[{"rating": 1.0, "review": "I bought my Apple tv in April of 2012 and wasn't exactly blown away by the capabilities of the device.  It plays any expensive movies you buy on Itunes.  You can play your iphone music on it.  It will also play netflix.  It's only in the past year or so that it does anything else and it still seems limited compared to the Roku 3.It worked fine for the most part during the past 2 years, but there were several times when it needed to be rebooted because it wouldn't show up in the list for Airplay on my other idevices.  About a month ago it simply lost connection to the wifi.  I rebooted and it reconnected - for about 10 minutes.  I did a reset and it reconnected for 10 minutes.  I then did a restore with the latest software and it reconnected for about an hour.  I then plugged it into the ethernet cable and it reconnected for 10 minutes.  The thing is basically a hocky puck now.I went out and bought a Roku 3 and this thing is amazing.  I can use Plex along with the other items that Apple tv allows (Netflix, Hulu, HBOgo).  Plex alone makes this thing worth it.  It also allows you to play your iphone music on the device, but it will not play any purchased movies from your iphone on the Roku - that is the only downside I have come across.  But who really does that anyway?  It also has a wifi connected remote that allows you to put the Roku completely out of sight.  And the Roku 3 is very fast - I have never noticed any lag moving through the interface.If you are on the fence about the 2 devices, do yourself a favor and get the Roku 3 - it is much more capable.", "verified": false, "helpfulness": "3/6", "author": "E in Texas"}, {"rating": 5.0, "review": "Very easy to use. The function of synchronizing with iphone and different computers is excellent. Accessing Netflix and other services without having to turn on the computer.", "verified": true, "helpfulness": "0/0", "author": "Gisele"}, {"rating": 4.0, "review": "You're unable to add new apps. Apple TV comes pre- installed and does not have a search browser. Can this be solved? Update: Apple TV does randomly add apps after some system updates. Hope they continue to add more variety and features associated with IPhone.", "verified": true, "helpfulness": "0/2", "author": "Michael Hunter"}, {"rating": 5.0, "review": "I purchased my AppleTV after my Google Chromecast got so hot that it bent and died on me in less than a month. What a difference! Netflix? Got it! HBO Go? You bet! Hulu Plus? Of course! Plus, you can access your iTunes library and even rent movies. You can play music, iTunes Radio and a slew of other things. It has loads of apps to use. And if you have other Apple devices such as an iPad, iPhone, iPod, you can broadcast You Tube and other websites and videos as well. You can also mirror your device and have your screen broadcast to show Facebook, pictures, you name it. Set up was a piece of cake. It took only a few minutes to set up and we were settled in watching The Walking Dead. It was completely worth it! I LOVE my AppleTV!", "verified": false, "helpfulness": "0/0", "author": "Sarah B."}, {"rating": 4.0, "review": "Netflix streaming sound is off a fair amount, other than that it is an excellent device, especially in combination with AirPlay on iPhones/iPads.", "verified": true, "helpfulness": "0/0", "author": "Matthew D. Brill"}, {"rating": 4.0, "review": "This was the easiest piece of equipment to set up... I plugged it in.. made a couple of adjustments, loaded my account info and I was on my way... There are a ton of channels, great streaming of Netflix and others.  Whats not to like?  Beats Cable!", "verified": true, "helpfulness": "0/0", "author": "OhDannyBoyO \"DannyBoy\""}, {"rating": 5.0, "review": "I download shows and movies from iTunes on my iPad....mostly to watch on long airplane rides which I take frequently....at home I like to watch those on my big screen tv and this Apple TV is a must in order to do so....I have no problem streaming amazon prime from my iPad over to my tv thru this device either ....what hardly ever works is watching a netflix movie or show on the tv! I would recommend highly!", "verified": true, "helpfulness": "0/0", "author": "Hi...it's me"}, {"rating": 4.0, "review": "Put in my master bed room  and have used it for TVs outside on patio and even in the garage without cable and can watch in HD.Downside, I have COX cable and at the moment they do not let you mirror live TV from my iPad to TV, but my buddy has Dish and said it works from the Dish app.  All in all great product and use a lot.", "verified": true, "helpfulness": "0/0", "author": "Grunion"}, {"rating": 4.0, "review": "Works as described. Not happy to find out Apple is not compatible with Xfinetygo which is really why I purchased it.So for that reason I can not give it 5 stars", "verified": true, "helpfulness": "0/2", "author": "Roger Wharram"}, {"rating": 5.0, "review": "Wow with Apple TV I can stream from my iPad anywhere in my gym. This is making teaching very interactive for the kids. Thanks Apple.", "verified": true, "helpfulness": "0/0", "author": "Huskerfan58"}]