[{"rating": 1.0, "review": "Just recieved this with high hopes and IT DOES NOT WORK!!!!!!!!!!!!!!!!!!!!!!!!!!! After an hour of trying to set it up the dumb thing tells me it needs an update? When im thinking why does a brand new item need an update? And then the thing shuts down and is stuck on a stupid apple logo with a picture of a usb cable that they didnt give me!!!!!!!!!!! Dont buy this save your time  cause you will be returning it", "verified": true, "helpfulness": "0/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This Apple TV was so easy to assemble that a child can do it. Provides many ways to watch TV, listen to music and much more.", "verified": true, "helpfulness": "0/0", "author": "first timer"}, {"rating": 5.0, "review": "there are so many things you can do with this device added to your TV. Best of all with Airplay your TV can become a mirrored computer screen and with the new Maverick coming out we will be able to add a 2nd computer screen to out TVS with airplay and drag and drop applications to clear the main computer screen ( mainly a app developer or game developer feature ).", "verified": true, "helpfulness": "0/0", "author": "CJ Brashear"}, {"rating": 5.0, "review": "I love my Apple TV!  I like how the Netflix and other apps are just on the Apple TV and you don't even have to use an iPhone or iPad for them.  Netflix also loads a lot faster on this than our Samsung Bluray players - it's very fast actually. And the recent update put HBO Go app on it, so now we don't have to use an iPhone or iPad for that either and it also loads very fast.  I love how small it is and the fact that it has a network port in case wifi isn't readily available (such as having to pay for it in a hotel room).  I bring it with me when I travel and hook it up to the hotel TV - great for catching up on my shows or entertaining the kids.  I only wish it had more onboard apps, but that may come with future updates.My 82-year-old grandma also has an iPad and Apple TV and uses both regularly and loves them.  The interface is very simple.", "verified": true, "helpfulness": "0/0", "author": "Vel Ham"}, {"rating": 3.0, "review": "Apple TV gives you options like a plethora of Internet radio stations to listen to, FLICKR, and sports subscription channels.The downside to Apple TV is the price, but despite that, I'm glad I spent nearly double what I paid for my Roku on this device. It's sleek interface runs smoothly (update it when you hook it up so you have the latest firmware) and quickly, and Netflix, HuluPlus and YouTube look great when played on the Apple TV.", "verified": false, "helpfulness": "0/0", "author": "Theresa Hawkins"}, {"rating": 5.0, "review": "These are a nice cheap solution to whole house audio! Every room we have a TV in we have an Apple TV. Its great to have our entire tv show and movie library in every room. When I clean the house listening to music, going from room to room I just hit a new airplay location! If I airplay from my Mac book pro I can airplay to more than one apple tv so then it really is whole house audio!!", "verified": true, "helpfulness": "0/0", "author": "Chris & Kristine"}, {"rating": 5.0, "review": "So, it isn't quite the Swiss army knife that a Roku media player is.  It's really locked into the iTunes eco-system.  But if you're already invested in it, especially if you're using an all-Mac, all-iOS setup, this is probably the most value-driven thing that Apple has ever put out there to make your devices even more cool.  I love that I can be commuting home, watching a video on my iPhone, then as soon as I walk in the door, throw the video over AirPlay to the Apple TV and keep watching on my television.  Seamless.  And I love being able to mirror my iPad on my TV.  And tied to my Mac's iTunes library, I can listen to whatever music I want over my TV's speakers, instead of using a separate speaker system for my laptop.  I also love that I never need to go to another clunky appliance to watch Netflix -- the Apple TV's interface for it may be the most elegant out there.  Yes, I wish it did a bit more -- like play files from non iTunes folders -- but it's still pretty great.", "verified": true, "helpfulness": "0/0", "author": "BrownyBrownie"}, {"rating": 1.0, "review": "Many times, while a video is playing on my iPadMini, it stopped displaying on the TV.  I had to restart everything to get it working. Sometimes, I have to shut everything down. It is useless to me.", "verified": true, "helpfulness": "0/4", "author": "H. Li"}, {"rating": 5.0, "review": "don't have to say much about this, if you have at least one apple product (ipod/iphone./ipad/mac) don't have to look any further.airplay option kills the competition.project any video, you want from you iOS device to your TV, projector (i use a projector).Play songs from your itunes on your home theater through this, all wireless.build in apps, many argue that apple Tv doesn't come loaded with many apps like the roku or some other, but they don't have airplay which is what i love the most in this. I have a mac too and can use this to mirror/extend my mac to any screen i want.I simply love this product.", "verified": true, "helpfulness": "0/1", "author": "ganesh"}, {"rating": 5.0, "review": "Lets you play Netflix, Hulu, and iTunes videos, along with YouTube videos, some sports, and even Flickr photos and iTunes music directly on your TV. With Airplay mirroring, you can also watch HBO Go streaming episodes. If only Showtime would get with the program. And for the price?? Can't be beat. I already want another one for my other TV.", "verified": true, "helpfulness": "0/1", "author": "TheDLG"}]