[{"rating": 3.0, "review": "It is awesome to have the ability to project the macbook and iphone to the TV.  However, the user interface of Apple TV is severely lacking.  As much technology as this device has, why didn't Apply build in safari for web browsing?  Also, it is packed with apps that we never use that only get in the way.  I have subscriptions to cable services, yet ESPN and a few other apps will not allow me to use the passcode to log in.  This user is less than impressed with this unit.  Not a terrible machine though, it does allow for streaming Netflix and HBO GO and projects the MacBook and iPhone to the TV.", "verified": true, "helpfulness": "0/0", "author": "Mr. Anderson"}, {"rating": 5.0, "review": "I love these Apple TV streamers. This was in well packaged and looked like new. It works just fine being that I have two of them. Thank you for a very good item.", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "Love Apple TV, clear HD picture and ease of use.  With Showtime Anytime, HBO GO and Netflix (subscription needed for these apps) who needs anything else. I have so many songs on iTunes it's great to be able to hear them over my surround sound. Though I always seem to misplace the remote, I always have my phone handy with the Apple TV remote app which works flawlessly.", "verified": true, "helpfulness": "1/1", "author": "Paul C"}, {"rating": 5.0, "review": "Love this little black box!!", "verified": true, "helpfulness": "0/0", "author": "Nisha"}, {"rating": 4.0, "review": "My new toy, good deal, great product...", "verified": true, "helpfulness": "0/0", "author": "Vernon \"Vernon\""}, {"rating": 4.0, "review": "very Good", "verified": true, "helpfulness": "0/0", "author": "Leslie T."}, {"rating": 5.0, "review": "Love this product, I have one for each tv in my house!", "verified": true, "helpfulness": "0/0", "author": "M G"}, {"rating": 5.0, "review": "Great buy! Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Arthur F. Bosco"}, {"rating": 3.0, "review": "It was ok until it died at about a year.  I suppose at the price, that's ok... maybe... I went a different direction.To be fair, I live in an area with LOTS of lightning.  Maybe it was hit.I find Apple's effort to minimize any type of inputs to be inconvenient.  Guessing how to interact with the hardware is simply not my cup of tea. I picture Steve Jobs looking down on me with a condescending smile as I try to deal with a remote control that has fewer buttons than my underwear...", "verified": true, "helpfulness": "0/0", "author": "D_Man"}, {"rating": 5.0, "review": "No more watching movies on Amazon Prime from my laptop. Lol! This is so awesome!!!! I love that I can wirelessly display the screen of my MacBook Air through my TV. Its great for music, too, considering I don't have a sound system to play music at our house.The set-up was easy. I set it up in maybe 20 mins (includes reading the user manual), and I do not consider myself a \"techy\" person. Apple is great at making user-friendly devices.The one thing that took the most time in the setting up process was being able to mirror my laptop onto my TV. Again, not very difficult, but I am new to this. Apple TV will guide you through all the initial set-up steps. Then on your computer in the tool bar at the top, you need to click on the display icon and then select Apple TV. So easy! :)", "verified": true, "helpfulness": "0/0", "author": "Angela"}]