[{"rating": 5.0, "review": "We love our Apple TV.  We got all caught up on old tv shows using our Netflix account.  There's alot of other things we could get into, but he haven't explored it yet.  I've been wanting to watch Netflix on my big screen TV for so long, and finally found a way to do that with the Apple TV.  I strongly recommend everyone buy one of these little gizmo's.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Barbieaholic\""}, {"rating": 5.0, "review": "I've wanted one for years. Finally got one and it changed my life. I told my girl the day we got it that it would change her life. Now she says she doesn't know how she lived without it.", "verified": true, "helpfulness": "1/2", "author": "Derrick.Treadwell"}, {"rating": 5.0, "review": "i would recommend this to anyone. great gift item. great for movie lovers, quick and easy to install and use", "verified": true, "helpfulness": "1/1", "author": "Elsa Alexis"}, {"rating": 5.0, "review": "This is the greatest product I have bought in awhile, great price. I love airplay. It is so easy to use.", "verified": true, "helpfulness": "1/1", "author": "Theresa L Johnson"}, {"rating": 4.0, "review": "I don't like the remote.  However, I was able to easily program my main t.v. remote to control this device.It was easy to setup, like most Apple products.  There are no buttons on it, but it has a number of good input/output options on the back.  I'm using HDMI straight to the t.v.Once you're logged into your Apple account, you can see a menu of Netflix, Hulu, and other things.  I like to keep one computer on the home and logged into my iTunes account.  The \"home sharing\" option has to be on, but then you can stream photos, music, etc... from your computer.There's a lot of features and much more that you can do with this, but I haven't messed around with all the features just yet. So far, I like it.One thing I want to try is traveling with this.  There are some blogs about how to set it up in a hotel, but it seems cumbersome.  I have a hot spot through Verizon and might set it up with that when I'm traveling.  It might work well in a conference to stream things to a projector.", "verified": true, "helpfulness": "0/0", "author": "pauldecarlo"}, {"rating": 5.0, "review": "I have another one of these and being abe to use my computers iTunes as well as my big screen is really cool and worth every penny.", "verified": true, "helpfulness": "0/0", "author": "oliver"}, {"rating": 5.0, "review": "This is the perfect replacement for DVD's, cable, everything. I have both NetFlix and Hulu Plus and with these two monthly subscriptions I was able to replace my cable.", "verified": true, "helpfulness": "0/0", "author": "Zebra Z-1"}, {"rating": 5.0, "review": "I've convert everything to apple now. Being able to network my iTunes music and movies and have them go right to my TV and surround sound. Using my iPad as a remote is awesome as well..", "verified": true, "helpfulness": "0/0", "author": "Brian J. Marino"}, {"rating": 4.0, "review": "Airplay works flawlessly. It even has the YouTube app (Roku doesn't !!). It would've been perfect if Airplay can play with Andriod devices too.", "verified": true, "helpfulness": "0/0", "author": "MotoApex"}, {"rating": 5.0, "review": "This was purchased as a Christmas gift for my geeky dad - the type who knows the specs of what he wants, so it's hard to get him anything tech related. He's loving it! He has it synced up with his iPad and iPhone, and loves that he can change the music we're listening to during dinner from the table. It's not a must have device, but if you know a gadget person who is already into the Apple tech, it's a great gift.", "verified": true, "helpfulness": "0/0", "author": "Idiosylph \"Idiosylph\""}]