[{"rating": 5.0, "review": "I don't think there is one negative thing to say about any Apple product. This Apple TV is the perfect example of that. I love this! Anything that is on my iTunes, I can now get on my tv, not just movies and shows, but music and pictures as well. This Apple TV was delivered to me in less than 24 hours!!! It was awesome. It also came with two Apple car decals! Make sure you have an HDMI plug because it is not provided with the Apple TV, so maybe one negative thing but not that big of a deal. I am extremely happy!", "verified": true, "helpfulness": "1/1", "author": "Mols"}, {"rating": 4.0, "review": "With this, I canceled my cable service. It cost me less than the monthly cable program fee and still have all the programs I wanted.", "verified": true, "helpfulness": "0/0", "author": "chanyou chow"}, {"rating": 4.0, "review": "The product is excellent.  Mirroring works perfect from iphone & ipad.  Even though I have an older mac (thus can't mirror from the computer), I can still link the computer to the apple tv to view movies or listen to music that is on the computer.  The netflix interface is very nice. The problem I had with the product is that when I first installed it, it crashed during the update. To resolve the crash you need to connect the apple tv to your computer.  The cable to connect it to the computer, however, is not supplied.  None of the apple cables I have would work. Luckily my brother had a cable which he uses to connect his android phone to his computer that worked.", "verified": true, "helpfulness": "0/0", "author": "Michael B."}, {"rating": 2.0, "review": "I found this product to be overrated.  Few services included.  Need to have iTunes running somewhere to really make it work.  Had trouble getting it to pick up my iTunes NAS library.  Returned it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is the second AppleTV I bought! As nice and small from the outside, it comes now with more apps: HBO GO, Netlfix, Hulu+, music videos and sports.I would love it Apple would include Spotify or Pandora, but I know that would be like shooting themselves I the foot. :P.If you have a large iTunes library, this is the way to go. Using iTunes Match you can play your songs anywhere. What I really love about videos is streaming those from the cloud (everything you had purchased in iTunes Store).Regarding apps like Netflix, is awesome, I can from any title look for actors and director and then look for more from the selected one. I haven't seen that on Roku.I really recommend it. Just take in consideration it might be more expensive than most of the streaming boxes in the market (considering the lower amount of channels). However, the streaming quality is awesome and practically you can take your movies and tv shows with you anywhere!", "verified": true, "helpfulness": "0/0", "author": "Walter"}, {"rating": 5.0, "review": "IF you have a Macbook, iPhone, iPad, or any other products this is a MUST HAVE, its no roku but it will give you more use from your products and well worth the purchase. I would recommend this to anyone that likes what apple makes, and it even comes with apple care for the first year for free with tech support to assist with any issues. BUT!!! i would recommend that you buy a High Speed HDMI cable as none others will work and cause issues. amazon sells some for much cheaper than anyone and they are just as good.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device is awesome. If you have apple products, it is a must have addition. All you need is a wireless connection.", "verified": true, "helpfulness": "1/1", "author": "Kyle J."}, {"rating": 5.0, "review": "My wife & I have enjoyed the Apple TV since we purchased it from Amazon in June 2013. After having it for a while I can say we have enjoyed it very much. It has great content, features, and I even did a Keynote presentation on it from my iPad using the AirPlay Mirroring feature. I cannot compare it to other competing devices, but it's hard to go wrong with this device. My only real complaint is that you cannot customize where the apps are on the screen...meaning I'd like to have the Netflix app closer to the settings app. Not a real problem, but would be nice. I recommend this product.", "verified": true, "helpfulness": "1/1", "author": "elcaballo"}, {"rating": 5.0, "review": "the best item with mac computer and iPhone.it works well and the Wifi system is so simple to use.", "verified": true, "helpfulness": "1/1", "author": "Steve Young"}, {"rating": 4.0, "review": "PROs:* Easy integration with a house-full of Apple products* Simple, pleasing menus* I like the ability to watch movie previews, in which hope springs (albeit fleetingly) that a given flick won't suckCONs:* I would have liked to have had greater connectivity with the internet at large, like Google Chromecast", "verified": true, "helpfulness": "0/0", "author": "J. Kahn \"NumberOneSon\""}]