[{"rating": 5.0, "review": "What can I say but this product met 100% of my requirements... the main requirement was to access Netflix.. and the quality is just awesome...", "verified": true, "helpfulness": "0/0", "author": "Peter Mucci \"PeteMucci\""}, {"rating": 5.0, "review": "What can I say if you own an Apple product then you must get one of these. Best thing out there for seeing your pictures on TV.", "verified": true, "helpfulness": "0/0", "author": "Flubber"}, {"rating": 5.0, "review": "This is are second Apple TV for another room.  It is great, love the new HBO to GO.  It would be nice if Apple added the NFL Sunday Ticket", "verified": true, "helpfulness": "0/0", "author": "Richard E. Crance \"Rich in Phx\""}, {"rating": 5.0, "review": "I put the Apple TV in the motorhome to connect all of my devices to the TV making road trips just like home.", "verified": true, "helpfulness": "0/0", "author": "John Simonson"}, {"rating": 5.0, "review": "This is such a simple solution. Instead of plugging a laptop into the wall, and then plugging the laptop into the TV –– you can just stream everything in a very energy efficient and space efficient package with a great interface. Yes, you need to pay for everything (Netflix subscription, HBO subscription, pay for iTunes movies and TV) but it works very well. In addition, with iPads, iPhones, and newer Mac, you can put whatever is on your display onto your TV, wirelessly. It's a great device!", "verified": true, "helpfulness": "0/0", "author": "Andrew J. Haglund \"Andrew\""}, {"rating": 5.0, "review": "No problems at this time...  Is doing the job that they said it would do...  Would recommend to a friend or business...", "verified": true, "helpfulness": "0/0", "author": "Robin Haggerty"}, {"rating": 5.0, "review": "Well not really, but this my second Apple TV. This product is easy to use and it matches my decor.", "verified": false, "helpfulness": "0/0", "author": "Gino Alberti Flores \"seri\""}, {"rating": 5.0, "review": "Plug in this simple little device and it will not only transform your television into a streaming video device, but may change the way you watch TV!Apple has changed the way we acquire and listen to music, and with the help of Netflix, iTunes, and Youtube, your viewing possibilities are endless!ProsStupid simple setup.Small form factor.Ethernet/Wifi connectivity.HDMI/Optical audio out.Low power consumption.A remote your parents will appreciate.Built-in Movie rental/store.Easily associate your iTunes Match account and listen to your music library.New features and functionality through firmware updates.Price.ConsLimited to iTunes and Netflix (for now).ReviewWith competing Roku, Sony, WD, and others breathing down their neck, Apple's Apple TV stands tall against the competition. With a rock solid interface, intuitive interface, and access to your purchased iTunes movies and music; if you are okay investing in the Apple ecosystem, this is a winner!Setup of the Apple TV is a snap. Plug in the unit, and simply enter your iTunes credentials to unlock all of your purchases and transforms your television into a modern streaming device.The remote has four (4) buttons! The simplicity of your interaction with the Apple TV compliments the simplicity of the interface. The interface may lack the bells and wistles that other systems may include, but ultimately promotes searching for and enjoying content.With rentals hovering in the $3 - $7 range, and HD or Standard movies starting around $10, some may be able to ditch their expensive cable service. Very happy with my Apple TVs! Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "J. Delacy"}, {"rating": 5.0, "review": "My son wanted this Apple TV for his birthday.  He tells me it works as advertised and really likes it.  Easy to install as well.  So, I just might get one!", "verified": true, "helpfulness": "0/0", "author": "shopinful"}, {"rating": 5.0, "review": "is great, im recommend for everyone...the best i had ever...and coming fast, i really happy...is awesome thing ..i love it..", "verified": true, "helpfulness": "0/0", "author": "Matheus Machado"}]