[{"rating": 5.0, "review": "Wave of the future. Someday this will replace current Cable/satellite services. Mirroring option allows you to project anything on your iPad or iPhone to large screen. Great for video chats with long distance family members where you can see them on big screen.", "verified": true, "helpfulness": "0/0", "author": "mukremincitir"}, {"rating": 5.0, "review": "Apple is always a good choice", "verified": true, "helpfulness": "0/0", "author": "Deb"}, {"rating": 5.0, "review": "Excellent, Apple it's the best", "verified": true, "helpfulness": "0/0", "author": "Mario A PC"}, {"rating": 4.0, "review": "I like the product and covers my expectations", "verified": true, "helpfulness": "0/0", "author": "Enrique"}, {"rating": 5.0, "review": "I simply love it.  It works very well and looks great.  If you want to hide it, you can because it's so small.  But the inflexible HDMI cable can be a pain and you will not be able to use the provided controller and will have to use your iPhone/iPad/iPod.  I particularly like the ability to mirror my iPhone on the TV and share my screen.  I might buy more for the other TV's.", "verified": true, "helpfulness": "0/0", "author": "Ahmad Al Alaiwat"}, {"rating": 5.0, "review": "I toyed with the idea of buying this now or waiting until Apple gets on the bandwagon & update this thing.  Guess I opted to buy now & haven't been disappointed.  I have Dish & setting up all the channels - HBO, Showtime, Netflix, etc. was a bit tedious but it all worked out.  I was a little disappointed it doesn't have Amazon, but I guess that's not likely to happen!", "verified": true, "helpfulness": "0/0", "author": "MJ"}, {"rating": 5.0, "review": "Perfect steaming srvice! I wish rhapsody was on it but still great!", "verified": true, "helpfulness": "0/0", "author": "Juliet Wong"}, {"rating": 5.0, "review": "This is perfect for carrying 3 cards. I carry my license, credit card, and ATM. I rarely carry my wallet in my pocket anymore. I have no fears of the cards falling out with regular usage, but if I went back down to 2 cards, it would be a concern. It is a little pricey, but worth it in my opinion.", "verified": true, "helpfulness": "0/2", "author": "Ron Womble"}, {"rating": 1.0, "review": "Not compatible with my late 2009 27\" imac, something I had to dig to find out after purchasing. Ok, fine, I'll use my 2014 macbook air with appleTV, that should work right? 66 mbps down, ASUS RT66U router, air updated to most recent Yosemite iteration, and appleTV skips and chops 90 percent of the time rendering streaming unwatchable. I have to run a VOIP phone off my router in another room, so I cannot plug appleTV directly into the router via ethernet. For a while I was able to restart my computer and get the skipping to stop, but after a while that gets really, really old.  I've witnessed it work for others, but after plenty of troubleshooting I gave up. AppleTV is not always, but can be worthless for streaming. Apple needs to spend less time and money removing ports and functionality from their products, and more time in R&D; bug-testing and making quality products that work.Sent it back to amazon and went back to my tried and true method of using my dedicated beater laptop hooked up to my Smart TV via HDMI for streaming. Definitely less headache that way.", "verified": true, "helpfulness": "0/1", "author": "jordan"}, {"rating": 4.0, "review": "Enjoy this very much.", "verified": true, "helpfulness": "0/0", "author": "April Lewis"}]