[{"rating": 5.0, "review": "Love this! Super easy to install but be sure you have an HDMI cable", "verified": true, "helpfulness": "0/0", "author": "Judi Houff"}, {"rating": 5.0, "review": "This is my second Apple tv. I love it. It is everything I was looking for!", "verified": true, "helpfulness": "0/0", "author": "Teoscherie"}, {"rating": 5.0, "review": "So awesome! I can rent and buy movies from apple, or watch Netflix, from anywhere! I can take the box with me on vacation and have all my favorite shows with me.", "verified": true, "helpfulness": "0/0", "author": "Brittany"}, {"rating": 5.0, "review": "Works perfectly, and it's a great deal! Good alternative to cable", "verified": true, "helpfulness": "0/0", "author": "Sarahy Silva"}, {"rating": 4.0, "review": "Works Ok - Thanks", "verified": true, "helpfulness": "0/0", "author": "David Repass"}, {"rating": 5.0, "review": "My son enjoyed the Apple Tv it was his Christmas present.", "verified": true, "helpfulness": "0/1", "author": "roslyn berkeley"}, {"rating": 5.0, "review": "works as advertized.", "verified": true, "helpfulness": "0/1", "author": "Nathan Tran \"Small man\""}, {"rating": 4.0, "review": "I'm a self-admitted Apple addict, and am shocked that this product isn't receiving 5 stars from me.The product works very well, however Apple's updates seem to be very few and far between. Other video products (Roku, etc) are more user-friendly, in my opinion, because they permit you to pick and choose your 'channels', while Apple just gives you whatever they deem important.I would, however, suggest the Apple TV if your household runs on Apple products; the synergy between iTunes, iPhone, iPad and Mac computers is wonderful and makes sharing music, videos and pictures incredibly simple.", "verified": true, "helpfulness": "0/0", "author": "KG"}, {"rating": 5.0, "review": "Very cool! Love my ATV gen3", "verified": true, "helpfulness": "0/0", "author": "Thomas B."}, {"rating": 1.0, "review": "If you're primary reason for getting this is to take advantage of the AirPlay feature that allows your iPhone to wirelessly stream content to your TV, without need of your WiFi and any download cost to your network data plan, don't let the advertising or hype about this feature fool you.It turns out you actually DO have to let the Apple TV unit use your WiFi or home network.  No, your iPhone isn't using up your data plan as it downloads what you're viewing.  Instead, the Apple TV unit is using up your data plan just as if you were directly downloading to any device without the Apple TV present.So you gain nothing, while putting up with a fairly sloppy and unreliable user interface (AirPlay stalls and drops out quite often, even with the iPhone, Apple TV, and WiFi unit within four feet of each other).Yes, there's content you can directly view with the Apple TV without need of another device (aside from your network connection) but it is all pay-per-view.  But if you already have the network connection, there's lots of ways to get pay-per-view content, and services like Netflix, WITHOUT the Apple TV unit.It is, however, the most elegant paperweight you could own.", "verified": true, "helpfulness": "1/2", "author": "Steven Plambeck"}]