[{"rating": 4.0, "review": "I love this! I will be dropping cable very soon! Easy to use with so many options!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Deangela S. Chastain"}, {"rating": 3.0, "review": "When it works it is great.  The problem us there are many programs/channels which block the signal from being mirrored from the iPad to the TV.  I bought the unit to watch PAC12 football games broadcast by Xfinity....sadly it will not work.  Nor does it work with Amazon prime movies and videos.  Apple missed the mark on this one and for the price should point out its limitations.", "verified": true, "helpfulness": "1/1", "author": "W. R. Goldsborough"}, {"rating": 4.0, "review": "its a apple TV if we can only jailbreak it now", "verified": true, "helpfulness": "0/0", "author": "the5280"}, {"rating": 5.0, "review": "couldn't live without it!! I do have to say that you do have to reset it at times.  It will freeze or you won't be able to see the movies or shows on Netflix.  I am not sure if that is an Apple Problem or what.  But it works fine once you do.", "verified": true, "helpfulness": "1/1", "author": "TDDR"}, {"rating": 4.0, "review": "Not sorry I've made the purchase but I was expecting to cut the cord and didn't expect to be tied to a cable company in order to utilize Apple TV. Disappointed in that regard.", "verified": true, "helpfulness": "1/1", "author": "No#1 Shopper"}, {"rating": 4.0, "review": "Overall, a nice unit.Pros:- Good content, and I especially like being able to access live business news such as Bloomberg- Good interface, I like it better than the Roku- Very easy to set up, integrates nicely with apple devices such as the iPhone and iPad. You can stream home videos, photos, music, etc. from the iPad/iPhone to your TV.Cons:- Lots of content is pay walled. Got excited that this had Disney Junior for my kids, but couldn't access since I don't have Disney Jr via a cable company (shame on Disney for being so greedy these days!)- Can't access Amazon Prime directly, but you can stream to TV via Airplay from your iPad or whatever if you have the Amazon Prime app.- The remote is really small, worried my cat will swallow it.Purchased at Sams so won't show as a verified purchase, but I did actually buy one.", "verified": false, "helpfulness": "2/2", "author": "tagger9 \"tagger9\""}, {"rating": 5.0, "review": "What a great device! I bought it for the sole reason of watching college football not found on my cable. It will render ESPN 3 in HD on my 70\" TV screen. Then I found other things I like about it so those were just a bonus for me. I'd buy one again in a heartbeat. I found it useful to buy a wireless keyboard to go along with the remote - input is slow just using the remote.", "verified": true, "helpfulness": "1/1", "author": "Bill in Vero \"BillC\""}, {"rating": 3.0, "review": "Love it when I don't get the \"no Signal\" message.  I have to disconnect and replug every time I want to access Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Lucille Grant"}, {"rating": 5.0, "review": "The product came perfect and in time.", "verified": true, "helpfulness": "0/2", "author": "Borges"}]