[{"rating": 4.0, "review": "Apple TV, like most Apple products is well designed and very easy to use. My 4-yr-old loves using the remote and selecting his own Netflix shows. It does everything Apple says it can without a hitch. No complaints here.", "verified": true, "helpfulness": "0/2", "author": "db"}, {"rating": 4.0, "review": "So I held off on buying last year's model of the Apple TV because I figured that I didn't need one. I had a Roku XD and I thought that the experience that Roku's unit provided was as good as it was going to get... Well, I was wrong!Roku's unit proved to be a horribly inconsistent performer when it came to HD content. Constant rebuffering and degradation of the (supposedly) high-definition content would have had me pulling my hair out, if I had any. For all of it's significant pros (a USB port, numerous channels, more functionality than the Apple TV) my little Roku box couldn't really deliver where it counted: Netflix HD streaming. Now, before you scoff at my review, understand that I am running a highly optimized wireless network with several devices, including my Roku XD running on the 5Ghz spectrum. In fact, I went to great lengths to upgrade my network in terms of signal strength and pure bandwidth.Since I have an existing Apple ecosystem I finally gave in and decided to give the newest iteration of the Apple TV a chance. My first impressions are very favorable. I love the wireless display capabilities of the device. I also like the ease of using my iTunes account to access and consume content via the iTunes store and iCloud. Most importantly I absolutely love the way that the unit performs when it comes to high definition streaming via Netflix. Just finished watching \"Ironclad\" in HD with nary a hiccup, stutter or rebuffer...I may just end up using and enjoying my Netflix subscription this time around if the Apple TV keeps performing like it did tonight!If you have an existing Apple rig in your house and an iPad or iPhone, then this is a no-brained and a must have device.", "verified": false, "helpfulness": "1/2", "author": "Patrick F."}, {"rating": 5.0, "review": "Typical Apple product, very simple to set up and works  without bring in a team of engineers. This is my second Apple TV and I highly recommend it.", "verified": true, "helpfulness": "0/1", "author": "Bruce E. Robison \"webcrew\""}, {"rating": 5.0, "review": "This small but powerful little device  has exceeded my expectations.  If you have an iPad or iPhone you can see all of your videos or pictures on your TV... Some great third party apps as well... Well worth the $99.  Did I mention it now comes in HD for a great looking picture.", "verified": true, "helpfulness": "0/1", "author": "Frank R. Laurie"}, {"rating": 5.0, "review": "'iPad3,  ''Appletv3'''''! Very good ! Air play is wonderful on Youtube and PPS.note:Mirror display quality is not so high. Just accepted .", "verified": true, "helpfulness": "0/2", "author": "ahtat"}, {"rating": 3.0, "review": "As a streaming media player you have to let your computer on to play content, no USB HDD support, it's just interesting for iOS devices that support Airplay. Without jailbreak, i wouldn't recommend it! Do Yourself a favour and buy a WD Live Streaming Media Player for the money!", "verified": true, "helpfulness": "1/3", "author": "Norbert Calina \"CN\""}, {"rating": 5.0, "review": "Updated review:After Amazon reviewer sandvfan pointed out that the \"channels\" that I said Apple TV lacked were actually hidden under Podcast, I went to an Apple Store to check out this feature. And indeed, there is a huge treasure chest of video and audio Podcasts - much more comprehensive that what Roku has, and the menu system and search feature are excellent.Yesterday, I returned the Roku 2 XS that I bought at Costco, and bought myself an Apple TV. I can overlook Apple TV's lack of Amazon Instant Video because my Blu-ray player has that feature.Old review:I tried both the latest Apple TV (third generation) and Roku 2 XS before deciding on the Roku.In short, the only advantage of Apple TV is its tight integration with iTunes. I also like its remote controller better.But if you are into high quality, free channels, the Apple TV pales by comparison. Even the least costly Roku LT ($50) supports 400+ channels. The channels that I use most are Amazon Instant Video (Amazon Prime members can watch free movies), Crackle (free movies), Cnet, Revision3, Tested, TED, and a number of news channels.Apple TV does NOT support Amazon Instant Video. It is a closed system, compared to Roku's vendor-neutral design. Even though I have many Apple products, I had to choose the more versatile Roku over the rather limited Apple.You can try out Apple TV at a Apple Store, and you can buy a Roku 2 XS at Costco which you can return within 90 days if you are not satisfied. The Roku at Costco is a special bundle: Roku 2 XS, HDMI cable, and 2 months of Hulu+ free - all for $90. The only thing I don't like about the Roku is its paltry 90-day warranty. Reviews on the Amazon site do not seem to indicate unreliable hardware, so I am not too concerned about this aspect. You can use the Chase Amazon credit card to buy this and get a doubling of the warranty to 180 days.", "verified": false, "helpfulness": "2/2", "author": "Consumer Advocate"}, {"rating": 2.0, "review": "When straeming, it drops the connection on a regular basis. Not very useful when you are trying to watch something and it drops out every 30 minutes.", "verified": false, "helpfulness": "4/8", "author": "D. Lee"}, {"rating": 5.0, "review": "I got this apple tv just so I could see my iphone 4s on my 55\" LED and play games but most game are not really playable because you need to look at the iphone's screen but some other games have airplay enabled, I just wish I could easily find a section on the appstore on my phone that showed airplay enabled only apps.Besides the lack of apps the item itself does the job more than perfectly fine with little setup and the thing is very little and has a sophisticated look which I will assume will mean little after the mount for the back of my tv which will hide it.", "verified": true, "helpfulness": "0/0", "author": "Arthur Feitosa"}, {"rating": 4.0, "review": "Using the Apple TV is easier than connecting my iPod to my receiver, and the Apple TV was cheaper than buying an iPod dock for my receiver. Now I can use the TV screen to change music instead of the little iPod screen. Plus the Apple TV will apparently work with any brand of receiver. I had been streaming Netflix with Roku HD, but the Apple TV gives me more access to my account, so the Roku has been relegated to the less-used bedroom TV. I have my iTunes music on an external drive connected to my router, and I can listen to it without turning on my PC.The Apple TV and my Yamaha receiver's remote cannot be programmed to operate each other. So I have yet another remote. And Apple TV does not stream Pandora, but my receiver does.", "verified": false, "helpfulness": "1/1", "author": "trlamb"}]