[{"rating": 5.0, "review": "I love it even more than my Samsung Smart TV program. The visual is much better than that of the Smart Samsung.", "verified": true, "helpfulness": "0/1", "author": "Virginia Gerbino"}, {"rating": 5.0, "review": "No longer need a Blu Ray Player and it is compatible with Netflix. Fun to use with the remote control app on the iPad.", "verified": false, "helpfulness": "0/1", "author": "GForce"}, {"rating": 2.0, "review": "I constantly have to restart itunes on my PC for ATV to connect to it, app selection is not there even with air play.", "verified": true, "helpfulness": "1/4", "author": "Louis Rodriguez"}, {"rating": 5.0, "review": "This is an amazing and easy to use device!  Our primary use will be for viewing our pictures and videos with our family!  Great and easy way to relive those family memories!", "verified": true, "helpfulness": "0/0", "author": "Suzi"}, {"rating": 4.0, "review": "I purchased this device for my sister for Christmas because she has an iPod Touch, and I appreciate the app that she was able to download and use to push whatever she watches on her iPod Touch onto her TV through the Apple TV, but the lack of apps on Apple TV makes it hard for me to enjoy it more than I enjoy my Roku 2 XS. Still, the video quality is great, and my sister loves it, so it was worth purchasing!", "verified": true, "helpfulness": "0/0", "author": "Adrienne"}, {"rating": 5.0, "review": "For anyone who relies on closed captioning to enjoy video, this little purchase is a major breakthrough.  Streaming Netflix was previously of no value to me, except on my little iPad screen.  Now the great world of Netflix content is available to me with captions on my television.  I don't care about anything else that Apple TV can do ( mirroring is cool).  For me, it's all about the closed captions.", "verified": true, "helpfulness": "2/3", "author": "Shirley Willard"}, {"rating": 5.0, "review": "I have been going back and forth for a while now on whether or not to purchase the Apple TV. Now that I just received it I love it! The Picture is great, the portability is perfect. Easy to set up and now I can FINALLY watch my Itunes Movies on my TV. I do not really enjoy watching movies on my laptop or PC. I have 2 negatives about it.1. Not that many apps. Would like to see more added.2. More descriptions for what I get with each App. Example: MLBTV. It gives me 2 options to buy from but I am not sure what I get with each.Otherwise its a great buy and cheaper from Amazon than via Apple.", "verified": true, "helpfulness": "3/4", "author": "Dore33"}, {"rating": 5.0, "review": "We are an Apple family:  two iPads, four iPhones, three Mac book pros, one Mac book Air & one time machine. It all works together seamlessly.  We are going to buy one for the Google TV that is great in its on right, but lacks 'AirPlay' which we love.", "verified": true, "helpfulness": "0/0", "author": "Claudia Glaser"}, {"rating": 2.0, "review": "The good: It's an easy to install little box that connects to the local WiFi network easily. It's pretty quick to go from in the box to up and running. The controller is sleek and stylish, and it's pretty intuitive to use.The bad: Do you use Amazon Prime to watch videos? Too bad. This thing won't do that. In fact, if you use anything other than iTunes, Netflix, or Hulu+, you're out of luck. Like Spotify? Too bad. Pandora only. It's very limited, and there's really not much chance of getting anything else any time soon here. It might be a better idea to look at a Roku. $50 less and you can do more. Even if its controller doesn't have Apple's classic, minimalist, styling, it's a more useful box.", "verified": false, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Exellent product, great value. i would recommend this product. Easy to use and install. A big asset to HD TV.", "verified": true, "helpfulness": "0/0", "author": "Carol Snyder"}]