[{"rating": 5.0, "review": "This is just awesome! We have Roku and this is the perfect addition for more TV options. This also offers a lot of other options besides just watching movies. You can turn your TV into a huge digital photo slide show, or listen to yout iTunes library. A perfect addition to any entertainment center.", "verified": true, "helpfulness": "2/2", "author": "Larry \"Larry\""}, {"rating": 5.0, "review": "I have had it over a year. The last 6 months have had some awesome upgrades done in it. They only add stuff to it that is relavent. HBO Go, Hulu, Netflix, and if you have an iOS device it is awesome.", "verified": false, "helpfulness": "0/0", "author": "Mike"}, {"rating": 2.0, "review": "Great software.  the interface is the cleanest on the market.  But overall I use my roku 3 all the time, which has the apps i use, Amazon prime, plex, and the blaze tv.", "verified": true, "helpfulness": "1/5", "author": "Keith D Ryon"}, {"rating": 2.0, "review": "Thank you apple for throwing in the needed HDMI cord.... not.Hope those extra dollars keep you constantly brainstorming about how to reduce convenience for more money.", "verified": true, "helpfulness": "2/15", "author": "Cricketty Mill"}, {"rating": 5.0, "review": "I had an apple tv now for a year and three months and couldn't be happier. This product has only gotten better over time because Apple keeps adding more apps and improvements to the device. I believe that Apple will only continue to add better apps and more content because of its rumored interest into the tv market. I love being able to access all of my itunes music and playing it on the surround sound, the free itunes radio is decent too. The only thing I wish it wasn't missing was an NFL app. I also hope that once more apps are created for the device that the user will be aloud to move and delete apps like on the ipad.", "verified": true, "helpfulness": "1/1", "author": "jim"}, {"rating": 4.0, "review": "It is a nice product, but my friend has the roku and that is good too.  I think that this product is nice but it does have trouble recognizing my pc at times.", "verified": true, "helpfulness": "0/0", "author": "sdubb"}, {"rating": 2.0, "review": "Too many bugs, does not work seamlessly like other apple products; I have an apple I everything and this is my only disappointment", "verified": false, "helpfulness": "1/7", "author": "Jeffrey M. Sherlock \"mookster\""}, {"rating": 5.0, "review": "Love it. I cut the cable cord, and this thing has saved me hundreds of dollars so far, and as the months and years go on, it will be thousands of dollars saved.  With the internet and Airplay, and the apps it has (and is constantly adding) I'll never need cable again and their absurd prices.", "verified": true, "helpfulness": "5/5", "author": "J. Neuman"}, {"rating": 5.0, "review": "Great TV accessory for $95... My two favorite features: 1. With OSX 10.9 (Maverick) you can set up your big screen as a wireless second display. 2. If you subscribe to HBO through your cable/satellite provider, you can access a huge library of HBO movies and series through the Apple TV.", "verified": true, "helpfulness": "2/2", "author": "Paul From Boulder \"pfb\""}, {"rating": 3.0, "review": "This device contains quite a few programs. Some of which require a subscription. Thus far we only use it for Netflix. It does allow us to stream and the picture quality is good. However, it is awkward to search. It is awkward to rewind or fast-forward.The remote does not have an on/off switch and there is not a notation in the manual that shares how to turn it on and off. I assume when you turn the T.V. off, Apple T.V. turns off. To turn it on one must press menu on the remote.", "verified": true, "helpfulness": "1/1", "author": "Richard A. Ruppert"}]