[{"rating": 4.0, "review": "I am an apple fan boy. I have mainly macs at home so I thought this is the obvious choice of media player to go with.Problem #1, for some reason it starts playing music at will consuming bandwidth.Problem #2, I had to type in my apple ID in 5 different places, I would like to just manage it from a mac on the network like I can do with my Roku.Problem #3 airplay doesn't work seamlessly with older macs.Problem #4 the sound some times plays on the mac and sometimes on the TV, I have yet to understand whyFor all fairness, I have also a chromecast and a 2 Rokus. From those three, I have to say that now that the Roku supports youtube, I think it is probably the best value for this cost.So what is good about it:1) The quality of streaming is probably the best of the three2) Airplay when it works is great for showing pictures, playing music and viewing content of your other apple devices.3) Ethernet and optical connections are very important for stream high quality to make best use of HD TVs", "verified": true, "helpfulness": "0/0", "author": "Yedidya"}, {"rating": 5.0, "review": "Great product! This little box has saved me a ton since I was able to discontinue my cable service. Easy to use. Lots of features.", "verified": true, "helpfulness": "1/1", "author": "Kathy Hall"}, {"rating": 5.0, "review": "I got the Apple TV for my best friend and she loves it. Very simple to work, simple setup. I got it for her dorm so the airplay doesn't work but she uses it for Netflix all the time which works great and YouTube and it has tons of features.", "verified": true, "helpfulness": "1/1", "author": "Lexie Kentros"}, {"rating": 5.0, "review": "Good price.  Mirrors my Mac laptop easily. Got my mom hooked on Netflix.  What else could you want?  THe built-in Menu doesn't offer Amazon streaming, but the easy mirroring compensates for that.", "verified": true, "helpfulness": "2/2", "author": "Sylvia"}, {"rating": 5.0, "review": "The Apple message boards are rife with glitch complaints, and they do happen.  Sometimes it won't connect to the internet and I have to use Airplay from my iPad.  Sometimes it drops the connection during a show, but I found that moving the box slightly, to the edge of the shelf where the wood isn't blocking it, solved that.  In any event, I love taking it when I travel!!  Love it so much I have two.", "verified": true, "helpfulness": "0/1", "author": "Debra McBride \"Online Power Shopper\""}, {"rating": 5.0, "review": "Purchased this product. Brand new. Excellent. Amazing packaging. I would highly recommend this to a friend. Easy to setup and use. High quality HD video quality. Processor speed is ultimate.", "verified": true, "helpfulness": "1/1", "author": "Chaitanya Deshpande"}, {"rating": 5.0, "review": "This is my second Apple TV.  This one is going in the living room.  I went with this because it will work effortlessly with itunes on my iphone, ipad, Macbook.", "verified": true, "helpfulness": "1/1", "author": "DCarnahan"}, {"rating": 5.0, "review": "This is a great product for combining my iPad and big screen TV. My high school senior grandson introduced me to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Betty A. Iams \"Betsyanne\""}, {"rating": 1.0, "review": "Doesn't work often enough to be worthwhile. Picture is often grainy, and that is on the rare occasion when it actually works and doesn't produce an error message or just turn airplay off by itself and go back to the regular laptop monitoring.So basically apple tv sucks.Maybe others have had better experiences, I think it sucks.", "verified": false, "helpfulness": "0/10", "author": "Marvin Nash \"Kris\""}, {"rating": 5.0, "review": "Easy to use. Great product for any room in the house.  Multiple apps to stream video. AirPlay is fantastic to watch my iTunes U videos for class.", "verified": true, "helpfulness": "0/0", "author": "Joshua Vengley"}]