[{"rating": 5.0, "review": "I used TiVo until I added \"Boost\" to my wireless and couldn't get TiVo box to work anymore. I switched to this and LOVE IT.I don't have that monthly fee for Tivo. I can watch almost everything I now get on Cable on either Hulu Plus or Netflix. It was super-easy to just plug it in (don't forget to buy the cable that connects from the Apple box to your TV cause it doesn't come with the Apple TV box). A child could set this up, its that easy.Crystal clear TV also, oddly sharper than when I watch cable on my HD TV's. I don't know why that is.I'm going to use this for a week and figure out which cable stations I no longer want, then save some $$ on my cable bill.Buy it, you won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Anne Cohen \"Dramatic Soprano\""}, {"rating": 3.0, "review": "I purchased the Apple TV 3 days before the announcement that Apple had planned on silently releasing a new version of the Apple TV 3, currently being called 3,2 (designated model 1469). This information was discovered when Apple filed with the FCC regarding a newer device. The (4mm) smaller Apple TV will have the A5X chip and new low-power dual-band 40nm Broadcom BCM4334 chip that is present in new iDevices like the iPhone 5. This is not a major upgrade, and the average user will not notice a difference. However, I would rather wait a few more weeks and purchase the newest device available.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A gift for my daughter in law. She really loves it and uses it all the time. Can stream videos and movies, etc.would definitely buy one for myself", "verified": true, "helpfulness": "0/0", "author": "Barbara J. Jorgenson \"barbie\""}, {"rating": 4.0, "review": "Meets expectations, not as user friendly as Xbox live but still pretty easy. Can't watch the web-only shows on Hulu. iTunes must be up on a computer to use home share. But a good, inexpensive addition to our home theatre.", "verified": true, "helpfulness": "0/0", "author": "Jaime Smoot"}, {"rating": 5.0, "review": "it's easy product i love it .. i am happy for have itthanks from saudi arabia .best wishes .", "verified": true, "helpfulness": "0/0", "author": "rakan gh"}, {"rating": 5.0, "review": "I am glad there's no iOS on this device as known. It is quite easy to use and manage, and I really appreciate real 1080 resolution and the optical audio outputs. That's simply a great gadget.", "verified": true, "helpfulness": "0/1", "author": "Grand Scualo \"GScualo\""}, {"rating": 5.0, "review": "Absolutely LOVE Apple TV, This is the second one I have purchased.  It has great reception in my bedroom & now my living room........LOVE< LOVE< LOVE....You can stream videos from ITunes, Netflix, Hulu etc....", "verified": true, "helpfulness": "0/0", "author": "Daisy"}, {"rating": 4.0, "review": "Apple would be genius if they used a bluetooth remote for this. The device itself is great and i stream movies in HD from my desktop to it and my music with no issue. Navigating the menus is a little annoying and the remote is a line-of-sight remote which can be annoying. BUT it integrates well with using a iPhone as your remote very well. Easy to set up with homesharing.", "verified": true, "helpfulness": "0/0", "author": "Josh Raymond"}, {"rating": 3.0, "review": "This device is OK for streaming from your IPAD, but not used very often.  I would buy a nice blu ray player instead., the new ones have streaming", "verified": true, "helpfulness": "0/0", "author": "Jerry A. Christensen \"chiropractor\""}, {"rating": 3.0, "review": "I love my Apple TV. Another great success in the apple line up. Simple set up sole remote sole use. The only real con I have is apple limits the apps you can load. Come on I can't play any amazon instant videos on this?  Apple and google need to learn to play together. Or I'll just by an smart tv and get what I need from there. Apple doesn't need to run the world. Make sure your products work with others.  Think about it if apple didn't make iTunes available for the PC where would they be.", "verified": false, "helpfulness": "0/0", "author": "Matthew Daley"}]