[{"rating": 5.0, "review": "We saw this in one of our friends homes and loved the setup.  We live in Eruope, and once you overcome certain IP address issues this thing is wonderful.  Its great to be able to watch some updated American TV shows and not have to fork out a ton of money for satelite fees.", "verified": true, "helpfulness": "0/0", "author": "Gerald L. Hill \"JERRY2KONE\""}, {"rating": 1.0, "review": "I've had the roku 2 xs for about one year and have been very happy with it. I purchased Apple TV not as a replacement but to work along side my roku. I wanted to access itunes content and youtube. Sadly I could not log into youtube or my itunes accounts AT ALL. I checked online and others are having this problem. The way to fix it is to buy a new router - I will not because my $200 router is ony 4 months old. Its not my router it ATV, my router works fine with everything else. The two reason I bought it I could not get, very disappointing.ATV is also extremely SLOW taking nearly a full minuet for netflix and hulu to load. The roku interface might be simple looking in comparison to ATV but its much faster. Lastly the Apple TV remote is so freakin tiny - like it was made for tiny people in some tiny alternate universe. If you sat on the remote without any clothes on it might slip up your butt unnoticed (well maybe not:). I really wanted to like the ATV but it was useless for me and I sent it back.", "verified": false, "helpfulness": "2/8", "author": "C. Davis"}, {"rating": 5.0, "review": "I loved the ease of use of this product. It combined all of my streaming services into one easy location this product I recommend to all movie buffs. My only call out would be the fact that you can't stream vudu movies", "verified": false, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Makes all my apple products sync up to my tv flawlessly. No more running vga cables from your laptop to share your screen", "verified": true, "helpfulness": "0/0", "author": "Mike1ch"}, {"rating": 5.0, "review": "If you own an apple product, this is really a great product to have and pair with.  This really become handy to share music, videos, streaming anything, photos, etc.  Must recommend to others", "verified": true, "helpfulness": "0/0", "author": "Self Review"}, {"rating": 5.0, "review": "If you buy into apple products then you MUST have apple TV. We bought this last Christmas not knowing much about it but knowing we loved apple and thought it would be cool to have. We had no idea what we stumbled upon. We canceled our cable and get all our shows on huluplus or netflix and anything we download on itunes plays beautifully on apple tv or we can take it to go on the iphone or ipad. If you're an apple nerd like me then you'll love apple TV. All your itunes playlists, movies, tv shows, etc play on here!You can also access youtube videos among other stuff like the Wall Street Journal channel and sports junk (that I obviously don't care about).Pros:Works right out of the box.Constant updates making it better and better!Can play anything you've purchased on itunes and can buy new movies, music, tv shows instantly.Beautiful picture on our large HDTV.Netflix! Need I say more?Huluplus! Again, need I say more?You can download the \"remote\" app on your iphone or ipad and use it instead of the apple TV remote from another room or even another location (at work).Cons:The remote is lovely and super thin which equals to it being lost 75% of the time in our house. This isn't really an issue with the remote app on all our other devices, mostly just annoying b/c I'm sure I wouldn't like the remote if it were larger. So not a true con.Wish there was pandora but I'm sure apple will never go for that.Would love more \"apps\" and offerings but I'm sure they're coming!", "verified": false, "helpfulness": "0/0", "author": "Kellista \"book lover and teacher\""}, {"rating": 4.0, "review": "Love it for watching Netflix and for movies and music from my iMac or iPad. AirPlay is its best feature. Wish it supported Amazon Instant Video and MLS Live.", "verified": false, "helpfulness": "0/0", "author": "James H"}, {"rating": 5.0, "review": "I love my Apple TV. I love my Apple TV. I love my Apple TV.I love my Apple TV. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Indie Film Lover"}, {"rating": 5.0, "review": "This product is amazing! Wish it would would wireless, So far working fast and great photo quality!! 5 star rating!", "verified": true, "helpfulness": "0/0", "author": "Dont care"}, {"rating": 4.0, "review": "As with all Apple products, it is a quality item. It is a must have for iPad owners. It has Netflix, Hulu plus, YouTube, and many other programs. It has Internet radio, with your choice of hundreds of stations. And for iPad owners, for the screensaver it uses your photo stream photos. It also mirrors your iPad on your TV set. I would however, like to see more features in the future.", "verified": true, "helpfulness": "0/0", "author": "MICHAEL B YATES"}]