[{"rating": 5.0, "review": "Typical of Apple products, it's easy to set up(even for us baby boomers) and a high quality product. Love Apple !", "verified": true, "helpfulness": "0/0", "author": "Kate Schappert"}, {"rating": 5.0, "review": "I cancelled my local cable contracts in Singapore and subscribed to Netflix and Hulu via my Apple TV.  I'm addicted and need to get out more now.", "verified": true, "helpfulness": "0/0", "author": "Noel Rodrigues"}, {"rating": 5.0, "review": "When you own a Apple tv you have the control to watch any show/movie you want anytime you want. Old tv series, old movies, YouTube videos all @ the touch of your Apple remote. Gave one to my mother and sister and they have enjoyed it as much as we do.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "In a time when Cable TV costs more money than it should, it's time to bypass it.  A netflix account is all I need as well as files from my computer and the apple tv is now being used every day on my HDTVs.  Well worth the money for me.", "verified": true, "helpfulness": "0/0", "author": "Todd Maure"}, {"rating": 4.0, "review": "This is my second Apple TV.  I have one downstairs and bought it solely to watch Yoou Tube concert footage and videos on the big screen.  Apple is expanding their programming.  Unfortunately there is little else they have that interests me that isn't on cable.Like all Apple products Apple TV is easy to use.", "verified": true, "helpfulness": "0/0", "author": "madreviewer"}, {"rating": 5.0, "review": "I like the apple tv.  I use it to watch hulu and stream movies from my home computer.We have two apple tvs and I love them.  We plan to get a third when we buy another tv.  I love how apple products integrate.  Today, I streamed music from Pandora on my phone through the apple tv to enjoy a surround sound listening experience.  Then I left the room, and went into the kitchen so I switched the airplay from the apple tv to the apple airport without missing a beat.The apple TV is an integral part of our home media experience.", "verified": true, "helpfulness": "0/0", "author": "Heather Jones"}, {"rating": 5.0, "review": "This is beyond my wildest dreams. The number of channels and programs is amazing. I would recommend this product to anyone, especially those who already have Apple products that you can use easily with this product.", "verified": true, "helpfulness": "0/0", "author": "Cowboy Cody"}, {"rating": 5.0, "review": "I love my apple TV! I have an iphone and they work so nicely together. This is the main reason I choose AppleTV in the first place. I think it helps if you have other apple products to use in conjunction with it. LOVE apple! I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Jny733"}, {"rating": 5.0, "review": "Excellent easy to use product. The entire family enjoys it. The new updated version has new and excellent features. I love the way it integrates with all other apple products we havevv", "verified": true, "helpfulness": "0/0", "author": "Davide Colletta"}, {"rating": 4.0, "review": "Great product. Now I can watch all my streaming movies on tv witelessly. Now wating for jb to come out.", "verified": true, "helpfulness": "0/0", "author": "Kevin Shukla"}]