[{"rating": 4.0, "review": "Since we bought this quite a while ago I feel that I have a good idea as to the pros and cons.  First, we cut the cable cord and really haven't missed it.  Have Netflix and Hulu Plus which, mostly, fill in the gaps.  I miss AMC (The Walking Dead) and the Food Network but can live without them.  More channels have been added to Apple TV which has made it that much better.My one frustration is how well it plays (or doesn't play) with our other apple products.  One of the selling points is that you can mirror a show from your laptop, iPad, phone etc and it will be a seamless transition. I've found it to be not as pleasant a viewing experience as more times than not the video is skippy. It is a broadband hog. If someone is online playing video games then the mirroring is worse and it interferes with the gaming experience as well.It would get 5 stars if it played better with the other apple products and if it had amazon on there so we could use Prime to view TV and movies", "verified": true, "helpfulness": "0/0", "author": "t66george"}, {"rating": 5.0, "review": "I have one and bought another as a gift.  Have never had a problem with mine however I can't compare to other similar products as I have never used any but my Apple.", "verified": true, "helpfulness": "0/1", "author": "LD"}, {"rating": 5.0, "review": "I love my Apple TV.  It streams movies from my iTunes library as well flawlessly.  I love the airplay feature from my iPad and iPhones.", "verified": true, "helpfulness": "0/0", "author": "MinnieGene"}, {"rating": 4.0, "review": "I got this primarily to watch Netflix in my bedroom, but it serves other purposes too like playing music when guests are over, watching PBS shows, etc. I love that I can use my phone as a remote on it.The one major downside is that Apple is stingy with the apps it uses on the Apple TV and I would really love if they put like Amazon Prime on it (I know Amazon and Apple are competitors, but Apple TV has Youtube on it so I don't see why they can't expand out a bit).Otherwise, it's great! It's really small and doesn't take up a ton of space and I'm happy to have gotten it.", "verified": true, "helpfulness": "0/0", "author": "M. Young"}, {"rating": 5.0, "review": "I purchased this for a guest room-no need to pay for a cable box for a room only used occasionally", "verified": true, "helpfulness": "0/0", "author": "Gail Harren"}, {"rating": 4.0, "review": "This is a great product, but the lacks apps. I wish it had Amazon Prime and others, but we do really like it and it works well!", "verified": true, "helpfulness": "0/0", "author": "Alex William Bennett"}, {"rating": 5.0, "review": "Apple TV is everything that I imagined it would be. I was really trying to decide what to say when writing this review but, this product tells everything it self. Like at this moment, I was trying to decide if I wanted the new xbox one or the PS4. Then, I thought, I have an Apple TV that is just amazing. It runs fast, no delays, very responsive. Remote is very little, not another big remote that usually comes with a tv or cable box. Netflix is in HD, everything is in HD. It had a recent update that made it even better. Has numerous of apps. Netflix, HULU Plus, WWE TV, NBA TV, ABC TV, HBO GO and Crackle. I can go on and on about everything the APPLE TV has but, back to what I was saying. Xbox one, has all the entertainment features and gaming. Why pay an extra $100 for a product, that I had already paid $100 for that does everything that I need entertainment wise. So, I decided I'm going to eventually get the PS4. Now, enough about my xbox one or ps4 decision. The product is great. It's small, almost to the point that it's about as long as a credit card for it's width and height and the depth of it, is easily only about 3 inches. It won't take much room at all. The remote is small and is great. The added feature though, is if you're like myself and own numerous apple products already. The Apple TV let's you airplay anything that you see on your phone to your tv including pictures, videos, music, apps, messages. Anything. The other cool thing abut this product that I love so much is the fact that you can get the remote app for free in the apple store on your iPhone and use your iPhone as a remote for it. Instead of dealing with an extra remote, you can just leave the remote app running and always have your remote and it's free of buttons, so you just roll your fingers anywhere you want your apple tv to go when selected a product. That concludes why I love this product and why I give it a 5 out of 5 star rating. I would for sure recommend it to a friend and, I would just give them all the run downs and how they wouldn't regret making the awesome purchase.", "verified": false, "helpfulness": "0/0", "author": "Adam Maddox"}, {"rating": 3.0, "review": "This unit is not new. It wasn't even wiped from the previous owner. I turned it on and could access all of the previous owner's accounts... netflix... itunes... etc. I will be contacting the previous owner over email (because I their email address as displayed on every app), and let them know. This is a huge breach of personal security for the previous owners, and big question mark for Amazon's honesty and commitment to their customers.", "verified": true, "helpfulness": "0/1", "author": "J. Haxton"}, {"rating": 5.0, "review": "I use the Apple TV to play video from my computer, via iTunes (just convert your videos to MP4) as well as for my HULU and Netflix accounts. It used to work with Amazon instant video, but Amazon recently removed that functionality in order to boost sales of their own similar device.", "verified": true, "helpfulness": "0/0", "author": "Depardieu"}, {"rating": 4.0, "review": "Good product, ease of use and easy to install. Arrived timely and serves its purpose; however, Apple will deliver a newer, better product in Q4 2014 and I recommend delaying this purchase until then.", "verified": true, "helpfulness": "0/0", "author": "DallasGuy"}]