[{"rating": 4.0, "review": "I have owned this item for nearly two years now.  The product itself is typical of Apple.  It is well finished, solid and is unobtrusive in my entertainment center.  For the most part it works well.  I purchased it specifically to use with my Netflix subscription.  It worked well with Netflix until I installed an update.  Now it lags and is constantly buffering.  I even purchased a more powerful wireless router to no avail.  It is so frustrating that I really don't even use it anymore.  Before I give it away, I'm going to try hard wiring it to my router.UPDATE:  I ran a network cable from my router to the Apple TV.  Now it works like I want it to.  No more buffering or kicking me back to the menu.  I will upgrade it to 4 stars.", "verified": true, "helpfulness": "0/0", "author": "L. Tabor \"regular guy\""}, {"rating": 4.0, "review": "I bought this thinking I could download Outlander episodes (Starz), only to realize that these versions are only available in Australia on iTunes. However, this is my first Apple product I've bought since I used to own the Apple Powerbook 100 and the Macintosh IIsi running System 6 and then System 7. Back in the early '90s these computers were on the cutting edge, but technology was moving so fast that the cutting edge didn't last long. I started out with the Roku 2 and now have the Roku 3 (really like the ability to plug earphones in to the remote). Also tried the Netgear Neo TV but gave it away as it doesn't have Amazon Instant Video. I also have the Amazon Fire TV so I'm curious to try the apple out in comparison to these other little boxes. I find that I use the Roku the most. Update: 11/11/14. Thanks to all veterans today. Okay. So I've had this little box for awhile now. Can't see the benefit when compared to my other little boxes unless I specifically want to buy a show from iTunes. The Roku 3 is still my go-to streaming box.", "verified": true, "helpfulness": "0/1", "author": "T. D. Thompson"}, {"rating": 3.0, "review": "Shipping took a little long but satisfy over all", "verified": true, "helpfulness": "0/2", "author": "mike"}, {"rating": 1.0, "review": "It's a POS!!! its always losing signal with wifi, I have constantly reboot everything. It hust sucks, by the time everything gets started an hour of your time passed by already.", "verified": true, "helpfulness": "0/4", "author": "Chino"}, {"rating": 1.0, "review": "My Apple TV has never worked more than half the time. It's not worth the price. I'm going to buy Roku. It's cheaper, easier to use and works all the time.Apple makes big promises, but rarely delivers given the price.", "verified": false, "helpfulness": "0/2", "author": "David Condon"}, {"rating": 5.0, "review": "Are you kidding me it's APPLE, Works awesome on my home network and linked to my home computer!", "verified": true, "helpfulness": "0/0", "author": "Jason B. \"drbdubois\""}, {"rating": 5.0, "review": "Easy to install. Apps like Netflix and Crackle work very well, but should leave the country to choose where to look and not associate the country where it is installed.You should also leave wifi direct communication from PC with windows, not only through iTunes.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Muro"}, {"rating": 4.0, "review": "Would have given it 5 stars if Amazon prime was available. To play Amazon prime, I have to use iphone or ipad to airplay my Amazon content. I have only used it for a few days now and could not find anything wrong with it.", "verified": true, "helpfulness": "1/1", "author": "Arvinder Singh"}, {"rating": 1.0, "review": "I initially began purchasing from Amazon because they did at the time have the customer in the correct position (#1) but like most ALL OTHER stores and people across the board become more and more obsessed with money and power and start to view customers as a bother actually. Employees begin to be treated not so nice and their power (the ability to handle moat common sense customer day to day issues. There has to be a set of written procedures, allowances and such for them to become so successful. If he would be stupid enough to say that he is or was unaware of things occurring inside of the giant company. Next comes the hiring of less and lesser qualified people here in the US and large numbers of the Customer Service  people now in foreign countries with even lower pay who we are being switched to even with and when US  Facilities are open.Tricks like these :\"kits\" they just give a fancy technical name to yet another Chinese cable that with an absurd price attached to it.  Anyone can set a imaginary List Price and give us 89% savings especially when the cable has never been sold and kept at  that List Price. I used to just ignore these types of products but it is happening  more often than not. I want to know why yet another American initiated company is back peddling in its promises of not locating  personnel in other countries especially those where English is the second or third language. Last topic for me is the lower cost products that have tons of 5 Star reviews. I ordered a wallet last week that had a landed cost of approximately $12.99 with a cost  saving of $50.00. When I opened the box and examined the \"100% cowhide leather wallet\" it was definitely not any type of leather I have ever purchased with any product I am so angry about this that I am going to return it or post to my home page and auction it with no reserve and in bid increments in $,05 amounts, It is a name branded product but one I have never heard of. Like Eddie Bauer but instead Freddie Bauer. I would value any input excepting for the \"nobody forces you to use Amazon, etc., as they are no more entitled to do this than any other online or brick and mortar store. Scott", "verified": false, "helpfulness": "1/3", "author": "S. B. Smith \"The truth and nothing less; unless of course it is Friday.\""}, {"rating": 5.0, "review": "love it.", "verified": true, "helpfulness": "0/0", "author": "Talal"}]