[{"rating": 5.0, "review": "I purchased this for my aunt, who gave it to her husband for fathers day. He loves Apple products & was looking for a way to get his Ipad content onto a bigger screen. I knew this would be great for him. Setup was quick & easy & it works perfect! He is very happy & his bedroom TV is now a smart tv with help from this small, lightweight, little box.", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 5.0, "review": "To anyone wanting an AppleTV so they can cancel cable, here is some insight on how the AppleTV works:The AppleTV turns on and you will see a lot of apps, just like on a phone. These are the only Apple available, you can't search and download an App Store like you can on your phone. I included a full list of these channels at the bottom of my review. These are changing over time and Apple adds more and more as time goes by.Many of the TV apps have free content available, like clips or interviews, but to access the \"good stuff\" like full episodes, you need to have a cable login/password.You can only access full content on a channel app if your cable package gives you access to it normally. I use my parents' account. Disclaimer: some companies may allow sharing accounts according to their user terms and agreements. I am not aware of every company's user agreements, so I can't speak to them, but what I can tell you is that I use my parents' cable account (I do not live with them) and have had no issues or pushback. Netflix encourages sharing accounts, as does Hulu, etc.My parents don't pay for HBO, so the HBOgo app on my AppleTV won't work unless I type in a different username. One good thing is you CAN use different usernames with each app. So it's not a one-size-fits-all login situation.Another feature I like is you can \"mirror\" your compatible phone screen onto your TV. We use this feature for channels who don't have Apple TV apps, but have viewing content available on their iPhone apps. For example, MTV, CBS, and most notably Amazon Prime. They have an iPhone apps with viewing content, so we downloaded it on our phones, enable the mirror option, and boom! We can watch it on the Apple TV now. We have found basically every show we normally watch this way.Another cool feature of the AppleTV is being able to rent movies the day they come out on DVD. It's usually $5 or $6 to rent, and I like it better than Redbox because Redbox never has what I want available (unless it's not a new release), and I don't have to drive to get it and drive to return it. It's also cheaper than my Time Warner On Demand rentals, and they have better selection. You can find ANYTHING. Plus TV shows are sometimes only $1-$2 to purchase forever!Pros:1) If you utilize all the viewing tricks (home sharing your computer iTunes, mirroring phone apps, using family cable accounts) you can watch basically all off your cable shows without paying for cable anymore2) easy to use interface3) simple controls4) quick click response, very few glitches and lagging (almost never happens!)5) lots of content available to purchase as well, if you're into that!6) great for kids, lots of control7) has a screensaver so it won't burn an image into your nice televisionsCons:1) many apps you're used to watching that are available on your phone may not be available on the AppleTV yet. This is probably not Apples fault and mostly licensing issues, but I still think it's a con. You CAN get around this by mirroring your screen if you have a newer iPhone, like I reviewed above! Some of those Apple include Amazon Prime, CBS, and MTV.2) setup is tedious. Typing your logins has to happen on each and every app, there are dozens!, and some of them (per the channel's policy) make you verify through the website and get an activation code. The Showtime app in particular is a pain in the you-know-what and makes you redo this once a month or so. You have to sign into Showtime using your cable app, get a code, and then type it into your AppleTV to view content there3) the remote signal isn't always received by the box and needs to be aimed right at it. If you have to put it in an obscure place, expect a little annoyance.4) the remote that controls the AppleTV is the same remote that comes with iMacs and can control other Apple devices. My computer is somewhat close to my AppleTV and if I'm not careful how I point it, the iMac picks up the remote signal meant for the AppleTV Zane starts playing music on my iTunes. This is easily solved by moving the devices farther apart from each other, but when you have a tiny apartment like I do, this isn't easily done!Overall I would recommend this product! We now own 2, one for our upstairs and downstairs TVs, and have cancelled cable and will never look back.Here is the complete list of apps that come on the AppleTV as of 7/5/2015:120 SportsA&E;ABC NewsACC Digital NetworkAOL OnApple EventsBeats MusicBloomberg TVCBS NewsCNBCCNNgoCrackleCrunchyrollDailymotionFeelnFlickrFOX NOWFusionFYIFX NOWHBO GO (cable/dish subscription required)HBO Now (standalone cable-free subscription required; available April 2015)HISTORYHulu Plus (subscription required)iMovie TheateriTunes Movies and TV ShowsiTunes MusiciTunes RadioKORTVLifetimeMLB.TV PremiumMLS LiveNBA League PassNetflix (subscription required)NFL Now (premium content requires a paid subscription)NHL GameCenterPBSPBS KIDSPodcastsQello TVRed Bull TVSettingsShowtime AnytimeSky NewsSmithsonian ChannelTastemadeTed TalksTennis Channel EverywhereThe Weather ChannelTrailersUFC.TVVEVOVimeoWall Street Journal LiveWATCH ABCWATCH Disney ChannelWATCH Disney Junior (some free content; cable/dish subscription required for full access)WATCH Disney XDWatchESPN (cable/dish subscription required)Willow TVWWE Network (subscription required)Yahoo ScreenYoung HollywoodYour Photos and VideosYouTube", "verified": true, "helpfulness": "19/19", "author": "Bethany L \"Bethany L\""}, {"rating": 5.0, "review": "Love my Apple TV!!!  I can now play anything and everything from my iPad or iPhone on to my TV.  Super easy to use.", "verified": true, "helpfulness": "0/1", "author": "Valerie Mejia"}, {"rating": 4.0, "review": "Fantastic product except for the remote. Too small and easy to misplace. The picture quality beats my Roku hands down. Have to say I like the Roku Netflix UI better though. I like the Apple TV Hulu UI better though. Overall though I will probably replace my 3 other Roku boxes with Apple TV", "verified": true, "helpfulness": "0/1", "author": "Steven Murphy"}, {"rating": 5.0, "review": "Excellent product.  Fairly easy to set up and use.  AirPrint for use with Apple devices is awesome!", "verified": true, "helpfulness": "0/1", "author": "Ronald H. Konowitz"}, {"rating": 5.0, "review": "great price and a good compliment to my Roku -- since it works with my iPhone...", "verified": true, "helpfulness": "0/1", "author": "jandj"}, {"rating": 5.0, "review": "I love this item.", "verified": true, "helpfulness": "0/1", "author": "ali"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Juan Pablo Quintero H"}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/1", "author": "wilson"}, {"rating": 5.0, "review": "This Apple TV worked perfectly and connected right away. VERY happy!", "verified": true, "helpfulness": "0/1", "author": "Matt F"}]