[{"rating": 5.0, "review": "I just got this product and for the price you'll won't be disappointed. There's like millions of movies and shows to choose from. But you do have to rent or purchase certain movies. For example: If you purchase nexflix for $8.00 a month you'll get to choose from hundreds if not thousands of movies and tv shows. Then there's another I think 15-20 more apps on there. You tube is free, I've only used it for about an hour so I can't tell you too much. I forgot to mention one important thing, you need to have a internet service wireless or hardwired.", "verified": true, "helpfulness": "1/1", "author": "maui1015"}, {"rating": 3.0, "review": "Good:-Sub $100 price.-Size.-Itunes store connectivityBad:-Network issues. Doesn't connect well to my Apple router.-Couldn't see my itunes share. Couldn't resolve problem.-Limited media network.-Apple needs to add a back button. The combo menu/back button is annoying.Sending it back.", "verified": false, "helpfulness": "0/0", "author": "J. F."}, {"rating": 3.0, "review": "If you could access more apps like HBO Go, I would like Apple TV more and probably purchase one for myself. I bought this as a gift for my brother and while it's really cool that it can mirror your iPhone or your mac, it's just not quite there yet. Maybe Apple should add the ability to add a wireless bluetooth keyboard to it and maybe a browser. Otherwise, it plays Netflix and iTunes just fine, but I'm looking for a more rounded device.", "verified": true, "helpfulness": "0/1", "author": "Katie Allred \"Katie Allred\""}, {"rating": 5.0, "review": "Small, compact and extremely easy to install. This is my first venture into the MAC world and, so far, I'm impressed.  Tons of choices -- movies, TV shows, podcasts, iTUNES. The only downside (and I'll 'master' it) is that the remote is SO small. Easy to lose. I'm going to velcro it to a block of wood the size of my TV and cable remotes.  I've already recommended it to friends and bought one for my grown sons.  Oh, and I'm catching up on Seasons 1 and 2 of \"Downton Abbey.\"", "verified": true, "helpfulness": "0/0", "author": "Charmor"}, {"rating": 5.0, "review": "he wanted this so i got it for christmas he likes it  not sure if i would but hes know more about  computer s then i do", "verified": false, "helpfulness": "0/0", "author": "carie martinez"}, {"rating": 3.0, "review": "I have 3 televisions and own 3 boxes including the now discontinued ReView (Google TV), The newest 2012 Apple TV, and The Roku Unit. From a functionality standpoint, the Apple TV is my least favorite.APPLE TVPros: The design, reliability and ease of use and general \"fit and finish\" is the clear leader of the bunch. Being able to stream some of the content on my Ipad and Iphone is also a cool bonus.CONS:The google TV acts like an Android Phone, you can add apps. Unlike the Google TV, you can not add APPS to the Apple TV and are left with the very limited selection of built-in applications. I can't stream my Amazon Videos, Can't Browse The web, Pandora is not native and the list goes on.  (Unless I am on my Ipad)and the selection is just plain poor.There is no USB port where I can connect an external HD and play media off of it. Both my RoKu and Google TV do this and I use it all the time.I can not connect to my NAS server in the house. Both my RoKu and Google TV instantly see the share and I can stream all the movies and songs that I have on my 3TB master NAS which holds all these things. Although my NAS is an \"itunes\" server... the only way to stream videos to an Apple TV is to connect to a PC or Mac which is running and logged into Itunes. If I wanted to keep my laptop powered on all the time, this would not be an issue but I don't.In summary, I think the features and functionality of the Apple TV is very limited. It should work like an Iphone or Ipad and support apps just like Google TV does, they should add some USB support and start making NAS products which are compatible with it.", "verified": true, "helpfulness": "0/1", "author": "Sean S"}, {"rating": 5.0, "review": "Purchased this for two of our kids for Christmas and they love it!!!  Easy to hook up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "James Pringle"}, {"rating": 4.0, "review": "Once we saw how much we used and enjoyed our Apple TV in our Media Center, we just had to buy another for our bedroom.", "verified": true, "helpfulness": "0/0", "author": "Rauol"}, {"rating": 5.0, "review": "Works very well, no complaints. Set up very easy. Using with Apple Airport Extreme, very clear and sharp picture. Recommended.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "So much functionality in such a little box! In less than 10 minutes out of the box my TV was interactive within my network, my laptop and two iPads.", "verified": true, "helpfulness": "0/0", "author": "J. Likens"}]