[{"rating": 5.0, "review": "This is the best streaming player out there. It provides you with all the apps that you need in a normal TV viewer's life, seamless and Airplay connectivity with your iOS devices as well as can connect wireless with your computers once you have iTunes synched up. Very handyThe remote is very sleek and stylish.", "verified": true, "helpfulness": "0/0", "author": "Arindam"}, {"rating": 5.0, "review": "In a time with hundreds of channels and nothing to watch, the Apple TV saves the day. More TV choices for the whole family on your own schedule and lots of free! I gave it to my husband for his birthday and he spent all of the snow days vegging out. I was delighted because he is normally a work-a-holic and it was good to see him relax.  This product is affordable and lots of fun.", "verified": true, "helpfulness": "0/0", "author": "Reba Hough-Martin"}, {"rating": 3.0, "review": "The lack of Amazon prime, an obvious attempt to keep out competition limits the usefulness of this in comparison to the roku for a general coardcutting piece. The mirroring feature still means you have to have the mirrored device blocked up, so mirroring HBOgo means you can't use the iPad at the same time. The only thing I use this one for anymore is dropping music from my computer or iphone/ipad to the tv.", "verified": false, "helpfulness": "0/0", "author": "asarstar"}, {"rating": 5.0, "review": "I absolutely love the Apple TV.  I have one in every room of my house.  Great way to watch a lot of great shows and its very easy to use", "verified": true, "helpfulness": "0/0", "author": "CC"}, {"rating": 5.0, "review": "One of the best purchases I have ever made.  Life without a cable bill is one of the best choices i have ever made.", "verified": true, "helpfulness": "0/0", "author": "Will H."}, {"rating": 5.0, "review": "Really pleased with the purchase, mostly use if for access to Netflix and Hulu but it also has some great other apps Im starting to use. It needs a decent internet connection. Like all Apple products it looks pretty smart, is extremely small and the home screen is easy to navigate and smart. Used to use Xbox to do some of the functions this performs, this is much easier and well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Thomas Gale"}, {"rating": 5.0, "review": "Well 1st I love Apple products. My wife & I have iPhones, iPad, & now 2 Apple TVs. It works great & fast shipping. I can't complain about it.", "verified": true, "helpfulness": "0/0", "author": "David Dominguez"}, {"rating": 5.0, "review": "This was my second Apple TV.  It had a problem where it did not connect to my network.  Actually it didn't even see any networks.  Must have had an issue on the board.  My other works fine.  I won't ding the rating as I really like this product.", "verified": true, "helpfulness": "0/0", "author": "mreservices"}, {"rating": 5.0, "review": "So far everyday is an adventure using it. Works very well, not to hard to figure out and I have moved it to 3 different TVs with no problems.", "verified": true, "helpfulness": "0/0", "author": "Mike Bowers"}, {"rating": 5.0, "review": "Best tech buy I've made in years. This thing is super cool. Many apps for many diff tv/movies. And the airplay to stream music or video to any connected device is clutch.", "verified": true, "helpfulness": "1/1", "author": "Charles"}]