[{"rating": 5.0, "review": "All Apple products are great. This one is no exception. All my Apple devices can be synced to/through the Apple TV. So cool!", "verified": true, "helpfulness": "0/0", "author": "Amaris Avant"}, {"rating": 5.0, "review": "Love it, just not as much air play from iPhone as expected mainly due to apps limitations but overall great device", "verified": true, "helpfulness": "0/0", "author": "Edwin Tilghman Coulbourn"}, {"rating": 2.0, "review": "Does not always work. Have to reset it frequently to keep playing music. It will play for about fifteen minutes then the sound dies. Not sure why.", "verified": true, "helpfulness": "0/1", "author": "Lisa"}, {"rating": 5.0, "review": "what can you say. It is apple after all. works like a charm. Doubles the pleasures watching Netflix and You Tube. Watch out for its razor thin remote. It has tendency to disappear between crevices. If you have an I Pad or I Phone you can operate the device with them", "verified": true, "helpfulness": "0/0", "author": "Abe Kothari"}, {"rating": 5.0, "review": "Awesome product for people who do not want to pay the high price of having cable in NYC.We love our Apple TV and it took less than 5 minutes to get up and running!", "verified": true, "helpfulness": "0/0", "author": "Haley B Vinick"}, {"rating": 5.0, "review": "Is everything I was told it was and more!  It makes tv more affordable for our budget....should have bought it sooner...", "verified": true, "helpfulness": "0/0", "author": "candace caraftis"}, {"rating": 5.0, "review": "Does what it's supposed to do.  Lets me stream a variety of internet programming.  The best app is the Youtube app.  It's the best I've seen so far because of how easy it is to navigate.  It would be nice if the remote was bluetooth so you wouldn't need near line of sight to operate.  It would also be nice if the remote had a plug for a headset like the Roku3 has.  For what it does have like network streaming from your home computers I'm happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "L. Jones"}, {"rating": 1.0, "review": "The cable that turns this from an \"Apple Paperweight\" into an \"Apple TV,\" is not included.  I opened the box when I first got it and was like, \"Oh what the hell, man?\"But don't worry, in lieu of functionality, you'll get - not one - but two Apple stickers as a consolation prize.  I'm 30-years-old, I don't grade essays written by children, and I don't own a skateboard... what the hell do I need stickers for?  They are completely and utterly useless.You know what would be useful??  THE CABLE THAT CONNECTS THIS TO THE TV!!  I'd go to the Apple Store to complain, but no one likes being around all those horn rimmed glasses. I actually read a book the night I got this.  Not a whole book - just, like, 4 chapters or whatever.  But still - I actually cracked open a hardback that evening because I couldn't watch the 21 episodes of Robot Chicken that I downloaded the night before.  Such a load of crap.", "verified": true, "helpfulness": "2/21", "author": "H. Parker Smith III \"Parker\""}, {"rating": 5.0, "review": "I flew down south to visit relatives and my gadget GOD brother has everything! He showed me this and I instantly had to get one when I got home, now I don't want to watch regular TV!!!", "verified": true, "helpfulness": "0/0", "author": "Stacey, CA"}, {"rating": 4.0, "review": "I love this for watching NHL and MLB. I did not want to pay the higher price for the hockey package with the cable provider, and satellite companies that I have been over the last 10+ years so I figured I would give the streaming a try. I was a little hesitant due to issues you sometimes see on your computer with delays, I am happily surprised. This works great, I have only had minimal delays on streaming to load up the show, but after it is going I have had no issues to this point. If this works this well over the next year I think I will look into cutting the cord on cable and test the waters streaming all my shows. The issues I see are: not a ton of options at this point with apple TV, but I just ordered a ROKU that seems to have a ton of watching options so I dropped my star rating to a 4 due to no availability to expand my viewing options on this unit.", "verified": true, "helpfulness": "0/0", "author": "J. M. Carter \"Jason Carter\""}]