[{"rating": 5.0, "review": "Mirroring is so easy with Apple tv.  One touch of a button and I am sharing my photos/videos/presentations.  The only downside is that the audio does not transfer as well, just the video.", "verified": true, "helpfulness": "0/0", "author": "Michael R. Dawson"}, {"rating": 5.0, "review": "We use Apple TV to augment our normal service (AT&T;'s U-verse) and watch both iTunes and Netflix content. Works great!", "verified": true, "helpfulness": "0/0", "author": "CM \"Better things to do but this is more fun.\""}, {"rating": 4.0, "review": "I bought a $10 app for my computer (now a free feature in OS 10.8) so I can stream anything from my desktop.It's compact and does everything I want it to.  The remote app for my iPhone and iPad makes losing the tiny remote irrelevent.All I know is that I'm completely satisfied.", "verified": true, "helpfulness": "0/0", "author": "Christopher M Rash"}, {"rating": 3.0, "review": "I've streamed a few movies from my iPAD to here, but I see the bigger value in this if you actually subscribe to Netflix streaming, Hulu, or other streaming media.  We don't---since we have HBO and Netflix DVD.  To make best use of it, better to have streaming subscriptions.", "verified": true, "helpfulness": "0/0", "author": "pb"}, {"rating": 2.0, "review": "A week ago I would have given this 4 stars.  But then I bought a Roku and realized just how limited the Apple TV is.  The Roku allows me to access Amazon Prime movies and Pandora; the only use I have for Apple TV is Netflix, which the Roku also does.  Basically, Roku does everything Apple TV does plus a whole lot more.", "verified": false, "helpfulness": "2/5", "author": "Uncle Gonzo"}, {"rating": 4.0, "review": "Great alternative to TV and very useful for netflix.  Need to add Amazon Prime.  As usual Apple is a little stingy with products that do  not send money directly to their bottom line.", "verified": true, "helpfulness": "1/1", "author": "W. Stoneman \"Bill\""}, {"rating": 5.0, "review": "My daughter and I like Apple TV! It is very convenient and easy to use like all Apple's products! recommend it for you!", "verified": true, "helpfulness": "1/1", "author": "Aleksandr Nechiporenko"}, {"rating": 5.0, "review": "We use this for watching Netflix and iTunes purchased content on the TV.  The only way it could be better is if it had Amazon Instant Video content.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 2.0, "review": "I have this item and the remote control buttons are just so uncomfortable to press. I always have to delete and try again. Hate it, i was hoping I could find a App remote control but that remote control app only controls itunes music library. How dumb. Who wants to have a iphone and a remote controlin their hand. I use my apple tv mostly to mirror with my big tv screen. A better idea would have been a QWERTY keyboard remote control, or even a QWERTY remote control app that allows us to control everything but I still like to feel and hear the buttons click. I hate how when you mirror it, it does not show the full lenght of the tv screen. They need to add amazon video, crackle, and pandora,etc", "verified": false, "helpfulness": "1/2", "author": "Mc Call"}, {"rating": 5.0, "review": "I don't think there is one negative thing to say about any Apple product. This Apple TV is the perfect example of that. I love this! Anything that is on my iTunes, I can now get on my tv, not just movies and shows, but music and pictures as well. This Apple TV was delivered to me in less than 24 hours!!! It was awesome. It also came with two Apple car decals! Make sure you have an HDMI plug because it is not provided with the Apple TV, so maybe one negative thing but not that big of a deal. I am extremely happy!", "verified": true, "helpfulness": "1/1", "author": "Mols"}]