[{"rating": 5.0, "review": "i never thought that a small little box could make a difference but the apple tv did.  the box is easy to set up and all our computers and iphones can connect to it", "verified": true, "helpfulness": "0/0", "author": "George J. Rivers \"BUGMANN\""}, {"rating": 5.0, "review": "PROS: easy to setup, easy to navigate, works consistentlyCONS: No App Store, on smaller TVs it's difficult to read text on the screen and no way to update it.My wife and I love our Apple TV... it works wonderfully and we have not had any issues with streaming at all. We gave up Cable and have been using this exclusively for a month with no issues. The only real issues we are having is reading some of the text descriptions of Movies or Shows on the NetFlix or iTunes Movies apps. We think with a bigger TV this shouldn't be a problem.", "verified": false, "helpfulness": "0/0", "author": "Zachary L Hill"}, {"rating": 5.0, "review": "This is a perfect match for any iPhone or iPad, because you can seamlessly share content between devices. It also has a great picture and sound quality. It is very easy to set up and very easy to use.Love the current apps and can't wait for more.", "verified": true, "helpfulness": "0/0", "author": "eddy villalta"}, {"rating": 4.0, "review": "I love the Apple TV. I own two. The system is fairly easy to install. I use it primarily to play music through my TV systems using iTunes library. I also love the screen saver feature allowing photos to be displayed while listening. If football could be watched using this system, I would let my cable company reclaim its box. This will happen, but sooner than later would be best.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Man I love this thing.  Not sure why I waited so long to grab one but lately I've been getting serious about ridding of cable.  Sure the AppleTV has its limitations, but that's really only because of limited deals with TV providers.  This will improve over time but the state of this device is still amazing.If you have an iPhone/iPad, using Airplay to stream your content to the TV is just amazing.  From songs to podcasts to Youtube movies, it's awesome.  Using iPhone as the remote control for this device is the only way to go as far as I am concerned as my fat fingers kept hitting the middle button on the included remote by accident.Personally I am using Hulu plus, Netflix and I got a flat OTA antenna for the free OTA HD channels.  Homesharing - playing songs from your iTunes from your PCs - very nice.And for the guys out there I am just gonna say it - you can stream free porn onto your TV via Apple TV.  Come on you know you're going to do it.  Wife and kids is away shopping and guess what, you have the house all to yourself.  You gotta keep the pipes clean and keeping prime can prevent prostate cancer.  The porn streaming works really well but get ready with emergency volume control.  Come on you're going to do it - you know I'm right.", "verified": true, "helpfulness": "4/6", "author": "antiscian"}, {"rating": 3.0, "review": "I was expecting to love this device and use it daily.  My first experiences using it to rent iTunes movies was less than spectacular, with lots of delays and freezing and buffering.  I did buy a movie and have a slightly better experience in that use.  I probably won't use it much for that purpose, especially for movies that are very involving, where a sudden freeze and buffer would ruin the experience!For streaming photos from iPhone, it is fantastic. Love seeing the photos on the big screen and not having to download them onto my computer, etc.", "verified": true, "helpfulness": "0/1", "author": "CB in LA"}, {"rating": 5.0, "review": "I use the Apple TV in a room where there is TV which is not connected to any cable or DISH/DIRECTTV line. It is used to let my grandchildren watch shows from HULU PLUS and NetfLex and I can easily rent movies through iTunes if need be.  It was easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "DIANE NEVITT"}, {"rating": 5.0, "review": "Really like my Apple TV. I end up spending more time using it than regular TV. It's nice playing my iTunes content on my home stereo. I only wish it came with Pandora.", "verified": true, "helpfulness": "0/0", "author": "G. Smith"}, {"rating": 4.0, "review": "Apple TV is a great addition to the Apple product line. Stream any thing to your tv from macbook, iPad or iPhone. Easy to set up, fast and reliable.", "verified": true, "helpfulness": "0/0", "author": "Rj"}, {"rating": 2.0, "review": "My \"newest\" apple tv is a big let down. I am a many years long apple user, fan, advocate, but this ATV (along with iCloud) has me feeling like I've been pushed aside in the interests of fast selling. I say this because: The ATV is dependent upon iTunes. The key here is \"tunes.\" I have lots of video I created with Apple software and most of it, by default, is in my Movies folder. Also, iPhoto and iMovie and Quicktime all are image or video oriented. Why are we using a music software like iTunes. Because it sets you up to buy, buy, buy stuff. My new apple tv shows me icons for Movies and TV but everything in those categories is for purchase. The only way to access my movies or any video I have, is convert it to a iTunes (very limited) format; import it into iTunes, then access it via the Computer icon. But wait, I have to first set up Home Sharing which my Apple MacBook Pro will not do because it rejects my Apple user id (their screw-up, not mine. They have a very old email address of mine which they simple won't let go of).Also...very significant, this new Apple TV 1080p will not play out at better then 720p on both my HDTVs. Why, because, it is p not i. (Google it). In short, it is outputting at a higher or better resolution (p). Now, in most products, if it has greater capabilities than your existing equipment, it usually will automatically play down to that level. I assumed (my big mistake) that since my HDTVs are and do play at 1080i, the apple tv would as well. Wrong.It's a real pain. I can-NOT get to the greatest amount of all the video I have on my three Macs and multiple external hard drives. Unless I convert everything and put it into iTunes. I never understood when people said iTunes was bloated. Now I understand.  (*The cloud thing, well, unless I move up to apple's newest operating system, or get mobile devices I don't want, I can no longer use what I have been paying apple $100 a year for, for the past six or more years.) Waa-waa. Blah, blah. Sorry about the rant. I'm so disappointed with Apple and this ATV.", "verified": true, "helpfulness": "1/7", "author": "Noodlehead"}]