[{"rating": 4.0, "review": "The Apple TV has grown from its early days when it had a hard drive, to now being just a streamer.  It cost much more back when it ran a version of Tiger.  Now it is a streamer and it makes it very easy to get movies and music off you computer and on to the TV.  Its interface changes with updates, Apple has added more channels, but nothing like Roku.  I have both,  Roku is nuts with adding channels. Roku is a cheaper unit, does more then Apple TV, is not as polished in terms of interface, but it can handle Netflix,redbox,Vdu, HBO, etc, etc.  If you are an Apple person with Ios toys then you will love this.  You might still like the Roku because if you are computer savy, there is more you can do with.", "verified": false, "helpfulness": "3/3", "author": "Mike60"}, {"rating": 5.0, "review": "I'm sure that as we use it more we will find additional things that it will do but at this point we won't be looking at \"smart tv's\" anytime soon.", "verified": true, "helpfulness": "0/1", "author": "william j. paquette"}, {"rating": 5.0, "review": "What can I say it's apple so why wouldn't I like it yea you should buy itIt's awsome  co", "verified": true, "helpfulness": "0/2", "author": "Cameron"}, {"rating": 5.0, "review": "Simple to hook up, beautiful interface, great to send music over from our iPhones or content on the laptops.  Great for watching HBOGO, Netflix, etc. etc.", "verified": true, "helpfulness": "1/1", "author": "Oldbarrows"}, {"rating": 5.0, "review": "We have used this several times since our purchase. It is easy to set and to use. So portable that you can move from one TV in the house to another if necessary. It has been great for streaming Amazon Prime videos.", "verified": true, "helpfulness": "1/1", "author": "JimB"}, {"rating": 1.0, "review": "It's cheaper and you have more options! I got mine to mirror from my phone or iPad and it won't mirror my cable subscription!", "verified": true, "helpfulness": "0/8", "author": "Waterfallaus"}, {"rating": 4.0, "review": "We like our Apple TV. The setup was easy and we were quickly able to connect to the iTunes account on our main household computer. The thing is, it might change the way you watch TV. If you are a person who is used to watching their television \"on demand\", and have Netflix and Hulu Plus subscriptions, this product is for you. If you are a \"passive\" TV viewer, like me, it does fundamentally change how you watch TV, and I haven't decided whether that is for the better.Sometimes you just want to put on a channel and watch a series of programs without having to do anything. With Apple TV and other similar devices (or YouTube for that matter) you have to select each program individually. You can build a playlist, but you're still picking everything. It takes away the ability to just leave the TV on in the background while doing other things.", "verified": true, "helpfulness": "1/1", "author": "James Altemus"}, {"rating": 1.0, "review": "I don't recommend buying this junk if you want to use it with netflix considering it doesn't work half of the time.", "verified": true, "helpfulness": "2/10", "author": "Brock Cyphers"}, {"rating": 5.0, "review": "I purchased this because my tv is a few years old, still good, and Hdmi capable, so I didn't want to yet purchase a smart tv. I got it set up easily, with a little help, and it's great so far--Netflix, Huku, YouTube all in one place. I only wish it amazon prime video, but I can do that from my iPad easily.", "verified": true, "helpfulness": "3/3", "author": "cinji"}, {"rating": 5.0, "review": "I am actually more impressed with this Apple TV then I thought I would be. Very smooth graphics. Loading times are great. Very suprised. Could not be happier.", "verified": true, "helpfulness": "2/2", "author": "Chris Hall"}]