[{"rating": 5.0, "review": "I love the apple tv.  I used to use my wii to watch Netflix but it wasn't in HD.  This is so easy to pick up and move from room to room when necessary.  Got a great price on it too.  Highly recommend.", "verified": true, "helpfulness": "1/1", "author": "J. Williams"}, {"rating": 5.0, "review": "I have a raspberry pi with XBMC and it in no way compares with the ease and use of the Apple TV. I have two of these and find using Netflix on it just great, and combined with Airplay and linked to my computer, just great.", "verified": true, "helpfulness": "1/3", "author": "Luopo"}, {"rating": 3.0, "review": "Short time I've had this can only know it takes a while to understand the system. Great picture quality and location.", "verified": true, "helpfulness": "1/3", "author": "Alan Gleason"}, {"rating": 5.0, "review": "It is such a great system and makes it so much easier to enjoy our shows! Plus, it is very easy to set up and take with you anywhere you go.", "verified": true, "helpfulness": "1/2", "author": "ChloezMaMa"}, {"rating": 5.0, "review": "I originally bought a chromecast and after hours and hours of messing with it I got smart and bought the Apple TV! I am so happy with this product! Works great! My only complaint is I DO wish it would have an app to stream amazon prime videos.....other than that, it's amazing!", "verified": false, "helpfulness": "6/6", "author": "honest opinion"}, {"rating": 5.0, "review": "As I received this device I was first impressed by the quality of it. it was even packaged in an impressive way. I loved the easy setup and its software. I had many of the applications in appletv already on the PS3, but the truth is I never experienced that quality of service from the same apps on the ps3. for example the Youtube app in ps3 compared to the appletv sucks!!.I would recommend it for everyone, I can't see a reason why someone should not have this device.", "verified": true, "helpfulness": "1/1", "author": "Sherif Khateeb"}, {"rating": 5.0, "review": "I don't have a tv yet and have been using this with an hdmi compatible monitor and some external speakers. It's been great. Will probably get another soon.", "verified": false, "helpfulness": "1/1", "author": "jenna"}, {"rating": 5.0, "review": "My first Apple TV and serious enjoying all the features it has to offer especially the ability to interface with the iphone and ipad", "verified": true, "helpfulness": "0/1", "author": "anthony orlando day"}, {"rating": 5.0, "review": "I purchased my first Apple TV a year ago.  Pretty much DOA out of the box.  It kept dropping the connection to iTunes.  It was impressed Tech support (US based, I think even in CA) answered the phone late Saturday afternoon, really knew his stuff, and was able to walk me through alot of different trouble shooting.  I learned many of the internet providers have a firewall system that interferes with the AppleTV, so the first thing we did was call AT&T; and reconfigure firewall setting.  BUST.  The second thing we did was try to update the hardware.  Since we couldn't connect long enough to complete the update, I had to go purchase a mini-USB cable (not included) to do a wired connection and update through iTunes.  BUST.  Keep in mind this took several weeks of troubleshooting and testing and retesting.  I was ready to throw in the towel.Tech finally suggested I had a bad unit and made an appointment for me the next day to go to the Apple store and swap it out.  The unit I received was new and had been tested by Apple and all the updates had already been installed for me.  Took it home and worked flawlessly just like I had expected it to when I first opened it several weeks prior.I will say I was very impressed with Apple's extensive service for a cheap $99 product.Over the year, my family has migrated more and more to the AppleTV and use it quite a bit.  My kids both asked for Apple TV's for Christmas, and I was able to ditch three U-Verse boxes.  With free HiDef broadcast TV, and all the options available on AppleTV, my kids are very happy.  The second and third Apple TV's I purchased worked flawlessly out of the box, have been running for over a month with moderate to heavy use and no issues.  They all connect to one iTunes account, which made setting all the parental controls super easy.My understanding is you can connect up to 8 AppleTV's to one iTunes account in one house.  I have found streaming movies lags when streaming three different AppleTV's at once, and I have 18mbps internet service.  We don't usually stream three movies at once, but I was curious to test the performance..I primarily purchased the AppleTV to manage the 2500+ mp4 movies I've collected and swapped with friends over the years.  I must admit I was not prepared for all of the extra features the AppleTV offers.The remote is not to my taste.  It's way too small and gets lost way to easily, especially with kids (- 1 star).  But any iPhone or iPad can control any AppleTV, and I can control any AppleTV from pretty much anywhere in the house, including sending live video to my kids TV's via Airplay.  (+1 star)the AppleTV remote must have a direct line of sight to the AppleTV to work.  You cannot tape it to the back of the TV and expect it to work.  It MIGHT if you have reflective walls, but you should have that expectation.  It is small, and some double sided tape worked real well mounting it to the top or bottom of some wall mounted flat screens.You can change the settings and remove icons/apps from the home screen that you don't want on there (customizable).You can set up parental controls and passwords to restrict content, compatible with MPAA ratings and US TV ratings.There is no Pandora app (yet), but we simply run Pandora from an iPhone or iPad and Airplay it to the AppleTV.", "verified": true, "helpfulness": "5/5", "author": "BEER30"}, {"rating": 5.0, "review": "It's nice playing my itunes collection on the TV with this device.  The only bad part is the price but apple products are always expensive.  You get what you pay for.", "verified": true, "helpfulness": "1/1", "author": "Arkansas Jeep Man"}]