[{"rating": 5.0, "review": "I love this product! The selection of apps that come with the iOS is great, there is something for everybody. The set up is sooooo easy and connecting to my wifi is even easier. Very intuitive and easy to use", "verified": true, "helpfulness": "0/0", "author": "Gabriel Papa"}, {"rating": 5.0, "review": "I purchased this to compliment my IPad!!  It is SUPER easy to set up and use.  I do suggest downloading the \"remote\" app from ITunes.  It is completely free!! This device allows you to see everything from your moble device on the TV.  Pictures, Videos, Music, Movies, or Games!!", "verified": true, "helpfulness": "0/0", "author": "TDavis"}, {"rating": 5.0, "review": "Gave to my son for Christmas.  He loves it for streaming a slide show from his iPhone.  Says its a lot easier than using  his X-Box", "verified": true, "helpfulness": "0/0", "author": "Donald R. Anderson"}, {"rating": 5.0, "review": "We cancelled Directv and use the Apple TV plus an antenna for our tv watching needs.  We have plenty to watch, especially since I can stream any app that plays video from my iPad.  If you are tired of spending ridiculous amounts of money for the 99% of cable channels you don't watch, consider an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Chris Feldhaus"}, {"rating": 5.0, "review": "Bought this for my stepson for Christmas.  It is a very neat product as are most Apple products.  He really enjoys it and the neat thing is he can put his computer on the tv so we can all view things together on large screen.", "verified": true, "helpfulness": "0/0", "author": "HiE4me"}, {"rating": 4.0, "review": "The only only reason why I didn't give it 5 stars is because I had to go back to the store and buy hdmi cables in order for it to connect to my tv. I thought a device like that would have come with its own cable. My lost. However after going out and buying a hdmi cables my Apple TV works beautiful. Love it", "verified": true, "helpfulness": "0/0", "author": "A. Smith \"Agent Smith\""}, {"rating": 5.0, "review": "This is something I wanted will help me save on my cable bill. I can view several different movie apps (you have to pay for Hulu).", "verified": true, "helpfulness": "0/0", "author": "Robert Manning Jr"}, {"rating": 5.0, "review": "I am a huge fan of all Apple Products.  This one is great for streaming netflix, hulu, as well as any of your itunes.", "verified": true, "helpfulness": "0/0", "author": "bwgilbr"}, {"rating": 5.0, "review": "I got Apple TV for my husband for a Christmas present.  We have thoroughly enjoyed streaming movies and pictures through Apple TV. Only hiccup we had was that our TV only had 2 hdmi slots and those were already taken by blu ray player and satellite box.  So, we had to buy a splitter to be able to hook up the Apple TV. Wasn't very expensive $10-$12 (I think) at Radio Shack. Overall we are most pleased with yet another Apple product in our household.", "verified": true, "helpfulness": "0/0", "author": "Tara"}, {"rating": 3.0, "review": "We have been using our Xbox 360 to stream Netflix for years and love it. We got this apple TV for Christmas so we could stream netflix in our room (so the Xbox can stay in the family room) and so far it is not living up to the hype. We've had a lot of problems with the streaming quality and freezing up- every time we think we've solved the issue it happens again.My husbands biggest complaint is the remote, which is very small. Tiny, in fact. It's probably 3 inches long by about an inch wide. It's very hard to keep up with.My biggest complaint is that the netflix format/commands are different from the xbox version of netflix, which is more user friendly. I suppose this could be a netflix issue, but regardless if you are like us and have both -- it can be very frustrating. There is no \"play next episode\" option or auto play 3 in a row --every time an episode ends you have to go back two menus and scroll down to select a new episode. Maybe not a problem if you are just going to watch one movie, but if you want to watch multiple episodes of a season - it's annoying.Pros: Good price for streaming device (vs. another xBox 360), some cool features like photo-synching with iPhone and ability to watch Apple Movie Trailers.", "verified": true, "helpfulness": "0/2", "author": "Amamom"}]