[{"rating": 4.0, "review": "As expected.", "verified": true, "helpfulness": "0/0", "author": "DEBRA ANN SOBIERAY"}, {"rating": 5.0, "review": "Best money I ever spent on electronics!", "verified": true, "helpfulness": "0/0", "author": "hansolo30v"}, {"rating": 4.0, "review": "I really like my apple TV. I just find it really annoying that I cannot download Amazon Prime App. I can use airplay from my phone and use it so it is fine. Still I think it is stupid Apple wont let you have amazon prime App. I get that it competes with iTunes but I am never going to cancel my prime membership for itunes.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 2.0, "review": "Always crashes and needs to be reset. I'm not as happy with is Apple product as everyone told me I would be. I wish I would have ordered the Amazon Fire stick or Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "M.B. \"Matt\""}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/0", "author": "wilmen"}, {"rating": 5.0, "review": "I tell everyone I know that buying the Apple TV II was the best 99 bucks I ever spent. And now it's down to $69!! the quality of streaming is very very impressive. I can stream directly from my iPhone, iPad and share my entire screen from my iMac! I can view all of my photos in quality giant size! It is amazing! Highly recommended, So easy to set up and use! The remote is very lick, but if you have an iPhone or iPad, then you have a SUPER remote built right in. No more point and search for letters to spell words. With the iPhone and iPad remote, you have access to a full keyboard! I am on my way this evening to buy a second one for the bedroom!", "verified": false, "helpfulness": "0/0", "author": "Jason Sumney"}, {"rating": 5.0, "review": "I honestly don't watch TV any more and subsequently save $ on cable subscriptions because of my Apple TV. I watch what I want when I want on Netflix, iTunes and YouTube. I love it and would definitely recommend it to anyone bored with their traditional viewing routine. Or those, like me, who don't watch TV for the sake of watching TV and only watch a couple of hours a day and want to make the most of it!", "verified": true, "helpfulness": "0/0", "author": "Darren Hutchison"}, {"rating": 5.0, "review": "What else can I say, it''s an Apple product.", "verified": true, "helpfulness": "0/1", "author": "David Portner"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Diteck"}, {"rating": 5.0, "review": "Exelente. .....faster delivery.thanks", "verified": true, "helpfulness": "0/0", "author": "RAUL MENDEZ"}]