[{"rating": 5.0, "review": "No need for cable!  Just need good internet and accounts for apps you want to watch (examples: Netflix and Hulu), and you're good to go!I love my Apple TV", "verified": true, "helpfulness": "1/1", "author": "Alex W"}, {"rating": 5.0, "review": "Great! Especially if you do not have Smart a  convenient way to access other applications.", "verified": true, "helpfulness": "0/0", "author": "Aj"}, {"rating": 5.0, "review": "Apple TV is my favorite. They have the best channels, and continue to add more. News, Music, Pictures, Video,  work flawlessly. Apple also has the nicest GUI.  If you have an iPad, iPhone, or macbook, this is the Best product to buy. Photo Stream, iTunes , sharing and mirroring, work amazing.I have tried Roku, Dlink, and Amazon as well.  The Amazon fire TV is also very good for some consumers because it has the voice search and can download apps.  I personally think the Apple is by far the best and nicest.", "verified": true, "helpfulness": "1/1", "author": "Joey A \"jades\""}, {"rating": 5.0, "review": "Apple device Very Excellent Working day limit", "verified": true, "helpfulness": "0/0", "author": "alghumayan"}, {"rating": 5.0, "review": "Fast delivery! Thanks! Works great!", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 3.0, "review": "It's really easy to set up but a half hour later it said I had to \"restore it\" with a microusb that I didn't have. I don't have time to go to an apple store so it was really annoying and inconvenient. Overall, I think getting a smart tv would be better.", "verified": true, "helpfulness": "1/2", "author": "Michele"}, {"rating": 5.0, "review": "If your already in the Apple eco-system, for the $ this is the best Apple product ever made.  If you have iTunes Match and a nice TV this is a must own.", "verified": true, "helpfulness": "0/0", "author": "MK \"M.K.\""}, {"rating": 5.0, "review": "It made out TV smart!  It was a gift for my husband who tells me all of the time that this was a perfect gift!  We've had it for a year and no issues at all.", "verified": true, "helpfulness": "0/0", "author": "Janice"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jasmine Bailey"}, {"rating": 1.0, "review": "....this is unfortunately going to go against Apple when it shouldn't, but we have no where to review delivery services so this is where it will go.  Whomever \"delivered\" this package put it on the ground by my mailbox.  You know, the area that is covered with all the snow that every passing snow plow pushes on to the end of my driveway.  I looked online to find out where my items were and they showed delivered.  I looked on my front porch.  I looked on my back porch.  I looked in my mailbox.  I looked by my garage.  My items were no where to be found.  Then as I dragged my trash cans in from the street, I noticed a piece of plastic peeking out of the road sludge pile of death at the end of the driveway.  After the week old ice crystals tore through my new gloves, I was able to unearth the package and discover the origin of the mysterious plastic.  My new Apple TV...buried under 2 days of salt, road sludge and snow.  Good work, delivery team.  Way to do the absolute minimum.  You should be awarded for your efforts.  I will let you know if the product works after it thaws/dries out.....", "verified": true, "helpfulness": "0/2", "author": "L. Starck"}]