[{"rating": 5.0, "review": "This is the second one I've bought.  My first one was given to me as a gift and now i buy them as gifts.  I love apple tv!", "verified": true, "helpfulness": "0/2", "author": "Rachel D. Sheedy"}, {"rating": 4.0, "review": "Love it. Giving it 4 stars instead of 5 because it is NOT compatible with Amazon Prime. Other than that I am enjoying the heck out of the viewing freedom it provides.", "verified": true, "helpfulness": "0/0", "author": "jammiesxo"}, {"rating": 1.0, "review": "I have to pay for everything on it to view it. It's not at all what I expected.  Wanted to return but did not get a invoice.", "verified": true, "helpfulness": "0/14", "author": "Pamela A. Heins \"Pam Heins\""}, {"rating": 5.0, "review": "finally 1080 so that is a plus and it does the job.  I like this a lot and i use it for streaming music mostly.", "verified": true, "helpfulness": "0/0", "author": "Jewski32"}, {"rating": 5.0, "review": "I choosed this rating because it is a great way to watch lots of good things.Also I love it:)!!!!!!!!I recommend it because it is a great way you can rent and watch whatever you want.", "verified": false, "helpfulness": "0/0", "author": "Hassan"}, {"rating": 4.0, "review": "Easy to set up, but at times it if difficult to get the link started between the iPad and Apple TV device.  Once it gets going it is very good.", "verified": true, "helpfulness": "0/0", "author": "Stephen P Wing"}, {"rating": 5.0, "review": "Like my iPhone and iPad, this works very, very well.  Intuitive navigation, was easy to connect and synchs with all my mobile devices and the library on my pc.", "verified": true, "helpfulness": "0/0", "author": "WA.Husker"}, {"rating": 3.0, "review": "I was hoping it will work easier and will do more. I am little disappointed. My son has think from google and it cost 1/4 and works better with all computers and phones. Well I am stuck with it.", "verified": true, "helpfulness": "0/4", "author": "Alex Blahnik"}, {"rating": 5.0, "review": "I am highly satisfied with my purchase! It's easy to set up a total joy to use! I love it!", "verified": true, "helpfulness": "5/50", "author": "Ikey G"}, {"rating": 4.0, "review": "I really like this Apple tv just wish it had more app like the ruku does and a usb in the back", "verified": true, "helpfulness": "0/0", "author": "Jamie McIntosh"}]