[{"rating": 5.0, "review": "This product is wonderful, especially with the addition of the HULU Plus option. I barely even watch cable anymore! Make sure you purchase the HD chord along with the Apple TV. I also love that I can listen to my iTunes library from my television.", "verified": true, "helpfulness": "0/0", "author": "louannalorette"}, {"rating": 4.0, "review": "Easy to set-up and easy to use, I like my Apple TV. Best of all, I can now watch Netflix Streaming movies from my bed.", "verified": true, "helpfulness": "0/0", "author": "Sharpster"}, {"rating": 5.0, "review": "I own this Apple TV v3, and I own a Roku LT.  Both are great devices, with similar function.The Roku works great for Netflix and Pandora.  I love both of those services, and Roku delivers.  Roku is also expandable - there are hundreds of other \"channels\".  But in general all those other Roku channels stink.  Sorry \"other channel\" guys (including you, huge online retail store named after a south american river).The Apple TV is a little more closed, but what it provides is excellent.  I can still use Netflix with the Apple TV, and plus I can stream all my music, movies, and  TV shows to the device with nearly zero setup.  \"It just works\" is very true.  I also love the wireless remote display capability - it is easy to \"stream\" my Mac's display, or my iPhone display, or my iPad display to my TV.  Again, it just works.  Roku?  I do technical work all day for my job.  I don't also want to do it all night at my house.In all, I love both Apple TV and Roku.  Roku is now on the back burner due to the great features of the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Larns"}, {"rating": 5.0, "review": "As always Apple does it right.  Sleek, good looking, easy to hook up ( if you have a newer TV) and intuitive if you have used Apple privets before.", "verified": true, "helpfulness": "0/0", "author": "Barinr"}, {"rating": 4.0, "review": "I own an apple tv and a roku. Both have their strong and weak points.Apple TVPro:Airplay musicEasy to usePhoto Stream from your iPhoneYouTubeCon:Can't Mirror Play older macs or iPhonesNo ability to add appsRemote must be aimed at the apple tv (unlike roku)Overall, I would recommend Apple TV if you would like to Airplay/Mirror Play with your Apple devices.", "verified": true, "helpfulness": "1/1", "author": "lkwaugh"}, {"rating": 5.0, "review": "We are very pleased with our new Apple TV and all of the alternatives it gives us. Can't  recommend it enough.", "verified": true, "helpfulness": "0/0", "author": "srrogers50"}, {"rating": 1.0, "review": "The Apple TV MD199LL/A seems to be a great little unit, but I'm posting to warn potential buyers who have older TVs.  My TV is a 62\", rear-projection, DLP with a fantastic HD picture and HDMI inputs (Toshiba 62HMX84), but WHAT my TV is really doesn't matter.  What does matter is when it was manufactured.  When some of my content wouldn't play with an error about HDCP, I did some digging and found that in 2004, the HDCP standards (copy protection for HD shows/movies) were put in place (my TV is HD, but not HDCP compliant).When you use your AppleTV to play Netflix, Movie Previews, HD movies or TV you purchased from iTunes, they all require HDCP or you will get an error message on your screen and cannot watch them.  If you search for an answer, a lot of people will tell you to power off and power on both the AppleTV (or other HDMI device) and the TV...and this will work for some people, but if your TV is a little older, it may not be compatible at all.I didn't know I had this issue for a long time because my HD TiVO has component outputs that go to the TV (instead of HDMI) and Netflix will play fine HD from the TiVO, but this AppleTV has ONLY HDMI.I love the AppleTV and I'm going to keep it, but I can only play movies that are standard definition from iTunes, home-made movies or that I have ripped from DVD (removes copy protection as part of the process).  I will have to wait until I upgrade my TV to enjoy most of the other features of the AppleTV (renting movies from iTunes, Netflix, Previews, etc).  If you have nothing but time on your hands, I've also read that you can remove the protection from iTunes downloaded HD material, but you still can't get around the streaming content like Netflix or iTunes movie rental.", "verified": true, "helpfulness": "9/20", "author": "Brian"}, {"rating": 5.0, "review": "This fits into my apple household seamlessly. I love that I stream my movies/music right off my iTunes and on to my TV in HD. I do not pay for HD cable, but the second I power up my Apple TV i get instant HD access to all of my owned content plus some extras.It's a great little box and I hope in the future they expand its capabilities because it really could be much more. That said, it works excellently and without flaws.", "verified": true, "helpfulness": "1/1", "author": "Christopher J. Livengood \"Christopera\""}, {"rating": 5.0, "review": "I really didnt need this product, but i love all \"apple\" product XD $100 is not bad a all. it has a HDMI hook up and the picture looks great!!", "verified": true, "helpfulness": "0/0", "author": "djspookay"}, {"rating": 5.0, "review": "It works very fast, amazing compression from iTunes movies, and Netflix works perfect too, YouTube software is a little uncomfortable but works fine.  I'm happy with it :-)", "verified": true, "helpfulness": "0/0", "author": "Albert"}]