[{"rating": 5.0, "review": "I have one for every room in the house - everything we watch comes over the internet to my TV via the Apple TV. My life wouldn't be the same without it!", "verified": true, "helpfulness": "0/0", "author": "Landon J. Harris"}, {"rating": 2.0, "review": "I'm sorry if I put anything else from I love this Apple TV so much that I now get any gospel music and comedians from my country any time I want. I'm even planning to buy another one as a gift to my son soon and I hope to get it with the same price or lessThank so much n may God bless all of you in the amazon businessMilcah Nduati", "verified": true, "helpfulness": "0/1", "author": "Milcah Nduati"}, {"rating": 5.0, "review": "This small piece of technology enabled me to share whatever photo, video or webpage in my iphone 4s, ipad 2, or MacBook Air with my family. It's amazing how it works on its own with all the devices connected to my home network without any installation whatsoever. I have 4 Apple TV 3rd Generation installed at home in 4 different rooms, and whenever I click on AirPlay icon I instantly get the list of four rooms to choose from. It's just like magic!", "verified": true, "helpfulness": "0/0", "author": "Haider Sahib"}, {"rating": 5.0, "review": "The only real question is if it actually does all the things it claims to do. It does!  Easy to set up. Nice on screen interface. Mirrored my iPhone and my iPad beautifully to my TV. Found my PC computer on my network and I played my iTunes library through my TVs attached sound system. Great little toy. Pod casts and movies are my next venture.", "verified": true, "helpfulness": "0/0", "author": "Voice of Reason"}, {"rating": 5.0, "review": "Lo uso en Costa Rica para ver netflix y trabaja perfectamente, como todos los productos Apple excede  las expectativas y tiene la ventaja de que trabaja perfectamente en Latinoamerica", "verified": true, "helpfulness": "0/1", "author": "Victor Cruz"}, {"rating": 5.0, "review": "EL PRODUCTO SI ME GUSTO ES NUEVO Y EXCELENTE NO TENGO NINGUNA QUEJA SOBRE EL PRODUCTO MUCHA GRACIAS POR VENDERME EL PRODUCTO", "verified": true, "helpfulness": "0/1", "author": "FRANCISCO SIMANCAS"}, {"rating": 4.0, "review": "My kids loved this product!  Said it was the best gift they received.  They were able to plug it in and use it immediately.Of course, it helped that they had a hdmi cord available for immediate use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Netflix, Hulu+, and iTunes is all really need to have all the content you want at your figure tips with this awesome device!", "verified": false, "helpfulness": "0/0", "author": "Drew"}, {"rating": 5.0, "review": "Does what it's supposed to. So far we are very happy with it but we have only used it with movies from the computer", "verified": true, "helpfulness": "0/0", "author": "Naggy"}, {"rating": 4.0, "review": "This is a cool item to have for TV shows and movies. You need to have a good internet connection (fast) though. The Itunes rentals are too expensive also, but it's a good product.", "verified": true, "helpfulness": "0/0", "author": "James Svoboda"}]