[{"rating": 5.0, "review": "Why choose this rating - The product is EXcellentWhat did you dislike - NothingTo whom would you recommend this product - Anyone interested", "verified": true, "helpfulness": "0/1", "author": "Robert G. Buice"}, {"rating": 5.0, "review": "Have four. Best thing since the DVR was invented! Have Apple everything, including IPhone 5, which is the only thing I use more than the Apple TV. It's amazing! Get it you won't be sorry.", "verified": false, "helpfulness": "0/1", "author": "gregg"}, {"rating": 5.0, "review": "Great user interface and price for an apple product. Very easy to set up and to use. I love it!", "verified": true, "helpfulness": "0/0", "author": "W. Wilson \"Jamminmon\""}, {"rating": 5.0, "review": "Version three works for me.  The installation is Straight-forward; just power and HDMI is all we need.  The remote is not sophisticated, but works well enough.", "verified": true, "helpfulness": "0/0", "author": "R. Knapp"}, {"rating": 5.0, "review": "fast, HD, airplay, nice looking, good quality.fast, HD, airplay, nice looking, good quality.fast, HD, airplay, nice looking, good quality.", "verified": true, "helpfulness": "0/2", "author": "A. Zou"}, {"rating": 3.0, "review": "The display is fairly easy to use. But the directions for using the device are skimpy.  I believe this is the \"Apple way\" where users are expected to somehow \"discover\" the various functions and devices, instead of providing instructions.  As with my iPad, there are many, many functions that exist, but one usually only finds them when a friend points them out.  This appears to apply to the Apple TV.In addition, if I want to stop a video and try to start it up again, I get an error message every time.  It requires me to \"try again later,\" which may require me to wait a full 24 hours to get back to the video.  I also find the remote to be, as usual, unclear.  The information on the buttons is not at useful or intuitive and they make no sense at all.  The buttons also don't work consistently and I often have to push one or more buttons many times before something happens on the screen.", "verified": true, "helpfulness": "0/0", "author": "Kim Schopmeyer"}, {"rating": 3.0, "review": "Not being a techie, I am unable to understand how to use the box.  The instructions that came with it are anything but helpful. One could put the directons on a 4x5 file card!  When I stream movies from my MacbookPro, the go to my big screen over a wire and I don't have to go through the \"enter password\" process every time I use it.Save yourself a $100.00 and get a wire from  your computer and enjoy the same experience the box might provide, if you knew how to use it.", "verified": true, "helpfulness": "0/0", "author": "Jack Gire"}, {"rating": 4.0, "review": "Apple just needs to cozy up with Bezos over at Amazon and get the Amazon video on this device!  Then, it will be perfect!", "verified": true, "helpfulness": "3/4", "author": "Matthew Hinman"}, {"rating": 5.0, "review": "Does exactly what it's supposed to do.PROS:- Works out of the box, minimum effort to setup.- Great integration to my Apple ecosystem (iTunes, iPhone, iPad, Macmini, TimeCapsule).- Small, Easy to conceal behind the TV.CONS:- Needs more channels (Crackle, Amazon Instant Video, HBO GO, etc)", "verified": true, "helpfulness": "0/0", "author": "J. Rojas"}, {"rating": 3.0, "review": "I like the idea of this device, and if I could get it to do everything they say it will, I would love it.Problem is, I can't get it to work consistently.  I have it hooked up to my home network - wired not wireless -  with a cable modem connection.I've tried to use it for Netflix movies as well as streaming video from other apple computers over the network.As far as Netflix goes, most of the time it works great. However sometimes it just doesn't want to download my netflix movie or it just drops the movie in the middle.Another annoying thing, Apple updates the software and one time when they did it, some of the netflix features were missing, including access to my instant queue.  The next week or so that came back.  I suspect Apple wants you to use it's Itunes store rather than Netflix, so they make it a little inconvenient.I tried to get some movies to stream from my apple desktop machine, but I haven't been able to make that happen either very well. I got it to work once, but haven't gotten it to work again.One interesting feature is being able to show content from an Iphone or an Ipad.  We had several folks at once showing videos one after another one day - that worked great.Customer service: After about six months, the remote control quit working.  This thing is useless without the remote - it's a brick.  You can't turn it on, you can't do anything with it.I had to make an appointment at the Apple store, then wait in line for my appointment, only to find that nobody in the store seemed to know much about Apple TV.  They took the batteries out of the remote on one of their display units, and since the remote seemed to make the lights on the Apple TV blink, they said I needed to buy a new remote battery (they didn't give me one)...  So I took it home, put new battery in the remote and of course it still did nothing.  Back to the Apple store - where after another hour of waiting they finally found a new remote control for me.  It was an excruciating wait for a $99 device to get fixed.  It would have been cheaper just to buy a new one.  It did work fine after the new remote.I hope they get the glitches fixed.  As I said, I like the device, I just wish I could get it work more consistently.", "verified": false, "helpfulness": "0/0", "author": "E. Redifer"}]