[{"rating": 5.0, "review": "Let me just cut right to the chase...If you are an Apple/Mac household, GET THIS.I did all sorts of online research. I went back and forth to the local electronics stores to look at streaming devices in person. And I listened to everyone I know give their opinion. In the end, most people leaned toward the Roku. Needless to say, I didn't go that route, and am happy that I didn't. Sure, Roku offers a zillion more channels, but how many of those are you actually going to watch? The majority seemed like infomercials disguised as channels. I'm a firm believer in trimming the fat. I liked the fact that Apple TV had less channels.I REALLY liked the fact that the channels Apple TV had were well known channels that I actually had an interest in.And then I got into Game of Thrones.I say this because we don't have premium cable channels. BUT, Apple TV offers HBO Now, which you can subscribe to a month at a time. There's even a 30 day free trial. You can get all your Game of Thrones fix without having to buy an expensive cable TV package with a bunch of stuff you're not gonna watch.And finally, the biggest selling point, is that anything you get on your iPhone, iPad, etc...you can pull up with Apple TV. No need for the expensive Apple adapter either. You can just stream it. There's two options you have: Airplay and/or Mirroring. With either one, you can get whatever you're watching on your Mac mobile device on your TV...including Amazon TV! You can even get a free app that lets you tuen your iPhone into a remote!Technically speaking, the device is typical Apple. Plain and simple. Just plug it in to an electrical outlet, hdmi it to your TV, and connect wirelessly to wifi, and you're good to go (You can also connect direct to your router, but we have zero issues with WIFI on a big room).Apple TV really is a no brainer for those of us that are invested in the Apple world. Don't have Apple products? This review may not be for you.", "verified": false, "helpfulness": "6/6", "author": "Daddy Anarchy \"Daddy Anarchy\""}, {"rating": 5.0, "review": "Perfect if you have apple devices. Easy to use, air play mirroring is great , I should bought this long time ago.", "verified": false, "helpfulness": "0/1", "author": "Susan Gonzales"}, {"rating": 5.0, "review": "Love the Apple TV is works so well with our other apple products. We have a couple through the house. Definitely worth it!!", "verified": true, "helpfulness": "1/2", "author": "Justin Ray"}, {"rating": 5.0, "review": "worked great!", "verified": true, "helpfulness": "0/1", "author": "Kate"}, {"rating": 5.0, "review": "This is my second one.  Love first one.  I bought a second Apple TV to take along in the rv.  You can watch all my pay for TV channels while on the road.", "verified": true, "helpfulness": "0/1", "author": "Brian Hanley"}, {"rating": 5.0, "review": "Skip the HDMI bundle nonsense.  Get this model if you are going to get one.Excellent build quality. The remote control is very sleek.It has to be the best looking remote control ever, but the also the easiest one to lose inside your couch.The good news is you can program any universal remote or your home theater remote to work with Apple TV.Comparing this to Roku.  You may get a little more value out of that.Roku has a headphone jack.You can watch TV without disturbing anyone else in the room.Roku also has more apps than Apple TVApple TV is missing out some of the more important ones like Pandora, Crackle and Amazon Instant.I also have Chromecast, which I no longer use.  Chromecast is lesser quality option for Android users. It provides no remote or on-screen apps, thus rendering useless for most average consumers.Apple TV fits better with your iOS and Apple environment.It has Podcasts, and you can do Airplay, PhotoStream from iCloud and all that good stuff.Playing games on AirPlay seems like a gimmick.My wifi has pretty good speed, but games looked like crap when I tried them via AirPlay.All in all, good value now after the price cut at $70.The buy appeal to me was the beautiful design and quality. It looks and feels very premium.  I saw this at my friend's house who had both of this and Roku.Apple TV really needs to get Pandora, Crackle and Amazon as native apps, even though you can make most things work with AirPlay.", "verified": false, "helpfulness": "0/1", "author": "Mike Rand"}, {"rating": 5.0, "review": "Have Apple TV and latest rocku.. Apple TV works great...much easier to set up than roku...I do like roku...but better picture with very little buffering and air play make Apple TV the winner over roku", "verified": true, "helpfulness": "1/2", "author": "Joseph D. Vece"}, {"rating": 5.0, "review": "Delivered on time and works as expected", "verified": true, "helpfulness": "0/1", "author": "Fahd Mujawar"}, {"rating": 5.0, "review": "Great deal.", "verified": true, "helpfulness": "0/1", "author": "Jed Mark Nilson"}, {"rating": 5.0, "review": "Apple TV is simple to use right out of the box and allows me to AirPlay from all my apple devices in just seconds. It made watching shows and movies from my phone a breeze. I highly recommend it to anyone who has Apple products they enjoying watching TV shows and movies on.", "verified": true, "helpfulness": "0/0", "author": "Alvina Mountain"}]