[{"rating": 5.0, "review": "perfect for apple fans who have everything apple.The air play is awesome to use, either from a mac, a iphone or a ipad.", "verified": true, "helpfulness": "0/0", "author": "niu xiaoxu"}, {"rating": 5.0, "review": "I bought this as a gift. They love it so i gave it 5 stars. It was easy to use.", "verified": true, "helpfulness": "0/0", "author": "sexy739"}, {"rating": 5.0, "review": "Works great.  Easy connection.  Walks you thru set up quite nicely.  Many options available once you set up so take the time to check it all out.", "verified": true, "helpfulness": "0/0", "author": "Mountain Refuge"}, {"rating": 1.0, "review": "I have been an apple fan boy for a few years. Everything, my work computer is an Macbook pro, personal is an Air, Ipad 2, iphone 4sm wife has an iphone 4. So when I decided to upgrade my ROKU (only 720P) I went right to the apple store and bought two Apple TV's. Man I was stoked thinking how cool it would be to share my screen on my apple tv, listen to my itunes on my Apple TV and even though I am a Prime member - itunes movies will work right sure they cost a buck more than Amazon - but its an apple right.Boy was I wrong.My macbooks were both refurbs so even though they are less than a year old running the newest OS I cannot share my screen on my Apple TV - only macbooks purchased in the past year can do that. The guy at the store told me no pandora, hbo go or Amazon Prime - but the trick was to run them on the ipad and screen share on the apple TV. Fat chance - apple blocks those sites.As for itunes and listening to music - only if you spend $25 a year to push your music to the cloud and renting Videos from itunes - HAThere is a bug that everyone on the apple site is complaining about which cause the movie to crash every 2-20 minutes. So a 2 hour movie requires 30-45 resets.Steve Jobs is dead and so is Apple - new Roku on the way, next phone will be a Samsung and what is all this I hear about Windows 8?", "verified": false, "helpfulness": "19/38", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very solid construction, its nice that apple puts thought into making a well built product even if it isn't meant to be moved around much. This has actually been really useful as someone who's on the move a lot, its my go to carry around netflix box. Airplay works well, but be aware that even on a good router system the streaming can stutter or require more than the initial buffering. These things being said, my initial concern with the apple tv was that it didn't do a lot on its own. However, the box is mostly designed to be an accessory to the apple ecosystem, so with the introduction of itunes match, screen mirroring etc. the utility of the device has improved. This of course means that if you're looking for a standalone box that does the streaming stuff on the big screen, its probably more worth your money to get a roku box, or an xbox both of which do the same things as the apple tv and more. If you're pretty invested in the apple ecosystem however, this box is extremely worth it because it's a quick and effortless way to get all your content onto the big screen.Weird things to note:Optical audio out doesn't work with netflix for some reason.Remote is small and easy to lose.Recommended that you get a sound system for your tv... the speakers on most tvs aren't great and with such an audio/video centered device, this is a big letdown. So not the fault of the box, but definitely something to watch out for.", "verified": false, "helpfulness": "0/0", "author": "M. Xu"}, {"rating": 3.0, "review": "The rating is based on fact HBO GO, Amazon Video, as well as others can't be streamed by Air Play.  If Air Play could be used,  this product would get a 5 star rating.", "verified": true, "helpfulness": "0/1", "author": "Wildhair36"}, {"rating": 2.0, "review": "I bought one as a present and ended up buying one for myself as well.I was mostly won over by Airplay integration and figured the default apps would be a nice add-on.I come to find out that Pandora is missing and you can't control the volume on Netflix or any Home Sharing or any other way besides streaming a song via your iphone.Pretty disappointed.I will be either taking it back or installing Plex on it if a Jailbreak becomes available soon.", "verified": true, "helpfulness": "0/2", "author": "ASC"}, {"rating": 4.0, "review": "is very nice out of the box, is very easy to setup but ones you are using it you will like to have more options like amazon instand video, Hulu.......", "verified": true, "helpfulness": "0/0", "author": "Manuel Compres"}, {"rating": 5.0, "review": "Wonderful product that my son wanted for the holidays. This will be a gift that should surprise him and I know he will enjoy.", "verified": true, "helpfulness": "0/0", "author": "Gil"}, {"rating": 3.0, "review": "Just wanted to let pc buyers interested in purchasing apple tv know that you can stream wirelessly from itunes, but you will not be able to mirror your pc. Only ios devices can.", "verified": true, "helpfulness": "4/6", "author": "cmosha"}]