[{"rating": 5.0, "review": "It is the neatest little Apple product I have seen yet. Very user friendly. Your other apple products will immediately recognize the Appletv and will offer to Airplay your pics, videos, you can pretty much do everything on your TV that you do on your iphone/Mac/ipad. Also has YouTube and Netflix available so my husband and I no longer have to fight over the PlayStation ;) Honestly I am not an Apple fanatic and I am very leery of the Apple takeover but when its good its good and for the price it is nothing for what it offers. BUY IT", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For me, it was between this and the latest greatest Roku. I have gotten two of these for family members who use other apple products, and it's great. The Airplay on Apple TV is a HUGE advantage. But it is sorely missing Amazon. Why can't you play nice, Apple?For myself, I got the Roku. Having Amazon Prime instant video is just too important.Overall, I like the interface better on the Apple TV. But the greater freedom in terms of channels/apps on the Roku was a clear victory in my book. Both are excellent.", "verified": true, "helpfulness": "0/0", "author": "overly critical"}, {"rating": 5.0, "review": "I do  not have satellite or cable tv service.  This is a good answer to more variety in tv programs.  I get good reception with my internet service.The only additional expense I have incurred is a subscription to Netflix.", "verified": true, "helpfulness": "0/0", "author": "Shirley"}, {"rating": 2.0, "review": "I have a Roku (newest), Apple TV (this one), and old models of each.  I am disappointed with the trajectory of latest Apple TV.  It functions poorly in comparison to Roku (IMHO).Problems:* In my experience, Airplay tends to not work with audio or video.  Apple TV abruptly disconnects from MBP with iTunes radio.  It abruptly disconnects from iPad with an internet video.  Getting Airplay to work is an arduous process of (re-)connecting and (re-)typing Airplay code.  Otherwise, Airplay is susceptible to (more) public use.* No amazon prime videos (obviously)Common Problems (Roku and Apple TV):* Must have a cable account to connect to some networks, like Showtime and HBO, which is what I wish to avoid in first place.* Hulu has commercials.  (I hate commercials.)Positives:* Video on demand (100+ Episodes of Scrubs with Netflix!)* Unhook from cable and retain many benefits, even some sports (like highlights).* Connect in new ways to some networks.", "verified": false, "helpfulness": "0/1", "author": "fg"}, {"rating": 5.0, "review": "If you have an i-pad you got get one of these.  Air play is cool.  I bought it so I could the NHL Game Center.  That works great too!  A lot of bang for the buck and I am no techie either.", "verified": true, "helpfulness": "0/0", "author": "Wingnut"}, {"rating": 5.0, "review": "Just awesome, especially due to the fact that you can mirror your devices to your TV. We play our music from our iphones through our TV speakers and it's seamless. All of our movies that we've purchased are viewed from \"the cloud\". No storage problems for our laptops.", "verified": true, "helpfulness": "0/0", "author": "Brayne"}, {"rating": 4.0, "review": "I love apple, I really do. They kind of push it \"too far\" sometimes, this is in fact one of those times.The build is amazing, and the remote is a uni-body design of aluminum.. pretty cool.The only thing I hate is that the software in apps such as Hulu and Netflix, which I bought it solely for the purpose of streaming, are skinned the way APPLE WANTS IT. It's annoying because everything is like this. It's unlike every other streaming device, like xBoxes, Ps3's, iPads, iPhones, Smart TV's, BluRay Players, etc. So with this, you don't get some features other devices get since it's not the Netflix/Hulu experience that you get on EVERY OTHER DEVICE. For example, the special profile's for each user(Netflix), not there. The \"Max\" service on Netflix, again, not there.I hope in a near future update they make the 3rd Party apps the way EVERY OTHER device uses it.Besides that huge con, the device is amazing. It also learns any remote so you can use one remote for everything! Pretty awesome device, just one huge flaw in my point of view.(By the way I'm not hating on Apple. I've been using them since 2010. - iPhone 4, iPad Mini, Macbook)", "verified": true, "helpfulness": "0/0", "author": "Christian Enright"}, {"rating": 5.0, "review": "With so much available and viewable on apple tv, it can practically replace your cable subscription.  Its so easy to use/set up, even a monkey could do it.Best way to utilize all of its capabilities is to use it in conjunction with your ipad. You can view almost everything on your ipad through mirroring.", "verified": true, "helpfulness": "0/0", "author": "Kate Maguire"}, {"rating": 4.0, "review": "I own a lot of Apple products and like being in the Apple ecosystem (itunes, iTunes Match, iBooks and so on).  I think the Apple TV is a near perfect streamer but I'm giving it 4 stars for only one reason: I cannot play music from it and to an airport express at the same time.  More on this later...-Why I got this?I wanted the Apple TV to be able to play music, and watch TV shows (i'm a cord cutter so I pay for a show or two here and there).  I also have speakers in multiple rooms in the house and wanted the ability to play music to multiple rooms simultaneously.  I had two airport expresses prior to the Apple TV.-How does it work?The user interface is smooth, well-implemented and works well.  Beyond iTunes, you also have access to Netflix, HBOGo, PBS, YouTube and a myriad of other services.  It's also nice to be able to show videos and photos shot on my iPhone on the AppleTV.  The Netflix app is one of the best I've seen.The Apple TV can also work with a bluetooth keyboard making it easy to search for content on Netflix, YouTube etc.It would be nice to be able to plug-in an external drive to play content, but Apple does not allow you to do so.  That's ok though as most people don't spend a ton of time ripping their CDs and DVDs anymore.  If you do have a large music collection and want access to it, just get iTunes match for $25/yr.  You'll have all your music up in the cloud and will have access to it on all your devices.  It would be to be nice to be able to store music on a connected external drive as I have kids and one of their hobbies is dragging DVDs on the floor to create deep grooves.  It would be nice, but it's not a deal breaker.-Areas of Improvement1) It would be nice if the next episode will be automatically queued up when watching netflix.  The family got a bit spoiled with this feature on our Sony Blu Ray player.  Again, not a deal breaker2) While the Apple TV has airplay, you can only use the AppleTV to play audio to one output at a time.  This is maddening.  I have to have a computer open with iTunes running to play music to two rooms in the house.  This is one area where I find the apple tv lacking.  It wants to be my media hub and I want it to be, but my computer still needs to be in the mix for me to use it as such.  While this also is not a deal breaker, it is a problem I hope Apple will remedy.-The Bottom Line:The Apple TV is a great streaming device.  It's everything you expect from an Apple product: It's elegant, reliable and easy to use.  It has some areas of improvement, but none of them are deal breakers.", "verified": false, "helpfulness": "0/0", "author": "Ali"}, {"rating": 5.0, "review": "My kids use this more than I do...... It is fun impressing them by using my iPad to throw pics and videos up on the big tv. My netflix and Hulu accounts interfaced seamlessly as well.", "verified": true, "helpfulness": "0/0", "author": "lugnut"}]