[{"rating": 5.0, "review": "Great buy. Wish it came with hdmi cable.", "verified": true, "helpfulness": "0/0", "author": "robert watson"}, {"rating": 1.0, "review": "I was originally attracted to the Apple TV because of its features like its mirroring comparability with the iphone and ipad. I also think photostream is really cool. Its pretty cool to have a collection of photo's scrolling on your TV.The worst problem with apple TV is that nothing works. The apple TV loads media slower than every other device I have used EVER! My computer, phone, Ipad, other tablet, Xbox, and fire TV all load videos way faster than the apple TV. Ironically enough the Netflix app works better than apple content on the appe TV than movies purchased from apple. however the Netflix app is still glitchy and slower than it should be. The apple TV actually struggles just to play music. It cant even play iTunes music without lagging so much its not worth listening too.The apple TV comes with roughly 25 apps and doesn't have the ability to get anymore. So if your not satisfied that's too bad because it's that limited.Photostream is very cool in thought but it works just like everything else on the apple TV, crappy. I had about 100 photo's loaded into my photostream but only about 30 came up on my tv looking at 30 photo's over and over again gets old fast. I looked on apple's website about this and it said something to the effect of the device may not be able to display all of your photos due to storage limitations.In comparison to other devices Apple TV is hands down the worst. If you are interested in the features buy another device that works. I've used Chromecast. its supports less apps than apple TV but it works every time. The fire TV is superior to the apple TV in every way. It works flawlessly and has more apps.Apple I would like my money back.", "verified": false, "helpfulness": "0/2", "author": "Duffy"}, {"rating": 5.0, "review": "great product and cheaper than other websites", "verified": true, "helpfulness": "0/0", "author": "Areida Foskey \"rita4u\""}, {"rating": 5.0, "review": "Since I do not have a smart TV, then this device allows me to get netflex", "verified": true, "helpfulness": "0/0", "author": "Charles E. Townsend \"cet1st\""}, {"rating": 5.0, "review": "Very easy to use. Just update the software first before use and you will have no problems. My update was about 4 hours. Could of been because of intermittent connectivity. Apple TV is great, all my devices from Apple were able to connect with no issue.", "verified": true, "helpfulness": "0/0", "author": "TEXAS"}, {"rating": 4.0, "review": "It works", "verified": true, "helpfulness": "0/1", "author": "C. alvarez"}, {"rating": 4.0, "review": "We love this product! In fact since we bought ours, we bought one each for our two boys! We just bought a smart tv so I moved it to the bedroom. So easy to hook up, I did it myself.", "verified": true, "helpfulness": "0/0", "author": "Joanne"}, {"rating": 3.0, "review": "I purchased this APPLE TV unit to complement a second television in the bedroom. I mostly use it to mirror my Apple devices onto the television, occasionally listen to radio stations with it at night. The only issue with Apple TV. is content. If you want to subscribe to additional services Netflix etc. that's fine, but as an alternative to cable /satellite broadcast, I have to pass. APPLE needs to develop it more.  SKY NEWS is probably one of the more exciting additions recently, the ability to mirror content wirelessly from my Macbook Pro and iPhone is the primary reason for purchasing.", "verified": true, "helpfulness": "0/0", "author": "John J.  Burnetski"}, {"rating": 5.0, "review": "Excellence", "verified": true, "helpfulness": "1/1", "author": "FHILBES DARIBELTO PIMENTEL"}, {"rating": 5.0, "review": "What can I say. It works great.", "verified": true, "helpfulness": "0/0", "author": "Bladeharvest \"Bladeharvest\""}]