[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Paul Ross"}, {"rating": 1.0, "review": "Not very happy with this product. Everything is up to date as far as software goes and I have hardwired it in still buffers anything I stream, and when connected to airplay it slows/stops my internet connection. I'm regretting buying this apple product.", "verified": true, "helpfulness": "0/0", "author": "Rory"}, {"rating": 1.0, "review": "BE PREPARED FOR A HEADACHE.  I worked with apple support, my internet service provider, and my router company.  I own a motorola surfboard modem, and a Linksys E1000n router.  After opening the necessary ports on the router as recommended by apple support (https://support.apple.com/en-us/ht201733) the device still would not connect to the internet.  If you have this combination of equipment be warned that this might not work for you.", "verified": true, "helpfulness": "0/0", "author": "Tony Gregg"}, {"rating": 5.0, "review": "I have a TV  and BlueRay Player that can access Netflix and other applications.  I found that this device works much better and streams faster than  both of them.", "verified": true, "helpfulness": "0/0", "author": "rontwo1964"}, {"rating": 4.0, "review": "One of the better entertainment boxes out there. Easy to navigate menu and works pretty much out of the box. Line of site needed to control box with supplied remote. Work great with Remote app. No HDMI cable included.", "verified": true, "helpfulness": "0/0", "author": "Scotty"}, {"rating": 5.0, "review": "I don't know what I would do without my Apple TVs.", "verified": true, "helpfulness": "0/0", "author": "Nicolas"}, {"rating": 5.0, "review": "nice equipment.", "verified": true, "helpfulness": "1/1", "author": "Harry Gonzalez"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Gavin"}, {"rating": 5.0, "review": "This is the best media device ever made. I only wish they allowed 3rd party apps because there are cases where AirPlay doesn't make as much sense as a native app would.", "verified": true, "helpfulness": "0/0", "author": "parker"}, {"rating": 5.0, "review": "I got these to stream Netflix.  By far, they do this better than any other device for televisions other than a computer.  Sorry, I realize that likely is a function of what Netflix develops but that doesnt matter to me.They work.  They don't crash.  They don't frustrate me.", "verified": true, "helpfulness": "0/0", "author": "Weldon S. Godfrey III"}]