[{"rating": 5.0, "review": "Love this so I can watch my digital copies and Netflix!", "verified": true, "helpfulness": "0/0", "author": "babyweedah"}, {"rating": 3.0, "review": "It does what it says it does though with lots of getting used to as it is pretty buggy. I got this because I want to mirror the videos I watch on my iPad and Apple TV is the easiest way. Note that I am on iPad Air 1st gen connecting via AirPlay to a Samsung LED HDTV.E.g.1) I cannot play or pause video from the lock screen, it will disconnect AirPlay.E.g. 2) I cannot play a video on my iPad THEN connect to AirPlay, it refuses to connect when I do that.E.g. 3) After a few AirPlay connections, nothing will show on my TV screen until I play a video, that is to say that it does not mirror my screen except for when a video is playing. To solve this, I need to reset my iPad.E.g. 4) Apple TV remote doesnt work for any videos that I mirror, not sure whether it is a bug or that is how it is.Overall if you want to use it to stream stuff, get chrome cast. It's about $30 cheaper! If you want to mirror on iPad/iPhone like I do, then Apple TV is the way to go. BUT, if you want to mirror via Macbook then get adaptors, they are on ebay for dirt cheap. Works for my Macbook from 2007.IMPORTANT: If you see an apple on the screen and a bar below it, let it download the updates. If not you would have to update it via itunes and if you do not have the latest itunes (due to an old computer) then you need to go to an Apple store to get them to help you. Also, the micro usb cable that is required to connect to the Apple TV works through trial and error. I've tried a micro usb cable that I used for charging phones and one that is used for my external hdd and both doesn't work. However the one that I used to charge my xbox mic works. So thank goodness. Apple should provide the cable instead of making people buy their overpriced cables >:-(Speaking of xbox, the netflix app on Apple TV is worst than that of the xbox. The navigation is bad and inconvenient as you have go back out each episode to go to the next instead of it auto leading you to the next one.Im glad I bought this at $69 and not when it is $99. DEFINITELY not worth the full price.", "verified": false, "helpfulness": "1/1", "author": "Reeane"}, {"rating": 5.0, "review": "Love it!! Works great...easy streaming!!", "verified": true, "helpfulness": "0/0", "author": "Jade Cantey"}, {"rating": 5.0, "review": "Does what's expected! Cool to connect to with great features", "verified": true, "helpfulness": "0/0", "author": "NaeNae"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Laura Fox"}, {"rating": 5.0, "review": "Works perfectly.  I have used this to watch Netflix movies and a movie purchased on Amazon and streamed thru my I-pad.", "verified": true, "helpfulness": "0/0", "author": "Choice Visa"}, {"rating": 5.0, "review": "Addicted", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Good customer service however it's a defective refurb so I had to return it.  Could not maintain a steady airplay connection, constant drop-outs drove me nuts.  Will get a brand-new unit instead.", "verified": true, "helpfulness": "1/1", "author": "GoBears"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love Apple TV!", "verified": true, "helpfulness": "0/0", "author": "S. Daley"}]