[{"rating": 5.0, "review": "Like Movies? Like Music? Do presentations? Like Netflix? GREAT, This gadget is for YOU! I suggest the mount option for cool but discrete mounting on back of tv. I like using the iPad with Remote App, the included remote kinda sucks for navigation.", "verified": true, "helpfulness": "1/1", "author": "Thrive Tech"}, {"rating": 4.0, "review": "Set up is easy.....and working within minutes....especially if you are familiar with Apple products, if not to worry, still pretty easy to use.The only issue is that almost daily my Netflix streaming will be interrupted, which immediately fixed by a quick restartThat's it.....hope this helpsSeveral months later the streaming interruptions seems to have become a chronic issue. I would appreciate some help on how to overcome this problem. I know some people that have no issues with this device whatsoever.....my wireless modem is less than a few inches away from this device.", "verified": true, "helpfulness": "0/1", "author": "Amazonian"}, {"rating": 5.0, "review": "I have a Roku and I think this Apple TV has a better user interface for Netflix. It's 52 inches of \"eye candy\" on my Big HD TV. But what I really like is now I can rip my BluRays with Hand Brake to the Apple TV 3 format, drop them into itunes and now I can watch all my movies through this \"hocky puck\" sized device. My home theater pc uses around 120 watts of power, while this only sips 1.9 wats. Whats not to like.", "verified": true, "helpfulness": "0/0", "author": "Wendall M. Barclay"}, {"rating": 3.0, "review": "Did not keep it so can't give a review.  All reviews seem to be good, bought ROKU instead it was cheaper and works just as good, I assume.  Love the ROKU", "verified": true, "helpfulness": "0/3", "author": "Barbi See \"Barbi\""}, {"rating": 5.0, "review": "Tremendous device.  We absolutely love it.  Does everything we need.Hopefully the OS expands to more functionality.  I'd love to see Twitter involved, etc.", "verified": true, "helpfulness": "0/0", "author": "Steve Silvasy"}, {"rating": 5.0, "review": "Unlike some other electronic equipment, this was easy to install and begin using.  It was reasonably priced and is small enough to be tucked away in our media cabinet. It works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Laura J. Miller"}, {"rating": 3.0, "review": "the reason i am giving only 3 stars out of 5 is not for the quality or any technical problem i have with the device.the reason this device is getting 3 stars from me is because of Apple...Apple decided to put a certain apps on the Apple TV and even though the platform is ready to have more and different apps, they had decided to keep it closed! so.. you can NOT stream content from Amazon (or anyone else that is not iTunes, Netflix or Hulu)ALL the sport channels and radio channels on it are locked and are very expensive to open.Apple should consider opening the device and give him a pot-light in the App Store.", "verified": true, "helpfulness": "0/0", "author": "Meydad"}, {"rating": 5.0, "review": "I have two of these: one in the family room and one in the bedroom. Seamlessly syncs with all other apple products and services. Works great on wired and wireless internet connections. I recently canceld cable TV service and use Apple TV exclusively to access Netflix and Hulu+.", "verified": true, "helpfulness": "0/1", "author": "adeinert"}, {"rating": 5.0, "review": "Now that I've gotten it to work, I love it as much as I love all my iPhone.  The only thing was when I first got it, it would always freeze or stop working after about 10 minutes.  I drove myself INSANE trying to find a solution.  I was so upset about it!So the solution, if you're like me is that you have to go to your router in any internet broswer by typing in the ip address, log in, and add in the atv's ip address as always allowed.  I don't trully understand why this is, but the explanation is something about devices are constantly \"reconnecting\" to the router, and this is what disrupts the atv's performance and ruins everything until fixed.  They say modern routers don't do this, but mine is only a few months old, so I think it's a problem with atv that it doesn't work out of the box or at least make it easier to find this solution which it took me HOURS to find.  I hope if you have this problem you find this review sooner.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Inexpensive, and delivers so many options to the TV. apple has scored big with this item. Highly recommend to anyone wanting additional TV experiences", "verified": true, "helpfulness": "0/0", "author": "DAn"}]