[{"rating": 5.0, "review": "Every time we have people over and I have my itunes playing through it people freak out when they see me changing songs and volume and such from my phone through the surround sound system.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 4.0, "review": "It works! I'm a frequent user of Netflix and I really like being able to connect to it from my man cave rather than share the \"main\" TV. If I was married to the lady who lives inside the Apple box, I'd go stark raving mad. I've learned to speed through the selections so as to minimize her blather. I would like to have a few more pages of Owner's Manual as I'm not sure I understand everything.", "verified": true, "helpfulness": "0/0", "author": "Cracker Jack"}, {"rating": 1.0, "review": "This not as great as other Apple products. I LOVE my macbook but HATE this box. It is SO annoying that my iTunes has to be on for Apple TV to run it (i.e my laptop has to be on the entire time we are watching TV, & when my daughter closes the screen her show stops & chaos ensues). Before this we had a Roku (that we moved upstairs to the bedroom TV) that could stream Amazon prime videos, connect to HBO & showtime GO, Facebook, and gives you endless options of channels to purchase. Apple TV gives you NO options other than the standard few things it comes with (I hope you like Youtube, Netflix & Hulu bc that's it!). Also, most annoying, the remote control is freaking TINY. I mean, MINISCULE. I get it Apple, you are sleek & cool, but it is really NOT cool when I can't find the damn thing every morning when my kid wants to watch tv. Seriously, this remote is about 3/4\" inch wide by 4\" long by 1/16\" thick. It's about as easy to find as a toothpick in the couch. I moved the Roku box back downstairs & now use both intermittently. If my husband didn't love Apple so much I would send this back for sure.", "verified": false, "helpfulness": "38/62", "author": "Lindsey"}, {"rating": 5.0, "review": "Good thing. Console is used together with a projector and showed his good side, quickly switches the image. A quality product with a good set of services.", "verified": true, "helpfulness": "0/1", "author": "vizavitobolsk"}, {"rating": 5.0, "review": "We love this!  It automatically detects wireless connection, just add iTunes account and voila! all of your purchases from the Apple iTunes store.  We watch Hulu Plus, movies, tv shows and pause/play back at our choosing. Much cheaper than DVR (monthly) and my 3 year old loves it.  It is small enough no one even notices it by my TV, QUICK on/off with no boot time.  Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Ali Solo \"SoloFamily\""}, {"rating": 5.0, "review": "I love this device.  Now I can watch All My Children and One Life to Live on Hulu Plus on the bigger TV screen rather than on my IPad or computer.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Peters"}, {"rating": 5.0, "review": "My main purpose for buying this was so I could stream video from my iPad to our TV.  This has given us that and much more!!!  My husband and son immediately were hooked on Netflix.  For us, this is so worth the price!!!", "verified": true, "helpfulness": "0/0", "author": "pepandjez"}, {"rating": 1.0, "review": "Totally blocks your internet connection. Recurrent messages \"cannot access itunes\" and \"failed to login to account\" . Constantly having to unplug and reset. If you have anything less than a very very fast internet connection be wary here. While movies download - and this routinely takes hours, using other internet devices in your home is severely impacted. Very slow, often totally blocked.  Movie says ready to play and then into the movie it freezes while more of the movie downloads for another 15 minites to hours. Often at this point you have to unplug to reset. Somehting is very poorly thought out in the design of this product. Movie downloads take hours. No instant watching. Disappointed. Works as supposed to occasionally but far more as described above.", "verified": true, "helpfulness": "0/4", "author": "AFM444"}, {"rating": 4.0, "review": "Vudu, Amazon Instant Video and other services are not yet available in my country, and even when I do access them via Unblock-Us, movies don't have subtitles in Spanish... Or even worse, no subtitles at all. So iTunes is, so far, the best option for digitally renting movies down here in Ecuador, since they started offering us this service about a year ago.My only gripe is that, despite having a 11Mbps Internet connection, iTunes movies load slowly, so when I rent a movie I have to do it from my PC, wait around 5 hours for it to download, and then watch it from the Apple TV. By comparison, I can watch 720p Netflix with no delays at all.Another plus of the Apple TV is that the UI and remote are so easy to use, this is the first time my 76-year-old dad is using Netflix all by himself. I also have a PS3, but he always asked me to turn it on and play the TV show he wanted. He would not dare use Netflix on the PS3 by himself. I once also caught my mother watching a video from her iPad on the TV via Aiplay... I have only needed to teach them a few times, and they already feel confident with their Apple toys.", "verified": true, "helpfulness": "0/0", "author": "Miguel Lescano Cornejo"}, {"rating": 5.0, "review": "I've got everything Apple, so I figured this is the next step and I'm very happy with it.  Super easy set up.  Haven't hooked up with Netflix as yet, but I will.  But music and photos are a breeze!", "verified": true, "helpfulness": "1/1", "author": "KAO"}]