[{"rating": 5.0, "review": "hook it up, plug it in and watch your shows.  so easy even a caveman can do it.  worth the money", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great deal. Works very well. Very easy to setup. Lots of very good apps for lots of vewing. Works well woth other apple devices.", "verified": true, "helpfulness": "0/0", "author": "Silverwolf341"}, {"rating": 5.0, "review": "Awesome I'm really enjoy this Apple TV and it's cheaper than the store so I totally love it. Thx u", "verified": true, "helpfulness": "0/0", "author": "Vayo Malithong"}, {"rating": 5.0, "review": "I purchased Apple TV so I could stream my laptop to the TV as second monitor.  Works really well with the iPhone app as well.", "verified": true, "helpfulness": "1/1", "author": "EJ"}, {"rating": 5.0, "review": "Not only was this apple tv cheaper on Amazon than other places, but it shipped in only two days to my house. It was easy to install and a great way to enjoy our netflix, iTunes, and Hulu accounts on our flat screen.", "verified": true, "helpfulness": "1/1", "author": "2k"}, {"rating": 5.0, "review": "This is what the wife wanted and she loves it.  She can watch all her shows and old series through the various features the Apple TV provides.  We now have two of these in a couple of rooms.", "verified": true, "helpfulness": "0/0", "author": "Jack Knight"}, {"rating": 5.0, "review": "Great service, excellent device, did everything it was supposed to and more.  Extremely easy to setup.  Has blue tooth so you can also attach a keyboard to the device if you don't like using the remote to pick characters from a list.  Would recommend to anyone trying to get high quality entertainment and educational TV at reduced prices.", "verified": true, "helpfulness": "0/0", "author": "bigram"}, {"rating": 5.0, "review": "We love Apple TV. You can do slides how with all your photos from your phone, iPad, iPod. We love watching movies also.", "verified": true, "helpfulness": "0/0", "author": "Cindy Hess"}, {"rating": 5.0, "review": "I love the convenience of being able to use my Ipad to play music and show pictures, slides, and videos on a larger screen wirelessly to the kids I teach!", "verified": true, "helpfulness": "0/0", "author": "Steve Neer"}, {"rating": 5.0, "review": "Superb...... Every thing I expected of it. It works fine and easy to use, gives u all the features I wanted", "verified": true, "helpfulness": "0/0", "author": "Ray Victor"}]