[{"rating": 1.0, "review": "I agree with the other reviewers.  I have not bought this product, but it is clear that it is overpriced for what an Apple TV should be.For reference: [...] marked as $99.  It should be that price or less on Amazon (I've seen $92.99 Apple MD199LL A TVPlease consider *very* carefully before buying this.", "verified": false, "helpfulness": "18/32", "author": "Andrew"}, {"rating": 5.0, "review": "Got this for my dad and it works great! My only slight qualm is that the remote's responsiveness seems to be choppy once you get more than 10 feet away. I might have to check the battery in the remote.", "verified": true, "helpfulness": "1/2", "author": "Steve"}, {"rating": 4.0, "review": "Great way to get additional programming on my tv and share from my other apple devices!  All we need is Showtime! AirPlay is fantastic and access to iTunes movies. Downside is no Amazon instant. If that's important to you or you don't use other Apple products, get a Roku (unless you want You Tube as its not available on it yet). We have a Roku on another TV and love it, but the Apple TV is great with our macs and iPads, iPhones.", "verified": true, "helpfulness": "1/1", "author": "QueenV"}, {"rating": 5.0, "review": "I recently purchased a \"smart TV\". The connectivity with that TV was not as good as the Apple TV. Apple TV is Great If you have children that like Disney shows. Also it has Vevo which is like Pandora with music videos. I LOVE THIS PRODUCT!!!!!", "verified": true, "helpfulness": "1/2", "author": "Bryan Quenzel"}, {"rating": 5.0, "review": "Great alternative to cable and satellite. I have neither. I pay a one time fee for the hardware and stream tv", "verified": true, "helpfulness": "1/2", "author": "FLORENTINO F. PEGUES"}, {"rating": 1.0, "review": "What comes extra for the additional $100 you're charging for it? This goes for 89-99 dollars everywhere else. Rip off.", "verified": false, "helpfulness": "50/78", "author": "Tknox"}, {"rating": 5.0, "review": "I love my Apple TV I can stream anything from my ipad or iphone straight to my tv it is awesome and came in a good time period", "verified": true, "helpfulness": "1/2", "author": "Gibsonsg72"}, {"rating": 4.0, "review": "I bought this specifically for the airplay/screen mirroring. We wanted to watch what was on the computer screen on our 55' inch TV. Unfortunately, the quality of tranference from the AppleTV from my Macbook Pro is very low. It lags, takes awhile to load and doesn't sync properly. After looking around online for a solution, it seems everybody with a Macbook has the same issue. Thankfully my roommate has an iPad and it works flawlessly with that and his iPhone5.", "verified": true, "helpfulness": "1/1", "author": "Andrew J. Szalla"}, {"rating": 4.0, "review": "This unit replaces an older and more expensive version. I had to work out some problems and had Apple suggest a reset. So far so good. Also, it appears that an infrared button (attached for better remote connection) was at fault. A gummy substance from the fastener had gummed up the devices eye. Having removed the eye and doing a thorough cleaning of the face, along with the reset has helped dispose of the problem. Netflix off of this device is a great have for me. Be advised that Amazon's version of streaming is not available. Beating iTunes pricing on movies makes this understandable. A new blue ray box will get me around this eventually. Sooner than later, since I feel Apple, as rich as it is, gets far too much for its movies.", "verified": true, "helpfulness": "0/0", "author": "manypages"}, {"rating": 5.0, "review": "Amazing technology. Apple does it again. My only suggestion would be to make the remote control bigger, it's so easy to lose!!", "verified": true, "helpfulness": "1/2", "author": "Lisa C. Wolf \"Mrs. Wolf\""}]