[{"rating": 5.0, "review": "The only two complaints after using this device for three years: the controller is too small and sometimes iTunes store connection is problematic. These are very small issues. Overall I have bought three family members this device. If you use Mac products, this fits perfectly into your life.", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 5.0, "review": "It does everything we wanted it to do...stream whatever we're watching on netflix to tv and anything on our iphones, ipads and macbook to screen...very convenient!", "verified": true, "helpfulness": "0/0", "author": "ashley"}, {"rating": 5.0, "review": "Love it! I bought my daughter one for Christmas and liked it so much I wanted one too. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Carrie Allamby"}, {"rating": 5.0, "review": "i love to watch my tv shows in my apple tv, i pluged my apple in a projector and is awesome.", "verified": true, "helpfulness": "0/0", "author": "daniel prieto"}, {"rating": 1.0, "review": "The menues were horrible.  It took forever to program this item.I returned it and purchased a newer Roku, which was much faster and far easier to program.I would not recommend the Apple TV.", "verified": true, "helpfulness": "1/6", "author": "Carolyn D. Solberg \"cds121\""}, {"rating": 5.0, "review": "If you have other apple products this will be the best money you'll ever spend. You can stream to your RV from your computer, ipad, or iPhone. It's really an amazing product.", "verified": true, "helpfulness": "0/0", "author": "JustAGuy"}, {"rating": 5.0, "review": "This thing is everything. Every single day i use it because i don't live in the US but i always watch the tv shows there, so i bought this and I'm completely in shock of how awesome it is. Would definitely recommand it to you all out there :)", "verified": true, "helpfulness": "0/0", "author": "Namarina"}, {"rating": 2.0, "review": "I can definitely be labeled as an Apple junkie and generally have high regard for most of their products.  Sadly, the Apple TV doesn't reach the same high level of performance as the iPhone and iPad products.  After about three months, I converted from the Apple TV to a Roku 3 and have been very happy with the change.  The Roku simply gives you more channels, has a better interface, is faster, is simply easier to use.  I did enjoy being able to project my iPad or iPhone onto a TV screen using Airplay and Apple TV, but unfortunately, the only way that functionality works is when you are on your home network.  You cannot travel with an Apple TV and expect to use it in a hotel.  You can use your phone as a personal hotspot to establish a network and gain all of the Apple TV capabilities, but you will burn through your data plan very quickly.  If you try to establish your own network using a mobile router then you will quickly find that almost none of your Apple content is authorized to play.  All in all, this was biggest disappointment I have experienced with an Apple product.  Go with a Roku, you'll be much happier.", "verified": false, "helpfulness": "3/4", "author": "Mr J. \"J.\""}, {"rating": 5.0, "review": "Was able to get a great price on amazon for the apple Tv.  I have a few units all work great.  Excellent product.", "verified": true, "helpfulness": "0/0", "author": "R. Williams"}, {"rating": 5.0, "review": "We are in love with our Apple TV.  We have netflix and ESPN, ESPN Sports Etc......Those extra channels are provided inHD through our cable company. We are looking into buying another apple TV soon!!! :) LOVE", "verified": true, "helpfulness": "0/0", "author": "Mom85"}]