[{"rating": 2.0, "review": "No volume control, again, your rolling your eyes thinking im dumb, i promise theres really no volume control.  Very limited channels, must have a cable or sattellite subscription to get an access code to use some channels, ipad remote interface doesnt work, on 2 seperate ipads, the swipe control part is broken, it does however function with an iphone, optical digital and hdmi outputs only, the interface wastes a lot of screen real estate, occasionally has a blackout moment then makes you reload content, however that could be my internet provider.  for an apple product, this is a very serious disappointment.  Without an idevice to add additional content via airplay then this is really a 1 star device.", "verified": false, "helpfulness": "0/1", "author": "Steven kabick"}, {"rating": 3.0, "review": "If you're in the Apple ecosystem this is a solid choice, but probably not the best one. Overall, the Apple TV has serious limitations compared to competitors like the Roku 3.Some are obvious. The Roku allows user-created apps and, therefore, has almost limitless possibilities compared to the Apple TV. (No Amazon Prime video on the Apple TV!) Other limitations are subtler. For the Netflix app, there's a 150-title limitation on the Apple TV -- a serious issue if your digital cue is as large as mine!The best feature of the Apple TV is Airplay, which works more smoothly with Apple products than the Roku's similar mirroring feature.But, beyond Airplay, you're better off going with the Roku 3 (or, perhaps, the Amazon Fire TV, which was released after I purchased my Roku 3), even if, like me, your computers and phones are Apple products.", "verified": true, "helpfulness": "1/1", "author": "Rusty Shackleford"}, {"rating": 5.0, "review": "If you are an Apple person, then Apple TV is for you! Great device! You are able to use it with your other Apple devices. I played a movie on my iPhone and through Airplay, sent the movie to the Apple TV and watched it on my plasma. Cool product! Only down side, cannot add addition apps.", "verified": true, "helpfulness": "0/0", "author": "Kevin Spiegelman"}, {"rating": 5.0, "review": "I love my AppleTV at home but I just found out on a trip with the kids that it is impossible to use in a hotel environment where you must sign into a web portal to gain internet access.  This is about 90% of all hotels and 100% of the big chains such as Marriott and Hilton. I did all my research on the hotel I was staying at to make sure it had HDMI ports and access to them just to find out that the appleTV operating system cannot handle an internet sign on!  What a shame, I also checked message boards and apple support , it is a known problem. I wound up tethering it to my cell plan though a wifi hotspot and blew through all my data.  I still love this thing and give it 5 stars but want people to know about the hotel issues.", "verified": true, "helpfulness": "2/2", "author": "morepowa"}, {"rating": 5.0, "review": "Awesome alternative to getting a smart tv. Apple tv is probably even better than a smart tv because you can stream content from any apple device (not the ipod shuffle) onto the tv through airplay. Makes for great party accessory because you can throw a slide show or music from your ipad or iphone to the surround sound speakers.", "verified": true, "helpfulness": "0/0", "author": "patriotsarebest"}, {"rating": 4.0, "review": "I am not a technophile, but this was easy to install and so far I have found it pretty easy to use. I have not yet tried to replace my cable TV with this, as so many are now doing, but it looks as though it won't be too hard to figure out. In the meantime, watching You Tube on the 50\" screen is a much more satisfying experience than watching it on my laptop, and iTunes movies are a breeze to pull up. I think I will eventually use this in place of my cable. I look forward to denying my local cable company the pleasure of cashing my monthly check.", "verified": true, "helpfulness": "0/0", "author": "R. Dawson \"LCSW, LADC\""}, {"rating": 5.0, "review": "A nice addition to my apple products, but I wish they would include amazon prime. I use the mirror image to see amazon prime video through the iPhone and it works great.", "verified": true, "helpfulness": "0/0", "author": "Enz"}, {"rating": 5.0, "review": "From iTunes music and movies to netflix movies. You can use the iPhone to watch stuff or the iPadI like it a lot", "verified": true, "helpfulness": "1/1", "author": "Mrs Fred \"Mrs Fred\""}, {"rating": 5.0, "review": "It's great. Easy to install but you need to read the instructions carefully to learn how to use it. It does a lot of great things like streaming your pictures from your iPhone or iPad, getting Netflix and other movies.", "verified": true, "helpfulness": "0/0", "author": "Betty Whiting"}, {"rating": 5.0, "review": "AWESOME ITEM, FAST SHIPPING.  THANKS.", "verified": true, "helpfulness": "0/0", "author": "Margie Cox"}]