[{"rating": 5.0, "review": "The Apple TV is great- we have bought 2 off of Amazon.  Amazon is the most affordable way to but the Apple TV- free shipping and no sales tax (in our state) plus it was marked down $6 from the original price. Apple TV is great for Netflix and other services like HBO Go.  The Apple TV is very small and easy to fit and hide near your tv.", "verified": true, "helpfulness": "0/0", "author": "Ash Rock"}, {"rating": 5.0, "review": "Just based on the video quality alone, I would give this product 5 stars, but if you also add how it integrates so well with other iDevices, this is an exceptional piece of technology. It will not replace your cable box/subscription because a lot of the channels require some sort of account to log in. However, if you already have a Netflix or Hulu account, it will nicely fit in to your entertainment ecosystem. We used to use our PS3 to view Netflix but now Apple TV is our device of choice.", "verified": true, "helpfulness": "0/0", "author": "C. Smith"}, {"rating": 4.0, "review": "I am a big fan of the Roku and Chromecast. I have several of each in my house. For Christmas, I was thinking about getting one of those for my sister, but decided to give Apple TV a shot since she is pretty invested in the Apple ecosystem.The design and build of the Apple TV is great. Though it's not something you'll be handling much, it is very solidly built and looks great as a little set top box.Setup was simple, the little remote is also solid and well built and the system is responsive. Got it connected to WiFi and started showing my sister how to use it. The app selection is smaller than Roku, but I figured that could be made up for with AirPlay.AirPlay worked just like I imagined it would. Easy. I love features that don't take much training since it makes showing family members what to do very simple.Overall I am happy that I chose this for my sister. I still think that other devices may be more versatile for people who do not purchase media through iTunes, but there are many people that do just that; for them, I think this is the device to go with.I docked a star only for the app selection compared to other competitors.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "Verdict: MUST buy if you own Apple devices!Apple TV is awesome! If you have Apple devices (iPhone/iPad/iPod), this is perfect because it lets you watch videos that you normally would watch on your small mobile device screen, and puts it on your TV via AirPlay. Think of it as hooking up your computer to your TV via a HDMI cord but only it's wireless!I use it all the time because I like controlling my Netflix, Hulu Plus, etc on my iPad because it is so much easier to search and select on your iPad (compared to TV or gaming console apps), but it's much nicer to watch on a big screen TV. That alone is worth the price of the device.On top of AirPlay, it allows you to sync and get content from your iTunes library. Not to mention the every growing apps that come standard on Apple TV (although keep in mind most apps require you to pay for the service). My favorite free app is VEVO. When you have guests over, I generally just pick a genre and it's nice to have background music playing with the music video to match. Let's be real - we all miss watching music videos! Much better than playing music and have a muted TV show on in the background.", "verified": true, "helpfulness": "0/0", "author": "Andrew A. \"sayforee\""}, {"rating": 2.0, "review": "+/- You can mirror an apple device display+ paired with an iPad or iPhone you can have the video from an app, like youtube or Amazon instant stream video to your TV without issue.+/- when mirroring display everything is leggy and choppy.- It does not have amazon instant app on it.- Apps are limited.- Limited to other devices at the price point- there other options that are 1/3 of the price that have similar functionality- only interfaces with apple productsOverall I'm disappointed with this purchase. The only thing I find remotely useful is having an iPad or iPhone and watch youtube or amazon instant from it. All you need is to spend another $300 - $400 more to get this functionality. I am very disappointed with this for that reason. The apps/channels are limited. It seems to be yet another $100 accessory to an iPad/iPhone. On its own, I think the market has better products that offer more, like Roku and Chromecast, either better price or more features.I was looking forward to mirroring functionality of this as well, but again I was disappointed, the video pauses and then tries to catchup and the audio keeps cutting in and out. This happened with simple things like trying to play a slideshow from iPhoto. Watching videos or mirroring a game is out of the question. I am not really sure what use it is. Maybe PowerPoint without transitions or displaying something static.If you are an Apple-only fan and have the full apple suite, this product my be for you because I'm sure you can overlook all of these issues that I have had.I would suggest looking into Roku or Chromecast, or if you have PS3/4, Xbox360/One, or a Smart TV, you probably have the majority of what this offers.", "verified": false, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Worth every dime, you could save by using this product....no need to go to the theater anymore! love the easy of use and the image quality!", "verified": true, "helpfulness": "0/0", "author": "Salem Nano"}, {"rating": 5.0, "review": "It was what our daughter wanted for a present. I do not know what it does but it was what she wanted.", "verified": true, "helpfulness": "0/3", "author": "ANDREA CONNELLY"}, {"rating": 5.0, "review": "This is a wonderful product.  It is less expensive than buying direct from Apple.  Easy to install and operate!  So glad I invested in this.", "verified": true, "helpfulness": "0/1", "author": "Toni Fleming"}, {"rating": 5.0, "review": "I've had my first Apple for about 18 months now.  It works great and I haven't had any problems with it at all.  I bought a second Apple 2 months ago and got rid of cable TV all together.  I now have free antenna TV along with Apple to stream Netflix.  I no longer get ripped off paying $72.00 a  month for lousy cable TV.  Now I watch what I want, when I want, for a $4.00 monthly fee to Netflix. This is a pretty good way to save money in this bad economy.", "verified": true, "helpfulness": "0/0", "author": "Laurie"}, {"rating": 4.0, "review": "The apple remote showed up on time. The only downfall is when purchasing you do not know you need the HDMI cable to hook it up to the tv. I had to go buy one at the store. The device works great. Just let people know about the cable!", "verified": true, "helpfulness": "0/0", "author": "Jim"}]