[{"rating": 5.0, "review": "Wonderful.", "verified": false, "helpfulness": "0/0", "author": "J G."}, {"rating": 5.0, "review": "You know, apple is apple... great product!", "verified": false, "helpfulness": "0/0", "author": "Eduardo Abelha \"Abelha\""}, {"rating": 5.0, "review": "This product works great if you already use the Apple ecosystem (i.e. Macbook Pro, iPad, iPhone). We have an Xbox 360, a Chromecast and this as the entertainment devices in our household, and I prefer this because of how well it integrates with our computer.Some of the features I use everyday:Airplay with Mac - you can stream movies that are stored in iTunes to your TV or browse your iTunes library (on your Mac) via your Apple TV. You can also stream movies stored in the Videos app on your iPad.Podcast - The Apple TV can play the latest podcasts synced from iCloud. You can also stop listening on your iPhone and then pick up from where you left off on your TV.Photo Stream Screen Saver - all the pictures that you take on your phone can automatically be displayed as the screen saver on your Apple TV. Our favorite screen saver setting is \"Origami\"", "verified": true, "helpfulness": "0/0", "author": "Blake"}, {"rating": 4.0, "review": "Well packaged, quick ship, easy to install, not as reliable as cable ( programming and games interrupted due to streaming) but can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Oak Duke"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Tareq Ali Mayhad"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Paulo Lima"}, {"rating": 5.0, "review": "Awesome little black box apple has come out with", "verified": true, "helpfulness": "0/0", "author": "Christopher J. Liakopoulos"}, {"rating": 5.0, "review": "Nice,thank-you.", "verified": true, "helpfulness": "0/0", "author": "Victor Purtell"}, {"rating": 5.0, "review": "Perfect for an avid Apple user", "verified": true, "helpfulness": "0/0", "author": "arturo viramontes"}, {"rating": 5.0, "review": "One of my favorite TV accessories. I really like Apple TV", "verified": true, "helpfulness": "0/0", "author": "Michael Ceniceros"}]