[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "fayza"}, {"rating": 5.0, "review": "I have three apple tv's. Now I can watch Supernatural, Sherlock, and Game of Thrones simultaneously in three different rooms. I wish they had the flixster, amazon, and vudu app. The digital copy of movies always forces us to use at least one of those. It's easy to set up and to use. Never have any problems with it.", "verified": true, "helpfulness": "0/1", "author": "Katrina"}, {"rating": 5.0, "review": "I love it for Netflix and catching some shows I might've missed using the other tv network apps (I don't care to DVR). It's also great to stream music through, look at pics/videos from you phone, and most importantly...using my tv as a second monitor when working from home. It's great!", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Good quality HD video and sound. But, my favorite feature is ability to mirror my IPhone's screen on big screen TV. Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Nature Gifted"}, {"rating": 5.0, "review": "Just for airplay!!!", "verified": true, "helpfulness": "0/1", "author": "Gordon Dai"}, {"rating": 3.0, "review": "I bought this since I want HBO Now and I was thinking of getting a Roku anyway.Cons:- The remote is made for a small hands and sometimes it is hard to press the right button.- Setup is a pain because you have to disable your router's firewall and reconfigure port's in order for it to work.- No amazon prime availability.- Requires itunes 10.5 and apple ID for computer functionality- Only HDMI/optical (No Svideo, component or composite  cables for older TV's)- Doesn't come with the HDMI cablePros:-Looks nice-Streams ok (sometimes has buffering problems).Overall I probably wouldn't buy it again but It does the job well enough to not need to be replaced.", "verified": true, "helpfulness": "0/0", "author": "Wintermute"}, {"rating": 5.0, "review": "Very good ítem", "verified": true, "helpfulness": "0/1", "author": "Leandro M."}, {"rating": 5.0, "review": "As the titile says, the Apple TV MD199ll/A came earlier than expected. Looked like it had never been used. Definetely recommend this product for watching netflix, Hulu, news channels, sports channels, the list goes on and on. I would definetely buy from the seller again.", "verified": true, "helpfulness": "0/1", "author": "Matthew Scheuermann"}, {"rating": 4.0, "review": "The only thing wrong with Apple TV is that it is not compatible with a Amazon Prime. I'm disappointed enough to take a star away.", "verified": true, "helpfulness": "0/0", "author": "Sara Holloway Bruner \"Saramelizabeth\""}, {"rating": 5.0, "review": "Great access to Netflix.", "verified": true, "helpfulness": "0/0", "author": "James Dickey"}]