[{"rating": 5.0, "review": "I have to admit I got a Roku some months ago and then got the Apple TV a month ago...not my initial plan to get both, but I'm glad I did. I use both of them and like them equally. I use different apps on each, so I and my housemate can keep our places in different apps. Since I might only watch for 10 minutes at a time, I don't want to spend time opening an app and finding my place in a show.I did set up Plex for Roku, but I way prefer streaming from my iPad or iPhone to Apple TV. Its so much easier to search on the iPhone or iPad, for streaming YouTube, movie trailers, music or videos. Also any friend or housemate in the house with an iPhone can stream to the Apple TV. Besides, there is a fun element of seeing your little devise stream to a big TV.I just checked and I could stream a movie from my iPad Amazon Prime app to Apple TV. It DID go full screen just as YouTube videos do. I couldn't tell on resolution. It looked the same to me when I went back to the Amazon app on the Roku and looked at the same movie clip. I can't swear to it though. If you intend to get the Apple TV and stream Amazon Prime, than I would check reviews on resolution or call Apple. I also don't know what would happen with various iPhones. I believe the resolution went up to at least TV resolution on the recent devises. I would say you DO want HD though if you have a big TV. From Amazon's end of things, I believe Amazon streams to the iPad or iPhone in HD. Last I read some months ago Amazon does not stream movies in HD to computers even if you paid for HD. As long as that is the case, in my mind that might knock Apple TV out of the running for streaming Amazon from a mac to Apple TV. The other issue would be bandwidth.  I am told by Apple tech help that when you stream from a computer or devise to your Apple TV, you are using double the bandwidth.  I have fiber to the home so I haven't noticed any slowing down.As for usability of the devises, I enjoy both Apple TV and Roku. They both handle well, and are quick enough, and both are user friendly.With Apple TV just make sure you pair your remote with the Apple TV.  I didn't know that mine wasn't paired, because the remote was working. But some flaky things were happening in one app which I was blaming on the app. When I called into Apple tech support they showed me how to pair the remote to the TV... phew... that fixed my problems.UPDATE after 3/4 year of use. I have in the house 2 Apple TVs, a Roku and a Fire TV. I find the Apple TVs give you the spinning wheel sometimes, which is really annoying. Right now mine isn't pairing with the remote at all so I may have to exchange it on what I understand is a year warranty. I was at a friends house recently and his did the spinning wheel also. My opinion at this point is don't get Apple TV unless you want to stream from your apple devise like iPhone. I do stream music and video from my iPhone so I am still glad to have the Apple TV. But I use Roku for Netflix and Prime on my main TV, since Roku is perfectly reliable and fast with no problems, and has some apps I like besides the main ones. Fire TV has HBOgo now, so that's prefect for me on my second TV. . Fire TV is fast, attractive, and the voice search works.Its weird that Apple TV is so slow.. or maybe they have improved? This review is based on a purchase of Apple TV spring 2013.", "verified": true, "helpfulness": "0/0", "author": "RoseV"}, {"rating": 4.0, "review": "Great product.  Works well with iTunes and home sharing. Wish it played more media files than it actually does play.", "verified": true, "helpfulness": "0/0", "author": "T. J. Bradley"}, {"rating": 5.0, "review": "I am thrilled with this purchase and wish I would have got one sooner. It's easy to get started and love everything about it", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "Arrived on time. Works perfectly. So easy to use and navigate. So pleased to have all of our networks (Hulu, Netflix, MLB) on one device. You'll hear no complaints from me.", "verified": false, "helpfulness": "0/0", "author": "Sara BHWP"}, {"rating": 5.0, "review": "Has the sleekest interface of the devices similar to this I have tried.  I paired it with AirParrot and the response was a little sluggish for mirroring, but using the on board apps is very nice.  I have given two as gifts I like it so much", "verified": true, "helpfulness": "0/0", "author": "Conor D."}, {"rating": 5.0, "review": "Apple tv is a real good expericence in internet hd tv. I love this product. Very small but very powerful.", "verified": true, "helpfulness": "0/0", "author": "José"}, {"rating": 5.0, "review": "I have a smart tv, a smart blue-ray, even a smart receiver- yet I use the Apple TV to run all my streaming content or for Airplay.Is there an app that it doesn't have? Because I haven't found it.", "verified": true, "helpfulness": "0/0", "author": "Patrick D \"El Pato\""}, {"rating": 4.0, "review": "We don't use the Apple TV with all of its potential yet.  We use it a lot for displaying photos and video from our iPads or iPhones using AirPlay.  Works quite well with that.  Displaying other picture albums is also fun to do.  A little disappointing when we try to project some apps from the iPad to the Apple TV and we get an error message that it is not supported.  I appears to be a licensing thing.  Apple TV is also nice for YouTube even though at times it \"stalls\" (YouTube waiting to download more content) when playing a selection and I am not sure if that is a problem with Apple TV or not but I don't think we saw as many stalls with our iPad 2 running on the same home network.  The one thing I should note is the YouTube app does not allow you to comment on YouTube videos after watching them like you can elsewhere.  I would suspect this was because with the tiny remote it would take forever to enter in a few sentences.  However, users can pair an Apple keyboard and that would work well for this.  Video through the many Apple TV apps are smooth even with my \"slow\" 3M DSL internet.  The unit is nice and compact and is extremely easy to set up when you first purchase it.  It is amazing how much you can do with a simple controlling remote but I would have preferred one with a few more buttons.  I would have given a 5 star rating if I didn't experience the YouTube stalls.  If this is a configuration issue, someone please note this and I will modify my rating.", "verified": true, "helpfulness": "1/1", "author": "I. Nieto \"ianieto\""}, {"rating": 5.0, "review": "This was so easy to set up, instructions were clear and easy enough a child could have done it.  Very happy with Apple TVJeanne Diehl Stiffler", "verified": true, "helpfulness": "0/0", "author": "J. Diehl"}, {"rating": 5.0, "review": "Easy to use, Great apps, I love to stream from ipad to Apple TV using airplay. This is a must have home entertainment item.", "verified": false, "helpfulness": "0/0", "author": "Daniel"}]