[{"rating": 5.0, "review": "I have used a couple other set top boxes (Chromecast & Roku) and loved them. I gave my father this for Christmas and it is absolutely awesome! The look and feel of the user interface, menu and options of streaming content is the best I have seen. Apple has been doing it longer and I believe they set the bar so high  the other providers trying to catch up. It almost makes me want to get rid of my android phone and go back to Apple. My father who is not technically gifted has no problem using Apple TV and he absolutely loves it. He takes it with him when traveling,  from room to room in his house and would probably put it in his car if he could figure out a way to do it. I would definitely recommend Apple TV if you are looking at set top boxes.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "I love Apple products. The perfect way to purchase digital movies.", "verified": true, "helpfulness": "0/0", "author": "Glenavary Lucas"}, {"rating": 5.0, "review": "Amazing device. Makes getting rid of cable that much easier. It's great to take on the go. Really simple to use. Just needing an hdmi cable keeps the clutter very low.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "Great Piece of Technology -- Wish I would have acquired one long ago!!", "verified": true, "helpfulness": "0/0", "author": "LDM"}, {"rating": 5.0, "review": "Works great with a Mac and iTunes library. My only wish is that you were able to add apps to it like Amazon prime videos and other things like you can do on an Xbox 360.", "verified": true, "helpfulness": "1/1", "author": "Ted J. Gianopulos"}, {"rating": 5.0, "review": "I love this and it's freeing me from cable,  There are so many viewing options and movies available. plus all of my iCloud movies and files are available in HD on my TV.", "verified": true, "helpfulness": "0/0", "author": "Big John G."}, {"rating": 5.0, "review": "Our Uncles Love it!", "verified": true, "helpfulness": "0/1", "author": "D. Benz"}, {"rating": 4.0, "review": "Very easy to set up if you have an iPhone or iPad with the free remote app from Apple, nearly plug and play.", "verified": true, "helpfulness": "0/0", "author": "Ted B"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Miguel Nazar"}, {"rating": 5.0, "review": "Perfect! I purchased a apple tv so I can mirror my iPhone on the tv in order to play movie. Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "MLynnM88"}]