[{"rating": 5.0, "review": "This is one of the best products I have ever bought. It is one of the best for the price which you can't beat. Although I was certain to buy the Roku, the price and the usefulness of air play told me to go buy this one. Turns any TV into a smart TV! What's better is that if you have other apple products, you can use airplay to play play all your content from your mobile device to your TV. You can even use mirroring to stream your mobile devices screen to the TV. Would definitely recommend!", "verified": true, "helpfulness": "0/1", "author": "Alex"}, {"rating": 5.0, "review": "Now I can see Netflix, You tube and my Ipad contents on the TV. Like every Apple product, easy to connect, easy to set, easy tu use.", "verified": true, "helpfulness": "0/1", "author": "Darío Gabriel Flores"}, {"rating": 5.0, "review": "We are a committed Apple family, and this works just as great as all Apple products do. However, if you buy it, make sure to update the software before trying to install it.", "verified": true, "helpfulness": "0/1", "author": "Don Gaze"}, {"rating": 5.0, "review": "Easy to hook up.", "verified": true, "helpfulness": "0/1", "author": "John Michael George"}, {"rating": 5.0, "review": "Meets all the expectations", "verified": true, "helpfulness": "0/1", "author": "balraj adhana"}, {"rating": 5.0, "review": "Bought this for my son for his birthday and he loves it!", "verified": true, "helpfulness": "0/1", "author": "Laurie Rago"}, {"rating": 3.0, "review": "Great but still waiting for more apps.", "verified": true, "helpfulness": "0/1", "author": "H. Abram"}, {"rating": 3.0, "review": "..the current version of apple tv is good..small design and appearance is nice..connecting all cables is easy but my only complaint on this item is the remote..its too light and navigation buttons arent big enough..alot of times you will press 2 buttons", "verified": false, "helpfulness": "0/0", "author": "Thomas Lee"}, {"rating": 5.0, "review": "Love it.  It's Apple.  Great product for cutting the cord during the summer.", "verified": true, "helpfulness": "0/1", "author": "Jason Rolf"}, {"rating": 5.0, "review": "As with all Apple products, impeccable packaging.  Best possible device if you use Macs and iPhone/ipad/ipod a lot.  New lower price is great.  GUI is sharper then Gen2.  Would recommend without reservation to any Apple product user.", "verified": true, "helpfulness": "0/0", "author": "4nrMike"}]