[{"rating": 5.0, "review": "We have just about all apple products we love it we had an older version that he gave away to a friend then he found himself missing it so I brought this for his birthday and he loves it like-he did the older one", "verified": true, "helpfulness": "0/1", "author": "angelia mcfarlane"}, {"rating": 1.0, "review": "Too many updates and everytime I download the update it takes numerous hours on the phone with tech support to try to get it to working again.  Apple support says that this is because I do not have an Apple computer.  They need to be honest and tell consumers this before they buy their product.  Very misleading.  I am so disappointed.", "verified": false, "helpfulness": "0/4", "author": "James McCain"}, {"rating": 5.0, "review": "Very simple to set up and use. Plug this in to your tv, tell it where the wireless network is, and all your MacBooks, iPads, and iPhones start offering it p to play music and video. It's that simple.", "verified": true, "helpfulness": "0/0", "author": "dish74"}, {"rating": 5.0, "review": "purchased for myself and my mom and we both enjoy it  itunes and netflix  can be used with this and you tube is great  just make sure what cables are needed", "verified": true, "helpfulness": "0/0", "author": "gerri a kutas"}, {"rating": 5.0, "review": "it is amazing and works great =) ,, my wife loved it =]i like the idea .. and it is small", "verified": true, "helpfulness": "0/0", "author": "Sayed Nasser"}, {"rating": 5.0, "review": "I got this mainly for YouTube. Has been working great. I occasionally suffer due to my internet bandwidth but that has nothing to do with the product. Recommended buy especially if you have other Apple products.", "verified": true, "helpfulness": "0/0", "author": "Catmando007"}, {"rating": 5.0, "review": "It does what it says it will.  Mirroring my iPhone and Macbook is a breeze.  Streaming music is even easier.", "verified": true, "helpfulness": "0/0", "author": "edgar ramos"}, {"rating": 3.0, "review": "I have had the Apple TV a few weeks now.  It was easy to install and has beautiful picture quality.  The problem is I rarely use it because of how long it takes to download a show or movie.  People with faster internet may enjoy more, but with even High Speed DSL internet, I have to plan a few hours in advance for any movie I want to watch.  Just to watch a trailer for a movie takes a few minutes to download.  I haven't tried a Hulu Plus subscription yet, but plan to.  If show can be accessed quicker I will probably enjoy it more.  Perhaps upgrading my internet speed some day will make me enjoy this more.", "verified": true, "helpfulness": "0/0", "author": "Susan \"deals shopper\""}, {"rating": 5.0, "review": "It's great.  The Wi-Fi is really good, the streaming is quick and buffer less.  The mlb.tv spring training games have been great!", "verified": true, "helpfulness": "0/0", "author": "Scott Baker"}, {"rating": 1.0, "review": "bought the apple tv to mirror my macbook pro to, only to find out that mirroring is not supported in any computer much older than 2 years old. Total disappointment. When using the remote on the apple TV it changes the volume on the macbook pro.IMO, If I had known the shortcomings here I would have invested the extra $20 and bought the roku. I guess I'll have to ebay this piece of crap off to someone else....", "verified": false, "helpfulness": "0/4", "author": "jowica"}]