[{"rating": 5.0, "review": "I bought a \"basic\" TV without internet connectivity due to quality and price and was able to get the TV connected to the internet using this little box that I got for less than $100 dollars. Hook-up is simple: one HDMI cord to the TV and the power cord to the wall and you're ready to go. It's a little hard to type/search using the on-screen keyboard but I think there is a way around that if you have a computer connected via Home Sharing... but I haven't tried it yet.The AppleTV ability to AirPlay anything from an iPhone or Macbook makes it well worth the money just by itself. The tiny box is also not an eyesore and is barely visible when sitting on a dark-colored entertainment center.", "verified": true, "helpfulness": "0/0", "author": "BMilw"}, {"rating": 2.0, "review": "We are disappointed that we can not play Amazon movies.  The audio can be heard, but the video won't play.  Until Amazon and Apple get together to fix this, look at a RokuRoku 2 XS 1080p Streaming Player--it does it all.  We wish we had gotten the Roku.That said--it does play Netflix movies beautifully.  It mirrors everything else well.  It comes with one free week of Hulu Plus.You probably want to go ahead and order an HDMI cable as it does not come with one. AmazonBasics High-Speed HDMI Cable (6.5 Feet/2.0 Meters) - Supports Ethernet, 3D, and Audio Return [Newest Standard]", "verified": true, "helpfulness": "1/3", "author": "G. T. Vekovius \"gayber\""}, {"rating": 5.0, "review": "This product is amazing!  We cannot tear ourselves away from watching series of shows available through the apple tv.  The walking dead seasons have been a hit and we are completely caught up now and ready for the new season in feb.  The only thing you need though is an hdmi cable to hook to your tv.  It did not come with one and had to make a run to a game stop store to get after christmas.", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "This was a gift for myself and I absolutely love it!!!! I recommend it to everyone! It's awesome! So happy!", "verified": true, "helpfulness": "0/0", "author": "Victoria Guerra"}, {"rating": 4.0, "review": "Installed quickly and set up easily.  Worked first time!  Works every time as described it would.  I like it.  I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Paul Hoeper"}, {"rating": 5.0, "review": "I have had this product for some time and am very satisfied with it. However, I don't recall seeing a lot of detailed operational instructions with it. Admittedly, I am one who installs first and reads the instructions later. It is a very easy installation and the quality of the programming such as movies is outstanding. The user interface is easy to navigate and I like the feature where I can see trailers for movies and if I don't have time to watch it now, I just place it in my wish list or queue. They also provide customer and critic's reviews. I am running both Apple TV and Roku 2 XS side by side. I did it because I wanted to see which one was the best overall with the intent to returning one of them. Instead I kept them both. I'll save the Roku evaluation for a little later but they are both very good streaming devices with different user interfaces and slightly different offerings. The quality of streaming HD movies on Apple TV is outstanding. I was pleasantly surprised. There is absolutely no freezing, choppiness (truncation) or any other distractions. I ran out of HDMI ports on the TV (which you must have to ensure the highest picture and sound resolution), so I purchased a HDMI switch to hook both Apple TV and Ruku 2 XS. So depending on which product I use, I just switch back and forth. I would also recommend that you not spend a lot of money on expensive HDMI cables. That is simply a lot of hype. You can buy very good HDMI cables for around $15.00 give or take. Just so you know you must have adequate bandwidth. I run at about 24 Mbps and am using a Linksys Gb router. I feel comfortable saying that you can have half the bandwidth that I have and still have a very satisfying experience.", "verified": true, "helpfulness": "0/0", "author": "Big Daddy Corleone \"Amazonian\""}, {"rating": 3.0, "review": "If you want a bigger vision of any multimedia files lying in your apple products, GO FOR IT.Other than that, you might not need it.", "verified": true, "helpfulness": "0/1", "author": "iamjoylicious"}, {"rating": 5.0, "review": "great product, easy to buy, easy to connect.i don't understand why you require a certain amount of words to describe this", "verified": true, "helpfulness": "0/0", "author": "Tracee"}, {"rating": 5.0, "review": "I own 2 Roku devices and decided to give the Apple TV a try. It is a great device and I recommend it.", "verified": true, "helpfulness": "1/1", "author": "Todd Porter \"the snuffy\""}, {"rating": 5.0, "review": "Bought this as a gift for my techie husband who says it's a 10/10.  Exactly what he wanted, works exactly as described--\"perfect.\"", "verified": true, "helpfulness": "1/1", "author": "JB"}]