[{"rating": 5.0, "review": "Great for airdropping movies from apple products.  Thousands of free radio channels from all around the world.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "Like it very much", "verified": true, "helpfulness": "0/1", "author": "Chris Brown"}, {"rating": 5.0, "review": "Works great for streaming videos from my iPhone/iPad. Great product!", "verified": true, "helpfulness": "0/0", "author": "Jonathan Llewellyn"}, {"rating": 5.0, "review": "Great product! The Apple TV is always getting new content and features added. Apple supports their products with upgrades which also makes them last much longer. I have cut cable and have been able to get all the programming I want through Apple TV.", "verified": false, "helpfulness": "0/0", "author": "KevoFL"}, {"rating": 5.0, "review": "VERY GOOD PRODUCT", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just a great video streamer, what more can I say, works fantastic right out of the box.", "verified": true, "helpfulness": "0/1", "author": "Burl Thomas"}, {"rating": 2.0, "review": "I don't think there is that much wrong with Apple TV so much as the fact that Apple seems to be having trouble keeping all their bells and whistles working with each other.A couple of weeks ago they made me change passwords after years of using the same one. I had it on all my extensive inventory of apple devices.Now for some reason--I suspect because of the password change--AppleTV will not recognize my payment method in iTunes store and I can't buy shows. It's a pain. Tried everything. I can buy from iTunes store off my computer and I have updated my Apple TV with the new password and I have chatted with iTunes.I have never owned Ruko but if I can get my money back on this I will buy one.", "verified": false, "helpfulness": "0/3", "author": "Mike Massey"}, {"rating": 5.0, "review": "This is the only product on which I have ever been an earlier adopter! We started with the first gen back when it was just an Apple \"hobby\" project. If you are part of the Apple eco-system this is a must have. Mirror the screen of your mac, ipad, or iphone to your tv. Show your photostream albums on your tv and have your itunes music play in the background (a great way to enjoy photos - it makes your TV a big picture frame). Also rent/buy/watch movies or TV shows from iTunes. Add in Netflix, HBO go, and a few other apps and this is a can't live without. We have two and one of them gets used almost every day, even if just for displaying photos.", "verified": true, "helpfulness": "0/0", "author": "LisiJ"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/2", "author": "Norman W Runyon"}, {"rating": 5.0, "review": "Excelent! I've been watching with this thing Netflix all the time!", "verified": true, "helpfulness": "0/0", "author": "Hector Leon"}]