[{"rating": 4.0, "review": "Works well and flawless, great for iPad and iPhone airplay, and integration with apple products,  if you do not need Amazon Instant videos or if you mind airplaying it get Roku., surprisingly you can't install new apps or channels like you do in Roku.", "verified": true, "helpfulness": "0/0", "author": "A. Khamari"}, {"rating": 5.0, "review": "I use it mostly for airplay and iTunes radio. The streaming services work well also, but everything and their momma streams the same thing these days.", "verified": true, "helpfulness": "0/0", "author": "Stephen Waggoner"}, {"rating": 5.0, "review": "Buy this product!!!!!!!!! :-) it is amazing I can even stream my Mac to it with airplay for work purposes.", "verified": true, "helpfulness": "0/0", "author": "Michael sofia"}, {"rating": 5.0, "review": "I love this product. There are so many things you can do with it. This was definitely a good investment.", "verified": true, "helpfulness": "0/0", "author": "Chris Whitmarsh"}, {"rating": 4.0, "review": "I love apple products and love the apple tv. It has the best layout of tv media devices that i've seen. It is quick and easy to set up and works great with itunes and home sharing. The only thing I wish they would improve upon is the content that is provided. An app store would solve this issue and would for sure be a 5 star!", "verified": false, "helpfulness": "0/0", "author": "N.Krupa"}, {"rating": 5.0, "review": "My Brother compared system to system and said this is it after days of intense research.  I am great full to him and to this Apple tvsystem.Amazon was right on in sending it to me, a snow storm made it one day late and the shipping dept. research that for me and called me back as to exactly where the package was and the hold up.  I AM HOOKED AND WILL CONTINUE TO SHOP AT AMAZON.THANK YOU SO MUCH FOR YOUR KINDNESS IN EVERY DEPT. I DEALT WITH.", "verified": true, "helpfulness": "0/0", "author": "Shiggy2"}, {"rating": 5.0, "review": "Great product and fast shipping. Was very happy to stream videos for my 2 year old daughter. You do need fast speed Internet for it to work properly", "verified": true, "helpfulness": "0/0", "author": "dana ronen"}, {"rating": 5.0, "review": "Like every Apple product. Excelent if you have ipad but you have to pay for everything to watch movies etc.", "verified": true, "helpfulness": "0/0", "author": "Emmanuel Munoz"}, {"rating": 5.0, "review": "The apple TV does everything I want: letting me watch movies and TV shows from my computer, watch netflix, and has convenient apps like Watch ESPN, and Youtube", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 2.0, "review": "I've had nothing but buffering and waiting with this unit. Netflix especially but NHL Game Center and Hulu weren't much better. Roku works fine and TWC says its not our internet connection. After a week or so of spending more time waiting to watch something, I sold it for a loss and moved on. Hope this was just my bad experience.", "verified": true, "helpfulness": "0/0", "author": "Tosha Walter"}]