[{"rating": 5.0, "review": "Apple TV is one of the simplest steaming boxes to use! I will say that it does not have all of the channels. I use Amazon Prime and you already know that app is not on there LOL. But everything else works great. When coupled with a Mac computer, you can steam your screen onto your TV through the ATV, which is a cool feature. And when streaming music from an iTunes library, you get large cover art that makes your tv look like a jukebox. That's one of my favorite uses, besides watching tv shows.", "verified": false, "helpfulness": "0/0", "author": "Preston Robinson III \"Preston Robinson III\""}, {"rating": 1.0, "review": "I purchased this item from Amazon and was out of the country on vacation before being able to try and install and use it. I contacted Amazon to return it and was helped via chat only to later find out they charged me a 20% restock fee without informing me. This is lousy service by Amazon and I wish to make other potential buyers beware", "verified": true, "helpfulness": "1/15", "author": "Willie g"}, {"rating": 5.0, "review": "Sir/madam,  I had been satisfied with Apple Tv ,But now since 2/3 weeks there showing problems.even could not see any program.So how could fixed it.", "verified": true, "helpfulness": "0/4", "author": "Birja Rai"}, {"rating": 4.0, "review": "If you have a iphone or ipad this is great. Struggling to find an Android app that works as seamlessly.  The AirParrot app for your laptop is great works well, wished it was available for other smartphones and tablets that are not apple.It would be perfect if Apple included safari browser as well.", "verified": true, "helpfulness": "0/0", "author": "Beiler Campbell"}, {"rating": 4.0, "review": "I'm not sure if I like this more than my Google TV or not, but this one works very well.", "verified": true, "helpfulness": "0/0", "author": "Big Guy \"Rich\""}, {"rating": 5.0, "review": "As always apple creates great products that are simple and easy to use. I would be willing to recommend the apple TV to any one", "verified": true, "helpfulness": "0/0", "author": "Paul E Beard"}, {"rating": 5.0, "review": "Apple is the best digital delivery system period. The future of TV the future of information transmission is here. Top design and performance. I also have a Roku and though both work I would place the Apple TV head and shoulders over Roku better design better interface faster delivery", "verified": true, "helpfulness": "1/1", "author": "Robert B. Keys \"a very handsome gentleman\""}, {"rating": 5.0, "review": "I love to use it to stream from my ipad. Have not tried to see if it works from other devices, but ipad is enough for me...", "verified": true, "helpfulness": "0/0", "author": "Lacramioara Elena Tewari"}, {"rating": 1.0, "review": "I bought this stuff two months ago, when I first connected it, everything seemed to be ok and working properly. After a week a message came up urging to update the software which I accepted, when installation was complete, I found out that I was not able  to see my pictures in Icloud......Called Apple and they made me do a lot of things, nothing worked, finally the lady accepted this is an engineering error of the update and that they are working hard to fix it.......The solution: go to an Apple center and claim a new one...and don't update it........wouldn't work for me since I'm out of country right now........Really Disappointed....", "verified": true, "helpfulness": "1/5", "author": "William Alvarado"}, {"rating": 1.0, "review": "Update (Dec 7, 2013)Since version 6.02 Netflix has become unwatchable during prime time on the Apple TV. It used to be the best at streaming HD shows on Netflix. Not anymore. All my other device stream Netflix much better during the same prime time viewing slot. Lots of others are reporting the same issue on Apple TV forum on discussions.apple.com.Until this is resolved ... I will be using my PS3.-------Better YouTube experience here than on Google TV,That itself should tell you everything you need to know.The fact that it starts Netflix and get you to their main page in less than 3 seconds ... And plays everything flawlessly is merely icing on the cake.Bravo.Now some minor quibbles.- remote blows.- smithsonian stream stops in the middle- no Amazon prime", "verified": false, "helpfulness": "2/6", "author": "vulcanman"}]