[{"rating": 5.0, "review": "Typical of an Apple product, beautiful, yet functional design.  I just wish my TV provider would allow you to stream their channels over Apple TV.  It would make it that much more functional.  We have 2 and use them every day.If you have a Mac, you can easily do screen mirroring and watch streaming videos from your laptop to Apple TV in just one click.", "verified": true, "helpfulness": "0/0", "author": "Peter G \"NJ Cyclist\""}, {"rating": 1.0, "review": "If you are one of those people who have to have everything apple then this is for you.With this device you have access to Itunes (whoopee), Netflix, Hulu Plus and of course Apple Air play so you can stream your home movies to you Apple TV 3.But you do not have the 100 different apps like Plex or Playon you can get with other devices such as Roku.  If you want to stream HBO GO to your Apple TV you can now finally IF you own an Iphone, Ipad or a MacBook and have to use Airplay to do it.  Apple TV 3 does not have a HBO GO native app built in like 99.9% of its competitors and Like everything else that is Apple related you are locked down to what they want you to have.  Apple TV 3 is not able to be jailbroken to add XBMC and it this point it looks like it never will be able to.I prefer Roku (or ANY other streaming media device) over this one.  I just sold mine on craigslist for ½ of what I paid for it because it was useless to me.", "verified": false, "helpfulness": "1/6", "author": "Mark B."}, {"rating": 5.0, "review": "I had the original version of Apple TV in my living room and enjoyed it for the last 4 years.  I had been considering getting the latest vesion and when I built out a media room in my house I added another.  Love this product, fast easy to setup and once I connected to my Itunes account all my music, movies and pictures were available instantly through the cloud.I use one to run my home media/music through the house including 16 speakers and the older one in my media room and couldnt be happier.  im a Prime member so it was a no brainer to order from Amazon.Functionally this unit is much faster, about 1/4 the size and easier to run than the original box.  I would recommend to anyone wanting a seemless media experience. 5 stars", "verified": true, "helpfulness": "0/0", "author": "Kirby's North"}, {"rating": 3.0, "review": "was working great until now when it doesn't detect my wireless signal (and that too from an apple router!). which means i can't do airplay from my ipad. otherwise it works great on the wired connection. let me try taking it to the apple store...", "verified": true, "helpfulness": "0/0", "author": "Rajeev Krishnan"}, {"rating": 5.0, "review": "The product exceeded my expectations apple tvI have no product to give it 5 starsthe product has a good presentation", "verified": true, "helpfulness": "0/0", "author": "Jaime Ramallo Torrez"}, {"rating": 5.0, "review": "LOVE my APPLE TV! Only improvements I would request is the ability to mirror History Channel App and Amazon Live Streaming app from my iPad, and an actual Safari browser built into the box instead of having to mirror from another device.", "verified": true, "helpfulness": "0/0", "author": "Greg Scott"}, {"rating": 5.0, "review": "If you have an Ipad, Macbook, or other Apple device with AirPlay, you simply have to have this connected to your network and TV.  Being able to display what I'm looking at on my Ipad is worth the $100 by itself.  HBOGo, Cinemax apps work flawlessly going from my Ipad to my AppleTV.  Works just as good with my Macbook Pro and Imac.  COULD NOT BE HAPPIER WITH THIS PURCHASE.", "verified": true, "helpfulness": "2/2", "author": "Doug F \"Go HAWKS!\""}, {"rating": 4.0, "review": "To be honest, this is being written on a year-old Macbook Pro. I also own an iPhone, a Time Capsule, an OG Apple TV... and between myself, significant other, and the friend crashing on my couch, the number of fruit-based electronic devices in my household currently numbers at... ten? Eleven? Fact is, I might be slightly biased.But! Another fact is this gadget may finally be the thing that convinces me that we're living in The Future. And why is that, you ask?AirPlay.See, the thing is that Apple has pretty much nailed the concept of dead-easy streaming to the big screen mounted on the wall (just like yuppies!). This has kind of changed my life. I consider myself, if not an audiophile, then at least an audio appreciator, and love and cherish my vintage, freshly re-foamed JBL loudspeakers. I have managed to basically make my entire A/V setup disappear from my living room as a result of this little box. I plugged a chip-amp in behind those speakers, and then just started using AirPlay. For everything. Soon, I'll have the ATV mounted behind the TV and poof! That's it! If I want to listen to a CD (yeah, I have a CD collection) then I'll pop it in the laptop and beam it over. Same with a DVD. Or radio from my phone. I select the ATV and those JBLs start pumping.And it gets even more exciting when someone has photos to show us or a spontaneous YouTube-off. All of it just goes straight to the TV, reliably, no fuss - just the occasional compression artifacts faintly audible.And that's the thing. It's not perfect. It's wireless, so I'm not wringing the ultimate in audio quality out of my ones and zeros. It's mostly a dumb box, requiring I have my laptop open if I want to listen off of my iTunes library, or buy things ala carte off the iTunes store more often than I intended to. I also really really wish I could add services to it. And honestly, if you're not as brand-centric as I somehow became, it's probably won't be so magical (what with AirPlay being proprietary and all). But it does 1080p, and has been the the trigger to completely upend my attitudes and behaviors surrounding media consumption and my home. I watch more videos. I listen to more music. I present things to my friends and learn more as a result. And that's not bad for the little black hockey puck once known as Apple's forgotten side project.TL;DR - I own a lot of Apple product, so this fits perfectly with my life in The Future, full of streaming and robots that fold my laundry. Might make less sense if you own disparate electronics. I'd say to throw one in the cart next time you buy a Mac.", "verified": false, "helpfulness": "0/0", "author": "Chris G"}, {"rating": 4.0, "review": "My Macbook Pro is a year and a half old, so I can't use AirPlay to mirror my computer screen on my tv. I was warned that that would be the case, so I can't really complain about that. I will complain that I have a large room and the sensor on the Apple TV has a hard time picking up the signal from the remote. It can be really annoying.Aside from that, Apple TV is incredibly cool, especially if you have Netflix or Hulu Plus. I hook up my laptop to my stereo, but I know my brother uses his Apple TV to play music from iTunes off of his TV, which is also a nice feature.", "verified": true, "helpfulness": "0/1", "author": "KS"}, {"rating": 4.0, "review": "I initially go this to watch videos and try to eliminate cable.  It's not enough.  While I'm a family with three iPhones and two iPads, it's not compelling enough to have just the Apple TV.  Apples holds the reigns too tightly to be the sole device.  They are slow to add channels and functionallity.I also have a Roku and it provides much more functionallity and a lot more channels.  WIth the use of PlayOn software on my PC and the Roku I have all of the TV I want (recorded, not live) along with Netflix and all of the other video services.", "verified": true, "helpfulness": "0/0", "author": "Guitarplayerbp"}]