[{"rating": 5.0, "review": "This apple TV supplements my apple ecosystem. Great user interface.  Able to stream movies from Netflix and use Apple Airplay to watch stuff (pictures, videos) on all our iPods, iPads and iPhones.  Plus it also supplements our free over the air (OTA) tv since we dumped basic cable TV.", "verified": true, "helpfulness": "0/0", "author": "Cessna89811"}, {"rating": 5.0, "review": "I use it pretty much every day ranging from using it for music to netflix or watching a long youtube video. if you have a mag you can send music, video to the apple tv instead of watching it on the computer, you can also control it from any ipod,iphone,ipad as long as they are on the same network  my dad liked it so much i got him one for fathers day and he really enjoys it as well..must get", "verified": true, "helpfulness": "0/0", "author": "Paramedicc"}, {"rating": 5.0, "review": "The Apple TV is a fantastic, affordable device to add to your home theater setup. It allows you to:- Rent and purchase from Apple's vast digital library of movies and TV shows;- Play music from streaming radio stations (of which there are hundreds to choose) or your own music if you sign up for iTunes Match;- Browse your pictures from photo stream (quick tip: create a \"shared\" photo stream titled \"apple TV\" and add pictures from your phone or iPad that you want used as a screen saver, then set the Apple TV to use that stream for screen saver purposes);- Setup a home media library and have all of your movie collection at your fingertips (GREAT for kids, no more scratched or lost discs, and material can be censored with parental controls);- Use AirPlay to stream audio or video to your TV effortlessly (great for playing services like Spotify or watching video stored on an iPhone or iPad);- Use NetFlix, HBO Go, YouTube, Hulu, or any number of other supported services directly from the device with clean, easy-to-use interfaces and 1080p & surround sound support.There's no question that if you don't own any Apple devices the value of the product diminishes a bit. There are other devices that will play NetFlix, HBO Go, YouTube, etc., that will stream home library content (although most of those don't allow for parental controls if they're using DLNA as their backbone technology), etc. But if you have just one Apple mobile device - a phone or a tablet - the Apple TV is hands-down worth purchasing. It seamlessly integrates into your environment and allows you to enjoy the Apple ecosystem on your television, and AirPlay is such a convenience.", "verified": true, "helpfulness": "1/1", "author": "Kelub"}, {"rating": 5.0, "review": "I got this delivered about a week back.  Was very very easy to hook it up.  Only thing I thought was if they would include HDMI cable with the package, it would be more ready to use.  Love the fact that I just play things from my iPad/phone and they magically play on my TV.  I even was able to hook it up to my 5.1 Dolby Digital HTS.  It is awesome all the way.. at least now.  If I do see something later worth mentioning, I will update later again.", "verified": true, "helpfulness": "4/4", "author": "A. Bapat \"Gadget Savvy\""}, {"rating": 5.0, "review": "At first, it had a hard time connecting with my iPhone.  But by the next day or so, it worked great!  Been happy with Apple TV ever since.", "verified": true, "helpfulness": "0/0", "author": "David C. \"notredave\""}, {"rating": 5.0, "review": "We love using our AppleTV and have completely moved from having cable to watching movies and TV through Hulu and Netflix, thank to this bad boy. The only downside (and not sure it's an Apple problem) is that we'd love if Closed Captioning was available.", "verified": true, "helpfulness": "0/0", "author": "The Hughdns"}, {"rating": 4.0, "review": "iPhones and three of these Apple TVs.  We've migrated from Windows over the last few years, much to the chagrin of my Microsoft employed brother in law and are more than satisfied with the move.The home sharing feature allows us to access all of our photos and videos which are stored on our Apple Time Capsule.  We can also throw content to the big flat screen from our various hand held devices and of course, access our music library and the various on demand services that Apple TV does support including Netflix and Apple's own iTunes store.  These functions were the reason I purchased this since we already had a Roku which provided the same content and then some including Amazon Prime and is also a great device.The remote control is a work of minimalist art which allows you to navigate the user interface with just a few buttons.  This matches the design of the unit itself which is a simple hockey puck sized black plastic box whose light weight allows for it to be mounted discretely with just some adhesive backed velcro.  You can also use your iPhone as a back up remote once you install the app.Over all, this is a great unit to add to an Apple household due to its ability to let you share content, access your iTunes library, etc..  However, if this isn’t important to you a Roku might serve you better.  Google also has a new streaming device on the market that certainly warrants a look.", "verified": true, "helpfulness": "3/4", "author": "Neil Flynn"}, {"rating": 5.0, "review": "I bought it to interface with my PC and IPad for displaying pictures video etc on my TV. Works well with Netflix Hulu etc. the ATV3 works well with HD HDMI CABLE IS NOT INCLUDED so 1 make sure you have HDMI connectors on your TV and pick up the cable.", "verified": true, "helpfulness": "1/1", "author": "R. Stewart"}, {"rating": 5.0, "review": "I have the Roku Player latest generation / Most expensive and while it is very good another 5 Star Item I find I prefer this for several reasons.1. This device has a manual sleep feature.2. This device does not get hot like the Roku Does.3. The quality of the streaming from Apple is second very good.4. The Quality of streaming from Netflix is Superb better than my Roku.5.Access to my Itunes purchases over the years very nice.6.Air Play and screen Mirroring very cool anything I can play on my laptop including instructional videos and materials for school can be placed on the big Screen.7. Built in UTube player very useful when looking things up.Things I do not like about the Apple T.V.1. The remote Apple likes to rely on style but it has exceeded itself this time Blending Style and being cheap have created a tiny  unwelcome easy to loose remote for the Device. The buttons are recessed into a thin aluminum rectangular remote that fits a child's hand better than an adults.2. Supply your own HDMI Cable one does not come with the Apple T.V.Things I like about the Roku Player better1. The remote is simply better it has earphone Jacks that allow you to watch T.V. without disturbing others.2. The remote feels like you actually have something in your hand and is great for playing Angry Birds with on the Roku.3. Unlike the cheapskates at Apple Roku includes not only earphones for it's remote but an HDMI Cable.4. Amazon Prime Video streaming. I guess greedy Apple does not want competition playing over their device. Too bad Apple tries to charge for everything I can only surmise that the only reason Netflix is available through it is that they knew they had nothing to offer without it.Overall worth purchasing.", "verified": true, "helpfulness": "5/7", "author": "Opinion Shared"}, {"rating": 5.0, "review": "I love it. Got rid of cable, got Netflix and using Family HBO & ESPN access. this is all we needed. Recommend to everyone...", "verified": true, "helpfulness": "0/0", "author": "B. Kara \"BK\""}]