[{"rating": 5.0, "review": "This product was shipped quickly and works just as described.  Plugged it in and within a minute was connected to the internet and away.", "verified": true, "helpfulness": "0/0", "author": "BillTheDad"}, {"rating": 4.0, "review": "We really like the apple TV and the price was good...but it doesn't come with a HDMI cable that it needs to work...they could have told us that!", "verified": true, "helpfulness": "1/1", "author": "James A Bottom"}, {"rating": 3.0, "review": "As the device itself look sleek and good, it don't have much app as others said.  If you have itunes account with lot of movies, then it may be useful.  I know this when i buy, the main reason i bought this iplay (mirror) and its not as good as i expected.  It should least have amazon instant etc.  Little disappointed as i have couple of iphones and an ipad.", "verified": true, "helpfulness": "0/0", "author": "Solaris \"SUN\""}, {"rating": 1.0, "review": "This product is severely limited in capabilities compared to a Roku.  It has the two major streaming apps, Netflix and Hulu, but that is about it.  I would not even consider this if you rarely purchase or rent anything from the iTunes store.  I purchased it strictly as a subscription based streaming device and am utterly disappointed.It does include AirPlay capabilities to expand the amount of content that the device is able to play, but this is only good in theory.  In reality AirPlay is an extremely finicky protocol and rarely works without any stuttering.  As it relies on communications back and forth between the sending device (iPad, iPhone, etc), it unnecessarily clogs up your network with traffic.  What they need to do is create dedicated apps for the Apple TV so that it takes out this intermediate process.I cannot recommend this device at all unless they bump up the apps available at least tenfold.", "verified": false, "helpfulness": "32/53", "author": "Sir Isaac Newton"}, {"rating": 5.0, "review": "I think it is a good produce to have when you want to watch more on your computer and TV.", "verified": true, "helpfulness": "0/0", "author": "Jan"}, {"rating": 5.0, "review": "It's the best thing we've bought since our first TV! I will never go back to cable!  Never! It's great!", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 3.0, "review": "Works ok but a roku will blow it out of he water. The only good thing that's better than roku is airplay", "verified": true, "helpfulness": "0/1", "author": "Andyr"}, {"rating": 5.0, "review": "I purchase the Apple TV, on a whim and have really fallen in love with it.  I have given up cable television completely and now purchase my TV per episode or season on this device.It was incredibly easy to set up and I've found that the picture quality is great, even on standard definition.  The HD is also quite good for something that is streaming.  The sound is also quite good.  I have the sound set up via optical audio into a surround sound system, and the sound is VERY clear.I use it for purchasing TV from iTunes as well as streaming Netflix.  What is really nice about purchasing TV shows and movies via iTunes, is that it preloads what you are watching as it streams, so if your internet connection slows you're quality stays the same.  (I should note however that this does not apply to Netflix, as the quality adjusts per your connection as with most other streaming devices).I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Captain Llama"}, {"rating": 5.0, "review": "Airplay is easily the coolest feature of Apple TV.  You tap the airplay button in spotify or any other app that supports it (youtube, videos, you name it) and it's instantly on the screen.I have it hooked up to my surround sound via optical, so even if my TV is off and I'm doing housework or hanging out in the backyard, I can adjust the volume and track right from my phone.Other than airplay, the entire system is smooth and intuitive.  You can sync a bluetooth keyboard as well for easier browsing.  I recommend the Kensington keyboard.", "verified": true, "helpfulness": "1/1", "author": "Robert A. Suarez \"Shadax\""}, {"rating": 5.0, "review": "somethings I would change, nothing that is worth writing about.  More than anything, this product has great quality!  I've been streaming Netflix from my Xbox 360 for two years now and even though it's only capable of 720p, my TV is only 720p anyways.  However, the sound and picture was dramatically better and noticed within the first ten minutes of watching.", "verified": true, "helpfulness": "1/1", "author": "Ryan Knudson"}]