[{"rating": 4.0, "review": "It was between this and the Roku LT. The new teardrop shape of the Roku put me off so I ordered this. We primarily use it for Netflix since we cut the cable.  The Roku LT has many more viewing options. I was put off a bit by the apparent necessity to register with Roku with a credit card. I don't want to register with my credit card to use this. I just have a relationship with Netflix. Apple definitely wants you to use their world of products but I don't see them as being price competitive with what is out there. It is easy to hook up, one HDMI cable and the power cord. It is always on but apparently energy conscious. Also, Apple products have a good resale value. If you are in the Apple world, you also have the ability to stream content to your tv with this device. Not important to me.  I would like Apple to loosen up the content of their system and allow me to add more channels. Ergo, the 4 star rating.", "verified": true, "helpfulness": "0/1", "author": "Voltaire"}, {"rating": 3.0, "review": "cant jail break it and probably never can, works great if you only want to use netflix, hulu  etc s", "verified": true, "helpfulness": "0/5", "author": "adam"}, {"rating": 5.0, "review": "I've never used a device like this as I have always just used cable boxes.  I wanted to be able to access YouTube on my television as well as Netflix.  This device was easy to install and set up.  The network connection has dropped twice in four months but I don't know if this is related to the device.  I am running a wireless-n network.  Not a big deal, simply unplug the device and plug it back in to reconnect to the network.  Ironically, this is the same fix for a lot of PC issues, eh?  Anyway, it's a nice little addition to the home entertainment setup and I use a Harmony 900 remote to control this guy.", "verified": true, "helpfulness": "1/1", "author": "Toy Picker"}, {"rating": 5.0, "review": "Makes no sense.  I have subscriptions to Hulu, Netflix, and Amazon.  I have an ipad, Macbook, and iphone.  I love Amazon instant movie...yet Apple decides to be re tards about it and not add this app.  I'm selling it and going to ROKU.  Why does Apple have to be so lame????  Wish I would have researched before I bought.My fault.  You can learn from my mistake.***********UPDATE**************  - I didn't understand how the product worked.  Duh.  If you have a MAC, or Ipad or Ipod, or Iphone, you can use whatever you're doing on on that device to put upon your tv.  I did not understand that...I just thought you had to use the apps on the Apple TV.My fault.  So I updated my review to 5 stars.  It's awesome.  Getting another.", "verified": false, "helpfulness": "4/20", "author": "Icepuck72"}, {"rating": 2.0, "review": "I hate that there is no update for netfilx to have post -play, it also has problems loading and playing pretty often", "verified": true, "helpfulness": "2/4", "author": "Dashiell Stratton"}, {"rating": 4.0, "review": "This is good as it gets. I had an apple tv now for a year and couldn't be happier. This product has only gotten better over time because Apple keeps adding more apps and improvements to the device. I believe that Apple will only continue to add better apps and more content because of its rumored interest into the tv market. I love being able to access all of my itunes music and playing it on the surround sound, the free itunes radio is decent too. I also hope that once more apps are created for the device that the user will be aloud to move and delete apps like on the ipad.", "verified": true, "helpfulness": "1/1", "author": "Caballo \"Jorge\""}, {"rating": 5.0, "review": "Let me preface this review by saying an Apple TV will really only be fully beneficial to you if you already own an Apple product, specifically a Mac computer/laptop or iPad. The Apple TV was given as a gift to my fiance and I and we absolutely love it. I have some experience using them at work, but I didn't know it's full functionality until I had one at home.From the Apple TV, we access our Netflix account and stream content to the TV and also watch movies that we have stored on the laptop. Through both Apple Mirroring and the home sharing, we're able to put the movies on my hard drive into iTunes, which is connected to the Apple TV. No more watching movies/tv shows on my 13\" MacBook Pro!You can also rent and buy movies and have them stored on the iTunes cloud directly from the Apple TV, which is another awesome feature.The best thing about the Apple TV was that it was really easy to set up. I literally plugged it in, connected the HDMI from my TV to the Apple TV, went to the appropriate input, and the directions came up on the screen and it was smooth sailing from there.I'd highly recommend the Apple TV to anyone, especially if you already own Apple products.", "verified": false, "helpfulness": "1/1", "author": "Peter James Schauer"}, {"rating": 4.0, "review": "Initially, I was disappointed in the Apple TV (ATV). Every show, every item cost something! I felt I was on a budget airline. I originally purchased it because of an Internet article which stated that PBS was coming. What I saw after installation was old shows which wanted $1.99-$9.99 to watch.Then came an Internet update two days ago which added a PBS icon to the main screen. Now, everything under that icon is free! This is what I was expecting in the first place; I just didn't wait long enough, it seems. Although the resolution is not HD, it's OK. I still don't know how much of a lag there will be between actual broadcast and ATV availability (Downton Abbey, e.g.) but my impression of ATV has gone from one star to 4. I hope they introduce more free stuff.", "verified": true, "helpfulness": "8/8", "author": "R. Fidelman \"MIS Guy\""}, {"rating": 3.0, "review": "Not as easy to install as I expected it to be. Most Apple products are so intuitive, you don't even need to read directions. Not so with this. However, once installed, it works great.", "verified": true, "helpfulness": "0/1", "author": "marykate \"marykate\""}, {"rating": 5.0, "review": "We are huge fans of this devise, especially with the upgraded software which now puts iTunes Radio on your Tv and home theater.  We have bought 4 of these so far and giving them as gifts.", "verified": true, "helpfulness": "0/0", "author": "SLB"}]