[{"rating": 4.0, "review": "It's beautiful and small and fits very well on our living room.It works with our iPhone and iPad and it's very good for watching Netflix, Youtube and other websites.", "verified": true, "helpfulness": "0/0", "author": "rosemberg de souza rodrigues"}, {"rating": 1.0, "review": "Pretty disenchanted with what AppleTV provides for a supposed straming player. In typical Apple-fashion, it requires an iTunes account to access video in the cloud. AppleTV cannot access your UltraViolet library to access outside iTunes.Compared to other streaming video players, AppleTV is extremely limited. It is like comparing Windows phones to iPhones, but in reverse. AppleTV has a limited number of applications for viewing videos.Netflix is available and is one of the few apps that function at a 1.5 Mbps connection. Videos from iTunes DO NOT stream, they automatically attempt to download.I purchased this device for my wife believing it was of the same quality as a Roku. I was wrong, the 2nd generation Roku outperforms AppleTV.", "verified": false, "helpfulness": "1/3", "author": "Rick"}, {"rating": 4.0, "review": "Could use some refreshed hardware but still a great addition to any home theater system.  Perfect for hbo go and netflix", "verified": true, "helpfulness": "0/0", "author": "M. Couchman"}, {"rating": 2.0, "review": "I have 3 of these but this one (newer model) takes forever to send a move over my local network and all the others work faster!!! I did every fix and reset imagine able even to Genius Bar 45 minutes away.  No luck.  Suck a duck Apple TV 3.", "verified": true, "helpfulness": "0/0", "author": "Rena Hall"}, {"rating": 5.0, "review": "We purchased this apple tv box for our HD tv in our family room.  We use it all the time.  It does require that you have Internet capabilities on your tv (which most newer tvs already have).  We own several apple products and we are able to sync up our music, photos, Netflix, and Youtube accounts for tv viewing/listening.  We do still have a cable box too and we switch back and forth between the two.  We find ourselves using Netflix the most for children's tv programs and movies.  For the price, this has been a great buy.  I would buy it again.", "verified": true, "helpfulness": "1/2", "author": "KSparky"}, {"rating": 5.0, "review": "That is so easy controlIf you have ipad that is more easy!!!!!!!Hurry up get this one now than more easy your life", "verified": true, "helpfulness": "0/0", "author": "Hyunjae You"}, {"rating": 5.0, "review": "I finally took the plunge and gave up my cable subscription, thanks to apple tv. I am never going back! This is so easy to install and navigate and the choices for viewing are fantastic. Plus I am saving hundreds of dollars a year with no more cable.", "verified": false, "helpfulness": "1/2", "author": "Johanna Piper"}, {"rating": 5.0, "review": "This is the ultimate. Since i use Mac laptop, Apple tablet and iphone, aside from all the amazing channels, including my favorites, itunes festival/movies/music/tv, netflix, yahoo screen, vevo, youtube and many more, the \"Airplay\" features brings all of my itunes and anything i wanna watch on line plays directly on my 40\" TV. Simply Incredible.  No extra cable wires necessary. I can't live without it.", "verified": false, "helpfulness": "0/0", "author": "raymondshead"}, {"rating": 4.0, "review": "Wanted to dump cable tv but still have viewing options. Apple TV is great!  So much to pick from and compatible with our iPads.  Using antenna free TV and Apple TV has saved us $100/month.", "verified": true, "helpfulness": "0/0", "author": "Stacy K. Hasenstab"}, {"rating": 5.0, "review": "This is a good product that just keeps getting better with more content updated all the time.  I am about to cancel my cable bill because I rarely stray away from my Apple box.  If you want the local news or watch regular TV then it is a great enhancement for movies but if you are like me and don't watch the networks this is for you.  I use NetFlix and Hulu Plus and can watch pretty much whatever I want that was worth seeing on regular TV.", "verified": true, "helpfulness": "0/0", "author": "Robert Evans \"Digital Wave\""}]