[{"rating": 5.0, "review": "I ordered the product from this seller because of the very competitive price.I was able to track the package and was informed of the shipping progress.When it arrived it was with-in the expected time frame promised.The unit was complete and powered up just fine.There were no problems. I would order again from this seller.", "verified": true, "helpfulness": "0/0", "author": "Wade and Karen Jenkins"}, {"rating": 3.0, "review": "Very limited apps for this. We have a Roku and were given this as a present. Honestly, I would have taken it back to the store and bought another Roku if that was an option.It works well for Netflix and I assume pay per view movies, but doesn't offer a service for Amazon prime or various other channels. Seems to be severely limited in its capabilities, yet more expensive. Maybe if I had more Apple products, this device would better suit my needs.", "verified": false, "helpfulness": "2/2", "author": "kazper"}, {"rating": 5.0, "review": "I am enjoying my Apple TV. I've had it about 4 months and my kids 5 & 3 can use this much easier than the Roku. Since we already have other Apple products, this seemed very intuitive to all of us. Love that I can listen to my music and see my pics on my TV at the same time.", "verified": true, "helpfulness": "0/0", "author": "Angie Gibson-Pittman"}, {"rating": 5.0, "review": "This was a gift for my son. He is very pleased with it. It does what he needs and is compact.", "verified": true, "helpfulness": "0/0", "author": "Kim K"}, {"rating": 5.0, "review": "Every single TV in the house should have an Apple TV connected to it. It is the most useful and user friendly device of all. Stream from iTunes, Netflix, etc without glitch. Most of mine are wireless, one wired. Running wired clearly helps but the experience is not poor on wireless. Radio pairs great with Airport Extreme/Extreme.", "verified": true, "helpfulness": "0/0", "author": "Ron \"RR\""}, {"rating": 5.0, "review": "I use this all the time and it's turned my TV into something that I use way more now. If you have a Macbook that is capable of Airplay, the possibilities are endless.", "verified": true, "helpfulness": "0/0", "author": "M. Pang"}, {"rating": 1.0, "review": "It is up to the whims and fancies of Apple Inc on what would get added on this Box. I hate being locked down. People please get Roku or Chromecast as they are atleast much more open to developers.", "verified": false, "helpfulness": "2/12", "author": "Poonam Parakh"}, {"rating": 5.0, "review": "It is a great product. I mostly use the airplay feature and love it.It does not have the limitations of other products like chrome cast.", "verified": true, "helpfulness": "1/1", "author": "ars"}, {"rating": 1.0, "review": "Ahhh Apple TV. Such a scam. Apple got you. Well, at least the person who bought this for me as a gift! Because you bought an iphone or ipad, do you think this is going to be a difference maker? If you own nothing but a tv and an ipad, then go for it haha but if you own a computer and you buy this, well, YOUR FAULT. this is 2013 2014 people! They are scamming the clowns that don't know you don't have to pay to watch movies and shows!!Does anybody else know how to hook a computer up to your tv other than me????!!!?? This Apple TV is a gimmick for all people who PAY for streaming!! This is 2013 2014 people! Hook your computer up to your tv using a hdmi cord. If you don't have one, go get a video card with one. Cost ya 50$. Then, you can stream any movie free in hd through sites... YOU STILL USE NETFLIX??!?! THIS IS 13 2014 people!", "verified": false, "helpfulness": "2/48", "author": "Bryan Bristow"}, {"rating": 5.0, "review": "user friendly and fun! I canceled my regular cable tv because of this. Works good with Apple phone app. Thanks", "verified": true, "helpfulness": "0/0", "author": "Steve Steckert"}]