[{"rating": 5.0, "review": "This was exactly what I wanted and happy with my purchase from Amazon! :)  This was a better buy than in stores and did not let me down.", "verified": true, "helpfulness": "0/0", "author": "Erin Meehan"}, {"rating": 5.0, "review": "It does exactly what it is designed to do. It updated to the latest firmware and new menus. It has had zero problems since I purchased it. I use it mainly to show movies that I have on my MacBook laptop and for some presentations at our local Macintosh User Group.", "verified": true, "helpfulness": "0/0", "author": "bugsy \"bugsy\""}, {"rating": 5.0, "review": "I have a huge library of songs residing on iTunes, and once I purchased my Apple TV, I subscribed to iTunes Match and I had instant access to my complete library through my Samsung Smart HDTV with it's optional sound bar. It sounds incredible, and if I'm in the mood, I can actually shake the walls! iTunes Genius works great too, and I use it to create custom playlists. Some of my songs were added a number of years ago, and Match upgrades these to the highest bitrate automatically, which is another great feature. Anytime I purchase music on iTunes, it automatically shows up on my TV. The same goes for my pictures. I take one, and there it is, instantly, on my big HDTV. I wish Apple would provide me with access to Amazon Prime, but since it's available through the Samsung Smart TV, it's not a big deal, but for convenience sake, it would be nice. Apple just added their new Radio feature, which I happen to like too. Overall, I've been very pleased with it for the last year and a half.", "verified": false, "helpfulness": "0/0", "author": "B. Cable \"Kebles\""}, {"rating": 5.0, "review": "Like this little guy.. Apple made this product well and it meets every things I need it to do.. super easy to setup, configure, and operate.", "verified": true, "helpfulness": "0/0", "author": "J. Middleton"}, {"rating": 5.0, "review": "Works perfectly! Connected to my tv with hdmi, used optical-audio cable to connect it to my stereo, used cat7 ethernet cable for network connection, the result: perfect! If you want to connect your ipad/iphone to mirror the image to your display this is the correct item, it comes with lot's of installed apps (youtube, espn, ...). works perfectly with 1080p. with homeshare, watch everything from your itunes library or computer", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Compact, low power, simple to operate, with a convenient remote control. A nice product with a surprisingly low price given that it's designed by Apple.", "verified": true, "helpfulness": "0/0", "author": "Robert Hollyer"}, {"rating": 5.0, "review": "If you have an Apple laptop or iPad or iPod with bluetooth this is the way to go.  Forget the Roku or the Google thing.", "verified": true, "helpfulness": "0/0", "author": "Pogue Mahone"}, {"rating": 5.0, "review": "This is the coolest little black box you will ever own.  It just works.  And all of a sudden you're watching streaming video, Netflix, mirroring your phone, iPad, or computer screen, and more. I'm buying some more.", "verified": true, "helpfulness": "0/0", "author": "L. Asher \"Director, School of Visual Concepts\""}, {"rating": 5.0, "review": "This is a small unit easily connected to any HDMI capable device. It allows you to mirror your itunes from any device. The one drawback is that you can't stream non-itunes videos from your computer. It has a bunch of applications preloaded (Netflix, Hulu, Vudu etc) and the remote works like a champ. You can also download a remote app for your iphone/ipad which makes controlling the system very simple. I love this little box.", "verified": true, "helpfulness": "0/0", "author": "K. Culleton \"Avid Biker - RAGBRAI rules\""}, {"rating": 5.0, "review": "if you have apple products this is a no brainier. If you use Amazon cloud instead of i tunes get the Roku 3 it has the amazon app. I thought I could get away with using the apple air share function to watch my Amazon movies, you can but there is a downgrade in picture quality. And unless you use apple products the Roku blows apple TV away with the shear amount of channel options. Had I done more research I would have gotten the Roku 3 first. But this is still an ecellent product does everything within it's description.", "verified": true, "helpfulness": "0/0", "author": "Jeff Greenberg"}]