[{"rating": 1.0, "review": "this device is frustratingly restricted. No use taking it. Itunes are rediculously costly, u get same thing cheaper  at other places.", "verified": true, "helpfulness": "0/9", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Obviously this is a great device to possess...it's Apple. However, on top of being able to conveniently purchase this product, I also got it at a discounted rate....I'm Loving this!", "verified": true, "helpfulness": "0/0", "author": "Shawanda"}, {"rating": 5.0, "review": "I'm an Apple share holder but I have to admit I didn't expect what happened when I hooked it up. Homeshare worked wirelessly between my Windows 7 PC with iTunes and the Apple TV. But guess what? The internet shuts down for all the PCs, including the one I have iTunes on. And it's not easy to get it going again. After Googling it, it appears that a lot of other people have the same problem. It has something to do with my router which is a Linksys WRT54G and the IP address. You know what, it should be plug-n-play and it isn't in my case, and I'm not an Apple geek who prefers to spend his life trying to fix what shouldn't need fixing. I suspect if you have a Mac or iPad you won't have this problem, but if you have what I have, you probably will be unhappy. On the plus side, playing your iTunes content through the system or ordering content through Netflix, etc., is very cool. It is the future so I'll keep it and wait until I have a day to fix what shouldn't have to be fixed.UPDATE: Aug 2013. I moved and now have a new comcast router/modem combo and the \"shuts down the Internet problem is gone. After many month I really like the Apple TV, especially the iTunes music capability and YouTube. It is well worth the money when hooked up to your TV and stereo. The older modem/router was the problem. Now my PCs and iPhone/iPads work fine.", "verified": true, "helpfulness": "0/0", "author": "lakesaintclair"}, {"rating": 4.0, "review": "I purchased this about a month ago.For some reason the wireless connection would not connect, so I just ran an ethernet cable to it.I hope that when I actually have the time and connect the wireless it will work and I am not stuck with a product that does not function properly..Otherwise Apple TV is the way to go!", "verified": true, "helpfulness": "0/0", "author": "alwaysfun"}, {"rating": 5.0, "review": "The setup is extremely easy.  The family has gotten more use out of the Apple TV in the first month, than the Roku we had over a year.", "verified": true, "helpfulness": "0/0", "author": "ernst"}, {"rating": 5.0, "review": "I had this item just yesterday, I liked so much, I can't believe that I stayed without it for all this time!", "verified": true, "helpfulness": "0/0", "author": "John Blue"}, {"rating": 5.0, "review": "I love everything about the product. Zero complaints. It's not often you can say that! Setup accessing my iHomeServer was brainless.", "verified": true, "helpfulness": "0/0", "author": "MM"}, {"rating": 5.0, "review": "one word... Awesome. It's got Hulu and Netflix pre loaded, all you need is an internet connection (faster internet prefered, above 3mbps) for streaming from Hulu or Netflix. I love the fact that you can stream the movies right from your iTunes account to the TV.The CONS: If you want to stream movies from your computer, you must have iTunes running in the background and be able to connect to it, otherwise you cannot watch them. If the program is closed, you lose the connection and the movie turns off.", "verified": true, "helpfulness": "0/0", "author": "Nate-G"}, {"rating": 5.0, "review": "As described, well packed and arrived on timeWould recommend to anybody, very satisfied with the service. Will use the service again.", "verified": true, "helpfulness": "0/0", "author": "Stanislaw Zdanewicz"}, {"rating": 1.0, "review": "I admit that when I first purchased the Apple TV just over a year ago I was extremely happy with the product.  It worked flawlessly - AT FIRST.  AirPlay was fantastic (that still works) - had no problems streaming Netflix - was easily able to Home Share and stream music and movies from my account - then, something changed.  I updated the software - everything went downhill from there.  Cannot stream from my iTunes account (home share) which is initially why I purchased the Apple TV (says I need to turn homesharing on - it's on! - tried everything to get it to work, but it won't).  Next, Netflix stalls.  Doesn't stream as it used to - flawlessly.  Airplay still works, but everything I bought the Apple TV and loved the Apple TV for no longer functions and with each update I hope the issue is fixed, but three updates later - nadda.  Apple Support isn't an option because I won't pay for it.  It should be free. Forums echo similar concerns that I've expressed.  I ended up purchasing a Roku and couldn't be happier.  Hasn't failed me yet - works perfectly - so much so that I bought another (really, for the price of the Apple TV you can get 2 Rokus).  My Apple TV is a useless paperweight which is disheartening.  I am a HUGE Apple fan - own iPads, iPhones, etc.  Love them - but I cannot endorse this product until Apple makes some serious improvements.  On this one - Roku wins hands down!!", "verified": false, "helpfulness": "31/42", "author": "Troy"}]