[{"rating": 2.0, "review": "It does not work about 10% of the time.  I have two of them, and they just don't work right.  Constant failures when using netflix and Hulu....videos refuse to play and images do not load.  I even have issues with iTunes movies that I have purchased.  Many times I use my iPad and share the screen to my appletv...this sometimes gets around the error...but even the screen sharing is hit and miss.  When they don't work I take it as a sign that I do not need to be watching tv.", "verified": true, "helpfulness": "1/1", "author": "Blake"}, {"rating": 1.0, "review": "I have an all Apple ecosystem at home, which I love, but this is without a doubt the worst product Apple has ever made. The Apple TV never recognizes my devices, or vice versa. I've spent so much time on their troubleshooting page which is equally useless.", "verified": true, "helpfulness": "0/1", "author": "Injustus"}, {"rating": 4.0, "review": "I like my Apple TV.  Works well with my iTunes movie library (although there have been three occasions when I had to reboot because  \"server was unavailable\"--it became available signing out and signing back in).  I also love my Amazon Prime, which I probably use more, and Flixster, which has most of the Ultra Violet movies (some of which are iTunes linked, some like Sony and Fox, which aren't) received as digital copies.  I just wish I could watch my iTunes library on Amazon, and my Amazon library on iTunes, and my Ultra Violet movies on both in a way better than now.  They really need to share platforms.  (Does it really matter where the movie comes from?)", "verified": true, "helpfulness": "0/0", "author": "BlueBonneville"}, {"rating": 5.0, "review": "Apple....works as described. Good service so far.", "verified": true, "helpfulness": "0/0", "author": "Lockmaster"}, {"rating": 2.0, "review": "Really cool piece of technology, but I returned it because mostly every app requires a subscription that wasn't compatible with my provider. I also tried to update the software a bunch of times and it never worked. I really wanted to like this, but it was a big disappointment.", "verified": true, "helpfulness": "0/2", "author": "Alejandro Murias"}, {"rating": 5.0, "review": "A great piece of technology for apple lovers. Steam iphone and ipad directly to your tv is the biggest selling point of this item.  It has access to the usual items like netflix, HULU, and all that as well.  The picture quality is great as well.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Schiotis \"Liquid Nick\""}, {"rating": 5.0, "review": "Love this product.  Even got rid of cable!", "verified": true, "helpfulness": "0/0", "author": "Linda Fazio"}, {"rating": 4.0, "review": "Works great and fast shipping", "verified": true, "helpfulness": "0/0", "author": "Allen V. Jayme"}, {"rating": 5.0, "review": "Love the apple tv. Convenience from iPhone or i pad.", "verified": true, "helpfulness": "0/0", "author": "rmorris"}, {"rating": 2.0, "review": "Apple does not have a contract with Amazon so my Amazon Prime was useless. I switched to Roku. Love it.", "verified": true, "helpfulness": "0/1", "author": "Charles E. Cook"}]