[{"rating": 5.0, "review": "Was a nice gift for my son.  Came promptly and just as ordered.  Thanks so much", "verified": true, "helpfulness": "0/0", "author": "missy b"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "rabin"}, {"rating": 5.0, "review": "Gift for grandson.  It was exactly what he wanted.", "verified": true, "helpfulness": "0/0", "author": "Mary Webster"}, {"rating": 1.0, "review": "As an Apple/Mac user, I decided to get an Apple TV to replace my Sony TV.  If I thought the Sony TV was bad, this makes it look like perfection.  The device worked well for the first day but, it has since lost all it's appeal.  It refuses to synch properly with iTunes and thus I have re-subscribe to podcasts evert time I use it.  I also have to restart it after every video I watch through Youtube app.  This occasionally fixes the problem and the video will play but now even that isn't working.  Tonight I had to log in and out of iTunes repeatedly in order for it to. Play my purchased videos.I wish I had read the reviews here before I bought it.", "verified": false, "helpfulness": "0/2", "author": "Chad Wiland \"Low expectations\""}, {"rating": 3.0, "review": "Received the appletv as a gift to replace my boxee which was the biggest hunk of useless garbage I've ever been unfortunate enough to own.The pros:Ethernet hookup and fast hd streaming, basically what it does it does wellThe cons:Very limited in apps and no App Store. In a mobile world it is embarrassing to compare an iPhone or iPad to an appletv. A huge gaping deficiency is amazon prime. I understand its strickly a financial decision from apples pov but its terrible for the consumer. It has the ability to airplay from the prime app on my phone or iPad but it's quite frustrating to give up the device to stream and drops the airplay quite regularly. The other huge con is the watch espn app it is horrid. It drops the sign in regularly and cuts out programming while watching games. Only chance to get it working again is to power cycle the Apple TV and sign in from scratch but it takes forever and often fails. I will be replacing with a roku soon just for its prime capabilities and because I know if anything new comes out that encroaches on apples turf I won't have access to it.", "verified": false, "helpfulness": "0/1", "author": "A"}, {"rating": 1.0, "review": "Apple tv did not do what it promised it would do.  I attempted to use Airplay to stream the Big Ten Network feed from the BTN2GO App on my ipad to my t.v.  It struggled to get a picture on my tv and then froze.  I also wanted to play the watchESPN app on my tv.  It would not load any content  Netflix loaded but was slow and the interface was awful compared to my ps3.I am returning this to Costco.  I don't know if this was a dud but I will not be finding out (unless Costco refuses to accept my return in which case I will be sending it in for a new one).", "verified": false, "helpfulness": "0/2", "author": "EB"}, {"rating": 4.0, "review": "I have two apple tvs and a roku.  There are things I love about both and things I dislike about both.  If you are heavily invested with music and movies/video in apple this is the right product for you.  Most of the channel options offered by both companies require a cable/satellite package but Roku provides more free channels.  You can share the screen of your other apple products with the apple tv.  Roku 3 has a similar option but I have a Roku 2 and don't know how usable it is with apple products.  I have let several of my friends barrow both products for a week.  After trying both products they have all bought Rokus. In my opinion, Rokus have a lag time from the time I click an item to the the time the Roku responds, which bothers me. Both have been adding more and more channels.  Roku does have more channels but I find I'm not interested in the majority of the content. I do enjoy the Roku workout channels and options.  Both products are great.", "verified": true, "helpfulness": "0/0", "author": "Cole B Lynn"}, {"rating": 5.0, "review": "Huge benefits from such a small item.  No one even knows we have it.  It sits beside the cable box and dvd player, but it definitely takes center stage when we're watching tv.  Easy to use.  If you can use an iPod or iPhone, you can use the remote.  We also love being able to mirror our iPad and iPhones to the TV.  Fantastic.", "verified": true, "helpfulness": "0/0", "author": "Eric Dale Kimbrell"}, {"rating": 3.0, "review": "Its okay. Good to have one if you have any of the apple products like IPhone, IPad or a Mac. Otherwise not much content on it. Also it lacks the bluetooth/WiFi Direct remote. Roku has much more content and I like the remote that comes with it as it works without direct view of the Roku box. Apple needs to improve its content on Apple TV. The only feature I like is the Air Play feature.", "verified": true, "helpfulness": "0/0", "author": "R. Singh"}, {"rating": 5.0, "review": "Use this everyday and love it.  It seamlessly works with our iphones, ipods, and ipads to stream video and contains a huge amount of content.  We mainly use it for Netflix and the audio and video quality is excellent and the entire system is very fast and never lags.", "verified": true, "helpfulness": "0/0", "author": "bward"}]