[{"rating": 3.0, "review": "Apple makes good products but I was hoping to stream hulu or NFL Sunday ticket to my Apple TV. Well those apps and many others do not allow for streaming video to Apple TV. It really only works for iTunes purchases and then make sure you have a fast internet connection because it takes as long as the tv show or movie to download it before you can watch it.It did not fit what I was looking for and wanted.  Make sure you know that it is limited before you buy.", "verified": true, "helpfulness": "0/2", "author": "Corey Maxon"}, {"rating": 5.0, "review": "It's like using my big screen tv as a remote monitor for my iMac. I am able to use my iPhone as the controller (although a very handy one comes with the Apple TV) and it lets me access a wide range of movies (including Netflix, etc.), plus my iTunes and iPhoto libraries and a lot more. A \"must-have\" for Mac owners.", "verified": true, "helpfulness": "0/0", "author": "Fulton Lewis \"FL in Florida\""}, {"rating": 5.0, "review": "Apple Products never let down. I have completely converted my home to Apple products and they simply perform better than any other similar products out there. Apple TV is great for the whole family and integrates with all our apple products.", "verified": true, "helpfulness": "0/0", "author": "onsceneinc"}, {"rating": 5.0, "review": "enjoying the apple tv.....the main advantage of this is, it allows for airplay.......which doesn't require any cables.....and also has build in some apps.......loving it..", "verified": true, "helpfulness": "0/0", "author": "Rad"}, {"rating": 5.0, "review": "It was a gift and the recipient loved it.  Since I have never seen it, it would be very hard to say more.", "verified": true, "helpfulness": "0/0", "author": "Russell Appleby"}, {"rating": 5.0, "review": "If you are an iPad or iPhone owner and do not have one of these, get it now!  This is a great device and so easy to use.  I was also able to program it into my Logitec RF remote and put it in the other room with the other devices.  We love it and now it has Amazon streaming and HBO on demand!", "verified": true, "helpfulness": "0/0", "author": "Potomac Hokie"}, {"rating": 3.0, "review": "The best feature that I like about it is being able to view movies from Netflix.  Logging offf was a little complicated at first but I am getting use to it.  I thought that this Apple TV had Pandora on it and am disappointed.  I have enjoyed it so far.", "verified": true, "helpfulness": "0/0", "author": "Laura Arenas"}, {"rating": 5.0, "review": "I should have bought one of these magic black boxes when they first came out. Wow, what a cool toy.  If you have any Apple IOS devices, this is a must have.  Don't waste your money on buying a \"Smart TV\", spend the $99 and buy an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "john w. gould"}, {"rating": 5.0, "review": "This is my second Apple TV.  I had one of the original ones and this is a definite improvement over what was a great product to start with.  My only complaint is that you can't stream StarzPlay or Showtime through it yet, just HBO.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device allowed me to tell my cable provider to gargle my sack.  My household has been free from an ever increasing cable bill for several months now, and we couldn't be happier.  I chose the Apple TV because I have a lot of Apple devices and the integration of features is great, especially being able to stream content from my iMac to my TV.  If I wasn't  already immersed in the Apple \"eco system\", I probably would have chosen the Roku unit, which has some nice conveniences not available on the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Eric"}]