[{"rating": 5.0, "review": "Given my needs, this was the most versatile set-top box I could find. I wanted something that could play Netflix, Amazon Instant Video, Pandora, and my iTunes music collection (over 3000 songs). I am eager to explore some of the other channels available, particularly the Disney and PBS Kids channels for my son. While I don't currently hold subscriptions to Hulu Plus or MLB.tv, having those available were bonuses, as they are services I could see using in the future. The fact that Apple TV gave me the ability to both stream my music content AND mirror streaming from my Mac, iPhone or iPad (which makes up for the lack of Amazon and Pandora as dedicated channels) was my deciding factor.Setup was incredibly easy, and the remote functions/interface are fairly intuitive. (Note, when streaming Pandora, the center select button will pause the music but NOT exit the screensaver.) The small footprint and sleek design are also pluses, as my space for electronics is minimal. Fire TV, Roku, and Chromecast were all considered, but this gave me the simplest of all worlds.", "verified": true, "helpfulness": "0/0", "author": "RCRoss"}, {"rating": 5.0, "review": "I love my Apple TV. Only wish the price would come down so I could have two. One for the guest room.", "verified": true, "helpfulness": "0/0", "author": "Joseph F. Corson"}, {"rating": 4.0, "review": "Excellent connectivity with other Ios devices.  Would love to have a customizable startup screen as we use in a classroom environment where we don't want movie adds displayed.", "verified": true, "helpfulness": "0/0", "author": "Mark Smylie"}, {"rating": 5.0, "review": "Best $100 I've ever spent!", "verified": true, "helpfulness": "0/0", "author": "Little miss lu"}, {"rating": 1.0, "review": "miserable, to use you must remove power and power on again. every time !", "verified": true, "helpfulness": "0/2", "author": "Valentin Mayer \"maverick\""}, {"rating": 3.0, "review": "Apple TV is very good but I must say I like roku better for my needs.", "verified": true, "helpfulness": "1/1", "author": "belinda hardesty"}, {"rating": 1.0, "review": "This is our second apple tv and we also have had a couple of Rokus. This apple tv constantly has connection issues. It will stream a movie from a computer or the internet and then simply lock up. The movie will no longer play nor will any other. At some point, usually not the same night, we will be able to watch again. Resetting does not seem to help all the time and all of our other devices have no problem connecting to the internet or the network. The laptop right next to the apple tv can stream the same movie that the apple tv cannot.We have never had the same problem with the Roku although the apple tv is much more durable (one time I wish I had something that was not durable). Both Rokus we had lasted little more than a year.We have also had other issues with this apple tv. For instance the Netflix icon and ability to connect to Netflix disappeared. We can connect to Hulu but not Netflix.We may have just gotten a lemon but it has been a lot more trouble than it is worth. We most often simply watch on a computer or on a screen hooked up to a computer. We have problems with it close to half of the time.We also have found Apple to be less than helpful in trying to solve the problems.", "verified": false, "helpfulness": "16/17", "author": "STOAK \"soffak\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Sarah M"}, {"rating": 5.0, "review": "I really enjoy this, has pays for itself after a month of cable.", "verified": true, "helpfulness": "0/0", "author": "William D. Norris"}, {"rating": 5.0, "review": "EXCELENTE", "verified": false, "helpfulness": "0/0", "author": "liliana castro"}]