[{"rating": 5.0, "review": "An awesome product that rocks all the time, you know Steve designed it for people just simple and good. Enjoy", "verified": true, "helpfulness": "0/0", "author": "Heiko R Brueckner"}, {"rating": 5.0, "review": "Easy to use. Easy to use with iPhone, iPad & PC through iTunes. Pulls in any recent purchases from iTunes store (movies & songs) and makes them available through iCloud along with any photos you've taken.", "verified": true, "helpfulness": "0/0", "author": "Jamie Stoll"}, {"rating": 4.0, "review": "Excellent product.  Ditched the expensive cable bills and started steaming content from netflix, hulu, etc. product works awesome.  Small, discrete, in line with the top notch quality you expect from apple products. I DO wish apple and amazon would stop the feuding and exclusivity rights war to their content, however, as I cannot stream ANY amazon prime content through this and that (quite frankly) sucks.  I'd have to reccommend roku if that is your desire ( and I  can only go by the feedback I've read as I do not own one) as I understand yo can stream ANYTHING through them.  If you want an awesome product and do not care about streaming amazon prime content....buy this & you will not be disappointed. 4* rating due to inability to stream amazon content , otherwise would be a 5* product.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is the Apple version of a Roku streaming device. Integrates beautifully with my ipad, macbook pro, iphone, etc. What more can I say, Apple has done it again!", "verified": true, "helpfulness": "0/0", "author": "Centroid_314"}, {"rating": 5.0, "review": "Setup & navigation couldn't be easier. Features are phenomenal. Airplay does more than I had hoped.  They've yet to disappoint me.", "verified": true, "helpfulness": "0/0", "author": "B. Cooper"}, {"rating": 5.0, "review": "I love my AppleTV. I use it frequently and love that I can take it when I travel.  It easily connects to any tv or projector.", "verified": true, "helpfulness": "0/0", "author": "Lou Ann Aepelbacher"}, {"rating": 1.0, "review": "I have Apple TV set up in our bedroom running off the wireless network in my apartment. The router is maybe 12 feet away with no metal walls or unusual obstructions. My internet connection is Comcast 20 MB, I usually have around 24 MB at any given time.Here's why you shouldn't buy this heap:1, In order to run anything from your pc to the Apple TV you must install Itunes and have any songs, movies etc. in a play list on Itunes. Oh and by the way, IT DOESN'T WORK. There are complaints all over the internet about it. There are attempts at work arounds and techniques to make it work, but none worked for me. Still, as it stands, it will not stream anything from the pc which is 50% of why I bought it ... lame.2. At times the Apple TV will suddenly decide that it doesn't want to work with netflix. Understand I stream netflix just fine on my Xbox a few feet away. It will give an error message blaming netflix and says to try again later.... at the same time I can walk over to my pc or Xbox and stream Netflix just fine.The ONLY positive things I can find about the Apple TV are:1. When it does work, it streams well. I've used Media boxes that buffered way too much during a program. The Apple TV buffers once and then doesn't interrupt the rest of the program.2. It's pretty easy to set up and has a very sensitive remote that responds well. Navigation is pretty straight forward.I bought it because of a lot of positive reviews. But just like my experience with other Apple products, they are over rated. Is 100+ bucks worth it for this? You decide. It's not in my opinion. You can do better, Apple.", "verified": true, "helpfulness": "0/4", "author": "Honest B."}, {"rating": 5.0, "review": "UPDATED 6.3.13 after having this for about a month I realize that this requires alot of bandwith which with my limited internet access due to being in a rural part of my state and county I am finding that streaming movies from Itunes is buffering alot and I have other devices such as blu-ray player, Roku 3 and such that I have had no problem with before. I'm returning and going back to my other devices.I love this APPLE TV due to the fact that I have nothing but trouble with my ROKU players over the years...I'll try to explain...I'm a subscriber of HULU PLUS I watch probaly 75-80% of my TV programs on here than watch LIVE or on my DVR since I hate my cable company so much but my wife doesn't want to do without it and we live so far out in country and local TV stations that we can not pick up with Antenna without getting expensive equipment or other means... I don't watch alot of TV like I use to but I like the HD for sports programming due to the fact that not ALL major sports are on TV due to blackout and other regulations..but enough of that HULU has worked flawlessly on this device (unlike it on ROKU) the APPLE TV does not have all the channels on ROKU but to be honest there are too many channels on ROKU that I didn't watch anyways...the main ones for me is HULU, NETFLIX and an outlet to watch movies (ITUNES STORE have Apple ID with my Iphone).Hopefully one day soon they will add Amazon Video on Demand.(an email to customer service informed me that they have no timeline in place but they do have Apps on Iphones , Ipod Touch, and Ipads.", "verified": true, "helpfulness": "0/0", "author": "C. Manley"}, {"rating": 5.0, "review": "Awesome, able to connect my new macbook pro r to apple tv. Enjoying watching \"Once Upon A Time\" abc television show on it.  Great if you big supporter of apple products.", "verified": true, "helpfulness": "0/0", "author": "CaRo"}, {"rating": 5.0, "review": "love it.  good product, works well.  would buy another.  would recommend to friends.  product delivers what was advetized.  that it.", "verified": true, "helpfulness": "0/0", "author": "Edward G. Diesch"}]