[{"rating": 5.0, "review": "Easy to use and seamless integration with other Apple products.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is the second one we purchase de. It works great. Easy to install and gives us access to a lot of the services we have without a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Bklyn shopper"}, {"rating": 5.0, "review": "Great product! You will not be disappointed.", "verified": false, "helpfulness": "0/0", "author": "Claire T \"Claire\""}, {"rating": 5.0, "review": "I've had my Apple TV for a while now and I have to say, it is amazing. I ended up canceling my cable because I just use my Apple TV for anything I watch. It is perfect for all ages and very simple. It's also great that apple has created an app that allows you to use your phone or iPad as the remote because I have misplaced the remote several times and was glad I had a back up! I'm actually contemplating buying a second one because we move it to the living room when we have guests over. I would highly recommend this!!!", "verified": true, "helpfulness": "0/0", "author": "Bwilkinson17"}, {"rating": 4.0, "review": "I like it...great for a tv that you don't have cable connected to. Sometimes Netflix and or Itunes movie purchase is slow but I suppose that it due to my internet connection.", "verified": true, "helpfulness": "0/0", "author": "Victoria J. Alexander"}, {"rating": 5.0, "review": "Great product! Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "eFairDeal \"eFairDeal\""}, {"rating": 5.0, "review": "Best solution for non smart tvs", "verified": true, "helpfulness": "0/0", "author": "Melise"}, {"rating": 3.0, "review": "The Apple TV has two radio features: \"iRadio\" for internet channels and \"Radio\" for broadcast channels. Both features were working fine until Sept. 2014. That's when \"they\" pushed out firmware version 7.0. Since then, the broadcast radio channels just cut out after 10 minutes and display an \"Error\" message. Other users have complained about this problem on the company web site, but so far, there has been no acknowledgement or patch. There is an option to disable automatic upgrades, which I have now set, least \"they\" break anything else.", "verified": false, "helpfulness": "0/0", "author": "pbseven"}, {"rating": 5.0, "review": "good product but expensive", "verified": false, "helpfulness": "0/0", "author": "Jimmy  Balladares"}, {"rating": 5.0, "review": "Easy to use and so handy.  I got rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Graham Sutherlin"}]