[{"rating": 5.0, "review": "excelent equipment", "verified": true, "helpfulness": "0/1", "author": "Alejandro Alvarado"}, {"rating": 2.0, "review": "I received this product on a Saturday and by Sunday morning, it was broken. It kept showing me a \"restore Apple TV\" message after only using the product once for approximately 2 hours. And what's worse is that the restoring process for Apple TV requires that you purchase a Micro USB cable (that does NOT come with the Apple TV even though it is the only way you can restore it once it's broken). This process is extremely frustrating after I had JUST purchased this device. This is the third Apple TV I've purchased, and I've now had difficulty with all of them. Thinking about switching away from Apple products for this first time in my life due to the constant frustration with their devices!", "verified": true, "helpfulness": "0/0", "author": "Samantha Gibbons"}, {"rating": 5.0, "review": "The best  ever", "verified": true, "helpfulness": "0/1", "author": "Barbara concepcion"}, {"rating": 5.0, "review": "I have had an apple tv since 2013.  I love it.  I stream from Netflix and apple stores my movies so I stream my purchased movies as well.  I stream my tv shows as well because they have channels now on the apple tv.  With on demand and channels, why should I watch regular tv?  I love my apple tv.  I have one in each room.", "verified": true, "helpfulness": "0/1", "author": "SingleMom3"}, {"rating": 5.0, "review": "Love it, as long as you have Internet you really don't need cable!", "verified": true, "helpfulness": "0/1", "author": "Steven Gagnon"}, {"rating": 3.0, "review": "I have the fastest internet available thru AT&T; Uverse but experience slowness starting up different apps on the Apple TV.  I recently made the switch to the Amazon Fire Stick and have rarely went back to using my Apple TV.", "verified": true, "helpfulness": "1/2", "author": "Mark"}, {"rating": 5.0, "review": "Good addition to my other Apple products", "verified": true, "helpfulness": "0/1", "author": "David S. Rowe"}, {"rating": 5.0, "review": "Loooove it!  The quality auto-adjusts to network speed (and our changes a lot).  Exceptional quality product.", "verified": true, "helpfulness": "0/1", "author": "Real"}, {"rating": 5.0, "review": "What more can be said it's a APPLE", "verified": true, "helpfulness": "0/2", "author": "Rich B."}, {"rating": 5.0, "review": "Works as described and received quickly", "verified": true, "helpfulness": "0/1", "author": "David J. Costa \"artcme\""}]