[{"rating": 5.0, "review": "Made a perfect Christmas gift for my son.  He and his wife really like it -- fits with their Apple universe.", "verified": true, "helpfulness": "0/0", "author": "David Harper"}, {"rating": 4.0, "review": "It works fine, but some of the applications like Crackle get stuck and repeat the comercials. I hope this has nothing to do with the AppleTv. The remote could be improved in the way it works, however it is giving a great service. Thanks, Apple!", "verified": true, "helpfulness": "0/0", "author": "Alberto Nunez \"Alberto Nunez\""}, {"rating": 5.0, "review": "I tried all the rest, and in the end, the AppleTV, especially considering the constant updates and feature additions, is the best of the breed by a mile right now.", "verified": true, "helpfulness": "0/0", "author": "Timothy Wudarski \"timwux\""}, {"rating": 5.0, "review": "This little Apple TV packs a punch! There is so much contented that is streaming and it's amazing how many channels are free! It does cover the major channels like netflix,hulu,etc and best of all you can order movies cheaper then your current cable provider!. The key thing you must have is a great internet provider and a good wireless server to prevent any lag issues. I love mine and best of all I can unplug the unit if the kids have the tv and watch it on another tv in another room. It's a Apple so you know it's quality is outstanding!", "verified": true, "helpfulness": "0/0", "author": "Nor'easter"}, {"rating": 5.0, "review": "Apple TV is a stellar product. If you have a Netflix account you owe it to yourself to try one out but even if you don't, there enough content available via streaming these days (more being added all the time) so that it's a great value.If you have a nice HD TV adding a product like this or a Roku or both is a relatively inexpensive way to get excellent content on your TV without adding the monthly expense of premium cable channels.Products like AppleTV and Netflix are part of the disruption that will be the end of cable TV as we know it.If you have other Apple products (iPhone, iPad, Mac) using AirPlay to share content on AppleTV is an added bonus.", "verified": true, "helpfulness": "0/0", "author": "Richard Wanderman \"rwanderman\""}, {"rating": 5.0, "review": "I can now watch all my German TV shows over my I pad on my TV. This is so cool! I love, love, love it! Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Veepka"}, {"rating": 5.0, "review": "Like other things Apple this is easy to set up and use and works flawlessly.  The set up was super easy using my iPhone (or iPad) to touch the Apple TV and my user info. was transferred to it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "What to say - It's an APPLE!!! It is absolutely PERFECT and works like a charm.  Definitely BUY 1,2, or 3", "verified": true, "helpfulness": "0/0", "author": "KATHLEEN TAYLOR"}, {"rating": 5.0, "review": "The first thing you will notice when you open your package is the distinct Apple quality packaging. Inside the box is the Apple TV unit itself, an AC power plug, a remote, an instruction manual, etc. All of the components included with this unit, including the unit itself, are very well made, rock solid, and scream quality. The setup of the Apple TV is also quite easy. Apple TV is WiFi compatible, but I opted to plug an ethernet cable into the back of it to ensure quick buffering times. It also utilizes HDMI, which is a nice feature for premium video quality. Pretty much this Apple TV acts as a gateway between your TV and all of your iTunes media on the same network, among other things. For instance, you can listen to music on your TV, watch iTunes purchased movies/TV shows on your TV, etc. The Apple TV can also access YouTube, Netflix, HBO GO, and many other useful \"apps\" which makes it a very compact media center pretty much. I would recommend Apple TV to anyone who makes purchases on iTunes, has a Netflix subscription, enjoys crystal clear YouTube videos on the big screen, etc.", "verified": true, "helpfulness": "1/1", "author": "James Fish"}, {"rating": 5.0, "review": "We had one in the bedroom and use it so much that we got another one for the family room.", "verified": true, "helpfulness": "0/0", "author": "Katharina Truelove \"truelove\""}]