[{"rating": 5.0, "review": "These are amazing media boxes. I have had the 2nd generation version for quite sometime but this one blows the socks off it. Much better picture and better wifi speeds.", "verified": true, "helpfulness": "0/0", "author": "W. T. Woolsey \"Tw758\""}, {"rating": 5.0, "review": "Excellent Product and Price", "verified": true, "helpfulness": "0/0", "author": "Daniel Aguirre"}, {"rating": 5.0, "review": "Good gaget", "verified": true, "helpfulness": "0/0", "author": "Jhonatan Morel"}, {"rating": 5.0, "review": "Very smart device.  You can now have your iphone on your TV.  My only suggested would be for this to be wireless to the TV.", "verified": true, "helpfulness": "0/2", "author": "James Vincent"}, {"rating": 5.0, "review": "Worked as expected.", "verified": true, "helpfulness": "0/0", "author": "Artemesia"}, {"rating": 5.0, "review": "Disclaimer: I put this review in the wrong spot, sorry! I didn't bother checking which version I have - I bought mine back in 2010 or 2011, so this is for the older (720p) version. This should speak to Apple's commitment to this product, because updates have constantly improved this thing over time.Streaming: The reason I originally got this. I am all about digital media and connectivity, so the ATV really appealed to me. It started out very clunky and intermittently reliable back in 2010. I haven't even bought a new ATV and the software updates have made this smooth and useful. Back in those days, the movie had to be physically on your computer to stream. Now if you have the digital version from the BDD you bought registered on iTunes, or you bought it on iTunes, it will stream from the cloud - no download required. You can also do Airplay directly from the computer. And Airplay isn't just for music and movies anymore - you can use Airplay to turn the tv into your computer monitor while hijacking your sound system.Mirroring loses frame rate with gaming, so you won't use it for gaming on your tv. I just use the extended desktop mode for WoW, Starcraft, and Rome 2 TW to put the sound on 7.1 surround when I have the house to myself. I use this feature most often when I am just moving about the house or hosting a gathering. It's pretty cool to stumble on a cool youtube video and force everyone to watch it.AppleTV vs Cable: On AppleTV you get to watch your fav networks without a cable subscription. I personally only do HBONow ($15/m), and have Amazon Prime video ($99/year or $8.25/m), so my \"cable\" bill is $23.25/month. I get to watch network TV shows, various forms of news (stock, politics, and current affairs) and the History channel. To me, just having HBONow is enough to fill my evenings, and there are tons of shows on Amazon Prime video (it also does Netflix) when I just want to sit and veg out. Prime also feeds the kids more shows than they can watch, which is pretty impressive.The interface takes some getting used to. I always have my laptop with me, and the AppleTV remote also controls my MBP. Just go into settings and turn it off on your laptop and the irritation will cease. You'll have to open the right app to get to the station you want. You might not like it if you are one of those people that sits in front of the TV all day long. If you know what you want to watch before you sit down, this is much more suited to you. If you have an 'idea' of what you want to watch, it works too. If you just sit down and want to scroll through channels endlessly, you will probably get frustrated. The good news is that you don't have to cancel cable to try it out. For $70 ($99 when I got it) there are plenty of features that make this thing awesome.Video Quality: 720p. It doesn't sound good when you look at that number. 720p is ancient tech, right? Well, most people that come over don't recognize the difference in TV. That's because most TV you watch is just 'optimized' for 1080p, but you can't tell the difference between the two. You will notice the difference when watching newer movies. Blockbuster movies at 1080p still look great at 720p, but you will realize you're missing something. On movie night this won't replace the BDD player. Depending on your internet connection (you will want a robust connection for ANY streaming service), you might see this quality drop down a bit when buffering. It does this so your video isn't interrupted when you experience a lag spike. I have Comcast in Colorado Springs, and it happens pretty rarely. It doesn't go unnoticed, but it isn't enough to for me to call the cable company and trade my $23.25/m for $125/m.", "verified": false, "helpfulness": "0/0", "author": "Robert C. Mustain"}, {"rating": 4.0, "review": "I read some reviews stating that the Apple TV was very easy to use, and though it does not have the best technical specs of some other TV streaming devices, it is still capable of streaming 1080p HD.  I have used this device for about two weeks now and I am impressed.  It's operation is simple and the picture quality provided through the services I use is excellent.  My only concern is that it does not support Amazon Prime, and is the only reason the device is getting four instead of five stars.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Chisholm"}, {"rating": 5.0, "review": "Works just as we thought it would.", "verified": true, "helpfulness": "0/0", "author": "Aza  Landini"}, {"rating": 5.0, "review": "Love it!Good investment.The only thing, with the remote, when searching, wish there was a quicker way to type in the search bar. Instead of having to use the arrow keys, up, down, left, right.", "verified": true, "helpfulness": "0/0", "author": "MeeMee"}, {"rating": 1.0, "review": "It is a piece of garbage like all apple stuff.  I threw it in the trash.", "verified": false, "helpfulness": "0/7", "author": "Kevin Sheridan"}]