[{"rating": 5.0, "review": "Worked great!  Client support was excellent! Would highly recommend this for netflix streaming - best birthday present ever - Thank you", "verified": true, "helpfulness": "0/0", "author": "Phyllis Gibson"}, {"rating": 5.0, "review": "Great for watching streaming NETFLIX.  Well built and a quality product.  I would definitely recommend this for anyone to try!!", "verified": true, "helpfulness": "0/0", "author": "Bluedog"}, {"rating": 5.0, "review": "This is my second Apple TV.  So convenient to watch movies.  Now I have one in the den and one in the bedroom.  So easy to use ipad and watch on big screen just by using Apple TV. Free shipping is always a plus with Amazon.", "verified": true, "helpfulness": "0/0", "author": "Daisy J Moreau"}, {"rating": 3.0, "review": "Less that 1 year after purchasing this product we are regularly having issues with intermittent connections when using Airplay, Hulu, Netflix, etc", "verified": true, "helpfulness": "0/0", "author": "Vellokat"}, {"rating": 5.0, "review": "Apple TV is one of the best creation that a man/woman could ever have. It's so HD and so easy to use better than all those product that was mimic on this device.", "verified": true, "helpfulness": "0/0", "author": "Leon"}, {"rating": 5.0, "review": "Is an excellent family entertainment device!Netflix works very fast and is very friendly interface!!If you buy it, then you'll want one for every room of the house!!", "verified": true, "helpfulness": "0/0", "author": "Ivan Baptista Lopez"}, {"rating": 5.0, "review": "Easy to set up.  The hardest part is going to the internet gateway and finding the wireless access password.Portable.  I went to my in-laws yesterday.  They don't have a lot of channels for kids.  We were going to be there for a few hours and the kids have always gotten \"bored!\" in the past despite our best efforts to keep them entertained.  Who wants to pull out toy after toy and hear the complaining while we're talking and eating dinner and playing cards? So I took Apple TV with us.  The cables (two of them) and the box fit in a grocery bag.  I hooked it up to my in-laws TV and the kids watched cartoons and their junk while the grown ups did our thing.  After dinner I went on YouTube and played songs for my 75 year old father in-law that he hadn't heard in years, that he loved, etc. etc.  He loved it! Then we watched clips of sporting events on YouTube.  He loved them.Portable is a HUGE pro for this product.  Other products like the Roku will be portable as well but this is so easy to set up, so easy to use (my six year old can easily navigate the interface), and just so...great!Be advised that you'll need a HDMI cable.  We bought an Amazon brand 6.5 foot cable for about $6 at the same time as when we bought this Apple TV and I had it hooked up in under five minutes.  Love it.  Chef recommends!", "verified": true, "helpfulness": "1/1", "author": "Raoul Duke"}, {"rating": 5.0, "review": "I want to keep this brief and to the point, because there have been hundreds if not thousands of reviewers before me.I personally have used this product hundreds of times since I purchased! I use this to watch YouTube videos streamed from my iPhone, and I also love watching Netflix TV Series like lost from my Apple TV. The product is fantastic and I have no complaints!I would purchase this again with no doubt.", "verified": true, "helpfulness": "0/0", "author": "Connor Brady"}, {"rating": 5.0, "review": "I am extremely happy with the Apple TV and would recommend it over any of the other comparable products out there. Perfect it is not, but darn good for what it does.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Wegis"}, {"rating": 1.0, "review": "I generally LOVE Apple products. I HATE this piece of junk. I'd call it worse than that but this IS a public forum. If I want to listen to my itunes on this, I can. Yeah, but I don't, because my music sounds much better on my Bose iDock than it does on my TV speakers.  If I want to watch youtube on this, I can, no problem. But what I really wanted it for was to watch netflix and to interface with my MacBook Pro. OF COURSE, these are the two things it WILL NOT DO!I can't even open Netflix most of the time. Or it is slow. Or stops and starts.When I use airplay, so that I can use the TV as a big screen for my computer, it packs up on me and just quits doing it. Airplay. Should call it Airpoop. Cuz it Airpoops out on me all the time!I returned the first Apple TV I had as defective, because even Apple support couldn't help me fix it. Now with the second one I am just giving up.  This is a shameful product. SHAME SHAME SHAME on you Apple! You charge a lot of money for your products and I LOVE my MacBook Pro and my iPhone, but this is a MASSIVE FAIL!I wouldn't be so mad about this if my expectations weren't so high. This is an APPLE product! It should be awesome! IT'S NOT!I'm going to go buy a Roku. Airpoop on you, Apple!", "verified": false, "helpfulness": "2/9", "author": "Artcat \"Artcat\""}]