[{"rating": 5.0, "review": "No brainer purchase.  Just buy it.", "verified": true, "helpfulness": "0/0", "author": "R. Brown"}, {"rating": 4.0, "review": "I only use this to mirror movies from my phone to the TV. The device is very small. It works well and the image is good on my 55\" hdtv. I have a smart tv so I don't use the other functions.Recognize that each app developer chooses whether the app can be mirrored. Some tv and movie apps such as the dish network app has mirroring blocked. I have only one satellite box so I've used this to watch shows from my bedroom TV not hooked into the satellite box. It worked as expected. I give it 4 stars because some apps are blocked and no way to tell until after you buy this.", "verified": false, "helpfulness": "1/1", "author": "T. Stanley"}, {"rating": 5.0, "review": "great price and works well", "verified": true, "helpfulness": "0/0", "author": "Paul Shuster"}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/0", "author": "jose de los santos"}, {"rating": 5.0, "review": "C'mon, it's from Apple. What more is there to say.", "verified": true, "helpfulness": "0/1", "author": "Pe'leg \"buzzhead\""}, {"rating": 5.0, "review": "I'm trying to bypass cable/satellite service altogether.  This is a nice way to do it.  $8/month for NetFlix, same for Hulu... plus YouTube access.  I streamed my NHL Gamecenter subscription without issue.At this point, I'm just waiting for Cox to realize what their internet service actually provides and watch their HSIA skyrocket.", "verified": true, "helpfulness": "0/0", "author": "Al Bundy"}, {"rating": 5.0, "review": "Love the full HD. Well done Apple.", "verified": true, "helpfulness": "0/0", "author": "Stuart"}, {"rating": 5.0, "review": "i have been resisting buying this FOR YEARS. we have a 4 yr old roku  which was good enough. we're cord cutters. no cable around here.we only bought teh appleTV so we could watch Game of Thrones thru HBONOW. OMG what a difference. we'll keep the roku so we can watch amazon prime but we'll be replacing it soon  because we want everything to look  this good.", "verified": true, "helpfulness": "0/0", "author": "Influenced by Nuance \":-)\""}, {"rating": 5.0, "review": "This unit is awesome everyone should have one", "verified": true, "helpfulness": "0/0", "author": "Robert Theriault"}, {"rating": 3.0, "review": "Keep having issues with optical out.", "verified": true, "helpfulness": "0/0", "author": "SilverCaboose"}]