[{"rating": 5.0, "review": "in my \"MAN CAVE,\" I have a Apple TV that I store all my movies in the ICloud.  After converting all my VHS tapes and DVD disc, i bought my first Apple TV and stored everything on the ICloud.  This was the best plan ever done.There is no more bulky tapes and DVD.  Please this plays clearer than most DVD/VHS players.", "verified": true, "helpfulness": "0/0", "author": "mario west"}, {"rating": 4.0, "review": "I purchased the Apple TV (3rd Gen) directly from the Apple store about a week ago.  So far,I have been so impressed with it that I am considering purchasing a second one for the master bedroom.  Setup was quite easy.  Out of the box, you just plug it in, connect the HDMI cable (sold separately), then turn on the TV and select the appropriate input on your HDTV.  It then begins to search for WiFi, select your WIFI, enter the password, then your in.  After that it asked for an Apple ID and password that can be used to purchase movies and video.  The primary reason I purchased the Apple TV was to have access to Russian TV channels over the internet.  The provider had an App in the App store in which I downloaded to my IPad 2.  It took me quite some time to figure out how to stream the video and sound from the IPad to the HDTV.  When I selected \"Apple TV\" as the source from the IPad, it only projected the sound.  Finally, through some diligent Google searching, I finally figured out how to stream both video and sound.  If you quickly double click the main button on the IPAD it shows a list of your most recently used Apps.  If you then swipe your finger to the right you'll see a circle with an arrow on it.  Click on that and it allows you to choose between \"IPad\" and \"Apple TV\".  If you choose \"Apple TV\" you then choose to turn mirroring \"On\" or \"Off.\"  If you choose \"On\" then you mirror your IPAD on the HDTV.  This is how I was able to stream video and sound from the App.  Airplay and Airplay mirroring are two features that make this product well worth it.I have also tried streaming music from Pandora to the TV from my IPhone 4 and it worked quite well with good sound.  However, I did learn that when Pandora shows a commercial, it shows the actual video on the TV which disrupted my photo slide show at the time.  I thought this was quite annoying because I had to go back in and reset the slide show.  I have rented a movie and previewed several movies.  For the previewed movies, the time for the Apple TV to start the preview was quite long because it had to download enough of the preview.  Therefore, I had to upgrade the speed of my DSL, which has helped quite a bit. We rented the new Avengers movies and the quality of the picture was top notch.  I have also tried NetFlix (free one month trial) and Hulu Plus (free 7 day trial).  However, I haven't been entirely impressed with the selection of videos.  However, I thought NetFlix was slightly better than Hulu.Overall, I give the Apple TV 4 stars instead of 5 because I think it is too limited in the programs available.  Plus Amazon instant video doesn't support Airplay mirroring which is a huge bummer because that would open it up to much more options for everyone.  Only the sound is projected from IPad without any video.  In the end, I would still highly recommend the Apple TV.  I am seriously considering purchasing a second one even after having it for only a week.", "verified": false, "helpfulness": "0/0", "author": "BrianD"}, {"rating": 3.0, "review": "This product worked great when I first got it but after I installed the first updatemy iphone 4, iphone 5, and ipad 2 will not connect using the airplay anymore which is the main reason I bought this thing. Very dissapointing.", "verified": true, "helpfulness": "0/0", "author": "Matt Mccann"}, {"rating": 4.0, "review": "Got it to AirPlay my Mac's screen so I wouldn't have to run wires everywhere. Says right on the box it can do it for newer macs. Now all I have to do is get that newer Mac. Good product, but I should have read up a bit more first.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "Did a bunch of comparisons on media receivers...Purchased both a Roku and this Apple TV.  Both work as expected and meet or exceed my expectations.  The bottom line:Apple TV - Of course it is intuitive and easy to set up.  Works like a charm --- and oh my, what stellar build quality compared to the competition.  Pros: Netflix works great, Airplay is awesome, Ethernet port is HUGE, and the digital audio output is so important depending on your setup.  Cons: No Amazon (no sh#t I understand why...but still a big issue given I'm an Amazon Prime member), who cares about NBA and MLB??  However, the lack of Amazon (for my dollar) makes the difference between buying 3 Apple TVs or 1 Apple TV & 2 Rokus.Roku 2 XD - Very nice interface and easy to set up.  Works like a charm -- but don't drop it or hit it against anything as it is likely to break easily (very, very flimsy build).  Pros - Amazon and other content.  Cons - No Airplay, no Ethernet, and no digital audio output.", "verified": false, "helpfulness": "0/0", "author": "JoMa"}, {"rating": 5.0, "review": "Excellent product - another great one from Apple.Excellent streaming from Netflix etc.Airplay works seamlessly - so you can stream stuff from your other Apple devices.Remote has a great modern design.", "verified": true, "helpfulness": "0/0", "author": "S. Pradhan \"SP\""}, {"rating": 2.0, "review": "Just so you know I like this product a lot. But I bought this mainly for AirPlay and I was greatly disappointed when I found out in order to use AirPlay for games you must have a iPhone 4s or later or a iPad 2 or later. Unfortunately for me I have a iPhone 4 and a iPad 1 so it really sucks. So make sure you have one.", "verified": true, "helpfulness": "2/4", "author": "Gumby"}, {"rating": 4.0, "review": "Apple is Apple... so good. Since the packaging to the funtion is ok.........is what you expected about a tv box...", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "Being an devout Apple product purchaser and user, I never really had the desire to use or purchase an Apple TV (aTV). But just last week, my family \"Cut The Cord\" from our Dish Network, picked up Hulu and Netflix and have enjoyed the results. Partly because the aTV offers us the freedom of having all the services we have come to enjoy in such an easy device, but also this device isn't static. Clean interface and extremely easy setup, the aTV offers the ability for my family to use it anywhere (given there is an internet connection).Pros:-The Apple Tv is clean. Being slightly bigger than a hockey puck and almost as thin, this little device can be placed virtually anywhere.-With more than one service (Now) currently available, the device makes it really nice to watch different content without having to pay the large price tag that comes with cable.-With Netflix, Hulu, MLB, NBA, NHL, iTunes, Vimeo and many more available, the hours that have been spent and will be spent are going to be countless.-1080p content on the Apple TV is visually Astounding. Even at 720p, the graphics and display of the aTV making watching TV more enjoyable with crisp, clean graphics.-User interface is extremely simple. With navigation of the device with the Apple Remote (which comes with the device) or the Remote App for iPad, iPhone, iPod Touch, makes traversing the content and options easy and quite simple compared to the Roku  or Netgear Neo.Con: (Yes there are a few)-Unlike many other services (Xbox Live, Playstation Network, Roku, Netgear Neo, Boxee), Apple TV doesn't offer other options such as Crackle, Voodu, Ultraviolet, or other services. If Apple hasn't released it in an update, it's not there.-Although much of the content can be accessed via Netflix and other services, not being able to access downloaded movies from Amazon or even your external HardDrive is a huge Con especially if your not limited to just one service provider for content.-iTunes is great for movies, music and tv shows, but there are many networks that allow these to be streamed for free over the internet. The Apple Tv doesn't allow for any connection to them (Unless your willing to break your warranty by Jailbreaking (unsuggested)).-There is no music services like Pandora, Last.Fm, or Spotify available.-HDMI is the only connection and is not supplied with the device.Overall:If you are looking for a great media streamer, with NetFlix, Hulu, many sports and the ability to watch previous movies/shows that have been purchased or downloaded with iTunes. Then Apple TV is right for you. Unlike many of the other media streamers, the interface and controls are much smoother and the experience is more enjoyable. If you have ever used or owned an Apple Product, the same quality that is used to make those products is used here with the Apple TV.I have tried and used many other of the media players and can say that you get what you pay for. $100 is seems like nothing when you don't pay $100's of dollars a year for cable/Dish services.", "verified": false, "helpfulness": "0/0", "author": "GaryB"}, {"rating": 5.0, "review": "This is a great add on for anyone with an iOS device and an HDTV.The ability to stream photos, music and video wirelessly from you iOS device is great for entertaining friends and show.You can also sync it with your Apple iCloud Photo Stream and it will display your iPhone or iPad's photos as your HDTV wallpaper...pretty cool!", "verified": true, "helpfulness": "0/0", "author": "Chuck"}]