[{"rating": 5.0, "review": "Great box.  Recent Apple update provides ESPN and a live news broadcast from England covering world news.  Great choice to cut your ties from cable and satellite plus you save money which I know everyone likes.", "verified": true, "helpfulness": "0/0", "author": "Steve Burton"}, {"rating": 4.0, "review": "So far so good.  The problems I had with it was that I live in a town house so I had to hard wire the system, now it works fine.  At the time I was also having issues with my MAC so I took them both to a MAC diagnostic shop....glad it was not only me, the battery in the remote for the MAC TV was dead....there goes the money I saved on S&H; and taxes.", "verified": true, "helpfulness": "0/0", "author": "Anita Smith"}, {"rating": 3.0, "review": "first week a had it totally used all my data plan up on verizon. now just plug it in when i want to use air play which works great. wish it could cache movies so wound't have to download them every time for playback at least the last three or something.", "verified": true, "helpfulness": "1/1", "author": "T. Whitney"}, {"rating": 5.0, "review": "Great product.  Has been everything I had anticipated it would be.  Very satisfied and hope to use it for many years.", "verified": true, "helpfulness": "0/0", "author": "Steve J. Wuertz \"TonyW\""}, {"rating": 4.0, "review": "I would love to give this device 5 stars, but it's lack of Amazon Streaming Video is, to me, it's only downfall. The box connects quickly and easily to your network - setup is painless. I was plesantly surprised to see I could connect a bluetooth keyboard to the unit, which made setup even faster. So far, this device has worked flawlessly. I have several devices around my home which have access to Netflix, this is by far, the cleanest, most user friendly interface.", "verified": false, "helpfulness": "0/0", "author": "M. Wire"}, {"rating": 4.0, "review": "It's great to stream all of my kids movies off of my iMac to my daughters tv but I have to restart it constantly. Almost every time I start a new show for them I get the infinite loading circle and have to restart the AppleTV. If it didn't do that I would rate it 5 stars.", "verified": true, "helpfulness": "1/1", "author": "Jesse"}, {"rating": 4.0, "review": "This was a graduation gift.  He was very pleased.  He sent me a note saying he's already using it.  The local delivery piece got hung up a bit but I was very pleased with how it turned out. I really like the local delivery option.", "verified": true, "helpfulness": "1/1", "author": "Buddhasmom"}, {"rating": 5.0, "review": "It is better than cable or any of the other available options.  We really are glad that we purchased this tool.", "verified": true, "helpfulness": "0/0", "author": "Dennis Key"}, {"rating": 5.0, "review": "User friendly, easy to set up, makes my dresser look fancy! I wish it would allow me to browse the web though...", "verified": true, "helpfulness": "0/0", "author": "Yari"}, {"rating": 5.0, "review": "Works well providing music to the pool and back yard.Need more than 2 to fill the backyard with sound.", "verified": true, "helpfulness": "0/0", "author": "John E Hinkle"}]