[{"rating": 5.0, "review": "I have two units - I bought the new version to get the enhanced video output.  It's great to interface to Netflix as well as all of the computers.  Easy to use and setup.", "verified": true, "helpfulness": "0/0", "author": "architect"}, {"rating": 4.0, "review": "i used this to replace my antiquated stereo/dvd receiver station (only running internet based music/video options). The initial set up was quite consternating as the system would not recognize home sharing with my PC (and for that matter iPad and iPhone) based control system.  FINALLY, after several attempts with helpful AppleTV techs on the phone, figured out the problem was that AppleTV MUST be on the same network as the other \"shared\" devices. You cannot be on your \"guest\" network and also your administrative network. It also seems that you can't use your \"guest\" network even if all devices are on it!!Anyways, the system seems to work fine with the exception that the write-ups could easily lead a user to believe that the AppleTV will also send signals to AirPlay enabled speakers. This is NOT true! This means that if you have a totally wireless speaker system set up, any video type applications (Netflix for example) will NOT play on those speakers...only your TV speakers.Aside from those small points the system seems to work as advertised and provides an easy to use interface with a decent array of entertainment options.  Great way to simplify (and reduce clutter) an entertainment system.", "verified": true, "helpfulness": "1/2", "author": "Globe Trotter"}, {"rating": 5.0, "review": "I already have one, but bought one for a gift. If you have any apple products, this is fabulous. If you want things such as hulu and netflix, but do NOT have any apple products, you are probably better off with a Roku box (for half the price). The appletv really comes into play when you have other apple products that you can airplay to, or pull up photos on. Overall great buy for apple people!", "verified": true, "helpfulness": "0/0", "author": "Hwkeye1"}, {"rating": 3.0, "review": "In our house we have a Roku and an Apple TV (in separate rooms)I liked the Roku but wanted the ability to access all my iTunes purchases and music from my couch and stream on our TV, for that it works great. The screen saver feature is nice as well as it also will display our iPhoto albums when we're just listening to music.My main reason for the 3 star rating is lack of Pandora integration and clunky navigation via the remote shipped with the Apple TV. I use the Remote app via my iPhone but that's only a slight improvement.If you aren't tied to Apple/iTunes then I think the Roku is a better choice", "verified": true, "helpfulness": "0/1", "author": "S. Haley"}, {"rating": 4.0, "review": "I've owned a roku since they came out several years ago.  I love my roku, that now lives in our bedroom.  We moved to the AppleTV mainly because I wanted to ditch cable and save some money.  Being in an Apple household (2 macs, 2 ipads) it just made sense for us to move to the Apple TV, but the main reason for us was the iTunes integration.  iTunes had everything we wanted to watch, so we knew moving to the AppleTV was going to give us the widest range of options for watching what we wanted.In addition to Netflix, Hulu & iTunes rentals and purchases, you can access anything that's in an iTunes library on your network.  So we've converted all of our DVD's to .mp4's and stored them in iTunes so we can quickly get to the videos we or the kids want to watch.  It's easy enough to operate that my 3 year old can use it, and has parental controls to block access to specific channels that I don't want my daughter getting to (like You tube). I do wish it would allow you to block content by rating, however I've yet to see that on any set top box to date.The one thing that really bothers me on this unit is that backing out of an app is a bit of a pain.... It's essentially hitting the back arrow on your browswer... back for every movie you've viewed till you get back to the home screen.  Not sure how Apple missed the boat on that, but overall I can live with that.", "verified": false, "helpfulness": "0/0", "author": "James Edwards"}, {"rating": 3.0, "review": "First issue was that Apple TV seems to have quite a few compatibility issues with routers and this certainly was the case for me on my actiontec fios router. Tool ages to find workaround in some obscure forum which I am not convinced will hold long term.Second was that I purchased this to watch amazon instant video from my iPad. Seems logical route, buy an apple product from amazon to watch amazon on an apple. But due to licensing issues, it seems from forums again, amazon instant video does not work with Apple TV. ll you get is the audio which somewhat limits the entertainment value. Nothing in the information leads you to suspect this limitation which I think is a major oversight on amazons part.", "verified": true, "helpfulness": "0/0", "author": "Terry Golesworthy"}, {"rating": 5.0, "review": "For those of us that like to keep it simple, this is the streaming device to own.Since we got the Apple TV, we haven't looked back. Its tiny size means no hard drive. This turns out to be a good thing, as it means one less hard drive to manage. The Apple TV can stream from any Mac's publicly shared files or iTunes library, or you can access Netflix, Hulu, Youtube, Vimeo, and more from the built-in apps on the main screen.We love the remote: it's small and to-the-point. There are two buttons and a navigation circle with four buttons. It may sound too simple to function well, but that's not the case at all. We've found that when we have guests over, they instinctively know how to use it when they first pick it up.There is a downside: You can't stream every format, so Apple TV may not be a good fit for some people with large movie libraries on their computers. This is minor, though, since the average user will just want to watch movies without hassle, which the Apple TV does perfectly. And simply.", "verified": false, "helpfulness": "0/0", "author": "Stefan Brundige"}, {"rating": 4.0, "review": "For the price, this is great, but the price for episodes of most shows is still a little high. Cable is still a better deal, but not for long, I imagine.", "verified": false, "helpfulness": "0/0", "author": "A. ROBERTS"}, {"rating": 5.0, "review": "Nothing quite compares with Apple TV - the mirroring feature is what puts the apple TV above all other competitors. If you have an iPad...you need Apple TV to go with it...you won't regret it :)", "verified": true, "helpfulness": "1/1", "author": "Connie H"}, {"rating": 5.0, "review": "I love this little box, I have almost replaced my cable with it.  My entertainment budget has gone down, and that includes the cost of this unit.", "verified": true, "helpfulness": "0/0", "author": "Stanley D. Porter \"stan porter\""}]