[{"rating": 5.0, "review": "Love being able to push media from any of the apple devices in my home. Renting movies on iTunes is very convenient. It's easy to set up just plain works - you can even access your iTunes library on your Mac from this device and stream whatever is there.", "verified": true, "helpfulness": "0/0", "author": "Carl \"Carl\""}, {"rating": 5.0, "review": "I have one at home and at work.  We use at home for movies, tv, music, and pictures.  At work we airplay our pictures, emails and anything else we have on our ipads and iphones.  works flawlessly and will eventually replace your cable subscription.", "verified": true, "helpfulness": "0/0", "author": "Richard Regitano Jr"}, {"rating": 2.0, "review": "Apple TV has a serious contents issue - Every stream service cost money and/or more expensive than Roku. For instance, same movie cost more to rent from Apple TV than from Roku. Unless you have definite needs or you're an \"applenatic\"; the Roku box is a much better buy.Another problem is its wireless capabilities, although both the Apple TV and the Roku boxes are located next to each other, the Roku box can stream faster and more consistently than Apple TV (go figure!). If you do decide to still buy an Apple TV, then make sure to connect it using ethernet, no wireless", "verified": true, "helpfulness": "0/2", "author": "Bob"}, {"rating": 5.0, "review": "I truly love Apple TV. My son can watch his hockey highlights, my husband gets his German programs and I myself my British. There is something for everyone and it is so simple to use.", "verified": true, "helpfulness": "0/0", "author": "Angel"}, {"rating": 4.0, "review": "I just like the apple tv it just need more free channels like the roku dose the roku has so much more free channels like movies news weather and they are all free apple just need the free channels", "verified": true, "helpfulness": "0/1", "author": "cjm"}, {"rating": 5.0, "review": "If you use IOS then every tv you have should have one.  Airplay is great, easy and allows you to show whatever you have on your mobile device onto the tv screen.  Take a video or pictures and show the entire group.  Play a game and mirror it onto the tv so all can watch you.  Looking forward to the addition of games some day...come on Apple open this puppy up and give us the app store.", "verified": true, "helpfulness": "0/0", "author": "Stevie"}, {"rating": 3.0, "review": "Pain to key in and link your accounts, it would be nice to just log into the darn thing from the web and or federate my accounts to content providers and call it a day.  Kids can navigate so it's simple just wish Apple wasn't Apple....", "verified": true, "helpfulness": "0/1", "author": "LWC \"Funny Time\""}, {"rating": 5.0, "review": "This apple TV changed how I see apple. ALong with my macbook pro the apple TV changed how i run my home, manage my entertainment and school. I cant wait for the iTV...true story.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "Not much you can really say about an Apple product I guess. It does what they say it's supposed to do, does it well, didn't cost an arm and a leg, hasn't broken or crashed, so I'm good with it.", "verified": true, "helpfulness": "0/0", "author": "Tim Brown"}, {"rating": 1.0, "review": "I spent way too much time and money on adaptive cables trying to make it work with my 6 year old tv that didn't have an HDMI outlet.  Once again, apples proprietary policy makes life difficult.", "verified": true, "helpfulness": "0/5", "author": "Virginia"}]