[{"rating": 5.0, "review": "So simple and wonderful! Has everything you ciuld possibly need, with the ease of fast set up. Highly reccomend to have for any tv, we take ours to the cottage, with a small tv", "verified": true, "helpfulness": "0/0", "author": "gloria pratt"}, {"rating": 5.0, "review": "Great buy still, using this today!", "verified": true, "helpfulness": "0/0", "author": "Geary"}, {"rating": 5.0, "review": "In all fairness, it's only been maybe 1/2 hour. But everything I've tried so far has been seamless. I haven't tried Netflix or other apps, but i have two other devices that can stream Netflix (TV and Blu-ray), so I'm not worried about that if it doesn't work well. Of course it would be nice if it streamed Amazon, but my two other aforementioned devices do that, too, so this was not a dealbreaker. One hint though, if you have a Mac, the remote will try to operate your computer, too. That was annoying until I figured out how to turn it off (System Preferences > Security & Privacy > General > Advanced > click Disable remote control infrared receiver). I don't use a remote with a Mac, but I can imagine that if you do, it may annoy you to have to turn this off completely rather than pairing with a specific remote. There may be a workaround for this, not sure.One thing I really like is that I have two options, I can access what's on my computer or iCloud directly from AppleTV (and use the apps), or I can mirror my computer if I want to stream something that's not an AppleTV app, such as Spotify, through AirPlay (this works with Amazon video, too, but you may need to turn off the AppleTV screensaver), though that does require a few extra steps. I originally bought a Roku 3 but found its lack of flexibility annoying and ended up selling it after one week on eBay (besides that, the Netflix interface on Roku was awful compared with my Panasonic Blu-ray). The AppleTV is about 95% what I was looking for. Now, if someone could just replace my Hopper, receiver and Blu-ray with something this petite! BTW,  I have a MacBook Pro running Mavericks. I don't know if AirPlay works with a PC.And P.S., if anyone is wondering why you might want to send something like Spotify to your TV, my TV audio plays through my stereo system, not through the TV speakers. I used to have to plug my computer (or iPod or iPhone) into the stereo receiver through a <gasp> cable.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 4.0, "review": "I actually have to of these boxes at home and the most recent purchases were as gifts to friends for Christmas.That being said, the AppleTv is worth the purchase and used quite regularly at home and at times for work.i've reviewed them before and can only say that I have enjoyed using.", "verified": true, "helpfulness": "0/0", "author": "Daniel B."}, {"rating": 5.0, "review": "I like Apple quality even it's not so cheap though, but you get you pay for. I like this device.", "verified": true, "helpfulness": "0/0", "author": "Nikos"}, {"rating": 5.0, "review": "Easy to connect. Movies, music and other apps all work well. I have one and my daughter has one. 1080P video and 5.1  sound HDMI who could ask for more.", "verified": true, "helpfulness": "0/0", "author": "mrtou58"}, {"rating": 5.0, "review": "LOVE IT.  Can use it for anything in your Itunes library and many more features!!!  Lots of possibilities for your big screen tv!", "verified": true, "helpfulness": "0/0", "author": "Emily Garthe"}, {"rating": 5.0, "review": "Very cool product and works seemless with all my other Apple products. Very easy to use and I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Michael Rodrigues"}, {"rating": 5.0, "review": "Got one for my sister for Xmas then got one for us. Dead useful and I love love love the simplicity of the remote. It duplicates some features our TV already has but the interface on this device seems better to me than that on our Samsung TV. Thinking about getting one? Just do it. It's worth it for $100.", "verified": true, "helpfulness": "0/0", "author": "Arthur Grueneberger \"Theater Art\""}, {"rating": 4.0, "review": "complete with remote! I can view netflix anywhere there is wi fi, and all of the free internet TV channels too.", "verified": true, "helpfulness": "0/0", "author": "renee"}]