[{"rating": 5.0, "review": "I bought this for my daughter and she was very happy with it. It was just what she wanted. Good product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We have the first and second generation Apple TV devices.  These have proven to be very useful and very user friendly.  Great to be able to pull up movies or tv shows you've purchased and watch it on your big screen.  Also great for listening to your iTunes library through your sound system.  Will probably upgrade to latest version when released.", "verified": true, "helpfulness": "0/0", "author": "Gary In Texas"}, {"rating": 5.0, "review": "My wife love it without connect cable from her iphone, she really enjoy it and will tell her friends too", "verified": true, "helpfulness": "0/0", "author": "Doi Nguyen"}, {"rating": 2.0, "review": "I've bought and returned two of these. I also have two Roku boxes, and just bought a Chromecast.  I'm on a quest to find a way to stream Time Warner video on demand, which I thought would be possible by streaming the TWC websit via Airplay, but the video is choppy and the resolution sucks. I see no reason to buy the ATV over the Roku other than desktop mirroring. Virtually all the limited iPad app content is available via Roku for less money, and there's much more content. The Apple UI is somewhat prettier, with no ads, but that's about it. I'm disappointed that after all this time Apple has not paid more attention to the ATV. Rumor has it that a new version will be released in October, so perhaps that will make it worthwhile. But until that happens, I really can't recommend it.", "verified": false, "helpfulness": "2/6", "author": "Craig \"Utician\""}, {"rating": 5.0, "review": "I use my appleTV everyday to watch netflix, listen to music from my iPhone, or study homework on from my iPad. It's a great source and easy to use. I highly recommend it, especially if you don't want to pay for cable and just want to use netflix and Hulu or watch movies from your iPad", "verified": true, "helpfulness": "1/1", "author": "mmcrae2"}, {"rating": 4.0, "review": "It works great for me.As expected I could use it perfectly for  photo sharing, connecting with other home devices and online streaming.Sandip", "verified": true, "helpfulness": "0/0", "author": "Sandip"}, {"rating": 3.0, "review": "It's alright, it works relatively well with Apple Devices.... assuming the app isn't blocked - although it seems that they are blocked.  Very limited list of streaming apps available (compared to competing devices). This has pretty much been relegated to being an AirPlay Mirroring device for my Macbook.  I use other devices for actual streaming.If they had more apps, and easier controls this device could be great.", "verified": true, "helpfulness": "1/3", "author": "PeterJames"}, {"rating": 5.0, "review": "I got this as a birthday present, and I love it! It works with an iPhone but it works a whole lot better with a iPad! We have not had any problems out of it so far. It shipped within just a few days and was easy and simple to hook up!", "verified": true, "helpfulness": "0/0", "author": "CaLeB2017"}, {"rating": 5.0, "review": "We have full cable with on-demand and TiVO - and this was a critical addition. Apple TV lets us access HBOGO and a host of other programs that are phased out, on-demand.  The range of programs is excellent, and fills out the variety of shows we can watch.  It's compact size makes it an easy addition to the \"media center\" corner of the room.", "verified": true, "helpfulness": "0/0", "author": "Leah G Fallon"}, {"rating": 5.0, "review": "I will recomend this computer to my friends. I chose this article for a friend recommendation. freat quality and great to share in family.", "verified": true, "helpfulness": "0/1", "author": "Rocio Corena"}]