[{"rating": 5.0, "review": "I went from spending $170. /month to 65./month by getting rid of my cable and just having Internet with Hulu + and Netflix. I get all the same shows and more features than I had with cable only. It took a little adjustment to get used to operating. But if you're good with an apple product such as an iPhone or iPad you'll adjust quickly.", "verified": true, "helpfulness": "0/0", "author": "Seriously"}, {"rating": 1.0, "review": "I don't see any reason why $100 should be spent for this product.There is NO browser compared to Google TV or Basic Samsung OS in TV. You cannot install any APP in Apple TV.I have lot of apple products, but this one really is poorly done.", "verified": true, "helpfulness": "2/7", "author": "Renju Nair"}, {"rating": 5.0, "review": "Got it for my grandkids.  They love it so it rates high in my book fgor quality, prive, and kid friendlessness", "verified": true, "helpfulness": "0/0", "author": "David W."}, {"rating": 5.0, "review": "I use this for online movie streaming and playing music from an iPhone, and it works great for both.  The user interface is simple and syncing with an iPhone for music streaming could not have been easier.My one gripe is that I have not been able to get my Logitech One remote to work very well with the Apple TV. The Logitech turns it on and off fine, but I have not figured out the navigation using the Logitech.  It may be just that I have just not put in enough effort to get the Logitech One programmed property, or it could also be another case of Apple not playing nicely with products outside the Apple family.  The Apple remote is intuitive and easy to use.", "verified": true, "helpfulness": "0/0", "author": "waterdog"}, {"rating": 5.0, "review": "helps get my whole home airplay setup going.  When your library is on iTunes, this set up just makes sense", "verified": true, "helpfulness": "0/0", "author": "James C Lloyd"}, {"rating": 5.0, "review": "I live in an old house with few telephone outlets. Apple TV is the best way for me to see a movie without having to move from in front of the TV set.  Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Pamela Sullivan"}, {"rating": 5.0, "review": "I ordered this so I could watch all of my iTunes movies & TV shows through the box. I already had Netflix through PS3, but accessing Netflix through AppleTV is much smoother. It is completely silent VS the hum of the PS3, and load-up time for the AppleTV is 40 seconds for Netflix VS 1:20 for PS3, so thats a huge plus right there. Worth the buy, hopefully they can get NFL on here sooner rather than later.Update: I just found out I can stream all sports games from my MacBook Pro using AirPlay, so not only is this thing awesome, but it also completely removes your need for cable. Quit living in the past, buy AppleTV!", "verified": true, "helpfulness": "1/1", "author": "J"}, {"rating": 5.0, "review": "Visually impaired and the Apple TV is essential in viewing and using my Apple iPad.  User-friendly.  Wish instructions were easier to understand.", "verified": true, "helpfulness": "0/0", "author": "Mary Ellen Sturgis"}, {"rating": 5.0, "review": "I had resisted getting this for over a year. I finally gave in when I had movies on my iPad that I wanted to watch on my HDTV. It connected easily and works great on my wireless network. I like the small size. People don't even notice it on my TV stand.Turning it off when not in use too a little research, but now that I understand how it works, it is fine.", "verified": true, "helpfulness": "0/0", "author": "ZCCH - Sonoma, CA"}, {"rating": 5.0, "review": "Like all the apple products we've tried, it's simple to use and does what we want it to do.  I do wish the remote maybe had a keypad, as it is a bit laborious to pick out letters to type in a youtube search onscreen, and is very easy to misplace for months at a time due to its small size!", "verified": true, "helpfulness": "0/0", "author": "mcd"}]