[{"rating": 5.0, "review": "Great product, very slick, intuitive user interface, love the Airplay mirroring feature (requires Mountain Lion OS). This is my second Apple TV.", "verified": true, "helpfulness": "0/0", "author": "CalifDiver"}, {"rating": 5.0, "review": "Very useful, actually I think iTunes store(for movies) is too expensive, but I have an netflix account and there is a lot of great movies there.I can watch videos from my computer with homesharing but it doesnt have support for .srt file and a have trouble to convert(the video file) and embed them.Beside this, it meets my expectations.", "verified": true, "helpfulness": "0/0", "author": "Clauber Oliveira"}, {"rating": 5.0, "review": "I use iTunes match and watch a fair amount of Netflix streaming. The ability to use the apple remote on the iPhone and iPad is awesome, it makes search and YouTube much easier to use. However, it took 48 hours to stabilize and work correctly, I did not change any settings, just waited and there it was. I think Apple maybe watching me!Much better wireless network range than the previous version.", "verified": true, "helpfulness": "0/0", "author": "Matthew J. Faulkner \"AdobeDog\""}, {"rating": 5.0, "review": "I bought this as a gift for my daughter and she said she loves it. I got it at a great price too.", "verified": true, "helpfulness": "0/0", "author": "Adam Glowacki"}, {"rating": 5.0, "review": "Apple TV is a great, fun addition to my living room and TV watching experience. The setup was easy and straight forward I had it up and running in less than 10 minutes.", "verified": false, "helpfulness": "0/0", "author": "K. Bilyeu \"Student of the Word\""}, {"rating": 3.0, "review": "Apple Products are always popular gifts for the kids I am sure they love it as much as I do.", "verified": true, "helpfulness": "0/0", "author": "Delton C. Baker"}, {"rating": 2.0, "review": "I bought it for AirPlay in hotels. Waste of money, most hotel Internet needs to be connected via a website agreeing to terms, that doesn't happen with this. Even at home the wifi goes in and out. When it works, it's nice but not worth the money.", "verified": false, "helpfulness": "1/2", "author": "Michael J. Sutton \"tecnopagan\""}, {"rating": 5.0, "review": "best present i got for my daughter. she absolutely loves it. all her friends cant wait to get one for them selfs", "verified": true, "helpfulness": "0/0", "author": "lonnie bates"}, {"rating": 5.0, "review": "we went from Netflix through our BlueRay to Apple TV and the picture, the sound, the speed, etc are all noticably better.  This is worth the money!", "verified": true, "helpfulness": "0/0", "author": "Jen \"Jen\""}, {"rating": 5.0, "review": "After some initial pain of the apple server not being available it was very easy to set up.A very nice interface and allows good streaming from netflix or from my computer.I gave up on the cute little remote (that is too easy to misplace) and programmed my Logitech remote to control its functions.I do wish it had RCA audio out instead of just optical to make it more compatible and save me having to get an adapter.", "verified": true, "helpfulness": "1/1", "author": "Dr. Z"}]