[{"rating": 1.0, "review": "I loved my Apple TV1. Didn't get the ATV2. Upgraded to the ATV3 and what a let down. Oh is this a bad product.Pros:iTunes links well.iPad mirrors to it well.iPad & iPhone works great as a remote, if your home is wireless.Cons:Can't watch Hulu. Neither free of paid for.Can't watch Fox, ABC, NBC, or any other free over the web content.Shows that you can watch for free on you notebook you have to pay to view on ATV3.Suggestions, get an old used ATV2 and jailbrake it or wait until it has been jailbroken.After purchasing the ATV3 I went and made a myth box it does what I want.The ATV3 was a said let down after using the ATV1.", "verified": false, "helpfulness": "20/40", "author": "Buddy Davis"}, {"rating": 5.0, "review": "This is a review of the Apple TV MD199LL/A [NEWEST VERSION]For the longest time, I was reluctant about getting an Apple TV since I have a TiVo box and a PC (not a Mac).  But, my brother told me one day how much he uses his, so I decided to give it a try.  I have an iPhone 4s, iPad 2 and an iPod Touch 4th Gen, so I use iTunes A LOT.  I have a rather extensive video collection amassing on my PC as well as close to 18,000 MP3s (all legal I might add).  The Apple TV really has changed the way I view TV now.  The seamless integration of all my various iOS devices with the Apple TV box is nothing short of spectacular.  It opens up the ability to start watching a movie on TV, then continuing the movie on the iPad, iPod Touch or iPhone.  Also, let's say you are out running errands and you are listening to music on your iPod, when you arrive at home, all you have to do is select Apple TV from the menu on the music player and Viola! You can listen to your music through your home entertainment system.  With all the features this little box offers, I now wonder why I ever hesitated to buy one.With the newest version of this box, you can now view streams in full 1080P HiDef. It also gives you access to the internet, so you can find out of town radio stations, your favorite YouTube or Vimeo videos, watch movies on Netflix, stream pictures to your TV with Flickr or PhotoStream, and lots of other cool and useful things.  Now, I know there are some people out there who think that a TiVo and negates te need for an Apple TV or, vice versa, but let me assure you, they are complimentary of each other.  With TiVo you can record shows off the TV and store them either on the TiVo box itself, or on a network-connected PC/Mac with the TiVo Desktop software.  The Apple TV allows you to stream all forms of multimedia from your computer or the internet.With Apple TV, the realm of digital media becomes more of a close reality.  I am very pleased with my purchase and would recommend it to anyone who enjoys collecting movies, music, or any form of media, on the computer.  Or, if you just enjoy renting a movie for the weekend, this is for you too.  The selection is by far larger than any cable television's On Demand or Pay-Per-View content offerings.Not really a complaint, more of a suggestion for Apple.  The Apple TV can only be connected to one TV.  It would be great if it could be connected wirelessly to multiple TVs so you could watch your favorite shows in any room in your house, on any connected TV.", "verified": true, "helpfulness": "6/7", "author": "Scott E. Sanders"}, {"rating": 5.0, "review": "I was waiting for the launch of the new apple tv and wholla ! its here and at an unbeatable price. Easy to hook and play. Love the \"air play\" feature. Amazon as always was amazing to deliver it in time for it was my wife's wedding gift and she did not wait to open it and hook it up to our other apple devices.", "verified": true, "helpfulness": "1/2", "author": "ARK"}, {"rating": 5.0, "review": "It makes it easy to use online entertainment services on your TV. Originally I had a desktop computer connected to my TV and had to use a remote mouse and keyboard to do this. My computer was bulky, the fan was noisy, awkward to use, and consumed too much power. Apple TV made my life easy. It also allows you to use your TV as your iPhone multimedia center and display the pictures, music, and videos from your iPhone (using airplay). You also can use your iPhone as a remote (although it comes with its own remote).I think buying it was a smart decision and good investment. You need to be a member of one of the online entertainment service it supports, like Netflix, i.e. if you don't want to use it only as your iPhone multimedia center, to make it worthwhile.", "verified": true, "helpfulness": "0/0", "author": "John Dormishian"}, {"rating": 5.0, "review": "I am very pleased with this gadget which gives me a lot of fun.I can recommend its simplicity.Contecting your iTunes with Tv", "verified": true, "helpfulness": "1/2", "author": "arie47"}, {"rating": 3.0, "review": "UPDATE 6/16/12 - Added a star because the Airplay functionality is indeed wonderful.Yes, its worth buying an Apple TV just for the Airplay function alone.  Its the perfect compliment to my iphone and ipad.First off, i have many apple devices so i am more or less commited to the platform.However im getting dissapointed by where things are going with them-less about making computing easy, more about controlling and selling content.So i was disapointed to discover that Apple TV is really just a \"buy\" platform for iTunes now.With the new interface they've made all the sharing and viewing of content off your PC stuff really hard to find and manage.Basically the utility functionality of it is going away in favor of accelerating monetization for apple.Its great for on demand buying of content from apple, but I really dont need another electronic leech on my wallet.We decided to keep it because of the Airplay function.  Thats sort of worth the $99.Too bad. I also have a roku that i wont be getting rid of.  Roku with airplay and itunes connectivity would amazing.", "verified": false, "helpfulness": "0/4", "author": "js \"SJ Shopper\""}, {"rating": 5.0, "review": "It's not a TV.  It's a very small internet computer that streams great content to your existing TV (if it has an HDMI input).Wow, how cool is this thing for less than $100? It rocks!  If you are into iPhone or iPad you need this!  Even if you don't care about watching \"TV\" on it, you can view your iPad/iPhone photos and listen to your iTunes music, podcasts, or Pandora right on your TV with no wires, chips, or uploading/downloading.  Your ring volume button on your iPhone controls the volume on your TV. Nice!", "verified": true, "helpfulness": "0/0", "author": "801eric"}, {"rating": 2.0, "review": "This is a tuff review because it depends on how you are reviewing it.  If you are reviewing it as a upgrade to the 720p appletv, then it can't be anything but negative.  if it's about the device in general, there are real positives about it.  My score reflected the upgrade route.  In general, you may hardly ever get to that point where the 1080p upgrade is noticeable.Your mileage with appletv is going to be dependant on your adherance to the IOS environment.  If you are a massive investor into purchasing/renting from the itunes environment, this device is absolutely fantastic.  also, if you are heavy into the ios environment with other devices, the airplay feature can potentially be very nice.  I like the fact that past digital movies activated via past dvd/blu ray disc purchases are there available for streaming.  The negative is the stream you get is sd.  Conversely, if you did an ultraviolet digital movie from a dvd/blu ray purchase and that movie is available on vudu(the setup on this is convuluted), via a roku, xbox or ps3, you can get a hd 1080p digital stream.  on the airplay front, its convenient to be able to do that to the appletv but if its for a game, the resolution hit can get gross.  airplay is a ridiculously finicky piece of tech and even under the best of the best network environments, getting a great resolution is rare.  when compared to using a direct hdmi connection to an ios device, its night and day on the quality front.  I have gotten it to the point where it does look really good over airplay but compared to direct hdmi, no comparison.  and to even get it to that, took a bit of work.If you don't airplay or don't purchase much from itunes, you are probably buying this for netflix.  in this situation, buy the roku.  the roku is an app beast, you get amazon prime video, hbogo, vudu, and on and on....the app offering on the appletv is paltry at best.for me, it's a mixed bag.  I do airplay quite a bit.  Also, I am heavily invested in to flickr which is one of the rare apps the appletv does have.  I love controlling the appletv from my phone or ipad as we watch our family photos thru the appletv from flickr.  I also have the fortune of owning many other devices so I can get my app fill from my network smart tv, ps3, 360, etc so for me, what roku offers in spades as it's advantages, i get from other devices anyways.  it leaves the appletv as a great device for me from which to do so airplay gaming or browsing and flickr.It's an extremely limited device, if you fall within that tiny, tiny sphere, you are going to love it.  if not, way, way better purchases can be made.", "verified": true, "helpfulness": "0/2", "author": "Joosby C."}, {"rating": 5.0, "review": "I have been an Apple TV fan since version 1 so I upgraded to the new Hi-Res version and am enjoying it.  I will buy the real iTV when it comes out as it will usher in a new generation of smart TVs as a lasting legacy to Steve Jobs' vision.", "verified": true, "helpfulness": "0/1", "author": "E. A. Clark"}, {"rating": 5.0, "review": "The mirror function wouldn't work with my first generation iPad and my iPhone4.  It did work with my new iPad (third generation).  You must download the REMOTE App in order to use your iPhone or Ipad with the Apple TV.  The device is so easy to use even my wife was able to use it to watch Netflix within seconds.  I am kind of disappointed with the photo quality but given the fact that the 1080P HDTV has much lower resolution plus larger pixels, it is entirely understandable.  I expect the new Apple TV which is currently under developing will solve this type of issue.", "verified": false, "helpfulness": "0/0", "author": "R. Lee \"Gadget lover\""}]