[{"rating": 4.0, "review": "Love all the content and ease of use.Would give it 5 stars all day except for ....1 major problem I've noticed is that movies don't stream sometimes at all or stream very slow.I compared Netflix app to the Netflix app on my PS4.Several times in the past week I couldn't stream Netflix movies on my Apple TV. I know it's not my internet connection because my PS4 streamed the very same Netflix movies quickly and cleanly.I'm calling Apple today to find out why this is happening.Overall a great product once they get that figured out!", "verified": true, "helpfulness": "1/1", "author": "Deltalifestyle"}, {"rating": 5.0, "review": "This was a Christmas gift for my boyfriend.  He is an Apple person, so he loved that he can link all of his different devices with the Apple TV.  He is very pleased.", "verified": true, "helpfulness": "0/0", "author": "Carina Christion"}, {"rating": 2.0, "review": "Better than a dvd player, poorer than all other streamers.There are just better streamers out there. I worked at an R&D; lab where we reviewed, analyzed and compared various external and on board streamers including Google, Boxee, Samsung, LG, Vizio, and Apple. What I landed on personally, was that all other streamers could play more. Different media services have different catalogs so when getting a streamer, the most important feature is that it can play as many as possible.I have to give it one star extra because the remote is nice. Probably the best non-keyboard remote.", "verified": true, "helpfulness": "2/4", "author": "Matthew Sssss \"Pants!\""}, {"rating": 5.0, "review": "Love it!  Now have 2 in the house and will soon add a 3rd.  If you have other apple devices then you need an apple tv", "verified": true, "helpfulness": "0/0", "author": "David H. Lee"}, {"rating": 5.0, "review": "I absolutely love this Apple TV, it's awesome, you will love this to. I can get any movie I want, steaming from my ipad is flawless as is any movie purchased or rented, get this you'll love it to. It's very easy to set up, ten or fifteen minutes is all it takes.", "verified": true, "helpfulness": "0/0", "author": "Bart"}, {"rating": 5.0, "review": "Shipping was fast, everything works fine and the price was very reasonable. Thanks for the easy transaction. There are cheaper alternatives but it is nice to have the easy to use apple interface", "verified": true, "helpfulness": "0/0", "author": "Ryan T Gleason"}, {"rating": 5.0, "review": "I purchased as a Christmas gift and my son-in-law seems to really like it.  Easy set up and easy interface.", "verified": true, "helpfulness": "0/0", "author": "Paula K Laurence"}, {"rating": 5.0, "review": "Since cutting the cable TV cord at our house in October, we have really enjoyed the opportunity to stream and mirror video, photos, movies, and skype calls through Apple TV. It's a friendly interface and we love that it speaks to all of our apple devices. We had a feeling that my somewhat tech-savvy parents would also love exploring this device and we were right. Shipped beautifully, and both parents love Apple TV. They have been texting about their latest adventures since the holiday and talking about how much fun it has been. Great gift for the boomer parents who are hard to shop for and who are open to new technology.", "verified": true, "helpfulness": "0/0", "author": "Elise Alford"}, {"rating": 5.0, "review": "It's simple, it is reliable and it has many options.It seems that they're constantly adding new media content, not only through the Apple Store but also through different partners as You Tube, Vevo and Vimeo.The Korean Network is in, I would love to see the Japanese also !", "verified": true, "helpfulness": "0/0", "author": "J. Soifer \"Sadhaka\""}, {"rating": 5.0, "review": "Everything is OK. Good quality product as described in the announcement. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Guilherme"}]