[{"rating": 5.0, "review": "This product did exactly what I purchased it to do, and was worth every penny that I spent on it. Would definitely purchase this brand and product again if a similar need arises.", "verified": true, "helpfulness": "0/0", "author": "Grateful Father"}, {"rating": 5.0, "review": "It is very easy to set up, remote control is very thin, so keep an eye on it. Small stuff so you will safe space.", "verified": true, "helpfulness": "0/0", "author": "Marco V."}, {"rating": 5.0, "review": "Small, elegant, and simple to use.  Perfect for Netflix, hulu, youtube, HBO Go etc.  If you can't use the apps directly it is super simple to stream your laptop or desktop to your tv.  I think that feature is worth the price in itself.  No more cord problems.I use it all the time because I don't pay for cable anymore.", "verified": true, "helpfulness": "0/0", "author": "James Catalano"}, {"rating": 3.0, "review": "Important part for me is that the apple TV is super light and can be mounted on the back of a wall mounted LCD with just a little piece of velcro.  If it wasn't for that I probably wouldn't have bought it and instead used a traditional computer with HDMI output for itunes/netflix/amazon.Pros:  Cheap (I paid $80), box itself is small and light, love the look and feel of the remote.  The first standard remote that I don't want to instantly find a way to replace.  Can get to my itunes library on the TV (which I COULD do with a traditional PC but not with chromecast).  Love the way that it turns on and off on its own.  Clean look that even the technologically impaired can navigate.Cons:  More expensive than a Chromecast.  No native amazon app (need to airplay from another device to use amazon prime instant video).Additional Con:  This one is the fault of the American people NOT the fault of Apple or Amazon.  My streaming ability was immediately degraded by my internet provider the second the supreme court overturned the FCC regulation preventing violations of network neutrality.  This product is less useful now than it was in the past because the American people don't care enough about not getting bent over by Comcast/AT&T; etc to elect representatives that will pass laws requiring network neutrality protections.", "verified": true, "helpfulness": "0/0", "author": "EKal \"EKal\""}, {"rating": 3.0, "review": "I purchased the Apple TV primarily because I wasn't able to get HBO Go on my Roku with DirecTV. Thus far I've enjoyed it and it has a pretty easy to use interface and seems to be compatible with most of the apps that I use on a regular basis. That being said, if Roku, DirecTV and HBO all got along, I would probably use my Roku more often than the Apple TV. The one thing that Apple has going for it is that it works with all other Apple produces. Seeing as I don't have many other Apple electronics, the Apple TV is really just a gateway to HBO at the moment.", "verified": true, "helpfulness": "0/0", "author": "Flann O'Brien"}, {"rating": 5.0, "review": "Another great apple product. I would recommend this item to anyone, and will buy it again as a gift  I give this a 5 star rating", "verified": true, "helpfulness": "0/0", "author": "margo g mize"}, {"rating": 5.0, "review": "Got this device so I could take advantage of airplay feature for my iphone. Box is really small and can be easily hidden. Plenty of apps, but can be limits less through the use airplay mirroring on iphone or Mac.", "verified": true, "helpfulness": "0/0", "author": "Greg Holguin"}, {"rating": 5.0, "review": "Have Apple TV and Roku xs (I think I can't remember the exact model) - Apple interface is prettier and smoother plus I can connect my iPad to my receiver to play iTunes, which rocks when I'm on my couch and want to surf and listen to tunes.  It's been rock steady since I bought it. Streaming quality is excellent.", "verified": true, "helpfulness": "0/0", "author": "Patrick Rodriguez"}, {"rating": 5.0, "review": "I've had an AppleTV for several years, but just got this one for my in-laws as a gift. They love it so far - it is so simple to setup and use that they were up and running in no time and enjoying Netflix and other services right on their TV. Can't go wrong with an AppleTV!", "verified": true, "helpfulness": "0/0", "author": "P. Sherman"}, {"rating": 5.0, "review": "A plethora of apps. This is better than a smart TV because there are more apps. Plus you can mirror what's on your iPad on your big screen. It is beyond great!", "verified": true, "helpfulness": "0/0", "author": "LAJay"}]