[{"rating": 3.0, "review": "Apple TV is good but not as good as I thought it would be. Great to be able to project from iPad but some apps make this difficult or impossible. Video quality is not great when doing this. So we end up using it occasionally instead of frequently.", "verified": true, "helpfulness": "0/0", "author": "MN \"mnagle8\""}, {"rating": 4.0, "review": "The apple tv worked extremely and we are very pleased.  The instructions provided were not as helpful as they could have been and assumed an above average level of computer literacy.", "verified": true, "helpfulness": "1/1", "author": "Syble Jean Garrison"}, {"rating": 5.0, "review": "Simple and easy to set-up and use. I mainly bought it to watch my Netflix on a larger screen than my laptop. Thank you Apple as usual.", "verified": true, "helpfulness": "0/0", "author": "Envision2009"}, {"rating": 5.0, "review": "I use this daily, sending a Pandora stream from my iPad to my TV and home theater speakers. It also lets me stream artwork apps from the iPad, or Flickr, which make for a very pretty TV screen through the day. Love it!", "verified": true, "helpfulness": "0/0", "author": "RaDadIndy \"indiana_dad\""}, {"rating": 5.0, "review": "was torn between 4 and 5 stars because:Easily 5 stars in terms of how much I enjoy owning/using, but4 stars because there are things I'd like to change without having to jailbreak.PROS:A) Instantaneous streaming (assuming you have a fast network)from: a) your computer* b) media purchased or rented from iTunes Store. c) Music in iMatch (puts music from non-iTunes store music in the cloud) but costs $25 d) photos from iPhoto (MacOnly) or PhotoStreamBy far the fastest most capable wireless or LAN based system I've tried for streaming from your computer  -- Love it or hate it: what makes the system work so well is that iTunes does all the heavy lifting rather than the device, (or incomprehensibly slow Windows Media Player - perhaps this will improve with new xBox). So your passion for this device assumes you like/love and/or can at least tolerate iTunes*.A1) Can play visitors music and videos: I assume this only true if they're running iOS devices. Keep forgetting to try with Android bearing guests, but sincerely doubt it would work without special software.B)Truly brain-dead set up (if you bother reading 3 pages of included manual) download it if you lost it.C)Free stuff: Watch/listen to Podcasts, play YouTube, Vimeo, Movie Trailers, Flickr, digital Radio Stations etc. As well as standard paid services (Netflix, Hulu Plus, MLB,WSJ, NFL etc)*Frankly if you're going to purchase an ATV its worth your while to learn how to really take advantage of iTunes capabilities like using smart playlists.CONS:a) They've made your computers media a couple more clicks away than ATV 1 (you used to be able to access from top level (main screen). You have to choose \"Computers\" first..b) Requires Home Sharing (This is a free software service built into iTunes - which determines who can play and or copy your purchased media). While I've never had any problem (even with my PC) some folks (nearly all are PC users) do. It seems this is mostly do to firewall/router settings and/or 3rd party antivirus software. Nonetheless, if you run into an issue, you need to be willing to read thru Apple's KBs on the topic,  (or call Apple and have them walk your thru it if your still under warranty.)c) No way to backdate software without jailbreaking, AND, as of Apple TV Gen 2, you can't disable updates completely (you're asked before updating, but it gets to be a pain constantly clicking \"Don't Update\".)-- A WASH: Pro or Con depending on your needs so YMMV---the Remote: Lots of folks like how simple and small this is. Personally I'd rather have a remote that's less likely to land in the wash. There are actually quite a lot of \"hidden\" commands in the device - like holding down select while playing a video to select chapter, I believe most/all? of these documented online, but personally I'd prefer separate NAMED buttons.No Amazon Video Player: If you don't have another device which has the software, and you really prefer using amazon media only, you might prefer a different device. For me this is no biggy, since I play my amazon music thru the ATV, and watch the \"free\" Amazon Prime Instant videos (well sorta free, since I pay an annual fee to amazon for the privilege) thru my Blu-Ray player, or TV.", "verified": true, "helpfulness": "2/2", "author": "Grizelda \"grizzy\""}, {"rating": 2.0, "review": "You sent a used one Amazon. It was opened, dirty and scratched up with none of the normal apple wrapping! Probably refurbished but for sure used. When you order a new item you expect a new item. It seems to work OK at lest for now. This is my third one so I know. Very weak and Amazon!", "verified": true, "helpfulness": "0/1", "author": "Jesus Saves"}, {"rating": 4.0, "review": "I am anxious for Apple to grow it's content offering.  They should add Amazon Prime access and HBO Go capability.", "verified": true, "helpfulness": "0/0", "author": "Douglas \"Doug\""}, {"rating": 5.0, "review": "At first it was really complicated to figure out the whole apple tv, even its overall function, and was very offended to realize the herding attempt by apple /itunes as an only option to buy movies or music.........that was the negative.There is everything positive to say when it comes to 1080p. I have a vizio 42 inch hdtv with apps and ipad 2, iphone4 as my phone.........the apple tv is awesome. And that is all inclusive. Works grate every day, flip on master switch at plug in every morning and comes on everytime. The HD, is really amazng and with all items mentioned, the apple tv has the best filter for watching stuff thru. I highly recommend the rocketfish ultra thin hdmi cable for $20, really amazing picture. The sound filter in the apple tv is also the best.It has a very sleek remote control , the apple tv is like a control panel for all your needs, music movies , netflix, are the ones I use everyday. The kool thing with the wifi is I can have my ipad and walk around the house with the ipad camera on and it will mirror on the tv. Same with video. The mirroring option is awesome. I tend to just watch things thru the apple tv rather than watch it on my ipad, and mirror to my hdtv, the filter on the apple tv makes it come in clearer picture and sound and puts everything into full 1080p format.I highly recomend is product. Well worth the hundred bucks. Comes in a nice apple box. Top notch. Besides my tv can literally carry all my entertainment needs in a backpack.............I HAVE ARRIVED.And the telefunken stand for the ipad, with all this is a sweet setup that I will have a long time. Forever.The one really kool thing is the HD movies on itunes come in so real with this setup. My neigbor sed wow, it looks so real. And thats the plus of buying movies from itunes. The quality is awesome.", "verified": false, "helpfulness": "2/2", "author": "Mdawg"}, {"rating": 4.0, "review": "Literally plugged it in and set it up in less than 5 minutes - not kidding.  I'm not an apple kool-aid drinker so I didn't want to buy an Apple TV until I truly saw a benefit I couldn't live without.  Being able to stream my movie library with minimal effort was the kicker in the end.  The only problem I have is that my PC needs to be logged in for the Apple Home Sharing to work.  Obviously that's not an issue with the Apple TV box, it's a setting on my PC that needs to be changed.", "verified": true, "helpfulness": "2/2", "author": "Heather Novak \"hcgnovak\""}, {"rating": 5.0, "review": "I bought this for only airplay but have found the YouTube and NBA to be great. What I don't like about it is that the movies are expensive - there should be some free movies. Also, instructions do not mention that the software update should be done via wifi, and not Ethernet connection.", "verified": true, "helpfulness": "1/1", "author": "OB"}]