[{"rating": 5.0, "review": "This is easy to use and works great!  We use it to watch movies and I use it to project my slides from my I-pad to a large tv when doing business presentatons. Love it!", "verified": true, "helpfulness": "0/0", "author": "Anne D."}, {"rating": 5.0, "review": "Love, love, love it! We tried the first one out and then bought 2 more for the 2 bedrooms upstairs! Couldn't live without it now!", "verified": true, "helpfulness": "0/0", "author": "Denise W. Pursifull"}, {"rating": 5.0, "review": "What can I say about this product. No surprises, the product is as good as expected. I have an iMac, iPod touch, iPhone 5 running on Apple Extreme, so installation was not a hassle at all. But see that your devices are running on the same wifi network.", "verified": true, "helpfulness": "0/0", "author": "Ket \"Gadget Freak\""}, {"rating": 5.0, "review": "For 99 bucks this this is a steal. It totally integrates all of my Apple products (Mac, iPhone, iPad) wirelessly and seemlessly using Airplay to stereo and TV. Great for renting movies from the iTunes store and streaming Netflix movies and series", "verified": true, "helpfulness": "0/0", "author": "primefan1"}, {"rating": 4.0, "review": "About me, I'm a tech guy with 30 years experience. Over the past 2 years I have heavily invested in the Apple Eco System. I have IPods, an iPad 2, a 2012 Mac Mini, and now Apple TV (newest version). It's been well stated that there is not a lot available for content outside of the Apple Eco System as compared to Roku, for example.I've hardwired the ethernet connection to my router from the Apple TV, as suggested, to avoid overloading my wireless capability at home.I'm running the latest version of the OS on the Apple TV, Mirroring my Mountain Lion and Ipad screens is very handy.I've updated my review and added a 4th star because the 'wired ethernet causing content load failure' issue has been addressed. The device needs to have more content available and have it available from the Itunes store. That's the only drawback at this point that I see, and it costs 1 star...I have seen one 'bug' in the current version of the software. Loading select Vimeo content caused an error message stating that the content wouldn't load because my TV didn't support the 'HDMC' protocol (an encryption protocol used by newer HDMI devices). Recommended fix was replugging my Apple TV into the TV. That didn't work. Cold booting the Apple TV did fix the issue.As others have stated, this is a no brainer if you already have Apple products, especially newer ones. If you don't have Apple products, then unfortunately at this time, I could not recommend this product to you, it simply wouldn't have the value per the cost to you... That's the bottom line.", "verified": false, "helpfulness": "2/2", "author": "Tristan Tighe"}, {"rating": 5.0, "review": "I would recommend this to everyone! Great product. My kids love watching Netflix through this device. Great for the entire family!", "verified": true, "helpfulness": "0/0", "author": "Lcarter13"}, {"rating": 5.0, "review": "You cant go wrong with Apple, especially this Apple TV.  It has made my classroom so much better, for teacher and students!  Instead of standing by your computer, clicking away, why not walk around your classroom with Ipad in hand...I love it and highly recommended for classroom!", "verified": true, "helpfulness": "0/0", "author": "Casey J Maxon"}, {"rating": 5.0, "review": "I bought an Apple TV to replace my Roku device on my family's main TV. I've had a Roku HD for the past year and a half which I've since moved to another TV. The Apple TV has Netflix and Hulu Plus on it which is what my family uses 99% of the time. Roku has more channels, but I rarely watched them. I do like having Spotify on the Roku, but with AirPlay I can easily run Spotify on my iPad and mirror it to my TV/sound system. I think this device is excellent for what it does. My only complaint with the Roku was that it was flaky and I had to reset it frequently. Whether that was the device itself or the software running the channel I don't know. Hopefully it's better with the newer Roku devices. I will still use my Roku on another TV. I also have most of my media in iTunes. If you have a Mac and/or several iOS devices then an Apple TV is worth consideration over Roku. I couldn't be happier with it. My kids enjoy AirPlay because one can play on the iPad while the others watch it on the TV. That solved the problem with my oldest son getting irritated by his younger brothers crowding around him to watch him play on the iPad.In summary, I think both Apple TV and Roku are capable devices. Having other Apple devices in the home was the deciding factor in purchasing an Apple TV for my family. If you don't have other Apple devices then Roku is likely a better choice.", "verified": false, "helpfulness": "0/0", "author": "Chay David"}, {"rating": 2.0, "review": "Do not like it because there is not enough programming to make this a viable option as compared to streaming", "verified": true, "helpfulness": "1/3", "author": "Unknown"}, {"rating": 5.0, "review": "We use 2 of the apple TV's in our home.  We no longer subscribe to cable or satellite and have been enjoying the extra money in our bank account every month and the ease of using the Apple TV.  We do have a subscription to NetFlix and Hulu Plus so we will use those to watch programming.  In addition we find ourselves listening to alot more music through MOG and Pandora through the apps available on the apple devices.  Also has the ability to watch NHL, MLB and NBA games through those apps if you have a membership to any of those.  But even if you don't you can watch the highlights from all the games offered in these apps.", "verified": true, "helpfulness": "0/0", "author": "SiggyFay"}]