[{"rating": 5.0, "review": "I love it! it was the best gift to myself, in fact I find myself coming home and watching Netflix or hill before I even consider watching regular tv.", "verified": true, "helpfulness": "0/1", "author": "SaraJane"}, {"rating": 5.0, "review": "I am using this product for my work and find it so easy to use, transport and care for!  I particularly like that it fits in with my purse so I can produce a big look without carrying in a lot of gear.", "verified": true, "helpfulness": "0/0", "author": "homefront"}, {"rating": 3.0, "review": "I did connect Apple TV to my brand new 65\" SAMSUNG slim 3D Smart TV and initiated (logged in) my NETFLIX account. When I try to watch a movie, Apple TV shows a window and error message like this: \"this movie can not be performed right now, try it later\". So, I realized that a conflict with the Apple TV is happening because I did watch the same movie at the Smart TV's NETFLIX option. I don't have any problem or conflict with my Laptop, IPad & Blu-ray player's NETFLIX apps, neither.", "verified": true, "helpfulness": "0/2", "author": "Alberto Rodriguez"}, {"rating": 5.0, "review": "Roku was and still is the most dependable, consistent, foolproof set-up with the most channels. For only fifty bucks, I don't see how you can beat it as the \"first\" choice for people seeking alternatives to cable, over-the-air programming, and DVD players.  In fact, both of my children's families have dropped cable and moved exclusively to Roku plus Netflix and Amazon for all of their needs.  My wife prefers cable and uses Roku for an occasional Netflix stream.That leaves me as the Apple TV guy, and this is the 2nd one I've purchased of Apple's 3 editions.  The box can be more temperamental than Roku, requiring the right settings on your computer and mobile devices, as well some limited knowledge about the device's interaction with iCloud and your various media libraries (iTunes will increase its usefulness)..  Also, the buyer should first be made aware that, unlike Roku, Apple TV does not give the user access to Amazon Prime services and features. Finally, for some reason each time I'm finished using Apple TV, I simply can't produce the necessary blinking \"start-up\" light the next time I use it unless I first go to the floor, unplug the device, wait a few seconds, then replug.  (It's probably good exercise for me, but some of us can be obsessive about ensuring that consumer media technology functions as flawlessly as its claims)  This 3rd generation Apple TV is far more reliable than my previous generation model, which eventually wouldn't even let me select \"Settings,\" but I was disappointed at the discovery that it would still require unplugging the device from AC before each use (maybe my \"unsmart\" TV is at fault).Unlike some, I don't require Apple TV simply to be able to hear my collection of music or to see my photos and movies in a room where there's a paired, compatible television set.  But I do find that the combination of the ITunes Store, with its vast holdings and resources, plus the availability of YouTube (not available on my Roku box), make up for the absence of Amazon content.  Moreover, I'm amazed at the effectiveness of \"Air Play\", which enables the user to \"mirror\" movies and videos on an iPod, iPad, or iPhone on a large TV screen--and in detail that's strikingly sharp.  (I would watch music videos streamed from Youtube all day long if it were my choice.)  One caveat: not all features are available to users who don't have Apple mobile devices or a computer with the iTunes program on it. Also, although I can \"mirror\" my computer's desktop onto my television set, the image is so dull I'm not inclined to use this feature.As for ChromeCast, it's far more limited in program content than either Roku or Apple TV and is, imo, fully valued, even at its current low price.  The ChromeCast device itself (which is nothing more than an extra-large thumb drive) was resistant to a secure HDMI connection in the back of my TV, and its attached short cord that must be plugged into a nearby USB port is a nuisance disproportionate to the reward.The best I can say for ChromeCast, when comparing it to the other two, is that it doesn't require a remote control (which is constantly getting lost).  I keep ChromeCast only for emergency use--should either of the other two boxes fail to access Netflix or \"throw\" a Youtube video on to my TV screen (which I rarely have time to watch--figuring out these gadgets takes up too much of it).  Some owners claim that Chromecast is the best of the three for \"multitasking.\"  Regardless, I'm happy to leave such activities to those who are more versatile than I.  Moreover, the device works best with computers that have Google's Chrome browser installed, and by habit I simply can't use anything other than Apple's Safari browser.", "verified": true, "helpfulness": "2/2", "author": "Caponsacchi"}, {"rating": 5.0, "review": "Apple is know to have very user friendly product and this is also seen in the Apple TV. Extremely easy to connect and use. This product is everything I was expecting.", "verified": true, "helpfulness": "1/1", "author": "Gina Yoon"}, {"rating": 5.0, "review": "APPLE.... all you need to know cause what apple product has ever failed?  Im sure something new will come out better but this works great.", "verified": true, "helpfulness": "1/2", "author": "Dee"}, {"rating": 1.0, "review": "If you predate Hdmi you're out of luck. Does not operate without a straightforward Hdmi connection. Not only that but it like clicks into this weird visually impaired mode when it only has an audio connection. Very annoying.", "verified": true, "helpfulness": "0/6", "author": "Ben Faure"}, {"rating": 4.0, "review": "...if it had Amazon Prime as part of its setup.  That said, it's a great little unit that provides an excellent quality experience directly with Netflix...as well as Amazon Prime Video (when facilitated via Airplay).", "verified": true, "helpfulness": "0/0", "author": "Blues"}, {"rating": 4.0, "review": "I got this before I got my Rokus but it's still useful for display mirroring for my Mac and iPads.", "verified": true, "helpfulness": "0/0", "author": "Robert \"rob_squared\""}, {"rating": 5.0, "review": "Wonderful product! Works seemlessly with my iPhone and iPad, I can mirror them both through Apple TV to my HD TV which is very nice. Must buy for those without one.", "verified": true, "helpfulness": "1/1", "author": "Keith Robertson"}]