[{"rating": 4.0, "review": "Good product, only needs to support Amazon Instant Video!!!", "verified": true, "helpfulness": "0/1", "author": "Jim Kelly"}, {"rating": 5.0, "review": "I was nervous because the wifi funtion never worked properly on our first generation Apple TV. But no issues with this one! Fast, easy to use and I love that we can put our TV anywhere without worrying about cables or internet cords. My only wish is that Apple TV would work with Amazon Prime!!!", "verified": true, "helpfulness": "0/0", "author": "Jenn"}, {"rating": 5.0, "review": "i was shipped this with no hemp cord- but it was quickly fixed. This is used DAILY in my household. It works with both moviebox and playbox. We love being able to watch what is on our phones on the tv!!", "verified": true, "helpfulness": "0/1", "author": "-t-"}, {"rating": 5.0, "review": "Fast shipping Great service.Would recommend all the way.Thank you", "verified": true, "helpfulness": "0/1", "author": "djemel chergui"}, {"rating": 3.0, "review": "the Apple TV is great but was very obviously not new. It had previously been used as someone elses Apple Account Info was on it!! As this was a gift this was doubly upsetting and embarrassing. Luckily she is a really close friend and did not make too big of a deal out of it. Also, the remote was missing which made it pretty much impossible to set up, as even with the iphone remote app you still need a remote to get it activated initially!! Thank god I have an Android and so different version of the app which worked and enabled us to get her remote and AppleTV up and going  . Amazon was super helpful and fast once I contacted them about getting a remote out though no apology for selling a previously used item as new. Had they not been so helpful and fast in there response they would only get 1 star.", "verified": false, "helpfulness": "1/1", "author": "naima"}, {"rating": 5.0, "review": "Super easy to set up and use. We bought it to utilize the HBO Now App. We ended up canceling our cable and saving a good chunk of money every month.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works like a charm. Was the most current version and I have not had any issues. Picture comes in better and clearer on the Apple TV than my Xbox 360 or my PS3 when streaming movies or shows from multiple apps.", "verified": true, "helpfulness": "0/0", "author": "Levi"}, {"rating": 4.0, "review": "Great reliable box - would like voice functionality like Amazon! Has HBO on Comcast, which Amazon does not.", "verified": true, "helpfulness": "0/0", "author": "Billy the Kid"}, {"rating": 5.0, "review": "Great to use in my classroom", "verified": true, "helpfulness": "0/1", "author": "francis"}, {"rating": 5.0, "review": "Love it. Got it and have not gone back to cable mode. Really enjoy the mirroring capability for your IOS devices. It's fun for other's especially when your playing a multiplayer game!", "verified": true, "helpfulness": "0/1", "author": "michelle w"}]