[{"rating": 5.0, "review": "I don't know what I'd do without my Apple TV!  This was almost plug n play and converts my 50\" into a smart TV. The only thing I wish it included was Amazon, but I understand that's a competitor.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Moss \"Author, TOWN RED\""}, {"rating": 4.0, "review": "Easy to set up and great picture.", "verified": true, "helpfulness": "0/0", "author": "JLM"}, {"rating": 1.0, "review": "Was sold as current version.  Was not  You Tube has shut the software to this unit off.  Not happy", "verified": true, "helpfulness": "1/2", "author": "ELIZABETH J CLEEK"}, {"rating": 5.0, "review": "works great", "verified": false, "helpfulness": "0/1", "author": "Gary Goodrich"}, {"rating": 4.0, "review": "Works great. Would be nice to be able to install 3rd party software.", "verified": true, "helpfulness": "0/1", "author": "JAN C LUBECK"}, {"rating": 5.0, "review": "Wish I hadn't had to purchase yet another one... boo YouTube... but this latest version will now play all the content.  The Apple Tv is one of the best devices every created.  Makes my video viewing much more enjoyable.", "verified": true, "helpfulness": "0/1", "author": "Blu"}, {"rating": 5.0, "review": "LOVE EVERYTHING ABOUT IT", "verified": true, "helpfulness": "0/1", "author": "Amandaaa"}, {"rating": 5.0, "review": "Fast shipping and works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Claudia Romero"}, {"rating": 5.0, "review": "Second Apple TV I've bought, first one for myself. I never realized it had channels for sports, news, and other things on it! So easy to set up. Works great", "verified": true, "helpfulness": "0/1", "author": "Nathan"}, {"rating": 4.0, "review": "I love this product, we can connect our apple products to the TV and can mirror whatever we are looking at.  It is great for showing off pictures to a large group.  You can also stream your videos from any apple products.  As a bonus you can also stream from your favorite apps. Great for the TV's that are not Internet ready and want to watch Netflix on it!  The negative i give it is that i wish the remote was a little bit bigger and easier to use.  There are only 3 buttons on the remote.", "verified": true, "helpfulness": "0/1", "author": "Anthony \"Anthony\""}]