[{"rating": 5.0, "review": "LOVE THIS! Everyone needs Apple TV. Prompt shipping!", "verified": true, "helpfulness": "0/0", "author": "DMADDNESS"}, {"rating": 5.0, "review": "I have issues with things that require the internet to work, but this thing is the 8th wonder of the world if you have an iTunes library and good internet connection.  I never watch TV, I watch the heck out of this thing though.  Very easy to use.  Integrates perfectly with your local iTunes, iTunes Cloud, and iOS devices.  Highly recommend if you own a lot of iTunes movies and shows.  Works great with Netflix too.Also works extremely well with content that you own exclusively of iTunes.  Very easy to \"airplay\" any content from a Mac, iTunes on a PC, or any iOS device to this unit.Only bummer is it will not airplay iTunes purchased movies or tv shows from your computer if internet has been down for awhile.  Not a great solution for me up in Alaska where I don't have a constant internet connection in my room.", "verified": true, "helpfulness": "0/0", "author": "iBigChill"}, {"rating": 5.0, "review": "Everything was perfect.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Borg"}, {"rating": 5.0, "review": "Excellent great product!!!!!", "verified": true, "helpfulness": "0/0", "author": "octavianocg"}, {"rating": 3.0, "review": "Great layout and selection, but I have a very fast internet connection and the Apple TV struggles to stream video without lagging frequently while the Roku, PS4, computers, tablets, and Xbox 360 in my home have no problems.", "verified": false, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Works good but sometimes it keeps stopping... But I love it... I am happy oft this little dude... :-)", "verified": true, "helpfulness": "0/0", "author": "LAM..."}, {"rating": 1.0, "review": "Over the last few years I have purchased three apple TV units.  None of them work properly now.  I use them mostly for streaming Itunes music from my iphone to the TV and on to the stereo, and for displaying my mac book pro screen onto the TV (I'm a photographer, and when I show client's their proof images, I use apple TV to show my mac display on the TV screen).  At first, all of them worked OK...a few hiccups now and then.  Now none of them work well.  They all constantly drop signal from whatever device I'm using.  And trying to troubleshoot the problem...you might as well be working on the space shuttle.  Too many components involved in the process (iphone, ipad, macbook, wifi, itunes, apple tv itself...etc.).  And even if you do find an issue, good luck fixing it.", "verified": true, "helpfulness": "0/2", "author": "Paul E. Serafini"}, {"rating": 5.0, "review": "I love my Apple TV, works right out of the box and pretty easy!  Great product and it works fabulous with my ipad as well!", "verified": false, "helpfulness": "1/1", "author": "DEBORAH WILSON"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "1/1", "author": "Mary"}, {"rating": 3.0, "review": "U need unplug often.", "verified": false, "helpfulness": "0/1", "author": "sean zhang"}]