[{"rating": 4.0, "review": "The Apple TV works well. We like the AirPlay features that extend our iMac monitor to the TV. Our Roku does offer more channel options.", "verified": false, "helpfulness": "1/1", "author": "Robin"}, {"rating": 5.0, "review": "I really am very pleased with this product. It has the quality feel that apple is known for. Great for watching netflix but.............. The really cool thing is the air play feature. Air play allows you to display the screen of your iphone or ipad on your big screen tv wirelessly. It is great for convvenient big screen face time or skype. I love it.", "verified": true, "helpfulness": "0/0", "author": "John M."}, {"rating": 5.0, "review": "I purchased this as a gift for a friend.  They love it and has been a great addition to their computer usage.", "verified": true, "helpfulness": "0/0", "author": "Mothernut"}, {"rating": 5.0, "review": "This is our second Apple TV. We loved our first so much we had to get another one. Shipped quickly and the price is right.", "verified": true, "helpfulness": "0/0", "author": "Jon H."}, {"rating": 5.0, "review": "Everything  was ok! The Apple TV works fine. We are happy with the product.Was a good price.Thanks for all.", "verified": true, "helpfulness": "0/0", "author": "marianne heitmann"}, {"rating": 5.0, "review": "I am happy to say I now own an apple tv! I purchased this item when it was on sale from amazon 80$! AND I used an amazon gift card too! I can only say I purchased it for less than half of what Its originally worth!", "verified": true, "helpfulness": "0/1", "author": "Israel"}, {"rating": 5.0, "review": "I have grown to love this product and how it integrates with my other apple products.  Is a consistent performer on a solid platform.  i am a cable cutter and this has been best tv product I own (I only wish Apple could integrate some skip-back functionality in the remote (not another button (but maybe a double-click left or right for a short skip back and a triple-click to skip back or forth, a chapter...just saying).Would highly recommend if a new version wasn't due out soon.  I also own a Roku 3, but the Apple TV is a much more polished product and has noticeably better image display properties.  (not to downplay the Roku 3, it's a fine product and I use that daily, as well.  It's image display is not unwatchable, but the AppleTV displays a much crisper image).", "verified": true, "helpfulness": "1/1", "author": "tympanik"}, {"rating": 2.0, "review": "Doesn't work half of the time. It keeps telling me I'm not an authorized user for almost all channels even when I'm signed in.", "verified": true, "helpfulness": "0/1", "author": "Gina Owens"}, {"rating": 5.0, "review": "Apple TV is amazing. Easy Graphical User Interface. It gives you access to a lot of channels out there… Netflix, YouTube, etc. GREAT price! RECOMMEND!!! :)", "verified": true, "helpfulness": "0/0", "author": "Meg"}, {"rating": 5.0, "review": "This Apple TV works so much better that the DVD player that was set up to access netflix and other products. We use it a lot.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Canterbury"}]