[{"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "1/2", "author": "patrick reznak"}, {"rating": 4.0, "review": "Very happy with this product", "verified": true, "helpfulness": "1/3", "author": "Alfredo polanco"}, {"rating": 3.0, "review": "I like the product, its an improvement of my prior Apple TV unit which had worn down with age apparently.However the issue is that this unit, which purported to be new, is not new.  It is previously owned and arrived fully loaded with the prior owners configuration including Apple ID, home sharing, Netflix account, language, region, and time zone.  Therefore, it creates a question as to the source- if one wishes to obtain a new and authentic Apple product perhaps one must buy it directly from the Apple store.  This is evidently a reconditioned unit from Gazelle or some such place, and the reconditioning did not even involve resetting the device.", "verified": true, "helpfulness": "0/2", "author": "Lewz"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "rainville yap"}, {"rating": 5.0, "review": "the best product i have ever bought. Using it for netflix and youtube in my tv", "verified": true, "helpfulness": "0/1", "author": "White Ines \"inewhite\""}, {"rating": 1.0, "review": "I used Ruku before and compare to Ruku, it is terrible. No apps other than Apple ecosystem. I can't watch Amazon prime or listen to Spotify. Apple movies are the only option which is pretty expensive for renting or buying.  AirPlay is the only good feature but that too doesn't work properly 1/2 the times. I bought it because Apple brought down its price but i considered this a waste of money.", "verified": false, "helpfulness": "1/4", "author": "T. Saha \"smartbengali\""}, {"rating": 1.0, "review": "DO NOT BUY ! I am an apple fan, but boy this product sucks. It does take forever to load and stream (Roku is 10x faster) and it resets itself all the time which makes you enter all your information over and over again. Why would apple release such a fautly product. When it does decides to work it works great, but i spend 50% of the time fixing its issues. Just google Apple TV problems and you will see how plagued this thing is. I didn't believe until I got it.  Get Roku. it works 1000x better.", "verified": true, "helpfulness": "1/4", "author": "Marcos \"mrc08\""}, {"rating": 5.0, "review": "Can't beat the price - and this is the same packaging and contents as the ones you get from the Apple Store. The description doesn't say it, but it comes with the remote and power cable, etc... brand new and packaged like from Apple themselves.", "verified": true, "helpfulness": "0/1", "author": "Hermosa Julie Jo"}, {"rating": 2.0, "review": "I hate it. I do, and I am upgrading from an original first Roku box. After switching to Apple Netflix streaming continually has an error, please come back later! They do not let you pick the channels you want and force you into the Apples choice of 120. No pandora no Amazon, none of the  choices of Roku. I am an Apple fan don't get me wrong have it all phone, tablets, iPods. But this is a miss for a streaming device other than if you only want it to AirPlay your device to your television. But I found quality poor through apps (Amazon, abc,ect..) via my iPad to television. I would have stuck with Roku if I had known. In fact I just purchased the stick as well to make up for the shortcomings of this product. About the only thing I like is the sleek look to the box and remote.", "verified": false, "helpfulness": "0/1", "author": "snowlaiden \"frosty\""}, {"rating": 5.0, "review": "The Apple TV is pretty sweet.It comes preloaded with 20-30 video apps like a Roku does (including Netflix and Crackle, but sadly not Amazon Prime).  Most of the apps require a subscription, but at least they all have a trial period of some length, which vary from a handful of shows to 2 weeks or so.You can mirror your iOS device or MacBook (2011 or newer) to the Apple TV wirelessly.  Mirroring is great because you can stream videos and music in HD, (including the Amazon Prime that isn't included as an app).The wireless tech this uses is clever and works great. Instead of using Bluetooth, the Apple TV and device connect to the same wireless network.You can also play music, movies, and videos that you have purchased with your Apple ID.  The Apple ID integration across all Apple devices at allows you to stream all purchased content over the cloud is quite impressive.As an added bonus Apple just lowered the price from $99 to $69.Overall I am impressed by the Apple TV and I will keep it in mind for gifts for family and friends.", "verified": true, "helpfulness": "0/0", "author": "A. Fujikawa"}]