[{"rating": 2.0, "review": "After setting it up and registering it which was pretty much way to complicated as is usual with any Apple Product it worked fine until the next day when I wanted to start watching again. It came up with an error and told me to go to an Apple web address, which was not there. As usual with Apple products. I called customer support which took a half an hour before I was in touch with a person who could help. After a couple of seconds he said I needed a different cable that I did not have available and had to plug it into a Computer witch has I Tunes installed to reload the firmware because something went wrong. This item is not ready for issue it seems, it was pushed to market. I returned the item and am sorry I wasted my time with it.", "verified": true, "helpfulness": "0/1", "author": "Harry Richard Lewis III \"Wuzzerdad\""}, {"rating": 5.0, "review": "Bought this for my room mate, he loves it!!", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 5.0, "review": "Amazing product!! Amazon does it again!", "verified": true, "helpfulness": "0/0", "author": "Alexandra McAndrews"}, {"rating": 5.0, "review": "great streaming", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We use the Apply TV box for Netflix and Hulu instead of getting cable. We love it except when you lose the ever elusive micro remote, you cannot operate it unless you preprogrammed your iphone to operate the box.", "verified": true, "helpfulness": "0/0", "author": "Jillian Wester \"Jillian\""}, {"rating": 5.0, "review": "Excellent.  You can watch just about anything on here in true hi-def.", "verified": true, "helpfulness": "0/0", "author": "Richard Almon"}, {"rating": 5.0, "review": "I had no idea this little box could do so much!  I love being able to \"mirror\" and play iOS games on my television. All my music, photos, and videos can be displayed on the tv without opening my laptop.  I'm able to watch shows from networks I pay for with satellite that aren't on demand with the company.  No more DVR confusion.", "verified": true, "helpfulness": "0/0", "author": "J Blanchard"}, {"rating": 5.0, "review": "This is the first time I use the AppleTV. It's really very easy to set up and user friendly. If you have any IOS devices and wanna connect to TV, I suggested you to buy AppleTV instead of any other competitor devices which maybe cheaper. I've been tried some other devices the connectivity was very poor, always said no device found, the wireless wifi connection was so unstable, the quality is not as good as Apple.", "verified": true, "helpfulness": "1/1", "author": "Wilson Chow"}, {"rating": 5.0, "review": "I bought it as a gift for my son and daughter n law. They love it. I would buy myself one, but I already had the Roku device. I may end up buying one anyway as I am not that happy with the Roku, as it is wireless only and cannot be connected to ethernet.", "verified": true, "helpfulness": "1/1", "author": "Stephen M. Shirk"}, {"rating": 5.0, "review": "You just can' go wrong with Apple products.  Love, love my apple TV.  Very easy to install & operate.", "verified": true, "helpfulness": "1/1", "author": "Girltish"}]