[{"rating": 5.0, "review": "fast and quick .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. .. speedy and quick and fast and will order again", "verified": true, "helpfulness": "0/1", "author": "Yousuf Ahmad Ali"}, {"rating": 5.0, "review": "The Fact that you can download the remote app on your iPhone and use it on the Apple TV is awesome! You can also view your iPhone on the TV. How cool is that ! Too many features ;)", "verified": false, "helpfulness": "0/0", "author": "1txgal"}, {"rating": 5.0, "review": "I bought this for my husband for Christmas. He loves it so much! Now we can watch all our iTunes movies and Netflix in any room!", "verified": false, "helpfulness": "0/1", "author": "Sun Hee"}, {"rating": 5.0, "review": "Crazy fun.  So very cool to throw YouTube from your iPhone over to the Apple TV and have it play on your system with the big screen and big speakers.  Download movies that you rent or purchase.  It will only keep getting better.Plays off your home's wireless network.  Can pull iTunes from your home computer.  For those of us who grew up with 8 tracks, this is pretty amazing stuff!", "verified": true, "helpfulness": "1/1", "author": "D. Guthridge \"Ring-a-Ding-Ding\""}, {"rating": 4.0, "review": "Easy hook up! Like the instant look back at video just recorded on IPhone.  Great integration w/ my home set up.", "verified": false, "helpfulness": "0/0", "author": "Gina"}, {"rating": 5.0, "review": "The Apple TV is a great addition to our home entertainment choices.  That is what it does.  It expands our choices of selections to show on our HD Screen TV.  In fact, we had not utilized the HD capabilities of our TV until we used the Apple TV device.", "verified": true, "helpfulness": "1/2", "author": "N.B."}, {"rating": 5.0, "review": "Great product. Works well, both Wired & Wireless. I have been looking for an alternative way to stream content and this makes it very easy to do that with the apple products i have at home.", "verified": true, "helpfulness": "0/0", "author": "Sanjay Mandloi \"Mandloi\""}, {"rating": 3.0, "review": "Doesn't do much that I can't do already with my tv, but AirPlay is nice. Also there was a problem with the Ethernet so had to connect wirelessly to download a software update that fixed the Ethernet bug", "verified": true, "helpfulness": "1/2", "author": "Ssquared"}, {"rating": 5.0, "review": "Works perfectly and is even smaller than I expected.  It uses a single HDMI connection for both audio and video.  The WIFI transmission is very fast, I have a 30+ mbps hardwire internet service to my router.  Netflix use is smooth with no pauses in streaming.  Playing a movie wirelessly from m iPad or Macbook is seamless and the audio and video match up perfectly with no synchronization issues.  If you own Mac devices and especially movies purchased through iTunes you should have an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "ERIC WATTERS"}, {"rating": 4.0, "review": "A lot of people see my AppleTV and still aren't sure what it does. Simply put, it can rent or buy on-demand movies and TV shows, buy music form the iTunes store, stream videos from Vimeo, YouTube or Netflix, plus Hockey, baseball and basketball (with a subscription).The feature I use most, however, is to stream the music and movies I already have on my computers to the TV in my living room. It's so easy to set up; just join your home wifi network, enter a name and password and you're all set. Any Mac or PC in the house, running iTunes, will automatically show up and stream to your TV.Yes, Roku, Xbox, PlayStation and other devices can do some or all of the above features, and if you have one of those, you probably don't need this. But the AppleTV is the simplest solution of them all. If you want something that a babysitter can figure out immediately without a lengthy training session, or something you can put in a guest room for company, or a way for your small children to watch their favorite cartoons over and over again, this is the way to go.", "verified": false, "helpfulness": "0/0", "author": "Alex K."}]