[{"rating": 5.0, "review": "I purchased this second Apple TV after the mountain lion upgrade allowed the mirroring of my macbook. Product has an extremely small footprint and setup is a breeze.", "verified": true, "helpfulness": "0/0", "author": "XxICARUSxX"}, {"rating": 5.0, "review": "Decent Looking! standard apple appearance.The biggest surprise is that I can stream my video to Apple TV( Only 2011's Mac can use mirroring, mine is 2009.) by using third-party software.", "verified": true, "helpfulness": "0/0", "author": "Liu"}, {"rating": 5.0, "review": "Apple TV is great for entertaining.  We have the Apple TV on a big screen in our screen room and we show photos, movies, play music, etc. all the time.  Wireless to my computer and iTunes, so no problem with running wires.  I did have a problem with the screen saver stopping after 30 minutes, then having to restart the Apple TV before it would connect to the PC again.  I downloaded the latest software and there must have been a fix in there because it hasn't done it since.All you do for the screen saver of your photos is make a folder on your computer and then point your iTunes to it via the iTunes software.  The screensaver can do various effects to bring photos in and out.  Very nice for family photos or vacation photos when you have people over.", "verified": true, "helpfulness": "0/0", "author": "toma114"}, {"rating": 4.0, "review": "Can't complain because wife is happy.  She just loves the airplay.  Setup was easy.  Wish searching/typing is a bit user-friendly than scrolling up and down to select each alphabet. Would recommend Apple to inspire from Nintendo Wii style of selecting.", "verified": true, "helpfulness": "0/1", "author": "Ramgiridhar R. Kilim"}, {"rating": 5.0, "review": "This is like every other device that apple produces, works just as described, enables me to watch movies purchased on ITunes. Netflix is nice and I'd really like it if i could listen to my amazon music & watch prime, but that wasn't the purpose. I purchased this device to share my screen for presentations, it does just that, little  to no latency over a 1 gb network. I have Apples newest airport extreme which does dual bandwidth, I think this helps.", "verified": true, "helpfulness": "0/0", "author": "CLC"}, {"rating": 5.0, "review": "I love the Apple TV. Works seamlessly with my iPhone 4GS and iPad for mirroring. Great if you have some friends over and want to throw up a YouTube video for everyone to watch. We even take turns with our phones controlling which video we're all watching. Kind of a fun party game.Also have Netflix and NHL GameCenter subscriptions, and very satisfied with both of them on Apple TV. For the NHL games, especially, you can go back and watch EVERY game throughout the entire season--both home and away broadcasts. Amazing, and no need to DVR 3-hour games anymore. As far as Netflix is concerned, I can't imagine going back to watching on my laptop now that I have this hooked up to my TV.**The only con/drawback I would say is that mirroring and video playback via your iPhone/iPod/iPad does depend on the strength of your WiFi network. I actually relocated my router closer to the entertainment room where my Apple TV is hooked up so that I can optimize the connection. Other than that, this is a great product and very satisfied with it.", "verified": false, "helpfulness": "4/6", "author": "mlind87"}, {"rating": 5.0, "review": "This is my second Apple TV and along with the mirroring on Mountain Lion makes it a must have home theater component.  They recently added Hulu+ and I am betting that more will come as broadcasters realize that with mirroring available they might as well join the parade.Easy setup via wifi or ethernet.  Fast interface which provides a lot of extra functionality with users existing Apple centric media libraries.  Streams photos and music like a charm.", "verified": true, "helpfulness": "2/3", "author": "C. Kracke"}, {"rating": 2.0, "review": "First of all, I am an Apple lover. Own several Apple products.I am so thankful to Apple TV, because I started loving  my Boxee!!. I am slowly observing that Apple is moving from  people oriented products to profit oriented products. Anyways.......I digressed......Apple TV....these guys first of all lock up the box, everything takes you to iTunes store and asks for your CC, Block you from accessing any of your personal non store media, movies, music, etc. that's stashed up in your NAS or external hard drive. Thank heavens for small mercies.......the AirPlay.  Even Boxee does AirPlay.......just that it doesn't mirror, that's all. There are hardly a few apps on ATV, it depends on your ipad, iphone and so for apps. Boxee has 200 of them. Most of them serve free content. Anyways.....I am disappointed. Bottom line? Not worth a 100 bucks. I would have a real little media serving computer such as Boxee. If not for AirPlay mirroring, I would have sent it back.Hope that helps you make a good decision.", "verified": false, "helpfulness": "1/5", "author": "Arun K. Seetharam"}, {"rating": 5.0, "review": "If you own a mac and an iphone, you're gonna love having an apple tv. I basically use it to stream itunes straight to my stereo system and watch my 'acquired' movie collection after converting them to mp4 or m4v and importing them into iTunes.", "verified": true, "helpfulness": "1/2", "author": "AT"}, {"rating": 3.0, "review": "I got this to use the Airplay feature.  I have a media hub in my house so the ability to buy or rent movies/tv shows off iTunes wasn't a big deal for me.Apple doesn't tell you this, or at least advertise this fact, but you need a 2011 Macbook or newer.  If you have an older Mac it will not let you do mirroring, and I'm not sure it will even let you use airplay.  Luckily I have a new MBP, so that was not an issue for me, but just wanted to let other people know as I have seen some people pretty upset it didn't work with their current Mac setup.I really like how easy it is to use.  It took mere minutes to set up and get situated with my iTunes account.  The only complaint I'd have about this stage is the remote takes forever to scroll through all the letters and symbols to enter your user name and password, but thats not really Apple's fault, well kind of, but nothing a nice remote with keyboard wouldn't fix.Airplay works really well, I was very impressed with the speed and sound quality of the streaming from the bedroom into the living room.  I haven't tried streaming anything 1080p because the only movies I had on my iTunes currently were 720p, but those streamed well without any hitches.My only complaint would be with the mirroring.  It works flawlessly as far as picture quality and sound quality.  The gripe I have, and maybe this is just my problem and I haven't figured out how to work around it......but to move anything on the screen you need to actually be looking at the computer and physically moving it.  I guess it was more my fault, because if there is no mouse or keyboard directly connected to it, how is it supposed to know its supposed to move?  I guess I figured something in the Apple TV itself would sync up and allow you to use the remote or something to move around the screen.  It would not, so to change what I was watching as far as a MKV file that iTunes didn't support I had to go into the other room, click on everything, hit play and then walk back out to the living room.  Not a huge deal, because the picture quality and sound was great, when you connect them the sound actually won't come out of your computer anymore and will go right to your speakers so thats nice, which makes me think there must be some way to get a mouse or something working on the screen.Overall I'm pretty happy, but just a few minor complaints.  Its still a great purchase and makes it a lot easier to stream music from my computer room rather than hooking up my iPod to the stereo.", "verified": true, "helpfulness": "2/4", "author": "JoshM5683"}]