[{"rating": 3.0, "review": "The apple remote came with a dead battery making the apple tv pretty much unusable..", "verified": true, "helpfulness": "0/1", "author": "Jude Melen"}, {"rating": 5.0, "review": "This is a great device. Love the mirroring from the ipad to the tv. Definitely recommend!", "verified": true, "helpfulness": "0/1", "author": "Lisa"}, {"rating": 4.0, "review": "It's an Apple TV so you get what you expect.  The way Apple handles the YouTube menus is terrible and too many of the channels require a TV subscription and I do not subscribe to cable TV.I'll subscribe to cable TV when the cable companies pay me to watch the commercials.Still, ABC News is a good channel with no commercials and there is a TED Talks channel and a You Tube channel which are the main reasons I use the Apple TV.CNN Go, CBS and SKY News are reasonable channels that have commercials, but you can skip them by getting out and getting back into the segment.I'll watch commercials when they quit screaming at me, stop trying to trick me into giving them my attention, and stop lying about the products they are sponsoring.  It would be better if the companies spent the money on producing a good quality product rather than a commercial with big boobs or little puppies.  Word about good quality would get out........", "verified": true, "helpfulness": "0/1", "author": "GoatSpice"}, {"rating": 5.0, "review": "Great product and came very quick!", "verified": true, "helpfulness": "0/1", "author": "Elisha Walton"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "latinman"}, {"rating": 5.0, "review": "Great! Apple did well with this. I bought this mainly for mirroring. That capability is great and effective; it doesn't work constantly but is worth it in my opinion. The remote buttons are small for my big hands sometimes.", "verified": true, "helpfulness": "0/1", "author": "Kojo O."}, {"rating": 5.0, "review": "Everything I'm looking for!", "verified": false, "helpfulness": "0/1", "author": "Princess"}, {"rating": 5.0, "review": "Easy to use. Very small so it fits anywhere.", "verified": true, "helpfulness": "0/1", "author": "Sarah C Allan"}, {"rating": 5.0, "review": "Amazing product I recommend it", "verified": true, "helpfulness": "0/1", "author": "Andres Cruz"}, {"rating": 5.0, "review": "Fast, simple, Apple... I wish it could be powered from the TV instead of an outlet, and that you could mirror Windows PCs to it. Other than that great.", "verified": true, "helpfulness": "0/1", "author": "Francisco"}]