[{"rating": 5.0, "review": "You will initially feel that there is a huge gap when using this as your only entertainment option, and that cutting Cable/Sat TV was a mistake. THEN, you realize that you were watching a lot of CRAP in the first place! And realize that life is much better with an extra $1000 in your pocket by Xmas time!!! :))", "verified": true, "helpfulness": "3/3", "author": "R. Patel"}, {"rating": 5.0, "review": "Love the Apple TV. Now that HBO Go is compatible, it easily beats out the Roku. I actually use this in the office to throw video up to the main screen, it's fantastic.", "verified": true, "helpfulness": "0/0", "author": "Dunham"}, {"rating": 3.0, "review": "I purchased the Apple TV after the HD version came out, V3 I suppose.  What I like is Netflix.  I won't watch Hulu, because you get less for the version you pay for than the free one, plus all the same commercials over and over drive me up the wall.  So, basically it's a Netflix box with a little bit of AirPlay or Air Parrot.  I rarely use this because I am too lazy to start it on my computer and move to the living room.  It's easier to watch Amazon Prime on my computer or my iPad.  I don't watch baseball (gasp!), NBA, or NHL, so those are worthless to me.  Also the just added ESPN and HBO are also totally worthless, as I have DirecTV.  What's with that?  So, I am being generous with the 3 stars only because for what it does for me, it does well.  I only wish Apple would quit treating ATV like a hobby and get serious about offering content.  There are reports of a deal with Time-Warner coming, but once again, worthless to me as I can't get TW. Apple, talk to DirecTV!! Please!!Bottom line, if all you are going to do is Netflix and AirPlay on your home network, it does this VERY WELL!  If you want more, maybe the new Roku 3 is the way to go.  I am thinking about adding one just for Amazon Prime Video and the slick headphone remote!", "verified": true, "helpfulness": "0/0", "author": "R. Allen"}, {"rating": 5.0, "review": "The Apple TV has more options than I had expected... Different apps for different streaming services.  The best part, though, unlike other players I've used, it seems to store what was streamed, so if I want to go back half a minute or so, I don't need to wait for it to reload the movie.  It is ready to go!  Nice job, Apple!  My only regret is that it does not have Amazon Prime streaming - still that competition with Google, I guess, since their devices are sold at Amazon.  My work around will be to try streaming from my iPad to the Apple TV, since I have an app for Amazon Prime there.  Haven't tried it yet, but will update if something does not work.  The iPad ll could not do this, but the iPad lll and later are supposed to-- a great excuse to upgrade the iPad!", "verified": true, "helpfulness": "0/1", "author": "B. Murray \"Dr. B\""}, {"rating": 5.0, "review": "I really like being able to pull up a yoga video on youtube throw it to the tv and have my own yoga classes in my living room. Also we watch HBO GO and netflix almost every night.", "verified": true, "helpfulness": "0/0", "author": "CourtneyOlms \"ceejay\""}, {"rating": 5.0, "review": "Already own other Apple TV's and love them, needed this one for mobile presentations from my ipad - using the wireless screen share option makes it a breeze to do without being tethered to the tv.", "verified": true, "helpfulness": "0/0", "author": "~ Kyle"}, {"rating": 4.0, "review": "I would like it better if it allowed the ability to use it as a second screen more. The fact that it just mirrors the existing screen makes it a little less enjoyable.", "verified": true, "helpfulness": "1/1", "author": "J. Williamson \"JBW\""}, {"rating": 5.0, "review": "if you watch movies and is a mac user you must have one - bought two one for the office and one for the house.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 5.0, "review": "I wrote a few reviews about the other streamers and I always said just buy apple tv instead!The best design, Check!The best software, Check!The best ease of use, Check!The best option to watch anything you like, almost Check! (no amazon prime at the moment, 7/7/13)The best resolution, Check!The best screen saver, Check!The best of the best, Check!!!", "verified": true, "helpfulness": "0/0", "author": "Magix"}, {"rating": 5.0, "review": "Makes me wonder why I wasted so much money on satellite TV!  I highly recommend this as either a replacement or a supplement!", "verified": true, "helpfulness": "0/0", "author": "PDaws"}]