[{"rating": 5.0, "review": "I have one in every room. Don't question it. Buy it!", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 1.0, "review": "Awful, I hate this machine. UI is clunky, the controller is bad and why the gell does it affect all macs in the area, I don't use it all all, it's not worth the hassel, doesn't work, poor quality, choppy, used a cromecast, no problems, I'm switching over, Apple could sell the iDump and people would buy it, it's an inferior product. Unless you absolutely must have all your electronics designed by ghost Jobs, which I'm aware much of you apparently do, don't buy this.", "verified": false, "helpfulness": "2/6", "author": "A.D. Olson"}, {"rating": 5.0, "review": "Great device! Use it mainly for presentations with my Mac Book Pro.", "verified": true, "helpfulness": "0/0", "author": "A. Marc"}, {"rating": 4.0, "review": "EASY SETUP  ,WIFI, RESTRAMING, GREAT GIFT", "verified": false, "helpfulness": "0/0", "author": "lenora marbury \"lenora maarbury\""}, {"rating": 2.0, "review": "It has issues, The first one died before an error, the second one ever time you watching something it times out and they will have to unlpug the power plug and restart it again.", "verified": true, "helpfulness": "0/2", "author": "jitu"}, {"rating": 5.0, "review": "I bought this to stream movies to any HDMI easily. It is great that I can easily pack it up and take it places! My only complaint is the power cord as it is a bit thick but that just means that it is high quality like every other Apple product!With this Apple TV, I am able to download Netflix and other apps (unfortunately, I can't get Amazon Instant Video on it), and mirror my device's screens to my TV! It's fantastic when I have family over and have something on my phone to show everyone!", "verified": true, "helpfulness": "0/0", "author": "Devon Miller"}, {"rating": 4.0, "review": "Works great. Doesn't have access to Amazon Prime App, I use my Roku for that.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "work as described", "verified": true, "helpfulness": "0/0", "author": "AK"}, {"rating": 5.0, "review": "I was very happy with my purchase and the quality of this product.", "verified": true, "helpfulness": "0/0", "author": "XPMiami"}, {"rating": 5.0, "review": "Nice product", "verified": true, "helpfulness": "0/0", "author": "revrace24"}]