[{"rating": 5.0, "review": "Does everything expected - second one I bought for a second TV.  Love looking at all of my photos on the big screen..", "verified": true, "helpfulness": "0/0", "author": "Lawrence Rothenberg"}, {"rating": 5.0, "review": "What can I say that everyone else hasn't?  As far as a thoughtful review, forget about it.  Subjectively, I love it!  My kids are able to use it all the time for Airplay and we can stream content to it, via wireless N.  Super easy to configure.", "verified": true, "helpfulness": "0/0", "author": "drcall81"}, {"rating": 5.0, "review": "I compared apple tv & roku and just by airplay capability, decide to use this product. simple to setup and easy to use.", "verified": true, "helpfulness": "0/0", "author": "honeybunch"}, {"rating": 5.0, "review": "My entertainment organization has jumped light years thanks to purchasing the Apple TV. My kids love it too since it has so many options for videos, movies, music.", "verified": true, "helpfulness": "0/0", "author": "Eric Salzman"}, {"rating": 5.0, "review": "Though I am still learning all that this product can do, I already love it. The best feature thus far is that it allows me to play the music on my computer through my home theatre system. So, I get great sound when watching tv programs or when listening to my music.", "verified": true, "helpfulness": "1/1", "author": "Ronald F. Hicks"}, {"rating": 5.0, "review": "I watch Netflix, MLB and rent movies.  A must have for iPhone and iPad users for the AirPlay option (watch anything on your phone/tablet on you TV through wifi)", "verified": true, "helpfulness": "0/0", "author": "Font420"}, {"rating": 4.0, "review": "I really do like my Apple TV, however, I had so many connection issues with my HDTV and computer that it was hardly worth it in the end.  It turns out, you have to buy a specific type of HDMI cord to connect it.  I bought cheap ones so some connection couldn't be made.  Just make sure that you buy the right cords, and if you aren't sure, buy them somewhere where you can return just in case.  It seems like this was a pretty common problem all around the internet while searching for solutions.", "verified": true, "helpfulness": "0/0", "author": "Hasen"}, {"rating": 4.0, "review": "I upgraded from an older generation Apple TV and must say that this is much more responsive, as it should be.  Wish it had the Amazon prime app for free videos ... then I would not need the Roku.", "verified": true, "helpfulness": "0/0", "author": "storm"}, {"rating": 4.0, "review": "This tight and easily set up device is just what I would expect from Apple.  Though to really enjoy the unit a membership to Netflix or Hulu is needed, it is an able substitute to cable television for the infrequent viewer.", "verified": true, "helpfulness": "0/0", "author": "Auburn Cinefile Society \"Cinfile\""}, {"rating": 5.0, "review": "Ez to install works great.  Now Hulu iTunes and Netflix YouTube all in one place no more switching between devices to use them all in 1080p.", "verified": true, "helpfulness": "0/0", "author": "Nate A. Thornhill"}]