[{"rating": 5.0, "review": "Love being able to take anything from my ipad and watch it on tv.Watching netflix and the other stuff is easy.Only wish that the networks would get it together and get the apps available on the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Peter Huff"}, {"rating": 5.0, "review": "So many new features.  Easy to install.  I resisted for a long while, but the mirroring feature of ipad is great to show movies and share my screen.", "verified": true, "helpfulness": "0/0", "author": "RT. Chin \"Ray\""}, {"rating": 5.0, "review": "I love it i basically bought it to stream movies from my ipad mini,and it does exactly what i bought it for ,it streams every thing straight form ios or apple devices any thing later then the iphone 4s it works with and i love the streaming it does i basically bought it for movies", "verified": true, "helpfulness": "0/0", "author": "hector casillas"}, {"rating": 4.0, "review": "I love my Apple TV.  I have a problem that the movies are $5.99.  I can go to Redbox and get the same movie for $1.29.  I guess that's a gripe for iTunes and not Apple TV.  I use an optical cable for the audio and it's incredible! I can also utilize my iPhone as the remote.The remote feels sturdy, and flimsy.Most apps utilize Airplay, where I can play YouTube videos, Amazon TV, etc. I can also play my music!  A big plus with the holidays around the corner.Overall, a great product for an Apple lover.", "verified": true, "helpfulness": "0/0", "author": "Rose B."}, {"rating": 5.0, "review": "I love my AppleTV. It provides an amazing service that makes it much easier to part ways with your monthly cable TV bill. For just under a hundred bucks, you get access to Apple's entire media ecosystem, including the hottest TV shows and movie rentals in HD. You also get access to apps like Netflix, Hulu, and YouTube to round out your entertainment choices. And since all of this content is on demand, you don't even need a DVR.Setup and operation couldn't be easier. Just enter your Apple ID, your WiFi credentials, and you're good to go. Once you're online, it's easy to find what you're looking for. The menus are easy to navigate, and while typing in search terms with the included remote can be a chore, you can search for content.The two main drawbacks are 1) you won't find a lot of live content on AppleTV and 2) you can't sit back and channel surf (though in some ways, that's arguably a good thing). A simple HD antenna can do the trick for the major networks, but for events like basketball, you might be out of luck. And while you can purchase NBA, MLB, and NHL packages for use with AppleTV, licensing agreements black out a lot of the games you'll want to see anyway.That said, the amount you save by using and AppleTV over your cable TV service can't be overstated. Even if you purchase four or five seasons of your favorite TV shows and rent a couple of movies, depending on what cable TV package you have, you could easily save anywhere from $500-$900 a year. That's a lot of money. And even if you do decide to stick with your cable TV subscription, movie rentals and access to Netflix and Hulu on your TV still make AppleTV a compelling purchase.", "verified": false, "helpfulness": "0/0", "author": "Tony L."}, {"rating": 5.0, "review": "Best way to view Netflix! This makes a great replacement for my BluRay player which was streaming, terribly. The ATV is easy to set up & use and absolutely worth the $99.The addition of iTunes radio is fun - I push the signal through my receiver and it's like having a free concert in my living room.", "verified": true, "helpfulness": "0/0", "author": "db"}, {"rating": 5.0, "review": "Apple TV is really amazing and super easy to use. I would recommend it to everyone. The apps are great and they are adding more all the time.", "verified": true, "helpfulness": "0/0", "author": "Rob L"}, {"rating": 5.0, "review": "Love this thing. Was pretty hesitant when I bought it but I'm so glad I did. Now I can watch netflix is something bigger than my iPad.", "verified": false, "helpfulness": "0/0", "author": "Jeremy Herbert"}, {"rating": 5.0, "review": "We bought this to stream amazon through our TV and catch up on shows via apps (HBOgo, etc). Seriously a life changer. One important note that I didn't catch in the reviews is you must have an HDMI to HDMI cable in order to hook it up; it does not come ready to go out of the box.", "verified": true, "helpfulness": "1/1", "author": "Christina D."}, {"rating": 4.0, "review": "Nice product. Be careful when doing the update to the new version. After the upgrade product crashes. You must have a micro-usb cable to do a restore in iTunes.", "verified": true, "helpfulness": "0/0", "author": "I. Ovejanu \"IO\""}]