[{"rating": 4.0, "review": "Good quality", "verified": true, "helpfulness": "0/0", "author": "John Halliday"}, {"rating": 4.0, "review": "Has some trouble streaming in 1080 from a new macbook air.  Seems to be a common problem with this device.  Replaced router to a Linksys AC1900.  That helped, but didn't totally rectify the issue.", "verified": false, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "This is the 4th Apple TV I have purchased. Works great!", "verified": false, "helpfulness": "0/0", "author": "Rozalia L \"IgE Doc\""}, {"rating": 5.0, "review": "Quality product!", "verified": true, "helpfulness": "0/0", "author": "Deek"}, {"rating": 5.0, "review": "I love this little device! This works so much better than the roku and is so simple to set up... just plug in the HDMI cable and power cord.  They really have improved the software on this with every update and you can now watch so many different networks on demand.  I have yet to rent or buy a movie from the iTunes store because there are so many other options on it.", "verified": true, "helpfulness": "0/0", "author": "P.J. P."}, {"rating": 4.0, "review": "I didn't buy it from Amazon, but, at the time, I didn't know they sold them through Apple.I really enjoy the easy to use interface; very Mac-ish, which is what I personally enjoy.Video quality is fan-friggin-tastic.  I mainly use mine to watch movies I've bought through iTunes, and the quality of the video is definitely NOT it's weak point.I do have a few things I hope they fix in the future.The MAJOR thing I hope they eventually do...  is get rid of the stupid IR remote, and go with an RF remote...  I can't tell you how frustrating it is to have to click numerous times on the button, only to not see any response from the Apple TV because of something in the room jacking with the IR.  Yes, you can use the remote app on your phone...  but really, Apple...  All the technology you have, and you use IR for this beauty?The other thing, is the lack of apps.  This seems to be a gripe of most everyone, though.  They're slowly building the app base, but, at their own pace.I personally think you have to be a die hard Apple fan to truly appreciate the Apple TV.  If you're a mixed bag of tech, it's just gonna be \"meh\", and you'll at times feel like you've wasted money on something you use only time to time.", "verified": false, "helpfulness": "0/0", "author": "Brian Spence \"kc5deb\""}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Rodney Cooper"}, {"rating": 2.0, "review": "Frequently disconnected", "verified": true, "helpfulness": "0/1", "author": "Soowan Lee"}, {"rating": 5.0, "review": "my son loves his Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Lynne Faulkner"}, {"rating": 5.0, "review": "Easy to set up and use and there are lots of apps.", "verified": false, "helpfulness": "0/0", "author": "Kaylyn Belcher"}]