[{"rating": 5.0, "review": "Works perfectly fine, easy installation, you can play any file (music, video and pictures) in your TV, moreover, you can access youtube and other things like (flicker, Vimeo, Trailers, etc...).Syncing the files to be displayed on TV can be done via the wireless network or wired, I have tested playing HD movies via wireless network without a problem.It is recommended to download the FREE (remote) application available from Apple for your Iphone or Ipad to easily control the device and type faster for YOUTUBE search instead of using the provided remote control.Browsing pictures is super fast, there is no lag what so ever, I was surprised to see that even though my pictures are larger than normal Ipad or Iphone pictures, also there is a cool slide show and screen saver.Notes:- You need to buy an HDMI cable it is not included with this product, many available in AMAZON and can be available for less than $10- The item I have received is supporting (100-240V & 50-60Hz), I think some customers outside US might be interested in that, I have also uploaded a photo with such details.", "verified": true, "helpfulness": "15/15", "author": "Rashid \"Rashid\""}, {"rating": 5.0, "review": "If you do not have a smart TV or want to save hundreds when buying a new TV by this.  A non smart version of a TV is ussually a few hundred cheaper.  Then you buy this and viola!", "verified": true, "helpfulness": "0/0", "author": "Woodpecker"}, {"rating": 5.0, "review": "easy to install.  easy to set up!  easy to use!  what more could i ask for.  it took a good five minutes to open it up and find the parts, figure out the instructions, hook it it up and set it on the back of the set!  the hardest part was throwing out the box.  setting it up was with my computer was soooooo, easy.  it was connecting to my my mac mini and as the they say...,. easy as pie.  the hardest part of pie is washing the plate and the fork!", "verified": true, "helpfulness": "0/0", "author": "tireiron"}, {"rating": 1.0, "review": "What a complete waste of miney! poor wireless connectivity, hard to use....waste. I can get cable much easier or NetFlex", "verified": true, "helpfulness": "0/6", "author": "teacher53 \"rdm\""}, {"rating": 5.0, "review": "the integration with my itunes library and my other apple devices make the device amazing, the only thing to be perfect is the lack of jailbreak and install xbmc,plex or something like that.", "verified": true, "helpfulness": "0/0", "author": "Gilbert \"sound and tech...\""}, {"rating": 5.0, "review": "I purchased this for my dad after he fell in love with mine. He uses it to view the pictures he has on his iPhone. He also uses it for music (so many genres to choose from). When he has guests over he will have the beautiful slideshow of pictures running with his selected music playing in the background. He also uses it to rent + view movies instantly. The quality is superb and it is so easy to use. I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Y. Lindo"}, {"rating": 5.0, "review": "I currently have three of these and a HD antenna. We only have internet and over the air television which has been amazing. The Apple TV has worked well for me since I have iPads and iPhones which can have stuff streamed to them via Airplay. I tried a Roku but the lack of Airplay and I own many movies that are in iTunes which Roku wouldn't play.", "verified": true, "helpfulness": "0/0", "author": "Lester L Palmer"}, {"rating": 5.0, "review": "I have had my Apple TV for several months and love it! I use it mostly for Netflix and Hulu. The only thing I don't like about it is the tiny remote. We lost it a long time ago, but that is fixed very easily with the \"remote\" app. It works very well also.", "verified": true, "helpfulness": "1/1", "author": "Shaina"}, {"rating": 2.0, "review": "This is basically an apple router. It either has to stream from your computer or the interest. No local stored files of your movies or music.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Apple's ease of use has been slipping for a while now. All of the problems I have had in the last 2 weeks with the Apple TV have been answered by internet searches, not the flaccid helpdesk at apple. All of the solutions have been short lived, as in I have to keep having to do the same thing over and over to displace the inconsistencies one should not encounter with an apple product. This is not user error so much as them putting out products that are of dubious quality. I'm really considering in replacing the box with the assumption it is faulty.", "verified": true, "helpfulness": "1/4", "author": "Chelsey Jacobs"}]