[{"rating": 1.0, "review": "Folks,Most of the reviews for the Apple TV Box are from non-verified Amazon Customers which means in my opinion, they were hired by a stock broker, Apple, or some other PR Firm looking to try anything to make the Apple stock price go back up to the $700 per share price which it should not have been at in the first place with only 2 major products generating almost all the company revenue. Let me say this, my brother bought the Roku Streaming Player and loves listening to Pandora, but he pays for the service on top of his cable bill. Here is the truth about all these \"HYPED\" streaming TV devices...Ready...My brother thought, oh great, I can get rid of cable TV and not have the bills every month! Guess again, with any of these streaming media boxes, you pay per series or episode, do I need to say it again louder? YOU WILL PAY FOR EVERYTHING YOU BUY USING THESE STREAMING DEVICES ON TOP OF YOUR CABLE BILL! You need cable TV and to say it louder, YOU NEED TO BUY EITHER THE MIDDLE OR TOP SPEED INTERNET PACKAGE BECAUSE THEY DO NOT TELL YOU WHEN YOU PURCHASE THESE DEVICES THAT YOU NEED A HIGH SPEED CONNECTION TO STREAM THE CONTENT...DECEPTIVE BUSINESS PRACTICES IS THE WORD FOR IT! All the streaming boxes are worthless, a fad, and will not survive! People, do not waste your money on any streaming device when you can use almost any Tablet, Notebook or Desktop Computer and do the same thing. If anything, spend an extra $100 and you get a full tablet in HD from Amazon! Buy the Kindle Fire HD Tablet by Amazon if you want streaming content but at least with the Kindle Fire HD, Amazon gives you a free tablet that the company is losing money on just to capture a good customer base! The Kindle Fire HD Tablet is a hands down winner above and beyond any of these streaming \"Falsely Hyped\" TV Boxes!F.Y.I. Mr. Jeff Bezos, your new TV Ad comparing the Kindle Fire HD to the Apple iPad is the best Ad I have seen in a long time! Your marketing department nailed Apple face to face, world-wide with that ad. IN fact, I wish the marketing department went one step further and actually showed more of what can be done with the Kindle Fire HD compared to the iPad with hardly any useful features. Folks, again, the Kindle Fire HD is feature rich! Spend the extra $99 to $100 and buy the Kindle Fire HD and let the so called streaming devices die a nice slow death.F.Y.I. - 2.19.2013Update on the Apple TV Boxes...The price is declining because people are starting to figure everything out! You do not need this box to stream anything as I said above in my post. All you need is a $100 CD Player with Wi-Fi and you can get all the streaming content, i.e. Amazon Streaming Content, Netflix, etc. The prices from what I have seen today are as low as $79 for this empty black box by Apple.", "verified": false, "helpfulness": "1/19", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I give it 5 stars. It is exactly what I expected it to be. It also comes at a reasonable price", "verified": true, "helpfulness": "1/1", "author": "Conner"}, {"rating": 5.0, "review": "What a wonderful item to have! We can watch shows of all types like netflick (7.99 monthly).  Easy to set-up and use!  We just love it!", "verified": true, "helpfulness": "1/1", "author": "Brenda"}, {"rating": 5.0, "review": "I am very pleased with my purchase of the newest version of the Apple TV. It syncs with my iPhone perfectly and displays my information onto my television just as it says! It is very easy to figure out - self explanatory.", "verified": true, "helpfulness": "0/0", "author": "Sunshine"}, {"rating": 5.0, "review": "Quick delivery, quality packing. No issues with the product so far. I would recommend this for anyone with a mac or new generation ipad.", "verified": false, "helpfulness": "0/1", "author": "Sanjith"}, {"rating": 4.0, "review": "I've had the Apple TV for about a year and a half now and I love it.  It isn't something that you would call a must have item, but it is very good at what it does do.Here is what you get:*  User friendly interface*  Integration with other Apple products*  Access to the iCloud*  iTunes integration*  Apps that include MLB TV, NHL TV, NBA TV, Netflix, and moreAgain, it isn't something you absolutely have to have, but it is fun and adds an element to your media consumption.", "verified": false, "helpfulness": "0/0", "author": "David R. Wakeman \"Dave Wakeman\""}, {"rating": 4.0, "review": "This is just what I needed. I had been using a mini-port to HDMI cable to mirror my Mac. Worked great for several months. When I downloaded an HD trailer and tried to play it, the connection flickered out. I tried two different cables to no avail. the connection would come and go (mostly go). I had never been interested in an ATV, but research indicated that it might be a good way to mirror the Mac. Ordered it, set it up, bang: off to the races (I have a late 2011 MBP, so air-play works fine). It is what it is. I don't do a lot of streaming, so I'm not missing the access to various venues mentioned by others. I like the interface with iTunes. The initial reason for my interest in connecting the computer to my home theater system (such as it is) was the ability to drive high impedance headphones. I also enjoy the interface with YouTube. Those rotating still frames are pretty cool. My often lame DSL is slow to load content (and sometimes just fails) but that's not the fault of the ATV. As for mirroring, my only disappointment is the slight lag time. I work in graphics programs via a Wacom tablet and this slight lag is not a good thing (but I don't mind working directly on the Mac these projects). If my local Apple store wasn't constantly crowded, I would have spent some time at the genius bar to see what's up with the lightening port (Apple Care wasn't able to get it figured out, and I found many blog posts about the problem). Bottom line: For basic use, this is a solid product. I don't regret buying it. Oh, BTW, the free remote  app works great with my iPod 5G. That's a definite plus.", "verified": true, "helpfulness": "2/2", "author": "Thunderhead22"}, {"rating": 3.0, "review": "The idea of apple tv is cool but still in its infancy stages.  There just isn't much that sets it apart from on demand on cable.", "verified": true, "helpfulness": "0/0", "author": "Robert Hunt"}, {"rating": 5.0, "review": "Just like all of the other Apple stuff... simple, useful, and reliable.  It's great to be able to project the iPad screen up on the TV so the family can share a laugh at a YouTube video, to browse photos or watch a movie.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "Since I only get 2 TV channels over the air, the Apple TV box has enriched our TV viewing manifold. Netflix ,uTube,Etc as well as being able to stream news shows from my iPad directly to the Flat Screen TV is a definite plus.", "verified": true, "helpfulness": "0/1", "author": "WERNERAN"}]