[{"rating": 5.0, "review": "I love my apple products.. They are easy to use for people who aren't technically savvy. Well worth the price to stream my Netflix and Amazon Prime. I highly recommend this for anyone. This also comes with the Apple guarantee which is one of the best parts of apple if not the best. Their genius bar is always there to help!", "verified": true, "helpfulness": "1/3", "author": "E. Oshea \"E. O'Shea\""}, {"rating": 4.0, "review": "I would give this 5 stars if Apple would include a web browser and the ability to open up the app store.  Otherwise it is awesome!  We use it every day between the loaded apps, and mirroring content.  You can also connect it to your home network and watch/view any content on that network.  its the bee's knees!", "verified": true, "helpfulness": "0/1", "author": "freeborn"}, {"rating": 5.0, "review": "I have the fire tv and the fire stick but needed this to support HBO now.  Works great and I love it but wish that I could get HBO now on my fire TV.  In time I suppose....Great service through Amazon as always!!", "verified": true, "helpfulness": "0/1", "author": "Johnny Atwood"}, {"rating": 5.0, "review": "why didn't' I get this sooner? Needs fox sports go added", "verified": true, "helpfulness": "0/1", "author": "Spencer J. Lazara"}, {"rating": 5.0, "review": "This Apple TV module is of high quality and works very well.  It provides easy access to lots of on-line media as well as facilitating the ability to show your iPhone or iPad pictures or videos on your TV.", "verified": true, "helpfulness": "0/1", "author": "RTA - Charlotte, NC"}, {"rating": 5.0, "review": "Love it. Anything on my phone can now be played on my big screen TV. Also can watch ESPN3 on the big TV. All my iTunes music on my computer can plays on the home theatre now using the home network and Airplay feature.", "verified": true, "helpfulness": "0/1", "author": "IndyRich"}, {"rating": 5.0, "review": "Very happy with this item", "verified": true, "helpfulness": "0/1", "author": "Carl Mattax"}, {"rating": 5.0, "review": "It well exceeded my expectations and is very convenient", "verified": true, "helpfulness": "0/1", "author": "Bryan"}, {"rating": 5.0, "review": "Great deal", "verified": true, "helpfulness": "0/1", "author": "Gregory Reynolds"}, {"rating": 5.0, "review": "I love this tv", "verified": true, "helpfulness": "0/1", "author": "Whd"}]