[{"rating": 5.0, "review": "Best aspect of the Apple TV is the display of the slideshow. Enjoy watching and remembering those wonderful memories again and again.", "verified": true, "helpfulness": "0/0", "author": "Bruce L. Lutz"}, {"rating": 4.0, "review": "Apple TV is better than ever, but still not perfect. That's why only four stars.  You might consider a Roku box as an alternative that starts out even cheaper at about half the price.  If you're already bought in to the Apple \"environment\" however, I'd recommend this.", "verified": true, "helpfulness": "0/0", "author": "Dr. Cyber"}, {"rating": 5.0, "review": "tempted to buy a mac mini for a home entertainment setup, but used with an ipad, the apple tv does 90% of what i'd like for much less than the price of another machine.", "verified": true, "helpfulness": "0/0", "author": "Cmac"}, {"rating": 5.0, "review": "I use the AppleTV with all of the Apple products in my house and it works seamlessly. I have an Apple AirPort Extreme Base Station that has an external HDD plugged into the back and together with the AppleTV I am able to easily access all of the digital media on the HDD without having to get off the couch. I have only had it about 3 weeks but it's one of those things I'd hate to go withou after owning one.My only complaint as of now is the Netflix app needs a lot of improving. I am used to Streaming Netflix through my Xbox 360 and the Netflix app on it is much better. The AppleTV Netflix retires far too many button pushes to get things goin and doesn't have continuous play like the Xbox. I am able to get around this though by just steaming it from my computer to the AppleTV.Overall this gets a 10 out of 10 from me.", "verified": false, "helpfulness": "0/0", "author": "B. Grant"}, {"rating": 5.0, "review": "I have bought a couple of AppleTV's now and they are really nice. I especially like the Airplay capability. I just with they would figure out how to jailbreak the AppleTV 3!!!! :)", "verified": true, "helpfulness": "0/0", "author": "JRH \"ViperACR\""}, {"rating": 5.0, "review": "Great addition to my IPAD. I  Can play music, games, email and play video on my TV from my IPAD.", "verified": true, "helpfulness": "0/0", "author": "Barbara Gleasure"}, {"rating": 5.0, "review": "Love it so fat.  I only wish the movies were cheaper and there was an easier way to search YouTube videos.  AirPlay is a great addition.", "verified": true, "helpfulness": "0/0", "author": "P. Hart"}, {"rating": 5.0, "review": "We can browse tv shows and movies immediately through this Apple TV. Most especially I love watching movies in my Netflix account.", "verified": true, "helpfulness": "0/0", "author": "benjie ulep"}, {"rating": 5.0, "review": "It works great although I'm still learning to use it. Hope to master it soon. I expect I will soon enough.", "verified": true, "helpfulness": "0/0", "author": "RobertJ"}, {"rating": 2.0, "review": "Apple TV is great for Netflix and quickly ordering movies from Apple.  For those unfamiliar with Netflix, the interface actually does vary between devices you use to access the service.  Apple TV provides the best Netflix interface I have seen  The Radio app is also a great feature, 100's of stations to choose from.  The photo streaming is nice if you have flikr or icloud, but is clunkier than you would expect to set up.  By far the best feature if you have apple devices like iPad, iPhone, etc.  is the ability to show audio, video or mirror your screen from your device.  Lots of fun to surf Youtube videos this way.  if you get tired of the radio stations, it is straightforward to stream something like Pandora from your iPod, just one button to push.  The only problem is poor quality, especially the wifi connection.  The support forums are full of horror stories with this device.  My wifi just stopped working after 9 months.  Trying to get warranty service for it, but its really a poor showing from Apple.  If you buy it, cross your fingers and hope for the best--and maybe spring for the extended support contract for this one.  Usually that's a money loser, but it will likely pay off for this product.", "verified": true, "helpfulness": "5/6", "author": "M. Crawford"}]