[{"rating": 5.0, "review": "Apple TV is amazing! It's so easy to use and such a great purchase. We love being able to pull up anything off of HBOGO & Netflix and syncing our iPhones is a great feature! We are even thinking of getting another for another room. Apple never disappoints with a quality product!", "verified": true, "helpfulness": "1/1", "author": "Gena"}, {"rating": 5.0, "review": "Incredible service. I received this item the day after I ordered it on-line. This is a gift for my son. Hope it's what he wants.", "verified": true, "helpfulness": "0/0", "author": "Rae Tarrant"}, {"rating": 1.0, "review": "I dont know why most people comments are posiTive about appletv. They also compare it with roku. They Shouldnt be compared at all. Both are very easy to install. One cost twice as much. One give you hundreds of free channels the other none. You find out which one.", "verified": false, "helpfulness": "0/15", "author": "Luciano Silvestri B"}, {"rating": 5.0, "review": "Netflix, Hulu, 1080p, AirDisplayenough said...I would love to see a dedicated player so you can insert an external HD an reproduce or even stream it with an HD on your Airport Extreme.", "verified": true, "helpfulness": "0/0", "author": "rodrigo"}, {"rating": 5.0, "review": "I have one in my living room and bedroom. Love how well it streams my media. Zero bad things to say about this.", "verified": true, "helpfulness": "2/2", "author": "beachcripple"}, {"rating": 1.0, "review": "I like this device but I am upset that I cannot stream Amazon Prime.This makes me so mad and it is such a big deal that I will NEVER recommend this to my friends and family.", "verified": false, "helpfulness": "3/14", "author": "Palmetto State"}, {"rating": 3.0, "review": "I have a Windows PC, when I try to view a video from my iTunes library (the main thing I bought it for) if it's been a few hours since I last viewed something, I usually have to restart the Apple TV, then restart iTunes on my computer before it can view my home library. I've got an iPhone, an iPad, and I had a MacBook for several years and it's disappointing when you know how well everything else in the apple ecosystem seems to work together.", "verified": true, "helpfulness": "1/2", "author": "Joey McDaniel"}, {"rating": 5.0, "review": "As the title hints, our household is already well furnished with Apple products. And as it has been said in other reviews in this thread, it will be a much more positive user experience for people who have Mac computers, or iPad / iPhone / iTouch, for these last three can be used as remote controls with an excellent free app (\"Remote\") from Apple.", "verified": true, "helpfulness": "0/0", "author": "wang"}, {"rating": 5.0, "review": "I have the fastest inet I can get which is about 50Mb down. Compared to a Samsung Smart TV with apps the AppleTV dominates. Compared to DirecTV with OnDemand the AppleTV dominates. Compared to the Netflix app on AppleTV iTunes movie streaming dominates. Compared to a Playstation 3 interface the AppleTV dominates. Samsung Smart TV lags terribly in the interface. Netflix app on AppleTV takes forever to buffer, stutters, and has limited content. AppleTV movies play within seconds, never stutter, and have all the new releases you'd expect. AppleTV even has content that hasn't hit theaters yet. If you buy an AppleTV it would benefit you to buy into the Apple ecosystem i.e. iTunes Match, Photo Streams, a Mac computer, and even an Apple WiFi Access Point. When you put all those things together everything just works. It may be a little more expensive upfront but it's worth it when it just works. The most I've had to do is reboot the AppleTV or open and close iTunes but after the last couple of software updates everything has been working brilliantly", "verified": false, "helpfulness": "0/0", "author": "BBWI"}, {"rating": 5.0, "review": "Got my Apple TV yesterday. Setup was a breeze. At first I absolutely loved everything about it, a step up from my Roku for sure. Then I used AirPlay to stream a few videos from my iPhone 5. The video was excellent but the audio was choppy (it was also very choppy when I streamed songs from my Windows 7 desktop running iTunes using Home Sharing). This was a deal breaker for sure. I spent a few hours tweaking my wireless router configuration (Actiontec wireless router for Verizon FiOS) with no improvement. I was about to pack up the Apple TV and send it back when I remembered that it had an optical audio output on the back. I connected the optical cable directly to my Onkyo receiver and voila! No more choppy audio. Seems the problem is with my Samsung HDTV panel and not the Apple TV (audio path was Apple TV -> HDMI -> Samsung HDTV -> optical cable -> Onkyo receiver). Now I can say without a doubt that the Apply TV absolutely ROCKS! Excellent video quality, excellent audio quality (now)... love Netflix streaming with this device too. Last night my wife and I used the AirPlay feature to stream a rented movie from our iPad 3 to the Apple TV... played perfectly and without any issues. Today I've been streaming Netflix, HBO GO, and even Amazon Prime videos (from my iPhone 5) without any issues. I've even used AirPlay on my MacBook Pro to display my desktop on the Apple TV. At this point I can safely say that I've put it through its paces (AirPlay via iPhone 5, iPad 3, MacBook Pro, and Netflix and HBO GO via internal apps, and iTunes streaming from iTunes Match (both music and radio) with excellent results. I'm 100% satisfied because it does everything so well and effortlessly.", "verified": false, "helpfulness": "5/6", "author": "Steve Z \"Steve\""}]