[{"rating": 5.0, "review": "Didn't use, but own another one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Does not mirror!", "verified": true, "helpfulness": "0/0", "author": "Joel Fago"}, {"rating": 3.0, "review": "Difficult to make set up.  I had to call Apple.", "verified": true, "helpfulness": "0/0", "author": "David R. Smelter"}, {"rating": 5.0, "review": "ATV. Works great.", "verified": true, "helpfulness": "0/0", "author": "Adrian R. \"Adrian R.\""}, {"rating": 5.0, "review": "You can't go wrong with an appletv!", "verified": false, "helpfulness": "0/0", "author": "UNLK3"}, {"rating": 5.0, "review": "Awesome device! Easy to use, fast, large variety of apps, highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Shannon M. Thomasson"}, {"rating": 5.0, "review": "I have three of these in my house. Great user interface and seldom have any issues. It doesn't play nice with amazon so no native viewing on that score but you can AirPlay a stream. I also have roku and Amazon fire tv so I am covered on all counts. I have these to supplement my breakaway from cable. I don't miss cable at all and am happy not to pay the high monthly cost of getting 500 sports channels that I don't want coupled with the barrage of senseless garbage in the form of reality TV.  Can we as a culture just not give the Kardashians anymore money please?", "verified": true, "helpfulness": "1/1", "author": "Patricia"}, {"rating": 3.0, "review": "Adds the kind of functionality I was looking for, so I don't have to wear out my lightning port whenever I want to display to my TV.  Works neat with some programs, particularly OnSong, which I want to use to project lyrics to the TV while I read the chord chart and play.  I have 2 glitches...first, playback of DVDs does not work with MacBook's own DVD player...the screen is gray though the sound comes through...whether I mirror or use a separate screen. VLC player worked fine as a workaround.  Second, streaming web content and playing DVDs has a strobe-like feel...a bit jerky about every second.  If you look for it you will notice it, but if you don't see it, you will feel it.  It feels annoying over time.  Like the digital rendering is skipping a bit.  It occasionally gets unwatchable when something in the background starts chewing up CPU time, and I have to reset the connection.  Hopefully these bugs will get worked out in the new model.", "verified": true, "helpfulness": "0/0", "author": "Carl K"}, {"rating": 4.0, "review": "as advertised", "verified": true, "helpfulness": "0/0", "author": "Guerrier John Darwin \"BOG\""}, {"rating": 5.0, "review": "Great Apple product.  Fast shipping. Easy to configure.  Mirroring from your iPhone and remote control phone app are great features.Good value for the price.", "verified": true, "helpfulness": "0/0", "author": "bka4970"}]