[{"rating": 4.0, "review": "I would like to know why the remote is made out of aluminum? It's always freezing cold! It doesn't need a heat sink. I mostly use airplay from my iphone and the remote app. I like it, I don't love it. Needs app store ASAP!", "verified": true, "helpfulness": "0/1", "author": "G. Rudick"}, {"rating": 5.0, "review": "Usual Apple - everything just works well !!! Easy set up and and easy to use. No problems at all.", "verified": true, "helpfulness": "0/0", "author": "Python"}, {"rating": 5.0, "review": "This was a gift for family members and they loved it. They were absolutely blown away thank you so much.", "verified": true, "helpfulness": "0/0", "author": "Silvia Bellia"}, {"rating": 4.0, "review": "The best part and reason for buying it is AirPlay, otherwise save your money and get a Roku!Two drawbacks:1.) limited subscriptions when compared to Roku and Apple is very slow to add new ones.2.) While AirPlay allows Macs running Mt. Lion and other iOS 6 devices to connect wirelessly and show content, there is a serious lagging problem through the Apple TV. Video that streams cleanly on laptop or other device is often just a little behind the computer or LOTS behind the computer with complete stalls.  No good fix in any forum so far.", "verified": true, "helpfulness": "0/0", "author": "Foster"}, {"rating": 5.0, "review": "This product has worked out wonderfully to display videos from my iPad to my tv. Great for presentations as well.", "verified": true, "helpfulness": "0/0", "author": "B. Gilligan"}, {"rating": 5.0, "review": "Great media box. The best features for me are media streaming, Airplay, MLB.TV and internet radio. Very easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "ken p"}, {"rating": 5.0, "review": "Good product, easy to install and use for all ages. Vey limited in the online channels you can see !.", "verified": true, "helpfulness": "0/0", "author": "Jinho On"}, {"rating": 5.0, "review": "As usual, Apple products superior to itself.Ease of use and absorbing.I received the shipment in a short period of timeRecommend this product is a unique experience", "verified": false, "helpfulness": "0/0", "author": "Khaled Altawily"}, {"rating": 5.0, "review": "Great quality, useful, best.  Buy it.  I'm a normal dude that doesn't go crazy with reviews. I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Jason Coleman"}, {"rating": 3.0, "review": "It works fine but is far more limited than I had hoped--too much tied to iTunes. I should have researched it more carefully before I bought it. But again, for what it is, it works very well.", "verified": true, "helpfulness": "0/0", "author": "James Twiggs"}]