[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Richard Christensen"}, {"rating": 5.0, "review": "We love our apple TV. It works great and has everything we need!", "verified": true, "helpfulness": "0/0", "author": "Sara A."}, {"rating": 5.0, "review": "This is my second Apple TV unit. The first was an Apple TV second generation and which gave years of service. This new third generation thus far has built on the solid foundations of the first. All my equipment is Apple related and uses iTunes. This allows me to watch a movie from my iPad, iPhone, and of course on my TV. This does it all from Netflix to Youtube and actually seems quite able to be tailored to your specific requirements.I also like that they lowered the price because with so much competition now, I was considered different systems. The price drop really made this more competitive in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Roboto"}, {"rating": 3.0, "review": "It doesn't connect to WIFI that well. I brought it to another house to see if it was a problem with my Wireless Router but it had the same problem there as well. The interface is very nice but it just doesn't connect to WIFI well unless you're right next to the router.", "verified": true, "helpfulness": "4/5", "author": "Ido K."}, {"rating": 5.0, "review": "It was exactly what I've been looking for. Its really simple to use and works great", "verified": true, "helpfulness": "0/0", "author": "Michael Ochoa"}, {"rating": 5.0, "review": "Apple TV is Great!! I already have one downstairs. I definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Lucy Flaherty"}, {"rating": 3.0, "review": "Difficult to use.", "verified": true, "helpfulness": "0/1", "author": "Rusty"}, {"rating": 5.0, "review": "Works, great. I love it.", "verified": true, "helpfulness": "0/0", "author": "Billy Bonura"}, {"rating": 5.0, "review": "CUT THE CABLE - Apple TV had all I wanted", "verified": true, "helpfulness": "0/0", "author": "Michael Harrington"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Amin Makram Simaika"}]