[{"rating": 5.0, "review": "A way to get amazon prime and videos is to down load the amazon instant video app and amazon app to your I phone, I pad or I pod. The Apple TV will mirror onto your tv whatever you have playing on you device. You can do that with most apps. Hope this helps", "verified": false, "helpfulness": "0/0", "author": "Sharon Wick"}, {"rating": 5.0, "review": "I don't know how well it stacks up against Roku and other competitors, but as an iDevice family, it suits us very well.", "verified": true, "helpfulness": "0/0", "author": "dufrog"}, {"rating": 4.0, "review": "I have two Roku HD Streaming Player devices streaming Netflix, HuluPlus, and Amazon Instant Video in my household.  Why get an Apple TV?  Apple iPad integration, iTunes library access on my HDTV, and a need for speed!Side by side the Apple TV device blows my Roku away in terms of grabbing streaming content, buffering it, and getting it to play.  I love that!  Apple TV also offers up the cool features of syncing with my iTunes library and AirPlay with my iPad.  I love that too!What I don't love about the Apple TV is that it doesn't support Amazon Instant Video.  Maybe with future upgrades or generations it will, but for now, this newest version doesn't and that gives the advantage to Roku in terms of programming options.Roku also offers a bunch more 'channels' to surf than Apple TV, but Apple TV's ability to stream podcasts from iTunes evens things out for me.If you have HBO, you can use the AirPlay function to stream HBO content via the Apple TV to your HDTV.  AirPlay also allows iPad users to mirror what they are doing on their iPad to an HDTV with Apple TV connected to it.Apple TV gives you options like a plethora of Internet radio stations to listen to, FLICKR, and sports subscription channels.The downside to Apple TV is the price, but despite that, I'm glad I spent nearly double what I paid for my Roku on this device.  It's sleek interface runs smoothly (update it when you hook it up so you have the latest firmware) and quickly, and Netflix, HuluPlus and YouTube look great when played on the Apple TV.With AirPlay (super cool way to stream video from your iPad to your TV) and a free iTunes app called 'Remote', you can play your downloaded movies and TV programs from iTunes via the Apple TV.If you don't have an iTunes account, music library or iPad, you may want to stick with Roku with the bonus of a lower price and Amazon Instant Video.Apple TV is great except for its lack of Amazon syncing and limited channel add-ons.  Despite those faults (and the reason for the 4 out of 5 rating), it's really a fantastic piece of hardware with impressive speed and Apple product integration, making it worth a purchase in my book.7/1/13 - UPDATE:Be sure to do the software update to this device when prompted, or check in settings for the update.  This latest update seems to have helped the speediness of the transitions and optimized the Apple TV.  A slight update to the visual interface is nice too.  Unfortunately, Amazon Instant Video is not yet part of the update.", "verified": false, "helpfulness": "3/3", "author": "Andrea Polk"}, {"rating": 5.0, "review": "So cool to now be able to watch Netflix and Hulu on my big screen TV, wirelessly no less!  Transmission so far has been excellent.  Have fun.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "With Apple there are no middle terms, or you love Apple or you hate it.Since i am in the first group of people and i have many apple products at home, Apple tv is a must specially when you use the Airplay function.", "verified": true, "helpfulness": "1/1", "author": "ALFONSO A. MUNOZ MONTERO"}, {"rating": 4.0, "review": "Received the Apple TV on time and excellent condition, I love the way you can mirror your IPad or ITouch to the Apple TV, reason given 4 stars, will not play Amazon Prime movies thru it, can't understand if you can get and watch Amazon Prime on the IPad and ITouch why it won't play thru a third device (Apple TV) does not make any sense?", "verified": true, "helpfulness": "0/0", "author": "Reginald T. Johnson"}, {"rating": 3.0, "review": "The prufoemance of the product is slow, I dont know if it just internet connection (comcast) but it skips alot.", "verified": true, "helpfulness": "0/1", "author": "Daniel D Read"}, {"rating": 3.0, "review": "I should have done some more research first, was dissapointed to find out you can only stream 1-2 episodes at a time on the device, it has no hard drive to store items, and I am in an area with slower speed DSL access so it can take 2 hours to get a 30 minute show.  I am now downloading media to my ipad and using the airplay feature, which I really love.  I can be listening to music on my iphone in the kitchen and mid-song change the playback to the living room tv when I switch rooms.  Defintely worth $99.", "verified": true, "helpfulness": "0/0", "author": "Christina L. \"Christina\""}, {"rating": 5.0, "review": "Only complaint - wist it came with an HDMI cable so I didn't have to make a separate purchase. Other than that, the wifi is very good. I like the user interface.", "verified": true, "helpfulness": "0/0", "author": "BukoBoy"}, {"rating": 5.0, "review": "I use this Apple TV almost daily and I'm not sure how I lived without it. I own a lot of digital content and have ripped my movie collection so I can take it on the go. Streaming this content to my TV is very easy with this device. The content is maintained through iTunes and it's a simple matter of turning on Home Sharing on your computer, and signing in on the Apple TV. Obviously a wired connection is preferable but I've found a wireless connection works fairly well also. I've only had a buffering issue a few times but blame that on my old wireless router.The UI is similar to that of an iPhone or iPad; there are multiple apps available for the user to choose from (most of them existing services you need to sign up for) and it's as easy as signing in to use the apps. We use this for Netflix, Hulu, and MLB TV, all of which work great on the device.The device is small (the remote even smaller) so you won't have to take up a lot of valuable space on your entertainment center to enjoy it. I own two of these now and have loved having them. If you use iTunes a lot to manage your content, give this a try.", "verified": true, "helpfulness": "0/0", "author": "Dan Thompson"}]