[{"rating": 2.0, "review": "Works just ok. Sometimes it stops momentarily. I'm an Apple soul, but would prefer the Amazon model if I had to do it over as it is more powerful and gets both Netflix and Amazon.  What I find particularly annoying is that it does not recognize the Apple Super Drive, so I cannot watch a DVD using this with my Macbook Pro. Also no Amazon Prime.", "verified": true, "helpfulness": "2/2", "author": "Murray Eisner"}, {"rating": 4.0, "review": "The Apple TV is about is easy to use as anything can be. After a relatively easy set up, the only thing you need to do to use it is to open your MacBook or iPhone and click on Apple TV. At that point everything on your handheld device or your computer is sent to your TV. You can also use it to get things from the Internet without a computer. But it's much more difficult to type on the little screen than it is to type on a regular computer.If you already have an Apple product and your comfortable using it. You will not have any problem using this add on. You can get the same effect by using a HDMI cable. The cable is cheaper but it's a lot more trouble. If the $99 is not a problem I would definitely suggest you get one of these and hook it up to your television set, you'll find that you use it a lot to show folks your slides, listen to music through your good speakers and watch streaming television shows.", "verified": true, "helpfulness": "0/1", "author": "Stuart Phillips"}, {"rating": 5.0, "review": "There are still apps I wish apple TV would add, but this little thing integrates well with our non-apple products.  I recommend to all considering.", "verified": true, "helpfulness": "0/0", "author": "Brent Helling \"Brent\""}, {"rating": 5.0, "review": "Apple is a benchmark for quality and it is not lacking in this product.  The format and design are of the best.  The only drawback is the lack of programs such as Amazon prime and a few other that can be found on Roku.  The Airplay for images from your phone and i-pad work effortlessly.  I only had a problem finding Airplay at first.  I thought it would be an App but it's on the slide up menu from the bottom of the desk top.  Too simple.", "verified": true, "helpfulness": "0/0", "author": "John B \"Mr. John\""}, {"rating": 5.0, "review": "If you have an iMac, MacBook Pro, iPhone or an iPad this is such a great addition to your home media system.  Never mind the huge number of other features this device has, the AirPlay feature makes sharing photos, videos (and anything on your iPhone or iPad screen) easy.  No need for a bunch of people to huddle around your phone to watch videos or look at pictures.  Just use AirPlay and show them on your TV.  It takes two swipes on your phone to connect.  That's it.", "verified": true, "helpfulness": "0/0", "author": "Colin Weaver"}, {"rating": 5.0, "review": "What else is there to say?  These things practically sell themselves.  I now have three in the house and I'm very pleased with every feature.  The quality of the device is outstanding, which one would expect from Apple.", "verified": true, "helpfulness": "0/0", "author": "Brian F Smith"}, {"rating": 5.0, "review": "I love my new Apple TV. Although I don't have Hulu Plus and Netflix I am able to login under relatives logins and it works great. I was hoping they'd have more apps, like Showtime and Cinemax. Hopefully in time they will add these. Even though Amazon is a competitor in this market it be nice to have an Amazon prime app also. My kids really love this AppleTV and I'm hoping when they come out with the next one, it will be voice activated like the new Amazon box. That way I can put this one and one of the rooms and by the new one for myself, yea! I'm not much of a square but one of my favorite shows is on PBS and since I live in the Miami Fort Lauderdale area for some reason they don't show this old house or ask this old house. Since I bought this AppleTV, I can watch ask this old house forever it seems. This alone makes it worth the hundred bucks. What can I say it's the simple things in life that make me happy.", "verified": true, "helpfulness": "0/1", "author": "johnml"}, {"rating": 2.0, "review": "Sounds like it works well, but what good is it to me if I can't get what I want. I have most of my movies digitized on Vudu so if Vudu is not available on apple tv why would I want it. Also I don't see being able to access Disney Movie Anywhere, so again why would I want it.", "verified": false, "helpfulness": "0/2", "author": "V. Eagan \"Vic Eagan\""}, {"rating": 5.0, "review": "I had a hard time with the idea of purchasing this, because my LG 50PZ950 TV has interfaces for many of the online streaming services.  I couldn't bring myself to spend $99 for an item that might not be any better than what I already have.Fortunately I received one as a birthday present, and I love it!  I use my personal Apple TV primarily for Netflix, and to play music.  I purchased a second Apple TV for my bedroom for the same reason.  Being a part of the Apple ecosystem, I find that the device works really well.  I found that iTunes runs far better on the Mac than its Windows counterpart.  When Vista came out, I made the switch to Mac, and haven't regretted it.PROS:I find the interface far more intuitive than the one on the TV, and easier to use.  Using my iPhone and iPad as a remote control adds further ease of use, as I can use the touch screen to type, rather than the Apple Remote.I like the ability to stream music from my computer to my TVs.  Being a Mac user, this is an easy link to set up.  I turn on my TV many mornings just to listen.Airplay Mirroring is a great feature.  On occasion I use my TV as an additional monitor for my laptop.  This is an important feature at my office.  We hooked one up in our conference room to enable an easy hook up to our TV display.  It makes connecting extremely painless, and wireless.CONS:The biggest downside that I have is that they don't have an Amazon interface.The iTunes movie store / rental system is a bit pricy.  If I wish to rent a movie, I will usually switch over to my SmartTV to save a few bucks.", "verified": true, "helpfulness": "1/1", "author": "James"}, {"rating": 5.0, "review": "Since Apple goods never update until 6 months at a time, I suppose their company can invest in long term goods that work well, like this AirTV device.  I hate those cords such as for the S4 or iPod Touch; they either mess up my phone or are too frustratingly short.  The AirTV is a logical, contemporary upscale alternative.", "verified": true, "helpfulness": "0/0", "author": "Komerican \"Danificent\""}]