[{"rating": 3.0, "review": "Can never get a good picture... everything is always jumpy :-(", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "I am highly satisfied with this product. All the entertainment I need is in this one box. I'm glad I purchased this and I do not regret it one bit.", "verified": true, "helpfulness": "0/0", "author": "Bryan Perdomo"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Donny Marchena Vargas"}, {"rating": 1.0, "review": "Just save your money and get a Roku. This is basically a glorified re-streaming box. In order to get any real usability you have to have another Apple device that supports air play. Almost all the apps that come on it need to be \"hidden\" as you cannot uninstall them to free up memory. You cannot download and install new apps. Some of the apps don't work at all. The first app in the list is Netflix and we have been unable to set it up becaue it keeps saying that Netflix is unavailable. In order to use something like Amazon Video you have to stream it from another Apple device so that makes it useless. Spend the few extra $$ or wait for a deal on the new Roku and get that instead!!!", "verified": true, "helpfulness": "2/2", "author": "James"}, {"rating": 5.0, "review": "WONDERFUL! Apple does it again.", "verified": true, "helpfulness": "0/0", "author": "A. Ade"}, {"rating": 3.0, "review": "The product works great. However, I was a little disappointed when I opened it. I assumed it was a new product and nowhere did it say it was a used product. The reason why I say this is because there was someone's pictures and someone's login information on the Apple TV account info 😠", "verified": true, "helpfulness": "0/0", "author": "Anayeltzi Uranga"}, {"rating": 5.0, "review": "Great deal.  Love the ability to airplay without a router.", "verified": true, "helpfulness": "0/0", "author": "kito"}, {"rating": 5.0, "review": "Geart little tool.", "verified": true, "helpfulness": "0/0", "author": "Bones"}, {"rating": 5.0, "review": "Great product-came brand new unopened box", "verified": true, "helpfulness": "0/0", "author": "Rowen Kamfiroozie"}, {"rating": 5.0, "review": "Performs as advertised", "verified": true, "helpfulness": "0/0", "author": "Randy Bovee"}]