[{"rating": 5.0, "review": "It's the best 100$ I've ever spent if ur pretty much an all apple user this is the best purchase ull ever make", "verified": false, "helpfulness": "0/0", "author": "Kmon"}, {"rating": 5.0, "review": "Apple TV provides instant access to my entire iTunes library of movies, TV shows, and music with a fantastically simple remote.  It's hard to imagine a better, more intuitive way to get at audio and video files.  My TV/Blu-Ray combo is by LG and includes smart TV, but Apple TV is easier to use and much faster streaming or downloading content.  Actually, I suppose there is one thing I could ask for - closed captioning of the same quality as a good disk.  But to the best of my knowledge, nobody does that, so we wait.", "verified": true, "helpfulness": "0/0", "author": "RickW"}, {"rating": 3.0, "review": "I bought the Apple TV chiefly so I could watch movies off my ipad. The setup was very easy. The picture quality and sound are very good. However, I was just a little annoyed to find out Apple blocks Amazon movies from being played on the Apple TV. Big brother at it again. If Apple is so good, why bother blocking the competition? I still can watch other video on it though. Without the ability to watch Amazon videos, I wouldn't recommend it though. Mirroring from your ipad is nice to have, but as other reviewers have pointed out, there are better solutions out there than Apple TV.", "verified": true, "helpfulness": "2/2", "author": "GaryS"}, {"rating": 5.0, "review": "This is a must have accessory for anybody that has a iTunes on their computer. The simple ability to stream to my new TV was reason alone to get this product and the ease of setup and use makes this the best.", "verified": true, "helpfulness": "0/1", "author": "Valentin"}, {"rating": 5.0, "review": "It's like a high-end Roku box...Apple knows how to do content well.  We use it everyday with iPad, iPhone and TV connections. Nice wireless viewing from laptop too.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought an Apple TV to replace my Roku device on my family's main TV. I've had a Roku HD for the past year and a half which I've since moved to another TV. The Apple TV has Netflix and Hulu Plus on it which is what my family uses 99% of the time. Roku has more channels, but I rarely watched them. I do like having Spotify on the Roku, but with AirPlay I can easily run Spotify on my iPad and mirror it to my TV/sound system. I think this device is excellent for what it does. My only complaint with the Roku was that it was flaky and I had to reset it frequently. Whether that was the device itself or the software running the channel I don't know. Hopefully it's better with the newer Roku devices. I will still use my Roku on another TV. I also have most of my media in iTunes. If you have a Mac and/or several iOS devices then an Apple TV is worth consideration over Roku. I couldn't be happier with it. My kids enjoy AirPlay because one can play on the iPad while the others watch it on the TV. That solved the problem with my oldest son getting irritated by his younger brothers crowding around him to watch him play on the iPad.In summary, I think both Apple TV and Roku are capable devices. Having other Apple devices in the home was the deciding factor in purchasing an Apple TV for my family. If you don't have other Apple devices then Roku is likely a better choice.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer \"Glenn W\""}, {"rating": 5.0, "review": "You can watch anything from you tube to Netflix on your regular tv. All purchases from iTunes can also be viewed with this devise.", "verified": true, "helpfulness": "1/1", "author": "J. Millar"}, {"rating": 5.0, "review": "what can i say......we use this everyday. i love playing games on the iphone or the ipad, then throwing the signal on the TV via apple tv. great product.......we have everything apple in the house now.", "verified": true, "helpfulness": "0/0", "author": "Johnny Appleseed"}, {"rating": 5.0, "review": "Needed one for my office and since I have already 2, one for my big tv and another one for my wife's tv in her sewing room, I got another one. It works great.", "verified": true, "helpfulness": "0/0", "author": "David C. Ryals \"ccwpbear\""}, {"rating": 5.0, "review": "This product was shipped quickly and works just as described.  Plugged it in and within a minute was connected to the internet and away.", "verified": true, "helpfulness": "0/0", "author": "BillTheDad"}]