[{"rating": 5.0, "review": "Works great.  I love it.  Was easy to connect and use.  My grandkids love airplay from my iPad.  Waiting for snow lion to be able to steam from my iMac.", "verified": true, "helpfulness": "1/1", "author": "Daniel K. C. Au"}, {"rating": 1.0, "review": "If you want to be able to watch movies and TV programs off the internet on your TV set you have two options.The first is that you can buy an Apple device and get iTunes content. That'll work if you live in a country that Apple acknowledges.  Except that you won't be able to do very much with the content, like play it on some other media player software (one that allows you to copy your DVDs as well, for example) or copy it to another device to watch outside your home, or migrate it to a new device if you need to.  It'll also cost you a surprising amount of money, but in the event the download is corrupted or deletes itself there is no support. And it will take a while for new content to become available, and your friends in one country might be able to watch something that you in your country can't.The second is that you get it off a pirate web site in which case it doesn't matter where you are or what hardware or software you are using, won't cost you anything, will let you decide how and where to watch it, will be available more quickly and will look just the same on the screen. And you won't have to provide your complete biographical profile or create an account.My point is that Apple (and other content providers- don't even get me started about Sony) make it so hard to get content legitimately without offering a single advantage. They all go on about how piracy is stealing, well that is their entire business plan! In order to avoid \"stealing\" we should choose to watch overpriced content with strictly limited functionality- or not watch it at all because we're in the wrong country. In other words we have a moral obligation to jump through hoops and provide them with big profits.That doesn't sound right to me, huge corporations taking the moral high ground. I could have gone along with paying the money if the functionality and availability was the same as it is for illegal downloads. In fact for a long time I only downloaded illegal copies after I'd bought the legitimate Apple TV content. I thought that was a morally acceptable alternative. But now I live outside of the US and the content just isn't available so I can't do that anymore.  I can walk into any store in the US and buy a book, CD or DVD and take it to another country, but I can't download that same movie from that country. Since Apple (and the other content providers) have made it impossible for me to buy from them, how can I be costing them anything if I download it illegally?So now here's what I do: I download the content illegally and watch it however and wherever I choose, then I either send the author/ director money by paypal or through their website, or I make a donation to a charity on their behalf and mail them the receipt and a note explaining it and pointing out how absurd and outdated business models are stifling their industry. I pay them half what Apple charges, which is more than they would get otherwise, and Apple gets nothing.", "verified": false, "helpfulness": "4/28", "author": "J. Piev"}, {"rating": 5.0, "review": "With the feature to stream from your home computer's iTunes, this is a good deal.", "verified": false, "helpfulness": "10/11", "author": "J Powell"}, {"rating": 3.0, "review": "even with wired internet buffers a lot while playing netflix. Never happened with my xbox which is right next to it and is connected wirelessly to the internet. Airplay video playback on tv has very poor resolution. I don't know what I was expecting but performance was not upto my expectations.", "verified": false, "helpfulness": "3/4", "author": "jeffers.sandra"}, {"rating": 4.0, "review": "I use You Tube and NetFlix mostly. Like most other reviewers, Apple needs more subscription movie/TV services offered beyond NetFlix.", "verified": true, "helpfulness": "0/0", "author": "Randy Hall"}, {"rating": 4.0, "review": "I bought the apple tv for my living room and bedroom so we could cut the cable cord but still have entertainment at our fingertips.I quickly fell in love with the smooth interface but realized it was not going to be a cheap alternative to cable.I think the apple tv is a waste of money. I bought a Mac mini and use that in the living room as it can play Hulu desktop and Netflix in addition to my iTunes library and of course since its a full blown computer it can play movies and shows of almost any format. It can also stream pandora and I can show my photos on the big screen.I bought a roku player for my bedroom that sits next to my apple tv so I can play Hulu, netflix, pandora, and amazon instant streaming,and honestly I hardly ever touch the apple tv.The apple tv can be used to stream downloaded content from your iTunes library to your tv but it's a pain to get the content in apple tv format. With seasons of new shows ranging from 15-35 dollars on iTunes I would much rather pay 7.99 a month for unlimited access to Hulu plus. If I desperately need a show or movie I don't jump I buy via iTunes. It can often be found cheaper from a different source like Netflix or amazon streaming.If I could do it all over again I would only buy a Mac mini for the living room and a roku for the bedroom and call it good.***update**** Apple TV now has Hulu plus! It has now eliminated my need for my rocku player which is now set up in the guest bedroom! With the addition of Hulu plus, and it already being able to get Netflix this little box is just what I need! My only problem now is if I download a movie from my computer it has to be in correct format to play from Apple TV which can be time consuming at times to convert! Change my rating to four star!!!!!!  On a final note Apple TV has cool extras a good example beamy live streaming of the presidential debates by WSJ very cool and convenient.", "verified": false, "helpfulness": "7/8", "author": "L. Breda \"L.\""}, {"rating": 3.0, "review": "Great look easy set up, but not what I thought it was. I thought it was a portal to hook my I pad to the tv and it is more like a Netflix device.  But on the other side if that is what you want it is great.", "verified": true, "helpfulness": "1/4", "author": "nickd"}, {"rating": 2.0, "review": "The device is simply a portal through which to purchase recorded content. It is not a substitute for cable or satellite, unfortunately, as there appears to be no live content except maybe pay-per-view sporting events. You can jailbreak the device and get live web streaming (in fact, there is no built in browser) but that brings headaches of its own.They should be giving these away, not selling them.", "verified": true, "helpfulness": "2/6", "author": "Philip E. Bowles"}, {"rating": 5.0, "review": "The newest Apple TV for $99 ... great deal!  Service and delivery were outstanding and wicked fast.  Hook-up and programming were a piece of cake--after I bought the HDMI cable that doesn't come with the Apple TV.  Not a problem ... Amazon had the best deal going on the Mediabridge HDMI cable, too ($10).  I'm not a TV or movie addict, but I can see how Apple TV can turn you into one ... it just keeps getting better!", "verified": true, "helpfulness": "1/1", "author": "AFJAG"}, {"rating": 5.0, "review": "I am becoming more of an Apple fanboy as time passes.  It all started with an 30 gig iPod video, then later an iPod Touch, then iPhone, then MacBook Air, and now I've added the AppleTV to the list.I really do like this little box.  It streams video better than my media center extenders and has other neat features like being able to play content off other computers on my network.  You can also send content to the Apple TV from iDevices, such as an iPhone or iPad.  This is neat because you can display recorded videos on your TV.I'm going to probably end up putting one of these on each TV in my house other than the main TV where my Windows Media Center resides.I am waiting for the ability to stream live TV from my windows media center pc, but that will come later once a certain group of developers release the tool that enables you to install such a feature.For now I'm happy streaming recorded TV and movies to the Apple TVs.  Apple does make great products, even if the may fall slightly short of all my desired features (live tv control & streaming).", "verified": false, "helpfulness": "0/0", "author": "Ryan"}]