[{"rating": 4.0, "review": "I will be happy when they expand the content available.  I especially find the mirroring useful.  I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "So far so good and am able to stream from my 4 year old macbook with a couple extra steps", "verified": false, "helpfulness": "0/0", "author": "Carolinkus"}, {"rating": 5.0, "review": "My son just absolutely loved his Apple TV.  He also got an iPAD and is able to connect both to his TV.", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "Purchased as a Christmas gift for my daughter.  Works great, we were able to use it over the holidays before she returned back to school.  Great price and quick delivery.", "verified": true, "helpfulness": "0/0", "author": "Sylvia"}, {"rating": 5.0, "review": "Cancel your cable and buy this!!!! We use this product every day...we love it. We can watch all our favorite programs and even some LIVE TV", "verified": true, "helpfulness": "0/0", "author": "edna rose cody"}, {"rating": 5.0, "review": "It is nice not to have to connect my laptop to the HDTV to play Hulu Plus, plus i can stream movies, music and pice from my mac without moving it!", "verified": true, "helpfulness": "0/0", "author": "lyn morsillo"}, {"rating": 5.0, "review": "For a better reviewCheck out this video on YouTube:http://youtu.be/kkJFPV2X6BsFor a better reviewCheck out this video on YouTube:http://youtu.be/kkJFPV2X6Bs", "verified": false, "helpfulness": "0/0", "author": "Marlon turcios"}, {"rating": 5.0, "review": "For those without a smart TV you must get Apple TV..  It was so easy to install and you can watch so many TV programs, movies etc via Netflix or Hulu, etc.  I am not tech savvy at all but had no problems hooking it up or using it.", "verified": true, "helpfulness": "0/0", "author": "Amy Mercuri \"BeautyBusinessGal\""}, {"rating": 5.0, "review": "We actually purchased the Apple TV after we had purchased the Google Chromecast before it. We absolutely hated the Chromecast and decided to spend the extra money on the Apple TV. Man do I wish we would've just purchased this the first time. It works perfect and it's very much seamless when it comes to connecting to our other devices. This is the best streaming device we've ever owned.", "verified": true, "helpfulness": "0/0", "author": "Corey Jones"}, {"rating": 3.0, "review": "I've had my Apple TV for about two years now and a month ago I bought a BluRay player with wifi. I spent $99 on my Apple TV and $55 on my Sony BluRay player, and if I had to give one up, I'd give up my Apple TV. The BluRay player lets you access everything the Apple TV does and much, much more including your Amazon purchases. The only thing the BluRay player doesn't have is iTunes, but that's something I can live with. In addition, you can also play BluRay discs and regular DVDs as well. The only pluses the Apple TV has are that it has a smaller footprint and the interface is more attractive, but I have plenty of room and as long as it does what it's supposed to do, I don't care what the menu looks like. Like Apple TV, you can also control the BluRay player using the TVSideView app on your iPhone. I love Apple products, but save your money and get more bang for your buck with a BluRay player with wifi instead of this.", "verified": false, "helpfulness": "0/2", "author": "DeeL42"}]