[{"rating": 4.0, "review": "Works 90% or the time. Maybe it's my wifi that makes it stop from time to time.", "verified": true, "helpfulness": "0/0", "author": "E. Dimitriadis"}, {"rating": 2.0, "review": "dont buy the 3rd generation unless you don't want to run plex on xbmc on it. all it is an advertisement box!!", "verified": true, "helpfulness": "0/1", "author": "blake"}, {"rating": 5.0, "review": "I have been enjoying for a while all the features of this product.  Its performance is really great and provide you with versatility watching videos, music and others from different sections of the house.", "verified": true, "helpfulness": "0/1", "author": "Carlos A. Montalvan Sr."}, {"rating": 5.0, "review": "Ordered for my son who asked for it for Christmas. He's very happy with it. And recomends this.", "verified": true, "helpfulness": "0/0", "author": "JimW \"James Walton\""}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Chubb"}, {"rating": 5.0, "review": "Yea, we love this thing. Let me tell you off the bat, if you own a \"Smart\" TV and think you don't need this, you're wrong. You know who has all of the resources in the world to create an amazing OS experience? Apple. You know who doesn't? All of the TV manufacturers.We thought our Samsung Smart TV had it all, and we used Netflix, HBO Go, etc. on a regular basis on it... but man, was it painful sometimes. I didn't realize how painful until Ceci's sister gifted us this Apple TV. \"What the hell, I'll try it just to be nice\", I thought. It stayed plugged in, and very quickly took the throne of how we watch TV in general.For reference, I own a Chromecast. I have not used it once since the first day I played with it. Apple TV is, in my opinion, better.That being said, it does have some flaws. For one, the size. I mean, it's portable, but not as portable as a USB stick which we all know at this point it could be. I'd quickly buy another one if it came in USB stick version. Not that this thing looks bad by any means, but if I didn't have to take up the extra space, I wouldn't.The other thing is, it does run into some use flaws every now and then. It can disconnect from WiFi, has frozen on us once or twice..  stuff like that. But honestly, these issues are so infrequent I couldn't imagine downgrading the rating for it.Overall, this little black box has completely changed our TV watching experience and really in turn our lives. I'm not sure if for the better (we used to not even own a TV, maybe life was richer that way), but it's certainly improved from the old days of our not-so-smart TV, and still trumps the Chromecast (until Chromecast gets VLC support, that is!).-Jesse", "verified": false, "helpfulness": "1/1", "author": "Jesse & Ceci"}, {"rating": 5.0, "review": "I have one of these in every room in my home!! Love it", "verified": true, "helpfulness": "0/0", "author": "Stephanie P"}, {"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "8372"}, {"rating": 5.0, "review": "If you've got apple products, this will tie them all together. I love my apple tv!", "verified": true, "helpfulness": "0/0", "author": "David J. Marcati"}, {"rating": 3.0, "review": "I like it. Tired of being locked in the apple world though. It is really easy to use though and works 100% of the time. Confident you can hand this to someone new to it and they will get it working very quickly", "verified": false, "helpfulness": "0/0", "author": "Daniel Roscoe-Hudson"}]