[{"rating": 4.0, "review": "I bought it mainly to mirror an iPad and an MacBook Air on TV.Sadly, my MacBook Air (2011) wasn't compatible with it, and the mirrored image of the iPad wasn't very good at all.However, I also assigned my NetFlix account with it, and it works perfectly! The menus don't look that good (which is Apple's fault) but everything I watch looks amazing, almost as good as a blu-ray movie!All in all, I'm quite satisfied with this product, even though the mirroring utilities being as limited as they are.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The device is good but needs some certain features like:A visualizer for musicRepeat option for musicAnd an included hdmi cordDifferent sleep screen optionsI like this device but apple really missed a chance to completely outdo the roku by adding the above features (which should have been obvious to include).", "verified": false, "helpfulness": "0/0", "author": "Stephen K."}, {"rating": 3.0, "review": "Sometimes it runs the sound through our TV and auxiliary system, and sometimes it fails when streaming a movie from our Mac. We find we have to reset more than we like. When running a DVD through our Mac to the TV, there is not a lag in picture with sound or any streaming issues. When streaming from the Internet, it can have lags -- for example, the video is running fine on the computer screen, but it is frozen on the TV while the streaming is trying to catch up. This is bothersome and disappointing. We have high grade HDMI connectors and super fast Internet speed, so neither of these are an issue - it's the Apple TV. However, it is very nice for putting pictures up on the TV screen for people to see, etc.", "verified": true, "helpfulness": "1/1", "author": "Jan"}, {"rating": 4.0, "review": "I purchased this as a Christmas gift for my grandson.  He tried it out when he was here and it worked as expected.", "verified": true, "helpfulness": "0/0", "author": "Arbuta McKee"}, {"rating": 5.0, "review": "I saw a friend's Apple TV and didn't realize until then all the things it could do, especially mirroring my iPad. It's GREAT!", "verified": true, "helpfulness": "1/1", "author": "gaylemichel \"oochie\""}, {"rating": 5.0, "review": "We already have an Apple TV device and many others but too stubborn to my an additional device.  Frankly it makes no sense to have to purchase another separate box for all of the TV's in your home.  We found it frustrating to be in one room and not be able watch programs because the device wasn't in that room.  It also took", "verified": false, "helpfulness": "0/0", "author": "Jones-Jones \"Fun, fun.\""}, {"rating": 4.0, "review": "I just gave this device four star because it doesn’t have Amazon prime streaming APP and I am an amazon prime member! Otherwise it is a nice little device and the remote is very practical and easy. I am also happy that I can mirror my I phone 5 on my big screen tv through this device.", "verified": true, "helpfulness": "0/0", "author": "Werede"}, {"rating": 5.0, "review": "Best investment ever!!! This is a great gift idea for anybody...works well showing pictures from your phone and playing music a definite buy!!!", "verified": true, "helpfulness": "0/0", "author": "Marcy"}, {"rating": 5.0, "review": "Its really a good but has so many features and apps its fun and my daughter is addicted to it def a great buy for the price", "verified": true, "helpfulness": "0/0", "author": "Patricia Nixon"}, {"rating": 5.0, "review": "Only sad part is even national channels like ABC want a cable network to play those channels… at least PBS is available...", "verified": true, "helpfulness": "0/0", "author": "Sbhasin"}]