[{"rating": 5.0, "review": "Does exactly what it's supposed to do intuitively and without fuss; cool hockey puck design and minimalist remote are extremely stylish.", "verified": true, "helpfulness": "0/0", "author": "Pete Petersen"}, {"rating": 5.0, "review": "I have used for months and love. Watch Netflix and ESPN3-sporting events over WiFi. Move from room to room if needed. Would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Michael's review"}, {"rating": 5.0, "review": "I bought 4 more for my girl and her children and we are all thrilled especially with the way it links to Ipads and Iphones making long distance Face Timing more special on the TV screen. Just wish it had more apps!", "verified": true, "helpfulness": "0/0", "author": "Big RWD"}, {"rating": 5.0, "review": "It's an Apple, what else can I say.  You don't need an IPhone, IPad, or Mac Book to use this device.  You do have to have high speed internet and an HDMI high def television or monitor though ...  Egad!  This is 2014 ... who doesn't have one of those yet?", "verified": true, "helpfulness": "0/0", "author": "Gbaby"}, {"rating": 3.0, "review": "It's ok. The Netflix interface is nice however the majority of the aps cost money. If you have an iPad you can stream shows through air play, if not this unit is pointless", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Great product and fast shipping. This connected flawlessly to my iTunes and Airplay is an amazing feature. The unit and remote feel very well built; I was also amazed at how small the unit and remote are.", "verified": true, "helpfulness": "0/0", "author": "jeff"}, {"rating": 5.0, "review": "The Apple TV is everything it was adv.ertised to be. Easy setup, and connection. Works great with Amazon video. Recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Wallace R. Symons, Jr."}, {"rating": 5.0, "review": "my son wanted this for christmas, he said it was well worth the money, he stated  would recommend it to everyone", "verified": true, "helpfulness": "0/0", "author": "Carolyn W Vanderwerf"}, {"rating": 5.0, "review": "I recommend this product absolutely! If you are an Apple user, you need to get this, belive me. I use it to reproduce my music and videos from my iMac to my living room's TV and Home Theater system. Features like Youtube and Netflix are simply cool.", "verified": true, "helpfulness": "1/1", "author": "Pol Mejía B."}, {"rating": 5.0, "review": "This little device can do quite a bit.  Stream netflix/Hulu/other services, mirror apple devices, wireless second screen for OSX, and much more. Watch my review for more.[...]", "verified": false, "helpfulness": "1/1", "author": "Anthony G."}]