[{"rating": 5.0, "review": "The apple TV is the most amazing product I've ever purchased. Its easy to hook up and it links right to your computer. You have easy access to netflix and hulu, and you can listen to your itunes off the TV which is great for parties. You can also upload your photo stream from iphoto if you have a mac. It has so many other features as well.", "verified": true, "helpfulness": "0/0", "author": "SV2331"}, {"rating": 5.0, "review": "The Apple TV is great! It is so neat to show anything on your iPhone, iPad, or I touch on your tv. I have a 60 inch tv so it is cool to view pics and videos on my phone on it. This is the best price to buy it too!", "verified": true, "helpfulness": "0/0", "author": "Bennie Durham"}, {"rating": 5.0, "review": "easy set up and works great with my new apple macbook..  pic quality is great and streaming, pics and remote desk top from my laptop is really cool..", "verified": true, "helpfulness": "0/0", "author": "capengin11"}, {"rating": 5.0, "review": "There a probably thousands of reviews about AppleTV out there, so I am not sure if I can provide much more information.  I had the first model, as well.  I like this one so much better due to the inclusion of NetFlix and other streaming services.  The much smaller size is nice, too.  I actually keep ours behind (under) our television so you barely even see it, other than the small LED light.  Apple products are just so user friendly.", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 4.0, "review": "I recently purchased the latest generation of Apple TV (gen 3). My decision was based on the review of both products that CNET.COM did back on August 16, 2012. Check out this video review. The setup and interface between the Apple TV and my router/modem was simplistic Like most Apple products, the quality of the hardware and the ease of use helped make my choice.The only reason I did not rate the Apple TV 5 stars is that the product is lacking applications. Both the Apple TV and Roku both have Netflix, However, the Apple TV does not have Amazon Prime Video which Roku does. I hope Apple will add this application to their menu in the near future.If you are looking for a streaming video box that is easy to use, quick in its response time, and small in its hardware design, then I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Sonar77"}, {"rating": 5.0, "review": "Items was received in quick order. It took a bit more to hook-up and connect than I thought. The directions that come with it are not the best to follow. Once it was hooked up and running I was super happy. The wife loves doing her thing with \"her\" music and the family photos rolling across the screen.", "verified": true, "helpfulness": "0/0", "author": "Ron White"}, {"rating": 5.0, "review": "Great equipment. Good pricing (better than in stores). Product shipped well and arrived on time.  We are already enjoying it.", "verified": false, "helpfulness": "0/0", "author": "JoeB"}, {"rating": 5.0, "review": "Amazing product!  It keeps me at home and saves me money!!  Works extremely well and is very reliable, as to be expected from Apple.", "verified": true, "helpfulness": "0/0", "author": "ANTHONY C. D'ANGELO"}, {"rating": 5.0, "review": "i bought this for my daughter and boyfriend.  They absolutely love it.  It allows them to watch so many of their favorite shows, movies, you-tubes and the list goes on, on their TV.  And it's only $100, one shot deal.", "verified": true, "helpfulness": "0/0", "author": "Faith Herzog"}, {"rating": 5.0, "review": "Easy setupLet's you connect to iTunes and pull content over to your TV and StereoMust have for multiple Apple device owners", "verified": true, "helpfulness": "0/0", "author": "Keith Williams"}]