[{"rating": 5.0, "review": "I bought this a few years ago and but never reviewed it. It is perfect for watching Netflix and now since I've had it for a few years they added about 50 more apps. This is a lot better than what I originally used for Netflix- hooked up my MacBook Pro to my TV and bought an apple wireless keyboard and magic mouse which costed $150. Apple TV for $99 is a drop in the bucket plus more subscriptions and easier to navigate from bed!", "verified": true, "helpfulness": "0/0", "author": "Mike Santo"}, {"rating": 5.0, "review": "Simply love it.", "verified": true, "helpfulness": "0/0", "author": "Shashank Raj Holavanalli"}, {"rating": 5.0, "review": "We love our Apple TV.  It is the best thing ever", "verified": true, "helpfulness": "0/0", "author": "Ben L."}, {"rating": 1.0, "review": "Have not had success connecting it to my smart tv", "verified": true, "helpfulness": "0/1", "author": "Monique B"}, {"rating": 4.0, "review": "I love this routerIt serves like a cable but not reallyI love twit cause I could watch most of my favorite channels and TV showsIt's really portable and cheap than most cable companiesBut the downside is there are some channels that I can't watch because it doesn't have itApart from that, it's really good both in quality and efficiencyI don't regret having it, and I would recommend it to people", "verified": false, "helpfulness": "0/0", "author": "Promise Ufomadu \"Jaycen\""}, {"rating": 5.0, "review": "great. thanks", "verified": true, "helpfulness": "0/0", "author": "Annette"}, {"rating": 1.0, "review": "This was the absolute worst product I have EVER received from Amazon, and I order frequently. The product was clearly used, as it was scratched as if a key or knife was taken to it. Also, it had no remote control, just an empty slot where it should have been. I attempted hooking the device up, before realizing the remote control situation, and it was on a green screen that I wasn't sure was normal. Since we ditched cable and promised our children we would buy them a streaming device for their TV, we decided to go to Wal-mart and purchase a new Apple TV from there... and guess what? It was perfect, included a remote, and did not give some funky error message...all for the same price!", "verified": true, "helpfulness": "0/2", "author": "DNIZZLE"}, {"rating": 4.0, "review": "Works fine.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey D. Moore"}, {"rating": 5.0, "review": "Love it. Have all apple products and bought this so I can stream from my phone and iPad. I feel like I don't even need that since it comes with so many channels. I have a roku as well that hasn't been turned on in days.", "verified": true, "helpfulness": "0/0", "author": "Lorrie Peck"}, {"rating": 5.0, "review": "don't know why this took so long for me to get one of these wonderful addition to our television viewing", "verified": true, "helpfulness": "0/0", "author": "G. Douglas Ponsler"}]