[{"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "Roger E Davis"}, {"rating": 5.0, "review": ";)", "verified": true, "helpfulness": "0/0", "author": "Diana C Perez"}, {"rating": 5.0, "review": "works very well!", "verified": true, "helpfulness": "0/0", "author": "Bernie Johnson"}, {"rating": 4.0, "review": "I've had an AppleTV for a few years now and while I like a lot of features, it still lacking in many ways.  Like Amazon's FireTV and stick, you're locked into their ecosystem.  If you have a large iTunes library it's great!  Have an iPhone, iPad, MacBook?  You can mirror whatever's on there on your TV.  Premium services like Netflix, Hulu+, and HBO Go/HBO Now are also available.  The drawback are similar t to Amazon's box: AppleTV doesn't allow you to watch your Amazon library or access your Prime subscription features, nor does it let you access any way to view your UltraViolet (UV) digital library (those digital copies that come with DVD and Blu-Ray purchases).  This is where the Roku brand wins out over Apple, it give you access to Amazon's library, your UV titles, and so much more (but lacks a way to access your Apple library).  I find that I use this slightly less than my Roku, but since I have a large Apple library, and as a cord-cutter, I cannot live without it.  AppleTV is showing its age: the remote, channel responsiveness, and features are becoming more and more burdensome.  There's no \"home\" button, so if you're watching HBO Now and want to switch to music, you need to press the menu button several times in order to just go back to the home screen (a feature both Roku and Amazon have on their remotes).  If Apple would just partner with UltraViolet, offer an Amazon Channel, and add a \"home\" button to the remote, this would be a close to perfect product.  As it is now, it's lacking.", "verified": false, "helpfulness": "1/1", "author": "Morgan Newton \"Super-Dad\""}, {"rating": 2.0, "review": "Proprietary configuration, hate that HBO used them as one of the main ways to get HBO Now.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great investment and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great, just as described", "verified": true, "helpfulness": "0/0", "author": "Cristina D."}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Fa"}, {"rating": 5.0, "review": "Typical Apple product: intuitive, easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "George W. Henry"}, {"rating": 5.0, "review": "Excellent stuff", "verified": true, "helpfulness": "0/0", "author": "roberto young"}]