[{"rating": 5.0, "review": "We have purchased 5 of these.  They are great.  We have reduced our cable bill by over a $100/month by cutting back on the 200 or so channels they demand you buy to get the 3 that you want.  We watch the 30,000 +/- movies and TV shows that are available with the Apple TV (and minus most of the commercials.)  Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "CW"}, {"rating": 5.0, "review": "Easy to setup.", "verified": true, "helpfulness": "0/0", "author": "hba"}, {"rating": 5.0, "review": "VERY GOOD", "verified": true, "helpfulness": "0/0", "author": "PAPA"}, {"rating": 5.0, "review": "I can't believe it took me so long to upgrade from the Apple TV 2nd generation to this one.  Unbelievable.  Perfect for our \"Apple family\".  Streams from our Macs and from the web with no issues.", "verified": true, "helpfulness": "0/0", "author": "browniestarmite"}, {"rating": 5.0, "review": "Perfect.", "verified": true, "helpfulness": "0/0", "author": "Samohi Viking \"Samo\""}, {"rating": 5.0, "review": "Its Apple - what more to be said.", "verified": true, "helpfulness": "1/1", "author": "Philip M. Dooley"}, {"rating": 5.0, "review": "Works great. Need HDMI port on your TV", "verified": true, "helpfulness": "0/0", "author": "Guerrino V. Lucas"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Hector Conesa"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Whenever Apple updates the software I seem to have difficulties.  Under iOS6 this unit interfaced with everything fine, but after that I've intermittant problems.  It's difficult to position it close to my wifi transmitter and is subject to drop outs.  I don't know why Apple in all their technological wonder can't simply provide a ad-hock connection between the iPad and unit and bypass the need to have it go through the house wifi transmitter.  Since they require you download all the content purchased at the iTunes store and don't allow streaming, you'd think it would be a no brainer.Bugs out the wazoo, if I hadn't invested in so much iTunes content I'd try a different system.", "verified": true, "helpfulness": "0/0", "author": "Thomas \"tomsde\""}]