[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Jerry Higginbotham"}, {"rating": 5.0, "review": "This is my second apple TV and the only one that has done it for me. I really love Mirroring. I love how everything looks and operates. The only problem that I have is that my TV is not big enough at 26inches.", "verified": true, "helpfulness": "1/1", "author": "VictoValdes"}, {"rating": 5.0, "review": "Mostly Iise it for Netflix and playing music. It is much nicer than the experience I have with doing this with our Blu Ray player.", "verified": false, "helpfulness": "0/0", "author": "G. James"}, {"rating": 1.0, "review": "Ok first let me say, I am a big fan of apple, I have the I-mac, I have the i-phone I am in it to win it.  But negotiating this thing feels like, like, when I use my husbands PC! nothing makes sense, movement wise, when interacting with netfix, my old roku is way better, and  I can't get my I-mac, OMG from WAY BACK in 2010 ...a whole year and a half old...to display on the screen.  When I purchase things from the I-tunes, even though I have gone through the long slow process of enabling home sharing, for some reason the apple still does not compute!  WTF apple?! how am I supposed to convert my husband to your product?! AND the netflix dosen't even stream in Hi def! BOO!...back to roku...or my husband's 2007 pc laptop connected to the samsung ( too bad apple didn't make a drive for my laptop)", "verified": false, "helpfulness": "4/12", "author": "Liz"}, {"rating": 5.0, "review": "Having Mac and iphone ...apple tv just add cheery on the top.  the best thing is it allow mirroring of almost everything  from ur iphone 5 or macbook pro", "verified": true, "helpfulness": "0/0", "author": "govi"}, {"rating": 5.0, "review": "Works great. It was easy to hook up to the wireless network and the mirroring  feature for iPhone and iPad is cool", "verified": true, "helpfulness": "0/0", "author": "L. Oliva"}, {"rating": 4.0, "review": "About me, I'm a tech guy with 30 years experience.  Over the past 2 years I have heavily invested in the Apple Eco System.  I have IPods, an iPad 2, a 2012 Mac Mini, and now Apple TV (newest version).  It's been well stated that there is not a lot available for content outside of the Apple Eco System as compared to Roku, for example.I've hardwired the ethernet connection to my router from the Apple TV, as suggested, to avoid overloading my wireless capability at home.I'm running the latest version of the OS on the Apple TV, Mirroring my Mountain Lion and Ipad screens is very handy.I've updated my review and added a 4th star because the 'wired ethernet causing content load failure' issue has been addressed.  The device needs to have more content available and have it available from the Itunes store.  That's the only drawback at this point that I see, and it costs 1 star...I have seen one 'bug' in the current version of the software.  Loading select Vimeo content caused an error message stating that the content wouldn't load because my TV didn't support the 'HDMC' protocol (an encryption protocol used by newer HDMI devices).  Recommended fix was replugging my Apple TV into the TV.  That didn't work.  Cold booting the Apple TV did fix the issue.As others have stated, this is a no brainer if you already have Apple products, especially newer ones.  If you don't have Apple products, then unfortunately at this time, I could not recommend this product to you, it simply wouldn't have the value per the cost to you... That's the bottom line.", "verified": true, "helpfulness": "10/11", "author": "HighRiver ForestRun"}, {"rating": 5.0, "review": "I love the product. The netflix and NBAtv and airplay are awesome. Glad i added it to the apple fam of mine. Its easy to use and works with everything.", "verified": true, "helpfulness": "0/0", "author": "Imani Smith"}, {"rating": 5.0, "review": "Everything works great. I love watching Netflix on it and listening to music from my computer. Works just as advertised", "verified": true, "helpfulness": "0/0", "author": "Chad A"}, {"rating": 5.0, "review": "Initially I got this for the family to use with all our Apple products.  Seeing how simple it made viewing videos, movies, photos...I gave it to my grandparents to use and they LOVE IT!  It was so simple compared to a WiFi Samsung DVD player they had, that I bought another Apple TV for their bedroom.They enjoy watching youtube music videos with the Airplay, my kids love Netflix when they are visiting, the rest of the family can relax and not have to mess with troublesome apps/connections/UI to port media to the TV for viewing.Happy Grandparents = Happy Grandkids & Great Grandkids!Since I bought 2, I give it 10 Stars.", "verified": true, "helpfulness": "1/1", "author": "Tram Truong \"cuegeee\""}]