[{"rating": 5.0, "review": "Love this product. Much better than blu ray. Easy to use. I love it for netflix and renting movies:) great product overall", "verified": true, "helpfulness": "0/0", "author": "Briella"}, {"rating": 4.0, "review": "Only used a handful of times so far, but the set up was user friendly and integrates well with iPad. Very pleased with the purchase and the price.", "verified": true, "helpfulness": "0/0", "author": "CLINT GROSSNICKLE"}, {"rating": 5.0, "review": "Great! I've had an Apple TV for a while, and I was due for an upgrade. The newest model doesn't offer a ton more, but it's still solid and has some worthwhile improvements. For me, the full 1080p is the most noticeable aspect. You can really see it, and it allows you to play more media types (e.g. if you have a library collection with lots of 1080p vids).I'm an Apple-enthusiast, so keep that in mind. =P", "verified": true, "helpfulness": "1/1", "author": "Joshua T. Ebert \"Ebes\""}, {"rating": 5.0, "review": "I'm happy with my Apple TV . One thing , I think I got to learn how to used . I rent a movie and it took a long time to download .by the time the movie has expired , only see half  Of the movie.", "verified": true, "helpfulness": "0/0", "author": "Amanda B."}, {"rating": 5.0, "review": "This device may have just been a small side project for Apple, but it is great if you use iTunes.  I have a combination of Mac and Windows machines running iTunes, and you can access all them and their libraries.  Also can access and purchase from the iTunes store and use iTunes in the cloud.", "verified": true, "helpfulness": "0/0", "author": "Oskar Contreras \"tg8arc\""}, {"rating": 5.0, "review": "Finally the perfect device for watching Netflix, Hulu Plus, and even streaming things like NFL Sunday Ticket over Airplay from my iPad or iPhone! It's plugged in via ethernet so it's super fast. No complaints at all!", "verified": true, "helpfulness": "1/1", "author": "unclespoon"}, {"rating": 5.0, "review": "I am sure this would be wonderful for so many more things but right now we are just using it to get Netflix movies. Love it! Easy set up and I am NOT techno friendly.", "verified": true, "helpfulness": "0/0", "author": "Lesli Haveman"}, {"rating": 5.0, "review": "Sleek easy to setup and use, first time user, like the way you can connect with other i stuff iPad phone, haven't figured out how to connect to PC yet", "verified": true, "helpfulness": "0/0", "author": "SAR Indiana"}, {"rating": 1.0, "review": "Airplay quit working after working flawlessly for last year.  I have followed directions on numerous websites using all advice found.  Restarted a million times.  All updates are current.  Of course apple blames problem on my router. (everyone always uses the \"it's your router\"  response.  It worked on this router for the last year.  I have tried 3 other wireless routers and have plugged in directly.  I believe it has to do with apples updates.  Seems like all there products get messed up after updates.  Be very careful buying this product, seems I am not the only one with this problem.  Very expensive just to quit working.  It is a neat product if you can get it to work, unfortunately like all apple products they only work for so long and updates will not allow you to do what they have always done.", "verified": true, "helpfulness": "4/10", "author": "Be careful"}, {"rating": 1.0, "review": "I bought this device to mirror my macbook pro on my Samsung hgtv. It doesn't work. After about 15 attempts to contact Apple about the situation, I'm giving up for the day. When I call them, their recording says to press \"1\" to speak to an advisor. Every time I did this, the phone just rang for several minutes and cut off. I expect more from Apple. I have an ipad and the latest Macbook Pro. These are expensive devices, and I expect better service for this kind of money. Right now, I'm extremely disappointed and I cannot recommend this device if you plan to mirror your macbook pro on your tv.", "verified": true, "helpfulness": "9/17", "author": "Cynthia160 \"CHB\""}]