[{"rating": 5.0, "review": "Great performance and UI, 1080p and Netflix 'superhd' playback is awesome, tons of content. Get an Apple TV and ditch satellite/cable!", "verified": false, "helpfulness": "1/1", "author": "David"}, {"rating": 5.0, "review": "While I wish Apple would add some more apps like Amazon Streaming, I am able to stream video's off my computer, iPad or iPhone and it is great....", "verified": true, "helpfulness": "1/1", "author": "Sean Lloyd"}, {"rating": 1.0, "review": "I got the device with no instructions and have tried for several hours to figure out how to make it do what it is reported to do, with NO success.", "verified": true, "helpfulness": "5/15", "author": "Dale E. Schaffer"}, {"rating": 5.0, "review": "Once again Apple makes a great product for streaming movies, music, photos and radio to your TV. I love my AppleTV. However, I wish Amazon would have an icon for streaming like Netflix, and iTunes since I have an AmazonPrime membership.", "verified": true, "helpfulness": "1/1", "author": "RUreading? \"RUreading?\""}, {"rating": 4.0, "review": "We think the Roku was a little easier to use but nothing compares to the selection and quality of our Apply TV! I'm so happy that hubby got this for our home.", "verified": false, "helpfulness": "1/1", "author": "Wendy Summers \"Ginger\""}, {"rating": 5.0, "review": "Okay....I'll admit it.  I'm an Apple Fan.  I have a MacBook, iPad, and iPhone.  BUT when deciding to get rid of our satellite TV to try a more affordable option, I was really unsure which to go with, the Apple TV or Roku.  I read countless reviews.  Both had pros and cons.  I ended up buying both.  The Apple TV for our main television, and the cheaper Roku LT for additional TV's in our home.After trying both....... I'm still an Apple Fan.  What Apple TV lacks in 'pre-set' channels, can easily be streamed from my MacBook, iPad & iPhone to the Apple TV through AirPlay.  (Except NFL!!  But I can't figure out how to watch from the Roku either)  My husband 'settled' for NFL rewind (at a nominal fee) but it can only be viewed on the iPad.  He's semi-satisfied.  Amazingly enough, the minute you attempt to airplay it, it shuts down the stream.  The NFL has their controls!!The Roku has more flexibility to add or remove channels (including 'private channels') or use Plex Play.  I really haven't found any incredible private channels I can't live without.  Plex Play is kind of a pain to set up.  I had to do a lot of browsing/reading to figure it all out.  If you're an Android fan, I believe there is now an App that works with many Roku Models for streaming from Android devices.  At this time, it's not available for the Apple devices.In my opinion, Apple Products are well made.  The cute little Apple remote is metal, not plastic.  It's easy to set up and easy to use (even for my anti-tech Husband)If you have Apple devices, simplify your life and stick with the Apple TV.", "verified": true, "helpfulness": "1/1", "author": "C Nagorski"}, {"rating": 3.0, "review": "I can't get super HD with Netflix or Vimeo... I have a Sony Blu-ray Player with Wifi and the quality is noticeably better. As much as I really really want to use the Apple, cause it's my new toy, I can't stand the inferior picture quality... The interface is nice... The remote is cool (I think it's drilled out of a solid piece of aluminum)  It's small and yatta yatta.... The mirroring is a bit slow.... maybe it's my router though? I do have 802n however...  I dunno.... I'd be so much happier if the friggin thing streamed HD. I'm so surprised Apple put out such a piece of crap.  I do have faith that they'll fix it some day...  People notice and aren't happy [...]", "verified": false, "helpfulness": "2/2", "author": "JJ"}, {"rating": 1.0, "review": "Went to stream a movie from iTunes store and got a message that my movie would be ready for viewing in 2 hours and 30 minutes. What? Obviously decided to do something else in the meantime; when I came back to the Apple TV the next night expecting my movie to have been buffered, I got the same message. What? Have no problem watching movies stream over the same network to other devices like a PS3 or Wii. Basically don't use it now as Netflix and Amazon Instant Video works fine on other devices.Terrible remote. After considerable effort got access to my iPhoto library but viewing was so clumsy never used it again.", "verified": true, "helpfulness": "2/7", "author": "Brian in Boston"}, {"rating": 3.0, "review": "The device itself is very nice, fast, and with the most recent firmware updates (HBOGO and iRADIO) is even better than it was originally. I'd give it a higher stars rating if it offered additional functionality:WISH LIST ITEMS1. A native APP to watch AMAZON PRIME videos.Currently (Dec 2013), it is possible to watch AMAZON PRIME videos by streaming them from an iPhone, iPad, iPod to the Apple TV via AirPlay, and while that's an improvement over the original feature-set, it is not as convenient as a native APP just like NETFLIX or HBOGO.2. Improved and expanded Apple's \"Remote\" APP functionalityThis app allows the user to control the Apple TV from an iPhone or iPad or iPod similarly as the remote control that comes included with it... In other words, you need to turn your TV on, and select the desired icon from those displayed on your TV screen. To some degree, that is OK if you want to watch a movie. What if you want to listen to iRADIO? It should be possible to select that icon right on the iOS device screen without having to turn on the TV. So, what I am proposing here, is for the Remote APP to show the same menu options on the iOS device screen as on the TV.3. Capability to turn on an A/V receiver automatically when streaming music via AirPlay to the AppleTV, and have the receiver select its input automatically to whichever HDMI port the AppleTV is connected to, and start playing the music \"with just one click\". This is what takes place if you start streaming music from an iPhone or other Apple device to receivers with built-in AirPlay capability such as Denon or Pioneer, and it would be particularly helpful with ONKYO's receivers which don't have built-in AirPlay capability at this time.", "verified": true, "helpfulness": "1/1", "author": "FLmiami"}, {"rating": 5.0, "review": "Very happy with this device. Keeps getting better with more apps, and upgrades in Apple services. I am getting one for every TV in our house. Great for Netflix and HULU, but Airplay is the real winner.", "verified": true, "helpfulness": "2/2", "author": "Stow Fresh \"Stow Fresh So Fresh Review\""}]