[{"rating": 5.0, "review": "My son-in-law recommended this so I had him install it but that seemed pretty simple if you have the hdmi cord to connect it to the television set.  The unit itself is small and inconspicuous, with a small remote which controls it.", "verified": true, "helpfulness": "0/0", "author": "V. Wright \"buzz buzz\""}, {"rating": 5.0, "review": "this is by far the best thing that i have bought months ago all you need is in this little device. although i have a bad internet connectionnetflix, hulu plus, youtube, radio are working perfectly. its totally recommended", "verified": true, "helpfulness": "0/0", "author": "kkamel"}, {"rating": 5.0, "review": "I bought the Apple TV so I could stream movies from my computer to the TV and it works great.  It does come with some apps but I really don't use them.  Too bad you cannot add apps to the Apple TV.I purchased my second Apple TV for use with a soon to be purchased big screen TV.Apple TV in combination with a Roku antennae works good.  Now I have to hunt down an inexpensive wifi connection.  That might eb the most difficult thing", "verified": true, "helpfulness": "0/0", "author": "Mista B"}, {"rating": 2.0, "review": "This thing was awesome out of the box.  Now, after several \"updates\" I want to throw it out of a moving car.  During playback audio will completely drop out.  To get it back you have to rewind and play again.  In the middle of a show a black screen with dialogue saying \"error can not play content\" will just suddenly appear.  You have to restart the show again.  I've had the error screen appear twice during one 20 minute show.  And of course if you try to reset the box to factory settings and original OS version, it won't let you unless you have a wireless connection because it automatically re-installs the latest updates.  Keep in mind all these playback issues occur using Netflix.Because everything I own is Mac I give this thing one star for Airplay and a second star for the iTunes radio/podcast playback.  I do love those two features.", "verified": false, "helpfulness": "0/0", "author": "B. Smith"}, {"rating": 5.0, "review": "Love this product. Got it mainly for Hulu Plus, Netflix and MLB. Have MLB and Netflix already on my LG blu-ray but the picture can't compare to this. Setup was simple and haven't really tried too much of the Air Play but it is quite easy too.", "verified": false, "helpfulness": "0/0", "author": "Buckeye Bob \"Buckeye in FL\""}, {"rating": 5.0, "review": "I considered going with a Roku or similar device, but chose Apple TV as there's no material price difference and for anyone with a number of Apple devices there are real advantages to this over the others.Setup was very simple, and I have no signal problem from my WiFi access point at the other end of the house. Straight out of the box both Youtube and Netflix apps are very straightforward to use, and picture quality from both has been very good. The ability to use your iPad or iPhone as a remote keyboard makes navigation easier.If you're invested in the Apple eco-system there are of course many more advantages; access to your iTune library, airplay screen sharing from your Mac or iPad - all the usual goodies you expect when you stay in the Apple fold.", "verified": true, "helpfulness": "0/0", "author": "Kevin Campbell"}, {"rating": 5.0, "review": "This is the best product for a great TV experience. I can see YouTube videos, shows, movies and just discovered a super variety if music. We barely even use our cable anymore.", "verified": false, "helpfulness": "0/0", "author": "Monica Carrera"}, {"rating": 5.0, "review": "Went ahead and got this and my wife and I are loving not having to pay for cable. We watch Sky news all the time and get international news and weather-a nice feature. Also hooked up to Netflix streaming and downloading from iTunes.Also we had an issue with the icons and we had to call Apple. They gave us great customer service and they fixed our issue and we were able to get back to watching very soon. Apple is a great company all the way around.", "verified": true, "helpfulness": "0/0", "author": "Bwwilson"}, {"rating": 3.0, "review": "THIS APPLE TV WAS USED AND THE WI-FI DOES NOT WORK. SO I HAD TO HARD WIRE IT IN TO GET AN INTERNET CONNECTION. OTHERWISE THE UNIT WORKS PERFECTLY.", "verified": true, "helpfulness": "0/2", "author": "Jairus K"}, {"rating": 4.0, "review": "Got the Apple TV and started updating it. Completely shut off and no connection. Then i had to actually purchase a MicroUSB cable to connect it to the computer so that i can restore it through i tunes. I think if APPLE wants us to restore through computer should have included one. Limited channels but i can see few more channels like Willow Tv and some international channels through AIRPLAY. This is a must have if you own an ipad or iphone. Otherwise Roku 3 is a much better choice.", "verified": true, "helpfulness": "1/1", "author": "Sath"}]