[{"rating": 5.0, "review": "It's apple. its what can you wish for it to be. It does everything. Works perfect. It's really worth buying it.", "verified": true, "helpfulness": "0/1", "author": "Ignacio Holguin"}, {"rating": 4.0, "review": "I have no quibble with the product itself, but what's the deal with absolutely NO setup information accompanying the tv unit? Not even a web address to go to for support and/or hookup instructions! I was left on my own to cast about Apple sites to find any instructions. Once I found them they weren't as helpful as they could have been for a technology tyro. It didn't help that the illustration of a remote didn't match the remote provided. The buttons that were illustrated aren't the ones on the actual remote, and the instructions only refer to the illustrated buttons, not the actual buttons. This made setup a miserable, frustrating experience. Nothing like the ease with which you can use any other Apple product \"right out of the box\".", "verified": true, "helpfulness": "0/2", "author": "N. Raphael \"Teacher/Designer\""}, {"rating": 1.0, "review": "To limited can't do much with it. IF you already own a smart TV there is really no reason to buy this. My wife thinks it's cute but cute doesn't do anything for me. Not recommended.  Waste of money I'm resealing this thing.", "verified": false, "helpfulness": "2/10", "author": "Pen Name"}, {"rating": 5.0, "review": "I have been wanting this little gadget for quite sometime, and just went ahead and took the plundge! what an awesome device!!! No more blu ray purchases. Its amazing how much one can do with this thing. I got it at best buy and used my reward zone card and saved 10.00. Nice! never a boring moment. I do not recall watching regular t.v since I got it. To busy watching youtube videos, and downloading music and movies. Also...watching trailers. Was excited to watch the cross fit games on ESPN. Very coool. Screw cable! who needs it!!! just an extra bill!!! No thanks. So run!!! go buy one..and for the record. I did do my research, and this apple tv...might not have as many apps as others..but its UI is easy and simple.  =-0)", "verified": false, "helpfulness": "0/2", "author": "Roni B \"Your only as old as you feel! =-0)\""}, {"rating": 5.0, "review": "The interface could use some better options here -- I would love to have a tile interface for browsing on-network media, like the Boxee's. But a very simplistic interface isn't really a problem here, I'm just comfortable working with something a little more complicated.I liked my boxee a lot -- like I said, I much preferred the interface on that --- but the boxee is a labor of love. It often just stopped working -- either would inexplicably fail to play some media files, or wouldn't be able to load a remote network directory...But this is an Apple product. You plug it in, and it just works. No hassle, no frustration, no cursing. Oh, and it's cheaper, too.", "verified": true, "helpfulness": "0/0", "author": "chrisazonian"}, {"rating": 5.0, "review": "This is now more than just a hobby for Apple.  I use it to watch video from my iPad or my iPhone all the time.  I rent movies on it.  I love using the Netflix and Hulu apps.  The HBO Go app has been great to watch my HBO series.  I can not wait to see what is added next.  It also is an Apple product which means it just works.  I plugged it in and a few minutes later it was working.", "verified": false, "helpfulness": "2/3", "author": "Sid"}, {"rating": 4.0, "review": "But has it's limitations. Your computer must be on with ITunes running which is a negative & you can't add aftermarket software which is a major negative. On the other hand it plays well & your movies of reasonable quality will look just fine on even a large TV (I use a 65 inch model) because of the ability it has to step pictures up to hi def.", "verified": true, "helpfulness": "0/0", "author": "BG \"Bob G\""}, {"rating": 4.0, "review": "I love this product. Great sound, great picture, great quality overall. Seamless integration with my computer's itunes library, my ipad and the internet. It works perfectly in Nigeria. Downside, is not enough content on it. Apple should open it up to more content providers and allow users download whichever provider they want just like apps on the app store. Also would be nice to have a browser, so you can stream video from any website you want. That's why i give it a 4.", "verified": true, "helpfulness": "0/0", "author": "Shez"}, {"rating": 5.0, "review": "My boyfriend purchased this product for me and I couldn't be happier!Although this can't be jailbroken yet because it's the newer versionThe air play is just as good if u have a apple ipadI absolutely love this product.The quality is great", "verified": true, "helpfulness": "0/1", "author": "Btwraps13"}, {"rating": 1.0, "review": "First let me say that I am a LONG time Apple fan having purchased 6 desk top computers and 2 laptops. Also Apple support staff through out my ordeal was simply the very best They really tried. Problem # 1 is that the remote is quite elegant but totally lame. In order to enter info you have to scroll through an on screen keyboard using this little button. I admit upfront that I have big thumbs and am not the sharpest tool in the box. But this damm thing drove me crazy! Worse yet to get to \"Submit\" you have to get past \"Clear\". Need I say I cleared all my work several times before submitting  because I am \"all thumbs\".Next to to do anything you need an Apple ID and password. Over 4 hours with Apple's saintly support and still could not get Apple TV to accept either my Apple ID or my wife's. Bottom line- returned to Amazon who is just the very best possible to deal with when you run into  problems with a purchase.", "verified": true, "helpfulness": "12/21", "author": "JAK"}]