[{"rating": 5.0, "review": "This thing is great; installation was a breeze (literally plug and play!) and now the 5000 plus family photos that reside on the computer are available for viewing on our tv, either as a slide show with music from our iTunes, or as a screen saver while the Apple TV is idle. Works beautifully with amazon prime, Netflix, etc. with plenty of free content from Crackle, PBS, etc. It also allows me to stream content from our iPads and iPod touch, which is a great way to share photos and videos with a group of people.", "verified": true, "helpfulness": "0/0", "author": "Doppler Man"}, {"rating": 5.0, "review": "YOUR CHROMECAST UNDER THE BUS, OR AT LEAST TO A TV IN ANOTHER ROOM. SILLY ME FOR THINKING THAT A GOOGLE PLATFORM DEVICE WOULD PLAY NICE W ALL MY APPLE STUFF.SAVE THE 35 BUCKS, AND GET THE REAL DEAL. ONE WORD...\"AIRPLAY\". ACCEPT NO SUBSTITUTE. IF YOU OWN APPLE, BUY APPLE.", "verified": true, "helpfulness": "0/1", "author": "joe"}, {"rating": 4.0, "review": "Simply great, it works great in india.The quality of the movie or image are great.But some time airplay is getting crashed", "verified": true, "helpfulness": "0/0", "author": "Arivoli \"Arivoli\""}, {"rating": 5.0, "review": "We are an Apple family and this is just icing on the cake.  Apple TV is easy to install, set=up and navigate.Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "J. Miller"}, {"rating": 4.0, "review": "My only issue is Airplay.  I understand the different screen dimensions but find it frustrating Apple can't maximize the display on a High Definition TV when your iPad is horizontal.  No one likes black bars", "verified": true, "helpfulness": "0/0", "author": "Patrick Ryan"}, {"rating": 5.0, "review": "Great product to use for any one with an apple device or iTunes. You can watch crackle and a number of other stations as well. All in all a great buy.", "verified": true, "helpfulness": "0/0", "author": "nino brown"}, {"rating": 5.0, "review": "I hate giving money to Comcast or Verizon for cable as cable sucks.  Apple TV makes no cable possible.  I pay for what I want to watch.  I just wish I could get German or Canadian content.  Some channels need you to have cable as well.  Things like the ABC and one other.  I refuse to support cable ever again!!!!!!  I would rather buy from apple TV than give any money to cable.  My advice, Boycott cable!!!!!", "verified": true, "helpfulness": "0/0", "author": "Anita H"}, {"rating": 5.0, "review": "Love this item went out and got a second one for the other tv. Even cancelled cable with having netflix and hulu.. Not to mention the 10 other apps", "verified": false, "helpfulness": "0/0", "author": "Matthew L Kowalski"}, {"rating": 1.0, "review": "I will not recommend buying is item through this vendor, the service for issues is awful, there are no customer serice numbers to contact, this item was passed from amazon to fedex to us postal and no one is taking responsibility for delivery, what a waste of money not to mention the disappointed recipient for whom this was a Christmas gift. Shame on you amazon for not providing a clear avenue for customer questions regarding misdelivery. Awful service will not purchase through amazon again", "verified": true, "helpfulness": "0/7", "author": "Maala Parameswaran \"Maala\""}, {"rating": 1.0, "review": "I was looking forward to this as a Christmas present, and to say this is a disappointment is an EXTREME understatement.Slow user interface, no app support for anything Ultraviolet (flixster, vudu, best buy, etc) - somehow iPad and iPhone have no issue here.Buffering is close to miserable on a hard wired line to my Mac....not even worth the $100....save your money to buy something that has a little better flexibility (Xbox, PS3, and Roku have much nicer interfaces) - Roku is even cheaper.", "verified": false, "helpfulness": "0/4", "author": "Jeffrey A. Barnes"}]