[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "A.L."}, {"rating": 5.0, "review": "Bought as gift, but I like the one I have", "verified": true, "helpfulness": "0/1", "author": "CHRIS EVARD"}, {"rating": 1.0, "review": "Hello,  unfortunately, found that Apple's Fund has no cable to connect it to the HD TV is the price without the wire because I found in my HD without wire at a lower price from you, I am disturbed by buying one of you .", "verified": true, "helpfulness": "0/7", "author": "badr"}, {"rating": 1.0, "review": "I bought into the Apple ecosystem primarily so I could listen to music on an iPod, but with iPod + iTunes working so beautifully and effortlessly, my attention quickly turned to this product. I'm an avid movie collector and have wanted some kind of media server for watching movies for about a decade.I bought initially an Apple MacBook Pro and an Apple TV (not the first generation) in the hope of constructing a media playback capability. This configuration didn't work for reasons that I've never fully understood. For a period of about six months, I went back and forth to the Apple Store looking for further methods to correct the problem. Among the things I did:1. Apple stated \"Buy a dedicated computer for movie playback, you're not going to get good performance otherwise.\" Ok, to fix this, I bought a Mac Air.2. \"The Mac Air you bought isn't powerful enough, you need at least an i7 processor.\" Ok, to fix this I bought a Mac Air with an i7 processor.3. \"Oh, of course you won't be able to play movies without leaving the computer on all the time\". Ok, to fix this, I bought a Mac mini which I can leave on all the time and it has an i7 processor too.4. \"Well, we don't know why it's not working. I suggest you try buying another Apple TV\". Ok, to fix this, I bought another Apple TV.5. \"Well, I don't know why your setup is not working, but it could be your router. Are you using an Apple router?\" Ok, to fix this, I bought an Apple Extreme Router.6. \"Well, it's not clear why your setup is not working. However we have other customers with your setup and they are having issues too. Let me tell you what I did to fix this: I bought a Synology media server. It has iTunes streaming capability. Then you won't need to worry about leaving your computer on all the time.\" Ok, to fix this, I bought a Synology DS411 with iTunes streaming capability.At this point, about two years had elapsed and the system had never been able to play a piece of music, a TV show or a movie. I didn't have any more time available at that point to try to make the system work so I put it on the shelf for about a year.About 3 months ago, I finally got some free time and dusted off all the components. I plug in the Mac mini and authorize it in iTunes, I plug in the Apple TV, still with two year old software, authorize it and, much to my shock and surprise, it started playing movies, TV shows and my music library perfectly.PERFECTLY!At this point, I thought to myself, \"Finally they have fixed all the bugs! This is going to be the same pure joy that my iPod is!\"Then I selected \"Software Update\" on the Apple TV and the unit stopped functioning.I've spent at least $10,000 and 3 years trying to get this to work and it worked successfully for about two weeks. I'm moving on now to some other ecosystem (haven't yet found a viable alternative).", "verified": false, "helpfulness": "0/4", "author": "R. Williamson"}, {"rating": 4.0, "review": "it's very good,i like it.thanks.", "verified": true, "helpfulness": "0/0", "author": "sho"}, {"rating": 5.0, "review": "Excellent! I love it....Now I can mirror my iphone, Ipad, and my Mac very easy.....", "verified": true, "helpfulness": "1/1", "author": "Amaranadh R Male"}, {"rating": 5.0, "review": "Love it! Great price - fast shipping", "verified": true, "helpfulness": "0/0", "author": "Michelle Hale"}, {"rating": 5.0, "review": "like", "verified": true, "helpfulness": "0/0", "author": "Wood"}, {"rating": 5.0, "review": "Exactly as advertised", "verified": true, "helpfulness": "0/0", "author": "corpad"}, {"rating": 3.0, "review": "Works great - thought it would do more.", "verified": true, "helpfulness": "0/0", "author": "Sandra M."}]