[{"rating": 4.0, "review": "This has improved our download experience over our early version Roku. So that's great. I love the streaming of videos from my phone. Haven't yet figured out how to use it to \"mirror\" my computer, which is one of the reasons we got this. But we just got this not long ago and haven't played around with it enough yet I presume.", "verified": true, "helpfulness": "0/0", "author": "K. Proffitt"}, {"rating": 5.0, "review": "I bought this because of the airplay feature, but was a bit sceptical that it would not work.  I was happy to find that airplay, which plays anything on your TV that is playing on your iPhone, iPod, and iPad, works great.  I mostly use it to show pictures that are on my iPhone on the plat screen TV, it can even play music at the same time!", "verified": true, "helpfulness": "0/1", "author": "Buyer"}, {"rating": 5.0, "review": "The apple tv is very simple to hook up and use.  It is also very nice that you can use your iphone or ipad as the remote control.", "verified": true, "helpfulness": "0/0", "author": "David T Bishop"}, {"rating": 5.0, "review": "We are using this device in a corporate mid-sized conference room.  Connected to an A/V tuner/receiver, we can now provide Apple devices with a convenient way to reach the projector.", "verified": true, "helpfulness": "1/1", "author": "Steven Moore"}, {"rating": 5.0, "review": "We love our Apple TV so much that we have given this as a gift twice.  I think its the perfect wedding gift for any couple with IPhones.", "verified": true, "helpfulness": "0/0", "author": "A. Beatty"}, {"rating": 5.0, "review": "the only thing i am not happy about with apple TV is that amazon instant video doesnt stream on it.  oh well, we still have hulu plus and netflix  so if something is exclusively on amazon, we watch it on the ipad.  totally worth the price paid, quick shipping, and really glad to not have cable!!", "verified": true, "helpfulness": "0/0", "author": "RLOinAZ"}, {"rating": 1.0, "review": "my beef with Apple TV is the unreliability of their server. Apple TVSUCKS because you can never tell if their server works.", "verified": false, "helpfulness": "0/9", "author": "bassplayer"}, {"rating": 5.0, "review": "stream netflix over hdmi, stream from your computer - awesome!  just know that when we took it to a hotel it didn't work because the wi fi needed web authentication so it didn't work.  great purchase!", "verified": true, "helpfulness": "1/1", "author": "Blueskies"}, {"rating": 5.0, "review": "The Apple TV is an easy way to get videos, music, photos, and podcasts on to your TV. I edit home movies on my Mac and put them in iTunes where they stream to the Apple TV. When I start a show mid-season, I catch up on old episodes by getting them from the iTunes store.", "verified": true, "helpfulness": "0/0", "author": "Neil"}, {"rating": 5.0, "review": "Great quality, works perfectly and as advertised. simple  - just plug it in and use the simple intuitive remote. Brilliant.", "verified": true, "helpfulness": "0/0", "author": "jp"}]