[{"rating": 3.0, "review": "Not a lot of instructions for connecting to the I pad. Or phone.  Just the Mac.  Very little info on cables you need.  Even TV show reruns cost.  Using this could become expensive.  But it is great for showing what is on you I pad.  Controller is simple to use!", "verified": true, "helpfulness": "0/0", "author": "espo56"}, {"rating": 5.0, "review": "Amazingly simple to use and set up! Streaming video, sharing pictures and video great for anyone. I have 3 myself and have bought one for my inlaws. Great for school or home use.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 4.0, "review": "I was a little skeptical when I first bought the Apple TV but it exceeded my expectations.The mirroring function allows you to broadcast whatever you have on your iPad onto your TV. This is great for streaming sports, movies, etc... that would normally be too small to watch on your iDevice.You can also set up your Netflix, Hulu Plus, HBO Go accounts on the Apple TV and stream them to your TV.The only con is that the movies, TV shows, etc... available for purchase on the Apple TV are very expensive.", "verified": true, "helpfulness": "0/0", "author": "Sparky"}, {"rating": 5.0, "review": "Product worked exactly as advertised. Easy to set up, easy to use. Great for keeping kids entertained on a non smart tv.", "verified": true, "helpfulness": "0/0", "author": "Bhavesh Patel"}, {"rating": 5.0, "review": "Love the Apple TV.  We have already signed up for Netflix, and there is so much more to watch with Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Preston Hall"}, {"rating": 5.0, "review": "Perfect for the home that has apple devices, and kids. New channel/apps appear that provide more content. No need to waste money on a smart tv.", "verified": true, "helpfulness": "0/0", "author": "D. Champlain"}, {"rating": 5.0, "review": "This was so easy to set up and use. Now we can watch a lot via the Apple TV from our computer. Considering getting rid of cable due to excessive fees that include many things we are not interested in. We recently lost TV service for 2 days and hardly noticed ti.", "verified": true, "helpfulness": "0/0", "author": "Native plant lover"}, {"rating": 4.0, "review": "AppleTV is probably the best mini set top box. The interface is much smoother and slicker than other boxes and smart TVs or Blu-Ray players I've tried. And if you also own other Apple gear, you can use Airplay which is amazing.The only downsides are 1) No Amazon 2) No PLEX 3) No way (without hacking) to add/remove apps.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 4.0, "review": "Very nice and user friendly, but I also have Roku and it has way more channels than Apple TV and it's cheaper.", "verified": true, "helpfulness": "0/0", "author": "Chris \"Chris\""}, {"rating": 5.0, "review": "I appreciate the support: G. Siva Niranjan, K. Saikumar and Sridhar S. for its excellent features at the drawbacks present in the purchase of apple tv. thanksrB", "verified": true, "helpfulness": "0/0", "author": "RandyBau"}]