[{"rating": 5.0, "review": "Perfect 👍🏼", "verified": true, "helpfulness": "0/1", "author": "Shaker"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "vdanbv"}, {"rating": 3.0, "review": "I had to spend an extra 30$ for an operating system. Did not work out of the package.", "verified": true, "helpfulness": "0/1", "author": "Stacey holmes"}, {"rating": 4.0, "review": "For some time I had been debating between Chromecast, Fire TV, Roku, and Apple TV for a streaming device. Up to this point I had been using an Xbox 360 to stream content from Netflix, Youtube, etc. That worked fine, but it's kind of annoying lugging around the rather large console just for one simple purpose. So I did some research and realized that since I already had an iPhone and a Macbook, Apple TV should be a no brainer. I love how it syncs perfectly with my devices and allowed me to link up with my iTunes account. I'm not really a fan of the limited app selection but for anything extra that I need, I can just mirror form my laptop. When close to the router or plugged in it runs great, when far away it's a bit laggy. All in all, I like the product and it streams well.", "verified": true, "helpfulness": "0/1", "author": "Jacqueline"}, {"rating": 4.0, "review": "For a Review of Apple TV Vs Roku | Which format will fit you best?https://youtu.be/SHmGVpLVTtI", "verified": false, "helpfulness": "0/1", "author": "Jade Studios"}, {"rating": 3.0, "review": "Fun product but one big complaint: the parental controls cannot be set to require a code each time a program in question is attempted.  Also, the settings can only be changed from your iPhone, iPad, computer, etc., rather than through the AppleTV. For example, if my husband and I want to watch Game of Thrones, I have to change the settings on my phone, then go back to re-enter the stricter setting after viewing so that the children don't have free access to it. Just would get a lot more utility if we could enter a code when trying to access each individual show....", "verified": true, "helpfulness": "0/1", "author": "Jenski"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/1", "author": "Johnny Varela"}, {"rating": 5.0, "review": "Great...  Read every thing very good  before buying....", "verified": true, "helpfulness": "0/1", "author": "alice amerson"}, {"rating": 4.0, "review": "Airplay is a bit of a disappointment, drops frequently from my iPhone.  Otherwise a decent buy.", "verified": true, "helpfulness": "0/0", "author": "Jeff G Brummer"}, {"rating": 2.0, "review": "The remote has a sticky button. Which every time the right arrow is clicked it sticks.", "verified": true, "helpfulness": "0/1", "author": "Ciera Howard"}]