[{"rating": 1.0, "review": "It does everything that everything else I have already does. I got apple tv as a gift for x-mas, thought it sounded cool and got to setting it up right away. Set up was easy enough and I thought this might be a cool new piece of technology. But it's not. My wii does everything this does, so does my tv and my blue ray player. The only difference is that I can stream music to my tv and listen to it on crappie flat screen speakers, and I can see what's on my computer screen right now. But guess what, my iPod plugs directly into my stereo system, and seeing what's on my computer screen is pointless. I cancelled Netflix a long time ago and have no plans of subscribing to Hulu in the future. In order to make this thing do anything you have to subscribe to a variety of different services so be prepared to spend a lot. And why would I pay 3 bucks to rent a movie on iTunes when they are a dollar at the redbox down the street? If you want to buy something that requires you to spend even more money to make it work than this is the product for you. Pointless.", "verified": false, "helpfulness": "5/14", "author": "david arko"}, {"rating": 5.0, "review": "My husband just loves his Apple TV, however that means that I won't be able to watch TV anymore.  But I knew that would happen when i got it for him.  LOL", "verified": true, "helpfulness": "0/0", "author": "Sybil Hussmann"}, {"rating": 5.0, "review": "Is it overpriced? Yes, probably. But it's still inexpensive, and works great. Netflix works great on it and is my primary use of it. If you have apple products, they wirelessly connect and play music/video. I love it and highly recommend it", "verified": true, "helpfulness": "0/0", "author": "Matthew J. Hodgkins"}, {"rating": 4.0, "review": "Everything works as I was expecting, and is smooth.Tons of free radio stations with all kinds of music.Good quality choices.", "verified": true, "helpfulness": "0/0", "author": "Ashish Gupta"}, {"rating": 5.0, "review": "This is a great product, I really recommend it to all mu family and friends.Apple is always the best.", "verified": true, "helpfulness": "0/0", "author": "Mariela Trujillo"}, {"rating": 5.0, "review": "My wife loves this product, makes the connection between ipad and TV simple. It seems if Apple TV is too far from the ipad, then the connection isn't as good.", "verified": true, "helpfulness": "0/0", "author": "Willyman0282"}, {"rating": 5.0, "review": "We love our Apple TV and now have one for each tv in house. No more $100+ satellite bills every month. Woo hoo!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I can't believe that I'm actually living in the future! AppleTV is a cinch to set up (Siri helps)- we were up and running with all of our music, videos, etc. from iTunes in a matter of minutes. Love that I can choose from Netflix or HuluPlus for streaming movies. Plus my photo stream scrolls through during downtown. I would highly recommend this if you are already loyal to Apple and iTunes.", "verified": true, "helpfulness": "0/0", "author": "Sharon Rossino"}, {"rating": 5.0, "review": "Funciona muito bem com os outros dispositivos apple. Usei ele no meu receiver e o resultado foi muito bom. Fiquei satisfeito.", "verified": true, "helpfulness": "0/1", "author": "Fpa run"}, {"rating": 5.0, "review": "Excellent performance from this unit main use is for netflix use and works excellent, easy setup and performance from a unit so small yet packed with performance", "verified": true, "helpfulness": "1/1", "author": "N. David"}]