[{"rating": 5.0, "review": "Absolutely love Apple TV. Very easy to use and set up. Access to more apps than my Roku with a better interface. Props go to apple yet again for a streamlined and awesome product.", "verified": false, "helpfulness": "0/0", "author": "Ryan A. Oneill \"Nkai\""}, {"rating": 5.0, "review": "solid little box, and it just works.", "verified": true, "helpfulness": "0/0", "author": "natt"}, {"rating": 1.0, "review": "This is the worst TV streaming device that you can spend your money on. Apple TV shows everything that is wrong with Apple, it is over complicating things as simple as connecting your phone to it. Even if you have an iPhone or iPad made by the same people it will not connect. I have used both Roku and chromecast and have found that both are extremely superior to this idiotic product. Not only is the software atrocious but the remote is the worst engineered thing that Apple has ever put out. I spent money on this thinking that I would get something that would work specifically for my Apple devices. I just ended up buying a brick with an Apple logo on top. Boo Apple.", "verified": false, "helpfulness": "1/5", "author": "Ben Tozier"}, {"rating": 2.0, "review": "I bought this because roku has been slow to get HBONOW but the lag is really bad. Also if you want to rewind or replay something it's really slow. I thought this would work just like the roku but roku is better. Really disappointed in Apple for this poor product.", "verified": false, "helpfulness": "0/1", "author": "A. Ramirez"}, {"rating": 3.0, "review": "Plenty of room for improvement in offerings and interface.", "verified": true, "helpfulness": "0/0", "author": "John Kevin Swint"}, {"rating": 5.0, "review": "Amazing seller AAA+++. All perfect.", "verified": true, "helpfulness": "0/0", "author": "Guido Favreaud"}, {"rating": 5.0, "review": "LOVE!  Especially love that I can use the iCloud photos and see my pictures as a screensaver on the TV.", "verified": true, "helpfulness": "0/0", "author": "kjayd13 \"k.dickinson\""}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "You would be insane not to buy this! It's so great! unending apps and software updates that keep them going strong and with new features all the time! Works well with iPhone and other Mac products! Love it! No problems at all. High quality!", "verified": true, "helpfulness": "0/0", "author": "B. MCGEE \"slim\""}, {"rating": 5.0, "review": "Apple TV is probably one of the best inventions ever made for television viewing. Highly better.", "verified": false, "helpfulness": "0/0", "author": "Ian Reed"}]