[{"rating": 5.0, "review": "Overall one of the coolest piece of electronics i own. This totally links up my apple entertainment. Very easy to operate from any apple device.", "verified": false, "helpfulness": "1/2", "author": "brian barash md"}, {"rating": 5.0, "review": "I have been waiting a long time for an Ipad, finally got one. So the next step was Apply TV. I am so glad i got this great product.", "verified": true, "helpfulness": "1/2", "author": "tom k"}, {"rating": 5.0, "review": "Amazing little gadget from Apple! Stinks that you have to pay $25 bucks to use the cloud app on it or else you have to have your apple pc open while using it though :( Sort of defeats the purpose! But overall great purchase! Husband loves it!!", "verified": true, "helpfulness": "1/1", "author": "Amy"}, {"rating": 5.0, "review": "These were my best buy of the whole year! Love them!! Super comfy and I'll buy more when these wear out", "verified": true, "helpfulness": "0/5", "author": "1torio"}, {"rating": 2.0, "review": "I gave 4 of these for christmas presents this year and everyone returned them and got a Chromecast.  The reason was because they couldn't use Amazon Prime with them easily.  There are ways to watch Prime through the Apple TV but its a hassle and no one wants to jump through hoops to watch a movie.  If you don't have Amazon Prime it works great.", "verified": true, "helpfulness": "4/4", "author": "M. Duggan"}, {"rating": 5.0, "review": "I use it to get music in an area that doesn't get good reception, but over the internet it works really well.", "verified": true, "helpfulness": "0/0", "author": "Creative lady"}, {"rating": 5.0, "review": "Very easy and with a little setup for wi-fi, your up and running. The only thing it does out of the ordinary, is the remote shares volume and starts movies on the Mac. Could be operator error. Happy with this device.", "verified": true, "helpfulness": "0/1", "author": "J. latsch \"EX MailMan\""}, {"rating": 5.0, "review": "Exceded my expectations, serves the purpose I wanted it to while discovred features I did not know Apple TV had.", "verified": true, "helpfulness": "0/0", "author": "OF Marte"}, {"rating": 5.0, "review": "Excellent product!!!It works perfect and is easy to install. I syn mi mac, Ipad and Iphone without any problem.I love it!!", "verified": true, "helpfulness": "0/0", "author": "Matias"}, {"rating": 5.0, "review": "You can never go wrong when you buy an Apple product, this little Apple TV gives me everything I need for streaming digital programs on my TV, Denis Herman", "verified": true, "helpfulness": "0/0", "author": "Denis Herman \"apollo100\""}]