[{"rating": 5.0, "review": "got this for netflix but the movies for rent over iTunes are great! very high quality when compared to comcast on demand.  why does the remote control my computer though? every time i start a movie music comes on from iTunes.", "verified": true, "helpfulness": "0/0", "author": "dan b"}, {"rating": 4.0, "review": "Apple TV has made my cord cutting experience tolerable.  I grew tired of increasing cable TV prices and having difficulty finding TV programming that I actually wanted to watch. I truly believe TV media is changing as we know it.  Apple TV and other streaming media devices are leading this change.PROS:- Airplay is awesome.- Did I mention that Airplay is awesome?- No really, Airplay is what sets apart Apple TV from all its competitors and really an amazing feature.  I digress...- I personally enjoy the following options on Apple TV:  YouTube, Apple Radio, iTunes via Airplay, Bloomberg News (surprisingly), Yahoo Screen (for SNL and The Onion), PBS, ESPN and NBA (for game highlights and short news clips) , Crackle, The Weather Channel, VEVO, Podcasts (which I never used before), and the Airplay Mirroring feature (mostly for Basic Hulu).- I can usually find something on Apple TV to occupy my time.  After all,  isn't that what TV is for?  It does take some effort to find something sometimes.  It's not like regular TV where you can just turn it on and all your programming is done for you.INTRIGUING OFFERS IF I FELT LIKE SPENDING MORE MONEY OR BEING MORE TECH SAVY:-Netflix, Hulu Plus, HBO GO-iMovie, Photos/Videos, FlickrCONS:- no amazon prime offering (however I think I read you can mirror Amazon Prime with an iOS device)- the remote works well however could be improved with a keyboard feature or headphone jack or sensor technology- no gaming features unless you use an iPad or iPhone with Mirroring- Mirroring did not work well straight out of the box (I had to alter my router settings to get rid of very jerky video playback.  This took me a while to figure out as no Apple representatives were able to help me.  I found the fix on some random messaging board.)- Video playback of HD quality video with mirroring is still slightly jerky.  Let me stress that the playback is only SLIGHTLY jerky.  It's to the point where its hardly noticeable to me.  It does not bother me, but it's not perfect.  My understanding is because it takes a lot of bandwidth to mirror from your device to the Apple TV.  I do not know that there is any way to completely fix this without running a cord.  Video playback used to be flawless using my HD cable. Despite all this, I value being able to mirror with Airplay more than running my HD cable.- not as much channel availability as the ROKU.  I have never used the ROKU, but I've heard that quality ROKU channels are few and far between despite their large channel lineup.WARNING:DON\"T FORGET TO MAKE SURE YOU HAVE AN OPERATING SYSTEM ON YOUR APPLE DEVICE THAT IS COMPATIBLE WITH THE APPLE TV AIRPLAY FEATURE!BOTTOM LINE:If you are an Apple user already, I recommend the Apple TV.  If not, I think the ROKU is a fine option.  Apple TV and ROKU are especially valuable if you wish to \"cut the cord\" to Cable TV.MY TWO CENTS FOR THOSE \"CUTTING THE CORD\":Don't forget to use a quality TV antenna for those days when you cannot find something on your streaming media player.  TV via the antenna has come along way.", "verified": true, "helpfulness": "0/0", "author": "P. McGrady"}, {"rating": 5.0, "review": "Really enjoy this Apple product and I haven't had any problems with it. I would recommend it to anyone looking for a way to stream entertainment on your TV.", "verified": true, "helpfulness": "0/0", "author": "Jacob"}, {"rating": 4.0, "review": "Remember to purchase your cords when you order your AppleTV as it doesn't come with them.  It works great with my netflix acccount.  Amazon needs to open Prime Streaming up for use on AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Stacy \"Stacy\""}, {"rating": 5.0, "review": "This bad boy is like almost seeing a scrambled boob on the porn channels when I was younger. The best thing in my life so far is what I'm getting at. If only amazon prime was allowed.", "verified": true, "helpfulness": "0/0", "author": "philip m ball"}, {"rating": 5.0, "review": "The couple was beyond thrilled and love their new Apple TV!!!  They say it works great and could not have received a better gift!", "verified": true, "helpfulness": "0/0", "author": "Yappy \"Lucy\""}, {"rating": 2.0, "review": "Remote fail! Remote will not work had to buy a new one at the store. Other than that it works well", "verified": true, "helpfulness": "0/0", "author": "ethan koslowski"}, {"rating": 5.0, "review": "This is the second Apple Tv I have purchased.  The first one was from the Apple store and was more expensive.  I would definitely buy this one again.", "verified": true, "helpfulness": "0/0", "author": "Dfras"}, {"rating": 5.0, "review": "Had Netflix (got rid of it bc I got AmazonPrime now) and had to manually plug in my MacBook Pro with a video/hdmi cord to my TV to watch anything. It got annoying after a while so decided to give the Apple TV a try. First off, Amazon has the best price. Now no need of cords! I can use my MacBook Pro, iPad Air, and iPhone to watch Amazon Instant right from my couch! The Apple TV has worked great for my home. I have Comcast and get about 28mbps down and about 6mbps up. I have noticed that on occasion there will be a slight video stutter (never sound though). But nothing major or unbearable. Actually, I noticed my Apple TV software was 6.0 and I had to upgrade it. Now I don't notice a video stutter/lag at all. But I have heard that many people have had problems with this so beware...Other than that it has worked great. If you are thinking about getting an Apple TV, I recommend looking into upgrading your internet speeds if you aren't in the 20mbps range. And maybe to save cost/cancel out cost, look into getting rid of your cable and get AmazonPrime and get their AmazonInstant Videos.", "verified": true, "helpfulness": "0/0", "author": "A Lee"}, {"rating": 2.0, "review": "Worked great for a few weeks, with a few minor connectivity issues. Now after I can't return it, major connectivity issues. I tried all the help recommendations relating to connectivity, but it was only fixed temporarily.", "verified": true, "helpfulness": "0/2", "author": "Timothy M Anderson"}]