[{"rating": 3.0, "review": "I get these to mostly do airplay wireless mirroring to my TV's from either my iPhone 4s, ipad or mac-book. they're pretty cool, but beside from that, it's lacking a lot of feature most other cheaper media player has. like the Roku HD Streaming Player or D-Link Boxee Box HD Media Player with HDMI, USB and 802.11n Wireless-Enabled Ethernet Port - Refurbished (DSM-380/RE)", "verified": true, "helpfulness": "0/3", "author": "vu nguyen"}, {"rating": 2.0, "review": "I have become a convert to Apple because of how easy it is to use their products. This is the first time I have been disappointed. I wanted to use the mirroring feature--wirelessly project whatever was on my laptop to the flat screen in my bedroom. It was easy to set up, but I tried to play a movie, and I could not get audio. I called Apple and they told me that my macbook air was probably not compatible, which was not true. Then I was told that my router was probably not powerful enough. (I just bought a time capsule so that was not it). I then was routed to technical, and talking to them, it sounded as if other people were having this issue. Final resolution was that I probably had some type of interference that was disrupting the audio. It turns out when I tried the apple tv in another room it did work, however the volume thru the flat screen TV is still supressed. Apple's final recommendation is that I connect the device with an ethernet cable. If I wanted to go that route I could just have connected my laptop the flat screen to begin with.", "verified": true, "helpfulness": "0/3", "author": "jaquee"}, {"rating": 5.0, "review": "This product is wonderful and we are thoroughly enjoying it. We can stream all of our pictures onto our television, play our I tunes music and watch tons of movies. We are using apple tv a lot more than I thought we would. Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Twright23"}, {"rating": 2.0, "review": "Greetings, I am writing because the product that you recently purchased, I could not connect with my new iPad 3 or my ipod touch 4g. no airplay icon appears in the aforementioned devices when I try to connect to Apple TV. I could also connect in any way that Apple TV with my apple devices. aperentemente seems a failure or receiving antenna Apple TV because if I could connect with the same wifi network.thanks for the care you may dispense with this", "verified": true, "helpfulness": "0/5", "author": "miguel"}, {"rating": 5.0, "review": "Another great product of Apple. If you like Netflix and surfing over YouTube, the Apple TV will be your best friend. Easy to set up, plug and play.", "verified": true, "helpfulness": "0/0", "author": "Eduardo Perez Mancia"}, {"rating": 1.0, "review": "Things are not quite as they seem. If WiFi service in the dorm is through a \"captive network\" (ie, one requiring authentication before letting a user onto the internet), Apple TV does NOT work (ie, it won't sync with iTunes, and your computer will not recognize the device). Apple tech support says that Apple TV won't work with a captive network, and that I should buy a router and set up my own wireless network in the room--the school, however, won't allow me to do this. Come on, Apple! You had to know that this would be problem! Apple TV should come with a big black-box warning that it may not work in dorm rooms! How about a little truth in advertising! Right now, my Apple TV is just a nice shiny black paperweight", "verified": false, "helpfulness": "7/21", "author": "G. Oster"}, {"rating": 3.0, "review": "Can't add apps.AirPlay is not smooth.Very limited set of apps.Interface is good.Remote is sleek. Easy to loose inside the couch.", "verified": true, "helpfulness": "0/3", "author": "smilerao"}, {"rating": 4.0, "review": "Well spent money, I use it  to watch Netflix and have got what just what I wanted and it is so easy to use that my 5 years old daughter can choose by herself what she wants to watch", "verified": true, "helpfulness": "1/1", "author": "Juan Picon Cordero"}, {"rating": 5.0, "review": "I've had this product for about three days now and have to say that I love it!  For starters, all the TV shows, movies, and music I've purchased through iTunes is available through this device via \"the cloud.\"  I can also access through \"the cloud\" music stored on my computer (I haven't purchased from iTunes) via the \"iTunes Match\" Service.I just watched the season 5 finale of BREAKING BAD on this device. I did not have to wait about 15-20 minutes for the 2 GB file to download to my computer. It was available immediately for instant viewing through Apple TV!  Another great benefit of this device is that you can stream videos from Netflix and Hulu!  Picture and sound quality is outstanding(I have a 720p HD TV).I love the fact that I can also control my Apple TV through a \"Remote\" app on my iPad.  So, if I ever break or lose my Apple TV remote, I can still use my iPad! Apparently, you can also use your iPhone and iPod touch as well. There are a lot of other outstanding features of this product; I  encourage you to read other reviews and the product description.This product is yet another reason why Apple is so successful and why they're recognized as a tech giant.  I prefer the word \"juggernaut!\"  Anyway, if you love Apple products and you have invested a good amount of money in iTunes content, you gotta get this product!", "verified": true, "helpfulness": "1/1", "author": "Introspective Falcon"}, {"rating": 5.0, "review": "I had the original hard drive based apple tv and was disappointed by it. Too much syncing/buffering. Quality of video was good, not great. And no services other than iTunes video.This has all changed. Netflix, Hulu, NHL, well you know the rest. Tons of streaming subscription services built in and then iTunes pay as you go to fill in the rest.Plus AirPlay from my iPad is AWESOME. just had a fantasy football draft and mirrored the results to my big screen from my iPad.I usually leave my tv on in the background when I'm sitting around and it's nice to play music through my surround sound and have the photo stream screen saver pull up all my photos from the last 30 days or just coming across a random Internet video or highlights from last nights game and being able to have them play automatically on the TV is nice.VERY happy with this version, thinking about picking up another one for the bedroom! Great device for cutting the cord and breaking free of cable/sat!", "verified": true, "helpfulness": "1/1", "author": "Casey Smigelski"}]