[{"rating": 5.0, "review": "Easy to use, Great apps, I love to stream from ipad to Apple TV using airplay. This is a must have home entertainment item.", "verified": false, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "I love the apple TV.  I mostly use it to stream my huge library of music, TV and movies over my local network.  However the web apps I have tried work  great too. Video quality and network streaming are excellent.", "verified": true, "helpfulness": "1/1", "author": "Josh B."}, {"rating": 5.0, "review": "I love this!  Makes using my tv so much easier.  Looks just like my iPAD.  My son suggested this to me.", "verified": true, "helpfulness": "0/0", "author": "Annie \"beadgoddess\""}, {"rating": 4.0, "review": "We had to return our first unit which was defective. Amazon promptly sent new unit. We haven't had any issues. We have this and a roku. The roku is better for the kids and apps. Apple TV is great for airplay.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 4.0, "review": "at times apple stuff is expensive and needlessly so, however the apple tv at under 100 dollars is good value for the amount of entertainment you can control with just the one device. worth it for anyone using hulu, netflix, or even youtube.", "verified": true, "helpfulness": "0/0", "author": "Nauman Jaliawala"}, {"rating": 5.0, "review": "I can't bring myself to buy the second one, only because I'm trying to be frugal.  I \"need\" one for my second TV.  I love the features.  Its Apple.  I think you get everything you expect from Apple.", "verified": true, "helpfulness": "0/0", "author": "coleopreacher \"Cole\""}, {"rating": 5.0, "review": "In my opinion the best looking, easiest to navigate interface out of the other streaming boxes.  I have two AppleTV boxes in my home and purchased one for my mother as well.  They are high quality, fast WiFi and great for syncing your iTunes.  If you tend to avoid apple products try the Roku 3, very similar results.", "verified": true, "helpfulness": "0/0", "author": "rs223"}, {"rating": 5.0, "review": "Exellent i love it my actually thinking of getting rid of my cable company cuz i have everything i need", "verified": true, "helpfulness": "0/0", "author": "Roberto Peralta Francisco"}, {"rating": 5.0, "review": "If you have an iPhone, iPad, iMac, or a Macbook, you absolutely have to have one of these. You can mirror the screen of your iPhone or iPad directly to your tv screen. It has several channels like netflix and hulu plus to enjoy also.", "verified": true, "helpfulness": "0/0", "author": "Joseph L. Dixon \"Kilo Boy\""}, {"rating": 3.0, "review": "Need I say more?  The usability is great and everything, but they need to expand on the Apps so you can watch more without a cable subscription.", "verified": true, "helpfulness": "0/0", "author": "Larsen G."}]