[{"rating": 5.0, "review": "My second Apple TV.  Great product, great price.  Most every other place I tried to purchase from wanted 20% more for the product.", "verified": true, "helpfulness": "0/0", "author": "Bill's Review"}, {"rating": 4.0, "review": "Misses info if you turn it off. Bluetooth capability would be nice and give internet to TV too. Nice finish quality and color", "verified": true, "helpfulness": "1/1", "author": "Dennis F. Mercado \"World W/O War\""}, {"rating": 4.0, "review": "I have trouble to display my mac image on the tv, but I think it could be my wifi.  I didn't have any problem installing it.", "verified": true, "helpfulness": "0/0", "author": "Efrain"}, {"rating": 4.0, "review": "I have both the Apple TV and the Roku 3. The Roku 3 has much better functionality and seems to have more apps than the Apple TV. The AT is great for someone with other apple products mainly for connectivity, but the roku is faster, includes a private listening headphone jack in the remote, has more apps, includes games and looks better. The AT is very simple and streamlined like most apple products. Even the remote is very slender and easy to misplace. This will definitely meet all of your streaming needs, but I prefer my roku.", "verified": true, "helpfulness": "1/1", "author": "nifa21"}, {"rating": 4.0, "review": "The Apple TV is a good product.  There is only one reason I didn't give it the 5-star rating.  On occasion (it doesn't happen very often, but it DOES happen), the Apple TV will stop in mid-stream and go back to the menu without warning.  I will get a message that we are not connected to the Internet, which is wrong.", "verified": true, "helpfulness": "0/0", "author": "Carol Mossler"}, {"rating": 4.0, "review": "It's silly that I have to pull up Amazon Instant Video App on my iPad and then push it to the Apple TV. This is not necessarily Apple's fault, but maybe Amazon's -- they have not released streaming apps for phones or AppleTV but they have made it readily available for most tablets and Smart TVs.", "verified": true, "helpfulness": "0/0", "author": "KoSpazz \"KoSpazz\""}, {"rating": 2.0, "review": "Apple claimed that you can use Apple TV to airplay anything from your iPad to your TV. This was the sole reason I purchased this product. When I got this home I immediately tried to airplay my favorite tv apps. Airplay is disabled for the NBC, CBS and USA apps.", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 4.0, "review": "Works fine. We can't access all the channels because we do not have a cable provider or satellite provider. But, knew that when we ordered it so can't really complain.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Baldwin \"freelancer\""}, {"rating": 5.0, "review": "I love this thing so far. Sometimes the sound will not play through, but if I unplug it and plug it back in it works fine.", "verified": true, "helpfulness": "0/0", "author": "Brittni"}, {"rating": 3.0, "review": "Images are too small and trying to type out characters for search strings too tedious often getting the wrong character and needing to drive around for the backspace. Look ahead type guessing while I'm typing in a search would be a welcome enhancement!", "verified": true, "helpfulness": "0/0", "author": "Frank Napoleon"}]