[{"rating": 5.0, "review": "This is my second one, goodbye cable and satellite providers no more dishing out money to them, now I control my viewing choice.", "verified": true, "helpfulness": "0/0", "author": "C. Valderrama"}, {"rating": 5.0, "review": "Well it's made by Apple so you know it's gonna have a certain level of quality and functionality, but this device is just awesome. Many different ways to access content from Netflix to HBO Go to Apples own services and many more. Also if you have a Mac computer you can also screen share to it (just check yours is compatible. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "J. Gambuto \"Wise Buyer\""}, {"rating": 3.0, "review": "I've had this device for about a month now and thought I'd give some impressions which might aid those considering a purchase.First, on the device itself. It's small in size and works well. I recently cancelled my pay-TV package because it was just too expensive for the amount of time I used it. I had 500 channels and watched about 1 of them. My main viewing interest was in watching NHL hockey games, and I watched nothing else, so why pay for what I wasn't using? NHL games were available through Apple TV for $100 dollars a year—about what I was paying each month for pay-TV. A good deal. I find that I actually get a better picture through the Apple TV than I got through my pay-TV provider, so I'm satisfied with how the device works.Now, what I'm not so satisfied with. First, in the NHL TV package, the games come on when the games begin and end immediately when the games are over. What's the big deal about that? Well, I like to get at least a little pre-game and post-game coverage. I'm not expecting complete pre- or post-game shows, but at least a little something. I don't need the game to switch off the second the final buzzer sounds. This isn't Apple's fault. I'm sure it's in the NHL TV contract. I won't reduce my rating because of this, but it's something to consider for sports fans because I'm sure it's the same deal with the NBA and MLB packages.There is not enough content available from Apple TV. Looking at the list available through Roku, they seem to offer a lot more, and a greater variety. For instance, I'm a subscriber to Amazon Prime. It's not directly availably through Apple TV. I've read here in reviews that you can view Amazon prime videos through Apple TV by mirroring your iPad, but I haven't been able to make this work. Oddly, I've been able to get the sound, but not the picture. I hear the program, but get a blank screen. Maybe I'm dumb, but Apple prides itself on making easy to use & intuitive devices so dumb guys like me don't have to bat our brains out getting the devices to work. Besides YouTube and the NHL games, there is really nothing available on Apple TV that I want. So I take a star off for that.I'm a long time and loyal Apple user, going back to the days of the Powerbook 160, and I like Apple products, but it's a love-hate relationship. Some things about Apple products bug the hell out of me, and a prime example of this is the Apple TV remote.Apple seems to have a design protocol that states that all their products will have a sleek, minimalistic, zen-like design with no bumps, protruding surfaces, seams, buttons or breaks to distract the eye. They want their products to have a certain \"look\" or, as they might call it \"sensory experience\". This may all look very well in a salesroom display, but we customers have to work and deal with these things, and what looks good doesn't always work good.The new model of the iMac is a perfect example of this. They designed a light, sleek (a real Apple word there) razor thin display unit that almost disappears when you look at it from the side. A wonderful technological accomplishment, but Apple doesn't seem to realize that just because you CAN do something doesn't mean you SHOULD do something. In my work with computers, a DVD-R/optical drive is a necessity. The new iMac, with its sleek chassis, has no room for a DVD-R drive, so if I want to use a DVD-R drive, I have to buy it separately, hook it up to the computer, using up a valuable USB plug, and have it sitting by the computer with cables running all over the desk. Hence we get the sleek, elegant zen design of the iMac with an un-sleek, inelegant dvd-r drive sitting next to it on the desk, with spaghetti like cables running from the drive to the computer. Sort of ruins the sleek, elegant, minimalistic effect, nicht wahr? Dammit, this thing is a DESKTOP computer, not a laptop. It's not something I'm going to carry around in a briefcase. Do I need it to be sleek, razor thin, light, when it's going to be sitting on a desk? The design is eye-catching and you may say, \"wow!\" the first time you see it. The ten thousand times after that, it's just another thing sitting on the desk. Recently when I needed a new desktop computer and discovered all this, it was the closest I've ever come to switching from Apple. I didn't, but I did go out and buy a used, reconditioned 4 year old iMac, which I'm satisfied with.Sorry for wandering off the subject, but I felt a need for an Apple rant. Back to the Apple TV remote. It's another one of those sleek, almost invisible, disappearing designs Apple so loves. But do the Apple designers ever watch TV? Do they ever use a remote control? Do they realize how easy it is to misplace a remote control? Don't they know the frustration of having a remote slip down in the sofa cushions when the user doesn't know it's slipped? Do these people live in the real world, or in a hermetically sealed container constructed completely of sleek, aluminized, elegant zen surfaces colored only in shades of white, black and gray? The Apple TV remote is ridiculously small, ridiculously thin, and just perfect to get lost with the least bit of inattention. It is a thing designed to win design awards, not to be used. So I reduced the rating another star for this.It's a shame, because the Apple TV device is really a nice item. It works well and, as I said, gives a very good picture. But there is a severe lack of interesting viewing content. If that is improved, I will revise this review and bump it up a star. I don't suspect they will ever change the remote device—it goes against their senseless design ethic. Since the remote is such an essential part of this device (it's useless without a remote), and the remote is such an annoying (if elegant) design, this thing will never be a five star item for me.", "verified": true, "helpfulness": "0/0", "author": "R. F. Mojica"}, {"rating": 5.0, "review": "I just recently bought the Apple TV and have used it for Netflix and for streamingof the Winter Olympics events. It works very well so far and I would highly recommend it to others !!", "verified": true, "helpfulness": "1/1", "author": "gunnar"}, {"rating": 5.0, "review": "Came in a box it plugged it and it workedInstructions were there and so was playgirl easy was all I wanted and got ut", "verified": true, "helpfulness": "3/3", "author": "Christopher c Michaels"}, {"rating": 1.0, "review": "I recently purchased this product so I could watch Netflix on my iPad on the big screen while traveling.  Was unable to make the connection at the first hotel I stayed at.  Apple support was very helpful but informed me that the hotel would have to configure their system to accept my specific device on their wi-fi network if I was going to use it...and, by the way, I could only watch my iTunes videos as other video formats (Netflix, Amazon Video) were not compatible with this device.  I immediately returned the device.  There should be some serious WARNING labels on the packaging for this product (won't work in hotels, won't work for most of your video players).  I love Apple technology but this one seems to be far too primitive for the current market.", "verified": false, "helpfulness": "1/3", "author": "Vanessa B. Lund"}, {"rating": 5.0, "review": "Able to watch all kinds of TV, instant access to Netflix, YouTube, Vevo, and so much more. I definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "BlondeAmbition321"}, {"rating": 1.0, "review": "This a wonderful device for people who want to find themselves constantly:- reconnecting to their non-apple wifi,- inputting their credit card numbers over and over again- resetting device for it to function- and generally getting frustrated after a long day because they cannot watch content they paid for.Truly a splendid device for going ballistically mental.simply get a Roku and save your nerves.", "verified": false, "helpfulness": "5/10", "author": "Schizoid"}, {"rating": 5.0, "review": "Bought this as a gift for my folks. They didn't know what this was at first but now are in love with their Apple TV and couldn't live without it!", "verified": true, "helpfulness": "0/0", "author": "Emily A. Weissman"}, {"rating": 5.0, "review": "This is a great way to watch from our iPad. We can mirror to watch what's on our iPad or or use our Amazon Prime to watch movies.", "verified": true, "helpfulness": "0/0", "author": "Jill"}]