[{"rating": 5.0, "review": "this is an excellent compliment to our television purchase.  it allows you to air play directly from your apple devices to the tv.  highly recommended.", "verified": true, "helpfulness": "0/0", "author": "anthony j. sciole"}, {"rating": 5.0, "review": "I just received my Apple TV box and I love it.  I already have an iMac and an iPad, so everything is compatible.  I use it to put anything I find on my iPad up on the big screen.  Last week, I put up a college wrestling meet from the PAC 12 network. The picture was perfect as was the sound.  I found that anything I want to share with someone else in the room is easily readable when put up on the TV.  I can also send my music collection easily out through the TV sound system.  So far, this product everything I hoped it would be and more.", "verified": true, "helpfulness": "1/1", "author": "Jckinyon"}, {"rating": 5.0, "review": "I love this little overpriced gadget. We use it to display on a larger monitor the ForeFlight display from a Redbird FMX through a Bad Elf Cygnus connection.", "verified": true, "helpfulness": "0/0", "author": "David J Silchman"}, {"rating": 5.0, "review": "The quality of picture is so much better on an AppleTV compared to the connection thru my blue ray player.", "verified": true, "helpfulness": "0/0", "author": "Brent"}, {"rating": 5.0, "review": "Bought this for my two son's they both really like this apple tv. They use it everyday. And, have friends over who really enjoy theirs as well. Thank you for a wonderful product.There is nothing bad to say.", "verified": true, "helpfulness": "0/1", "author": "beverly bagwell"}, {"rating": 5.0, "review": "This is great for any Apple user as it provides wireless access to any TV or monitor attached to the Apple TV. I use it to display from my iMac, MAC Air, iPhone and iPad. Plus the content available, both pay as you go or subscription services with my cable provider allows me to watch streaming content through the device.", "verified": true, "helpfulness": "0/0", "author": "Taft D. Navarro \"taft1958\""}, {"rating": 5.0, "review": "We use this daily. It is great for streaming tv shows to our tv since we don't have cable. Love everything about it!Update 6/24/2014We still use this daily. They've added pretty great feature with added apps. We use it often for steaming from my computer. Airplay is definitely useful, but doesn't work with old macbooks. We just started using it to stream games from ESPN and that has been great for us!", "verified": true, "helpfulness": "0/1", "author": "A. Brooks"}, {"rating": 4.0, "review": "I really enjoy using this product.  It has met my expectations and I look forward to further offerings through this device.  I ordered the product on a Sunday and it was in my mailbox before the end of the work week!One thing I did note was that it was impossible to access the micro-USD port after connecting the HDMI cable.  Due to the size of the unit, there doesn't appear to be adequate spacing to be able to utilize both ports.  I do wish there was Bluetooth capabilities which would allow the device to play audio wirelessly through a Bose Soundlink or Big Jambox.", "verified": true, "helpfulness": "1/1", "author": "John Simonds"}, {"rating": 4.0, "review": "Apple means different things to different people.  I personally love apple products, but I don't live completely in the Apple ecosphere, meaning I have a windows laptop and use google for a lot.The major plus of this devise is Airplay!  I have a iPad, and iPhone, and I would say 85% of the time it works perfectly.  There are occasional hiccups getting it on the TV, content will randomly decide not to work on Airplay.  Overall I love this dongle technology stuff!I primarily use it to stream content from a NAS drive I have hooked up to my home network.  Of course the NAS drive has an iOS app which lets me Airplay it to my TV via the Apple TV.  Fantastic!The downside is that it's not an end all solution for television.  I dropped TV service completely so I've tried every other alternative, including watching TV shows through websites.  Netflix and other apps are supported here, but they don't have everything, so beyond that its out of my hands whether or not a website will let me Airplay to the Apple TV.  iPad mirroring is cool, but the aspect ratio is different so streaming full screen video isn't full screen on your TV (I don't like that).However if you're looking for TV solutions consider this: the average TV service is about $50 per month.  On Apple TV you can buy a full season of a TV show for about $30.  So in a year's time, you could own a full season of 20 different shows for the same $600 you would have spent on cable or dish.  I say that plus an antenna is good enough for me.  Of course you have to have good internet to make this work, so factor that in.", "verified": true, "helpfulness": "1/1", "author": "boeser14"}, {"rating": 1.0, "review": "This supposedly new APPLE TV arrived with a persons user name and premium subscription movie service programmed on it that belonged to someone else. Running back and forth to the computer to program it is a hassle too.Dissatisfied in Utah", "verified": true, "helpfulness": "3/7", "author": "monte in utah"}]