[{"rating": 5.0, "review": "Apple works. It also rocks because it is easy to use. This is such a product and I can't believe I took so long deciding.", "verified": true, "helpfulness": "0/0", "author": "Colin Farmer"}, {"rating": 5.0, "review": "I bought this for use in my 4 year old daughters room. This is my 3rd Apple TV. It is an excellent product. With it's built in parental controls and easy of use. My 4 year old can watch all her favorite shows without me worrying about her seeing in appropriate or unauthorized content.", "verified": true, "helpfulness": "0/0", "author": "D. Morgan"}, {"rating": 5.0, "review": "I own both an Apple TV and a Roku 3.  I originally bought the Apple TV but quickly found myself wanting more channels.  As a primarily Apple user, I didn't want to replace the Apple TV because I love the airplay mirroring and streaming from my Mac or iOS devices.  The Apple TV is very fast and responsive, especially compared to the online apps in my Internet capable TV.  So far, I have not encountered any buffering or sync issues with the apple TV.  I originally had it connected with an ethernet cable but after purchasing the Roku, I now run it wireless in the family room.  I keep the Apple TV in the family room so other family members can mirror or stream from their iOS devices.As I mentioned, my only complaint with Apple TV is a lack of channels. The only premium channel available is HBO Go.  However, the only extra premium offered on Roku is Epix.  Also, some of the extra channels are pretty worthless, like SyFy.  Forget full episodes of current and former SyFy faves like Being Human, Helix or Battlestar Galactica.  The SyFy channel on Roku offers nothing more than snippets.  Dozens and dozens of minutes long snippets.  Uh, no thanks.  Apple TV does offer several news, weather, specialty and children's channels (like Disney).  There is no Amazon instant video as offered on Roku.  Movies and television shows that aren't available on any other channels must be purchased through iTunes.  The included remote is small and limited to basic playback functions or text entry using the directional arrows.  A remote app is available for free from iTunes that gives you more flexibility and is much more efficient for certain tasks, especially text entry.  The keyboard in the iOS remote app will make you never again want to use the directional arrows on the bundled remote.  All remotes work through the network, not bluetooth or infrared.  I can actually control the Apple TV in the family room from any other room.  Last week, I was able to display photos from my iPhone two rooms away.  In addition to the iPhone, the app works on iPods and iPads as well.So far, I've had my Apple TV since the end of November.  As of mid-January I have not experienced any major issues with A/V sync or buffering.  It worked flawlessly when I originally had it connected via an ethernet cable.  Once I switched to wifi, I still never encountered any sync issues, however, I'll occasionally get a very quick buffering.  It is infrequent and  doesn't last more than a second or two.  I actually get more buffering delays when watching streaming video wirelessly on much more powerful laptops.If you're trying to decide between Apple TV and Roku, I suggest Roku if you're really into watching online content and want the greatest variety of channels available.  Apple TV currently can't come close to the number of channels offered by Roku.  If you own a Mac or iOS devices and get your content primarily from iTunes or plan to do a lot of streaming /mirroring from your Apple device, Apple TV is a no-brainer.  I actually fall into both categories, so I own both.  With recent sale prices, they were still pretty affordable.", "verified": false, "helpfulness": "2/2", "author": "Troop"}, {"rating": 4.0, "review": "Works well for movies.I do have trouble getting my computer to mirror through Apple TV. Succeeded only once. I had hoped to be able to use it for teaching. Not sure if it's the Apple TV or a problem with my connection.", "verified": true, "helpfulness": "0/0", "author": "L. King"}, {"rating": 5.0, "review": "I purchased this as a Christmas gift for my daughter and she loves it.  It works perfectly with her ipad.  She is able to use it for movies and on-line games.  It was easy to hook up and is everything we expected. It's great to watch video and view photos on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Janet Speciale"}, {"rating": 1.0, "review": "I can not explain this was like the ignored van version of an automotive company which makes sport cars comparison.PROS: It worked... for a monthCONS:Airplay doesn't work no more after SO MANY technical issues and attempts to get it to work. Fully updated and still have problemsIgnored Apple product (Don't buy it)Netflix has problems buffering (I mean it, compared to my ps3 and laptop, netflix loads fine, on atv .. it doesn't wtf)Limited features.I NEVER HAVE RECEIVED A PRODUCT THAT WORKED AND THEN FAILED. This is my first one and probably due to software problems.", "verified": true, "helpfulness": "1/4", "author": "Tech Lover 6969"}, {"rating": 5.0, "review": "The Apple TV was extremely easy to set up (I did it myself).  You do need an HDMI cord to complete the setup.  Excellent deal and great device!", "verified": true, "helpfulness": "0/0", "author": "V. Magness"}, {"rating": 5.0, "review": "I got this for my son for Christmas. He loves it!! It was very easy to set up -- very user friendly!!", "verified": true, "helpfulness": "0/0", "author": "Suzanne Pernell"}, {"rating": 5.0, "review": "This and my iphone 5s are the best purchases I have made in the last 20 years!  I stream all my movies from my computer through it, plays music, streams all my photos on my computer though the screen saver and so much more.  I use it every day and love it.  I had it hooked up to my wifi in 5 minutes.  Ultra user friendly and even my great grandma was able to hook it up no problem.  Love it way more than my Roku since Roku won't stream movies from my hard drive, Roku won't play movies and slide shows directly from my iphone to my 52 inch TV and Roku won't stream photos from my computer hard drive.", "verified": true, "helpfulness": "0/1", "author": "Jessica"}, {"rating": 5.0, "review": "I don't have anything else to compare it to, but this product works great if you're mostly to all-in with apple products.  I just bought my second one.  In sadly typical Apple fashion, however, they should wise up, and increase compatibility across platforms.  My xfinity player won't stream to it, which I find stupid.  If I already pay for the subscription, the device shouldn't be able to decide what I can and can't stream.", "verified": true, "helpfulness": "0/0", "author": "OG \"BDE\""}]