[{"rating": 5.0, "review": "Love the Apple TV! It is a huge entertainment system in a small box.", "verified": true, "helpfulness": "0/0", "author": "Jihan Wilkerson"}, {"rating": 1.0, "review": "This apple tv is a defective model serial number C1MHGRBPDRHNThis is the model that did not have wifi. I am still trying to get it replaced by apple.Case # 695866689.I cannot get it replaced without paying some money for applecare.I know it been almost 2 years.I just arrived back home after a 2 year tour and tried to set it up.It does not work. Please advise on what I should do.", "verified": true, "helpfulness": "0/4", "author": "Gavin"}, {"rating": 5.0, "review": "Awesome!  I can watch anything streaming from my Iphone or Macbook Pro, onto my HDTV.", "verified": true, "helpfulness": "0/0", "author": "Jiffy"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Zulema"}, {"rating": 5.0, "review": "Apple TV is a must for any apple household, even if you are not after using it you may be converted.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 5.0, "review": "We love our apple TV.  We had a problem with the remote not working after about a year.  We used our phones for a while then found a way to reset it and do an update to fix it.", "verified": true, "helpfulness": "0/0", "author": "lovesweetlove04"}, {"rating": 2.0, "review": "This product needs a better method of organizing images in preferred order.  It is impossible to stream images from the hard drive to the TV and have photo presentations.  Making the Apple TV pretty much useless, at least for my purposes.", "verified": true, "helpfulness": "0/1", "author": "Jon Thomas"}, {"rating": 5.0, "review": "The way technology should be: simple and works great.", "verified": true, "helpfulness": "0/0", "author": "DanOR"}, {"rating": 5.0, "review": "I love Apple TV units, have one on every TV for Netflix/Hulu and the other apps. How do people still pay for cable?", "verified": true, "helpfulness": "0/0", "author": "Simpson"}, {"rating": 4.0, "review": "It was good.", "verified": true, "helpfulness": "0/0", "author": "sheri pari"}]