[{"rating": 5.0, "review": "Great would recommend it to anyone bought for a gift and it was well recieved  would order again for sure", "verified": true, "helpfulness": "0/1", "author": "Kory Bawden"}, {"rating": 5.0, "review": "I have a smart TV but I like the apps with Apple TV much better. I especially like to mirror the IPAD on the TV to share things with others in the room or to show pictures, etc.", "verified": true, "helpfulness": "0/0", "author": "Steven Klusman"}, {"rating": 5.0, "review": "If you own Apple products, you need to get this. It has the simplicity, reliability and clean interface of a typical Apple product. I wish I would have gotten this years ago. I read all the reviews particularly the ones comparing them to Roku III. but in retrospect, it was a wasted effort. Apple users prefer intuitive simple to use features with a clean interface. That's what this provides. I'm not a gamer. I'm not someone who can't afford to pay for items and needs to jail break an item to get free apps. I'm too busy to watch or need 1000 apps/stations/channels whatever you want to call it.  Yeah, the Apple TV doesn't have as many apps as the Roku but it has the only apps that you will really need. What you want is what I wanted. You want a device that won't lose connection. You want something that is easy to use. You want a clean interface. You want to be able to import your iTunes so you can play music over your television for when you have guests over or just provide a nice ambience in the home. You want to be able to view your photos and videos on your television.  This product does not deserve less than 5 stars.", "verified": true, "helpfulness": "2/3", "author": "Sam"}, {"rating": 5.0, "review": "This is an awesome and easy to use product. We have Netflix and hardly ever watch regular cable any more. I especially love the 'just for kids' section on Netflix. We now have a huge library of kids movies to choose from. There is tons of other features but that's all we have really used and it has been a great source of entertainment. I ended up buying an extra set of the cables so we can easily move it from the living room to the bed room.", "verified": true, "helpfulness": "0/0", "author": "Sarah Jean"}, {"rating": 2.0, "review": "Everyone is claiming you can get disney junior channel with Apple TV and that was my reason for buying it to find out that the claim is false because in order to get disney channels you local provider( cable, satellite etc.) has to provide a access code to view it and still makes you dependent on having cable no cord cutting and getting rid of cable with this product returned it", "verified": true, "helpfulness": "1/3", "author": "T. Steinman"}, {"rating": 5.0, "review": "This is a must have for football season. We haven't even scratched the surface of what AppleTV is capable of. If you are having doubts, just buy it. You won't regret it.", "verified": true, "helpfulness": "0/0", "author": "nolenurse730"}, {"rating": 1.0, "review": "This is simply a very buggy product. We accidentally hit menu while watching a movie and it was simply gone. So basically the rental was wasted and we lost hours trying to retrieve. This kind of nonsense always happens with our appleTv. Just not worth it. A cord to connect you computer to your tv will be more reliable and more functional.", "verified": false, "helpfulness": "1/8", "author": "Just a guy"}, {"rating": 5.0, "review": "Our son got us interested in purchasing the apple tv.  It is user friendly and we have used it many times.  The cable networks aren't putting out many good movies to choose from so this is an answer to being able to select good movies.  I would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "B. Hettervik"}, {"rating": 4.0, "review": "I received my AppleTV two days ago and I really enjoy using the airplay mirroring feature, but when it comes to home sharing I noticed that when my MacBook Pro was put into sleep mode the Home sharing feature stopped working and I could not continue to watch my movie. It is super nice for showing people pictures and running some ideas across though. I will definitely be keeping it for that feature alone.", "verified": false, "helpfulness": "0/0", "author": "Crzykindluvr"}, {"rating": 4.0, "review": "This is a great streaming device. My only complaints are as follows.1.) It has to use iTunes which is inconsistent and full of bugs.2.) Once you import your media library to iTunes, it is an unorganized mess.Essentially, if you want it for Netflix, ESPN, HBOGo or Hulu, its a great little box.", "verified": true, "helpfulness": "0/1", "author": "TangoTech"}]