[{"rating": 5.0, "review": "A plethora of apps. This is better than a smart TV because there are more apps. Plus you can mirror what's on your iPad on your big screen. It is beyond great!", "verified": true, "helpfulness": "0/0", "author": "LAJay"}, {"rating": 5.0, "review": "Simple to set up, effective and enjoyable to use. And it pays for itself in replacing our bill for cable tv.", "verified": true, "helpfulness": "0/0", "author": "Arlen Bensen"}, {"rating": 5.0, "review": "Instructions easy to follow. It was very easy to get it going, I had no issues. I Love my Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Al Perez"}, {"rating": 4.0, "review": "Love the apple tv, as an apple user this is just great. I only hope it would also have a web browser, safari, so one can surf the web on tv as well, hopefully hey get it integrated some time in the near future.", "verified": true, "helpfulness": "0/0", "author": "Bea \"nerebea\""}, {"rating": 5.0, "review": "Prompt, as Stated, PleasedGood quality.  Good Price, I have bough three of these.It was a real convenience to be able to purchase this item on line.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Dan King \"Dan\""}, {"rating": 4.0, "review": "I bought this Apple TV so that I could watch Chinese tv series from iPad apple apps on the big TV.  Works great.  I even ordered one for my sister and brother-in-law.  The only issue is the picture on the big TV gets a little pixelated when it's enlarged from 9\" to 46\".", "verified": true, "helpfulness": "0/0", "author": "M. Harper"}, {"rating": 5.0, "review": "I received this as a gift and at first thought didn't think I would use it much. On opening the box and setting it up (very easy to set up) this became my primary way of watching shows. I have an older tv that doesn't have netflix or other apps built in. However, t ended up getting rid of my cable because I am able to watch hulu and netflix, and use the Airplay to stream any other shows I have. I think considered getting a Roku as they are reputable as well. However, with me having an iPhone, iPad and MacBook Pro, it's a no brainer of having the Apple TV to work seamlessly with all other Apple products. It excels extremely well at this. Being able to mirror whatever on my iPhone or iPad is one of the best features of the Apple TV. Definitely a great product, very satisfied customer!", "verified": false, "helpfulness": "1/1", "author": "Anson"}, {"rating": 5.0, "review": "I haven't met an apple product I didn't like. This is a seamless product. The only thing to note is that if you want to connect it to your surround sound is that you need and optical cable and input on your stereo or an adapter. Doesn't cost a whole lot to get that set up. But worth mentioning", "verified": true, "helpfulness": "1/1", "author": "Brian & Kim French \"French Family\""}, {"rating": 5.0, "review": "I hadn't been able to get one of these to work in hotels before, but now that I have a hotspot through my 4G LTE phone (with unlimited data), I can use this just like I do at home.  Great to have the options to watch Netflix, MLB.TV, HBO-Go, ESPN WatchNow, etc. when I'm away from home.", "verified": true, "helpfulness": "1/1", "author": "T. Johnston \"tej2\""}, {"rating": 5.0, "review": "We have one at my house, love it, so I bought one for my parents for xmas.  Came quickly, def original product, no complaints, and they love staying in to watch movies.  Super easy to install and use!  Does require wi-fi, iTunes account", "verified": true, "helpfulness": "0/0", "author": "ASHLEY ELSEBOUGH"}]