[{"rating": 4.0, "review": "Love this product EXCEPT I do not love that Amazon cannot be received through it!  The best feature is the cloud feature from the home computer, and also the You Tube feature is fun.  Great value!", "verified": true, "helpfulness": "0/0", "author": "Organized Mom!"}, {"rating": 4.0, "review": "I love it when it works right! I have to reset it quit a bit, and sometimes the streaming is slow to catch up. However, that could be the internet connection. But a good little device to have for playing my iTunes movies!", "verified": true, "helpfulness": "0/0", "author": "Momof6"}, {"rating": 5.0, "review": "Great product. I have it in my bedroom so I can stream Netflix, Hulu, etc. Just waiting for Apple to finally put Amazon streaming on the device so I don't have to use my iPhone/iPad.", "verified": true, "helpfulness": "0/0", "author": "Jessica C."}, {"rating": 5.0, "review": "Performs as one would expect from an Apple product. Easy hookup out of box and very easy set-up. No HDMI cable included, so make sure you have one.", "verified": true, "helpfulness": "0/0", "author": "faddygk81"}, {"rating": 1.0, "review": "It worked great for about one month, now it is giving me problems all the time, it constanly giving me a message \"an error accured loading this content\". I have to unplug it a few times and it might work eventually. I have ROKU in the bedroom and it always works great. I am wondering if I got a defective product.", "verified": true, "helpfulness": "0/7", "author": "Estella Ilesanmi"}, {"rating": 5.0, "review": "I use this on a daily basis. it's everything i need to stream videos, and music to my tv! Love it", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "If you have a Mac, iphone or just like there products you will love this! It makes sharing great fun and easy between divides.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "It is Apple; so it works and is simple. The remote is the best part of this; great design; Apple", "verified": true, "helpfulness": "0/0", "author": "Greg Dencker"}, {"rating": 5.0, "review": "This little device is amazing. Now I enjoy my favorite music, videos, movies and more!  All of this while I peruse some of my favorite pictures,.", "verified": true, "helpfulness": "0/0", "author": "W. Steve Tolen"}, {"rating": 5.0, "review": "Love the Apple TV! One of the best purchases I've made from Apple! Love watching Netflix and my iTunes content on it! Apple continues to release more apps!", "verified": true, "helpfulness": "1/1", "author": "Troy T DeLorenzo"}]