[{"rating": 5.0, "review": "Thanks you.", "verified": true, "helpfulness": "0/1", "author": "MurthyC"}, {"rating": 5.0, "review": "Great item.  Lots of options, and content is being added all the time.", "verified": false, "helpfulness": "0/0", "author": "Jonathan Hoffman"}, {"rating": 5.0, "review": ":)", "verified": true, "helpfulness": "0/2", "author": "Wayne Doganieri"}, {"rating": 5.0, "review": "The Apple TV is the best smart TV platform I have used.  It has all the channels I use and then some.  Very elegant  design and simple to use interface.", "verified": true, "helpfulness": "0/0", "author": "Ronald T. Roseborough \"Ronrose\""}, {"rating": 5.0, "review": "Easy and intuitive to use. I bought this for my wife so she could stream music while at home to our stereo. It has a ton of watching options out there for it. The mirroring from your iPhone is nice too. To me its a bit more user friendly then the Chromecast (I have both) but that definitely comes at a premium. The nice thing about it, like all apple products is that it just works.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Absolutely marvelous. The best set top box you can buy. I have owned others, and used the included smart features on gaming consoles and TV's, the Apple TV is simply the most refined. The UI stays consistent throughout every application. This is the only unit I have used that prompts if you want to resume watching or start from the beginning, great when you share accounts for Netflix, Hulu, and HBO Go. Airplay is the real winner here though. Anything you find on your iphone or ipad can be played on your TV without a hitch with one button press. Airplay also lets you play whatever mp4 or x264 encoded file you might have on your computer through iTunes straight to the Apple TV. It will play a 1080 x264 you get from torrents without any hiccups.", "verified": true, "helpfulness": "0/0", "author": "Javier"}, {"rating": 5.0, "review": "Love it!", "verified": false, "helpfulness": "0/0", "author": "JThomas"}, {"rating": 5.0, "review": "kids room is much better now", "verified": false, "helpfulness": "0/0", "author": "Me"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "a a r a m \"a a r a m\""}, {"rating": 5.0, "review": "Apple TV is great! I have had this for over a year now and it is great! I have enjoyed using this product over the years.It does have some glitches in it though. Still is a great product!", "verified": false, "helpfulness": "0/0", "author": "R. Young"}]