[{"rating": 5.0, "review": "I love this easy to assemble technology.  I use it for Netflix currently and it is fabulous!!! Looking forward to learning more of its functions.....", "verified": true, "helpfulness": "0/0", "author": "a13bro"}, {"rating": 5.0, "review": "This is the second Apple TV I've purchased. My daughter \"borrowed\" mine so I bought another. might just buy one more for another room!", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "Love Apple TV. So glad I bought it. It lets me watch everything I want to on one easy device. I am also considering buying another one", "verified": true, "helpfulness": "0/0", "author": "Gina Ruiz"}, {"rating": 5.0, "review": "I absolutely LOVE my Apple TV.  Makes it super simple for Airplay from my Ipad and Iphone.  Love the access to NefFlix and Crackle.  Super easy to set up. No technical skills required.  Worth the money.", "verified": true, "helpfulness": "0/0", "author": "Laura Early"}, {"rating": 5.0, "review": "Works great for me as I have a large iTunes library.  A must for easy acces to your library! I definitely recommend it!", "verified": true, "helpfulness": "0/0", "author": "Juan Cruz \"SHIBVMI\""}, {"rating": 5.0, "review": "Works great! Easy to set up, use and worth the money. Would highly recommend for anyone that has Apple products.", "verified": true, "helpfulness": "0/0", "author": "Ellie Lombardi"}, {"rating": 5.0, "review": "How did i survive without this for so long???  My nephew talked me into it and it's the best 90.00 I have ever spent!", "verified": true, "helpfulness": "0/0", "author": "Simonette \"S. Pellegrino\""}, {"rating": 4.0, "review": "Works great to stream movie to TV but only compatible with Apple products. That's ok for me that's all I have.", "verified": true, "helpfulness": "0/0", "author": "Debra Longtin"}, {"rating": 4.0, "review": "I was really worried when the item arrived any the box looked as if it had been through fight. But when I opened it it was in good condition, minus the dust.  The only reason I didn't give this item a higher rating is due to the remote battery was dead and I had to purchase a new battery immediately to complete the setup.", "verified": true, "helpfulness": "0/0", "author": "Jamillah Alexander"}, {"rating": 5.0, "review": "While I still have some options to set up I find this to be a great addition on our entertainment system.", "verified": true, "helpfulness": "0/1", "author": "Marilyn"}]