[{"rating": 5.0, "review": "Ok, so I bought a Roku.... I took it back after 4 days because the remote constantly. The Apple tv works flawlessly and the setup time is literally 3 minutes! Easy to navigate through the channels, and the best thing is if you have an IPhone, Wifi Itouch or IPad, you can mirror the device straight to the tv. Best $99 I've ever spent! I cancelled $100/month cable bill by the way.", "verified": false, "helpfulness": "0/1", "author": "Ronald D. Bruner Jr. \"Ronnie Bruner\""}, {"rating": 5.0, "review": "This device has proved invaluable to my streaming arsenal & provides plenty of content via the ever so useful \"AirPlay\" feature. The Netflix interface could use a bit of a facelift however it is still useable. Overall a good value for the price, more than worth it. Definitely recommend to those that own an iPod Touch, iPhone (4 & above), iPad (2 & above), Macbook Pro (2011 or above) &/or a combination of any of these devices.For those running Macbook Pros older than 2011 could use a program known as \"Airparrot\" to airplay to your big screen via Apple TV as opposed to using Mountain Lion's 10.8 native airplay feature since it will not run on the older hardware.\"Airparrot\" performance will tax your CPU and not be as eloquent Mountain Lion's native airplay, however it will get the job done albeit a bit choppy.", "verified": true, "helpfulness": "1/1", "author": "Retrostarscream"}, {"rating": 3.0, "review": "To start with the good, Apple TV simply fascinates me about the technology.- Seamlessly playing music, videos from my Macbook, iPhone- The First time setup was simple and effortless- Can easily watch Netflix, Youtube, Photo Stream, iTunes movies etc- Very compact and sleek with unmatched packaging skills as ever (for any Apple product)My frustrations are- Sometimes my Macbook and iPhone doesnt recognize the presence of the Apple TV. I have to reboot the Apple TV so that it gets listed in the list of devices for Air Play. This has happened to me 5 to 6 times in the past 1 month.- A single remote works for both my Macbook and Apple TV. If i operate the remote for Apple TV, the iTunes in my Macbook also responds simulataneously to that remote control clicks.- There was once when i tried to set up my wife's ID as well in the Apple TV after restoring to the factory settings. But this restoration did not help but this crashed my wireless router's security and the router went down. I reconfigured the AppleTV again to my apple ID to restore the wifi router back to normal. So, some function in the \"Restore to factory settings\" is incorrect for the AppleTV.- The AppleTV key board on the screen is hard to use (i felt a PS3 keyboard was even easier to use on the TV screen than the Apple TV keyboard)", "verified": true, "helpfulness": "1/2", "author": "Varun"}, {"rating": 5.0, "review": "Perfect for the toddler in the house.  Gone are the days of scratched or missing media.  We just purchase the movies in the cloud and watch.", "verified": false, "helpfulness": "0/0", "author": "E. Jones"}, {"rating": 5.0, "review": "Another great Apple Product. Would be a six star if Apple and Disney would develop the WatchESPN app for the Apple TV", "verified": true, "helpfulness": "0/2", "author": "macattack71189"}, {"rating": 4.0, "review": "I have just started to use the devise.I like to come back after a month's time wit a more realistc opinion.Thanks", "verified": true, "helpfulness": "0/2", "author": "Roberto Esquivel"}, {"rating": 4.0, "review": "The 1080P HD Apple TV is truly a great product. I have had it for around a month now and have only one complaint. Ive bought two different movies in 1080P HD and I feel like they are not at this definition. Some parts seem pixelated and I have a great HDTV and have streamed 1080P movies from VUDU and they are at Blu-Ray quality.Netflix, Hulu look great though and it's super fast! The only other app I've used besides those is YouTube.Great Product overall!", "verified": true, "helpfulness": "0/1", "author": "Tdk"}, {"rating": 5.0, "review": "I bought this Apple TV for one reason only, the AirPlay with my MacBook Pro.  It is A M A Z I N G.  One of the best purchased I have ever made.  I am currently streaming my mac through wifi at 1080p resolutions to my tv and am able to watch all the movies.  I was able to stream before with other products/software but with none I was able to stream the subtitles which was something I needed badly.  It has been ideal for me to stream music when I have people gathered in my house.I bought it as soon as it was announced, even months before Mountain Lion was released.  During this time I had enough time to poke around with the Apple TV.  All the channels (netflix, mlb.tv, etc)  available work great.  More channels will be added soon Ive heard.As of today I know of no software to jailbreak it which is a bummer.", "verified": false, "helpfulness": "0/0", "author": "Freddy Montas"}, {"rating": 5.0, "review": "I am not an Apple fan boy because I am a PC guy inside. But I do have iPhone, iPad, iPod and Airport Extreme because all of them are of the best quality comparing to other competitors. Now I got an Apple TV hooked to my new TV. It connects my PC, iPhone and iPad wirelessly. I am not going to describe Apple TV's main feature as you can easily find them on various reviews over the internet.What I do want to recommend to you is the AirPlay feature. For all that come from abroad, it was a pain to search for TV programs in your native language. Several Chinese TV program streaming Apps came to iOS last year and I always use my 9.7' iPad for TV programs. Now with AirPlay, I can easily stream them to my 47' TV and it feels just like I am a living room in China! It just works!", "verified": true, "helpfulness": "0/1", "author": "Zhe Liu"}, {"rating": 5.0, "review": "This little box is great. I bought it on impulse without much research and it does everything I wanted and more. I just set itunes to load minimized during startup on our htpc upstairs in our living room and have this box in the basement family room. It allows me to watch any movies from our htpc library, listen to music files, view all of our photos and stream netflix. It will stream even more stuff but nothing else that I use. It streams blueray content without a hiccup over our n wifi. Well worth the price compared to a roku which we had because it does so much more. May not be great if you don't have a computer with a lot of files you want to be able to view in another room but for us its perfect.", "verified": false, "helpfulness": "0/0", "author": "DMS1960"}]