[{"rating": 5.0, "review": "Very usefull if you like to watch movies and shows.We reduced our cable tv contract, and now we buy from iTunes only new movies.Be sure that you have a good wi-fi connection.", "verified": true, "helpfulness": "0/0", "author": "Daniel Xavier"}, {"rating": 5.0, "review": "I like all the options that this new Apple tv has. The resolution is amazing!I like all the channels/programming that come with it.Recommend it!!", "verified": true, "helpfulness": "0/0", "author": "R. Doellefeld"}, {"rating": 5.0, "review": "I have two apple TVs now - one in my bedroom, one in the family room.What I like about the apple tv is that it's easy to use, like apple products in general. The user interface is easy - anyone can use it. Actually my 75+ year old father in law recently got one, and it's a breeze for him to use. Along with the remote control included with it, navigation of menus is really easy and apple-like. There's also an iphone/ipad app that you can use to control the apple TV, helpful if you lose the apple tv remote (the remote is rather small). The remote has 3 buttons - play/pause, menu, and a button for right/left/up/down/select. It's well made.I use it for netflix. We have netflix built into our TVs. But the user interface for netflix on the apple tv is slicker and easier to use than that on our TVs.The Apple TV has limited channels - not like the hundreds of channels offered on the Roku. I've never tried the Roku, but channel selection would be a good selling point for the roku. But the apple TV integrates very nicely with other apple products. You can use the apple TV to use airplay with your iphone, ipad, mac computer, apple airport express base station. You could use it to listen to music coming from one apple TV but piped into a tv hooked up with another apple TV. I use it to wireless transmit streaming movies and TV from my ipad to my screen via the apple tv. The only problem is that when doing this, the screen size doesn't take up the entire size of the screen.", "verified": true, "helpfulness": "0/0", "author": "Jon E."}, {"rating": 5.0, "review": "I love it, it is so simple to use. I bought one for the house as I am thinking about reducing my cable subscription. I then bought another one for my condo in Mexico since I miss a lot of TV shows down there and it worked great. We also listen to our music through the Apple TV, able to look at our vacation pics on the big screen TV. I think I might be addicted to it.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "Apple TV, another quality product if you are in the apple ecosystem this is a must have. Only thing I will say is if you get a \"smart TV\" the value of this device diminishes slightly... for things like NetFlix or YouTube videos for example", "verified": true, "helpfulness": "0/0", "author": "gendroni"}, {"rating": 5.0, "review": "Apple TV is absolutely essential for any home with internet and apple products. I am already planning to order another one soon!", "verified": true, "helpfulness": "0/0", "author": "omar minhas"}, {"rating": 5.0, "review": "I was so impressed with the first Apple TV device that I  decided I was going to buy a second one for my room. It works with all my other Apple products.", "verified": true, "helpfulness": "0/0", "author": "svhecjb \"svhecjb\""}, {"rating": 5.0, "review": "There are so many great features, I'll try to highlight the ones that are most important:When plugged into the HDMI port of your television, you will have to switch the input to HDMI. Once that is done the startup screen will show up. It will want to link to your home wi-fi network so choose that network and use the enclosed Apple TV Remote to enter the password for the network (if you have a password on your network-if you don't, you REALLY should).APPLE MAGIC: Once you have linked the Apple TV to your Wi-Fi network, and if you have a newer version of your iPhone or iPad, make sure that this device (iPad or iPhone) has Bluetooth enabled (check Settings)  and is on the same network as your Apple TV. Then tap (yes, physically tap) the iPhone or iPad on the Apple TV (just a tap, you're not trying to break it) and the iPhone or iPad will link to the Apple TV which will make setup very very easy because you will be able to use the keyboard on your iDevice rather than the Apple TV Remote. BE ADVISED: this doesn't always work so if it doesn't you will have to complete the setup using the Apple TV Remote. If you have an under 25 child in the house who texts regularly, let them use the Apple TV remote to finish the rest of setup; it's so much easier for them!).Once you have the setup completed, use the Apple TV Remote to select options for you.EASIER: If you have a later iPhone or iPad, go to the App Store and download Remote (it's free). This will allow you to link with your Apple TV and not use the Apple TV Remote, which is a good thing.What fun things can it do?If you have a later model iPhone or iPad, you can project the image on your device directly on your television.If you have iOS 6; Click your home button twice and then slide the apps button to the right until you see a small square with a filled triangle on the bottom half. This is the AirPlay button. Tap it and choose the Apple TV as the source. Then slide the \"Mirroring\" slider to the on position. Within a few seconds your device's screen will show up on your television screen.If you have iOS 7: Slide the controls panel up from the bottom of your home screen. The AirPlay button is labeled. Tap it and choose the Apple TV as the source. Then slide the \"Mirroring\" slider to the on position. Within a few seconds your device's screen will show up on your television screen.You can watch Netflix, YouTube, Sports, you can stream any media that you have purchased from Apple including Music, TV, Movies, etc.You will find that the Apple TV is a welcome addition to your technology. Even if it's the only Apple device you have.", "verified": true, "helpfulness": "2/2", "author": "R. Rasmussen"}, {"rating": 5.0, "review": "Works great.Very pleased with my purchase.I can now view my I-Phone pictures and videos on my big screen television. Also great for U-Tube.", "verified": true, "helpfulness": "0/0", "author": "Tilly Jones \"Tilly\""}, {"rating": 5.0, "review": "It's funny because I wasn't sure if I was going to like it or use it but i have to say: \"You don't you know you need it but you DO!\"", "verified": true, "helpfulness": "0/0", "author": "Alvaro  Martinez"}]