[{"rating": 5.0, "review": "Constantly finding more uses for it as apple \"tweaks\" the Apple TVs functionality.  Bought this version for a HDTV and shunted an earlier Apple TV version to an analogue TV to  give the TV a longer \"functional life\"  (using a Sabrent HDMI to Composite/S-Video Converter 3RCA DA-HDRC to connect the HDMI from the apple TV).", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"cube\""}, {"rating": 4.0, "review": "Not an ideal product, but indispensable. I have four of these and they are nice. It can be buggy though and it's not perfect.", "verified": true, "helpfulness": "0/2", "author": "Chad M. Sorenson"}, {"rating": 5.0, "review": "It makes every TV a SMART TV and it is helping me to cut the cable cord.  I will not miss paying Comcast the cost of this unit every month.  It works so well I bought a second one for the bedroom. Now if it only worked with Prime.  Good thing my Panasonic TV does that already.", "verified": true, "helpfulness": "2/2", "author": "Denver37"}, {"rating": 4.0, "review": "When I first got it, I immediately ran into the HDCP required for playback error. I managed to get around this by doing the (what should be unnecessary) song and dance of unplugging and turning things off and on, and it worked for a while. I then made the mistake of updating the software. Now, all I get is the HDCP error. So I put it aside for a bit, and recently bought a brand new plasma tv. Boom, same HDCP error. If you're looking to watch netflix, I'd much rather recommend a hdmi cord and connect your laptop to it. Apple clearly doesn't care about quality anymore, or even delivering a product that actually works.EDIT: 1/9/2014 Oddly enough, the fix for this was getting a new hdmi cord. This is strange, seeing as the original cord works for everything else, but at least it works now. Love my Apple TV, but it does make you jump through hoops to get it to work. For example, the audio often gets out of sync with the video, and the only fix is to restart the unit. I probably have to do this every other day. Still, I'm very happy with it, and have changed my rating from one to four stars.", "verified": false, "helpfulness": "5/11", "author": "Kyle Damken"}, {"rating": 5.0, "review": "There's no better experience out there in streaming devices.  You'll be happy with this, especially if you own Apple products. Decent price with the benefit of Apple's ecosystem, too, at $89 from Amazon. At this seller's price, the remote must be plated with 24k.", "verified": false, "helpfulness": "8/25", "author": "Eric"}, {"rating": 5.0, "review": "Dude, Apple TV supplements where you do not want to buy a Smart TV.  It is equally as good as the SamSung Smart TV with limitations of watching only shows you re-format to fit into your iTunes.  That's not hard to do for Mac geek users though.If you don't want to buy a new SmartTV - add this to your existing TV - and you will love it, since it has Amazon Prime Streaming, NetFlix, Vudu and other great integrations.", "verified": true, "helpfulness": "1/2", "author": "James Talkington"}, {"rating": 5.0, "review": "I purchased my Apple TV a few years ago and it was so simple to active that I have purchased others. The Apple TV walks you through the setup and is very simple. It also connects to my WiFi from long distances (I guess if you have a good wifi). Enjoy this item.", "verified": true, "helpfulness": "1/1", "author": "n.e."}, {"rating": 1.0, "review": "Totally fraudulent product. This should not be listed at such a high price. You shouldn't pay more than $99 for an AppleTV.", "verified": false, "helpfulness": "81/124", "author": "Nathan D Gunn"}, {"rating": 5.0, "review": "The AppleTV always impresses me. It's amazing how you can watch something on your computer A button and then watch it on the television the children love it.", "verified": true, "helpfulness": "2/2", "author": "GoodVibrations"}, {"rating": 5.0, "review": "Great way to access a ton of content... It's super cheap, and you have easy access to Netflix, Youtube, and other content that you can rent or buy from Apple.  It's a no brainer, and also a good step in the effort to get rid of cable.", "verified": true, "helpfulness": "2/2", "author": "T. Parry \"World Traveler\""}]