[{"rating": 5.0, "review": "So I've had problems streaming from my iMac to my PS3. File sizes are getting just too big to play well with my wireless network, or so it seemed. I'm sure that if I were to play around with enough settings and priorities I could get it to work just fine. Purchasing the Apple Tv 3rd gen was just a much more simple and elegant solution. Youtube play much quicker. Streaming from iTunes is painless.The only complaint I could think of is the removal of the hard drive after the 1st gen Tvs but I knew about that all along so there isn't much room to stand on that one. It has no issues pushing 1080p videos that were struggling to be streamed otherwise. I also really appreciate the extremely low power consumption. Saving cash is always a good feature.", "verified": true, "helpfulness": "1/2", "author": "theWeasel0"}, {"rating": 5.0, "review": "Installation was very easy.  Plugged it into my tv hdmi port. Powered it up and up it came once I changed the input to the hdmi port.One thing I wish they would do for this is to allow a wireless keyboard interface or a smart phone keyboard interface.  It is slow to do a search and input the name/title/etc using the scroll and click method. I guess if you do it often enough it will get easier or faster.", "verified": true, "helpfulness": "2/2", "author": "LocalBoy"}, {"rating": 5.0, "review": "THIS ITEM IS GREAT FOR WATCHING VIDEOS FROM YOUR MOBILE UNITS.  I'M STILL PLAYING AROUND WITH IT AND STILL FUN.", "verified": true, "helpfulness": "1/2", "author": "FER"}, {"rating": 5.0, "review": "great price, great product, prompt delivery.This version is more versatile than older modelEasy introductions, set up a breeze. Quality product", "verified": true, "helpfulness": "1/2", "author": "Robyn Carpenter"}, {"rating": 5.0, "review": "This product is amazing! you can rent movies, listen to music, watch photos and movies from your iPhone, iPad, Mac, and PC directly in your TV! I'm very happy with this Apple TV. You can even mirror your Mac computer in the TV without any cables", "verified": true, "helpfulness": "2/2", "author": "Erik Mendez Chacon"}, {"rating": 5.0, "review": "I wish they would drop the No Amazon Video bit, but obviously I understand why they don't have it.  It's not a big deal though, because with airplay and any of my devices I can stream amazon anyway.  Win.  Very quick...way better than navigating smart tv online menus.  I like using airplay to mirror my sweet lappy to do work on my HD TV.  Listening to podcasts and any of my synced iTunes media on any registered devices is super nice too.  It is awesome having everything work together the way I want.", "verified": true, "helpfulness": "1/2", "author": "Jason Taix"}, {"rating": 5.0, "review": "This is an awesome piece if you have apple products. I purchased this so my daughter could play her learning games on our ipad through our TV. It works wonders when they are trying to learn there ABC's etc. I also use this for netflix and hulu even though i have a smart tv the apple apps seem to work better and stream at a better quality. I would highly recommend this to anyone with kids or those who have apple products.", "verified": true, "helpfulness": "2/3", "author": "Anthony B."}, {"rating": 5.0, "review": "This is a awesome product. Works with any tv and watching movies on netflix. And rest of the streaming is great", "verified": true, "helpfulness": "1/2", "author": "warin"}, {"rating": 3.0, "review": "I don't want to take away from what all this thing can do. It is kinda cool but still different from what I was looking for. I was expecting to be able to display whatever I was viewing on my iPad on my TV. That is not the case. There are a few apps that can be displayed, otherwise the Apple TV has its own apps that you can purchase things on to view. Or if you have stuff you have already purchased on your iPad you can view that on your TV. But it does not have the ability to act as a monitor for your iPad as I had thought. Still cool enough to keep I guess as I'm sure I will learn new things that I can do with it, but overall I wish Apple would just figure out a way for me to display everything from my iPad and not just select items.", "verified": true, "helpfulness": "1/2", "author": "Jeremy Arrington"}, {"rating": 4.0, "review": "Great product, but it can be difficult/trying at times to connect it to your iphone via Airplay.  YOu have to always turn off airplay, then turn it back on again on the apple tv", "verified": true, "helpfulness": "1/1", "author": "Robert P De Lara"}]