[{"rating": 3.0, "review": "This is not as polished as their phones, tablets, and computers, but it is okay.  Obviously no Android phone-based remote control, but Apple people could care less about that anyway.  I like that it doesn't ask for a credit card.", "verified": true, "helpfulness": "0/1", "author": "Bob"}, {"rating": 5.0, "review": "This is a great product and everything was as the ad promised.Thanks for a good product and fast shipment.", "verified": true, "helpfulness": "0/0", "author": "mcole"}, {"rating": 5.0, "review": "Love this. I stream hulu and most of the main channels from Apple TV.  The the fact I can stream music, videos, etc from iCloud/iTunes.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey E. Ivey"}, {"rating": 5.0, "review": "I bought this to replace my faulty Apple TV version 1. It is a definite improvement in all functions. It is smaller, uses less power, and has an auto-off function that I don't think version 1 had The programming options are many, although similar to all the other boxes out there. It hooks up seamlessly to my network and is a no-brainer if you have an iPad or iPhone, because with Airdrop you can stream easily from either device to the set.", "verified": true, "helpfulness": "1/1", "author": "ral1375"}, {"rating": 5.0, "review": "Great service. My son had me order it, because he had one and liked it. It works  for me also.", "verified": true, "helpfulness": "0/0", "author": "brenda"}, {"rating": 5.0, "review": "My Daughter loved it she now is able to watch TV shows in her room she could not watch before!", "verified": true, "helpfulness": "0/0", "author": "Tracy Neri"}, {"rating": 5.0, "review": "I was having major streaming problems with Netflix and thought they were the problem. After a lot of research I realized my Sony Bluray Player might be the problem. Read up on Apple TV and decided to give it a shot. Score! This is so much better video quality and streaming issue is gone. Best $100 I've spent. It was so easy to set up. I highly recommend,", "verified": false, "helpfulness": "0/0", "author": "Phil \"ly\" \"Phil\""}, {"rating": 5.0, "review": "Bought this for my daughter and her hubbie for Xmas. They are both apple computer everything in their home. Phones, computers, laptops, iPads, you name it it's an apple product. They love this Apple TV MD 199LL/A. As soon as they got home to their house they had it set up. They use it all the time and love it. They are both artists, graphic designers and teachers. They have made me an apple user now and I  love them.", "verified": true, "helpfulness": "0/0", "author": "Joanne Boenig"}, {"rating": 5.0, "review": "I wanted to be able to sit in my easy chair with my iPad and select movies and play them on the TV without having to get up. Well after reading reviews that this baby could NOT stream amazon prime free movies I was ready to box it up for return.  I kept digging  and after a few hours discovered that there was a new app that would allow this very feature through airplay.  It got terrible reviews but I installed it anyway.  The app has worked perfectly for me. Also, after seeing this in action my daughter got an Apple TV also and the app works perfectly for her.  She loves the music too.Go to App Store and search for \"amazon instant video\".", "verified": true, "helpfulness": "0/0", "author": "M. Thompson \"Dyson Diva\""}, {"rating": 5.0, "review": "If your an iPhone / iPad user Apple TV is a must. On one hand Apple does isolate their products but on the other, they provide components like Apple TV that allow intervention of music, photos and videos to be shared with some of the most user friendly software and components on the market.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]