[{"rating": 5.0, "review": "I recently bought an Ipad and Iphone and now I'm addicted to everything \"Apple\". Apple TV is amazing in the fact that you can spend hours and hours watching youtube videos and can see your own stored movies and videos from iPad, iPhone, or regular computer. It still lacks Pandora or the potential to add new channels like Roku does (I only bought this one to watch youtube videos, otherwise Roku is way better than this).", "verified": true, "helpfulness": "0/0", "author": "Jorge Philly \"Jorge\""}, {"rating": 5.0, "review": "I have had the Apple TV for about a month now and absolutely love it. It works seamlessly with our iPhones and iPads through the airplay functionality and I love that it streams any purchases from the Cloud rather than taking up memory on the devices.It is a must own if you have apple tablets/phones.", "verified": true, "helpfulness": "1/1", "author": "Edward Welsh"}, {"rating": 5.0, "review": "great product so much fun. easy to set up and great price keep up the good work 5stars A++++ and fast shipping", "verified": false, "helpfulness": "0/0", "author": "Tanya"}, {"rating": 5.0, "review": "Apple TV is a fantastic product allowing users to view new content through multiple services. Netflix, Hulu, iTunes and more are all available through Apple TV. The remote is thin and streamlined for easy use and the unit has Wi-Fi and the option to be wired. It is small and unobtrusive. For the features, the unit is also priced well. I have three of these units throughout my home and all of them work well and function with my iPad, iPhone and Mac. Reduce the cable package, save some money, and buy an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "PL"}, {"rating": 3.0, "review": "Until recently I used Logitech Revue, and was very satisfied with it. Recently it began glitching, and crashing which caused me to switch to the new Apple TV.I have a Macbook (and 'of course' an iPhone), so I thought to also give the tv a try since I greatly enjoy my other Apple products. Sadly, my finding were not what I expected...Though the Revue was one of the first Android TVs it contained a large number of apps, an app store, and a browser. While with Apple there is only a limited number of apps available, and no app store*. I assume it is because they would like users to purchase the shows via iTunes instead of 'renting' them. However, they have Hulu and Netflix installed which makes me wonder why apps like HBO-GO, or SHOWTIME ON DEMAND, are not available. As for the browser, when I had Revue I found it great, because it allowed me to watch shows (like HBO GO), or read check a social network site when the application was not available. Revue, honestly made it feel like there is a computer connected to my TV, while apple feels like I have a bunch of apps (which are standard on all blu-rays) extending the capabilities of my TV.The one good thing about Apple TV, which Revue lacked, was that it is very organized. The small number of apps makes it very clear where you are and what is available to you.*No app store means: limited number of apps online, and no games on your box (something I think apple would have profited from)", "verified": false, "helpfulness": "0/0", "author": "Moshe Shadmon"}, {"rating": 5.0, "review": "We use it for Netflix, streaming on our iPads, sharing family photos and music. I need to get a second one for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Alicia"}, {"rating": 4.0, "review": "Set up is easy.  Makes my Net Flix render very nice and fast with great audio compared to my smart tv.  Was disappointed with available apps.  If I were not an Apple person would definitely go for Roku 3 instead.  May anyway if Apple TV requires jailbreaking to add content.  Love how it mirrors in my laptop or iphone or ipad so easily.  Starting to get a little weary with Apple's revenue ideas by limiting content to PAY only.", "verified": true, "helpfulness": "0/0", "author": "RayC"}, {"rating": 5.0, "review": "Fantastic product. Some small issues with wireless connection to iTunes at times but overall great. I recommend this item to anyone.", "verified": true, "helpfulness": "0/0", "author": "B. Cochell"}, {"rating": 5.0, "review": "Great product.  Will use in our locker room for the girls since we don't have cable and will just use the internet.", "verified": true, "helpfulness": "0/0", "author": "Moe"}, {"rating": 4.0, "review": "My second Apple TV. Perfect for me to have access to my music and be able to AirPlay my Macbook Air and iPhone to the TV's.", "verified": false, "helpfulness": "0/0", "author": "Thunder"}]