[{"rating": 5.0, "review": "The Apple TV was very easy to install and use.  I am very impressed with it.  We use Apple videos, Netflix, and view Apple pictures and videos.  We especially like the ability to display iPad screen and music on the big screen HD-TV and sound system.  Our iPhone 4s also work well with the Apple TV.  Great product!  I programmed the Harmony remote to control the Apple TV with the HD-TV, receiver and speakers system.  Wow!", "verified": true, "helpfulness": "0/1", "author": "David Wheat"}, {"rating": 5.0, "review": "Easy installation and love playing games on HDTV with the mirroring feature.Originally, I hesitated in buying Apple TV, but I love the fact that you could play games from my iphone and airplay it on the HDTV.  It is wonderful.  The set up it very easy.If you are undecided, please try it, you will love it.", "verified": true, "helpfulness": "0/1", "author": "Viking"}, {"rating": 5.0, "review": "Was skeptical about buying Apple TV, as I just didn't know what it would do for me. After a few weeks of owning it, I can say it's one of my favorite things in my family room. From the ability to play music from my phone/ipad through my stereo system with a simple touch of a button, to streaming video from the system itself, and the option of playing videos through airplay from my ipad, it is used all the time. Best 115$ I've spent in a while (HDMI/Optical Cable).", "verified": false, "helpfulness": "0/1", "author": "Alex"}, {"rating": 4.0, "review": "I have an original Apple TV.  While I enjoyed it, it always seemed like a half-finished concept.  Only by hacking it and extending the functionality was I able to make a truly useful device out of it. Even then, it would choke on even 720p video if it wasn't encoded just right.The new Apple TV is not only much cheaper, it's better all around.  It's got a lot more features, Netflix streaming, 1080p video (welcome to the new millenium, Apple!), and much more.  The airplay is especially worth it to me.  Being able to stream audio from just about anywhere and sometimes even video was easily worth the price of admission.My only complaint is that they got rid of the USB port on the back and no one's come up with a hack for it yet.  I got a little too used to using my \"extended\" Apple TV and I want some of that functionality back.", "verified": false, "helpfulness": "0/0", "author": "K. McCauley \"Thir13en\""}, {"rating": 5.0, "review": "I have a lot of movies on our family's Apple devices.  Being able to simply \"flick\" them to my tv is amazing!  I own last year's version and in one year I have never had a problem.  In fact it only gets better.  During parties I play all of my playlists while at the same time showing slideshows of my favorite photos, we are able to easily send web page videos, and home videos right to the tv so everyone can see.  Even my son's power point and imovies are instantly veiwable.  Netflix has been great for me and Apple's movie rental prices are almost always cheaper than the on demand HD prices from Verizion. Great product!", "verified": false, "helpfulness": "55/65", "author": "LOVE HDTV \"smc\""}, {"rating": 5.0, "review": "Funciona a la perfeccion. El Apple TV es bueno, bonito y barato. Lo recomiendo. Mlbtv y Netflix se pueden ver en HD.", "verified": true, "helpfulness": "0/1", "author": "Luis E Martínez \"CADC2002\""}, {"rating": 5.0, "review": "I have both Roku 2 XS and Apple TV.Each has their strength and weaknesses.They both have Netflix.Roku 2 XS integrates with Amazon video store while Apple TV is built around the Apple iTunes store and ecosystem.Personally, I think a couple features give Apple TV the edge:* Apple TV has Youtube, Roku does not.* Apple's AirPlay is really amazing technology. I can stream videos from Mac or iOS to TV without using wires.", "verified": true, "helpfulness": "20/24", "author": "Roger H"}, {"rating": 4.0, "review": "Great to use with IPAD and Ipod touch in home.  The screen size could have been improved when doing Airplay Mirroring.", "verified": true, "helpfulness": "0/0", "author": "happyshopper21"}, {"rating": 5.0, "review": "Excellent, Very good, is highly recommended, as is the product is as described. is of good quality, providing the service that is offered.", "verified": true, "helpfulness": "0/0", "author": "wdmarin"}, {"rating": 5.0, "review": "Picked up the AppleTV in an attempt to cut the cord with cable.  We are a few weeks into the experiment and are not looking back!Setup: Pretty much just plug it in and set up your wifiInterface: Simple, intuitive and very smooth.iTunes Content: Tons of iTunes content.  Great selection of movies, but I wish the prices were better.  I see no reason to purchase TV shows, but others might.  Got me back into podcasts, there is an amazing about of content.3rd Party Content: My son lives in Netflix, he never used it on the Wii but now accessing content is much easier.  Vimeo has some great content, much more polished then YouTube.  MLB.TV is great, but I with they didn't follow the blackout rules.Remote: Remote is simple, but the remote app (iPhone/iPad) makes it much easier to use.AirPlay: This is the killer feature, and it will be even better with Mountain Lion this summer.At $99 this is a no brainer.If your have an iPad, this is a great add on.", "verified": true, "helpfulness": "2/3", "author": "Dave"}]