[{"rating": 5.0, "review": "This is much better than my ROKU 2. It does not need to reload the movie like the ROKU. And I really like the playback of apps from my iPhone and iPad, it fills the screen and looks like a giant iPad, if the app is designed to do that like You Tube, any Apple app, Netflix (from iPad/iPhone), etc. Would recommend anyone with an i device to get this vs. the ROKU.", "verified": true, "helpfulness": "1/1", "author": "strummer281"}, {"rating": 5.0, "review": "I've had mine for about a month or two now and it's great! It works way better than the in tv system.", "verified": true, "helpfulness": "0/0", "author": "Chuck H. \"Chuck\""}, {"rating": 5.0, "review": "Exactly what I was expecting. Great product. Good price. Very easy to hook up and a snap to get up and running", "verified": true, "helpfulness": "0/0", "author": "RICHARD J MULHERN JR"}, {"rating": 5.0, "review": "If you have Apple mobile devices (iphone/ipads), I cannot recommend this more highly. It is so easy to mirror the screen of your mobile device and send music, pictures, or video from your phone to the TV. The built in apps work really well also.I have a \"smart\" TV, but the apps (like Netflix and Hulu+) on the Apple TV are much more responsive and work much better than these same apps on my TV. Also, my TV is a good distance from my router. My TV could never get a strong enough wifi signal to stream video reliably, but the Apple TV does not have this problem.Over, I highly recommend this product!", "verified": true, "helpfulness": "1/2", "author": "B. Kilpatrick"}, {"rating": 5.0, "review": "Absolutely one of the best purchases I have ever made! It was affordable, and keeps me entertained in my down-time.", "verified": true, "helpfulness": "0/2", "author": "Charles"}, {"rating": 5.0, "review": "I use this device to stream content to a TV that is not connected to a cable line.  It works very well.  Highly recommended", "verified": true, "helpfulness": "0/2", "author": "jerry grisko"}, {"rating": 5.0, "review": "I almost don't know how I lived before Apple TV, especially since my husband and I live overseas so the TV programming isn't great. We loved it so much, we got it for my parents and although they are still getting used to it, they love the movies and especially that we can share pictures so they can see all of our adventures.", "verified": true, "helpfulness": "0/1", "author": "paddlegrl9 \"paddlegrl9\""}, {"rating": 1.0, "review": "The airplay mirroring is horrible with quality varying widely depending on mirror device.  My macbook pro retina (2013, Mavericks OS) mirrors with 1 to 2 second lag making it impossible to use as a mirrored or extended display.  It seriously will give you headaches to operate a cursor with this much lag.  Videos playing from websites lag horribly with terrible refreshing of HD content.  The audio quality is also degraded.  This issue is even further exacerbated using a macbook air (2013, Mavericks OS) and impossible for use.  It's even worse than remote access many encounter with IT departments.  Yeah, crazy.It's appalling that apple would market this feature.  It's the only reason I purchased it.  Now I have a 100$ glorified Netflix, HBO GO box.  YEAY!  It's like Netflix heaven at my place.  You can watch it on my PS3, PS4, my HTPC, and now this wonderful 100$ paperweight.Now about apple customer support.  Just terrible.  When I first brought up this issue they sent me to a troubleshooting page of iOS devices.  That's right ladies and gentlemen, they sent me to a troubleshooting page for iOS devices even though the problem was associated with a macbook pro and a macbook air. FFFUUUUU.......Then they blamed the router.  But wait for it. I had the best router possible from their recommendation.  What the fu....So then we hooked up the AppleTV AND Macbooks through ethernet directly to the router and still got terrible lag.  With a direct connection?? What?  This is Apple quality?  The same people that made the MacBook Retina made this garbage. Really?So then we tried another TV and two other monitors.  Yeah that was waste of my time.  All in all I lost around 4 hours and 100$ because Apple can't get their you know together.In conclusion this 100$ box of failure is worse than a 5$ HDMI cable.If you think I'm raging...well you're right.  That's all this box is good for, a good rage.  But in my defense this issue is all over their support forums with absolutely no solutions offered.  So I'm not the only one experiencing this issue.", "verified": false, "helpfulness": "0/5", "author": "A Serious Reviewer"}, {"rating": 5.0, "review": "Every once in a while I have to restart my internet box or computer when I turn on but I expect that will disappear once I install my apple airport which I should also receive soon. It is very vivid and really is fun but is work to learn to use. Netflix is easy and then you can buy something at itunes go to your computer and enter some code and then can play on Apple TV. If you have your own videos or photos you can also use this baby to play on your TV. I love everything Apple and would never have another computer. Now I have apple iphone 5S (bought at store through Sprint for $99), ipad, and apple computer in addition to Apple TV and now I am getting the apple airport.", "verified": true, "helpfulness": "1/3", "author": "Joy D. Leftow"}, {"rating": 5.0, "review": "Received it as a gift and was reluctant to use it for several monthsDidnt think I needed one more wireless gadget to consume more of the precious time I dont haveAfter several months I hooked it upThe effort to connect was minimal and operating it was totally intuitiveIt provides lots of options for TV viewing and more channels or apps or whatever the right description is, are added with timeIf you enjoy YouTube or NetFlix after you watch it on a big screen TV on an easy chir you wont want to view on a desk top or lap top (maybe a pad is OK)", "verified": true, "helpfulness": "1/2", "author": "gonzalo martinez"}]