[{"rating": 5.0, "review": "This is what Sony was trying to do in the 80's and 90's...just turns out Apple did it better.  If you have Ipad(s)/Ipod(s)/Mac(s) or any combination this is a great device.  Also, I have DirectTv which has a brutal on-demand service...so AppleTV fills that gap too.  Great product...easy to install...easy to use.  Awesome.", "verified": true, "helpfulness": "0/0", "author": "Saraht"}, {"rating": 5.0, "review": "I have been an \"Apple Man\" since 1986 and I have nothing but. This is a very nice addition to my collection!", "verified": true, "helpfulness": "0/0", "author": "G. Prouty"}, {"rating": 5.0, "review": "works good, does what it is supposed to do. Does for sure not what the description doesn't say like playing various files as a media player could. I got it for the air play function in order to play videos on the big tv which are streamed to iPhone/ iPad. Can recommend it for this and the advertised purposes.", "verified": true, "helpfulness": "0/0", "author": "Constantin Schmekel \"constantine\""}, {"rating": 3.0, "review": "I had a reasonable idea of the limitations of the Apple TV from reading the reviews.  I decided to pick one up anyway just to replace my composite video cable adapter that was busted.  That cable costs around $40-$50 and I was able to get the Apple TV for $75.  So instead of hooking a cable from my iPad to the TV, I transfer the video/picture/audio to my TV via the Apple TV and the Airplay function.  When I bring up my video on the iPad, a rectangle with a triangle under it shows up.  If you click on that, my Apple TV shows up and I select it.  When I hit play, the video is transferred via the wireless router in my house to the Apple TV and from the Apple TV to my TV.  As a wireless extension to my iPad, Apple TV seems to work well.  That's worth a solid 3 stars.However, the Apple TV has pretensions of being a multimedia player.  At that, it fails miserably unless your primary source of video and music is from iTunes, Netflix, or Hulu+.  Quite a few folks have raved about the Apple TV menu.  The reason it is reasonably clean is due to the lack of options.  You cannot watch any of your own content unless you have purchased it from iTunes or have it reside on your computer iTunes account.  I knew about this limitation before purchasing this box but I was still shocked with the lack of functionality.  One nice feature is the ability to display your Photo Stream from your Apple iCloud account on your TV as a screen saver.  All in all, I give Apple TV perhaps 1/2 a star on the Photo Stream support but nothing else.So if you are looking to extend your iPad/iPhone/iPod to you TV without wires, this is a nice box (though you need to have a wireless network in your house for it to operate).  If you don't need that wireless extension, don't pick up this box unless you are a big iTunes user.", "verified": false, "helpfulness": "1/1", "author": "Richard"}, {"rating": 5.0, "review": "So yeah I bought this on the recommendation from a co-worker and I love it! I've been thinking about getting rid of my over priced cable and I wanted to see how this would work and it's great! Super easy to set up and super easy to use!", "verified": true, "helpfulness": "0/0", "author": "Cornelia McAndrew"}, {"rating": 5.0, "review": "I am glad that I got this.  It was able to keep the office nice and with the minimal amount of cables.", "verified": true, "helpfulness": "0/0", "author": "Boris Chu"}, {"rating": 5.0, "review": "I purchased the Apple TV so that I could use the mirroring function on my ipad to my tv. It works very well, I am very pleased with it.Setup was quick and simple, I had to provide my own HDMI cable to hook it up.With the combination of my new Apple TV and Netflix I no longer have a cable tv bill!!!One feature that I use a lot, is showing YouTube clips on my tv from my iPhone.Overall this is another great product from Apple that just works!!!", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 3.0, "review": "I used to love the Apple TV for one reason, early movie releases.  I could buy movies sometimes as much as two weeks earlier than the physical version and while I didn't buy many, I could rent others.With Apple TV you have a very simple device that pretty much plays movies, music, YouTube videos, Netflix, and TV shows.  Yes this is cool and the interface just works but, it is seriously lagging behind other devices in the market.  For instance, my Google TV has Hulu Plus, Netflix, Play Movies, Crackle, Amazon Prime Instant Video, Flixster, Vudu, Amazon MP3, Pandora, slacker, play music, and a whole host of other options as well as the ability to manage my whole entertainment experience.The first problem is obviously, flexibility and other devices with Google TV or Roku boxes have way better options available to them.  The second issue is that Loyalty isn't rewarded with Apple!  You see, Apple feels that their exclusive product is worth more for rentals over shorter periods of time than the competition.  Both Amazon and Google deliver their rentals at lower prices and Amazon actually gives you twice as long to watch the movie.So, I honestly have to say that you should pass up the Apple TV until Apple gets their head out of their sphincter!  Mine is sitting here where I cannot sell it because I have too many movies that I stream with it (About 30) but, I won't give them any more of my money until they start Rewarding Loyalty instead of Taxing It!", "verified": false, "helpfulness": "1/1", "author": "Gaiking"}, {"rating": 5.0, "review": "I love my Apple tv...in fact I am buying two more so that each tv has one attached to is so we don't have to be stuck in front of the tv in the tv room.", "verified": true, "helpfulness": "0/0", "author": "JamaicanGirl"}, {"rating": 5.0, "review": "This thing is great. It has a few glitches every now and then, but being able to stream music and video wirelessly is great. And being able to watch netflix without a laptop is icing on the cake.", "verified": true, "helpfulness": "0/0", "author": "Galant"}]