[{"rating": 5.0, "review": "Bought this for my father for Christmas. He has loved it since he got it. Great product. I'm going to buy one for myself now.", "verified": true, "helpfulness": "0/0", "author": "Dana Smith"}, {"rating": 5.0, "review": "Love apple TV.  Does take a bit to think when using Netflix sometimes, but we had the same problem with the wii, so I think its a netflix problem.  Its fun using all our devices to control the tv.  I wish there would be a way to move things around in the menu.", "verified": true, "helpfulness": "0/0", "author": "The Awesome!"}, {"rating": 5.0, "review": "No comparisson with other similars ... extremally powerful and high quality. If you are looking for a good equipment...here it is!", "verified": true, "helpfulness": "0/0", "author": "Oduvaldo Oliveira"}, {"rating": 5.0, "review": "Does everything it says it does. Love looking at pics and movies on the big screen. Turns any tv into a Smart tv.", "verified": true, "helpfulness": "0/0", "author": "Mark Super"}, {"rating": 1.0, "review": "The device requires additional items to make active? Mydaughter who purchased it, says it connects then goes off screen. does this each time she tries to use it.", "verified": true, "helpfulness": "0/4", "author": "Floied Coltey"}, {"rating": 5.0, "review": "Does the same thing as my 2012 Samsung smart TV and 2013 Xbox One by playing Netflix, Hulu, etc, but it also offers to AIr Play the iPad or phone so everyone doesn't have to gather around behind you. Make looking at things online easier for a family or group.", "verified": true, "helpfulness": "0/0", "author": "F. V. Plummer II \"Jetsetr\""}, {"rating": 5.0, "review": "If you like to buy movies from the iTunes Store, this is an easy way to watch them on your TV, and you can also use it to listen to your music collection.  Very small, so it fits most anywhere, and hooking it up was simple.", "verified": false, "helpfulness": "0/0", "author": "cmccance"}, {"rating": 5.0, "review": "I got this unit once it finally streamed in 1080 and I am so glad I did.  It does what most of the other similar devices do but the AirPlay feature is the best!  I have mostly Apple products and it works seamlessly.  I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Tweeprise"}, {"rating": 4.0, "review": "I found it very usefull and easy to use. the small modern shape gave it a tidy and nice look.Thanks", "verified": true, "helpfulness": "0/0", "author": "Fahad Alshuaibi"}, {"rating": 5.0, "review": "Just like it should be … plug & play! Now I need a faster internet connection to fully appreciate some of the features.", "verified": true, "helpfulness": "0/0", "author": "H J M"}]