[{"rating": 5.0, "review": "Family members told us about Apple TV several months ago, and we finally decided to purchase one. Wow!!! This is fantastic!! We are now able to stream our church services, stream movies, and so much more....we love it!", "verified": true, "helpfulness": "0/0", "author": "SueZan Stutts"}, {"rating": 5.0, "review": "I have to start with this preface: if you are choosing between an Apple TV, Roku, Chromecast, Amazon Fire, etc and you are already within the Apple Ecosystem, I'm 90% sure you will be most satisfied with the Apple TV.All of my electronic devices are on OS X or iOS. The Apple TV centralizes all of my devices. It connects and streams off my iTunes library and iTunes account. I use it for iTunes Radio as well, but can watch movies and listen to music straight from my computer (good thing because I'm tired of buying HDMI cables that stop working). Additionally, I love AirPlay. If I'm too lazy to go on the YouTube app or can't view something on the Apple TV (because there is not ATV app for it), then AirPlay will just throw it on the screen.That said, there are two things you should also consider that would actually make this thing useful: a good Wi-Fi connection and subscription to services like Netflix or HBO GO etc. The latter is not as important because I know a lot of people just use it to stream from their computer or use the free services that are included, but you can maximize how amazingly convenient this thing is through Netflix or HBO Go services and the like. But I can't stress the importance of Wi-Fi connection. If it's slow or unreliable, it will really diminish the enjoyment of this device.Another thing that I like? I can watch stuff on my own time and interest. I stopped watching TV years ago but I still see how people just mindlessly watch whatever is on, no choice and limited to time (even if they have DVR). Not only that, you don't have to pay $50 for like 4 channels you actually want and 600 others you don't care about. If you Netflix and other services can suffice your selection, you can either save money on entertainment subscriptions OR allocate some of those savings towards faster internet (and you'd probably still have some money left over for gas or food!).", "verified": false, "helpfulness": "1/1", "author": "Stan T."}, {"rating": 5.0, "review": "As with most Apple products its very easy to use. I love being able to stream Spotify directly from any of my devices to the Apple TV that is plugged into my Yamaha surround sound via digital optical cable. There are quite a few apps on the device but ones that aren't can easily be streamed from any IOS device by clicking the airplay icon. Once ATV was plugged into my network the icon appeared on all of my devices so there was no set up involved.", "verified": true, "helpfulness": "0/0", "author": "Christopher G."}, {"rating": 4.0, "review": "I  love this tiny device and use it all the time with minimum difficulty  Once in a while it requires restarting but that has not been a problem.  I like the ease with which it is installed and the fact that it is so small and not cumbersome.", "verified": true, "helpfulness": "0/0", "author": "Izzy"}, {"rating": 5.0, "review": "ok update I'm giving it 5 stars now the airplay is working just fine i just had to get a newer faster router. i guess one downside to this could be no amazon prime video on the apple tv lol. but it works great. i can just use my macbook pro to watch prime video and airplay stream it to the tv ^^", "verified": true, "helpfulness": "0/1", "author": "chris"}, {"rating": 5.0, "review": "easy to install and fun to use;  love this accessory;  everything I expected it to be - great addition to my system", "verified": false, "helpfulness": "0/0", "author": "Nancy B. MacLachlan"}, {"rating": 5.0, "review": "also my son in law got it for christ mas for us and he say love it and work good", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Dahle"}, {"rating": 5.0, "review": "I tried an android based dongle first, but disappointed when it could not mirror my ipad.  So, I broke down and got this.  I am very happy, airplay, and mirror work great, and quality of the image in HD is great.  Yes, the built in apps are limited, but truthfully, I only use Netflix, and YouTube and on occasion rent a movie from itunes, so I don't find this an issue.", "verified": true, "helpfulness": "1/1", "author": "Phillip S. Porter"}, {"rating": 2.0, "review": "Has similar channels as Chrome and Fire, but the plus is connecting to your iTunes library on another computer in the house.  Problem is that this connectivity is very spotty.  One day I can play movies, music, etc.  Next day I get a spinning wheel on the Apple TV that never goes away.  Fix the connectivity issue, and this will be a winner.  Otherwise, just plain frustrating.", "verified": false, "helpfulness": "0/0", "author": "Mark"}, {"rating": 1.0, "review": "I like the apple tv but the one I got stops working at least once every two hours, goes back to the home screen, and often doesn't save the spot I was at while my roku doesn't have any problems so I know it's not my internet connection.", "verified": true, "helpfulness": "1/2", "author": "Rachael"}]