[{"rating": 5.0, "review": "This Item is wonderful. I have 2 now. We can watch Netflix, and YouTube Videos, Listen to the Radio, and much more. This is why I dont pay for cable, no commercials!!", "verified": true, "helpfulness": "1/2", "author": "Bulletproof808"}, {"rating": 5.0, "review": "A smart move for any Apple user. Great music & photo streaming along needed apps like HuLu & Netflix. Simple, clean design. Flawless operation.", "verified": true, "helpfulness": "1/2", "author": "M. H. Schrank"}, {"rating": 2.0, "review": "What is is: an extremely easy to use device to connect iTunes or other apple devices, wired ethernet or wirelessly, to your HDTV and stereo.What it is not: completely pleasing.  The single biggest problem is that it's limited to 30 frames per second.  It also limits the number of fields updated. It means you notice a jerkiness to the display.  Motions are not natural.  The sound is fine; it's the drop in frame rate that loses points.In my opinion, it impacts the video presentation making a movie less enjoyable (the reason for the low rating)....stick to DVDs or an HDMI cable from a good video card in your computer connected to your TV.A BD-DVD can provide 59.9 fields per second (like old-time tv) at full HD (a field is a still image that fills half the lines of resolution of a frame).  The Apple HD video format does not provide the full bandwidth.  Running a video encoded for apple-tv on iTunes vs the original DVD, the dropout is immediately noticeable. (The Apple TV supports up to H.264/AVC high profile 4.0; it is suggested that to cover 1080p correctly at least 4.1 is necessary - which, btw, iphone 4 apparently supports.)The wireless network this was on is not highly loaded - it has plenty of bandwidth (802.11-n).Having said the above I intend to use this heavily over the next month as an audio node and based on that may revise this review again.", "verified": true, "helpfulness": "2/8", "author": "Mojave Mike \"Mike\""}, {"rating": 5.0, "review": "The resolution on this AppleTV is unreal. Near perfect HD streaming on almost all shows.Way better than the Roku i had, and way faster. Love it.", "verified": true, "helpfulness": "1/2", "author": "Aviv Hever \"dochollywood\""}, {"rating": 5.0, "review": "Simple, quick review.This is great if you have an iPad, iPhone or Mac laptop, as you can use airplay and mirror with this.Comes with Netflix and much more built in.This CAN NOT be jail broken as of yet, so if your looking for that get a 2nd generation.Good value if you use most of the features.", "verified": true, "helpfulness": "1/4", "author": "Paul E. Seals \"Lunasdude\""}, {"rating": 5.0, "review": "My fiancé owns one of this and the roku... I absolutely LOVE IT!!!! So much to Watch on it and do!!! I'm thinking of canceling cable now!!!! Wouldn't trade it ever!!!!! It's awesome I love apple products!!!!", "verified": false, "helpfulness": "0/2", "author": "Proudmama"}, {"rating": 5.0, "review": "This is a great addition. Now stream your music from iPad  iTouch 4 using airplay and the cloud. Everything works great! You can't beat the price and just to be able to watch iTunes festival it's worth the price.  You will need a good broadband throughput, I have 15mbps and together it's excellent in 1080p.", "verified": true, "helpfulness": "0/1", "author": "Joe Kidd \"Joe Kidd\""}, {"rating": 4.0, "review": "It's simple out of the box but be aware you will need to purchase HDMI and ethernet cables on your own.  This comes with power cord only.  Truly a plug and play device. One of the simplest, trouble free electronic devices I've ever utilized.  Plug in power. Plug in ethernet or connect wireless.  Run HDMI to TV or reciever. That's it.  The device will power itself up and walk you through a quick set up screen. It will be easier if you have created an iTunes account already. Updates will download w/in the first several minutes hooking it up.I won't go into a lot of detail about the icons/apps as they are well explained here and other places.  The UI is user friendly and easy to navigate using the small, sleek remote control.  The only one I've really played with so far is Netflix which connected to my account using just user name and pw. Didn't have to run up to the home computer and register the device to my NF account. Very easy. Unless you subscribe to iTunes Match ($25/yr.) you must have the iTunes program open on your device before it will stream iTunes content through your TV. If you pay for Match then you can pull all that out of the cloud and won't need to have your imac, iphone or ipad running.Probably the favorite feature everyone wants to hear about, and the reason I purchased the box to begin with is Air Play Mirroring.  You must be running Mountain Lion on your mac or have ios6 (I think) on your phone or pad.  Additionally your Mac needs to be a relatively recent build; mid 2011 and up I believe running the i5 Intel chip. Your device will automatically detect an apple tv box on the network and produce an icon for you to click.  This occurs in two places:  there is an icon on the bottom of the iTunes program which if clicked will push video and audio from w/in iTunes to your TV.  The other one is located in your main tool bar somewhere (on my imac this is the top right corner of screen). Activating that will push web mirroring to your TV.  I did a quick Google search to figure out which settings are best. Under resolution select \"Best for Airplay\" and deselect \"Overscan Correction\".  Initially I had some issues with the whole herky, jerky, stop-motion effect. Again a Google search for \"Mirroring Stuttering\" or \"Mirroring Freezing\" will take you to many solution pages.  There are many psbl. fixes but these seem to be the most common and worked for me:  make sure you have a true N band, dual antannae router with most up to date firmware. Use the 5Ghz band. In your router advanced settings deselect \"WMM Enabled\" under the QoS-Quality of Service-tab. Have the router as close to the apple box as you can. Turn off other apps and limit other usage on your network. Obviously high speed internet is necessary. Once I adjusted for all that the picture came in quite clear--not quite HD or bluray but definitely as good as or better than SD signals. Every now and then a few screen pixelations and minor stuttering will occur but nowhere near the extent as before the tweaks. Also volume had to be turned up quite high on my receiver before audio sounded good. The play/pause button on the remote will not stop and start video so if you need a break you'll have to control that from the device that's being mirrored.  Ultimately this is really a fantastic bit of technology though future updates will hopefully make it even better. There's all kinds of free streaming services from TV to movies to clips etc. that can now be viewed from the comfort of a couch on your big screen. This is why I bought the box and it has delivered satisfactorily.Biggest downside I have to comment on has nothing to do w/ Apple or the box. I chose Amazon free shipping and they took their sweet time getting it to me. I always use the free shipping when offered and usually still have the product w/in a week or so.  They didn't even ship this box the first week. Then once shipped it took another week getting to me. Pretty ridiculous but free so little room to complain I guess. Still annoying.  If you have high speed internet and a mirroring capable device I don't see how you can go wrong getting the Apple TV box for less than 100 bucks. Well worth it.EDIT:  Figured out the volume issue during mirroring.  Need to make sure the volume on your mac, phone or tablet is all the way up which I thought mine was. Turns out it was turned way down and once adjusted sound through the receiver speakers was just fine.EDIT #2:  12/8/2012.  With the iTunes 11 update the AirPlay mirroring icon in that program is now at the top of the window on the left side near the Song Title bar.  Also just had difficulty with an update last week.  Google search indicated many others having similar troubles trying to get the update via ethernet.  The fix is to disconnect ethernet and get the update wirelessly...then reconnect ethernet cable when completed.EDIT #3:  10/21/2014.  I was re reading this review and figured I would make one further clarification. There is a difference between mirroring and air play. When you mirror you are pushing the entire web site with all its graphics and text to the TV. In this case you cannot control with the Apple remote.  If you chose the air play icon alone you are simply pushing video only to your TV and in this case the remote works.  At the time of my initial review I was under the impression mirroring and air play are one in the same. They are in fact two separate functions and operate a bit differently. Airplay is the preferred method to use, but if you can't get it to work for whatever reason you can always push the whole web page using mirroring.", "verified": true, "helpfulness": "22/26", "author": "T. Shepard"}, {"rating": 2.0, "review": "We got the Apple TV for our home after my wife was provided one at her school where teaches music. For streaming of music it is excellent (4 stars) but when chose to rent movies another result occurs... The phrase your purchase will ready for viewing in 19 hours arrived. It was not that long but we still have yet to see a whole movie that we have rented.", "verified": false, "helpfulness": "0/3", "author": "Poohuno"}, {"rating": 5.0, "review": "Set up was easy. It links to my iMac seamlessly, letting us watch our favorite shows on iTunes on the big screen. The remote is very simple -- if anything it is too simple. I have a Blu-Ray player that supposedly connects to Netflix, but usually just reports \"Network Failure.\"  But the AppleTV seems able to connect to NetFlix even when the other player cannot.", "verified": true, "helpfulness": "1/1", "author": "TandemCaptain"}]