[{"rating": 5.0, "review": "Best $100 device.  Scrolling pics, easily connects and set up... bought 2 and probably going to get another 1-2.", "verified": false, "helpfulness": "0/0", "author": "Mike L."}, {"rating": 4.0, "review": "I assume this was okay.  I bought is as a gift.", "verified": true, "helpfulness": "0/0", "author": "Jackie Quick"}, {"rating": 5.0, "review": "Everything Apple makes is amazing, and this product is no different.  I'm very happy with my purchase....and I saved a few bucks getting it off of Amazon.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 4.0, "review": "Good quality for mirroring iPhone for Skype, photos, etc. Not sure about Amazon Prime flix yet.", "verified": true, "helpfulness": "0/0", "author": "Dave N."}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Patricia Cardozo"}, {"rating": 5.0, "review": "great product. doing exactly what it was designed to do", "verified": true, "helpfulness": "0/0", "author": "Raffi"}, {"rating": 4.0, "review": "Set up was easy, for this challenged person.  I have enjoyed watching and finding things.  I do get annoyed when it 'losses' connections.  But several friends say it happens on theirs.", "verified": true, "helpfulness": "0/0", "author": "Kathryn Mellina"}, {"rating": 5.0, "review": "Son uses it at college and loves it!", "verified": true, "helpfulness": "0/0", "author": "Joe h."}, {"rating": 3.0, "review": "The product is fine if you already use and subscribe to certain apps. It will cost more if you don't .", "verified": true, "helpfulness": "1/1", "author": "Sena"}, {"rating": 4.0, "review": "Bought this after using a first-gen Roku device, and I'm torn on how to rate the Apple TV. This device is well made, cleverly designed, and has some extremely useful features, including Airplay, a simple remote, and ease of use. However, outside of Apple's digital services - movies, music, podcasts - its not quite as handy. And this generation is getting long in the tooth. I wish Beats music was integrated into it, though.Quality of streaming content is really good. I have a 47\" LCD 1080p LG, and the iTunes purchases and rentals always look top-notch. The icons are clear and easy to follow. Apple intentionally limits the services allowed access to the Apple TV ecosystem. So, there aren't any competitors to the iTunes store - this means no Amazon, no Spotify, etc. This is a clear strike against the device.Setup is easy. However, it doesn't seem to use the strongest wireless antenna - sometimes, the wifi streaming just cuts out in the middle of netflix streaming for no discernible reason - the router is in the same room, less than 15' away! In addition, sometimes it takes 5-10 minutes to buffer an iTunes rental for watching, which seems like a long time when you're sitting on the couch waiting for everything to get started, and have spent the last 5 minutes trying to decide on a movie!Airplay doesn't work consistently, and generally ends up being much more frustrating than I hoped. It works, but not consistently. I'd estimate that during the rough patches, I have to physically unplug the power several times a day, if I want to use airplay streaming. This is the same whether using an iPhone 5, a 2013 MacBook Pro, or an iPad Mini, so I tend to blame the Apple TV - especially when the wifi isn't doing anything in the background. It actually seems worse with the MacBook than the iPhone. It makes it near impossible to use Amazon Prime video streaming. Even screen mirroring isn't as useful as I'd hoped.The Apple TV does have YouTube, which works fairly decently. The Roku 3 only received an official YouTube channel in early 2014 (I think), and the Roku 1 & 2 still don't. Using the iPhone as a remote, however, isn't very easy. There is definitely lag between input and what pops up onscreen, and isn't nearly as fun to use as it could be. Somebody needs to come up with a great 10-foot YouTube interface - I don't know, maybe Google TV already does? I haven't had a chance to use any of those products.It would be fantastic if I could use this without a screen to play music through my expensive sound bar, unfortunately, it seems as though thats not possible - everything has to be routed through the screen interface. If I'm wrong, someone please correct me! I haven't found a way to make it work.If you like to buy movies and music from Apple, get this device, no question. If you need integration of other services, such as Amazon Prime or Netflix, get a Roku 3 or try out the new Fire TV.", "verified": false, "helpfulness": "1/1", "author": "Andy, an Amazon Customer"}]