[{"rating": 5.0, "review": "Love this device .", "verified": true, "helpfulness": "0/0", "author": "James Mills"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "hugo"}, {"rating": 5.0, "review": "WORKS WELL WOULD BUY FROM AGAIN", "verified": true, "helpfulness": "0/0", "author": "Pete Fell"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Cami1306"}, {"rating": 5.0, "review": "Top notch! Love it!", "verified": true, "helpfulness": "0/0", "author": "Peter Mundo"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Nicholas Rittmeyer"}, {"rating": 1.0, "review": "Had great difficulty with the ambient light effect caused by this device.  Kept activating the ambient light setting on my VIZIO tv even though the setting was completely disabled.  A tech explained to me that because of black coloring used in the screen displays, is perceived by the TV as low level light and automatically adjust the ambient light setting.  Apple customer services was horrendous!!  Ughh!!", "verified": true, "helpfulness": "0/2", "author": "ChargerFan"}, {"rating": 5.0, "review": "Works awesome thanks", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 1.0, "review": "I am a long time apple fan, since 1983.  I like apple tv but there are issues that force me to give it a one star review and recommend that instead you should purchase either Amazon or Roku or a smart tv or blu ray.  First apple tv does not get amazon.  So if you have amazon prime you can't watch the free prime video with apple tv which to me is one of the best sites for those of us who have cut the cable.But the biggest issue is that when I purchase or rent a tv show or a movie from iTunes it does not immediately play on apple tv.  For example: I had purchased The Good Wife.  When I tried to watch it I get a message that it will take 45 minutes to download.  It doesn't take any time to watch a movie on Netflix with Apple TV. Why should it take this long?  Then when we are finally watching the show, 45 minutes later, it stops in the middle and says it will be 45 minutes before it resumes. Pretty annoying.The final straw was the other night when I rented The Rise of the Planet of the Apes.  It costs $4.99 for a 24 hour rental. I rented it at 7pm.  Soon after I try to watch and it tells me it will be 4 hours plus before I can watch it.  I figured that was a mistake and would change as it downloaded.  But after about an hour it has gone from 4 hours to 2 hours to 45 minutes and back to 4 hours.  That means we could have started watching the movie after 11pm.  Or I guess we could have waited until the next day and left work early to try and watch the movie before our rental expired at 7pm.  I gave up and emailed iTunes to say that I did not want this rental and to please refund my money.  Then I went to amazon (using my LG smart blu ray) and rented the movie from them.  They offered a 48 hour rental for the same price and the movie started in minutes.  Both rentals were in HD.Now several days later Apple is ignoring my complaints. I'm guessing they're ignoring me because I've complained about this issue several times.  I was using iTunes because there was an issue for a couple weeks where the blu ray wouldn't access Amazon. Not sure what the problem was (LG said security issues) but it is now resolved and was the first problem I'd had in a couple years of using it.Now I notice that Apple TV shows the movie as having been rented and says I have 25 days to watch it.  But of course I don't want to watch it, I've already seen it. And I don't want to pay for it.So, if you buy apple tv instead of amazon or roku you can't access amazon and buying from iTunes is a frustrating waste of time. Stay away!", "verified": false, "helpfulness": "2/5", "author": "johnrf \"johnrf\""}, {"rating": 5.0, "review": "good product as expected", "verified": true, "helpfulness": "0/0", "author": "giuseppe"}]