[{"rating": 4.0, "review": "I have both the Ruko and Apple TV boxes. They are pretty much the same product, but the Ruko gets more stations. I only bought the Apple because I have a Ipad and Ipod touch that I can use to view my content on the large screen tv or even mirror the Ipad on the tv if I so desire. Homesharing works perfectly between devices and if I put photos in the photostream file folder they appear on all the devices including my PC using Icloud. I recommend the Apple TV to anyone who uses Apple products.", "verified": false, "helpfulness": "0/0", "author": "Thomas N. Gilmore"}, {"rating": 5.0, "review": "I have had this item for about 10 days now. I am not a techie type person, and this was easy for me to set up. I use this with wifi connection and it is flawless. We have rented movies and have Netflix, they stream with no buffering or drops. The big thing is MLBtv for me and this device is great for watching the ballgames. Overall I am a very satisfied customer!", "verified": true, "helpfulness": "0/0", "author": "russreds"}, {"rating": 5.0, "review": "We are a no-cable house. We use Netflix, iTunes, Pirate-themed seeded download sites (cough cough), and have tried a number of streaming options, with mixed results.GOOD!Plug it in, it works. No weird connection issues (ROKU, I'm looking at you), no weird signal drops (XBOX, I'm looking at you), plus its HD (WII, I'm looking at you).If you have every tried to play your OWN video library on an XBOX, you'll know it requires a PhD in Microsoft file conversionailty - basically, everything you want to do requires 4 steps and an update. Want to watch a downloaded movie on AppleTV? Drag it into iTunes. Thats it. Drag it. I don't know how well ROKU plays your own video library as mine worked about as well as a 5th grade science project and I hurled it out the window in rage. (not really)BAD!How tiny is this remote? I know its the future and all, plus Apple always assess you a premium for design simplicity, but I even have skinny little ET fingers and hit the input key instead of the arrow key. Plus, the super simple remote can make things a little tricky (sometimes the left arrow takes you back, sometimes the menu button - or to turn on CC in Netflix, you hold the input button 5 seconds) Also, the box and remote are so tiny, you have to make sure they are well within each others line of sight. No pointing the remote up in the air as you browse.CONCLUSION!I had a ROKU - hated it. I had an XBOX, had a WII, tried plenty of streaming options. Not ONE works as easy and as flawlessly as Apple TV. Plus AirPlay mirrors for my iPad? FREEWAY SOLITAIRE on my TV? Yes, please.", "verified": true, "helpfulness": "30/33", "author": "M S"}, {"rating": 5.0, "review": "Admittedly, I was a bit intimidated, but determined. I actually got it up and running without calling tech support.The instruction pamphlet and website support is fairly good, maybe too much information online creating added confusion.The only perplexing head-scratch was the various on-screen \"Submit\" button activations. Eventually it is the \"right\" click off the keypad on the donut that takes you to the Submit button. Instructions for that was not exactly clear, and seemed many folks were hung up on that step.Follow the numerous instructions. And unplug and replug the cables if something doesn't work if you've done all the steps. Worked for me. Voila! I'm cooking with gas. So cool.Next step, Airplay.", "verified": true, "helpfulness": "0/0", "author": "ElmoTheCat"}, {"rating": 2.0, "review": "They say 51% of U.S. households own an apple product well I personally own 2 macbooks, an iPhone, and iPod, soon to be delivered iPad (didn't quite make the 2days shipping), and Apple TV (HUGE DISAPPOINTMENT). I purchased the Apple TV thinking I could Mirror my Macbook Pro to my Samsung HDTV and use it to watch AMAZON Prime. Being a huge fan of Amazon, I dumped Netflix and bought Apple TV hoping to stream Amazon Prime videos to my HDTV through Apple TV (Herein lies the disappointment). Like all other apple products it is a beautiful product with inherent simplicity but it looses big time by not having an Amazon App or interent browser capabilities that I have seen. Maybe Apple designed it this way so that you would be influenced to buy an iPad for the mirroring capabilities. I don't know if Amazon can get Apple to get in line with this Apple TV snafu but I sure hope something resolves. For now I have a $99 swell looking device that neither connects to Hulu nor Amazon Prime but will play iTunes across my TV speakers. Whooptie Doo! Can I get a refund? I had planned to use Apple TV to seamlessly push histological slides and xrays through homesharing to devices for better studying and finishing my work. I'm sorry Amazon I should have bought the ROKU when you made it an awesome gold box deal for me :(. And I'm cutting you slack on the two day shipping because I ordered very late last saturday night. It was Easter Holiday Sunday. I'm just hoping that my other order get's in before clinic tomorrow so I can try my hand at patient charting on the iPad.", "verified": true, "helpfulness": "5/10", "author": "Med1"}, {"rating": 5.0, "review": "I cant believe it but they added icloud features to it so I can view all the movies and tv shows from the cloud without using itunes.  I only wish they could add music to it also.  Netflix works great.", "verified": true, "helpfulness": "0/0", "author": "Terrence Toshio Ozaki"}, {"rating": 5.0, "review": "Love the new pic quality, iPad  iphone smooth interface is great. Fast and bug free.  Like most Apple devices it just plain works.", "verified": false, "helpfulness": "1/1", "author": "SJH AZ"}, {"rating": 5.0, "review": "I got this for my living room. It was very eas to hook up to the tv, you will need to make sure you have the cable to go from it to the T.V.  The only other is it's plug. Then it is just a matter of hooking it up to your wifi, syncing with you iTunes library, and if you have a Netflix account imputing your account info. It is very easy to do. It comes with a remote, but if you have an iPad, iPod touch, or iPhone, you can use them as a remote. The menu is very easy to navigate and understand. Going through the music, movies and anything else that you have in iTunes is very easy to accesse and sort through and navigate.", "verified": false, "helpfulness": "1/1", "author": "Patricia Brouillette"}, {"rating": 2.0, "review": "One issue with this device is with the range, I am about 50ft from my wireless router, causing disconnections and loading issues. The apple TV also randomly resets during play, which causes me to lose my position in whatever I was watching and I have to fast forward back to where I was. Also, every now and then the apple TV will give me the error \"Netflix cannot be reached at this time\", and I have to reset the device. If I could return the device I would and try my luck with a Roku. I love apple products, so its safe to say that this was a disappointment for me. I may have received a defective device also, but I believe I am past the return/replacement period.", "verified": false, "helpfulness": "2/8", "author": "Craig"}, {"rating": 5.0, "review": "I purchased the newest AppleTV a week after canceling my DirecTV service. I was paying $90 a month for what was basically HD basic cable with a few extra channels thrown in, in one room with a DVR and now I'll never need to go back.My job has me working both day and evening hours, so I basically only watched the news, the Red Sox, and The Walking Dead. I decided it was just not worth spending close to $100 a month for the few things I watched. A also pay for Netflix and Hulu+ on top of that.With the AppleTV I only pay for what I want to watch, a la carte style.What I can't watch on Netflix or Hulu I can pay for through the Apple TV and stream. While the AppleTV doesn't have a native Hulu app I can watch that on my PS3 or Xbox360, or if I want to show off, mirror the app from my iPad or iPhone 4S.Using the CNN app on my iPad I can watch the news live and mirrored wirelessly to the AppleTV. The only thing I'm missing is the Sox, which are blacked out on MLB.TV since I live close to Boston.", "verified": false, "helpfulness": "23/28", "author": "J&P Robinson \"Jared Robinson\""}]