[{"rating": 5.0, "review": "Bought an Apple TV for myself about 5 years ago and love it. Picture quality is better than a standard DVD. Bought this one for Christmas for my parents.", "verified": true, "helpfulness": "0/0", "author": "C. Oldenberg \"Motorpsycho\""}, {"rating": 4.0, "review": "it works fine. it is very easy to project whatever you are viewing on your Ipad 2 or IPhone 4s.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 3.0, "review": "I chose apple TV because I was having problems with ROKU.  I am disappointed with Apple because there is no way to fast forward or to back up.", "verified": true, "helpfulness": "0/0", "author": "THOMAS MARSHALL"}, {"rating": 4.0, "review": "It is worth the money, it has many options.  Just the access you to get movies make it well worth it's money.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "This product is amazing. Even with low internet quality and bandwidth, there is minimum buffering. I highly recommend buying this product.", "verified": true, "helpfulness": "0/0", "author": "Joseph Fields"}, {"rating": 5.0, "review": "Great for my Apple collection, Connects to my mac for use with itunes. Mirrors photos from my ipod to the TV.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Bought it as a gift.  They love it.  You can't go wrong with it.  Will purchase more in the future.", "verified": true, "helpfulness": "0/0", "author": "hd103, CA"}, {"rating": 5.0, "review": "I have this device for almost a year now.  At first I thought this little gadget was over priced but now believe it is worth every penny I paid for. The video and sound quality from YouTube streaming on this Apple TV device  is unbelievable and better than what you get from the Hi-Def channels on dish network.  Netflix video/audio streaming quality is excellent.  Now you know why Apple products are priced higher than competitor's and why their stock price is > $550/share.You can also remotely connect your iPad thru Air Play to Apple TV and view your iPad screen/pictures, etc on the TV screen with no loss of sound or picture quality. Way to go Apple.  Steve Jobs was a genius who clearly differentiated Apple products from the rest of the competetion.The smart TV interface for Youtube and other internet browsing is garbage and hard to navigate.The remote is sleek and very user friendly and has a robust builtin WiFi. No cons except a bit expensive but definitely worth the price.  I will recommend this to anyone who wants to watch quality YouTube, Netflix  streaming and iPad mirroring on the TV.", "verified": true, "helpfulness": "0/0", "author": "Barney"}, {"rating": 3.0, "review": "Out of the box, the remote did NOT work. After phone calls to Apple tech support and a visit to Apple store, Apple replaced the remote. So far, Apple TV is working well. Probably would buy from Apple instead of this supplier to avoid the hoops involved to get Apple to resolve an issue with their products.", "verified": true, "helpfulness": "0/0", "author": "John Rosser"}, {"rating": 5.0, "review": "We skip Cable and watch all our content from the internet.  The AppleTV is our portal to a growing list of channels and content providers.  We've team it up with its native support for Netfix as our primary way of watching stuff.  We have one for each TV.", "verified": true, "helpfulness": "0/0", "author": "SoggyInSeattle"}]