[{"rating": 5.0, "review": "We bought the roku for my inlaws and quickly returned.  The Apple TV interface is much better...especially the Netflix app and ability to select users-you can't do this on the roku app!  I didn't want to log into my Netflix and see my Father in Law's shows in currently watching :)", "verified": true, "helpfulness": "0/0", "author": "MamaD2012"}, {"rating": 5.0, "review": "It's Apple TV ... Say no more!!!", "verified": true, "helpfulness": "0/1", "author": "Paul Matsumoto"}, {"rating": 5.0, "review": "this thing rocks! It works so nicely and it does so much more than I thought it would.Pros:I love screen mirroring, and how you can play a movie from your phone onto your tv, and set it up so that you can leave the Videos app or lock your phone, and the iPhone knows to keep playing the movie on the tv, and not interrupt the movie for everyone watching. I love the custom remote control setup (along with how well the IR sensor picks up the signal from the remote, regardless of how out-of-sight you put the unit itself), I love the Bluetooth keyboard compatibility, I love the Netflix app in it, I love how well the media player and device synchronisation work together so seamlessly. I especially love how I can set up a photo stream on my iPhone that's just for pictures that I'd like to see in a screensaver, and set that particular stream as the screensaver for the Apple TV.Cons:The Netflix app needs a better UI, as I get annoyed with navigating from the menu Netflix > User Selection > Recently Watched > (name of show) > (next episode in the series that I need to watch) > click \"Play\" > then select from \"Resume Playback\" or \"Start From Beginning\". That's slightly fatiguing. Even still tho, I really like using this thing for Netflix.But I really do love this thing. I would easily recommend it to my friends. In fact I already have.Easily one of the best purchases I've ever made.", "verified": true, "helpfulness": "1/1", "author": "Cullen C."}, {"rating": 5.0, "review": "Rated 5 star because my Apple TV works good.....actually gave this purchase as a gift ......so assume it works ok since I've not heard anything negative.", "verified": true, "helpfulness": "0/1", "author": "William"}, {"rating": 1.0, "review": "Honestly, if you want to ditch cable and pay extra for the premium services on this device go for it. Otherwise this thing doesn't even properly work. I purchased this before the chromecast release so that I could stream movies from my Macbook to my TV. Instead what this does is require about an hour worth of waiting to get a movie to load from my mac to this device, and it never mirrors my screen correctly. This thing is a $100 box that lets you pay a premium for their services, and mirroring doesn't even work right.", "verified": true, "helpfulness": "0/2", "author": "Zack"}, {"rating": 2.0, "review": "the streaming  on this thing is pathetic which is the only reason I bought it. You have to pay for everything on this thing too. Just an apple marketing tool", "verified": true, "helpfulness": "0/3", "author": "Thomas Michael Casey"}, {"rating": 5.0, "review": "Love it!  2 cables (power and TV HDMI) to connect and it offers you so much more for your tv.  Perfect for the traveler that wants more out of their hotel TV...", "verified": true, "helpfulness": "0/1", "author": "boring"}, {"rating": 5.0, "review": "I use my AppleTV as my primary source of Television and it works great!  ESPN never looked so good on my HDTV.", "verified": true, "helpfulness": "0/0", "author": "Grant Denniston"}, {"rating": 5.0, "review": "Really wonderful, I enjoy it almost every day. This is one of the best buys I have made for the price, the quality, and the joyfulness.", "verified": true, "helpfulness": "0/0", "author": "Augusto César Sartori"}, {"rating": 1.0, "review": "The power cable is not working good ..and it is attached to the apple TV I just don't want to be rude that's why I keept it", "verified": true, "helpfulness": "0/2", "author": "Keshav khanal"}]