[{"rating": 4.0, "review": "The Apple-TV 'hobby project' works very well as a media content streamer.  Using iTunes, all of your stored media can be played easily.  But more useful is the AirPlay integration with just about all other Apple devices -- every Mac, iPhone and iPad can stream media to the Apple TV.  Using 3rd Party apps such as AcePlayer or Air Video, you can browse all of your network's shared media and play almost all of it through the Apple TV.While other media streaming devices can also browse and stream your content, this product succeeds because 'it just works' quite well and without a lot of fuss, and also does so with an attractive and easy-to use interface.Works so well in fact that it allowed me to re-purpose a Mac Mini that was being used as a Media Center PC -- now my kids have an extra Mac to work on.Rated 4-stars due to lack of Netflix integration at this time, though many will not find that much of a limitation -- it's only a minor point in my case.", "verified": true, "helpfulness": "0/0", "author": "Dev from Seattle"}, {"rating": 2.0, "review": "i like apple products, grudgingly. own ipad and iphone. hate their control freak mentality - no flash etc.this product is basically useless. i can stream netflix and amazon. ok. big deal. i can do that on a 60$ blueray - along with crackle, and ..... where i can also access me playon server and view anything. not having access to any apps except the few that they offer makes this pretty much worthless. i am waiting for the hack but until then, my bluray is the answer or my ps3.", "verified": false, "helpfulness": "0/1", "author": "Gavin Buttigieg"}, {"rating": 4.0, "review": "I've been using Apple TV for a couple of years. This is my 3-rd device: 2 at home and 1 at work. At work (iOS dev shop) it is a great solution to sharing your iPad, iPhone or OSX screen with a team. We could not run a meeting without it. We loved the ease of switching between different devices: no wires or adaptors to worry about. At home I use it for streaming Hulu and Netflix, showing my photographs and occasionally renting a movie from iTunes.  I like it for what it's built for, however, I feel that Apple TV is aging fast. Competition from smart TVs, game consoles and other streaming devices is catching up quickly. Apple needs to innovate to make me buy another Apple TV in the future. I want 3-rd party apps on Apple TV and better integration with the rest of the home theater.", "verified": true, "helpfulness": "0/0", "author": "DrOleg"}, {"rating": 5.0, "review": "You don't even have to to have an apple device for this to work. This is the best device for media streaming, period. I can use my iPad to stream movies directly to my HDTV in full 1080p, wirelessly. Just pure awesomeness....get it!", "verified": false, "helpfulness": "0/0", "author": "Zetronimus"}, {"rating": 4.0, "review": "Wish I HAD KNOWN when ordering that I HAD TO HAVE THE CABLE (WHICH WAS NOT INCLUEDED) I ordered a week or so later to set it up!!!  Sissy Quinn", "verified": true, "helpfulness": "0/1", "author": "Sissy Quinn \"sqonami2\""}, {"rating": 4.0, "review": "The product speaks for itself.  I use it for airplaying iPad videos, browse trailers, view icloud photos, works well for what it is.  Would be better if it supports streaming video from LAN/NAS", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "When you have it, do you understand the benefits of AirPlay. Compact, nice design and pretty easy to set up", "verified": true, "helpfulness": "0/0", "author": "OSCAR MORA V \"CoolKhan\""}, {"rating": 5.0, "review": "This is how TVs should work.  You get iTunes movies and TV; Netflix; baseball, hockey, and basketball highlights; Wall Street Journal News on demand; and a whole bunch more..... With AirPlay, you can stream audio, video, and pictures from any iPod, iPad, iPhone, or Mac on your home WiFi network.  My favorite thing to do?  On cleaning day, I use AirPlay to push classic rock from my main iMac to AppleTvs around my house.  Turn up the stereos and/or sound bars and housecleaning turns into a music festival!", "verified": true, "helpfulness": "0/0", "author": "Kevin Koepnick"}, {"rating": 5.0, "review": "I didn't expect to have so much fun with this item. It was simple to set up. The only thing I needed to know was my wifi password. I bought it specifically to view movies off my hard drive and it works wonderfully. Great device!", "verified": true, "helpfulness": "0/0", "author": "S. Yorton"}, {"rating": 5.0, "review": "I have the last generation, which I love, but the improvements are amazing.How can you live without Airplay?????????????Just click on a photo or song, and play it thru your audio in your house.So easy to use", "verified": true, "helpfulness": "0/0", "author": "Nick"}]