[{"rating": 5.0, "review": "Always trust Apple! And dang it's only $68! So cheap and so much you can do. Bring exitement in the bedroom.", "verified": true, "helpfulness": "1/2", "author": "Alex"}, {"rating": 5.0, "review": "very fast to use with netflix and other apps, before I was using a blueray to get netflix and was very slow to choose a movie and to foward during a play", "verified": true, "helpfulness": "0/0", "author": "DANIEL"}, {"rating": 5.0, "review": "Hooked it up and got logged into everything in under 10 minutes. This makes streaming movies and music a breeze. Can't believe it took me this long to get an Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Jones"}, {"rating": 4.0, "review": "I bought this for the missus for X-mas as she has an i-Pad. I'm not to familiar with it but I did notice that the menu screens do look nicer than my Roku boxes and the performance seems to be about the same, possibly a little better with a weak signal.", "verified": true, "helpfulness": "1/1", "author": "Mike Calimari"}, {"rating": 5.0, "review": "Right part. Right price. I own more than one. They are fantastic. Easy to use easy set up.", "verified": true, "helpfulness": "1/1", "author": "Matthew Grinsell"}, {"rating": 5.0, "review": "Great product. Does exactly what it's suppose to.", "verified": true, "helpfulness": "0/0", "author": "Greg D"}, {"rating": 5.0, "review": "Awesome. Too bad not more apps available yet (like AMC)", "verified": true, "helpfulness": "0/0", "author": "Swiss Reviewer"}, {"rating": 1.0, "review": "Very frustrating installation process. I tried everything recommended on different Apple Forums (except to sacrifice a chicken) and nothing worked in order to sign in ITunes, set date and time and update software.", "verified": true, "helpfulness": "0/0", "author": "CR Reviewer"}, {"rating": 5.0, "review": "Very good deal", "verified": true, "helpfulness": "0/0", "author": "Mohammad"}, {"rating": 5.0, "review": "No suprises", "verified": true, "helpfulness": "0/0", "author": "StarMan"}]