[{"rating": 5.0, "review": "What a great device.  Love it.  Don't need it but I want it.  Lots of fun.  Especially the ability to display photos on your tv.", "verified": true, "helpfulness": "0/1", "author": "Thomas F Mc Farland"}, {"rating": 5.0, "review": "This little box is fantastic!  Unlike cable where I have been paying for lots and lots of channels I never watch, here I can choose what I want to pay for.  This, along with the antenna I bought from Amazon so I can receive local channels, will allow me to get rid of cable.  I have figured costs with this setup compared to cable and I will save a lot of money.  Thanks Apple!!", "verified": true, "helpfulness": "0/1", "author": "Missie"}, {"rating": 5.0, "review": "I love this product.  I have the Roku in my bedroom but the Apple TV is much nicer to navigate.  It's a bonus that its capable with my Iphone:)", "verified": true, "helpfulness": "0/1", "author": "SAP"}, {"rating": 4.0, "review": "Worked like the description.Good and solid product.Easily setup and use friendly.Looks like everyone love the apple product.", "verified": true, "helpfulness": "0/1", "author": "Y. Zhao \"torn sky\""}, {"rating": 5.0, "review": "apple tv is a great ad-on to any tv. Although apple still claims it's a \"hobby\" product this box is way advanced. Since now the google chromecast is out you can really see how advanced apple tv really is. There are not too many devices in such small form factor that pack all these features.I highly recommend Apple tv for anyone.We use it at home to stream various services as well as in the office to run our digital signage, it's great.", "verified": true, "helpfulness": "0/0", "author": "ALK \"AK\""}, {"rating": 4.0, "review": "It works fine, but must restore if power is interrupted.  We just found that out last night, after being gone on vacation for three weeks.", "verified": true, "helpfulness": "0/0", "author": "sigma 7"}, {"rating": 5.0, "review": "Awesome product, I love apple tv, I use it all the time. I can watch youtube, hbogo and lot of other stuff as well as I can play my videos and music from my computer hard drive", "verified": true, "helpfulness": "0/0", "author": "Sal"}, {"rating": 5.0, "review": "I purchased the Apple TV because my tv was not a smart tv and I needed access to Netflix and did not want to purchase a gaming console.  I have been very satisfied ever since.", "verified": true, "helpfulness": "0/0", "author": "Freestyle_7@hotmail.com"}, {"rating": 5.0, "review": "$100 for a device that does so much (and continues to get more features via software updates on a regular basis). iTunes movies/tv shows in HD (both own and renting with your Apple ID), HBOgo, Netflix, Hulu, you name it.I am obsessed!", "verified": true, "helpfulness": "0/0", "author": "Jason Hicks"}, {"rating": 5.0, "review": "As I live in an ipad, iPhone, iMac world this little device brings them all to my large screen TV. People crying about Amazon video not working have not heard about airparrot for the Mac.  That program allows me to watch my Amazon movies and other videos on my TV.  Also my new Vizio smart TV has Amazon built in so I'm covered.  Airplay also works great with a service called Aereo that we use for local stations.  I just ordered a second device for my wife to mirror her ipad onto the flat screen she has upstairs.  Anyway I'm very happy with this purchase that I bought along with the new one i just ordered on Amazon.", "verified": false, "helpfulness": "0/0", "author": "Kayak David"}]