[{"rating": 5.0, "review": "Great price, worked straight out of the box. Highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "John Michael Russell"}, {"rating": 5.0, "review": "Muy bueno", "verified": true, "helpfulness": "0/0", "author": "LUIS RODRIGUEZ"}, {"rating": 5.0, "review": "We use apple Tv for everything", "verified": true, "helpfulness": "0/0", "author": "mldiotallevi"}, {"rating": 5.0, "review": "Apple at its best. Very pleased with this item.", "verified": true, "helpfulness": "0/0", "author": "rvap"}, {"rating": 5.0, "review": "It's awesome!!!! Only downer is that you need wifi to use it and were in a dead zone for that til school starts.... But all in all this product is amazing!!! Anyone can have a smart tv with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Olivia Harris"}, {"rating": 3.0, "review": "Why is is that Apple TV has trouble connecting to my WiFi network, but my Sony Blu-ray player doesn't?  And my WiFi router is an Apple Airport.  I use Apple TV once in awhile, but it just reeks of mediocrity.  I was hoping it would be my go-to device, but I find the Sony device to be much more robust.", "verified": false, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "Bought it for my 90 year old mother so she could get MLB TV.  She missed her Dodgers since no one without Times Warner Cable can get the games in LA.  She loves it.  My brother set it up and said it was easy to set up.  If my 90 year old mother can figure out how to use it, it must be good.  I do not personally own one.", "verified": true, "helpfulness": "0/0", "author": "Katfox"}, {"rating": 5.0, "review": "Simple set up, Airplay for streaming iTunes content or mirroring your Mac/iOS device, and a growing assortment of channels make this a potent little box for your entertainment needs. I've been especially pleased with the channel additions. Netflix, Disney, Smithsonian and more have made this device a go to for me. My kids find it intuitive to use, too (ages 5 and 7). Altogether a surprisingly great device for $100.", "verified": false, "helpfulness": "0/0", "author": "John S. Surdyk"}, {"rating": 4.0, "review": "I bought this for my mom for Christmas, and i use it more than she does. The coolest thing about this is that, you can pretty much watch anything on the big screen from your ipad or ipod. Coincidentally, my mom bought me a Roku 3 on Christmas. Now don't get me wrong, the apple tv is a good product, but the roku has way more channels. I mean the roku probably has somewhere close to a thousand apps and channels (the roku has games also). The apple tv has like less than 30. I still think the apple tv is good, just not as good as the roku. The only advantage i see is that i can find a movie on my ipad and watch it on my tv through the apple tv. The roku only allows me to view videos from youtube on my tv, which can also be done on the apple tv. Now if the roku isn't an option for you, than get the apple tv. If you are comparing the two, i say get a roku.", "verified": true, "helpfulness": "0/0", "author": "philmoe"}, {"rating": 5.0, "review": "Tks. Good job.", "verified": true, "helpfulness": "0/0", "author": "raul ruiz"}]