[{"rating": 5.0, "review": "This is my second Apple TV.  The first one cost $99, and I liked it so much, I wanted another for the bedroom. Couldn't pass up purchasing for this price.", "verified": true, "helpfulness": "0/1", "author": "Price Matters"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Victor L."}, {"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the apple tv because there's a lot of features you can take advantages of. For example all the apps like netflix, hbo go, hulu plus, etc. I use apple tv a lot because it's so easy to move around. I have a play station 4 with the same apps but it's a hassle moving. The apple tv is so versatile and you can move it with ease. You just need to connect it to wifi and your all set! Also if you have a apple laptop or a apple phone you will be even more happier with this. Due to the fact that you can airplay them. For example your watching a youtube video on you phone or laptop but want a bigger screen. You just airplay the device and it links up to apple tv and will be show on your tv! The only thing I don't like is the remote. The remote is great but if you use it near an apple laptop the laptop picks the remote up so when you go up or down and someone is using the laptop the volume goes up and down. Also when you press the middle button iTunes turns on automatically. I'm pretty sure you can just fix the remote system so the laptop won't be affected through the laptop settings though.", "verified": false, "helpfulness": "1/2", "author": "Johnby"}, {"rating": 4.0, "review": "It is an OK product. Hope for more functions.", "verified": false, "helpfulness": "0/2", "author": "Thomas Jordan"}, {"rating": 5.0, "review": "I loved Apple product!", "verified": true, "helpfulness": "0/2", "author": "nes4bit"}, {"rating": 5.0, "review": "Very goood!", "verified": true, "helpfulness": "0/2", "author": "Transportation S."}, {"rating": 5.0, "review": "Works well.  Much better than Chromecast.", "verified": true, "helpfulness": "0/2", "author": "D. T. Oakley \"DTO\""}, {"rating": 5.0, "review": "I don't know why I was so late to get one of these. I've had it for about 5 days now and haven't used any other device connected to my TV since. I had recently bought chomecast as well about 3 months ago and I will not likely use it again for anything other then youtube or netflix (maybe not even for that).Ok so first there is always Apple packaging, if you have ever bought any of apples products in the past decade or so you know what I mean when I say you feel like you just got something special and very exclusive. I could tell you more but do you really care about that. I didn't think so, anyway simple enough its all just plug and play if you have a HDMI cable (amazon has bundles with a HDMI for a few dollars more) and the automatic set up/sync option (for those of us with and iphone, ipod or ipad with bluetooth) is very useful, you just turn bluetooth on and tap the Apple TV with it.2 quick suggestions regarding setup: - 1. Whatever you do, do not activate siri's voice (if you are at the initial setup screen for a while she well say tap the play button 3 times to activate voice \"something\" (I thought it was voice command but it is not. She just reads all information on what you are currently on all the time). I did this and at first thought it was cool (\"she's talking to me\") but she doesn't shut up and it gets really annoying. I was unable to figure out how to turn her voice off and had to clear all settings and start new. - 2. As soon as you can get an app for your phone, ipod or ipad to act as the remote (may not need it anymore after you've set up everything including all the apps that you will use. There is nothing wrong with their remote (in fact I love it, never really put it down) but when you need to type things its a real pain in the A** without a keyboard. For instance when your activating apps and stuff that may require you to sign into itunes or entering your wifi password or something of the like.their menu is just like on all there devices just a page with apps you could rearrange.Now quick comparison with chromecast.Biggest difference (and maybe the only one that matters, outside of content of course) between the 2 is that Apple TV has its own user interface (menu) that you can use to control it (via remote or remote app). Chromecast has no such function rather it is just a \"middle man\" really that is completely controlled by your everyday devices that you are very familiar with. Because of this you may find it a bit easier to use chromecast as you do the same as you would have before but after you just press that cast button. Chromecast doesn't really have apps but they do have support for some such as youtube netflix hulu the usual more common streaming services and because of this it turns your other device (phone) to a remote and takes over the connection to the internet. Positive for this is that you can still use your device (phone) for other purposes without interupting whatever you put on the big screen. I do not believe you can do this the same through Apple TV (but b/c you never needed to use your other device to go to these services in the first place, does that matter?) but still can be done just not the way you may be use to. That said using youtube and netflix are much quicker and easier, and in the formers case a lot more functional when its being controlled by your phone rather then Apple TV (I have yet to figure out if you can use your phone the same with Airplay [for ATV] as Chromecast). Chromecast unlike Apple TV, lets you mirrorcast your computer screen to the TV as well though if you try to stream video that way it will be very laggy/jumpy just not watchable so its good for just looking at a page but they even messed that up b/c the cursor is not visible on the big screen so your still looking at the laptop or computer screen when you need to click something or type in a new webpage. Such a shame b/c that could have been a big 1 up for chromecast (though it may be the only 1). Now ATV does come with free content some of which you can't get through chromecast such as option to watch some channels live through your ATV (providing you have the channel through cable already). Some channels like USA will allow you to watch some of their futured shows (recent, already aired) even without having their channel. I do not have USA yet I was able to watch  Mr Robot (very promising) and Complications through ATV, but when attempting to watch a movie they had, it wouldn't let me b/c I do not have their channel. It has all the same apps as chromecast that offer free content (regardless of cable subscription) as well though the only ones that are relevant (to me at least) are Crackle and redbull TV. Side note: there are a lot of apps geared toward childrens TV which can't speak on other then to say that I saw a lot. My big app and the driving factor that made me buy both chromecast and Apple TV is HBO NOW. We all know they charge 15 dollars to have the channel through cable then an extra 5 for on demand a month and some ppl like myself only got cable b/c we want HBO. As soon as I heard HBO Now is offered as a standalone service and Game of Thrones Season 5 was starting the following week I did a flip and ran out to buy chromecast (didn't know anything about Apple TV yet). Highly dissapointed as chromecast doesn't have support for HBO Now I had to use mirrorcast only to find the picture unwatchable. After complaining to a friend of mine, he said (in a condescending manner) \"Why didn't you just get Apple TV?\" and if he said in any other way then that, I might have listened rather then getting defensive and ignoring him. Anyway I ended up watching the second to last episode at his house and finally saw what Apple TV was and more importantly HBO Now works flawlessly on it. So I bought one. Sorry I know I said it would be short. Chromecast seemed to squander every opportunity they had to do something better then ATV even when you think there is something, you'll find there really isn't but it was close. Anyway ATV is flat out better and if you already have the means to watch whatever you want whenever you want on your iPhone or iPad via a certain app most of us know about you could use airplay to send it to the ATV and watch on the big screen.", "verified": true, "helpfulness": "2/2", "author": "stone27"}, {"rating": 5.0, "review": "everything went very well!", "verified": true, "helpfulness": "0/1", "author": "ricardo romero"}]