[{"rating": 5.0, "review": "Wow with Apple TV I can stream from my iPad anywhere in my gym. This is making teaching very interactive for the kids. Thanks Apple.", "verified": true, "helpfulness": "0/0", "author": "Huskerfan58"}, {"rating": 5.0, "review": "I love this device because i can watch great movies using wireless and my family enjoy them its fun to watch with family and friends", "verified": true, "helpfulness": "0/0", "author": "shanell reckley"}, {"rating": 4.0, "review": "...which is what I think everyone has to say about this product.  It makes it possible to have all the specialty programming I want (NBA TV, iTunes, etc) without the necessity of cable.", "verified": true, "helpfulness": "0/0", "author": "Lily Maase"}, {"rating": 5.0, "review": "Just an awesome product.  It is a must have for any apple lover.  Remote is really small so just be careful not to lose it.", "verified": true, "helpfulness": "0/0", "author": "robbie schweizer"}, {"rating": 5.0, "review": "This is my 3rd Apple TV. I love these things. I have no complaints and would not hesitate to recommend this item.", "verified": true, "helpfulness": "0/0", "author": "Sandy S \"Sandy S\""}, {"rating": 4.0, "review": "we love it. use it all the time to stream from iPad. we can also show off our photos and stream music from our computer.", "verified": true, "helpfulness": "0/0", "author": "Steve J Schmidhauser"}, {"rating": 5.0, "review": "I wish I had one years ago. This is so convenient for me when I want to watch Netflix. I used to have to go thru the wii game console  to do that but it's easier, quicker and simple to access with Apple TV. I also watch a lot of HBO and again, much easier than going thru the comcast tuner. I really enjoy using my lolo exercise apps on it too! This works with my iPhone which has \"airplay\" and when I turn on the \"mirror\" switch, the lolo app will display on the tv screen! The Apple tv is super easy to set up, and if I misplace the remote that comes with it, I can use my iPhone as a remote!!", "verified": true, "helpfulness": "1/1", "author": "C.Wolf"}, {"rating": 5.0, "review": "So happy with this purchase, I'm in the process of getting 2 more for my nephew and sis. Thanks apple!", "verified": true, "helpfulness": "0/0", "author": "Corymia"}, {"rating": 5.0, "review": "Integrates well with the rest of the system.  Plays all of the computer-based content, iCloud, and all of the other things like Netflix, Hulu, etc...", "verified": true, "helpfulness": "0/0", "author": "Thomas Oliver"}, {"rating": 5.0, "review": "In the past, I always used my Wii to stream Netflix and that was really a pain.  The remote for the Wii was hard to use to click what I wanted to.  However, the Apple TV remote is simple and very easy to use.  I also downloaded an app on my iPhone that lets me use my iPhone as a remote for the Apple TV.  I can also use the Apple TV to put whatever is on my iPhone or MacBook Pro onto the TV (mirroring).  I love that I can play my music that's on my phone or computer through my TV by streaming it to my Apple TV.  I also love how many apps it has.  I can watch Netflix, HBO Go, Hulu, and even some of my movies that I have in iTunes on my computer.This product really works best if you have other Apple products to use it with.  I love the Apple TV, but I probably would have purchased the Roku if I didn't have a Mac laptop and an iPhone simply because it's cheaper than the Apple TV is.", "verified": false, "helpfulness": "0/0", "author": "EAJ08"}]