[{"rating": 5.0, "review": "Very easy to install & works great!  Easy to navigate. Gives you a nice variety of  TV shows, movies to select from", "verified": true, "helpfulness": "0/0", "author": "Greg Baxter"}, {"rating": 5.0, "review": "Bought this as a Christmas gift for my daughter and she is thrilled with it.  Says it offers so many online viewing options that she is cancelling her cable service.", "verified": true, "helpfulness": "0/0", "author": "rakrti"}, {"rating": 5.0, "review": "Arrived as expected.  Love it. I cancelled Sirius radio when I started playing it.  Also I now can get Netflix.", "verified": true, "helpfulness": "0/0", "author": "Raleigh"}, {"rating": 4.0, "review": "Bought for a gift for my 77 year old mother. Mr. Tech Support had to figure the thing out (actually called on my 28 yr old son to help with AirPlay)Works well, just one regret - I could have had \"Geniuses\" configure it for me!", "verified": true, "helpfulness": "0/0", "author": "L. Smith"}, {"rating": 5.0, "review": "So Apple TV is pretty awesome. It's fast, easy to navigate and is constantly adding new contents partners. So what is a downside of Apple TV? Honestly there is not much but a few things you should think about before buying one.If you are just wanting Netflix and could care less about viewing photos, mirroring displays, renting or buying movies and TV shows or playing music then Chromecast might be a better option for you. It's also less then half the price of an Apple TV.There are other options out there such as Roku. Roku is more open and has access to a bit more content, but that content is more obscure for most people and Apple TV has all the big players on board.  Where Apple TV is better then a Roku IMHO is interface and usability.  Roku is great but the interface can at times be slow and annoying. Apple TV has it's issues here and there as well, but using both for the last few years I get far fewer issues with my Apple TV, and Roku is very slow to update when issues arise.  So if you are the kind of person that has to have every single content provider under the sun a Roku is a damn fine device. If you are looking for all the best mainstream content with a lot of extras and a smooth interface then Apple TV may suit you better.", "verified": false, "helpfulness": "1/1", "author": "R. Windsor"}, {"rating": 5.0, "review": "I tried this and the Roku. I found that the the Roku had WAY more channels (apps), but in the end, I opted for the Apple TV since I probably wouldn't even watch 1/16 of the media available on the Roku. The AirPlay functionality really sold me, as I am able to stream my Xfinity online media to my TV, as well as all the media that is not on the Apple TV yet. So who cares if I don't get the Korean News channel or the vintage horror movie channel...Between Hulu, Netflix, HBO, PBS, ABC, and the AirPlay option, I'm all set.The device itself is true Apple...High quality, great UI (Way better than Roku), easy to  use, and the remote is small, functional and works well from a distance. If you own a Mac, the remote also doubles as a remote for the computer as well.Great functionality with iTunes and Home sharing, as well. I am able to play my entire iTunes library through the Apple TV, which then goes through my sound bar.I love it! Keep those updates coming, Apple!", "verified": true, "helpfulness": "2/2", "author": "M. Brown"}, {"rating": 5.0, "review": "Apple TV rocks! Make your tv into a mobile system, love the airplay feature for sharing YouTube videos, pictures, and videos! Definite must have for apple families. Can't believe we waited this long to get one!", "verified": true, "helpfulness": "0/0", "author": "Bugz"}, {"rating": 4.0, "review": "had a little trouble with airplay at first,  but i managed to fix it, very user friendly and great for anyone! only thing i would want is to be able to search the web. otherwise great for the price", "verified": true, "helpfulness": "0/0", "author": "Jesse Alcantar"}, {"rating": 5.0, "review": "I had my eye on this item for a month. The price was reduced and it was one of the top deals for year 2013. Great price and fast delivery! I'm very pleased! ✔💯", "verified": true, "helpfulness": "0/0", "author": "Ebony Steppes"}, {"rating": 5.0, "review": "It works nicely using airparrot for my older mac to stream to my monitor. Tho you probably don't need airparrot if you wanna stream movies/music because itunes can do the same thing.", "verified": true, "helpfulness": "0/0", "author": "Technocrat"}]