[{"rating": 4.0, "review": "Great product however I just realized I would need aHDMI cable when trying to install it. The vendor shouldhave specified that the cable is not included.", "verified": true, "helpfulness": "1/1", "author": "Lucy"}, {"rating": 4.0, "review": "I really like this product, but Apple needs to be able to add more apps, the lack of available free tv on this product make it hard to LOVE it :) content that is free on the internet, cost on Apple TV, that's not hot!!!!", "verified": true, "helpfulness": "0/0", "author": "A. Smith"}, {"rating": 5.0, "review": "If you own an iPhone or an iPad, this is a must buy. We use it all the time. Apple makes everything so simple to use. I have taken ours with us on vacation to play movies for the kids and pix of the day.", "verified": false, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "The Apple TV box is great. I primarily use it for Netflix and streaming pictures and projecting images from my Iphone and Macbook. Careful though, because episodes from itunes are super expensive, some of them are nearly $5.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 4.0, "review": "Works extremely well with my iPad and iPhones. Love the Airplay features. Set up took me under 5 minutes. We use the Netflix features daily. It would be even better if Apple and Amazon get together and approve use of Amazon prime videos with the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Hong Carrillo"}, {"rating": 5.0, "review": "This device is really worth getting if you have an iPhone or iPad. The remote that comes with it is okay but the device really shines when paired with an iOS device using the remote app. The YouTube app on this is great and so is the music application (which I have paired with iTunes match).If you don't use iOS devices you might want to consider a Roku.", "verified": true, "helpfulness": "0/0", "author": "JS"}, {"rating": 3.0, "review": "I was disappointed because I am unable to directly stream video from my macbook air through the apple tv (wirelessly), which i was told by an apple tech at a store that \"yes that is how it works\"....hello tech lady, you can stream \"audio via iTunes\" but anything visual requires a separate HDMI cord from your computer to the tv which is what I was trying to avoid in the first place. Since ITUNES competes with AMAZON and HBOGO. You are unable to have those options either ....However the \"airplay\" works great using my macbook or IPhone as remotes for certain HULU or NETLFIX shows !! There are other amazing options with being able to transfer data wirelessly (everybody hates cords).  As long as you understand what your buying it can be a great addition to any entertainment center.", "verified": true, "helpfulness": "0/1", "author": "Brett"}, {"rating": 5.0, "review": "I purchased this product primarily for the purpose of hbo go streaming. Although hbo go does not have a standalone apple tv app yet I found it to work very well with my iPad. It does not freeze at all and streaming hbo go and Netflix is so smooth. It never buffers. The interface is also very well layed out and easy to use. I also own a roku hd which has the standalone hbo go but constantly locks up and has choppy streaming. The only thing better about the roku is that it has more apps/ channels. Hopefully Apple TV will gain more channels such as amazon prime, showtime, and starz in the future", "verified": true, "helpfulness": "1/1", "author": "HD Enthusiast"}, {"rating": 5.0, "review": "The packaging was totally apple-style, very elegant. Functioning well, intend to get an airparrot to mirror my PC. Overall satisfied.", "verified": true, "helpfulness": "0/0", "author": "Ha Vinh Loc"}, {"rating": 4.0, "review": "They collect me the shipment and tax, and it supossed they didn.'t I just hope this product can be hackeed soon so I can see more TV series and movies", "verified": true, "helpfulness": "0/0", "author": "George"}]