[{"rating": 5.0, "review": "Just before I bought my husbands Christmas gift he came home talking about this and since he is an electronics buff I ordered it and he loves it. It arrived quicker than I expected, too.", "verified": true, "helpfulness": "1/1", "author": "Pam Davis"}, {"rating": 5.0, "review": "Bought this for christmas for my husband and kids and they love it! I was going to purchase it through the Apple store but I always check Amazon before I buy anything because it tends to be cheaper. I was surprised to see that it was being that generally Apple products are the same price everywhere. Even got the HDMI cable through Amazon together with the Apple TV and it was cheaper than purchasing just the Apple TV through Apple!", "verified": true, "helpfulness": "1/1", "author": "kb"}, {"rating": 2.0, "review": "So after reading about the roku and the apple tv, I decided on the apple tv because I was sooo keen n the Airplay and Airplay Mirror features as we have a number of iPads and iPhones in the house. Setting it up out of the box was easy using the wired internet connection. Then I tried pulling out the ethernet cable and it was easy to set up the wireless connection. I have the iPad 2 and could get some apps to show the Airplay icon, but no matter what I did, I could not get the Airplay Mirror to appear when accessing the recent apps (double click on the  Home button). After doing some research, I upgraded the  apple tv to the latest version. Thats when everything fell apart. No more wifi!!!! It now only worked with the ethernet cable, even after resetting and restarting the router and the apple tv.I also have a Sony 3D DVD player with wifi (BDP-S590) which I paid the same price as the apple tv and it has more capability than the apple tv. So I am taking the apple tv back for a full credit. If the airplay would work, that alone would have warranted me keeping it as I can see the value of sharing my iPad screen on the tv.Apple, y'all need to do a little more work on this puppy!", "verified": false, "helpfulness": "0/3", "author": "Dissapointed"}, {"rating": 5.0, "review": "Apple TV is great, as long as you have media to use it with. (iTunes, hulu, Netflix, ect.). I have many purchased items from iTunes, and I can stream them on Apple TV without downloads. This thing is great when u use it right.", "verified": false, "helpfulness": "1/1", "author": "Miles"}, {"rating": 4.0, "review": "I gave this to my boyfriend for Xmas. He has a late 2010 MacBook Pro, running the latest OS system available right now. While he was able to connect it to the TV and get it running fairly easily, including streaming his music onto it, as well as his Iphone 5, he wasn't imeediatelly able to stream any of the movies we had downloaded onto his computer.After he did some research online he found something called \"Air Parrot\" that solved the problem. ps. he said iif his macbook had been a 2011 or newer it would've worked out of the box.Oh and it xcomes with a new remote too that works for his macbook as well. It was a good buy overall!I like my Roku better...but he's a Mac/Apple guy and I would recommend it if you are one too...otherwise go with the Roku.", "verified": true, "helpfulness": "0/0", "author": "madenbrazil"}, {"rating": 5.0, "review": "I bought this after purchasing my iPad 3 and I absolutely love it! Easy to use out the box. You are able to stream true 1080p movies from iTunes. My favorite feature is the ability to use my photos on my PC as a screensaver and still play music.  It's great when I host parties.  My guest enjoy looking at the thousands of photos of family and friends.  The mirror feature for the iPad is also wonderful.  I recommend this product to anyone with an apple mobile device.  A++++++++", "verified": false, "helpfulness": "1/1", "author": "shiniqua carter"}, {"rating": 4.0, "review": "Not sure if it is my router or what the problem is. Called Apple to set up the Apple TV and computer. We had everything set up properly, but it didn't work until we shut down and reconnected our router and cable. We'll see if it works better with an up-to-date router. The instruction booklet that came with the product needs better instructions for trouble shooting.", "verified": true, "helpfulness": "0/1", "author": "patty"}, {"rating": 4.0, "review": "It is slowly taking over as the go-to choice for TV time. We are using the Apple TV more and more and cable less and less. I have a Roku device, which has a great content lineup, but the Apple TV interface is so much better. The remote control is too small and slick. I drop it all the time and because of its aluminum build it scratched my wood table.", "verified": true, "helpfulness": "0/0", "author": "Tom Pomponio"}, {"rating": 4.0, "review": "Love how easy it is to set up and get going with Netflix and the iTunes store. The product design is great. Small form-factor box and remote, not a lot of buttons to fumble around with. Netflix operation is nearly flawless compared with other media PC options I have used in the past (Windows Media Center, for example).What is missing from this product (and the rest of the Apple iTunes setup) is a server device so I can effectively play my movies that I have in mp4 format using the Apple TV. Currently you have to have another computer running iTunes with Home Sharing enabled to be able to play your movies that are not downloaded from the iTunes store. On top of that, the Home Sharing setup is not the most reliable. I have had to restart iTunes on my computer and restart the Apple TV to get the Home Sharing library to show up on the Apple TV. It just seems to stop working occasionally.Apple, get your act together. Put in some way to stream movies from either a NAS device or a home server to the Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Kevin Neubauer"}, {"rating": 5.0, "review": "This item came in the mail expeditiously and it works perfect.  Arrived before Christmas Day.  Looks good and works fine.", "verified": true, "helpfulness": "0/0", "author": "Rod Woods"}]