[{"rating": 5.0, "review": "Awesome and easy for even a techno-phobe to set up.", "verified": true, "helpfulness": "0/0", "author": "Ilana M Garon"}, {"rating": 5.0, "review": "It's great for what it is...I only bought this to stream video from iPad and iPhone at home along with better access to my iTunes library without going to the computer.  Works great!I love all of my Apple products however I'm sticking with the Roku 3 for my Netflix amazon prime instant video, pandora, Sirius xm and everything else.", "verified": true, "helpfulness": "0/0", "author": "Trip"}, {"rating": 5.0, "review": "If you have Apple products stick with Apple TV since everything syncs w/iPhone, iPad etc.  Since I don't have Cable in my room this works great to watch Netflix, HBO etc.  Also if you have Amazon Prime account you can use your iPhone/iPad via airplay to watch on the big screen", "verified": true, "helpfulness": "1/1", "author": "TeddyP10"}, {"rating": 4.0, "review": "Mostly works. The industrial designer(s) who designed the case and remote did a fantastic job!!! Kudos!The issues I have had may be with the apps I have been using. Works great with my iPad. I have not been able to find out how to display my PC screen on my TV.", "verified": true, "helpfulness": "0/0", "author": "Capt Bob"}, {"rating": 5.0, "review": "I love my Apple TV, makes streaming so easy", "verified": true, "helpfulness": "0/0", "author": "Justin Tolentino"}, {"rating": 2.0, "review": "I guess I would give four stars for function (maybe even five when the new one comes out).  But Several of the channels DO NOT work with Comcast customers.  The whole reason I bought this was for easier access to the history channel and now I'm on their forum trying to find the back door to watch the history channel because Comcast/xfinity is NOT listed as a provider. So far this is an issue with A&E;, lifetime, history, CBSgo maybe a couple others?  I guess it's comcasts fault but maybe worth looking into if you are their customer. I guess we will be streaming the XFinity go app through our phones to the Apple TV?  Not really convienent.", "verified": true, "helpfulness": "2/3", "author": "mrs.z"}, {"rating": 1.0, "review": "Very slow", "verified": true, "helpfulness": "2/4", "author": "Avinash Bhosale"}, {"rating": 5.0, "review": "Bought this for my 15 year old daughter.  She loves it!!!!", "verified": true, "helpfulness": "0/0", "author": "Rhonda"}, {"rating": 5.0, "review": "Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Rocio"}, {"rating": 4.0, "review": "I don't use apple software or products very much and you have to either pay for extra services or be a cable subscriber to get certain content.  The point of boxes like these is not to have cable, so it is limited in use for me.  It works great though, streams content nicely.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]