[{"rating": 5.0, "review": "As the title hints, our household is already well furnished with Apple products. And as it has been said in other reviews in this thread, it will be a much more positive user experience for people who have Mac computers, or iPad / iPhone / iTouch, for these last three can be used as remote controls with an excellent free app (\"Remote\") from Apple.If it were not for Apple's attention to detail, the installation of the Apple TV could be a bear for less technology-savvy consumers. But, even though I've installed a network or five before, in my mind this couldn't have been easier. Opened up the package, plugged stuff up, and things came right up on the screen. Used the included remote to log in. It should be noted that logging in (This means you have to have an Apple ID login and password) must be done on all devices you plan on involving in what is essentially a kind of network parallel to the wi-fi network you have in your house (although of course it runs on it).You must log in, and turn on Home Sharing, on the Apple TV, in iTunes on any computer you're planning on using, and also on any  iPad / iPhone / iTouch you're using as a controller. It should also perhaps be noted that these logins are separate from logins and passwords you may be using for Netflix, Hulu, or any other media you are accessing through Apple TV. This all takes some time, but it's a one-shot deal.The nicest surprise (which I had not come across in my research) about the Apple TV is that it includes a high fidelity TOSLINK optical audio out connection in addition to the HDMI connector. The Sony receiver on our home stereo is rather old-school in that it predates HDMI, so we weren't going to be able to run the Apple TV signal through that. Instead, I'd have to run the HDMI cable directly to our Samsung HDTV. However, the receiver does have TOSLINK inputs, so I just use a cable I had lying around, and I have excellent sound through our stereo speakers.Once everything was up and running, I was very gratified by the far better picture and sound that I was getting compared to streaming Netflix through the Wii (which we have done for several years heretofore). I already knew that the Wii's specs for picture and sound were pretty low, but for me, the increase in performance alone was worth the price of the Apple TV and cable.Apple's attention to the end user experience has always been one of the best features of owning their products, but the icing on the cake for Apple TV is the \"Remote\" app. Free, simple, and elegant. Once I used it, I knew I'd have to put the included remote in a safe place, because I wouldn't be using it again except in some extraordinary circumstances.There are some complaints in the reviews that the Apple TV lacks certain online media services. This may be the case, but for what it does provide, and for how it performs, we are very pleased.Addendum: This Apple TV is just the gift that keeps on giving. I was under some misapprehensions about the capabilities of AirPlay, specifically AirPlay Mirroring. Google it, go to the Apple support page, and then do enough links. Photos and music may be displayed from your iDevice simultaneously through the Apple TV to your HDTV. Great!", "verified": true, "helpfulness": "696/783", "author": "rico567"}, {"rating": 5.0, "review": "This is a must have accessory for anybody that has a Hi Def TV and iTunes on their computer. The simple ability to stream to my new Hi Def TV was reason alone to get this product and the ease of setup and use makes this the best $100.00 that I have spent for a long time.  OK, so I am a beginner to Mac products (I am a die-hard PC user) but I would not even begin to look for something negative to say. Sure, other more experienced persons might have wished for more but for me its GREAT.Ease Of Setup: 10Ease Of Use: 10Will it get me looking at other Mac products?  Definitely!", "verified": true, "helpfulness": "10/12", "author": "Paul L. Thwaites"}, {"rating": 4.0, "review": "I'm basing my review off of the 3 big streaming solutions I currently own: The Apple TV, the Roku, and the Xbox 360. They're all good products, and they each have a slightly different purpose for existing. Below I review the Apple TV, and then compare it to the other solutions.What does the Apple TV have going for it?- The Apple TV syncs beautifully with all of your other iOS devices (iPhone, iPad), and now it also works wonderfully with Mountain Lion for Mac. Quite honestly, this is what makes this product so special. The ability to connect my iPhone up via AirPlay and listen to Spotify and Pandora in addition to my iTunes library is fantastic. With AirPlay Mirroring you can even watch apps like CNN live on the Apple TV (via the iPhone / iPad app). It seems almost like a bonus that it streams Netflix, and now Hulu Plus.- The biggest drawback this thing has going for it is apps. While you can now do much of these via the AirPlay mirroring, it would certainly be nice to have a dedicated ATV app. Especially for those without iPhones / Macs.- The pricing isn't bad in the iTunes Store. TV Shows run at $1.99 / episode ($2.99 HD), and movies you can rent for $3.99 ($4.99 HD). This is the same exact price you'll see in Amazon Instant.How it compares.To Xbox: Xbox 360 really has an ideal package going for it. It has a large library of apps (and continues to expand) and can play all the latest games. The apps range from Amazon Instant (a good equivalent to iTunes, though I notice more lag with Amazon), Netflix (the standard on everything), Hulu Plus, Hbo Go, and more. With the exception of Netflix and Hulu, everything else is missing in the Apple TV. I decided to start watching Netflix on ATV because the Xbox seems to lag with video streaming apps, but for everything else it works fine. Biggest drawback is price... While you can get a decent Xbox for $200 these days, you also pay annually for Xbox Live Gold to keep these apps. That'll run you an extra $60. You really don't find your value in Xbox Live unless you're also a gamer as well.To Roku: I like the Roku. It has a lot of the same apps as Xbox (with a few extra goodies like Pandora). You can use a lot of stuff without needing an iPhone or apple device. And it's a bit cheaper than the ATV or Xbox. This gadget seems to lack in video quality (noticed a big difference in color streaming with the Xbox and ATV), and occasionally the audio would cut out out on certain settings, but it does the job if you want a simple streaming device. They allow for people to make apps and add it to their market but, alas, it seems the marketplace has become stale. In the last 6 months I can't think of any apps that I downloaded and actually ended up using.In the end...Get the Apple TV if: You are looking to stream content flawlessly from iTunes, Netflix, or Hulu. And if you ALREADY OWN iOS devices / Mac computers.Get the Xbox 360 if: You like a lot of apps AND are into gaming. Otherwise you can go with option 3... The Roku.Get the Roku if: You're looking for a simple streaming solution that's easy to set up. It doesn't have any extra bells or whistles, but I'm guessing many people out there won't be looking for that. They'll just want to stream their content!Happy to answer questions below!", "verified": false, "helpfulness": "1/2", "author": "Justin Huskey"}, {"rating": 5.0, "review": "I've been wanting a Apple TV since I got my iPad so that I could watch movies from my iPad on my TV.  Unfortunately, Apple TV is a HDMI output only device, which sucked cause my TV although full HD is a older model that doesn't have HDMI inputs.  So I really thought I was screwed and wasn't going to be able to use the Apple TV as I really wanted to unless I bought a new TV.  Well that was out of the question so I started looking for HDMI to composite converters and thanks to Amazon again found ViewHD Two Input HDMI to RGB Component YPbPr / VGA 2x1 Switch Converter Support 5.1CH Surround Sound, did take about a hour to get everything right and set up but thankfully it converted the signal from the HDMI on Apple TV to the YPbPr connection.  Setting up aside, the Apple TV is amazing, its basically like getting iTunes to run on the TV screen.  So i'm glad that after all that had happened that I got it, was well worth it.By the way some have been saying that ViewHD Two Input HDMI to RGB Component YPbPr / VGA 2x1 Switch Converter Support 5.1CH Surround Sound doesn't work with Apple TV Gen 3, and it may not depending on your set up but for me it works fine and my TV is a RCA 55' Full HD 120Hz from probably 2004 or 2005 can't totally remember think I bought it Christmas 2004.", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 5.0, "review": "What can I say...I've never had a complaint about anything Apple, from iPhones to iMacs. The gift recipient loves this latest generation Apple TV, especially since he can stream Netflix directly through the device and interface apps from iPhone to TV.Apple items don't have sales, but I always found anything Apple to be worth every penny.Amazon shipped this directly to my gift recipient in another city right on time.", "verified": true, "helpfulness": "0/0", "author": "e-findz"}, {"rating": 4.0, "review": "Ok, so I bought this at a Best Buy a couple of weeks ago and it is a great addition to my apple inventory. I use both, Apple and Android so I don't like one over the other. Now for the main review on the Apple TV...I will separate this review into sections for your convenience...==== Air Play ====Personally, this was the main reason why I bought the Apple TV. I own two iPod Touches and an iPad and I use the Air Play on the Apple TV a lot. I can easily steam over to the Apple TV without any problems and it is really easy to do. I end up mirroring Youtube videos onto my TV Instead of watching them on the small screen. This is probably one of the best things about the Apple TV. If you don't have other Apple Devices and are just looking for a media box to stream netflix, huluplus, etc on your TV I would recommend buying a different product instead as they tend to have more features to them then the Apple TV.==== 1080P Content ====When renting or buying movies in the iTunes Store you can watch everything in 1080P! That is Full HD! You can also watch previously owned movies on your Apple TV so you don't buy them over again you just start enjoying on your TV Instead of an iPod/iPhone/iPad screen.==== Content/Channels ====The main downside to an Apple TV is the amount of content/channels it supports. It doesn't have as many channels as other media players like the Sony SMP-N200. If you want something cheaper, but with more channels and don't plan on using AirPlay then I would go with other options; however, if you do own other Apple Devices that are capable of AirPlay then this is a Great Buy! You can now have everything that is shown on your iDevice's screen on the screen of your TV! That is what makes the Apple TV such a popular product.Overall This is a great product that I really enjoy using and it adds to a great addition to my other Apple devices. I wish it would have more channels/content, but it does balance out since the Apple TV has AirPlay. I rate this product 4 stars out of 5 stars.I hope this review helped you out!", "verified": false, "helpfulness": "5/5", "author": "Eduardo Placido"}, {"rating": 2.0, "review": "The description on the Amazon product page says it mirrors \"ipad content\" but I didn't learn that actually it only mirrors iPhone 4 or iPad 2 and 3 until after I bought and hooked up the Apple TV device.  Well, guess which two products I have that I wanted to mirror the content with but can't.  Very disappointed the description didn't state this.", "verified": true, "helpfulness": "0/2", "author": "Ragamuffin"}, {"rating": 1.0, "review": "I have had this for a couple months now.  Overall, I have pleased with it.  A little bumpy at first due to I had to keep signing in and out of Itunes and home sharing numerous times each day to get my Itunes Media to stream.  Has gotten better, I just have to close of of Itunes each morning and relauch it for my library to come back up on the AppleTV.  Not the fastest streaming compared to something like Netflix but I am assuming it is due to the higher quality picture ATV puts out.  So those with slower internet connections (probably 6 and below) will not like the buffer time.  Airplay is great but keep in mind not everything is airplay supported, for example HBO2GO.  Getting HBO on board and a bigger selection of apps, LIKE AMAZON INSTANT, would make this worth every penny.  Hulu Plus was recently added which will help alot of people cut cable or dish.  Not quite a cable cutter for me since I have a handful of TV shows not on Hulu that I watch and paying $3 a episode in the Itunes store is not going to happen.EDIT 11/24..DROPPED THE RATING FROM A 4 STAR TO A 1 STAR.  APPLE RELEASED A UPDATE THAT HAS RUINED MY AND OTHERS (GOOGLE IT) AIRPLAY.  I HAVE TO RESTART ITUNES AFTER ALMOST EVERY SONG OR I JUST GET THE ENDLESS LOADING SYMBOL.  I CALLED APPLE TECH SUPPORT AND THE REP WAS RUDE AND WANTED TO CHARGE ME TO GET HELP FOR A PROBLEM CAUSED BY APPLE.  APPLE IS GOING DOWN THE TOILET!", "verified": true, "helpfulness": "12/25", "author": "Shay44"}, {"rating": 5.0, "review": "If you have all elements in place IE: HDTV internet access this thing performs flawless out of the box set up takes less than 5 minutes. I recently dished dish network and the countless channels that I had to get this. I put it in myson's room so he could access my Netflix account granted there are not a lot of channel selection with this however, for the reason I bought it the unit gets five stars for it's quality speed and no loss of service great unit and with the ability to share from your iTunes under home sharing and push from i-cloud can't be beat I don't even leave feedback's that often but had to on this one and no I don't work for apple I am a blue collar worker with a white collar lust for products that work like this.  Thanks, Patrick", "verified": true, "helpfulness": "1/1", "author": "1966"}, {"rating": 5.0, "review": "What else is there to say?  The UI is excellent and very quick to respond to commands.  It's much less laggy than the TiVo UI.  You get access to a whole bunch of video and music sources.  It's tiny.  It's beautiful.  It's 1080p.", "verified": true, "helpfulness": "0/0", "author": "Christopher Esplin \"I get into non-fiction, particularly history and social science literature.\""}]