[{"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Vasiliy Smirnov"}, {"rating": 1.0, "review": "Disappointment.  This item does not support Netflix.  My fault, I should have checked better.  Otherwise, it works as described - not the sender's fault.", "verified": true, "helpfulness": "0/6", "author": "Louise B Louguet"}, {"rating": 5.0, "review": "Works perfectly.  Just what I expected", "verified": true, "helpfulness": "0/0", "author": "Edward B. Macdonald \"Hifin 1\""}, {"rating": 4.0, "review": "Does everything that was advertised, running Netflix from my IPOD to myApple TV", "verified": true, "helpfulness": "0/0", "author": "RJB"}, {"rating": 5.0, "review": "I wanted this Apple TV to work with my IPad, so I could use with YouTube and Netflix. What is even better is that not only are Netflix and YouTube already on the Apple TV, there are many other program channels I can watch past episodes and documentaries from like History, and Smithsonian. Set up was very easy, just remember you do need to have a modem for it to draw internet access from (mine is wireless)  and you need a HDMI cable to connect the AppleTV to your TV, which can be purchased from amazon as well.", "verified": true, "helpfulness": "1/2", "author": "Ladibug21"}, {"rating": 5.0, "review": "Just fine", "verified": true, "helpfulness": "0/0", "author": "Driver's Uncle"}, {"rating": 5.0, "review": "by far the unsung hero of the Apple lineup. The Apple TV has turned in to a staple of my entertainment life. There are so many functions to list, a lot of people are excited about the movies and tv capabilities--I agree they are incredible.A standout feature is using this in an office -- if you have a meeting and need to do a presentation you can simply use air play and run it directly from your MacBook or your iPhone with Keynote. I find this a feature I am using daily at my office or at home when I want to take advantage of my larger TV screen.Overall you can't go wrong, if you use ANY other Apple products this has a home right there next to your TV. Stop reading and buy it", "verified": true, "helpfulness": "0/0", "author": "Maybach"}, {"rating": 5.0, "review": "Recommend to anyone.  Works great.  Only downfall is the HDMI cable is not included.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "Excellent as APPLE is always.", "verified": true, "helpfulness": "0/0", "author": "Marcus P."}, {"rating": 4.0, "review": "My family loves it! I have 3 little ones under 5. The remote is hard to keep up with and you HAVE to have it in order to use it. I wish you could update with other other apps, but it serves our purpose.", "verified": true, "helpfulness": "0/0", "author": "Andrea Gunning"}]