[{"rating": 1.0, "review": "Only gave it one star because it wouldn't let me give it zero.  We are an avid apple family, but Apple TV is a terrible product.  Slow, unreliable, constantly requires being disconnected from tv and hooked up to the computer for service updates.  Airplay is buggy.  At apple supports suggestion added a new AirPort Extreme router, and airport express extenders...  None of it worked.  By the way our second generation Roku worked flawlessly on all network router configurations.  Happily threw the Apple TV out the window went back to the old Roku and looking forward to picking up a Roku 3...", "verified": false, "helpfulness": "0/1", "author": "Molly F. Peacock"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Richard Sanchez"}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "nguyenho"}, {"rating": 3.0, "review": "Had issues with it updating. Kept getting stuck on \"getting date and time.\" Tried resetting it with iTunes twice. Finally got passed it by pressing the menu button on the remote while it was stuck. Roku is much nicer but iOS/Mac devices can't \"airplay\" to it.", "verified": true, "helpfulness": "0/0", "author": "Joshua Sullivan"}, {"rating": 4.0, "review": "Petty good looking at it now. Only thing it cuts off some time.", "verified": true, "helpfulness": "0/0", "author": "tracey gant"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Chris Scholler"}, {"rating": 5.0, "review": "My family really likes this. We primarily use it for Netflix and YouTube, but my wife also uses the PBS app to watch her shows. We've been having some difficulty with signing in to other apps like Showtime and HBO, but that could be an app problem, or a Charter issue. My last complaint - they dropped the price by $20-30 after I bought the **** thing.", "verified": true, "helpfulness": "0/0", "author": "G. Johnson"}, {"rating": 5.0, "review": "Awesome product. I don't even use my xbox anymore because hulu and netflix are on it.plus all the movies I bought on iTunes as well. Worth the money!", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 1.0, "review": "I want to note this is my personal experience with this product. Further, I have the latest Ipad and an Iphone 6+ as well as as a MacBook Pro. I mention this because I have purchased Apple products for many years and am rarely disappointed by Apple products (except for the Apple GS2 back in 1990). That said I must say I am tremendously disappointed in this product. The name of the product has always kept me from even looking into purchasing it. I thought Apple TV was an actual TV and I always thought that was somewhat silly. It was not until Apple won the rights to the stand alone HBO Now (which is outstanding) that I finally looked into it and found it to be basically the same as ROKU. ROKU obviously stands heads above Apple TV but I didn't much care because of HBO Now.Setting it up was a breeze and I really like the presentation of the channels. Very creative and well thought out. I was tremendously excited. That was yesterday. Today not so much.I invited a couple of friends over to look at the device and how nicely HBO Now was presented. To my dismay there was a message on the screen which read \" connect to iTunes.\" Apparently my Apple TV needed to restored and the only way to restore is literally to disconnect from TV equipment and go to a computer and plug it in to iTunes. There are a total of SEVEN steps I must follow. I am stuck on number 1 because what is supposed to pop up on the screen is not happening. Granted this may be my error and it is possible I am doing something incorrectly but the point is...this is brand new! Is this going to happen often? Am I going to have to take an hour of my few free hours to restore my device on a regular basis? Not gonna happen.I'm likely going to return this product to Amazon. I rarely return things and being awesome as they are (which is why I spend so much money with them) they will give me my money back and as a Prime Member most likely even pay for shipping. In all the years I have made purchases on Amazon I think this is only the second extremely negative review and it is only because of my experience and frustration. However, I wanted to keep it real and share my honest review of this product.", "verified": true, "helpfulness": "0/1", "author": "Robert Jackson"}, {"rating": 5.0, "review": "Best purchase!", "verified": true, "helpfulness": "0/1", "author": "dz."}]