[{"rating": 5.0, "review": "I have now had Apple TV for nearly 2 years. We got Apple TV to watch Netflix instant on it. But it's been so much more. We now rent movies from iTunes at least 2 times a month, plus we listen to music, watch YouTube videos, and now it includes HBO Go and Watch ESPN!", "verified": false, "helpfulness": "1/1", "author": "Nick"}, {"rating": 5.0, "review": "I love it ,i love it...... This item is very cool and we used it every day to watch our iphone-ipad,iPod and my iTunes in our big screen tv.. Love it yes i recommended", "verified": true, "helpfulness": "1/1", "author": "Ibrahim  Badr"}, {"rating": 5.0, "review": "For a relatively low price, I think this is a great gadget and does a lot of neat things. Remote control is not good.", "verified": true, "helpfulness": "1/1", "author": "salman rashid"}, {"rating": 5.0, "review": "I bought this mainly to get access to Netflix and Youtube.  Now we use it all the time to stream iTUNES content/playlists coupled with slide show of pictures from my computed via WiFi...sounds great running through our BOSE home theatre system.", "verified": true, "helpfulness": "0/0", "author": "ZeroBoy"}, {"rating": 5.0, "review": "IT IS VERY EASY TO FOLLOW......SIMPLE.....THE APP IS VERY GOOD TO THE EYE...EASY ACCESS IN AND OUT OF APP..WILL RECOMMEND IT", "verified": true, "helpfulness": "1/1", "author": "Lily Nomie"}, {"rating": 4.0, "review": "It is a very good product but not much free service from apple. It is very expense to operate the apple TV.", "verified": true, "helpfulness": "1/1", "author": "Anthony Yu"}, {"rating": 5.0, "review": "As an apple fan, I bought one or two apple tv's every time I can for selling to my family and friends..I love this product!", "verified": true, "helpfulness": "0/0", "author": "Enrique"}, {"rating": 5.0, "review": "I own 2 of these bad boys, one for home, and one I carry around in my IT backpack. I absolutely love this tiny device, please keep in mind, it is not for everyone. I personally have an Apple Eco-system at home, so it makes sense to use this in my case. The device is great if you use streaming services such as Netflix or Hulu. The user interface on the ATV is dead simple to use and the configuration is super easy, you will be up and running in under 5 minutes. You can also run YouTube and stream radio stations from around the world, and with the latest update, can run HBOGo. The one drawback of this device, is the streaming of personal media. It will only stream video from your iTunes library, as long as the ATV and your iTunes library are on the same network. iTunes videos are in m4v, or mp4 format only. If your videos are saved in any other format, they will not be playable on the ATV, unless you run them through a video converter. I worked mainly with .avi and wmv files, before  I got this device, I had to re-encode my whole video library to mp4 format. While it was time consuming to do this, (over 100+ videos), It was well worth it, as the file sizes for my HD-WMV files, shrunk from 8GB down to 2.5GB with no loss in quality. There are a lot of applications out there that can do this conversion. (For a free method, I'd suggest Handbrake, as it's super easy to use, and is available on MAC, PC and Linux) Another nice feature of the ATV is iTunes Match. If you currently subscribe to this service, $24\\year through iTunes, all the music in your iTunes library will be available on the ATV without needing to have your PC on. Another plus, comes if you run an Apple computer, or have an iPhone. The ATV has the ability to \"mirror\" those devices. I have an 11\" Macbook Air, but I can wirelessly sync it directly to my TV, using the ATV. So instead of an 11\" screen, I have a 47\" monitor. Same goes for the iPhone, your TV will now be the screen, which is great for playing games. I highly recommend this device to anyone who uses Apple products, you won't be disappointed. If your a PC user, you can still use it, but using something with a bit more support for different formats, like a Roku might be better suited for you.", "verified": true, "helpfulness": "14/15", "author": "Brian Carilli"}, {"rating": 4.0, "review": "It's really what I expected, it is very useful and greatly increases the options in TV besides it is very nice.", "verified": true, "helpfulness": "0/0", "author": "Mar Saav"}, {"rating": 5.0, "review": "Easy setup.  Only had it a couple of months and already has new programming available.  If you have an iphone, looking at your pics and videos on the TV is super easy.  Works great with netflix and hulu+.  I don't miss cable at all.", "verified": true, "helpfulness": "0/0", "author": "CHRISTINE"}]