[{"rating": 5.0, "review": "Oh yeah, what else you got?", "verified": true, "helpfulness": "0/1", "author": "Goofy2u"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "1/2", "author": "manuel"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "1/2", "author": "Shelley Stokes"}, {"rating": 5.0, "review": "At its new reduced price (cheaper than Roku 3) the Apple TV remains a great option, assuming you are a Mac, iPhone or iPad user.While other devices have more channels and its channel interfaces are a bit dated, a few things make this a killer app:1) So many native iOS apps support AirPlay. So while a Roku may have more native channels, the Apple TV can stream anything. IF you have other Apple products.2) The video and audio streaming (AirPlay) is fantastic. There are churches using these in lieu of expensive HDMI extenders. Works great! They are also showing up in board rooms, which beats having to sit in the right place and hoping you remembered your VGA dongle for the projector.", "verified": true, "helpfulness": "1/1", "author": "S. Lewis"}, {"rating": 5.0, "review": "Easy to setup and easy to use. Takes a little time to setup HBO and others because you have to go to their website and get a code. Otherwise great product.", "verified": true, "helpfulness": "1/2", "author": "kc135 boomer"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "1/2", "author": "Nada"}, {"rating": 5.0, "review": "Works fine.  Bought it since I get the standalone HBO NOW throught itunes.  Should look into using more of the features.", "verified": true, "helpfulness": "1/2", "author": "LizR"}, {"rating": 5.0, "review": "I LOVE THE APPLE TV!! It has a great user interface it also has great speed. I love being able to airplay my MacBook and my iPhone/iPad to it. If you have an Apple device or are embedded in the apple ecosystem, this  is the device you SHOULD buy. The price drop also makes it more appealing.", "verified": true, "helpfulness": "1/1", "author": "Matt"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "1/2", "author": "Priscila Antoniazzi Calomeno"}, {"rating": 5.0, "review": "Is good", "verified": true, "helpfulness": "0/1", "author": "fahad alharbi"}]