[{"rating": 1.0, "review": "Like all other apple products, it boxes you in and limits your options. Not compatible with older MacBooks.  Only worth having if you have subscription services.", "verified": true, "helpfulness": "1/5", "author": "F. Ospina"}, {"rating": 5.0, "review": "I use my Apple TV all the time.  I had to buy one for my brother.  I use it almost as much as anything else that is connected to my TV.  It is great for streaming anything from my MBA (allows dual screen appearance now which is nice), as well as just playing music through it from my phone or iPad while I am working around the house.I still have a Gen 2, which is at least a couple of years old now and still going strong.  I highly recommend these to everyone!", "verified": true, "helpfulness": "0/0", "author": "Hawkeye"}, {"rating": 5.0, "review": "Have always wanted the ability to select entertainment from Netflix and this little box provides it without hassle. Grabbing my home wireless network was a simple task and the system works with no problems.", "verified": true, "helpfulness": "0/0", "author": "Schadow \"Schadow\""}, {"rating": 5.0, "review": "Best device ever!! It has changed our lives. Had a few glitches but those were easily trouble shooter. Definitely recommend this, even if you do not have Apple devices.", "verified": true, "helpfulness": "0/0", "author": "Giselle"}, {"rating": 5.0, "review": "First off, I will say that I am not a fan of Apple Products. I don't have an IPad or IPhone, although my wife and kids do. The products we do have at home are all jailbroken so that I can get XBMC on them. I have a Samsung Galaxy tablet because I could easily install XBMC. Now to the point. I just got a new TV in a recreational room and wanted a way to watch XBMC on it. We don't have cable because we stream XBMC and Netflix all throughout the house. I looked at alot of different products and settled between The Apple TV and the Matricom MX2. I did not like the Matricom box because of the negative reviews. It took alot for to get the Apple TV because like I said I am not a fan of Apple products. I got it anyway and figured that i could jailbreak it and put a sticker over the Apple logo. However, I found I could not jailbreak the Apple TV and almost considered returning it. I did some research using Bing, and found an app called AirParrot. It was a $10 product and it allows me to mirror my Windows laptop to the Apple TV for XBMC. My kids can also mirror their IPhones to it as well. It works like a charm. I am really impressed on how well it works on wifi and how clear the picture is. The other morning I was having a bowl of cereal and watching the Smithsonian channel before I went to work. I wont go as far to say that I am an Apple fan but this really is an excellent product. If a jailbreak ever comes out for mine, I don't even think I will jailbreak because its mounted to the TV and Airplay mirroring works great. In my opinion, if you are looking for a powerful little device to satisfy your streaming needs, this is the product for you. The capability is there, you just have to fins what works best for you.", "verified": false, "helpfulness": "0/2", "author": "Ryan Grusky"}, {"rating": 2.0, "review": "Didn't work for me.  Hooked it up with Wi-Fi.  Constantly buffering, but have NO trouble with my Roku box so...... I returned it:(", "verified": true, "helpfulness": "1/2", "author": "P. Venturacci Book Worm \"Book Worm\""}, {"rating": 5.0, "review": "Easy set up and use. Integrated controls using iPad or iPhone. Wireless access anywhere at home to movies and music on any device. Needs more apps but we have other devices that cover the channels it does not have.", "verified": true, "helpfulness": "1/1", "author": "Marlon"}, {"rating": 4.0, "review": "Satisfied with performance and quality. Recommend  purchase. Great to take with you on business or vacation trips, or just at home.", "verified": true, "helpfulness": "0/0", "author": "Bobby Bromley"}, {"rating": 5.0, "review": "Simply the best.  Better than all the rest.  Apple TV trumps all others on the market.  Wish they would add Amazon Prime, but that's between the two of them.", "verified": true, "helpfulness": "1/2", "author": "Tanner Vinecke"}, {"rating": 5.0, "review": "It cost more then the other similar electronic however it has a lot of feature that you don't get with the cheaper one I have two of them.", "verified": true, "helpfulness": "1/1", "author": "grn46"}]