[{"rating": 4.0, "review": "Works well, my old tv is not a smart device this apple gadget complements that divise nicely. The remote and its buttons could be a tad larger,", "verified": true, "helpfulness": "1/1", "author": "JK"}, {"rating": 5.0, "review": "This is the 3rd one I've order - one for each room.  Easy and connects easily to all my favorite media outlets and itunes libraries", "verified": true, "helpfulness": "0/0", "author": "Zachary Burns \"Computer Guru\""}, {"rating": 4.0, "review": "I bought this for my fathers house to use on a tv to play hbogo,etc on.  worked. very happy with the results", "verified": true, "helpfulness": "0/0", "author": "payrez"}, {"rating": 5.0, "review": "The Apple TV is a very nice small low power product which allows me to connect from my MacBook Pro to my tv screen and audio from anywhere in the house, over the wi-fi. I can show hi definition video or just my computer screen, in 1080p. It also will play audio files from my iTunes account, although the iTunes program must be open on whatever computer you want to play from. The TV/Movie connections are almost all subscription, which I'm not going to use. TV shows from the iTunes store are priced at $3.99, which is too high unless there are special circumstances.", "verified": true, "helpfulness": "0/0", "author": "Richard W Ulmer"}, {"rating": 5.0, "review": "I bought this for my friend on their birthday and they loved it. Works perfect loves to use it for music, movies, videos. Great device.", "verified": true, "helpfulness": "0/0", "author": "Bml"}, {"rating": 5.0, "review": "Bought this for my living room, already had one for my bedroom. It's a must for anyone looking to fully take advantage of Apples offerings!", "verified": true, "helpfulness": "0/0", "author": "K. Ryan"}, {"rating": 5.0, "review": "It's just wonderful!  The shows I can watch are unlimited. I've stopped relying on my DVR so much (which often couldn't handle all that I wanted to record).  Easy to install. Comes with little remote and it's so easy to operate.  Definitely, definitely worth it.  I then ordered a second one!", "verified": true, "helpfulness": "0/0", "author": "HappyinBuckeye"}, {"rating": 5.0, "review": "We use the apple tv to stream content from our phones andhome network. This thing is too super cool.", "verified": true, "helpfulness": "0/0", "author": "SK"}, {"rating": 5.0, "review": "I have put off buying this forever, finally took the plunge last week, wish I had spent the $99 years ago.  If you have an IPad, of Mac in the house, then this is a wonderful device to have.As with all Apple devices, it works seamlessly with all of them, easiest set up I have ever had, connect HDMI cable, power cable, and login to your accounts.The minimalistic remote is a joy, three button, wow, only potential problem is it's so small.Works on 802.11 g/n, guessing they will add 802.11ac soon, amazing performance on such a small unit.HIGHLY recommend", "verified": true, "helpfulness": "0/0", "author": "Michael L. Shanks \"MikeLee777\""}, {"rating": 5.0, "review": "I'm a huge apple products guy anyway but surprisingly it has taken me a while to purchase the apple TV.  I finally bought this product less than a month ago but I'd have to say so far, so good.  I'm pretty satisfied.  It has lived up to the billing to this point.", "verified": true, "helpfulness": "0/0", "author": "Big Hen"}]