[{"rating": 3.0, "review": "When I first wrote this review I gave it 2/5.  I've since upped to 3/5.The good:+Easy to setup.+Airplay from OSX works great.  Super easy to get set up.  I don't have an iPhone so can't tell you how well it works from your phone, but imagine it's just as easy.+If you can play it in iTunes, you can easily stream it to your TV.+The remote is nice.The bad:-If you can play it in iTunes, you can easily stream it to your TV.  Yes I did list it as both good and bad.  The problem is that iTunes doesn't support really that many file formats.Want to play a video in MKV file?  It's a popular video format, but nope sorry.Want to play a FLAC?  It's open source and more popular than Apple's lossless format, but nope sorry.It makes for a really crappy user experience when you have to convert formats for the sake of Apple's prudness.  Converting audio is not that big of a deal.  However re-encode HD video in to an mp4, can take considerable time.  Although I've figured out how to encode the video to mp4, and the even faster method of remuxing the video (assuming it's using the proper encoding), it's still more time (and possibly cost) than the non-technical will want to put in to it.  Sometimes the Apple way, is not the best way.-The lack of apps.  It would seem that this is a killer time for Apple to dominate the living room.  However they haven't opened up the Apple TV up to developers, so don't expect to find specialty music apps like Pandora.  However you could always play such services via Airplay either on OSX or iOS.-Does not recognize different wireless frequencies with the same broadcast name.  I've always found this kind of odd, and it's the same way in OSX.  If you want to chose between 2.4 Ghz or 5 Ghz wireless you must name each differently.  If you're going to steam high def video, or use airplay to your tv you probably want the 5 Ghz band properly set up.-The interface feels old and dated.-Not all Macs or Hackintoshs support Airplay video mirroring.  Luckily an app like AirParrot will allow you to use it.  Airplay sound should work regardless.Conclusion:Overall it's a stylish little box, and you could probably do worse.  If you're happy with iTunes, and can deal with how Apple restricts you, or already have your entire media library in iTunes, then this is right up your alley and you'll love this.  If you buy content from the iTunes store and want a way to play it on your tv easily, you'll love this.  If you have an iOS device and can Airplay stuff to it, you'll love this.  If you're just a huge fanboy, you'll love this.For the rest the lack of choice seems less than ideal.  If you have a large media library that is not iTunes friendly you should spend your money else where.  Similar boxes, like the Roku 3 (but any Roku 2 box really) have a lot more apps, and can play nearly any music or video format with Plex media server.  A lot more choice and cost the same or less.  The Roku 3 should also soon support the non-Apple Airplay called \"Miracast\".After using the Apple TV it for a few days, I'm probably going to keep it.  I find enough uses for it, and have invested enough time in to it to figure out some of the technical hurdles.  I do enjoy Airplay, but wonder if it's really worth the cost of admission.  However that seems to be what this device is, it was meant for you to use some kind of other Apple device to interact with it.  It just, feels odd.  But when you think about it, it should bring unlimited possibilities.I find it hard to recommend.  I feel it's primarily aimed at non-technical people who don't know any better, like most Apple products.  However if you are on the more technical side and have the patience to deal with the technical issues it can also serve you well.  It doesn't seem to fit the middle ground so well.", "verified": false, "helpfulness": "2/3", "author": "Brad"}, {"rating": 5.0, "review": "Does just what it's supposed to.  Easy to set up and use.  It turns out many YouTube videos don't look quite as good on the big screen as you might think, but everything else is great and I can't blame Apple for the quality of YouTube recordings.", "verified": true, "helpfulness": "0/1", "author": "William K Tobin"}, {"rating": 5.0, "review": "I love this unit!!! You can stream music right from your iPhone or computer which is the main use for me. I do wish it had an app built in for Pandora but no biggie! I can stream Pandora from my iPhone... Very cool unit that does a lot!", "verified": true, "helpfulness": "0/0", "author": "Coney"}, {"rating": 4.0, "review": "The basic setup for the Apple TV was very easy and many of the features work immediately. However, the instructions for accessing the computer or iPad screens is less than adequate, both in the manual supplied and on the web. The web instructions tell you to click on a symbol that does not appear anywhere, and they don't bother to tell you where it is. This lack of information is very frustrating, and the effort to be \"elegant\" in having a tiny instruction book really is not helpful. However, the things that work without much instruction work really well.", "verified": true, "helpfulness": "0/0", "author": "L. G. Gilley"}, {"rating": 5.0, "review": "Streaming iPad / iPhone videos and Netflix app make me realize I don't need cable anymore.  No brainier at the price.", "verified": true, "helpfulness": "0/0", "author": "Stephen O."}, {"rating": 4.0, "review": "Excellent product.  Very happy with the quality of the device, quality of the video, the interface, and the video offerings.  I would give it 5 stars, if Apple would allow Amazon to utilize airplay.  Currently you can't use airplay within the Amazon Instant Video App, which is disappointing.", "verified": true, "helpfulness": "1/1", "author": "T. Lewis"}, {"rating": 4.0, "review": "I purchased my Apple TV from Apple.  They didn't have a link for reviews so here I am. I specifically bought Apple TV as I read it can stream from iOS devices.  Ok, just what I wanted.  My 3 year old streaming DVD player has a limited Amazon menu.  No wishlist.  Small con but all my purchased vids are from Amazon.  My ipad retains Amazon wishlist entries. When I want to view one of my Prime vids on my HDTV, I have to note the movie title, then use search to find and select that movie on my DVD player's interface.So, after plugging in my brand new Apple TV squarish hockey puck, registering all the passwords for my wireless network WEP, Apple and Netflix accounts, I noticed Amazon was absent from the channel lineup.  Great access to iTunes purchased or rentals vids but the competition was not there.  No surprise I guess.So, on to Amazon vids.  Vids playing in other apps will only display vids through Apple TV if it's Airplay compatible.  Wish I knew that before sending $100 to Apple.  Vids playing on my ipad in Amazon's video app can send audio to the TV but not video.  However, vids in the Apple \"Videos\" app will play through Apple TV.  After all, \"Videos\" is an Apple app. I did notice Apple TV Netflix interface is several times faster than my older DVD streaming player interface.  The remote is what I would expect from Apple, simple and elegant.  30mm wide, 120mm long and 5mm thick tapering down to 2mm at the edges from a single piece of aluminum.  Uses a 2032 button battery. Slender but kinda easy to lose in sofa cushions.I looked into Roku but one reviewer found out that to activate his Roku account, a credit card was mandatory, just in case he made a purchase in the future.  Uh oh.  Another opportunity for a hacked commercial database to spread stolen credit card info, so I will live with Apple TV and continue checking my ipad for my Amazon wishlist movies to search for them in my DVD player Amazon interface.  Such is life, until I buy a newer streaming DVD player.", "verified": false, "helpfulness": "0/0", "author": "Stanley O. Chang \"stan1911\""}, {"rating": 5.0, "review": "The Apple TV gives you so much functionally in regards to iTunes, Hulu, Netflix, Photostream and others. I would say anyone who has an iPhone should have an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "I am not usually a gadget person, so the ability to transfer so easily the content of the iPad and the computer to the TV screen was quite amazing to me.", "verified": true, "helpfulness": "0/0", "author": "Winnie"}, {"rating": 5.0, "review": "As always, Apple products deliver, works effortlessly. Would recommend to everyone, no skill level required to set up, just plug it in", "verified": true, "helpfulness": "2/3", "author": "J LeRoy"}]