[{"rating": 4.0, "review": "Excellent product, work as you expect , ease to handle and follow instructions, clear images and the most easy to read CC, the only subject that don't let me give the 5 start is because do not take Amazon in his program, should be there as other divice.", "verified": true, "helpfulness": "0/0", "author": "Dario Lopez"}, {"rating": 5.0, "review": "I can't believe how well this works between my desktop PC and my Samsung smart tv. It handles music and photos much better than the tv apps. TV apps handles home videos better. It works great interfacing my iPhone 5s and iPad 3 to the TV using IOS7+.", "verified": true, "helpfulness": "0/0", "author": "Old Goat \"clay2young\""}, {"rating": 5.0, "review": "I don't know what you can say about Apple products. They all work as advertised and perform flawlessly. Updates are available and announced when you turn it on. Works well. No complaints.", "verified": true, "helpfulness": "0/0", "author": "G. Giftos \"Vacman\""}, {"rating": 1.0, "review": "Spent hours trying to get it to work. Entered everything asked for. Starts to connect but I get a error message number xxx.  Worthless.", "verified": false, "helpfulness": "0/6", "author": "Rich"}, {"rating": 5.0, "review": "Love it!  We use it to watch Amazon Prime movies from my iphone on our TV, or to screencast from my laptop for homeschooling.  Versatile and easy to use.  Only issue is the tiny remote is easy to misplace, but once I got the app that lets you use your phone as a remote, problem solved.", "verified": true, "helpfulness": "0/0", "author": "Techie Mom"}, {"rating": 5.0, "review": "this is the best $100 i have ever spent.  i used every function in apple tv and  have no need for the apps in my smart tv.  it does a good job up converting everything to 1080p. airplay is awesome too!", "verified": true, "helpfulness": "1/1", "author": "dang nguyen"}, {"rating": 5.0, "review": "It's an AppleTV. What more can I say that hasn't already been said? Haiku!Sleek little black box:Netflix, Airplay, Youtube, More!Mmm...All my content.", "verified": true, "helpfulness": "0/0", "author": "Robert C. Murray"}, {"rating": 5.0, "review": "i want to buy two more ... its that good! i recommend this for all users... it almost converts any regular TV into smart TV", "verified": true, "helpfulness": "1/1", "author": "Shannon Nanan"}, {"rating": 3.0, "review": "*** This item seems to be malfunctioning, so I've been trouble-shooting what any correctable problems might be, or if the item itself is defective.  The install was easily taken care of, and the device worked properly for a short period of time, but it soon began to malfunction - quite often.  As of this writing, it is not responding to any commands.  The battery is fine, the reset options have been tried time and time again, but to no avail. I will update this rating if I'm able to determine the problem and fix it.  If not, however, I may soon be returning the device, once I check to see if it's still under warranty.  Makes me disappointed, because I'm all about Apple everything, and always have been. We shall see...", "verified": true, "helpfulness": "0/0", "author": "CrimsonBird \"Sheree Huitt\""}, {"rating": 5.0, "review": "I have cancelled my Dish Network service and am completely reliant on internet streaming services. My Apple TV is an amazing product, and integrates perfectly with our other Apple products - iPhone, iPad Mini, etc. I recommend it to everyone who asks me about it, or about streaming services.", "verified": true, "helpfulness": "0/0", "author": "Jason Cloninger"}]