[{"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "1/1", "author": "kofi asante"}, {"rating": 5.0, "review": "It's amazing design. Very good status of the product. it is not have problem on that aspect", "verified": true, "helpfulness": "1/1", "author": "Giovanni Rodriguez"}, {"rating": 3.0, "review": "Just OK.  I own several Roku devices, and also stream through an XBOX and a Panasonic Blu Ray player.  While the video and audio output from the Apple TV is good, the menu layout, scrolling, and app availability is not impressive at all.", "verified": true, "helpfulness": "1/2", "author": "C. Callaway"}, {"rating": 5.0, "review": "Excellent product, Apple still rules!", "verified": true, "helpfulness": "1/1", "author": "Alsland"}, {"rating": 5.0, "review": "I just installed it today... very easy to setup.  Airplay works great from my iPad2 and playing media from iTunes on my PC couldn't be easier.  It is missing a few apps that I would like, such as Amazon Instant Video and XBMC.  But the reason I made the purchase was to get HBO NOW when it becomes available in April... that alone sold the box!", "verified": true, "helpfulness": "0/0", "author": "E. Meiners \"pawnslinger\""}, {"rating": 5.0, "review": "Purchased a refurbished unit from Apple the day the price drop was announced. I mainly use this to turn my old 40\" TV into a second monitor via AirPlay for use with Final Cut Pro X.With my 2012 min-retina MacBook Pro, AirPlay works flawlessly. I can send both audio and video wirelessly and see my timeline in full HD while I work.AirPlay from my iPhone and iPad is easy and works perfect, though I don't have a use for either right now it would be an ideal way to watch downloaded iTunes video content.As a bonus, I like the Netflix app better than the Netflix app on my PlayStation 3.  Even with my rather poor 768k internet connection, Netflix on the Apple TV never drops a connection, unlike the PlayStation. I also think the picture quality is slightly better than the Netflix app on my PlayStation. Podcast streaming is nice, and You Tube works really well too.The aluminum remote that comes with the Apple TV operates the interface fairly well. The on-screen keyboard is quicker than I thought it would be. The remote is, however, slightly uncomfortable witDon h sharp edges on both sides. Also, I had to go into the settings of my MacBook and turn off the IR port, or else the remote would make strange things happen on my computer even when it didn't seem to be in the computer's line of sight.Because of my slow internet connection, most of the other streaming apps don't work—but I didn't expect them to. Content, or lack thereof, wasn't really a concern of mine.", "verified": false, "helpfulness": "0/1", "author": "W. Jones \"bored thirtysomething\""}, {"rating": 1.0, "review": "I bought this for my dad. It has almost never worked. Totally hangs up with the bleeping Apple logo just sitting there. I have a Roku and it works great.Good job Apple. You really screwed this one up.", "verified": true, "helpfulness": "0/6", "author": "M. Schmidt"}, {"rating": 5.0, "review": "Works better with Apple devices than Chromecast.  No surprise there.  I couldn't get Chromecast to throw every web page to the TV using an iPad or iPhone but it does using Macbook.  Apple TV gets rid of that problem.  It is easy to use and navigate with.  It works with my Logitect remote since it uses an infrared remote not WiFi.  Chromecast doesn't.  My only worry is that they may come out with a new model soon and this one will be obsolete.", "verified": true, "helpfulness": "0/0", "author": "hb2"}, {"rating": 1.0, "review": "Like every other Apple product I own ( and I literally have them all ).... you will love this at first but over time as you use it, realize it's got it's share of flaws and frustrations putting it on par with everything else on the market. One good example is the registration and updates. In order to watch any of the streaming channels, you need to sign up for each, which generates a code that you have to enter on the channels website from your TV or tablet. It will seriously take you a good 30-45 minutes to register for all the channels you might want to view. OK I thought, that's a pain but I only have to do it once. WRONG. Apple pushes updates out to all their devices just like everyone else. In some cases you can choose whether to apply them or not. But not with Apple TV. In fact it doesn't even tell you it's updating. But the worst part. After each and every update. Your credentials that should be saved or cached and reused aren't. So you have to go through the registration process all over again. I also own several Blu-ray players with built in WIFI that support streaming TV such as Sony and this never happens. I sign up once and even after updates everything just works. Kind of like how Apple used to be, but lately and not just with Apple TV but with all of their products... Everything just doesn't work.", "verified": true, "helpfulness": "17/20", "author": "Hypercussion"}, {"rating": 5.0, "review": "new item worked fine", "verified": true, "helpfulness": "0/0", "author": "Garry K."}]