[{"rating": 4.0, "review": "I did not have a previous Apple TV, but with the update it received this year I was intrigued enough (and $100 seemed reasonably low enough) to give it a shot.I like it quite a bit. I have liked it enough that I bought one for a relative whom I thought would enjoy it.I like being able to have all TV shows and movies purchased on my computer's iTunes immediately available to watch on my main entertainment system. I think in the past the Apple TV had a storage capacity but as far as I can tell this doesn't so much store things as instantly retrieve them from the iTunes store as soon as you ask for it.I have iTunes match so that means all my music, even stuff I didn't purchase from iTunes, is easily accessible to listen to through my main entertainment system.I like the AirPlay functionality with my iPhone.I use the Netflix and Youtube apps a lot, those are great. I use Pandora and Vimeo sometimes. I have experimented with the radio app which is interesting but haven't used it much.As other reviewers have noted, I would have liked to have the ability to add apps over time, and/or get things like Hulu Plus, which the Roku has. But, the smoothness of the presentation and easy integration with my existing iTunes stuff is pure Apple.UPDATE 9/5/12: As you probably know, the Apple TV has Hulu Plus now. That is a great addition! The only other thing that would be extra great would be Amazon Prime Video but I doubt that will happen due to direct competition between Apple and Amazon. I did hear that the iPad has some kind of Amazon Prime app, though, so you never know.I am continuing to use the Apple TV about 50% of the time that I have my main TV on now. I still have cable and will DVR network and cable shows that I want to watch as they are broadcast. I find the interface and remote for Apple TV more pleasing than that for my cable box. I use Netflix and Hulu Plus fairly often. I am using YouTube, with its channels and subscriptions a lot more than I ever thought I would.", "verified": true, "helpfulness": "1/1", "author": "Brian K."}, {"rating": 5.0, "review": "As all products from Apple this one is amazing. I can watch all media from my macbook, beam my iPad display to TV via AirPlay, watch Netflix and many other things. Recommended!", "verified": true, "helpfulness": "0/0", "author": "danielcbit"}, {"rating": 5.0, "review": "I have had an Apple TV 720p for some time.  The newer 1080p version is just as excellent a device as the previous version, but with higher resolution.  It is also a bit faster.  The increased resolution is evident in the photos I show form my Flicker account.  As with most things Apple it is an excellent product.", "verified": true, "helpfulness": "0/0", "author": "gordonrf"}, {"rating": 1.0, "review": "I'm having a very hard time trying to get this setup.  I have went through the setup website and it still will not connnect to my home share, does it even connect with itunes?", "verified": true, "helpfulness": "0/17", "author": "Michael R Miller"}, {"rating": 3.0, "review": "We love the integration but there really are no apps for this. It is all about buying from iTunes and that is about it. I also have a Roku and if it is apps and media streaming you are after it is the better choice.Don't get me wrong, linking into you iCloud is awesome and being able to access iTunes is too. I just miss my HBO go and Amazon Prime on this TV now that the Roku is in a different room.PopPop was in town and we were able to pull up our iPhone pics as soon as we got home. That was really cool. No one had to hover over a phone or wait for them to be transferred to a laptop or PC.", "verified": false, "helpfulness": "1/2", "author": "pohlcat01 \"pohlcat01\""}, {"rating": 4.0, "review": "Plus - Watching a 1080p trailer made me say WOW right at the start. Excellent picture quality.Minus - Streaming via Itunes is a hit and miss. I should admit I have only tried it from Itunes on Windows 7. More apps should be brought in. Mirroring should be made available for Macbook as well. Not just for IOS devices", "verified": true, "helpfulness": "0/0", "author": "A A KUMAR"}, {"rating": 3.0, "review": "As a self proclaimed Apple fan boy who owns iPhone, iPad, & Mac I am torn for which direction to go for this review. On one hand, it is nice to push all my music and pictures form my iDevices to my TV, however the time it takes to push any videos is way too long. Renting movies from iTunes on Apple TV is nice and the ability to stream Netflix is legit. Bottom line is I hardly use the Apple TV so I feel like it wasn't worth the money. But if you play a lot of music, which seems to be what it is best at, then it'll be worth the $100.", "verified": true, "helpfulness": "0/1", "author": "Joshua Crawford"}, {"rating": 5.0, "review": "I love the apple tv, it pairs seamlessly with other apple devices, such as the iPad, iPhone, and iPad and the iTunes accounts. It does not have the wide selection of apps that my Roku player offers (such as amazon prime movies) however it is very user friendly and the overall navigation is extremely simple. I have one for my main tv, and I also bought one for my not so computer savy parents that are mainly enjoying Netflix on theirs, they have a hard time doing much else on it since they do not own other apple devices.", "verified": true, "helpfulness": "1/1", "author": "Karen Hodas"}, {"rating": 5.0, "review": "Exelente muy cumplidos correcta transaccion e l pedido lle ga tal  y como se habia acorDado y la mercancia llego en perfectas condiciones", "verified": true, "helpfulness": "0/1", "author": "Atccow"}, {"rating": 1.0, "review": "I loved my Apple TV1. Didn't get the ATV2. Upgraded to the ATV3 and what a let down. Oh is this a bad product.Pros:iTunes links well.iPad mirrors to it well.iPad & iPhone works great as a remote, if your home is wireless.Cons:Can't watch Hulu. Neither free of paid for.Can't watch Fox, ABC, NBC, or any other free over the web content.Shows that you can watch for free on you notebook you have to pay to view on ATV3.Suggestions, get an old used ATV2 and jailbrake it or wait until it has been jailbroken.After purchasing the ATV3 I went and made a myth box it does what I want.The ATV3 was a said let down after using the ATV1.", "verified": false, "helpfulness": "20/40", "author": "Buddy Davis"}]