[{"rating": 5.0, "review": "Easy setup.  Only had it a couple of months and already has new programming available.  If you have an iphone, looking at your pics and videos on the TV is super easy.  Works great with netflix and hulu+.  I don't miss cable at all.", "verified": true, "helpfulness": "0/0", "author": "CHRISTINE"}, {"rating": 5.0, "review": "I love Apple TV.  Watching rented iTunes videos, while more expensive than Redbox, the streaming quality is great.  Also, the Apple TV streams Netflix so much better than my Sony Blu-Ray....the Sony gets alot of pixelation and the Apple TV doesn't.", "verified": true, "helpfulness": "0/0", "author": "Kenneth A."}, {"rating": 4.0, "review": "Pros: Great little product. Extremely easy to use. HBOGO application was added with the last update (must have an HBO subscription to use). Watch ESPN app is great. Mirroring from an iPad or iPhone is still incredibly cool. Downloading the remote app for your iPhone or iPad is a MUST.Cons: It really hates to be hard wired to the internet. I have no idea why, but have given up on that. It runs great on WiFi.Updates sometimes take a couple of attempts. You can obviously skip updating, but you will miss out on awesome new features and improvements (like HBOGO).The app selection is still a little thin.", "verified": false, "helpfulness": "1/1", "author": "Korey"}, {"rating": 5.0, "review": "We also have a samsung blue ray that we use to view Netflix. That thing is so slow. The apple tv is farther from the router but it works flawlessly. I haven't tried to download pandora on it. I'm nit sure that's available. That may be the only drawback for me.", "verified": true, "helpfulness": "0/0", "author": "David Egan"}, {"rating": 5.0, "review": "I love this device.But then again, I own an iPad, iPhone and Macbook Pro.It plays nice with all my devices.The thing I like most about it is that I have A LOT of iTunes music.If you have iTunes match and want to listen to all your music through your TV/stereo, it's totally worth it!I've heard some people say they wish it had most content, but I beam other content like Amazon Instant Video through my iPad so I don't feel like I'm losing in the content department.", "verified": true, "helpfulness": "1/1", "author": "Carlon Haas"}, {"rating": 3.0, "review": "Until about a month ago, I totally enjoyed this product, but recently Amazon made it so that the Amazon Instant Video app on my iPad does not transmit video to it.  I suppose this is an effort to sell their Roku product, but it's disappointing since that was one of the main reason I bought it.", "verified": true, "helpfulness": "3/4", "author": "Brandi"}, {"rating": 5.0, "review": "I got this to mirror my iPad on an hdtv.  Wow!  Really impressed.  I did have to reboot my iPad in order for the airplay icon to appear but no problems afterwards.  Sure there's a lot of fee based content here but since I cut cable years ago I wanted to be able to stream stuff off all my apple devices and home computer onto the TV.  Easy peasy.Now if we can only get Amazon Instant Videos app to become airplay compliant.........", "verified": true, "helpfulness": "2/2", "author": "Marc"}, {"rating": 5.0, "review": "If u use iphone or any mac gadget this product is a Must to have, helps a lot in sharing/presenting photos and movies on streaming from the iphone to th tv", "verified": true, "helpfulness": "1/2", "author": "Márcio Lopes de Assis"}, {"rating": 5.0, "review": "The Apple TV is much easier to use than the smart wifi built into our LG TV.  We bought this so that we could use the big screen for our iPad images.  It works great and has a very simple interface.  No problems hooking it into our system.", "verified": true, "helpfulness": "3/3", "author": "K. Green"}, {"rating": 3.0, "review": "This item is preatty good to share your ipad's screen using the your TV but something that i miss a lot is a browser!", "verified": true, "helpfulness": "1/2", "author": "Marcelo Rodrigues"}]