[{"rating": 5.0, "review": "I absolutely am very happy with this!!! Quality is great! received on time and very simple to hook up!!", "verified": true, "helpfulness": "0/0", "author": "Zelda"}, {"rating": 5.0, "review": "It offers Netflix and Hulu plus a bunch of additional services. It is definitely an alternative to cable.", "verified": true, "helpfulness": "0/0", "author": "csepuede"}, {"rating": 5.0, "review": "We love our Apple TV! It's even easy to use YouTube which is great. We love to see our photos on the TV from our iPhones too. This is another great Apple product.", "verified": true, "helpfulness": "0/0", "author": "H. Collins"}, {"rating": 4.0, "review": "Have had no issues with this yet. Bought it for the girlfriend. Would give it 5 but i'm biased against Apple products.", "verified": true, "helpfulness": "0/0", "author": "linksus maximus"}, {"rating": 4.0, "review": "In a nutshell:It works, some hiccups here and there but overall it’s just another media player. It does the job and the interface is pretty straight forward and easy to use.The nitty-gritty:Overall the Apple TV works okay, but there will be some random crashing and loss of profiles/settings. We use it just for Netflix (swap between the Amazon FireTV stick and the Apple TV depending on what NetFlix/Amazon have removed from their content library. In general the device works, but it tends to drop wireless off (even though the access point is just a few steps away). Randomly while watching a show the device will restart or it will just kill the show off and take you back to the episode selection screen or the home screen. It also failed to remember the Netflix password even though it did not do an update on some cases.Thumbs down for not having the ability to watch amazon videos, that was a killer for me. You would think they would roll out an update to include that functionality or update the firmware, but no luck.Even though I am no apple fan I have to review it as I see it and plan to use it. Overall, it works (minus the little glitches). I ended up running my own cat5 cable to get it via Ethernet since the wifi just sucked on this guy.We only use it for Netflix, everything else for us is just noise. If you are looking for something basic such as Netflix, go get yourself a fire tv stick for far less the cost. I did not delve into the other apps but i’m sure they work just fine. We don’t have a big need for airplay (at least not yet) but it’s a cool feature if you want to broadcast from your ipad. A work around for Amazon prime videos would be if you use airplay, but that’s just lame. I might as well go build my own recording studio, record myself playing various characters and then go back in time and play that future video of me back to past me… and no I am not being sarcastic :)…. maybeOne other comment, I actually liked the remote control and the style of the Apple TV is black, so it looks nice, but I care more about how it works than how it looks.Visit www.examinators.com for more reviews", "verified": false, "helpfulness": "1/1", "author": "Examinators"}, {"rating": 5.0, "review": "Has changed our viewing habits.Many more options.", "verified": true, "helpfulness": "0/1", "author": "David Meltz"}, {"rating": 5.0, "review": "This is the best electronics investment I've made . You can play whatever you're showing on your iphone or ipad and listen to music directly from your device. Plays netflix and hulu. You can also view your pictures directly on your TV. If you're watching youtube on your phone you can also stream that to your TV as well.", "verified": false, "helpfulness": "0/0", "author": "K. Frederick"}, {"rating": 5.0, "review": "Absolutely LOVE.  Wish we would have gotten this sooner. Make sure to get the HDMI cable if you don't have one; the 3 foot one worked perfect for us.", "verified": true, "helpfulness": "0/0", "author": "MrsParisi"}, {"rating": 4.0, "review": "So far so good. Very useful when you want an alternative to popular service providers with nothing new.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"RSD\""}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "WEB-3086 christopher cross"}]