[{"rating": 4.0, "review": "While this thing is pretty awesome I wish it had a few more apps on it. I also wish the mirroring feature, that I use to stream videos and music from my IPad straight to my tv, worked with everything I did on the IPad. For instance- I tried to pull up a map on the internet and wanted my parents- who needed a larger image- to be able to see it on the TV but it doesn't let you do that!", "verified": true, "helpfulness": "0/0", "author": "Amznmom"}, {"rating": 1.0, "review": "We didn't even have the chance to try this unit out completely. When we set it up, we got the video, but no sound. When we checked the \"troubleshooting\" part of the manual, we discovered that many older sets  have HDMI ports that do not support audio.I think that it would have been wise if we had been informed beforehand.", "verified": true, "helpfulness": "1/8", "author": "Victoria"}, {"rating": 5.0, "review": "The order arrived a day ahead of schedule and was packaged very well, with multiple air packets to keep it secure. The box was in condition as good as or better than you'd find on the shelf of an Apple Store.", "verified": true, "helpfulness": "0/1", "author": "Andy Ligotti"}, {"rating": 3.0, "review": "I thought I would get more use out of it but since it doesn't let you view Amazon prime its a waste of money to me. I enjoy Amazon prime movies a lot and iTunes just doesn't cut it for me and it cost more to view thru iTunes.", "verified": true, "helpfulness": "3/5", "author": "Reenie"}, {"rating": 4.0, "review": "I am the biggest fan of Apple TV and use it for listening music on TV, watching movies, streaming Netflix etc.One hint: If you lose the remote you CANNOT set up the Apple TV in a new wifi. The remote application on smartphones works only AFTER you have set up your apple TV with the original remote.I tried to set it up with a friend's remote and didnt work, but you have to buy a new one (at a steep Apple price) to set it up.Apart from that, it's a great product and if you have a fast wifi connection it's really fast/no lag between your laptop/phone and the TV.", "verified": false, "helpfulness": "0/0", "author": "Di.Li."}, {"rating": 5.0, "review": "The Apple TV is best for watching movies. Easy installation Easy easy handling allrecommend is high quality and is designed so that you can use even a child", "verified": true, "helpfulness": "0/0", "author": "Rodolfo Araya Villalobos"}, {"rating": 5.0, "review": "I used to get on Netflix and Hulu etc. through my blu-ray or Wii and this is much easier. A great buy for the low price. It is sleek, works great, great picture and I love AirPlay.", "verified": true, "helpfulness": "0/0", "author": "Hhall"}, {"rating": 5.0, "review": "So I've had the original Apple TV with the 150gb hard drive since it came out.  Great device, only most recently I was getting more and more irritated by the effort necessary to sync the device with my library.  The latest TV model is awesome with the streaming ability.  That aspect along makes it worth the price.  Couple it with the Airplay functionality and its an amazing deal.", "verified": true, "helpfulness": "0/0", "author": "JKnapper"}, {"rating": 5.0, "review": "I've used in the past a Samsung DVD player that streamed Netflix and though it worked ok it required that you to use the computer to set up your queue. This is soooo much easier and the layout is all simple icon driven. You will say the same thing why did I not get this sooner. If you have an iPhone, ipad, itouch or Netflix you need this!", "verified": false, "helpfulness": "0/0", "author": "R. Mayer"}, {"rating": 1.0, "review": "Apple TV is not compatible with Amazon.com. If you have Amazon Prime and hoping to stream movies from your iMac, iPad or iPhone to your TV you better look elsewhere. It doesn't work. Bummer.", "verified": true, "helpfulness": "9/21", "author": "Kyle Turner"}]