[{"rating": 4.0, "review": "Works great!! I love everything about it best investment made in home entertainment!!", "verified": true, "helpfulness": "0/0", "author": "Danielle Jordan"}, {"rating": 5.0, "review": "So yeah it came new and great no damage at all. Well plug it in on the tv and yeah everything looks normal and yeah very satisfied with my purchase.", "verified": true, "helpfulness": "0/0", "author": "James M"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Alicio"}, {"rating": 5.0, "review": "Purchased this for my grandma for her 84th Birthday. She LOVE LOVE LOVES it. She finds it super easy to use. After she started using this, she went out and upgraded her phone to an iPhone 6. \"If I can work an apple TV, I can work an iPhone whatever.\" Proving you can teach an old lady new tricks.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Torrey"}, {"rating": 5.0, "review": "Great! Works as expected", "verified": true, "helpfulness": "0/0", "author": "MgabyPL"}, {"rating": 3.0, "review": "its fine thus far, price is relatively affordable and it has a very sleek design especially the remote control, also it supports 1080p so the graphics are very stunning. However the major disadvantage with this product from apple is that some of the apps aren't accessible in certain countries outside of america, so be mindful when purchasing this item if you reside outside of america.", "verified": true, "helpfulness": "0/0", "author": "Hailey"}, {"rating": 5.0, "review": "Awesome, wish I had bought it sooner. Love everything it does. Easy to hook up and I'm not a techy person.", "verified": true, "helpfulness": "0/0", "author": "Holly and Mark Needham"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Eugenio Marsiglia"}, {"rating": 4.0, "review": "Apple should make it work with the same video apps that work fine on their iPhones, for example flixster, had to buy a Roku to easily use Flixster,... accounts... That's bs", "verified": true, "helpfulness": "0/0", "author": "Kevin Thomson"}, {"rating": 5.0, "review": "Great product, good seller.", "verified": true, "helpfulness": "0/0", "author": "Douglas J. Metzger"}]