[{"rating": 5.0, "review": "We like to use the Apple TV for two things - 1.  To view movies and other shows from our Netflix account and 2. To receive content (streaming) from our iPads into our large LCD TV for viewing as a family.  We are never short of good quality material to watch and learn from.", "verified": true, "helpfulness": "0/0", "author": "Paul Dawson"}, {"rating": 3.0, "review": "apple tv is nothing special in my opinion.Pros:NetflixCool sleek remoteairplayCons:Boring channelsstreaming issues with wireless sometimesRecommendation: build yourself a cheap htpc and directly connect it to your router and you defeat anything apple tv and/or roku can offer.", "verified": true, "helpfulness": "0/0", "author": "Kapitalist"}, {"rating": 4.0, "review": "I bought this so that I could watch the (VERY FEW) things that I've bought on itunes.  For that, it's great.  You can stream things from the cloud, so you don't even have to download it anywhere.I wish it did Amazon videos, but it doesn't.I also wish that it would play video from my uPnP NAS.  But it doesn't.  Even though it's an itunes server - but only for music.It does have a bunch of apps that I don't really care about - NHL, ESPN, lots of sports things that I'm not interested in.  And it has Watch ABC and HBO Go and some of the streaming broadcast / cable apps that you can use if you have cable (which I don't).  It has PBS, which is cool, you don't need a cable account for that.And it has Netflix.  But so does my TV.  And DVD player.  And Tivo.  But unlike those other devices, it recognizes Netflix's new(ish) profile feature, where for streaming purposes, an account can set up multiple profiles to make queues easier to manage - I have have shows I watch when I go to the gym in one profile, my kids shows in another, my husband's movies in another, and my movies in another.  All separate queues.  This is the only device I have (of many) that recognizes that feature.  All the rest of them just ignore the other profiles as if they don't exist.My only gripes are the amazon thing, my home network media thing, and that while watching content, there doesn't seem to be a way to get an on screen display to show you how much time you have left without pausing it and restarting it.  Maybe there is a way to do that, but I haven't been able to find it.  That and my general lack of understanding on why apple doesn't recognize a difference between \"pause\" and \"stop\".  But that's a different conversation.", "verified": true, "helpfulness": "0/0", "author": "B. Lemons \"lemonbrine\""}, {"rating": 3.0, "review": "C'mon apple—I know you create supply and demand by keeping your tech behind the times. But, this most certainly does not follow Apple's design principle of providing the best user experience. It takes a million clicks going back and forth page to page to find what you want to watch. I'd rather have a larger, less minimal remote with more buttons if it means I don't have to click back and forth hundreds of times.And just a few weeks ago apple finally decided \"Maybe users should have the ability to hide all the weird channels / providers that they don't ever use\"", "verified": true, "helpfulness": "1/1", "author": "yumyam"}, {"rating": 5.0, "review": "Quit paying for cable tv now! It's a waste of money! Get apple tv and save a fortune and watch only what you like. I bought three of these. One for each of our tv's and love them! You make up for the cost of the apple tv in getting rid of stinky cable tv.", "verified": true, "helpfulness": "0/1", "author": "Heather Birath"}, {"rating": 1.0, "review": "The item is the same one that is sold for $99.00.  It may be the \"latest\" version but it is certainly not a new version.", "verified": true, "helpfulness": "0/2", "author": "C. Hignite"}, {"rating": 1.0, "review": "Garbage...After a required software update, I was presented with a static screen depicting a picture of the Apple TV and a USB cable. Come to find out, after searching all over the house for an apple cable that would fit the back of the device (none did from various IPod and IPad purchases over the years), Apple expects me to purchase a 'micro' USB cable. Incredulously the required cable was not supplied in the box with the product (verified in the instruction manual) and there is no way to set my frozen device back to the factory setting without it. I now have a useless piece of plastic that I will have to pay additional money to resolve an issue created by a required software update glitch. This is nothing short of criminal. I will never again support a company that actively and openly abuses its consumers. Buyer Beware!Update: I seriously wish I could give this less than 1 star. Three times now this device has needed a complete restore and endless issues with syncing to ITunes library.", "verified": false, "helpfulness": "5/11", "author": "Scott Gustin"}, {"rating": 3.0, "review": "Needs more content, besides YouTube there is not whole lot worth watching. It does connect all other apple products together. Unless they add more content I think one can live without it.", "verified": true, "helpfulness": "0/0", "author": "Jamshaid hassan"}, {"rating": 5.0, "review": "Easy set up. Directions were easy to follow and works beautifully. Price is less or comparable to all that I searched. Came on time. Would buy from them in the future.", "verified": true, "helpfulness": "0/0", "author": "Larry Loutzenheiser"}, {"rating": 4.0, "review": "I got an Apple TV instead of  another \"streaming\" product out there because I work on a mac so it seemed like best option for me.  It works great when watching Netflix, Youtube etc...but when it comes to watching movies it gets a little slow.  I purchased a movie that I liked and it took forever to get it to start playing.  I really like the Airplay function between the ATV and another mac device, I just wish the Apple DVD player on my MacBook Pro would have access to that but alas it does not.  I have also experienced a lot of disconnections between my laptop and the ATV when using Airplay to play music or watch mp4s but then again I am still using Snow Leopard so that might be an issue.  Other than that I am very happy with my Apple TV, hopefully once I upgrade to Mavericks I should be able to mirror my mac and that will be a welcome feature.", "verified": true, "helpfulness": "0/0", "author": "Ivan Suro"}]