[{"rating": 4.0, "review": "A must have for anyone who enjoys Itunes video streaming or owns other Apple devices.", "verified": true, "helpfulness": "0/0", "author": "Mr J"}, {"rating": 3.0, "review": "First off, I would give this a weak 3 stars. The box works some of the time but it has been fidgety enough that I would not recommend it. The reason I bought this over a similarly priced Roku 3 is that I have apple products and I wanted a uniform design and the AirPlay functionality.The problem is that the box is unreliable and lacking too many features. The speed and memory of the box are not impressive. The AirPlay feature works 70% of the time. I cannot stream video reliably from my Mac (choppy and sync issues) and my iPhone will sometimes fail to load properly or cut out. Otherwise the display mirroring works most of the time.  This was a major reason if not THE deciding factor for the box over the competition.I am very limited with my channel selection as well. There's no spotify and no Amazon prime, and most of the other choices are the standard channels. It would be nice to see more content just to have the option.The box is slow. Slow to load apps and slow to load menus. Video buffers sometimes and worst of all, the Hulu plus app has been crashing on me often (twice in the last half hour).I am upset with apple as I knew I was paying a premium for the name and design but I thought I was getting a solid product. Not so.", "verified": false, "helpfulness": "1/2", "author": "Revo"}, {"rating": 5.0, "review": "No problems so far. Easy to connect", "verified": true, "helpfulness": "0/0", "author": "Georges A."}, {"rating": 5.0, "review": "use it with netflix more movies than we can watch, its great", "verified": true, "helpfulness": "0/0", "author": "Salvatore A. Giglia \"hunting guy\""}, {"rating": 5.0, "review": "Thanks.", "verified": true, "helpfulness": "0/0", "author": "Kurt Gollinger"}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "1/1", "author": "MCG"}, {"rating": 5.0, "review": "Ok", "verified": false, "helpfulness": "0/0", "author": "Beatriz Puig"}, {"rating": 5.0, "review": "Excellent streaming quality. Drop cable TV and  pay for just what you watch.", "verified": true, "helpfulness": "0/0", "author": "David Roush"}, {"rating": 5.0, "review": "Love my apple TV", "verified": true, "helpfulness": "0/0", "author": "S. Howell"}, {"rating": 1.0, "review": "So dissapointed.  We are apple people.  Our family of 4 all have iPhones.  We own the 27\" iMac, iPads, iPods and MacBooks.  We've always loved apple but couldn't be more dissapointed with Apple TV.  It is not compatible with MOST apple products.  Unless your hardware is new, this is absolutely useless.  Not only that, but the unit itself constantly timed out.  The screen would freeze and turn black every few minutes and we have incredible internet speeds, so that shouldn't be an issue.  It was actually sitting directly next to our router.  It added nothing to our experience that a playstation couldn't do.  It was glitchy and a complete peice of junk.  My advice... Read the negative reviews of this product!  They are spot on.  We actually received a used product first and had to send it back, so we had waited far longer than we planned for a package we were more than dissapointed in.  Sent it back to Amazon.", "verified": true, "helpfulness": "1/5", "author": "Roxysoxy"}]