[{"rating": 4.0, "review": "Using two Apple TVs and an Airport Express, I have created 3 zones with connected speakers in my home. This is wonderful for playing music from iTunes or my families iOS devices. From any audio application on iPhones or iPads it is easy to send the audio to the Apple TV and even mirror the video to the Apple TV.It's not perfect. We also have a Roku device to connect with nearly all other streaming multimedia applications that we use such as Pandora, Amazon Instant, HBO Go, etc. Apple TV however makes easy browsing of Internet video services.Setup is quick and painless, and you can easily access your Apple music and video library.", "verified": false, "helpfulness": "2/2", "author": "Jeremy Floyd"}, {"rating": 5.0, "review": "Have to say that this is quite a clever box of tricks. Before purchasing, I did a lot of research including Apple forums and other instant streaming devices such as Roku. In the end, it is about personal choices and what works for you. I should also state that although I have an iPhone and the wife has an iPad, we are not committed to Apple products we have to have no matter what. Having said that, I DO like the minimalist styling of both the unit and its remote.The ATV3 is Apple's 3rd version and besides a few tweaks at previous bugs, the essential difference between this version and the previous ATV2, is that this one supports 1080p HD whereas ATV2 was restricted to a max of 720p. To some that matters, but I personally cannot detect the difference from my sofa! Also, when I checked where it was available to buy, the best deal was on Amazon itself for $88! Free shipping and no sales tax, too. Normal retail is $99 plus tax and the 3-4 days wait wasn't a problem either.The set-up was straighforward. Yes, you could follow the booklet that came with it but all you needed, was the instructions on the screen and you were up and running. You can have it set up wirelessly (WiFi, with a router) or an Ethernet cable (wired). My specific set up was I have a NETGEAR dual band WiFi router in the office next door that provides a wifi hotspot for the wife's iPad and my iPhone (when not using Verizon's 4G network). This particular router stated that it was designed for medium to large homes, several devices simultaneously being used and that it supported streaming HD video. My 7 year-old TV is also capable of 1080p HD res.The box comes with the small, black ATV, a power cord and the Apple remote. You WILL also need a HDMI cable to connect it to your TV, if you don't already have one. You don't need to buy a state-of-the art one with gold plating that'll set you back up to $50; they are available for as little as $20 at Radio Shack or Fry's. Mine was one left by my TV cable company when I switched to using a CableCard instead of using one of their bulky box tops.Had the ATV for a few months now and I'm still learning what you can do with it! It's a work in progress. I would highly recommend getting a book on this device, especially one that includes trouble-shooting. There is one available on this site and it DOES cover the ATV3. Having this companion, I found, is very useful and not too technical following each chapter, depending what it is you're looking for.All in all, I have no regrets in buying this product as I already had the other devices with which it runs. About my only criticism is that the library content on say, Netflix, is not as wide as on the regular mail-in DVD. If you do a search on either, you are more likely to find the physical DVD format available as the same movie as instant streaming. Apple's good but even it and iTunes are not 100% perfect! Maybe they will add more content and encourage more consumers. Already other companies are giving them a good run for their money and there's nothing like healthy competition to get a company to give the consumers what they want, rather than what they think they need!!.......", "verified": true, "helpfulness": "2/2", "author": "Will Shakespeare"}, {"rating": 5.0, "review": "This is a product I cannot live with! I have 2 of them. One for my family room TV and other for my basement home theater. The streaming is so fast and perfect. We use mainly to stream Youtube videos, Music, photos, videos from multiple iphones, IPADS during a party. If you have any Apple product this is a must have. Lot of people don't know much about this product until they use it. AppleTV surprised many of my friends and they ordered the first time when they saw this at my place :). Only addition if apple can add a bluetooth receiver to this to stream music from any other devices other than apple devices and provide an audio jack other than just HDMI to connect to any stereo system, all the bluetooth audio receivers will go out of business.", "verified": false, "helpfulness": "1/1", "author": "Kumar Kuchimanchi \"KK\""}, {"rating": 4.0, "review": "I would give this product five stars, except it doesn't include Amazon streaming video as one of its channels.  But in every other way, it is far superior to the roku player I had before - easy, intuitive interface and displays closed captions for Netflix (roku didn't).  Also, Apple service is much nicer and more knowledgeable to deal with than the service I received from roku.  I have to watch Amazon streaming on my tv, though, or I can mirror tv screen thru the Apple TV, but resolution is not as good.  Hope Amazon/Apple get together soon, so I can give this device five stars.", "verified": true, "helpfulness": "0/0", "author": "M. L. Laney"}, {"rating": 4.0, "review": "I bought the latest generation of Apple TV because my older second gen took a dump after many years of use (HD crashed). I've become used to using Apple TV for movie rentals, listening to my music collection through my home stereo, etc.  I like the new size and don't mind the lack of local storage and dependence on wireless connection to my home computer for music, photos, videos etc.  Makes for a smaller, cleaner unit.  The wireless-n works fast and flawlessly.  No problems streaming everything.  The ONE thing I am bummed about is Apple's decision NOT to support 1080i output.  This unit supports 720i, 720p and 1080p, but not 1080i. My Sony display is 1080i, so I have to view using 720p instead.  Not a lousy picture, but I'd rather use 1080i like I did with my 2nd Gen Apple TV!!  Common Apple.", "verified": true, "helpfulness": "0/0", "author": "Phil Keesee"}, {"rating": 3.0, "review": "If you live out of the country, you will not be able to access Hulu! Also, this device does NOT get any local NEWS networks!", "verified": true, "helpfulness": "0/0", "author": "Billy Allmon"}, {"rating": 5.0, "review": "The Apple TV is useful in ways you don't realize until you have it, as it allows full integration of all of your Apple products. I guess I'm officially an Apple person now. Great buy!", "verified": false, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "I have owned three media player and have over two hundred videos on my system, so this is not my first time to the party.  If you are wanting a media system that is reliable, responsive, easy to use and offers solid pack of features the apple TV 3 is the unit to buy.  I have two in my home.  I will give you the pros and an outline of how you have to set up a system with this unit.1. The wireless feature is high quality I have never had an issue with data transfer or streaming video. (my router is in the basement and my apple tvs are upstairs)2. The family share feature allows you to access all your music, photo's and video files on your home network.3. The screensaver options are extensive and easy to personalize. I have 300 photos that cascade across the screen with music playing from my library. Great feature for parties.4. The slideshow feature has a large selection of shows that all play music , play in fixed order or shuffle and are great for parties also.5. The video and photo libraries work the same as the itunes music library so cover art and genres are easy to set-up. (FYI  the video and photos are run through the itunes program)Out line system configuration:If you are wanting all your videos in a network storage system and your DVDs in a box this is the best way to do it from what I have expereinced.You will need all of the items below:1. Dual band Wireless router with 802.11 N speed equiped with video streaming  ( I use a  Belkin N750 Dual Band Wireless N Gigabyte Router2. Network storage device  (media server, DNLP, NOS  I use a WD MY Book Live  6TB)3.  Dedicated work station  ( I use an old window xp tower this computer will sit in the corner and run 24/7  mine is in the basement)4. Apple TV 35. iTunes installed on the workstationThe set up is easy, just follow the instructions for the network storage the My Book Live is super simple.  Install the itunes on the workstation (basic computer for nontechies) connect the workstation to the router and load your media on the storage system then copy links to itunes (drag and drop to itunes).  Install apple TV 3 on tv and follow on screen set up. Activate home sharing on itunes and apple TV now you have access to all your personal media.  (side note: if you don't know how to copy your DVDs to your network you will need ripping software.  Their are several free programs on the net I recommend a software package called DVDFAB it cost $200 for the suite but, is the best I have used no more legal notices, movie previews and can convert standard dvd  and bluerays to appleTv langauage (Mpeg4)", "verified": true, "helpfulness": "0/0", "author": "draves67"}, {"rating": 5.0, "review": "Great product, but it needs an App Store of its own for adding content!  I really wish it had HBO Go, but until then I really do like the fluid switching between my Apple devices and my living room TV.  Highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Motorcycle Owner"}, {"rating": 5.0, "review": "This is so much fun and easy to use small lightweight and portable apple you did it again will buy again if I need a gift", "verified": true, "helpfulness": "0/0", "author": "Jeffery"}]