[{"rating": 5.0, "review": "Come man, it is Apple!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It works perfectly on my mac, does everything specified without problems, I recommend it.", "verified": true, "helpfulness": "0/0", "author": "amuggia"}, {"rating": 5.0, "review": "great functionality.  stable apple product.if you are a Mac person it is a must as theapple components just work together.....", "verified": true, "helpfulness": "0/0", "author": "tommy \"tommy f.\""}, {"rating": 5.0, "review": "If you are interested in simple - you need to buy the Apple TV.  If you own any Apple product, you will be able to figure out how to operate the Apple TV in seconds.", "verified": true, "helpfulness": "0/0", "author": "Daryl Ives"}, {"rating": 5.0, "review": "if you want to put anything from your iphone or ipad onto your TV without hassle or in a matter of a second, or you just dont like clicking buttons (thanks android and chromecast for that opportunity) get AppleTV.its really simple, apple products work well with other apple products and you get delightful experience.  you dont have to brag about it but it feels good every time you use apple TV in combination with other apple devices.on its own, i'm not sure.  it feels like it could be better.there is a way to put plex on appleTV through plexconnect if you're into that kind of thing.  that works very well and give you full fledged media center pc with pretty graphics and more.i would recommend to buy refurbished AppleTVs because those come with a year of warranty and once its out of the box, you'll never tell it is a refurbished unit.  if you have any issues, they'll gladly replace it at apple stores as long as you're within 1 year warranty.", "verified": true, "helpfulness": "1/1", "author": "This guy"}, {"rating": 5.0, "review": "Really can't inagine my life without Apple TV. We listen to music and watch family pictures, watch movies and our favorite shows. LOVE Apple TV!! It's also so much faster than our smart tv.", "verified": true, "helpfulness": "0/0", "author": "JK"}, {"rating": 5.0, "review": "Who knew this existed?!  Apple TV is awesome", "verified": true, "helpfulness": "1/1", "author": "Juston Anderson"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Luis Penoth"}, {"rating": 1.0, "review": "A terrible Apple product. Movies constantly are interrupted while they are being downloaded to the system. This has happened many times. Also, Apple charges for every TV channel and it's movie offerings aren't always rentable, and they try to make you purchase titles including many older titles such as the extended version of Lord Of the Rings trilogy at non-market prices. Buy from Amazon. Forget Apple.The Amazon box is much better if you have a Prime membership. Apple continues gouging its loyal customers by offering inferior products designed to nickel and dime them endlessly.One big negative for the Amazon box is its lack of offering HBO, which Apple offers. In my opinion, these boxes don't save much money versus using Comcast or other providers despite their myriad problems.", "verified": true, "helpfulness": "2/3", "author": "12 sunyata"}, {"rating": 5.0, "review": "This a great product. I wish I had purchased this much sooner. I was told about it by my Son. I use it everyday get to watch all Movies & Series that Iissed.I could get Netflix before I recieved this Apple TV.Thank you, Mary Lou", "verified": true, "helpfulness": "0/0", "author": "Mary Lou Lion"}]