[{"rating": 5.0, "review": "I took a chance and finally ordered Apple TV after eying it for a couple months and I must admit I absolutely love it! Very easy to use and I love having the option to display what's on my iPad wirelessly to my tv screen.", "verified": true, "helpfulness": "0/0", "author": "kwilli"}, {"rating": 5.0, "review": "Couldn't live without my Apple TV! I wasn't even sure what I would use it for before I got it but I love being able to stream from my ipad things like you tube videos, downloaded movies and netflix. It is do easy to use and I downloaded a remote control app so I don't have to always fine the teeny tiny remote that comes with it.", "verified": true, "helpfulness": "1/1", "author": "Christi901"}, {"rating": 4.0, "review": "Love this! But it doesnt tell u, that u need the hmti cord when buying so i had to make a special run to walmart to get it but the cord isnt to terribly expensive $15.", "verified": true, "helpfulness": "1/1", "author": "Alison"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/1", "author": "Wvb"}, {"rating": 4.0, "review": "Great TV companion to have in the house. The ability to airstream content from my iPhone to the tv is great. I still need to have a cable subscription to log in and unlock content. I use the Vevo and YouTube apps on a daily basis. Apple TV is pretty straight forward to operate but does have its limitations as to what providers have apps. I wish it had an Amazon Instant Video App.", "verified": true, "helpfulness": "0/0", "author": "Dominik W"}, {"rating": 5.0, "review": "I now own three of these. They allow me to watch the many movies I have on iTunes as well as ESPN3 on my television. In addition, the picture is fantastic. I was very pleasantly surprised.", "verified": true, "helpfulness": "0/0", "author": "BULLGATOR \"SGK\""}, {"rating": 5.0, "review": "Fantastic product and delivery! Just as advertised!", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 3.0, "review": "Switched to Amazon FireTV", "verified": true, "helpfulness": "0/0", "author": "Sfhehe"}, {"rating": 4.0, "review": "Its an Apple TV. What more needs to be said? Great but not perfect.", "verified": true, "helpfulness": "0/0", "author": "Cole W"}, {"rating": 4.0, "review": "When I preordered my new iPad from Apple, I also got this to test the AirPlay. I read most of the reviews beforehand, and I was aware about all the shortcomings of ATV. My original thought was, even if I didn't like it, I can always jailbreak and install third party software on it.Connectivity and Netflix:It did not have any surprises, and the whole installation finished in 10-15 minutes--including wireless setup. I have a long WPA2 password, and that alone took an extra 5 minutes. It connects to both 2 GHz and 5GHz channels on my Linksys E-4200 router without any problem. I immediately tested Netflix, and I was blown away by the interface, 1080P quality, and streaming speed of 8-12Mbps. I have a Sony BDP-S580 Blu-ray player that I used for streaming from Netflix, but Apple TV simply puts it into shame both in ease of use and speed. For this reason alone, I will keep this Apple TV. They really have thought about the user interface.I could not use the Apple TV to stream from my... Read more", "verified": false, "helpfulness": "0/0", "author": "Lance Haynes"}]