[{"rating": 5.0, "review": "We use this with a 50\" tv in our office for meetings, etc.  My only disappointment is that my Macbook Pro is one half generation too old to work without using Parrot.  Parrot and my old Macbook don't run fast enough to provide some of the video or complex Keynote slides without either lower graphic quality or delay.  Others in my office with newer laptops have no problem, and everything works just fine.", "verified": true, "helpfulness": "2/3", "author": "steve noblett"}, {"rating": 5.0, "review": "Works great. I wish it had more apps for watching other online content. Not necessarily games and such, but apps that would allow access to video content from popular websites something like the Roku or XBMC plugins. I actually was about to buy the Roku but then found out that it's Netflix app does not work here in South America, so I went with the Apple TV although I do not own any other Apple devices... and I have to say that it works very well within it's limitations.", "verified": true, "helpfulness": "2/2", "author": "Andi H. \"Andi\""}, {"rating": 4.0, "review": "After cancelling my cable, I decided to purchase Hulu Plus and needed a mode to watch it. I decided to get an Apple TV so I could stream Hulu Plus as well as use Air Play with my iPad. I am very pleased with Apple TV - however, the only issue I have is that my Amazon Prime App on my iPad won't allow me to mirror to the Apple TV. The sound will come through, but the picture won't. It's a bit frustrating since now I have to hook up my computer to my TV and I can't use the Apple TV to stream it, but other than that I've had no issues.", "verified": true, "helpfulness": "9/9", "author": "Lauren"}, {"rating": 5.0, "review": "The apple tv works just as I thought it would. I use the YouTube connection to get video's for my grandson and use the other connections to watch tv shows I missed.  Have not used Netflex or Hulu yet, except for free shows.", "verified": true, "helpfulness": "3/3", "author": "D Evans \"Dr Data\""}, {"rating": 4.0, "review": "I am a little disappointed with all the pay per view channels. I thought there would be more free channels. The pay per view channels charges just as much as Directv for PPV , Amazon Instant Video is a much better deal.Which Apple TV doesn't support, you have to download the app (Amazon Instant Video) on your ipad or iphone and mirror it to your Apple TV. It also doesn't support Epix you have to do the same thing with your device to get that channel. If I knew what I know now I may have not purchased this item. If you are considering it make sure you check it out real good first.The Roku 3 has over 750 channels, and they keep adding more. It does not have the mirroring feature, which is a real problem. Apple TV needs to allow you to add more channels. I can get the Amazon instant video and Epix by using the mirroring feature. But you have to have your ipad on and streaming the video to view.", "verified": true, "helpfulness": "1/2", "author": "Brenda L Davis"}, {"rating": 3.0, "review": "Worked pretty well with Netflix, Hulu, YouTube, max, hbo and other stuff like photo and video from apple devices. Would have given 5 stars if it supported amazon videos", "verified": true, "helpfulness": "0/1", "author": "Emil"}, {"rating": 4.0, "review": "I purchased this at the Apple Store specifically to connect to different client HD TVs to display my Keynote presentation. Setup is very easy. Once your laptop and the AppleTV are on the same network, in typical Apple fashion, everything just \"sees\" each other. After a very easy set-up, it's just one click and your laptop display is mirrored on the television set.Most people purchase Apple TV as part of their entertainment system and it definitely did not disappoint in that area. The Netflix and YouTube apps operate flawlessly. Very clean, sleek design for both. Unfortunately (and the reason I cannot gove it five stars), AppleTV does not include a browser like Safari and there are limited apps available, and no means of downloading others.But, if you have an iPhone, iPod or iPad you can display videos using their browsers onto the television you have AppleTV connected. So, no need to catch up on old Episodes of your favorite show on your tiny laptop screen or hunched over your desktop. Display it onto your television screen through AppleTV. I love this feature because I can watch online foreign news channels without increasing my cable bill.Definitely worth the $100!", "verified": false, "helpfulness": "0/0", "author": "Leticia Sanchez Garzon"}, {"rating": 5.0, "review": "No problem hooking the Apple TV up...streams my iTunes to my TV with no problems...I would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "kp"}, {"rating": 5.0, "review": "Since getting this device my eyes have opened up to all it can do.Gameplay with up to 3 others so far.Just need iphone to stream video and music.It has taken over my living room.Easy to hook up.Kids look at me lovingly.Sure that won't last long but my new found toy is here for good!", "verified": true, "helpfulness": "0/0", "author": "Mike Perlatti"}, {"rating": 5.0, "review": "I'm pleased with this version of Apple TV. However, I may not be the best source for a comprehensive review (yet) since we've only used it for airplay from our ipad to stream programs - this part does work quite well.", "verified": true, "helpfulness": "1/1", "author": "L. Kim \"L Kim\""}]