[{"rating": 5.0, "review": "This was the best gift ever! I love apple TV. It is so cool that you can miror your iPad right in the TV screen plus it comes with all kinds of apps to watch. It is fast and smooth. I am hooked. Worth every penny.", "verified": true, "helpfulness": "1/2", "author": "amanda barbee"}, {"rating": 5.0, "review": "This product has exceeded all expectations. We purchased the Apple TV unit for two major reasons: first- access to apps such as netflix, pandora, hulu, as well as being able to see videos, photos etc from our other apple devices, and second- VoiceOver accessibility. Both of these features offer multiple options for programming and accessibility, but the best, totally cool feature is AIRPLAY! Using this simple to access mirroring feature we have been able to share the wide world of apps from our iPhones and iMac and send the display straight to the tv screen. Imaging sharing a YouTube video with the whole family with just one step! Super! And Apple's VoiceOver means that everything is accessible for our family member who is visually impaired! One happy family!", "verified": true, "helpfulness": "0/0", "author": "Jean L Chambers"}, {"rating": 5.0, "review": "I bought this for a friend for Christmas and she loves itShe said it was her favorite present . She watches Netflix and loves that she can see her iphone photos on her TV. She hasn't begun to see all the features. I scored big time on this present.", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 5.0, "review": "A joy to use. Find something neat about it every time. Great gift!Do wish I could get netflix to automatically go to the next episode, I'm not sure there's a way to do that but it works on safari. But no big deal.", "verified": false, "helpfulness": "0/1", "author": "Alli F."}, {"rating": 5.0, "review": "I love being able to watch anything I want, when I want right from My Ipad to my big screen.", "verified": true, "helpfulness": "0/1", "author": "shelly dewsbury"}, {"rating": 5.0, "review": "I was told by the man who installs all of my electronics that I should purchase 2 of these.  Am using it for streaming Netflix and LOVE that feature!! Haven't learned anything else yet.", "verified": true, "helpfulness": "0/1", "author": "Nancy Johnson"}, {"rating": 5.0, "review": "Compact in size and big on features + very end user friendly both to setup and use. Would highly recommend especially to cord cutters.", "verified": true, "helpfulness": "0/1", "author": "Ramana Kadari"}, {"rating": 5.0, "review": "Love these things. Have 3 of them in our house and want another for our trailer. Only problem is that you can knock others off their programs if you select the wrong Apple TV. Be sure to name them differently and/or add a pass code to access to prevent problems with multiple boxes.", "verified": true, "helpfulness": "0/1", "author": "Verna"}, {"rating": 5.0, "review": "This is a solid product and works very well.  I am using it with the 3rd generation iPad and am very happy.  I am also using the built in Netflix's and Hulu apps and they work great.  This is an inexpensive way to upgrade a TV to have \"smart\" features as well as getting the content of your apple device on your TV.", "verified": true, "helpfulness": "0/1", "author": "Daniel Blair"}, {"rating": 5.0, "review": "VERY easy to install and the price was better than the Apple store when I purchased this unit. Love that it synchs up so easily with my other Apple products and my TV. Be sure to order an HDMI cable too. I highly recommend Amazons Basic HDMI cables. Inexpensive and they work great without fail.", "verified": true, "helpfulness": "0/1", "author": "DMc"}]