[{"rating": 1.0, "review": "You're not saving any money with this deal. This item is available from Apple, brand new, for $69", "verified": false, "helpfulness": "1/1", "author": "Wally Hickeydinkler"}, {"rating": 5.0, "review": "This is my fourth AppleTV. All different generations or used in different homes. I love my AppleTVs!", "verified": true, "helpfulness": "0/0", "author": "Chris Giddings"}, {"rating": 4.0, "review": "There are frequent updates for the apple tv, it works as expected-flawlessly.  It looks great, and barely takes up any space.The reasons why I docked it a star:-the remote is a bit flimsy and could be better built-if you lose the remote, there's no way to operate it from the device, NO buttons...this is very annoying!-the apple remote app (for the iPhone) is one of the worst apps I have used, it crashes within seconds.", "verified": true, "helpfulness": "0/0", "author": "wilddaisy \"Daisy\""}, {"rating": 5.0, "review": "It's tiny and with HBO Now who could say no.", "verified": true, "helpfulness": "0/0", "author": "A. Watley \"Hiro\""}, {"rating": 5.0, "review": "works fantastic", "verified": true, "helpfulness": "0/0", "author": "Jerry D. Freeman"}, {"rating": 5.0, "review": "As far as I know, this is the only device that you can use to mirror your Apple devices wirelessly. Functions are very simple. Offers variety of apps - ESPN, Hulu, HBO, Netflix,... I love playing podcasts on my TV, and most importantly, it connects to your iTunes library, which is cool!Mirroring screen feature is amazing. I've used it with iPhone, iPad, MacBook Pro.", "verified": true, "helpfulness": "1/1", "author": "iicty"}, {"rating": 5.0, "review": "AppleTV is a very cool product!  It can allow you to access your all of your computers library of music, videos and TV shows. you can watch Hulu, Netflix, and as of April 2015 HBOGO!", "verified": true, "helpfulness": "1/1", "author": "Don Kelley"}, {"rating": 5.0, "review": "Love the Apple TV.  I bought several Rokus, but with the lower price I took another look at the Apple TV and wished I got it earlier sinceit works great for several reasons.1.All my itunes songs can be played (even without the iphone) and I have the apple tv going through my stereo as well.2.Pictures and videos that are stored on my WD Mycloud network storage can be played/displayed with my iphone by using the airplay and mirroring functions of Apple TV.  I found Airplay very reliable and unlimited since it can Airplay anything on my iphone compared to Rokus phone app which is flakely and limited in what it can play from my phone.3.Itunes radio nicely replaces Pandora, but I still can Airplay Pandora from my iphone to the Apple TV.4.I like that the ATV has the power supply in the device which makes it heavier to hold on to the weight of hefty HDMI cables and takes less room on the power strip.5.Video Streaming seems clearer to me when using Netflix.6.Startup of apps seems faster than Roku like Netflix and Youtube.7.All the main apps I need are on the ATV, but if I need to use one that is missing I can always Airplay from my iphone.", "verified": false, "helpfulness": "4/4", "author": "fish and dog man"}, {"rating": 3.0, "review": "as usual, the problem with apple products is the limitations. no Pandora? ridiculous.", "verified": true, "helpfulness": "1/4", "author": "Stuff!"}, {"rating": 3.0, "review": "Great but as with most technology gets dated quickly.  Easy and intuitve to use.  Price of service is right,", "verified": true, "helpfulness": "0/0", "author": "Peter Domiziano"}]