[{"rating": 5.0, "review": "Instant setup.  Works perfectly.  You can play YouTube and content on my iPhone video, audio and pictures...  I love it !", "verified": false, "helpfulness": "0/0", "author": "Dvalentine"}, {"rating": 5.0, "review": "I love my apple TV and use it in my classroom for interactive and video instruction. It's so easy to set up and the mirroring option makes it especially great for instruction.", "verified": true, "helpfulness": "0/0", "author": "Ms. M"}, {"rating": 5.0, "review": "Great item.  Need to have a subscription to Netflix or something like that to use, but fun to stream videos, movies and tv shows on my tv.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Stark"}, {"rating": 3.0, "review": "Bought to be able to watch YouTube videos and listen to music purchased on my iPhone and iPad. Because Apple doesn't support Adobe Flash, many video's I've watched on my laptop are not viewable on AppleTv. But I knew that when I purchased, just didn't realize the extent of how much on YouTube uses Adobe Flash Player. So video's are limited.I'm still a novice and learning as far as my AppleTv goes, but it seems that to be able to play my purchased iTunes from my iPhone and iPad, it seems I have to subscribe to iTunes Match to be able to do so? This is at a cost of $25 annually. I was under the impression I'd be able to listen to these like on my other Apple products.The remote is VERY flimsy. I have large hands and when using, I can feel the the thin body of the remote flexing when using.I have doubts about the lifespan of the remote.The Radio app is great though. I listen to hard rock and heavy metal mostly, and there are endless channel's to listen too. Every sub-genre of metal is covered. And International channels too! Excellent!Overall, pretty good device but not great. As I get more familiar with it, maybe my opinion will improve as far as my rating goes. Especially if I don't have to subscribe to another Apple product to listen to my iTunes on my tv. And please Apple, make a more robust remote!!!!", "verified": true, "helpfulness": "0/0", "author": "Steven B. Lekan"}, {"rating": 5.0, "review": "This is a fantastic device!  I was able to connect it to my TV in about 5 minuets.  Very simple.  I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "rocdharr"}, {"rating": 4.0, "review": "The product now works as expected with a Samsung LCD TV. Hopefully also with the new LED I've just bought.First, there was a lot of flickering at 1080P. It disappeared  when I told the TV that Apple TV was as a computer connected through HDMI. Then, even better resolution options became available.Maybe this is just a Samsung/Apple problem. There is no mention/recommendation about this in product documentation. There are a lot of complaints, though, in Internet forums.Problem is solved and I'm happy. The missing star goes for the initial frustration and the need to search for a solution.Nelson", "verified": true, "helpfulness": "0/0", "author": "Nelson Gorini"}, {"rating": 5.0, "review": "Love these little boxes, they give you all the stuff you want from itunes and netflix with the added ability to AirPlay! And if you have a mac, iPhone, or ipad you really should have an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Rdawg \"Thanks\""}, {"rating": 5.0, "review": "I bought this as a gift.  The receiver loves it. I don't really know the details of what it does, but my brother-in-law was excited to receive it. It arrived quickly and was packaged very well.", "verified": true, "helpfulness": "0/0", "author": "Karen Furgerson \"\"taekwondo mom\"\""}, {"rating": 2.0, "review": "Out of the box, aTV \"found\" my iPod 4th gen.  I was able to display pics off of the iPod... that was it.  No vids, no games (mirroring), nope - nothing else.  Thought about returning it then, but decided to wait to see how well it works with a new MBP.MBP (2.6GHz i7 16GB, dual 7.2k rpm hd): what a waste of my time.  I upgraded to ML just for aTV...  Yes, mirroring worked, but not like for viewing movies at full resolution/24fps.  My MBP was 12' from the router, the aTV located 8' from the router.  (btw, a $130 Linksys/Cisco N router).  As for \"mirroring\", well, slow at best - most of the time there was a 12 sec delay... on anything.  So frustrating.  I \"reverted\" back to Lion where Airplay worked for pics...  oh but not so well for vids/movies.iPad 2nd/iPad mini- oh forget it.  Decided to return the aTV to Amazon.Pros:  Can display pics on the iPod/iPad very well on your home lcd.  This has great potential for photo studio purposes if one uses wireless units in their dSLRs.  aTV has really nice screen saver and the menu driven interface is as one would expect from Apple products.  Intuitive, easy to use, high quality.  Wireless configuration was such a breeze!  The packaging for this is second to none.  The included remote works with other Mac/Apple products - very nice.Cons: Video files cannot be some of the more popular file formats.  Basically, they all need to be in Apple's iTunes compatible formats.  Price is a bit high, but consistent o all Apple's products...  ( this would have been my 6/7th Apple product).The concept of being able to display my MBP screen onto a selectable (if you have more than one aTV in your location) LCD in my home/office wirelessly is really cool.  Maybe in the next release this will work.  BTW, for AirPlay works on Lion - you do not have to upgrade to ML.", "verified": true, "helpfulness": "4/4", "author": "JL \"Nikonian\""}, {"rating": 5.0, "review": "Works as you'd expect an Apple product to work:  simple to set up and use.  Great for a variety of streaming content options, and if you have a Mac or i-device then it's worth the purchase price just for the convenience of AirPlay.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Borris \"gadget junkie\""}]