[{"rating": 5.0, "review": "We live in an area that is not connected to cable and our only internet provider is a phone line--not the most user friendly to watch streamingTV. We dropped the satellyte. We had an early roku device which did not have caption ability. It served us fairly well but one of us really needs captions and with some of the British series, we both need captions. Now all the netflix has captions and I can down load movie rentals and any tv series that I might want and watch them without interruption. My phone line does take a while to down load so I try to do most of that job over night. The Apple product seems to be more efficient and even when watching streaming there is less buffering than before. While we are buying some of the programs from the Apple Store, we are still saving money over subscribing to a satelyte company that forces you to buy so much programing you don't want and never watch .  My husband and I are very happy with this product .", "verified": true, "helpfulness": "0/0", "author": "judith a bell"}, {"rating": 3.0, "review": "Easy to hook up but all of my purchased movies don't show up.  About 1/3 of my collection can't be streamed from the cloud because they aren't showing up as purchased.  After about a couple hours of \"Apple Support\" still can't access them.  Also, there are not as many choices to stream from.  Overall okay, but disappointed at the $99 price point.", "verified": false, "helpfulness": "0/2", "author": "Troy \"Mark\""}, {"rating": 5.0, "review": "I use it for netflix mostly great for buying or renting movies too. If I wasn't married I'd cancel my satellite tv for this!", "verified": true, "helpfulness": "0/0", "author": "Jessica \"J Witham\""}, {"rating": 1.0, "review": "I thought the concept was that whatever is on your iPad or iPhone could be put up on the big screen.This not the case.The very first thing I tried to watch - a video on my Amazon Prime account - could not be displayed.This $100 product pretty much only works with Netflix and Hulu.  On top of it all, Apple TV does not have a smooth interface... which is what Apple products are supposed to be known for.", "verified": true, "helpfulness": "0/4", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Why they didn't allow apps to load on it or safari, I have no idea? This would be in every home in America if that was the case. I like the fact I can mirror my iPads and iPhones to it, but forget about trying to get a web browser on it. If you own a Mac this is a must have. It works good with my windows computers if you leave iTunes up and running. Great picture quality on my projector which doesn't have smart apps, and would be good for anyone who has a good tv but not a smart tv. If you have a smart tv, I'm afraid this cool device wouldn't be good for particuarly special for anything but watching your iTunes content. You can mirror anything from your iPhone or iPad except safari? If somebody knows a work around for this please let me know. Otherwise this is just another cool apple device that can run, iTunes, netflx youtube and Hulu in highdef", "verified": true, "helpfulness": "0/0", "author": "Webblaze"}, {"rating": 5.0, "review": "The unit worked flawlessly right of the box. Easy to hook-up and use. Very versatile unit. Offers a variety movie programming sources. Replaced the Logic Revue, which never worked correctly.", "verified": true, "helpfulness": "2/2", "author": "tomd"}, {"rating": 4.0, "review": "It's a great item but the only problem that it didn't come with AV output so I can't let it work with a projector, only on my LCD tv", "verified": true, "helpfulness": "0/0", "author": "raef f gorgi"}, {"rating": 1.0, "review": "You can get this item for 50.00 at some other place. It must have gotten popular thus the price increase.", "verified": false, "helpfulness": "0/7", "author": "Phillip P. H. Ryder"}, {"rating": 5.0, "review": "Just AWESOME! I have 2 apple tvs and I love them. No problems what so ever with them. You won't be sorry you bought it", "verified": true, "helpfulness": "0/1", "author": "supersleepyrightnow"}, {"rating": 5.0, "review": "I download a few shows from iTunes that I enjoy watching and keeping the episodes.  I purchased this product so I could watch those shows on my television instead of my computer or phone and it's awesome.  I know it does other things and I'm not using it to it's full capabilities but for what I need it for, it's perfect.", "verified": false, "helpfulness": "0/0", "author": "K. Mulready"}]