[{"rating": 5.0, "review": "that's all I have to say. It's an Apple product. Compatibility with other apple products is as easy as it comes.  it works flawlessly!", "verified": true, "helpfulness": "2/2", "author": "Adan Hernandez \"Guaco wacko\""}, {"rating": 4.0, "review": "I really like this product a lot. I can stream my class lectures (using downcast) on my phone and mirror them to the TV!! I also like that you can watch netflix or hulu plus. The only reason for the 4 star .... I wish I could watch my Amazon Prime movies/tv shows using the Apple TV device. Even if you try to mirror it you can watch the trailers but it does not allow you to watch the movies. Very disappointed about that and I am not sure if that is an amazon or apple thing.", "verified": true, "helpfulness": "1/1", "author": "JLeeB"}, {"rating": 5.0, "review": "Just as advertised for easy access to Netflix and music. Love it!No down side at all.Apple makes great product!", "verified": false, "helpfulness": "0/0", "author": "Fun Finder"}, {"rating": 2.0, "review": "The unit itself sets up very easily and the layout for Netflix is the best I have ever seen. However, Netflix and Hulu are about all this thing has to offer outside of what you purchase from Apple. Unless you have a giant iTunes collection I would recommend getting a Roku player instead because it has over 600 channels compared to around 10 on Apple TV.", "verified": true, "helpfulness": "17/22", "author": "D. Ezzio \"James Ezzio\""}, {"rating": 5.0, "review": "When I first purchased this I found a better price here than apple store or Best Buy. But when Amazon started to charge tax for some items, I purchased all my other 4 apple tv's at Best Buy, yes, that is how much I love aplle tv's, I have one for each television in my house. It is a great product, with awesome features, my favorite being Airplay or mirroring. It is very easy to use, even for my 6 year old. Since I have Amazon prime, I can mirror movies or shows from Amazon instant video that are not available on Netflix, directly to my tv.", "verified": true, "helpfulness": "0/0", "author": "X-Fit Chick"}, {"rating": 4.0, "review": "Wow..what a nice little toy.  I enjoy viewing something on the iPad and then it appears on the HDTV...so cool!!", "verified": true, "helpfulness": "0/0", "author": "Victori4ever"}, {"rating": 4.0, "review": "While I had to call Apple to set it up since the directions are almost non-existent for a person who is less than computer savvy, once it was set up, it did pretty much everything it said it would....perhaps some things not as good as I would hope due to the speed of our internet connection I would imagine...what we did find out though is that we could have gone through life happily without it...it seems like everything we thought might be free, costs (even things we have free on our regular cable on demand cost here) but we've got it and we will use it to whatever degree we will.", "verified": true, "helpfulness": "1/1", "author": "SandyNYC"}, {"rating": 5.0, "review": "This is such a great product with a price that is awesome. I have two at home and can't get enough of it. The only thing Apple should consider is embedding more streaming services to the box.", "verified": true, "helpfulness": "0/0", "author": "Chmoller"}, {"rating": 5.0, "review": "I can not emphasize how much we love Apple TV. It's so simple to set up and use. Not only does it stream movies and television show, but music, photos even facetime. We liked this so much that we gave them as gifts to our adult children for Christmas this year. They have been just as pleased.", "verified": true, "helpfulness": "1/1", "author": "Andrea Finney \"Doodlerah\""}, {"rating": 5.0, "review": "I love my Apple TV. Got one in every room. Even my grandkids love it. They use it in the guest room with their iPads when they play multy palyer games.", "verified": true, "helpfulness": "0/0", "author": "Efrain Yepes"}]