[{"rating": 5.0, "review": "Easy set up. Works great with our home theater and tv. Another product from Apple that just works. Highly recommended.", "verified": false, "helpfulness": "0/0", "author": "KDW"}, {"rating": 5.0, "review": "+ Very easy to setup+ AirPlay feature is super easy to figure out.  As long as your iOS device is on the same network as your AppleTV, it automatically appears as an option when playing videos, pictures or audio from your iOS device.+ Beautiful interface- I wish there were more \"apps\" available for this device because there aren't anywhere near as many apps here than for iOS devices.  I wish they had Amazon Prime video app.", "verified": true, "helpfulness": "0/0", "author": "PATRICK SERRATO"}, {"rating": 4.0, "review": "I love the Apple TV and the simplicity of it.  Makes streaming and playing podcasts and iTunes music simple.  For less than $100 it is SO worth it.Four stars because clicking Airplay on my Macbook Air and iMac often does not work (or sound does not play).  I checked, double checked, triple checked all settings. My Apple computers are less than two years old each.  After searching a solution, I downloaded AirParrot  (about $10) after reading about others having the same issue, and it works perfectly.So really, total cost is $110  (as you may need to download AirParrot or something similar) - still very worth it.", "verified": true, "helpfulness": "0/1", "author": "Elizabeth R. Douglas \"E. R. Douglas\""}, {"rating": 5.0, "review": "What an upgrade from version 1!!! Way faster and great picture. So easy to use with Remote App on iPad or iPhone.", "verified": true, "helpfulness": "0/0", "author": "Tyler Moore"}, {"rating": 4.0, "review": "Great product and works well. Put it in front of my Samsung 7500 not so Smart TV, which is actually a frustrating, dumb and slow implementation of a web interfacing TV. The problem is solved by just adding an Applle TV and turning the Samsung 7500 into an attractive monitor. Really why didn't Applle and Samsung just build a smart TV together and both sale a lot of product!Great product that installs easily and works well, recommend without reservation.Wish Amazon and/or Apple would let \"Prime Video\" through, and if they did I would give it 5 stars. Will avoid using the iTunes store for video until it happens.", "verified": true, "helpfulness": "0/0", "author": "BobR"}, {"rating": 5.0, "review": "very good, it is one product excellent...wonderful tecnology, diseñ i like, this adadtabily at use of the news TIC...thanks!! excellent..", "verified": false, "helpfulness": "0/0", "author": "Omar Ramirez"}, {"rating": 5.0, "review": "I was looking for something to mirror my iPad 2 with my tv. A friend suggested Apple TV and I took his advice. I don't regret it. I can now enjoy my iPad flics on TV. Plus, I can access all the great stuff on YouTube. It's easy to set up and, like all Apple products, easy to use. It's definitely worth the price. By the way, I use it with a five-year-old Philips with no problems.", "verified": false, "helpfulness": "0/1", "author": "Dimitrios Siountris"}, {"rating": 5.0, "review": "Not sure how Apple has packed so much into such a small and affordable device. We've had 1st and 2nd generation AppleTV the 2nd gen has no internal hd and uses a ton less energy. I being the tech geek of the house had my doubts about being completely reliant on streaming which the 2nd and 3rd generation Atv's are. Over the past 2yrs Apple has made major improvements to the iOS and many services (streaming) make the device a great value. In the early days I did feel crippled by the lack of options but that is no longer an issue for example MLB network is now available if you have an MLB account. And then there are the obvious options like Netflix and streaming from your networked computers (that are running iTunes). My guess is things will only get better as Apple continues to add services through iCloud and hopefully streaming of live TV. Even without those the device is a bargain and completely idiot proof. :-)Note you can stream many cable channels via iPad - iPhone - iPod apps in HD. For example we often stream news channels like CNN to our Apple TV on our bedroom TV via my iPhone. However most apps require you have a TV provider... We have Dish sat service (only one receiver in our family room) having that account lets us use apps like CNN to watch their live streaming.Bottom line this is a great device and even greater if you have iDevices in your home. A great value.", "verified": false, "helpfulness": "2/2", "author": "Will \"wsmithapple\""}, {"rating": 5.0, "review": "This was a great addition to expand the use of other Apple devices such as an Apple laptop, iPad or iPhone. All these devices can be connected to your TV through this box. Set-up is simple and immediate. Hint: make sure that the operating software on ALL your items is up to date or you will have problems connecting.", "verified": true, "helpfulness": "0/0", "author": "CinciJ&J"}, {"rating": 5.0, "review": "This product is what Apple is about. Easy to use, convenient, and some provides great entertainment (hours of youtube videos). Extremly nice to rent new movies, eliminate the use of DVDs and so on. It's not a necessity, but a handy product.", "verified": true, "helpfulness": "0/0", "author": "Washingtonian"}]