[{"rating": 5.0, "review": "I have two AppleTVs. Easy set-up, Apple quality, nice and small. I wish Amazon Prime streaming was available on it, however. Seamless integration with iTunes. Now that I bought this, Apple will probably release a newer version. That's OK, still love this one.", "verified": true, "helpfulness": "0/0", "author": "Philm \"mstudio\""}, {"rating": 5.0, "review": "Very happy with gift.", "verified": true, "helpfulness": "0/0", "author": "Jean A Atwood"}, {"rating": 5.0, "review": "loving it", "verified": true, "helpfulness": "0/0", "author": "Sabitha Gladden"}, {"rating": 4.0, "review": "Purchased this to replace a ROKU 3 that failed after 18 months! Display and content navigation is better than the ROKU, and access to iTunes is super convenient.  For our home, the Apple TV is a much better experience. One minor note: Apple TV will go into a sleep mode when not in use whereas the ROKU has no such feature. We often had to unplug the ROKU to reboot the system, and the device would run very warm to the touch even when not in use. ROKU support assured me that it was not a drain on electricity and of no harm to the device, but in our experience it seems an off button or sleep function would make the unit better.  Either way, I am happy I replaced a broken ROKU (issues began with remote sync/failure...a new remote did not fix this!) with the Apple TV.", "verified": true, "helpfulness": "2/2", "author": "J. Carr \"jusluvfiallovus\""}, {"rating": 5.0, "review": "Ok I have another", "verified": true, "helpfulness": "1/1", "author": "rafael"}, {"rating": 5.0, "review": "Great price for the item", "verified": true, "helpfulness": "0/0", "author": "Aria Maintenance \"Virg K.\""}, {"rating": 5.0, "review": "this apple TV is great. works with full range of voltages. buying from amazon means that you are definitely getting an official product", "verified": true, "helpfulness": "0/0", "author": "Muneeb"}, {"rating": 5.0, "review": "An excellent investment!  I got this after a friend showed me theirs and started walking me through all the options and what it can do.  I installed this in our living room to be used as an \"add in\" to our existing audio/video setup...little did I know we would be using the Apple TV more than just about any other device.  Not just iTunes, Netflix, Hulu, and the other audio/video on demand type of apps but also the airplay ability to play or show just about anything from our (or friends') iPhones, iPads, or other compatible devices.  Soon to be getting a couple more for the bedrooms.", "verified": true, "helpfulness": "0/0", "author": "Dennis London"}, {"rating": 5.0, "review": "Love my Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Taylor Stinson"}, {"rating": 5.0, "review": "Great set to buy! The HDMI cable is good quality, strong. Packaging is great!", "verified": true, "helpfulness": "0/0", "author": "Taylor Stinson"}]