[{"rating": 5.0, "review": "As an Appleholic I was going to buy the Apple TV at some point. I recently had the need to do some presentations from my iPad and I wanted to be wireless. This Apple TV is GREAT for that.But this is an Apple TV. I have found it very useful for streaming videos and other content from my computer to my television. It is simple to use and the picture is great!", "verified": true, "helpfulness": "0/1", "author": "DJ Tricky D"}, {"rating": 5.0, "review": "Works great and loving it. The small size make it easy to fit just about anywhere. Plus works with my iPhone.", "verified": true, "helpfulness": "0/1", "author": "Art"}, {"rating": 5.0, "review": "I got in on the Apple TV with the 2nd generation TV.  The current generation, the third one, is the best. 1080p content streamed to your television from your Apple cloud (any music, music video, tv show, movie, etc) or from your iTunes on your computer. You can also watch live and on zed,and content from many of the major network players like HBO, Disney etc. there's also sports fare like MLB, NHL etc for the sports fanatic. In addition, you have Netflix, YouTube and more.These days, I'm watching more content on my Apple TV from my BluRay digital copies, things I've rented or purchased from iTunes and Netflix content then watching regular TV. It's literally amazing.As always, the interface is easy and intuitive like any Apple product.It's extremely small, about the size of a hockey puck and unobtrusive. There's nothing dangling from the side of your tv like with Chromecast.If you're in the iTunes ecosystem it's an absolute no brainer. If you're on the fence, take the plunge. You won't know how you went without it before.", "verified": false, "helpfulness": "0/0", "author": "PopCultureWhore \"PopCultureWhoreDotCom\""}, {"rating": 5.0, "review": "Apple TV works great & has amazing pic quality!  My wife loved her Christmas gift.  It's also great that our daughter can watch Disney Jr as well.", "verified": false, "helpfulness": "0/0", "author": "Betsy Haley"}, {"rating": 5.0, "review": "we now own 4 and i am on the only one in the house without one... what gives?  I need one... easy, mainstream... fun", "verified": true, "helpfulness": "0/0", "author": "M. H. Self \"2atonce\""}, {"rating": 5.0, "review": "This thing is amazing. I can't believe it does everything that it does. I was disappointed that it didn't have ITunes but then it did (BAM!)an update and had it. I have to give it 5 stars though I'd like to take away 3/8 of a star for the awful, terrible, annoying voice that announces new screens. I guess if that's my only complaint, then I'm pretty satisfied.", "verified": true, "helpfulness": "0/2", "author": "C"}, {"rating": 5.0, "review": "Worked well and easy to install....just needed a little  walk thru on the TV  itself.I can wait to use the full potential of the system..Price on Amazon always  less than outside retailers", "verified": true, "helpfulness": "0/2", "author": "Liz  Van De  Mark \"CCShopper2563\""}, {"rating": 5.0, "review": "I really like the ability to throw my iphone or ipad up on the tv with this easy device.  This is my second one, and it seems to work a bit better than the older one.  This one is available to my iphone when the older one sometimes doesn't want to be found or stay connected.  Super device though!", "verified": true, "helpfulness": "0/2", "author": "Charles E. Ellis \"REV\""}, {"rating": 5.0, "review": "I am not one for lengthy reviews so I will keep it short and to the point. The Apple TV works very easy right out of the box and looks great. The controller is very user friendly even for children. We use this almost every day to stream Netflix and Hulu. It also does a great job at mirroring your computer and playing youtube videos and songs from any apple wifi device.Overall a great product and beats out roku any day of the week for me. I would recommend this over any like device.", "verified": false, "helpfulness": "0/0", "author": "Hambone"}, {"rating": 5.0, "review": "I have purchased 3 of these to have one on each TV.  I really like the way it interacts with all of my devices and provides both air play and access to my iTunes library for music, photos and movies.  I really haven't found anything to complain about other than you do have to check for software & firmware updates, there is no notification.", "verified": true, "helpfulness": "0/0", "author": "AKVHutch"}]