[{"rating": 5.0, "review": "High quality packaging, high quality product. Remote is small, feels great in your hand and works well. Was a breeze to set up, the only real question I answered was the language of choice! I did not even have to enter Wireless credentials, since I chose the Ethernet connection option. I have tried AirPlay, Netflix and Youtube so far, and the experience is great. Like the Netflix interface much better than the old clunky one my previous Vizio Blue Ray player had. I wish this supported Amazon Instant Video also.", "verified": true, "helpfulness": "0/0", "author": "Santosh Iyer"}, {"rating": 4.0, "review": "This is a great, simple product overall.  Apple just needs to commit further to it.  They did add Hulu Plus recently, and that is a BIG plus indeed.  However, they keep adding new iPads, etc but they refuse to bring the App Store or any real app ecosystem to the Apple TV.While it is a far more polished experience than Roku (which I also have), they need more apps.  Obviously they can handle an app ecosystem based on their success with iOS apps and the Mac App Store on OS X but they choose not to with Apple TV.If you use iTunes a lot (I would say I'm more on the music side, and have iTunes Match) and like to use AirPlay from your devices, this is still a killer product.  But I'd love to see more apps.Also, this is a far better option than using other devices like your gaming system.  I used to use my Xbox all the time for this type of media but Apple TV is far less power hungry and I feel that any long use of Xbox is just that much time spent moving closer to hardware failure so I save that time for gaming on it.", "verified": true, "helpfulness": "0/0", "author": "Audio Nut \"Computer and recording nut\""}, {"rating": 5.0, "review": "If you have ever had any Apple product, you know there is no middle ground... It is love it or hate it.I had a chance to compare (on daily use) this product with a similar, from a different brand, and it became obvious to me how superior the product was.", "verified": true, "helpfulness": "1/1", "author": "Hans Müller"}, {"rating": 1.0, "review": "Lowered to 1 star, DONT BUY THIS PIECE OF CRAPAfter the latest SW upgrade, everything has problemsa) Watching iTUNE movie, failed in 10 mins, and did not show up in rentail queueb) Watching Netflix - a) movie pauses/exists about every 10-15 mins b) loses sound every 6 mins or so.So all in all - restart the movie about 12 times in a 2 hr period.This is Apple, not netflix, since other methods of streaming work fine.Piece of crap, do not buy the latest one.All the other problems below still existWhen microwave is switched on in the kitchen, apple tv connection drops. - another problem ......Lowered to 2 stars.Wifi conntection keeps dropping, and almost impossible to reconnect without restarting the apple tv box. The other end is fine (iphone, mac, pc, etc). The only way to reconnect is restart apple tv. Very poor wifi used the apple tv side.Sound is really choppy, if you are an audiophile, dont even bother with this device, it's no good for musicLowered to 3 stars.Apple TV often loses wifi connectivity. (This is apple tv, since my xbox does not)The remote interacts with macs and tv at the same time, which is annoyingMany apps - amazon, pandora etc, not available on Apple TV (although Pandora from iPhone can be played onto Apple tvOverall reducing to 3 stars.Bought this after reading all comparisons of Apple vs Roku. No regrets on my choice, but both have limitations hence 4 starsPrice - the two I looked at Apple vs Roku, price was only 1$ diff. (98 vs 99). Even that, a few days after I bought. Amazon dropped Apple to $92. So even better now.Apple streams most things through iTunesI got rid of my wires,/connections to my receiver for audio/video, now stream my musin through itunes. Sounds great.(Some of the wires I had, had noise introduced on them, from the laptop power supply, and I had this same problem on mac and PC.Movies too, I stream through Apple TV.Why 4 stars?Network connection - the Apple TV often drops the wifi connection and then comes back. Since my laptops never drop connection, the problem is with the apple tv box, not with my wifi.Other users have complained, and I can confirm too, that when the connection drops/comes back, several times, my laptops/iphones cannot detect the apple tv. Then you have to do all sorts of workaroundsa) Turn the wifi off/on on phone/laptop. This works most of the time.b) Restart either the apple tv or your phone/laptopMany movies do not work through iTunes, so I need to stream using Xbox/Media center PC/ Windows Media Player. This is inconvenientMany TV apps on Roku, very limited on Apple,and not free.", "verified": true, "helpfulness": "9/16", "author": "minacel \"minacel\""}, {"rating": 5.0, "review": "works great, you can see your aperture photos, itunes music and itunes movies and tv series.works with Hebrew  subtitles.i use a third party app to edit my movies metadata to match apple look and feel.a wonderful product,", "verified": true, "helpfulness": "0/0", "author": "Amit Hasky"}, {"rating": 5.0, "review": "I do not regret this purchase at all. First it is easy to set up. You do have to buy the HDMI cable though. Really easy to navigate and use. The only drawback is that Amazon Prime does not work with it yet. I am still hopeful as this would be really great.", "verified": true, "helpfulness": "0/0", "author": "D. Georgi \"Davin\""}, {"rating": 4.0, "review": "While the Apple TV is a wonderful addition to your media setup if you have other products from the Apple family such as an iPod or an iTunes playlist that will sync up with it.  However, since the default remote that comes with the Apple TV does not have a keypad or many shortcut buttons.  With a better default remote, this would be a 5/5 product.  As such, it's only 4/5.", "verified": true, "helpfulness": "0/0", "author": "Hank"}, {"rating": 5.0, "review": "i have two in my home. it's a great product of apple.i love it. this new HD version is perfect.", "verified": true, "helpfulness": "0/0", "author": "Jean Pierre Boechat"}, {"rating": 4.0, "review": "First off, if you own multiple Apple products such as iPhone, iPad and etc, this is the perfect compliment to your i products. The airplay works great and you can stream music / photos and video to your TV (even though at a compressed format for high quality videos). It's a great way to share media with friends and family at home.If you are getting a streaming box to watch movies from the internet such as Hulu and Netflix, this is also the device to get. I think it has the most user-friendly interface out there for the most popular apps (but the lack of back button on the remote was confusing initially). Unfortunately, it doesn't have the Amazon Instant Video app, so it might be a deal breaker if you are a Amazon Prime user. Everything you buys from iTunes is also available to stream from Apple TV. And it also streams everything you have on your iTunes library.The only people I would not recommend to get this are the PC users looking to stream stuffs from their PC without going through iTunes. Since iTunes does not play a lot of video format that are popular on PC such as MKV, AVI, WMV, you would need to convert your video library to iTunes compatible format e.g. mp4. It may not be your best use of time. Some people had success jailbreaking an older generation of Apple TV that allows them to stream media without iTunes but as of the date of this review, it does not look like this Apple TV is jailbreakable. I would recommend getting the Roku 2 XD or XS for such users. They are available at Amazon at similar, if not lower, price.So if you are invested in iTunes and Apple hardware, definitely get this. If not, look for alternatives mentioned.", "verified": false, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "This was the best thing I could've ever purchased! I save so much money each month because I see no need for DirecTV now. I  love my apple tv! J plan on buying one more!", "verified": true, "helpfulness": "1/2", "author": "jamijo232"}]