[{"rating": 5.0, "review": "Works fine!", "verified": true, "helpfulness": "0/0", "author": "OV reader"}, {"rating": 5.0, "review": "Terrific", "verified": true, "helpfulness": "0/0", "author": "Dellel"}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Arturo"}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/1", "author": "Gerard Kabacinski"}, {"rating": 4.0, "review": "A nice substitute for who do not have a Smart Tv", "verified": true, "helpfulness": "1/1", "author": "Marco"}, {"rating": 5.0, "review": "How the heck did I not have Apple TV and Netflix until two months ago?  For $100 you can't go wrong with this device (or an Amazon Fire for that matter).  I chose this because I already have a MacBook that can sync super easily to it.  Netflix is a no brainer, but I also love the PBS Channel (Frontline and other great programming) and like I said the syncing capabilities.  I've cut the cable and use this as my primary form of entertainment (a growing class of people are doing this for a myriad of reasons).  To be honest, what is the point of having cable anymore if this little device can solve a lot of your entertainment needs?It's also very easy to set-up and I'd recommend the AmazonBasics HDMI cable as well.  Don't buy expensive cables.  They all do the same thing no matter what anyone tells you.", "verified": true, "helpfulness": "2/2", "author": "memory_tape"}, {"rating": 5.0, "review": "I was as advertised, it works perfectly. I got it super quick as well.", "verified": true, "helpfulness": "0/1", "author": "Andrew Reining"}, {"rating": 5.0, "review": "This is a great deal! $10 less than on apple's website and its brand new!", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 5.0, "review": "My niece and nephew loved it", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "Very happy with the purchase I will definitly buy more products from this seller", "verified": true, "helpfulness": "0/0", "author": "Sheila"}]