[{"rating": 5.0, "review": "I recommend this to anyone who is a fan of Apple and the ecosystem. The Apple TV speaks for it self great bang for your buck at $100", "verified": true, "helpfulness": "0/0", "author": "Daniel Makarewicz"}, {"rating": 5.0, "review": "Just got Apple TV delivered today and took less than 5 minutes to go through initial setup including connection to our wireless network. Tested with iPhone 4S, iPhone 5, and iPad 4...all work like a charm! To be more specific, I tested viewing photos, mirroring, and viewing videos (both stored on my device & streaming from internet sites).", "verified": true, "helpfulness": "1/1", "author": "Diptesh"}, {"rating": 4.0, "review": "Working as expected.  Not much suprise as I bought after thorough review over this product.  My internet speed might be a little slow, as every time when I try to use the NBA recap fuction, it will need several tries to have it work smoothly.  Other than that, everything is good.", "verified": true, "helpfulness": "0/0", "author": "crs83"}, {"rating": 3.0, "review": "I thought it would give me more access to free TV and Movies.I like the gadget because I can port things from my iphone to it.Yes, I would recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Chidi"}, {"rating": 5.0, "review": "I can watch videos on my iphone on TV, can browse you tube videos too. The HD movies on itunes store is awesome! great product.", "verified": true, "helpfulness": "0/0", "author": "Omen Jain"}, {"rating": 1.0, "review": "i have all iphone ipod and ipad it displays on tv about 32\"s is ok but the screen bigger than 32\" it is bad i want to return it but the packet i throw alway", "verified": true, "helpfulness": "1/6", "author": "ly"}, {"rating": 5.0, "review": "Great one easy to install and easy to use Apple TV 3rd generation amazing , good stuff great watching. I'm happy with Apple TV", "verified": true, "helpfulness": "0/1", "author": "Sam dawood"}, {"rating": 5.0, "review": "I liked it so much I ordered another for my second  TV. It is so much fun to watch what I want when I want ..", "verified": true, "helpfulness": "0/1", "author": "cje16"}, {"rating": 2.0, "review": "I'm a fan of many different Apple products, but I'm of the opinion that in recent years Apple has created one massively bad service (iTunes Match) and one not-so-functional product: the Apple TV 3.The 3rd Generation Apple TV should be great, and on first glance it appears to be. It can (under the right circumstances) play all your iTunes Match music, play Netflix/Vimeo/Hulu Plus/Youtube/iTunes videos, display your Photostream as a screensaver, and Airplay from your iPhone/iPad/iTunes PC/Mac.You'll notice that of the capabilities I listed above, many require some investment in the Apple infrastructure. I have that investment, with something like 8 Apple devices in my house from iPhones to a Mac Pro, and also have iCloud, iTunes Match, and a substantial iTunes library. Most of the function between Apple devices and the Apple TV works well. Unfortunately, the Apple TV's basic functions have serious issues.iTunes Match is the first major issue. I use both of them heavily. I already revealed my opinion of iTunes Match, which has been very difficult and problematic since I got it. If you set your Apple TV to stream iTunes Match music, it *will* freeze up every once in a while and stop playing until you tell it to start again. Very fast internet will not help you here, this is an Apple server problem. If you're running a PC or Mac with Homesharing enabled (and you should be) you can play your music from that, and it works like a charm. Of course, this requires you downloading the songs you want to hear ahead of time, which destroys the point of streaming.Photostream is a very cool feature that unfortunately doesn't seem to work properly for the majority of users. Google \"photostream apple tv 3 issues.\" My Apple TV recognized 268 photos out of about 700 I keep on Photostream, and will not recognize the others, despite updates and system resets. Do not get Apple TV for the Photostream feature, because there's no guarantee it will work.Netflix and other video applications work very well on the Apple TV - it streams 1080p content without a hitch (provided of course you have decent internet). Unfortunately, there are some serious issues with the Apple Remote. It's a great looking and feeling little device, but is not completely functional. For example, to change Netflix audio settings and subtitles, the Apple TV tells you to \"hold down the Select button.\" All that does is pause the video. In order to change these settings, you need to use the Remote App on your iPhone or iPad or iPod touch. Luckily that won't be a problem for most people, because so many households have one of those, but it's still an awfully annoying oversight. You can't watch Netflix videos with subtitles *unless* you use your other iOS device - and there are a number of similar, basic things you can't do without an iOS device.I'm keeping my Apple TV. I like what it does right - the interface, the aesthetics, and the functionality of iTunes Match (when it works), plus Airplay works well with my other devices. I could not recommend it to anyone who isn't willing to spend a few hours a month troubleshooting it. I really wish at this point that I had picked Google Music over iTunes Match, but since I didn't I'm willing to work with this sub-optimal device. If I wasn't reliant on iTunes I would switch to a Roku in a heartbeat, since they are vastly superior and easier to use in my experience.", "verified": true, "helpfulness": "16/21", "author": "Nicholas Moses"}, {"rating": 3.0, "review": "Two weeks later. The remote stopped working. I was so upset. After trying different options, I found out the remote battery is dead.", "verified": true, "helpfulness": "0/1", "author": "Degang Li"}]