[{"rating": 4.0, "review": "These things are great, I have two.  I mostly use it for netflix and HBO Go without any problem.  It's also great for working through PBS content on your own time.  iTunes movie rentals and purchases work really well.  My only gripe is that it doesn't do Amazon content natively (though you could stream Amazon movies from a laptop via AirPlay,) but I think that's kind of expected since I'm pretty sure the whole point of apple selling this thing is to make it easier for people to spend money in the iTunes store.It would be nice if they opened up the development process a bit for this thing, being limited to the apps that are pushed out is a bit disappointing, I bet third-party developers could do some neat things with it.", "verified": true, "helpfulness": "2/2", "author": "Christopher Mactaggart"}, {"rating": 5.0, "review": "I use Apple TV religiously. If you buy tv shows and movies from the iTunes Store this is for you.", "verified": true, "helpfulness": "0/0", "author": "davecavehasghost"}, {"rating": 5.0, "review": "I really like this :) i have a roku too and this is really neat because you can use air play if you have an iphone to put your pics and video on the big screen", "verified": true, "helpfulness": "1/1", "author": "A. Williams \"AMWill\""}, {"rating": 5.0, "review": "You gotta love this for work or play, we take it on vacation, we use one in the office to flip iPad and Apple Laptop presentations or content up to a wall mounted monitor. easy setup just listen to the setup prompts.", "verified": true, "helpfulness": "1/1", "author": "William C."}, {"rating": 5.0, "review": "Great product I own 3", "verified": true, "helpfulness": "0/0", "author": "Mark Lucas"}, {"rating": 5.0, "review": "This is a  truly excellent product.  It is quick and easy to set up and has many uses.  However, I originally purchased it for projection of  photographs and videos, made with my Iphone, onto a large screen HD television.  It has become a modern digital still image and video projector.  For that use, it is peerless.", "verified": true, "helpfulness": "1/1", "author": "W BURGIS"}, {"rating": 4.0, "review": "Too bad you cannot get Amazon films on it.", "verified": true, "helpfulness": "0/1", "author": "Ed K \"Edwin kaplan\""}, {"rating": 4.0, "review": "I love the AirPlay and remote app feature where you can use your iPod/iPad to control what you see. The only problem is sometimes my apps have trouble downloading content (like netflix). I did update the system and my internet is fine, but it don't happen too often. I also wish you can browse the web and add more apps but I guess in the future maybe?", "verified": true, "helpfulness": "0/0", "author": "B. Barrientos"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "LUIS LOPEZ"}, {"rating": 5.0, "review": "Apple TV is working out great for our family. I just wish it could host/store home movies on the device and not stream them from iTunes. Oh, well, I just have to make sure our computer is fired up and iTunes is up and running.", "verified": true, "helpfulness": "0/0", "author": "Scott Glime"}]