[{"rating": 5.0, "review": "My 3rd Apple TV in the apartment! should say enough!Beats Roku/amazon/google's units.  at $60... you cannot beat that price.  My friend has the Amazon stick thing and he hates it! My brother has the google chrome and it is a pain to get it to work.", "verified": true, "helpfulness": "0/1", "author": "Dr. RMG"}, {"rating": 5.0, "review": "Easy to set up and ties in perfectly with the Apple ecosystem. I love how I can stream directly from my iPhone.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "Our Apple TV has had issues for a year now with not staying connected to Hulu or Netflix or watching a movie. We have to restart the Apple constantly and it has all of the last updates. We just bought a Amazon FireStick and it is way better and way more stable.", "verified": false, "helpfulness": "0/1", "author": "Vital"}, {"rating": 1.0, "review": "I only got it to be able to airplay video from my computer, ipad, etc to my television.  There's really no way to put other then it fails miserable in any way I can think of for playing video.  It takes longer to download something then the actual length of the show or movie.  20-30 minutes for a 12 minute show is about average.  And before some apple fanboy makes an excuse my ps3 (which is almost a decade old) streams netflix, hulu, etc with no lag at all.  So it has everything to do with the apple device itself.  If you don't mind waiting a ridiculous amount of time to watch a program then once it actually has it ready to play, it plays fine.  You just have to plan well in advance when you want to watch a program.  None of the methods tech support has suggested have worked.  Not that it would make it better if I had to constantly fiddle with the device for it to work properly.  It should work properly and without having to do anything other then set it up once.", "verified": true, "helpfulness": "0/2", "author": "cby41"}, {"rating": 1.0, "review": "no direct access to amazon prime returned a bought a amazon prime", "verified": true, "helpfulness": "0/3", "author": "Julie McKinstry"}, {"rating": 2.0, "review": "It works fine but very sensitive to WIFI it Keeps dropping and it doesn't seem to have cache. I bought Apple TV to use with the Mirroring to ipad and the indicator rotating circular icon keeps popping up. It also has problems while watching Movies. The control has to have a direct path to the Apple TV. The Amazon Fire TV doesn't have any problems.", "verified": true, "helpfulness": "0/1", "author": "Rikardo"}, {"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/1", "author": "bt59"}, {"rating": 4.0, "review": "My first one stopped working after 3 years.  Works great.", "verified": true, "helpfulness": "0/1", "author": "RMP"}, {"rating": 1.0, "review": "This is from a longtime Appleboy.  This purchase was a huge mistake.  If you are tempted to buy this bad apple, do yourself a favor, go online and Google \"I keep getting a 'Connection Failed because your HDMI cable does not support HDCP'\" message.  If you don't heed this warning from the depths of Electronica Hell, you may be in for one of the worst mental journeys of your life.  To think that I was once a fairly normal human being, rather than the raving lunatic I have become, forced to type with a pencil stub because my arms are so tightly wrapped--when the guards aren't looking, that is.", "verified": false, "helpfulness": "1/4", "author": "J. O'Hara"}, {"rating": 5.0, "review": "My demanding three year old loves this thing", "verified": true, "helpfulness": "0/1", "author": "SAM K NY"}]