[{"rating": 5.0, "review": "Loved the Interface, loved the remote functionality with iPhone 5, iPad, iPod touch its just amazingly easy to use Remote App.Setup is easy, in 5 minutes I am ready to go...Airplay feature is too good and convenient.Apple TV box is so small that it fits in your hand, pocket and great finish, its really looks smart.Highly recommended product.", "verified": true, "helpfulness": "0/0", "author": "Rajesh Waghade"}, {"rating": 5.0, "review": "I own a lot of apple products (iPhone 4, Macbook Pro and an iPad 2) so this was the perfect fit for me. It works perfectly with all my stuff and the only thing at all is that the remote for the TV works on my macbook! But I usually just use my phone as the remote anyways! :)", "verified": true, "helpfulness": "0/0", "author": "LissieRae"}, {"rating": 5.0, "review": "So much in a small package. I ordered this so we could watch House of Cards, produced by Net-flicks. Great series and now we watch movies and view things from my iPad on the larger TV screen whenever we want.", "verified": true, "helpfulness": "0/0", "author": "MHiggy"}, {"rating": 4.0, "review": "Havent figured it all out yet but it seems to work well.  My favorite part is seeing my pictures from my desktop roll across my bigscreen.", "verified": true, "helpfulness": "0/1", "author": "randall myers"}, {"rating": 5.0, "review": "This works great.  It was a gift for a friend and they love it.  They live out of the country.", "verified": true, "helpfulness": "0/1", "author": "Judith Bentley"}, {"rating": 5.0, "review": "Another excellent product from Apple. Very easy to use. Updates have been great. Don't waste your time with the copy cats.Love it. Would recommend.", "verified": false, "helpfulness": "0/2", "author": "Gary Henson \"Khalil72\""}, {"rating": 5.0, "review": "The Apple TV is easy to work. I have it connected to a number of iTune accounts we have in the house. The Apple TV Remote App works wonderfully on my iPhone. I downloaded the Remote App because  I can see the remote that came with it comming up missing.", "verified": true, "helpfulness": "0/0", "author": "Juan Mason"}, {"rating": 1.0, "review": "When it works, it's great.  But when it doesn't, it's a headache and very frustrating.  Apple does not seem to want to support this device very well.  I try to access my video files on my computer and my Apple TV says to turn \"Home Sharing\" on in my computer.  But it's already on.  How to I turn it \"more\" on?  I turn it off, then on again.  Then I get \"Error 5599\".  What does that mean?  So I Google it and get to an Apple support bulletin board.  I find that dozens of others are wondering the same thing, all very frustrated.  Why doesn't Apple monitor their own bulletin boards and help us out?  I guess when you're the big gorilla in the room, you make the rules.  And if there are errors or glitches, you just call them \"industry standards\".", "verified": true, "helpfulness": "2/6", "author": "Stan Praisewater"}, {"rating": 5.0, "review": "Wanted to be able to stream movies and I'm an Apple product person so the choice was easy for me. It easy to use and makes a great addition to my home theater. Apple you have done it again!!", "verified": true, "helpfulness": "0/0", "author": "Donald Bruce Jones"}, {"rating": 4.0, "review": "Apple TV (MD199LL/A) is a pretty good supplement to my entertainment system. You can access many different non-apple accounts from; the NHL network to Vimeo and from youtube to Netflix. Also, you have the same access to the iTunes store that you would from a computer (albeit in a different interface). The real great thing about appleTV is that you can \"mirror\" your macbook and iphone to your television - this basically means that you can watch your computer screen on your TV. This only works if you have the iPhone 5 (or newer) and a 2011 or newer macbook pro - I'm not sure about other apple products, so please read the fine print before buying! Also, with slightly older apple technology (say iPhone 4) you will still be able to use airplay to play music and videos.However, I feel that apple is still lacking in the total user interface with appleTV. As of April 2013, they do not have access to an app store, so what you see on the main screen is what you get.", "verified": true, "helpfulness": "0/0", "author": "Johnny Vigneux"}]