[{"rating": 5.0, "review": "Great product and timely delivery", "verified": true, "helpfulness": "0/0", "author": "Sunil S."}, {"rating": 3.0, "review": "The Apple TV connects intuitively and streams effortlessly. It is an elegant little box that is well worth having for accessing iTunes content, even if you already have another mini-set-top device. However, if you are buying this to watch HBO Go or any other premium channel content, and your cable provider is Comcast, this will not work.I am not even trying to cut the cord. Seriously. I just want to be able to use a service I am already paying for to catch up on some of my shows before I fall asleep at night. But thanks to a 30 year war on Teddy Roosevelt's anti-trust and monopoly laws, tying arrangements are legal and pretty routine. Boring, I know. What it means as a practical matter is that Comcast can require you to install one of its subpar cable boxes and pay it to put a cable outlet in any room you want to watch your premium channels in. Or buy a Roku. Those are your options with Comcast and several other cable companies.And the other manufacturers of TV boxes go along with it. As do the content providers.", "verified": true, "helpfulness": "2/2", "author": "Elie 3173"}, {"rating": 5.0, "review": "This product gets an A+", "verified": true, "helpfulness": "0/0", "author": "no name"}, {"rating": 5.0, "review": "good!!", "verified": true, "helpfulness": "0/0", "author": "LIM chung ha"}, {"rating": 5.0, "review": "I like my Apple TV as much as I like my Amazon Fire TV ! Easy to use and amazing ! Specially with HBO now ! I'm all set and no more cable huge bill !!!", "verified": true, "helpfulness": "0/0", "author": "Teresa"}, {"rating": 4.0, "review": "Like my Amazon Fire better, especially the voice search", "verified": true, "helpfulness": "0/0", "author": "William K"}, {"rating": 2.0, "review": "A little too Apply and dumbed-down for my taste, but it works well enough. The remote is too simple, not enough buttons, and has slow response. The on-screen keyboard isn't qwerty, but rather alphabetical (who still does this?). The on-screen keyboard is also just slow overall, mostly due to the slow remote response but also it is built for an 80-year old who can't handle moving the selection box around too quickly, so when you hold in one direction it eventually accelerates to a turtles pace but it has the typical fluid Apple animation when doing it (eye roll). Not very fun to sign into all the services using the remote. I would pair a BT keyboard to it if I thought it would support one (maybe it does?).I only bought it to watch Game of Thrones. I later realized you can still get HBO NOW on a PC immediately, and I've had a home theater PC since 1998 so I obviously could have just used it on my 125\" projection screen. I shouldn't have listened to the LIES that said HBO NOW was an Apple-exclusive. My options were the lightning-to-hdmi adapter for $44 or the Apple TV for $67. Haha, kind of makes the decision easy. I ended up putting the Apple TV in my bedroom on the tertiary TV since the main two already have more abilities than the Apple TV provides.", "verified": true, "helpfulness": "0/0", "author": "M. McMillan"}, {"rating": 5.0, "review": "My second Apple TV, this one for the office. Love how fast I got it through Prime.", "verified": true, "helpfulness": "1/1", "author": "Scott Saghirian"}, {"rating": 5.0, "review": "the best electronic device.", "verified": true, "helpfulness": "0/0", "author": "SANGSIN LEE"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Doug Bailey"}]