[{"rating": 5.0, "review": "Apple TV is working better than I expected.  Easy and simple installation and setup, as I would expect from an Apple product.  I did have a problem with audio at first, but immediately found a fix online in Apple Support that took about 10 seconds to perform (simply turning my wifi off, and on again from my computer).  Total time to setup, even with the search and fix was 15 minutes.  I found ATV to have functionality and video channels beyond the music and photo/video streaming from my computer that I was wanting.  I was especially surprised to find that with AirPlay, I can use my TV as a monitor for my MacBook Pro.  I am very happy with Apple TV.", "verified": true, "helpfulness": "0/0", "author": "John J. Grimaud, MA"}, {"rating": 5.0, "review": "The apple tv is a phenemonal product, especially if you already have Apple products. I already have Netflix and Hulu accounts and my purchases on my ipad and ipod are paired with my Apple TV so I can watch the tv shows and the movies that I previously puchased on my Apple TV. It's a great product especially considering the price.", "verified": true, "helpfulness": "0/0", "author": "Mo Tashae"}, {"rating": 5.0, "review": "This is one of the best things I have ever bought!!  Love love loveI wish I had bought it sooner", "verified": true, "helpfulness": "0/0", "author": "Carla R."}, {"rating": 5.0, "review": "Easy to use. It's a fantastic product. Make sure to buy the hdmi cable with it. We like it so much we are going to get it for our other tvs", "verified": true, "helpfulness": "1/1", "author": "sj"}, {"rating": 5.0, "review": "Beca use ti is a product excellent with all i have Apple.I lije the conection Of my iPhone 5s And my tv with the Apple TV", "verified": true, "helpfulness": "0/8", "author": "pato781"}, {"rating": 5.0, "review": "No surprises here folks! Great for Netflix and streaming videos from your apple products to your TV. Yup pretty much a must have", "verified": true, "helpfulness": "0/0", "author": "Jos-Louis"}, {"rating": 5.0, "review": "very good has super HD feature i like,plus it was on sale great, thank you, very prompt service,will suggest to others, P>kumar", "verified": true, "helpfulness": "0/0", "author": "p.kumar"}, {"rating": 5.0, "review": "Easy to set up and great product. Small in size so it is not an eye sore. Love this product.Great packaging also.", "verified": true, "helpfulness": "0/0", "author": "S. Hanna"}, {"rating": 5.0, "review": "So pleased with this purchase. I absolutely love that I can also now listen to my itunes music through my sound bar.", "verified": true, "helpfulness": "0/0", "author": "Patty"}, {"rating": 4.0, "review": "+ AAA + AAA + always to have an apple tv is better..... Really the best for tv watchers and the whole family", "verified": true, "helpfulness": "0/0", "author": "MAURICIO SALEM"}]