[{"rating": 5.0, "review": "I have no idea how I lived without it. It's far superior to Roku, XBox, and all those other vehicles to run apps like Netflix and Hulu to the TV.  I have used both the XD Roku and XBox Live and Apple TV is far faster, runs smoother, and is easier to use; that alone would be enough to get it. On top of that though, you can play music or videos on the TV wirelessly from you Mac, IPhone, or IPad... But if you don't have any Apple products, it's still superior to the other devices.", "verified": true, "helpfulness": "0/0", "author": "JoDean"}, {"rating": 5.0, "review": "Easy interface and complete integration with iTunes, Netflix, Pandor and your computer.  It's also fun to 'project' from your iPad or iPhone. Not sure I can tell the difference between the 720 dpi and the 1080 dpi versions (I have both) but my largest TV is only 42\".I have two Apple TVs (one upstairs and one down) and am a huge fan. I just wish they would add Amazon VOD, but won't likely happen since they compete, so I have to switch to my Blu-Ray or Xbox to watch Amazon VOD.  Still searching for one device to rule them all...", "verified": true, "helpfulness": "0/0", "author": "Helen"}, {"rating": 3.0, "review": "Good product, easy to install and use for all ages. Vey limited in the online channels you can see !.", "verified": true, "helpfulness": "0/0", "author": "Luis Elizondo"}, {"rating": 5.0, "review": "This product changed my life. I don't even need cable tv anymore, so I cancelled my Time Warner subscription and save $150 a month. Not bad, eh? If I want a show, I can buy it on Hulu. And I watch films on Netflix. And I can airplay from my MacBook Pro. What more could you want? Everyone needs an Apple TV.", "verified": true, "helpfulness": "1/1", "author": "LJ"}, {"rating": 1.0, "review": "You can watch just mp4 ! : mkv, avi... impossible !I like apple but 100 $ for that : no way !", "verified": true, "helpfulness": "1/5", "author": "Sylvain"}, {"rating": 4.0, "review": "I just got an Apple TV and for the most part I love it. I would give it 5 stars if it had more apps like Pandora and Last fm. Setup was simple and I love being able to connect my Mac.", "verified": true, "helpfulness": "0/0", "author": "J. N. Leute"}, {"rating": 5.0, "review": "From order to delivery, Amazon was great!  My Apple TV arrived on time and was simple to set up (5 min).  With a high-def HDMI cable, Apple TV is streaming Hi-Def movies and TV shows from my iPad, iPhone, Mac and iCloud beautifully (even between floors)I now have two Apple TV \"pucks\" and I'm sold on the simplicity, quality and performance for the price.", "verified": true, "helpfulness": "0/0", "author": "Scott - Canton, MI"}, {"rating": 4.0, "review": "Nice interface, very easy to setup and connect with other apple devices and services.  Only con is limited content -- no hbo go, no amazon prime, etc", "verified": true, "helpfulness": "0/0", "author": "CA"}, {"rating": 5.0, "review": "I bought as a gift for Christmas to a friend.  They told me they love it so far and use it everyday.  I wish I could tell you more but I gave it away...", "verified": true, "helpfulness": "0/0", "author": "Jim Bourisaw"}, {"rating": 4.0, "review": "Setup: The setup on the box was very easy. Apple TV saw my wireless internet right away and after some tweaking I was watching movies in no time. Just remember that you do need a HDMI cable.Pros: The usability was truly was better than what I expected. It allowed me to watch movies and listen to music from iTunes. I could also use my TV as an extension of my I-Pad which was an added bonus. This device will continue my use of Apple products for the time being.Cons: I think the only con for me is I live in an area where the internet is not that speedy. So by the time I am using wireless the Apple TV system can be slow. AKA: slow buffering and everything taking longer than it should. This is no fault of Apple TV just something to consider if you don’t have fast internet.", "verified": true, "helpfulness": "0/0", "author": "A. Freeman"}]