[{"rating": 5.0, "review": "i would buy another one of these. I don't have to buy a adapter for my iphone to play movies on the tv. this new age of \"streaming\" movies is wonderful.", "verified": true, "helpfulness": "0/0", "author": "Mexman00 \"mexman00\""}, {"rating": 4.0, "review": "We use our Apple TV as is, no jailbreak, so far, and this has been working fine. Setup with itunes cloud we play our own music collection off of the apple TV a lot, but many times we are having issues with the connection it took days, maybe even weeks before all of our library was available on the AppleTV. I think this is an itunes cloud issue and not a hardware issue. Applications for youtube isn't up to its best performance yet. Sometimes downloading itunes movie rentals or purchases gets stuck if the broadband internet connection isn't performing at top speed. Just for us, we found that Hulu plus isn't that great for providing additional options to Netflix. We use the mirroring for iphone and ipads every now and then but manytimes just using an hdmi cable direct between the iphone, ipad or laptop to the TV screen's hdmi port is many times the better option.the remote control for the AppleTV still has a lot to be desired---is quite small and hard to control even with my smaller female hands, but my husband and teen sons don't like the small size. Even i feel like the remote control is going to fall out of my hands while I use it. The controls are pretty basic, and I must see primitive. A keyboard would be a nice add-on option especially for the simple task of keying in words for searches, rather than toggling from letter to letter with the up-down-left-right RC buttons. Are you listening, Apple? (Wait! as per E.J.'s almost immediate comment, there is a free Remote Control app for the iphone and ipad that you can use with the Apple TV. I just tried it and it is a handy remote control alternative that I am still getting used to, BUT i really like tapping searches in for itunes, movies, netflix and youtube instead of toggling for letters. Highly recommend using it with Apple TV now. Thank you, E.J., for the tip)So lots of 3rd-party factors going on for the AppleTV to perform to its max, but we don't regret cutting our cable TV off and saving 70% off of our ATT Uverse bills!I read up on jailbreaking the AppleTV to get more content on this thing, but I am looking forward to a paradigm shift for smart TV so that more content will be made available through this medium.", "verified": true, "helpfulness": "0/0", "author": "Omehra \"Being. Differently.\""}, {"rating": 5.0, "review": "Bought this for Christmas, it's great. Very easy to use, so much fun to use with the iPad home sharing. Only feature \"missing\" that I'd like to see is the ability to control it remotely using voice commands (have gotten used to this with the Xbox Kinect with the Netflix/Hulu/Amazon Video apps), but that's just a wish, and probably will be included someday.Great buy, especially if you have an iPad or new iPhone that does the home sharing.", "verified": true, "helpfulness": "0/0", "author": "jaimilyn"}, {"rating": 5.0, "review": "Apple TV is great for homes with iPhones and iPads. We got it primarily to stream our pictures as a screensaver on the TV and are enjoying airplay and the built in apps as well. Easy to set up. Amazon as usual has super fast shipping and great prices!", "verified": true, "helpfulness": "0/0", "author": "H. Turner"}, {"rating": 4.0, "review": "its better than waiting for the ps3 to load up for netflix and now can stream my itunes to my son's room", "verified": true, "helpfulness": "0/0", "author": "steven d"}, {"rating": 5.0, "review": "Apple TV.  How do I love thee?  Let me count the ways....No more DVD player.NetflixCan I get rid of cable yet?  Pretty soon.My only complaints, can't stream hbogo or PBS. I'm us they'll get there one of these days.  But it hasn't dulled my Apple TV love affair", "verified": true, "helpfulness": "0/0", "author": "Amy O \"sista411\""}, {"rating": 5.0, "review": "Easy to hook up and use.  Some difficulty finding the right setting on the TV to get it to come up, but all go after that.", "verified": true, "helpfulness": "0/0", "author": "SeaLoon \"Sailors on SeaLoon\""}, {"rating": 5.0, "review": "Apple TV has a user friendly interface that is easy to learngreat for owners of other apple gear because of AirPlay", "verified": true, "helpfulness": "0/0", "author": "Matt D"}, {"rating": 5.0, "review": "I now have 2 of these in my house. One in the living room and 1 in the bedroom, it makes life a lot easier.", "verified": true, "helpfulness": "0/0", "author": "Fern Gtz"}, {"rating": 4.0, "review": "Pros: AirPlay mirroring, Super Compact, Easy Set Up, Great User Interface, 1080Cons:  Limited Apps, AirPlay mirroring blocked by Comcast/HBO using portable devices (iPad, iPhone), Doesn't work with other devices, no control of AirPlay when mirroring from iMac in other room.My favorite feature with Apple TV is the AirPlay mirroring.  When I am visiting friends without cable, Netflix or Hulu, or on the road traveling, I can easily get access to these shows or live streaming if I bring my ATV along with my iPad and connect to an HDMI device.But, outside of ATV's AirPlay mirroring, I am left wondering what else can I do?Apps on ATV are very limiting.  If you are buying this for the current app line up and not Airplay Mirroring, I suggest buying a Wireless Sony Blue Ray DVD player.  Head to head, the DVD player has far more usable apps than Apple does, it plays DVDs, Blue Rays, and even does 3D DVDs... and cost $130 vs $95.  Well worth the extra $35... but it doesn't do AirPlay mirroring.When using AirPlay mirroring, I am limited to controlling streaming from the device which is being mirrored.  With the iPad this isn't a problem... but if I am using the iMac which is located on the other end of the house, this isn't fun, but is good exercise.  I can't even pause a movie.  If your question is why don't you just mirror it from your iPad, well the answer is that not everything can be mirrored from portable devices.  Comcast & HBO have blocked the ability to mirror from your iPad/iPhone, but not the case from my iMac.  It would be nice if the ATV gave some control to pause the iMac in the other room.UPDATE to Mirroring:  HBO recently updated their app and I can now mirror HBO Go on my Apple TV from my iPad.  Additionally, I have been able to use the remote to pause, rewind and fast forward... or simply use my iPad to control everything.  This is a much better improvement and makes me raise my star review to 4 stars.After getting the ATV, I shelled out $25 for a yearly subscription to iTune's Match.  That was 3 weeks ago and 90% of my music has been uploaded.  The first 80% took a few hours, the remaining 20% is taking forever because the music wasn't matched from iTunes catalog.  I understand some of my music isn't on iTunes, but there seems to be some that is on iTunes that isn't getting matched from the iTunes library.  Match allows me to AirPlay my music from the Cloud in another room with ATV without connecting to my computer.  This is especially useful when on the road.Not all Netflix & Hulu apps are the same and ATV wins easily for their interface.  I have these services built in on my Vizio Via TV in our bedroom and the Sony Blue Ray in our living room.  Apple TV wins easily in user interface.  The Sony comes last in quality.  It is a bit wonky, the layout is weird, and reading titles is nearly impossible.  The Vizio is a bit better, but is also limiting.  The Apple TV is clear, easy to navigate and even gives you extra search features in Netflix.  For example, on some movies you can go to the cast list and click on each cast member to find other movies they appear in. The layout is well thought out and easy to navigate. Great!I have high hopes for ATV in the future.  Coming from Apple, I expected more Apps and they should be delivering on this ASAP.  Additionally, giving the user two way control using AirPlay mirroring is much needed.  I should be able to pause my iMac in another room from my ATV.  Finally, ATV will reign supreme if the user can also mirror and control a remote computer from another room on a television using a keyboard/mouse or trackpad... in essence, giving the user the feeling of having a 2nd computer in another room.This is what I expect from Apple and until then I really can't give it a better rating.", "verified": true, "helpfulness": "2/2", "author": "R. LUCAS \"RustyGumbo\""}]