[{"rating": 5.0, "review": "Very happy with this device. Keeps getting better with more apps, and upgrades in Apple services. I am getting one for every TV in our house. Great for Netflix and HULU, but Airplay is the real winner.", "verified": true, "helpfulness": "2/2", "author": "Stow Fresh \"Stow Fresh So Fresh Review\""}, {"rating": 5.0, "review": "As a bit of background, there are 4 iPads, 2 iPhones, 2 iPod Touches, and a Mac Mini in my house. Because of all the iOS devices around my house and because all my media is already in iTunes on the Mac Mini. Anyway, because of all this, I made the decision to purchase the Apple TV instead of a Roku that I was looking at and so far I am very pleased. The apple TV connects easily to my itunes library and plays all of my movies and music. Using Airplay to stream music and videos off of my assorted ios devices is very nice also. Netflix and Hulu both work well on the Apple TV and there are many other \"Channels\" such as sports, and childrens programming that will appeal to others.In summary, if you already have your media in itunes or have ios devices this is a very good choice for a streaming device.", "verified": true, "helpfulness": "2/2", "author": "Jeremy S"}, {"rating": 5.0, "review": "I love apple tv. Because I don't  need a smart tv. I use apple tv search everything on line or NetflixI used it just like smart tv.", "verified": false, "helpfulness": "1/1", "author": "tuan"}, {"rating": 5.0, "review": "This is probably one of my most used electronicsIf you have a bunch of music or movies on your itunes then i would suggjest this product over and overyou can't beat airplay if most of your library is on itunes.BUTA roku might suit others needs better especially if they don't use airplay", "verified": true, "helpfulness": "1/1", "author": "Andrew"}, {"rating": 1.0, "review": "This must be some kind of joke!  I just bought an Apple TV and a HDMI cord at an Apple store yesterday for a total of $126.  Amazon should kill this ad and protect it's customers.  Buyer beware!", "verified": false, "helpfulness": "13/23", "author": "Mark Amershek"}, {"rating": 4.0, "review": "Great at streaming content, a lot of great apps, Apple keeps updating for more content.  Showtime needs to get on the ball and put an app on there.  Amazon can be airplayed but you need another IOS device to do it.", "verified": true, "helpfulness": "0/0", "author": "MJO"}, {"rating": 2.0, "review": "My wife and I actually now have 2 apple tv's... so it's probably surprising that I'm giving the product 2 stars, right? Well the majority of the time I like the Apple TV just fine. The main issue comes from renting movies through the Apple Store. We have one Apple TV in our living room and it seems like a basic function would be to put the movie on pause and resume playing in the other room, right? WRONG. I've literally unplugged the other Apple TV so I can just watch our silly movie in the bedroom to finish it, but guess what? That $5 you spent on a movie, you can't watch it unless you stay in your living room. Or you can go back and forth trying to log out of Apple ID's trying to get it to play. Convenience is what they are supposed to be selling with this product, but when it comes to this moving switching, it's absurd. I truly don't understand how they couldn't make this simple feature easier. I am planning on a 3rd streaming device and will be giving another brand a shot at it.", "verified": true, "helpfulness": "1/2", "author": "Scott"}, {"rating": 5.0, "review": "The hardware is elegant and it was easy to setup. The initial update took some time but I was streaming from my iTunes library and Hulu in no time. Picture quality is great. The remote is simplistic and the menus are easy to navigate.Update: I have been using my iPhone with the Apple tv's airplay ability to stream video and music from my phone and it works great.", "verified": false, "helpfulness": "2/2", "author": "M. Olson \"zeusofolympus\""}, {"rating": 5.0, "review": "We all have iPhones or iPods and Windows machines with iTunes on them. I installed AirParrot on my Windows Asus laptop and have had no issues whatsoever this this. The video and sound quality is stellar for Netflix, Hulu, iTunes (movies, radio and more). Plug it in, go through the setup and BOOM! You're ready to rock n' roll.Must have if you are already or plan to join in the Apple ecosystem.", "verified": true, "helpfulness": "2/3", "author": "B. Franklin \"Breklin\""}, {"rating": 5.0, "review": "I purchased this for my mother to watch shows on the TV since it has a bigger screen. She loves it and would never go back to watching it via the computer or smartphone.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}]