[{"rating": 4.0, "review": "I had no problem using the Apple TV to view movies or listen to music.  Just plugged it in and started using itBut, I struggled connecting my iPad and Apple TV.  I had wanted to view pictures taken on my iPad using the Apple TV. Apple support was great!!", "verified": true, "helpfulness": "0/0", "author": "Gma"}, {"rating": 4.0, "review": "With the release of Mountain Lion (OS X 10.8), the Mac has gotten the ability to mirror screen content to the AppleTV. To me, this means the AppleTV has gone from being a useful enough product to one whose flexibility and multitude of uses make it something you should own if you have any toehold into Apple's ecosystem.I will keep it short and simple! Below are some simple pros and cons too:Pros:++ Simple set up++ Very pretty and smooth++ AirPlay (for music and video)Cons:-- Very limited channels/content-- iTunes only for content, even for in network- iTunes match dependent for musicI wouldn't have bought it for myself but my friends got together and got it for me on my birthday on VenTribe.comI like it, and I think you will too!", "verified": false, "helpfulness": "0/0", "author": "Tahir Popat"}, {"rating": 5.0, "review": "I love this product. Very easy to set up and very easy to use. The price was competitive and the delivery was as advertised. I am very satisfied.", "verified": true, "helpfulness": "0/0", "author": "roger"}, {"rating": 5.0, "review": "Great ! This Apple TV meets my expectations. Easy to set up and running. Very good image quality. Product arrived to my home in time in accordance with the schedule given by Amazon.com", "verified": true, "helpfulness": "0/0", "author": "Juanjo"}, {"rating": 3.0, "review": "I bought this box to get the 1080p capability.  I already had an AppleTV with 720p.  I was hoping that at last we could project the laptop screen onto the TV like the similar non-Apple products.  With the iPhone and iPad the screen projections for movies and videos goes smoothly.", "verified": true, "helpfulness": "0/3", "author": "PDM \"Moo on Books\""}, {"rating": 5.0, "review": "The Apple TV device is so much sleeker than I had anticipated, yet it beats out most such devices I have tried in the past. It is unobtrusive kept beside our TV. It took probably 5 minutes or less to set up. Connected wirelessly to my iTunes account, I was vowed by this long. Of course it connects to Netflix , Youtube etc. The thing I would like to see improved is the search feature. I understand the sleek remote and limited buttons on it make it tedious to search for videos, but typing names becomes a little bit of a stretch with it. Hopefully this issue will be resolved some day, which would then make this an even more excellent product!", "verified": true, "helpfulness": "0/0", "author": "B. Thompson"}, {"rating": 1.0, "review": "I have an internet ready Panasonic Viera TV. It has many applications pre-installed such as Netfilx, hulu, Amazon video, etc. The problem with this semi-smart TV was that it could not display subtitles of movies in many cases they were foreign language. I assume the Apple TV should be smarter than the Panasonic TV and it will be able to display subtitles as my iPad did. But it turned out that the Apple TV is as dumb as my TV set. I was very disappointed and returned it back to Amazon. The returning experince with Amazon was first class as smooth as silk.", "verified": true, "helpfulness": "5/14", "author": "Bohai Zhang"}, {"rating": 1.0, "review": "I bought this thing to be able to play DVDs off of my MBP without having to deal with dongles, hdmi cables, etc.  Well, it can't.  Web search on \"apple tv dvd checkerboard\" and you'll see what I mean.  Thank you Apple.", "verified": true, "helpfulness": "1/11", "author": "van z"}, {"rating": 5.0, "review": "I bought this about 6 months ago to put in my jewelry studio so I could watch some great shows while I work. I haven't had any issues with it at all. I bought a HDMI cable and put it directly into the TV so I can switch from Apple TV to a DVD player easily. I like having all the shows I've purchased on my iPad or Mac ready to watch on a TV. I'm seriously considering buying another one for a main room TV as well. I like the remote that came with it, no problems with that either. Everything just works. :)", "verified": true, "helpfulness": "0/0", "author": "sn315on"}, {"rating": 5.0, "review": "Apple does it again. After having a Logitech Review with Google TV that gave me nothing but trouble, I upgraded to the Apple TV. Can't say enough about it, it is like all other Apple products, FLAWLESS!! Have only had it a month and not played a lot with it but what I have seen of it makes the Google TV look sad in comparrison. Highly recommend this one!", "verified": true, "helpfulness": "0/0", "author": "Mickey"}]