[{"rating": 5.0, "review": "Sorry , but I had to return it because my son got it for me for Xmas. Anyway, it is what I expected. Great product.", "verified": true, "helpfulness": "0/0", "author": "Sergio Garcia"}, {"rating": 5.0, "review": "APPLE TV IS MY FAV.... bought this one for my gf.  She has no cable but with this bad boy... she can use my passwords for the various apps and I can now watch sports at here place on the ESPN app!  THANK YOU SWEET BABY JESUS!", "verified": true, "helpfulness": "0/0", "author": "Jonathan E. Lee"}, {"rating": 5.0, "review": "The Apple TV MD199LL/A has two basic functions. It's an audio/video streaming device like the Roku and it's a wireless connection device between your iPad and your television - that's the \"Airplay\" feature.  My family has both the most recent Roku and the Apple TV. The Roku and the Apple TV have more similarities than differences. Both are compact, easy to set up, compact, have a simple menu navigation system and provide excellent streaming. Not surprisingly, the Apple TV features iTunes store rentals and purchase of music and movies and Apple Radio. The Roku doesn't have Apple Store but basically has all the competitors, Vudu, Amazon, etc.  As a device for streaming movies, I'd give the nod to the Roku.  The ace up Apple's sleeve though is the iPad connectivity. With Airplay turned on I can play whatever is on my iPad (iPad 3 in my case) on my television (projector in my case) through the Apple TV. This makes the Apple TV the perfect accessory for a home theater system. Instead of playing my ipad through it's on board speaker or headphones, I can play it through the home theater system speakers while I carry it rather than have it tied to the charging stand.  I stream a lot of Pandora, Sirius/XM and Youtube music videos. Lately I've been getting into Apple Radio also.  The audio and video quality of Airplay streamed content is great. There is some lag (latency) that makes airplay connections unsuitable for most games.  By the way, I tried playing software instruments on the iPad through using the Airplay audio. As I expected, there was too much latency, at least a full second between when I hit the notes and when the sound arrived. I didn't notice the same latency playing movies. The iPad must compensate on streamed video feeds.  I think it would be great if Apple came out with an Audio-only over airplay mode which would allow a huge reduction in latency.  We'll see if it happens.  I'm giving the Apple TV five stars, because for under $100.00, it's a very useful little box. If you have an iPad and a home theater receiver, the Apple TV will increase your enjoyment of both.", "verified": false, "helpfulness": "2/2", "author": "Steve Conslaw"}, {"rating": 5.0, "review": "The apple tv has been a staple in my home as we stream, mirror, and play almost all media through this device.  The product receives the appropriate updates in a timely manner and is well priced on Amazon versus other retail vendors.", "verified": true, "helpfulness": "0/0", "author": "Paisley"}, {"rating": 5.0, "review": "Love the Netflix layout. Works well with my Vizio TV.  The movie rental option worked great.  My kids love it.", "verified": true, "helpfulness": "0/0", "author": "Biffster"}, {"rating": 5.0, "review": "I wasn't exactly sure what to expect.  I was just hoping that it would be easy to view my photos & videos on my regular TV.  Not only does my Apple TV do that, but it also allows me to watch my Netflix, as well as so many other options.  Why I waited so long?  I have no idea.  Great product, great delivery!", "verified": true, "helpfulness": "0/0", "author": "love2travel"}, {"rating": 5.0, "review": "Works as advertised, seems like a must have item for any apple groupie but its a nice standalone device also if you want to use netflix", "verified": true, "helpfulness": "0/0", "author": "Cent \"guitar player\""}, {"rating": 5.0, "review": "I am using this little budget for more then 2 years. Still totally in love with it. It's still way better than Chromcast we've got a few month ago. Would recommend to anybody.", "verified": false, "helpfulness": "0/0", "author": "Carl Berglumd"}, {"rating": 5.0, "review": "Apple mirroring excelent way for look every thing arround apple products, I'm use w iphone, ipad, macbook and mac mini", "verified": true, "helpfulness": "0/0", "author": "Rchantos"}, {"rating": 5.0, "review": "Plug it up and it works the way is says. I use this for music streaming with a DAC. Well made, but its apple.", "verified": true, "helpfulness": "0/0", "author": "dwest"}]