[{"rating": 5.0, "review": "This is how I've been watching TV for the past year. It works great.", "verified": true, "helpfulness": "0/0", "author": "Michael \"read booker\""}, {"rating": 4.0, "review": "Great procuct to own.", "verified": true, "helpfulness": "0/0", "author": "Ed Garza"}, {"rating": 5.0, "review": "Awesome for 68$.....the AirPlay feature (which I had no idea what AirPlay was at the time of purchase) would make my rating a 7...wifi reach is amazing", "verified": true, "helpfulness": "2/2", "author": "Daniel R. Druzsba"}, {"rating": 5.0, "review": "If you have any Apple products this is a must! AirPlay is the most amazing thing ever. Have purchased one for every TV in the house!", "verified": true, "helpfulness": "1/1", "author": "KR"}, {"rating": 5.0, "review": "Got this and have never been happier with a purchase! Was able to give Comcast the boot and we still get to watch our shows! Works really well with our TV. Only downside is the remote is pretty small and gets lost easily. I recommend attaching it to something larger.", "verified": true, "helpfulness": "1/1", "author": "Nicole DeFelice"}, {"rating": 5.0, "review": "I'm very happy with the performance of this box, especially the quality of the output video, after the Sony box I bought, which has poor ability to connect with my network, and isn't capable of showing video during F/F or Rewind. My only dissatisfaction is in that it does not provide access to Amazon. I assume that's because of some lame business rivalry thing...", "verified": true, "helpfulness": "1/1", "author": "David J. Shields"}, {"rating": 5.0, "review": "The Apple TV works really well with my other Apple devices. The interface is easy to use, though I think the option to use an iPhone/iPad as a remote should be more robust than just mimicking the stock remote.  Overall it manages my accounts and lets me access all the streaming services I want to use, and I recommend it, especially if you use Apple products already.", "verified": true, "helpfulness": "1/1", "author": "T. Moody"}, {"rating": 4.0, "review": "Very useful and convenient gadget, I simply love it - easy to install, fits anywhere, can AirPlay anything on your iPhone, iPad or MacBook.", "verified": true, "helpfulness": "0/0", "author": "Jollychan"}, {"rating": 2.0, "review": "I bought this because I thought it would hold the wifi signal better and stream faster than my Sony Playstation 3. It does neither. The only reason I am keeping it is for HBO Now, which Playstation still does not have access to.", "verified": true, "helpfulness": "0/1", "author": "Mr.Opey"}, {"rating": 5.0, "review": "as expected", "verified": true, "helpfulness": "0/0", "author": "noc"}]