[{"rating": 3.0, "review": "We own MacBooks, iPods, iPhones, and iPads all in a variety of versions.  The apple tv is my LEAST liked product. It is always losing connection with my wireless whereas nothing else seems to have that trouble. I have a roku as well and it NEVER loses connection to my wireless. The graphics on the screen, like the iTunes screen are fantastic I will say.  But that is a minor point. Also, the remote is so tiny. I've already lost one remote. I had to go purchase another one and they are pricey!  We are huge Apple fans, but I am just disappointed with the apple tv.", "verified": false, "helpfulness": "3/4", "author": "CrazedMomof4"}, {"rating": 5.0, "review": "Great device! You can connect netflix and hulu plus and all the other streaming sites to it. Fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kathy Crawford"}, {"rating": 3.0, "review": "Apple doesn't allow Amazon to be used with airplay.  Its silly because you can have the app on your phone of iPad, but cant stream.  very frustrating.", "verified": true, "helpfulness": "0/1", "author": "Will Edward Patrick"}, {"rating": 5.0, "review": "I have had this for 9 months now and is great. It is a good product for the price. I recommend to a friends.", "verified": true, "helpfulness": "0/0", "author": "Fyador \"Zugzwang\""}, {"rating": 5.0, "review": "Great product worked right away arrived on time , Finally I got it !! now I can enjoy netflix, Youtube, Vimeo and more... the right way :) you should get it !!", "verified": true, "helpfulness": "0/0", "author": "Cyberfish \"Ocean Lover\""}, {"rating": 2.0, "review": "I bought the Apple TV to stream my amazon prime and xfinity tv videos to the tv. It cannot be done, not even with the mirroring feature. I'm returning the Apple TV since I have no use for it. I don't need Netflix or Hulu since I have amazon prime and iTunes is too expensive.", "verified": true, "helpfulness": "2/4", "author": "Luis Antonio"}, {"rating": 5.0, "review": "Very Easy set up and learning curve.  Really cool playing video from Iphone and IPad by Bluetooth on big screen.", "verified": true, "helpfulness": "0/0", "author": "D. DERANGO"}, {"rating": 5.0, "review": "Apple TV is fantastic. It's easy to configure and I highly recommend this product to any other users considering purchasing it.", "verified": true, "helpfulness": "0/0", "author": "mneal"}, {"rating": 1.0, "review": "I have been a happy apple user for many years. However, this apple TV has changed all that. I have been on the phone with apple for more than 3 hours, my phone company for 2, a family tech wiz for 1, not including my own time on the internet. It still won't join my network. I have been able to download and re install the soft ware on this product, but it refuses to join for anything else. Apple finally decided that it was due to WEP password on my airports. I changed everything to WPA as they requested. Still doesn't work. I opened the ports, still doesn't work. Shared the connection from my mac, still won't work. My brand new mac joins with no issues at all. Apple is refusing to replace. Very disappointed in this\"new\" un-customer friendly apple. I will return this product and purchase a ROKU which is almost 50% cheaper and reviews say does twice as much.", "verified": true, "helpfulness": "6/13", "author": "Kim S. Zoss"}, {"rating": 5.0, "review": "Admittedly, I have not Had the unit for more than a week by this time, but that is aside the point.MAIN Reason for selecting this unit was so that I or MA Hon could hook up and watch the contents of our other Apple Products, (POD, PAD, Air, Pro, Phone) on the TV Screen. and as far as this part is concerned, it serves its purpose, thou I still have to figure out how to interact on it with my Macbooks.Hook up, install and configuration was done in less than 15 mins, including the initial update.The User Interface, ie the Remot, leaves abundance to be desired, and With Iphone/iPad/Mac interaction, One would expect to be able to Input faster With the keyboard, but that is not supported.The connectivity is pretty standard, wifi or Ethernet for input, and HDMI for output.Surely i would had prefered if i could connect my external USB HDD to it too, but that is not supported. Then again, the item is a STREAMING Device. So that is Apparently not what it is suppose to doThe Pre-Set options that comes with this unit is VERY Limited. beside home sharing of the content on the Apple Products or the Purchases from ITunes, it only offers YouTube, Hulu and Netflix for streaming contents right off the internet. the search in youtube is easy and simple, but it lack the option to Sort or Refine the results with any criteria or catagory. at least I have not been able to locate the option to do so as of yet.", "verified": false, "helpfulness": "0/0", "author": "Thomas Bangash \"THBangash\""}]