[{"rating": 5.0, "review": "I absolutely love my new Apple TV, it is definitely worth the money that I paid. It came as expected, and in the time frame expected with my Prime membership. The Apple TV can do so much as far as syncing with my iPAD,Macbook Pro, and iPHONE .. I love the airplay feature, and the fact I can mirror my devices to my TV,, and even airplay off my BOSE Air-link speaker. I highly recommend the APPLE TV, and especially recommend it if you own APPLE products.", "verified": true, "helpfulness": "0/0", "author": "Nolesfan84"}, {"rating": 1.0, "review": "My primary use for Apple TV is as a netflix device. It does NOT perform this function well. It will often have a problem connecting to netflix, which requires a reboot to fix. It also knocks out airplay functionality when this glitch occurs. This happens regularly, making it almost useless for this function.I now use my ps3 for netflix in the living room and a roku for the bedroom. Not only better performance, but better interface on those devices.I do like airplay, and the ability to access my itunes media... But it is so unreliable I would never buy this product. If they ever fix this glitch I would up my rating significantly... But this essentially destroys functionality and no fix has occurred in too long a time (and I update the software as soon as it is available).", "verified": true, "helpfulness": "1/4", "author": "J. Ranieri"}, {"rating": 5.0, "review": "A perfect setup-box for my TV and mobile devices. It's easy to handle and works very good. I would absolutely recommend.", "verified": true, "helpfulness": "0/0", "author": "S. Bauer"}, {"rating": 5.0, "review": "Love it. Just as described and shipped fast! Brand new came in full packaging. Works perfect for streaming movies and music.", "verified": true, "helpfulness": "0/0", "author": "wayne sorensen"}, {"rating": 5.0, "review": "works great with all apple device, fast, clear picture and great soundi use on my iphone  and ipad a lot", "verified": true, "helpfulness": "0/0", "author": "yarink"}, {"rating": 1.0, "review": "Honestly Apple TV sucks. I don't have cable. I bought Apple TV 2 years ago and I could mirror all sorts of apps with shows on my phone to it (Disney jr. Abc, etc). However now you either need a cable account to sign in and watch on Apple TV apps or from your phone you get a message saying that mirroring is not supported. Amazon is not supported so I watch amazon prime thigs through our xbox. I'd much rather have a roku I think. Apple has ruined this product. If I jae cable why do I need it when I could have DVR and streaming through the cable company.", "verified": false, "helpfulness": "5/10", "author": "Amazon Customer"}, {"rating": 2.0, "review": "im not complaining about its ability to do what it says it can do, just the fact that its a tool to rip you off further... there are other options out there", "verified": true, "helpfulness": "1/2", "author": "2centsreviewer"}, {"rating": 5.0, "review": "We use the Apple TV daily for Netflix, HBO to Go, screen sharing, pod cast or just listening to the thousands of internet radio stations available.", "verified": true, "helpfulness": "0/0", "author": "C. Butler"}, {"rating": 5.0, "review": "I am finally watching some programs and seeing movies that I have been wanting to see! Watched a whole season of House of Cards on one rainy day!", "verified": true, "helpfulness": "0/0", "author": "Deborah Mckechnie"}, {"rating": 1.0, "review": "I have Mac desktop.  I don't have cable tv or streaming subscriptions.  [Note this product does not stream Amazon videos.]  I called Apple & asked about streaming from my computer to my Samsung tv through this product.  I was assured it did, even touted I could stream wirelessly from 1 room to another.  I bought it from Amazon based solely on Apple's assurances.  It did not work.  My friend who did the set-up called Apple during the 90-day free tech period.  He was told that my Mac (which the initial saleswoman I talked to knew about) did not have the capacity to stream wirelessly; that function was added to the Macs that were manufactured only a few months after mine.  That tech suggested AirParrot.  I subscribed to AirParrot.  It still does not work.  Wasted money on a product & a service I cannot use.", "verified": true, "helpfulness": "5/10", "author": "Janet M Fendrych"}]