[{"rating": 5.0, "review": "Honestly, there is not much I can say about this product that doesnt speak for itself. Living overseas I do not have access to the shows I like to watch back in the United States. This has given me a legal way of watching the shows I like to watch as well as watching movies and listening to music and then it airplays my MBP and my iDevices as well. Great buy overall.", "verified": true, "helpfulness": "0/0", "author": "dust"}, {"rating": 5.0, "review": "I had tried Roku about a year ago but it screwed up my tv and dvr so I was very reluctant to try this but everyone I knew who had it insisted that it was the best.  I bought it, plugged in one plug and it was done!  SO EASY TO SET UP! And it works perfectly with my TV and my DVR (Time Warner Cable).  I LOVE IT!  I only wish that I had got this years ago!", "verified": true, "helpfulness": "0/0", "author": "J. C. Goldenberg \"BookWhisperer\""}, {"rating": 4.0, "review": "I don't usually give 5 stars to anything, and I would give this a 4.5 if that was an option.  It was a little confusing to figure out the mirroring of my Ipad as it wasn't discussed in the set up manual at all.  Once you make sure the settings are appropriate on the apple tv -AirPlay(that part was easy).  Go to your Ipad, double click on the home button to where all your open apps show up on the bar at the bottom.  Drag to the right (which takes you to the screen to the left) where the music setting are and there is a button that has a square with a triangle in the middle of it, you have to activate the mirroring on your ipad to connect with the airplay on the apple tv. Here are the instructions from Apple.  [...]My only other beef is that my computer with Itunes must be up and running in order for the apple tv to stream my movies personal movies (not movies that I have purchased from ITunes) even though they have been moved into my itunes on the computer.  So, when I am away with the computer, no one can watch our personal movies on apple tv.  The primary reason I bought Apple TV as opposed to some other player was that I could wirelessly view the screen of my Ipad on the TV.", "verified": true, "helpfulness": "2/2", "author": "dallas bolen"}, {"rating": 5.0, "review": "Worked real goos.  Make a Apple products work on TV.  You can have whatever is on device on tne TV or just the videos.", "verified": true, "helpfulness": "0/0", "author": "Thinker623"}, {"rating": 5.0, "review": "Here is what to know before ordering this:The video out is HDMI (which also carries audio if going to the same device), the digital audio out is Optical (no Coax).  So if you are like me and running short on HDMI spaces on your TV, keep this in mind.Otherwise, an amazing device that has forever changed watching movies.  It will play any movie in your iTunes library as well as allowing re-broadcast of any video being shown on your iDevice on the same home share (think YouTube / Internet Videos).I also really like the Netflix interface with this device as I spend a lot of time watching Netflix with my son.", "verified": true, "helpfulness": "1/2", "author": "J. Davis"}, {"rating": 5.0, "review": "Absolutely amazing product!Well made and truly connects your Mac computers to your TV. If you are a Mac person, the Apple TV is a must have product!", "verified": true, "helpfulness": "3/4", "author": "David Hermansen \"Dave Hermansen\""}, {"rating": 3.0, "review": "Not sure what the point of this machine is for. If your stuck in apples world the it's probably worth it but until they allow apps up I would say pass", "verified": true, "helpfulness": "0/1", "author": "NickWizz"}, {"rating": 5.0, "review": "Ordered with Apple TV and both items were shipped together--arrived on time and packaged well--good value and deal for both items--", "verified": true, "helpfulness": "0/1", "author": "Kristine Kowalski"}, {"rating": 4.0, "review": "Hulu has been added which is very nice.  This thing works great with my iPad and iPhone as well.  I am extremely happy with it.  For 99 bucks it is a great deal.", "verified": true, "helpfulness": "1/1", "author": "E. Butler"}, {"rating": 5.0, "review": "It does the job with a minimum of fuss - providing access to on-line content and displaying a beautiful picture on the TV.  Recommended", "verified": true, "helpfulness": "0/0", "author": "Bill"}]