[{"rating": 2.0, "review": "The device works fine and it is very usefull to access content on your iPhone, YouTube and etc. However, the most disapointing aspect is that you will not be able to watch other kind of content from your computer, like downloaded videos, dvd's and more. It could be better.", "verified": true, "helpfulness": "0/3", "author": "DamienJoe"}, {"rating": 3.0, "review": "nice solution for tv internet like youtube and flicker but the bad attitude of apple its locked and still lockedi want to share movies from external hard like nas, its ok for music but for movies it's still face troubleswhile there's Roku and many other devices and it works normal and openso if u want to buy this device buy it after xbmc released :)", "verified": false, "helpfulness": "0/1", "author": "Amr Talaat"}, {"rating": 4.0, "review": "So this is really cool if you have a mac and/or iPhone. Setup was a dream and operation is simple. Just wish the streamign providers offered a better selection of newly released videos1 iTUNES is pricey", "verified": true, "helpfulness": "0/0", "author": "Lisa Sexauer"}, {"rating": 2.0, "review": "The airplay function which will mirror your iPad, iPod Touch and iPhone is temperamental, sometimes difficult to access requiring rebooting of either Apple TV or the device itself to make a connection. When connected it frequently loses the connection and requires a few steps to reconnect. This can be tiresome when trying to watch a video. As far as Photostream goes, that is an absolute disaster and apparently inherent in the software. You will find on many forums discussing this that a good portion or the majority of photos which have been made available from your various devices such as your computer, iPad or iPhones in the Photostream will not appear on your AppleTV stream. This is an ongoing software glitch which Apple has failed to rectify for months. These two aspects of the device are very disappointing because they are two of the better features that a lot of people would enjoy using. That's why they were built into it in the first place yet they either don't function or only function marginally.", "verified": false, "helpfulness": "0/1", "author": "Darla"}, {"rating": 5.0, "review": "This is a very easy device to install and use.  I thought it would be a challenge, however that was not the case.  Apple products are amazing!!!", "verified": true, "helpfulness": "0/0", "author": "Cesar Ramos"}, {"rating": 5.0, "review": "This product ties all of my Apple products together nicely. It's so easy to just put a pictures or videos off of your phone right up on the TV or to stream music off Pandora for a party without having to plug your receiver into the headphone jack. The part I use it for the most is watching movies stored on my Mac Mini downstairs. For $10 the program iFlicks will take video files and convert them so they will play in iTunes. It also adds them to the proper playlist and includes a picture and synopsis just as if you had bought it from iTunes making the Apple TV a great investment. Free shipping and no tax on Amazon seals the deal!", "verified": true, "helpfulness": "0/0", "author": "Glenn"}, {"rating": 4.0, "review": "So far so good.  Would like it to be a bit more open to other services though.  Like the idea behind Roku, but feel like I'm being forced into the apple family.", "verified": true, "helpfulness": "0/1", "author": "Yahoutee"}, {"rating": 4.0, "review": "I have a MacBook Pro and Iphone, so i bought this product inorder to make them sync easily and efficiently ...1) don't expect a lot of choices interms of content.  2) it's a kinda slow when i play online videos on my laptop and use airplay to display it on TV ..it's not the internet cause it plays well on my laptop but it hangs over now and then on the TV & sometimes loses connection ... except that it's good to have.", "verified": true, "helpfulness": "0/0", "author": "AM"}, {"rating": 4.0, "review": "While it fills the needs I had as far as streaming from my iTunes library, renting and Netflix go it still needs some serious software improvements.  Having to have every computer you plan to share from being in the same home sharing network seems excessively confusing.  Also having both movies and music from shares computers be under the computers menu instead of the respective music or movie category on the home screen seems dumb.  Also the home screen needs work so it is more like iOS and less its own amalgamation.", "verified": true, "helpfulness": "1/1", "author": "Dan"}, {"rating": 5.0, "review": "Using this device with an iPod/iPhone/iPad makes it better. I love Apple products in general it's good if you have a net flicks account or Hulu plus.  Mirroring is another feature that I use very often.", "verified": false, "helpfulness": "0/0", "author": "Jarrad Linden"}]