[{"rating": 3.0, "review": "Works well with iPad and iPhone.Can stream YouTube, Vimeo and good podcasts such as TED.Unfortunately it is  very restricted in terms of customization of contents thus dependent on Apple on what can be streamed to the device.", "verified": true, "helpfulness": "0/1", "author": "fsma"}, {"rating": 5.0, "review": "For a hundred bucks this item is great.  It seamlessly integrates with other Apple products, including the Cloud.  The new Apple TV is a brilliant device and a no brainer purchase.", "verified": true, "helpfulness": "0/0", "author": "Carl Twain \"CT\""}, {"rating": 4.0, "review": "Works just as advertised.  I got it primarily to stream Netflix and watch youtube clips on my TV.  This device does a fantastic job.The only con I have about the device is the \"apple sharing\" feature whereby you can link your iphone/ipad to the apple tv to playback videos/pics you have taken.  While the pictures look fantastic and load quickly, the videos on the other hand take forever to load.I heard to mitigate this problemm, once should be connected to the interned over a wired connection as a oppose to wi-fi.  This really is not a option for me, so I guess I will have to live with this issue.", "verified": true, "helpfulness": "0/0", "author": "m3lo"}, {"rating": 1.0, "review": "I recently purchase an Apple TV, and I must say I am horribly disappointed by the experience.  This product absolutely does not live up to Apple standards.This feedback has been prompted by an increasingly frustrating series of experiences with my Apple TV.First, I was quite surprised to learn that I can not rent a movie on my computer and then stream it to my Apple TV.  I must rent it on my Apple TV or on my Mac.  This is just silly...I can stream a movie that I own from my computer to my Apple TV (a movie which is physically sitting on my computer and then streamed to my Apple TV) - BUT I can not stream a rented movie from my computer to my Apple TV (a movie that is, incidentally, ALSO physically sitting on my computer).  But I was willing to overlook this flaw...Next I was disappointed in what seems to me to be a rather clumsy interface.  It looks great, but I just found that several menu options were not in intuitive locations.  I was also willing to overlook this though.Next...I was disappointed in the performance of the iTunes photo streaming...I could not get the Apple TV to stream my entire library, apparently due to the size, yet I found no readily available guidance on how many photos I can expect the Apple TV to stream reliably.  It works as long as I select a limited number of events from my photo library.  Ok, a minor annoyance, but again I was willing to overlook this.But this next issue was the straw that broke the camel's back...I had several friends over to watch War Horse on Friday night (which I had to re-rent on the Apple TV once I discovered that I could not rent on my mac and subsequently transfer or stream it to the Apple TV).  I click play, excited to watch my first rental on the Apple TV.  I'm surprised to see it will take 1 hour and 40 minutes before we can watch the movie.  Dismissing it as an inaccurate estimate of the remaining time, I am hopeful after the estimated time fairly quickly drops to 36 minutes...still disappointing, but acceptable.So we switch my TV input to DVD and watch a short home video for about 25 minutes (while the Apple TV keeps downloading).  When we switch back to the Apple TV, it STILL says it will take 36 minutes, and then it jumps up to 51 minutes.  At this point, I unplug the Apple TV, switch to the free Amazon App that is in my Panasonic TV, and within 5 minutes we are watching the movie.  You can't blame it on network issues, since Amazon was able to stream it without a problem in less than 5 minutes under the same network conditions.This experience renders the Apple TV almost completely useless.  It is now reduced to a nice screen saver that shows SOME of my pictures, and a way to share my iPad screen without connecting a wire.  I'll be returning it, since $100 is too much to pay in my book for a snazzy screen saver and to save a cable connection.I hope Apple rectifies these issues at some point in the near future.  I really wanted to like this product.", "verified": true, "helpfulness": "90/144", "author": "D. Manly"}, {"rating": 1.0, "review": "Loved apple products since Apple II, this doesn't belong to such a distinguished family. Even I have a  fast connection it took hours to download, and you never get a warning that if you press menu it will start downloading all over again, it simply freezes and you are done. I cannot understand why you cant have in memory the movie you are renting for the time allowed. Forget if you want to see something comfortable during the weekend. Too much trouble.", "verified": false, "helpfulness": "10/26", "author": "Gerafrei"}, {"rating": 5.0, "review": "Excelente producto, lo recibí a tiempo y sin ningún problema. Funciona muy bien, lo compré con los cables HDMI y óptico para audio.", "verified": true, "helpfulness": "2/4", "author": "Alvaro Olmos"}, {"rating": 1.0, "review": "I own a iPhone,my wife owns an iPhone, we have a Mac, an iPad and until recently an apple tv. The trouble with it is it simply doesn't register with the afore mentioned line up. It's as if it was designed by another company and sold by apple. The thing is clunky, looses connection, and if you wish too mirror, you'll wish you hadn't. Games lag, web pages lag, and the channel inventory is second to all. The only saving grace was apples WONDERFUL customer service. They promptly apologized and refunded me. I am now the proud owner of a WD TV live hub and though it suffers a slew of hiccups it does what the apple tv does and so much more. Too bad apple. Oh well, even Ty Cobb struck out every now and then.", "verified": false, "helpfulness": "7/24", "author": "Slash6airhead \"Slash6airhead\""}, {"rating": 5.0, "review": "Apple TV is a Great Product, Just next leap in the technology loved the AIRPlay Feature convert my iphone into the Great, you can just watch all your video and Photo on your TV, if you have a IPHONE/IPAD you can convert your HDTV into a Smart TV by just paying 99$ , Sound Quality is Great, Video Quailty Awesome..watching movie on netflix and Youtube is more fun nowThanks Apple", "verified": true, "helpfulness": "1/3", "author": "Hari"}, {"rating": 1.0, "review": "You say you game, watch Netflix, and surf the web all at the same time? Your connection still won't be fast enough to load a movie in less than an hour. AirPlay is extremely finicky, sometimes works and a lot of the time doesn't. Not sure why. Everything on this works differently as well. I can listen to music from my library in the background while wading through other menus,  but not podcasts. For podcasts you must not dare press a button or playback stops. Umm, okay... Go with a device that supports Amazon Instant so that you're actually able to start a movie in less than the movie's playing time. This is an embarrassing device not worth your time or the premium you're paying for it.", "verified": false, "helpfulness": "7/23", "author": "alan"}, {"rating": 5.0, "review": "The Apple TV was very easy to install and use.  I am very impressed with it.  We use Apple videos, Netflix, and view Apple pictures and videos.  We especially like the ability to display iPad screen and music on the big screen HD-TV and sound system.  Our iPhone 4s also work well with the Apple TV.  Great product!  I programmed the Harmony remote to control the Apple TV with the HD-TV, receiver and speakers system.  Wow!", "verified": true, "helpfulness": "0/1", "author": "David Wheat"}]