[{"rating": 5.0, "review": "Great Product. Easy set up. Good interface to the computer and to other Apple products. I would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Another must have Apple gadget for any Apple geek, especially with your iPad or iPhone linked to it via the cloud (e.g. Playing your iTunes playlist through your tv via the Apple TV, via the iPhone by way of the cloud...)Throw in a ton of Sat radio stations, Netflix, iTunes and a host of other features and it's an easy buy at $100 or less.", "verified": true, "helpfulness": "0/0", "author": "MJH"}, {"rating": 4.0, "review": "I first bought a Roku 2 XS from Costco then returned it for the Apple TV. The reason that I needed a device like this was to stream Hulu, Netflix, and Amazon Prime for my wife and kids. We got rid of cable TV and decided to stick with over the air broadcast HD tv and internet streaming to save money. Here's why I decided to stick with the Apple TV.1. WiFi strength - My router is upstairs and my TV is downstairs.Roku 2 XS - it took about 4 or 5 attempts for the Roku to get setup under my wifi. First of all it could not see my 5ghz signal and for some reason it would go through the setup on my 2.4ghz signal, but end in an error. Finally, on the 4th or 5th attempt it went through.Apple TV - The setup was a breeze. It saw both my signals and the setup went through after the first attempt.2. Interface - I needed a VERY USER FRIENDLY INTERFACE. My wife is NOT tech savvy, but I consider myself above average when it comes to electronics.Roku 2 XS - The Roku's interface wasn't bad, but I didn't like how all of the channels were laid out in a single horizontal layout. You have to scroll sideways to view the channels. If you have a lot of channels installed, then it's a little troublesome to scroll to the end to go to the channel you want. You can list the channels in different order, but I like being able to view all the channels in a single screen. Once you click on a channel, the interface gets even worse for me. Netflix is a good example. The netflix interface is set up so that you see the suggestions for all of different genres of movies and shows on the main page. You have to scroll through a number of menus, which are hard to find, at first, to go to the recently viewed, instant queue, complete list of genres, search, and other sub menus. I wasn't as frustrated with it, but it took my wife so long to figure out some of the BASIC menus on the Roku box that she just ended up watching some shows on her 13\" laptop, instead. Happy wife, Happy life...Roku so far was not helping me.Apple TV - The channels are listed on one page with many more channels easily viewable at the same time on the TV screen. The interface just looked cleaner upon first glance. For some reason, it also seemed to scroll a lot smoother as I was scrolling through the channels. The Netflix channel was a LOT simpler to scroll through, as well. Once you click on the netflix channel, all of the different sub menus are listed on the right hand side of the interface. You can easily go to your instant queue, search screen, genre list, new arrivals, etc, without having to figure out where those menus are. My wife was able to find the kids shows, instantly. This made her happy.3. Channels - I was looking for a box for Netflix, Hulu, Movie purchases and rentals, and Amazon Prime.Roku 2 XS - Roku had all of them. I was pretty happy about that. The box that I bought from Costco also came with Angry Birds. That was a nice feature, although I only played it once and never had a desire to play it again. The Roku also had some other channels that the Apple TV does not have, like VUDU, Crackle, etc. I think the Roku is far superior to the Apple TV when it comes to the channel lineup. The main way to purchase/rent movies on the Roku is through Amazon. I like this because I actually like purchasing through Amazon rather than Apple. It seems like Amazon's prices are, generally, lower.Apple TV - Does not have Amazon Prime, and probably never will, but it does have Hulu and Netflix. I can't imagine that Apple would allow Amazon Prime to be a part of their Apple TV channel line up. Too bad. This was one of the things that really deterred me from buying it, initially. You can purchase/rent movies through Apple. I do believe Apple's prices tend to be higher, but I don't really purchase/rent movies for streaming, so it didn't matter to me that much.4. Streaming Quality - This was the real game changer for me.Roku 2 XS - I read that the quality of streaming on the Roku box was great. I'm sure the quality is great for those that have good wifi strenght or have the box connected via an Ethernet cable. I didn't have the luxury of having the box connected through a cable, because my router is too far for a physical connection. As soon as I started streaming a movie through netflix I was getting less than stellar quality. It also took about 20-30 seconds for every movie/show to get started. I figured it needed some buffering time. The movies were not coming through at HD quality and I was getting frustrated that I couldn't get the box to receive any movie at HD quality. Finally, I got one movie to start at HD quality, but in a few minutes it reverted back to a lower quality video. I'm sure this had to do with the wifi signal, but this was the main reason that I returned the box back to Costco.Apple TV - I thought that getting the Apple TV would not solve my issue with the bad wifi signal to the Roku box, so I was a little scared that I would have the same problem with the Apple TV. Once I started a movie on Netflix I saw a rotating, circular animation on the screen and I thought, \"GREAT, It's going to take forever to start.\" Wouldn't you know it, after about 5 seconds the movie started and it was perfect. The quality of the video was HD. I thought maybe it was because I was using my 5ghz signal, so I changed the wifi setting to my 2.4ghz signal and the video quality was perfect, again. I'm not sure why the Roku box didn't catch the wifi signal as well as the Apple TV, but I've not had problem, yet, with the Apple TV not being able catch a strong signal from my router.5. Playing local media through a computer/iPhone/iPad via box -Roku 2 XS - I can't really comment on this for the Roku box, because I didn't really try it. However, I do know that you can download software to your computer to stream movies from you computer to the Roku.Apple TV - I connected my iTunes to the Apple TV via homesharing, and voila it was done. The movie came out very nice. I did not consider Airplay as a reason to buy the Apple TV, but after I tried i fell in love with it. Airplay is NOT GOOD for watching movie through screen mirroring. The quality isn't that great, but it's not too bad watching it through homesharing via iTunes. I have all of my kids' DVD's ripped and in iTunes and it's a great way to view through the Apple TV on the TV screen. We also take a lot of pictures and video on our iPhones and we have been using Airplay to show the kids the videos that we take of them through the Apple TV. They love it and think it's great that they can view the videos on a big screen. There is one thing that took me a long time to figure out, though. When you try to view a video recorded through an iPhone via Airplay it will take FOREVER for the video to buffer. For 1 minute video it took about ten minutes to buffer. I figured out that you have to use \"Airplay Mirroring\" then view the video through the mirror mode and not through direct Airplay. I hope that makes sense. If you go through this route the video plays instantly without any buffering.Full Disclosure: I am what people might consider an Apple \"Fanboy\", BUT I first bought the Roku box, because I thought having more available channels and a cheaper price through Costco would be worth it. However, the Apple TV won out in the end because it was easier to use, the interface was better, and the quality of the videos were better through the way that I had it set up.If I had the ability to set up the box through a wired ethernet connection, then the results might have been different and I might have stuck with the Roku 2 XS. Despite a slightly higher price and not being able to access Amazon Prime, I'm happy with the Apple TV.", "verified": false, "helpfulness": "96/106", "author": "John"}, {"rating": 5.0, "review": "I have tried a lot of methods of streaming movies from my computer to my tv, NOTHING works better than this. I just use my iPad, iPhone or macbook and its SO simple.", "verified": true, "helpfulness": "0/0", "author": "Heta Shah"}, {"rating": 5.0, "review": "Great product. Easy setup and integration with my home network and other Apple devices that have iTunes. Definitely recommend for anyone who has a networked home theater system. Could use more Apps, but I use this device mostly for accessing and streaming the music/movies/tv shows/pics from multiple devices (Desktop, laptop, iPod Touch, iPad)", "verified": true, "helpfulness": "0/0", "author": "Neal"}, {"rating": 4.0, "review": "Apple TV is sleek and and very easy to set up. However, the channels are limited and currently (11-26-2012) it does not have Amazon installed. Although the Netflix option is nice, Amazon offers more recent TV show episodes and unfortunately is not included in this version of Apple TV. I actually just ordered the Roku device because of this issue.Overall, Apple TV is a nice product with a few good features but is limited in content compared to Roku.", "verified": true, "helpfulness": "1/1", "author": "Shiloh Kremer"}, {"rating": 5.0, "review": "I upgraded from the 2nd-generation version. That version is still very popular because it can easily be jailbroken, so I was actually able to make money on the deal while getting the latest version. The only issue I had with the device was that initially I was not able to stream audio from iTunes. It would play one song, then quit. As it turned out, the problem was with my Symantec AntiVirus software. I had to tweak the software to allow iTunes to communicate out. I primarily use the Apple TV to stream music and to watch Netflix. The video quality with the Apple TV is superior to the quality of Netflix streamed through the Sony PS3 or a stand-alone Blu-Ray player with Netflix capability.", "verified": true, "helpfulness": "0/0", "author": "Gregory J. Orme"}, {"rating": 5.0, "review": "I purchased AppleTV because I have come to appreciate almost all things apple.We have two iPhone4's and iPads, so it was only logical to cross into AppleTV country.I am totally pleased with my apple world and all my apple products.....BUT right now,I am astounded at the beauty and simplicity AppleTV brings into the house with all my media streaming tommy big flat screen TV, WHEN I want it to do so.Pairing it with an HDMI Projector makes Home Cinema instant fun.", "verified": true, "helpfulness": "0/0", "author": "Dale B"}, {"rating": 5.0, "review": "I use this teaching. I load a Keynote document onto my iPad and then display it through the Apple TV. The ability to walk around the room and not only advance slides by touch the iPad to display a \"laser pointer\" type image that is *much* easier to follow than any real laser pointer.", "verified": true, "helpfulness": "0/0", "author": "Jon B. Olsen \"prof berndt\""}, {"rating": 5.0, "review": "Although we do not use this capability a lot. It works very well through the Apple N Router and a Samsung TV. It offers more options than TIVO for movies, etc. Of course it is not a DVR. If you want access to Netflix, You Tube, etc., this is a good product.", "verified": true, "helpfulness": "0/0", "author": "P. L. MURPHY"}]