[{"rating": 5.0, "review": "Thank you!!!", "verified": true, "helpfulness": "0/0", "author": "Nick Leavitt"}, {"rating": 5.0, "review": "Apple TV is super easy to set up and use. I even move it from room to room every once in awhile, because it is no hassle to reconnect. The minimalist remote design is a plus for me.", "verified": true, "helpfulness": "1/1", "author": "stpilar"}, {"rating": 5.0, "review": "I love my Apple TV.I mainly use it for Netflix, listening to my music library, youtube and sometimes watching iTunes videos.Apple has the best netflix interface out of all the other such devices.  It is very easy to browse and actually discover other movies that are like the one you are currently looking at.Would highly recommend for people who watch a lot of Netflix, but also as a general media hub for people mainly using the Apple ecosystem.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Babeshkin"}, {"rating": 3.0, "review": "I works as advertised but doesn't seem to really do all that much, let's you spend money on various services etc. It does let you see your I pad screen on your HD TV but after looking at photos on an 3 megapixel 9.7 inch I pad air, they don't look so good on a 2 mega pixel 47 inch HD TV  DONT KNOW IF I WOULD BUY IT AGAIN OR NOT .?????", "verified": true, "helpfulness": "0/0", "author": "William V. Gale"}, {"rating": 5.0, "review": "It was an additional tv for me for my media room.  Great product- it works seamlessly with other Apple products.", "verified": true, "helpfulness": "0/0", "author": "Ramesh K. Kapoor"}, {"rating": 5.0, "review": "When I got this product I was planning on binge watching shows on Netflix, maybe watching a you tube video here and there, but that was about it. Then I found out that HBO Go was available for the Apple TV. That was amazing for me because I love many HBO shows, and all seasons of every HBO show that they have made are available on HBO Go. Unlike the Comcast On Demand service, you can access any episode of any show any time. The interface is easy to use and intuitive. I even used the iTunes app on the home screen to rent a movie. Everything was easy and fun to use. I think in the future, this product will just get better as more apps and services get included with the product.", "verified": true, "helpfulness": "0/0", "author": "Josh Rastatter"}, {"rating": 2.0, "review": "There are alternatives I have tried including Chromecast and Roku. both offer similar services for more than half the cost of the apple TV.We purchased the Apple TV to sync with my wifes Apple products and that works ok, but I cannot justify the cost for the limited uses.", "verified": true, "helpfulness": "0/0", "author": "Fidofour"}, {"rating": 5.0, "review": "I think the Apple TV is a fabulous product.  I have one on every TV in my house.  So easy for watching HBO Go, or streaming content you've purchased.  But another great feature is the mirror option.  If you have an iPhone, iPad or Apple laptop computer, at the touch of one icon you can stream the content from the device to your Apple TV.  Want to show some pictures to your friends, just press an icon and mirror your phone to your Apple TV and see them on the big screen.There are so many things you can do with your Apple TV, and Apple seem hell bent on adding more and more features.  Just this week they are streaming a concert live from Austin, free for Apple TV owners.  In the fall they get 30 artists to film an exclusive concert, and show these concerts for free.Various TV channels are getting involved too, so you can stream a surprising amount of free content without having to subscribe to a ton of stuff.As with all Apple products, it isn't the cheapest choice, but it is one of the best.", "verified": true, "helpfulness": "0/0", "author": "Chris Healey"}, {"rating": 5.0, "review": "Well worth the cost if you have a subscription to Netflix or Hulu plus.  Also works with Amazon Prime videos", "verified": true, "helpfulness": "0/0", "author": "Robert S. Mason \"Bob Mason\""}, {"rating": 5.0, "review": "I have been an apple tv user for a while and have gone through several updates. I have the standard version and the HD version. HD is the way to go! I look forward to when more and more channels become available.", "verified": true, "helpfulness": "0/0", "author": "van grant"}]