[{"rating": 5.0, "review": "I now have all three generations of the AppleTV and must say I really DO LOVE them.  We are an Apple family so we're pretty intertwined in the whole iTunes system.  Movies, music and such.  We have iTunes Match which works AWESOME with the ATV.  It allows you to watch all your movies and listen to all your music from the cloud.  IMO, it doesn't get any easier than that.  We don't buy DVD or Bluerays, because we can grab it on iTunes and play it on our iPhones, iPads, Mac, or AppleTV's.  Have you mirrored your iPad II or iPhone 4 and up to your ATV yet?  It's nice to be able to surf the net on your TV and show the other people in the room the same stuff.We're hooked...  Have been since 2004 when I got my first iPod.The AppleTV is NOTHING without the app to control it.  If you're using the remote it comes with, buy a used iPod touch at least so you can download the app and run it the RIGHT way.  Well worth it.Signed,Apple FanFamily.", "verified": true, "helpfulness": "1/1", "author": "Amazonaholics"}, {"rating": 4.0, "review": "Great product. We use it for everything: movies, music, radio, podcasts, family picture screensaver. The only problem is for audiophiles; if you have your CDs ripped at 16bit/44.1KHz, the AppleTV 2nd and 3rd generation will up-convert your music to 48KHz, whereas the first generation Apple TV would keep the 44.1KHz rate.This problem will not bother most users in the least, but it's worth mentioning if you are an audiophile and are thinking of streaming your lossless files to the Apple TV.", "verified": false, "helpfulness": "1/1", "author": "Macauley86"}, {"rating": 3.0, "review": "A very well designed product with user friendly menus. Not so great unless you are a fan of i-Tunes and paying for virtually everything.I hoped to be able to view my local (WGN) news feed (free to air with an antenna) but alas it does not seem possible - maybe I'm doing something wrong. Radio stations are plentiful and in the main free, so it's not all bad. Will buy a Roku eventually.", "verified": true, "helpfulness": "1/4", "author": "MChicago"}, {"rating": 3.0, "review": "In general I have had a love hate relationship with Apple and my Apple TV. When it works, man it works great. When you interact with iTunes Netflix- the things the Apple has a good partnership with, it's fantastic. When I want to airplay hulu...I'm not having so much fun. When I want to use my iPad to airplay content available on my PC that I own...I'm not having so much fun.I've downloaded several apps to try to compensate for Apple's lack of integration and plug ins and I cannot get around it. When I use my Xbox 360 for content I have a very good experience, but Apple just only wants to let me use MY content the way THEY want. I do not appreciate that very much. I am done investing my money in Apple and once the market catches up to them (which they will) in phone technology and tablet, a lot of people will see why Microsoft dominated for so many years.", "verified": false, "helpfulness": "2/4", "author": "jdemp87"}, {"rating": 5.0, "review": "I don't have cable, and we watch our stuff on iTunes or NetFlix.  I wanted something for streaming to the TV.  I looked at the Ruku, which has more content and is cheaper, but after playing with a friends Apple TV, I realized how much nicer an experience the Apple TV is.  I have all Apple products, so that may have influenced me... but I like the product.  Small, clean, easy to use... perfect!  It runs NetFlix and iTunes very well... I wish it had Pandora... maybe they'll add that.", "verified": true, "helpfulness": "1/1", "author": "srights"}, {"rating": 5.0, "review": "This is the greatest device I've ever tested for enjoying multimedia , that' s why I'm  suggesting it with all my friends and family", "verified": true, "helpfulness": "0/0", "author": "Imontes-review"}, {"rating": 5.0, "review": "I purchased this for my in laws. They are so happy they have such a small device that does so much. Streaming all my media works amazing on this. I have this hooked up via wifi and have no issues with lag on netflix, youtube, or itunes downloads. I also love that I can use this to throw my iphone screen on the TV.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Lee \"STUDLEE\""}, {"rating": 5.0, "review": "Worth it just for AirPlay feature!Also fun - Trailers, NBA.tv, iTunes streaming of Movies, Music and photos from my Mac.All for free :)", "verified": true, "helpfulness": "0/0", "author": "Omer Ninyo"}, {"rating": 5.0, "review": "I received an Apple TV as a gift.  Installed it on a new flat screen in the bedroom.  Easy menu's to perform a record quick installation!  Works great - and easily connects to my Mac & PC Via iTunes.  I now can make full use of my video library through my Apple TV through AIrplay!  Fun, easy, not technical!  Recommend for everyone!I have even bought one for he living room TV now,as well!THANK YOU APPLE!!!", "verified": false, "helpfulness": "0/0", "author": "H. Brake \"hbrake2\""}, {"rating": 5.0, "review": "Perfect !!Apple products are always the best. I mainly use the airplay watching videos from my ipad on the TV.Setup was easy, no connection problems.Just felt, apple could have made the remote a little better.Must have if you have a lot of apple products already at home.", "verified": true, "helpfulness": "1/2", "author": "Praveen"}]