[{"rating": 5.0, "review": "He enjoys watching his podcasts and the ability to watch current movies at home for very little money.\"perfect in every way\"", "verified": true, "helpfulness": "0/0", "author": "coco"}, {"rating": 5.0, "review": "I don't often write reviews, but I am so pleased with the Apple TV that I am writing this one. First, it was really easy to set up, which is important to me. You do need an HDMI cable, so make sure you have one--and don't buy an expensive cable. Sure, I wish the Apple TV did more, but if you have Netflix, Hulu Plus and iTunes--this is a great way to watch them on your TV. I mostly use it to stream video from my iPad. It works with many other video podcasts and other videos sources (such as Leo LaPorte's shows) on the iPad, but not all. I'm very happy.", "verified": true, "helpfulness": "0/0", "author": "ralph gottlieb"}, {"rating": 1.0, "review": "Apparently, there's an issue with the updates. This has been a long standing issue with Apple but updating this device causes the digital output to not work. Apple is aware, yet they continue to sell this unit. Think I'm lying? Google it!", "verified": true, "helpfulness": "1/5", "author": "Quence"}, {"rating": 4.0, "review": "This is great for watching movies off of iTunes or Netflix, and to be able to mirror what you are doing on your iphone or ipad to your TV through this device is really cool. I just hate that Amazon Instant Video is not available. Even if you watch on iPad or Iphone and mirror that to TV through Apple TV, it is blocked. Roku Box would be better for internet TV as it has many more channels and options.", "verified": true, "helpfulness": "0/0", "author": "Bulleydawg"}, {"rating": 3.0, "review": "The main reason to own one is to watch Netflix. Netflix is just okay, not great. Netflix has mostly older movies and the collection is kind of patchy.", "verified": false, "helpfulness": "0/0", "author": "CHARLES J MILLMAN"}, {"rating": 4.0, "review": "I got this for my girlfriend for Christmas because she has asked for one for years. Once we were able to get the thing hooked up, it was really nifty and worked with all of our Apple gadgets. However, I did not pay close enough attention to the specs when I purchased the box and did not realize it ONLY hooks up to the TV via HDMI cable. At the time, we did not have a TV that had an HDMI input. Soooo, we had to make another $100 investment to get a small HDTV that could work with the Apple TV. I would definitely recommend the product but make certain you have an HDTV if you purchase.", "verified": true, "helpfulness": "0/0", "author": "codered1126"}, {"rating": 3.0, "review": "Got this about a week ago and am a bit disappointed with the content, there isn't that much of it.  Since you can watch Netflix and Hulu on just about anything these days, DO NOT BUY IT FOR THAT.  The best part by far is having your iTunes library available through your TV and the ability to use AirPlay to project your iPhone, iPad, and Mac screen to the TV Screen.You're basically paying $95 to listen to your music through your TV (and I have surround sound so i admit my music sounds amazing when I'm using the treadmill) and project images to your TV wirelessly.  Some say its worth it, some say its not.  All a matter of opinion, I think think its nice to have, but I wouldn't buy it again.  This thing would be awesome to receive as a gift.If you want more content options, like news, HBO GO, sports, things of that nature, go with the Roku HD.  If you want to project images from your apple device to your TV (which is very nice at times) go with this.This product seems like a slam dunk 3-star review to me.", "verified": true, "helpfulness": "2/2", "author": "Patrick Smith"}, {"rating": 5.0, "review": "For the $100 price tag, it seems an easy choice between this and a Roku.The Netflix interface via Apple Tv is also very good (have never used a Roku). You get access to iTunes, Netflix, Hulu MLB, NHL and NBA with the Apple Tv (assuming you subscribed to these).You can also kick anything from an iDevice or Mac to your TV (assuming the hardware meets the version requirements).Your iPhone can also be the remote.", "verified": true, "helpfulness": "0/0", "author": "D. Mahan"}, {"rating": 3.0, "review": "I purchased the Apple TV because the JB was due out in December 2012.  It never came.  Still waiting for the JB to arrive so I can install XBMC onto it.  As a streaming device, it does a decent job running my netflix, but I dislike the multiple screens I have to go to in order to play the next episode of a TV show.  Watch one show, then once it's over, give me the option to watch the next show!  I know this is a limitation of Netflix and not the Apple TV, but comparing it to my xbox360 which also streams netflix, it has some things to improve.I'd also like to note, I don't have an iphone, an ipod touch, nor do I have a lot of shows I've purchased in my itunes, so really until the JB and XBMC are installed, my ATV3 is just a netflix streaming device.", "verified": true, "helpfulness": "0/0", "author": "wakkedup"}, {"rating": 1.0, "review": "Unlike the 1st and 2nd generation AppleTVs, this one is hard-locked by Apple and can't be unlocked.  Run the other way!Buy the Apple TV MC572LL/A instead.", "verified": true, "helpfulness": "1/6", "author": "Amazon Customer"}]