[{"rating": 3.0, "review": "ok, so i have finally figured out how to get this thing working. no thanks to applecare, whom i called and they could not help me at all.basically, i had to retire my airport express (which was actually from about 2003 -- maybe the longest used apple product ever?!) and purchase some extra products to connect this.so now i use the appletv to stream music from my imac and my iphone to my home stereo, and am using a wireless router to get internet, instead of the apple express for both those uses. so its a bit redundant but supposedly has a more steady connection.what i had to buy (from monoprice, i spent about $30, whereas radioshack would have charged like 60) was an optical audio cable (toslink or something) and a digital to rca converter (which has to be plugged into an elec. outlet)so now the optical audio out on the appletv goes through the converter and into the rca jacks in my stereo receiver. now i can get audio when i rent a movie or soemthing from appletv.*****************ORIGINAL REVIEW BELOW***************super bummed by this purchase.so i have an airport express hooked up to my home stereo that i can airplay music from my imac or iphone to.so after reading the box and specs, i purchased the ATV so i could watch video on my tv. i can watch video but i cannot have the audio play thru my airport express-enabled speakers. you can only get audio thru the tv itself.i can stream music thru the ATV thru the airport speakers, but not audio to accompany video.so why do i need this if i can already do this with my imac & airport express.and no, i dont want to listen to the audio thru my tv, i bought the ATV because it said it would work with the airport.oh, and the UI sucks. not intuitive or \"pretty\" at all. what a waste of a product.", "verified": false, "helpfulness": "0/5", "author": "patrick bateman"}, {"rating": 5.0, "review": "Apple TV is just great and will change the way you listen to music and watch TV at home. Basically, now I arrive home and set the music I want from my iPhone wirelessly and listen it through a LG sound system connected to the Apple TV. All hassle free.The same works for watching videos I have in my iPhone or in my computer at home. Just send it via AirPlay and watch on your TV.Additionally, the home screen from the Apple TV let you stream media from your computer or iCloud or Hulu or Netflix or YouTube which is nice if you pay for any of these services.I'm totally happy with this purchase. The 99 bugs are totally worth it.", "verified": true, "helpfulness": "0/0", "author": "Ricky"}, {"rating": 5.0, "review": "I use this handy device to stream movies, music and TV programs, podcasts, etc. I got rid of Satellite as was costing me about the cost of this little device a month! I built an antenna from clothes hangers for local channels and installed it in the attic. This gives me two to three channels for each of the big four networks! You can get Hulu and Netflix and more. Programs I can't get from all these sources I can usually buy from the iTunes store. I bought full seasons for three programs cheaper than what one month of satellite was costing me!Setting it up is a bit of a hassle as you have to use the remote to enter IDs and passwords. Its four-way toggle makes it easy to hit the wrong thing.  But, once set up, you're through!  I have no streaming issues.I also have Ruku which offers access to Amazon, Netflix and other channels, plus a hard disk via USB. Between these two I have access to all the media I can stand.Update:  June 15, 2013Still very pleased with this purchase.  The user interface is much easier to use than the Roku.  Between it and Roku, if I could buy only one, the Apple TV would be my choice.  I've dropped satellite and use cable only for internet. Definitely recommended.", "verified": true, "helpfulness": "0/0", "author": "Maximzodal"}, {"rating": 5.0, "review": "Works great, it is the second one I have in two different locations and they both are a great help.", "verified": true, "helpfulness": "0/0", "author": "alaskajon"}, {"rating": 1.0, "review": "Since I purchase a lot of content outside of Itunes this box is very redundant and loses a lot of functionality. It aggrivates me that Apple always tries to force you to buy everything from them or else you cannot use the content you have purchased. The box is easy to set up and will take you approximately 10 minutes if you have a basic understanding of your network and encryption.Overall I am not impressed. I spend more time looking for the 3 inch remote then I do actually watching programs, and all of the programs I have to buy, only to sit though commercial after commercial. Why do I have to pay for the shows, then I cannot fast forward though commercials? Let me get this straight, I pay for the show, and then Apple gets paid again by forcing me to sit though commercials? Um...no.If you have a gaming system like Playstation or Xbox you do not need this as it has the same content but with limited ability to use. I do not intend to keep paying for programs so that I can watch commericals all day.If you have nothing else than this might be alright for your purposes, however I am sorry that I bought this device.", "verified": true, "helpfulness": "4/12", "author": "TheGadfly \"TheGadfly\""}, {"rating": 5.0, "review": "I love it a LOT! It works great with my netflixs & it was so easy to setup.  I also downloaded the apple remote app for my iphone & it too is incredibly simple to use.", "verified": true, "helpfulness": "0/0", "author": "sha"}, {"rating": 4.0, "review": "poderia ser melhor apenas se pudesse instalar aplicativos da app store.would be better if allowed to install applications app store.", "verified": true, "helpfulness": "0/0", "author": "Felipe Santiago"}, {"rating": 4.0, "review": "The latest Firmware upgrade prevents Hulu from working if you are connected via Ethernet.Apple is working on a fix in the next Firmware upgrade.If you can't get Hulu to work, disconnect your Ethernet cable and run it on wifi.", "verified": true, "helpfulness": "0/0", "author": "WarWagon"}, {"rating": 3.0, "review": "I spent countless hours converting all my music and DVDs to Apple TV and it worked great at the beginning. Now, as many users experienced, every time I turn on the Apple TV it says I didn't enabled home sharing. I have to go back to my computer, turn it off, turn it back on and half of the time it doesn't work. I tried everything recommended by Apple including restoring factory settings but its a mess. Weird it worked so great for the first few months and now, without changing anything, it fails all the time. Very dissapointed.February 2012 update: Bumping to 3 stars as the problem with home sharing has gone away. I still wish the UI was better at discovering movie or music info, managing folders, or rendering closer to the original.", "verified": true, "helpfulness": "3/6", "author": "Chuck G \"chuckg\""}, {"rating": 5.0, "review": "perfect product, air play an amazing feature. Totally loved it and if you have any other apple product at home (ipad, iphone, mac book) then just buy it. Worth every penny!!", "verified": true, "helpfulness": "0/0", "author": "Upendar Garg \"UG\""}]