[{"rating": 5.0, "review": "I had the apple TV2 and sold it for a good price because of the jailbreaking ability and XBMC. I opted for this one in order to watch netflix and for my Air Play apple devices. I have a Mac Mini connected to my 70 Inch LED/LCD and it works perfect with the XBMC FRODO release. I like the 1080P resolution and the clarity. Its an amazing addition to the Gadgets Collections", "verified": true, "helpfulness": "1/2", "author": "settler"}, {"rating": 4.0, "review": "the actual product was a gift for a friend. so I can't tell you how well this one works.But I love mine!", "verified": true, "helpfulness": "0/0", "author": "nat P"}, {"rating": 4.0, "review": "I have a love/hate relationship with my Apple TV. Mainly love. I've had it for six months now, so I have a thorough understanding of the pros and cons.Pros:The best AirPlay streaming device you will find (I initially purchased a receiver with built in AirPlay, but the inconsistency was unbearable)Small and energy efficientSimple set up and updatesNon-intrusive designQuiteCons:Limited functionality (Jailbreak seems unlikely for this model)AirPlay can be inconsistent with music cutting out or not playing at allThis device suffers more from HDMI handshake than any other (not a fault of the device per se, but I can't figure out why this is happening when I've been able to troubleshoot better with the rest of my devices.Bottom line:This is a great purchase at $100 for the AirPlay alone assuming you have other electronic products to get use from this functionality. It can be infuriating when your ATV's AirPlay doesn't work properly, but I have found that shutting it down (put to sleep) or unplugging as a silly, but effective troubleshooting method. I'm not going to comment on Hulu, Netflix, etc. as I have other devices I use for this. I would like to see apps for Amazon Prime and others. More apps in general would be nice (here's hoping for a jailbreak). Also, if your Mac is mid-2011 or older you can't use AirPlay to mirror your screen.", "verified": true, "helpfulness": "0/1", "author": "Trevor Ayers"}, {"rating": 5.0, "review": "Easy to setup.  Works like it supposed to. Netflix works much better on apple tv than on the PS3.  Looks great.", "verified": true, "helpfulness": "0/0", "author": "L. Brozek \"Luke\""}, {"rating": 5.0, "review": "It's awesome. Recommend that everyone gets it. It's an awesome device. Plus with the new upgrade software, they have added more channels. Now I can enjoy all my movies and tv show on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Saul Rodriguez"}, {"rating": 5.0, "review": "Love these things. Able to stream movies from my iMac and Macbook pro. The family can enjoy movies with me.", "verified": true, "helpfulness": "0/0", "author": "W. M. Greene"}, {"rating": 1.0, "review": "I have one in my bedroom works good but the one I brought from Amazon I have in my living room dose not work right", "verified": true, "helpfulness": "0/4", "author": "John Eric Ellis"}, {"rating": 5.0, "review": "I have a Roku and a Logitech device so I guess I'm not surprised that when I got a Mac, I also needed Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Philip Holden"}, {"rating": 1.0, "review": "Netflix constantly acts up won't work on ATV taking Apple 3 years n counting to update hardware smdh. ridiculous", "verified": true, "helpfulness": "1/1", "author": "Reese"}, {"rating": 1.0, "review": "Warning, warning.  Until you here the CEO of Apple Inc, come out and say that they will fully support this product, rather than just create an Apple Version of a more superior product do not waste your money. Hours to download movies or rentals, I checked my connection speeds - A+. I used my iPad, iPhone and laptop.... all downloaded perfectly. I used my Xbox downloaded the same movie in a few minutes. If you plan on streaming or downloading don't use this device. i have never been upset with Apple and this item is trash. 100% inferior to xbox online setup, i'm going to try Roku. Apple rolled this product out, and then abandoned it. I have plenty more to add but i'm too upset and don't want to regret this review later. but if you read reviews and value them please know that this product says Apple, but it doesn't meet those standards i've come to expect, i've been an apple guy for a long long time, i'm not buying another Apple TV till Tim Cook stands on stage and tell us that they have redesigned this product, and addressed every issue. Go check the apple forums right now and see the hundred and hundreds of threads all related to issues with this product. these are people taking time out of their day to warn others. i'm warning you now go else where. wait until Cook re-rolls a new product, or the Xbox One.", "verified": true, "helpfulness": "2/7", "author": "dbishop07"}]