[{"rating": 4.0, "review": "I would have given this product 5 stars if Apple allowed Apps to be installed. Very easy to set up. This is a sleek box that allows me to play movies, slide shows from my MacBook air, iphone, ipad or access my PC iTunes library on my Plasma TV.  I am glad I returned the overpriced Apple HDMI adapter for the Apple TV. Some reviewers complain that Amazon Prime is missing but I can use mirroring on My MacBook Air to watch Amazon Prime. In the bedroom I find myself listening to music on my TV just as much since it is just a click away.", "verified": true, "helpfulness": "0/0", "author": "Paul Joseph"}, {"rating": 5.0, "review": "I love my Apple TV! I always heard my friends talking about it and how much they loved it, so I figured I would check it out. As a college student I choose not to pay for cable but rather use Netflix and Hulu+ accounts for the majority of the shows I watch. Apple TV makes it so easy to have these, along with my HBO Go all in one place! On top of that I have many movies and TV shows from the iTunes store that I watch. All of these accessible on one device is awesome. I also love that I can instantly put whatever I am doing on my iPad, iPhone, or Mac on the TV to share with everyone in just seconds. The setup was super simple and the userface is easy to work. Another pleasing Apple product to get its fair share of good use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased my first one 3 years ago to be able to stream Netflix movies in my living room and to also steam my music.  Then a few months later I got one of those Blu-Ray/DVD/Digital movie packs of \"Bedtime Stories\". So I downloaded the digital copy to my iTunes account and was instantly wowed with the fact I could stream my digital movie collection to my apple TV, in essence, my very own Netfilix.This go me thinking about my second ATV, this one was going into my child's room because I was always finding DVD's laying around in the room that was previously watched but never put back, (Probably due to the fact I had a 400 DVD Changer).  This began my search, no my quest to figure out how to rip my movie collection to digital copies from the DVD so that my child could stream them to the TV in that room.  Eureka, I figured it out and I was off to building my very large digital movie collection and now not having anymore damaged dvd's I can save these in the cases to always come back to them if needed.Now, because my child had there own ATV, I figured...heck I should have my own for my room.  So, I got one for my room to enjoy the contents before bed.  I love these ATV, if I was watching a movie in one room and wanted to continue where I left off in another room, YUP it does that.  I love having the ATV remote app for my phone too, it makes it easier finding the remote with my phone then looking for that tiny silver remote that comes with it, so those are stored away as well for backups.I have since expanded my ATV to 2 other rooms in my house and I have a whole different network for my camper with its own ATV setup to use while on camping trips when its either too cold out or raining.If you are a Apple fan, you will love these small black boxes of joy.  I sure do!!!", "verified": true, "helpfulness": "1/1", "author": "AmazShopCrazy"}, {"rating": 5.0, "review": "The Apple TV works seamlessly with my blu-ray and television. It is great to have all of your iTunes movies at your fingertips", "verified": true, "helpfulness": "0/0", "author": "Zan"}, {"rating": 5.0, "review": "I bought a Google Chromecast for another TV in our home after having two Apple TV boxes elsewhere.  As the price of the Google product was approximately one third that of Apple TV, I wanted to see if there is a significant difference.  Disclaimer: all of my computer/tablet/phone products are Apple and that may bias me as the interfaces for Apple TV and Apple products are seamless.The set up of the Chromecast was simple enough using the app, however I was really disappointed as to how slow the streaming of videos were either through youtube or netflix.  I put the Chromecast on one of the two HDMI ports on my TV and then Apple TV on the other while timing how long an one hour long episode in HD would take to start streaming.  Needless to say, Apple TV was exceptionally faster and appeared clearer without pixelation that was seen on the Chromecast.Bottom line for Apple users: you get what you pay for.  Simple to install with clear GUI and integration with other Apple devices.  I'm not certain if I would be so critical of Chromecast if I had an Android device.", "verified": true, "helpfulness": "1/1", "author": "S. Law \"healer of hemaphrodites\""}, {"rating": 5.0, "review": "Since I don't have a Smart TV, this is the next best thing.  Works great.  Love it.  Love watching all the PBS Masterpiece Theatre shows on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Grandma"}, {"rating": 5.0, "review": "Came as it has been purchased in a retail store. Cables, remote control and instructions came completely. Pretty good conditions.", "verified": true, "helpfulness": "0/0", "author": "Daniela"}, {"rating": 5.0, "review": "Works well, easy to connect, does exactly what its supposed to, looking forward to reducing my cable bil would recommendl!!!!", "verified": true, "helpfulness": "0/0", "author": "Charlie's mom"}, {"rating": 4.0, "review": "Great add-on set if you don't have a smart tv. Fast streaming for netflix and hulu+ along with others.. Only complain is that apps are limited, however, new apps are periodically added. If Apple Tv had Amazon prime it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Emmanuel M."}, {"rating": 5.0, "review": "Great for streaming Netflix! Sleek design! I will be purchasing more for other TV's. A free HDMI cord would be a nice touch (:", "verified": true, "helpfulness": "0/1", "author": "knowledgeable"}]