[{"rating": 5.0, "review": "It is an apple tv-  I have had these for a while and it is pretty much just like all the previous versions.  A little faster, a few more mild software tweaks.  Its good.", "verified": true, "helpfulness": "0/0", "author": "S B"}, {"rating": 5.0, "review": "I just purchased a third Apple TV.  These relatively inexpensive devices work flawlessly and set up easily.  I was surprised that my library contained titles that my kids had put on their iPods years ago.  Digital Copy movies are accessible on all linked Apple ID accounts and devices.  No messy set up like UltraViolet.  No waiting for buggy apps like Flixster.  As usual, the Apple stuff simply works--simply.  I use it to rent movies.  The streaming works wonderfully, even with the TV in my house that is a ways from the WiFi source.  You can also stream mostly anything from your iPhone or iPad to the Apple TV device through AirPlay.  Think---pictures, home movies, YouTube, even presentations through Keynote (Apple's PowerPoint equivalent).  Finally, I trust that Apple will be around to maintain my Digital Copy collection longer than the alternatives.", "verified": false, "helpfulness": "14/16", "author": "Robert M. Speeter \"speet\""}, {"rating": 4.0, "review": "The hardware of the Apple TV is great and easy to set up, the picture is outstanding. However it is very expensive to rent movies & TV shows and the TV shows are not current. Needed to buy antenna for local TV.", "verified": true, "helpfulness": "0/0", "author": "Joan"}, {"rating": 4.0, "review": "I like the fact you can display you iPad screen on the TV, watch movies, video's, etc. but I would like to be able to choose more than one place for the bluetooth to be active.  I would like to use my soundbar while watching a movie or concert(haven't done either) but like my iTunes songs better through the soundbar than the tv.Played with it a lot when I 1st got it and now hardly use it.  I would recommend it, just noy with great passion.", "verified": true, "helpfulness": "0/0", "author": "CrazyCatLady"}, {"rating": 5.0, "review": "the unit works as advertised. I went with the apple tv instead of it's competitors because my peeps have ipads and the inter-connectivity between both apple products would be extremely useful to them, and so far everything works perfectly. They are able to stream directly to the device from their ipads as well as use the remote app for apple tv to control it as well. The little remote is built like a tank but it is very basic and limited, I would have loved to see more options/features available on it. So excellent picture and audio, and easy enough setup so I have no problem recommending the Apple TV MD199LL/A.Be sure to not select the audio help during the initial setup because the automated assistant voice is annoying beyond description and played way too fast so that it provided no help during the whole time it was on. It took a while of searching before I found the option to turn it off.", "verified": true, "helpfulness": "1/2", "author": "Dwhyte Hunter \"rookie1178\""}, {"rating": 4.0, "review": "It's a handy little gadget to have in your entertainment system and Airplay works great on stuff that's not \"only allowed to be played on your mobile device\" which is why it didn't get 5 starts. Most of the interesting stuff that you want to watch using Airplay is blocked from being played over Airplay. It's very annoying. There is a crack you can use if you feel like jailbreaking your iPad. It's also missing the Amazon Video app but you wouldn't be able to watch the videos over Airplay anyway so I guess it doesn't make any difference.", "verified": true, "helpfulness": "0/0", "author": "Roadrunner"}, {"rating": 4.0, "review": "Wish there was a comment about needing an HDMI cable.... Christmas morning was a bust with no cable for it to play with!", "verified": true, "helpfulness": "0/1", "author": "Kdall"}, {"rating": 5.0, "review": "There is not a single thing to not like about this. It has Netflix and Hulu. iTunes sharing couldn't be easier. I'm addicted to mine. If you are thinking about cutting your cable and getting this, don't hesitate one second.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Dezinno"}, {"rating": 1.0, "review": "I am a loyal Apple product guy, but this product does not live up to their usual standards.  Every time I use it, I need to do a full system 'Reset All Settings' in order to get Netflix to work.  Every day I use it requires the following steps:1) Selecting a language2) Selecting the wireless network3) Type WEP password4) Type netflix id5) Type netflix passwordIn addition if you want to use any of the apple related content (itunes, etc) there are some additional steps:6) Type Apple ID7) Typing Apple PasswordIt may not seem like a lot, but it definitely far from user friendly and becomes annoying very quickly.  Previously I had a Vizio Blu Ray player that was unusable.  It was unresponsive to the remote and extremely slow in general.  There would be up to a 1 minute lag between pushing a button and having the DVD player respond.Next step will be to try a Roku, it can't be any worse.", "verified": true, "helpfulness": "4/12", "author": "Troy D. Devine"}, {"rating": 5.0, "review": "Absolutely LOVE Apple TV!  We dropped our cable bill from $200 to $64. After the initial cost of Apple TV, there is no subscription or monthly fees.  If you want to purchase movies or TV shows, that is up to you.  Kind of the same thing as downloading from Amazon.And Netflix Instant is incredible on Apple TV.", "verified": true, "helpfulness": "0/1", "author": "Christine"}]