[{"rating": 3.0, "review": "Menu button no longer works...makes the whole thing useless.I think I would try another product next time. Not recommended.", "verified": true, "helpfulness": "0/0", "author": "Patrick J. Webb"}, {"rating": 5.0, "review": "Who would have guessed that and entire gamut of movies and shows were available to me through Apple TV? True, I did need a technician to install the device but I'm particularly inept with technology.  Now that I've got it down, I have endless hours of good education and entertainment that was not available before this.", "verified": true, "helpfulness": "0/0", "author": "wilma Melville"}, {"rating": 2.0, "review": "Half the time it won't download the movies I've rented.  Lots of other comparable Products do a better job. Only useful for streaming from my Mac.", "verified": false, "helpfulness": "0/1", "author": "Patrick Webb"}, {"rating": 5.0, "review": "Gift... I already have 3. It's obvious what I think of it. Good choices.  Selections Buy one  You won't regret it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I bought this when I signed up for Amazon Prime. I expected it to link well with my iPhone. The included controller is a joke and the whole experience could be worlds better. A big disappointment from Apple. Biggest problem is not having a direct link to the Amazon Prime account as does Netflex and others. I made it work, but wish I had gone with another.", "verified": true, "helpfulness": "0/1", "author": "DHuntr"}, {"rating": 4.0, "review": "I enjoy the AirPlay feature and viewing YouTube videos on my big screen TV. Apple MUST improve the options and Apps it provides on Apple TV if it wants to stay in the game.", "verified": true, "helpfulness": "0/0", "author": "Brad Moore"}, {"rating": 5.0, "review": "This has allowed me to engage more students, using this with an iPad and projector.  The computer, iPad, iPhone become Air Play from any where in the classroom.  I can walk to a student desk and click it is up on the screen for us all to see.  Students want their work on the screen.  GREAT tool for engagement.", "verified": true, "helpfulness": "0/0", "author": "Stephanie N."}, {"rating": 5.0, "review": "I saved so much money with this product, made life easy, I added this and cancelled a lot of channels I did not need, bought one for the spare bedroom too for guests and grandkids.", "verified": true, "helpfulness": "0/0", "author": "K. Martin \"HVAC\""}, {"rating": 3.0, "review": "A little unhappy with this unit right now- it's failed during the last three updates and requires a restore each time to be made usable again. I also want this unit to have Amazon Instant Videos added as a service, but I get that Apple doesn't play well with others and doesn't like to share the profits. So they don't work that way but they typically they make super high quality 'user-dumb' and highly usable equipment. Lastly, Air Play is very appreciated.", "verified": true, "helpfulness": "0/0", "author": "bgr0221"}, {"rating": 5.0, "review": "First world problem: all hell breaks loose when Wi-Fi stops working! So I try to create a reliable set up.Comcast Xfinity Internet Plus 25 Mbps download speed with local HD channels plus HBO Go $79/month.$80 Motorola Surfboard SB6141 (Download Speeds up to 343 Mbps) ($70 SB6121 is slower 172 Mbps)$90 Apple AirPort Express (My only router in a 2 floor 1300 sq ft townhouse) $190 AirPort Extreme (Not needed)$90 Apple TV (Stream Netflix HD and browse Wi-Fi with my iPhone 5 at the same time without any lagging)Speedtest.net I consistently get 18 Ping 28 Mb (I only have the Xfinity 25 Mb package) on my iPhone 5 over Wi-Fi.My parents house have 50 Mb Blast Plus package with the same Motorola SB6141 Modem (Speedtest shows 51 Mb!)", "verified": true, "helpfulness": "0/0", "author": "Giuseppe"}]