[{"rating": 2.0, "review": "My main complaints about the Apple TV focus on the remote and the UI.  Both coupled together are minimalist to the point where I could easily see them being very challenging for someone to use, whether or not they are age 50+.  Given the nature of the device mishaps with the remote are not without cost - rewinding your Netflix stream and watching it rebuffer to YouTube quality c. 2006 is not pleasant.  Perhaps if the UI was a bit more informative it'd make up for the remote's shortcomings, but no.I'll also add that the remote is so damn small it is very easily lost - between sofa cushions, underneath papers and magazines, etc etc.  I was ready to take a power drill to the stupid thing and attach a lanyard, but I bought a Fire TV instead.  It too is not without issue (where the hell is Cloud Player?) but it is far and away more user-friendly.Overall - a competent but not inspired piece of equipment.  It's great for NetFlix when you don't have a \"smart\" TV, and that's pretty much all I have ever used it for.  AirPlay streaming is nice; needing to constantly keep a computer on to use it is not.  I'd much prefer for iTunes to have something like Amazon Cloud Player's \"upload the music you already own\" feature, and stream it over the Internet.", "verified": false, "helpfulness": "2/2", "author": "IFK"}, {"rating": 5.0, "review": "I am a i-Tunes junky.  Instead of having dvds and blu-rays litter the house, I like the digital version of things.  This is my second Apple TV.  It's been a great addition to our tv viewing options.", "verified": true, "helpfulness": "0/0", "author": "Keun-young Anthony Kim"}, {"rating": 5.0, "review": "I have a few apple devices and I bought this to go along with them. The set up was easy and fast. Seamless transition from device to Apple TV . Nice 1080p picture and really cool air play features.", "verified": true, "helpfulness": "0/0", "author": "Jonny84"}, {"rating": 5.0, "review": "It arrived in time and it was easy to install.My 12 years old son installed it and programmed it in 15 minutes", "verified": true, "helpfulness": "0/0", "author": "Fabio Peruzzi \"fabio\""}, {"rating": 5.0, "review": "I got this for my brother, and he and his family love it. They can stream from the Mac to the flatscreen, which is all they wanted to be able to do. But they now also use it for Netflix and other things. I think they're happy with it.", "verified": true, "helpfulness": "0/0", "author": "PenName"}, {"rating": 2.0, "review": "This device is damn near useless. The only thing making it worth a damn for home users is an open source project called plexconnect. I ended up just bringing it to the office for conference room use as an airplay endpoint for wireless mirroring.", "verified": true, "helpfulness": "0/3", "author": "Anonymous"}, {"rating": 4.0, "review": "As an owner of all kinds of streamers including roku 3 and PS4, Apple TV has is really climbing the ranks for me. Of course it's dependent on your wireless connection but everything I've watched so far has worked beautifully and picture is crystal clear. The new remote for the newest 2014 version is a little too small for my tastes but I'm getting used to it as well as the button layouts on it. For me, the real draw of Apple TV was to be able to stream my iTunes content to my hd TV. Again, I've had no issues at all and everything loads relatively fast(depending on connection). Lastly, another big draw is the AIRPLAY function which is pretty cool. This allows you to play whatever is on your iPad or iPhone on your tv through Apple TV. Comes in handy especially with apps that aren't available on the device like amazon instant video. And that's the one drawback of Apple TV, not enough apps available yet. It's got netflix and hbo go(which are the two big ones) but not much more. But something tells me that will change in the future.", "verified": false, "helpfulness": "1/1", "author": "W. Rapanault"}, {"rating": 5.0, "review": "Very pleased easy to use. I also have a Roku. But this is a better product. I would recommend to anybody.", "verified": true, "helpfulness": "1/1", "author": "Dennis Mitzel"}, {"rating": 4.0, "review": "The device is slick and the interface is cool. The only drawback for me is navigating using the remote, and limited apps.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 2.0, "review": "You get limited content from Apple.  You won't find Amazon Prime movies on this device.  I think this device was Apple's biggest failing into the TV market.  I would recommend Roku or anything else...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]