[{"rating": 5.0, "review": "This is an awesome product. Apple tv syncs with all my apple products (iphone/ipad) You can sit there and watch everything and anything and also mirror your iproducts from your phone straight to the tv... coolest thing ever. If your an Apple fan, this is something that is definitely worth the money. HIT THAT UP!!!", "verified": true, "helpfulness": "0/0", "author": "Moose"}, {"rating": 5.0, "review": "UPDATE: based on the following comment from Diane O., I have upgraded to 5 stars:Dianne O. says:Apple TV now supports Amazon Instant Video : http://www.makeuseof.com/tag/amazon-instant-video-app-now-supports-airplay-and-apple-tv/Bought this when I was first finding out about streaming video. Had already started streaming through our Wii and thought it was great and a friend recommended Apple TV. The graphics and video interface is really nice, and I like the slim metal remote (though it is EASILY lost in the couch cushions), however had I known then what I know now, I would have skipped Apple and went right for Roku, simply because Apple does not have an interface for Amazon Prime Video.  Later on bought a Roku 2 for $58 and love it, supports both Netflix and Amazon Prime, plus a whole bunch of other free streaming sites.", "verified": true, "helpfulness": "0/2", "author": "Tekkiechikk"}, {"rating": 5.0, "review": "Although there are times when it chokes on streaming from the Apple server during high use periods,  if you pause the episode and get a drink, it usually has loaded by the time you get back. Great and easy to set up. I can even use my Flickr photos as a screensaver!", "verified": true, "helpfulness": "0/0", "author": "G Edward B \"Entropy: it's all downhill from here\""}, {"rating": 5.0, "review": "Not going to get into Apple vs Roku fight as I have both on my TV.This is because though they overlap, example with Netflix, they have different lineups and functionalities.Taken together, both give me a wide variety of TV shows, easily.So yes, when I want to stream my iTunes collection to my TV, I use this.If I want movies from Amazon, that are not on Netflix, I  use Roku.One thing the Apple TV supports is a full wireless keyboard via Bluetooth.So I use this with the Apple Wireless keyboard so I can access YouTube easier when I'm in the mood to search for old TV, for an old TV show themed party....\"The Fugitive or The a Untouchables \" anybody?If you want to nit pick over this sub hundred dollar item, vs the Roku sub hundred dollar  item, go ahead if you have the time.For me, I'm going to sit back and enjoy the wide variety of streaming content I can get with both.There are more important things to obsess about in life.Bottom line, it works as advertised, if you have other Apple  products, it complements them.", "verified": true, "helpfulness": "3/5", "author": "DC Guy \"DC Guy\""}, {"rating": 5.0, "review": "Apple TV integrates very well with other Apple devices allowing you to easily stream videos or music to your TV.  Airplay Mirroring also works well for some things but not others.  For example, I originally bought this with the intent to stream Amazon Instant movies through my Prime membership to my TV.  That didn't work out well--I found out later that Amazon Instant seems to have some issues (even when just streaming directly to my Mac) that made for a bad viewing experience.Watching movies on the Apple TV through iTunes is awesome, but not very cost effective.  I ended up signing up for Netflix and that has worked out great.", "verified": true, "helpfulness": "0/0", "author": "chicagoblackhawks"}, {"rating": 5.0, "review": "I love Apple TV, easy to install and start enjoying! Such a great product, with no hassle at all, thanks!", "verified": true, "helpfulness": "0/0", "author": "Nastassja Lee"}, {"rating": 5.0, "review": "This is a great media streaming device! The shipping was super quick and it arrived early! This is a great buy and I would definitely recommend to anyone! The best $100 I've ever spent!", "verified": true, "helpfulness": "0/0", "author": "Derek Bowers"}, {"rating": 5.0, "review": "It works and does what it is supposed to do.  How did I ever live without it.  This is a good product", "verified": true, "helpfulness": "0/0", "author": "Huie Douglas"}, {"rating": 5.0, "review": "I was not worried about the quality of the product but the setup was so quick and easy and networking was done in less than 10 min.  Great product.", "verified": true, "helpfulness": "0/0", "author": "Amanda DC"}, {"rating": 5.0, "review": "Well, I bought this for my friend not knowing too much about it.  It's a great entertainment tool.  I like how you can stream Hulu and play games on it too.  I'm not too familiar with the product but the smile it brought to my friend was priceless.  I think this is a great buy for anyone who is a fan of Apple.  Me personally, I don't have time to play with these new toys.  I will assume another update for Apple TV will come out which is why I usually hold out on a purchase like this.  Anyway, if you are looking for a great companion toy for your TV watching, this is great.", "verified": true, "helpfulness": "0/0", "author": "Rwong \"Rwong\""}]