[{"rating": 5.0, "review": "Simply take it out of the box, plug it in and connect it to your wifi.  Then start enjoying the ability to watch anything you have on iTunes right on your TV.  You can also use Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 4.0, "review": "Did exactly what I wanted. Streams content beautifully in HD. Only flaw is the typically sleek but weak remote. Replaced the whole system with a Harmony 600 and all is good.", "verified": true, "helpfulness": "0/0", "author": "Tony Johnston"}, {"rating": 4.0, "review": "I do not want to waste time putting up devices. Just one or two clicks and it is done. Design is modern.", "verified": true, "helpfulness": "0/0", "author": "Tapio"}, {"rating": 5.0, "review": "Love my Apple TV. I use it for  Netflix, Nba league pass,air play from my iPhone and iPad and of course renting the occasional movie or tv show", "verified": true, "helpfulness": "0/0", "author": "Y2dough"}, {"rating": 4.0, "review": "Great product but doesn't work off wireless internet had to plug in through Ethernet directly. Still works but wanted no cords.", "verified": true, "helpfulness": "0/0", "author": "Amy King"}, {"rating": 1.0, "review": "While this product has its good points, its unreliability makes it a misery to use. With no change to the hardware, sometimes it works and sometimes it doesn't. Just get the kids settled down and you click play. \"This film requires hdcp for play back. Please check your HTMI cable\". Don't waste your time replacing the cable. Just waste your time randomly unplugging cables and power cycling. some times you get lucky and sometimes the kids go to bed because it got to late to watch the new film, even if you do get it working.This is the worst Apple product I ever had to suffer, problem after problem, HDCP error being the most frustrating.", "verified": false, "helpfulness": "2/6", "author": "Tom"}, {"rating": 5.0, "review": "We bought an apple tv the last time we were in Florida.  We live in the Caribbean, so our cable is horrible, but we can now get Netflix here.  I used to watch movies from our Wii, but now with the apple tv, I can watch anything I can get on my laptop or iPad or phone including music and apps.  I don't know if Roku works here, as some of the options to watch movies and tv are not available here, so this is our best option.  The apple tv was so easy to set up and and it's so easy to use, one of the easiest things I have set up.  My husband and I aren't getting younger, so a lot of the new tech stuff seems so complicated, so this was really a great surprise to set up so easily.", "verified": false, "helpfulness": "0/0", "author": "Cat \"Cat\""}, {"rating": 5.0, "review": "Love the Apple tv and all its features easy to learn and use.  This is an absolute most for Apple users.", "verified": true, "helpfulness": "0/0", "author": "Tyler Sebetka"}, {"rating": 1.0, "review": "This thing has bricked on me 4 times now in the short time I've owned it. I've restored each time. This last time I encountered an unknown error while restoring. It won't restore at all now. I'll be tossing this thing in the ocean shortly and buying a Roku. What a waste. Apple products have really deteriorated.", "verified": true, "helpfulness": "2/7", "author": "Scott D Baird"}, {"rating": 5.0, "review": "This was a present and I was really worried if this would work as well as people do mention. Well, Apple TV exceeded all of our expectations. This is another Apple product that really has no shortcomings!", "verified": true, "helpfulness": "0/0", "author": "Anechkaa"}]