[{"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Again, Great Apple products.", "verified": true, "helpfulness": "0/0", "author": "Agnes Sona"}, {"rating": 2.0, "review": "It worked perfect for the first few days but now once I mirror to watch movies, it always freeze it kicks it out, so it only works great as long as you don't mirror because once you do you are screw", "verified": true, "helpfulness": "0/1", "author": "Edis2012"}, {"rating": 5.0, "review": "I can't say enough good things about Apple TV. I got rid of my Xbox for a 3DS and had a spare TV lurking around with nothing plugged in. I got an Apple TV, and I have a second or third display for my Macs with AirPlay Display, a regular streaming target for AirPlay and access to Netflix and way more. If you own a Mac, this is a must have for your TV.AirPlay Display is the killer feature here. There is virtually no lag, and you can choose to mirror or extend, as though you'd plugged in an HDMI cable. It really changes what a TV can be with such ease.Compared to Roku, the interface is much cleaner and much more responsive. Compared to ChromeCast, you can display more content from more sources, and if all else fails you can use Apple TV as an external display to just push the content that way (I use it to VLC content that iTunes can't read). This is an invaluable tool for any Mac user, and you'll find tons of ways to use it beyond these few.EDIT: I forgot to mention that Apple TV can be a target for iOS as well, so iPhones and iPads can connect and share photos, videos or mirror their screen to the Apple TV. It is really, really cool. We used it for a scavenger hunt involving taking photos. To verify each team found the right place, each team connected their iPhone to the Apple TV and displayed the photos for everyone to see. Some hilarious photos, and some good fun. This is just one possibility when you have a device that integrates so well with other ones.", "verified": true, "helpfulness": "0/0", "author": "David H."}, {"rating": 1.0, "review": "This damned thing works about every other time. Just a piece of crap!", "verified": false, "helpfulness": "0/6", "author": "Bonnie D. Warner"}, {"rating": 5.0, "review": "Cool addition to my Apple devices.", "verified": true, "helpfulness": "0/0", "author": "Alan K Davis"}, {"rating": 2.0, "review": "Let me start this review by saying that I am not an apple fanboy, nor a hater. I merely seek the best reliability and overall consumer experience for my money.Pros:Excellent designIf you already are into the apple ecosystem, makes a ton of sense (theoretically)Cons:There is simply no power switch, to activate the box you need to use the remote. If you don't have the remote and your app decided to not sync (as it is wont to do on occasion) you're S.O.L.There is a crippling problem with Apple's servers, which interface with the TV to stream the content, which leads to halting playback numerous times mid-stream. This issue has been known since 2012.I purchase through apple because of their reputation for reliability and consistency. Their product design in this situation has led to major flaws which should've been ironed out by this generation of product. It is deeply frustrating that apple can't seem to get their act together.", "verified": false, "helpfulness": "4/4", "author": "kyle"}, {"rating": 5.0, "review": "My husband loves this!!!! Works great and fast with iPad or iPhone.", "verified": true, "helpfulness": "0/0", "author": "Mo Butts"}, {"rating": 3.0, "review": "I love the idea of Apple TV and it works really well with the iPad. What I'm disappointed in is how it does not always work well with my MacBook Pro. It connects fine and will either mirror or extend my MacBook Pro's desktop. But it's finicky when it comes to playing video from the MacBook Pro. The online video can be completely loaded but it will sometimes skip or be delayed or not aligned with the sound when projected onto the TV through Apple TV. This delay is not noticed when playing the same video from the iPad and it's also NOT ALWAYS a problem from the macBook Pro, just about 60% of the time. So it seems to be a software issue. I also was surprised that I could not play a DVD on my macbook pro and project it onto the TV via Apple TV. So the Apple TV does work well for pandora and other applications like that, but has some software issues I'm not thrilled with.", "verified": true, "helpfulness": "1/1", "author": "KCR"}, {"rating": 5.0, "review": "Great to use and easy to use.", "verified": true, "helpfulness": "0/0", "author": "James Vazquez"}]