[{"rating": 5.0, "review": "Quality of this product met my expectations. It arrived on time, new, and in the original packaging. The product is easy to setup and easy to use. Perfect for anyone wanting to access internet on their tv. It's perfect and anyone can handle this technology!If mine were to ever break, get stolen, or lost in a move.. I'd definitely purchase it again!", "verified": true, "helpfulness": "0/0", "author": "Noel1212"}, {"rating": 5.0, "review": "It's pretty much a no brainer, and a steal at less then 100 bucks for quality technology. IF you have apple stuff, you have to have it. it's fantastic.", "verified": true, "helpfulness": "0/1", "author": "gregory Bowman"}, {"rating": 5.0, "review": "We got rid of cable because of this fantastic little device. Between various download services and the relatively easy time we had finding a program to convert files to Apple format, we can stream almost anything to our tv except for live material. The integrated services work really easily and the quality is flawless without buffering. Wifi connection was a simple password and apple found our non-apple based network without a blip. My only complaint is that the quite stylish remote, while solid, is not ergonomically easy to use if you have big fingers. It's hard telling where the guide \"bumps\" on the circle are compared to the button part in the center.", "verified": false, "helpfulness": "2/2", "author": "P. Chen"}, {"rating": 1.0, "review": "I ordered this product back in May and now am experiencing difficulties. At first I thought it was my Internet connection; however my other Apple TV works fine in the same room. It's unfortunate that the return policy is only for 30 days and here it is 120 days and I'm out $100 for a defective product. Purchase with caution!!", "verified": true, "helpfulness": "5/12", "author": "Tiffany Powell"}, {"rating": 5.0, "review": "We love this thing!  Very easy to set up and operate.  The list of available programming seems to grow every week.  I only wish our cable provider was more cooperative so we could take advantage of HBO GO and similar providers.", "verified": true, "helpfulness": "1/1", "author": "T.B."}, {"rating": 5.0, "review": "i am in love with this thing. iOS 7 is about to come out so im hoping the back ground will be able to change like on the leaked pictures.", "verified": true, "helpfulness": "0/0", "author": "Cindy L VanderMeulen"}, {"rating": 5.0, "review": "Using playon app and filmon app and Crackle App on my ipad and ipod touch I can mirror over 800 free channels on my 50\" plasma. Bye bye  cable tv. Now all of my friends are saying goodbye to cable and buying apple tv and using the iphones as a remote to get hundreds of free channels. Apple TV is the best device I have used in a long while and I am now sold on everything Apple. Using Apple TV and an over the air hdtv antenna paying for cable tv is a thing of the past.", "verified": true, "helpfulness": "1/1", "author": "Mr Slim"}, {"rating": 4.0, "review": "With the price of cable/ satellite service....I was debating/ researching which streaming option to use.  Looks like Blueray option was out due to too many complaints about connectivity..it was down to Appletv 3 or Roku 3.  I guess either would do..but I read a review somewhere stating the ApleTV had a more stable Wifi connectivity and thats what I needed.  My router was on the 2nd floor of the house and really needed wifi stability.Set-up was easy enough. Just turn on the unit/ plug it in and follow onscreen instructions.  Took a little while for the initial boot-up/ set-up.  Typing the password for the wifi set-up was a little challenging since I was not used todoing it via the remote (probably needs a keyboard accessory in the future)...and the typed character was converted to * after a few secs...so you really need to know your password.  It will rememebr the set-up after everything is set-up so you do this only once.  Just Be careful with the very small remote...very large chance to misplace it , specially with small kids using it.Comes with a lot of links (mostly need account with itunes) to purchase stuff...access to Youtube , podcasts, Smithsonian  and weather channel were free.Really need either a HULUplus or Netfilx subscription depending on what you regularly watch.  Beats paying $70++/ month for DirecTV which has 90% of the channels you dont watch....and clouds don't interfere with the signal.**NOTE: make sure the router is on first before you turn on the Appltv or else it will take a long time to do a re-set-up/ re-link to the router.***SO far it has been great, after a month of no huge cable/ satellite", "verified": true, "helpfulness": "5/5", "author": "ramir san diego"}, {"rating": 5.0, "review": "All of your media form iTunes, all device screen push, netflix, hulu... who needs cable now?  Not me thats who!", "verified": true, "helpfulness": "1/1", "author": "Liam mcdonough"}, {"rating": 4.0, "review": "Exellent performance, no complain. I've used it for two weeks. It has fulfill my expectations. I'd recommend it to my friends", "verified": true, "helpfulness": "0/0", "author": "Maximo Jerez Gomez"}]