[{"rating": 4.0, "review": "I like it but also own a Google TV and the ability to browse the internet and have apps is a reason I enjoy Google's option compared to Apple.  Apple did say they are starting to pay more attention to this product though so hopefully there are some solid improvements on the horizon.", "verified": true, "helpfulness": "0/1", "author": "Rich G \"Rich G\""}, {"rating": 5.0, "review": "We have been looking for a way to cut cable costs for a while and decided to try Apple TV WE LOVE IT!We subscribed to Netflix for $8.99 a month and Hulu Plus for the same price, and were able to cut our cable package to the local basic channels and increased the speed of our internet. Wireless connection is great. I love that I can listen to Pandora from my iphone through the Apple TV onto my TV, my kids love it, especially the Netflix, they never run out of things to watch and we have rented several movies from the Apple Store, super user friendly.We are actually going to buy two more, one for our bedroom and for the kids basement playroom.  Make sure you have an HDMI cable, it doesn't come with one and you will need it to make it work, we bought one on here for less than $10. It updates itself regularly, a notice comes on the screen for the update and it takes about 2 minutes.We had considered the Boxy Box, but decided to try this because the cost was better, and honestly we are just Mac people, but this product is awesome!", "verified": true, "helpfulness": "2/4", "author": "MommyIves"}, {"rating": 5.0, "review": "Great team that.The apps perform better, a cohesive look.  Very nice!I'd recommend this to anyone with any Apple products.", "verified": true, "helpfulness": "1/2", "author": "M. J. Glauser \"Shutterbug\""}, {"rating": 5.0, "review": "I used Samsung DVD player for streaming and it was terrible, painfully slow and Netflix streaming stopped working at some point! Apple TV works flawlessly - fast and intuitive! I use it mostly to stream movies from Netflx and it works like a charm!", "verified": true, "helpfulness": "1/2", "author": "Asia"}, {"rating": 2.0, "review": "If you are buying Apple TV for Airplay and Netflix and Hulu and other things, it works great and thats the reason I have given 2 stars. If you are buying it for Home Sharing.. GOOD LUCK!!! At one point of time, Home Sharing worked great but now my 2 Apple TVs cannot play any iTunes content from my PC or Mac. Forums and Blogs are filled up with this problem. I paid Apple to resolve the issue and they were absolutely clueless. It was a total waste of money. I have tried every solution that was posted to fix this issue for few months now. Fortunately, I did not sell my WDTV Live boxes and I have now gone back to using them to play my content. Best thing about WDTV is that you don't need to convert the media in Apple readable format. Coming back to Apple TV, for me, its a paperweight at this point. I have run out of all the options and solutions. Home Sharing is a major function of ATV and it does not work as advertised. Apple needs to fix it just like their new maps. Unless they fix this, I DO NOT RECOMMEND this product to anyone.", "verified": false, "helpfulness": "0/3", "author": "Savvy Amazon Shopper"}, {"rating": 2.0, "review": "It's no AppleTV2. Until it's jailbroken Ruku is cheaper, has more apps and works with analog TV. Itunes comes out ahead with AppleTV3.", "verified": true, "helpfulness": "0/3", "author": "D. LeDoux"}, {"rating": 5.0, "review": "I am so glad I got this. I use it daily and it is so much faster at loading Netflix than the bluray player I was using before. It is also well integrated with other apple products", "verified": true, "helpfulness": "1/1", "author": "Anonymous"}, {"rating": 5.0, "review": "Ever since the upgrade that added Hulu, this is all that I need for TV.  It would be amazing if Apple or someone else could figure out how to get live sports added to the features but until then this does 90% of what you need to get rid of cable.The interface is very intuitive and quick to get around.  Setup was very easy and adding photos through iPhoto worked great.  I would have liked for the AppleTV to keep the component outputs or RCA audio outputs for those TVs that haven't been upgraded yet to HD.  But I understand the size and overall technology is moving towards HDMI for everything so eventually I would have this problem with any new device.", "verified": true, "helpfulness": "0/0", "author": "ed231"}, {"rating": 5.0, "review": "I have used Apple TV with a projector in my elementary classroom. I can stream everything on my projector from my iPad. In addition, I also use the Apple TV at home to watch movies and television shows. It's a great product for the money.", "verified": true, "helpfulness": "4/5", "author": "Allison Urda"}, {"rating": 5.0, "review": "If you have one or more of the following:1. Hulu2. Netflix3. iTunes contentThen you should pick one of these up.Plug and play it just works, and works fast.The interface is far better than my crappy Visio TV which takes an eternity to scroll through each page in Hulu/ Netflix.And far better than the PS3, which makes me install a new version of netflix monthly (and re-enter my user/ pwd everytime!!!!)At $97 doesn't seem like any reason why you wouldn't want to pick one up.", "verified": true, "helpfulness": "0/0", "author": "B. yau"}]