[{"rating": 2.0, "review": "i got the apple tv a few months ago and it works great i would like to give it a 4 star rank but this has to do with the airplay watching a video on the apple tv is great no wires or anything but play back really sucks it lags, freezes, and sometimes just quits on you and goes back to where all the apps are and sometimes loses internet connection for the mount of money i paid i should at least watch my videos without this problem but nooooo and then apple suggests to trouble shooting it which half of the time works oh and don't get me started on the audio if you don't get the sound you'll have to disconnect the apple tv and restart your computer I'm not saying not to buy this its really great and all but for almost $100 the price should at least be $50 with all the trouble it has", "verified": false, "helpfulness": "1/1", "author": "Robert Caballero"}, {"rating": 5.0, "review": "Like it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I ordered this as a gift and it was a nice little package. I didnt realize how small it was wow! It was quick to set up and the packaging was nice as all Apple products normally are. Great purchase and shipping was quick. No complaints-but Id like to mention that no HDMI cable included.", "verified": true, "helpfulness": "0/0", "author": "Kayla"}, {"rating": 1.0, "review": "I give this product  one star only because I cannot give it negative stars. I bought it two months ago mostly to watch Netflix etc. The first two weeks it was  wonderful and worked very well like most Apple  products. Then it started slowing down, and eventually stalled completely.  There is no problem with our WI Fi, as we used our iPads and computer to watch the movies we couldn't with Apple  TV. We owned this piece of junk two months and Amazon will not take it back.Rotten apple.", "verified": true, "helpfulness": "2/4", "author": "laura"}, {"rating": 5.0, "review": "Excelente producto", "verified": true, "helpfulness": "0/0", "author": "Ronny Correa"}, {"rating": 5.0, "review": "This has been a big help ever since we \"cut the cable\".  We have only over-the-air TV now and use our Apple TV for premium programing and movies.  Works great.", "verified": true, "helpfulness": "2/2", "author": "J. W. H. Esq \"Maxwell\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Ana Oliviero"}, {"rating": 5.0, "review": "Easy to set up, easy-to-use", "verified": true, "helpfulness": "0/0", "author": "James B C"}, {"rating": 5.0, "review": "Works just like it should. We have everything from apple and it works together flawlessly ! Apple never disappointed ! It's worth the price!", "verified": true, "helpfulness": "0/0", "author": "Inga Herrmann"}, {"rating": 5.0, "review": "With an Apple TV I can watch Barney and his friends on my 50 inch TV with my granddaughter's  I can also watch anything that is on my iPad on the TV and it's crystal-clear 1080 P and it also has very good sound .You can also watch videos and see pictures from your iPad on a TV. This is an excellent product from Apple.", "verified": true, "helpfulness": "0/0", "author": "Edward"}]