[{"rating": 5.0, "review": "I love my Apple Tv I no longer pay for Cable, I watch all my content via Apple TV whether its from Netflix or YouTube I can watch it all! The future of entertainment is with streaming devices like the Apple Tv.", "verified": true, "helpfulness": "1/1", "author": "Jason"}, {"rating": 5.0, "review": "I love my Apple TV.  I wasn't sure how I would like it since I\"m not into the fanciest electronics available but I love having Netflix available and only wish they had more of a movie library but that has nothing to do with my Apple TV.  It works great and I have not had any problems with it in the last few months.", "verified": true, "helpfulness": "1/1", "author": "Miriam Franklin"}, {"rating": 5.0, "review": "Apple products are easy to use and user intuitive. Apple TV doesn't disappoint! It hooks up easily with internet and fits seamlessly with my iPhone and Macbook.", "verified": true, "helpfulness": "1/1", "author": "Omari Aarons"}, {"rating": 5.0, "review": "With Wi-Fi it's cool, but once you hook it up to a wired connection that's fast, it is a much better experience. Love it.", "verified": true, "helpfulness": "1/1", "author": "Producerman \"Life's short, use it well.\""}, {"rating": 4.0, "review": "It performed fine but channels and viewing options we wanted were only available with cable. We were looking to cut our cable not supplement it.", "verified": true, "helpfulness": "0/1", "author": "Suzy Q"}, {"rating": 5.0, "review": "Here's the scoop:My reason for buying: 1.  I've been trying to find a way to get rid of my cable bill but I'm not willing to say goodbye to certain tv shows. 2. I'm an \"Apple\" person. I have an iPhone and iPad and soon to have a Mac laptop. I chose Apple TV over the other gadget alternatives due to the fact I can \"mirror\" my other gadgets. The biggest reason for me is I downloaded all the tv network apps that my shows are on. I can watch my shows free through those apps (even the newest episodes if you watch within a week of them first airing). It has tons of other perks too! HBO! All the shows and movies free and on your own time. Lots of other apps for shows and movies and music (including sports) You can bring up all your photos etc..... Literally anything u can do with your other Apple gadgets (Aside from making phone calls I assume).What you need to know:an HDMI cable is not included so you need to buy one if you don't have an extra. They're only a few dollars on amazon. If u don't have wireless internet you'll also need an Ethernet cable. And optional is an audio optical cable if u want it. But I don't need it apparently becaus mine is working perfectly without it.Lastly, I had issues figuring out how to enable \"home sharing\" and \"airplay mirror\". You have to turn on home sharing from a Mac or PC through iTunes. It can't be done from iPad, iPhone or Apple TV. I just downloaded iTunes for my PC and turned it on though there. For turning on \"mirror\" you go to the home screen of your iPhone or iPad and swipe up from the bottom. When the menu slides up click \"airplay\" and \"Apple TV\" and switch to \"yes\" and it'll pop up on your tv screen (when you have your Apple TV screen on).I highly recommend it to do away with a high cable bill. Nowadays you can watch your shows free through apps and since this allows you to bring them up on your tv it's perfect. And watch it when you want without paying for DVR service. I hear amazon fire is pretty cool and I don't doubt it one bit. But if you have Apple products already I say this is a must to link them all together.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I've tried and owned several different brands of media streaming devices and the apple TV still remains at the top of the list. The response time when navigating through the menu is amazing and the way the pre-installed apps are displayed is very user friendly.Out of the box I was able to setup the WiFi and start watching Netflix within 5 minutes. There were some software updates available and depending on the size of the update they can vary with how long they take.My only complaint with the Apple TV is the lack of USB support allowing me to stream my own personal content through my TV. That is the only reason I am docking a star from this review.", "verified": false, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Got this for my husband for Christmas. He loves how he can stream things he wants to watch to our widescreen TV.", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 5.0, "review": "Love the variety of shows with new ones added all the time.  Shows I wasn't able to see I'm able to watch from the very beginning due to Netflix!", "verified": true, "helpfulness": "0/0", "author": "B. Shields \"B. Shields\""}, {"rating": 5.0, "review": "I am an apple fan.Ok I said it.Toys like this are brand centric, I know.Since I like apple and have a ton of apple tech,This thing connects so well.Love it.", "verified": true, "helpfulness": "0/0", "author": "Bradley vail turner"}]