[{"rating": 5.0, "review": "This is a very easy and simple Apple device to use. It makes your home entertainment centre complete. Love it!", "verified": false, "helpfulness": "0/0", "author": "Just the way it is!"}, {"rating": 5.0, "review": "I have long had and used the old white model, with built in hard drive. It worked well, but i had issues. Mostly sync speed and app support. This model seems to have handled those issues. Speed is fantastic and the array of Netflix and similar apps available on it makes it an all line one media device. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "TMentuis"}, {"rating": 4.0, "review": "Solid performer. Easy to install and integrate with existing A/V setup, home networking was a breeze.Biggest problem: Lack of 3rd party apps. Unlike the Roku, there aren't very many \"channels\" or apps that you can add to customize the experience. The built-in apps are good but not great (Internet Radio app is terrible).", "verified": true, "helpfulness": "0/0", "author": "A. Customer"}, {"rating": 3.0, "review": "The Apple TV is a very useful device.  If you have other Apple products, make purchases from the iTunes store, etc it brings all of that to your TV and stereo setup in a simple manner.  It automatically gives us access to our iTunes purchased content, we use AirPlay to stream music from our Synology diskstation, use our TV to show photos and videos we've taken on our phone, etc.  It brings everything together nicely.The big issue I've had is that updates frequently break it.  A recent update has caused network issues.  Each day I have to reboot the device to get network connectivity and AirPlay to work.  It's like every night it forgets how to network.  I tried fixing this by reseting the system to factory settings, but that only made it happen less frequently.  Also, all of the content you purchased in iTunes must be verified with an online server before it will play.  I've been unable to access my purchased content on two different occasions because of the server going down.  Perhaps I just happened to find the two outages in the past year, or (more likely) this happens rather frequently.Overall, I recommend getting it if you have a lot of iDevices and iContent.  Let's hope Apple gets its act together and stops pushing poor quality software, though.", "verified": false, "helpfulness": "0/1", "author": "Damon"}, {"rating": 5.0, "review": "Works awesome with my Iphone.  I can put what ever I want on my TV for everyone to view.  ..", "verified": true, "helpfulness": "0/0", "author": "Tally Fisher"}, {"rating": 1.0, "review": "I never could get it to accept my Apple ID or password. Frustrating.  I tried many different things with no luck", "verified": true, "helpfulness": "1/6", "author": "Mark Clarke"}, {"rating": 5.0, "review": "Have a lot of enjoyment from this purchase. Easy to set up and use with my Ipad. Prefer watching Netflix from this box rather than the app on my TV. Like looking at picture and movies from my Ipad.", "verified": true, "helpfulness": "0/0", "author": "Mad Max"}, {"rating": 2.0, "review": "I don't have a HDMI cable. After so many days of waiting it to arrive, only to find out that I can do nothing with it without a HDMI cable which is not even included. That's so disappointing. I decided to return it.", "verified": false, "helpfulness": "3/6", "author": "Akaneirie"}, {"rating": 4.0, "review": "We use this to stream Netflix on my ipad mini and it works great. It took some time to get it working through the wifi, but well worth it.", "verified": true, "helpfulness": "0/2", "author": "fyrmnkeith"}, {"rating": 5.0, "review": "I had an Apple TV but bought another for our summer cabin and it's better than ever with the recent additions to the lineup. I hope they continue to evolve. The Roku and Google competition is keeping Apple on their toes but nothing else integrates with iPhoto and other Mac products as well as Apple itself. Well worth the $100.", "verified": true, "helpfulness": "0/1", "author": "Don B."}]