[{"rating": 5.0, "review": "Great streaming device. Plays purchases from iTunes without a problem.  Would highly recommend for anyone who is a hardcore apple user.", "verified": true, "helpfulness": "0/0", "author": "Troy Pautz"}, {"rating": 3.0, "review": "The Apple TV unit itself works well.  The picture quality is great.  Apple keeps adding more channels and making the Apple TV more useful.That said, the Apple remote that comes with it is the worst remote in the history of remotes.  First the remote has only 3 buttons and the utterly useless scroll wheel. Seriously, who makes a remote without a power button? Apple that's who. It takes an eternity to log into your accounts and navigate trough the menus. Second, the remote is super tiny and therefor easily lost, hard to hold onto, and hard to use.  Third all the weight for the remote is in the back and the buttons are in the front making it even more awkward to hold onto and use.I like a lot about the Apple TV, but I rarely use it; mainly because the remote is so horrible.  Every time in try to watch something it takes forever to use the rubbish remote to get to what I want, pause, play, or navigate.  I end up saying \"Worst remote ever,\" at least twice while trying to navigate the convoluted menus and get the show started and at least twice more while trying to put the unit in sleep mode.", "verified": true, "helpfulness": "0/0", "author": "Androstarr"}, {"rating": 5.0, "review": "This apple tv is smaller than I expected and seemed well made. I bought this apple tv primarily for its ability to mirror iPad onto my TV. Took me awhile to find out where the AirPlay is on my iPad. It is not on the desktop but around the play button while playing video. Initially I had sound but no video. It was due to my os4 on my original iPad. Once I updated my iPad to os7, problem solved. I also found out that it works with os5 on my iTouch. Wonderful device and it works very nicely with high def.", "verified": true, "helpfulness": "0/0", "author": "tiger"}, {"rating": 5.0, "review": "I can't believe i waited this long to finally get this.  I love being able to stream my music and video off my ipad/iphone/mac straight to my tv/stereo.", "verified": true, "helpfulness": "0/0", "author": "daveturnips"}, {"rating": 5.0, "review": "Excellent product and works out of the box, minimum effort to setup, really easy to use interface + wifi. I recommend it", "verified": true, "helpfulness": "0/0", "author": "Jose Franca"}, {"rating": 4.0, "review": "Apple TV just keeps getting better and better as new channels are added. As Apple puts their plan in place to do to the video world what they did for the music , phone and computer world", "verified": true, "helpfulness": "0/0", "author": "Tony Vitale \"I love sailing, Apple Inc., good books, good music and fine films\""}, {"rating": 5.0, "review": "It is amazing and i highly reccomend this product to everyone i know. Buy it. You wo t regret it", "verified": true, "helpfulness": "0/0", "author": "kullen"}, {"rating": 5.0, "review": "...if you are invested in Apples ecosystem, this makes sense. Doesnt have the full app offerings of a Roku, but if you have an ipad or iphone, you can airplay a lot of apps, personal videos, pics, etc. If you dont own apple stuff or have an itunes heavy catalog, get a roku or chromecast.", "verified": true, "helpfulness": "0/0", "author": "DocStrange"}, {"rating": 5.0, "review": "What a concept! No more viewing my little iPad screen.  I can use the air play option and send everything to my television screen, Whether it's video or pictures you're sharing with others, it is so nice to launch them across the room without worrying about wires.", "verified": true, "helpfulness": "0/0", "author": "Janet Wells"}, {"rating": 5.0, "review": "With the latest discounts, it's an even better buy.  All you need is a one computer in the house w/iTunes running to get music, movies, photos on your TV.  There's loads of gizmos that'll do Netflix and other pay services, so in that respect it's about the same.  I have three for several years and no issues", "verified": true, "helpfulness": "0/0", "author": "Gadget Freak"}]