[{"rating": 5.0, "review": "Apple TV is my preferred system. I have tried roku and fire stick. As an apple product owner I think the system is this best for integration and content. The fire stick offers nothing and is very disappointing.", "verified": true, "helpfulness": "1/2", "author": "James V."}, {"rating": 5.0, "review": "I own 4 of these. We decided to forego the ridiculous fees for cable this year. Tired of paying for garbage programming/commercials that the cable companies provide in exchange for the ridiculous fees they charge. I will no longer be hostage to their lack of service. This is a fantastic product", "verified": false, "helpfulness": "4/4", "author": "SANDRA ROY"}, {"rating": 5.0, "review": "Easy and we love it.", "verified": true, "helpfulness": "0/1", "author": "Kim Nickell"}, {"rating": 5.0, "review": "I love my Apple TV 😻🙈 it's the best ! I can connect my phone to it and play music, videos and pictures and I can watch so many TV shows movies and other things ! I really really really think that you should buy it !", "verified": true, "helpfulness": "1/1", "author": "Ryan lopez"}, {"rating": 5.0, "review": "Works great! So many features", "verified": true, "helpfulness": "0/1", "author": "Becky Calderwood"}, {"rating": 3.0, "review": "cant access any apps, no vudu or amazon prime videos, works pretty good on airplay from iPhone or ipadthe remote is somewhat limiting, a tad disappointing but adequate", "verified": true, "helpfulness": "1/1", "author": "mike bateman"}, {"rating": 5.0, "review": "Just what I needed", "verified": true, "helpfulness": "0/1", "author": "salina"}, {"rating": 5.0, "review": "BEST MONEY I EVER SPENT. VERY USER-FRIENDLY AND EASY TO SET UP.!!!", "verified": true, "helpfulness": "0/1", "author": "Crowes1313 \"Smith\""}, {"rating": 5.0, "review": "Serve my need,very happy with it.", "verified": true, "helpfulness": "0/1", "author": "pv"}, {"rating": 5.0, "review": "Can't say enough about this little device. Very pleased with everything it does, no delay in movies. We used to watch Netflix on our Wii and if someone was streaming music, we would have a conflict. Nothing like that using this. HDMI out is clear as a bell, and I use the remote app on my iPhone.", "verified": true, "helpfulness": "1/1", "author": "Micah"}]