[{"rating": 4.0, "review": "I haven't watched actual television for the past 3 weeks! I gave it 4 stars because it seems to loose connection kinda often, while my other gadgets never do.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 5.0, "review": "Easy setup! Cool watching YouTube  on my tv.  I have Netflix and an antenna for local channels.  Lots of good tv and many radio stations!", "verified": true, "helpfulness": "0/0", "author": "Joe W"}, {"rating": 5.0, "review": "Great TV with Netflix, Hulu, and more. It works really fast and is very easy to use and setup. It was an awesome buy!", "verified": true, "helpfulness": "0/0", "author": "jasmine"}, {"rating": 5.0, "review": "I have had the original Apple Tv for quite some time and it still works just fine.  I purchased this newest version to take advantage of viewing my iPad on the TV screen.", "verified": true, "helpfulness": "0/1", "author": "VT"}, {"rating": 4.0, "review": "My husband decided we needed to cut the cable cord, so we got a couple of these. We're pretty happy with the product. I just wish it had Amazon Instant Video on it too! it is easy to install and we use it everyday. Hopefully more subscription services will be available in the future.", "verified": true, "helpfulness": "0/1", "author": "sharlene scott"}, {"rating": 5.0, "review": "The menu of options, channels including and speed of software are great. I prefer to operate with the iphone, which control the apple tv as it tends to be a bit small. I recommend it 100%", "verified": true, "helpfulness": "1/1", "author": "Allan"}, {"rating": 5.0, "review": "Love this gift for my husband and it is an excellent device to add to your tv.  So easy my daughter can use it!", "verified": true, "helpfulness": "0/2", "author": "Alison Clark"}, {"rating": 1.0, "review": "this cuts out at leas once a show, and good luck trying to watch espn on it, it does not remember where you left off. i know my connection is just fine so the problem is the device.", "verified": false, "helpfulness": "2/6", "author": "Erin"}, {"rating": 5.0, "review": "Simply awesome. Crystal clear HD picture. Only gripe is no amazon app. Idiot proof setup, nice clean interface, and love the mirroring functionality. Turned in a cable box to save $ after getting my second Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Schriscoe"}, {"rating": 5.0, "review": "The Apple TV is simple to hook up and to use.  It make the Bluetooth from ipad to tv simple", "verified": true, "helpfulness": "0/0", "author": "Mark F."}]