[{"rating": 5.0, "review": "Main reason I like the Apple TV is because I can look at pictures I take on my iphone right on my big screen TV. Can also watch video as well from my iphone. This is only one feature of the Apple TV. It has many more that are so enjoyable. I would recommend everyone who has an iphone and is an itunes memeber to get the Apple TV. You will really enjoy it.", "verified": true, "helpfulness": "0/1", "author": "George"}, {"rating": 5.0, "review": "The title \"Wii No More\" is because no longer do I use the Wii for playing YouTube or Netflix videos through my TV. In fact, since getting the Apple TV I haven't even turned on the Wii. The Apple TV is much faster at downloading content for play and rarely pauses during playback. For that alone, I would have given the Apple TV 3 stars. Because there's so much more to love about the Apple TV, I've given it 5 stars.Things I love:1. Airplay Mirroring - if I want people to see something I'm doing on my MacBook, I turn on Airplay Mirroring and just like that, it's on the TV. No more trying to squeeze in to see the MacBook screen or dragging a cable across the room to connect the MacBook to the TV.2. Playing content from a computer - as long as Home Sharing is setup I can pull music and video directly from a computer and play it on my TV. The perfect exercise music is always easily accessible.3. Customizing the Home Screen - with the latest Apple TV update, I can remove the home screen icons that I don't use. With parental controls I was able to remove some of them before, but now I have complete control, minus a few \"required\" icons.4. The Remote App - conducting a search on the Apple TV can be somewhat of a hassle if you are using the Apple Remote that it comes with. Once I started using the Remote App on my iPhone, a keyboard pops up on my phone that I can type the search query in. Down, down, right, right arrow pushing is not required to get to the next letter.5. Size matters - the Apple TV is so small, making it easy to place anywhere. I set it on top of my DVR along with a Kinivo 501BN Premium 5 port High speed HDMI switch with IR wireless remote and AC Power adapter - supports 3D, 1080p, which is on a OmniMount Tria 1 B - 1 Shelf Wall Furniture (Black/Dark Glass) mounted behind/above my TV.6. iTunes integration - renting or purchasing new movies/TV shows from iTunes is so fast and easy. If I have subscribed to a TV show, the show automatically downloads to the Apple TV. And I can also choose to download purchases to my MacBook if I want.", "verified": true, "helpfulness": "30/30", "author": "Skip"}, {"rating": 4.0, "review": "Pros:1. Design, no external power adapter (more than five star)2. very easy and simple to use3. Fits well with iCloud/iTunes ecosystemCons:1. Optical audio should have been hybrid 3.5mm/optical2. Missing bluetooth3. Amazon VOD is missing4. Limited software capabilities.", "verified": true, "helpfulness": "5/7", "author": "SG"}, {"rating": 5.0, "review": "This product as usual was awesome. It works so easily with my system and it allows me to access everything I need.", "verified": true, "helpfulness": "0/0", "author": "Gerry"}, {"rating": 5.0, "review": "I heard Apple TV when it was first appeared with mixed responses from users several years ago. But this time I decided to order it because of its new Airplay function. It arrived safely and on time.  It worked so beautifully that now it becomes the only channel we watch TV. Thanks!", "verified": true, "helpfulness": "2/3", "author": "Ning Pan"}, {"rating": 5.0, "review": "Remarkable device at very affordable price.  Setup is a snap, and it opens up a whole world of music,streaming movies, shows, and events as well as subscription services such as Netflix, blockbuster, Hulu, and many more.  It networks with your computers songs, video, and  photo libraries, and is less than half the size and weight of its original counterpart.  Worth every dime!Apple TV MD199LL/A [NEWEST VERSION]", "verified": true, "helpfulness": "1/1", "author": "Myron M. Persoff, M.D."}, {"rating": 1.0, "review": "Being a dedicated Apple consumer (Macbook Pro, Airport extreme and express, iPod touch, iPod shuffle, iPod nano, iPad 2, iPhone 4S), I read the specs for the new Apple TV briefly and went ahead with the purchase. I know quite a few people with the older (hard drive) version who are happy with theirs.Well this the first Apple product that I will be attempting to return. It just flat out is not reliable!! It freezes and continually dumps downloaded material. I have been on numerous  online forums with suggested solutions. Most suggest that network speed is the issue but even after confirming wifi speed to be adequate with my Macbook right beside the unit it doesn't function properly. I rented a movie that was fully downloaded and tried to play it only to be given an error message. This required resetting the unit and re-entering the log in info and downloading the movie again. After failing a few times I finally got it to play. Foolishly I tried to rewind a segment only to have the unit freeze up requiring another reset.I purchased this product primarily to watch movies and You tube my sons nursery rhymes. It is NOT any more convenient than buying Blu-ray! I cannot understand the reason for not offering the hard drive option anymore. They will need to do a lot of bug fixing to get this product to make any sense.", "verified": true, "helpfulness": "1/12", "author": "Docchin75"}, {"rating": 1.0, "review": "I order from Amazon at least on a weekly basis and have never had an issue with a product being defective, thankfully. I already owned an Apple TV, but purchased this one as a gift. Turns out, it didn't work. All I wanted was a replacement, not a refund, and Amazon refused both. Glad I hadn't previously encountered defective products with Amazon because I learned that they will not assist you in getting what you paid for. There went $100 down the drain and I will reorder this product from Apple to give to my relatives who are awaiting their long overdue (working) gift.", "verified": true, "helpfulness": "12/26", "author": "bdw9877"}, {"rating": 5.0, "review": "Everything works as they say it would! Super simple set up. Easy integration to our laptops and iPhones. I would recommend to anyone with kids!", "verified": true, "helpfulness": "0/0", "author": "E Hemingway \"tropic_traveler\""}, {"rating": 5.0, "review": "I love our Apple TV. If you have Apple products (an iMac, but especially an iPhone), you will appreciate the interface and ease in using this over other streaming boxes. I love being able to share photos and videos with company in the comfort of my living room, listening to my entire music collection from another room (my iMac is upstairs), and playing my movies onmy 60\" v. my 21\" computer screen. And being able to type with the Apple remote is beyond easy and better than any alternatives I've found. For $100, this is a no-brainer for anyone who wants to be able to do what I've described easily.", "verified": true, "helpfulness": "0/0", "author": "David R. \"Abide\""}]