[{"rating": 5.0, "review": "Very happy with the unit.  Unfortunately, the information did not show that an HDMI cable was required but not included.  Packaging and delivery was prompt and as expected.", "verified": true, "helpfulness": "1/2", "author": "Robert Colter"}, {"rating": 5.0, "review": "The Apple TV arrived promptly, was very easy to set up and use, and is an excellent product for viewing movies, tv shows, etc.", "verified": true, "helpfulness": "0/2", "author": "Jenny Tyson \"City Slicker\""}, {"rating": 5.0, "review": "Great product by all standards. Got it as a gift and it sure does what it promises! Its amazing how the remote control works seamlessly with other devices such as the mac. Couldn't be happier.", "verified": true, "helpfulness": "0/2", "author": "Mab"}, {"rating": 5.0, "review": "This thing can pretty much access all your purchases in the cloud (except apps), and stream them to it (while only storing the data until no longer needed)! The perfect Apple iCloud companion for those who are needy for space on their PC, Mac, or iDevice! It can even do a lot more things than just access your iCloud content. It can share audio with Apple Home Sharing linked devices through the AirPlay service (requires Wi-Fi, and Ethernet devices must have a direct connection through the router), and it can access basic and premium services (like YouTube, Netflix, Hulu Plus, The Weather Channel, and more)! However, the only thing I wish it had was the ability to stream Live TV through your Local Cable or Satellite TV provider (or even a DTV antenna), just one of your choice! Hopefully, the next generation will have these extremely useful features, and more! If they do so, I literally will stop at nothing just to trade it in for credit towards the next generation! But..., only the company that offers the highest Trade-In value will earn the right for the future exchange! So (for example) if Amazon can't beat Apple's offer, they may lose out on the action!For right now, this product simply delivers what I need it for at this time, and I'm not regretting this purchase..., at all!Apple launches new devices faster than any other competitor, so please try to wait for the next generation before you buy!But..., if this is all you want, then I would definitely recommend this product to anyone who wants it exactly for this purpose!", "verified": true, "helpfulness": "0/0", "author": "bjj0001"}, {"rating": 5.0, "review": "As usual, I loved it. I never ever have any problem with it for last 1 year. Beautiful stuff. Recommend it.", "verified": true, "helpfulness": "0/0", "author": "Puru Pokharel \"NEWROAD PLAZA\""}, {"rating": 5.0, "review": "We love Apple TV.  We did have to upgrade our wireless, but that was an easy fix.  We love it!", "verified": true, "helpfulness": "0/0", "author": "Debbi"}, {"rating": 5.0, "review": "I love it it is easy to use I wood recomend appel tv to all my friends, and famaly members.", "verified": true, "helpfulness": "0/0", "author": "Thora Hauksdottir"}, {"rating": 5.0, "review": "The apple tv is a great streaming box and easy to use. I lost the remote, it is probably somewhere in my couch since it is so tiny but thankfully the app for the iphone works well. If you have an iphone or ipad then this fits great into the ecosystem. They are adding new apps to it everyday and rumors are they will add an app store which would make this device almost flawless.", "verified": true, "helpfulness": "0/0", "author": "JimmyJames"}, {"rating": 4.0, "review": "Have enjoyed watching home movies on my big screen. Also, great for watching movies, Netflix. Highly recommend it as a must have.", "verified": true, "helpfulness": "0/0", "author": "Forrest M. Butler \"skeetshooter8436\""}, {"rating": 1.0, "review": "Product failed after only 2 months of owning.  According to owners manual, we should have had 90 days to receive technical support for item.  Apple refused to help without us paying 19.99 for support.  Contacted Amazon and they very willingly offered to take it back from us even though we were past our 30 day window to return.  We will not be purchasing from Apple again!", "verified": true, "helpfulness": "2/5", "author": "Kristen"}]