[{"rating": 4.0, "review": "If you don't want to be another one of the mindless drones who sit through whatever cable has to offer (including insanely long commercials) than this may be the device for you. You can still watch the shows you like via Netflix, HBO Go, ESPN, etc. but without the commercials & without having to wait until a certain time to watch the show. With the Apple TV, you are in control.I like this better than the Roku because the interface is simple & clean. Also, there is a YouTube app which the Roku doesn't have (major mistake on Roku's part). Lastly, the Apple TV syncs well with the iPhone & mac computers so you can show whatever your phone screen is showing on your TV via Apple TV. This is great if you want to watch a game on The Big Ten Network for example & Apple TV doesn't offer it - you can just put it on your phone or computer & beam it to the TV wirelessly. Pretty solid & I don't consider it very laggy, unless you have a slow internet connection.The YouTube interface leaves much to be desired. You can't read comments, etc. but it's still nice for watching videos. You can also download the Apple remote on your iPhone for free. This turns your phone into a remote & saves you time when typing in the search bar of the Apple TV menus. Would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Paul E. Mathematics"}, {"rating": 5.0, "review": "got it as a gift for my daughter and her wife in new york.  they love it . thanx !!!", "verified": true, "helpfulness": "0/1", "author": "Michael N. Pepe"}, {"rating": 5.0, "review": "We love our Apple TV for its ability to consolidate and use minimal steps to get to programming. Highly recommend!", "verified": true, "helpfulness": "0/1", "author": "B. KLUEPFEL \"imaklubfut\""}, {"rating": 5.0, "review": "Bought this as a gift and my son demonstrated it for us on Christmas Day. If you take a lot of photos with your iPhone and like to show them off, this is a must have. Great for Grandma and Grandpa to show off the a Grand kids. If your not familiar with the tech, have the kids hook it up for you and show you how to use it.", "verified": true, "helpfulness": "1/1", "author": "Too busy to return it"}, {"rating": 5.0, "review": "Apple TV is another great from Apple, just like everything they put out. Very easy set-up. No problems with connection or use.", "verified": true, "helpfulness": "1/1", "author": "Sandi Weir"}, {"rating": 5.0, "review": "Bought as a Christmas gift for my hubby.  He likes what he can do with it and his iPad.  Great gift!", "verified": true, "helpfulness": "1/1", "author": "Shoppergirl"}, {"rating": 5.0, "review": "I originally bought the Chromecast which lasted all of three weeks before acting up.  Sent it back under the 30 day warranty with Amazon and ordered the slightly more expensive Apple TV.  You get what you pay for!  Love my Apple!", "verified": true, "helpfulness": "0/1", "author": "M. Fredendall"}, {"rating": 5.0, "review": "I love the flexibility tht this device gives in the home entertainment venue.  Its easy to set up and even easier to operate!", "verified": true, "helpfulness": "0/1", "author": "Nick Arnold"}, {"rating": 1.0, "review": "If you want to watch YouTube a lot, don't buy this.  It won't play continuously like google tv.  It is very difficult to search anything because it doesn't come with a keyboard.", "verified": true, "helpfulness": "0/5", "author": "ChaoTep"}, {"rating": 4.0, "review": "I purchased this so I can watch the movie files on my laptop on my tv.I opened the package and connected everything. Started to upgrade the software on Apple TV and boom!It froze. I thought it would be easy fix. Just reset it and do the upgrade through iTunes.I was wrong. It was not that simple if you don't have the right cable which they do not include in the box.It requires Micro USB cable to connect to your computer which I had to order it separately. You might already have Micro USB in handy but not everyone has it. If it needs restart/reset/upgrade through computer and requires additional cable, Apple should've included that in the box.Other than that, it just works. I love it so far.", "verified": true, "helpfulness": "0/0", "author": "Kazuya K."}]