[{"rating": 5.0, "review": "I really like this toy, it's awesome to have in your extra rooms and Crackle, Netflix and other apps are great on it.", "verified": true, "helpfulness": "0/1", "author": "bobbyo!"}, {"rating": 4.0, "review": "Love my Apple TV! I am a Mac user so its awesome that I can use Airplay with my iPad and tv to watch whatever I want. Is a little pricey but well made and hopefully will last a long time, its Apple!", "verified": true, "helpfulness": "0/0", "author": "Di \"Diane\""}, {"rating": 5.0, "review": "I have give about 15 or 20 of these away to friends for holiday presents.  It's a great little product", "verified": true, "helpfulness": "0/0", "author": "I.N. Botnick"}, {"rating": 5.0, "review": "When I was buying this at my local Apple retail store, the rep told me it could play directly from my NAS (network-attached storage). When I got home, I realized she had either lied to me or simply hadn't got a clue.  The Computer part of Apple TV only streams from iTunes software on Mac or PC.However, with the help of a free app called MoliPlayer HD -- I first used this app last year on my Nokia Windows Phone -- and the wonderful AirPlay, it's a cinch to network-play my files on my NAS, a Diskstation product.  MoliPlayer HD can access any server or computer on your LAN (local area network), and play pretty all the video and audio formats out there.  The free version doesn't allow you to password-protect the app, but otherwise has all the major functions.  I just launch MoliPlayer HD, go to Nearby on the left, and it accesses my DiskStation as well as my Windows workgroup immediately. I then turn on AirPlay to send the media content to my Apple TV.The Apple TV is truly simple and elegant, and it just works.  I went through several Android-based media players but they were all difficult to use, froze frequently, not to mention anything from Google is reported to spy on you and your family.  On the Apple TV I can rearrange the app icons just like on iPhone or iPad. I can easily get rid off unwanted icons through the Restrictions settings. For instance, I don't have cable at home, so I remove things like HBO and ESPN and Disney channels.  Everything just works so well and so smoothly, even the screensaver is so well done.  AirPlay is indeed awesome!!  I plan to get an AirPort Extreme and AirPlay-ify all my media hardware.", "verified": false, "helpfulness": "1/1", "author": "For Real \"HAND\""}, {"rating": 5.0, "review": "Easy installation. Already had the apps I wanted on there. Couldn't beat the price of $84 versus the price in-store. Dad loves it!", "verified": true, "helpfulness": "1/1", "author": "Linh H."}, {"rating": 4.0, "review": "I have 2 of these products.  Easy to install.  For me it makes access to Netflix, etc easy.  I also use it for a screen saver with my photo stream.  It is probably a little expensive for what you get, but it's Apple and it works.", "verified": true, "helpfulness": "0/0", "author": "john w."}, {"rating": 5.0, "review": "The Apple TV was recommended to me by my brother in law.  I was very cautious at first but I can not live without this device now.  It makes viewing Netflix, my iPhone videos and pictures a convenient breeze.  I would recommend to anyone but especially to those who own an Apple device(s).", "verified": true, "helpfulness": "0/0", "author": "Elderlan"}, {"rating": 5.0, "review": "As you would expect with an apple product, hook it up and away you go. Simple, easy to use, always works.", "verified": true, "helpfulness": "0/0", "author": "WackyBrakke"}, {"rating": 5.0, "review": "It was quick and easy setup.  I mostly use it to tune in to NetFlicks and it works fine.  The remote control especially makes it easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "CharlieTX"}, {"rating": 5.0, "review": "I LOVE IT! I can't wait to they come out with the next gen and more apps like Amazon so I can watch movies on it", "verified": true, "helpfulness": "0/0", "author": "Phantom Phreak"}]