[{"rating": 5.0, "review": "It is an apple TV, was indeed the Model Number listed. Works well, I have absolutely no complaints at all.", "verified": true, "helpfulness": "0/0", "author": "Kev"}, {"rating": 4.0, "review": "If your an Apple fanboy, go ahead and buy it. Decent interface and speed. However I'm not as impressed as I am with the Android TVs out there...It's still nice to have and for the price is a great addition.", "verified": true, "helpfulness": "0/0", "author": "R. Brown \"R. Brown\""}, {"rating": 5.0, "review": "If you are going to use your tv as a monitor to watch online tv, THIS IS A MUST HAVE.  I haven't owned it long, but well worth the money.  My wife is now thinking about cancelling our TV service.  We spend $25 on TV now, we'd pay for the Apple TV is as little as 4 months.  I should state that I'm a PC lover.... but Apple is starting to win me over.", "verified": true, "helpfulness": "8/9", "author": "cap045"}, {"rating": 5.0, "review": "Apple TV works great with my iPhone 5, my ipad and my Mac Book pro.  I would recommend this device if you have a lot of other apple products.  It works great together.", "verified": true, "helpfulness": "1/1", "author": "whitey33"}, {"rating": 4.0, "review": "Everything is according description, good product and quality. I like this product is very funny, Apple support people are very kind.", "verified": true, "helpfulness": "1/2", "author": "Jose Perez Cueva \"Jose Antonio Perez\""}, {"rating": 5.0, "review": "I just have begun to use this, primarily for presentations. I really enjoy the ability to present from my IPad wirelessly! We have watched one movie as well, as I have just started to find the benefits.", "verified": true, "helpfulness": "1/2", "author": "Fishguy1368"}, {"rating": 5.0, "review": "As we are now an entire apple home I can say that without a doubt I love the apple tv. The streaming of netflix is so good, and the user interface is great!! Having an iphone 5 with apple tv is amazing!!!! I cannot say enough about this product!", "verified": true, "helpfulness": "1/2", "author": "Gregory A. Kinat"}, {"rating": 5.0, "review": "Haven't deployed this yet but the item arrived on time. Packaging etc. is all good. Got what I had expected to buy.", "verified": true, "helpfulness": "0/6", "author": "PS"}, {"rating": 5.0, "review": "Apple TV works great for streaming Netflix, MLB TV, and using it to put other Apple products on the screen.  Setup was super simple and makes watching TV (not cable) much better.  Also works great for streaming pictures and music through Pandora or other internet music services.", "verified": true, "helpfulness": "1/2", "author": "Taylor T. Bentz"}, {"rating": 3.0, "review": "If you're looking for a small, easy-to-use, elegant but extremely limited set top box and don't mind purchasing everything from iTunes, the Apple TV works. If you want something that's a portal to other content providers, you might want to consider something else.Make no mistake about it, Apple wants you to buy everything from them and nothing from anyone else. Nowhere is this strategy more evident than with the AppleTV. Other than Netflix and a couple of other services that, if not available, would render this product completely irrelevant, Apple makes sure you don't have access to competitors, like Flixster or Amazon. If you want a movie or television show and it's not on Netflix (and it probably won't be), you will have to purchase it, and the only place to get it is, you guessed it, iTunes. If you've purchased a digital copy of a movie on a cloud like Flixster, you won't be able to use the Apple TV to play it like you would on a PS3, XBox, Google TV, Samsung Smart TV or any of a number of open systems.Unless.That is, unless you have OSX Mountain Lion. If you do, you with one click, AirPlay everything on your computer on your television. Everything that's on your computer is on your television, including the sound. It's a great feature for making presentations or simply watching a movie.And it helps you subvert the brilliantly engineered iTunes Monopoly that comes installed with every product Apple sells.", "verified": false, "helpfulness": "1/2", "author": "Tangerine \"Tangerine\""}]