[{"rating": 5.0, "review": "Love my Apple TV. I wish Apple could get Amazon Prime. Anyway, Not a large selection of apps but really how much do you need, thats not on hulu.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Morris \"Matt_Wolf!\""}, {"rating": 5.0, "review": "Apple tv vs ROKuApple: So far we can mirror our ipads on the tv. We can watch a lot of free tv. We can check out what is on the icloud.Roku: we can play apps like angry birds and more. We can also watch free tv and some movies.They are different but the same.I will add as we use them more.", "verified": false, "helpfulness": "0/0", "author": "kmbere \"kberen\""}, {"rating": 5.0, "review": "We love it! Going to buy another one for 2nd TV. Can't compare to any other similiar devices since we've only used Apple. Works great with our iPhones and iPads.", "verified": true, "helpfulness": "0/0", "author": "Crisinda Puetz"}, {"rating": 4.0, "review": "This is replacing my Roku XD. Although I love the roku it was missing a couple things, which is why I got the apple tv. Those reasons being 1. optical audio output 2. streaming videos from a mac or pc. The Apple Tv was easy to setup just like the roku and I got everything to work. Dolby digital, 1080p, my netflix, youTube which was not included in my roku and video/audio streaming was easy to setup. All you have to do is sign on to your apple ID on your pc or mac and enable home sharing. Enter in the same apple id on the apple tv and your good to go. The reason why i gave this 4 stars is its lack of being able to add channels like amazon instant video to it. So far I like it and will post an update if I get any issues.", "verified": false, "helpfulness": "0/0", "author": "Frank C"}, {"rating": 5.0, "review": "Item delivered on time, was as described", "verified": true, "helpfulness": "0/0", "author": "Mark Estey"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Neverwhateve"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Gary May"}, {"rating": 5.0, "review": "I bought this for my sister because I love my Apple TV so much that I knew it would be the perfect Christmas Gift!", "verified": true, "helpfulness": "0/0", "author": "Damian Kulczynski"}, {"rating": 5.0, "review": "XECELLENT", "verified": true, "helpfulness": "0/0", "author": "Robert Gaulin \"BABA\""}, {"rating": 4.0, "review": "Works great but beware -- as with other Apple products you cannot view all content on this.  For instance, I ordered an Amazon Prime Video subscription ($99/yr). but then had to get a Roku 3 to play it... as Apple does not.", "verified": true, "helpfulness": "0/0", "author": "Janyth"}]