[{"rating": 5.0, "review": "Apple TV is easy to use and provides a plethora of viewing and listening options.It is well worth the purchase!", "verified": true, "helpfulness": "0/0", "author": "SuzieQ"}, {"rating": 5.0, "review": "I initially purchased the 2nd generation Apple TV and my family used it so much that I bought the 3rd generation for our other TV. Both versions look the same, but the 3rd gen. supports 1080p.We have a Netflix streaming subscription, and use the Apple TV for that, but there are many devices that offer access to Netflix, Hulu, You Tube, etc. so that isn't the reason to buy this, in fact the Roku box offers more in the web-based steaming channel category at the moment. The real reason to buy the Apple TV is the ability to stream media from your ITunes account.I've streamed my media to devices in the past, including an Xbox and a PS3, but this was the easiest by far. This is the only device ive ever had that my wife will actually take the time to use for streaming purposes. she always complained that the other setups i used were too tedious and unintuitive. With the Apple TV, iif you are on a network, and have a PC with iTunes running and Home Sharing enabled, you can access everything you have loaded into iTunes.Then there is airplay, which allows you to actually use your iOS device to communicate with the Apple TV. Anything you have in your iPhone or iPad can quickly and easily be shown on the Apple TV. Streaming music, videos and even viewing apps has never been this easy. The box does a lot more than what I've mentioned, but these are the main features my family uses.", "verified": true, "helpfulness": "0/0", "author": "D. Nalesnik"}, {"rating": 3.0, "review": "The user experience of the Apple TV - meaning the on screen UI and responsiveness is top notch. It is very friendly to use, easy to set up and even a bit exciting to play with. I find myself annoyed at the lack of depth, however. I don't understand why there is no app system on this apple product - it leaves me feeling as if it is a neglected toy as compared to the rest of the Apple product line.I really wish I could watch vudu on this device, as I find it has the best selection of new (in theatre) movies.The Netflix experience is fantastic, definitely the best netflix experience of all of my devices. I love the AirPlay from my iPad and my Macbook, but I've yet to find a practical use for it in my house - it has come in handy on the ones we have at our office though.The very stylish but annoyingly tiny remote control is a frequent pain point. The fact that it is so small means it's always under our butt, between the couch cushions or otherwise hiding. I really just wish it had a normal size remote control as we've evolved our livingroom habits to efficiently manage those without losing them or sitting on them (much).Overall I'd say this product is well designed and fun to use but a bit too closed (platform limitations) and lacks a lot of the functionality I've come to expect from apple products.", "verified": true, "helpfulness": "0/0", "author": "Amir Elaguizy \"amirpc\""}, {"rating": 5.0, "review": "I am very happy with my purchase, having fun with my apple tv.-seven more words required to submit this form-", "verified": true, "helpfulness": "0/0", "author": "Diego"}, {"rating": 5.0, "review": "Works well,got it to use youtube & movies on youtube does good. Any other movies you have to pay for. Podcast & Radio are good.", "verified": true, "helpfulness": "0/0", "author": "Anthony Womer"}, {"rating": 5.0, "review": "I got this as a gift for my boyfriend and he says it is better than anything else of it's kind.", "verified": true, "helpfulness": "0/0", "author": "Morganccc"}, {"rating": 5.0, "review": "I am very happy with my Apple TV, I even bought another for another TV. It works well, I only wish their were apps available to expand it.", "verified": true, "helpfulness": "0/0", "author": "K. T. \"Honest reviewer\""}, {"rating": 5.0, "review": "Love it. It has just as many features as I'd think a $100 product should. Especially love the netflix interface.", "verified": true, "helpfulness": "0/0", "author": "Kyle Wayne Benson"}, {"rating": 5.0, "review": "When we first got one, we were trying to find a place for our pictures and music.  It kept it centralized and was a great to see pics more often than not.  Now we no longer have cable (going on 4yrs) and it has become the focal point of our tv.  Since it almost alway on the Apple TV now, we have our photo stream turn on and get to see images all the time.  We can play our music or favorite radio station.  There have been some hiccups but for the most part, it is the best streaming out there.  I have seen streaming on other devices, and it just not bring the quality that the Apple TV does. Highly recommend it!", "verified": false, "helpfulness": "0/0", "author": "Bonny J. Hill"}, {"rating": 5.0, "review": "If you have an iphone, ipad, ipod, or a mac with 10.8 and above, appletv is a great supplement to your products. I use it to share pictures and youtube videos with friends and family. Definitely recommend having one, it's very seamless.", "verified": true, "helpfulness": "0/0", "author": "N. Ilyas"}]