[{"rating": 5.0, "review": "I ordered the newest version of the Apple TV and absolutely love it. I had the first generation Apple TV and this is replacing it for all the new features (like Netflix streaming and Air Display). My OLD Apple TV still works and rents movies from iTunes but its much larger, runs very hot, wont stream netflix, and is overall just a bit clunkier than the new model. The NEW Apple TV is small, quick to start up, consistently pops open when you touch the remote button and swaps from room to room quite quickly. The AirPlay feature is quite nice and allows me to play my Spotify playlists through my tv/stereo and even pops the name of the songs on screen. My only grips about the product might be the streaming speed. The old Apple TV had a hard drive where the rented iTunes movie would download directly and play - this has a flash memory that temporarily stores the movie for playback... if you start an HD movie then stop it so you can finish up the movie later, you seem to have to wait for the buffer to start the download again (like it never fully downloaded the movie the first time. I only noticed this when downloading an HD movie off itunes (which are quite large anyway) and have not noticed such a lag when watching HD Netflix streaming movies. Other than that minor quirk (which may be addressed in a future upgrade - or may just be wifi speed related) I love this thing and actually am considering buying another for our other room so I dont have to keep moving it back and forth.", "verified": true, "helpfulness": "1/1", "author": "R. Wagner"}, {"rating": 5.0, "review": "We've tested all the devices out there in this segment, and the Apple TV remains the best!  The latest version added Hulu Plus which we use a lot and really enjoy.  Hands down this is one of the best units, just wish it had NAS storage playing and wasn't so locked in Apple's little world.  But, still really nice and worth the price!", "verified": true, "helpfulness": "0/0", "author": "ARI J COMET"}, {"rating": 4.0, "review": "Works well and as advertised. Only issue is documentation. Apple still thinks their products are so simple they need little explanation. That has not been true for a LONG time.", "verified": true, "helpfulness": "0/0", "author": "Snowflake"}, {"rating": 5.0, "review": "Personally, i use this thing all the time. If you have an ipod or ipad and use youtube non-stop, I feel this is a must buy. I use it to watch youtube vids from my ipod to my hd tv everynight before bed. I love it, is compact and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Chris Spencer"}, {"rating": 5.0, "review": "We are living overseas and did not have access to American TV and there are very few radio stations. The Apple TV has changed our music and TV/movie viewing life. Very easy to set up, although there are occassional glitches and the device has to be set up. The optical connect to the stereo system is easy, and sound guality is great. We were amazed at the number of internet radio stations, and the ease of streaming directly off our ipad, mac or iphone --- just use airplay. Makes it easy to download a video from itunes and then play it through our home stereo system. One of our most recent surprises with music is we are enjoying the Rhapsody music service, $10 a month, and with airplay we can stream directly to out stereo system. Little quirks are the remote -- make sure you follow the steps to ensure your laptop isn't picking up the apple tv. Also we have slow internet, so downloading movies via apple tv is too slow to stream -- instead we download to the laptop and use airplay to watch on the TV. Just a great device for a great price.", "verified": false, "helpfulness": "0/0", "author": "snakes"}, {"rating": 5.0, "review": "I had been debating for over a year whether to get an Apple TV device, but after getting one I don't know what took me so long. If your TV is the focal point of your home entertainment as it is for me, and you're a Mac, iTunes, or iPad user, then this device is awesome. It allows you to play anything you have ever bought or downloaded from iTunes (music, movies, shows, podcasts, etc.) on your TV instantly and wirelessly. If you connect Home Sharing from a computer running iTunes (a PC in my case), you can watch or listen to anything in your iTunes library, regardless of whether you purchased it from iTunes (e.g. ripped CDs or DVDs). But the best part for me was that you can mirror your iPad or other iOS device onto the TV through the built-in Airplay feature. For example, you can listen to Sirius or Pandora through the TV and control it from the iPad wirelessly. Apple TV also has built-in apps for Netflix, Hulu, YouTube, and a few other services if you're so inclined.  The $100 price tag is not bad considering the capability it gives you. There is nothing else like it available for mirroring iOS devices onto a TV. The main reason I debated was that I can already stream Amazon, YouTube, Netflix, and Hulu directly onto my TV without having to by a separate device (I have an LG smart TV).  But all of my music is in iTunes and there is no way to play it on the TV otherwise.  But the thing that really sold me was the iOS device mirroring.  Bottom line- I highly recommend it.", "verified": false, "helpfulness": "3/3", "author": "CB"}, {"rating": 5.0, "review": "This is a great media streaming device that works great over wi-fi.  Use it as an audio source to stream your lossless music from your Mac, stream video like Netflix, stream all your photos from your Mac, or use AirPlay and your iPhone to share about anything.  If you do have an iPhone or iPod Touch, you can use the free Apple \"Remote\" app to control the Apple TV... genius!", "verified": true, "helpfulness": "1/1", "author": "IgnoringMyWife"}, {"rating": 5.0, "review": "This is the second Apple TV I purchase. Both are exactly the same model (3rd gen, I think, which is the latest so far) and were purchased from Amazon within a year period.Both, when I considered purchasing the first one, and then the second one, I had in mind the following:1) I wanted a Hi-Def A/V IP tv box (no more standard-def through the Wii console Netflix), and work with HDMI cables (less cable clutter)2) It would have to be able to handle Netflix, YouTube, and then some3) Aesthetics were also relevant, so it would have to look sleek (if it was only really possible!), and have a small footprint and overall dimensions4) Finally, the deal-breaker would be if I couldn't find enough available content for it to show, since I spend many months every year outside the USA, and some video and music services (ie Rhapsody, Amazon Prime and many others) do not work outside the USA, but iTunes Store does.At the end it all came down to two serious contenders: the newest AppleTV, and the latest ROKU box.Having the iTunes Store content available overseas, on top of Netflix, was what tipped the balance in favor of the ATV, for the first time, and having had such a good experience with the ATV that time, set my mind into favoring the ATV unit for the second time as well. AirPlay from my kids ipods, and ipad, also proved to be a very nice feature. Hopefully with the coming OS upgrade, ATV might have some Apps capabilities coming into it soon.My internet connection is supposed to be 10 Mbps, and it measures up to 8-10 Mbps most of the time, and with that speed, I get good video and sound quality, without noticeable stuttering or long buffering times, so I'm satisfied with it.Amazon delivered on time, with super-saving free shipping, and the purchase price itself both times was marginally lower than Apple's official list price, so it proved to be a good deal for me. Hope you enjoy yours as well.", "verified": true, "helpfulness": "1/1", "author": "Eduardo Valladares"}, {"rating": 5.0, "review": "This is my 2nd Apple TV.  I only bought this to update to a 1080p version.  This product interfaces so well with the MAC, the iPad and the iPhone.  Easy to install and within minutes you are showing pictures from you iphone to your big screen TV.  Too many uses to name but if you are thinking of buying one - GET IT! you'll love it.", "verified": true, "helpfulness": "0/0", "author": "Bob N"}, {"rating": 5.0, "review": "Apple TV 3 is much improved comparing to the Apple TV 2 that I own also. The 1080p versus 720p in Apple TV 2 is the most recognized advantage in all reviews. But beside that, it has newer processor and works much faster. The Wi-Fi connection is more stable in my opinion. Setup is fast and easy, identical to the one on Apple TV 2. The menu is quite intuitive and does not requires to search pages through user guide to find the function. Connection to iTunes account was easy and worked instantly after entering my account info.The only con i could find is it haven't been jailbroken yet, so not able to install XBMC on this. But it is probably just the matter of time.Overall, it is the great product.", "verified": true, "helpfulness": "0/0", "author": "Ed \"Ed\""}]