[{"rating": 5.0, "review": "Works great, no problems, lots of nice features", "verified": true, "helpfulness": "0/0", "author": "Ambrose"}, {"rating": 5.0, "review": "Every home in the United States should have an Apple TV, I mean, provided they have at least one Apple device to stream from. The selection on Apple TV is great and if you have Netflix it replaces any other clunky gaming device you may have been using. I'm going to buy more.", "verified": true, "helpfulness": "1/1", "author": "George R.E. Wacker"}, {"rating": 5.0, "review": "Love,,,gave to grandkids", "verified": true, "helpfulness": "0/0", "author": "Aunti Marie \"Aunti Marie\""}, {"rating": 3.0, "review": "Bought with the hopes that it would eliminate the need for cable.  Its not quite up to that task.  Netflix seems to work fine, the overall interface is just what any other Apple is.  ESPN did not work well at all (lots of buffering and below standard def quality when working) and I could never get iTunes movie rentals to work properly with my iTunes account.", "verified": true, "helpfulness": "1/1", "author": "Ellis"}, {"rating": 5.0, "review": "Incredible product. I have two now.", "verified": true, "helpfulness": "0/0", "author": "Rafael Ferreris"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Robert A. Redmond"}, {"rating": 5.0, "review": "Awesome! Works with my ipad and iphone. The only issue is if you lose the remote, you're screwed as you can't turn on or join wifi networks without it.", "verified": true, "helpfulness": "0/0", "author": "R. Tang"}, {"rating": 5.0, "review": "Made by Apple, so you know the quality is great and usability is too.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 3.0, "review": "flaky at best. drops connection regularly. needs rebooting constantly. love being able to share things easily in the house but the product struggles. mine is an older version, perhaps reliability is improving?", "verified": false, "helpfulness": "1/1", "author": "PM"}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "LDOU"}]