[{"rating": 5.0, "review": "We were dissatisfied with the interface between our TiVo premiere box and Netflix - wait times for our instant queue to load, fast forward function, etc.  I got Apple TV set up in minutes and we are extremely happy with the way that it streams movies from Netflix. It also has a great interface with my MacBook air using Airplay - a cinch to have it display whatever is on my laptop screen. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Rex"}, {"rating": 4.0, "review": "Be nice if the had a USB port that allowed you to connect an external drive, but I knew that upfront. It does have Home sharing thought ...", "verified": true, "helpfulness": "0/1", "author": "Laura Martin"}, {"rating": 5.0, "review": "Like the idea of being able to show people pictures  and video from my phone on my tv when we have a party !!!!", "verified": true, "helpfulness": "0/0", "author": "Mark T"}, {"rating": 4.0, "review": "This is my 2nd Apple TV device, and if they come out with a newer version, I will probably buy it too.  I am heavily invested in \"iDevices\" in my household - iPhones, iPads, and iTouch music players.  I have my iTunes library that controls all the devices tied to my main PC that is in the office of my house.  I use iTunes as my digital entertainment hub for all of my devices.  iTunes has all of our music, music videos, and digital movies (including digital copies that come with my blu-ray movies that I buy).  I was looking for a way to take all of that digital media and play it in the family room where the home theater is set up.  I chose the Apple TV device.This box is about 3\" x 3\" x1\" and is barely noticable.  Hookup is very simple - power cable, and HDMI cable to the receiver (or directly to TV).  Setting it up takes all of 10 minutes.  It can be connected to your network using a wired connection or wireless.  I use wireless in my house, so I had to set up the wireless on the Apple TV.  Once the Apple TV is connected to the internet, you will put your Apple ID and password in.  Everything you have purchased from Apple is now right there at your fingertips.  I also wanted to tie this device to my media collection that is stored on my PC in the office.  This requires you to turn on Apple's Home Sharing option.  Once you turn that on, the Apple TV will find your media library in iTunes, and make it available.There a few pre-seeded apps on the device (Netflix, HBO 2 Go, You Tube, etc.), plus access to all of the content you have in the Apple ecosystem.  Everything is simple to operate, the user interface is easy to understand, and if you have an HD TV, the quality of video is excellent.Again, I would recommend this to anyone that has a lot invested in Apple content and products.  Since this is a direct competitor to the Roku, Boxee, etc., the form factor of this is very similar to the others.  The only difference between these boxes is user interface and media options - for instance, a Roku box will not play anything you have controlled through Apple's iTunes, and vice versa.  Bottom line, this is made for people invested in Apple for their digital music, digital TV, and digital movies.  If you get your music from Amazon, use Prime Instant Movies, or buy music from Google play, this box will not work for you.  You will need to look at the Roku or other similar device.", "verified": true, "helpfulness": "1/1", "author": "Roux"}, {"rating": 5.0, "review": "We are now able to watch the games on MLB, movies, TV shows we've missed, and with the update, iTunes Radio and Disney are now available.  Love this!!", "verified": true, "helpfulness": "0/0", "author": "Deb Grosner"}, {"rating": 5.0, "review": "This AppleTV is a great step up from the original one (which I used to have until now). I've used this for about three months now, and it's just excellent. It hooks up to the TV via HDMI, and if you can get a mounting kit for it (about 15 bucks here on Amazon) it's not even visible as you can hide it behind the TV and the remote still works.1080p HD makes the image look great, and it hooks up to your wireless device to stream from either your computer or any online streaming service available (I use it primarily for Netflix regarding online streaming).Another use it has is streaming images and videos from your iPhone or iPad. You can set up slide shows using your images, show videos, or listen to audio from it. Everything is wireless- no cables required. You can also stream your Mac to the TV using airplay, also no cables!Even though the control is kind of clunky, it's small and gets the job done. If you have an iPhone or iPad, you can also control it using an app on these devices, which is actually extremely useful.I can't recommend this enough. Every house should have one on their main TV! And if you're a Mac user, it should be mandatory that you have one!", "verified": true, "helpfulness": "0/0", "author": "Rob Art \"bob\""}, {"rating": 5.0, "review": "Love this.  My toddler loves being able to watch movies that I have on my phone on the big tv...in addition, my husband and I love sharing videos/clips/sports with each other without having to pass the phone around.", "verified": true, "helpfulness": "0/0", "author": "Tammy"}, {"rating": 5.0, "review": "I bought this for the fact that it can mirror whatever is playing on my iPod or Mac laptop.  I have my old stereo hooked up to my tv so I can mirror Spotify music through the Apple TV onto the stereo.  It's a great option if your not interested in spending a ton of money on a new sound system.  I also mostly use the Apple TV for the YouTube and Netflix apps.  I've found that most of the other apps on it are useless to me.  Most of them require a subscription to use them.  I do enjoy the trailers app however as I don't have any TV reception where I live so it's nice to be able to see what movies are out.  It also will give you info on theater locations and show times which is nice.  As far as connecting it to your tv it's no problem.  Just plug the HDMI cable in to your tv port plus the power cable into an outlet and that's it.  You do have to also connect to your wifi network which shouldn't be a problem. It's a great little device especially if your already invested in other apple products.  If not then I've heard the Roku is better as far as content goes.", "verified": true, "helpfulness": "0/0", "author": "Darren"}, {"rating": 5.0, "review": "If you love AirPlay you love this one. Finally,  I can watch my EPIX channels right off the iPad to the big screen without even turning on of off the device.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "works as expected. Little slow on macbook. Works great with IPAD and IPHONE. Don't ask for more words when customers are taking time to review.", "verified": true, "helpfulness": "1/1", "author": "Daniel J Martin"}]