[{"rating": 5.0, "review": "It works nicely using airparrot for my older mac to stream to my monitor. Tho you probably don't need airparrot if you wanna stream movies/music because itunes can do the same thing.", "verified": true, "helpfulness": "0/0", "author": "Technocrat"}, {"rating": 5.0, "review": "Love the device-This is far better than other competing devices, I think. I have the Google ChromeCast too, but that does not do as much.For example, there are so many different podcasts and other forms of content available FOR FREE besides movies and TV shows.My 65 year old dad is enjoying his too. Easy setup, easy navigation.", "verified": true, "helpfulness": "0/0", "author": "Daniel Harrington \"Reading Teacher\""}, {"rating": 5.0, "review": "Easy to set-up, works great out of the box. Must sync device to pc, follow instructions or find tutorials on U-tube. Remote starts tube randomly....? Speeds seem fine for streaming online content. Haven't used Netflix or Zulu yet.", "verified": true, "helpfulness": "0/0", "author": "Planethog"}, {"rating": 3.0, "review": "The Apple TV works well enough, Airplay works alright though is overly complicated for my folks to use on a regular basis with their iPad 2 (it seems picky when using their apps, many of which are in Taiwanese). It's just a rather unspectacular device. Hulu and Netflix have terrible interfaces when compared to other versions of their software, there are no other non-iTunes stores that you can purchase movies from. And no Amazon unless you stream it through your iPad/iPhone.On the other hand, Airplay works well (though by no means flawlessly). iTunes has a very thorough store (though it too could use a facelift), and though added slowly, the Apple TV is getting some better channels finally. HBO Go here works on Comcast (*cough* Roku, wtf fellas *cough*).Recommendation: If you have a lot invested in iTunes or really want Screen Mirroring from your apple devices, get an Apple TV. Otherwise, there are better solutions out there.", "verified": true, "helpfulness": "1/2", "author": "Rich"}, {"rating": 5.0, "review": "We left our Roku behind and opted instead for the AppleTV.What we like:- Airplay, airplay, airplay- It downloads content pretty quickly, we have never had any slow network issues or Netflix buffering- The quality of the content playback is superb- Did I mention airplay?What we miss about our Roku:- I could install apps for the Roku, including custom apps that would stream content from a home serverIn summary, it's a great deal and has enabled us to rid our selves of the shackles of cable TV.", "verified": true, "helpfulness": "0/0", "author": "Joseph McBride"}, {"rating": 5.0, "review": "This is my second apple TV in the house. We also have a smart TV that makes access to other media services but the apple TV is better, faster for downloads and the quality of the download is superior", "verified": true, "helpfulness": "0/0", "author": "Francisco Cruz"}, {"rating": 5.0, "review": "Fast delivery, good product! I am really enjoying the Apple TV. I don't even need to have cable to watch my favorite shows!", "verified": true, "helpfulness": "0/0", "author": "Rose"}, {"rating": 5.0, "review": "Apple TV is streaming smoothly. Apps launch with lag and hi-def streaming looks amazing. I love the fact that it starts within a second of turning it on. The remote is minimal and portable.", "verified": true, "helpfulness": "0/0", "author": "baotoan86"}, {"rating": 5.0, "review": "I cannot say enough good things about this unit. I purchased form Target for $99 plus tax. I cut the cable cord some years ago. I was between purchasing a Royku and this Apple TV. I wrote this review because some of the reviewers stated that smart tv owners would not want this. As a smart and basic HDTV owner, I disagree. Also, I cannot speak to the movie sources, etc. because that is not my interest. What I like most is the Airplay feature on the ATV. I have access to content I want on my iPad via the Internet. Being able to Airplay, and not just mirror is worth the purchase. I have used a a digital media adapter on the ipad before but there is no comparison in resolution or presentation for the adapter vs ATV and the adapter will cost about a third of the price for the ATV and still not airplay. So if you are thinking of going the adapter route - probably not. Some complained about the remote. I rather like the little remote, and like that it has some flex in it. I can see that it might get lost in sofa cushions, etc. but I am pleased with it. The ATV was extremely easy to set up. Another point I should make is that I installed mine on a secondary older HDTV that must be about 8 years old or more. As it relates to the discussion of older TVs, this works perfectly. It is an LG and has one HDMI port - ahead of its time when I purchased it. I was concerned about mounting the ATV on the wall mounted tv. I discovered that the ATV does not have to be visible for the remote to sensor to it, so I was able to hide the ATV in the tv casing. So if you want to watch movies, etc. there are apps for that. I like that there is free international news and other free apps. But I mainly use use Airplay to play iPad content - plenty video podcasts - such as time shifted cable news, and other feature programs, as well as free tv internet/cable/tv channels. Of course, photos, notes, and anything else can be air played as well. It did take a while to learn how to move from one tv input to the other without loosing tv functionality- but that is not a problem now. If you are not apple invested, and if you are mainly interested in movies- you may want to also look at a Royku, but this was a best solution for my purposes. And that should probably be the deciding factor, - what do you need a set to do for you that you cannot already do? Hope this helps and was not too rambling.And about You Tube, just Airplay it.", "verified": false, "helpfulness": "0/0", "author": "FLShopper"}, {"rating": 4.0, "review": "Should only add the option to access your local downloaded files as well. Pelple should have the option of having other resources besides Apple to buy Media.", "verified": true, "helpfulness": "0/0", "author": "Luis Murano \"Heavy e-Shopper\""}]