[{"rating": 5.0, "review": "Not a bad choice for streaming anything to your TV. With the correct apps, you can even stream from your Android. I love it!Great choice self. Thanks self! *hug*", "verified": true, "helpfulness": "1/1", "author": "Henree Garcia \"HG\""}, {"rating": 5.0, "review": "I can't believe I didn't get one of these earlier! It's a great device that I'm getting a lot of usage out of.Not only can I use this to play or display anything from my computer, but I can also stream Netflix and even use the Airplay feature to stream Amazon Prime videos from my iPad, iPhone, iPod or Mac to my TV! It works quite well.It's built quite well and the little remote that it comes with is metal, you can tell some actual thought went into the design of this product.Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "T. TOM"}, {"rating": 5.0, "review": "I love my apple TV! I bought this because I had started watching netflix on my Xbox 360 and that was all fine and dandy until I went to college and stopped playing so many video games. Saves me money on Xbox live subscriptions!", "verified": true, "helpfulness": "0/0", "author": "Alec Sokso"}, {"rating": 5.0, "review": "Product is exactly as advertised. Great for Netflix or streaming anything from your laptop. Just wish it had NFL streaming and I wouldn't need my cable anymore.", "verified": true, "helpfulness": "0/0", "author": "Jared Abert"}, {"rating": 5.0, "review": "Such a powerful little gadget.  And there are more and more services offered.  Indispensable especially if you have other Apple products", "verified": true, "helpfulness": "0/0", "author": "Snowbird"}, {"rating": 5.0, "review": "Has worked well from day 1 - no problems.  I ended up hard-wiring mine with ethernet to improve signal and reduce buffering.  Probably all about your LAN as far as your preference.  Like most Apple products, works well, no real problems.", "verified": true, "helpfulness": "0/0", "author": "Jonathan S Mayer"}, {"rating": 5.0, "review": "Good Apple product, extremely easy to set up.  It's nice to have, I use it to watch movies, shows and it's really handy to watch any videos you take from your iPhones.  I video my son wrestling and we come home to watch it/review technique.", "verified": true, "helpfulness": "1/1", "author": "Randall Milleson"}, {"rating": 4.0, "review": "Much better than viewing from a PC screen.  Works great with and all my TVs (60\", 48\", 32\", etc)  Only downer is it control, especially initial set ups and initial logins to services, is best completed using a PC/Mac/iPad device.  The remote control works but keying in characters is difficult.  I liken it to texting using Morris code.", "verified": true, "helpfulness": "0/0", "author": "knowja \"knowja\""}, {"rating": 5.0, "review": "I absolutely love it, the best gadget I have bought in a long time.  Multiple uses but perfect for watching NETFLIX.", "verified": true, "helpfulness": "1/1", "author": "daniel.chapa"}, {"rating": 5.0, "review": "I find I must revise my rating of this product to be fair to it.  As you see below I was really frustrated but I couldn't believe that I should have the problems I was having since so many people gave it a 5 star rating and their reviews were expressing things I wanted with my Apple TV.  Well, I decide to go to the Settings-General-Reset and give it a try.  I did and much to my happy surprise it seems to be working without any buffering problems.  I was able to watch a show on PBS and a show on Netflix.  I'm going to try Airplay and keep my fingers crossed that it works.------------------------original---------------------I wasted $100.00 on this thing.  I was hoping to be able to Airplay from my iPad or Mac to the TV, well that doesn't happen.  What happens is every 10-15 seconds the thing stops to buffer another 10-15 seconds of viewing, you need a whole day to watch an hour show.  I'm blown away that this happens with an Apple product after all they aren't they suppose to be the \"best ?\".  I have Roku and I have no problems with buffering issues.  Save your money on this and get Roku instead and be happy not frustrated with Apple TV.", "verified": true, "helpfulness": "0/8", "author": "Jamie Reader \"Taking time to relax\""}]