[{"rating": 5.0, "review": "Perfect !!Apple products are always the best. I mainly use the airplay watching videos from my ipad on the TV.Setup was easy, no connection problems.Just felt, apple could have made the remote a little better.Must have if you have a lot of apple products already at home.", "verified": true, "helpfulness": "1/2", "author": "Praveen"}, {"rating": 5.0, "review": "I use Apple TV 3rd generation to watch contents in iTunes Store and iTunes at my Mac.You can use photostream at iPhone as a screen saver too.", "verified": true, "helpfulness": "0/0", "author": "Hyosuk"}, {"rating": 1.0, "review": "I have contacted apple about this because it is now useless to me. I would give it zero stars but I had to give it at least one to write a review. The product worked for one week before it pretty much went on the fritz. I do not want to have to return it to the seller because of the hefty fee involved. I am waiting on apple to send me the materials to send it back. They said they would send me a new one when I sent them the broken one. Thank God for the 90 day Apple complementary service on it. I feel like I should have just bought it direct from them so I could save myself the time of writing my review on Amazon. I am waiting for the shipping materials they said they would send me to package it up in order to return it to them. I figure it should arrive soon. Oh and by the way after spending over an hour on the phone the Apple rep told me he thought there was a \"hardware problem\" when he told me I would need to send it back.", "verified": true, "helpfulness": "1/14", "author": "TheConstantConsumer \"Art Love\""}, {"rating": 5.0, "review": "The iMatch (iTune) and airplay are two main features that I use for AppleTV.Able to push all my music to iMatch and listen from AppleTV is very convenient.I bought two more and sent them to Taiwan for my family to listen to my music,but iMatch/AppleTV does not allow it to cross the Pacific Ocean. This is not good!", "verified": true, "helpfulness": "0/0", "author": "Michael Chen"}, {"rating": 5.0, "review": "Amazing device at good price. 1080p works great and AirPlay is great too. If you have another iDevices, this is a good option for playing movies or videos from your iPhone, iPod or iPad to your HD screen. Mirroring works fantastic and it's very useful. There are some new \"AirPlay ready\" games and you can use your iDevice as game controller while you watch the game on your screen in a pretty decent quality.", "verified": true, "helpfulness": "0/0", "author": "likeluis"}, {"rating": 5.0, "review": "I have 5 of these, one on every TV.  For $99, this is the cleanest and easiest way to access your iTunes & iCloud content, use Airplay from your iPhone/iPad.Really slick, and affordable techno wizardry!", "verified": true, "helpfulness": "1/1", "author": "JLN"}, {"rating": 4.0, "review": "Very easy to set up.small delay at times but very responsive.Remote is the biggest draw back.if you have artheritis you wont be able to use the remote comfortably.remote is too small for ease of use.The circular old ipod looking buttons are hard to press.", "verified": true, "helpfulness": "1/2", "author": "Sam_Long Island"}, {"rating": 5.0, "review": "It started with my iphone, then the ipad, then the apple tv 3, and now my entire network is all apple with two extremes and 3 expresses (for airplay). I'm very proficient when it comes to networking and pc set up and was so tired of all the messing around with my netgear router that I just replaced it with the apple airport extreme - took about 10 seconds to set up, including port forwarding for my iomega ix2-200d NAS. I wish PC related components were so simple to hook up. Honestly, I can't believe I am raving about apple products but, well, I am. Who knew? The apple tv's ability to wirelessly display content from phones, ipads, itunes, etc is what I have been trying to do as a pc uiser for decades - use my \"stuff\" in a meaningful way. I have purchased 6 of these in the past two months to have in every room.", "verified": true, "helpfulness": "0/0", "author": "Vince Barrett"}, {"rating": 5.0, "review": "I can play everything streaming from my iPad beautifully on the tv screen. And while the alternative choice to this has more stations, the amount of Apps that can perfectly stream video onto your tv is endless. Netflix, HULU PLUS, NBC, ABC, TED TV, NBC NIGHTLY NEWS, and Video file, PBS, ESPN APP (THE BEST!). Either way if you own apple you NEED this for your HD tv. Cable will never be needed again!", "verified": true, "helpfulness": "1/1", "author": "TooTall"}, {"rating": 5.0, "review": "We love this product so much, we purchased a second one for our home. The integration of photos, music and movies (among other things) is so seamless and so easy! This will be a go-to-gift for all going forward.", "verified": true, "helpfulness": "0/0", "author": "S R"}]