[{"rating": 5.0, "review": "Received overnight, sets up easily, great performance,slick remote control, can hoop up iPhone and stream right from it. Typical apple product. Gotta love it", "verified": true, "helpfulness": "0/0", "author": "John Miller"}, {"rating": 5.0, "review": "its everything they said it would be. they are who we thought they were. i guess you can say....im as happy as a little girl.", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 4.0, "review": "I'm reviewing v.3... which is the same as v.2... but now with 1080p.If you see my review for v.2 you should disregard it as they've made significant improvements to the user interface.In short... I love my AppleTVs.  One in the living room and one in my bedroom.  You can \"mirror\" your Apple's Mac to ALL your connected AppelTVs, so if you're running a movie for a bunch of friends through your mac (like I have a few times) you can have some of them in the living room and some of them in the bedroom watching the same thing.Enough about my life... the product itself is very intuitive to use, the interface is simple and sleek, and allows for iCloud information to be passed to your ATV (bought music on iTunes but don't have iMatch? No problem. All your music that you bought through iTunes now shows up on your ATV and you can play your music to your hearts content). Bought a movie or TV show from iTunes? It plays it via streaming.  They used to only stream rented movies, but NOW you can play any movies or tv shows that you've fully purchased via iTunes.What it DOESN'T do is allow you to play any iTunes extras (the added features that some iTunes movies comes with).  You'll need to run them through your Mac and send the \"broadcast\" over to your AppleTV.I also love the fact that it pairs up nicely with my Logitech Harmony remote. As simple as the included remote for ATV is, I like everything to be controlled through ONE remote... ONE remote to rule them all... and Apple TV plays nicely in that respect.Why ATV vs. Roku? Quite simply.... simplicity.  My roommate has my old Roku box.  And what I didn't like about it is that there were a plethora of \"channels\" to choose from, however, most of them had the same content that I could find on the Apple TV box and those apps (Netflix movies and shows, HuluPlus movies and shows, rental items from iTunes, sports apps, etc). You have to wade through all their \"channels\" to see what they were about and how useful they are to you. I found a majority of the channels NOT useful to me... even less useful when I found out that you had to pay a subscription services for a majority of those channels. And so this is why my roommate ended up with my Roku box.  He don't care. He's happy to have something for free.", "verified": true, "helpfulness": "1/1", "author": "TicketMediaGuy"}, {"rating": 5.0, "review": "Fast Shipping and Easy Install. TV back in business after replacing blown out bulb. Takes a a minute for the screen to brighten but other than I am a satified customer. I am going on one week. Will update review from time to time with any changes.", "verified": true, "helpfulness": "0/0", "author": "jayjordan21"}, {"rating": 5.0, "review": "What can I say about this product, it's an Apple!!! A great addition to any TV. Enables you to watch great, current movies for $5.", "verified": true, "helpfulness": "0/0", "author": "Ronnie G. Miller"}, {"rating": 5.0, "review": "I am very happy with this product.  It shipped quickly, easy to set up and works great.  Glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Heather Fannin"}, {"rating": 5.0, "review": "Our Apple TV has been just as good as we anticipated it would be. We use it for everything from watching movies to tv shows to listening to music. I didn't realize the new version is so much smaller than the old one so that was a pleasant surprise. All around a great product. Amazon delivers again!", "verified": true, "helpfulness": "0/0", "author": "Sarah Marie Sibley \"Siblesandbits\""}, {"rating": 5.0, "review": "We love you Apple. Keep producing these wonderful gadgets. Life is much more interesting with technology and Apple is the company for it.", "verified": true, "helpfulness": "0/0", "author": "Amjed Shacker"}, {"rating": 4.0, "review": "Now I have all in one access to my netflix, hulu plus, iphone music library etc etc. It doesnt stream video from devices very well for some reason but for everything else its great. Plus I can use my iphone as a remote! Sweet!", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "Works perfectly fine, easy installation, you can play any file (music, video and pictures) in your TV, moreover, you can access youtube and other things like (flicker, Vimeo, Trailers, etc...).Syncing the files to be displayed on TV can be done via the wireless network or wired, I have tested playing HD movies via wireless network without a problem.It is recommended to download the FREE (remote) application available from Apple for your Iphone or Ipad to easily control the device and type faster for YOUTUBE search instead of using the provided remote control.Browsing pictures is super fast, there is no lag what so ever, I was surprised to see that even though my pictures are larger than normal Ipad or Iphone pictures, also there is a cool slide show and screen saver.Notes:- You need to buy an HDMI cable it is not included with this product, many available in AMAZON and can be available for less than $10- The item I have received is supporting (100-240V & 50-60Hz), I think some customers outside US might be interested in that, I have also uploaded a photo with such details.", "verified": true, "helpfulness": "15/15", "author": "Rashid \"Rashid\""}]