[{"rating": 5.0, "review": "This is a great device if you own pretty much all apple products. I love streaming videos from my iphone to my tv. I also like the fact that my photos from my phone display easily on the tv and it has Netflix and HBO go.", "verified": true, "helpfulness": "0/0", "author": "Sarah B"}, {"rating": 3.0, "review": "When I use Airplay to put my Macbook Air's screen on my TV, the audio doesn't come through. I did everything I could think of and went to Apple's support forums and learned this is a common problem ever since Apple's latest software update.For now, the only work around is unplug the power cord from the AppleTV and let it do a \"hard\" reboot, and to reboot my Macbook Air... then they will play nicely together for a session.When you think about it, AppleTV's OS, OSX Mavericks, iOS7 and iWork all have problems right now. Apple's software doesn't seem to be keeping pace quality-wise with its hardware these days.", "verified": true, "helpfulness": "0/1", "author": "Tom L. Pittman"}, {"rating": 5.0, "review": "I love using this Apple TV. I only use it to mirror my MacBook Pro to my TV. Only complaint is I wish they have Amazon Instant Video on it.", "verified": true, "helpfulness": "0/0", "author": "A-Tan"}, {"rating": 5.0, "review": "Bought this as a gift.  They love it as they have now replaced all their older devices with Apple products.  Great for pictures, music, and watching streamed shows and movies", "verified": true, "helpfulness": "0/0", "author": "BestBillsFan"}, {"rating": 1.0, "review": "If you eat, sleep, and breathe Apple then this device is probably STILL not for you.So! If you like your ultraviolet collections that were redeemable through Vudu/Flixster, don't expect any app for them any time soon.And! If you like watching Netflix, don't expect for it to have its latest updates which make Netflix as convenient as it is. expect to manually play every episode, THERE IS NO 'AUTOMATICALLY PLAY NEXT EPISODE' FEATURE!AND! If you just so happen to not have wifi, don't expect your device to operate... AT ALL. Even with a USB hard drive attached for local media./cry.", "verified": false, "helpfulness": "2/6", "author": "Paul"}, {"rating": 5.0, "review": "This was an item on my son's wish list for Christmas.  He likes it very much. He's happy, I'm happy.", "verified": true, "helpfulness": "0/0", "author": "Vicki Beckley"}, {"rating": 5.0, "review": "Having been apart of the Apple ecosystem for awhile, this was an amazing complement to the tribe. It's a fantastic device for getting that content to the big screen and also plays very well for my iDevices.However, in the year of 2014, after a few years not seeing real updates to both hardware and software, there are a couple of aspects left wanting.", "verified": true, "helpfulness": "0/0", "author": "D. Griffin"}, {"rating": 5.0, "review": "So easy to install. Up and running in no time. Great for Netflix. Easy interface and availability of programming. Super easy to use with iPhone and MacBook.", "verified": true, "helpfulness": "0/0", "author": "D. M. OHalloran"}, {"rating": 5.0, "review": "This is my first AppleTV and I love it! No complaints, everything works great as it should. And of course it's Apple-Easy To Use as usual!", "verified": true, "helpfulness": "0/0", "author": "Sterling Waters"}, {"rating": 5.0, "review": "Fun to play with! Easy to install, real HD quality. Works great with my iPhone iPad. Wish there were more HD channels.", "verified": true, "helpfulness": "0/0", "author": "iluvpugz"}]