[{"rating": 5.0, "review": "I love my Apple TV. Got one in every room. Even my grandkids love it. They use it in the guest room with their iPads when they play multy palyer games.", "verified": true, "helpfulness": "0/0", "author": "Efrain Yepes"}, {"rating": 5.0, "review": "I bought the Apple TV because I wanted to play all my video and music on my tv I wasn't disappointed. I can play my videos on my iPod touch and push play on Apple TV.  I will definitely recommend this to my friends.", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 4.0, "review": "Image is clear, small and great!If the standard keyboard and mouse the better!Best to be cheaper!Why write so many words ?", "verified": true, "helpfulness": "0/1", "author": "lewis_yu"}, {"rating": 5.0, "review": "If you haven't gotten one of these, you should!  This is my second one.  One for the bedroom and one for the living room.Apple products, my iPhones and my iPad along with my computer can all connect together wireless and with ease...and this one's with 1080P!", "verified": true, "helpfulness": "2/2", "author": "Louis \"LNADO\""}, {"rating": 5.0, "review": "Who still buys at Apple Online Store????For 10 bucks less, you get the same, faster!Must have for Apple Macbook users!", "verified": true, "helpfulness": "0/0", "author": "Marcus Lontra"}, {"rating": 5.0, "review": "I have apple everything theirs no comparison ,the only problem I have with apple tv is you should be able to load iTunes gift cards like you can on other devices so you can rent or buy movies instead of having to use your credit card.", "verified": true, "helpfulness": "0/1", "author": "Todd Workman"}, {"rating": 5.0, "review": "My daughter Is just 5 and she knows how to handle Apple Tv. It's an incredible gadget for our tv, it's portable and we take it with us everywhere.", "verified": true, "helpfulness": "0/1", "author": "Monnyka Fuertes \"Monnyka\""}, {"rating": 1.0, "review": "After spending over 40 hours working through various potential resolutions and trying to speak to Apple support... I am still unable to get the Apple TV to synch w iTunes on my PC... After much frustration I purchased a new Roku and was able to communicate with my PC within 5 minutes... The Apple company should be ashamed of this product.", "verified": true, "helpfulness": "0/6", "author": "JohnInBelmont"}, {"rating": 4.0, "review": "I really just bought this to link my iPad and our iPhones to my old Bose system to play music.  AirPlay function works excellent for that purpose.  For $100 I think this is worth it for that purpose alone.  Can link to computer to play music from iTunes, and also can upload purchased music into Apple TV to play directly.  You can mirror iPad or iPhone 4S+ to view on TV, decent feature except that iPad doesn't have 16:9 aspect ratio so part of your tv screen doesn't get utilized. Content of Apple TV was unimpressive for me, but I already had most of those features on my Bluray player anyway.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "I use my apple tv everyday. I watch netflix all the time. Also, that you can use your Ipad and display your images on the tv. Slides shows and more.", "verified": true, "helpfulness": "1/1", "author": "Graphx"}]