[{"rating": 5.0, "review": "Best TV companion, has all the popular services and more plus you can share videos from you PC or MAC.  With support for Airplay you can broadcast to one or more Apple TV equipped TVs at the same time. I have one on every TV.", "verified": true, "helpfulness": "1/1", "author": "Randall G. Rich"}, {"rating": 5.0, "review": "Apple TV always works accordingly, did not like the fact that the remote died fast and need it replaced. Good product though.", "verified": true, "helpfulness": "0/0", "author": "Allen A Anderson II"}, {"rating": 5.0, "review": "How have I gone this long without Apple TV? It's so wonderful. We have one for the spare bedroom/library and it's great for Netflix and Hulu. PLUS, I absolutely adore the whole remote-on-the-phone feature. It's also really easy to set up so if I want to switch rooms I can easily move the device. To be honest, I'll probably end up buying myself a second and another as a gift for my parents.", "verified": false, "helpfulness": "2/2", "author": "Allison \"The Book Wheel\""}, {"rating": 4.0, "review": "Typical Apple device - does what it was designed to do very well, but (so far) this generation is hack-proof so you can't modify the software to add capability to it (like Plex). If you've got an iPhone or iPad and want to share that screen on your TV, this is the (only easy) way to do it. Otherwise Roku can do everything this can do cheaper and easier, and can also do a lot more.There's a reason the previous generation devices sell for more than $100 more than this generation on EBay - you can hack them and modify the software. I just wish someone would find a way to do that to this device. Apple just doesn't want you to be able to modify anything they sell. It makes tech support easy, but limits the capabilities of their devices.", "verified": true, "helpfulness": "1/1", "author": "Guerry"}, {"rating": 3.0, "review": "I bought this because I want to display my slingbox feed on a \"regular\" TV - not just an iPad or a computer.  It appeared to be one of the \"connected\" devices on the slingbox website that would support that application, and I chose it because I like Apple products for their quality.  It doesn't, however, do what I want, at least not without an iPhone or and iPad 2, which I do not own.  It can apparently stream video from an iPhone or an iPad 2 running the Slingbox ap, but it doesn't have a native ap or a browser that would let me access the slingbox URL directly.  I also bought a $35 Chromecast, and it does the job well enough, from a Chrome browser (on my old macbook, for example).The Apple TV is a nice enough product, but it doesn't do anything I couldn't already do with my Toshiba blu-ray player.  It can stream Netflix apparently (something I can do on my blu-ray player).  I am especially disappointed that it doesn't have an ap for streaming Amazon videos (please someone correct me if I'm wrong).  The lesson here is of course that I should spend more than 45 seconds researching products before I buy them online, but who has time for that?", "verified": true, "helpfulness": "0/1", "author": "Thomas B. Gross"}, {"rating": 5.0, "review": "I bought this for business presentations and travel. I highly recommend it for that if you own any apple device or install air parrot.", "verified": true, "helpfulness": "0/0", "author": "doobedoo"}, {"rating": 4.0, "review": "It's easy to install, plug-and-play abilities make this a great device to start enjoying out of the box. It's very easy to set up and works perfectly. The only issue with the installation is it's HDMI capable only, so if you don't have an extra one, be sure to get one to go with it.It lacks a few apps, most notable being Amazon Instant, although there is a workaround for the iPad and iPhone but if you use other Apple products it works seamlessly with all of those other devices, sharing your iTunes music, iCloud photos (essentially turns your TV into a large digital picture frame), and iCloud video directly to your television. The Airplay Mirroring feature, which broadcasts your computer screen, or video on your computer, directly to the TV is a good feature, although we experience some lag from time to time when we use it. I can't tell if it's an issue with the Mirroring or an issue with our WiFi network. We don't use this feature often but it's worked best for showing a large audience a YouTube video or something of the sort.Overall, we're very satisfied and would purchase again or as a gift.", "verified": false, "helpfulness": "0/0", "author": "B. Moore"}, {"rating": 5.0, "review": "Love it, use it almost daily.  As a result we are seriously considering \"cutting the cable\".  I especially like the new OS that allows me to mirror anything I'm watching on my computer (not only movies, but web surfing windows also) straight to my 56\" TV with the click on one button. I think I'm on my third gen Apple TV and I've gotten most of my family members to get one also.", "verified": true, "helpfulness": "1/1", "author": "Woodman49"}, {"rating": 4.0, "review": "as all apple products it is a little over priced. Bought it for the a friend overseas, no other choice if you want to wirelessly watch your ipad on the TV.", "verified": true, "helpfulness": "0/0", "author": "M. Hsu \"Save more money!\""}, {"rating": 5.0, "review": "I love this!!!! Works awesome in Europe!!!!! Was simple to set up and works amazing! Definitely would recommend to others!", "verified": true, "helpfulness": "0/0", "author": "Crate of Rummage"}]