[{"rating": 4.0, "review": "Easy to install and use. Wish they would separate the \"have subscription or free\" icons from those you don't have subscriptions for. I use it mainly for Netflix access.", "verified": true, "helpfulness": "0/1", "author": "Christopher C Schaefer"}, {"rating": 5.0, "review": "Works great, fast shipping, thanks", "verified": true, "helpfulness": "0/1", "author": "Trudy"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/1", "author": "Miguel A. Rosa"}, {"rating": 5.0, "review": "Love this thing! I ordered it for HBO now and love it... Never knew it had so much content.", "verified": true, "helpfulness": "0/1", "author": "Raul Saldana \"raul\""}, {"rating": 5.0, "review": "We have completely \"disabled the cable\" and no longer subscribe to TV.  We use netflix and hulu and \"buy\" current seasons of a few shows from iTunes. Used to have 10 movie channels I didn't watch.  Now we preview movies and if we like them we buy them.  Also great to have internet radio on and playing through the tv system. We also have linked our photo library and let the slide show run randomly while listening to music or just vegging on the couch. People always comment how cool that is.We have 3 apple TVs in the house, are saving a ton of money compared to cable, ADSL or satellite tv.  Not looking back at all.  The only thing missing is live sports but I gotta believe that's gonna happen someday. In the meantime that's my excuse to go to B-dub and get some wings...", "verified": true, "helpfulness": "0/0", "author": "Ex-Calif"}, {"rating": 4.0, "review": "Works well.  Easy to assemble.", "verified": true, "helpfulness": "0/1", "author": "RK"}, {"rating": 5.0, "review": "apple does it again.  youtube, airplay, and constantly channels being added.  love love apple.", "verified": true, "helpfulness": "0/1", "author": "Stephen"}, {"rating": 5.0, "review": "Works great.  Plug in and play", "verified": true, "helpfulness": "0/1", "author": "WGV Chas \"Chas\""}, {"rating": 3.0, "review": "Got package in good condition but remot is not working", "verified": true, "helpfulness": "0/1", "author": "sumitra"}, {"rating": 5.0, "review": "love our Apple TV and this price on Amazon is an amazing deal!", "verified": true, "helpfulness": "0/1", "author": "Brittney Castanon"}]