[{"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "Dolores"}, {"rating": 5.0, "review": "As a self confessed apple fan boy, I don't know that I can say anything negative about the Apple TV. But then again, it being the 3rd Apple TV in my household, I can say I am well within the limits of my satisfaction.You will not get as much content as say with the Roku but what you lack in content you make up for in Airplay.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "GOOD VALUE QUICK SHIPPING", "verified": true, "helpfulness": "0/0", "author": "Dbird"}, {"rating": 5.0, "review": "Just buy it.  Totally worth it.  Seriously, stop thinking about it and reading these reviews.  Click \"Buy Now\"", "verified": true, "helpfulness": "0/0", "author": "Alison \"DnA\""}, {"rating": 5.0, "review": "Simple, easy to use, and a great price.", "verified": true, "helpfulness": "0/0", "author": "Thomas Allen"}, {"rating": 2.0, "review": "not really ,have to purchase too much .Mostly ,netflix is more difficult on apple than right off the computer.", "verified": true, "helpfulness": "0/0", "author": "michael turner"}, {"rating": 3.0, "review": "Nice product, but would be better if apple let users install third party applications on them, or offer the opportunity as with iphone/ipad/ipod to install additional applications according to user desires via itunes.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Peterssen"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Roberto Rivera"}, {"rating": 5.0, "review": "Fave this item to our grandson who uses when mommy wants to watch another show", "verified": true, "helpfulness": "0/0", "author": "Laurawho"}, {"rating": 3.0, "review": "It's just ok.  They need to add a reset switch to it.  Airplay doesn't work many times, plus the thing locks up a lot.  Have to unplug power cord to reboot.  Many times when you rent a move, it will stop playing and say you need to download it which could take 24 hours.. Yikes!I expect better from apple.", "verified": true, "helpfulness": "0/0", "author": "Melmark98 \"Melmark98\""}]