[{"rating": 4.0, "review": "About me, I'm a tech guy with 30 years experience. Over the past 2 years I have heavily invested in the Apple Eco System. I have IPods, an iPad 2, a 2012 Mac Mini, and now Apple TV (newest version). It's been well stated that there is not a lot available for content outside of the Apple Eco System as compared to Roku, for example.I've hardwired the ethernet connection to my router from the Apple TV, as suggested, to avoid overloading my wireless capability at home.I'm running the latest version of the OS on the Apple TV, Mirroring my Mountain Lion and Ipad screens is very handy.I've updated my review and added a 4th star because the 'wired ethernet causing content load failure' issue has been addressed. The device needs to have more content available and have it available from the Itunes store. That's the only drawback at this point that I see, and it costs 1 star...I have seen one 'bug' in the current version of the software. Loading select Vimeo content caused an error message stating that the content wouldn't load because my TV didn't support the 'HDMC' protocol (an encryption protocol used by newer HDMI devices). Recommended fix was replugging my Apple TV into the TV. That didn't work. Cold booting the Apple TV did fix the issue.As others have stated, this is a no brainer if you already have Apple products, especially newer ones. If you don't have Apple products, then unfortunately at this time, I could not recommend this product to you, it simply wouldn't have the value per the cost to you... That's the bottom line.", "verified": false, "helpfulness": "0/0", "author": "Taylor Walker"}, {"rating": 2.0, "review": "I bought this apple tv awhile back and I was planning to take it back but the 15 days return policy passed. So I got stuck with it. The good things are that it streams really well and is pretty simple to use. The bad side is that it has way to little of choices for streaming compared to Roku. No appstore, no adding stations, way too controled and limited. The airplay seemed like a good idea but in reality Ive got other things to do with my computer besides streaming movies. My kids like to watch programs from some other sites that apple tv does not support. I like to use my computer for other things. I thought airplay mirroring would be really great but it is not very smooth many times. There are so many glitches while air playing through my macbook. Sound problems and video quality have been issues. I cant really recommend apple tv right now. Apple offers limited channels its super limited. Roku offers i believe around 750 channels.  When you turn on your apple tv youll see movies, tv shows, music, dedicated to guess who, yep Apple to buy or rent movies or tv shows of which you can find many on netflix or Hulu with your membership. The hulu plus on the apple tv does not give you all the content you get on your computer. I don't know why, thats even more limited. Amazon prime is not supported along with others. I wish I would have thought sooner. I suggest going with Roku or another streamer at least until apple gets a better selection. Apple makes great products but this particular one is lacking pretty big in available content and as I said earlier the mirroring features with airplay have not worked very well. Consider very well before you invest in apple tv.", "verified": false, "helpfulness": "0/0", "author": "jason"}, {"rating": 5.0, "review": "I bought the Apple TV a little over a year to round out my home entertainment system.  I had previously purchased a Roku and was frustrated beyond belief. Unless my technological savvy partner was available, I was dead in the water with Roku.The Apple TV is clean design, intuitive and has added a new dimension to my viewing. I watch many movies - free if possible, and the Apple TV opens lots of options.", "verified": false, "helpfulness": "0/0", "author": "rhody86 \"Sally Chaffin\""}, {"rating": 5.0, "review": "Using this all the time now.  Getting rid of our cable DVRs and just using this.  Both kids took to college for easy access to Hulu etc.  Doesn't have Pandora naturally but everything else we use.", "verified": true, "helpfulness": "0/0", "author": "DEWDENVER \"DEW\""}, {"rating": 5.0, "review": "Works great with all my Apple products.  Apple has continued to update he software, which Apple excels at.  I also own a Roku, and I now prefer the AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Todd Mittness"}, {"rating": 5.0, "review": "Great Product!Fulfilled with your propose and surprised about your connectivity with apple devices.No more words to say about that.", "verified": true, "helpfulness": "0/0", "author": "Jorge Maciel A. Dias \"Jorge\""}, {"rating": 4.0, "review": "The AppleTV offers a beautiful, easy-to-operate streaming experience that's likely to be far better then your Smart TV's built-in options. The unit is as reliable, fast and trouble-free as you might expect from Apple. The AirPlay streaming feature with other apple devices is especially fun and useful.My only complaints are related to the lack flexibility; it is not possible to add streaming services that Apple has not yet partnered with and not possible to remove the streaming apps that you may not use. Pandora Internet radio is notably absent.", "verified": false, "helpfulness": "0/0", "author": "Rhett Waldock \"RW\""}, {"rating": 5.0, "review": "This is the greatest addition to my entertainment center.  We use it more than cable by a long shot, between HuluPlus and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Harold S"}, {"rating": 3.0, "review": "It's an Apple TV -- like most Apple stuff, it works great. Very fast menus, loads content fast, easy to use, etc. BUT -- there is no analog audio. Only optical digital. I don't know why they didn't put a combo jack on this like on the Airport Express. So stupid. Not everyone has surround sound digital audio systems these days. I had to buy an external DAC -- costing another $35 when Apple could have just added an analog jack to the Apple TV for $2. There's no good reason to leave this out, it's just annoying.", "verified": false, "helpfulness": "0/0", "author": "B. Garland"}, {"rating": 1.0, "review": "Just recieved this with high hopes and IT DOES NOT WORK!!!!!!!!!!!!!!!!!!!!!!!!!!! After an hour of trying to set it up the dumb thing tells me it needs an update? When im thinking why does a brand new item need an update? And then the thing shuts down and is stuck on a stupid apple logo with a picture of a usb cable that they didnt give me!!!!!!!!!!! Dont buy this save your time  cause you will be returning it", "verified": true, "helpfulness": "0/5", "author": "Carolyn_L"}]