[{"rating": 4.0, "review": "Works Great .All that I expected. May just cancel my cable because of all the features it offers .Would recommend for anyone.", "verified": true, "helpfulness": "0/0", "author": "Andrew Kaman"}, {"rating": 4.0, "review": "The physical hardware is great, but the software leaves some things lacking.  I wish there was an included browser.  That would make it handy for things that don't have an app yet for the Apple TV (Pandora, Spotify, etc.).  I have locked mine up multiple times when I have left something paused for long periods of time (like overnight).", "verified": true, "helpfulness": "0/0", "author": "N. Sarakas"}, {"rating": 5.0, "review": "Love it! Fast shipping, we use it all the time to watch Netflix. I would order again for another room. You should get this product.", "verified": true, "helpfulness": "0/0", "author": "CHRISTINA L THOMAS"}, {"rating": 5.0, "review": "Easy to install, easy to use. We have one in our den & bedroom sowe can watch both places-No more DVD rentals, It has radio stations from all over the world,sports channels, hulu, iTunes and netflix...You can watch House of Cards!!!!", "verified": true, "helpfulness": "0/0", "author": "Harvest Moon, LLC"}, {"rating": 5.0, "review": "i love my apple tv ! i just wish i could play Pandora with it ... but idk if thats possible haha", "verified": true, "helpfulness": "0/0", "author": "Tatiana Lampat"}, {"rating": 2.0, "review": "I am running 18 mbs internet speed and still have constant issues with \"cannot connect to itunes store\", takes forever to load previews. I do not have issues like this at all with the 2 chromecasts I own. But, based on the overall reviews, there appear to be many that love this thing. I hate it!", "verified": false, "helpfulness": "2/2", "author": "DJO"}, {"rating": 5.0, "review": "Easy to set up, easy to use. Looks sharp. I mainly purchased this to steam directly from my iPhone and iPad which works great.", "verified": true, "helpfulness": "1/1", "author": "Brian Daniel Miars"}, {"rating": 5.0, "review": "This is my second Apple TV. The home sharing feature as well as the iphone mirroring features are my favorite.", "verified": true, "helpfulness": "0/0", "author": "L. McKenzie"}, {"rating": 5.0, "review": "This little gismo changed our viewing habits!  It is great, easy to install and amazing!  We even took it on vacation with us andused it on the cable tv in our rental.", "verified": true, "helpfulness": "0/0", "author": "mary leary"}, {"rating": 5.0, "review": "Like any Apple product, reliable and awesome.. It's easy to use, makes your pictures come to life.. Links your movies, personal videos, netflix, hulu + and any other popular subscription to your tv..", "verified": true, "helpfulness": "0/0", "author": "Robbie Paskill"}]