[{"rating": 5.0, "review": "Love the apple tv. Works great with my iphone! I am a huge apple lover and love how simple it is.", "verified": true, "helpfulness": "0/0", "author": "Maggie V"}, {"rating": 4.0, "review": "At first I was worried about buying Apple TV because its online descriptions and its paperwork did not indicate that it could do what I wanted it to do: mirror what was on a iPad screen. However, I talked with other people who have Apple TV and received assurances that it would mirror. I have been really happy with it. The only trouble is that, when mirroring, it sometimes stalls or gets out of sync with the images on the iPad -- not often, though.", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 5.0, "review": "Works like a charm. We use it to play music for our toddler and it streams pictures from our photo stream! She loves seeing all the pictures!", "verified": true, "helpfulness": "0/1", "author": "Julia A. Denton"}, {"rating": 5.0, "review": "Saved $10 vs. Best Buy... This works amazing & bonus, you don't have to have cable! We already have two in the house and love the capability to control the televisions with our Mac products! Buy early and buy often!", "verified": true, "helpfulness": "0/1", "author": "JSMiller"}, {"rating": 5.0, "review": "Wanted to connect my flatscreen to the internet and do it in style.Looks good and performs good. You can't go wrong with Apple.", "verified": true, "helpfulness": "1/2", "author": "Gudjon Mar Halldorsson"}, {"rating": 4.0, "review": "Really love the endless availability of TV shows, movies and music. Would have given 5 stars if it wasn't for having to pay for each show but there is the option to use the hulu plus or netflix feature for only 7.99 a month. The airplay mode using apple products with ios7 works great. You can throw anything you have stored on your iphone or iPad up onto your TV.", "verified": true, "helpfulness": "1/1", "author": "KT"}, {"rating": 5.0, "review": "What an incredible piece of technology. Unfortunately, my macbook pro is too old to airplay to my tv from Apple tv but Apple tv is great for netflix, espn, vevo, movies, etc.", "verified": true, "helpfulness": "1/2", "author": "Tyler"}, {"rating": 5.0, "review": "Like other Apple products it performs as advertised. Little to no setup its ready to go out of the box and it does everything from your personal stuff to the commercial stuff. If you have other Apple devices get this.", "verified": true, "helpfulness": "1/1", "author": "Enigmaview"}, {"rating": 5.0, "review": "I've purchased three Apple TVs over the past few years & have loved them all. I've given one to my parents & one to my sister none who are tech savvy, but they love how easy it is to use. To be fair I own a Ruko & Netgear Net-Neo as well and have found myself using the Apple over the other two. It's simple, no useless buttons and pretty much idiot proof for me :) The best feature in my opinion is the ability to add your own movies, tv shows and music to box. I've added home movies, purchased DVDs and lots of other stuff I can't add to the other streaming boxes. Plus I love using my iPhone, iPad or iPod to stream music, videos or whatever so easily. The pictures comes out clear, the sound crystal and no hiccups in the streaming. Also with the Apple TV you have the ability to block certain content if from nosy ankle bitters or Tweens. It's a fantastic way to gather the whole family for movie night without the hassle of driving to Redbox or a video store. Yes, the rentals are a bit higher, but you save time, milage and gas by simply staying at home.Now with the new update Apple offers more channels than ever. Channels I actually like & will watch. Disney, The Weather Channel, Sky News, HBO Go, Smithsonian, You Tube, and more. I cut the cable cord and honestly can't say I miss it. The monthly subscriptions to Netflix & Hulu Plus cost me less than twenty dollars a month. My dishnet work bill ran about 150 a month. Granted I can't watch new TV episodes until the next day, but really it's not a huge deal. If you're torn between streaming box sets it all comes down to this : Are you a Pro Apple person? If so get Apple TV. If not Ruko might be the best choice for you. Ruko allows you to stream movies from Amazon Prime, but you have to pay the 79 a year for the privilege. As for as streaming movies from your computer to the Ruko I haven't tried it so I don't know if it's possible.All in all I can honestly say Apple TV is my first choice when it comes to streaming TV.", "verified": false, "helpfulness": "1/1", "author": "Rilee James \"Rilee\""}, {"rating": 5.0, "review": "I have to say, sadly, the Apple TV changed my life. Definitely opened up worlds of new viewing possibilities (Netflix, Smithsonian, etc).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]