[{"rating": 5.0, "review": "Love it.  We have two in our home and use them constantly.", "verified": true, "helpfulness": "0/1", "author": "Guy J."}, {"rating": 5.0, "review": "Been waiting to buy an Apple TV and it works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Banana Bread"}, {"rating": 5.0, "review": "My son loves it", "verified": true, "helpfulness": "0/1", "author": "Lisa Brambilla"}, {"rating": 5.0, "review": "It just works. After some bad experiences with other streaming devices having flakey apps or network connectivity, I can't say enough good things about the Apple TV. True to Apple form, it just works. Take it out of the box, hook up two cables, spend 5 minutes doing some basic setup (WiFi password, etc), and boom. Netflix works beautifully, using it to watch YouTube videos is a dream, the Weather Channel app is excellent. Sky News works well. All in all, the Apple TV is what I'd recommend if you want a -simple- media box.", "verified": true, "helpfulness": "0/0", "author": "Lucas Moore \"Turq!\""}, {"rating": 4.0, "review": "Love Apple TV especially the AirPlay feature.", "verified": true, "helpfulness": "0/1", "author": "gigm0302 \"gigman\""}, {"rating": 5.0, "review": "Love my Apple TV", "verified": true, "helpfulness": "0/1", "author": "robert jacobs"}, {"rating": 5.0, "review": "Fantastic product, I love it already! Set up was quick and easy- but maybe not as quick as I fell in love with it. Wonderful machine that lets me do everything!", "verified": true, "helpfulness": "0/1", "author": "Michael Beasley \"MCBeaz\""}, {"rating": 5.0, "review": "Apple TV is the best!", "verified": true, "helpfulness": "0/1", "author": "Jeanie M. Nulph \"jlark5\""}, {"rating": 3.0, "review": "I would give this four or five stars if it was a slightly more convenient .. Every single channel on the device requires you to sign-in to your provider account on a weekly basis!!! It's absolutely absurd! I constantly have to go to a computer to verify an activation code.  It defeats the whole purpose of having the apple tv! I don't want to access my computer constantly, I would like to watch shows on the device and forget about the computer.For this reason, we are contemplating switching back to cable.. At least you have instant access to the channels you pay for and I guess we can use the apple tv for... Netflix?", "verified": true, "helpfulness": "2/2", "author": "Gomes Fam"}, {"rating": 5.0, "review": "This works great to stream from my machines to my tvs.  Just added 5th one. Still it lacks browser, apps, and wish it had Amazon prime on it.", "verified": true, "helpfulness": "0/1", "author": "Priority IT"}]