[{"rating": 5.0, "review": "NICE", "verified": true, "helpfulness": "0/0", "author": "Christian Vargas Thomas"}, {"rating": 5.0, "review": "Love it! Been wanting Apple TV for a long time. Just keep in mind, a fast internet connection is recommended.", "verified": true, "helpfulness": "0/0", "author": "rockin-bandit714"}, {"rating": 5.0, "review": "Love it! Works great! Offers more apps and channels than my Smart TV does on its own.", "verified": true, "helpfulness": "1/1", "author": "Shadi S Eskaf"}, {"rating": 4.0, "review": "This was used as a gift. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "J. Lloyd"}, {"rating": 5.0, "review": "Even in the age of Smart TVs, BluRay Players, and other Set Top Boxes, this one wins out. I could go on about its features and usefulness, but it has all been said. Apple simplicity and quality at its finest.", "verified": true, "helpfulness": "0/0", "author": "R. Smith"}, {"rating": 5.0, "review": "My brother loves it", "verified": true, "helpfulness": "0/0", "author": "Annie3kid3"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "eddi"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Holly"}, {"rating": 5.0, "review": "perfect product, delivery was quick. made a daughter very happy.  Thank you", "verified": true, "helpfulness": "0/0", "author": "George Garriott"}, {"rating": 2.0, "review": "I honestly feel that this is a quality product, however it does not allow access to the broad array of channels that I was expecting. Beware of this device, you should know that it is not an across the board streaming device, more of an amped up version of an HDMI cord with NETFLIX and HULU access (I can go on my comp. or PS4, and access either of these services). At this point in time it does not offer access to HBO or ESPN on demand without cable tv access (i.e. through DirecTV, ATT, Brighthouse, etc.), nor does it allow you to easily stream prior purchases from the iTunes store without a great deal of effort. Stay away from this device if you are looking for a cable replacement, as this will not suit your needs.", "verified": true, "helpfulness": "2/3", "author": "Thomas Niemeier"}]