[{"rating": 4.0, "review": "So glad I bought this! Overall, no big complaints. The only reason I give it a 4 is because of the lack of apps (compared to a Roku or something of that nature) Hopefully a new update comes that makes the Amazon Prime videos easier to access. I can watch them on the Apple TV if I mirror my MacBook, which is just a little of a pain.Overall, it works seamlessly with all your Apple products and any iTunes purchases. When you scroll, it is quick and smooth and I am definitely a huge fan already.", "verified": true, "helpfulness": "1/1", "author": "Ren"}, {"rating": 4.0, "review": "I LOVE my apple TV.  The only complaint I have is that it doesn't have browsing capabilities.  Would recommend for the i-tunes, movies, and netflix.", "verified": true, "helpfulness": "1/1", "author": "Jena Thompson"}, {"rating": 5.0, "review": "With a house filled with Apple devices, I figured it was time to get this one too. I like the forum and function and am able to watch a large variety of visual media from my iTunes movie collection to YouTube videos.", "verified": true, "helpfulness": "1/1", "author": "Dennis Tennant \"dtshooter\""}, {"rating": 5.0, "review": "What can I say, when we decided to to finally part with Cable TV our daughter and son in law both said they thought we would really like Apple TV.  I didn't understand what they were saying.  All I can say is I wish we had simply purchased two Apple TV units and left it at that.  The usability, convenience, and compatibility with what we already were using around the house has been amazing.  In particular nearly any video whatever it is alway gives us an option to view them on Apple TV which is great,  Much easier to view something on a TV than an iPhone.  We like the Apple TV unit so much that we are thinking of getting an Apple TV to use with a Smart TV we purchased.", "verified": true, "helpfulness": "1/1", "author": "Greg Zinn"}, {"rating": 5.0, "review": "This was a great deal and works really well.  I would highly recommend this product to anyone who want's a great deal at a great price!", "verified": true, "helpfulness": "1/1", "author": "Ken M. Jones"}, {"rating": 5.0, "review": "Yes, I'm an Apple fan, but that's not to suggest I like everything Cupertino puts out.But this is truly a great product.  Small, slick, and is the perfect box (as least in my opinion) to watch Netflix.  It sets up fast and is really idiot proof - good for me I assure you.I don't use all of the apps, but there are several worth checking out.  I really enjoy the PBS app for watching programs like Nova.  Also, the Airplay is very nice to have to stream music, and mirror my iPad for Amazon Prime videos.  I hope everybody will play nice at some point and Apple will include the Amazon app at some point, or Amazon allowing an app to be used.I can attest to the wireless functionality being very good.  I live in remote Alaska - no roads in or out where I live - and there is no broadband.  My internet is all done by satellite, so you can imagine the speeds.  I usually get around .512 - .520gbps.  If you don't understand the technical reference - think dial-up on a good day.So, that said, I still can stream Netflix without interruption, and the Apple TV can do it all wirelessly.  You cannot go wrong with this product.", "verified": true, "helpfulness": "3/3", "author": "GG"}, {"rating": 5.0, "review": "We use this thing constantly since we're an Apple family. So easy to use and so fast. Works great to stream movies from iPad or Mac. Love it!", "verified": true, "helpfulness": "1/1", "author": "H. Kenagy"}, {"rating": 5.0, "review": "A gift was for my husband, who is an apple lover.  He loved it. The instruction were easy and installation a breeze.", "verified": true, "helpfulness": "1/1", "author": "LindaNY"}, {"rating": 1.0, "review": "This is ONLY for Apple lovers. There are not too many apps. One good thing is it has YouTube. Only plays expensive iTunes videos.", "verified": true, "helpfulness": "2/17", "author": "SSS"}, {"rating": 5.0, "review": "I love Apple TV!! I love streaming my music from iTunes and my movies. I really think this is a remarkable item.", "verified": true, "helpfulness": "1/1", "author": "JMS"}]