[{"rating": 2.0, "review": "I got this along with the TimeCapsule 2 in hopes of being able to stream my movies from one to the other directly.  Turns out it will only stream media from a computer running iTunes.  That greatly limits the formats that can be played and is a pain having to turn on a new device.  Worst of all, you can't jailbreak this model so for me, it was practically useless.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "very nice and good price love the airplay mode, i connect my ipad 2 via wifi and i can see my videos directly on my tv without using cables thats amazing", "verified": true, "helpfulness": "0/0", "author": "CMG72"}, {"rating": 3.0, "review": "If I had it to do over I might opt for an another streaming device. It will only stream pictures,vidios, and music from my IPAD.It looks like the older Apple 2 that has been jailed broke will do what what i want. Maybe in the future there will be a jailbreak for the apple 3 and make it more usefull", "verified": true, "helpfulness": "0/1", "author": "FLA"}, {"rating": 5.0, "review": "This is a dream to use, I use to download movies and connect to the TV via computer.  No more !!!  This one of the best products I have ever bought.Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Ala M. \"aelmalak\""}, {"rating": 1.0, "review": "I have had numerous other Apple products- iPods, iPads, iMacs, iPhones, etc.  This is by far the worst Apple product I have ever used.  Why?  Simple: Airplay, which was my only reason for purchasing, doesn't work reliably.I purchased this because I wanted to be able to listen to music from a computer or mobile device through my stereo system. I have tried the device with numerous TV's and receivers and consistently get HDCP connection errors.  It is rare that I can get it to play more than a single song before wireless drops or there is an HDCP problem.", "verified": false, "helpfulness": "3/7", "author": "hobbes \"hobbes\""}, {"rating": 1.0, "review": "I thought I could connect to videos and files on my PC. Wrong! Will only access I-Tune library. Just another gimmick.", "verified": false, "helpfulness": "1/5", "author": "Mr.Pete"}, {"rating": 5.0, "review": "Went to local store to purchase Apple TV, only to find the last one walking out the door as I walked in.  Looked at Amazon.com and I had it next day with no trouble. Thank You Amazon.com", "verified": true, "helpfulness": "0/0", "author": "Dale"}, {"rating": 5.0, "review": "I have found the Apple TV to be the best means for streaming content from your iTunes library to your TV set by far. No other media box has a easier to use interface and all that I have used seem to lag and generally be sluggish compared to the Apple TV. One thing to consider though with the Apple TV: It is designed to be used with iTunes. To get the most bang for your buck with this device, you need to manage your audio/video media with iTunes. I would like to see apps on this device in the future, but for now it does what I want flawlessly!", "verified": true, "helpfulness": "0/0", "author": "M. Martinez"}, {"rating": 5.0, "review": "Don't wait, just buy it.  It is amazing what this little device can do and how simple it is.  The size is great and the quality is incredible.  Between music, video and even mirroring out Macbook Pro's this device handles them all.", "verified": true, "helpfulness": "0/0", "author": "BBJ"}, {"rating": 5.0, "review": "Typical of an Apple product, beautiful, yet functional design.  I just wish my TV provider would allow you to stream their channels over Apple TV.  It would make it that much more functional.  We have 2 and use them every day.If you have a Mac, you can easily do screen mirroring and watch streaming videos from your laptop to Apple TV in just one click.", "verified": true, "helpfulness": "0/0", "author": "Peter G \"NJ Cyclist\""}]