[{"rating": 5.0, "review": "I had been using a shared Apple TV for several months. I ordered this one for myself the day after the opening of the June 2015 World Wide Developers Conference when it became clear that no new version was being announced by Apple in the immediate future. Although my smart TV has the two channels I use most often (Netflix and Amazon Instant Video), I enjoy the availability of the Apple TV's many channels that are not on my TV, such as PBS, and the integration with my family's iTunes libraries. In particular, my wife loves to stream her yoga podcasts to the big screen via Airplay.Screen mirroring is another big benefit. At my user group meetings we connect an Apple TV to a projector. Those of us with new-ish MacOS or iOS devices can take turns doing mini-demos by connecting in turn to the Apple TV. Sure beats connecting and disconnecting cables.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Frankel"}, {"rating": 1.0, "review": "Apple TV decided this evening that it won't play Netflix.  Reset, unplug - doesn't matter...,just won't play Netflix.  Roku - no problem but not Apple TV.", "verified": false, "helpfulness": "0/3", "author": "Richard J. Russell"}, {"rating": 5.0, "review": "Good accessory to have when you have Apple devices.Good accessory", "verified": true, "helpfulness": "0/1", "author": "TINGHSIN KUO"}, {"rating": 5.0, "review": "It's an Apple TV ..... so it's great", "verified": true, "helpfulness": "0/1", "author": "Taylor"}, {"rating": 4.0, "review": "The Apple TV is amazing, but I wish the Airplay feature was a little more reliable and easy to use.  Frequently it kicks off, especially if I'm more than a few feet away from it.", "verified": true, "helpfulness": "2/2", "author": "Jake Eppehimer"}, {"rating": 5.0, "review": "Great gift!", "verified": true, "helpfulness": "0/1", "author": "Madison"}, {"rating": 5.0, "review": "👍", "verified": true, "helpfulness": "0/1", "author": "Serzhik Vardumyan"}, {"rating": 5.0, "review": "Everything was great!  Love our Apple TV!", "verified": true, "helpfulness": "0/1", "author": "Kristi Perrin"}, {"rating": 5.0, "review": "Good  i love apple", "verified": true, "helpfulness": "0/1", "author": "Murdi"}, {"rating": 5.0, "review": "This is really helpful everything in one place....Except Amazon!!!!", "verified": true, "helpfulness": "0/1", "author": "Edna Sloan"}]