[{"rating": 5.0, "review": "I ordered this from amazon on a Sunday and it arrived on Tuesday.  Perfect price ($5 cheaper than apple).  I was torn between a Roku 3 and an Apple TV.  Since I used iTunes for years and purchase music, movies and TV shows, this is exactly what I needed.  It connected to my account and I can play anything wirelessly through my TV.  In addition I can play/stream anything from my iPhone, iPad and iMac directly to my TV.Don't worry about music/video files you can't play through iTunes.  Simply convert to mp4 or mp3, add them to your iTunes and you're set.  I definitely would recommend this to apple users.  It works for me.", "verified": true, "helpfulness": "0/0", "author": "Terry"}, {"rating": 5.0, "review": "I like it very much.I enjoy this with air mirrorring function very much.I can enjoy youtube with big screen using this.", "verified": true, "helpfulness": "0/0", "author": "SANG KWON LEE"}, {"rating": 5.0, "review": "I am now able to watch max go and hbo go on my TV! Easy to set up and easy to use, plus great quality!", "verified": true, "helpfulness": "0/0", "author": "atomicdp"}, {"rating": 5.0, "review": "we had one already and this was our second for our 2nd living room so We love it. Price was better then instore. I recommend to anyone who doesn't have cable and has netflix or Hulu.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "What I like best is ease of use. Theability to watch the programs I missed first time around is really nice.", "verified": true, "helpfulness": "0/0", "author": "coffee farmer"}, {"rating": 1.0, "review": "There will be some for whom this is a great product.  If you live in a studio apartment, and your Apple TV box is a few feet away from your router, then it might work well.  But our situation is that the router is in another room, about 25 feet away, partially blocked by a wall.  The result is a train-wreck.  Initially, it didn't work at all (well, it worked for the first few days, then not at all.)  I used the utility Wifi Stumbler (not supported by Apple) to detect interference from other routers, then went and changed the channel on which my router was broadcasting.  Now, it works, sort of.  Netflix movies start and stop regularly.  A 30 minute t.v. show generally takes close to an hour to watch, and there's no rhyme or reason to when the show will stop, and when it will start again.  It obviously destroys the viewing experience, particularly when you have a dramatic scene or sequence, to have it freeze for two minutes, start up for another minute, and freeze again.  YouTube is completely hit or miss -- some stuff just won't play at all.Support was of limited assistance.  I was given several helpful suggestions about how I could spend several hundred more dollars buying additional components to add more routers, drill holes in my walls and run huge cables through them so that the Apple TV could be wired instead of wireless.Thanks guys, but that's not what you advertised, and not what I bought.  What I'm left with is the equivalent of a radio that only works if you're actually in the radio station.", "verified": false, "helpfulness": "2/6", "author": "Jeremy Crowhurst"}, {"rating": 5.0, "review": "Okay, so my daughter wanted something to stream NetFlix on so she could watch Finding Bigfoot (don't get me started!).  I was torn between AppleTV and the Roku 3, but since everything she has is Apple I opted for the AppleTV.Installation was very simple.Operation is smooth and simple.The only ding I would give it would be that it doesn't do Amazon Instant.Overall, my daughter loves it so I'm happy.  Now she has moved from Finding Bigfoot to Duck Dynasty.  Have I failed as a parent???", "verified": true, "helpfulness": "0/0", "author": "Jon Rollins"}, {"rating": 5.0, "review": "Easy to set-up and use for any current Apple customer.  Makes it simple to watch all of your iTunes movies and listen to your music through your TV.", "verified": true, "helpfulness": "0/0", "author": "Law Student \"ABS\""}, {"rating": 5.0, "review": "Was ripping my hair out trying to stream videos from my PC to my living room.  I had tried XBMC, PS3 media server, and Plex.  I believe all three of these say they can do on-the-fly encoding, which is what I was really looking for (I have a lot of HD movies in MKV format).  None worked very well, although Plex seemed to be the closest to what I was looking for.  But it just wasn't able to handle the HD MKVs and it was driving me crazy, so I just grabbed an AppleTV and spent a weekend converting all of my movies in handbrake.  Handbrake is free and easy to use and once you get the movies into a format that you can add to iTunes streaming to the AppleTV works flawlessly.  I thought having all of my movies and TV shows in iTunes would be a pain but it's actually pretty convenient letting iTunes do all the organizing.  However if you're using Windows and don't have a great PC then iTunes may very well be a deal-breaker.  My PC is pretty beefy so I don't have much of a problem.The interface is sleek and intuitive, as you would expect from Apple, streaming works great, connects via HDMI (although it also has an optical audio port which is nice).", "verified": true, "helpfulness": "1/1", "author": "Lance"}, {"rating": 5.0, "review": "Took a little while to get it to stream from my iPad, but now it works all the time and the picture is fantastic. HBOgo and watchespn are the main apps I use as some are still blocked like the xfinity player, but hopefully that will change soon. I don't have cable tv so $100 to watch ESPN and HBO is definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "Trevor Rappa"}]