[{"rating": 5.0, "review": "Love my apple tv and use it quite a bit.  I love that I can play my music and have a slide show of my favorite photos from my Imac when I am in the mood for music.  It gives me access to my itunes movies etc.", "verified": true, "helpfulness": "0/0", "author": "A. North \"a dreamer\""}, {"rating": 5.0, "review": "Love it ! Easy to use and fast , uncomplicated to install has great features would like more apps- nice", "verified": true, "helpfulness": "0/0", "author": "James Cymbryla"}, {"rating": 5.0, "review": "Love my apple tv. Has made watching things from the internet SO much easier.I only really use it for Netflix, and occasionally YouTube, but there are other apps that you can use.People with MULTIPLE APPLE PRODUCTS should get this over another smart device. You can airplay from your iMac, macbook, iPhone, iPad, iPod touch. So if you want to use it as a second monitor for your computer, do it. If you want to show your friends or family pictures from your latest vacation, do it. If you want to have a bigger screen than your phone when playing a game from the app store, or you want to see what your edited video project will look like on a tv, just airplay. AIRPLAY AIRPLAY AIRPLAY.Only thing I really dislike is that the remote from the apple tv will also work with your mac computers. There is a way to turn it off though.", "verified": false, "helpfulness": "0/0", "author": "Esteban"}, {"rating": 5.0, "review": "It's Apple TV, it works, it is easy to setup (especially if you have an IOS7 iPhone).I put this on the TV in our bedroom so now I have NetFlix, WatchABC and access to my iTunes on my PC (yes you have to launch iTunes on your PC to have it show up).Setup was super easy, if you have an iPhone or iPad running IOS7 you can just turn the Apple TV on, turn on the BlueTooth on your iPhone, lay your iPhone down on the Apple TV box and your phone automates the install process! Type in your Apple ID password and confirm that you want to setup the TV and BAM! The Apple TV is setup with your wifi password and iTunes account info.Simple as can be!The only thing missing from the Apple TV options (for me) was Amazon (not surprising since they compete) but it's easy enough to run the Amazon Instant Video app on my iPhone and use Airplay to shoot it over to the Apple TV. The recent addition of WatchABC is awesome and now gives me ABC On Demand in our bedroom (we have a bare minimum cable box in there).I would also suggest installing the Apple TV Remote app on your iPhone/iPad/iPod Touch.", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 5.0, "review": "nothing around as good as this. I like it and recomend to anybody. buy it you will love it also is easy to install.", "verified": false, "helpfulness": "0/0", "author": "barbara p."}, {"rating": 5.0, "review": "So easy to use, a really great product. One thing to note is that if you do not own an HDMI cable you will need one to hook this up to your TV. The one Amazon has is inexpensive and works perfectly.", "verified": true, "helpfulness": "0/0", "author": "abi"}, {"rating": 5.0, "review": "I am very happy with my Apple TV. It works so easily with my iPhone and  iPad. I love it!Only thing is, I didn't realize it wasn't compatible with my macbook pro, because I have an older version.It only works with the mid 2011 model or newer.", "verified": true, "helpfulness": "0/0", "author": "Tian"}, {"rating": 4.0, "review": "It works and does what it's suppose to do.  I love throwing my iPad up on the big screen for people to see what I'm doing or watch a show.I do have some issues where the apps just spin and will never go in.Also, the iTunes Home Sharing is a pain.  You have to close and open iTunes for the apple tv to see it constantly.  It can't just find it like it should.  Gets annoying having to go back and forth a few times for it to see it.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Klepper"}, {"rating": 1.0, "review": "Like all things Apple, it's over-controlled and more trouble than it's worth.  I'll buy Chromecast for $30 instead thank you.", "verified": true, "helpfulness": "0/7", "author": "hunterb2003"}, {"rating": 5.0, "review": "I got a great deal on my Apple TV with no hidden strings.  The product came in a timely manner and works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Henry E Hendrix"}]