[{"rating": 5.0, "review": "Item received on scheduled. works fine very happy with the product and Amazon", "verified": true, "helpfulness": "0/0", "author": "emile messiha"}, {"rating": 4.0, "review": "It's a great product and you can use any old TV remote or use the remote app on your iPhone. The AirPlay features work great too. It really pays off to have all apple products. I have a MacBook, iPad and iPhone and i can play all video easily on my tv.The only downfall is the apple tvs interface, it's clunky. It's should be designed like iPads and iPhones. Therefore I give it a 4.", "verified": true, "helpfulness": "1/1", "author": "Rob Wentz"}, {"rating": 5.0, "review": "Magnifico", "verified": true, "helpfulness": "0/3", "author": "Alí Díaz"}, {"rating": 5.0, "review": "I tried everything in market roku, apple tv, xbox , raspberry pi, etc... apple tv just works, no drama, issues.", "verified": true, "helpfulness": "0/2", "author": "M3hm3t"}, {"rating": 5.0, "review": "2nd one in lieu of a \"smart\" TV. Unbeatable.", "verified": true, "helpfulness": "0/2", "author": "Joe's hobby workshop"}, {"rating": 5.0, "review": "I've been using the Apple TV for several years now and really enjoy it.  I expect their content offering to expand as they continue to evolve their Apple TV product into a more formidable living room component.", "verified": true, "helpfulness": "0/1", "author": "Kieran"}, {"rating": 4.0, "review": "better alternatives available. Doesn't offer as much free programming. Have it but not using it as much. Price should be 29.99-39.99", "verified": true, "helpfulness": "3/3", "author": "Muhammad Dar"}, {"rating": 5.0, "review": "The best like all apple", "verified": true, "helpfulness": "0/2", "author": "Ed"}, {"rating": 5.0, "review": "As expected.", "verified": true, "helpfulness": "0/3", "author": "Blake"}, {"rating": 3.0, "review": "I set this up, messed with it for a bit, then returned it once I realized my PS3 will cover everything it offers that I want. While it has a slick operating system and lots of features for the price, it just wasn't for me.", "verified": true, "helpfulness": "3/3", "author": "airon"}]