[{"rating": 5.0, "review": "AppleTV is the leader of this genre of technical toy.  AppleTV is on the edge of injuring their luxurious device by trying every day to make streaming your own movies from your computer more and more difficult.The day they take that capability away is the day they will lose 90% of their market share.Until then, this device is the one you must-have.", "verified": true, "helpfulness": "0/0", "author": "Roquen \"Respiratory Therapist\""}, {"rating": 5.0, "review": "Apple consumer products just plain work.  Couldn't be any easier to set up & use.  Lots of worthwhile free content but add Netflix & DTV (via antenna) for a complete & less expensive alternative to cable.", "verified": true, "helpfulness": "0/0", "author": "BUFULO"}, {"rating": 5.0, "review": "Combined with iTunes Match all my music I've ever owned is now available on this little box wired into the stereo and tv.  I bought a second one and it shows up on iOS devices as Apple TV 2 automatically.  Love it.  Thinking about ditching cable.  May never buy another movie except on iTunes either as you can purchase and watch instantly whatever isn't already free on the built in Netflix.  Way cool.", "verified": true, "helpfulness": "0/0", "author": "David Mcconaughy"}, {"rating": 5.0, "review": "This product has significantly enhanced the use and value of our television set. It synced easily with our cloud providing access to all our Apple related content from our iPhones to iPads to Macs. If you have a TV and you are an Apple user this is a very inexpensive  must have product!", "verified": true, "helpfulness": "0/0", "author": "Charles Brooke"}, {"rating": 4.0, "review": "This allows you to watch things from your laptop, but it requires iTunes and thus is limited. If it allowed you to display anything from your laptop, it would be better. Also, Apple recommends that this \"wireless\" product be hard wired to the internet. Ok for me because I store it close to the router, but that could pose as an inconvenience if you wish to store it elsewhere because it tends to lose the internet connection more often than usual.", "verified": true, "helpfulness": "1/1", "author": "Emerald Black"}, {"rating": 5.0, "review": "Wanted to use this as a single device to drive an HDMI flat panel from an iPad. Turns out you need a separate AP to make the connection. I thought I had researched it thoroughly but alas I did not. So, with the addition of an AP I was able to mirror my iPad's screen to the flat panel. Still have to fuss with screen size but over all happy.", "verified": true, "helpfulness": "1/1", "author": "S. Tompkins"}, {"rating": 3.0, "review": "Apple has an exasperating mindset that tries to limit one's ability to share fully owned material across users, even in the same household.  I think that it is pure and evil greed, no matter how high and holy Apple thinks it is.  Anyway, at least with iTunes one can share libraries.  With Apple TV, an user must sign out of his library and sign into another in order to watch shows or listen to music on that other library, even if the library is in the same house.  So, for example, I have to sign out of my Apple account and log into my daughter's Apple account, which means she needs to provide me her password, in order to watch a show that she has bought on iTunes, even though she still lives in my house and is sitting next to me while we watch the show.  That is infuriating!  Also, in Steve Jobs quest to simplify everything, he made it much more difficult to navigate the menu than it should be.  The controller should have more buttons on it, and one should not have to repeat actions so much.  I like the overall ability to play media through the Apple TV, but the interface needs to be expanded, and the restrictions need to be lifted.", "verified": true, "helpfulness": "1/2", "author": "J. G. Hoff"}, {"rating": 5.0, "review": "AirPlay is the reason I bought 2 of them. I stream my photo album, music and videos from my iPad, iPhone and laptop through Apple TV to my receiver and it looks and sounds great. Very very cool feature and makes it stand out from Roku and other players. There is a app for Apple TV called Remote that's free lets you control your Apple TV with swipe gestures.", "verified": true, "helpfulness": "4/5", "author": "Waxtoy"}, {"rating": 4.0, "review": "Pros: The best in home networking with other iOS devices. Connects flawlessly and integrates smoothly.Cons: Besides Netflix and Hulu, there really isn't much this thing offers in the video department. And you're insane if you think I'm gonna rent/buy from the Apple store with their prices. Things like Crackle, Xfinity, HBO/Cinemax Go aren't available so there really isn't much content.Fortunately I still have an Xbox 360.", "verified": false, "helpfulness": "2/2", "author": "AwesomeDude"}, {"rating": 4.0, "review": "My first Apple product was an iPod nano many years ago. I enjoyed it (still do), but it wasn't until I bought an Apple TV that I began to realize the greatness of Apple. It brought Internet connectivity to my tv in a simple, elegant way. Is it perfect? No, but it does so much that you're willing to overlook its shortcomings.Plug in 2 cables, and you're done: power and HDMI. It's pretty simple to setup wifi, and then you're up and running. You have access to iTunes movie and tv show purchases through the cloud, you can access iTunes media from your computer, Netflix, Hulu plus, Vimeo, YouTube, and internet radio stations. There are other streaming video services available, but I haven't used those yet. Personally I'd like to see Amazon instant video and UFC made available, but those aren't available just yet. I'm keeping my finger crossed though.Another great thing about Apple TV is its smooth integration with other Apple devices. You can have it mirror your Mac computer screen, or stream music, videos, and photos from any iOS device. I love mine so much that I bought one for my brother and two for my mother. We love our Apple TVs, and we're slowly but surely becoming part of the Apple family.", "verified": true, "helpfulness": "1/1", "author": "Eric Tello"}]