[{"rating": 5.0, "review": "I cut ties with the cable company sometime ago and Apple TV has made sure I'll never go back. Love the effortless way I can display my iPad, and Phone on the big screen. And there's no lag.", "verified": true, "helpfulness": "0/0", "author": "Ben Magana"}, {"rating": 5.0, "review": "Great Item-Great Seller", "verified": true, "helpfulness": "0/0", "author": "Dana"}, {"rating": 5.0, "review": "I love this apple product as it seamlessly integrates all of my apple devices. Streaming is flawless and quick. Set up was a no-brainer. The simplicity of the remote is elegant and intuitive. Great buy!", "verified": true, "helpfulness": "0/0", "author": "RichCS"}, {"rating": 5.0, "review": "I was told after I made the purchase that there is an upgrade to the one I bought. giggle  I didn't know anybetter. Either way, doesn't really matter, this item is awesome. Takes up very little space and allows me to use Netflix, and many other applications like ESPN - through the use of my AT&T; Uverse internet. Awesome buy! Love it. Several of my friends have bought it after seeing it at my apt.", "verified": true, "helpfulness": "0/0", "author": "mary lou alfaro"}, {"rating": 3.0, "review": "I want to play video on my Mac and mirror to my TV.  The Mac DVD player blocks mirroring, but I downloaded another player that allows mirroring.  Unfortunately, Air Play is use progressive/multiresolution rendering.  The image starts fuzzy and improves with time.  With fast moving images, like video, the picture never has the time to improve and stays fuzzy, so movies have poor image quality.It also does not work with Amazon Instant Video streaming.", "verified": false, "helpfulness": "0/1", "author": "C. Law"}, {"rating": 4.0, "review": "For some reason my music is not being \"shared\" to my Apple TV. My only remedy seems to be to stop the \"sharing\" on my five devices. I think that will mess up a whole lot of things. Plus EVERYTHING else is available through my iTunes account (videos, photos, tv shows) except songs! Ugh...", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "Apple TV is great....especially with kids...can stream all your iTunes movies and music. Also love the different apps on it and seeing my photos on the tv.", "verified": true, "helpfulness": "0/0", "author": "Dawn Breski"}, {"rating": 5.0, "review": "This was easy to set up, small and compact and full of entertainment . Can't go wrong with this , my kids live it", "verified": true, "helpfulness": "0/0", "author": "Gregg Loyd"}, {"rating": 4.0, "review": "Probably the most handy little box you could buy. It pretty much turns your regular dumb TV into a smart TV. The interface is very user friendly as most Apple devices so it’s easy for anyone to use. I wish it had access to an app store. Having a Pandora app would be great but you’re able to mirror other apple products so you can access Pandora that way.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It works  great with the iPhone I would recommend it to anyone with the apple product. It's easy to connect to the TV.", "verified": true, "helpfulness": "1/1", "author": "Rita Campos"}]