[{"rating": 5.0, "review": "This is a great product and your service was also fine. You were prompt to correct a situation that occurred with a missing cable and you did it to my satisfaction.Thank you", "verified": true, "helpfulness": "0/0", "author": "Irene Azzarito"}, {"rating": 5.0, "review": "We love it as it is the gateway to internet.  Easy to use.  Only thing is that newer version's remote is not compatible with older version.", "verified": true, "helpfulness": "0/0", "author": "OC_Mango \"sunny land\""}, {"rating": 5.0, "review": "Absolutely fantastic. It's exactly what I expected from a Mac product-- easy to set up, easy to use, and works flawlessly with my other mac products. Definitely a must-have for any iPhone, iPad, or Macbook user.", "verified": true, "helpfulness": "0/0", "author": "Tyler Anthony"}, {"rating": 5.0, "review": "Simply excellent. Highly reliable product is to recommend and enjoy.It can be adapted to any TV and turns it into Smart", "verified": true, "helpfulness": "0/1", "author": "Gerardo Sanchez"}, {"rating": 5.0, "review": "Apple TV filled a need perfectly. I have a home theater without Bluetooth. Apple TV lets me wirelessly play music from my iPhone and MacBook through the home theater. I can also watch anything from my phone or computer on the large screen TV. And this is in addition to all the content available with the product. Installation was a snap. Just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Windy"}, {"rating": 5.0, "review": "Amazing device! I use it for everything screw cable buy this! I even bring it to my friends and stuff so we can easily watch whatever we want.", "verified": true, "helpfulness": "0/0", "author": "Tyler robbins"}, {"rating": 5.0, "review": "I now have 3 apple TV's.  One for each TV in the house.  It stream Netflix better than the smart TVs.", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 5.0, "review": "Arrived on the day they predicted and was very easy to install.  No problems with reception.  Then bought one for my daughter who wanted to get rid of her cable bill. A bit pricey though.", "verified": true, "helpfulness": "0/0", "author": "DWC"}, {"rating": 5.0, "review": "There was a lot of different name brand to choose. The apple was the easiest to set up. I have been using it since I received it. I recommend 200%.", "verified": true, "helpfulness": "0/0", "author": "FRANKIE"}, {"rating": 5.0, "review": "I am an Apple fan and wanted to love this product but it seems  this product needs more improvement. I have a MacBook Pro late 2012 that I am using with Apple TV and sometimes for no reason Apple TV drops its wireless connection to the laptop. Although I have pretty good download speed for Utube video streaming (35 mb/s) and my computer plays it perfectly but sometimes Apple TV can not keep up and there are some annoying interruptions.I am only connecting to Apple TV & Utube @ 720p.The interesting part is when I don't use Utube and use videos from my computer to Apple TV those interruptions becomes much less frequent. Hopefully future firmware updates will improve the connectivity.Update 7-17-2014After playing around I finally found out what was causing those annoying interruptions!! It was caused by my own wireless networks!! I have Verizon Fios wireless & Apple Airport Extreme in the house, I noticed that there was a conflict between these two so I disabled Fios WiFi and its all good now, no more interruptions.Now rating should be 5 Stars.", "verified": true, "helpfulness": "0/0", "author": "M. Boroomand"}]