[{"rating": 5.0, "review": "Works great--like I expected", "verified": true, "helpfulness": "0/0", "author": "nick morado"}, {"rating": 2.0, "review": "Want to watch amazon prime? No app allowed on this. Want to add app channels from a channel store like UFC? Nope, not allowed. Buy a Roku 3. The apple remote app for your phone or iPad is also super lame. I have the Roku 3 and bought the Apple TV thinking it would do everything roku could do plus mirror my apple devices. Even the remote that comes with Apple TV is junk. You can AirPlay amazon from your iphone or tablet but the fact that you have to do this rather than just selecting it from the Apple TV home screen like you can do with netflix makes this an inferior rather than superior product when compared to other offerings.", "verified": true, "helpfulness": "2/2", "author": "R. Duggan \"Bobby\""}, {"rating": 5.0, "review": "Works perfectly! Haven't had not one problem with using the adapter.", "verified": true, "helpfulness": "0/0", "author": "Monie"}, {"rating": 5.0, "review": "Hey it's Apple... I am just a schmuck. Love this product, still u gotta put myriad passwords in this little beastie. Please software peeps make my life simpler. Some times I have to hard reset the apple because it's sleeping and won't wake, not sure if that's an issue with this particular one or in general. Hard restarting apples is a PITA. This is second one I have, I also have roku and smart TV.", "verified": true, "helpfulness": "0/0", "author": "B. Scholten \"emonkey\""}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Wilfredo Frontado Langaine \"wfrontado\""}, {"rating": 3.0, "review": "Sleek product, doesn't offer as much as is advertised, I purchase the Apple TV to make up for a lack of cable television. I called apple prior to purchasing the Apple TV and asked what kind of programming came with the unit. The insured me that abc and several other networks were \"free\" with the Apple TV box, unfortunately this is not true. For you to have these other app, you have to have an account with one of several cable companies already. Since we got rid of our cable tv, and we live in the middle of nowhere due to our job, we did not get these benefits so the boxes capabilities are very limited and the advertising miss leads you. We got netflix and that has worked as advertised and the link up with our other apple products is very nice. Just watch out apple will mislead you and say what they need to so you buy the product.", "verified": false, "helpfulness": "1/1", "author": "Ryan E. Reed \"Ryan\""}, {"rating": 4.0, "review": "Hangs up wonce in a while .", "verified": true, "helpfulness": "0/0", "author": "ORT"}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/0", "author": "guimartax"}, {"rating": 5.0, "review": "Apple used to include a HDMI cable. This version did not.", "verified": true, "helpfulness": "0/0", "author": "Darren Mortensen"}, {"rating": 5.0, "review": "Just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Motor Man Steve"}]