[{"rating": 5.0, "review": "Come fast and set up fast. Everything works great on all my Apple product. Share your video and photos are so easy now with AirPlay. Must buy for all Apple fan :D", "verified": true, "helpfulness": "0/0", "author": "JoseZ"}, {"rating": 5.0, "review": "This is my third Apple TV.  Love it!  An excellent use of ~$100 if you have a solid iTunes library...and a dedicated \"always on\" computer/drive running your iTunes library 24x7 that you can tap into.I was surprised, however, to find out that a USED Apple TV was shipped to me...and part of the packaging that would hold a new Apple TV perfectly in place was gone -- the plastic wrap around the outside of the box, the protective plastic around the Apple TV and remotes were part of the mess, but haphazardly replaced, and the cardboard \"guides\" inside the box that keep eveything in place weren't there.  When I opened the box the remote control was \"floating around\" freely in the larger box's packaging...it had completely slipped out of the Apple TV box.  Scuffed up.  VERY unlike Amazon!  PLEASE DON'T LET YOUR AWESOME QUALITY CONTROL SLIP AMAZON!!!  I have been a happy customer for years and want to remain so.Also I think this was the FIRST time that my shipment has been late.  Usually UPS and on time or early.  This was FedEx and a day late!?!?!", "verified": true, "helpfulness": "0/0", "author": "Erich Starrett"}, {"rating": 5.0, "review": "I BROUGHT THIS AS A CHRISTMAS GIFT FOR MY HUSBAND AND HE LOVES THIS AND SO DO I!!! WE PLAN ON GETTING ANOTHER ONE SOON.", "verified": true, "helpfulness": "0/0", "author": "Angela Reid Williams"}, {"rating": 5.0, "review": "Plug it into the wall, plug it into the TV, walk through the setup and you're cooking with gas. The interface to Netflix is the best out there. Be sure to get the Remote app if you have an iPhone.", "verified": true, "helpfulness": "0/0", "author": "Timothy H. Pylant"}, {"rating": 5.0, "review": "I love the apple TV, it was $20 cheaper at amozon! Very happy  and now i can see all my favorites show! Thanks amozon...", "verified": false, "helpfulness": "0/0", "author": "mimi"}, {"rating": 5.0, "review": "The box is so small I had hard time figuring where to locate so that my universal remote control signal would get to it.  If you have apple products in your house; I have three computers and three cell phones this is the way to easily display or listen to their content.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 3.0, "review": "Haven't used this yet but know the receiver was thrilled to recieve this item. He has an outdoor tv and is looking forward to control it from his iphone. We shall see.", "verified": true, "helpfulness": "0/1", "author": "margaret smith"}, {"rating": 5.0, "review": "This is a great device at a very good price!  Allows you to do basically everything you do on your iPhone or iPad on your tv. Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Mike P"}, {"rating": 5.0, "review": "So much better than Smart TV. I just wish the Apple TV would have HBOGO on it! But other than that, it's flawless. And amazon shipped it REAL quick. HA!", "verified": true, "helpfulness": "1/1", "author": "Adam \"CHANGEMENT\""}, {"rating": 4.0, "review": "Airplay is still under the infant stage. More apps need to support apple tv such as HBO Go and Netflix. However, so far it's great! Good product to play music videos or your song playlist without having to buy an expensive bluetooth speaker set.", "verified": true, "helpfulness": "0/0", "author": "Lui"}]