[{"rating": 3.0, "review": "Nice and simple, but not so useful because you need to purchase almost everything online, sucking watching movies or watching the channels.", "verified": false, "helpfulness": "0/2", "author": "Dragon \"dragon801\""}, {"rating": 5.0, "review": "The first step in my move away was an indoor leaf antenna.  This is vital for getting the local channels.Next up, purchasing an Apple TV.  I own a PS4 and PS3, so I already have access to the majority of the apps.  However, the ESPN app was unavailable to me because I guess MS is paying to keep that app off Sony consoles.  Me being a sports fan, I had to have ESPN.  So I purhcased an Apple TV.What I loveThe design.  This box is tiny.  It takes up no space. Set up was very simple and easy.  Understand to activate ESPN and HBOGo you're going to need go on their websites and enter a code.  The picture is great and the airplay feature is kinda cool.What I'm not so in love withThe remote.  It's friggin small and begging to fall into the couch vortex.What I'm disappointed with:Airplay.  There are a few apps that aren't available on apple tv that are available on my ipad and I was really hoping I could mirror what's on my ipad to my tv (like watching the TNT app on my tv).  Unfortunately, you can't do this for whatever reason.  You can mirror photos, music, games, etc...but not certain entertainment apps.Overall, I'm happy.  I got what I wanted. ESPN!!!! And I'm sure the other stuff will be useful as well. Great product.", "verified": false, "helpfulness": "0/2", "author": "The Endz"}, {"rating": 2.0, "review": "A hassle to set up and dealing with iTunes (through which the setup is handled) took several days of phoning and to this day I am not sure if I am properly registered.  Also, getting passwords etc. on the various services is a bit of a nightmare also.  Be prepared for a big investment in time until you get anything for your money.Full disclosure, I owned a Next computer and Steve Jobs abandoned me so I am probably prejudiced.  However, this latest Apple acquisition has done nothing to smooth ancient ruffled feathers.", "verified": true, "helpfulness": "1/2", "author": "fish 0143"}, {"rating": 5.0, "review": "I love the Apple TV.  I am asking myself why I didn't buy it sooner.  The ability to view the screen has been great for sharing information with my family.", "verified": true, "helpfulness": "1/1", "author": "Rebecca D \"elise72783\""}, {"rating": 5.0, "review": "Loved it, great addition to my other Apple products. Setup was a breeze, even though using the included remote to scroll through letter and after letter when setting up can be a pain. I would encourage anyone to get a Bluetooth keyboard.", "verified": true, "helpfulness": "0/0", "author": "David Oliver"}, {"rating": 5.0, "review": "We love all things Apple! So easy to use- so easy that our 4 year old can use it. Only wish it had an alphabet key, versus going through the whole alphabet to spell something out.", "verified": true, "helpfulness": "1/1", "author": "Alison C."}, {"rating": 4.0, "review": "This is a nice addition to the apple family. As long as you have a decent amount of apple gear you really do get a lot of use through this box. I can stream from my laptop and phone with ease. The connection sometimes does discount sometimes, and I wish apple would release an app store for this thing. But for a mere 100 dollars you turn your tv into a smart tv and is worth the investment if you are into apple and want an easy streaming experience.", "verified": true, "helpfulness": "1/1", "author": "Sebastian Zdarowski"}, {"rating": 5.0, "review": "You can't go wrong buying this apple product ! I am saving so much on my cable bill and the device is so very easy to use. Thanks Amazon for providing this at such a great price!", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 5.0, "review": "I'm sure there are more technical reviews above or below this one. Apple TV allows you to mirror your iPhone / iPad, watch Netflix, YouTube, etc on your TV. I also use it to listen to music that is on my home computer, since you can sync the two together. Cancel cable, and you've paid for this baby in one month. If you don't like it, hook up cable again, and you have a \"free\" Apple TV to go along with your million cable shows!", "verified": true, "helpfulness": "0/0", "author": "Lane N. Halterman"}, {"rating": 1.0, "review": "Loads of movies and shows, but all cost money! Even stuff you watch for free on the HD airwaves or through your computer has a price tag.  For example, say one night you watch one CBS sitcom, one PBS show, some News and your at 10 bucks!  These are typically 'free' shows/TV on the airwaves people!  Why should we pay?  Oh, and pray that the show your watching is NOT in HD for it will take between 20 to 90 minutes to load!  Another issue...take for example a typical 'YouTube' video, start playing it via AppleTV and suddenly after only a mere 20 seconds into the video it fades out, why?  Is there a copywriters infringement when something 'free' is channeled through your licensed AppleTV device via iTunes store? After a month of pulling my hair in an attempt to making sense of the costly 'free' programming I gifted this device to my folks who were content in using it as a mere interface 'gizmo' between their iPad and their Samsung HDTV. The 'Airplay' option is slow/sketchy to interface with the TV, its a 1 in 3 shot attempt to get a perfect non-buffering lock for video.  For 'stills' however, it works fine; but as we all know,  there are better, smaller and cheaper foolproof gizmos to interface your pics from your computer/smartphone to an HDTV.Sorry Apple, but I agree with the other 195 '1 star' reviewers, your product has a strange 'cost' and 'rights' relationship with free TV programming. Roku is better if you want to watch terrible 'B' movies for free and really for free.  'Googlecast'  merely gathers all the free and paid programming links for you in one place, but for TV and Movies, still,' the best -bang-for-your-buck'  is to get internet service and Netflix.  I have had DirectTV and Comcast service for less than 30 bucks (2014) a month, I pay an additional 8 bucks for Netflix and I get hundreds of 'on-demand' shows in dozens of genres at a instant, in HD,  that I can rewind,  FF, and save and no delay!", "verified": false, "helpfulness": "1/4", "author": "Teacherman"}]