[{"rating": 5.0, "review": "I'm not sure I could ever write enough good things about the Apple TV. Since there are countless websites touting the virtues of Apple TV (or criticizing it), I will instead make a list of my Pros/Cons:Pros:1. If you are \"in\" the Apple ecosystem like my wife & I (iPads, iPhones, Macbook), and you want a streaming media player -  look no further. We also have a Roku 3, Chromecast & Roku Stick but that's for another time.2. Mirroring - using an iPad or iPhone, Apple TV, and the same Wi-Fi network allows me to turn my HDTV into a monitor for ANYTHING that's on any of my screens. Watch Youtube videos on your TV from your phone? Takes seconds. Read & write email on your TV? Done. It is incredible. The Airplay feature is BY FAR the primary reason to get an Apple TV. We use them at work for mirroring blueprints (drawings) from supervisor's iPads to the HDTV monitors we have around the offices.3. Channel Selection - while it's not as large as Roku (or maybe even Amazon's own Fire Box/Fire Stick), it has all the channels that I care about. HBO GO (and HBO Now, now!), Netflix, Hulu Plus, Crackle, Watch ESPN, and I can rent or buy movies using my Apple ID. Since I get iTunes gift cards every Christmas, instead of my wife and I going to Redbox or wherever, we just click a few buttons and away we go watching a newly released movie. If it's a favorite of yours, keeping it in the cloud for later viewing is a huge plus.4. Honestly - I cannot say enough about the Apple TV - ESPECIALLY now that they've dropped the price down. It isn't the fastest, the newest, the one with the most channels, but it sure is flexible for those with other Apple products and it gets the job done.Cons:1. The remote - this thing is slippery, hard to hold, hard to keep track of, and just overall \"meh\" for being Apple. It is like a long, skinny original iPod. The battery is easy to change out (I assume,  mine has never died). The one positive here is that you can download an app that will be your remote OR, and this is fantastic - you can program ANY remote to perform the functions of the Apple TV remote. Don't want 3 remotes? No worries! Just pair & program your TV remote!2. Netflix loading speed. I never noticed this until I got a Roku 3. By comparison, Netflix (only that channel it seems) can sometimes take a few seconds to load. I'm not sure what the cause or reasoning is - processor, buffering, etc. Again, I never noticed in the 6 months before we got a Roku then I saw how fast it *could* be and was instantly disappointed.3. Mirroring - while fantastic (see above), I have had some issues with it. I was trying to mirror something from Amazon Prime on my iPad to the Apple TV (some TV show) and it kept cutting in & out. Not sure if this is an Amazon vs. Apple deal where they purposely make the other's items difficult to use to force you into buying their products? Jokes on you both Amazon & Apple! I own all of your stuff! (Except the Amazon phone - that was terrible).In closing, if you find yourself using an Apple device 50% or more for your electronics needs (mobile - iPad, iPhone, Macbook), getting an Apple TV is a logical, smart move that you won't regret.Quick note about cost: other than buying the device, there is no monthly cost associated with the Apple TV. If you want to subscribe to premium streaming services (I recommend Netflix & Hulu Plus) - THEY have subscription costs.", "verified": true, "helpfulness": "0/0", "author": "TexasBuckeye"}, {"rating": 5.0, "review": "Works good. Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "David F Thomas"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Alejandro Zeledon Masis"}, {"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "Marshall F Simmons"}, {"rating": 4.0, "review": "I LOVE airplay! Its the only reason I got it. Or else I would have opted for something cheaper, a stick or whatever.I had a ROKU 2 and it was great, although the quality is apparent when switching to the apple TV.The apple TV is missing an app store. It needs amazon prime. It need crackle for free content. The apple TV honestly need more free content when compared to its competition with ROKU. Although all this changes if you have a compatible device with which you can take advantage of airplay mirroring. You can play content already stored on your computer, and the deal maker... stream! I enjoy taking advantage of steampowered, which i use to play live gaming on my TV through my computer. I like the apple TV but there is much need for improvement. I would only get the apple TV if you have a mac which is compatible for airplay. I also have an iPad but the screen comes out distorted due to the dimensions of the iPad, so you don't get to fully enjoy the size of your TV. If you don't have an embedded apple ecosystem I would opt for a cheaper rival device.", "verified": false, "helpfulness": "0/0", "author": "Bryan S"}, {"rating": 3.0, "review": "Roku 3 is better. This works fine though.", "verified": true, "helpfulness": "0/1", "author": "GBerios"}, {"rating": 1.0, "review": "not work", "verified": true, "helpfulness": "0/2", "author": "carlos"}, {"rating": 5.0, "review": "Don't know why I didn't get this before. After cutting cord with Cox and then reluctantly with Dish (HBO junkie), I was happy watching some HBO programming through Amazon Prime, YouTube clips or at friend's homes. The HBO Now came along and I quickly jumped on it. I'm still enjoying 30 day triall and very happy to pay $15 a month. Only bad thing is that HBO doesn't offer PPV. I really like Apple TV and it's apps. I used to watch programming on my Samsung DVD player but it crashed too often.", "verified": true, "helpfulness": "1/1", "author": "Teresa M. Baker"}, {"rating": 5.0, "review": "Great product and it shipped super quick!", "verified": true, "helpfulness": "0/0", "author": "Luke william drawdy"}, {"rating": 5.0, "review": "I have Amazon Fire the Roku  and Apple TV boxes. They are pretty much the same product, but the Amazon Fire and Ruko gets more stations. I only bought the Apple because I have a Ipad and Ipod touch that I can use to view my content on the large screen tv or even mirror the Ipad on the tv if I so desire.Homesharing works perfectly between devices and if I put photos in the photostream file folder they appear on all the devices including my PC using Icloud. I recommend the Apple TV to anyone who uses Apple products.Apple TV has a great user interface which is by far better then Amazon Fire and Roku.  Each has it's benefits Amazon Fire has the Amazon prime and Roku has the voice search.  However Apple TV has the mirroring option for iPad and iPhone.", "verified": false, "helpfulness": "2/2", "author": "Dante's Reviews"}]