[{"rating": 5.0, "review": "I have been using it for 3 months now and have no idea why we didn't upgrade to one of these sooner!  If you use apple devices in your house you will love it!  Pictures from my iPhone automatically appear as the screen saver, so many different channels to choose from.  The only thing it doesn't support is Amazon Video and Pandora.  I had no idea there are so many different choices of shows to watch!  The old roku boxes just sit unused anymore...", "verified": true, "helpfulness": "0/0", "author": "Scott Helmann"}, {"rating": 5.0, "review": "These have a lot of capability and features. I have my entire music and moving libraries on these devices and I really like them.", "verified": true, "helpfulness": "0/0", "author": "SCI-FI Nut \"Gravy Grabber\""}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Frank Kwok"}, {"rating": 2.0, "review": "not easy to use", "verified": true, "helpfulness": "1/2", "author": "Taha Keilani"}, {"rating": 5.0, "review": "perfece", "verified": true, "helpfulness": "0/1", "author": "van"}, {"rating": 5.0, "review": "Amazing little device! It allows you to play items on from your Itunes account your home computer, watch Netflix & Hulu, and a huge variety of other apps. It's pretty easy to setup. The only downfall is keeping up with the tiny remote that comes with it!", "verified": true, "helpfulness": "0/0", "author": "JHWatson"}, {"rating": 1.0, "review": "I'm not sure that I have this exact version I have, but in trying to fix my issue, I think that this problem affects all models,  I have an older TV that works perfectly well but does not have an HDMI input.  I got a converter to use with my AppleTV and everything was fine for the first 10 months.  Then I started getting these \"This content require HDCP.\" errors whenever I tried to play video.  Apple offers no remedy.  Basically, I need everything between the AppleTV brick and the TV to \"support HDCP\".  This will be fixed when I go and finally buy a new TV, but it really annoys me that I am forced to upgrade my equipment, when this worked fine before.  My old TV works fine and I have better uses for that $500 right now.  Until then my Appe\"TV\" is only useful for audio.I only really used this thing for AirPlay, since I already have my Internet Apps setup on my BluRay DVD player.  The DVD player has NO PROBLEM streaming Netflix and Amazon video to my old TV.  Just Apple, being high-handed about copy protection.If you have an older TV or route your connections through a Home Theater Receiver, do not buy this.", "verified": false, "helpfulness": "2/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just the best gifts ever!", "verified": true, "helpfulness": "0/1", "author": "PATACA"}, {"rating": 5.0, "review": "Best purchase I ever made. There is nothing like Apple TV. I have Roku also. I watch Apple more.", "verified": true, "helpfulness": "0/1", "author": "sonya"}, {"rating": 5.0, "review": "Apple TV does just as it was advertised!!!We are thinking about getting another one for our extra TV.", "verified": true, "helpfulness": "0/0", "author": "Dan Hodge"}]