[{"rating": 4.0, "review": "ever watch youtube on your iphone at home? well, with this you can just throw it up on the TV and enjoy watching it on the big screen.", "verified": true, "helpfulness": "0/0", "author": "kenneth takahashi"}, {"rating": 5.0, "review": "Love all Apple products. Apple TV lived up to the brands reputation. With this product i am going to try to eliminate cable TV from my life.", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 5.0, "review": "I recently \"cut the cord\" and discontinued cable TV at my cabin in the woods.  Now I only have this little gadget and whatever I can stream from Netflix, HBO or anywhere on the web.  I have no experience with Roku or other streaming devices; since I have an Apple \"ecosystem\" I opted for this.  I am very pleased.  Set up was super easy and it works like a champ.  So much so, I bought a second unit for my city apartment.  One small complaint -- the remote is very tiny and I'm always misplacing it or losing it in the sofa cushion.  Recommended.", "verified": true, "helpfulness": "0/0", "author": "M. Houghtaling"}, {"rating": 3.0, "review": "Apple claims to always have an intuitive interface, and while this is a remarkable machine and I am delighted with what it is capable of doing, unless your intuition involves unplugging the machine from time to time to get it to work, I might argue with that basic claim.  Admittedly our set up is probably not typical, (more security and firewalls than most probably have) which made the alleged -no step- set up a nightmare.  Still, it does work and is really wonderful.  The Air Play mirroring leaves a lot to be desired though.  First turn of anything that is bluetooth, and don't use a microwave or baby monitor.  Getting it to play internet radio through the Radio 365 app was infuriating.  And since my musical tastes don't run towards \"everything Apple/iTunes\" I'm left with an intuitive battle that involves a lot of unplugging the Apple TV and rebooting my iPad.  Let's just say there is room for improvement.", "verified": true, "helpfulness": "0/1", "author": "Singing Lemur"}, {"rating": 5.0, "review": "It was a great investment I can watch any live ESPN channel on my TV with the click of a button. The only thing I don't like about the product is that the remote is annoying to use sometimes since it only is 3 buttons, so selecting is aggravating. It does not have a ton of apps to choose from and there is no app store. If you're looking to watch a ton of channels this product is NOT for you!", "verified": true, "helpfulness": "0/1", "author": "Aaron Eisenhardt"}, {"rating": 5.0, "review": "My main reason for purchasing the Apple TV over ROKU, was so I could access my very large iTunes library in the living room. It does this beautifully, but what I didn't expect was superior performance when streaming from Hulu Plus, Netflix and YouTube. There are a lot of the apps that are also resident on my Vizio TV set, but many that are not, and vice versa, so this also added an expansion of my streaming ability. Set up in a few minutes without a hiccup! Note too, that i am using a PC, not a Mac, and I am not particularly Apple-centric, but I find iTunes to be the best app for compiling and centralizing a music and video library. I can also access my library via my Samsung tablet using Samsung Link and have iTunes open for the Apple TV and other Apple devices without any conflict. Now for those considering getting one of these in order to stream from your personal iTunes library, you can do so without any concern. There are some limitations on video format, but if your primary player is iTunes, and the video plays there, it will play via Apple TV.My audio files in iTunes are loaded as uncompressed .wav files as opposed to using one of Apple's codices. I am an audiophile and many of my files, particularly home recordings from LP, are high resolution at 96kHz 24 bit, as well as the typical 44.1kHz 16 bit CD files. Absolutely no lag or bottleneck to the flow. I am currently piping the audio into a stereo system from the TV set's line out jacks, and the quality is nearly as good as playing the files directly from the computer into the main system it is hardwired into.At first I couldn't locate the proper playlist option, and assumed that the playlists weren't working. Turns out it was a simple matter of selecting the sort option to sort by name and then scroll up and BAM!, there it was. I thought at first too, that it wouldn't automatically play the next video in my iTunes playlist, but again, that was my slip, not the unit.It earns a 5 star rating from me, as it is a simple yet elegant solution to accessing my media library remotely. We may have to get a couple more for other rooms in the near future.", "verified": true, "helpfulness": "0/0", "author": "G&L; Rocks \"stratocat99\""}, {"rating": 4.0, "review": "I'm wandering why don't  Apple makes simple one like this and better, fully loaded model for the high end systems.", "verified": true, "helpfulness": "0/0", "author": "ta"}, {"rating": 5.0, "review": "I love my Apple TV. I installed this on my Samsung TV and it is wonderful! It is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Shopper"}, {"rating": 3.0, "review": "Apple TV is fine but with other streamers out there, these are the things I find annoying:- Remote is tiny easy to misplace. (Beware falling asleep with TV on.)- Remote is same as that for your laptop. (Beware using it with laptop near.)- Only rewind and FF but you can't pick out a point on the 'bar' to get to spot in what you are watching.Overall, its a \"meh.\"", "verified": false, "helpfulness": "0/1", "author": "Kay"}, {"rating": 5.0, "review": "It's great, pure and simple.  Works on my newer TVs and integrates with my iOS devices just fine.But my big question is, how would I connect this to my older DLP with only RCA, super video and USB ports?Are there converters out there that are guaranteed to work?  Which kind would be best?Clear as mud?", "verified": false, "helpfulness": "0/0", "author": "Occam's Razor \"JSL\""}]