[{"rating": 5.0, "review": "Great device. Love my Apple mirroring ability with all my devices.", "verified": true, "helpfulness": "0/0", "author": "Arturo Carrillo"}, {"rating": 5.0, "review": "We are very happy with the Apple TV.  We watch something from it daily.", "verified": true, "helpfulness": "0/0", "author": "JLCT"}, {"rating": 5.0, "review": "Love it! Best thing ever!!!", "verified": true, "helpfulness": "0/0", "author": "happy kid"}, {"rating": 5.0, "review": "Everything was as listed, unopened, in perfect condition- works like a charm- \"thank you\".", "verified": true, "helpfulness": "0/0", "author": "bg"}, {"rating": 1.0, "review": "Other Streaming Devices I Have Work OK But This Apple TV Stalls & Drops Programs Very Often & No Amazon Movie Links. I Do Not Like This Apple Device Full Of Bugs & Now I Am Out The Cash For Junk Make By Cheap Labor TO DAM BAD NONE OF THESE TYPES OF CORPORATIONS Do Not Do AS Ford Did Back in The Day He Realized WORKERS SHOULD BE PAID ENOUGH SO THAT THE EMPLOYEES Can BUY PRODUCTS TO , HOW Many Apple Devices MADE IN THE USA ? I AM VERY UNHAPPY WITH THIS DEVICE Do Not BUY IT .", "verified": true, "helpfulness": "0/4", "author": "Tim Riggle"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jaime Daza"}, {"rating": 5.0, "review": "I've been using it for months and it works great. I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Bravette"}, {"rating": 5.0, "review": "LOVE IT! I just wish that the remote was bigger :( I already lost it.", "verified": true, "helpfulness": "0/0", "author": "sun kim"}, {"rating": 5.0, "review": "I've had this unit for just over a year and it has worked without issue since I purchased it. I have replaced my cable subscription to only Apple TV. and the apps that are on the system. I had another system prior to this that claimed to be true HD and wasn't, the connection was ok on that system but the video often lagged and would not play. I have not experienced that on this unit and I will admit I don't have the fastest internet from my ISP and even with 3 people online at a time I very rarely if ever experience a lag from the system.Pros:* Sleek Design* Easy To Setup* Amazing Connection Speed To WiFi Flawless video quality 1080p HD* Self Updates* Lots of channels* Never without entertainment* Mirror your iPad/iPhone without a loss in qualityCons:* Remote is annoying its nice and sleek but constantly getting misplaced due to size* Black design is nice but shows any dust that is near the system.* No notification when channels are updated or added", "verified": true, "helpfulness": "1/1", "author": "J. Morenus"}, {"rating": 5.0, "review": "Get this ASAP, it's great.", "verified": true, "helpfulness": "0/1", "author": "IBart \"Belize08\""}]