[{"rating": 2.0, "review": "I have the ROKU also and I have to say the ROKU offers way more.", "verified": true, "helpfulness": "0/1", "author": "Marion Palomino"}, {"rating": 3.0, "review": "I like the Amazon Instant Video integration, the fast response time and the video quality. I hate the fact that it does n't support wireless streaming from my macbook pro. Amazon be a grown up and please be reminded that you have n't released a lappy yet.", "verified": true, "helpfulness": "0/1", "author": "Raghu Kona"}, {"rating": 4.0, "review": "Great device.  Any flaw I have found is having to enter the PIN code for any show, whether on Prime or not.  This led to my kids purchasing a Wild Kratts because they thought it was included with Prime since they were entering the PIN for the shows that were included......wish you onlyhad to enter the PIN to make a purchase.", "verified": true, "helpfulness": "0/0", "author": "sandybeach"}, {"rating": 5.0, "review": "Excellent so far ---- I would appreciate more information on getting my Picasa photo files and Amazon music set up to use through the Amazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "Richard O. Marsh"}, {"rating": 5.0, "review": "Absolutely love it", "verified": true, "helpfulness": "0/0", "author": "mike wagoner"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "minh"}, {"rating": 3.0, "review": "I am not a techie by any means, but I like to think that I know a little about how to make these things work. I've been using the fire TV box for over a month now. I also have been using an Apple TV and smart TV for years. In terms of hardware, I believe the fire tv is pretty good considering the product specs and regular use. The remote and box are solid and basically look/feel as expected for the price. The bluetooth remote is nice because you don't need to point it at the box. But that's only part of it. You're buying this for it's USES and not just for solid construction and powerful specs. If it doesn't function well then what's the point?!! (so I'll review some of the apps as well as the box here)My partner and I recently moved and decided to try \"cutting the cord\" for tv. We already had to pay at least 50 bucks a month for internet access (not the fastest in the world at 25 Mbps but enough to stream decent video to 2 devices at the same time), and we didn't want to pay another $100 per month for the 10-15 channels we watched on cable. We had used Netflix and Hulu in the past so added those apps to the Fire TV, and later decided to try Sling TV when it debuted.  We don't have Prime membership, but have tried it, and even if we added that cost we would still be saving $30+ per month over cable. Here's the downside though...-If you are giving up the cost of cable tv, you also are giving up some nice features such as variety, DVR and On Demand. We didn't realize how convenient those were until they weren't available. I know the apps can be similar, but they don't quite offer the same level of service and choices.-There is a LOT of similar content that crosses over between Netflix, Hulu and Prime.  And by \"similar\" I mean the same.-The games are similar to what you would use on your phone. I don't use them on the tv because, frankly, they are easier to use on my phone or ipad.-The voice search is really convenient and works as expected, but does ONLY return Prime content. If Hulu has the same exact content AND the Hulu app is downloaded to your Fire TV (not sure if you're Hulu account needs to be active), then there is an option to watch that item using Hulu. If you select the Hulu option, it does bring the video up immediately through the Hulu app, which is nice. Netflix is not supported in the voice search at all. I've also searched something I knew was available on Hulu but only received the Prime content without the option to watch on hulu, so you have to check anyway before you buy. I find this annoying and will only use this feature to save some \"clicks\" if I know that particular video is on hulu AND the box will return the option to watch through hulu (what's the point?)-The Sling TV subscription only includes a few channels, and the app is not as seamless as we had hoped. There is no DVR function or on demand content. I know this is new, but don't think it's ready to replace cable and is a bit overpriced. Good news is that this is only monthly subscription so can cancel.-BIGGEST Issue - Every streaming app constantly freezes!!  I assumed this was a buffering issue so adjusted all settings (on box & in app) to lowest quality settings, and ran a hard wire ethernet cable from the router to the box. STILL  FREEZES!  So turned off every other internet connected device in the house... STILL  FREEZES!  Often the sound will continue while the video is frozen, and then after 15-20 seconds the video will catch up. But now I'm missing 20 seconds every few minutes... this is terrible!  I can say it's terrible because I have an Apple TV (2nd Gen) (which is not the latest 3rd Gen) and a Vizio smart tv (low end 2 1/2 years old) which both stream HD video flawlessly (and wirelessly) over the same network.  I realize that there may be issues with the apps on this new platform in addition to issues with the box, but in this case, one needs the other to function well in order to drive sales. I can't say for sure if the problem is getting any better or I'm just getting used to it over time (mostly because I prefer to use the other devices) but they need to make some improvements asap.I gave it 3 stars hoping Amazon can fix some of the problems with updates and keep me from giving this away, but my advice is to wait until some of these issues are resolved to make this purchase.", "verified": true, "helpfulness": "3/3", "author": "Pat Donaldson"}, {"rating": 5.0, "review": "Out the box, it took two minutes to hook up only because my dog kept messing with me. I have to say that I'm impressed with it. To me this is going to be the next big thing. A gaming system, Movies, TV SHOWS, and Music and a bunch of other things. For the price its not bad at all. Its like have your Kindle Fire HD and a Gaming Console all in one. Before I go, DON'T FORGET TO GET THE HDMI CABLE. One is needed. Amazon developers...Awesome job!", "verified": true, "helpfulness": "0/0", "author": "F. Williams \"Practice and you will master your craft\""}, {"rating": 5.0, "review": "Very easy to use, and loads of great content.  Allowed us to pretty much get rid of cable, so it paid for itself within the first month.", "verified": true, "helpfulness": "0/0", "author": "DM0392"}, {"rating": 5.0, "review": "love it but paying for Prime Membership doesn't give you all you expect.You still have to pay for some video", "verified": true, "helpfulness": "0/0", "author": "rachael polite"}]