[{"rating": 5.0, "review": "it's just great especially the voice command", "verified": true, "helpfulness": "0/0", "author": "Elmer D Hamblin"}, {"rating": 4.0, "review": "A well built and finished product with great interface -- if not a bit cluttered.It has one major flaw that prevents me from gifting the system to my family or recommending to others: No way to turn off the system short of unplugging it. Fail.The \"sleep\" function continues to consume data. Absurd.Fix it so the system shuts down from the controller and this is a real winner.", "verified": true, "helpfulness": "0/0", "author": "GranpaBear"}, {"rating": 5.0, "review": "In spite of an occasional buffering problem I greatly appreciate the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very popular within my family circle.  More convienent then my PS3 connection.  Glad I bought it.  Though not as fluid when it comes to the Netflix connection.", "verified": true, "helpfulness": "0/0", "author": "lorenzpl"}, {"rating": 5.0, "review": "We love it, cancelled Netflix and rarely go to Redbox anymore", "verified": true, "helpfulness": "0/0", "author": "Ronald Uhland"}, {"rating": 4.0, "review": "Great box, it is getting better all the time. The only issue I have is with the search function. It does not work with Netflix or Hulu.", "verified": true, "helpfulness": "0/0", "author": "Mike Andl"}, {"rating": 5.0, "review": "I am really enjoying my fire tv. It is very easy to use, and has excellent picture quality. Ya gotta love Amazon!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "LOVE IT!! I plugged it in myself - I am so none technical - it came on - gave me instructions and that was it. I love the fact that you can speak into the remote and say \"Owen Wilson\" and all of his movies come on the screen.Could not be easier to use.", "verified": true, "helpfulness": "0/0", "author": "S. Robinson"}, {"rating": 1.0, "review": "Nothing special about this item , I really wished I wouldn't have purchased it. Waste of money.It doesn't do anything your laptop can't do....I got it as a gift for someone and now wished I would have returned it he looked at it once.They want you to pay for Prime to get anything on it.So it's a small box that costs you money for stuff you can get cheaper elsewhere.", "verified": true, "helpfulness": "1/4", "author": "K of The Midwest"}, {"rating": 4.0, "review": "It appears Amazon has taken its cues from Apple TV in creating the Fire TV, and then taking it a few steps ahead. In design, navigation and ease of use, in my opinion, Apple TV still has an edge over the Fire TV (hence the 4 star rating). The Fire TV's build quality is about as good as the Apple TV, which is to say, excellent. Where the Fire TV has Apple TV beat is the sheer volume of supported Apps, including music, video, lifestyle and gaming. The voice search facility works well most of the time.While Apple TV is tightly integrated into Apple's iTunes ecosystem, Amazon's Fire TV is integrated into Amazon's ecosystem, where purchased movies, music and other content can be streamed on demand.Using the optical out (Toslink) connection, the audio quality is excellent. The video quality is excellent too, but here again the Apple TV has a slight edge. The colors from the Apple TV seem to have an extra \"pop\", but that is nit picking.Most people these days seem to be invested in both Amazon's and Apple's ecosystems for their online entertainment content.Therefore, in choosing between the Apple TV and Fire TV, I would say get both if you can afford them! Otherwise, the Fire TV would be better simply because of the volume of applications (including Spotify Connect, with Apple TV does not support) and functionality.", "verified": true, "helpfulness": "0/0", "author": "nagappa"}]