[{"rating": 5.0, "review": "Love it.  Still trying to figure out which content is prime and which is an addtional cost.  The voice control is fantastic- even recognizes a southern accent (Can't say that about Siri).", "verified": true, "helpfulness": "0/0", "author": "Laney"}, {"rating": 2.0, "review": "Ok I did do a review search and I did find reviews on \"Why no Vudu\" (ok maybe not worded that way) and I see no answer from Amazon? But for me that's a biggie and I see they have IMDB I was wondering if they get to the \"view content advisory\" link on IMDB?", "verified": false, "helpfulness": "0/1", "author": "daddyrex \"Rob\""}, {"rating": 5.0, "review": "Love the ease of use and number of programs offered. Good job Amazon.", "verified": true, "helpfulness": "0/0", "author": "Vickie Keown"}, {"rating": 2.0, "review": "Subscribed to prime at Amaon but when selecting TV shows and Movies in Amazon Fire still get get windows to get billed? ? ? ? ? ? ?", "verified": true, "helpfulness": "0/1", "author": "F. Weyerts \"Midgit Digit\""}, {"rating": 2.0, "review": "This worked perfectly since April - I'd been telling all my friends that it's so great that I ended up canceling my regular cable since my 5- and 4-year-old are able to watch whatever they want through our subscriptions via the Amazon Fire TV. Then just this morning it no longer connected to WiFi and had the error message, \"Connected with Problems.\" I even tried connecting my internet cable directly as Amazon Tech Support instructed me to and that didn't work. I had downloaded the Pandora and a couple of other music apps last night, so not sure if that has anything to do with it, though I don't see why it should. There was nothing else that was done to the Amazon Fire TV from one day to the next when it no longer worked. So far Tech Support has been unable to help me and I'm still waiting for a call back to get this resolved.There is no current fix on the Amazon.com troubleshooting page. PLEASE HELP", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This thing sucks data like crazy even when you aren't using it! And you can not turn it off. I have a 50 mbps connection and even when not streaming any content my homes internet drops to like 2mbps. This is terribly engineered and will return this POS.", "verified": true, "helpfulness": "3/8", "author": "Jordan Seavers"}, {"rating": 5.0, "review": "I have several Roku and Amazon devices at multiple homes.  I think Amazon has a really top quality device that delivers.  It's easy to use and the remote is high quality.  Sure beats having cable tv", "verified": true, "helpfulness": "0/0", "author": "Shark Reader \"Avid Book Reader\""}, {"rating": 5.0, "review": "This device is very easy to set up (just plug it in), and the screen display, voice search, and remote control make it extremely easy to use. I have a Tivo and a Chromecast, so I was already well wired with internet television. The main reason I bought the Fire TV was to get access to Amazon Prime video and to Showtime Anytime. Well, Amazon Prime is awesome, but I was extremely disappointed that my cable provider, Charter, was not among the supported cable providers. I was almost thinking of returning the device, but I quickly got hooked on its ease of use -- so, so, so much easier than Chromecast, and so, so much faster than my Tivo, which is bogged down by a slow internet adapter. So, I decided to keep it, and I find myself using it all the time. Well done, Amazon; I know the Charter glitch is not your fault.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a very nice addition to enhance watching movies or listening to music.  It has great features, one of the greatest being the voice command. It works perfectly and takes no time to display the information.", "verified": true, "helpfulness": "0/0", "author": "Barbara J. Ross"}, {"rating": 5.0, "review": "This thing is awesome!!!!  And the kids love it also. So easy to hook up and use.  If u don't have one now, get IT!!!", "verified": true, "helpfulness": "0/0", "author": "Kaleena Bettmeng"}]