[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Kenneth Persell"}, {"rating": 5.0, "review": "LOVE IT, LOVE IT, L O V E  I T ! ! ! ! !  We have a Roku & an Apple TV box.  Both are good. But the Amazon Fire TV blows them both out the water!!", "verified": true, "helpfulness": "0/0", "author": "I-Key-Doe \"Mike\""}, {"rating": 5.0, "review": "I think the product is great and keeps getting better! Keep up the good work! I own the Sony Google TV, and the Apple TV. I personally only turn the Amazon Fire TV on now... the others are going up for sale...", "verified": true, "helpfulness": "0/0", "author": "Just a guy shopping online"}, {"rating": 5.0, "review": "I have no negative thoughts on this unit. this unit makes your dull tv a smart tv and is great at what it does. I just upgraded to a smart tv so i have no use for this anymore but for the short time that i did use it, it was a great item. I do not use a cable or dish provider but i only use hulu, vudu, netflix, and amazon prime to watch my shows and this worked great.", "verified": true, "helpfulness": "0/0", "author": "James TC-AZ"}, {"rating": 5.0, "review": "Great fun and variety...takes me some time to learn all that can be seen but is pretty easy to use.  This was one of my  best Christmas presents!", "verified": true, "helpfulness": "0/0", "author": "betsy demp"}, {"rating": 5.0, "review": "Easy to set up.  Picture is excellent with my fairly fast cable internet.  The navigation with the remote is simple.  The voice search for Amazon videos works well.  I wish that the Neflix app had been pre-installed, but that was easy to do.  It would be nice if the voice search worked within Netflix, but it doesn't.", "verified": true, "helpfulness": "0/0", "author": "Neal R. Mielke"}, {"rating": 5.0, "review": "Bang.  This one you NAILED!  The \"streaming\" board in my sony TV went bonkers, and Sony wants $450 to replace the board.  $99 for Fire TV gave me the streaming and high quality sound I wanted without having any service man come to the house.  The device works great - gives me the best Amazon video browsing experience I've seen to date (much better than the Amazon app on my other TV or on my Xbox One.  Picture quality is great, and it connected to my dual-channel N network at top speed - giving me wireless, long range, high speed video in high def!", "verified": true, "helpfulness": "0/0", "author": "Dan Rogers"}, {"rating": 1.0, "review": "I initially received my Fire TV about a month ago, one month later, and i'm yet to have the pleasure of viewing a single movie on my Fire TV,  i have not been able to get it to work, even with a replacement, it still hasn't worked. So i'm left with a Fire TV box, that is absolutely no use to me. i've written to amazon several times, but this problem is yet to be resolved.", "verified": true, "helpfulness": "0/3", "author": "Horace C Baptiste"}, {"rating": 5.0, "review": "Love it. I have a smart TV, but the apps are SLOW and outdated. The Amazon Fire is FAST and I love the options and features. I have a Fire Stick too after trying a Google Chrome one. It was SLOW and locked up frequently.", "verified": true, "helpfulness": "0/0", "author": "TommieT"}, {"rating": 5.0, "review": "Simple install. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "J. Booth"}]