[{"rating": 5.0, "review": "I am very satisfied, to the point I'm no longer continuing my cable tv service.  I would recommend this to anyone considering purchasing one, you will be delighted with it.", "verified": true, "helpfulness": "0/0", "author": "Timothy Shrout"}, {"rating": 5.0, "review": "I was using apple Tv... Now i got fire... Much better thn apple TV... Apple Tv very slow... This one is really Fire...", "verified": true, "helpfulness": "0/0", "author": "Somesh bhai"}, {"rating": 1.0, "review": "This is my first review and I normally wouldn't write one but my experience was so bad that Amazon deserves a bad review. Purchased this a few months ago but have not really used it until last month. It was cool when it was working. All of a sudden, after some auto updates, my remote stopped responding.At first, I thought it was just bad batteries so I bought new ones but that didn't work. I looked the problem up online and some troubleshooting such as resetting Amazon fire TV and pairing it came up, tried both and no luck. I then emailed Amazon about the remote stating I've tried buying new batteries, resetting, and pairing the device and it still was not working. I received a response from them to call support for some troubleshooting. I didn't understand why I had to call support but I called them anyway.The 1st person I talked to told me to try and pair the remote with the fire TV (something I stated I've already done in the email) but I was away from home so I was told to call back. The 2nd time I called, I was hung up on. The 3rd time I called, I was then told to reset the Amazon fire TV (which I did) and the person on the line then proceeds to tell me, \"Maybe you need to turn on discovery in your settings.\" HOW THE HELL AM I GOING TO ACCESS SETTINGS IF MY REMOTE ISN'T WORKING? She then proceeds to transfer me to \"a more advance tech\" for troubleshooting who couldn't even verify my information to send a replacement remote. Never want to deal with Amazon customer service again!Tl:dr Amazon fire TV remote malfunctioned in a little over a month and had to deal with horrible Amazon customer service.", "verified": true, "helpfulness": "2/7", "author": "Jonathan"}, {"rating": 3.0, "review": "Pretty good device. Used to an Apple TV but this has need of some improvements.PROS:1) Voice search - this works great a real edge on competition I think. I have two kids and as long as they can say what they want they should hopefully be able to find and access content easily.2) Can watch and listen to Prime Videos and Music on TV. Get apps available other places too.  This is a nice feature lots of free music and video content available but does require Prime subscription.3) If you are an Apple User the iPhone and iPad apps for Fire TV work pretty good. Would be nice if rotation was enabled have to use iPad in page view.CONS:1) Buying single episodes does not discount an entire season (at least for TV episodes like Apple TV. Recently cancelled cable and did not get to watch the last episode of Better Call Saul so bought episode 10. To get the rest of the season it still reflected full price not full price minus episode 10 cost. So essentially have to pay for episode 10 twice if we opt to buy the full season. Requested a refund may get it... Hopefully this will change also sent feedback on this.2) Purchasing a whole season of something that has not yet aired through Prime still somehow does not show up for watching on Fire TV. Example: after buying TURN through web was not able to watch episodes 1-2 (only ones available for purchase as this season is just airing) on Fire TV. Not sure why this is buggy still perhaps.3) Kids Free Time does not work with Prime Video there is an extra fee to pay $2.99 a month or more for second childs account to access content that is already included with an adult Prime subscription. You can add purchased content to the kids section with no paid account. But if it is on Prime and I pay for Prime it should be accessible in the kids free time section too I believe not an extra fee to access it and then even more for additional kids which also by the way must register each app individually for each child account also. For instance Netflix must authenticate account with Parent/device account and then again for each child account, same for PBS KIds, etc. so I have 2 kids, total of 3 activations for each app (annoying). Also even in the kids area still get a prompt for which Netflix profile to use so kids could potentially select the adult profile for Netflix instead of the child one...and yes you can search and access things to you shouldn't be able to from a kids account... So be warned if using this as parental controls. Should be able to force a Netflix profile in the Free Time area for each kid so as to keep them out of an adult Netflix area. Good features in concept but needs some work.", "verified": true, "helpfulness": "0/1", "author": "ahudson"}, {"rating": 5.0, "review": "Can't say enough good things about this. In fact, I'm not going to say anything, except to say that it's fantastic. Bye, cable.", "verified": true, "helpfulness": "0/0", "author": "Michael McAuliffe"}, {"rating": 5.0, "review": "Beats my blue-ray dvd network", "verified": true, "helpfulness": "0/0", "author": "Bonnie L. Holt \"Bonnie\""}, {"rating": 5.0, "review": "Amazon Prime videos and rent on demand, this product is great.  I have the app on my phone for this and it works awesome together.  Great buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you want one of the smallest-form-factor boxes with absolutely quick intuitive response... this is the item you want. It streams all movies/series in a user-friendly manner. The remote has been WELL thought-out and the design is par none. Excellent work Amazon - keep up the great job! Anyone thinking of purchasing one... check out Amazon's 'used items' for what you desire. I have made many a purchases through the Amazon Warehouse and have been super-satisfied with each item.", "verified": true, "helpfulness": "1/1", "author": "U2strategy"}, {"rating": 4.0, "review": "Loving it so far.  Finally ditching cable abs the almost $300 a month bill.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "I Like It, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lois Tamburino"}]