[{"rating": 5.0, "review": "This is life changing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ChicBookChick\""}, {"rating": 4.0, "review": "This was a gift and I love it. Great video quality when wired to my network. Recently however it no longer works with Netflix.  Have seen a few other reviews with the same complaint.  Amazon video and Prime selections are good no complaint there. Not every service has all the movies you would ever want but the combination of Amazon TV (w/Prime), Netflix and the cable pay per view gets you almost everything.  Running Netflix through the DVD player until Amazon fixes the connection issues.  It's a shame bcs I assume Amazon is loosing money as Netflix users go to other devices (like me).  Having Netflix on Fire TV brings buyers to Amazon, Netflix not working on Fire makes them go elsewhere.The voice search is GREAT by the way.", "verified": true, "helpfulness": "0/0", "author": "DavidK"}, {"rating": 5.0, "review": "Excellent!!!", "verified": true, "helpfulness": "0/0", "author": "Joe V Lerma"}, {"rating": 5.0, "review": "Once we figured out how to set it up (hours), it works great.", "verified": true, "helpfulness": "0/0", "author": "Pat Schmidt Marquis \"Kindle2 Lover\""}, {"rating": 5.0, "review": ":)", "verified": true, "helpfulness": "0/0", "author": "Amanda H."}, {"rating": 3.0, "review": "Great concept, fabulous picture, and excellent offerings of TV and movies.  BUT, it keeps freezing up on me!  I've owned this for months, and this continues to be a major and annoying problem.", "verified": true, "helpfulness": "0/0", "author": "Nimicholas"}, {"rating": 4.0, "review": "Would have 5 stars if I could actually use HBO or Showtime through Comcast.", "verified": true, "helpfulness": "0/0", "author": "Jonathan M Lebedoff"}, {"rating": 1.0, "review": "Nothing special. Can't get redbox app. All the good movies still have to pay extra for because not on prime list and cheaper go buy most for $5 at Walmart than to rent from Amazon.  Might as well stick to Netflix app through phone because Amazon offers nothing more or different. Very disappointing if wanting to watch movies!!!", "verified": true, "helpfulness": "1/2", "author": "V.lee"}, {"rating": 4.0, "review": "It's okay but should have more choices for movies and download  of apps it's fine for what I need it.,one by way it's fast getting  movies and playing them.", "verified": true, "helpfulness": "0/0", "author": "Jose Sanchez"}, {"rating": 5.0, "review": "I have to say Fire TV worked seamlessly over my wireless network. It was easy to install and setup. Love the voice search feature.", "verified": true, "helpfulness": "0/0", "author": "DIY Grandpa \"SJCDAVE\""}]