[{"rating": 2.0, "review": "This is an OK devise. Not to happy with all the hidden cost when you start to use it though. Almost everything on it is an additional cost, even TV shows. I mean even old Andy Griffith TV shows are an added cost. Seriously!!!!! Come on Amazon. You are getting a hundred bucks for this and a hundred bucks for prime and now you want me to pay $3.00 every time I want to watch a tv show made 40 years ago. I was shocked. Yes there are a few things you can watch free but MOST of the options cost to see or play, yes even the games. I am probably going to return it and get my $100. back.", "verified": true, "helpfulness": "2/3", "author": "evright"}, {"rating": 4.0, "review": "Good content. Quick access to programming.  Like it.", "verified": true, "helpfulness": "1/1", "author": "Ron S. Bowman"}, {"rating": 3.0, "review": "Generally works as you'd expect for movie playback, no complaints for Amazon Prime video, but the Netflix app repeatedly has issues playing video that error codes say are network, etc, but they clearly aren't; this is pretty frustrating and a negative in comparison to Roku, especially since the marketing for this thing constantly draws the comparison.  Music playback, if you have digital music through amazon or have uploaded your tracks to their cloud, is great.  I haven't really used the photo aspect.  Games were touted as a big selling point, with the controller, etc.  Seems like a simple \"steam\" sstreaming app or something else is needed; as it their game support model is spotty and limited, and the games they do have that are exclusive you either already have on another platform or have something just like it.  So its an ok device with a lot of potential, but the lack of updates an mediocre experience for some of their apps that everyone KNOWS are going to be heavily used(i.e. Netflix) makes me concerned this is going to be an experiment and not the rock steady experience you expect when you just want to sit down after a long day and be entertained.", "verified": true, "helpfulness": "0/1", "author": "D. Chenault \"shares house with cats\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "1/2", "author": "Charles L. Bonfiglio"}, {"rating": 5.0, "review": "This is an awesome way to use my prime.", "verified": true, "helpfulness": "1/2", "author": "Joseph Bustos"}, {"rating": 5.0, "review": "Love my Amazon Fire TV. Has lots to offer.", "verified": true, "helpfulness": "0/1", "author": "Ginger Duncan"}, {"rating": 5.0, "review": "I am so happy with my FireTV that I am dropping my cable company. There are changes in the way we watch TV anyway but now I won't be paying for channels I don't watch. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "JnzWorld"}, {"rating": 3.0, "review": "I also have a roku and I like the way it is formatted a little better for searching. The fire voice search is great if you know what you're looking for but it doesn't browse as well. Fire seems to have more games than roku but that doesn't interest me.", "verified": true, "helpfulness": "0/0", "author": "Gene H."}, {"rating": 5.0, "review": "Fastest streaming box I own.", "verified": true, "helpfulness": "0/0", "author": "Fredrick Bartow"}, {"rating": 5.0, "review": "So fast and easy to use! Love using XBMC/kodi on it", "verified": true, "helpfulness": "0/0", "author": "Carlos Ochoa"}]