[{"rating": 4.0, "review": "Once I got the thing plugged in properly it was very easy to set up on my TV.  I am enjoying my prime choices and Pandora radio.  I am not finding a huge amount to watch on Netflix though.  I will use my 30 day trial and decide in that then.", "verified": true, "helpfulness": "0/0", "author": "Linda B. Sage"}, {"rating": 5.0, "review": "love it , easy to install, easy to use", "verified": true, "helpfulness": "0/0", "author": "GG"}, {"rating": 5.0, "review": "Exceeded my expectations. Should have purchased much earlier.", "verified": true, "helpfulness": "0/0", "author": "Derrick G."}, {"rating": 4.0, "review": "Christmas Present to ourselves.  Make sure you subscribe to Amazon Prinme, which we do, and dummies, yes, we were only using 1 out of the 5 Prime benefits.  Love it!  On a side note, I got off my butt and started checking out/downloading Amazon Prime music, which gas an outstanding library, again, all for $99 yearly.  Love the lyrics mode that comes with Prime Music, too.  A+.", "verified": true, "helpfulness": "0/0", "author": "Lise M."}, {"rating": 4.0, "review": "The interface is very user friendly, I would give it 5 stars but the device has issues when trying to get Netflix running. It does not come installed from the factory. When trying to install the netflix app it gives an error, what I did was do a system update and re-downloaded the netflix app; initially it gave the same error but started to download! The other con, which is minor, the voice search function only works within amazons apps. It does not work inside the netflix app.", "verified": true, "helpfulness": "0/0", "author": "Aaron B. Austin"}, {"rating": 5.0, "review": "Incredible technology one of the best buys on the market", "verified": true, "helpfulness": "0/0", "author": "William H Spoons Jr"}, {"rating": 4.0, "review": "We really like it. It was really easy to install. We were dreading that the process would be very complicated.", "verified": true, "helpfulness": "0/0", "author": "PayBear"}, {"rating": 3.0, "review": "Your product is good but it is watered down. Roku has you smoked in channels. And you needs a place for you personal channels. And also your voice search is alright and accurate. But useless I see no real need for it. Right now it just a novelty with no real value to the device.", "verified": true, "helpfulness": "0/0", "author": "Jerry Lee Greer"}, {"rating": 4.0, "review": "Fire TV works well and was easy enough to set up.  Works best for those who get their content from Amazon.", "verified": true, "helpfulness": "0/0", "author": "A. Raymond"}, {"rating": 4.0, "review": "Does what it said it would do. Very fast.", "verified": true, "helpfulness": "0/0", "author": "C. Thomas Payne"}]