[{"rating": 4.0, "review": "I like it and use it regularly. I just feel there is a lot you still have to pay to watch.", "verified": true, "helpfulness": "0/0", "author": "amber taratuta"}, {"rating": 5.0, "review": "The fire tv is awesome and fast. Very nice streaming device.", "verified": true, "helpfulness": "0/0", "author": "Bernard"}, {"rating": 5.0, "review": "Amazon Fire TV beats Roku and any of the built-in streaming apps on my HD TV...  Got my first HD TV (4K) recently and added the Amazon Fire TV to take advantage of all the Prime and for-cost offerings.  The available apps are fantastic and the streaming thru Amazon Fire is top quality  All the reviews comparing Fire TV vs Roku 3 and Chrome TV are correct.  The other's don't hold a candle to Fire TV !!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "George from Charlotte"}, {"rating": 5.0, "review": "This is amazing..!!!!!!!  I love it.....Very easy to install and very east to use.......I am totally enjoying this......And being a prime member I have thousands of free movies ....I also downloaded pandora with this and love it....It is also very fast to download any movie...I wish I had ordered this months ago......It was perfectly packaged and was delivered in 2 days....I am totally in love with this....", "verified": true, "helpfulness": "0/0", "author": "Rose Ronga"}, {"rating": 5.0, "review": "YES, IT HAS AND IS BETTER THAN I EXPECTED.BOB", "verified": true, "helpfulness": "0/0", "author": "ROBERT MURRAY"}, {"rating": 5.0, "review": "Awesome service ... I love it!! Easy to set up configure and use.", "verified": true, "helpfulness": "1/1", "author": "Scott E. Phares"}, {"rating": 4.0, "review": "Amazon fire installed just as easy as advertised. The selection of content available is great. We are enjoying it.", "verified": true, "helpfulness": "1/1", "author": "KKG"}, {"rating": 5.0, "review": "After using it for a month now. I can say it's super excellent and a must have entertainment system.", "verified": true, "helpfulness": "1/1", "author": "Rayan M. Alhussamy"}, {"rating": 4.0, "review": "My Amazon Fire TV arrived about 5 days after I ordered. First thing that surprised me was that it had my Amazon account information already on the set which was cool, lucky it was for me and not a gift. Very easy to setup and download the apps I want, i also installed XBMC which runs flawlessly.  I have a Roku3 in the front room, a Ouya out front... bonus the Ouya controllers will pair with the Fire TV WOO HOO!  I also have Wii, Xbox 360 and Xbox One so you can see i am very familiar with this type of media players.I very much recommend this media player.", "verified": true, "helpfulness": "1/1", "author": "M. Latham \"Mark L\""}, {"rating": 5.0, "review": "fantastic and easy to set up!!!!", "verified": true, "helpfulness": "1/1", "author": "Elizabeth H."}]