[{"rating": 5.0, "review": "I just love my Fire TV. The Voice Recognition is just absolutely wonderful. It even accepts whispers.", "verified": true, "helpfulness": "0/0", "author": "Corby"}, {"rating": 5.0, "review": "Easy to setup. Love how easy the remote is to use. Great deal overall.", "verified": true, "helpfulness": "0/0", "author": "Ellen Peterson"}, {"rating": 5.0, "review": "I really enjoy this streaming device.  It's easy to setup and I can sideload many of my favorite apps.", "verified": true, "helpfulness": "0/0", "author": "soyalozo"}, {"rating": 2.0, "review": "It arrived fast and was in good working condition - just as new. My disappointment with the product is that there aren't good enough apps and software for amazon Fire TV. For example, there is no web browser supported, no skype, facebook or other social media.The apps that are available do not seem to be well-built and do not seem to have basics.", "verified": true, "helpfulness": "0/1", "author": "Valderama"}, {"rating": 1.0, "review": "Does not stream very good.  Had to have a cable tech come out three times just to find out its the Fire TV.  Remote is so small I can't find it .", "verified": true, "helpfulness": "1/5", "author": "Jesse D."}, {"rating": 5.0, "review": "My second one. Works perfect.", "verified": true, "helpfulness": "0/0", "author": "Timothy J Dixon"}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "Susan Hart"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Sidney R. Hamby, Jr."}, {"rating": 5.0, "review": "I am very pleased with the Amazon Fire TV.  In addition to all the movies and TV shows available on the Fire - and a lot of them for free - I have access to my music and digital photos stored on the Cloud - all a big plus.  My husband and I are enjoying watching the old TV sitcoms from the '60's and early '70's which are far superior to the sitcoms shown today.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Connie J. Tritt"}, {"rating": 5.0, "review": "Well pleased with this product!", "verified": true, "helpfulness": "0/0", "author": "Patsy D. Scott"}]