[{"rating": 5.0, "review": "The simplicity of use is fantastic..  Quality great.  Easy setup.  One does need to be ready to speak immediately after tone, though, or computer does not think you are going to speak and breaks in with message.  I would like to see a second or two lag time.", "verified": true, "helpfulness": "0/0", "author": "astounded"}, {"rating": 3.0, "review": "Doesn't work well. Stops in the middle of streaming to reload. Returned it and bought the apple version which is perfect!", "verified": false, "helpfulness": "0/0", "author": "Asr1600"}, {"rating": 5.0, "review": "Absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Amber Sutton"}, {"rating": 4.0, "review": "Works like a charms", "verified": true, "helpfulness": "0/0", "author": "clark kelly"}, {"rating": 5.0, "review": "I've had this for three weeks and I love it.  easy to navigate menus, quick set up, and the ability  to play many android games on my tv.  I purchased the game controller as well just for that reason.  Since I purchased this I haven't turned on my old  xbox360 since this has all the apps I use.  Games are not next gen in terms of graphics or gameplay, but for the chance to get a shooter, racer, etc that is decent in gameplay and costs $45-$55 less than they do for the consoles is a big win to me.", "verified": true, "helpfulness": "0/0", "author": "IowaRaiderFan"}, {"rating": 5.0, "review": "I purchased my Fire TV about a month ago, and have barley used my Directv since then. The show selection is phenomenal, as is the picture quality. I love love love my Fire TV!!!", "verified": true, "helpfulness": "0/0", "author": "Tesa"}, {"rating": 5.0, "review": "I love it, it is great. Compact and I love the voice activation.", "verified": true, "helpfulness": "0/0", "author": "Ali"}, {"rating": 3.0, "review": "I thought I was getting something better than what I bought.  I apparently I misunderstood what I could stream for free.  It appears that I need to have a NetFlix and other monthly subscriptions to see what I wanted to view.  I'm going to have to keep cable to watch current news.  I do get to watch lots of movies...but I didn't buy it to watch movies - I wanted to watch TV shows.  Granted I can, but I have to have either subscriptions or wait for them to be part of Fire TV streaming for free.  It doesn't meet my expectations.  For instance, I have to pay $1.99 or $2.99 (depending on the episode) to watch season one of House of Cards.", "verified": true, "helpfulness": "0/0", "author": "Robin Rockhold"}, {"rating": 5.0, "review": "Easy to use. Nice to the touch. I love it!", "verified": true, "helpfulness": "0/0", "author": "Christian S. Delavega"}, {"rating": 2.0, "review": "Powerful hardware but lack of execution", "verified": true, "helpfulness": "2/2", "author": "Joey"}]