[{"rating": 4.0, "review": "Pretty nice to have all my TV apps in one place... Now if only we can get useful apps for the over the air TV channels NBC, ABC, CBS and FOX", "verified": true, "helpfulness": "0/0", "author": "'Meka Oh em gee \"'Meka Oh em gee\""}, {"rating": 5.0, "review": "its a beautiful little thing!", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 5.0, "review": "Had this for a week, streams prime and Netflix without any delays, wish I could also stream from my home network. but that is why I have the KDlinks 720. all in all top marks Fire TV", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "A really great piece of equipment.  It's still very new and have owned it for only a couple of months, but it certainly has exceeded my expectations.  I bought this simply to use at my cottage for 4 - 5 months a year in the summers.  I had previously been having one of the local cable companies fleecing me at at around $200 per month for their mediocre services and I decided I had enough of them and I started researching alternatives.  Ultimately I picked the \"Amazon Fire TV\".  I ordered it with a special promotion with Sling TV and had it shipped to my son's home on my travels to the north woods.  It arrived exactly when they said it would.  I was only at his home for a couple of days so I was hoping Amazon would not let me down on the shipping and they didn't.  The next morning I drove up to the cabin and also began to wonder if I really could install this myself as advertised.  I am not very handy and am absolutely thumbs and stupid when it comes to fixing or installing anything.  I have internet already at the cabin already so I did not have to worry about that, but I figured I had to trust Amazon that I could install it myself . . . hopefully without a lot of swearing and handwringing.  Long story short, I had it installed in less than 5 minutes and it worked perfectly from the very start and still does.My wife and I watch it everyday, she loves it and when she's happy . . . . I'm happy.  I am still learning \"new\" little features that ease my way through all of the content available.  We couldn't be more please with this product.  Plus, my new and improved viewing is costing me approx. $170 + per month less for better and more content.Amazon, thank you for another great product.  This is why I am a \"Amazon Prime Member\"!", "verified": true, "helpfulness": "2/2", "author": "jeff lawrence"}, {"rating": 4.0, "review": "So far so good.  This box is faster and more responsive than my fire stick.  Right now I use it for Netflix, Plex, and Youtube.  The only complaint I have is that the voice feature (Which works great by the way) isn't available while using applications like Plex and Netflix.  Otherwise I would have given it a 5 star rating.", "verified": true, "helpfulness": "1/1", "author": "Daniel"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Raj"}, {"rating": 5.0, "review": "I can not say enough good things about this! I've canceled my cable! My son loves his shows, especially Creative Galaxy! We own two!", "verified": true, "helpfulness": "0/0", "author": "Christina Carlson"}, {"rating": 5.0, "review": "Absolutely love this product. Super fast. Super easy to set up. I use it every day. The best streaming prodcut out there on the market.", "verified": true, "helpfulness": "0/0", "author": "VP"}, {"rating": 2.0, "review": "I jave been using this for a out 6 months. At firat we were so proud to have blown off our TV provider and be saving money and doing our own thing. Here are some things I wished I knew before I  bought this.All those apps cost money. The apps like sling (which doesn't offer the most popular shows on various channels), hulu, etc cost extra to subscribe to. Apps like espn and A&E; and Disney require you to have an account with a cable or satellite provider to log in to access the programming.This fire box is good to supplement an existing service but with all the money you can sink in potentially without most of the programming, it is not a great replacement for your TV service unless you don't mind giving up disney, cbs, tnt, espn and much more.Also there is a voice feature and what they don't tell you in large print is that they reserve the right to record you and there is no off button on its thing except the power cord. Also, this thing is a bit freaky, it turns itself on at all hours and turns on movies. I looked into many solutions including the sleep timer on my TV but even the sleep timer cannot turn on Amazon, pick out a movie, and press play. This happened on several occasions and I started having to unplug it  at night to avoid this scenario. One night it happened to me and I thought it was one of my kids so I yelled into the living room to turn off the movie. The movie paused itself and returned back to the home screen. I went to catch the kids with the remote and there was no one in the room, just me and Amazon. I have to keep my power strip off at night so it doesn't turn itself on and play freaky movies.I called amazon and they had no solution. I called the satellite TV people, they're coming tomorrow, for me... it just isn't worth the trouble. I miss my favorite shows, I'm tired of sinking money into subscriptions, I really don't trust that dumb box to not record me or turn itself on and off, and I'm getting tired of the same content.All in all I may keep it (unplugged of course) but I ended up going back to our satellite provider because I miss some of the shows, I miss my DVR, I miss prime time, I'm paying almost as much in subscriptions anyway, and it takes more of my energy than my TV used to.", "verified": true, "helpfulness": "1/7", "author": "ak102006"}, {"rating": 5.0, "review": "Satisfied on Content, Delivery, and Usability.", "verified": false, "helpfulness": "0/0", "author": "Maria Capone"}]