[{"rating": 5.0, "review": "Big fan of Fire TV.  Best streaming box around by far. Bought one for my mother and she loves it too.", "verified": true, "helpfulness": "0/0", "author": "Chad W."}, {"rating": 5.0, "review": "Like a  lot", "verified": true, "helpfulness": "0/0", "author": "Anthony Tress"}, {"rating": 4.0, "review": "Easy set up, easy to use, however ... the Prime option is a big disappointment, as all the programming I look at to watch is PAID meaning you have to pay for it and pay and pay and pay. I have not found one free option (other than the first episode of TV show series.) Other customers have mentioned this too and Amazon needs to listen, the \"free\" stuff should be a separate tab so I can find it, because right now I feel a bit tricked into buying everything. I thought Prime would include much more free TV. I love Netflix, flat fee and I don't have to worry about racking up a big bill on paid items. I understand the premium new movies having a charge like 'pay for view' / on demand' but old '70s films come on. 'Prime' or P is for Pay. The shipping option for heavy shoppers makes sense but the value for Prime movies/TV is just not there. The FIRE has four quad which adds to the quality, very clear images. The small size is wonderful, not some boxy plastic thing like Roku. I have only buffered once so that is positive. Four stars overall. If Prime was better than I would say five. Fire TV is great Prime not so much.", "verified": true, "helpfulness": "0/1", "author": "Heather Joyce"}, {"rating": 5.0, "review": "A breeze to set up and use! The bluetooth remote is a great feature. Finally a remote you don't have to point directly at the receiver to work right. The voice search feature is superb and work very well. A nice little unit.", "verified": true, "helpfulness": "0/1", "author": "Mikhaela"}, {"rating": 5.0, "review": "Works well, out of the box and simple to set up. Great option with sling TV for sports. Encountered some issues with espn3 and a wired connection.", "verified": true, "helpfulness": "0/0", "author": "Nick \"Nick\""}, {"rating": 5.0, "review": "We are debating on canceling our cable service cause we love this Fire tv so much . The only issue I have is with the voice remote , sometimes it does not understand what you are saying even if you speak clearly.", "verified": true, "helpfulness": "0/0", "author": "Susan C Scott"}, {"rating": 5.0, "review": "is everything it claimed to be", "verified": true, "helpfulness": "0/0", "author": "Michael Norton"}, {"rating": 5.0, "review": "I'm such a fan of Fire TV now.  I am seriously considering dropping my premium satellite channels, who needs them?  Then there's the games and the apps .  One thing though, make sure you have decent internet speed or the lag will really be a joy kill.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Fernando Hidalgo"}, {"rating": 2.0, "review": "My Fire TV remote doesn't work.  My wife has tried constantly to use the Fire TV without result.  Please replace the remote or direct me to an order site.  Please advise, thank you.", "verified": true, "helpfulness": "1/1", "author": "Dewey P. Regan"}]