[{"rating": 5.0, "review": "Best cutting the cord hardware", "verified": true, "helpfulness": "1/1", "author": "Michael J Metzler"}, {"rating": 5.0, "review": "so well designed.  My parents have a RoKu, and I've used it a little.  And, this streaming box is way better.  I use Amazon for my MAIN media source, so that may be a big part of my decision.  They DO, have a netflix app, on this box.  And it IS, different and better, than the netflix app on my parents box.  But back to the AMAZON PRIME part.  Their app, for amazon, is laid out SO nice and organized.  It makes, the whole media library, a pleasure, and easy to get to.  And the VOICE search, is spot on, accuracy.  Not like those voice assistants on the telephone.  That understand you, sometimes.  This has NEVER missed.  Even with a mouth full of food.  NEVER MISSES.", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 5.0, "review": "This has been the best thing ever for my son. Watch movies and can play games all on 1 device.", "verified": true, "helpfulness": "1/1", "author": "Connie Talley"}, {"rating": 5.0, "review": "awesome with Prime.", "verified": true, "helpfulness": "1/1", "author": "James Elkins"}, {"rating": 5.0, "review": "awesome device, my wife loves it, easy to operate", "verified": true, "helpfulness": "1/1", "author": "John L. Fay"}, {"rating": 5.0, "review": "Love it!", "verified": false, "helpfulness": "1/1", "author": "Carly grace perna"}, {"rating": 5.0, "review": "Everyone loves it!!!", "verified": true, "helpfulness": "1/1", "author": "Jeffrey A. Strauser"}, {"rating": 5.0, "review": "I cannot say how happy we are with the Fire TV. Exceeded our expectations!!  Head and shoulders above the Apple TV it replaced. Pair it with Prime and it is an incredible bargain.", "verified": true, "helpfulness": "1/1", "author": "George Wentz Jr"}, {"rating": 4.0, "review": "I am pleased except the HBO did not work without a subscription!  I am sorry for that and would have given 5tars.", "verified": true, "helpfulness": "1/1", "author": "Mary Madeleine Kroneberger"}, {"rating": 5.0, "review": "Great product! Looking forward to the addition of more shows and movies but the set up is much better than Apple tv", "verified": true, "helpfulness": "1/1", "author": "Allison"}]