[{"rating": 5.0, "review": "Easy to hook up and works great.", "verified": true, "helpfulness": "0/0", "author": "Donna Brawner"}, {"rating": 5.0, "review": "So far I've only watched movies but it's very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Hydrogibbon"}, {"rating": 2.0, "review": "First, you WIFI need to be in the same room, or you will not able to find it. I but the fire TV in the dinner room,and my cable just in my living room.Second, buy it when it's in deal. I just brought it for 7 days, then 15$ off!", "verified": true, "helpfulness": "0/7", "author": "April"}, {"rating": 3.0, "review": "the only major problem so far is the videos in \"YouTube\" keep getting stuck after several minutes. (it started 2 days ago)", "verified": true, "helpfulness": "1/2", "author": "YS"}, {"rating": 3.0, "review": "does not turn off when not in use needs off switch.", "verified": true, "helpfulness": "1/4", "author": "James Rawlings"}, {"rating": 5.0, "review": "I will probably buy another one of these.  Who needs Apple TV or cable On Demand (both of which charge $4-6 per movie) when, for $99 total, you have thousands of movies at your disposal (assuming you have Amazon Prime).  If you are a Prime user and own a TV, this is a must have.", "verified": true, "helpfulness": "0/0", "author": "Eric in TX"}, {"rating": 2.0, "review": "I like the FireTV overall, yet the BIGGEST DETRACTOR for me is trying to use it to watch content via Hulu.  Frequently when watching a show, the screen will freeze while the audio continues.  The picture returns sometimes after a minute or two, sometimes never.  I have to try and go back to a point where it synched video and audio.  HOWEVER, there is neveer a problem when viewing commercials.  It is as though the commercial always get preferential treatment while the normal video is \"what the heck, try to show it but give up if i cant do it easily.\"Another problem this day and age is trying to find someone involved with the product who really cares about things such as this.  Most times, they shrug their shoulders and say there is nothing they can do.  BULL DOGGIES!  Care about the product you support, otherwise your product will tank,", "verified": true, "helpfulness": "3/4", "author": "K. Welty"}, {"rating": 2.0, "review": "I really wanted to like the FireTV, its a great concept but poorly executed and supported.  My biggest complaint for the week and a half I had it was that unfortunately too few apps are supported and what is supported are older versions that are very limited in features.The hardware itself is very nice, the setup process was little over simplified.  Those of us who are technically don't really want to sit through a long video or step by step setup process.I ended up returning the product.  I really hope it matures and sticks around but for now I prefer my Chromecast dongles.", "verified": true, "helpfulness": "2/3", "author": "M. Mead \"Yzerman\""}, {"rating": 3.0, "review": "This product sounds great.  But as a hockey fan living far away from my favorite team, I will not be buying this until NHL GameCenter is available.  If Roku and Playstation have it, then Amazon should be able to offer it.", "verified": false, "helpfulness": "1/3", "author": "Andrew Phillips"}, {"rating": 4.0, "review": "Like it but I don't use it enough , need more newer releases", "verified": true, "helpfulness": "0/0", "author": "Randy Rader"}]