[{"rating": 5.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Victoria Dreyer"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Praveen Verma"}, {"rating": 1.0, "review": "I have purchase refurbished items before with no problem.  This item was frustrating as it worked at random intervals.", "verified": true, "helpfulness": "0/2", "author": "Bruce C."}, {"rating": 5.0, "review": "Exactly as described. Very easy to set up. Streams wonderfully clear.  Haven't attempted Kodi yet, but I've heard that works really well from friends who have.  Sorry I can't go into much more depth but I haven't toyed around with it as much as I would like.I do wish that there was an actual \"off\" feature. Or at least, I haven't figured out if there is a way to turn it off.  Currently you just have to wait for it to put itself to sleep.Would be nice if it came with an HDMI cable, but it doesn't. Not a deal breaker.  I'm sure you read that in other reviews too :-).Another friend told me of a great use for the Fire TV - one in any bedroom that you don't want to put a cable box in. I think it's ridiculous that cable providers force you to rent a cable box for every TV, even if you just want basic channels.  If you want to have something simple in each room, you can get a Fire TV (or Fire TV stick) and then stream from there.  NetFlix, Prime movies, HBO Go, etc.  Especially good idea if you get Kodi installed :-).Enjoy!", "verified": true, "helpfulness": "0/0", "author": "P. Reed"}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "lakisha henderson"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Mariuccia \"Uccia\""}, {"rating": 5.0, "review": "Sounds like a real break-through in terms of price and specs as well as offering the gaming part which is missing from other boxes.When will it be available in Europe? Can't wait to get it :)", "verified": false, "helpfulness": "0/0", "author": "Andrew Cogdell"}, {"rating": 4.0, "review": "The Fire TV is great, it does everything I could want and more. After getting this I disconnected our cable and save a ton of money. With Xbmc/Kodi installed I can watch all the shows I want plus movies and more.", "verified": true, "helpfulness": "0/0", "author": "FJ"}, {"rating": 3.0, "review": "Still getting used to it and trying to determine if it was worth the expense. Most Amazon-related products are super easy to use but this one has been a challenge.Not quite what I had thought it was going to be.", "verified": true, "helpfulness": "0/0", "author": "S. Renee Wright"}, {"rating": 5.0, "review": "For $99, this baby is loaded with features. Seems to be a much better value than the other options on the market, and the Amazon Prime tie-in is a game-changer.", "verified": true, "helpfulness": "0/0", "author": "Sarn \"Paul\""}]