[{"rating": 3.0, "review": "i'm not a huge fan.  The Amazon Fire TV was relatively easy to set up and to use, but he picture quality is poor.  Although, I changed the settings it picture is dull and dark.  I was expecting it to have a clear, sharp picture as a smart TV does.", "verified": true, "helpfulness": "0/1", "author": "Judy DeWeese"}, {"rating": 5.0, "review": "We received the Amazon Fire TV and it was easy to hook up.  We have been catching up  on all the tv series that we missed, and are enjoying having movies to  watch.  We are thinking about canceling some of our movie channels as this gives us more movies and tv shows to watch than we have time for.  We would recommend as it is a good deal.", "verified": true, "helpfulness": "1/1", "author": "janice hulen"}, {"rating": 5.0, "review": "LOVE LOVE LOVE this little doo-hickey!  We have have three Rokus in our house but got this for Prime Content and all the games! FUN!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "This is ok, However I really do not have much use for it.  the only thing that works for this is the fact that you can use your tv and you are able to not strain yourself by using a laptop or ipad", "verified": true, "helpfulness": "1/3", "author": "S M Perez"}, {"rating": 3.0, "review": "I would have to say that it's an overall pretty good streaming player. I wish the interface was a little more polished, but I think that will come in time. The voice search I wish brought up the results via different apps. Not just a list of shows. I also feel like it brings up only prime shows when you search, which kinda makes sense because it's a piece of Amazon hardware. That may be what it's supposed to do... I honestly don't know. I came from using a Roku 3, who's search is way better even though it isn't voice controlled.I like it, I just want to see it polished up a bit more.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It is not too bad but practicallly not my taste. the game is ok but hard to add more games. Not flexible. Watch movie is fun and very clear.", "verified": true, "helpfulness": "1/3", "author": "EMIZE"}, {"rating": 3.0, "review": "The voice search works great.Set up was very easy.The remote is very small and easy to misplace.To use it you need very good internet service.", "verified": true, "helpfulness": "0/1", "author": "James D Groves"}, {"rating": 5.0, "review": "My husband and I love Amazon Fire TV! It was very easy to install, and we have been able to watch countless hours of free movies on our TV! I waited to write this review because I wanted to see how this product worked for a while, and to see how much use we would really get out of it, and we could not be more pleased with this purchase. It was worth every penny.  The only thing that I do not like is having to have more than one controller, but I feel like that is a minor detail.", "verified": true, "helpfulness": "1/1", "author": "Jeannette N. \"Jeannette N.\""}, {"rating": 5.0, "review": "Now, I have owned the FTV since day 2 of its release (and recently got a second FTV) and my overall experience is very positive. I have watched a ton of prime tv shows ( many seasons of different shows) and I have not experienced a single rebuffer during any of those. So kudos for the streaming service so far.Let me get my gripes out first because there isn't many.Side loading apps is my biggest gripe, I dont mind side loading apps, I just want my side loaded app to be able to be launched from my home screen. Having to go to settings/applications/finding the app, clicking on it and then having to select launch app is a bit much especially considering you have to do it every single time you want to launch the app,I am trying to make FTV into my all in one media experience which includes live OTA tv. The only way to get live tv was to side load xbmc and use its live tv function with my hd homerun tv tuner. Having to launch xbmc through settings is not a wife friendly way of doing it.Storage is going to be an issue and one I think they need to remedy quickly. I am already down to 1 gig left (on my first FTV) and that is just with a handfull of games. They really will need to open up the usb port to allow for more storage.As for quality of games, there are a few games out there that I think could compete with with the console generation, I just wish and hope more will be developed for the fire tv,And my last real gripe is really more my impatience then anything else but the apps just dont seem to be coming quickly enough for me.I give it major props though, I have only had to power it off and on one time and that was due to a games sound track continuing to play when the game I was playing crashed.My overall feelings for the FTV is if you are a kindle fan, then this is just another extension of the kindle and you will be happy with it.  It certainly competes with roku and others for what it does and they have already stated more is coming for it, Its just a matter of how long do we have to wait. The only real question is will they be able to do it on this current hardware or are we going to have to endure many hardware revisions?", "verified": true, "helpfulness": "2/2", "author": "D. Cole"}, {"rating": 5.0, "review": "Best packaging I have ever seen. Neatest fit for everything. Easy install and start up. Works great. Just wish there was an option to only see free shows and movies.", "verified": true, "helpfulness": "0/0", "author": "Dale Arbush"}]