[{"rating": 5.0, "review": "If you want a device for streaming tv shows and movies while having some entertainment with video games this is the perfect combo!", "verified": true, "helpfulness": "0/0", "author": "Joye Philavanh"}, {"rating": 5.0, "review": "WOW truely awesome. this is a very compact and easy to use unit.", "verified": true, "helpfulness": "0/0", "author": "Kenneth R. Horton"}, {"rating": 5.0, "review": "We haven't had cable for over 3 years.  Roku 2 and Roku 3 have been our main source of TV entertainment since making the decision to ditch the cable, and also a brief stint with AppleTV that we just didn't care for.  We are loyal Amazon customers and have always enjoyed Amazon brand products (kindles, kindle fires...) so when we heard that Amazon came out with their version of Roku/Apple TV, we knew it was only a matter of time before we tried it ourselves.We got it last night and so far we love it.  It it as easy to use as the Roku, which I think is easier than Apple TV.  The quality is great and the speed is unbeatable.  As soon as we connected it, it updated itself right away.  Then during set up, it detected that we needed to adjust the screen to fit our TV, so it walked us through the process without us having to look around for the directions...Basically: its smart.The remote is very easy to work...We have played around with the voice search option a bit and it has worked perfectly each time.AmazonPrime is pre-loaded, so it could be kind of confusing at first if you're used to a different set up.  AmazonPrime isn't an app like Netflix, Hulu, Plex, etc.  It's just there.  But easy to get used to.Also, one thing we really, really like compared to Roku, is that the machine turns itself off when idle whereas Roku is always on, which we feel burns out the server on the machine itself.  Our Roku 2 is completely burnt out and we haven't used it as much in the last year and a half since getting the Roku 3, which itself is slowing down.I think this is a great product.  Amazon is really good at putting out first generation products and improving off of that.  If you're on the fence, about getting a streaming device, I think this totally holds up. I hope they put out an MP3 player to rival the iPod!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"mmw\""}, {"rating": 5.0, "review": "In my quest to have decent tv to watch without giving a fortune to cable & satellite providers I have found this little box to be worth every penny. I became a prime member because I buy almost everything from amazon now so the free 2 day shipping had me sold. Needless to say the free tv they supply members is awesome. I bought a Netflix membership so I have almost everything I love to watch without the high monthly fees. If you have appropriate internet speed I highly recommend this device!!", "verified": true, "helpfulness": "0/0", "author": "EL Johnson"}, {"rating": 1.0, "review": "Will not connect to my Internet. I have tried both the ethernet cable and wifi. The box keeps losing connection before I can even type in the password. I have plenty of other wifi devices that work perfectly in the same location. This is a huge headache.", "verified": true, "helpfulness": "3/6", "author": "Fox Mulder"}, {"rating": 5.0, "review": "Good by Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 1.0, "review": "This is a very nice device in terms of response times (significantly faster than appleTV, though this is expected given it is a far newer device) and the menu is quite nice.  However, it has major issues with netflix. Specifically, netflix does not work with this device.  Checking forums here at amazon it is clear that there are a lot of people with the same problem and as far as I can tell the workaround that sometimes works is to reboot router, modem, and fireTV every time you want to use netflix.  This seems like a poor option to me, so I'm going back to my appleTV.  If you are desperate for amazon prime, this might be a good purchase but if the new appleTV supports amazon then there is no reason to buy this.", "verified": true, "helpfulness": "1/3", "author": "Xgate"}, {"rating": 5.0, "review": "We have always bought Roku in the past but one of our TV's had a older one so we went with the Fire TV......Guess What? we loved it so much we are giving all our other Roku boxes to family and buying two more.  The speed is incredible and blows Roku away. My MLB app use to always try to reload three or four times during a game (always during a important play), with the Fire...NO MORE...Love that you can just talk in to the remote and pull your shows up.  If your on the fence which box to buy (Roku, Apple and etc)....buy this baby and you won't regret it a bit.  It is still adding a lot of Apps, so be sure and check that your App is on there but I know Amazon....they will catch up with Roku and out do them.  I am a Prime Member and love every thing it offers....free books, music and shipping.  Also please go to Amazon Smile when you buy stuff and a portion of your money goes to your favorite charity and Amazon lets you pick the the charity you want it to go to.  Mine is the Indianapolis Humane Society.....Thank you Amazon.....:)", "verified": true, "helpfulness": "1/1", "author": "nosferatu_deb"}, {"rating": 5.0, "review": "I have used about over a month. For us that we don't want cable and will not waste our money paying for channels that we might never watch, Amazon Fire TV is just great.", "verified": true, "helpfulness": "0/0", "author": "Priscy"}, {"rating": 3.0, "review": "Nice hardware, poor software.  You would think that after buying their hardware and paying for Prime, Amazon would allow you to find free content with ease.  Au contraire.  The interface is very confused.  Returned.  Will re-consider once the interface improves.", "verified": true, "helpfulness": "0/0", "author": "ELT"}]