[{"rating": 4.0, "review": "only used it a couple times, but wanted it to see if we could get Amazon Instant video to stop \"pausing\" in the middle of movies.  This seemed to do the trick on the first 2 we have watched.", "verified": true, "helpfulness": "0/0", "author": "Scott Whitlock"}, {"rating": 3.0, "review": "Connected this and immediately began sideloading it. 3 hours later it was factory reset and repackaged with a return label on it. Spent another $100 and got a small pc instead. Seriously the best way to have a smart tv with full internet capability. The Fire Tv is just another limited media streaming app based device- after buying apps and installing android apps I still wasn't satisfied. Good technical specs on it though.", "verified": true, "helpfulness": "0/1", "author": "Brian Collins"}, {"rating": 5.0, "review": "This is the best purchase I have made in quite a while.  Before getting Fire TV I used a Blu-ray player to stream which was acceptable.  The Fire-TV is incredibly small and the voice searching works very well.", "verified": true, "helpfulness": "1/1", "author": "K. Hooper"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "1/2", "author": "ALVIN"}, {"rating": 5.0, "review": "Love this. It's easy to use, my 6 year old doesn't have a problem. You can watch tv, play games, music, or whatever is your fancy. Definitely better than Apple TV", "verified": true, "helpfulness": "1/1", "author": "whitney mcvay"}, {"rating": 5.0, "review": "Amazing item. Great alternative to an additional cable box.", "verified": true, "helpfulness": "1/3", "author": "Justin Thatcher"}, {"rating": 4.0, "review": "While I LOVE how easy it is to find programs the whole family can watch, I don't like how easy it is for a program to be purchased. There are no warnings, approvals, or precautionary measures to guard against accidental purchases.  My 7-year old can easily find programs she wants to watch, but if she clicks too quickly, she's purchased a show without realizing it.That being said, I love how small it is. I love that whatever I purchase stays in my library. I love that I can purchase entire seasons of shows that we watch and not pay as much for monthly \"cable\" service for shows we aren't watching.", "verified": true, "helpfulness": "1/1", "author": "Hope Griffith \"HGriffith\""}, {"rating": 5.0, "review": "Before I bought this, Amazon and Netflix were streamed through a Panasonic blue ray player. There was a constant problem with buffering and poor quality picture. Sometimes it was so bad, it became unusable.I bought the Amazon Fire TV device on the advice of a Best Buy sales person. I took it home and had it hooked up in less than ten minutes. It works perfectly! No more buffering. The result is instantaneous display of anything selected. The picture quality is the very best high definition I've seen anywhere. The remote has the ability for the user to speak a title, or other search item such as director, etc. I've tested it in many ways and it has performed with 100% accuracy and with super fast response. Speak the words, \"Jimmy Stewart\" and you get a near instantaneous listing of every movie for that name.The remote is very well designed and intuitive, little or no learning curve. There's even a quick video tutorial that automatically comes on the first time you use the device that gives clear instructions.The device has been in use for two weeks and has performed flawlessly. At last, stress free entertainment with the very best in quality viewing and trouble free performance!Don", "verified": true, "helpfulness": "3/3", "author": "Don"}, {"rating": 5.0, "review": "easy to use. fast and smooth. picture quality is vey good. awesome product!", "verified": true, "helpfulness": "0/1", "author": "W.Yu"}, {"rating": 5.0, "review": "I've been using this for a couple weeks for Prime video and HBO GO. Works well. Nice small unit. Very easy to hook up and operated.", "verified": true, "helpfulness": "1/1", "author": "Buysalothere"}]