[{"rating": 4.0, "review": "I love this and use it all the time. It's super easy to use. The only annoying thing is that when you do searches, it doesn't search Netflix.", "verified": true, "helpfulness": "0/0", "author": "Dana Weinreb"}, {"rating": 5.0, "review": "Good  selection of  movies and TV shows", "verified": true, "helpfulness": "0/0", "author": "Elaine"}, {"rating": 4.0, "review": "I have been very happy with my Fire TV except for one potentially serious problem.  The good is that most of the time it does what it is supposed to do at lightning fast speed.  Its interface is intuitive and easy to use.  Set-up was a breeze.  The bad: after about two months of service it began to give problems.  Buffering couldn't keep up with streaming even using a 75 Mbp wired connection .  Streaming was constantly being interrupted with error messages.  I tried resetting the Fire TV and my router plus all other recommended solutions.  The only thing that finally worked was unregistering and reregistering the Fire TV with Amazon.  I hope this is a firmware bug that Amazon will fix and that the problem does not recur.  Otherwise this potentially 5-star accessory will fall to 3-star or lower in my ratings.", "verified": true, "helpfulness": "1/1", "author": "Richard Rodewald"}, {"rating": 5.0, "review": "This is one of the best purchases I have made in a long while. Very easy to hook up and we were watching within minutes. We haven't watched anything on Amazon yet as we don't have Amazon Prime and most everything costs at least $2 to view. The voice search on the remote does work really well though. We bought Netflix and for $9 a month have more choices than we ever did with our satellite dish at about 8 times that cost. We may purchase Prime in the future, but for now we are very happy with the streaming capability of the Amazon Fire and the shows available on Netflix. Would be nice if the voice search worked for Netflix too, but you can't have everything.", "verified": true, "helpfulness": "0/0", "author": "R. Lindey"}, {"rating": 1.0, "review": "Amazon Fire TV has great difficulties streaming. Our other devices have no problems, whatsoever. Plan on having your videos constantly interrupted and your system freezing up if you purchase this device. I've contacted Amazon repeatedly and even their recommendation of clearing the cache and data doesn't permanently fix it. Find another streaming source.", "verified": true, "helpfulness": "3/5", "author": "Teacher Tia"}, {"rating": 4.0, "review": "This has been one of my best purchases recently as I work to establish a set-up to go entirely to streaming for my TV programs and services. This device offers access to many streaming services and I continue to explore all the possibilities which are available. I've already recommended this item to many of my friends some of whom have already added it to their streaming arsenal.", "verified": true, "helpfulness": "0/0", "author": "TheChaNar"}, {"rating": 3.0, "review": "Might work for some...too confusing. Saw no way of \"dropping my cable/satellite thanks to this. But yeah...the voice remote works great.", "verified": true, "helpfulness": "0/0", "author": "CaliKid68"}, {"rating": 5.0, "review": "I had been using Apple TV for almost three years, but decided to give this one a try, Incredible difference, Games, Amazon Prime Streaming, Plus anything that the apple TV Does, Runs smoothly, NO REGRETS !!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Sergio Aguero"}, {"rating": 5.0, "review": "Really enjoy  Fire TV, easy to set up and navigate.", "verified": true, "helpfulness": "0/0", "author": "kidbell"}, {"rating": 1.0, "review": "I got the device 3 months ago, it stopped working after that.The audio gets muted in middle and i need to restart the device every 10 min to get back. During Video play back i get video cannot be played even though the network is still looks good. This was the biggest mistake to choose fire tv.", "verified": true, "helpfulness": "2/4", "author": "Sandhya Balamurugan"}]