[{"rating": 1.0, "review": "No enough apps, essentially a total waist. Better of getting a roku or even the dreaded Apple TV. If you must have one, it does a fine job of running XBMC.", "verified": true, "helpfulness": "2/6", "author": "Damion"}, {"rating": 5.0, "review": "good!", "verified": true, "helpfulness": "0/0", "author": "Henry Stevenson"}, {"rating": 4.0, "review": "Great product, works well. Recommended.", "verified": true, "helpfulness": "0/0", "author": "DMac"}, {"rating": 5.0, "review": "This is a great product.  Very simple to install and excellent quality.  Would highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "NRHgal"}, {"rating": 5.0, "review": "I use this device for basically three things:* Streaming Prime Instant Video* Watching stuff via WatchESPN* PandoraIt is super easy to find content on using this device.  Navigation is a snap.  The voice searching simply works.  It took only minimal effort for me to teach my non-techie wife to use it.The only thing I wish it had was an app that would restrict instant video search to ONLY the free prime instant videos.  Other than that, though, this is a great device.", "verified": true, "helpfulness": "1/1", "author": "Ken Sodemann"}, {"rating": 5.0, "review": "I was very surprised at the small size when it arrived. I bought the first one for my mother to start using and get to know how to use it. It was easy to hook up and started working instantly. I plan to buy at least 2 more for my house.", "verified": true, "helpfulness": "0/0", "author": "Donald E. Bowen"}, {"rating": 2.0, "review": "I thought by getting this product I would be able to get rid of cable. I did not know that everything that I want to watch I have to pay for, very disappointing...is there anything free???", "verified": true, "helpfulness": "2/4", "author": "Regina Zymantas"}, {"rating": 4.0, "review": "I use it all the time but just read about people going over their alotted data from their isp.  For the first time it has happened to me and never thought much about it cause never got close to it before.  I was reading about someone else going over their caps and I haven't change my viewing habits that much and for the first time I was considering getting a larger data package but looking over past history never got close.  Everything works great on this the only thing I would change is let the voice search work for all apps not just amazon you still have to type your search on netflix or I haven't figured it out yet on how to do it.  When you talk into it and you are in another app it kicks you out to amazon.  Oh yea more apps.  Getting back to going over data limits I was reading that if you turn off the screensaver that may be the issue.  Love the screensaver but turning it off so I dont go over limit.  Still a cool product.", "verified": true, "helpfulness": "0/0", "author": "Charlie Hollaway"}, {"rating": 1.0, "review": "This fire tv is a piece of junk no off button almost they want you to leave it on all the time so they can keep data flowing all the time.as for the fire just a piece junk safe your money get a x box or ps4 you will enjoy it so much more", "verified": true, "helpfulness": "2/11", "author": "steve rummell"}, {"rating": 4.0, "review": "This product works exactly as advertised, it is fast and very responsive. Integrates well with Amazon's services and the apps and games that are available for it work great. I own an Xbox One and use that or my Smart TV's when at home for accessing these content providers. I was looking for something similar to use when I travel (quite often) and this brings the best of both worlds. I was debating between this and the Roku Stick (which I tried, and is phenomenal by the way) I know its not apples to apples here, but I was really compelled by the Roku's small size. I eventually settled on the Fire TV because it has the ability to play games. It's like having a mini-Xbox in my suitcase (obviously the graphics are not the same, but you get the point...)The one star deduction is because some of the games (like sonic) though the controls are simple, require the additional amazon controller. I think the controller should be reserved for more complex games. Also the Wi-Fi is complicated to setup in a hotel environment because the Fire TV does not support the captive portals which are needed to register the device with the network. Calling the front desk usually works but it would be nice if this feature could be added in at some point.", "verified": true, "helpfulness": "2/2", "author": "spacerat60"}]