[{"rating": 3.0, "review": "Works as described.  Limited apps and support for apps for DirecTV customers.", "verified": true, "helpfulness": "1/2", "author": "Jeffrey  A. McFadden"}, {"rating": 4.0, "review": "Truly compact and pretty easy to use.", "verified": true, "helpfulness": "0/1", "author": "S. Villarreal \"Sylvia V\""}, {"rating": 5.0, "review": "LOVE It!!!  We bought another...", "verified": true, "helpfulness": "0/1", "author": "unknown"}, {"rating": 5.0, "review": "I am geting addicted to fire tv. Ez to use, very ez to setup.", "verified": true, "helpfulness": "0/0", "author": "Eoghan Roe \"eugene walton\""}, {"rating": 5.0, "review": "Helps with movs", "verified": true, "helpfulness": "0/1", "author": "Joseph"}, {"rating": 5.0, "review": "The first remote broke within a week; Amazon replaced without a hassle. The user interface has a lot of minor anoyances but for the price it is awesome. Plus, made me pay for Amazon Prime to stream the things I wanted - I couldn't live without the 2 day shipping now.", "verified": true, "helpfulness": "1/1", "author": "eldergod0515"}, {"rating": 5.0, "review": "Do you need cable or satalite or fios to watch ?? Can you watch live prime time shows ie: ch. 3,6,10, ?", "verified": true, "helpfulness": "0/3", "author": "J W H"}, {"rating": 5.0, "review": "GREAT!!! Especially if you don't want to have to pay for On demand or things like that. This gives you free movies, apps and more! Couldnt have been more happier with it.", "verified": true, "helpfulness": "0/1", "author": "G. Amant \"saint duke\""}, {"rating": 5.0, "review": "We have this in one room and a roku stick in another.  I love this so much!  The user interface is clean and easy to navigate, it connects and downloads so quickly, it is head and shoulders about the roku (but the roku is older, so that is to be expected)", "verified": true, "helpfulness": "0/1", "author": "Melissa Pierce"}, {"rating": 5.0, "review": "It was easy to set up, and I was quickly off exploring all the shows I haven't watched.  I quickly had to order the game controller cause I had to nerd out on all the games too.The only thing I have to compare it to is my current cable provider. I used to have HBO, Cinemax, Stars, Showtime... but since I noticed lately I am pretty much paying over 90 a month for a subscription to channels that have a lot of nothing on I decided to dump them and just get Fire. I have more options! At the command of my voice my faves are there for me to view!", "verified": true, "helpfulness": "1/1", "author": "MAD"}]