[{"rating": 5.0, "review": "This is great. It works faster than Comcast On-Demand. I am very pleased.", "verified": true, "helpfulness": "1/1", "author": "Garym"}, {"rating": 5.0, "review": "We love the Fire TV. It is so easy to use and the voice search is WONDERFUL! Anyone who has spent time entering a search on a standard remote will appreciate the voice search option. I am happy with my purchase.", "verified": true, "helpfulness": "1/1", "author": "Resa"}, {"rating": 5.0, "review": "So far I am enjoying it thank you excellent 5 stars.", "verified": true, "helpfulness": "1/2", "author": "Richard Daniel Perez"}, {"rating": 5.0, "review": "Works better than Apple TV. Easy to set up. The voice command search is awesome. No need for a smart TV either. Now just need the Amazon game controller.", "verified": true, "helpfulness": "1/1", "author": "MC"}, {"rating": 4.0, "review": "Works great, just stinks that mostly everything costs extra, obviously expected but at least the box itself is a one time fee!", "verified": true, "helpfulness": "1/1", "author": "tori"}, {"rating": 3.0, "review": "I was disappointed in fire t.v.  made it difficult for prime members to find selections.  Many of the subscriber channels didn't have certain cable channels we were looking for like HGTV.", "verified": true, "helpfulness": "1/1", "author": "jeffrey neal hardy"}, {"rating": 5.0, "review": "Exceeded our expectations. Thought it would basically be an Apple TV but offers great additional features as well. Easy set up.", "verified": true, "helpfulness": "1/1", "author": "StevestonD \"Debster D\""}, {"rating": 4.0, "review": "Great device. Interface not as \"sleek and shiny\" as the Apple TV, but if you use a lot of Prime Video and the included cloud backup for pictures with your Prime account, its the way to go. That content is available in an instant when you get home from family events. The \"apps\" way of having you access other servivces like Netflix, HBO Go, etc is not as user freindly as i expected compared to the Apple TV that I have. Other than that, its a no-brainer.", "verified": true, "helpfulness": "1/1", "author": "Richard Blanco, Jr."}, {"rating": 4.0, "review": "I am still on the learning curve; can probably help you a little later when I get smarter!", "verified": true, "helpfulness": "0/1", "author": "Silver Streak"}, {"rating": 5.0, "review": "Easy setup. Doesn't take up much space. Easy to navigate.", "verified": true, "helpfulness": "1/1", "author": "Courtney Finnegan"}]