[{"rating": 3.0, "review": "Don't like the fact you have to change the hdmi cable every time you want to watch regular (cable/network tv) or Amazon Fire.. it's just not what it's hyped up to be. Still debating on whether I'm going to return it or not.", "verified": true, "helpfulness": "0/3", "author": "lisa"}, {"rating": 5.0, "review": "Works great.  Easy to set up too.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I am not so impressed with the product as much as I am with Amazons customer service.Its like a Kindle on tv minus the book/reading portion.  When it advertises that you can play Minecraft, it failed to mention that it's only thePocket Edition and you have to pay for it just like you would on the Kindle.The Roku actually seems better, I can block ordering on Amazon and dont have to enter my code unless I purchase.  FireTv I have to constantly enter my code.  My kids have no option to independently watch FireTv unless I enter the code everytime or give it to them, whoch defeats the purpose.Overall its still pretty cool.  I love my Kindle so this just seems like an extention of that product.", "verified": true, "helpfulness": "0/2", "author": "STORMSTER"}, {"rating": 5.0, "review": "I didn't like how it automatically registers whiever purchases the product, since it was a gift.", "verified": true, "helpfulness": "0/1", "author": "Brooke cusick"}, {"rating": 1.0, "review": "I love my fire T.V.", "verified": true, "helpfulness": "2/6", "author": "Frankie butler"}, {"rating": 1.0, "review": "No partership with comcast will be sending ths back.  Limited functionality", "verified": true, "helpfulness": "1/5", "author": "Al Wolden"}, {"rating": 5.0, "review": "Just got it but already am in love with it.", "verified": true, "helpfulness": "1/1", "author": "kimrn83"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "1/1", "author": "Annie Nolin"}, {"rating": 5.0, "review": "Fast fast and excellent video quality. We have benning using Roku and this is head and shoulders above.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great!", "verified": true, "helpfulness": "1/1", "author": "Michael"}]