[{"rating": 5.0, "review": "Amazon Fire TV is the BOMB", "verified": true, "helpfulness": "0/0", "author": "EbonyC"}, {"rating": 3.0, "review": "Not really user friendly for people who have never used similar products.", "verified": true, "helpfulness": "0/0", "author": "C&K Productions"}, {"rating": 4.0, "review": "I am happy with the quality of picture and sound, but it would be much better, if possible choose and install my favorite applications", "verified": true, "helpfulness": "0/0", "author": "Jose Bermudez"}, {"rating": 4.0, "review": "The CBS News app is on both my Apple TV and my Amazon Fire Stick.  When I start a video segment on the CBS News on Apple TV the app automatically goes to the next video segment when done with the first, this experience is very good and almost like watching the live broadcast, and eliminates most inserted ads.  The app on the fire stick makes me play each segment manually, with the intro ad.  Is there an upgrade planned for the CBS News fire stick app?", "verified": false, "helpfulness": "0/1", "author": "A Ford"}, {"rating": 5.0, "review": "Don't be cheap and buy the stick, buy the fire tv. I bought this for $50 as a promo when I signed up for 3 months of sling tv for $60. The fire stick buffers all the time and the fire tv doesn't. Absolutely love it. Can also use it to access HBO go, Netflix and a bunch of other apps", "verified": true, "helpfulness": "0/0", "author": "Michael T. Jayson"}, {"rating": 5.0, "review": "It is awesome!", "verified": true, "helpfulness": "0/0", "author": "Charles Clayton"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Margarita \"tanker boy\""}, {"rating": 5.0, "review": "I WANT TO KEEP MY AMAZON PRIME WHAT SHOULD DO . I DO NOT WANT CANCEL", "verified": true, "helpfulness": "0/1", "author": "THEARDISE STOWE"}, {"rating": 5.0, "review": "It was easy to set up and has worked like a dream.", "verified": true, "helpfulness": "0/0", "author": "Letitia H. Berghammer"}, {"rating": 4.0, "review": "My wife loves the fact that she can now watch HGTV via Sling on the Fire TV.  I have not had a chance to use all of the features, but I love the fact of how much you can customize the parental features.", "verified": true, "helpfulness": "1/1", "author": "Michael"}]