[{"rating": 5.0, "review": "Easy to use and it is fab.", "verified": true, "helpfulness": "0/1", "author": "Kathy Wohlhieter"}, {"rating": 5.0, "review": "Upgraded from a ROKU and extremely satisfied with Amazon Fire TV!  We used ROKU only to run the Amazon Prime app and experienced FREQUENT streaming and connection issues (over WIFI).  Amazon Fire TV has a great UI, is extremely fast and we have yet to experience any streaming issues (Full HD over WIFI).  Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Stephen G"}, {"rating": 4.0, "review": "The remote alone is great enough to sell this product as a viable option. The remote is great. My only issue, which holds true across all Amazon products, is that the user interface is very limited. I feel restricted using it. That being said it is way better than a Roku, but I can't speak to other media streaming devices like apple tv.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "Great product, a MUST if you have Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "Juan Antonio Cisneros Mtz."}, {"rating": 4.0, "review": "Great once I got it working, best customer service, Thank you to Alec", "verified": true, "helpfulness": "0/1", "author": "AMart"}, {"rating": 5.0, "review": "love it, I can see all the shows & movies any time without having to go out of my house, even my 3 yr. old nice can use it by just talking to it.", "verified": true, "helpfulness": "0/0", "author": "Julie \"The Reader\""}, {"rating": 5.0, "review": "Awesome Product!!!I can now mirror my Kindle Fire HDX to big screen TV. Love Fire TV and can't wait to find out additional features to my Fire TV. I can even watch movies that I downloaded somewhere else on my Fire TV.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "the unit is well made but to many games also will not play mp4 movie files of which i have 1000 on my computer hard drives i also have a western digital streaming device which will play these mp4 & mkv files so after one day with the unit i sent the unit back  if the unit played these files i would have kept it i called customer service to see if the could help me they did not know what a mp4 or mkv movie flies was they only new how to set it up", "verified": true, "helpfulness": "0/2", "author": "David H."}, {"rating": 4.0, "review": "EASY TO INSTALL AND USE.", "verified": true, "helpfulness": "0/1", "author": "Jerry S"}, {"rating": 5.0, "review": "WOW, It is super.  Only problem is now I am glued to the television and not doing what I need to do.  I highly recommend this product to everyone.  It works amazing.  I was amazed at how small it is.  So easy to set up and I love the menu.  Extremely user friendly in every way.  The best way to stream Netflix and all the free Amazon Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Barbara A., Mintz \"Babsie\""}]