[{"rating": 5.0, "review": "Hands down the best streaming box I've ever tried (I've used various Rokus and Chromecasts).  Snappier and cleaner interface than the rest and looks nicer on the component shelf too.  If you use amazon prime regularly, this is the way to go.  Also, the voice search with the remote is great!", "verified": true, "helpfulness": "2/2", "author": "Bill Brasky"}, {"rating": 5.0, "review": "Fire TV (2014)It's fast, has a sleek UI, best in class remote control and all Apps you need. An Apple fan", "verified": true, "helpfulness": "1/1", "author": "Marcus Rosebrock"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "1/3", "author": "Amazoner"}, {"rating": 5.0, "review": "Amazing tech gadget .", "verified": true, "helpfulness": "0/2", "author": "Dan"}, {"rating": 3.0, "review": "Very easy to set up. However, once set up, I dare you to find the \"huge number of games and apps\" in any sort of systematic way. When the search function is used, it only applies to Amazon Prime movie and television content, so the only way to search for apps is to scroll through them, in large icons that move across the screen in random order. There needs to be a way to search for apps.The games available are mostly lame, free-for-a-reason titles that have all the appeal of Pong. Why won't amazon with all it's clout gain access to the cool stuff.Also, if it was a TV show that I really wanted to watch, it was at least 2.99 an episode.The Pacific and some other made for cable series are great, and some of them are free.I do believe that \"literally 1,000s of movies, apps...\" is a little exaggerated, but all the content providers use that line.It's a work in progress, I hope.", "verified": true, "helpfulness": "2/3", "author": "Linda Waud"}, {"rating": 4.0, "review": "Lots of potential - have had it freeze on us and give \"unknown_error\" twice already in less than 2 weeks.  After phoning support and rebooting, it lost my settings for Netflix and so had to re-peck out username and passwords all over again - this should be so much better than it is!", "verified": false, "helpfulness": "1/1", "author": "toomanybarts"}, {"rating": 4.0, "review": "So far so good. Wish Prime offered some more movies and that the rentals werent so expensive but this little machine does exactly what its supposed to.", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "Amazing speed and more movies than I could possibly watch....what a great product....thank you", "verified": true, "helpfulness": "0/0", "author": "gramps4many"}, {"rating": 5.0, "review": "I love it. I recently was able to get rid of DirecTV (yay) and got Amazon Fire, Hulu, and Netflix instead. I pay $ 291 per year for these 3 services vs. $1260 per year w/ DirecTV.", "verified": true, "helpfulness": "0/1", "author": "Mel"}, {"rating": 5.0, "review": "Easy set up, simple to use and the voice search is awesome. If you are a Prime member you'll love the list of movies to choose from. I've enjoyed my Amazon Fire TV from day one!", "verified": true, "helpfulness": "0/0", "author": "S K Conn"}]