[{"rating": 4.0, "review": "I've been using the Amazon Fire TV now for a few months. I also have the Roku stick on another TV. Since I love the Roku, I was curious about why I would want an Amazon Fire TV - or what the actual differences were. There are differences.Finding Apps - I find the Amazon Fire more complicated to open 3rd party apps like Hulu Plus. One thing I really, really enjoy on the Roku vs. the Amazon Fire TV is that the Roku allows the user to arrange the home screen and apps. HOWEVER, I love being able to use my voice to find the App, for example, the Hulu Plus app. It's a Voice workaround to finding stuff - and does require a second step of using the voice search rather than clicking an app you have ordered and placed in a certain place on the home screen (like on my Roku).Streaming Content - One advantage Amazon Fire TV has is being able to use my Fire HDX 'fling' screen to watch programs or see images from my Fire HDX screen on the big screen. But most everything I would 'fling' can be done via an app or Amazon content. And to be true, Roku has workarounds to share a screen. I do find the workarounds (apps) clunkier than streaming web content from my HDX to the big TV screen.Overall, these are the three PROs I find Amazon Fire TV has over Roku: 1.) voice search content and 2.) sending my HDX screen to the TV screen and 3.) Amazon Fire loads extremely fast, and faster than the Roku (if that's an issue for you).Apps - I've found plenty of apps with Amazon Fire TV which are free and keep me satisfied as much as Roku, although Roku has more apps to use than Amazon does currently. Between my TV antenna and these apps, we've cut cable off completely.Prime - Since I'm a Prime member, it's nice having my prime content at my fingertips. But again - the sort and order function to find that content more efficiently is something I hope Amazon works better on getting down right. They have a home menu screen where I can access content I've placed in my Watchlist. But again, I can't order that content, or at least I haven't found a way to do that yet.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Had tv app but just wasn't the same on the vizio tv, so I figure I would try it out after looking at YouTube to see what the menu actually was. Easy installation, easy remote, great channels. The menu is better with the fire tv box by a long shot, more options, the watch list I guess is like the cue on Netflix. Find a whole bunch of stuff place it on the watch list from series to movies. Movies stream perfect, pause feature, resume movie the next day after going back to the movie. It would be nice to have that \"resume\" feature more accessible thou. I figure I got 3 month before satalite contract is up, try it, watch the data usage for streaming and see if will all work as a package. So far we like it", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 1.0, "review": "Do not buy one of these!  I have spent hours on the phone with Amazon's tech support, and they have no idea how to make it work. My guess is the unit is defective.  I set everything up correctly and it just refuses to work.  I am really, really tired of this thing and will be sending it back.", "verified": true, "helpfulness": "3/5", "author": "S. E. Fanning"}, {"rating": 5.0, "review": "Who needs regular TV when you have Fire TV. The news are always depressing and I do not want to deal with reality I need entertainment, drama and funny stories to make my troubles go away.The selection is endless and the voice command search is out of this world. Just mention the name of your favorite actor and all his movies pop up on the screen. From there you can select similar movies, add another favorite actor  and the search is endless.I am an amazon prime member and the free selection of movies is pretty decent. It also has HBO and Showtime series that you cannot find in Netflix. Have you seen Carnival ? What a different show.I have not tried the games yet. I am still overwhelmed from the plethora of movies and shows.John G", "verified": true, "helpfulness": "0/0", "author": "John Gatzonis \"Yiannis Gatzonis\""}, {"rating": 4.0, "review": "Lots of choices - most of them not that great. Additional cost for things like Netflix and Hulu Plus.", "verified": true, "helpfulness": "0/0", "author": "iron klutz"}, {"rating": 5.0, "review": "This is THE BEST steaming media out there right now. I've had Chromecast, Roku, Apple TV, Raspberry Pi, etc... This is hands down the best one on the market. It is really fast, small, sleek, and I love the remote control. I like it so much that I purchased it for all of my family members. I would say this is Amazon best product that they have ever made.The user interface is really simple and clean. Best part, its quick. Unlike the competitors where they sometimes it feels laggy. Not so with this device. I don't usually use the voice operation, only here and there. It works great for the times I do use it. It's cool that they add that function on the remote which makes it convenient.I know you can play games on it too, but I only tried some. I'm not big on playing games with a streaming device. My friend was able to attach his Xbox controller to it and we played some games together. That was kinda cool.Overall, this is THE BEST streaming media device I have ever bought.", "verified": true, "helpfulness": "0/0", "author": "brandon"}, {"rating": 5.0, "review": "I also posted a review of the Fire TV Stick.  Very easy setup with an excellent remote.  The device requires a LAN connection.  If you need a wireless device, purchase the Amazon Fire TV stick instead.", "verified": true, "helpfulness": "0/0", "author": "lhodd \"idolfanatic\""}, {"rating": 5.0, "review": "I have one in every room. Amazon hit it out of the park with this unit.  Without getting too technical, it would be easy to compare it to an apple tv.  Its double the processing cores. Double the RAM, Double the Wifi Antennas, Quadruple the onboard storage, and has a Radio remote rather then a IR  remote.  As an apple tv user for years, I can say this unit is miles ahead of Apple. (I own an iphone, ipad, macbook, ipod, & apple tv) You would think I would be a fan boy and state that the apple unit is better, unfortunately that is not the case.  The video quality is outstanding, It can sideload xbmc, and it has some great apps. (No HBO go! is probably the only downfall, was told they will have it on by Q1 2016).Dont think about it, get one, its probably one of the best products for your home.", "verified": true, "helpfulness": "0/0", "author": "Salman Chawla"}, {"rating": 3.0, "review": "Great picture.  However, I  do not care for the process that directs user to amazon prime for pay to view when it is free on Netflix, HuluPlus, or other sources.  The voice recognition feature needs improvement.", "verified": true, "helpfulness": "1/1", "author": "michael phillips"}, {"rating": 5.0, "review": "Performance and functionality mathe d description.", "verified": true, "helpfulness": "0/0", "author": "Daniel M Paschall"}]