[{"rating": 5.0, "review": "This little thing is awesome!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "Love this...easy to use. It would get 5 stars, but did not come with HDMI cable... So was not able to hook up without running to the store! It should have an option...with or without!", "verified": true, "helpfulness": "0/0", "author": "B.A.T."}, {"rating": 5.0, "review": "Impression: Very impressed! The remote is GENIUS!Opinion: Better, faster, more reliable, more options, than any other media streaming box out there I tried, best device for the money.Testing: Stable wifi, no buffering issues, no lock-ups. Just works like it should!Cons: None.Comments: Can side load just about any app on it being Android based OS, such as Dropbox and Kodi (xbmc).", "verified": true, "helpfulness": "0/0", "author": "Level1"}, {"rating": 5.0, "review": "just love it. It is better than Direct TV .", "verified": true, "helpfulness": "0/0", "author": "Linda Bruce"}, {"rating": 5.0, "review": "Look no boxes!! Love how fast it is - way better than the PS3. Remote is great and the Apps are wonderful", "verified": true, "helpfulness": "0/0", "author": "Steve Peck"}, {"rating": 3.0, "review": "I  do think this is a really good product. I did not like to be paying for old tv shows like \"The pink Panther Cartoon\" they have a smal assortment of the movies and shows that are free.  When you ask for a title you want it takes you back to prime tv where you choose to buy rent even when you are trying to search for something on Netflix. That is all I did not like .", "verified": true, "helpfulness": "0/1", "author": "tareci"}, {"rating": 5.0, "review": "This item was a gift from my daughter who already has the unit in her home.  It was easy to install, and I had a small issue about turning the unit on after shutting it down from the previous use.  The Amazon tech staff  called me within a matter of hours after requesting help.  It turned out to be \"operator error\" on my part.  The system now functions as it should and we will be buying a second unit.  The only problem with the second unit will be whether my wife puts it in her study or I put it in my classic car garage;  I may be buying two more units.  Thanx.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Excellent and fast", "verified": true, "helpfulness": "0/0", "author": "Ruben"}, {"rating": 4.0, "review": "The Amazon Fire TV is quite a good choice for streaming box!  The interface is nicely laid out and easy to use.  Prime instant video is included by default and is a great addition to your media streaming choices.  Voice search is good, but does not seem to be integrated down into apps yet as it is on the Google Nexus Player.  Good hardware, great form factor, all in all, very nice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It's not a bad product. My family and I were going to try to go cable free and looking at all of our options and we just aren't ready for it. We may explore the Amazon Fire TV in the future just not now.", "verified": true, "helpfulness": "0/0", "author": "Tim Donahue"}]