[{"rating": 5.0, "review": "Love it. Very fast.", "verified": true, "helpfulness": "0/0", "author": "Michael \"Mike\""}, {"rating": 5.0, "review": "Very happy with this device, no complaints.", "verified": true, "helpfulness": "0/0", "author": "EJB"}, {"rating": 5.0, "review": "I just purchased a new tv but it didn't have Amazon movies available in the apps section I rent movies from Amazon so purchasing this unit fixed that problem.  It you have a television and it is not a smart tv and you would like to have one and don't have the money to buy a new tv Ernest in this Amazon fire tv.  I find I use it more than my smart tv.  I am a fan.", "verified": true, "helpfulness": "1/1", "author": "Phoebe"}, {"rating": 5.0, "review": "I love my FIRE TV? please add more shows and free movies? I highly recommend everyone to buy one for their family. its better than cable?  EXCELLENT!!!!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my Amazon tv.. Cut the cord with cable", "verified": true, "helpfulness": "1/1", "author": "Melissa Guerrero"}, {"rating": 5.0, "review": "I love amazon tv! it allows me to watch all my favorite shows, listen to music, play games and so many other things.  It has hundreds of apps to explore and you never get tired of the same thing because theres always more to see!", "verified": true, "helpfulness": "0/0", "author": "Barbara K."}, {"rating": 5.0, "review": "This thing rocks! And I compared Amazon Prime to Netflix... other than Netflix's original shows... the programming is virtually the exact same... needless to say I dropped Netflix", "verified": true, "helpfulness": "0/0", "author": "Christopher Gore"}, {"rating": 5.0, "review": "WOW:  Is this ever a neat system.  Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Russ Welty \"Russ Welty\""}, {"rating": 5.0, "review": "Remarkable product!  Very fast, easy to setup and use, and the viewing choices are plentiful.  It's (almost) time to throw away the cable box forever!  Once Amazon and the other publishers price TV shows at a reasonable 99 cents or less, I think you'll see more people using Amazon Fire TV than regular cable.", "verified": true, "helpfulness": "0/0", "author": "Shenandoah Dreams"}, {"rating": 2.0, "review": "it would not work with netflix", "verified": true, "helpfulness": "0/1", "author": "r fleck"}]