[{"rating": 3.0, "review": "Let me say that we are truly Amazon fans and supporters. But, not being able to mirror the fire TV was so disappointing. We have 3 kindles, one of which is a fire edition, and none of which can mirror!! We r not going to buy a fire phone or a new kindle. We will be purchasing an Apple TV until we can get the kindle that will work with the fire TV! But with all of that said, we LOVE Amazon.com and the Amazon products. We are prime members and always will be!! Love uou guys!", "verified": true, "helpfulness": "0/1", "author": "K.Drum"}, {"rating": 5.0, "review": "Work flawless as describe", "verified": true, "helpfulness": "0/0", "author": "Thanh Huy"}, {"rating": 5.0, "review": "Great purchase", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "robert mcmurray"}, {"rating": 4.0, "review": "Very nice and smooth,, it did have some hangups but we will soon see...i wish it had more apps you could download.", "verified": true, "helpfulness": "0/0", "author": "pasquale longordo"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Cory Scott"}, {"rating": 4.0, "review": "I wish I could give this 5 stars.  I loved it for the first 10 months, very easy to navigate and great sound and picture quality, I even purchased another one a couple of months ago.  BUT then they both died on me within a week.  We will see how long the replacements last.", "verified": true, "helpfulness": "0/0", "author": "leslie simms"}, {"rating": 5.0, "review": "nice  and  the picture is good", "verified": true, "helpfulness": "0/0", "author": "ey"}, {"rating": 5.0, "review": "Amazing device. I know it says there are so many movies, TV shows etc. but you have absolutely no idea how many until you get it, it's actually a little overwhelming haha. Love this, it is definitely worth buying if you love movies and TV shows. Best money I could've spent honestly.", "verified": true, "helpfulness": "0/0", "author": "Courtney Sanders"}, {"rating": 5.0, "review": "We decided to cut the cable cord and this has done just thatAlthough you still have to get the apps for whatever you want, its still better than cable.Went from a Chromecast to this and I have to say Fire TV is much better. You can still download an app to cast whatever you want to it, but this functions much better and operates much faster than Chromcast.Able to get all the major television programs on call for relatively cheap and if you're a Prime member (I am) you get access to a lot of free content.", "verified": true, "helpfulness": "0/0", "author": "Chris Alverson"}]