[{"rating": 2.0, "review": "Pros:-Great device in terms of the physical components (device is much thinner and smaller than anticipated; remote feels great)-Programming has never been so steady (meaning no issues with streaming or programs stopping in the middle for buffering)-I am convinced the images look crisper on the same tv-Incredibly easy set up (instruction manual is very brief for a reason). It took longer to take the cellophane off the battery than it did to plug in the cables and set up the deviceCons:-This is a big one - it is very difficult to identify Amazon Prime vs content you need to pay for (meaning content from HBO, Netflix, videos you need to pay for, etc.).  I used to play my Amazon Prime videos on our Playstation and Amazon Prime content was much more readily identifiable. Now, the menu options are arrayed so that you can purchase the video first and only if you press the 4th icon \"more options\" can you find out if the content is indeed free for viewing if you're an Amazon Prime member. If my explanation is confusing, it's because selecting Amazon Prime videos is confusing.  Much more confusing than it has to be. For those with the device they will know exactly what I mean.That's my only con and a big enough one that I will definitely be returning the Fire TV device. We signed up for Amazon Prime to replace Netflix and I can't/won't watch TV being concerned that I may inadvertently pay for programming I had no intention of paying for. This device makes watching programs you pay for 10 times easier than watching Amazon Prime \"free\" programming.I have to admit, this is the only time I've been disappointed in Amazon. I used to be a huge fan of Amazon's but not only will I be returning the device but I will make sure to let others know to steer clear of this device.Amazon is risking losing some loyal customers with the way the selection for the videos are arrayed.  I've always thought of Amazon as a really competent and efficient company that really does care to deliver the best value and service to their customers. This device makes it abundantly clear that this is actually a company that will engage in a practice to actually confuse and mislead their customers to make more money.I was torn between two stars and one star but I'll go with two stars because as mentioned previously the device itself is stellar.", "verified": false, "helpfulness": "6/8", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Man, this thing is so close for me. Problem is my 6 Mbps Frontier DSL Wi-Fi drops out in middle of watching a movie, downloading a game, browsing content selections, etc. I get message to re-establish connection, but when I execute the attempt I get message \"connected with problems\". The normally steady white led goes orange and flashing. I usually have to pull the power plug on the Fire TV box and reconnect to get Wi-Fi back to normal. I have ROKU and Google Chrome Cast on same Wi-Fi and they have no dropout problems and are still going strong when Fire TV is kaput. So, come on Amazon, I love this product's possibilities but you're execution on the Wi-Fi seems to be somehow botched. Possible I have a bad unit, but the way it's working looks more like bad software on recovery algorithms for Wi-Fi? Only had FTV a week or so and don't want to have to send it back. Hopeful software update might fix my problem?", "verified": true, "helpfulness": "0/0", "author": "Donald E Rushing"}, {"rating": 4.0, "review": "Just set it up, so these are the very first impressions.  Judgment so far - a lot of good features, not sure I'll keep it.Pros:Very fast loading.Picture is gorgeous.Sound is great.Haven't used it enough or at different times to see if it goes to buffering as the Roku does all too frequently.So why the indecision?Cons:Prime videos intermingled with the pay-for videos. In fairness, they say they'll fix this \"in spring.\"  Meantime it's annoying.Compared to Roku, very limited selection of streaming applications. That's the killer.Okay, Amazon sells content. And we love them for it. BUT, my Roku has a lot more movie and television providers including FREE HBO (with my cable subscription) - apparently the HBO on the Fire is a pay-per-episode- BBC and PBS. And others.And the interface isn't all that good.  Again, in fairness, neither is Roku's. Amazon's not so irritating, or at least not yet, but more something to put up with than enjoy.Haven't yet tried the voice search.  Perhaps it's great  We'll see.  BUT only works, they say, with Amazon content.Will be trying it out more, and will update as appropriate.UPDATEAfter using the Fire TV for a while, I've decided it's a keeper.The primary reason for this is the fast processing.  Using my Roku 3, I was always waiting for films to load, and frequently having them stop and rebuffed in the middle.  Sometimes when there was heavy ISP traffic, they would just stop and would not rebuffed at all.  This was, needless to say, incredibly irritating.So far, the Fire has always loaded very quickly (2 to 3 times faster than the Roku) and we have not had a single rebuffering pause.As noted above, the picture and sound are exceptional.Still only up to four stars, because of limited services (although I primarily use Hulu and Netflix in addition to Amazon).  The availability of HBO series helps.Like many others, I would like a Prime-only search and browse category.SECOND UPDATE: Cooper Proof!What is a Cooper? Cooper is a 15 pound agent of chaos, the apotheosis of the \"testing to destruction\" philosophy.  Some think Cooper is a mad scientist's crossing a piranha with a beaver, some believe that he's a cyborg chainsaw with legs. Hiding behind his natural camouflage of \"cute little dog,\" he will eat anything that does not eat him first.And he started to eat the Fire TV remote. Photos of damage posted to page for Replacement Remote.BUT - at least for now, it does not need replacement.  It still works. Very few things have survived the Cooper test, but this one did.", "verified": true, "helpfulness": "3/4", "author": "LJO"}, {"rating": 1.0, "review": "I have purchased several hundred items from Amazon but this has been one of the most disappointing. I bought this unit thinking it would be a great way to search across all digital providers (Netflix, Amazon, etc) and yet the voice search only works with Amazon Prime which is far too limiting.  The Roku 2 is a far superior unit and cheaper. I was very disappointed to learn that the search worked this way.  I moved the unit into a spare bedroom on a small TV and brought the Roku 2 back out for the big screen Plasma TV.  I wish I had never bought it.", "verified": true, "helpfulness": "9/18", "author": "BrettW"}, {"rating": 2.0, "review": "this is your typical media streaming player. Got it on a free trial and am returning after setting it up and playing with for about an hour. It doesn't fit my needs. Now if I can just find out where Amazon will let me send it back to them for free.", "verified": true, "helpfulness": "4/9", "author": "Michael Baker"}, {"rating": 5.0, "review": "We were having trouble connecting with the internet on our DVR to watch Netflix, Prime, and Pandora.  In frustration, I ordered the Amazon Fire TV.  We love it!  It is almost as small as a pack of cards and we have not had a problem connecting with our WiFi...it's connects flawlessly.  It is so nice to have a product that just works!  We can't say enough good things about it.", "verified": true, "helpfulness": "3/3", "author": "Jacqueline M. \"Jackie RN\""}, {"rating": 3.0, "review": "I bought this to watch and hear the many concert and music files I have on my C drive. I have a \"smart\" TV but its performance is less than satisfactory in playing my files wirelessly. I thought the FTV would help. But so far I am trying to figure out how to use Plex and several other s/w programs to accomplish this. Still working on it part time as I work out of town. Maybe this weekend it will work and I will update this review.", "verified": true, "helpfulness": "0/1", "author": "Stu Brown \"Stu Brown\""}, {"rating": 5.0, "review": "Everything's great about this \"Clicker\".To be able to say \"Quest for Fire\" into the Amazon Fire \"clicker\" and have it appear from out of nowhere in 3 seconds, ready to play with a single click of a button is simply amazing.  (It's an old, old favorite movie of mine that I never though would even be available online, nor would I have any idea how to find it with old-fashioned \"type-in-your-target\" methods.)And it gets better and better, as more and more movies and TV shows are added to the \"Available Free with Amazon Prime\" categories.  We watch nothing else now.  Amazon Prime and Amazon Fire TV work amazingly well together; and I'm a computer expert, so I recognize what the implications of such things are.I cancelled my Roku order I had outstanding at the time of  the Fire announcement, and it's the best thing I've done in a year or two.Buy it; enjoy it; tell others about it.  Even the slide show it plays when things are quiet are great.(Now: all I can hope is that I don't get sued for anything I've said here: this is my last comment on purchased products for that reason: I can't afford legal entanglements at my age . . .or any other age for that matter!", "verified": true, "helpfulness": "0/0", "author": "Robert D. McConnell \"BobGeezer\""}, {"rating": 5.0, "review": "As a person who likes movies, especially in my living room, the Amazon Fire has exceeding my expectations.  The ability to watch movies of my choice and never leave the house to do so is a great advantage. Movies from Amazon stream along with my Netflix subscribtion give me great pleasure.", "verified": true, "helpfulness": "1/1", "author": "Senior Citizen \"Darth\""}, {"rating": 5.0, "review": "We love using the Amazon Fire!  After having the original Apple TV, Roku2, and Google Chrome, I think we are ready to cut the cord to Uverse.  The Amazon is such an easy to use interface, and the whole family easily is able to find what they need.  I set it up in minutes... it just took a few minutes to explain it to the husband :)  Hulu, Netflix, Prime, it is all there.  Our LG Tv easily recognized it- which never happened with the Apple TV.  The streaming is lightning fast- faster than our other devices.  The picture is awesome.  I love Google Chromecast, but I get tired of having to \"cast\".  It just isn't practical for a cable replacement.  I will be ordering more of the Fire TV to accommodate the other TV areas of the home, they bye-bye Uverse!", "verified": true, "helpfulness": "1/1", "author": "Amy B."}]