[{"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Robert C."}, {"rating": 5.0, "review": "It doesn't hook up as easy as it looked on the advisement, because I could not get it to do Wi-Fi it had to be hooked up using the telephone wire and I had the wire running to the telephone to the TV; I would have wanted no wires, because it is long wire to the TV to the telephone and  you are always tripping on it, but once it is hooked up is wonderful and very easy to play; loved it and I would recommend it and you might know how to get it to play using Wi-Fi:)", "verified": true, "helpfulness": "0/0", "author": "babymagic1955"}, {"rating": 5.0, "review": "I've never owned a Apple TV or Roku so I can't compare. However, I don't know how you could get any better than this product! Maybe my favorite entertainment device I've ever owned. I use it for Hulu, spotify connect, Netflix, and the screensaver for a picture collage. It's extremely fast and have only had issues with the software once so far. It's so much easier than trying to mess around with the Xbox or playstation to stream. I don't use the voice button ever so I can't say if it's a nice addition or not.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "great Christmas present for mom.", "verified": true, "helpfulness": "0/0", "author": "William J. Lanier"}, {"rating": 5.0, "review": "This is the new way to watch TV!", "verified": true, "helpfulness": "0/0", "author": "Kathleen L. Bieker"}, {"rating": 5.0, "review": "Not a huge TV watcher but the have enjoyed some of the series offered by Amazon, Fire TV just makes it easy to access.", "verified": true, "helpfulness": "0/0", "author": "Wade"}, {"rating": 5.0, "review": "What I can tell you? Works as advertised! Now I can really enjoy Prime TV since the interface in my smart TV is not the greatest. Besides, I enjoy as well Netflix and Sling TV. Voice command works awesomely!! Keep on the good work!! Too bad I did not know the Sling TV offer of 50% off for the Fire TV...", "verified": true, "helpfulness": "1/1", "author": "Robert D. Torres"}, {"rating": 5.0, "review": "While this is the first streaming device like this that I have used, I must say that I am VERY pleased with it. Easy setup and one device I have not had to teach my wife to use! It was truly easy for her to figure out on her own.", "verified": true, "helpfulness": "1/1", "author": "onecuwldood"}, {"rating": 1.0, "review": "I thought it was a TV!!!😡😢😢😪😤😒😟😢😢😢😢😪😟", "verified": false, "helpfulness": "0/0", "author": "NELLY"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "1/1", "author": "jenk"}]