[{"rating": 4.0, "review": "Finally a remote easy to use I really like it.Now Amazon have you considered becoming a high speed internet provider?", "verified": true, "helpfulness": "0/0", "author": "sand95"}, {"rating": 5.0, "review": "Great product!  Wasn't sure how  or how much I'd use it after taking it home from a company event, but it's great to use as a portable device between the TV's throughout the house that don't stream or have DVR's.", "verified": true, "helpfulness": "0/0", "author": "Tony Reiter"}, {"rating": 5.0, "review": "We love our Amazon Fire TV!We've had an Apple TV before, and I prefer Amazon over Apple.The remote is better than Apples product in my opinion. And we have Amazon prime so using prime to watch shows I love in addition to Hulu, Netflix and HBONow unless you have a lot of money in iTunes movies and songs it's honestly not worth it", "verified": true, "helpfulness": "0/0", "author": "Alexa Grigg"}, {"rating": 5.0, "review": "I love the instant buffering,great product.", "verified": true, "helpfulness": "0/0", "author": "Antonio E. Rodriguez"}, {"rating": 5.0, "review": "Love it.  Easy access.  Music for me, games for grandkids, yoga on you tube, plenty of entertainment for everyone.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Comparing to the Apple TV which I already own, I'm impressed with the voice commands and ease of remote use. I love the home button feature, as with the Apple TV, you have to press and hold the center button to get back and it doesn't always work.", "verified": true, "helpfulness": "0/0", "author": "Janelle Tennant"}, {"rating": 5.0, "review": "Whole family LOVES this product, so much so we now also have the Amazon fire sticks.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Decent product, but not compatible with the Comcast (Xfinity) service.", "verified": true, "helpfulness": "0/1", "author": "B. Shrestha"}, {"rating": 4.0, "review": "Great product!", "verified": true, "helpfulness": "0/1", "author": "clint ashworth"}, {"rating": 5.0, "review": "Purchased for a Christmas gift, my Brother likes it a lot.", "verified": true, "helpfulness": "0/1", "author": "John H"}]