[{"rating": 5.0, "review": "Very useful tool for connecting my TV and PC. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Naseer Ahmad"}, {"rating": 5.0, "review": "I hope this works better than my Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Trekker01"}, {"rating": 5.0, "review": "5/14/15: Updates have made it even better! Amazing Amazon. Youtube works pretty well now, with an imbedded keybord that the remote can scroll through. I quickly found my favorite kahiko hula videos (check out Natasha Odas' winning performance in the 2001 Merrie Monarch Festival competitions for a treat if you have the time).I must say I have no desire to subscribe to yet more \"services\" for $$$. I pay plenty for Prime, that is what should be the Amazon steamroller (not Hula, HBO, etc.).Survived USPO smushing the box into my mailbox along with a couple of dvds (yet again).Amazon rules with this Fire TV!Not much bigger than a cigarette case. I unboxed it and was watching my favorite Amazon Prime shows in MINUTES!Don't forget to buy HDMI cable of appropriate length (I bought an Amazon Basics HDMI 1.4 cable on Lightning Deal with it).Best streaming video quality I have experienced, bar none. Sound is excellent also.I route the HDMI through my entertainment center receiver with no problem.Even the \"screen saver\" slide show is beautiful. So much hassle free fun.I don't even have to \"log in\" because if you buy it for yourself (not checked as a gift) it is set up to your account before shipping to you.Sublime. This is a no brainer folks.Especially since I got it as a Lightning Deal for $69 !!!1/29/15  Still liking it, daily use. Especially for Prime shows. Needs an Amazon app for a wireless keyboard/trackball (and sell the keyboard Amazon) and a web browser (Opera?) without having to \"sideload\" stuff. I don't want to have to get that geeky with it!", "verified": true, "helpfulness": "1/1", "author": "Z"}, {"rating": 4.0, "review": "Amazon Fire TV with digital audio optical output = four and one half (4-1/2) stars.  If it also had a digital audio coax output: five (5) stars (see below).  After playing with this device for about eight weeks, here is a summary of what I have discovered.1.  It's idiot proof.  There are only five inputs/outputs of which you will likely use only three or four. A five year old (perhaps even a four year old) can plug it into your video/audio system (and get it right the first time).2.  It's incredibly small for a powerful set-top entertainment app provider.  It quickly disappears into the woodwork.3.  If you can name the entertainment app, chances are it's already there.  Or soon will be with software upgrades now occurring about every 10 days.4.  It's cheap.  99 USD for the device; free for Amazon Instant Video content if you have a 99 USD Amazon Prime account.5.  It comes preloaded with Amazon Instant Video if you have an existing Amazon Prime account.  No user ID and passphrase need to be painfully entered (but you will have to perform this tedious chore for other pay apps (like Netflix and Hulu) as you would if using a lap/desk top).5.  The on-screen menu is extremely user friendly and easy to navigate with an intuitively-designed, right-sized remote control.  (Even for those under the age of four.)6.  It's fast with wired connections.  I compared times to load Netflix from my large-screen smart TV, Blue Ray smart player, and Amazon Fire, back to back.  The TV took 15-20 seconds (or did not load initially); the player took 15-20 seconds (or did not load initially); Amazon Fire took 1-2 seconds (and loaded every time).  The superiority of Amazon's server farm architecture (or \"cloud computing\") is clearly in play here!7.  Buffering pauses are just about nonexistent (due in part to 8 GB of internal memory).  Except for Netflix which does not have its own server farm and depends on third parties for \"cloud\" services.8.  In back-to-back comparisons (see number 6 above), video and audio were superior with Amazon Fire.  If the original source material is available in HD video and any flavor of surround sound, Amazon Fire delivers same.9.  You have to provide your own cables (which you probably have left over from other past home entertainment system experiments).10.  As previously noted, there is no digital audio coax output.  Not a problem if your audio system only requires HDMI pass through and/or an optical input.  And you never plan to disconnect your optical audio output from Amazon Fire (optical audio connectors are fragile [every one I have used has usually failed after 4-5 disconnects/reconnects]).  If your audio system requires a digital coax input, you will also have to buy an optical-to-coax converter.  There have been reports of some converters causing audio and video to become asynchronous.  Using the C2G / Cables to Go 40019 Optical to Coaxial Digital Audio Converter (also sold by Amazon), I have noticed this to occur only once (for a few seconds in mid dialog).A thoughtful, well-engineered product with hardware/software extreme user friendliness offered at \"popular\" prices.  Highly recommended!  WILLIAM FLANIGAN, PhD.", "verified": true, "helpfulness": "2/2", "author": "William F. Flanigan Jr."}, {"rating": 1.0, "review": "I was soooo stoked about this Fire TV. Until...I realized I needed a huge bank roll!  EVERYTHING on the fire TV is for sale. All shows you have to buy. Sure some are free but only about 2% and their old movies. So you pay $99 and better have about another $500 to get you through the month. Not sure why others aren't saying anything which makes me think....their reviews by amazon PAID reviewers! Oh yea....if you don't have cable too....your further screwed. Forget watching the history chanel shows or A&E; shows because you need a code from your cable TV provider. The games...cheesy. so unless your planning to pay 4 to 6 times the price of cable...stay with cable and forget about amazon tv.", "verified": false, "helpfulness": "4/14", "author": "LukeB1979"}, {"rating": 5.0, "review": "Super easy to set up, LOADS of options to choose for watching programming, and what really got me excited was being able to play games from my Kindle! I am extremely happy that I got the Amazon Fire!! Great job!!", "verified": true, "helpfulness": "0/0", "author": "Maureen Trapasso"}, {"rating": 5.0, "review": "Very easy to setup. It Arrived on time and in good condition, I would definitely use this seller again.", "verified": true, "helpfulness": "0/0", "author": "CHRISTINA L THOMAS"}, {"rating": 5.0, "review": "Incredible! I am truly impressed. I've seen and operated ROKU and the Fire TV leaves that in the dust. Very simple set up. It took about five minutes from opening the box to watching a show. If a person already has Amazon Prime, you would be crazy not have have Fire TV. If you are thinking about getting Amazon Prime, be sure to include the Fire TV. I mean all I do is speak into the remote to find a movie. All of the music I've bought on Amazon MP3, that I hardly ever listened to, is here at a touch.", "verified": true, "helpfulness": "0/0", "author": "Greg Christy"}, {"rating": 5.0, "review": "I recommend this. So much you can do.", "verified": true, "helpfulness": "0/0", "author": "ECF"}, {"rating": 1.0, "review": "Did not enjoy, I would rather have a true HTPC or even an XBMC box than this thing. and its SSSSLLLLLOOOOWWWW", "verified": true, "helpfulness": "2/3", "author": "shiptip"}]