[{"rating": 5.0, "review": "Very pleased with the Amazon Fire TV. Easy to use and large selection of movies.", "verified": true, "helpfulness": "0/0", "author": "DCorby"}, {"rating": 5.0, "review": "Love it. Way cheaper than cable. Tons of choices.", "verified": true, "helpfulness": "0/0", "author": "HudsonPie"}, {"rating": 5.0, "review": "I like this unit better than the Roku 3 Player.", "verified": true, "helpfulness": "0/0", "author": "P. Callahan \"down by the sea\""}, {"rating": 4.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Ian Lazarus"}, {"rating": 5.0, "review": "We are really enjoying on Fire TV, its quick and never loses a connection like my Sony smart TV.", "verified": true, "helpfulness": "0/0", "author": "502dm"}, {"rating": 5.0, "review": "Simply the most elegant streaming device I could have purchased.  The artistic simplicity and functionality of the remote reminds me of the controls on my Bose Acoustic Radio and CD player.Effortless installation and set-up were no challenge for this 68 year-old male who had been avoiding live streaming because of its perceived hyper-complexity. In fewer than 15 minutes I had Amazon Prime videos, Netflix videos, and SlingTV at my finger tips and the infinite choices these programs bring. (For Example: The Girl With the Dragon Tattoo in your choice of a) standard Swedish; b) Extended Swedish (4 hours); c) Standard Swedish with English subtitles; d) Extended Swedish dubbed in English... and so on.)This is a marriage of technology, elegant simplicity, and amazing functionality! (Yes, I know. A polygamous marriage)", "verified": true, "helpfulness": "0/0", "author": "KBL in ABQ"}, {"rating": 5.0, "review": "The picture is amazingly clear, and the set-up was very easy.  We bought this to replace an old Roku, which we mainly used for streaming Amazon movies.  The menu system is easy to navigate, and the available apps meet our simple needs.  We aren't heavy tv watchers.  We needed a nice streaming box when we bought a new tv within the past month, something that would allow us to get nice HD video.  This device was a very good choice for us.", "verified": true, "helpfulness": "0/0", "author": "Greatdanes"}, {"rating": 1.0, "review": "I wish to differentiate Amazon Fire TV Hardware vs Software.  As Hardware goes, great piece of equipment.  I think Amazon hit a homerun there.  Now to the software:I'll compare the Amazon Fire to both Las Vegas and Disneyland.  The ENTIRE experience, everything, is carefully planned and executed to extract the most amount of money from the user at ALL times.  Nothing is done, nor given, until the wallet opens up first.  I'll explain below.1.  Sorry Microsoft Windows, our device won't talk to you. Millions of homes in the United States have Microsoft Windows computers.  Microsoft Windows is the #1 home computing platform in the US.  On millions of these computers are photos, videos, home movies, many home movies in stunning HD quality capturing family events of all sorts.  Terabytes of data.  Now enter Fire TV.  If you want to view those Terabytes of data on the Amazon Fire, well, upload ALL OF IT to the Amazon cloud, because, natively, Amazon Fire cannot browse Window's shared folders using the built in Video and Photo apps.  Amazon allows 5GB of data for free....5GB.  Anyone want to bet how far 5GB of data goes when capturing HD quality footage using your home video camera.....anyone....Or, surprise, you can buy Amazon Cloud unlimited storage for $60 bucks a month (cha ching).  Anyone wish to wait to upload Terabytes of data from a Home internet connection.  Anyone think your provider wouldn't shut down your internet when they see you trying to stream terabytes of data over their network, from a home connection nonetheless?Oh, there's another option, plug in a USB stick to the Amazon fire TV and you can see what's on the USB stick.  That is such a non-starter for sooooo many reasons, I won't bother elaborating.  If the amazon fire is meant to sit prominently next to your TV, in plain sight, then why waste resources on a small size, wireless connectivity and even include an optional mount to stick to the back of your wall hung flat panel.  Anyone try to connect cables to the back of a flat panel while hanging on the wall.  Yeah, try imagine doing that repeatedly each day with a USB stick.2. What better way to get you to buy things than with a useless Search feature.Amazon touts their search function as the next holy grail of the world.  It's advertised as the short list of top functions.  Now, I tried the search function to find things....movies or music or such, EVERY SINGLE RESPONSE from the search function says \"Oh, buy it from Amazon\" (cha ching).  The search function only includes Amazon purchasable goods (cha ching).  So, let's say Netflix has the movie \"Nightmare before Christmas\", Amazon Prime does not.  Well, let me search for it, and \"cha ching\" I can buy it from Amazon.  Doesn't say it's available or not on Netflix, doesn't give me a notice it's not available via Prime, it may be, but I'm not given even the inkling it may be, just \"Go buy it Now\".The Search function, well, only works for Amazon.  I open Netflix, want to search for a movie, click SEARCH on the remote, speak into it, and, there are my choices to buy from Amazon.  If I want to search Netflix, back to T9 texting days.I have yet to get a response from the search, no matter what I search for, that doesn't require me to buy something.  Not a single one.  I have 4 of these in my house, I have a household of users.  So far, there's not a single search by anyone that didn't result in asking the user to \"Buy\"(cha ching).  I just took a survey of all the users in my house, no one bothers with the search function on this anymore, completely useless.Reminds of search features on Netflix and Hulu and such.  I search on Netflix for \"Nightmare before Christmas\".  What does the search respond with, \"Orange is the New Black, House of Cards, or Marvel's Daredevil\" then at the end of that is \"Nightmare before Christmas\".  What Orange is the new Black has in common with Nightmare before Christmas, I still haven't figured it out.  Amazon does the same thing.Now, if the Search function had an option, search Prime Video Free, and returned no results with a little blurb that said, well it isn't available for free but it is available to rent, now that's at least providing some feedback that the search function is at least trying to find the video that may be free since you are paying for Amazon prime membership.  If the Search function would fill in text boxes in other apps, well, now we're talking.  But it doesn't.3.YoutubeOh, sorry, nope.  We don't do that.  My $30 tablet from China does youtube just fine.  My vizio flat panel TV, 5 years old with limited apps, does youtube just fine.  My $30 Sony Blu-Ray DVD Player with some apps does youtube just fine.  Amazon Fire, no.  I'm still in awe over this one.4. Wrapping it up.I really tried to like the Amazon Fire.  I bought 4 of them.  I really, really tried to look past these boneheaded decisions by Amazon on the user interface, but I can't.  I also believe, truly, there is a level of genius at work here.  To screw up an interface, a home media device, in a way that blocks you at every turn to enjoy your home media, has to be designed in.  You have to consciously sit down and come up with ways to block the user, re-direct user to open their wallets at every turn (cha ching), there is truly a level of genius at play at amazon, that's a compliment, just seems so misdirected.4.", "verified": true, "helpfulness": "5/8", "author": "Christopher Bomicino"}, {"rating": 5.0, "review": "Nice streaming box at a great price, can't wait until they make HBO now available for it so I can set my \"other brand\" free.", "verified": true, "helpfulness": "0/0", "author": "Ralph T. Katt"}, {"rating": 5.0, "review": "Excellent product and easy to install.", "verified": true, "helpfulness": "0/0", "author": "john frawley"}]