[{"rating": 5.0, "review": "YOU CAN STREAM YOUR OWN LIBRARY ! ! ! ! !  I have been using Boxee for the last two years but it's flaw is that Boxee sold out to Samsung and we have not had a software updates or new apps since....  Boxee was missing Amazon Prime App and we love the choices on AP....With the acquisition of AMAZON FIRE TV you can HAVE IT ALL ! ! !I now have access to* Amazon Prime* Hulu Plus*Vudu*HBO*Netflix*Showtime*Pandora*My 3TB of video content....... using the easy to set up PLEX app......Amazon Fire TV >>>>>>>>>> Winner !!!! of the \"Cut the Cable\" set top box interface....And the \"Voice Search\" does work......", "verified": true, "helpfulness": "0/0", "author": "D. Hitch \"shopdoug\""}, {"rating": 5.0, "review": "The Fire TV is awesome.  I am using it for both Prime and Netflix.  I highly recommend this to anyone looking for a great source of TV shows and movies!!", "verified": true, "helpfulness": "0/0", "author": "Tom Hochulski"}, {"rating": 5.0, "review": "The best gadget i ever had. Customer service Rocks!A win win situation.", "verified": true, "helpfulness": "0/0", "author": "Roberto Valldepereas Mussap"}, {"rating": 1.0, "review": "To much extra equipment @$150 to connect to older tv on cable, not HTML.", "verified": true, "helpfulness": "2/5", "author": "Boston8b"}, {"rating": 5.0, "review": "It streams flawlessly and logs into HULU plus and Netflix much faster than my AppleTV, Chromecast,or Samsung device. The voice control works well and sure beats trying to type in searches with a remote control. The only advantage the Chromecast has is its size, I use it on a wall mounted tv in my kitchen where I can't put a box, but the Chromecast is slow and sometimes it won't connect at all. Overall Fire tv is the best I've used yet.", "verified": true, "helpfulness": "0/0", "author": "Kenn Day"}, {"rating": 4.0, "review": "Great... after I figured out how to use it. I heard customer service was bad but the one time I had to use it it was very good. The operator exactly what to do to fix my problem and I was watching movies again in less than 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is everything I hoped for and more. Love it! I enjoy \"gadgets\" very much but most of the time when I acquire one, it does not stand up to the expectations. This one definitely does. Easy to use and plenty of choices.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The only real problem that I found was that you cannot connect a head phones to the remote.  Now this may not be important to most, but for the hearing impaired it is important, since you cannot use closed caption with this.", "verified": true, "helpfulness": "0/0", "author": "1910"}, {"rating": 4.0, "review": "I like the speed, and would like to get even more functionality, as it looks the little machine can handle a lot more. Voice search for netflix is something that would be awesome to have. As it is, Plex and Amazon Instant Video work excellent. If you have prime is a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Carlos C. Martinez \"Eclesiastes 3\""}, {"rating": 5.0, "review": "Ease of using netflix and hulu are great. You can add apps and such as well. We haven't found a great benefit to amazon prime since a lot of the shows or movies we would be interested in have an additional cost but amazon fire was well worth the one time cost.", "verified": true, "helpfulness": "0/0", "author": "MegMcGee"}]