[{"rating": 5.0, "review": "Love it. The games are a nice bonus, but the video speed and quality is what's really makes it great.", "verified": true, "helpfulness": "0/0", "author": "D. S. Hirsch \"jampacked\""}, {"rating": 4.0, "review": "If you have an amazon prime membership, or are willing to get one, then this device is great. I received one for a gift, and have been using it for about a week so far. In the past, I have had horrible buffering issues with Amazon Video - however, using the Fire TV, I have not had one issue of this happening yet. I am super happy with the speed of play. The voice to text search is handy, but isn't really all that revolutionary. The amount of shows in the amazon prime catalog is amazing. The kids have tons of spongebob - and I\"m currently halfway into watching Alphas. I would highly recommend one if you have prime or are about to get it. If I didn't have a prime membership, I'm not sure this is worth it.", "verified": false, "helpfulness": "0/0", "author": "Watermelon Meow Meow"}, {"rating": 5.0, "review": "This device beats the other in competition for now.this is super duper fasthas an awesome screen saverif your a Prime Member this unit is the ticket!", "verified": true, "helpfulness": "0/0", "author": "KURUPDID"}, {"rating": 5.0, "review": "The Fire TV has a clean interface and is by far the snappiest media streaming device I've owned.  I have a Roku 2 and Roku 3 as well, which are also fine devices, but the faster CPU and larger amount of RAM in the Fire TV opens up new possibilities not available on the current Roku devices.  Gaming is the most obvious example, and with the optional game controller this little box has taken on a fair bit of gaming time with my kids.  My son really likes Asphalt, and my daughter is a fan of the Walking Dead game.With Plex, all of the content on my PCs can be streamed to the box.  Plex is also available for the Roku, but the streams seem to load faster and start off with better quality on the Fire TV.There are three cons my family has run into, however.  One is that there is no HBO Go app for the Fire TV.  So if you were hoping to watch Game of Thrones on this device, you're currently out of luck.  Amazon recently announced a partnership with HBO, so hopefully this criticism will be solved soon.  Another problem is that the Netflix interface is the older interface, like what the Roku 2 used to have.  The Netflix app on the Roku 3 is new and much more streamlined.  Finally, the last problem we've had is there is no way to search all providers for shows.  Amazon's voice search is incredible, but it only works on Amazon content.  The voice search does not extend to Netflix or Hulu or any other providers as far as I can tell.  On the Roku 3, media search covers all providers and returns results from them all.  This is a feature I miss, but the pros of the box make up for it.As a developer, the Fire TV's Android base makes it easy to develop content.  Not that it's hard to write apps for the Roku, but Android has more libraries, toolkits, and books covering the development model.  As an Android app developer, this is pretty exciting stuff.  The integration with Kindle Fire tablets make the development experience even more exciting - I can't wait to see what people do with it!Overall, it's a great little box and does everything I need.  If Amazon would address the cons we've encountered, it would literally be the perfect streaming device!", "verified": true, "helpfulness": "1/1", "author": "E. Rasmussen \"tech junkie\""}, {"rating": 4.0, "review": "So far I really like it, I have only watched a few included Prime movies .  I plan on investigating it's potential as I go.", "verified": true, "helpfulness": "0/0", "author": "Thomas A. Hunter"}, {"rating": 5.0, "review": "Amazing!!! Easy to navigate and control. Quick, with no delays. Also have Google Chromecast and I definitely prefer Amazon Fire TV over it.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Waide"}, {"rating": 4.0, "review": "I've had the Amazon Fire TV for a few weeks now, and I am VERY happy with it's performance.I watch a few movies through the Amazon Prime service, but more than anything else, I watch a TON of movies from my own collection.I downloaded the PLEX Media server (free) for my PC that stores all may DVD and Blu Ray rips.I installed the PLEX App for the Amazon Fire TV ($0.99)All my movies are displayed with the movie posters in the main interface. Upon selection the graphic is enlarged and the movie synopsis and actor/director info is displayed. From their I can enable subtitles, change language track, and play the movie.I would have given 5 stars had browsing the Amazon Prime library been easier.", "verified": true, "helpfulness": "0/0", "author": "LT.Son"}, {"rating": 5.0, "review": "Excellent product to expand your  TV watching choices.  Purchased to watch House of Cards on Netflix. Well worth it just for this content alone.", "verified": true, "helpfulness": "0/0", "author": "Jim Wilder"}, {"rating": 5.0, "review": "I am always skeptical when a company says, easy setup, no problems just plug it in, but in this case they didn't exaggerate.  Took me longer to unwrap it than it took to set it up. And it worked as advertised, no hangups, no calls to tech support, no fiddling around to get what I wanted. Even the wife, who is somewhat ( read: completely) technically challenged, had the Fire TV working in minutes with no shrieks of frustration and that's unusual.", "verified": true, "helpfulness": "0/1", "author": "WAP"}, {"rating": 5.0, "review": "I looked at a few set top boxes and hadn't decided on one yet when Amazon came out with this one. It's so easy to install, and it comes all ready to go if you order it from Amazon. The interface is just gorgeous, and it's really user friendly. The remote is a good size, so it won't get lost easily like the ultra-mini remotes that seem to come with too many things these days and it's a simple remote.I like the cloud and being able to set up slideshows of photographs. The voice control works well with Amazon video, and this is perfect with a Prime membership. Because of the voice control, this is the set top box that I recommended to my dad who has vision problems.As far as games go- I do have the Fire TV game controller, and it was a big selling point for me. My family is full of gamers. The games available now are mostly fun little time wasters, the sort of thing you would play on a tablet or phone. Sev Zero, which is designed for this platform, really shows off the potential of it. It's well-rendered and attractive.You do need a good fast internet connection with this, because it defaults to the HD versions of shows.", "verified": true, "helpfulness": "0/0", "author": "Shala Kerrigan \"Glitter it and call it art.\""}]