[{"rating": 4.0, "review": "I've only had the Fire TV for a week, so I am still learning it.  However, the set up was really easy and navigation is pretty simple too.  I also like when you search for something it gives you options on where you can watch - Prime, Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "Neil Peterson"}, {"rating": 5.0, "review": "The Amazon Fire TV is easy to hook up, user friendly and has so much to offer the viewer. Makes a great gift. I highly recommend the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Robert Petovello"}, {"rating": 5.0, "review": "After getting a new blue-ray player to use for Netfex and others. I took it back because it would not load the movies.  I got theFire after hearing about it from a friend.  I was hesitant about doing it after my trouble with the blue-ray, but it works great.I would reccommend it very highly.", "verified": true, "helpfulness": "0/0", "author": "Fran Hooten"}, {"rating": 4.0, "review": "I think it is great, but there is a certain amount of things that are free, and then you have to pay for the rest.Example:  I can see half of a season of The Walking Dead, but I have to pay for each episode afterwards.", "verified": true, "helpfulness": "0/0", "author": "Diosmedes Garcia"}, {"rating": 5.0, "review": "It really is easy to set up and use. With your Prime membership there is tons to choose from for free. Renting movies is so simple and the selection is great. It's a breeze to add other Internet T.V. apps. All in all a lot of bang for your buck.", "verified": true, "helpfulness": "0/0", "author": "Christine Graening"}, {"rating": 5.0, "review": "The only problem I have is that they talked me into joining PRIME and I was led to believe movies were free with Prime. Not True!", "verified": true, "helpfulness": "0/0", "author": "Jim Soltis"}, {"rating": 5.0, "review": "I have a ROKU3, smart TV, and smart Bluray disc player and the FIRE beats them all.  Sometimes, the marketing exaggerates the performance of a product, but NOT in this case.  The voice recognition is the BEST I have ever seen.  It's such a pleasure to search by voice instead of with the hunt and peck method.  And the streaming reliability far exceeds my other devices.", "verified": true, "helpfulness": "0/0", "author": "billflag \"Ride On\""}, {"rating": 5.0, "review": "BECAUSE ITS EASY TO USE.AND ITS SMALL AND IT LOOKS NICE AND ALSO THE VOICE COMMAND ON THE REMOTE CONTROL.", "verified": true, "helpfulness": "0/0", "author": "Eddie Negron"}, {"rating": 4.0, "review": "I will start off that I have only had this for about a week. Here are my notes:Pros:Great picture qualityEasy setupEasy to maneuver through the menusThe voice command works perfectlyNice design of the remote and Fire TVCons:I really only have one. The games are very difficult to play with the remote. I will have to splurge and get the game controller.Overall I like it and for the most part its everything I would expect from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Dore33"}, {"rating": 5.0, "review": "This thing is amazing and easy to use. It's like a trip to the video store. I only wish it had an HBO app", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]