[{"rating": 4.0, "review": "This review will be quick and to the point.  I own a smart tv(one of the first ones actually), and I recently moved to a new home.  My smart tv doesn't have wireless support, and I didn't feel like running lots of cable to the tv to use these features.  I began my search for a streaming box, and finally decided on the Amazon Fire TV.  I have used an Apple TV in the past and enjoyed it very much, but I decided to try something new and exciting.  The Fire TV meets all my needs and more.  I am not a cable customer, and it streams netflix, amazon instant and much more quickly and much better than my smart tv ever did.  I can't give this a perfect rating because there is definitely room for improvement, but it doesn't get much better than this when it comes to a streaming device.", "verified": true, "helpfulness": "0/0", "author": "A. Hamilton"}, {"rating": 4.0, "review": "I bought it for my daughter's bedroom, I don't go in there but so far she has no complaints.", "verified": true, "helpfulness": "0/0", "author": "evelyn huxtable"}, {"rating": 5.0, "review": "Love my Amazon Fire TV.  A lot of entertainment in a tiny little box.", "verified": true, "helpfulness": "0/0", "author": "SummerBlnd \"MEM\""}, {"rating": 4.0, "review": "This device suits my personal needs quite well. I just wanted a way to stream my amazon Prime and owned movies. I was old-school with a laptop with HDMI out plugged into my TV until I got this. It was super easy to setup the basics and the picture quality is way better than what I was getting through the internet media players. I'm pretty impressed with the basics.This isn't really amazon's fault per se, as I understand that sports are locked in contracts with the big telco content providers, but I'm still looking for way to stream sport and at least an app to stream nhl leave through the content providers would suffice (without having to sideload). I'm also not sure why they provided big drive space as it doesn't seem super obvious how to load and play your own content. I'm sure you can, but I haven't had time to look into it.Overall, I'm pretty impressed for the price!", "verified": true, "helpfulness": "0/0", "author": "Rebecca R. King"}, {"rating": 5.0, "review": "Great easy to use and more important easy to hookup it took me all of 5 minutes love it", "verified": true, "helpfulness": "0/0", "author": "Mr. NAW"}, {"rating": 5.0, "review": "Works as advertised.  I'm very happy with the unit.  Responds quickly to voice.  Had it set up and running in about five minutes.", "verified": true, "helpfulness": "0/0", "author": "Richard Ryden"}, {"rating": 5.0, "review": "Received this as a gift. Like it a lot. Great way to watch movies, Netflix and  more. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easily the best I have ever owned. Nothing can compare to it. I had a roku 3 and a friend of mine has the apple tv. The fire tv is so much faster and the quality in sound and video is amazing. And to top it off the price is wonderful for what you get out of it. The only reason i can think of getting something else other than the fire tv is for apple's air play if you are a apple person. Even if i was an apple person I would still probably go with fire tv.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 4.0, "review": "Overall very please with this purchase. I can add on my other memberships (Hulu Plus, Netflix, etc) and it is easy to navigate through the interface. I do wish there were more historical TV options available under my Prime membership.", "verified": true, "helpfulness": "0/0", "author": "BillF \"BillF\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Angel Ziegler"}]