[{"rating": 5.0, "review": "Delivered as promised right out of the box, first try. 10 times easier to use than Apple TV or Netflix.  Found everything I looked for quickly and easily.", "verified": true, "helpfulness": "0/0", "author": "Thomas Wyckoff \"Tom Wyckoff\""}, {"rating": 4.0, "review": "Easy to use. Came preset for my Amazon Prime account. Content could be better, but for the price can't complain. Movies look great, no buffering.", "verified": true, "helpfulness": "1/1", "author": "Sally A. Wise"}, {"rating": 5.0, "review": "Was the right decision for me. I am a big user of Plex and to run it on the Apple TV you had to trick it. That was hit and miss, just when you thought you got it working Apple would plug the whole and it would stop working. Plex runs native on the Amazon Fire TV and I love it!Rich", "verified": true, "helpfulness": "0/1", "author": "Richard J. Hagan"}, {"rating": 3.0, "review": "Because they are Amazon and want to proprietorially restrict their Equipment. The have left out those programs that allow you to redeem your movies through VUDU, Or Flixster. So if you are invested in other programs don't invest in Amazon Fire.It's the same game with Apple TV. The want your redeeming. Rather, you go through alternative means. I would have left Apple Tv and Roku. If the offered VUDU. Too bad.", "verified": false, "helpfulness": "0/2", "author": "Sterling"}, {"rating": 4.0, "review": "My learning curve with the Fire TV has been slow.i would like some brief reviews with ideas of how to use it.Where i do use it, the quality of use and picture is excellent.", "verified": true, "helpfulness": "0/0", "author": "purchaser"}, {"rating": 4.0, "review": "Wonderful if you have netflix and amazon prime. I just wish it had the spotlight search for netflix as well", "verified": true, "helpfulness": "0/0", "author": "Karley Gann"}, {"rating": 2.0, "review": "I HAVE LIVED IN THE HEART OF SILICON VALLEY FOR OVER 45 YEARS AND WORKED FOR SEVERAL HIGH TECH COMPANIES. THE INSTRUCTIONS THAT ARE INCLUDED IN THIS PRODUCT ARE SO VAGUE AND UNCLEAR, AT LEAST FOR ME, A RETIRED SENIOR CITIZEN AND FORMER EXECUTIVE IN THE HIGHT TECH INDUSTRY. TO BEGING WITH, ONCE YOU CONCECT THE DEVICE TO YOUR TV, IT AKS YOU FOR YOUR ID AND PASSWORD; BUT THEY NEVER TELL YOU HOW TO ENTER THE INFORMATION. AFTER 2 HOURS OF RESEARCH, I DISCOVED THAT YOU HAVE TO PRESS THE BIG ROUND BUTTON FOR THE KEY BOARD TO APPEAR. SECOND, TO LOOK AND SELECT THE APPLICATIONS IS ANOTHER NIGHTMARE; AND THEY DO NOT AUTOMATICALLY APPEAR WHEN YOU SELECT THE PORT FROM YOUR TV. THIRD, TO HAVE THE CAPTIONS APPEAR TOOK ME ANOTHER 3 HOURS OF RESEARCH, AND THERE IS NO PHONE NUMBER THAT YOU CAN CALL. FOURTH, I HAVE A SLIGHT ACCENT, THEREFORE, THE VOICE INSTRUCTION ARE A NIGHTMARE TO USE. IT NEVER UNDERSTAND WHAT I SAY. FIFTH, IF YOU LET YOUR TV IDLE FOR MORE THATN 10 MINUTES, THE DIVICE HIGHJACKS YOUR TV AND GIVES YOU THE MOST BEAUTIFUL SCREEN SAVER PHOTOS IMAGINABLE; BUT THEN, YOU HAVE TO SELECT THE HDMI PORT TO WATCH TV AGAIN. OTHER THAN THAT IT IS A GOOD PRODUCT. I WOULD HAVE RETURNED, IF IT WEREN'T FOR THE HASSLE.", "verified": true, "helpfulness": "1/6", "author": "anyone"}, {"rating": 1.0, "review": "tried several times to set up per instructions with no success. contacted amazon, tried everything again, still no connection. it was \"suggested\" that my wireless was at fault, but there are two laptops and a printer that work fine on the system.", "verified": true, "helpfulness": "3/9", "author": "william adamson"}, {"rating": 3.0, "review": "Warning- double check that your tv is HDCP ready otherwise you will not be able to use this!! I did not see anything about that when i purchased it and found it would not work with my Tv with DVI input according to tech support. Upon further research i found my DVI is HDCP ready and even with an upgraded Hdmi to DVI cable, no luck. But thanks to some additional poking around i bought this: http://www.amazon.com/gp/product/B004F9LVXC/ref=oh_details_o00_s00_i00?ie=UTF8&psc;=1 and now it works great. So just a heads up if you are using an older tv you will need to have a work aroundGood but surprisingly limited device. I was expecting more app and streaming content than i have been able to find. I am hoping that this is only because it is a newer device, because otherwise my Xbox has access to more apps which is sad.", "verified": true, "helpfulness": "2/2", "author": "William Allgood"}, {"rating": 5.0, "review": "When we first tried to hook it up to our television, nothing happened.  So we called Amazon and was transferred to the Amazon Fire TV technicians.  After I told the technician that there was only one HDMI port on our tv he determined that our tv was too old so we could either return the Amazon Fire TV or buy a new tv.  Well, my brother came over and hooked it up in no time!  It's a good thing we didn't buy a new tv!  That being said, it's wonderful!  Now we will always be entertained!  it's a real small, compact unit that takes up very little shelf space.  Very easy to navigate with the included remote.  Especially like the voice search feature!  Two thumbs up for the unit but not the technical help.", "verified": true, "helpfulness": "0/2", "author": "Cathy K"}]