[{"rating": 5.0, "review": "I love my FireTV! Easy to use and setup. NOTE: When you first setup the device, I urge you to run the update feature in settings. Netflix did not work at first, but after updating it worked perfectly.Since setting this up, I have spent less time on Comcast and more time on Netflix, Hulu Plus and Amazon movies.", "verified": true, "helpfulness": "0/0", "author": "Tony Vargas"}, {"rating": 2.0, "review": "Returned it. Screen kept freezing up while dialog continued. Bugs need to be worked out", "verified": true, "helpfulness": "1/2", "author": "L. Watkins \"avid reader\""}, {"rating": 4.0, "review": "Great device, I have been using it for about two weeks now and everything about is just great. Definitely met my expectations.", "verified": false, "helpfulness": "0/0", "author": "Sara Ahmed"}, {"rating": 4.0, "review": "Good way to watch video and view family photos.", "verified": true, "helpfulness": "0/0", "author": "Chris Nowinowski"}, {"rating": 5.0, "review": "No complaints, love my fire TV, easy to install, easy to use.. Awesome", "verified": true, "helpfulness": "0/0", "author": "Jenbell1981"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Durre Hasan"}, {"rating": 2.0, "review": "Was hoping for more of the classic TV to be free and trying to down load music is so confusing just gave up then trying to fling programs from my PCor tablet that's really confusing", "verified": true, "helpfulness": "0/1", "author": "scott blanchette"}, {"rating": 5.0, "review": "Excellent!!!", "verified": true, "helpfulness": "0/0", "author": "debbybee"}, {"rating": 5.0, "review": "Very easy to set up and works great. If you have Amazon Prime then Amazon Fire is a must.", "verified": true, "helpfulness": "0/0", "author": "philip nugnes"}, {"rating": 4.0, "review": "overall I'm very happy with the Amazon fire TV. I'm very disappointed that the voice search only searches Amazon Prime instant video. I wish it searched Netflix also for movie choices.  I have a Google TV Box also, and when I search for a movie, it pulls up results from the Web, Netflix, Hulu, Amazon, Etc...  all the sources so I can choose which one to stream from. Also would be nice if the remote or main screen had a quick way to TURN OFF or SLEEP the FIRE TV without having to go to the Home Screen, scroll to settings, and then over to settings and THEN Sleep.I really wish the Fire TV did that.... it's what I was expecting.  Maybe they can do that in an update.", "verified": true, "helpfulness": "0/0", "author": "E. Johannessen"}]