[{"rating": 5.0, "review": "Owned a Roku for a few years. I love the Fire TV. Very smooth and fast, picture quality is awesome. Everything I expected and the voice search works great!", "verified": true, "helpfulness": "0/0", "author": "Troy H"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Maddie Lynema"}, {"rating": 4.0, "review": "Amazon Fire TV in HD is a bargain if you also have Prime. The selection of free movies and TV to stream is excellent. All that is needed is a fast Internet connection and a TV or a receiver with a free HDMI 1.4b port.The four star rating is due to HBOGO which is not as reliable as Amazon's own streaming capability.", "verified": true, "helpfulness": "0/0", "author": "Watch collector 99"}, {"rating": 5.0, "review": "Awesome!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Scott McMechan"}, {"rating": 4.0, "review": "It's a pretty nice box in many ways.  The digital out is useful for me.  Loads movies fast.I bought this largely for Prime Music, which is fine.  But you can't search for content in music.  You have to add it to your library via another device.The other thing I use it for is Plex to play my own music collection.  This works ok, but definitely has some bugs and quirks.  First, you can't move forward or back in a song.  Second, it doesn't remember searches, and there is no way to get back to the search results page after you select an item, so you must retype your search every time.  Third, you can't search by song.", "verified": true, "helpfulness": "0/0", "author": "Tracing Error"}, {"rating": 3.0, "review": "Brought it to install xbmc on it. Works great. Does the job intended.", "verified": true, "helpfulness": "0/0", "author": "JOnathan Waide"}, {"rating": 5.0, "review": "Love my Fire box!!!", "verified": true, "helpfulness": "0/0", "author": "Nyla R."}, {"rating": 5.0, "review": "It has all the features of the other players and is so easy and convenient", "verified": true, "helpfulness": "0/0", "author": "Work relatef"}, {"rating": 3.0, "review": "Excellent for Prime movies and TV.  Also very good for Prime music with access to cloud for my music library.  Not so good for other apps, in fact very poor.  No HBO Go or Max Go app available.  Showtime Anytime app does not work if your satellite provider is DirecTV or Dish.  Come on Amazon... all these are available on my computer and HBO & Showtime are available on my Kindles.  I didn't buy it for the games.  Solitaire is OK but anything more sophisticated, not so good.  Don't bother with this if you want fast, or even medium paced action.", "verified": true, "helpfulness": "0/1", "author": "Bob Gillette \"Bogey\""}, {"rating": 5.0, "review": "GREAT APP TO HAVE FOR EVERYONE TO ENJOY", "verified": true, "helpfulness": "0/0", "author": "Manuel"}]