[{"rating": 5.0, "review": "Excellent product!  Easy setup, great picture quality, simple interface!", "verified": true, "helpfulness": "0/0", "author": "John Zaagman"}, {"rating": 4.0, "review": "The hardware in the Fire TV is great!  The only thing that turned me away for the price was the lack of Infrared Remote.  If it had it I would have kept the device.  Instead I returned it.  Luckily for me they released the little brother, the Fire TV Stick.  Also a great product, but at half the cost!", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 2.0, "review": "Fire TV gets two stars because of the easy access to Amazon Prime video. Other than that, we are very disappointed in the experience of using the Fire TV device. The user interface is clunky and not intuitive. I must mention that we are avid AppleTV users and love that product. Our reaction to the Fire TV could be influenced by the prior experience with the AppleTV but, after switching back-and-forth between the two for many days, the Fire TV is just a bit too confusing. We've had the device for many weeks and, after about 10 days of regular use, the Fire TV is hardly used at all. My hope is that Fire TV improves the user interface and makes things easy to find and easy to use. Until then, I'm afraid it will be gathering dust.", "verified": true, "helpfulness": "0/0", "author": "eddie sutton"}, {"rating": 5.0, "review": "Getting a lot of enjoyment from Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Pat Wilkerson"}, {"rating": 1.0, "review": "I regret buying this - searching is not intuitive and is no better than the Roku I purchased three years ago.  Save your money.", "verified": true, "helpfulness": "2/2", "author": "MED"}, {"rating": 5.0, "review": "I love this! Amazon Fire TV is wonderful it’s changed my life and my family’s for the good. It’s great to take with you while moving and watch what you want in a hotel. Only things I don't like about it is there watch list needs to have categories or a profile you can make for more than one person on there. I don't like scrolling past the 100's of things in my watch list to find what I want to watch in the watch list. If the watch list could be sorted with content category’s it would really help a lot. As a disabled person I don't have the strength often to leave my house so I love that Amazon Prime has so many travel logs I can see the world while still being at home it helps a lot. I love how I can take the Fire box and hook it up to different devices to watch things. I know Amazon is constantly working on making it better and it’s great how they really listen to customers on changing and adding to their programs and function of their device. This has been the best thing I have gotten in years very worth the cost even with its few cons it’s still wonderful! Hopefully Amazon keeps improving on things like they have been. One caution there is no off button on this and it can get very hot sometimes Amazon is wonderful about fixing things I had one box get way to hot they just got me a new one out no charge. I’m hoping they put Highlander the cerise back on Amazon prime I miss watching my favorite show on there but there are plenty of other things to watch. I’m not fond of their new Amazon made TV shows a but I’m picky about what I watch and that's something you get with this lots of watching choices. Without Amazon prime I don't know if this would be worth much but I do have Amazon Prime and it’s wonderful with it. I also wish you could stream the same thing on only one account at the same time so I could watch the same thing in the bedroom as my family is watching in the living room I have faith that Amazon is working on it. This really is great to have a well worth the cost of the Fire box and Amazon prime", "verified": true, "helpfulness": "0/0", "author": "Cheri K"}, {"rating": 4.0, "review": "I really like the Fire TV. It's very user friendly and easy to set up. The apps that come with it are great. We got Sling TV to cover my husband's love of sports but are still saving so much over Direct TV. It's fast loading and the picture is clear.  We have had a problem with Sling shutting down for no reason, but it has been infrequent. The only complaint I have is that there is no way to have parental control over the apps. I guess that's up to each app to provide. The parental controls with Fire TV require a code to access or buy anything so it even controls my tech savvy grandkids. They just don't know the code which I plan on changing frequently to keep ahead of them.  All in all I would recommend this to everyone.", "verified": true, "helpfulness": "0/0", "author": "Pattie S"}, {"rating": 4.0, "review": "I've been an Amazon prime member for over a year and have always used the Amazon app on my bluray player or PS3 for access to movies. There were many occasions where I had issues with streaming movies (quality of video, buffering, etc.) and generally blamed my internet provider, especially on busy weekend nights. I often wondered if the Fire TV box would do a better job, but never saw a review that addressed that situation. Well, it went on sale a couple weeks ago and I decided to give it a shot. I am soooo glad I did! Most reviews say it is fast, and boy is it! This thing is a 1,000 times faster  than streaming from my bluray player or my PS3. Just click and BAM, the movie starts. The quality of the video surpasses what I've been watching also. Pixelation in dark parts of the image was a big problem, buffering during the movie, could not pause and come back to watch without stopping and resuming. All that has stopped. It's not quite bluray quality, but, I might now pay extra to watch a new release as opposed to going to RedBox. Thank you, Amazon", "verified": true, "helpfulness": "0/0", "author": "DLB"}, {"rating": 5.0, "review": "So very pleased with it ,far beats my old blue ray player ,Terific.", "verified": true, "helpfulness": "0/0", "author": "Doreen Coley"}, {"rating": 1.0, "review": "Why can't you get the Hulu app.  The free one.  Your content is pretty limited", "verified": true, "helpfulness": "2/3", "author": "Scott Samuelsen"}]