[{"rating": 5.0, "review": "Way cooler than roku! I just wish it could do my cleaning and shopping for me too! I'm a little obsessed.", "verified": true, "helpfulness": "0/0", "author": "Cathy Brock"}, {"rating": 4.0, "review": "Yeah and Nay...if you have terrible internet speeds.  (less than DSL)  This is not the gadget for you.  I performed a speed test using my wireless internet in my home and was told by technical support it should work fine.  However.  There is quite a bit of the picture freezing and the people continue to talk.  Picture just stays static while the characters continue to act out their parts.  Very annoying.  Other than that, I love it.  The remote makes it very easy to navigate the menu.  There are games but you must purchase the game controller to take full advantage of the gaming offered.  Everything else worked as described. I really like the voice recognition on the remote control!", "verified": true, "helpfulness": "1/1", "author": "dslayman"}, {"rating": 4.0, "review": "Does this device work outside USA and if yes what are the subscription fees?Does it need and installation other than connecting to a TV?", "verified": false, "helpfulness": "0/2", "author": "Fady"}, {"rating": 3.0, "review": "Great hardware,  but content needs to be increased. Picture quality, remote, speed of operation are top flight! Not a gamer but that feature will appeal to many.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this television where you can watch pretty much anything even Pandora! This is the best investment I could have ever made.", "verified": true, "helpfulness": "1/1", "author": "Joy2know"}, {"rating": 3.0, "review": "I'm trying to cut the cable cord as far as TV watching goes; the free apps are for older  or very different shows...to see any new things you have to buy a service (like hulu plus,netflix,etc.) I was hoping for something I could get NBC,ABC, etc, or regular Hulu. On the plus side the picture is great, shows load very quickly without annoying buffering and the apps that are free do have a lot of content. The instructions for use are very limited other than connect it, turn it on and let it go. Hoping with added channels it proves to be worth the expense, but not ready to cut the cable cord with this device at this time.", "verified": true, "helpfulness": "1/2", "author": "Michigan Steve"}, {"rating": 3.0, "review": "Positive side. It is very fast.  I did have initial problems with the device for some reason turning itself off. Now after a few emails to customer support it no longer does that. I will say Amazon does give out a FEW, not many, free programs on this device, HOWEVER, almost all programming  is for a price. I have no problem with this except that I am disappointed with the fact that I feel like I was sort of drawn in with the \"free\"  promotion, and almost none of what is on the Amazon Fire is free.  In fact if you are not very careful you can be charged, as I was, for a program that will be instantly billed to your account, in my case, the first show of Big Bang Theory, which I punched up, then the next morning saw the $2.99 deduction from my bank account. All being said, Amazon Fire TV does provide a wide range of  offerings, HOWEVER be aware that you WILL be paying for most of it. Gary Goude.", "verified": true, "helpfulness": "1/1", "author": "Gary R. Goude"}, {"rating": 4.0, "review": "Hardware: This is my first experience with any of Amazon's hardware. The build quality seems to be top notch and there is a definite weight to device. The remote also fits nicely in your hand. Speaking of remotes, I had a pleasant surprise when I noticed that the remote to my TV was able to control the device as well. This is because they support HDMI CEC. There are some limitations to that though, because the TV remote do not include the standard android buttons, but it does come in handy for casual control and convenient use. My biggest complaint is the memory. I installed 2 games, Bard's Tale and Asphalt 8. After downloading the required data packs I was getting messages that I was running out of memory and the streaming quality of the video could deteriorate. I think they could fix this with an external memory card.Software: The overall user interface is good, and they did a good job hiding the underlying Android OS. They made it possible to side load non Amazon App Store apps, but it is not something the casual user will not do. The problem with side loading apps is that they will not show up in the launcher. Other things that I found missing were a web browser and the ability to connect an external hard drive. All of these items can be addressed in software upgrades. Amazon Developers, if you're reading this then please add the following features, a Web Browser, support for expandable storage, side loaded apps in the launcher, support for web cams, voice text entry in any field, and access to the entire library of App store apps.Overall I like the device. The quality even when viewing SD video is very good. I am one week into my trial period and am considering purchasing the device.", "verified": true, "helpfulness": "1/1", "author": "GusTeez"}, {"rating": 1.0, "review": "Poor stream quality.  Sending it back.  I've used apple TV with no issues so this is very disappointing.  I can't say one nice thing about this device.", "verified": true, "helpfulness": "5/11", "author": "Tim"}, {"rating": 3.0, "review": "Everything you have to buy theirs not many movies...free like other TV modam i think you know what I'm talking about", "verified": true, "helpfulness": "1/8", "author": "yahya"}]