[{"rating": 1.0, "review": "I love the fire TV but if you have Internet that is based on data usage like a lot of small towns have then this thing will suck the life out of you. I have been paying $200 a month in overage fees and finally narrowed it down to the Fire TV. Huffington Post has a great article on it too. Anyway I have this useless heap of technology that I can't afford to use and tried explaining the situation to Amazon Customer Service. Well because it took me so long to figure out they won't let me return it. This is a well documented problem with Fire TV and Amazon just tells you tough, deal with it. All I want to do is return a perfectly functioning product and use the money for something else.http://www.huffingtonpost.com/2014/07/01/amazon-fire-tv-data_n_5545687.htmlhttp://www.reddit.com/r/amazon/comments/2pzgoc/anyone_having_data_usage_issues_with_the_fire_tv/http://www.technobuffalo.com/2014/07/01/amazon-acknowledges-fire-tv-is-a-data-hog/", "verified": true, "helpfulness": "31/36", "author": "Chris Ostrom"}, {"rating": 5.0, "review": "My new toy. I'm very enjoying this product. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Elias Rodriguez Ferrer"}, {"rating": 5.0, "review": "We cut the cable cord and for the Amazon Fire! I could not be happier. The kids love the \"Free Time\" , my husband has his shows. It is so new that there aren't a huge amount of Apps yet.... We love it so much we got the Fire stick for the other TVs!!!!!", "verified": false, "helpfulness": "0/0", "author": "Melissa F"}, {"rating": 5.0, "review": "It streams HBO, Netflix and Amazon Prime over wifi with no problems so it does everything I need it to do.  Would be nice if it could voice search all providers and list comparative price and availability with each for a particular show.  I'm hoping for a firmware update to do that.", "verified": true, "helpfulness": "0/0", "author": "James M. Spencer"}, {"rating": 5.0, "review": "blows roku out of the water. and the only ding on this was hbo which is now available!  basically no reason to get a roku over this now.", "verified": true, "helpfulness": "0/1", "author": "gigah"}, {"rating": 3.0, "review": "I like the many TV and movie choices the Amazon Fire carries.  I do not understand why Amazon charges for TV shows that their competitor does not charge for.", "verified": true, "helpfulness": "0/0", "author": "mlove"}, {"rating": 5.0, "review": "Excellent product!  I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Staci Hebert"}, {"rating": 3.0, "review": "Nothing from Comcast works for Amazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "Eric H."}, {"rating": 4.0, "review": "I do like my fire tv box however, I wish it had an option to see only prime free shows versus scrolling through everything that you pay additional fees for. The remote is also very tiny and always seems to get lost. I am considering purchasing another one though, it's a great alternative to renting a cable box for rooms that you don't watch tv in often.", "verified": true, "helpfulness": "0/0", "author": "Jen \"Jen\""}, {"rating": 3.0, "review": "This box excels at many areas and I like it much better than the Roku 3 I have.Pro'sFast and SmoothAmazon videos are organized well and it's ability to minimize the loading screen is very nice.Voice search works very well, if limited in what it can search.Decent selection of apps (HBO Go counts as a negative for Comcast users, see below)Con'sHBO Go.  Comcast is NOT listed as one of the participating cable providers for Fire TVHBO Go.  Comcast is NOT listed as one of the participating cable providers for Fire TV (yes, twice)No volume control, like most media boxes sound is not controlled by the box.  So yes, you still need multiple remotes.Carousel interface is not the most friendly method of organization.  It's okay as long as you're in Amazon's universe but this is where 3rd party apps really fall short.", "verified": true, "helpfulness": "0/0", "author": "Kenneth"}]