[{"rating": 5.0, "review": "I have Netflix, but I love my Amazone Fire TV because it has movies that Netflix does not and it has Showtime and HBO series :)", "verified": true, "helpfulness": "0/0", "author": "Rosalyn Reyes"}, {"rating": 5.0, "review": "It looked really great the voice option worked great but after realizing on my LG TV comes with SmartTV that the Amazon Fire TV is their version of the SmartTV so I returned it but I did like the voice app.", "verified": true, "helpfulness": "0/0", "author": "Kelly A."}, {"rating": 4.0, "review": "very easy to use.  Voice recognition works pretty good.", "verified": true, "helpfulness": "0/0", "author": "L Boyle"}, {"rating": 5.0, "review": "The only problem I think I might have is losing the remote its so small.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 1.0, "review": "It is clearly a piece of crap which I will return. The first Amazon Fire TV that they sent me did not install and customer service determined it was defective. It was hard enough trying to figure out how to get in touch with technical support customer service. The second Amazon Fire TV that they sent did not install easily and when it was finally installed it kept stopping during the movie and telling me that I had no internet connection.  I sent an e-mail to Amazon, they sent me detailed instructions on how to \"clear data\". Amazon CS said that \"clearing the data\" would solve the constant re-buffering problem. I followed the instructions for \"clearing data\" and I  still kept getting a message saying that my internet connection was lost .  I kept having to have to unplug the device and start over. Then it started telling me that my internet connection was too slow and it would stop streaming.  It would attempt to re-buffer the film but the film would never start again. I just turned the TV off and started watching the film on my laptop.  I will return the Amazon Fire TV and accompanying game device next week.I have a google chrome computer which streams videos on my TV easily from the internet without all of this bull crap. Google chrome and Amazon can't get together and allow their individual products to interface with one another.  Amazon should just interface with Google chrome and allow Google chrome to stream  Amazon Prime.  Amazon has wasted much time and effort and they have annoyed me and caused me to waste a lot of my time and effort and ultimately tried to rob me.  They will have to refund my money, this trash does not work and it does not deliver what is promised.", "verified": true, "helpfulness": "8/9", "author": "George M. Sharrow"}, {"rating": 3.0, "review": "clear picture. my 3 year old son liked to watch all the time...but if wifi is slow, it will pick up slow also...", "verified": true, "helpfulness": "0/1", "author": "DBV"}, {"rating": 4.0, "review": "So far I like Amazon Fire TV lot but it is not as easy as you would think.  I have had to Google the heck out of some of the features and still have not gotten good with flipping things from my kindle to the TV.  My particular Kindle Fire is the first gen and doesn't do all the things the latest Kindle Fire can do.  That was a bit disappointing as the ads were not that clear on that point.  My Kindle Fire is still going strong and there is no reason to replace it just yet so I hope that Kindle will address that problem and not let the old school folks such as myself be left out.  I also wish that the Logitech remote had support for Fire TV as well.  You can jury rig it a bit but the codes for the Fire are not there.  Don't know if that is Logitech's problem or if Fire needs to reach out to Logitech to offer them the secret number to the kingdom.Also there are not that many free shows and the gaming selection is a bit weak.It is almost too easy to accidently purchase a show instead of watching with Prime.  To stop that I had to child lock myself out of making purchases with a secret code.I really want to \"cut the cord\" with cable but am not entirely convinced yet that I can do this just yet without regret.", "verified": true, "helpfulness": "0/0", "author": "D. Fillinger \"myz\""}, {"rating": 1.0, "review": "i bought it there is an 81 year old person that lives here and i thought voice command would be nice for him but i have a hulu plus account it wouldnt take it and other accts that i pay for would not use my accts wanted me to pay a ridicolous price i called amazon and hulu neither one said they could do anything they blamed each other took it back for a refund", "verified": false, "helpfulness": "6/8", "author": "ben stiles"}, {"rating": 5.0, "review": "Best device to have if your tv is not internet ready.Easy to use and great to have all your options in one place.", "verified": true, "helpfulness": "0/0", "author": "Steve Harvey"}, {"rating": 3.0, "review": "Sucks up bandwidth! Caps are here with most ISP's. Please allow us to turn off the prefetch feature.Faster compared to Apple TVWish it had an iOS app to control itVoice feature is cool for 5 minutesAnnoying that apps have to be downloaded instead of pre-installedEnd up returning after my free 30 day trial", "verified": true, "helpfulness": "0/0", "author": "B. Gibbs"}]