[{"rating": 5.0, "review": "This product virtually installs itself.  We had only DSL available so I purchased a fabulous Medialink router and was streaming my first movie about five minutes later.", "verified": true, "helpfulness": "0/1", "author": "K. Michael Waldock"}, {"rating": 5.0, "review": "I read a lot of the reviews and still couldn't make up my mind if I wanted to spend the $$ to buy this. Come on Amazon, a $100?Anyway I spend a lot of time on my laptop for my business and I also use it to hookup the TV with an HDMI cable so I can stream movies, etc. I hated that it was either work or watch a movie. So I gave in and bought the Amazon Fire TV a week or so ago.It, and I'm not kidding, took me longer to get it out of the packaging than it did to hook it up. I liked that Amazon had registered it to me so I didn't have to waste time setting my account. The instant I finished with about the only thing you have to do which is put in your wireless modem ID (am still not sure why the Amazon setup refers to it as \"password\") and boom it was set up. The instructions on how to use it couldn't be more simple.Okay so the only minor complaint is that unless you use the voice option on the remote control, scrolling through your watch list can be a pain. I have a lot of stuff on my watch list so it can take a while to find what I'm looking for.This is what I like about it - I like how easy it is to use; I like that if I have to put it on pause, after about a minute these absolutely beautiful scenic pictures come on; I like that after about an hour of non-use (like you've switched back to regular TV) it powers itself off; and, I like that it's small and portable.It was a good investment, I can now work and stream at the same time - life is good.", "verified": true, "helpfulness": "1/1", "author": "Suzi Girl"}, {"rating": 5.0, "review": "Totally awesome big time!  I am thoroughly enjoying this thing.  Recommend? Oh you betcha! You gotta get one of these!", "verified": true, "helpfulness": "1/1", "author": "Phillip A Brunecz"}, {"rating": 5.0, "review": "I am really enjoying this. What is so amazing is the ease of setting it up. The portability is great also.", "verified": true, "helpfulness": "1/1", "author": "Ira"}, {"rating": 1.0, "review": "I love the Fire TV but after 30 plus days the remote stopped working. The only way to navigate is with a USB enabled keyboard plugged into the box. This sucks. Among the many things that one can't do without the remote is voice search.My complaints to amazon have resulted in a free remote replacement, which would not pair with the receiver - even their customer service couldn't get it to work. The follow up call to amazon resulted in 3 techs on the phone working with the customer service rep who couldn't get it to work. An additional free remote was in order, which one week later, amazon has not shipped.I am not going to sell this piece of crap but instead leave this cautionary review. Roku has been ordered.", "verified": false, "helpfulness": "1/1", "author": "J S"}, {"rating": 5.0, "review": "I see all thing tech stuff, dont care....this gives what if offers in that its a great gateway to tv watching as YOU wantYes, I woulda liked if they'd been clear at the first that wifi was required (I still have friends without it)and as for the Amazon Prime Instant, its well worth itone odd thing .. I see several comments that, sometimes, the free things are hard to find, and they areBUT I found that if you go to ..... not all, but some.......a show and it SAYS its XX.XX per episode, be sure to check the\"Other ways to watch\" as it shows Amazon Prime there rather than on the first pageBut, its works really well, it does offer a lot of variety and its worth every penny.Remember guys, you DO have to buy the other 'stuff'  like amazon prime or netflix or subscribe to showtime to get shotimeanytimeIf you're looking for a super duper game/tv/instant/etc/etc maybe you could look else where but geez, if all thats important to you ....you probably aren't looking at this in the first place (haha)", "verified": true, "helpfulness": "1/2", "author": "Curtis Lyon \"curtlyon19\""}, {"rating": 2.0, "review": "After installing the device, a table of numbers & letters appeared on my TV requesting a password. I had not been provided any password in the packaging, so I used the PW that I always use to sign on to Amazon, which was not accepted. I contacted Amazon technical service and tried various methods of getting the device to accept a password, which included booting & rebooting several times, disconnecting & reconnecting all cables several times, changing my password. None of this helped and I returned the equipment to Amazon. If anyone else has had this type of problem which they were able to resolve, I would appreciate any feedback on your solution which might be applicable to my problem with this product.", "verified": true, "helpfulness": "3/5", "author": "Don"}, {"rating": 5.0, "review": "Everything you would expect and being self contained blows Chrome out of the water I love this system thanks Amazon", "verified": true, "helpfulness": "1/1", "author": "michael"}, {"rating": 1.0, "review": "The good:  The box is very small, easy to hook up, and there is a nice screensaver when you aren't using it.The bad:Primarily, Amazon advertises \"40,000 movies and videos free with your Prime\".  Yeah, but good luck finding them.  There is no \"free movies list\", and even if you search for Free with Prime, you'll get pay movies and TV's in the list. The only way to tell is by clicking into them.The price of the movies and TV's is purely outrageous.  Two dollars for a single TV episode, Four dollars to rent a movie, or buy the movie/TV show for the same price as a DVD.  Why wouldn't I just buy the DVD and watch it anywhere I want, even without Internet access?Even the interface is awful.  The menu takes up a third of the screen, so you are limited to only viewing a few titles at a time.I'm a huge fan of Amazon products (I own 3 kindles) and have always been a loyalist, but this product is terrible - pass it by.", "verified": true, "helpfulness": "8/18", "author": "William H Kline IV"}, {"rating": 5.0, "review": "WE ARE JUST GETTING STARTED AND IT IS GOING TAKE A LITTLE LONGER THAN USUAL. WE HAVE WATCHED COUPLE  MOVIES AND NOW WE ARE SELECTING MORE MOVIES . MY WIFE AND I GOING TO STOCK  PILE  MORE MOVIES . I WISH WE COULD  TELL YOU MORE BUT IT TAKES A WHILE TO LEARN.", "verified": true, "helpfulness": "1/4", "author": "Paul  Dohrn"}]