[{"rating": 2.0, "review": "It is fast and the cabinet looks good. To sad that it's crap compared to my Apple TV 3, both in user interface, streaming quality and sound.The Apple TV 3 is far superior and I will only use the Fire TV for Prime content that is exclusive to Amazon - if not, I'll power up the ATV 3 and enjoy super quality streaming, sound and a SO much better User Interface (how could you mess that up so badly??!!)!Sorry Amazon - this is no good by today's standards. It's like comparing DVD (FireTV) and BluRay (Apple TV 3). The BluRay beats the crap out of DVD...Hope for a BIG improvement VERY soon by firmware upgrades!An update poster May 30. 2014:Still no improvement by updates and I installed XBMC to see if it could ease the bourdon of one my Mac minis, but no go: 1080p lags and can't sync the sound, the Android OS only supports standard Dolby Digital and DTS (Googles fault). Forget trying to play content with Dolby TrueHD or DTS-MA.Another problem with this device is the low audio output from the HDMI port. I own a Sony STR-DN1040 Surround Receiver with 7 speakers and a subwoofer and several other devices connected to the 8 HDMI ports and if I forget to reduce the volume on the Receiver when switching from the Fire TV to another source, I think I will have severeral speaker membranes and wood killing me or at least ruin my ears for good: If anyone knows how to boost the audio from this Android thing, I would be VERY grateful if you let me know.", "verified": true, "helpfulness": "3/6", "author": "Lars"}, {"rating": 5.0, "review": "I was so surprised at how well this unit works, not to mention user friendly. This is a great product and well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Derby \"Derby\""}, {"rating": 1.0, "review": "I've Never Been So disappointed with an Amazon Product As I am with the Amazon Fire TV.  I downloaded the Netflix App to watch Braveheart. After 20 times of buffering, I decided this is completely useless to have. I am going to return it because I wanted to test it before I gave it to my elderly mother. She has even less bandwidth than I have so it is basically useless to her. I've never been so disappointed with an amazon product. STAY AWAY!", "verified": true, "helpfulness": "4/14", "author": "Keith"}, {"rating": 2.0, "review": "It could have been nice if it worked outside the US, unfotunatly it doesnt, still can't understand why they impose restrictions.", "verified": true, "helpfulness": "3/7", "author": "Fz Al-aufy \"aufy\""}, {"rating": 1.0, "review": "Apparently I'm supposed to have 3 remote controls, because this has no way to adjust the volume of my receiver or control my TV.Also, if you have amazon prime but shared FROM another family member's account? Too bad for you. Only account that bought the prime membership can stream free prime movies.That sounds fair to me but I was unaware of this when I bought the Fire TV, with Prime shipping, and found out I SHOULD have bought it on my spouses' account instead.Just a huge pain in the ass.", "verified": true, "helpfulness": "4/19", "author": "N. Johnson \"liquidthex\""}, {"rating": 4.0, "review": "ProsFast and powerfulGood for Amazon Prime contentGames (although limited)Can use music apps while you browse or play gamesConsNavigation / Menu system sucks (Only shows you what it wants you to see)No sane organization of apps or contentLimited number of apps availableNetflix App is lameHorrible music app selections, no way to sync music with your computer or cloud.Despite the downsides it's still one of the better boxes", "verified": true, "helpfulness": "2/2", "author": "Eric Olson"}, {"rating": 4.0, "review": "Look, if you've dealt with streaming video boxes before, you know the requirements that you have.  For me, it's Netflix, Hulu, Crackle and Amazon Instant Video.  Those HAVE to be available, or no sale.  There are tasty little treats that are also nice to have, like Youtube, a fitness channel, and PBS.  I love PBS.  Bottom line right now?  Amazon Fire is a very smooth streaming video box, the remote is sleek and well functioning, and the selection is there.However...There's not a PBS channel.  For me, it's a bit of a letdown, and the reason that ROKU takes residence in my den.The interface for the fire is a bit jumbled and not user friendly yet.  You CAN learn it, but it takes time and patience and needs some cleaning up.  Prime should be featured on it's own, your apps should be easy to see, (they're convoluted but available,) and  it could be graphically more attractive.Lest one think I didn't understand the idea of the review....what works?The streaming is AWESOME.  I have a spotty road runner connection that was forever an issue on my roku after an hour....but Amazon?  Goregous.  No issues, save for one during a very bad thunderstorm in my area (this did affect cable.)Bottom line?  Get it prettier on screen, keep the super sweet streaming power, and this is the box to beat.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer \"nittfox\""}, {"rating": 5.0, "review": "I purchased Amazon Fire TV to replace cable tv. The first channels I watched/listened to was Pandora and Vevo. I absolutely loved it! I have also watched Netflix and Hulu with Fire tv. I am still checking out the other channels. It would be nice though if there were more movie channels that offer free movies. But overall, very happy with this product!!", "verified": true, "helpfulness": "0/0", "author": "Lisa M. Werner"}, {"rating": 4.0, "review": "The quality of anything Amazon Prime is AWESOME! Series that are equally available on Netflix, Hulu plus, and Amazon are much better quality on the Prime. The Netflix app runs much better on the ROKU box. I like the extra features of Netflix on the Fire, but if the video is jittery and jumpy and same series is perfect on Amazon, one has to assume that it's the app. Check out 'Star Trek Voyager' and you'll see what I mean.But overall, the FIRE is a superior media box, so long as the upgrades are software and don't surpass the hardware for at least a good long 5 to 7 years. Achieve that and make improvements still during the wait and you've got a customer for life. I'm sure many more would agree.", "verified": true, "helpfulness": "1/1", "author": "K. Decker \"codgus\""}, {"rating": 5.0, "review": "Fast and easy to use. Great product. Love that you can load outside developed programs. Use it daily with Plex.", "verified": true, "helpfulness": "1/1", "author": "Dan Noordam"}]