[{"rating": 5.0, "review": "Excellent! Have used this far more than Roku or Apple TV units. Coupled with Prime, this is a no-brainer. Voice search is very good, remote and UI is easy to use. Highly recommend it", "verified": true, "helpfulness": "0/0", "author": "LGM"}, {"rating": 4.0, "review": "Really  like the voice search . But - if i want to search Netflix only no way to do that - Also Amazon needs to open the gates to Apps like drop box. there are a few apps that back up the setup data to drop-box. then when you instill the app on a new device you can just import the set up. Very handy feature. My 101 year old Father-in-law loved looking at family pic on the TV. that one feature was worth the price of the Fire-TV for his enjoyment. It's crazy having to manage family pic in multiply places.", "verified": true, "helpfulness": "0/0", "author": "Stephen Raphaelson"}, {"rating": 5.0, "review": "A perfect addition to any system.", "verified": true, "helpfulness": "0/0", "author": "Ken Burton"}, {"rating": 5.0, "review": "I think it's awesome, I don't miss my cable at all, get to see all my favorite shows and even catch up on ones that I missed. I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Glenda"}, {"rating": 3.0, "review": "Would have given it more stars if the new stick hadn't just come out at a fraction of the cost that does the same thing. REALLY AMAZON?!? Showtime anytime doesn't work woth it even though it works on my computer. Kind of disappointed and I'm a loyal Amazon supporter usually. Should offer trade in or money back for those of us who spent 100$!!! Not long ago!!", "verified": true, "helpfulness": "0/2", "author": "julia"}, {"rating": 4.0, "review": "We just love it. I ordered it with the game controller, and my grandson is so happy to be able to just download games and start to play.  I'm already thinking about trying your free 30 day upgrade offer. With love and Gratitude. Madeline Esquivel😉", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Great product,! Now if Amazon Prime would load some good movies!!!?????", "verified": true, "helpfulness": "0/1", "author": "CHARLES F MINNICK"}, {"rating": 5.0, "review": "Much easier and cheaper than satellite companies", "verified": true, "helpfulness": "0/0", "author": "katherine nickels"}, {"rating": 5.0, "review": "Loved it! Has Amazon, Netflix and so much more! Loved the microphone feature to speak what you want to see.", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 3.0, "review": "Connection and flow to WiFi is questionable", "verified": true, "helpfulness": "0/2", "author": "capsgary"}]