[{"rating": 5.0, "review": "I love the voice search. The hardware is very fast and responsive. More apps have become available such as HBOGO.", "verified": true, "helpfulness": "0/0", "author": "Kyle L."}, {"rating": 5.0, "review": "This little box has changed my life. Well, not really, but it has made me very happy, so I guess you can say it has changed my life a little bit. I am a recent chord cutter, and while I had a roku 3 from a year ago to use when traveling, I wanted to get a box to use in my living room for all my chord cutting needs. Since the majority of my programming has now been moved to amazon (prime content and many purchased titles), I thought it would only make sense to get this little guy to use vs other boxes. First thing I noticed out of the box was this was super fast compared to my Roku 3. Netflix was faster, Hulu was faster and Amazon (obviously) was much faster. The box was easy to install, and I love the voice search feature. I don't think the voice search has failed yet.. it has recognized everything I tried searching for. Overall, SUPER happy with this purchase. I may consider getting a second one if I ever decide to sell my PS4.", "verified": true, "helpfulness": "0/0", "author": "Jaime the Destroyer"}, {"rating": 5.0, "review": "I'm very pleased with my purchase it is easy to operate.I would recommend it to everyone.I did not grow up with computers to be truthful I hate them.this system is a pleasure to operate.", "verified": true, "helpfulness": "0/0", "author": "Rodney"}, {"rating": 3.0, "review": "Decent product which has the potential to be great, but misses the mark.In my book, a perfect streaming box MUST have:1) ALL major content providers: Netflix, Amazon Prime, HULU, Vudu.2) Ability to stream local content from my medial server.3) An easy to use and intuitive interface.2 products in my arsenal at home that came the closest to the above are my WD TV live box, and my Boxee box.The WD TV Live box is fantastic in that it can decode just about any media format you throw at it.  The interface is also easy to use, it'll stream from my media server, and the price is very competitive.  The main downside is no Amazon Prime access.Boxee was a fun machine in its day.  The thing is not made anymore, and it's too bad because it was powerful and hackable.The Fire TV has a beautiful interface and form factor.  Voice command is available, but a bit wonky to use reliably.  The biggest downside of this device is no way to stream local content from my media server.  That's a shame, because it does everything else pretty well.Hardware is nice, processor is good, connectivity includes wifi (which I never use on media streamers), and ethernet (which is the only way I will connect a media streamer).If Amazon would tweak this device a bit and add some badly needed functionality, this box could be a winner.", "verified": true, "helpfulness": "0/1", "author": "Skeletor"}, {"rating": 1.0, "review": "I accidentally ordered this.... so I sent it back", "verified": true, "helpfulness": "1/7", "author": "Caleb a cobb"}, {"rating": 5.0, "review": "Love it! So easy", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Truly I do... It is that good.", "verified": false, "helpfulness": "0/1", "author": "Damion J."}, {"rating": 5.0, "review": "This thing is awesome!", "verified": true, "helpfulness": "0/0", "author": "Quiltingcacher"}, {"rating": 4.0, "review": "We love the Fire TV, and use it constantly....It works great for almost all the apps with the exception of HULU Plus...nearly impossible to watch a program with out it constantly freezing up...(80% of the reviews for this app have the same problem)!  What makes this device even more impressive is that we are currently located in an RV Park while visiting family and are using the WiFi provided by the Park, and there are very few times that it has to \"Load\" (with the exception of Hulu).If you are looking for a good streaming device - this is the one to buy!I do have one rather strong complaint which is directly aimed at AMAZON and not the Fire TV.....I totally disagree with the 1-Click policy regarding video/digital purchases....Its MY device...Its MY account...and ITS MY MONEY  If I want to turn it off everywhere THAT SHOULD INCLUDE THIS DEVICE!!!!!!  MY CHOICE!  I don't want to enter a code every time I want to watch a program not suitable for children!  And right now the only way to stop 1-Click purchases - Is to set up Parental Controls - My home is a child free zone!", "verified": true, "helpfulness": "0/0", "author": "steven"}, {"rating": 5.0, "review": "Forget the stick, get the box. The box costs more but is much more reliable, has an ethernet port for better internet connection over WiFi, and the overall experience is better vs the stick. The stick is HDMI and also needs the power cable running to it, so with all that why go with a stick? If the item needs a power supply attached, then just get the box and have more hookup options. I use mine with Sling TV and it works great (the Fire TV box). Tried the stick, had major WiFI issues as commonly reported by other Fire TV Stick users, and swapped out for the Fire TV box. So glad I did.", "verified": true, "helpfulness": "1/1", "author": "Randy M \"rdm\""}]