[{"rating": 3.0, "review": "Its okay when it works.  Most of the time you need to reset the device to get apps to work properly.  The format is okay, wish the Prime TV and Movies were a little easier to find.  One improvement is an on/off for the Fire TV.  I find that mine will stay on for days without shutting off.  I usually have to unplug it to turn it off and reset.", "verified": true, "helpfulness": "0/0", "author": "Karen Ann"}, {"rating": 4.0, "review": "Good shopping", "verified": true, "helpfulness": "0/0", "author": "LUIS JAVIER SIERRA N"}, {"rating": 4.0, "review": "I can't believe how responsive it is.  Press a button, anywhere in the room, and the box instantly responds.  Easy to use.  My onlly complaint it that Fire TV does not support Vudu.  I own several movies on Vudu, from buying bluerays from Amazon that include a free digital download.  I can't rely solely on Fire TV unless I want to abandon the Vudu content for which I've already paid.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A seamless entertainment experience. Dollar for dollar perhaps the best investment I have made for media/entertainment. Lots of viewing options that has worked flawlessly with my TV and internet connection. I also just bought the fire-stick for use in my bedroom -- can't wait until it gets here.", "verified": true, "helpfulness": "0/0", "author": "TPH1983"}, {"rating": 5.0, "review": "Fantastic system. Only problem was a faulty remote that ate the batteries every two days. This was replaced with very little effort or hassle by Amazon Fire technical support. The fire tv has streamed video and movies beautifully without the slightest hiccup. It is so easy to install and get running. This took less than five minutes!", "verified": true, "helpfulness": "0/0", "author": "nashvillec \"frankc\""}, {"rating": 4.0, "review": "this was a gift for my brother which he is very happy with the only thing he could complain about is its not user friendly to everyone you do have to be somewhat Internet and electronic savvy his wife could not easily operated also it never actually turns off and its screensaver will use data. I read the reviews before I purchased this item and decided it was the best one for what he wanted which I still agree with that choice so I had already pre warned him about the fact that you have to be a prime member to get the free instant videos and you also have to watch it because you might accidentally buy something", "verified": false, "helpfulness": "0/0", "author": "Fairygirl"}, {"rating": 5.0, "review": "OK, don't review often but NEED to do this for Fire TV. This little gem comes packaged in gem worthy packaging. As only Amazon could package their products. Then, to open this nice box to find a device the size of a slice of bread AND possibly one of the most ergonomically designed remotes I have ever owned. But, don't let the size fool you! This little metal box is loaded with technology. To be able to watch all your Prime content is one thing but, to add apps, games, etc. Well. what more can I say? Perhaps to simply say, you really NEED the Amazon Fire TV.....especially if you are a Prime member. Shoot, maybe getting one will move you to become a Prime member. Just get it. You won't be sorry!", "verified": true, "helpfulness": "0/0", "author": "Ron, Amazon Prime Member \"Ron\""}, {"rating": 5.0, "review": "I was looking for an alternative for the traditional outlets for TV. Fire TV for me is the perfect alternative. Very easy to set up and a terrific value. Thanks!", "verified": true, "helpfulness": "0/0", "author": "donald hathaway"}, {"rating": 4.0, "review": "Great little media streamer.", "verified": true, "helpfulness": "0/0", "author": "Troy Demet"}, {"rating": 5.0, "review": "I love it, i've tried a lot of media players and this is by far the fastest and most reliable.I wish it had a way to play media from my network without Plex but it works and is always ready for me.", "verified": true, "helpfulness": "0/0", "author": "J. Miller"}]