[{"rating": 4.0, "review": "Everything I was looking for, 4 stars because without Amazon prime it isn't the same", "verified": true, "helpfulness": "0/0", "author": "Jennifer Cruz"}, {"rating": 4.0, "review": "It did everything they said it would do and was super simple to install", "verified": true, "helpfulness": "0/0", "author": "Bob Parker"}, {"rating": 5.0, "review": "I am very pleased with my Amazon Fire TV. It came to me already configured to my Prime account. All I had to do was plug it to power outlet, hdmi on my receiver, and network. Then I turned on my tv to follow the simple onscreen prompts to finish the setup. I really like that I can use the Amazon Fire TV app on android to make use of its keyboard instead of the hunt and peck of the remote interface. I wish the voice search worked with Netflix. I do look forward to hopefully seeing the networks move their content into apps someday, so I have even more options for viewing their content. I also have a Roku, and I have to say I like the speed and user interface of the Fire TV more. There are some differences in the apps available. If you have something in particular that is important to you, I would check out the availability of that on Fire TV before you choose Roku.", "verified": true, "helpfulness": "0/0", "author": "EAC"}, {"rating": 3.0, "review": "Cant simply read a usb drive & forced to sign in with amazon account", "verified": true, "helpfulness": "0/1", "author": "Wally"}, {"rating": 4.0, "review": "A bit slow loading at times, but otherwise, great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Its great.  I received it as a gift.  Found it easy to set up and get going and get my accounts set up.  Only thing I noticed was that the apps I was hoping to get, i.e abc family, fox news, cw, fox, nbc,  etc are not available for the fire tv.  It seems to have the basic apps which s great, but when are the apps that are available for the kindle going to be for fire tv?", "verified": true, "helpfulness": "0/0", "author": "K9 Ginger"}, {"rating": 5.0, "review": "I love it! It's so easy to just say what I want to see. If I say Netflix it goes there. I can say Amazon Prime & it pulls up all the Prime shows! So much better than the box I used before that needed so much painsteaking effort to enter in shows to watch!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love my fire tv", "verified": true, "helpfulness": "0/0", "author": "Jonelle Byers"}, {"rating": 4.0, "review": "I don't know why you can get amazon apps on google/android, but no google products on amazon. like youtube?? You have to download a third party's app just to watch YT vids.  Other than that, it works very well, very fast and easy to navigate.  -love how you don't have to point the remote directly at it to work.  Very few commercials for now; not looking forward to the onslaught of forced advertising.  I just hope amazon learns to play nice with everyone else; there's obviously plenty of market share for everyone.  Oh, and FYI, Hulu doesn't work for free; you have to buy plus to use it.", "verified": true, "helpfulness": "0/0", "author": "william j spence"}, {"rating": 5.0, "review": "This has replaced my Roku 2 and I didn't bother looking at a Roku 3 because I know this device is better. Especially with Kodi installed on it. The firetv is fast, movies/shows load almost instantly and at full HD quality. The menu system is very, very fast. Its easy to navigate and looks good. The voice search on the remote works great. Almost always gets exactly what I want to search for correct. If you have Prime, its even better. Prime video, music and cloud photos are awesome.I believe this device to be the best streaming box you can buy.", "verified": true, "helpfulness": "0/0", "author": "James Mccarty \"expose\""}]