[{"rating": 3.0, "review": "Not near the HOT item I thought it would be.  In all honesty, it may be a user problem.  I have a lot of trouble negotiating the different choices or moving around at all.  I thought I would have access to newer movies and more choices.  I have gone back to Netflix for most of my viewing.", "verified": true, "helpfulness": "0/0", "author": "Sue C. Farber"}, {"rating": 5.0, "review": "We purchased the Fire TV because ever since all tv went digital our reception wlth a very good antenia became rather sporatic but we were still able to get most of our local stations. About 6 months ago every thing all but vanished. We are not big tv watchers so I refuse to pay for what I always got for free. When Fire TV came out it really hit the mark for us. My husband and son who enjoy westerns and action movies love it. The reception and delivery of the movies are great, the picture is beautiful. We do not have the greatest internet speed and I was worried but it works perfect. I have a kindle fire with Prime so many movies are free and the selection is awsome. I give Fire TV all 5 stars as it is well worth the price. Add in the Prime, pop some popcorn and set back to enjoy movie time. Also lots of my favorites biographies, travel and documentries. My advice, GET ONE!", "verified": true, "helpfulness": "0/0", "author": "Patie"}, {"rating": 4.0, "review": "Overall a superb picture delivering 1080P. Scrolling thru the selections to view is too fast and sometimes you overshoot the item you want selected. I guess you have to get used to it. Voice activitation also works on Netflix as well as Amazon Prime. Nice size,pretty light blue power on LED. Not obnoxiously bright!Now a potential problem. I tried it on my 8 yr old Westinghouse 42in LCD that has only one HDMI that doesn't like 1080P. The Fire sent 720P instead and it was the best looking 720P I had ever seen on this set. When connecting back up to my new Panasonic 60in. LCD/LED ,it continued to send 720P instead of 1080P which it did when I first set it up. There was no way to manually reset it. When going to SETTINGS/DISPLAY, and setting from AUTO to 1080P,I got a message that said \"unsupported resolution\" which of course was not true. It appears that the FIRE thought it was still connected to the Westinghouse. I unlugged the HDMI and plugged back in to see if it would \"rediscover\" the Panasonic. It didn't and I was forced to RESET to FACTORY DEFAULTS. That meant redoing Users and passwords on the virtual keyboard. BOO!!! I did not try removing power to see if that would work!Wish there were more channels like the ROKU. Not a GAMER so I can't comment on that! Overall,though I like the unit. It loads very fast!  4 Stars!", "verified": true, "helpfulness": "1/1", "author": "L. Bourassa"}, {"rating": 3.0, "review": "USB connection did not seem to work, no connection to computers, movies available weren't current. Should be more like the Apple but it had faster download of movies than Apple.", "verified": true, "helpfulness": "1/1", "author": "Jean M. Johnson"}, {"rating": 5.0, "review": "I LOVE my new Fire TV, it's easy to hook up, use and search. I would recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "KPScent \"Scent Lady\""}, {"rating": 5.0, "review": "Fantastic product. Fast and voice search works very well.  I'm excited to see where amazon will go with this.  Only down side. No \"Prime\" movie list, must search through all movies and no designated power off.  Though if inactive it will go into sleep mode", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 4.0, "review": "Lacking cable and not very good over the antenna reception I was looking for something affordable to pick and choose what I want to watch. Combined with my Prime account, this has completely the need.  I would have given it 5 stars, but periodically, it seems to lose the wireless connection  It is not difficult to reconnect, but it is at least a modest annoyance.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV works great. It is easy to use, so many choices now, have cut back to basic cable.Love the clear audio that comes through. Husband really like the voice search feature.", "verified": true, "helpfulness": "0/0", "author": "Dorothy"}, {"rating": 1.0, "review": "I have DSL at my residence but for whatever reason  could not get it to work. Always got message that the movie could not be seen at this time.", "verified": true, "helpfulness": "4/6", "author": "phil narigon"}, {"rating": 4.0, "review": "Overall I really like the fire tv.  Have only had it just over a week.  Not able to send audio to hdmi and optical at same time.  So no music on patio.  Biggest disappointment with amazon so far is no real manual.  You can buy books, borrowed one, it wasn't much either.  Online questions say I should be able to do that, but no.  Rule one read manual; no can do.Resolved the problem.  Was using optical to outside speakers, forgot that had to be analog, got converter, presto it works.", "verified": true, "helpfulness": "0/0", "author": "MGDA"}]