[{"rating": 5.0, "review": "EDIT #3 July 22, 2014 - Talk about customer service.  An Amazon rep calls me.  We discuss the review below.  I stress that I'd very like much to use my Fire TV box to browse Prime Kids content for my children.  I reiterate how disappointed I am that the device is not friendly to Prime subscribers... and then.. LO AND BEHOLD - it's fixed!  The device now fully supports Prime browsing by Genre, and even supports intelligent sub-categories based on your Prime viewing habits.Amazon - you've really impressed me here.  You listened to customer feedback and revised this device accordingly.  It's now everything I wanted it to be.  This is easily now a five-star device.  Yeah it was a rough start, but now we're in business! Thank you!!!Maybe now I try out that gamepad...<original one-star review continues below>Sooooo... this is actually pretty disappointing.  Amazon really missed the mark here.  This device is absolutely NOT friendly to Prime members.  As other people have already noted, there is no way to search through and/or browse Prime-only content.  Best you can do is browse through Prime content on your computer, \"add to watchlist,\" and then walk back over to the living room and plunk yourself back on the couch.  But it gets worse, WAY worse.  Even if something IS on Prime, watching it through Prime is not the default option.  What I mean is, say my kid daughter wants to watch Season 2, Episode 7 of Bubble Guppies (which is available on Prime currently), if she navigates to that episode, the default option is \"Buy for $2.99.\"  She would actually need to go one menu deeper, under the \"find other ways to watch\" option, and then click \"watch free with Amazon Prime.\"  Watching free on Prime is not the default option.This is absolute crazy sauce - the default option is I pay for something that's free?!?  If something is available on Prime, then that should always absolutely 100% be the default option for watching it.  I shouldn't need to delve two menus deep to find the option to watch something on Prime - and my kid daughter REALLY shouldn't be expected to do that.  (I'm guessing Amazon is banking on people's kids paying for stuff they have freely available to them on Prime).This is basic functionality my PlayStation has right out of the box.  How is it that Sony has better software for viewing Amazon content than Amazon does?!  That's bananas!This can (and should) be fixed with the latest software update.  Until it is though, this is 1 out of 5 stars.  Not worth your money.  You can get a used Xbox for the same price.  It has better software for viewing Amazon content, and the games are waaaaaaay better.Get your act together Amazon.  Fix this busted little thing.</original one-star review>EDIT - Several times in this review I refer to Prime content as \"free\" content.  It isn't free.  I pay $80 a year for it.  Even more reason it should be easily accessible through this device.EDIT #2 July 11, 2014 - Changed the review from one star to two stars.  There are several reasons I did this:1. I'm a complete idiot. You don't need to navigate two menus deep to watch Prime content.  Just click on the video itself, rather than the menu options beneath it.  Simple, I know - but that completely went over my head.  I was making it more complicated than it needed to be.  I'm totally embarrassed.2. After posting this review a rep from Amazon called me - he had to leave a voicemail as I was out of the office at the time... but still.  His message was completely sincere and he wanted to discuss any feedback I might have about the product and its features.  A+ customer service.  Dude if you're reading this call me back anytime - I'd love to chat.3. Even though I am seriously disappointed in the software, the hardware itself is pretty slick.  And POWERFUL.  Once I actually get to the video I want to watch, there's virtually zero load time (that is, after I've browsed Amazon on my computer in the den, selected what I want to watch, then moseyed back to the living room to watch it)... We've come a long way from the RealPlayer \"buffering\" days of the 90's.I still feel like this product punishes long time Prime customers instead of rewarding them...Watching Prime content is still way more inconvenient than it should be. Maybe that'll change in the future.  When it does maybe this review moves to 5 stars.", "verified": true, "helpfulness": "13/16", "author": "fenomas \"fenomas\""}, {"rating": 3.0, "review": "The app accessing your Amazon Music Library is pretty much unusable at this point for any semi-serious music listener. I have 266 artists in my library (which really isn't that many) and it takes forever to find music (unless the artist name comes early in the alphabet. This is easily fixed. Let me search my library, or give the option of drastically reducing the thumbnail size, or let me jump forward rapidly, so that its easy to navigate a large library. Make the music app navigable, add a navigable spotify app, and get going with HBO Go,  and this would be a 5 star device.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the ease of use and many choices for prime members. I use this more than Apple TV now.", "verified": true, "helpfulness": "0/1", "author": "The Colonel-Retired"}, {"rating": 5.0, "review": "The Amazon Fire TV has an enormous amount of entertainment features to discover - which after only 3 weeks of use I'm sure will only increase. One of my favorites is the Screen Saver feature of over 150 glorious photographs, which activates about 2 minutes after streaming music like Pandora begins-as well as pauses of most any videos that you're watching. The only complaints that I've got is that the \"Weather Friend\" app is consistently forecasting for the previous day in the Long Range forecast (DUMB), spells \"temperate\" for temperature, the Dew Point and wind speed to the nearest hundredths instead of rounding of. For example  \"Dew: 48.82\" and \"Wind: 10.52 (MPH not entered)\". (We in the USA give the Relative Humidity % and wind has MPH after it on official NOAA-National Weather Service forecasts). I've an \"AccuWeather subscription, which along with most USA weather apps is what I'd prefer to see for my weather.Also I had a problem connecting my \"Apple Airport Extreme\" to the Fire TV, because I'm using a state of Utah public internet systemso after some Great help from Amazon Kindle's technicians, I discovered that I had to enter my password before I could use myWi-Fi created from my Airport Extreme.One other complement is since using Fire TV, my connection has been completely free of streaming pauses unlike my Sony media player which did pause many times while watching Netflix or Amazon videos.", "verified": true, "helpfulness": "1/1", "author": "John F. Fitzgerald"}, {"rating": 4.0, "review": "Like most reviews before can't say enough about how easy it was to set up!! Awesome. It has GREAT HD quality & normal screen clarity, like a brand new upgraded tv when watching Netflix or prime. The only complaint I have us with the arrangement of the \"free\" movies or tv shoes on prime. I'm guessing this is because they think that we will all dirt through the countless titles & finally give in to spend more $$ than we already have because we just want to watch something!! To be completely honest, of they actually sorted out the free & need to pay titles, I would be more inclined to spend the extra money, but out of spite, I just can't bring myself to do it! All in all it's a great bargain for what you get. We didn't have a tv that was able to integrate netflix on it, now that tv can with this, so that alone was worth the $99 but you also get great screen quality as well!!! Would definitely purchase again & recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Abby"}, {"rating": 5.0, "review": "Awesome! Super easy set-up. Voice recognition is excellent. I just wish I could access my Prime Music through my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "C. LAMBERT \"azaleacity\""}, {"rating": 4.0, "review": "This is our first experience with a streaming media player, and so far we have been particularly impressed with Amazon's Prime content and picture quality.  However, like many others who have posted reviews, our Netflix experience has been less than satisfactory ~ picture quality alternates between standard and high definition, and the streaming is frequently interrupted to reload.  Other reviewers have stated that this is not the most up-to-date Netflix app, and I would like to know why.  Is this an Amazon issue, or a Netflix issue?", "verified": true, "helpfulness": "0/0", "author": "M. Henegar"}, {"rating": 5.0, "review": "This product is fantastic. I think the only thing that would make it out of this world, is if it was a web browser as well. We stream Netflix and Amazon Prime mostly, so I can't comment on the other subscriptions available to watch. We've had no problems at all. The hook up and installation was a breeze and following the menu was just as easy. We enjoy the voice function to search for movies or actors on the Prime side; I really hope that eventually becomes available across other subscription services (like Netflix). We are dropping our cable since we binge watch TV shows on Netflix, and can continue to watch our regular TV shows through the Prime service. I love that it is competitively priced with other services like this.", "verified": true, "helpfulness": "0/1", "author": "Amanda S Nuernberg \"amanda\""}, {"rating": 4.0, "review": "Nice device. I love the fact that you can talk to this device and it actually gets it right. Although it is difficult to find complete lists of movies, it wants to show you most recently added or similar movies you may be interested in. But if I browse horror, it will only show me 50 movies or so. I would like to see all movies in that category and not just a short list. I find it easier to find and select movies on the Amazon website and add them to the Fire TV. I would also like to have a category of just Prime movies, and not a mix of Prime and Paid movies. I bought the Fire TV to supplement the $99 per year charges since they have gone up. I never really watched much Prime Video before the increase. Of course you pay $99 for the Fire TV, but I like it much better then watching on a laptop or tablet. Love the size of the device and the remote is fairly simplistic in it's function's. I do wish they would have made the remote slightly larger, it is hard to find a small black remote. But overall, Amazon keeps pumping out winners. The Kindle's are awesome and will have to wait to see about the Amazon phone.", "verified": true, "helpfulness": "1/1", "author": "KC of Indy"}, {"rating": 4.0, "review": "Interface is nice however do not like the walled garden that is the Amazon market.", "verified": true, "helpfulness": "0/0", "author": "Michael B. Fagan"}]