[{"rating": 5.0, "review": "Ok so I bought a Fire Stick and fell in love with it so I decided to take the plunge with Fire TV. It is worth the extra cash in my opinion.I own 2 Fire Sticks, 3 Roku 3's and Apple TV 3 and each has its benefits. Roku has the remote with the earphone jack which is the best feature of them all (wish the Fire TV had that instead of voice search) the Apple TV supports airplay (I have an Iphone and Ipad).I find the Fire TV works flawlessly. Those that complain about playback either have a defective unit,substandard internet connection or a junk router. Those that complain about lack of free content needs to step up to the plate and sign up for Prime, Netfix and Hulu Plus ($16 a month) and you will not live long enough see everything that you might be interested in. For the really cheap crowd just watch Crackle, it is free.However the game changer is XBMC period.So if you are thinking of getting one take the poor review with a grain of salt. Just buy it.", "verified": true, "helpfulness": "4/5", "author": "mmv"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/2", "author": "Bret Kruse"}, {"rating": 5.0, "review": "Easy set up.  Very easy to figure out how to use.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this, and I am not a tech person. In fact it can be very difficult for me to figure out how to set up new technology. However, this was so easy I am pretty sure anyone could set it up. I also LOVE that I can talk to the remote and tell it what I want. I bought this so we could stream Netflix since they picked up the series Longmire. I love this product so much I am going to buy another one for the bedroom.", "verified": true, "helpfulness": "1/2", "author": "Missy Mc"}, {"rating": 4.0, "review": "Received Amazon Fire TV which i primarily wanted as an alternative to Apple TV 3rd Gen. I must say the Netflix interface is top knotch from Amazon Fire TV, great job there!Also thanks to Amazon for offering a trial of Amazon Prime although i can't say i fully agree with the fact that some are paid, some are free, it gets confusing as one offering. Might be good to split into 2 categories altogether clearly marked those that are free and those that are paid.", "verified": true, "helpfulness": "1/3", "author": "manualvin"}, {"rating": 5.0, "review": "Just a review of the hardware - works great every time. Remote is the just right amount of grippy and it works fast with the screen interface no lag at all. Also the voice search rocks! Regarding the available titles, well, that could be better - there is a LOT there but much of it you have to pay more for - this thing is designed to help you spend money with Amazon super duper too easily - so if you are OK with that great. Just go in with your eyes wide open that this is a point and clicker connected to your credit card.", "verified": true, "helpfulness": "0/1", "author": "Mike Linton"}, {"rating": 5.0, "review": "I love the fire tv", "verified": true, "helpfulness": "0/2", "author": "pamela carr"}, {"rating": 5.0, "review": "The grandchildren loved the game controller and games. Lifesaver on a slow evening of babysitting to get Mom a night out.", "verified": true, "helpfulness": "1/2", "author": "Martin Sizemore"}, {"rating": 5.0, "review": "I have a roku a chrome cast and rca streamers my fire is ten times faster voice command is great", "verified": true, "helpfulness": "1/3", "author": "yardman"}, {"rating": 5.0, "review": "Easy to operate and gives quick access to the movie or show you want to see.I love the voice command.", "verified": true, "helpfulness": "1/2", "author": "Carlos Burgos"}]