[{"rating": 3.0, "review": "Would have given a better score if it allowed apk install, or all the streaming video accounts I'm paying for. Like cruchyroll, ETC... guess I'll have to keep using other devices so I can watch all of my stuff..", "verified": true, "helpfulness": "0/0", "author": "Jason Board"}, {"rating": 5.0, "review": "Great Great Great! Love the microphone to search. The only downside is that the microphone only searches amazon prime and not other connected services like netflix or hulu.", "verified": true, "helpfulness": "0/0", "author": "Eric Shea"}, {"rating": 5.0, "review": "The best thing ever!!! Definitely going to cancel my overpriced cable!!!", "verified": true, "helpfulness": "0/0", "author": "Julie Mayer"}, {"rating": 5.0, "review": "This by far is the best streaming media device out!", "verified": true, "helpfulness": "0/1", "author": "Kishara"}, {"rating": 2.0, "review": "Couldn't get it working with my current ISP", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "In order to appreciate all the Fire does you truly MUST try it. I have THREE of these devices (one purchased from Amazon)and two purchased from Best Buy (only because Amazon had them on back order).  If you review the specs from a hardware perspective they are TWICE of the top ROKU streamer.  Look at the hardware not yet activated on the device yet and it tells me that more goodness is on the way.  First- The wifi fi range for the device is absolutely fine.  My wireless router is located in my upstairs office and my 3rd fire is located in my basement (that's 3 floors) and I get 3 bars of good strength with no streaming challenges or skipping.  The device streams movies extremely fast and works exceptionally well with PLEX.  Streaming PLEX through my XBOX and PS3 machines were reasons I bought two additional Fire TV Units.  The movie quality through my game units was less than it was on the Fire TV because Sony and Microsoft route traffic through their mandatory log-ins vs. directly to the device, where Amazon fire like Roku hits your media server directly.  So what are the drawbacks?  I can honestly only think of two right now and both are very fixable by Amazon.  One- there isn't a robust app selection yet like with Chromcast, Roku and Apple TV, but IMO that is just a matter of the other products being out of the gate first and amazon needing to catch up.  It will.  I have every belief in that.  2nd- They cram Amazon content down your throat including recently added banner advertising at the top. (Don't like it but its not a killer for me).  They are getting better at showing you content available via other sources (like it actually promoted HULU when I did a search for Fox's Empire s a test).  This needs to  be expanded to the service Roku provides where it offers you selections across all apps.  If Amazon offers a cheaper price on a show or product I think consumers will default to them first.  Amazon doesn't stop you but it doesn't offer you the option easily.  Bottom line, I only need a few apps to make me happy and I have them through Prime.  Hardware specs don't lie and here hands down Fire TV is king.  Be patient, the rest will come!  Apps I am running are: WWE Network, Plex, Pandora, and Flixster.  All work GREAT!  I haven't tried gaming yet, but I honestly didn't buy the unit for that.  That's wht my XBOX and PS are for.  Happy hunting.", "verified": true, "helpfulness": "1/1", "author": "Frank K."}, {"rating": 5.0, "review": "We use ours for watching netflix mainly but also for accessing amazon prime instant video content.  Don't have any conplaints, it is fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 4.0, "review": "Love it, can't wait for our remote to arrive.Amazon could perfect the interface a little bit more, there should be easier ways to shut down apps, and put it to sleep without having to rummage around in the Systems area.", "verified": true, "helpfulness": "0/0", "author": "Aric T Goodman"}, {"rating": 5.0, "review": "Love it! Already got rid of cable!", "verified": true, "helpfulness": "0/0", "author": "Stephen Thorwart"}, {"rating": 5.0, "review": "Simple to use.  I already have a Prime membership, so there is a lot of good, free content for both kids and grownups.  I have one in our bedroom, on a tv we watch a lot.  I have also bought 2 additional units for other tv's in my house to replace the \"digital converter\" box I rented from the cable company for $2.99/month that got me reception for broadcast channels and a lot of basic cable junk.  My savings on that per month charge will pay for this unit in 2 years, plus of course there is much, much more to watch. Now those tv's that are not used very much -- in the guest room and office -- can have good choices for someone when they actually do get watched.  I couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Chicago Mom"}]