[{"rating": 5.0, "review": "This product was shipped quickly and is amazingly cool!", "verified": true, "helpfulness": "0/0", "author": "RICHARD WALKER"}, {"rating": 5.0, "review": "For a Prime member, this is a must have.", "verified": true, "helpfulness": "0/0", "author": "John Braden"}, {"rating": 3.0, "review": "Can't run TWC on it.  Come on Amazon, I paid for your hardware, so why can't we run the same apps as the fire tablet?  My Minix box offers more than this and is at the same price.", "verified": true, "helpfulness": "0/0", "author": "Rickey M. Horwitz"}, {"rating": 5.0, "review": "Excellent interface and has all the apps I need. It's exactly what I want from this type of device.", "verified": true, "helpfulness": "0/0", "author": "JWG"}, {"rating": 5.0, "review": "I like this fire tv... easy to use and fast respoonse", "verified": true, "helpfulness": "0/0", "author": "German Acevedo \"German Acevedo\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Why pay a membership when you make me pay for all you offer", "verified": true, "helpfulness": "0/1", "author": "Matthew"}, {"rating": 2.0, "review": "I was in hopes of cutting cable, unfortunately that was not possible, Amazon Fire TV indeed was a disappointment.  Having Prime, I was under the Impression that all the movies were free, that's partially true as long as you have pre existing cable.  Not having access to local programing was another reason to give it two stars.", "verified": true, "helpfulness": "0/1", "author": "Lance"}, {"rating": 4.0, "review": "I received my Fire TV promptly and in good order.  Following are my thoughts and observations:1.  The unit is very slick and attractive, small and unobtrusive, and takes up almost no space.2.  It's very simple to install, especially with the \"built in\" video that explains the process.3.  I've not found a simple way to turn off the device.  Choices are to let it turn itself off (after some time delay) or to put it to \"sleep\" (which takes a few click to get to the setup screen, followed by selecting \"Sleep\").4.  Although I didn't expect it, I wish there were a way to access the internet, in general, by using the Fire TV.  There are plenty of entertainment options available from Amazon nevertheless.5.  You should be careful about choosing Apps....some are free while others have a cost (Slinger, for example, costs $20.00, I believe).  Costs are available but you need to read information page to find it.6.  Voice selection and searches work great and voice recognition seems not to be a problem.Overall, I'm extremely pleased with Fire TV and recommend it.  Gave it a 4 Star rating because 5 Star would suggest it's perfect...", "verified": true, "helpfulness": "0/0", "author": "Steve L. \"Steve\""}, {"rating": 4.0, "review": "It works fine, if I had a reputable satellite host. If you know of anybody that is considering Hughes service, don't let them do it.", "verified": true, "helpfulness": "0/0", "author": "Carole A. Carlman"}]