[{"rating": 5.0, "review": "Love it!!!! Worth every penny!", "verified": true, "helpfulness": "1/1", "author": "Dan"}, {"rating": 5.0, "review": "very easy hook up and with prime  it has thousands of movies-voice activation not a big deal for me and if  I did this over I would not get it-but this is the greatest thing since sliced bread--cable company's look out -this is the beginning of the end for cable!", "verified": true, "helpfulness": "1/1", "author": "THOMAS HAASE"}, {"rating": 5.0, "review": "System has worked very well, including the voice. Used to supplement the apps built into my high end TV. Those apps are constantly messed up when the TV does online upgrades. I would recommend this to anyone who wants a reliable system. I also purchased a fire stick for another tv.", "verified": true, "helpfulness": "1/1", "author": "farrider"}, {"rating": 5.0, "review": "I'm owning Apple tv 3, Roku3, Roku stick and two Amazon Fire TV boxes, and most of time I'm using Fire Tv which I find the best streaming box so far.", "verified": true, "helpfulness": "0/0", "author": "Dino Lukic"}, {"rating": 5.0, "review": "So far we love it. Nice mix of TV shows and movies that come with Prime Membership.  The voice search works well and is a nice feature.", "verified": true, "helpfulness": "0/0", "author": "Mark Simmons"}, {"rating": 5.0, "review": "So easy to set up and use. Literally took less than 5 minutes. Using it almost every day!!", "verified": true, "helpfulness": "1/1", "author": "A. Merrit"}, {"rating": 5.0, "review": "I just received and hooked up the Fire TV so I've only touched a bit of what it contains and all the features it has. Hooking it up was so easy a Two year old can do it.", "verified": true, "helpfulness": "1/1", "author": "dpf66"}, {"rating": 5.0, "review": "I now have 3 Amazon Fire Tv units in my home. Watch Amazon Prime all the time. Bye bye N** flicks.", "verified": true, "helpfulness": "0/0", "author": "GaryS"}, {"rating": 1.0, "review": "My Note 3 would not screen mirror at all (and yes I did reset my phone). My Tab 3 would screen mirror with no issues.  There is no USB media player capability meaning you can't simply stick a USB flash drive in it expecting to view photos or home videos. It is super fast but too many restrictions for you to view free stuff (unless you like watching trailers or youtube videos). Almost everything costs money and you aren't getting any more of my money. If you are looking for a HD media device that has lots of restrictions this is a good unit. If you want the freedom of a dedicated media player get something like a Micca Spec. If this unit could play from the USB port and screen mirror with no issues it would be perfect. Those were the two main reasons why I had purchased this to begin with.", "verified": true, "helpfulness": "2/3", "author": "D. Lee"}, {"rating": 3.0, "review": "Thought there would be a much larger selection of movies and music.", "verified": true, "helpfulness": "0/0", "author": "M Maura"}]