[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Darci Slaten"}, {"rating": 5.0, "review": "Love It ; the picture and sound quality is amazing. Best of all there is no  digital lag and ghosting, never seen happen ever.  I really do think  there must be a better way to search .  I will be purchasing another for the media room.Just amazing guys.", "verified": true, "helpfulness": "0/0", "author": "SJ"}, {"rating": 5.0, "review": "replaced Netflix", "verified": true, "helpfulness": "0/0", "author": "Lee Family Perdido"}, {"rating": 5.0, "review": "Best thing ever, I no longer use my chromecast after purchasing the amazon fire t.v.", "verified": true, "helpfulness": "0/0", "author": "JP Martinez"}, {"rating": 4.0, "review": "Very nice unit.", "verified": true, "helpfulness": "0/0", "author": "Rodelino Virata \"RL\""}, {"rating": 4.0, "review": "As a PS3 Amazon Instant Video user, I wasn't sure if I could justify the expense of buying a Fire TV to do essentially the same thing I was doing with the PS3.  I tried to find posts about someone having experience with both, but didn't find much.  I saw the Fire TV on sale, so I decided to take a chance, and I'm so glad I did!  The difference between this and the PS3 app is night and day.  The PS3 has a slow start up time, the Fire TV is nearly instant.  Navigation is easier and faster.  Videos would take 10 seconds or so to start on the PS3, versus nearly instant with the Fire TV.  The voice search is excellent, and it's a huge time saver.  It searches Amazon content, as well as Hulu Plus content.  Not sure about Netflix.  If it finds the content you're looking for on Hulu, it shows you that, instead of trying to sell you the same content on Amazon.  This also has a lot less power consumption than the PS3, it's silent, and it's hidden behind my TV, so you wouldn't even know it's there.  I also side-loaded Kodi, which enabled us to cut the cord with Dish.  We are only on a 15mbps internet plan, and we never have issues with buffering.  HD content streams right away with no problem, even if someone else is watching something on the computer.  I also like a lot of the free games that I couldn't get on the PS3.  The remote is comfortable, but I do wish it was a bit larger.  It frequently gets lost in the couch cushions.  Battery life is pretty good.  I think we got about two months out of the set that it came with, which isn't bad for a Bluetooth remote that we use a lot.  That's also a nice feature, since you don't have to aim the remote anywhere, or even be in the same room to pause a show.  I deducted one star because I have had a few errors where a video wouldn't play for no apparent reason.  After a restart, all would be well again.  Also, sometimes the thumbnails load sporadically on the Hulu Plus app, so you don't know what you're looking at. Clearing the cache solves that problem, but it takes a few steps to do it, and should be unnecessary.  This could be an app issue anyway.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "great product, wish remotes where a little better had to replace one already", "verified": true, "helpfulness": "0/0", "author": "fourwiller"}, {"rating": 5.0, "review": "fantastic.", "verified": true, "helpfulness": "0/0", "author": "Neil W."}, {"rating": 5.0, "review": "So far it has worked perfectly, very easy to set up and use.  I would like to see more things like the Smithsonian channel.  It and other  things are probably there somewhere and I just can't find it.  Is there a directory of channels?", "verified": true, "helpfulness": "0/0", "author": "Dennis Brack \"DB photo history\""}, {"rating": 3.0, "review": "Can this be used in a foreign country?", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}]