[{"rating": 5.0, "review": "Nice device. Slick UI. Voice recognition works pretty damn well. Now all you need to do is give us early adopters free access to all your movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Michael Mannske \"Author of Foreign and Domestic\""}, {"rating": 4.0, "review": "I have a Roku 3 and bought the Fire TV at Best Buy for the second television in my house. I am comparing them both here as Roku has been the best for streaming and the fire tv is its competitor.Set up:Set up for both is a breeze. For both the Roku and the Fire TV just plug it into the outlet, hook it up to you television with an hdmi cable and follow the on screen instructions. After the fire downloads its software updates (which the roku does too) just follow the onscreen instructions. In about 15 minutes I had it logged into my amazon account and working. Basically, setup is very easy.Search:The fire TV hasa voice search, which I am starting to use more and more. Just hit the mic button and hold it while saying the title or actor you are searching for. Then, the results pop up. However, the fire's voice search on works with amazon prime. It will not work with Netflix of Hulu, and you will have to search with the arrows like you do with the Roku. Since I am already used to searching this way, I don't find it an inconvenience.Streaming:The fire TV streams really fast, comparable to the Roku 3. Within seconds of choosing what I want, I'm watching it with no buffering. Only twice have I had to wait for a buffer, but that was do to a problem with my internet connection, not the device. Once I had a picture playing and no sound. Not sure if that was a problem with the fire device itself, or the hdmi cable. Since I experienced the same once on my Roku, I am thinking it was the hdmi cable. Either way, if that happens, I found that unplugging it and then replugging it back into the outlet fixes the problem.On/OffLike the ROku, the Fire TV does not have an off switch. It will go to sleep when not in use. This is a feature I like. I don't have to worry about turning it off. I have the setting set so that if it is idle for 5 minutes, it will power down.Gaming:I haven't tried playing any games and cannot rate that aspect of the fire. I'm not much of a game player. I do more streaming.Cost:The same. The Roku 3 cost me $98 and the Fire TV is $99. No real difference there.Overall Quality:I am pleased with the Fire TV just as much as I am pleased with my Roku. It streams Netflix quite well, and no buffering like what I had when using my sony blu-ray player. The picture is crisp and clear. No pixilation. And the sound quality is good.  I love my Roku, but also really like the Fire TV.Adding channels:I find it a bit difficult to search for channels on the Fire TV. This is the only downside in my opinion. It is much easier to locate different channels on the Roku and add them.  However, I wouldn't let this be a deciding feature as it depends on what it is you watch. Netflix and Hulu are easy to locate, as they are on page 1 of the search, and if that is all you use, then you're fine. When you find a channel you wish to add to the Fire, click on it, click install, and then click open to open it. I wanted to add the same channel to the fire that I had on my Roku, but am having difficulty locating them. But no biggie since I mostly stream from my streaming accounts.Which one should you get:It's a toss-up. Both work great for streaming, are fast, and little to no buffering. If you have a prime account, then I would lean towards the Fire TV as it will probably help you get the most out of it, especially if you play games on your prime account.Update July 4, 2014.Today, for the second time, the fire tv stopped playing, giving me a playback error whenever I tried to use Amazon instant video, Hulu, or Netflix. SO, for the second time I had to contact customer support to figure out why. A real annoyance since this was the second time this has happened. They fixed the problem and now it works again.So this is what I am thinking has to be done every so often.1. do not pause a movie and leave it on pause while walking away for the next several hours, like my dad has a habit of doing.2. When you get playback errors always restart, unplug and plug back in and check your internet connection.  If okay then you need to clear you data. You do this by going to Settings-Applications--Amazon Video--Clear Data, and when asked if you're sure you want to clear data click okay. After you clear the data, you will need to restart the machine. This should solve the problem.3. Every couple of weeks you might want to clear the data of your machine and the cache (Settings-Applications-Amazon Video-Clear Cache)to prevent further playback errors.I never had this problem with my Roku. I hope Amazon fixes this. I like my fire tv and it still works great when no giving me playback errors.", "verified": false, "helpfulness": "3/3", "author": "Book Junkie"}, {"rating": 5.0, "review": "It caught me by surprise when I set it up for the first time. All I needed to do was select which wi-fi spot to use, enter the password and viola!  The darned thing already knew who I was. I did have to pair the controller to it but once that was done all amazon media content was there before my eyes.I plannned to only use this for game development but I might just boot the appleTV and drop this in place.I think Amazon has a winner here.", "verified": true, "helpfulness": "1/1", "author": "Dragonhill"}, {"rating": 4.0, "review": "I had trouble with the installation, with help from Amazon we reversed the cable and it worked. Love the voice activation.Don't like paying for movies I have on DVD.", "verified": true, "helpfulness": "0/0", "author": "Cindy L. Calligan"}, {"rating": 5.0, "review": "I gave it 5 stars because I now can get my husband to watch a movie with me & he has to watch what I want & besides that it is amazing what you can do with technology now days it is very easy to use the voice control is awesome there is not one thing wrong with it it is a lot better than most I would recommend to anyone", "verified": true, "helpfulness": "0/0", "author": "lisa deserio"}, {"rating": 5.0, "review": "I had the Fire up and running in just a couple minutes and it is very portable.  I have 4 HD TVs and often want to stream a show either on the patio or in the bedroom (usually have it connected to main tv in family room) and the fire is so easy to move and hooks up to the wi fi without a problem.  The streaming is even better than on my Roku, which is okay but not as quick as the Fire.  I really like the interface with Amazon Prime and the verbal search option.Hope to see more apps added as time goes by.  HBOgo and MLB would be nice.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "Answer:  There aren't any more to give!  Audio and video presentation is excellent...speed in response to commands is unbelievable!  A total computer neophyte like myself now looks like a genius!  Thank you so very much!!", "verified": true, "helpfulness": "1/1", "author": "DAVID SHAW"}, {"rating": 4.0, "review": "I have always been a fan of Amazon, and I usually buy their devices. I like Jeff Bezos' philosophy on providing good devices not to make money but to deliver content. The Fire TV was an easy and painless device to install. The remote is simple and elegant and the interface is easy to navigate.A couple of issues:I am a prime member. I should be able to access Prime movies by genre. This wouldn't be hard to code - and as long as ROKU offers this sorting tool, you are going to be three paces behind.I cannot believe Amazon launched this device without having their MP3 player ready to roll. Methinks someone is filling unemployment papers over that lapse.Fix those issues - and frankly, they are not insignificant - and you will have a gamechanger here.", "verified": true, "helpfulness": "1/1", "author": "John Martin \"John Martin\""}, {"rating": 5.0, "review": "Absolutely love you! Love the voice feature! Love Amazon Prime movie and tv choices! The box is very small and light. I can not say enough about Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Hearing about this product pushed me over the edge to cut the cable cord and go completely to streaming.  I bought the Amazon Fire at Best Buy and signed up for Prime on the same day.The good:Sleek lookEasy setupSimple remoteQuick responseWhere I would like to see improvement:In the Amazon Instant section they have all of the options mixed together.  Some cost money, others do not.  You can go into categories that are just for Prime videos but you can't separate them by category of show or movie.  I paid the $99 for this content, not to so I could see all that I DON'T get with my prime membership.  In addition:  Do not try searching the kids section for Prime videos with your 4 year old present or be prepared to explain to them why they can't watch all of the shows without the little tiny \"Prime\" banner in the corner because Daddy already spent $198 for the ability to watch the other shows.  (She misses the Disney shows).Continuous play - it would be nice to at least have this as an optionNo live sports - This will be tough especially going into basketball and hockey playoffs.  (I may do the HD antenna for football season)That's my main gripes.  Otherwise I think this is leaps and bounds over some of the options that were available just a few years ago.  I'm hoping the issues can be addressed by Amazon.  I'm also banking on the show and movie selection improving.Overall a solid device and one that I would recommend.", "verified": true, "helpfulness": "2/3", "author": "Jimmy Mac"}]