[{"rating": 5.0, "review": "Easy to set up - just like promised - love it! Purchased as a birthday gift for my husband - hopefully he can learn to use it.", "verified": true, "helpfulness": "0/0", "author": "teresa"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "wayne"}, {"rating": 5.0, "review": "Great ldea", "verified": true, "helpfulness": "0/1", "author": "william jarrell"}, {"rating": 3.0, "review": "My fire TV Stick was buffering quite often.  I decided that my century link ISP was not fast enough.  I have switched to Comcast for a higher speed internet and now my fire TV stick can't find the signal and the remote doesn't work so that I can try to connect it.  Can somone tell me how to fix this problem?", "verified": false, "helpfulness": "0/0", "author": "Patrick Wolfe"}, {"rating": 5.0, "review": "Owned for over a year and is my main media streamer.  UI is snappy and hardware is fast.  I like the auto-sleep mode.", "verified": true, "helpfulness": "0/0", "author": "Matthew Hennessey"}, {"rating": 5.0, "review": "It's excellent !", "verified": true, "helpfulness": "0/0", "author": "Renee Womack"}, {"rating": 5.0, "review": "Awesome! I have one on every TV. My kids each wanted one, so they were stocking stuffers. We have taken one with use on vacation a couple times now. Great to have your setup already to play like at home. On downside is that you are at the mercy of the speed of wifi at your hotel. You don't need much, but one place was very poor.", "verified": true, "helpfulness": "0/0", "author": "Elroy Cartwright"}, {"rating": 5.0, "review": "Fantastic device!  We love amazon prime and have gotten rid of all cable and satellite because of Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Keith Gray"}, {"rating": 5.0, "review": "I am Pleased with the product. Thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "Carey Donaldson"}, {"rating": 5.0, "review": "The price is awesome and great to side-load Kodi on!!!", "verified": true, "helpfulness": "0/0", "author": "Andy Benson"}]