[{"rating": 5.0, "review": "Awesome.  Small and compact. It blends right in with the tv stand.  I have no problems with it.  Easy to use", "verified": true, "helpfulness": "0/0", "author": "Rich G"}, {"rating": 5.0, "review": "Was surprised how small it is, but man it packs a punch. Was not crazy at first that there was no way to power it off, but I am now a fan of the \"quick on\" or wake up. You press a button and off you go. No waiting something to load or power on! A lot of great apps available and the games are super fun! I also love the picture viewing and screen saver option...over cool. Well done Amazon, well done!", "verified": true, "helpfulness": "1/1", "author": "B. Gordon \"flash\""}, {"rating": 5.0, "review": "I received my Amazon Fire TV today and in two minutes had it set up.  It was so easy to install.  I have already watched some TV shows on it and the picture, audio and quality are excellent.  I have viewed some of my photos from my Amazon Cloud on it.  There are no cons.  I love everything about it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "video great. system will not sync up to audio system.after talking to very friendly people at firetv technical dept. THEY WERE NOT ABLE TO ANSWER ANY TECH problems. They couldnt give me tech # , support or any information. Please help!!!!", "verified": true, "helpfulness": "0/1", "author": "JOSEPH  REED"}, {"rating": 5.0, "review": "I don't watch much TV or that many movies.  But when I heard about Fire TV I signed up.  Funny but the thing thats the best about Fire TV is it's simplicity. From the inobtrusive small box to the small TV \"wand\" that's been designed to be totally intuitive. How many hundreds of times have I wished that I could just tell it what show I wanted to watch!  Now I can. Amazon did it's homework. I'm impressed.  The movie repertoire I'm sure will improve as time goes by. I'd prefer documentaries, great foreign films and Sundance winners vs the mass market movies. Nice work Amazon!", "verified": true, "helpfulness": "0/0", "author": "AB Richmond Beach"}, {"rating": 4.0, "review": "Ok, the short of this review is that this is now my go to android content streaming device. I think, for what this device was created for. ... It does very well,  if not better than any other device in its class. HOWEVER,  and this is a BIG HOWEVER. Do NOT think you will CURRENTLY be able to plug in an external USBdrive and read of of ANY of them, because you WON'T. ALSO,  this to is a HUGE issue, the storage is TINY, like 3 gigs available tiny, that's NOTHING for storage devices that steam content or are DESIGNED for playing TABLET type of games.  Come on. Also,  I would have returned this device already if it were not for me finding out how to SIDE LOAD applications. I HAVE XBMC and es file explorer and dolphin browser as well as an app to rotate to landscape for any of the side loaded apps. Granted, I don't have but maybe 10 apps on this thing because it just doesn't have the space. I have twice run out of space. I DO NOT use this entirely as it was intended, which by the way... just like that other apple device... It created or built to keep you in the Amazon world. So, if you just want to stay there and you have already paid for the yearly amazon prime membership (like I have) than you should be ok, but if you want to venture out beyond that, you better know the android o's or you're going to be frustrated with its limits. Speed, start up,  are both fast, the search works great for Amazon content. WHAT YOU NEED TO MAKE THIS A GREAT DEVICE... A USB keyboard, knowledge of the android os, and how to side load apps which includes dolphin, xbmc, es file explorer, etc. Like I said earlier, if you want to stick to amazon, this is ok, it does do what it was designed for, but I wouldn't pay 100$ for that, you can do those things and more with an Android TV stick for 50$. ANYWAY, my point is this, there are other ways to stream content and play some basic android games and not pay a monthly fee, and or 100$ AND FINALLY I do think this device will improve and start to do more, but space, until they allow external storage, will ALWAYS be an issue.", "verified": true, "helpfulness": "3/3", "author": "Larry B."}, {"rating": 5.0, "review": "This is so much better than the Roku. I love it so much that I took the Roku back to the store the next day after I received my Fire. It loads the movies and tv shows really fast. The picture is more vivid, there is no lag time. My only dislike is when watching Hulu the tv shows stall or you can hear the actors talking but can't see what scene they are on. Now I'm not sure if it's Hulu's fault or the internet connection. But overall I would highly recommend getting the Fire over the Roku.  I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 5.0, "review": "I love this little box. Super easy to use. Love the voice search. It makes my Prime membership so much more valuable.", "verified": true, "helpfulness": "0/0", "author": "K. Cooper"}, {"rating": 1.0, "review": "Looked forward to the purchase of Amazon Fire TV....noted in initial advertizing that MLB.tv was identified as an available app. I purchased the Amazon Fire TV...very cool looking....easy to set up....scanned the apps....no MLB.tv!!Have communicated my dismay to Amazon that they advertized a product that they did not have....they had folks like me purchase their product under false pretenses....and still...after over two months...no MLB.tv. And, in fact, recent correspondence from Amazon indicates that they have no idea when this product that they fronted in order to sell their box would be available....if ever!Shame on Amazon.", "verified": true, "helpfulness": "6/12", "author": "Ted Whiteside"}, {"rating": 3.0, "review": "I was with verizon fios over 5 years. Now I have direc tv. Cable is way too expensive now. I subscribe to Hulu, Netflix, and now Amazon tv. I been with prime for over 2 years now. Content is ok. Wish there were more latest movie selections. Glad that it allows the other streaming apps to work with it. Overall good unit. Could be better with more updated content.", "verified": true, "helpfulness": "1/3", "author": "Ivan Garcia"}]