[{"rating": 4.0, "review": "Its not really Comcast friendly; some apps do not work because Comcast refuses to sign deals with those companies ie. HBO.  Depending on your internet connection as well the streaming can be choppy at times. I use it for Amazon Prime, Netflix and some other basic streaming TV / Movies. I wish there were options to eliminate some of the pull down menu to simplify it because I dont use it for photos or games.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 3.0, "review": "Let me begin by admitting that, while I am proficient on the computer, I would NOT consider myself to be \"tech savvy\".  I received my Fire TV as a Christmas gift.  The installation was a breeze and I was able to start using it right away.  However, I think Amazon could have done a better job making this device more user friendly.  The search function is cumbersome and it is not easy to plan to make sure you are watching what you want at the lowest prices.  I'm certain there is a considerable amount of redundancy between the various viewing sites available (Hulu Plus, Netflix, Amazon Prime etc.) and I was hoping to have an easier time navigating this complex universe.  Perhaps it is unfair of me to expect Amazon to help with this but I DO.  Rather than feel as though I am paying multiple providers for the same programing, I am more likely to just shut everything down and stick with my Cable.  At least I will know I'm only getting overcharged by one extortionist, not many.  I promise, if I find the Rosetta Stone that allows me to decipher the hieroglyphics of streaming video, I will revisit this review and adjust my remarks accordingly.  I hope you find this helpful.", "verified": true, "helpfulness": "0/0", "author": "Paul Cocco"}, {"rating": 5.0, "review": "Works great. Loads quickly and navigation through different screens is user friendly.", "verified": true, "helpfulness": "0/0", "author": "Daniel Downs"}, {"rating": 1.0, "review": "I'm having so many problems connecting to the internet. I have tried everything from calling the internet provider and calling technical support for the amazon fire. I quit using it.it is sorting by my tv not being used and it is very frustrating.", "verified": true, "helpfulness": "1/6", "author": "Heather Anderson"}, {"rating": 5.0, "review": "Love this little box, great if you don't have a smart TV", "verified": true, "helpfulness": "0/0", "author": "Kim McElwain \"Kimmi\""}, {"rating": 5.0, "review": "Very useful. Way better than my old Apple TV. With the app store and games it will be fun for a while now :)", "verified": true, "helpfulness": "0/0", "author": "K. Jenney"}, {"rating": 5.0, "review": "I absolutely LOVE this item! It is easy to use and the voice activation understands my accent. I don't have a problem with it at all. Sometimes, Suri on my iPhone doesn't understand me. I have never had a problem with this item. I love it so much that I just bought a second one for my bedroom. I was hesitant at first to buy this but it compliments my Smart TV so well. With this device, a Smart TV isn't needed at all. I waited to buy both items when they were offered at the sale price. I think more of them would be sold if the price were at the sale price all the time.", "verified": true, "helpfulness": "0/0", "author": "C. A. Neal"}, {"rating": 5.0, "review": "Game changer for streaming video content, soon cable will no longer be needed as soon as they install news, sports apps etc. on this device.", "verified": true, "helpfulness": "0/0", "author": "Bobbie Digital"}, {"rating": 4.0, "review": "Looked brand new and worked great", "verified": true, "helpfulness": "0/0", "author": "danbutler"}, {"rating": 1.0, "review": "Amazon Fire is a colossal disappointment.  Despite settings that describe my signal as strong, and using the tips listed in the Amazon Fire TV user guide book, it keeps losing the signal in the middle of episodes.  What a waste of money!", "verified": true, "helpfulness": "1/5", "author": "ted"}]