[{"rating": 5.0, "review": "Easy to install and operate. Very simple instructions. I can see why the TV fanatics think it is too simple, but for the average viewer it does everything you need. If you just use amazon and netflix content, it's perfect. And the voice search seems to work very well. If you have a kindle fire, a smart tv and this box, you may never leave your home again!", "verified": true, "helpfulness": "0/0", "author": "D M"}, {"rating": 5.0, "review": "just wating to buy the fire so I can get all the benefit of it all love it so far. To get rid of cable", "verified": true, "helpfulness": "0/0", "author": "wayne"}, {"rating": 5.0, "review": "Bought the FireTV as a replacement for an Android TV dongle I had (which had cost little less than this beautiful piece of hardware).At first glance, I was pleasantly surprised by the quality of the product.. looks and feels both elegant and sturdy.Very simple connections. It doesn't even have a power button....A very nice interface (far better than any standard android dongle I've seen). Those who have a color Kindle will notice the similarities.I installed standard video streaming apps like YouTube, and some radio apps.. everything without a hitch. I also installed XBMC, and found that it runs beautifully on this product.The remote is confortable, small, and does its job perfectly....if only it had an IR blaster to control the TVs volume.. that would be my only wish.For those wanting to have good audio from this, may I remind you that it only outputs audio via the HDMI port, or a digital optical connection.. there are no analog audio outputs.I will be buying more of these things for a couple other TVs I have around (which are not the \"smart\" types), and for my parents too.. I'm very happy with it.", "verified": true, "helpfulness": "1/1", "author": "Mariano Kubota"}, {"rating": 5.0, "review": "It's great, I love it, I use it everyday. It does everything it say it will do, can't wait for amazon fire tv 2", "verified": true, "helpfulness": "0/0", "author": "rodney marshall"}, {"rating": 5.0, "review": "I am so enjoying my Amazon Fire TV!!  It was very easy to set up and works wonderfully.  So glad I decided to give it a try.", "verified": true, "helpfulness": "0/0", "author": "Cathy Smith"}, {"rating": 5.0, "review": "Great product. Voice search is easy to use. Easy and fast to connect and start using. We are really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Jane Strohm-Crout"}, {"rating": 2.0, "review": "IF you own other apple products, iphone, ipad, ipod touch, macbook pro etc. I would go with apple TV, where as the Fire does have more services built in than Apple tv3 you can  still stream the same apps from your ipad or macbook,  as a pro AV installer I find the voice feature a bit cheese , most systems I install I use Harmony remotes and they cannot control the Fire as it is not an IR based remote, I don;t think anyone is really going to care about video games on it,  If you don;t own apple products and are not using it on a custom install, i guess it would be fine", "verified": false, "helpfulness": "2/7", "author": "Knoxville AV guy"}, {"rating": 5.0, "review": "I am so excited about this purchase!  It was the easiest thing ever to set up and took all of 2 minutes to understand all the features.  I am thrilled to not have to switch between my TV and XBox to watch Prime (and Netflix). I especially love how tiny the device and remote are ... I hate clutter!!", "verified": true, "helpfulness": "0/0", "author": "KinseyM"}, {"rating": 1.0, "review": "Amazon Fire is overhyped. it’s also overpriced. I however, got a 30 day free trial with free shipping. so, I didn’t have to spend one penny. the Amazon Fire is slow. it tells you all the specs like “hey! we have a better processor speed than the other guys” which I did not by. also, the voice search could be better. I searched for “Mariska Hargitay” it took 2 tries for it to get it right. the box itself is simple. yet boring. not enough free stuff and  speeds are slow when trying to play a game or start a movie. what they need to embrace is demos and 30 second clips. if they did that people would be more prone to buy tv shows,movies etc… Amazon prime is over $100 a year. it’s pricey for what you get and I feel the TV and Movie industry is dead. I mean if you were a serious fan of tv shows and movies. you’d end up spending $500 to $1,000 a year on content. you’d need Hulu,Amazon Prime,Netflix,HBO,Showtime,Directv or whatever else. if there was a way to watch everything on one g$%%@# device. that would be swell. anyway.. this box is not for me. I don’t recommend it. I would wait till something better comes along. thanks for reading my rant about the Amazon Fire.", "verified": true, "helpfulness": "2/13", "author": "HONEY BUN RUN"}, {"rating": 5.0, "review": "I love Amazon Fire TV. We have one smart TV in our home which has the app on it for us to use our amazon prime streaming. Which is awesome and that is in our main TV viewing room. However in our other room we do not have a smart TV but use it quite often and miss not being able to use Amazon and all it has to offer. So when Amazon Fire TV came out I could hardly wait to buy it and it has not let me down. It was so easy to install. Just a matter of plugging in the HDMI cable and plugging in the actual Amazon Fire TV box. Turn on your TV and Viola ;)  I couldn't be more happy. I absolutely love the voice command button on the remote. Just hold down the button and talk into the remote and it will search for what ever TV show or movie you are looking for. Really it is worth every penny. Plus I love the fact that when you buy it online with Amazon it is automatically associated with your amazon account so when you hook it up to your TV you do not have to register it, it is already done. So if you where to buy it at your local dealer you would have to register it on your TV. All your photos, everything is just right there. Like I said I love it. And if you are not an Amazon Prime member, really you all need to be one. It is really worth it to be one. I have no regrets of spending the money on it the last couple of years. I can't say enough about the product. It has exceeded my expectations :).  Thank you Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Andi"}]