[{"rating": 3.0, "review": "The setup was freaky easy. Since I ordered it via my Amazon account it was already registered to me, so no logging in by hunting and pecking to type in userid and password. Searching for a TV/Movie was super cool using the voice activated search. I would give it 5 stars except for the picture quality. I tried watching one of my fav TV shows ... not HD quality. I then installed the Netflix app and tried watching another one of my favs. The quality was not HD as I had expected. I then switched over to Apple TV and watched the same program ... beautiful HD! So...... Amazon, please address the picture quality.", "verified": true, "helpfulness": "1/2", "author": "R. Cash"}, {"rating": 5.0, "review": "I ordered this the day it came out.  The Amazon Fire TV is outstanding.  It is fast and reliable.  The UI is clear and easy to navigate through.  I have head several other media streaming devices (Sony, Xbox 360) and Amazon's is by far the best.", "verified": true, "helpfulness": "1/1", "author": "NordicsLtd \"Daniel\""}, {"rating": 5.0, "review": "I canceled my direct tv.  put up an antenna for my local channels and bought the fire tv....I love it. It has so much on it that I couldn't possibly watch all it offers.....I recommend it highly.  love love love!!!!!!!", "verified": true, "helpfulness": "1/1", "author": "linda lefler"}, {"rating": 4.0, "review": "I have had my Fire TV for about a week now.  The image is stunning! Nice to use the 1080P for TV.... It is fast and easy to find what i want to watch and I am loving the games.  I have mostly used it for the gaming this week and I also bought the Amazon Bluetooth Controller which I give 5 starts if you are a gamer.ONE THING NEEDS TO BE UPDATED! As of right now the USB port is useless.  Being a gamer and having only 5 games on my Fire TV the storage is already maxed out! I paid for a couple of the games so I can not delete anymore or download anymore. I clicked on the contact me option and I was called within a min! The customer service guy said I am not the only one with the problem.  They need to send an update so my 16GB thumb drive will be recognized and I can add more games.  After this update is corrected it will be a 5 star item that you must have!!", "verified": true, "helpfulness": "0/0", "author": "Ryan M Dreher"}, {"rating": 5.0, "review": "Depending on your internet connection, this box will work from okay to amazing. If you have basic cable internet speeds, you will be okay. Everything loads super fast. The UI is awesome! Very smooth and beautifully done. HD video loads are almost instant thanks to its pre-loading features.Available apps are a little on the scarce side, for now. My big hopeful is Spotify. Needs to be added sooner rather than later. Gaming apps are also a little scarce but that seems to be a temporary thing considering they want to make it a big part of the box. The games I tried worked very well, however, some of the better games required a large amount of space and ultimately take up a huge chunk of the available space. I am not sure if the USB slot that it comes with is to expand the memory.I think the Prime TV Shows and Movies need their own area where they can be easily accessed instead of sifting through the paid videos. Yes, they have recommended and recently added Prime Videos but it would be nice to access the entire Prime library from one spot.The voice control works very well and so far has accurately picked up everything I have said.If you are an Amazon Prime member, you are going to want this box, especially since I read that Amazon has struck a deal with HBO that will make older HBO shows available to Prime members for FREE. It also, of course, has Netflix, Hulu Plus, and HBO Go should be added soon, if you use that instead.", "verified": true, "helpfulness": "1/2", "author": "G. Alanis"}, {"rating": 5.0, "review": "Now have much lower sat. bill.  Able to watch what I want to watch.  Love seeing all the old timey movies like Hedy Lamar in Desperate Lady.  My husband loves all the war movies available. And best of all we love the fact that Prime allows us to see them free.  Have told everyone we know about Amazon Fire TV.  Absolutely a great purchase.", "verified": true, "helpfulness": "0/1", "author": "Nana Nan"}, {"rating": 1.0, "review": "the free choices are mixed in with the pay choices--bad show Amazon---now I have a ROKU 3  that does not have this major problem", "verified": false, "helpfulness": "15/20", "author": "ol hoosier \"old hoosier\""}, {"rating": 3.0, "review": "Had chrome cast, wanted to try fire tv so I could get prime movies/tv. Prefer chrome cast over fire TV's UI. Netflix is better via chromecast.☆Fire TV's search only works for Amazon content??", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Installed and set-up in 3 minutes.  Nothing special required, your Amazon Prime account info is preloaded.  Great RF remote does not need line-of-sight to work.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "I was reluctant to order another set top box as I already had the Roku stick.  Regardless, I took the plunge and am glad I did!  This box is super fast and stylish.  My only complaint is that the search function does not search Netflix and other apps items.  Still, this is a problem that should be corrected in the near future.One more thing, I was having some difficulty with the Netflix app but called Fire TV's help number and got the problem solved by a very professional tech person.", "verified": true, "helpfulness": "0/1", "author": "Sadebugo"}]