[{"rating": 5.0, "review": "I received my FireTV with game controller and so far am very impressed. Setup took seconds and its super fast compared to other similar devices I have used before.People complaining need to realize this is a very new device so to compare content to devices that have been around for multiple years, of course it's not going to have as much right now, but IT'S COMING.The only soso I can find is limited storage space, but I am hoping that will be addressed with the usb port soon.", "verified": true, "helpfulness": "0/0", "author": "Richard Keller"}, {"rating": 4.0, "review": "I purchased this to put in my living room, so that I could move my Roku to the bedroom. The voice search is great but it does not seem to offer as many channels as my Roku does.", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 1.0, "review": "You can't block content based on rating.  You either have to put your password in every time your kids want to watch a G-rated show or run the risk of them watching something inappropriate.  This is so disappointing.  I am returning it today.", "verified": false, "helpfulness": "5/6", "author": "ANZ"}, {"rating": 5.0, "review": "The Fire TV is really easy and convenient, just talk and the movie or show comes up.  I suggest being a Prime member so you can really get the full benefits of Amazon Fire TV.  I am very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "woodman \"woodman\""}, {"rating": 2.0, "review": "Liked the size and features this device offered, but the performance was very inconsistent and after three weeks, it stopped working.  I found the user interface to be clunky and not intuitive.", "verified": true, "helpfulness": "1/1", "author": "Esteleline"}, {"rating": 5.0, "review": "Had Apple TV and it was great. When this came out and I saw the features it beat apples by far. Still use apple for my mac but now all media is with this.", "verified": true, "helpfulness": "0/0", "author": "Chief engineer \"Chief Engineer\""}, {"rating": 5.0, "review": "Perfect browsing, fast access, voice search is amazing, ver nice features overall. It was very easy to setup as it came with my own settings preloaded.", "verified": true, "helpfulness": "0/0", "author": "ssenyurt"}, {"rating": 2.0, "review": "UPDATED March 11, 2015--See BelowSHOULD YOU BUY THIS UNIT?In my opinion, this unit, like all things Amazon, is only about 80% ready for market but they release this stuff anyway. It's a cheap shot to their customers and they should straighten up and actually release products when they have all the features advertised actually implemented.Buy this thing only if USB isn't important to you AND if you are willing to wait hours to upload video and picture content to the Amazon Cloud Drive. ABOUT THE CLOUD DRIVE--the initial allocation of space for your account is only a few gigs (I think 2 gigs). After that you can upgrade and pay Amazon more money for the bump up in storage space. That this unit has a non-functioning, flaccid USB forces you to use their cloud for video streaming your own stuff and this works for Amazon because lots of folks will end up paying for more cloud storage. This is borderline unethical in my opinion.Pros:Sets up easily.Great help videosOutstanding picture qualityWiFi and Wired connections both very goodSmall footprintCons:USB not implemented so you cannot play your own video content without uploading to their cloudUploading to their Cloud takes much longer than other clouds (Dropbox for example). It's hours compared to minutesPuny cloud storage allocation without upgradeSearch has no QWERTY layout to type in your search and no way to add a space and second or more words to the searchLimited on-line supportCONCLUSION: Not really ready for prime time if you need full functionality in a unit like this.UPDATED March 11, 2015: REDUCING THIS TO TWO STARS. Okay, this is the most annoying, frustrating and unreliable piece of technology I've ever purchased. In the months since I bought this item its performance has degraded to where it is simply unacceptable. Amazon tech support is of little help and neither is Netflix tech support. Here are the NEW FEATURES my Fire TV now performs:1) Regularly pauses an in-progress program as if I'd pressed the pause button. It usually resumes after I press the play button on the remote.2) It does not play nice with Netflix and often (actually daily) gets hung so that I see an error message telling me there's trouble, \"playing this video right now...,\" and suggests I try later or pick something different. Well, I don't want to wait, nor do I wish to watch something else.3) It often cannot find my HDMI cable, even though I've tried several cables. It is, therefore, not a cable problem but an internal glitch in the Fire TV box.4) Often after turning it on, it goes to a blank screen from which there is no return.5) There are many more fun things this piece of garbage does but why bother list them.Tomorrow, I'm going to Best Buy to pick up a Roku 3 for about what it sells for on Amazon. See, then I won't have to wait for it to be shipped and, if necessary, I can take it back to a real store and exchange or return it. Oh, and I intend to donate this Fire TV box to the garbage can. I do hope it won't offend the garbage man/woman/person/whatever.", "verified": true, "helpfulness": "4/6", "author": "Amazon Customer \"Silver Smith\""}, {"rating": 4.0, "review": "came from a roku box and as such find the browsing menu a bit constrictedotherwise not a single complaint for a very fine product", "verified": true, "helpfulness": "0/0", "author": "D.G. Bennett"}, {"rating": 5.0, "review": "Since I game on the PC the ps4 was only used for what this does. How ever the ps4 was sucking down 87 watts, the firetv pulls a max of 16w. The remote works great, including the search function when you can use it. I used a gamestop android gamepad on it and it works fine. They do not block you from using other brands, you just wont get the extra audio buttons on the fire version. Coupled with the plex app. Its the best media device of its kind. You won't have access to the google store. You can how ever side load apps. They don't show up in the normal area though. Perhaps they will fix that. Or else maybe someone will make an app you can pin to recent for all side loaded apps. Not worth taking an star off though as this fits the bill perfectly. Lets hope the second version has a terga k1 chipset or better for the mobile kepler GPU that is going to revolutionize portables and devices like this.", "verified": true, "helpfulness": "0/0", "author": "Kate Fox"}]