[{"rating": 5.0, "review": "I gave up on TV 10 years ago because I cannot stand commercials - and much of what was on TV wasn't worth my time either.  In lieu, I became an audio book junkie.  I am also a 'techno'/Apple junkie - I own 4 ipods 2 apple laptops and 2 imacs - I am not a gadget shy person.  That said, I have been totally unimpressed by all of the previous TV streaming devices on the market - until now.William Hardin nailed this device in his \"pros\" review.  His \"cons\" seem to be \"filler\" content only - they are completely negligible.  This device works great and at lightening speeds.  Easier to use than any cable box and faster (like a jet compared to a horse and buggy) than any other streaming box available.Bottom Line: economical;  super fast;  easy interface.  Works EXACTLY as described.", "verified": true, "helpfulness": "3/3", "author": "Victoria \"TV Assassin\""}, {"rating": 5.0, "review": "Between my Roku (2 and 3) and Chromecast, this is by far the superior experience. It's very small, silent, and powerful. It has a better version of Plex - nuff said. I expect to see more/faster/better updates to this device and it's applications in quicker intervals than Roku.", "verified": true, "helpfulness": "3/3", "author": "Eric J Rodewald"}, {"rating": 4.0, "review": "YOU CAN NOT SEARCH YOU TUBE LIKE YOU CAN ON YOUR CELL.PICTURE QUALITY IS GREAT, WITH A GOOD INTERNET CONNECTION THERE IS NO PIXILATING OR INTERRUPTIONS.i AM VERY HAPPY WITH THE SERVICE AND AMMOUNT OF FEATURES.TOO BAD THE CONTROLLERS ARE ON BACK ORDER FOR OVER A MONTH....A REVISED REVIEWWILL COME WHEN THE CONTROLLER COMES IN", "verified": true, "helpfulness": "0/7", "author": "GARY MORRIS"}, {"rating": 5.0, "review": "Consider the Hands that Write this LetterBY ARACELIS GIRMAYConsider the handsthat write this letter.Left palm pressed flat against paper,as we have done before, over my heart,in peace or reverence to the sea,some beautiful thingI saw once, felt once: snow fallinglike rice flung from the giants' wedding,or strangest of strange birds. & consider, then,the right hand, & how it is a fist,within which a sharpened utensil,similar to the way I've held a spade,the horse's reins, loping, the very fistsI've seen from roads through Limay & Estelí.For years, I have come to sit this way:one hand open, one hand closed,like a farmer who puts down seeds & gathers up;food will come from that farming.Or, yes, it is like the way I've dancedwith my left hand opened around a shoulder,my right hand closed insideof another hand. & how I pray,I pray for this to be my way: sweetwork alluded to in the body's position to its paper:left hand, right handlike an open eye, an eye closed:one hand flat against the trapdoor,the other hand knocking, knocking.", "verified": false, "helpfulness": "0/38", "author": "Cadesia"}, {"rating": 4.0, "review": "I get most of my video from Amazon, and I have several Logitech Revue devices I'd like to retire due to the horrible Flash-on-Chrome viewing experience on those devices.  When the Fire TV came along, I jumped on it.  Here's my take:PROS:* From the front porch to my first Gary Busey video was maybe 5 minutes* The Kindle-esque UI is very responsive; far better than the Revue or any cable box I've ever used* Excellent HD playback on my hard-wired connection* Wifi worked well in my brief trials* Remote works great, including voice search* Gaming is pretty decent, though obviously not a replacement for an XBox or PlaystationCONS:* Continuation of Amazon's terrible video browsing experience* No web browser* No MLB.TV as of this writingIf you know what you want to watch, and it is on Amazon, you will be happy with this.  If you want to browse Prime Instant Video content, you will find this just as unsatisfying as searching directly on the web site.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am a google tv user and thought i would try this device since it basically took most of google tv os and apps. not bad.pro: great device, fast, small, video game are fun. cons: no volume control! no way to control my television with the remote! the remote isn't just black it's matte black, i lose it constantly (all remotes should be bright orange so you can find them!", "verified": true, "helpfulness": "0/1", "author": "Thomas L. Downs"}, {"rating": 5.0, "review": "I love the amazon mini tv-it is so really good and convenient..  You can watch all you want on many different places, Pandora Netflix amazon amazon prime are all together, that's groovie", "verified": true, "helpfulness": "0/0", "author": "evaluator"}, {"rating": 5.0, "review": "WOW!!! That was fast shipping and I am not a member of Prime.  Thanx for seeing me as an excellent customer and shipping my items out with haste.  I cannot wait to try this new TV system. I will come back and add to my review once I get this gadget set up and watch a few shows on it.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Because I already knew the device needed to be updated, I ran a hard wire to it so that would go quickly, and it did.  A few minutes later, and it was working super!  It is pretty simple to find a TV series to watch that is available on Prime, and movies that are available on Prime.  I watched both for a few hours and never had a single glitch.My only actual complaints are two.  One is that the pictures it shows of the various selections of entertainment are in rather poor quality.  That is, they are blurry and I often had to get up and walk closer to the movie cover being illustrated on my 59\" HDTV so that I could read it.  It appears these are recorded in the lowest quality pictures of MOST, but not ALL, covers, so it appears to be more a fault with the provider of the movie cover not using a high quality bitmap.  Two, the first TV series I watched was Season 1 of Vikings.  I finished it, and that is an awesome series by the way, but, the picture was rather washed out.  Considering that the content is available in Hi-def, it's a shame that Amazon could not include the Hi-def version with Prime, instead of the \"made for tube TV version\".I should point out that I also got to play with a Roku-2 last week (a friend brought it over), and I have to say that the Fire is most definitely faster and easier to use than the Roku-2.  I hear that there is content available on the Ruku-2 that is not available on the Fire, but I don't care about that, because I'm only really interested in Prime movies and TV content.The only thing that prevented me from making this a 5 star rating is that a fair amount of the Prime content is not Hi-def.  I know I could pay for the Hi-def version, but my cable bill is already too high and my \"better half\" prefers to watch TV on cable.  So to save the money, I will take what I get, regardless of the definition.", "verified": true, "helpfulness": "0/1", "author": "Knightwind"}, {"rating": 5.0, "review": "One of the coolest things we've ever bought.  We don't have 'tv' but just had used our tv for dvd's.  This is awesome and has a bunch of the shows and things we wanted to watch.  Very fast loading on Verizon Fios wireless connection.  One of our most favorite toys ever!  :)", "verified": true, "helpfulness": "0/0", "author": "John Roney"}]