[{"rating": 5.0, "review": "Very pleased", "verified": true, "helpfulness": "0/1", "author": "Anthony C. Byrd \"seabyrd\""}, {"rating": 5.0, "review": "Fast and easy set up, quality picture, once my selected apps dowloaded it was a breeze. Prime videos are seemingly endless.It is nice to have a product just work as expected and advertised.", "verified": true, "helpfulness": "0/0", "author": "selective sam"}, {"rating": 4.0, "review": "The good:Its an amazing little box, although the apis should be available to use across all apps within the magic box for one.Altho this box is powerful and good looking, it also comes packed with goodies and able to make hacks right out of the box.The bad:Many people have had the issue of the remote control draining the battery in matter of hours. My case is no different, I have contacted customer help and tech support several times to no avail. I think its a very poor way to start venturing into the whole amazon ecosystem in the home.You need some sort of VPN for countries away from usa.", "verified": true, "helpfulness": "0/0", "author": "Adolfo"}, {"rating": 4.0, "review": "We have three Fire TV boxes and three Kindles in our house. Love them all... BUT why no HBO GO for Fire TV? I'm tired of watching HBO on the Kindle!!! Come on Amazon... make the deal and get HBO GO on Fire TV!!!", "verified": true, "helpfulness": "0/2", "author": "KCA Ohio"}, {"rating": 5.0, "review": "Love it!!!!!!!!!!", "verified": true, "helpfulness": "0/1", "author": "consumerbuyer"}, {"rating": 4.0, "review": "This is my first streaming player and I have to say that it works very well but the game selection is very thin and almost all video content is a pay service. Although it works great, picture quality is amazing but in truth I see very little use for it if anyone has cable with on demand service.", "verified": true, "helpfulness": "0/0", "author": "B. P. Nowlin"}, {"rating": 5.0, "review": "I bought this to run XBMC and wow am I impressed. I'm very happy with this small (seriously, I was shocked how small it is. It gets lost in my entertainment center!) TV box. It is perfect in every way except dealing with some really high quality video which is understandable, but it is so much better than stringing an HDMI through the floor between my computer and the TV. Just a great piece of hardware. Give it a try!", "verified": true, "helpfulness": "0/0", "author": "Alexander Hayes"}, {"rating": 1.0, "review": "could not get it to work with my internet connection- would connect to my mobile hot spot but took hours to download videos. Might work with an internet connection that is greater than 10mbps. Should really be a no star but not an option", "verified": true, "helpfulness": "1/9", "author": "no"}, {"rating": 5.0, "review": "Love it. Does everything you said it would", "verified": true, "helpfulness": "0/0", "author": "Becky Kiser"}, {"rating": 4.0, "review": "Very nice and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Donald S."}]