[{"rating": 5.0, "review": "I received the box today and was very excited.  I found it very easy to install and now my husband is enjoying his birthday present watching all the movies he loves.  Looking forward to all the entertainment we will enjoy with this little box.", "verified": true, "helpfulness": "0/0", "author": "Laurie M. Lamoureux \"lmlscrapping\""}, {"rating": 5.0, "review": "Finally we can easily watch Prime Instant Videos and Amazon Instant Videos in our living room.  Voice search works great.", "verified": true, "helpfulness": "0/0", "author": "T. Stone"}, {"rating": 5.0, "review": "Just hooked it up but two words: Totally Rad!  Maybe I can finally get out from under Comcast Cable.  That'd be great!", "verified": true, "helpfulness": "1/1", "author": "Katy Henderson"}, {"rating": 4.0, "review": "first I  have to say Amazon  I love you  But I like the ROKU because I have the conveyance to plug in my Earphones in the Remote control. You guys get a 4 because they is room for inprovement.Thank youyour fav customer", "verified": false, "helpfulness": "0/1", "author": "carl  bubb"}, {"rating": 4.0, "review": "The overall performance is great but you need more apps like MLB and HBO GO. You add these and the Amazon Fire will be perfect. Keep up the good work.", "verified": true, "helpfulness": "2/2", "author": "Carlton E. Purcell, Jr."}, {"rating": 5.0, "review": "First of all...it's pretty tiny.  About the size of two decks of cards laying next to each other.  It was a BREEZE to hook up and set up.I've used it a lot so far and I'm so glad I bought it.  the picture is crystal clear, haven't had a single issue of pixelation or buffering yet.  I do wish it had HBO Go on it but, after reading the announcement that Prime will be given some of HBO's older content to stream, I'm pretty sure the HBO Go app will be along soon.I also wish the voice command worked across all apps but, it only works for Prime.  Not a huge issue for me, though.I haven't played any games yet.  I opened up the Sev Zero game and poked around a bit but, I'm awful at shooter games so I'll have to wait for my 20 year old son to get his hands on it.  lolAll in all, I'm very happy with this purchase!", "verified": true, "helpfulness": "1/1", "author": "Cheryl D"}, {"rating": 1.0, "review": "If you have no sense of hearing, this box is great, been battling loss of sound with Netflix and Hulu for several days now, the voice command only works for Amazon Prime which is far below average, at least the remote works, I only have negative reviews of this substandard product", "verified": true, "helpfulness": "2/15", "author": "worst game ever"}, {"rating": 5.0, "review": "So easy to connect to the t.v., really just as easy as the computer, but the Fire TV is so small that it fits right there with the TV. I can watch my prime shows and my niece can play the games all on the same unit. Only problem I see is if we want to use at the same time. Able to access NetFlix and Hulu with touch of remote.", "verified": true, "helpfulness": "0/0", "author": "Agynes L Broesche"}, {"rating": 5.0, "review": "This is a great little device.  I had chromecast and it sucked ( a lot of audio/video sync problems ).I am not thrilled that the voice search directs you to amazon only where you may have to purchase something but hey, that's capitalism for you.I'd still recommend this to anyone wanting to add streaming to an older HD tv that isn't internet ready.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I upgraded from an AppleTV strictly for the Plex Application support. Its ok, but needs a lot of work!The voice search does not work with Plex! What??? Why???Device needs the ability to adjust home screen layouts more and hide un-used items!!!Device needs the ability to start into an application like Plex! I would like to lock the device so it can never leave Plex actually!How do you get support for this device or suggest features?Please advise.", "verified": false, "helpfulness": "4/12", "author": "SCOTT MCKINNEY"}]