[{"rating": 5.0, "review": "love this box nothing else to say 5 stars.", "verified": true, "helpfulness": "0/1", "author": "saul miranda"}, {"rating": 5.0, "review": "I love how this works. I am able to watch movies with HD perfection, picture looks better than cable.", "verified": true, "helpfulness": "0/1", "author": "Susan Taylor"}, {"rating": 5.0, "review": "Fire TV installed 2  weeks ago, so far so good.  There's a lot of free stuff to see and enjoy if you're an Amazon Fire member,  it took a while for me to get high speed internet but now that I do I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I was just disappointed that the voice search does not work while on You Tube searching for videos.", "verified": true, "helpfulness": "0/1", "author": "David A Dugas"}, {"rating": 5.0, "review": "Great unit with ability to add your own applications.", "verified": true, "helpfulness": "0/1", "author": "Steve J Wall"}, {"rating": 3.0, "review": "-No FX-No Fox Now--Activation unavailable for A&E;, History, and Lifetime with DirecTV account (that's a problem  for me)-Search works only with Amazon Instant Video (you won't get inside Netflix)+HDMI-CEC — the lack of it was the most surprising disadvantage of Roku++Sideloading of Android apps, most notably XBMC (two worlds collide in one device at last)+Most apps are slicker than on Roku+Considerably faster video initialization++Spotify Connect (missing on Roku)", "verified": true, "helpfulness": "2/3", "author": "Vadim Poguliaev"}, {"rating": 1.0, "review": "does little for me... what shows are available are not what I like.... I watched one... Alpha House --- what a waste  ...over acting, fould language... I thought you might be able to bring TV up from the slums", "verified": true, "helpfulness": "1/7", "author": "Frank  from Marblehead"}, {"rating": 4.0, "review": "Great device!  Mostly using it for Amazon Prime Music as the other apps/channels are available on my Roku3.  AcornTV is not available on the Fire TV so I will always be tied to the Roku for that alone.  The user interface for the Amazon Fire TV is a little BUSY!!!  I like navigating on the Roku3 much better.  I did a mini test of screen images by watching an Amazon Prime Video on both the Fire TV and the Roku3.  The picture was considerably better on the Fire TV.  The music sounds better as well.  Glad I requested this one for Mother's Day!", "verified": true, "helpfulness": "1/1", "author": "Lee"}, {"rating": 5.0, "review": "Love the unit and the ease of use.  Great picture.  Good bye Cable!", "verified": true, "helpfulness": "0/1", "author": "rmg62"}, {"rating": 1.0, "review": "Everything  costs on this", "verified": true, "helpfulness": "1/8", "author": "Mike"}]