[{"rating": 1.0, "review": "To me the biggest advantage of this box is the voice search, however as of this review the voice only searches amazon prime videos.  Not only do you need a prime membership to watch these selections but even then you still have to pay for some to own or rent! If you have a laptop and an HDMI cord you can do everything this box can and more, same goes for any of the 2nd to newest gaming systems (Xbox 360, ps3, wii and on to the next gens).  To me I would have rather put this $100 into a new laptop or next gen system that could provide much more versatile use and entertainment then this box could ever hope to do.  Also the \"gaming control\" is an extra cost and most of the games can be played on any smartphone.  HBO go is still missing as well and has been promised since early 2014.", "verified": true, "helpfulness": "12/26", "author": "Tony Melone"}, {"rating": 5.0, "review": "Easier than I thought", "verified": true, "helpfulness": "0/3", "author": "Charles J. Herrig"}, {"rating": 5.0, "review": "I've owned my Fire TV  for just a couple days now and I absolutely love it. Only issue is FiOS App not available. But I was able to get around that and side load the app with ABD. My deciding factor on the Fire was my Prime membership. Other streaming devices didn't offer that. The system is lightening fast and the voice search makes it easy for my wife to use.I absolutely recommend Fire TV", "verified": true, "helpfulness": "4/5", "author": "Larry & Michelle"}, {"rating": 5.0, "review": "I like it a lot.  I haven't had it that long and am still trying out the different options.  The only problem I've had is I can't seem to shut the Fire TV off...but I can put it to sleep.  That works.  Otherwise I have both regular TV and the Fire TV sound going at the same time.  That doesn't work.  Regardless of my temporary problem I would recommend it to anyone who wants to watch their movies and programs on their TV.  It's just a grand experience.", "verified": true, "helpfulness": "1/1", "author": "Faith"}, {"rating": 5.0, "review": "Wow!!!! Great device. Easy instillation. Great programing line-up. Great picture and sound. Addictive to binge watching.", "verified": true, "helpfulness": "0/2", "author": "nbpk"}, {"rating": 4.0, "review": "It's pretty awesome, no complaints this way. Just be prepared to purchased certain things.", "verified": true, "helpfulness": "0/3", "author": "BJ Brown"}, {"rating": 4.0, "review": "I really like the fire tv.", "verified": true, "helpfulness": "0/3", "author": "william e kacaba"}, {"rating": 4.0, "review": "Bery nice", "verified": true, "helpfulness": "0/3", "author": "gabriel"}, {"rating": 5.0, "review": "Nice picture quality", "verified": true, "helpfulness": "0/3", "author": "francisco"}, {"rating": 5.0, "review": "Snappy response (near instant) and overall well laid-out interface. Nice remote, too.  No complaints.", "verified": true, "helpfulness": "0/1", "author": "ThisReviewer"}]