[{"rating": 2.0, "review": "So if I purchase this product, is it like a cable box  where I just hook it up and its ready to go or does this device needs internet access and you charge a monthly fee?? Help me please thanks", "verified": false, "helpfulness": "0/4", "author": "chevyman83"}, {"rating": 5.0, "review": "The Amazon Fire is wonderful. It is user friendly and great addition to my Samsung Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Eduardo Rivera"}, {"rating": 5.0, "review": "I am enjoying this little unit. Nice streaming, nice remote and great voice search. I'm still trying different features and such.", "verified": true, "helpfulness": "0/0", "author": "Clark"}, {"rating": 2.0, "review": "Can't get Netflix to work on my fire very disappointed!", "verified": true, "helpfulness": "0/2", "author": "Donny"}, {"rating": 2.0, "review": "I find myself having connectivity issues with this product. Not sure if it's due to the proximity of the Fire TV to my router. Streamability is better with my PS3 for Netflix vs. this product. The concept of this product is nice but has its shortcomings, IMO", "verified": true, "helpfulness": "0/2", "author": "Woo Kid"}, {"rating": 2.0, "review": "keeps freezing on me...", "verified": true, "helpfulness": "0/2", "author": "KHT \"KingWear\""}, {"rating": 5.0, "review": "I love it...worth the price, brings entertainment all together.....one wire...worked for me", "verified": true, "helpfulness": "0/0", "author": "Rita Zehner"}, {"rating": 1.0, "review": "My device started \"stuttering\" when playing my Plex served movies (regardless of resolution, audio,compression, container, etc.) after an \"upgrade\" from amazon.  The only reason I bought this device was due to its Plex \"compatibility\".  After reading some postings at the Plex users forum it reminded me of my own experience when Microsoft sabotaged Stacker's compression market when introducing MS DOS 6.0. I've even followed some of the recommended \"solutions\" from other forum users to no avail.  Quite interesting thread that's been going on for months and months since November 2014 and yet no solution.Here are some facts:Last night I watched a 1080p 5.1 audio movie on my Samsung \"smart\" tv connected to amazon's fire-tv device, while at the same time I watched the same movie on the same gigabit wired network on another tv conected to a wd media player served by Twonky,  on my pc and finally over the internet my uncle watched the same movie in Puerto Rico (mind you that he's a retired 70 years old non-techie guy and has a real low bandwidth connection).  That's 4 connections through different clients all served from my 16TB QNAP NAS in Florida at the same time.  The only crappy stuttering rendering came from the amazon fire-tv device.  I've tweaked and tweaked my fire tv plex client and did noticed that pausing the movie for a while decreases the stuttering frequency.  Buffering anyone?  Yeah wait, buffering isn't an option in the settings just something called \"quality over local network\" which I set one by one from lowest to highest.  Wait, did I say that I have at my house a wired gigabit ethernet lan and that the amazon plex client and the twonky wd client both connected at the same time using the same gigabit switch?Right now I'm left with a useless piece of hardware since unless I can sync my brain to the robotic stuttered rendering, I can't watch my movies on this thing.  do you think I'm going to waste my time calling \"tech support\" to debate with someone who's trained to not support?  Isn't it obvious that instead of trying to fix this fire tv junk it's time to start talking about a replacement.  I don't recall signing up as a beta tester for amazon.Just saying...", "verified": true, "helpfulness": "0/3", "author": "boripuri \"L'Hefe\""}, {"rating": 4.0, "review": "This is a great device to me because I don't have a smart TV. First of all, I must say the packaging was great and arrived as promised. The remote itself feels amazing to hold and the buttons are very simple. The Fire TV itself is beautiful, very minimalist. All you see is the tiny LED on the front when it's in use. I would have given it 5 stars if I had the ability to use the voice search for commands and inside apps (such as Netflix). Love it though!", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"CF\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "LadyB \"Beach lover\""}]