[{"rating": 5.0, "review": "I want it to have programs for Latin America.", "verified": true, "helpfulness": "0/0", "author": "Stalin"}, {"rating": 5.0, "review": "Great product! Lives up to expectations.", "verified": true, "helpfulness": "0/0", "author": "Noe Banda"}, {"rating": 4.0, "review": "We've enjoyed Amazon Fire for about a month, and especially like all of the programming we are able to access.  It was easy to hook up and it's very easy to use, especially with the voice option.  I also like the fact that there is often more than way to watch selected programs.  My only issue is that a few of the popular movies and documentaries to rent are usually more expensive than with TWC Movies on Demand  We need to mention the ability to download great music, and Netfix, Hulu, etc. are all in the same place.  Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fun to use the voice remote.  Amazing selection of videos.  The HD quality is excellent.  I highly recommend Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Doc Dave"}, {"rating": 5.0, "review": "I love it.  It was very easy to set up and have enjoyed for a couple of days. Haven't played around with much of the movies,  not sure on the cost.", "verified": true, "helpfulness": "0/0", "author": "danese"}, {"rating": 3.0, "review": "To easy for mike kids to byovies without my consent. The setup of the programs is se what confusing", "verified": true, "helpfulness": "0/0", "author": "Iris A. Stadin"}, {"rating": 5.0, "review": "Very nice easy to connect and I am still working my way around it", "verified": true, "helpfulness": "0/0", "author": "Kurt Kurtz"}, {"rating": 4.0, "review": "Love it ... I like that I can pay for Julie thru Amazon just wish I could do the same with Netflix", "verified": true, "helpfulness": "0/0", "author": "Wanda Valentin"}, {"rating": 5.0, "review": "This is my second fire TV device. I initially purchased the stick, and loved it but the full Fire TV brings things to a whole new level.", "verified": true, "helpfulness": "0/0", "author": "TIM CERATO"}, {"rating": 5.0, "review": "Can't live without this.  I have 2, and am about to buy one for my kitchen tv.  The best part about the Fire TV is the QUICK response by the remote control.  Our smart tv took FOREVER to get to the netflix show we wanted.  This one gets there as quickly as the button is pushed.  The only downside is the teeny-tiny remote control.  One was missing for weeks until I finally found it.  It's just so small it gets lost easily.", "verified": true, "helpfulness": "0/0", "author": "Andrea M"}]