[{"rating": 4.0, "review": "You should be able pair a BT keyboard with this, but apparently Amazon does not want you to do this.  Otherwise, it works good.", "verified": true, "helpfulness": "0/0", "author": "T. MacIntosh \"Tomac\""}, {"rating": 5.0, "review": "This has been one of the best buys we've made!  It's extremely easy to use.", "verified": true, "helpfulness": "0/0", "author": "R. Millard"}, {"rating": 3.0, "review": "It works good usually but it goes through periods where it buffers alot even when it says WiFI is very good", "verified": true, "helpfulness": "0/0", "author": "Charity Turner"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Neptune"}, {"rating": 5.0, "review": "I purchased this as a gift.  I helped my mom get it set up and running.  I was surprised at how quick, easy, and smooth that process was.  Great product.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 5.0, "review": "Very good unit with strong wifi. I would recommend this over any other unit.", "verified": true, "helpfulness": "0/0", "author": "darran"}, {"rating": 5.0, "review": "The unit responds very quickly to commands.  Sound is great and while the selections are good you can get them via TiVo or APPLE TV also.  The performance makes Fire TV my preference.", "verified": true, "helpfulness": "0/0", "author": "JAL \"jal\""}, {"rating": 4.0, "review": "I wish there was a better mechanism for searching and finding the movies that you want. otherwise I'd give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm really pleased.  Setup and use has to be easy for me and it was.", "verified": true, "helpfulness": "0/0", "author": "jiminky \"free thinker\""}, {"rating": 5.0, "review": "Have a questiondidn't know how to submit a question so I put it under review hoping someone will have an answer for me. I was wondering if this would work if you have no cable hook up at your house and you were only using Wi-Fi with the Amazon prime system we currently do not have any television system or network so could I use this with my wife I hope someone has an answer for me thank you.", "verified": false, "helpfulness": "0/0", "author": "Nicole pizzolongo"}]