[{"rating": 4.0, "review": "So far I'm loving the device.  Super fast and great menus.  The voice search is awesome ... but know that is only searches into the Amazon library and ignores other media sources like Netflix.  Very highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Bill Hipp"}, {"rating": 4.0, "review": "I like the new Fire, but I was disappointed not to be able to get ESPN. I use DirecTV and they aren't one of the providers that subscribe to it. I like not having to use another device to get to Prime TV, Netflix, and Pandora and I have discovered a couple of others that I hadn't used before. Boy, it was easy to hook up and set up, too.", "verified": true, "helpfulness": "0/0", "author": "Bill G. Slaughter \"Bill G. Slaughter\""}, {"rating": 5.0, "review": "The Fire TV is a fast streaming device, much faster than my old Roku. It supports 5gh wireless so even 5.1 1080p hd programing starts up flawlessly. Oh, and the games are a great bonus.", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 4.0, "review": "Quick and easy setup.  Connected with no problem to local wifi source in home (30 mbps Brighthouse).  Voice lookup was very helpful.  Selected Avengers from my watchlist and played back flawlessly on my HD tv.  Looking forward to using this for gaming.  Controller due to arrive today.  Granddaughter will love to play Minecraft on it.  Would have been 5 stars if it came with access to other popular content.", "verified": true, "helpfulness": "0/0", "author": "Magic Power \"magicpower\""}, {"rating": 5.0, "review": "This item was very nicely packaged for shipping, opened easily, and started simply and quickly. It works exactly as described, and allowed immediate access to an Amazon Prime video.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Ron Gillum, MD\""}, {"rating": 5.0, "review": "I love the ease of  finding a specific actor and their movie appearances. Voice activation is excellent. I love it!", "verified": true, "helpfulness": "0/0", "author": "barbara s. kichline"}, {"rating": 4.0, "review": "Really great stuff.  Wish it was more clear what things the search is searching through, other apps, etc.  But really strong so far.  Very happy with how fast it all is.", "verified": true, "helpfulness": "1/1", "author": "Scott Johnson"}, {"rating": 5.0, "review": "It works great. Way better than the Roku. I love the voice command feature so much. Awesome product, great price.", "verified": true, "helpfulness": "0/0", "author": "PriscillaSoriano"}, {"rating": 5.0, "review": "The Fire was easy to set up and operate.  I have a Roku to compare it to and I think the Fire is easier.  I will be getting one or two more for the other house TVs.", "verified": true, "helpfulness": "0/0", "author": "L. Harrell"}, {"rating": 4.0, "review": "This works well - pretty easy to use, very easy to set up.  My only disappointment is that I didn't realize that streaming videos would be so much more limited in availability.", "verified": true, "helpfulness": "0/0", "author": "Annie D"}]