[{"rating": 5.0, "review": "I like this more than my apple tv, which is saying a lot. It has certainly raised the bar. I with it natively supported streaming from my itunes library, but I think I can solve that with plex. It's also better than the 'smart tv' tools that come with my samsung appliances - I like the smart tv, it makes life easier, but the apps are lacking a bit. The apps for this are much better and the fact that you can easily call support is very nice.", "verified": true, "helpfulness": "0/0", "author": "A. Covati \"@covati on twitter\""}, {"rating": 5.0, "review": "Love it.  Have watched a lot of old movies which do not have all of the swearing and violence of modern movies.  Children canwatch these classic movies and family movies.  They also have modern movies.  You can also watch youtube movies through it.Old timers can enjoy, through youtube, cowboy shows like Gunsmoke, Wanted Dead or Alive, Death Valley Days, Wagon Train,Rawhide, etc.", "verified": true, "helpfulness": "0/1", "author": "Dennis C. Harms"}, {"rating": 1.0, "review": "Lots of problems with HULU \"app\" on Kindle Fire TV.  Delete app.  reset fire tv.  reinstall app.  reset fire tv.  Funny, NEVER a problem with Amazon videos or shows.  Fire TV constantly locking up.  I have several, much older Sony streaming boxes that always work perfectly.  Overrated.  And no, it's not my high powered modem with 1gb cache, and no it is not my 60mbps internet connection.  And the mirroring from a Kindle?  Psshh,  as long as you don't mind the voices not syncing will the video!", "verified": true, "helpfulness": "0/0", "author": "Odiewon \"Odie\""}, {"rating": 5.0, "review": "Best purchase I've made in a long time.  Easy to use, tons of options and a great way to lower the cable bill!", "verified": true, "helpfulness": "0/0", "author": "rainingdogs17"}, {"rating": 5.0, "review": "I love it! It was so easy to start up and use. Thanks", "verified": true, "helpfulness": "0/0", "author": "FranL"}, {"rating": 2.0, "review": "I wanted to have an easy way to watch Amazon videos, replacing a burnt-out Roku HD which I had before. I was also hoping to use the WiDi display mirroring (Miracast) to share my Windows 8 screen easily without cables.After about 2 months (a bit too late to return), I realized a new Roku might have been a better choice. Here's why:Pros:- easy to access movies and shows - no need to start a special app to get to your Amazon content- voice search for movies is very good, it really works - no need to hunt-and-peck the letters on the screen- when playing music from your Amazon music library, it shows the lyrics in sync with the song (for many but not all songs)Cons:- the user interface is simply bad; I get a headache trying to use it. The UI on the Amazon Prime Video app on Roku is actually a lot better- apps have problems - for example, I tried to watch a video on Vevo: it ran the ad but then the video did not start; tried it several times, same result (never had a problem with apps on my old Roku)- the display mirroring (Miracast) simply does not work - tried both a Surface Pro 3 and a Lenovo running Windows 8.1 (those worked with a Roku stick)- the voice search doesn't work for other content - e.g., music or apps; so it's back to hunt-and-peck for those (how hard would it be to support a bluetooth keyboard or allow using iPad/Kindle/Android phone as a keyboard; or, for that matter, my old Blackberry with a real keyboard :)- entering the video PIN on screen in front of others (guests or kids) makes the PIN pretty much useless - even though the digits are displayed as dots, anyone paying attention will see which numbers are being selected; there's gotta be a better way", "verified": true, "helpfulness": "0/3", "author": "Blast9"}, {"rating": 4.0, "review": "Just make sure to subscribe to PRIME.  This is not good for anything else.  Games play very nice and wifi is flawless.", "verified": true, "helpfulness": "1/3", "author": "Jamie"}, {"rating": 4.0, "review": "great.  Loved the Bosch series.  Easy to use.  However, no list of available movies.  Apple TV is much better in this regard.", "verified": true, "helpfulness": "0/0", "author": "Hamlet"}, {"rating": 5.0, "review": "Excellent product.  Very satisfied with your service.", "verified": true, "helpfulness": "0/0", "author": "Mario Cordova"}, {"rating": 1.0, "review": "I've been using the Fire TV Stick for a couple of months now and it has been great.  When the Sling TV deal came up I decided to get a Fire TV for another TV.  I setup the Fire TV in the evening and watched a few shows on it.  When I came out in the morning the device was dead, no power light and the TV didn't see any device hooked up to that HDMI port.  Amazon support had me try a couple things then shipped out a new unit.The new unit arrived and I set it up and it was working great.  24 hours later I went to reboot it since Netflix wasn't working and it never turned back on.  Again called support, went through a few troubleshooting steps and the are sending a new unit.The Fire TV is great when it works but they seem to have some quality issues right now and are shipping out defective devices.", "verified": true, "helpfulness": "10/11", "author": "Ravie McDonald"}]