[{"rating": 5.0, "review": "I have side loaded XBMC and stream Netflix and that's it. I don't use any off the other apps or services. Based on my usage the AFTV is the best small streamer available and only beaten by a HTPC. For my use here is the order of preference for devices, all of which I have used:HTPCAFTVATV2RokuWDTV SMP", "verified": true, "helpfulness": "0/0", "author": "David Pearce"}, {"rating": 5.0, "review": "I HAVE SEVERAL APPLE TV UNITS, BUT THE  AMAZON TV FIRE VOICE RESPONSE IS AMAZING , THE PRIME SELECTION OF MOVIES IS GREAT", "verified": true, "helpfulness": "1/1", "author": "HRY"}, {"rating": 5.0, "review": "I just received my new Amazon Fire TV today.  i hooked it up to my TV without any problems.  I am currently only using it for Amazon Prime videos...I don't use any other service.  The hardest part of the hookup was getting the damn shrink wrap plastic off the batteries for the remote...lol.I was already an Amazon Prime customer, using my Sony BD-570 to stream video.  Lately I was seeing a few odd problems from my Sony...and the technology was about 5 years old, so I got the Fire TV on the 30 day free trial.I have the new software in my system...I had no long delay downloading any updates.  After the little install cartoon, I selected my wif-fi network and entered my router security password, then it said \"Checking for Updates\" and went straight to the menu system.Since I already had Prime, I had a Watchlist and it was immediately available.  The Home screen now has the categories \"Recently Added to Prime\", \"Top Movies on Prime\", \"Top TV on Prime\", along with the other Featured and New Movies categories.  There is also a Featured Apps and Games selection which looks like it already includes Netflix and some other apps and games.Unlike my Sony which required 15-30 seconds to start up any movie, my Prime movie and TV selections came up immediately.  They also look better than what my Sony gave me and they sound fine.  I plan to hook this up to my Sony wireless surround sound headphones later this week via optical and I'll do an update to let you know how that works out.All in all, I'm glad I purchased this unit and, barring any problems, I plan to keep the Fire TV.UPDATE: 6/2/2014:As promised, I connected my new Fire TV to my surround sound headphones (Sony MDR-DS6500) using the optical TASCAM audio connection.  The summary on this operation is simple:  It works great.  Using the Settings menu item on the AFTV, you can set either the HDMI audio or the Optical audio stream to use the Dolby surround sound system.  It would be nice if you could use both on Dolby at the same time, but it's pretty simple to change from one to the other.  Whichever audio output is not set to Dolby surround is set to stereo. (Note: Both can be set to stereo, but only one at a time can be set to Dolby surround).  The sound was awesome and worked great on my headphones.I'll provide additional updates as I continue trying out features of my new Amazon Fire TV streaming box.UPDATE 6/20/2014:I've been using the Fire TV for 3 week now and I'm still enthusiastic about this product.  The system that predicts your viewing is pretty awesome.  Just to try it out, I deliberately switched to other movies and series beyond what I had been watching.  You could tell there was a little more of a delay starting up the program, but nothing like I experienced with my Sony BluRay player.  This is definitely a keeper for me.  I'll let you know if I find any additional features or problems with my Fire TV.UPDATE 8/13/2014:Well, as most people know by now, software updates for the AFTV have fixed most of the concerns about finding just the Amazon Prime movies.  Besides the new Prime Only categories to browse through, you can precede your voice search with the words \"Prime Eligible\" and get just the videos that are free with a Prime membership.  For example, saying \"Prime Eligible Covert Affairs\" will bring up only those Covert Affairs seasons that are free on Prime.  It will not include the last season, since that is still a fee-based release.I also have now used the \"Crackle\" app to watch movies.  Sometimes it works just fine and other times it buffers repeatedly.  I haven't yet determined if that's a problem with the app, the AFTV, or my ISP.  When I do, I'll let you know.  I'm thinking about getting Hulu Plus later this year, so I'll let you know how that works out, too.", "verified": true, "helpfulness": "3/3", "author": "Wayne Shearer"}, {"rating": 5.0, "review": "I love (LOVE) my Kindle Fire, and still feel it's one of the best gifts I have ever received.  I purchased a Prime membership shortly after getting my Kindle, and never really used the videos because I didn't enjoy the \"small screen\" experience to watch them on.  The Amazon Fire TV has opened up a whole new world of viewing for me, and I am beyond thrilled.  There are so many wonderful choices, from classics to current, tv shows/series and movies.  There is only one problem...There just aren't enough hours in the day to watch everything!  :)Thank you Amazon!  This is really great!", "verified": true, "helpfulness": "0/0", "author": "DogWoman"}, {"rating": 4.0, "review": "I am liking my Fire TV. The voice search is near flawless. Amazon's own media is at the top of the design. For Instance the Your amazon Prime Watchlist is on the top menu, where as to watch NetFlix vidioes, you have to go to Apps->Netflix->Watchlist. If you are an avid Amazon Prime subscriber such as I, this is definitely a value adding device.  Another cool thing is that when you use the remote, it switches the source on your TV to the fire TV (At least on my Panasonic Plasma TV). That being said, Amazon didn't go far enough with this. They should add apps for the Amazon cloud player for Music,and for audio books, and kindle books. Why shouldn't you be able to stream your amazon music through your fire t.v. as you are working around the house? Ditto Audible books. Why not be able to put a kindle book up on your tv and see a big picture of a diagram that you can't see well on a kindle ereader? Or Display a kindle book in BIG type on the TV for people with poor eyesight?", "verified": true, "helpfulness": "2/2", "author": "K. Lange"}, {"rating": 3.0, "review": "THEY DONT EXPLAIN IN THE AD THAT THE VOICE CONTROL ONLY WORKS WITH AMAZON PRIME. I AM VERY DISAPPOINTED  BAD", "verified": true, "helpfulness": "0/1", "author": "bob mckay"}, {"rating": 5.0, "review": "Absolute beast of a machine have had it since the 18th of this month, its fast and resposive the internal specs make sure of that, love the fact that the remote feels great in the hand and uses blutooth...no line of sight needed how great is that? Now while content is missing I expect this to change, to folks complaints about how the everything is geared toward amazon ...duh its built by them of course they will want their content front and center.Picture quality and sound are great my only issue is I would like to see native app for the fire tv and not ports like Netflix and Flixster and flixster only streams my stuff in SD which sucks, voice search is fantastic and will be made available to other 3rd party apps later like netflix, other then that I do recommend getting this if you have been on the fence its small yet packs a punch you can't go wrong I'm very happy I purchased my fire tv.", "verified": true, "helpfulness": "0/0", "author": "William Talbert"}, {"rating": 4.0, "review": "I would love to add this to our Entertainment arsenal. I really would.But without HBO2Go, it's really not all that useful. The ONLY series we watch any more are 95% HBO series. If it had HBO2Go on it, I'd snap one up. Until it does, I'm stuck with Roku. ;-(", "verified": false, "helpfulness": "1/2", "author": "AMom"}, {"rating": 3.0, "review": "Still figuring out HOW TO sort filter for FREE PRIME content! $99 box + $99 Prime membership but search ( voice commands cool) for\"how I met your mother\" and there is a per episode charge???  I can watch reruns ON-DEMAND on VERIZON FIOS for FREE!???  My KINDLE FIRE shows Prime content so I'll keep trying.Still playing with my new toy. Maybe I missed a settings.....voice controls r cool!", "verified": true, "helpfulness": "0/0", "author": "BURLGIRL"}, {"rating": 3.0, "review": "Like many of you, I'm sure you tried out Amazon Fire TV with a free trial (if not... you should really, really read the reviews before purchase.)  I felt like setting it up was a breeze (I had my own HDMI cable - does not come with one but they do a good job letting you know that before you order).  I also had my brother kick me off his Prime membership (which only comes with free shipping as a guest) and get a 30-day free trial of Amazon Prime so I could stream videos.  It's ultra small (maybe 4\"x4\"x0.5\") and can fit most anywhere, and has a responsive remote (voice and touch).  The screen quality is fantastic. However, I was underwhelmed and will be sending it back.Why won't I be keeping it? Here's the short list:1. You should be able to filter out which Prime videos are free to stream vs. the ones you have to buy/rent.2. You should be able to use Amazon Cloud Music player with this.  It is ridiculous that you can't listen to your own music that you bought through Amazon and have loaded to an Amazon Cloud with an Amazon Fire TV player. No, I don't want to use any of the other music apps - I want to listen to my own music. I could give two scoops about being able to see the pictures I have on my Amazon cloud drive (nor did I want to see some of them... sheesh...)  Give me my music.3. Roku has the remote with a headset jack. I LOVE that idea. For so many reasons, that is a huge selling point of the Roku 3 versus this player for me.4. It would be helpful if you already have premium channels (i.e. Showtime, HBO, etc.) that you could connect to their online services (i.e. HBO GO) through this player. I'm not going to pay to watch something that I can watch for free on my regular cable or on my computer.In summation:  to get me to buy this, I would need it to have a remote with an audio jack like the Roku 3, the ability to listen to my Amazon Cloud music, and apps that would access my premium channel websites.  It was fun to play with while it lasted, but it's going to go back until Amazon implements the features I want.", "verified": true, "helpfulness": "2/4", "author": "Sultry Science Sweetie"}]