[{"rating": 2.0, "review": "With no written instructions I'm lost. It's confusing to this old guy. I'm probably missing something that tells you how to operate it!", "verified": true, "helpfulness": "0/3", "author": "Donald R. Terry \"It's really me!\""}, {"rating": 5.0, "review": "I love it.  Although every now and again it lags but I think its because of how fast I press the buttons when going over my Watchlist and my list on Netflix.  But other than that, I love the way its all laid out.  But I do have a question, every now and then it says its not connected to the internet but when I go into the settings, it is connected.  Why does it do that?  I'm just curious, that's all.  Thanks for a great product!!!", "verified": true, "helpfulness": "0/0", "author": "Theresa M Drouillard"}, {"rating": 5.0, "review": "We love watching our Amazon Fire TV.  We are working at getting rid of the the high cable cost and watch our programs with either Hulu, Netflix or by the Amazon Prime account.  One of the best items we have bought in the last year.  Would recommend it to those trying to lose the high cable bills each month.", "verified": true, "helpfulness": "0/0", "author": "mmueller0926 \"Mitch Mueller\""}, {"rating": 4.0, "review": "My husband and I decided to stop cable last month. The Amazon Fire TV allows us to watch all our favorite shows, movies, listen to music. And we can even add our photos to the Cloud to view on our TV. We read reviews and features on the various choices available. I'm very satisfied with our purchase. The only reason I didn't rate it a five was because for some reason, Netflix wasn't loading for a few weeks. We read that there was an update needed to allow Netflix to load to Amazin Fire TV. It is now working great! We especially love the voice prompt feature.", "verified": true, "helpfulness": "0/0", "author": "An Amazon Customer"}, {"rating": 4.0, "review": "Lots of fun and works great!", "verified": true, "helpfulness": "0/0", "author": "Vance R. Kenney \"Vance\""}, {"rating": 5.0, "review": "The Amazon Fire TV works very well and was easy to setup and install.  What we are not happy about is that Amazon Prime Video charges rental fees for movies that are so old.  Movies as old as 20 years should be free to watch at this point in time.  My husband feels the movie portion of Amazon sucks.", "verified": true, "helpfulness": "0/0", "author": "S. Smith \"stinkymom\""}, {"rating": 5.0, "review": "this is absolutely the best for streaming video. the only problem is ISP LIMITS ON DOWNLOADS. the ISP caps are really just to make sure you stay on cable", "verified": true, "helpfulness": "0/0", "author": "Walt Enfield \"Techno-holic\""}, {"rating": 5.0, "review": "It is wonderful. I love it. Thank you.", "verified": true, "helpfulness": "0/0", "author": "june m horne"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Edwin"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "RHONDA TURNER"}]