[{"rating": 2.0, "review": "The USB port does not support any form of external storage, so why does it have one?  Terrible waste of time and money unless you want to spend more time and money uploading your movies to the Amazon Cloud.", "verified": true, "helpfulness": "4/6", "author": "Bob Collins"}, {"rating": 1.0, "review": "Stopped working!  Harder to use then the Roku I gave up for it, when it was working.  I definitely want to return this thing.", "verified": true, "helpfulness": "1/6", "author": "Kevin Thulon"}, {"rating": 5.0, "review": "Love it so much!! The voice control works amazingly well!! That is the feature that made me pull the trigger on the Fire TV. So much easier to navigate with voice than going through menus and sub menus. We bought the game controller as well, because Fire TV has games. We aren't gamers, just wanted something to fool around with occasionally. Happy with that too!", "verified": true, "helpfulness": "0/0", "author": "Betsy F. \"Betsy\""}, {"rating": 2.0, "review": "The concept was good, however it freeze up a lot, and the sound would drop making it very annoying when trying to watch a movie or video.", "verified": true, "helpfulness": "2/5", "author": "Winta202"}, {"rating": 4.0, "review": "it works well, doesn't run hot like my PS3, doesn't crash like my Chromecast... and it runs most of my Amazon apps. I didn't play with the voice activated stuff much, but it worked well when I did.", "verified": true, "helpfulness": "1/2", "author": "Dave the Pear"}, {"rating": 5.0, "review": "best hardware with $100 for tv box", "verified": true, "helpfulness": "0/0", "author": "Viet T."}, {"rating": 4.0, "review": "works", "verified": true, "helpfulness": "0/2", "author": "Robert D. Aue, Sr."}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "jason herzog / lori herzog"}, {"rating": 5.0, "review": "Really fast movie streaming device.  It's much faster loading than any web TV or BlueRay player can do. It also recognize my account by searching the IP address of my home network.  There is no need to sign-in for Amazon Prime account. Great product made by Amazon!", "verified": true, "helpfulness": "1/2", "author": "C. Y."}, {"rating": 5.0, "review": "So happy to see Amazon has created a quality product. I have  Apple in one room and Amazon Fire TV in another. Now I'm thinking removing the cable boxes from the other rooms since it is wifi no need to pay for the DVR boxes in all the rooms. So it will save money.Oh and I love the voice commands too. So quick.", "verified": true, "helpfulness": "0/1", "author": "Sarah Barlow"}]