[{"rating": 5.0, "review": "This has been a great box. I got a deal on it by signing up for 3 months of Sling TV. It is very stable and fast. I really like the user interface.", "verified": true, "helpfulness": "0/0", "author": "Pointech \"pointech\""}, {"rating": 5.0, "review": "I like it so much my family keep asking me to get them one. I give them the one I have and buy another.", "verified": true, "helpfulness": "0/0", "author": "Ralph  Jones"}, {"rating": 5.0, "review": "LOVE IT. Should have purchased sooner. I can play my own music and have my own video library. DVD'S obsolete.", "verified": true, "helpfulness": "0/0", "author": "CB"}, {"rating": 5.0, "review": "Struggled to watch Netflix on the Sony Media Player for months, finally switched to this and it's amazing!  Great format - so easy to use!", "verified": true, "helpfulness": "0/0", "author": "MICHAEL F. DALEY"}, {"rating": 4.0, "review": "I'm loving the FireTV, I have now stopped using my Apple TV. This little box Rocks.", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 5.0, "review": "AAA", "verified": true, "helpfulness": "0/0", "author": "omar"}, {"rating": 5.0, "review": "Everything I expected. It really adds variety to my Video Choices. Great Value.", "verified": true, "helpfulness": "0/0", "author": "daniel"}, {"rating": 2.0, "review": "Unclear in description that more wires are needed to make this work. Not for the cable tv ignorant. I am sure it works well for those who can hook it up. Mine is collecting dust.", "verified": true, "helpfulness": "0/2", "author": "Sean \"Seann\""}, {"rating": 4.0, "review": "This little streamer arguably offers the best performance of current streamers. It has the specs for the title but optimization falls short here and there. This is apparent when pressed with rapid menu navigation, mostly within certain apps.Speaking of apps, the Amazon TV leaves a little to be desired. Many of the main boxes are checked but some apps available on other brands, and even on other Amazon devices are absent.But when it comes to pure media streaming the Amazon TV is excellent. 1080p video is streamed effortlessly (with well optimized apps) thanks to the dual band wifi and powerful processor. Dolby digital+ delivers very good audio quality across multiple channels alongside the crisp video.Those of us who aren't subscribed to Amazon prime are inconvenienced with a main menu heavily structured for prime services. It's also worth noting the voice search/command feature works surprisingly well.TL;DRIt's powerful, App support is just ok, menu is prime centric, good remote & voice function.", "verified": true, "helpfulness": "1/1", "author": "Jables"}, {"rating": 5.0, "review": "Very rarely is there a delay, interruption in viewing. It's wonderful to be able to watch a greater variety of excellent programs on the television. We have a cable, Wi-Fi company that leaves a lot to be desired so I had to get a Wi-Fi extender and it works wonderfully now.", "verified": true, "helpfulness": "1/1", "author": "lovebeinggrandma"}]