[{"rating": 4.0, "review": "I bought the Fire TV primarily because my streaming Blu ray player began to become very unresponsive and did not want to stream netflix properly. It would only play 5 minutes of a show before crashing. I decided to give this a try and got it the week it came out. I am very happy with the purchase, but if you are not a prime member, it may not be worth the high price tag. Many of the things this does can be handled on a Ruku or Chromecast, so these may be better options. This box does allow you to have access to prime movies and tv shows, but these require a subscription. I had said subscription making this box much more worth it. I use hulu plus, netflix, and prime up here, and have no cable since this is all anyone could ever need. The games are decent, and more should probably come out. It is also simple to rent movies up here, but once again, note that there are a lot of in app purchases and rental costs and whatnot embedded in some of the content.I have loved my fire TV. It is fast, netflix does not crash, and I would give it 5 stars. I don't, however because of one complaint. The remote is EXTREMELY sensitive. You can be lying around and if a pillow or something even brushes against a button, it does something. There is a positive to this in that you don't ever have to aim at the box perfectly or keep pressing buttons from time to time, but it can be a pain when your streaming your show and set down the remote and all of a sudden, it starts fast forwarding or something and you can't find your remote. There are also no buttons of the Fire TV itself, so lose the remote, your out of luck. And it does not turn off (until a period of inactivity). There is no off button on the remote.In summary: LOVE the box, hate the remote. 4/5, and would recommend it to a friend if you have subscriptions like Netflix, Hulu, and/or Prime. Without such subscriptions, this box may not be too gratifying considering the cost.", "verified": true, "helpfulness": "1/1", "author": "Cshaf51"}, {"rating": 1.0, "review": "SUCKS!!!", "verified": true, "helpfulness": "2/21", "author": "Eric Pearson"}, {"rating": 3.0, "review": "Overall I like the device. It is attractive hardware, a nice quality remote with good performance. The setup was easy, a video demonstration at the beginning was a nice touch. The voice recognition on the remote works well, but doesn't search all media or apps. As mentioned performance was good, I moved up from an older generation Apple TV2. I use Plex for media streaming and it works quite well with the FireTV.My main issue is the interface. The icons are quite large and could use a little space between the rows. It just seems too cluttered at times. If you have any doubt as to this being a direct pipe into the Amazon ecosystem let me assure you that is exactly what it is. I am a Prime member so I am okay with that. If you aren't a Prime member consider a Roku. The good part is that it is helping me discover more of my Prime available media. I wasn't using all of it before. Prime Music however is still a lean offering.Going back to Plex, that is the real reason I bought this in addition to the Prime offerings. The ability to stream media stored on my network is a big deal. Prime offers a lot, but Plex is a superb offering. If  you haven't tried it you should.Not to drone on, if you are a Prime Member it's an easy $99 to spend. It comes literally ready to go and tied to your count. They make it very easy to purchase content and sometimes that ability is placed in front of free ways to consume the same media so be aware.", "verified": true, "helpfulness": "1/1", "author": "awraynor \"awraynor\""}, {"rating": 5.0, "review": "This is the most amazing product. I turned off cable.I have wifi and I can watch about anything the next day.", "verified": true, "helpfulness": "0/0", "author": "Lucyb"}, {"rating": 2.0, "review": "It stops in the middle of a program, saying my connection is bad, however our laptops work fine. After going through some shows/ movies we like , I find we have to buy them. Your advertising for fire tv is very misleading. I expected to cancel our cable, however, it looks like what we would want to watch would only be more costly. very disapointed", "verified": true, "helpfulness": "4/5", "author": "carl p"}, {"rating": 2.0, "review": "Advertisement failed to properly warn user that unless reception system had adequate thru-put capacity, buffering and pauses when projected on common large TV screens in use today, would be excessive.I felt lied to by Amazon for having failed to adequately warned the purchaser of this. I will distrust Amazon in the future. It is too big and too well-respected to fail in this regard. Shame on it.", "verified": true, "helpfulness": "2/4", "author": "Shazam \"Shazam\""}, {"rating": 2.0, "review": "Sorry Amazon I was disappointed with this product.  I get way better programing on my Roku and I expected to have access to more shows and not have to pay.  I am still limited to just the Amazon Prime shows.  If I am missing something please let me know.", "verified": true, "helpfulness": "6/7", "author": "JSS"}, {"rating": 3.0, "review": "I thought the amount of television programs and movies available would be more extensive and free.  However, I found that is not the case.  I do appreciate that Netflix programs download faster than with my BluRay player.", "verified": true, "helpfulness": "1/2", "author": "Thomas Ryan"}, {"rating": 2.0, "review": "It's ok if you don't have a \"limit\" on your download/uploads!  Unfortunately, many cable companies just love to limit your usage and charge extra if you go over (what age are these companies in?).  So, we returned it.  Otherwise, it seemed great for the only three days of use!", "verified": true, "helpfulness": "1/5", "author": "Laoblue"}, {"rating": 5.0, "review": "I love Amazon Fire TV. It meets all of my needs for I am a cable cutter. I kept my Apple TV and gave my Roku to someone else. I kept the Apple TV for I have the MLB premium. NOW, that is Amazon Fire. It is so simple to use and pretty straight forward. I have all of my other services (Hulu, Netflix, MLB, etc.) all on one device so I see no reason to keep my Apple TV. Also, my other services run way better on my Amazon Prime. For me, Amazon Fire has met all of my needs and more.", "verified": true, "helpfulness": "0/0", "author": "Kratos Ohio"}]