[{"rating": 4.0, "review": "I AM VERY HAPPY WITH MY PURCHASE", "verified": true, "helpfulness": "0/0", "author": "James W."}, {"rating": 5.0, "review": "May say \"Certified Refurbished\", but it looks pretty brand new to us. Works great and we saved a few bucks.", "verified": true, "helpfulness": "0/0", "author": "Maurice \"Maurice Naragon\""}, {"rating": 5.0, "review": "I really love the Amazon Fire TV.  It's much much better than I anticipated.  I have a weak internet speed and even with that challenge the Fire TV is great, no buffering or delays.  I love it.", "verified": true, "helpfulness": "1/1", "author": "Chofis \"Fia SuperStar\""}, {"rating": 5.0, "review": "Bought this device SOLELY to use for Plex. It works great, its very fast, super snappy menus and its nice and small. Love this device, keep making it better please.", "verified": true, "helpfulness": "0/0", "author": "Atlanta Anthony"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Lynda Berwager"}, {"rating": 5.0, "review": "I received this item just over a week ago and I think it's great.  The main reason I bought this was because of the YouTube app.  I have an older Sony blue-ray player which had a YouTube app but was no longer available after April 20th.  I did not see a need to buy another blue-ray player so I looked at other options.  After reading reviews on this website I just felt the Amazon Fire TV was my best option.  It was very easy to set-up and of course the first app I used was the YouTube app.  The entire process took 15 minutes.  I am using other apps as well.  The apps load very quickly and I have had no issues other then the ESPN app which always takes two attempts to connect.The only negative comment I have is that there is no on/off button for the Fire TV.  It stays on for 30 minutes before shutting down.  I recommend this item very much.", "verified": true, "helpfulness": "1/1", "author": "jmrk"}, {"rating": 5.0, "review": "I bought this on sale for $99 for my 40\" 3DSamsung TV in my bedroom which is not a Smart TV (it was only $400) and we have the new Samsung 3D Ultra Hi Def Curved TV in our Living Room. I had a Western Digital Live TV Media Player for the Bedroom, but it didn't have the Amazon link. (It has Netflix and Hulu, which is great) and so I figured I'd get the Fire TV which gets just about everything. I wasn't disappointed. It got here in two days and was a breeze to install. It is easy to use, and the voice command feature is a real time saver. It has built in wi-fi (unlike the WD player which I had to buy an antenna for) and so it was really just plug and play. I have had Prime for almost a year, and love it. For about $30 a month I get just about everything, (this includes Amazon, Hulu & Netflix) and so don't have to pay a large cable bill anymore. I highly recommend this product and guarantee that you will love it. It's perfect for those who don't have Smart TV's, for whatever reason. Thanks, Amazon for a year of great service and products, and I hope there will be many more. 1 click shopping is fantastic.", "verified": true, "helpfulness": "1/1", "author": "grindael"}, {"rating": 4.0, "review": "Impression after 1 week - Much better than Roku that I used earlier.  Better than Apple TV in terms of content, remote and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Silicon Soldier"}, {"rating": 5.0, "review": "We researched the apple tv, roku and amazon fire tv and decided the fire tv would work best for us.  Super easy to set up.  Turns on instantly, navigation is a snap, the voice search is awesome!  The box isn't in the way the remote fits nicely in a drawer.  We have no complaints!", "verified": true, "helpfulness": "0/0", "author": "Susan T. Elkins"}, {"rating": 5.0, "review": "I purchased this to help me to reduce my bills and cut Directv. Install was a breeze, and my account info was already installed by Amazon. I bought the Amazon game controller to go with this. It's nice to have everything all in one box as I watch free Prime movies, Netflix, Gaiam, Sling TV. Sling TV doesn't work very well however, I suspect it is not the Fire TV problem, but a bandwidth problem at Sling. All of my other apps work flawlessly. I am not a major gamer, so the games available are ok with me. I enjoy Asphalt 8 a lot.The remote is small and easy to hold. I wish I could get it to work with my Harmony remote, but I can live with one extra remote out on my coffee table.I have the fire stick for my bedroom TV, which works fine as well.", "verified": true, "helpfulness": "0/0", "author": "Ajay"}]