[{"rating": 3.0, "review": "It doesn't really do much for me that my Apple TVs don't do and there's a big thing it can't seem to do correctly. I need it to interface with my Plex server to play movies and TV shows I've ripped off my Blu Ray collection. It can't seem to play the AC3 surround sound, even in \"supported\" MP4s. Sent it back and will continue with the ATV.", "verified": true, "helpfulness": "0/0", "author": "Kevin B. Dooley"}, {"rating": 5.0, "review": "This is great!  I'm off cable now for good.  Super easy to use and really a lot of good content.  If you are a Prime member there are tons of things to watch without charge.Setup could not be simpler.  Plug it in, connect to your network and start watching.With any thing there are errors and this is no exception.  However, the customer service is very easy to use and it is with a live, polite and well trained person - an actual delight to use the support service!", "verified": true, "helpfulness": "0/1", "author": "Michael S."}, {"rating": 4.0, "review": "My biggest complaint is that Prime does not give you nearly enough Prime shows for free", "verified": true, "helpfulness": "0/0", "author": "Samantha Moore \"Sunflowersam\""}, {"rating": 5.0, "review": "I love it!  I mainly use it for Netflix and Flixster but I love that I didn't have to buy one of those 'smart TVs'  it's nice and small and when I hit the button to turn on the amazon fire tv it even turns my regular tv on and puts it to the hdmi channel it needs to be on (talk about making me lazy, LOL)  The remote lets you speak into it BUT you cannot use it when you are in Netflix or Flixster so I wish that was different.  If you speak into it, it will take you to the amazon movies for you to buy them on the amazon tv and I want to buy them on flixster or watch netflix and browse by voice and can't.  Whatever it's no big deal I still love this and wouldn't trade it in.  Oh also for some reason on Flixster I can't seem to buy my movies on their app I have to go on the computer flixster to buy movies and then it shows up right away on the amazon fire tv flixster app after refreshing, don't know if it is what I am doing or not but it really isn't that big of a deal to me since I have a computer too.  I would def. recommend getting this!", "verified": true, "helpfulness": "4/4", "author": "Rachel"}, {"rating": 1.0, "review": "this is by far the worst device i have ever brought into my home did not know u needed deep pockets to own it everything cost money even if u have already paid 99 dollars for the amazon prime membership because their is nothing on it worth watching u must pay per episode anything good found out tonight that u can only have a few apps on the fire tv other wise it will not stream movies unless u uninstall some even ones u have paid for however they are still on your account install when u want to use uninstall when done  what a joke for 200 bucks the fire tv + membership the only thing worth watching is netflixs and that is 7.99 already had could of saved money  only 2 games work with the remote so look forward to spending another 40 bucks for a game controller and by the way the free game that works with the remote takes up to much space so u have to install it when using uninstall when done i cant wait for my refund so i can spend my money else where", "verified": true, "helpfulness": "1/11", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My wife LOVES it! This is a great little product!", "verified": true, "helpfulness": "0/0", "author": "William W. Davis"}, {"rating": 4.0, "review": "Love it my only complaint is I wish one box would cover all TV's in my house. I hate the thought of buying two more so everyone can watch what they want.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 3.0, "review": "\"We're having trouble playing this title right now. Please try again later or select a different title\" is what I get for everything I try to play from Netflix.  So I \"ok\" out and attempt to play again. Repeat. Repeat. Repeat. Repeat. Re... oh! Now it works!  But if not, having to constantly uninstall/reinstall the application or clear the cache or delete the data (all of which work only sometimes) and finally having to reboot the system just so my daughter can watch Tinker Bell is silly. And I use all Amazon Basics HDMI cables so I do not want to hear \"maybe it's your cables\" rhetoric (assuming Amazon would make cables compatible with their own stuff).  Roku plays every title every time. So, FireTV was sent to the bedroom and Roku regained its original place in the family room. Fix it and I'll up the rating to 4 stars and trade places again BECAUSE I really do like the player. Voice Search, Gaming, design, interface layout, the game pad are all very, very nice features.  It's very responsive and feels more refined than other players.  And one night... VOILA!... all the music I'd ever bought from Amazon was available for streaming on the Fire TV! With lyrics!!But what is the USB port for? I ran out of room after installing 3 or 4 games and had to decide what apps to delete to make room for Asphalt 8. I guess that's a coming feature.  Well, when it arrives I will up the rating to 5.  See... an honest review and a couple of carrots.  Go to it!!", "verified": true, "helpfulness": "1/2", "author": "Rod \"diy'er: rod\""}, {"rating": 5.0, "review": "I feel this is the best way to go for someone who has Amazon Prime and will continue to utilize Amazon Prime. The load times for amazon content are lightning fast and amazon content is easy to find. If you ever want to change to Netflix, or have both, you can do that as well. The voice search is something you wouldn't miss if you did not have it, but would if you were suddenly without it. It is fast and accurate. However, I still think Amazon is behind in the App game, but honestly how many apps do you need on your television. This is a device to consume watchable media and it excels at that. Just my two cents, but if I knew I wanted only Netflix I would go with a Roku. I am and will continue to be an Amazon Prime member, so this is the device for me. If you are deep in the Apple game and are invested in iTunes, then Apple TV may be the way to go. If apps are important to you, you also may want to look elsewhere. It depends on whose ecosystem you would like to live in, and for me it's Amazon as I have always had successful interactions with the company.", "verified": true, "helpfulness": "1/1", "author": "GB"}, {"rating": 3.0, "review": "Returned,more of a gaming streamer.", "verified": true, "helpfulness": "0/1", "author": "larry"}]