[{"rating": 4.0, "review": "This is another \"keeper\"/great device from Amazon...excellent voice search, (hopefully it expands to include several other movie apps, eg: Netflix, Hulu, Crackle etc) very good gaming support (thought it's not primarily a \"game-box\", if you bought it for that you may not be satisfied)...The 5GB of space is really eaten up by games that are large in capacity, some response lag playing some games using the game controller...Overall this is one heck-of-a-buy...you should get this...quick", "verified": true, "helpfulness": "0/0", "author": "Mr. Marcus"}, {"rating": 5.0, "review": "Bought this to replace one that was stolen. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The first thing we were impressed by was the packaging. So neat and well designed,  Next it was easy to hook up and get running.  The hardest part was getting the battery compartment to open.  Had to go online and see if I was working with the right latch.  Yupper, I was.  There was a note that said may require significant force.  Right on with that one.  Got a screw driver out and was in business in seconds.  Am sure if the remote is dropped on the floor the battery compartment will not come open unless the pet elephant steps on it. Once got the batteries in, was up and running in a matter of minutes.  No tech head needed for this device just follow the instructions on the screen.We have DSL running at less than 7Mbps down.  Have noticed Fire TV buffering twice in three days of running.  Don't know if that is bad or good but if it happens no more than that, saving $130 and month I can deal with it.  Heck, sometimes Direct TV would lock up.  Other than that pic is great and reception good.  With the Mohu antenna and Fire TV have cut the cord on that TV. (3/15, Tech from the Internet provider came out to check out slow inconsistent speed,  Replaced some wiring now are running 7-8Mbps like we are suppose to. No more noticed buffering.)Wife says going from  antenna TV to streaming and back is easy and she can find what she wants to watch.  She was smiling when telling me that.  A very good sign.  That is the TV she watches the most during the day and no complaints about programming or reception.  A happy wife is a very good thing.The voice search works great.  However, the only thing it seems to find is movies on Amazon and you have to pay for them.  Tried the voice search with Netflix and Hulu and all it did was bring up movies you had to pay for thru Amazon.  Probably one of the best voice activated systems I have tried but I rated Fire TV with a 4 instead of a 5 because voice only works with Amazon and it is pay,pay,pay.  It would be great if it worked with Netflix and the rest of the apps.Have ordered a Roku 3, when it gets here am looking forward to a heads to head comparison because have 3 other TV's to cut the cord  on.3/15Roku 3 arrived and it has been hooked up to the living room TV for better than a week.  It is slightly slower loading than the Fire TV but has more apps/channels than Fire TV.  A far as I am concerned, performance is the same.  They both do a fine job of streaming content with great picture and sound quality.  The Roku is the one I went with for the living room because of the ear buds.  My wife can now crank the volume up to her hearts content while I sleep like a baby in the next room.Ordered a Fire Stick for the guest bedroom. Hooked it up a few days ago and am happy with the product. It is not as fast loading as either the Fire TV or the Roku 3 but close enough to them that I don't perceive it as an issue.  Has the same apps/channels as the Fire TV and, like the other two, easy to install.  The remote does not have voice recognition which is not a problem with us, as mentioned above.  The Fire Stick does not have usb or Ethernet ports as do the Roku and Fire TVAll three products perform well receiving streaming content and delivering it to the TV.  Don't think a person will go wrong with anyone of the products for that use.  ( Can't address gaming, we are not into that.)  If one is not going to be gaming the Fire Stick is a great deal.  If late night volume is an issue, the Roku 3 comes with ear buds that plug into the remote and shuttles the sound from the TV to the ear buds.  If one is a stickler on loading speed,  the Fire TV does load a tad faster and has great voice recognition.  For basic TV viewing all three do a great job for us connected to DSL running at 7Mbps - 8Mbps thru a modem/router.", "verified": true, "helpfulness": "0/0", "author": "rnldlbl \"weber cook\""}, {"rating": 4.0, "review": "Spoiler alert! Great device if you don't have a house full of Roku. The channel offering is dignifigantly less however the resolution is beautiful. An added plus, all of the music I ordered in the past, before iTunes, 785 tunes is available on the Amazon music channel. It occasionally freezes when too many devices are operating in the household.", "verified": true, "helpfulness": "0/0", "author": "Ann Runningwaters \"<--- Recycled Stardust ;)\""}, {"rating": 5.0, "review": "I love this. My grandson as well who is 10 love the games. I have just ordered a controller.", "verified": true, "helpfulness": "0/0", "author": "llabbelle"}, {"rating": 1.0, "review": "I bought this for the option of sling TV as I already have Netflix and Amazon Prime.  What a nightmare and complete waste of time.  I would rather gauge my eyes out than deal with being put on hold endlessly and transferred to departments that don't respond.  After explaining the problem to numerous people  (4) and being told repeatedly to try different ways to log on to Sling TV I simply gave up.  Amazon was unhelpful and time consuming. It's pointless.  There's a problem with Amazon customers logging on to sling TV.  Its up to Amazon to figure it out not me.", "verified": true, "helpfulness": "1/2", "author": "Crispy1"}, {"rating": 5.0, "review": "I've only used it for a few days, but I really like it.  Remote control is easy to use.  I like the variety of selections of tv and movies to watch on Amazon prime.  Seems to be different things than I'm getting with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Mike H. \"Partner, Winter Morning Pictures\""}, {"rating": 5.0, "review": "Love this device for using to watch the Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Milisa"}, {"rating": 5.0, "review": "We love the Amazon Fire. We were looking for an option to help us save money. We were already paying for Hulu, Netflix and Crunchyroll and this allowed us to have more features on our non-smart TV. It is easy to use and my 13-year old figured out really quickly. We have a lot of variety and would like more. We are not to happy with some of the selections, especially the manga channel which my daughter is really disappointed in, since she loves Manga. If Fire TV could add crunchroll that would be awesome.", "verified": true, "helpfulness": "0/0", "author": "Megan Santiago"}, {"rating": 5.0, "review": "I really love the Fire TV. I have been watching Amazion video from my Blu-Ray player and it always took some time to load. The Fire TV is almost instant. The search feature on the remote is a great time saver too.", "verified": true, "helpfulness": "0/0", "author": "Jedi"}]