[{"rating": 5.0, "review": "Loved it! The only thing it needs is a cw app, abc, and cbs app to make it perfect.", "verified": true, "helpfulness": "0/0", "author": "Julie O'brien \"Emalyne\""}, {"rating": 5.0, "review": "This box is everything I thought it would be.", "verified": true, "helpfulness": "0/0", "author": "depotdave"}, {"rating": 5.0, "review": "I am quite happy with Fire TV.As this page does a great job of listing the specs, let me tell you what makes me happy about this device from a usability point of view.Obviously, there is access to all of my streaming video services, such as Amazon, Netflix, Hulu, and WWE Network.  There are so many others, but these are the ones I use.The interface is easy to use and intuitive for the most part, using the included remote control.  The on screen menu boils down to scroll up and down for different menu items, scroll left an right within that menu item.  The remote has a nice solid feel to it.  I had one issue with the remote, and that was getting the back off to insert the batteries.  I had to watch a video on the web to figure it out.  You need to slip a flat head screwdriver up underneath the clip that holds the back on and pry it up and away.The greatest feature about Fire TV for me though is access to all of my cell phone videos on Amazon Cloud Drive.  This is so great, because I am constantly recording short videos of my children on my phone.  On my Android phone, I have Amazon Cloud Photos installed.  It uploads all of my photos and videos to the cloud for safekeeping.  I was very happily surprised to see that I have access to all of the videos.  It was so seamless.  Now I have instant access to my videos of my children on my TV.Overall, this device is small (a good quality), doesn't slide around on my entertainment center, and has the horsepower to handle the tasks for which it is designed.", "verified": true, "helpfulness": "2/2", "author": "Jerry Palmerino Jr"}, {"rating": 3.0, "review": "Not enough app", "verified": true, "helpfulness": "0/1", "author": "Ike Nnah"}, {"rating": 5.0, "review": "Love the Amazon Fire Tv!  Took less than 5 min to install and ready to go forward!  The remote is extremely easy to use and I would recommend it!", "verified": true, "helpfulness": "1/1", "author": "Skye \"Skye\""}, {"rating": 5.0, "review": "I have had mine since Fathers Day and I love it.  Intuitive and creative device.  I chunked the Roku (and I really liked it).", "verified": true, "helpfulness": "1/1", "author": "B. Meyer"}, {"rating": 4.0, "review": "a lot of good movies, easy to use but only a few are free..Still  a great idea..", "verified": true, "helpfulness": "0/0", "author": "Robert J. Miller"}, {"rating": 4.0, "review": "Fire TV is so simple and very user friendly. The trial period was a trick (of course) but an excelent marketing ploy!", "verified": true, "helpfulness": "1/1", "author": "DrGeraldP \"Doctor Gerald\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "James Vejil"}, {"rating": 1.0, "review": "I am giving one star, but I should give none. The screen look cools prior selecting a movie, TV series, etc., but once it runs the image freezes up, and it is like watching a movie on a dialup connection. I thought it was my internet connection, but My Wii console play my Amazon Prime, YouTube and Netflix videos without any inconvenience. I am sending back this product. I am totally disappointed.", "verified": true, "helpfulness": "2/6", "author": "Johnnie B \"Johnnie B\""}]