[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Stephanie L Rodriguez"}, {"rating": 1.0, "review": "Been nothing but a pain since we got it. It had continaully had problems with the remote which amazon sent us a whole new box for. It was a good thing because the box went bad too. So this is a whole new one and we continue to have remote glitches and issues staying connected to the internet. I am returning it for good and getting a new Roku. As Cartman says, \"Screw you guys, I'm going home!\"", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am very interested in your reasons for not including directions for use with your items, including computers, kindle, and fire tv.  Being 78 years old and having learned my computer basics when you had to manually enter info, I am stupid compared to my grand children.  I had no idea you had to pay for most movies.It would be great to have some idea other than what I,'ve seen in TV ads.", "verified": true, "helpfulness": "0/1", "author": "Betty Kreft"}, {"rating": 5.0, "review": "More than what was expected....", "verified": true, "helpfulness": "0/0", "author": "George Barba"}, {"rating": 5.0, "review": "Excellent! I now have so many choices of movies and TV programs to watch.", "verified": true, "helpfulness": "0/0", "author": "E. Rothman"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "IRB"}, {"rating": 5.0, "review": "I love it!  It was easy to set up and the voice command works perfect.  The streaming is great and gives me all kinds of access to my Prime movies!", "verified": true, "helpfulness": "0/0", "author": "Mr. Ozo"}, {"rating": 3.0, "review": "It does all the features as stated.  HOWEVER - What was really disappointing was all the paid options.  All the shows and tv series that we bought this for are mostly \"Rent or purchase\".  That was really disappointing to see as they list this as the endless entertainment... only to find out it comes with more costs.  I would rather not have purchased it.", "verified": true, "helpfulness": "1/2", "author": "John H."}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "Great product. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Danny Bailey"}]