[{"rating": 4.0, "review": "I have the Ruku 3 which blows this away for the same price or less because it has an earphone jack in the remote and has the ability to get more content like Vudu, MLB TV and HBO Go.  Also have Apple TV which seems on-par with this product, even though it was released in 2012.Set-up is a breeze and took me eight minutes to unbox, plug-in and find my wireless network. There is no product registration involved like with Roku. Amazon pre-sets your PRIME account information for you. All you do is find your wireless network and enter the associated password or hook-up to your router via a cable.What I like about this is there is a dedicated closed captioning button on the remote for those of us who are hearing-challenged. The user can set the closed captioning font size which is a huge bonus.The microphone for voice search also works well with Amazon and VEVO content (not available with other content). Navigation via the remote is intuitive with the enter button being located in the middle of the circle where you scroll left, right, up or down. The return, home, backward, forward and pause/start buttons are easy to identify.Picture quality equals the Ruku 3 and is great and video load times for Amazon streaming is fast. Netflix loads slowly.  Kindle Fire HDX screen mirroring is wonderful and is something you should try if you have the Kindle Fire HDX.The introductory video from Amazon is a nice touch and will offer rudimentary information.The rest: very average and I will not repeat the other fine reviews already posted, to date. I wish this were priced at $59 because at $99 it does not seem worth it given the other products on the market today like Roku, Google and Apple. You can't turn the remote sideways for gaming like you can with Roku. Instead, you have to purchase a separate game controller.The Netflix interface is OLD compared to the Netflix interface on the Roku. More of a pain to use in my opinion. Voice search will not work here.There is no option to use a web browser on this device, either, unless you mirror from your Kindle Fire HDX. You can use a native browser with the products mentioned above.This is used just like my Kindle Fire HDX - a portal for Amazon Prime Video. Two years ago, this would have been great. I feel Amazon is a little late to market with this product given the competition.  Nothing new compared to Roku, Apple or Google.  Just another version of an Amazon content portal.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This little box is slick.  I'm a long time user of multiple WDTV Live boxes to locally stream a large media library to numerous tv's throughout the house.  Comparing this box to the WDTV Live is like comparing an iPhone 1 to an iPhone 5s - there is no comparison.Comparing the user interface and speed is no contest.4 stars for now, 5 stars once MLB.tv and HBOgo apps are added.", "verified": true, "helpfulness": "1/3", "author": "Uncle Hoss"}, {"rating": 5.0, "review": "I have all sorts of gizmos and gadgets and this was very easy to set up and everything works great. GREAT! Exactly as advertised.", "verified": true, "helpfulness": "2/3", "author": "JH \"JH\""}, {"rating": 2.0, "review": "UI is clunky, Voice search takes too long as it makes a trip to the cloud and that seemingly beefy hardware doesn't do anything to the games at all - and these are just basic games... Disappointed on this one Amazon along with the hike in Prime subscription fees. Will wait for third strike and I am out of Amazon ecosystem!", "verified": true, "helpfulness": "4/14", "author": "Umesh Shah"}, {"rating": 5.0, "review": "I Love Love this product so far. I think it is better than the Roku Players I have owned. You can even watch YouTube on there. Its great to watch Amazon Video as well. I seriously would recommend this product. Great job Amazon!", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Snappy little box. Smaller than I had thought, but solid.  I cannot say solid with respect to the remote, cheap feeling comes to mind.Primarily dedicated for Amazon content, but I expected that.  Configured with my Prime account and my Netflix account, voice search only searches Amazon content apparently.  Roku (not technically having a dedicated media service) searches all sources for content you want.  Amazon if you are listening, keep the Amazon results on top by all means, but make your searches go through all potential sources at least -- just your installed apps preferably.One disappointment which should not affect many people - I tested just with TuneIn Radio so far:  If you are playing something and turn the TV off (my FireTV plugs into a stereo, which outputs video to the TV), the music pauses.  That is an annoying waste of power if you just want music in the background.  The Roku 3 just pauses then picks right back up playing when the TV shuts off.These two issues are (so far) the only thing keeping me away from 5 stars.  Bear in mind it has been installed for a whole 2 hours or so now!Edit -- added IHeartRadio and it keeps playing after I turn the TV off, so it appears to be an app specific issue.", "verified": true, "helpfulness": "0/2", "author": "Paul S."}, {"rating": 4.0, "review": "This one brought us out of the dark ages. Hoping that some of the streaming that's available through Kindle apps will soon be formated for the TV as well (BBC News & PBS).", "verified": true, "helpfulness": "1/2", "author": "Christafer Sobbing"}, {"rating": 5.0, "review": "This unit was easy to set up, and I loved the introductory information. The unit is small and clean and has the outputs I needed. I required an optical audio out and HDMI video out and this unit has both.The remote is simple and intuitive to use, but best of all is the voice search - no more tapping out titles and hoping that there is no typo. Searches are quick and easy and the voice recognition works well.Mirroring from Kindle Fire HDX works great, although I really would like to be able to bring up an internet browser (maybe a future feature?).Sound is great and picture is beautiful. Amazon did a great job.", "verified": true, "helpfulness": "2/3", "author": "Alan"}, {"rating": 5.0, "review": "Works great out of box, easy setup, needed some updates but it only took 5 minutes to download and install.  We have the ROKU 3, Logitech TV, and BluRay gateway from Sony.  This appears to be faster than all of them.  The voice remote is great.  Have fun.  Trouble finding batteries, they were hidden in the bottom of interior box.", "verified": true, "helpfulness": "1/2", "author": "Edie Shelton"}, {"rating": 5.0, "review": "I have an unusual home theater setup no \"real\" TV.  I have a large movie screen on one wall - video is projected by an XGA (1024x768) projector with a 35' HDMI cable.  That connects to an Onkyo Home Theater 7.2 receiver.  I mostly feed it with a Windows 7 PC running Windows Media Center, a great combination for broadcast TV or DVDs but its a pain using a keyboard when you work outside the Media Center environment.  I had tried to connect up a Roku XD box to my setup to simplify streaming video.  It worked - but everything was a very purple tint.  I tried all the things in the user forums suggested to fix it - none worked.  I saw the splash ad for the Fire TV box on the day it launched - I purchased it with my Amazon Prime account and it arrived two days later.  Nice packaging, very clean and simple.  I disconnected the Roku, and plugged the Fire TV in it's place -using the same HDMI and wired network cables. The first thing after seeing the startup screen (no purple!) is that it wanted to see the remote (which the manual said - can take the AAA NiMH rechargeable batteries I use - a very green plus in my book).  Once it found the remote, it did a software update.  After restarting, it played a welcome video.  After I got out of that, I pushed the button and said \"Dora\" - and it brought up options for watching Dora the Explorer.  I then said \"The Amazing Race\" and it brought up all options for watching it.  Early seasons were for purchase on Hulu Plus.  Two seasons had a Prime stripe on them, but also had purchase prices listed below (confusing to me).  I assumed it was no charge with my Amazon Prime membership and started watching them.  Great video and great sound! I will try and use the optical audio output, but I doubt it will make much difference.  I do wish there was an audio up/down control on the remote, but that's rare in any device nowadays.  Overall, great first impression - great packaging, simple, easy.  Great job Amazon!", "verified": true, "helpfulness": "3/4", "author": "Dale MCATEE"}]