[{"rating": 4.0, "review": "The only reason this isn't rated a 5 star is due to the voice command only working with prime.Anything non-Amazon you are using the remote hunting and clicking. A merger or a software change or add on would fix this.The other issue is with how different movies are released. It is Amazon not the Fire TV though the device works great.The only issue with the remote is that you can't slave your TV remote to turn the power on and control the volume of the TV. Other than that it works great. This might be fixed with a universal remote but I haven't tried and don't care to mess with it yet.", "verified": true, "helpfulness": "0/0", "author": "IOWAHEALZERS"}, {"rating": 4.0, "review": "Better than roku", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 5.0, "review": "This is a neat little device.  It was beautifully packaged, easy to install and set up and works VERY well.  Amazon has it nicely integrated with their services as well as other companies.  Highly recommended...", "verified": true, "helpfulness": "0/0", "author": "Leland C. Sheppard"}, {"rating": 5.0, "review": "I really like how easy this is to use.  the remote and the unit seems to be made of great quality.  I especially like that it came already set with MY specific information.  This is a very good idea for a constantly updated source of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Faboulus", "verified": true, "helpfulness": "0/0", "author": "Carlos Penaloza Martinez"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Droid69"}, {"rating": 5.0, "review": "Excellent device!  I just love it.  The best thing I've ever ordered next to my kindle fire and my Amazon prime membership.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Was very easy to set up really enjoy this. Who needs cable?", "verified": true, "helpfulness": "0/0", "author": "Penny"}, {"rating": 5.0, "review": "Order  it for my husband  to put in  his man cave  he love it.", "verified": true, "helpfulness": "0/0", "author": "Tracey Wallace"}, {"rating": 5.0, "review": "I have a Google Chrome cast and an amazon fire tv. The fire tv blows chrome cast away.", "verified": true, "helpfulness": "0/0", "author": "Randolph Hostetter"}]