[{"rating": 3.0, "review": "I like the amazon TV, I really do. It's really fast and I use it to watch Netflix and Youtube all the time. However, I do have one really big con about the device. So one of the major features that it possess is voice searching. However, voice searching only works Amazon Prime movies. This means that for everything else you would need to type using the remote which is as tedious as it sounds. So if I was on Youtube trying to learn how to make chicken noodle soup and I try to use the voice search, it would give me the tv show Chicken Soup for the Soul available on Amazon Prime, which may be good, but totally not what I wanted. I would like to see Amazon implement voice typing for all situations that require typing. Obviously the technology is there where it recognizes what you say, now just allow us to use the text in other apps.", "verified": true, "helpfulness": "3/3", "author": "Hai L. Huang \"Highleon\""}, {"rating": 2.0, "review": "Pretty awesome at first, works great. But after about a month all apps begin to freeze all the time. Netflix shows freeze up and buffer constantly. Hulu stops working regularly. Other apps as well. Roku or Apple TV are probably better options. I stupidly bought two of these with the same issues on both. Even tried at my family members homes.", "verified": true, "helpfulness": "0/1", "author": "Gentry"}, {"rating": 5.0, "review": "I have enjoyed Amazon Prime for two years and am loving it even more with my Amazon Fire TV.  It's so easy to setup and use, and I really like the voice activated remote.  We are watching great movies and TV programs on our big screen TV.  Just like going to the movies without leaving the sofa.  Thanks, Amazon, for another wonderful product.", "verified": true, "helpfulness": "0/0", "author": "L. Shabinaw"}, {"rating": 5.0, "review": "Very happy thus far, I think being a Prime member is a necessity though - you get access to tons of great movies and shows with it that I don't think you'd get otherwise.  Never had another streaming device to compare it to, but I think it's a great product. And if you're already a Prime member, don't even think of buying Roku or the Google Chrome Stick thing.  Your Prime membership is your ticket to getting access to tons of free stuff.", "verified": true, "helpfulness": "0/0", "author": "Brian Szczechowski"}, {"rating": 5.0, "review": "If you have a surround capable sound bar the optical out of this unit is the only way you will get real dolby input to the bar. Roku dropped optical so doesn't work. And the unit is so much faster than roku 3.", "verified": true, "helpfulness": "0/0", "author": "Rwik Sengupta"}, {"rating": 4.0, "review": "So far I've had no issues with Amazon Fire TV. It was really easy to set up, and I've become quite addicted to it. It'll be midnight before you know it! The voice recognition through the remote is very cool, and has worked every time (so far). I do wish more movies were available with Amazon Prime, though. Also, sometimes when you're scrolling through it's hard to tell immediately which ones are available through Prime and which ones aren't.", "verified": true, "helpfulness": "0/0", "author": "D Batchelor"}, {"rating": 5.0, "review": "I am so enjoying watching movies and tv series with Amazon Fire TV.  It was very easy for me to set up and had it up and running in a matter of minutes, the download took longer than the actual setting up, but that's only 'cause my network was running too slow.  All told, it probably took less than 45 minutes for me to start watching videos.  Now I just need to buy the controller so that I can play games.  Received this as a gift and it's one of the best gifts I've ever received.", "verified": true, "helpfulness": "0/0", "author": "Crystal Bleu \"Elena B\""}, {"rating": 4.0, "review": "Really enjoying my Amazon Fire. It's easy to use and my photos look great on the bigscreen. I have no problem using the voice to search for favorites. I would like them to expand and offer some streaming TV channels. Also, since I have a number of the Great Courses in their digital library, I would love to view them on an app for Fire TV. I got my Fire TV on a deal of the day and it was well worth the cost!", "verified": true, "helpfulness": "0/0", "author": "F. Patterson \"WanderWoman\""}, {"rating": 5.0, "review": "Works great! I am so not a techie and was a little worried about the setup but it couldn't have been easier! Voice commands work just as reviewers said.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 2.0, "review": "The interface is great.  The footprint is perfect.  The Netflix application is so much better than the offering on Roku.  All of that said, the following really hold this device back:1) The small amount of storage and seemingly the lack of ability to expand thru the unused USB port2) In my experience the remote tends to register a double press very often when you have only pressed once3) The game controller suffers from a similar issue as the remote - seemingly drunken controls when trying to play a game.Until the above issue are fixed, I would say this otherwise awesome device is not yet ready for full-time use in anyone's living room.", "verified": true, "helpfulness": "1/2", "author": "B. Hare \"Hareball\""}]