[{"rating": 5.0, "review": "Best media streamer. Over all more useful then Ruku, WDTV, Co-Star and the other Google TV Boxes.  Biggest feature is the Plex Player.", "verified": true, "helpfulness": "0/0", "author": "Scott FitzGerald"}, {"rating": 5.0, "review": "the very best thing is that it does not buffer or shut off like my HD roku did. Only drawn back is control not as simple as roku or could be me.", "verified": true, "helpfulness": "0/0", "author": "G. D. prater \"prove it\""}, {"rating": 5.0, "review": "This is a great product.  Streaming has never been easier, and the voice command works great!  Easy set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 4.0, "review": "NO HBO GO !......that would get it 6 stars. Fast, easy to use,  easy to set up but the omitting of HBO GO is glaring", "verified": true, "helpfulness": "0/1", "author": "louis b murray"}, {"rating": 4.0, "review": "Setup was a snap. The interface is clean and easy to understand. Unfortunately there's no content available in Canada at this time so its use is terribly limited for the present.", "verified": true, "helpfulness": "0/0", "author": "Thomas Glover"}, {"rating": 4.0, "review": "Easy to use with lots of features.  Just need more content.  The voice search makes it very easy to find content that is available.  Can't wait for other vendors to utilise this feature.", "verified": true, "helpfulness": "1/1", "author": "Andre Cato"}, {"rating": 4.0, "review": "Very useful. Many old and new movies. However, the prices for  TV series and movies should be less. Prime clients should be charged les or no no cost, that's why we joines prime....The box is very easy to install.", "verified": true, "helpfulness": "1/1", "author": "Drb"}, {"rating": 4.0, "review": "I'm very impressed with the product.  There are two things conspicuously missing.I have a ton of music in the Amazon cloud.  Why is it not accessible through FireTV?It is quite difficult to connect this device to a hotel WiFi network.  Roku exposes the device's Wifi MAC address which can be used in lieu of a web browser to call in and get the device authorized on a hotel network.  Either a web browser or exposure of the Wifi MAC address would be most welcome.  At present my work-around has been to discover the MAC by connecting it briefly to the hotspot on my phone, write it down on a piece of paper and affix it to the device with a bit of sticky tape.", "verified": true, "helpfulness": "1/1", "author": "timInAZ"}, {"rating": 5.0, "review": "Excellent, it was a gift for my dad and he loved it. I cant complain. Excellent product! High quality! Thanks", "verified": true, "helpfulness": "0/0", "author": "Jessica Nunez"}, {"rating": 1.0, "review": "There are nice things to say about this device and some not nice things to say. Oddly, Amazon reviews and website reviewers seem to only focus on the positive. I am here to help others sort through the marketing propaganda and make an informed decision.So the device has nice specs. Though this is largely due to being the latest and greatest. 6 months down the line somebody else will have more horsepower in their technology. Regarding streaming, I do not see any appreciable improvement over other streamers. And how could it? I have used a number of other streamers and they all work great--it's the internet service that most often is the issue in streaming problems. So the device is merely average in terms of streaming functionality, but it sorely lacks apps which others have--dropping it to a below average streamer.The device plays games. That does separate it from the streamer pack to some degree. It performs like a fine Android gaming phone, though it is obviously not competitive with console, PC, or SteamOS games. So if you are into fun little casual games and do not need top quality, this makes sense for you. Having said that, there are other alternatives: Ouya, GamePop, Mojo, Game Stick, Nvidia Shield, and numerous other Android microconsoles. Not to mention the soon to be released Playstation TV and Google set top box. The FireTV doesn't stand out from the crowd, in fact the limited game library probably relegates it to below average status.A saving grace for the device is the access to Amazon Prime. Some devices simply forego such access. However, Amazon nearly screwed that up by making it difficult to find Amazon Prime content which is free for members. They have made concessions in this regard, though it is still not great. Which brings up another point, the menu is poorly designed. It just is. Amazon could have used the FireTV to help keep Prime members, but it won't keep me.The FireTV outright fails in one area. As of yet, there is no way to play your own music locally. I mean Amazon hasn't even created a way for you to play music you purchased from them. Then there's the music you might have bought from iTunes or on CD, etc.. This is a media streamer which can't play music outside of a few apps like Pandora and such. That is unthinkable. Totally unacceptable. This is a basic functionality which Amazon clearly fails at. I have a huge issue with Amazon touting a USB port in there specs. There is no USB port--the port can do nothing. However Amazon wants to feign USB functionality to prevent customers from choosing the Roku 3 instead. I have purchased plenty of my own movies and music which I would like to put on a USB drive and watch on TV. I CAN'T DO IT WITH FIRETV, and that is a joke. The fact they are claiming a USB port in the specs is outright fraud.So to sum it all up. Ignore the guerrilla marketing campaign. The device is a below average media streamer due to lack of apps. A below average micro game console due to lack of library. It outright fails as a media device due to its inability to play local movies and music via USB. If you are interested in a small number of casual games, only need a couple of apps, and have no need for USB support to playback movies and music... then this is the streamer for you. And judging by the Amazon reviews, there must be a lot of those people out there ;)", "verified": true, "helpfulness": "6/17", "author": "P. Graves"}]