[{"rating": 5.0, "review": "This is by far the best  interface out there!  (We have Amazon Fire, Roku, and Apple.)The remote is RF remote instead of IR -- which means you don't have to point it at the TV for it to work.It has 10 sec forward and rewind. It's easier and faster.You can also locate shows with voice activate and one button push.The best!Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "K Day \"Day8\""}, {"rating": 5.0, "review": "First let me say I love this thing. However things that were promised aren't there yet... One of the biggest reasons for the purchase was freetime for the kids which was promised by springtime?  What happened I mean they have parental controls which prevents from kids buying stuff but that also means they can't watch anything without me putting in the password. Extremely annoying.!! Please fix that or get freetime up and running. I would definitely change my  stars to a 5 then.UPDATE11/16I love this device but it's seriously lacking in one department and that's storage...when will a storage device be created or when will we be able to add a hard drive?UPDATE3/30I re-fell in love with my AFTV.  THANK YOU AMAZON YOU HAVE SUCCESSFULLY MADE A LOYAL CUSTOMER FOR LIFE!!!!!!!Now that it has the capability to add a hard drive to it without rooting the device, and adding other BT devices.  This device has hands down wiped any and all media players!  Good for you Amazon.", "verified": true, "helpfulness": "3/4", "author": "Gregory J."}, {"rating": 5.0, "review": "Easy to use! I was unsure if the voice command feature would work but it works great!We have hulu, prime & netflix- it's cheaper than cable and the choices are endless! I recommend this to anyone ready to get rid of cable but still enjoy movies & tv.", "verified": true, "helpfulness": "1/1", "author": "A"}, {"rating": 1.0, "review": "I swear all these great reviews are bought and paid for by amazon. This Fire TV has so many bugs. Every app has bugs including Plex and Youtube. Searches get stuck. Video with great internet connections get hung up.", "verified": true, "helpfulness": "5/18", "author": "ZebFullmer \"zf\""}, {"rating": 3.0, "review": "Because the device is Android, there's lots of compatible software already.  However, because it's sandboxed, the utility vs its potential is very limited.  Amazon's artificial limitations of the device and its accompanying software directly reduce my engagement in the product.  If they want to fix this problem, Amazon should make available for all Android phones and tablets the same software  they use on their Android-based \"Fire\" tablet to enable content-flinging from that vast universe of established hardware.  As it is, it's okay for the kids and not much more.", "verified": true, "helpfulness": "2/3", "author": "R. Harmon"}, {"rating": 5.0, "review": "I've used all the little boxes out there, and this thing is the slickest.  Very quick and responsive. Fun to use.", "verified": true, "helpfulness": "0/0", "author": "Josh Chudnovsky"}, {"rating": 5.0, "review": "Set-up was easy as can be and everything I have watched has looked great. Perfect choice if you are an Amazon Prime subscriber.", "verified": true, "helpfulness": "1/1", "author": "Book Lover"}, {"rating": 5.0, "review": "I already had a Google Chrome but was frustrated by not being able to view Amazon Video on my TV. This also doesn't take as long to fill the buffer. I'm impressed.", "verified": true, "helpfulness": "0/0", "author": "Billie too"}, {"rating": 4.0, "review": "The box is very easy to hookup and use is extremely easy.  It is great to be able to see the shows and movies from Amazon on the big screen!", "verified": true, "helpfulness": "0/0", "author": "glassln"}, {"rating": 5.0, "review": "I have been searching for a content streaming device that will play my 1000+ collection of MKV's, Mp4's and other misc file formats.  XBMC is my go-to media player and up until now, I have always run full blown HTPC's at each TV.  While this was an effective approach, it was not very efficient.Fire TV has a fantastic interface, great voice recognition and it comes with the native ability to load Android Apps on the device without having to jailbreak or root it.  Installing XBMC was very simple and it works flawlessly.I am looking forward to replacing a house full of HTPC's with Fire TV's.", "verified": true, "helpfulness": "2/2", "author": "Sparks Family"}]