[{"rating": 1.0, "review": "Had to return operating system was too difficult to use and I am a software programmer! Have Apple tv much easier to use was very disappointed love all the Amazon product but this one needs work before releasing!", "verified": true, "helpfulness": "1/12", "author": "Colleen CM \"Colleen\""}, {"rating": 5.0, "review": "This tiny box has changed the way I watch TV.  It was so easy to set up and the voice recognition is awesome.  It never hangs or buffers or drags like my laptop did.  I regret not buying this 6 months ago.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fire TV is the best investment I've made this year.  This thing is great and it is so fast!  I don't hardly watch Apple TV at all anymore except when I want to watch Netflix.  Fire TV's Netflix interface is not the best.  Other than that I love it.", "verified": true, "helpfulness": "0/0", "author": "minhawaii"}, {"rating": 5.0, "review": "Great product!  We use it every day.", "verified": true, "helpfulness": "1/1", "author": "Jeanne L. Smith Anderson"}, {"rating": 5.0, "review": "Amazon Fire works better than advertised.", "verified": true, "helpfulness": "0/0", "author": "the product truther"}, {"rating": 5.0, "review": "Another marvel of technology.  It replaced my Apple TV, the microphone search option is a big improvement.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the Fire TV.  Very easy set up.  The voice control works as advertised.  Great to use, just say what you want and there it is on the screen.  I also have an Apple TV device but thine the Fire is a bit better.  Would recommend this very highly.", "verified": true, "helpfulness": "1/1", "author": "Susan O'Connor"}, {"rating": 5.0, "review": "It works very well, very good image and sound, options to turn the captions on with a choice of font sizes, convenient remote,no pauses for \"buffering\", overall a very good product!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like the Fire and the voice search is great.  My only qualm is the lack of some movie apps they need to get really fast.  No Vudu yet which is disappointing and there are several other movie apps they could add.  I am waiting for Vudu.  I think it will get better.  Other than that, the fire works really well and very easy to use.  We use it alot!", "verified": true, "helpfulness": "0/0", "author": "Connie Lubonovic"}, {"rating": 5.0, "review": "Amazon fire TV does everything it advertises flawlessly. With Amazon prime there is a lot of programming free of charge. But any new or recent programming you pay for, whether through Netflix or Amazon. Still beats cable. I do wish they had a headphone jack on the remote like Roku.", "verified": true, "helpfulness": "0/0", "author": "Sonjco"}]