[{"rating": 4.0, "review": "Amazon Fire TV is a great device.  It allows our family to access all of our favorites, Amazon Prime, Netflix, Pandora, etc.  The only downside is that you cannot use the device to access an internet search engine.  I would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Jason McCraw"}, {"rating": 5.0, "review": "Excellent product. The search feature is excellent.", "verified": true, "helpfulness": "0/0", "author": "Chris Brandaberry"}, {"rating": 5.0, "review": "Just beginning to navigate the world of Amazon Fire TV, tremendous volume of options and possibilities.", "verified": true, "helpfulness": "0/0", "author": "Paul O'Mara"}, {"rating": 5.0, "review": "Lots of shows to watch for free.", "verified": true, "helpfulness": "0/0", "author": "MaLorraine \"malorraine\""}, {"rating": 5.0, "review": "I am impressed with the video quality over another on line video provider I previously had. I was a bit confused as to where the power button was, and I waited while not using it and it did power itself off as I guessed it would. I did have to unplug and plug it back in a few times during the initial setup, and I thought there may be something wrong. It finally updated and fired up, and has worked flawlessly since.", "verified": true, "helpfulness": "0/0", "author": "Brian M."}, {"rating": 1.0, "review": "Could not use my Ipad to mirror it on the tv. So I returned it", "verified": true, "helpfulness": "1/4", "author": "Dax H F Vieira"}, {"rating": 1.0, "review": "Giving this one star where previously I loved the device and would have given it five. Our home has two and they've worked very well for us and both are connected to our Prime account. I'm giving it this one star review because Amazon has seen fit to add a giant ad at the top of the screen that is visible when you're at the home screen. None of the screenshots on the product page show this newly added ad. If they've added a giant banner ad to the home screen there might be others and they might add more in the future.The ad is a quarter if not more of the screen in height and is nearly the full width of the display. The content of the ad was for a show but to me the content is irrelevant. There are ads now showing up for a product I've paid full price for and I pay for the service to access content. Neither has been discounted to me in exchange for filling my screen with ads.I checked the settings and there is no opt out option for ads even with a connected Prime account.", "verified": false, "helpfulness": "5/7", "author": "Michael Stack"}, {"rating": 5.0, "review": "Goodbye Roku.  Hello new BFF!", "verified": true, "helpfulness": "0/0", "author": "Katona Lofton"}, {"rating": 5.0, "review": "It's amazing.  Love it. So many movies.", "verified": true, "helpfulness": "0/0", "author": "Karen Urena"}, {"rating": 5.0, "review": "Good bye to cable TV forever!!!", "verified": true, "helpfulness": "0/0", "author": "darrel"}]