[{"rating": 5.0, "review": "Works great, better selection than Netflix,nice and small too.Love the voice search option", "verified": true, "helpfulness": "1/1", "author": "AIR Mom TC"}, {"rating": 2.0, "review": "Visually the Fire TV is very impressive.  Navigation is okay.  Maybe because I'm new at using this but it isn't always clear to me that I am or am not paying for something.  What I am not impressed with is that this advertises that it has Netflix but it doesn't work.  The icon for Netflix is there but when I click on it I see a description page like I am going to \"buy\" it.  When you click on the free button I have to put in my pin (I guess because I set that up when I installed the box)...then it goes through the nonsense of \"validating\" my pin only to tell me there is an error that I have already bought this and that it should download shortly.  Not sure how long shortly is supposed to be but it has been days.Shame on me for not reading the feedback when I made this impulse buy.I'm not much of a gamer.  I found most of them repetitive and boring after a while.  But I thought I would give it a try.  It came with two free games and they are certainly okay.", "verified": true, "helpfulness": "2/4", "author": "Robert Notman \"Bob\""}, {"rating": 4.0, "review": "Cant think of any complaints other than the repetitive user interface, lack of 4K support, and lack of voice searching within or across downloaded apps.Other than that, it is a great device that not only is the best-looking streamer available, but best performing one. The bluetooth remote is something that I've only seen on the PS3 before and seriously missed in other streamers such as the AppleTV. The I/O on the device is exactly what should be on a streamer, no more, no less.Currently, the Fire TV is the gold standard in the streaming world, but don't expect that to last. The need for streamers in the future will be minimal with casting from android/ios devices built directly into TVs via android TV. The move to devices whose remote is optional is the way of the future so devices like the Fire TV, even though new, are on the way out. I expect the lifespan of this device to be at most 6 years.", "verified": true, "helpfulness": "0/0", "author": "Joseph Ruane"}, {"rating": 4.0, "review": "I bought this Fire TV to replace the existing network streaming player at home, and at the same time utilizing the PRIME membership I am having with Amazon. So my review won't cover any comparison to others (e.g., Roku, Apple TV etc).However I have also tried Netflix and Hulu Plus in Fire TV, the video playback is not as fast as the Amazon instant video content, need little buffering time. Based on my user experience, I like Netflix more. Hulu injected advertisement before the playback which I really dislike it. But to choose between Amazon instant video, Netflix and Hulu, it really depends on your watching needs and I suggest searching Internet on the comparison for your decision.After using for a week, this is what I have discovered/experienced.Likes:- Fast boot up and smooth user interface- Auto detect my TV resolution (1080i) and adjust accordingly- Voice search working nicely for Fire TV contents (but not other apps)- No longer need to point remote control to Fire TV, since it's bluetooth paired- PRIME Videos: All the PRIME eligible videos are now grouped in single place (saw old reviews that it was a pain last time)- Amazon Music: My CDs purchased also available for playback immediately here- Amazon Music: Auto display lyric while I'm playing the song, that's coolIssues:- Apps: Missing iOS app for Fire TV remote- Apps: Youtube search results screen, back button not working. Anyway this is YouTube app problem.- Stream local network media: PLEX won't help much as media player, don't waste your time and money on that- Stream local network media: Dolby Digital Plus only supported in MP4 container, so MKV/AVI etc won't play properly (workaround covered below)Because most of the reviews don't talk about streaming local media stored in your NAS, I think it'll be good to cover here. My setup:  Fire TV (HDMI and optical) -> Onkyo Reciver -> Onkyo Speakers (optical) & Toshiba TV (HDMI)Fire TV is connected to same LAN as my NAS that stores my videos.If you search in the Internet, most results will recommend installing PLEX server in your NAS (or Windows PC), then purchase the PLEX client at Fire TV (take note it costs $4.99, and no refund allowed). I tried and wasted two nights, with disappointing output. My issues:- Dolby Digital Plus/DTS audio direct passthrough not working, when video is not in MP4 container- With transcoding on, full 1080p HD videos unable to playback smoothlySearch around and found XMBC (will be renamed to Kodi soon), that actually solved all my problems. However, this is not natively supported in Fire TV app store, you have to follow the steps in link below to install the app.http://kodi.wiki/view/Amazon_Fire_TVOnce you have Kodi up and running, that's it and your local media contents can be played smoothly with audio!", "verified": true, "helpfulness": "2/2", "author": "Wayne"}, {"rating": 1.0, "review": "Very disappointed in the fact that I can't stream from my media server nor can I attach an extrenal USB drive with my movies, photos, music, etc. already preloaded. Why would Amazon put a product out that can't meet consumer's expectations and previous experiences with the competition's devices?", "verified": true, "helpfulness": "7/10", "author": "ChrisInCO \"ChrisATLGA\""}, {"rating": 1.0, "review": "I have your run of the mill Vizio smart TV with its extremely limited number of apps. I decided to expand my options with the Fire TV.  I like its responsiveness, sleek look, and quality of images for movies and TV shows.  Of all TV streaming devices I felt like the Fire TV was the one for me.Well, earlier I got a notice from my ISP that I had gone over the 250GB monthly limit.  I've always maintained a platonic relationship with my ISP.  Always making sure to never overstep my bounds.  I knew I kept a good distance because the most data I've used was 170GB.  So, after I get the notice, I go to examine the daily usage monitor and what do you know...the usage kicks up the day I hooked up the Fire TV.THIS IS IMPORTANT: Apparently the Fire TV continues to use up your data when you're not using it.  The unit doesn't have a power button so the only way to turn it off is to unplug it.  Amazon says it'll go into sleep mode when not in use.  Well the Fire TV may be \"sleeping\" but it continues to download and upload software.  WTHThis is terrible.  This device had so much potential.  I loved the Fire TV and was faithful to it these past two weeks only to find out it had been sleeping with my ISP when my back was turned.", "verified": true, "helpfulness": "20/23", "author": "Spiral500"}, {"rating": 1.0, "review": "Outraged at the fact that I purchased this and when I received it , I found out from Amazon it does not work in my country", "verified": true, "helpfulness": "4/15", "author": "Andre Kerr"}, {"rating": 5.0, "review": "I purchase my first Fire Tv box my family love this box so much I bought another Fire Tv box. GOOD BYE  Apple Tv boxes I found something \"BETTER\"... XBMC, NETFLIX, VEVO etc. works FLAWLESSLY. Fire Tv run circles around Apple Tv, G-Box MX2, and all other Media Player out their. Fantastic Speed, Awesome Picture Quality 1080p works GREAT!!! I Highly Recommend This Fire Tv.", "verified": false, "helpfulness": "0/1", "author": "Houston,Texas TRACEY"}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/1", "author": "msalnahdi"}, {"rating": 2.0, "review": "Not what I expected.  The remote is running too fast, ie jumps over movies and apps I am trying to access.  Paswords and usernames are almost impossible for and older man.  I realze it's not your fault but I am trying to give up cable but apps want me to get permission from DirecTv, not to mention some of the apps like Spotify are not the usual app I have on my computer.  In other words, I'M NOT HAPPY.", "verified": true, "helpfulness": "0/5", "author": "James Louderback"}]