[{"rating": 3.0, "review": "Setup into my home theater system was not a good experience as Amazon doesn't account for that in its instructions especially if you are not a techie. Contact with Customer Assistance only resulted in losing all sound on my tv home theater system. Had to get the Geek Squad to come and save the day. Amazon needs to address this scenario as I know I'm not the only non-techie with a home theater.", "verified": true, "helpfulness": "0/1", "author": "MickyD"}, {"rating": 3.0, "review": "its a small compact lil thingy-super easy to hook up and make stuff on my tv-not really sure what its supposed to do by itself with just amazon to use-it all costs money-rent everything there is to watch-but there is plenty of stuff to watchif you go thru apps available there is more stuff to use and get for free -plenty more-but hooking up a computer to your tv will get the same things to happenso far using it thats what ive come up with-my opinion/experience only and im sure there will be plenty of feedback different than mine-the point is it dosnt come with any type of manual or instructions just whats loaded on the lil box when you get it and they have books written by people other than amazonians that tell you how to become a master at using this device but they also charge for those tooI dont believe ill return or get rid of this black box I have now but I will have to pay attention to what others are doing to get more out of it", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 5.0, "review": "This has been a great acquisition, had already had experience with other brands, but this takes the prize is excellent, I loved the teimpo d entrefa also was excellent, as the seller had promised, the cost-benefit ratio I left gained very usefully, I am very happy.", "verified": true, "helpfulness": "0/0", "author": "Maximo"}, {"rating": 3.0, "review": "the device is working. My kids do not find movies or games that are interested them to them.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Excellent product. Very user friendly!!", "verified": true, "helpfulness": "0/0", "author": "Thomas N. Tilden"}, {"rating": 5.0, "review": "Despite Amazon's failed attempts at ALL consumer electronics (I'm looking at you kindle HD fire and fire phone), they really hit a home run with this device. It is super fast with an easy to use layout. I got this after my Roku started having problems maintaining a connection to the stream. Once you switch from a Roku, you will be blown away at how fast and easy it is to use. It has excellent voice recognition integrated into the remote that makes searching effortless. More and more apps are available- I just downloaded HBO go (so my Roku is now officially a relic).One problem is that the down button on the remote has become much less responsive after 6 mos of use so I hope this doesn't need replacing.", "verified": true, "helpfulness": "0/0", "author": "Ipomo"}, {"rating": 4.0, "review": "Very good interface, integration with prime. Only negative is the catalog -- seems like most anything I want to see comes up pay-per-view rather than free, even very old movies.", "verified": true, "helpfulness": "0/0", "author": "bpm"}, {"rating": 3.0, "review": "Frustrating. Let's start with the basics. It took 15 minutes to put in the remote batteries. Google it and you will see actually posts where people are asking how to do it.During set up, it has asked me for my wireless password 4 separate times. And now I am watching the instructional video again because it keeps taking me to the video. All I want to do is watch a movie!Finally up and running but set up should have been easier - and, for the record, I work for a tech company so I know how to work with this type of stuff.", "verified": true, "helpfulness": "1/1", "author": "Paul Courter \"Paul Courter\""}, {"rating": 3.0, "review": "I have all apple products....it did not work with my current apple products", "verified": true, "helpfulness": "0/1", "author": "Haveatake"}, {"rating": 5.0, "review": "I purchase the Amazon fire tv stick first, I didn't like the setup so I purchase the Amazon fire console. It was easy to setup and the best thing is the voice activated search feature.", "verified": true, "helpfulness": "0/0", "author": "Mario"}]