[{"rating": 2.0, "review": "Amazon Fire TV is a good, reliable product that is easy to hook up and operate. BUT, the Amazon Prime membership, which is required to use Amazon's capabilities, is just their gateway to get you to spend even more money on new movies, shows and anything more recent. The free programs and movies they offer are pretty much the same as all the other streaming companies and will charge you to watch the new stuff. If I knew this I would have never bought this for my household.If you do a lot of online shopping in order to take advantage of the Prime benefits then this is for you. Otherwise, look at the competitors to see who offers the best item for you.", "verified": true, "helpfulness": "0/1", "author": "Jeffery H. King"}, {"rating": 4.0, "review": "LOVE IT-The only negative is that I have to scroll through Home \"list\" then settings to power off unit. Other than that it's awesome and kicks Apple TV's butt!!", "verified": true, "helpfulness": "0/0", "author": "Real Life Byron"}, {"rating": 4.0, "review": "This is a very good appliance.  I figured more of the old movies would be in the prime section though.", "verified": true, "helpfulness": "0/0", "author": "Robert Bruce"}, {"rating": 5.0, "review": "Voice command remote is very accurate. Although would be nice if it searched in the apps like Netflix or Hulu. Very pleased with the speed and looks of the unit. I bought the TV mount which is behind the TV so we see nothing and still the remote signals accurately.", "verified": true, "helpfulness": "0/0", "author": "J. Innocenti \"FPS\""}, {"rating": 4.0, "review": "As a devoted reader I'm not inclined to s pend much time watching movies and TV series.  I also have a hard time understandind some of the whispered dialog which may be due more to my 73 year old ears than to the device.", "verified": true, "helpfulness": "0/0", "author": "Farmer Bob"}, {"rating": 1.0, "review": "not able to hook up to cable system, hdmi on one tv only, rest are not, cable is network surround set up and cannot figure out how to install the box to the internet without a separate router.", "verified": true, "helpfulness": "1/3", "author": "LLD"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "gerard scannell"}, {"rating": 5.0, "review": "Solid, responsive, and works well with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Brian McCarty"}, {"rating": 5.0, "review": "This is awesome. just love it can see so many things way better than just cable.", "verified": true, "helpfulness": "0/0", "author": "Ann \"sew fun\""}, {"rating": 5.0, "review": "Love it!  We have used it almost everyday since we hooked it up!  Super easy to use and great value!", "verified": true, "helpfulness": "0/0", "author": "Carrie Brooks"}]