[{"rating": 5.0, "review": "Super fast and awesome UI!", "verified": true, "helpfulness": "0/0", "author": "shanky"}, {"rating": 5.0, "review": "its awesome!! so much better than cable, I turned my cable box in, movies were way to expensive and I was sick and tired of all the commercials on cable. Lots of FREE shows, movies, and comes with all your favorites youtube, netflix, news and sports apps and much much more!! Like I said way better than cable, its AWESOME!!", "verified": true, "helpfulness": "0/0", "author": "mrad_metal"}, {"rating": 5.0, "review": "i am glad i got it works grate love it", "verified": true, "helpfulness": "0/0", "author": "James R."}, {"rating": 3.0, "review": "Thought there would be more free movies", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 1.0, "review": "It stopped streaming the day after it arrived. I spent over an hour with customer service just to have them tell me it will take a week to get figured out. It's been 13 days and I've received nothing. It's still broken. And I'm still out $70. Good day to you Amazon", "verified": true, "helpfulness": "3/5", "author": "joseph castagnola"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Marcus"}, {"rating": 4.0, "review": "I want to buy one, but one thing stops me. The Bluetooth remote system. I may be in the minority here, but I have most of my equipment out of sight and use a UHF radio Universal Remote to control everything in my AV system with just one remote control unit. The remote transmits via UHF to an infrared emitter in the equipment closet. So, since I cannot use my Universal Remote to control the Fire TV unit, I will have to use multiple remote controls which is what I want to avoid. So, if Amazon would make model of the Fire TV with an infrared remote instead of the Bluetooth, or make a unit that has both, I would buy one in a minute.One other feature I would like to see is compatibility with Windows Media Player for streaming music.", "verified": false, "helpfulness": "1/1", "author": "David S."}, {"rating": 3.0, "review": "Do not buy it if your main streaming app is Hulu plus. They are not compatible. It works fine on all other apps I've tried. Read other reviews about compatibility issues.", "verified": false, "helpfulness": "0/0", "author": "Bradley Frago"}, {"rating": 5.0, "review": "Exelent!!", "verified": true, "helpfulness": "0/0", "author": "Geovanny Orellana"}, {"rating": 4.0, "review": "Only installed 2 days ago but so far am very pleased. Will probably be 5 star after some use. Hook up very easy!", "verified": true, "helpfulness": "0/0", "author": "JAMES D BUTLER"}]