[{"rating": 5.0, "review": "Easy to set up and tutorial was great", "verified": true, "helpfulness": "0/0", "author": "claudia mcgilvray"}, {"rating": 4.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "RK"}, {"rating": 4.0, "review": "Not sure about  free and not free", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, just don't use it much.", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 5.0, "review": "Great improvement over my ROKU. I don't know why I waited so long to change....", "verified": true, "helpfulness": "0/0", "author": "Bob Furton"}, {"rating": 5.0, "review": "Great for being able to watch something other than free digital T.V. We wanted more channels to watch at the lake, which is far from the city, and this works great for us. The NBC app is not that great (it loads way to slow & buffers constantly), but that's the only app we've tried & didn't like. Great bang for the buck! Thank you Amazon!  FYI, Having Amazon Prime is a bonus because you get more apps for free.", "verified": true, "helpfulness": "0/0", "author": "T. Hess"}, {"rating": 5.0, "review": "Excellent  for on the go (mobile  phone) & the Internet! !!!!", "verified": true, "helpfulness": "0/1", "author": "peter"}, {"rating": 5.0, "review": "If you are like me, and when you subscribed to cable or satellite TV, you probably watched about 5% of the channels you had available. After seeing one more cable bill over $100, I decided I had enough, and it was time to cut the cord. So, I started looking for streaming box options, and after (a lot of) researching, I decided to get both an Fire TV box and a Fire TV Stick. And I have not looked back since.I replaced cable with Amazon Prime TV, Hulu, and Sling TV which covers pretty much everything we watched before.But, to focus on the Fire TV box. Set up was a breeze. Just connect it to your TV and your internet router (you can use Wifi to connect it, but a hard wire connection provides better performance), and plug it in. Once it is on, you are walked through the setup process, and the system may need to download a software update. But that is it!I did a lot of comparison between the Fire TV and Fire TV stick, and I ultimately got one of each (Fire TV for the living room, and Fire TV stick for the master bedroom). There are several advantages the box has over the stick:1) better processing power. This is useful if you are going to use it as a gaming system. Granted, it will not replace a dedicated gaming system, but for the price of a gaming controller, and occasionally a few dollars for some games (not all), it works pretty well! Games run more smoothly than on the Fire TV Stick.2) FreeTime. If you have kids, you want to be able to set up their own profiles with their preferred content and time limits. No more arguments about another show or another 15 minutes of games.3) Bluetooth headsets/speakers. I do not have a huge house, so when someone wants to use the TV and not disturb other people, it is great to be able to attach a small Bluetooth speaker or a set of headphones (that do not have attach to the remote).4) Optical audio out. If you want to connect your Fire TV to your surround sound stereo, you need an output.The layout within the system is not perfect, but the software is still in the first generation, so that is to be expected. It is fairly easy to find and keep track of your preferred shows, apps, music lists, etc. The only consideration for music is you can only select the Amazon Music playlists directly off the Fire TV. To create your own music options, you have to select music off the Amazon website or mobile app. But once that is done, you will see them on your Fire TV.For a first generation system, the Fire TV is extremely impressive! And I foresee it only getting better with more content (both Amazon created and not) and more features. And best of all? No more cable bill!!", "verified": true, "helpfulness": "2/2", "author": "dougetx"}, {"rating": 4.0, "review": "It's very handy and I don't miss my apple tv at all.", "verified": true, "helpfulness": "0/0", "author": "Angelica Goodman"}, {"rating": 4.0, "review": "At first i was very hesitant to buy the amazon TV because i already got the roku 3. But i got it for a main reason because it was android based and i could install some of my favorite apps. And after using it for a while i got used it and started loving it. But if your still thinking of it you need to know first that you have to have a PRIME membership otherwise you will feel useless seeing all those movies and shows and not being able to watch them similar to apples environment . Secound im giving it a four star because it misses two things , One. search like roku and two headphones in the remote control. Those two options i loved in roku but are not deal breakers to me. The player is well built and more solid than roku3.", "verified": true, "helpfulness": "0/0", "author": "Waseem Grace"}]