[{"rating": 4.0, "review": "LOVE IT!  A little disappointed that some of the older movies are not included in Prime and you actually have to rent them but overall the is so worth it.", "verified": true, "helpfulness": "0/0", "author": "Mary T."}, {"rating": 5.0, "review": "Awesome idea! It's so easy to use. Very glad I chose Fire TV over the other brands. It's everything it says it is. You literally plug it in, hook it to the TV, get on the web and go.", "verified": true, "helpfulness": "0/0", "author": "Lori Gee"}, {"rating": 5.0, "review": "I love this device, my daughter can find all the shows she likes here between our Prime and Netflix membership.  Works really well!", "verified": true, "helpfulness": "0/0", "author": "arleigh"}, {"rating": 1.0, "review": "Just another way to charge for content. May be an alternative to cable but I still need cable for standard programing an the content s redundant. The marketing from Amazon would lead you to believe that there is free content. Nothing is free.", "verified": true, "helpfulness": "1/3", "author": "ojglty"}, {"rating": 5.0, "review": "We are really enjoying this during a long, cold Midwestern winter, and we haven't even scratched the surface . We're stuck in the HBO block watching \"The Wire,\" \"Treme,\" and \"Deadwood.\" I highly recommend Amazon Fire. We also got rid of our satellite TV service and don't even miss it.", "verified": true, "helpfulness": "0/0", "author": "Gracie Black \"Bazaar Baker\""}, {"rating": 5.0, "review": "Love it!  Easy to use,  fast and there are many apps. Will recommend to everyone", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent results. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Robert Seabolt"}, {"rating": 4.0, "review": "So far so good it was very easy to set up and sink with WIFI still havent tryed out all the features.", "verified": true, "helpfulness": "0/0", "author": "rockinR"}, {"rating": 5.0, "review": "I really enjoy this", "verified": true, "helpfulness": "0/0", "author": "Nelgin"}, {"rating": 5.0, "review": "Works great even better rooted.", "verified": true, "helpfulness": "0/0", "author": "Clarence Bills"}]