[{"rating": 5.0, "review": "Comes with a lot of content.  Trying out to see about cutting the cable.  Not looking good for the cable.", "verified": true, "helpfulness": "0/0", "author": "Dane \"diverdane\""}, {"rating": 5.0, "review": "I also bought the controller for the games. The fire TV was easy to set up, easy to navigate and has a lot of great features.  I recommend this to anyone.", "verified": true, "helpfulness": "1/1", "author": "Janet Bu \"Jbu35\""}, {"rating": 5.0, "review": "Wish there were more non-US movies, non-Hollywood. Meaning, more UK, Spain, European content. Otherwise, with Netflix, this device is well worth the investment.", "verified": true, "helpfulness": "1/1", "author": "Vintagemusic"}, {"rating": 5.0, "review": "It's great! Love the Fire TV. Super easy to setup. Simple to use. And access to all kinds of programming.", "verified": true, "helpfulness": "0/0", "author": "Sarah Smith"}, {"rating": 5.0, "review": "we love it. best purchase. I wish there were more shows included with Prime.", "verified": true, "helpfulness": "0/0", "author": "JKH"}, {"rating": 5.0, "review": "Wonderful addition to our TV options", "verified": true, "helpfulness": "0/0", "author": "Tom Butler"}, {"rating": 4.0, "review": "I didn't know I had to have internet to use this thing which I don't have. It wasn't mentioned in the ad. But a wonderful Amazon rep helped me connect of cell phone wifi to it and now I can use it. You almost got a returned item.", "verified": true, "helpfulness": "0/0", "author": "rosemary kunselman"}, {"rating": 5.0, "review": "I had a fire stick, but decided that we needed more oomph from the Fire TV.  It is faster but buffering is still an issue.  But it's so much better than cable.", "verified": true, "helpfulness": "0/0", "author": "Paula Kalamaras \"scribesunlimited\""}, {"rating": 1.0, "review": "I received my first Amazin Fire TV and set it up. It happened to get unplugged and when I plugged it back in, absolutely nothing happened. No lights, no engines whirring, nothing! It became a brick of uselessness. I spoke with Amazon customer service (who were extremely helpful and understanding) and was sent another box. Here is what peeved me.... I was sent a refurbished box that won't make it past the Amazon load screen. So this is two boxes now that have had inexplicable technical issues. I still need to contact Amazon about my second box... but I'm close to just asking for my money back.", "verified": true, "helpfulness": "1/2", "author": "K Staudt"}, {"rating": 3.0, "review": "I was very disappointed when I found that the Fire tablet I previously purchased could not mirror  with the Fire TV and the Fire TV did not have a workable browser or streaming app for FNC,", "verified": true, "helpfulness": "0/0", "author": "Richard Coleman"}]