[{"rating": 5.0, "review": "Games, movies shows.  What more could you want for $100 a year.", "verified": true, "helpfulness": "0/1", "author": "Aaron O."}, {"rating": 5.0, "review": "We have thoroughly enjoyed having the Amazon Fire TV.  We are able to download from our bedroom TV.  We never watched the TV show \"24\" until now thanks to Amazon Fire TV we are able to stream this show and just finished Season 1.  We are also an Amazon Prime member so makes it free.  Love it!", "verified": true, "helpfulness": "0/1", "author": "Patricia A. Minter"}, {"rating": 5.0, "review": "With blazing fast speed, Amazon Fire TV goes toe to toe with Apple TV.  I bought the bundle which was an easy decision since discount was atleast $50-$70.  The remote works very well and the speech function is an added convenience to search via voice rather type.  Adding HBO programming was a smart decision as now Fire TV is the only device I use for entertainment.  One enhancement I would suggest is for Amazon to release a mobile app for remote with an option for keyboard (similar to rowmote for Apple TV).  This would make it very easy to type and use the mobile phone in case the smallish remote goes missing in a house full of kids. Overall, I highly recommend it and knowing Amazon, the content will just get better.", "verified": true, "helpfulness": "1/1", "author": "I review therefore I am!! \"hraza76\""}, {"rating": 5.0, "review": "Best thing since sliced bread.", "verified": true, "helpfulness": "0/1", "author": "Kevin Kinkade"}, {"rating": 4.0, "review": "I previously owned a Roku2 and this was a big step up in speed and navigation. Easy to navigate and the voice command works well. Some issues setting up Netflix account originally, but it could have been a problem with their servers. My only complaint is no HBO-GO app so I have to run my old Roku just for that.", "verified": true, "helpfulness": "1/1", "author": "Jeff Wickliffe"}, {"rating": 5.0, "review": "The speed is incredible, as is the picture quality. The voice search is the best I have ever seen, just fantastic. The BEST streaming player on the market!", "verified": true, "helpfulness": "0/1", "author": "Edward J. McCann"}, {"rating": 5.0, "review": "Amazon did a fantastic job with the Amazon Fire TV. Very user friendly, I LOVE the remote, it's design is like no other and the speed of the remote is incredible. The price is reasonable, you get more features than the competitor, it's really a no-brainer. This is definitely worth a 5 star review.", "verified": true, "helpfulness": "0/1", "author": "Philing \"Phillip Ingram\""}, {"rating": 2.0, "review": "Movies are too expensive to rent or buy!!!", "verified": true, "helpfulness": "4/6", "author": "Frank Fordjour"}, {"rating": 5.0, "review": "the easiest installation and set up I ever went through.  I love it.", "verified": true, "helpfulness": "0/1", "author": "Michael Gelinas"}, {"rating": 5.0, "review": "Excellent streaming device, easy to set up, easy to use.", "verified": true, "helpfulness": "0/1", "author": "slade"}]