[{"rating": 5.0, "review": "Love Fire TV. Voice feature is the best, Would highly recommend.Very fast, more so than smart TV and Roku.", "verified": true, "helpfulness": "0/0", "author": "M Merchant"}, {"rating": 4.0, "review": "I like it but it's too biased towards itself \"amazon\"", "verified": true, "helpfulness": "1/1", "author": "Heather P."}, {"rating": 4.0, "review": "Nice unit - I have not yet found time to use it but will soon.", "verified": true, "helpfulness": "0/0", "author": "jcg"}, {"rating": 5.0, "review": "I love my Fire TV. The voice search makes this product stand out above the rest. Everything else about it is fantastic. I own two FireTV's, and a FireTV Stick. I bring the stick everywhere the family goes. Plus if you know how to work with Android, there are some really cool things you can do on the side.", "verified": true, "helpfulness": "0/0", "author": "conga1100"}, {"rating": 5.0, "review": "Easy to install and works great.", "verified": true, "helpfulness": "0/0", "author": "Sharon Brightwell"}, {"rating": 5.0, "review": "It's SUPER easy to use, the voice search is AMAZING (and maybe even FUN!) and it's a great way to watch all kinds of movies without having to connect the computer. We LOVE our Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 5.0, "review": "LOVE, LOVE, LOVE our Amazon Fire! Easy set up, good tech support if needed, it does everything it says it will. We do not have cable or a dish, for just the price of our prime, which we had anyway, we are able to watch so many new programs, movies, and listen to an unending list of music-couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "sue moore"}, {"rating": 5.0, "review": "By far the best investment I've made so far this year. No more cable, just the Internet. I recommend everybody to throw away the cable box because this is the future.", "verified": true, "helpfulness": "0/0", "author": "pork chop"}, {"rating": 5.0, "review": "I was pleasantly surprised by the Amazon Fire TV.  From the packaging to the Fire TV device itself, everything had a quality feel.  The unit is small and fits just about anywhere, and I was able to quickly set up Netflix, HuluPlus, and HBOGO with minimal effort.  Although I purchased it at a discount I feel that it is well worth the retail price.  It does exactly what I purchased it for, and the voice search is a useful feature. Initial setup for connecting to my wireless router went smoothly.  I have only had it for a short time, but so far I am extremely satisfied with my purchase.", "verified": true, "helpfulness": "0/0", "author": "barmeath"}, {"rating": 1.0, "review": "there is not a live TV only show and movies I need news too.", "verified": true, "helpfulness": "1/8", "author": "Mamady SANOU"}]