[{"rating": 5.0, "review": "Fire TV has something for everyone in the whole family. Games ,your saved photos, radio , movies. My family and I want one in every room so everyone can have one.", "verified": true, "helpfulness": "0/0", "author": "sharine owens"}, {"rating": 4.0, "review": "i think its great.  one problem was that it didn't work.  the next day until now it has worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Richardmr Petruso \"tampa pete\""}, {"rating": 5.0, "review": "The system is great. The Bluetooth remote makes it so easy to use without pointing the remote at the device. System is super snappy and responsive. The Fire TV is a great device and outperforms the competition", "verified": true, "helpfulness": "0/0", "author": "sean"}, {"rating": 5.0, "review": "that this little box could provide as much entertainment as it does with so little fuss.  The Amazon Fire TV box is everything that Amazon advertises and more.  Don't hesitate . . . just buy it.  You pay so little for so much!", "verified": true, "helpfulness": "0/0", "author": "Amazonian"}, {"rating": 2.0, "review": "Overall this is nice, but if you think you are gonna get a lot of free tv, the kind you regularly watch you are going to be in for a big surprise.  Get out your wallet.  I ended up signing up for netflix.  Netflix gives you much of the content included that Amazon wants money for, And with my visio smart tv I didnt need Fire TV to access netflix.A major flaw in product is no capability to plug in headphones or blue tooth headphones.  Major plus for Roku.  With Roku you can plug headphones into the remote control.  Plus Roku has a lot more channels and free content.I'm a HUGE Amazon fan and I was leaning toward Roku but wanted to be in the Amazon camp.I think I made a mistake in this case.", "verified": true, "helpfulness": "1/3", "author": "Fred from Red Bluff \"Fred\""}, {"rating": 5.0, "review": "This unit is beautifully designed, made and packaged. It is easy to set up, and has excellent performance. I had tried a similar component made by another company, and didn't like it at all. I replaced it with this one, and I am delighted that I did so. If you are considering the purchase of a streaming device, don't waste time - buy this one.", "verified": true, "helpfulness": "0/0", "author": "Lyle W. Heldenbrand \"phantom\""}, {"rating": 5.0, "review": "I have a Prime Membership and download purchased, rented and free movies/tv only from Amazon.  I used to watch all videos via computer/monitor.  My monitor is 24\"; my tv is 40\"HD--which one would you use!!!!!  I used to watch videos from my desk chair; now I watch from my Recliner--again, a no-brainer!!!  Everything is controlled from a remote control smaller than my hand; and I have got to say that, in my opinion, Amazon Fire TV is the best invention since toilet paper!!!!  I am 72 yrs. old, and do not watch TV except for the morning news.  I, also, have my computer and I read a lot.  Amazon has made my life a little more comfortable.", "verified": true, "helpfulness": "0/0", "author": "Philip Neri"}, {"rating": 5.0, "review": "Surprised at how something so little can be me so grand. Easy to connect, small and compact but packed with amazing features. Love all the apps. Will purchase for every room in the house!!!", "verified": true, "helpfulness": "0/0", "author": "Clyde Burrell"}, {"rating": 5.0, "review": "I held off on a device like this... for a while. The FIRE is great... easy to set up, use and I love the speak feature! I do hope that Amazon will have other apps in the future... for now Prime, Netflix and Pandora keep me very entertained.", "verified": true, "helpfulness": "0/0", "author": "conijohn"}, {"rating": 5.0, "review": "It is really an amazing device and I'm glad I made the purchase! Ease of use, well-constructed, and state of the art technology!", "verified": true, "helpfulness": "0/0", "author": "James Teeple"}]