[{"rating": 5.0, "review": "We bought this to take on our 2 week vacation for our kids to watch in the condo. It was perfect. The voice command search option was great for them so they didn't have to type in what they wanted to search for. We thought we would try it out and maybe return it, but this is a keeper. It is so tiny and easy to hook up that we can take it even on short trips. Great buy!", "verified": true, "helpfulness": "0/0", "author": "nelli"}, {"rating": 1.0, "review": "The box did not work. I spent 3 hours trying to sign in. the first problem is that it was not registered to my amazon account. Then, after much time wasted and getting customer no service on the phone, they could not get it to work either. It connected to my wireless at home, but it never allowed me to sign in.....I will send it back and find another alternative!", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The best streaming service i have seen.  I am really impressed.", "verified": true, "helpfulness": "0/0", "author": "Mark C."}, {"rating": 5.0, "review": "We all love it!!", "verified": true, "helpfulness": "0/0", "author": "Sandy Doeseckle"}, {"rating": 5.0, "review": "This product is excellent.  It needs a few upgrades, but overall is great.  I sure like it better than my blu-ray player for streaming video.  The on-screen images are outstanding and I would buy another one.", "verified": true, "helpfulness": "0/0", "author": "Larry Lincoln \"fifi the cat\""}, {"rating": 3.0, "review": "I was hoping more videos would be free", "verified": true, "helpfulness": "1/1", "author": "Chillett"}, {"rating": 3.0, "review": "Amazons fire tv is great with only a few caveats. First their amazing voice search feature only searches amazon for the requested content, as apposed to the roku 2 and 3 where their search feature will search all streaming content no matter its origin. Meaning you cant use fire tv to search netflix. This seems like only a minor annoyance until you realize if you have both netflix and amazon prime you will have to search for the same thing at least twice maybe more depending on how many different streaming services you use. Besides that the quality is great and i was impress when i first plugged it in it managed to immediately find my account without even having to log in, this is probably because i had a kindle fire on the same network but it was simple to set up and started working right away.", "verified": true, "helpfulness": "1/2", "author": "JR"}, {"rating": 5.0, "review": "Best purchase ever.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "Great for convenience. It does everything my XBOX One can do, but is portable. I previously bought a Google ChromeCast to meet my convenience and portability needs, but you get what you pay for. This device out performs the ChromeCast hands down.", "verified": true, "helpfulness": "0/0", "author": "MAR5H"}, {"rating": 5.0, "review": "I use it everyday. Super fast .", "verified": true, "helpfulness": "0/0", "author": "R. Vera \"Ramonv\""}]