[{"rating": 5.0, "review": "Absolutely love this device. It loads quickly and I love being able to use voice to search content. We also have a Roku on another TV which we like but the Fire TV is better in every way.", "verified": true, "helpfulness": "0/0", "author": "Sandra J. Smith \"Sandy\""}, {"rating": 5.0, "review": "If you are a Prime Member this little box is just a must buy.  I have a PS3 and can get much of the content already but FireTV is SO MUCH FASTER and easier to use.  The WIFI connectivity for me has been very good.  Considering a second one for the kids room.  Content is very good and we've had no problem finding good movies.  The legacy HBO shows in HD (ALL The Sopranos are here!) are just SO good.  Also, many of the original Twilight Zones in HD as well?!  Awesome.  This thing is so much better than AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 1.0, "review": "Amazon Fire TV does not work, cannot buffer more than a few minutes, won't maintain WiFi connection.", "verified": true, "helpfulness": "1/8", "author": "John Reagan"}, {"rating": 5.0, "review": "Take it out of the box, simple connection to your TV and away you go !! GREAT PRODUCT !! I plan to buy two more for my other tv\"s real soon !! Buy one you won't regret it !!", "verified": true, "helpfulness": "0/0", "author": "JG \"tag\""}, {"rating": 2.0, "review": "I really had high expectations for fire tv, but I have bought this time twice from my local best buy and returned it....twice.  The first time I returned it was because of lack of content.  I have a subscription to MLB TV and it was not available on fire tv at that point in time, so back it went. Then recently I seen that MLB TV had been added and back to best buy I went to buy for the second time. I set it up put in all my information used it for two days and then I could no longer connect to Netflix, Then my wife was viewing one of her exercise programs and fire tv started uploading updates in the middle of her program and she could not continue.  I have to say I am a loyal amazon prime member and I think the service is great, but amazon has really laid an egg with this product so far. There are many great features with fire tv, but nothing beats functionality and dependability and to date those two requirements are solely lacking.  Clean it up, make it more reliable and I will give it another shot in another 12+ months.", "verified": false, "helpfulness": "0/4", "author": "Bandido"}, {"rating": 5.0, "review": "The Amazon Fire TV is the best entertainment value available today. My watch-list contains almost two hundred programs.  Some programs, such as NOVA, have dozens of episodes.  The price is only one tenth of my cable provider and I get ten times the value.  I select what I watch and when I watch it.  I love the immense selection of movies, TV programming, and video available on Amazon Fire TV. You can watch your favorite TV show beginning with episode one.", "verified": true, "helpfulness": "0/0", "author": "wroberthelms \"Robert Helms\""}, {"rating": 5.0, "review": "Love my Amazon Fire TV!  Very easy set up.  Remote is fast and easy to use.  My only problem - and I'm sure it's just me - is that I can't figure out how to get into Netflix.  Every time I click on the app, it wants me to sign in.  How do I do that?  There's no keyboard on the remote.  Like I said, I'm sure I'm just not seeing something obvious, but I would really like help with this!", "verified": true, "helpfulness": "0/0", "author": "Diane Barnes \"ItascaDiane\""}, {"rating": 3.0, "review": "Use XBox Amazon App.  You can search only for Prime content.  I was going to get this but I tried my XBox 360 and there was an app for this.", "verified": false, "helpfulness": "0/2", "author": "J. F."}, {"rating": 1.0, "review": "Doesn't support playing from SMB shares like the Boxee or WD Live. When it does, I will think about replacing my current boxes that play the content I want.", "verified": false, "helpfulness": "2/5", "author": "Darin Rother"}, {"rating": 3.0, "review": "I like this box, but it is lacking some functionalities:1. It doesn't fully use its android power. It could have way more apps than it does right now. I wish it could have the android games. Right now the game pad is useless to me because there are not many games to play.2. The most important issue to me is the lack of international TVs unlike Roku. Even Samsung TVs do come with some international TV apps (eg. GLWiz).3. It would be really awesome if it had Facebook and a web browser. I am pretty sure that it is capable of having them, I just don't understand why they don't want to do it.4. I am able to Airplay with my apple products but not android ones (Although it's base system is Android and it should be more compatible with Android devices)Overall, it is a great device. I barely watch the cable tv since I got this box; yet, there is a lot of room for improvement. I want this box to work as if I connected my phone to TV. It has the same specs, so it should do the same thing.", "verified": true, "helpfulness": "1/1", "author": "mkatouzi"}]