[{"rating": 5.0, "review": "love this product!!!!!  Great fun.", "verified": true, "helpfulness": "0/1", "author": "Carolyn Coy"}, {"rating": 2.0, "review": "I would get this if it had HBO Go.", "verified": false, "helpfulness": "0/8", "author": "Hamp"}, {"rating": 1.0, "review": "Inconsistent.  Have only been able to use it once or twice. Rarely works.  Always some kind of technical difficulty with the TV. Overly sensitive to HD M I cords.  Can't use. Wished I had never gotten it :-(", "verified": true, "helpfulness": "2/7", "author": "Susan E Irick"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "1/2", "author": "Carmen I. Ramirez-Balboa"}, {"rating": 5.0, "review": "The fire tv is great.I like the tv shows and movies.my son enjoys the games and music.it's a win -win situation for me.", "verified": true, "helpfulness": "1/2", "author": "ELIZABETH W. WHITT"}, {"rating": 1.0, "review": "so i'm trading hbogo for bloomberg tv?  i don't see that happening anytime soon.", "verified": false, "helpfulness": "2/7", "author": "Andrew D Mathews"}, {"rating": 5.0, "review": "Love the device and very easy connect and easy to use", "verified": true, "helpfulness": "0/0", "author": "Becky A. Sander"}, {"rating": 4.0, "review": "Awesome after some slight adjustments!", "verified": true, "helpfulness": "0/0", "author": "Louis Chan"}, {"rating": 5.0, "review": "A fantastic application especially if you have Amazon Prime.  Setup is very easy and fairly intuitive with your secure wireless network.  User directions are somewhat sparse, so you need to figure it out as you go, but once set, your good to go.  Make sure your TV has an available HDMI port (not all sets do) and know how to switch from TV to Amazon Fire.  Application has Netflix built in so if you have a subscription to Netflix you can watch your favorites from this device.  Also customizes each user's preferences and streams the movies/shows without interruption.  Only had a couple of times that it needed to stop and continue loading content before continuing.", "verified": true, "helpfulness": "0/0", "author": "R. P. V."}, {"rating": 5.0, "review": "Have two Rokus, but crazy about Amazon so I ordered this.  It is terrific!  The voice command is just amazing and works just great.  Would highly recommend over Roku.", "verified": true, "helpfulness": "1/1", "author": "Kirby Bible"}]