[{"rating": 5.0, "review": "Love being able to watch some of the old comedies on Fire TV.  It was super easy to set up and use.  Can't wait to see what else we can discover on Fire TV.", "verified": true, "helpfulness": "0/0", "author": "staylor0127"}, {"rating": 5.0, "review": "initially complicated but after awhile you figure it out.  It is FANTASTIC!!!!", "verified": true, "helpfulness": "0/0", "author": "Simone Shevelle \"Simone Shevelle\""}, {"rating": 1.0, "review": "If you order this product be sure it's compatible with you TV provider. If not, its a complete waste!", "verified": true, "helpfulness": "1/3", "author": "Thomas"}, {"rating": 5.0, "review": "Great...love that I get a lot free with Prime", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 5.0, "review": "Very pleased  highly recommend", "verified": true, "helpfulness": "0/0", "author": "Edward R Page"}, {"rating": 5.0, "review": "Amazon is slowly taking over my life.  The Fire TV is a great product with much better specs than my Apple TV.  I wish the home screen were better and/or customizable (c'mon Amazon, it's not that hard), but with a few Kodi hacks this thing is amazing and hosts all my home network content.  Fits well into the Amazon ecosystem--I have two of these boxes and thoroughly enjoy them.  Also, the landscape scenes on the screensaver are honestly some of the best photos I've seen. Great, great product. Pure value.", "verified": true, "helpfulness": "0/0", "author": "T Money"}, {"rating": 4.0, "review": "Got it for a great deal. Voice control is a a great piece to this product. Easy searching and scrolling, no latency. Much better than the competitors that I have tried. Roku, Chromecast etc", "verified": true, "helpfulness": "0/0", "author": "Christopher Wido"}, {"rating": 5.0, "review": "Love it great little steaming box.", "verified": true, "helpfulness": "0/0", "author": "GC"}, {"rating": 4.0, "review": "wished I would've know that the fire stick was coming out.  would've preferred that.  other than that, we really like this in that we can access so many cool apps (spotify, youtube, amazon prime) as well as airplay.", "verified": true, "helpfulness": "0/0", "author": "Andrew Spingath"}, {"rating": 3.0, "review": "A good option if you have no other way to stream media, however I purchased this to mirror my android phone which it did flawlessly the first time. Ever since it has been unable to connect. This was the reason for the purchase and so I returned it and will do without and save $100. however I still think THIS IS THE BEST STREAMING OPTION FOR FAMILIES. It has amazon parental controls. Way to go Amazon!!!", "verified": false, "helpfulness": "0/0", "author": "J. Cloward"}]