[{"rating": 4.0, "review": "We are enjoying the Amazon Fire TV.  There are several FREE really great app options to choose from.  We have been watching Christmas movies on youtube all week.  We use Netflix and Amazon, which we do pay for, but there are many free choices, as I stated above.  It also comes with a game controller, which we have not used yet.  We are giving it 4 stars, because it is still new to us and we are not sure if it is as good as or better than our Roku.  Will update this later on!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Soujourner\""}, {"rating": 3.0, "review": "Fast tv box but number of apps is really very small and the version of Plex is very old. Voice search is neat but again limited ti only amazon media", "verified": true, "helpfulness": "1/2", "author": "Gerald S. Roscoe"}, {"rating": 5.0, "review": "It's working great, enjoying some good movies on prime and Netflix !!!!!", "verified": true, "helpfulness": "0/1", "author": "beverley cope"}, {"rating": 4.0, "review": "Not Much to get starting using Amazon Fire, great buy.", "verified": true, "helpfulness": "0/1", "author": "David"}, {"rating": 5.0, "review": "It was so simple to use.  Getting it on the TV was easy.  Picking a movie and watching was quick.  Like the pausing button too.", "verified": true, "helpfulness": "0/0", "author": "Betty Baker"}, {"rating": 1.0, "review": "I ordered this for a gift but the prime trial as advertise wasnt part of the package as advertised..", "verified": true, "helpfulness": "1/7", "author": "MIRANDA"}, {"rating": 5.0, "review": "Love This Item!!Very Easy to Install and Use!", "verified": true, "helpfulness": "0/0", "author": "BigWilley"}, {"rating": 3.0, "review": "mechanics were good no local tv available movies cost too much", "verified": true, "helpfulness": "0/2", "author": "chris a faucett"}, {"rating": 5.0, "review": "I bought the Fire TV solely for the game functionality, because I was one of those kids with strict parents who wasn't allowed to play Grand Theft Auto.  So, on black Friday, Staples put this unit on sale, and I got it, went and bought a PS4 controller, and promptly downloaded San Andreas, and played to my hearts content.As a Prime member and an addicted Amazon user, I was able to make use of Prime instant video on this device.  Aside from using it on my computer (which works flawlessly) the only other device I had used Amazon Video on was my Samsung Smart TV.  I was worried this would be just as buggy.  But since it's a little box, essentially devoted to those sorts of tasks, with a killer processor and software, I was pleasantly surprised to find the videos loading quite well.I bought a 32 gb thumb drive to expand the memory, I think that's more than enough room for most apps, I just know the big games will take up a bit of space.  (Side note, I'm hoping for more from Rockstar, like BULLY)To touch on the remote, at first I was like \"Who wants to talk to their remote\" but one of the first nights I owned this thing, I got a really bad hankering to watch \"Small Soldiers\" which I hadn't seen in probably 10 years because I heard \"Another One Bites the Dust\" on the radio (watch the movie, you'll understand).  SO I pressed the Mic button, and said \"Small Soldiers\" and it comes up immediately, and plays the video without issue.  I've found myself constantly talking into the Mic now, it's so much easier than dealing with an on screen keyboard, and it works well.  I can also say, the fact that I can point the remote at the wall and the Fire TV still picks it up just fine is awesome! I'm used to using a Boxee unit that someone else owns, and it's a nightmare trying to get the remote to line up with that little sensor.  So props to this one!I think the only thing I can complain about is perhaps an easier way to shut it off.  Unless I'm missing something, you unplug it to shut off, but you can track down through the settings to find a sleep function.  I think I would like a reset function built into settings, because let's face it, I'm lazy, and you're lazy, and we don't want to get up to unplug a machine that might need to be reset.  I would also consider being able to use the mic to tell the tv to go to sleep.Either way, it's an outstanding product, I recommend it to everyone, though most of my friends are sold as soon as I say I've been playing Grand Theft Auto.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 5.0, "review": "IT IS GREAT ! MY SON LOVES IT", "verified": true, "helpfulness": "0/1", "author": "Jonnell Waller"}]