[{"rating": 2.0, "review": "I tried to connect and failed--three TV's all with the same result. The unit has been sent back with a full refund offered.  Nothing in this world is perfect, and I do not fault the manufacturer.", "verified": true, "helpfulness": "1/3", "author": "aquarius"}, {"rating": 1.0, "review": "Every time I go to use it, there's no sound, so it has to be rebooted.  I've discussed this issue with Amazon tech help and they have NOT been able to help me.  Amazon needs to fix this issue with either a software update or a way to turn off the unit, when done, with the remote.", "verified": false, "helpfulness": "1/2", "author": "Ron K.  Smythe \"Ron K. Smythe\""}, {"rating": 4.0, "review": "Seems ok.  Not as many free programs as I expected.", "verified": true, "helpfulness": "0/0", "author": "buyer"}, {"rating": 3.0, "review": "The picture quality is fantastic.  The sound is also excellent.  Movies stream almost instantly.I can only give 3 stars because of some limitations that were not even remotely made clear on the 'sales' page.  For instance, the screen mirroring is only available with newer devices already running miracast.  The sales page makes no mention of that, but you'll find some references if you dig deep into the fine print and 'learn' more links.Overall, it advertises a lot of interconnected features that as you learn more, are only available with a Fire phone, Fire HDX tablet or Kindle.Another thing is the device has a network cable port, but if you use it, you won't be able to see the box on your WIFI connected phone.  Important if you want to control apps like Spotify with your Android phone.  You have to make sure the Fire box is also on the WIFI, not hardwired.If these things don't matter to you, or you have the Fire devices, than it's a fantastic deal.", "verified": true, "helpfulness": "0/1", "author": "Robert Harrington"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "James Caldwell \"tankhook\""}, {"rating": 1.0, "review": "Wifi does not accept my network and tech support can not tell me why", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "C. Nelson"}, {"rating": 1.0, "review": "The box went bad in three weeks. I contacted technical support, and he put me through several procedures which I had already done. I told the technician that the problem was in the box, but he wanted to send me a new cable. With the new cable installed, the screen went blue again. I tried it on another almost new TV and the screen went blue. Now, I am just going to return it and stick with Apple TV", "verified": true, "helpfulness": "1/3", "author": "Dr. RJT \"rjt\""}, {"rating": 1.0, "review": "Impossible to find the prime video content that is included with prime subscription through search. Very frustrating...bringing it back to the store tomorrow.", "verified": false, "helpfulness": "1/4", "author": "M. Filips"}, {"rating": 5.0, "review": "Great alternative to the high costs of cable TV you have many options and a full line up of programs to watch tv or movies PBS whatever your hearts desire", "verified": true, "helpfulness": "0/0", "author": "pilotrod"}]