[{"rating": 5.0, "review": "I cut the cord two years ago and used a Roku XD to stream content. I remember setup was a breeze. The chromecast was cheap and cool... but you always needed a second device to send content so don't use it that often. Well with the Fire TV, I've been surprised and impressed right from setup. The talking animation during setup was cool and very helpful. The interfaces are slick and user friendly. The navigation between screens and HD streaming is super fast. I am operating the Fire TV on my 5GHz band and I have been more than impressed with this little box. Very happy with my purchase.", "verified": true, "helpfulness": "1/1", "author": "Julian Samuel \"JR\""}, {"rating": 3.0, "review": "I'm not going to focus on the things it does well but instead on the things that need work for it to excel. First of all the most annoying thing about most of these streaming boxes out there.... No way to power them off when not in use, this wouldn't be much of an issue if the device could figure out how to go to sleep properly on its own but mine after the first day of use has stopped putting itself to sleep, on the first day I had it it was going to sleep by its self but now on the second day it just stays on no matter what and there isn't a manual way to make the box sleep... This makes it annoying if being used in a bedroom because the light on front is blindenly bright enough to make sleeping an issue.Music apps... There is one HUGE omission, Amazon's own mp3 music service. How can you make a product yourself and not even include your own service on it? I've gathered quite a music library on Amazon's mp3 cloud through their autorip feature offered on many CD's and vinyls and would've expected access to it on the Fire TV.Storage space, it quickly becomes an issue after getting just a few apps and games. First of all you don't get the full 8gb at all because the system takes a couple right off the top leaving you with around 6gb. I've downloaded Netflix, Hulu, iHeartRadio and a few games and am down to less than 400mb left. Don't know if external storage is possible but it would be nice knowing how quickly the space vanishes.Fix those issues and in my mind its a real contender.", "verified": true, "helpfulness": "3/4", "author": "bafranksbro \"bafranksbro\""}, {"rating": 4.0, "review": "The Fire TV is at best a very good 4+Star device overall.3-Stars for HBO users at worst.5-Star for Amazon Prime Fanboys (Which might explain the Vine 5-star reviews).There are alot of 2014 devices to watch video on the internet, the Fire TV doesn't replace them for $100.$70 Sony Blu Ray Wifi BX510-All in One Player with C+ speed$50 WDTV Play-Supports Most Local Files,but no DTSRoku SeriesSpare Laptop-All in One Player with All Services and A+ speed$35 ChromecastFire TV ReviewPROs/Support-Very Fast A+ Page Scrolling with Bleeding Edge Quad Core & 2GB RAM-Support for Amazon Prime, Hulu+,HD Netflix, HD Youtube, Kindle-Support for Photos,Video , Music via the Amazon Cloud Internet & Wifi LAN-Amazon Voice SearchCONs/Limitations-Voice Search on Amazon Prime Only-Limited Storage for Movies and Games with 8GB storage only-USB port doesn't support playback for local photos and video-Keyword searching is slow on Netflix, Youtube, Hulu+-No programmable IR Blaster.  Another set of remote.BONUS-Plays Android Games with an extra $40 Amazon Gamepad & Game CoinsRequirement for a Good Experience-Fast Internet 15mpbs or faster-Day 1 Patience for upcoming Voice Features, Apps and Video ServicesImprovements for Fire TV Gen 2-Needs a Android/iOS app for faster nav.-Needs Voice Search for all app searches like Netflix, Hulu-2 Customization shortcut buttons like 1 button for Netflix, Amazon Prime-HBO Go would be a bonus-Programmable IR BlasterThe Fire TV has premium hardware,but the navigation isn't exactly premium for non-Amazon Video Apps.", "verified": false, "helpfulness": "3/4", "author": "FAL"}, {"rating": 5.0, "review": "Short Summary:  If you are wondering which one to get between Fire TV and Roku 3, get the Fire TV instead.If you find my review useful, please vote Yes. This review will be updated on a monthly basis so please stay tune!Fire TV is an audio/video streaming device for your TV and A/V system. It lets you play full streem audio/video streaming content, play your local media content from storage or the network at your house, and play a games. It's finally great to see a Amazon Competitor from Amazon.Amazon requires a broadband Internet connection if you want to watch high definition video, or slightly slower one for standard definition video. If you are unsure about your speed, go to Youtube check some HD video to see what service you need. If you can watch youtube then you can use Fire TV.Content:Netflix / Amazon Instant Video / Hulu / Crackle / Youtube/ HBO GO Showtime Anytime / Watch ESPN / Bloomberg TV / Vevo / Pandora ALL work perfectly on this.Fire TV is a little black box that is small and fits nicely in your house. Frankly it is a slick piece of hardware capable of placing in your house.Fire TV only has one audio/video output available: HDMI to 1080p HD withith Dolby Digital Plus up to 7.1, enjoy . Fire TV also has an ethernet port for wired network connection, and supports dual-band and Dual Antenna MIMO 802.11 a/b/g/n for wireless network access.What stands out between this and other devices is the Quad Core processer with 2GB.  Think a Galaxy Note 3 for your TV without the AMOLED screen.  It's more than capable of running all the applications and games and streaming you needFire TV is remote-controllable via infrared. With the remote, you can control it with the included Wi-fi remote or an iOS device. With infrared, you can control it with the remote included in the package.  Very slick and very similar to the Apple Remote for Apple TV.Fire TV also has a USB port, which let you use additional storage for content and system settings.Note that Amazon is not exactly a substitute of cable TV because a lot of content can still only be seen on cable, notably live TV: live major sports programs and live broadcast of TV series.Amazon does have streaming of obviously the Instant Video Program with Prime.  I use it on my Kindle Fire but now it's great to be able to share it on the TV also.Most of what Amazon offers is archived content, or \"on-demand\" content. There are hundreds of providers, which Amazon calls \"channels\", that stream select archived programs that you can watch at any time. A wide variety of content is available: movies, TV shows, cat etc. A nice selection of movie content from around the world is also available. Go to Amazon's website and browse its channel store to see all it offers. New content are added frequently.Amazon does not support iTunes or iCloud content because this is not an Apple device and cannot be in competition with Apple TV. But with Fire TV, you probably have enough content as it is.Game selection is one of the good things with this device.  Although still not as many as Play store, it is still better than Roku. And with Amazon commitment in this field (by buying a game studio) it will be soon be jammed pack with game contentThe Interface is extremely friendly and easy to use.  Coming from an Roku this is a good refreshment from the boring GUI of ROKU.  Contents are easily seen on demand and browsing is in my opinion smoother than Apple TV or Roku.  Lag doesn't exist with the powerful processor chip inside this tiny deviecAnother Good thing about this Fire TV is the support offered.  Call up Amazon and you get a real customer service who will try to help you setup.  This type of service you do not get with Apple or Roku which is a definitely plus for those who are not great with technologyBesides streaming online content, the Fire TV is also a media player for playing your personal local content from an external USB storage or home network.Fire TV is also a gaming console. Its remote has a motion sensor that works like a Xbox like controller and allows you to control on-screen movements. Fire TV comes with \"Real Racing\" that showcases nicely the remote's ability. More than 100 games are available in the channel store currently. Many are free,so you can do trials on those before paying the freemium model. All are in the casual game variety. Nowadays, it seems that all gadgets have to do two things at the minimum: stream video, and play games.Kindle Integration:I briefly used Kindle Fire HDX 7 for integration with this Fire TV.  Typical controls are there but I think there could be more Amazon can integrate to Kindle Fire HDX to make it a seamless experience.  the Mirroring experience is great but will be much nicer if we can work on dual content between the devices.Overall, Fire TV is for the Amazon:A - people who have problem setting up even a DVD player or VCRB - who have Amazon Prime subscription already and want to watch their content on TVC - Looking for a casual gaming device and a potentially big list of libraryD - To fully utilize their Amazon servicesNow I tried a bit of Mayday helpI check back pretty regularly, so if you have a question, please feel free to ask and I'll do my best to answer it.", "verified": true, "helpfulness": "5/12", "author": "Amazon Reviewer \"Reviewing is my greatest interest\""}, {"rating": 2.0, "review": "nothing different than the rest of the streaming boxes. I have a roku, and apple tv. I mainly watch apple tv because of you tube. No you tube no go. The voice feature isn't a compelling reason to part with a hundred bucks.", "verified": false, "helpfulness": "4/17", "author": "Kevin K. Crandall"}, {"rating": 3.0, "review": "I was contemplating chrome or something else. Amazon has been decent with me over the years. I read a lot of books on my kindle that will not take a charge and I know it is a loose connection on my kindle but I always make it work.  I have only used it for a day but  I was hoping to be able to connect to my network channels and watch tv.  I have basic Comcast and on my laptop can watch all but discovery. this machine works for me but it is just a wireless netfilx machine, since my prime doesn't have all I want.  I do like it but was hoping for more.", "verified": true, "helpfulness": "2/6", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Got Apple TV already but still want to give Fire TV a try.Actually like the look and feel of Fire TV. But the look of the main screen is, just like most Android  devices, too busy, not as simple like Apple TV's.Also don't like that you have to subscribe cable/satellite TV service in order to watch ESPN3. The whole point you got an streaming box is that you want to cut the cable/satellite TV service. YOU DON'T WANT TO PAY THE TV SERVICE. Apple TV let you watch ESPN3 without having to subscribe TV service.So I will try Fire TV few more days.  If I still have to subscribe TV service in order to watch ESPN3, very likely i will return Fire TV.", "verified": true, "helpfulness": "1/6", "author": "CW \"chao\""}, {"rating": 5.0, "review": "I'm not much for writing reviews, but this thing is super fast and super simple.  I have prime, and there is a ton of content I like to watch quickly available.  I was already renting streaming video from Amazon, so this made a lot of sense for me.", "verified": true, "helpfulness": "6/6", "author": "something_witty"}, {"rating": 5.0, "review": "I don't have cable and I stream all my media over the web.  I decided to give Amazon Fire TV a try as I'm loyal to the Amazon brand.  I wanted to try something different other than the various Roku boxes I'd been using.  What a beauty this streamer is.  It was effortless to set up and I had it working in no time.  I'm a Prime member and my video library was all there after I set up the box.  The video quality is great and I was able to easily log into my Netflix and Hulu+ accounts and start watching TV.  All my videos loaded super fast!  Its that easy that there was no running back and forth to my computer to type in codes like you have to with Roku.  Don't get me wrong, I wish Amazon had a bigger channel selection like Roku but I'm certain in no time they will.  I love that we can watch You Tube!  If I may suggest you add PBS, Spotify or Rdio  to the channel line up please?  Bottom line, I am happy with my purchase and as effortless as it was to set this up, I would highly recommend you give it a try!  THANK YOU AMAZON!", "verified": true, "helpfulness": "6/7", "author": "fluna60"}, {"rating": 4.0, "review": "Having Skype or Google Hangouts Apps with a webcam connected through a usb port will be a plus for this wonderful device. Please plan to provide this functionality.", "verified": true, "helpfulness": "1/2", "author": "Naasson \"Naas\""}]