[{"rating": 5.0, "review": "Best streaming device I owned to date. Its android and very much modable for power users. Just wish it had hdmi in for regular tv like the vizeo box. However the vizeo box just like their tvs never update thier devices.", "verified": true, "helpfulness": "0/0", "author": "Paul Adcock"}, {"rating": 5.0, "review": "Works as well as advertised.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon took good notes from others products and came up with a winner! I highly recommend this product to have for all ages. Especially cheap games and entertainment.Good job Amazon team.", "verified": true, "helpfulness": "0/0", "author": "JOHNNIE WERTZ"}, {"rating": 4.0, "review": "I love this little box so much that I purchased two of them. The voice command feature is really nice but it does not work on Netflix, it only works on Hulu. You can even say Hulu or Netflix and it will pull that up as well. The one problem that I have is that the menu button does not pull up a menu. It doesn't do anything at all. Other than that this is a great little box!", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 1.0, "review": "Not what I expected.", "verified": false, "helpfulness": "1/13", "author": "Amazon Customer"}, {"rating": 3.0, "review": "easy to use but the \"40,000 free movies \" are something I have not been able to find", "verified": true, "helpfulness": "0/1", "author": "Steven Thomsen"}, {"rating": 1.0, "review": "The advertisements mentioned thousands of free movies and TV shows if you signed up for Amazon Prime, so I did.  So far, every movie or show I have searched for has included a cost.  Every one!  My Amazon Fire TV box is just gathering dust.", "verified": true, "helpfulness": "0/3", "author": "George P. Partin \"Old Guy\""}, {"rating": 3.0, "review": "I love the concept, but it's a little frustrating when you see something you want to watch and you only can watch a clip or one episode.", "verified": true, "helpfulness": "0/0", "author": "Jackie Reineke"}, {"rating": 4.0, "review": "Amazon Fire TV turned my TV into a movie theater that I can watch when I want to watch. It is wonderful.", "verified": true, "helpfulness": "0/0", "author": "abbie t fortner"}, {"rating": 5.0, "review": "Replaced our old roku and this is amazing. Way faster, more choices and very easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Daniel J Wall"}]