[{"rating": 5.0, "review": "I just got the Fire TV and I absolutely love it. The user interface is very intuitive and very fast to navigate. The recently used scroll wheel is spot on. Switching back and forth between movies and tv is very fast. Accessing any part of a movie is very fast as well. Netflix works well, Game selection is decent for casual gamer. The voice search is the most accurate I have seen. Unlike the XBOX One Kinect, the voice search comes from the remote so no screaming across a room. This is definitely a keeper and I am will be selling my XBOX One.", "verified": true, "helpfulness": "7/9", "author": "Stephen Aniston"}, {"rating": 5.0, "review": "I love it.  Just installed it - took about 20 minutes.  The interface is faster than other streaming devices (i have several) and the voice recognition is extremely good (better than my XBox One Kinect).  My only complaint is I could not find any access to my Amazon music on the cloud player.  You do not seem to offer your own music player as a service??  Everything else worked flawlessly.  I love the sleek box design and the remote is small but has a high quality feel.  I connected the optical output into my 7.1 JVC amp and the sound quality was excellent - crisp and distinctive, with clear high pitch and deep bass response.  The menu felt comfortable after ten minutes of use - tested Netflix, Pandora, ESPN, Crackle, and several others.  All worked perfectly. Great design, great execution, great price!  BUT PLEASE GET ME ACCESS TO MY AMAZON CLOUD PLAYER AND THE MUSIC I HAVE PURChASED FROM YOU....", "verified": true, "helpfulness": "8/9", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire TV came well packaged with extremely simple instructions. Plug in the power cable and HDMI cable (not included), put batteries in the remote and that's it. After initial start up there is an update that must be run, but after a few minutes the unit was up and running. Interface is nice looking and easy to use. Voice search worked perfectly...it understood this Kentucky accent instantly. Flipping through the movie choices is super fast (almost too fast since it has skipped a movie a time or two). Netflix is on the home page, but you have to install the app before using it the first time. As I'm typing this review the unit is displaying some beautiful screensaver pictures while I have a movie paused. If you store your photos on Amazon's Cloud you can use your own pictures instead. Picture quality is fantastic and movies start up lightning fast. The only thing I see as a con would be how the Prime movies are marked. The placement of the Prime marker in the upper left of the movie icon is very small and isn't as prominent as it should be making it rather difficult to tell whether it's Prime or a movie you would rent/purchase. I figure in the days and weeks ahead Amazon will be listening to customer suggestions (as they usually do) and more and more updates will be forthcoming making this device even better. For me the Amazon Fire TV is a winner. It will definitely be replacing a Directv receiver I was using.Update: After one full day of using Amazon's Fire TV I am more than satisfied with my purchase.If you read reviews like I do make sure to skip over the ones that don't have the Amazon Verified Purchase listed under their name or click that their post is unhelpful. These are people who are trying to review a product without even having it in their possession. If you discount those reviews (which make the overall rating less than it should be) you will discover that the majority of people who actually purchased this product are very satisfied.4-6-14 Update: Added the AmazonBasics Digital Optical Audio Toslink Cable and this has added a whole new dimension to the sound quality of my tv. The sounds are more richer and louder than ever before. I am continually amazed at what this little device is capable of. I really suggest getting the cable I mentioned above to make your Fire TV experience even better!!4-8-14 Update: Turned on the device today and went to start up Netflix...all I got was a white screen. Turned the unit off and on, but still a white screen. I uninstalled the Netflix app and reinstalled and it worked again. I don't believe it was a problem on the device itself, but rather the app since all of the other apps worked fine.4-15-14 Update: Had the same white screen issue with Netflix some more. Contacted customer service and reported the issue. He stepped me through the process of going into the settings then the apps. When you come to Netflix instead of uninstalling click on force stop. This fixed the issue. If I have the problem again he asked that I contact them back immediately so that they can contact the developers with the issue. I continue to enjoy this device and have since gotten rid of the Directv receiver I had connected. I can't recommend the Fire TV enough!!6-25-14 Update: My Fire TV is still going strong and I am completely happy with it. I have found that I watch TV more so on The Fire than my DirecTV. The one thing I haven't checked (but will sometime) is the USB port. I've got to save some movies to my flash drive and see if I can play a saved movie from the drive using the USB port on The Fire. Finding Amazon content is a breeze using the Voice Search and searching through movies or videos using Netflix and others is fine. Yes, it would be great to be able to use the Voice Search with everything else, but it's not a deal breaker for me nor an inconvenience. I would imagine Amazon will eventually include their Voice Search on any third party application as time allows. Even after using it all this time I'm still amazed at the sound and picture quality of such a tiny device. For me Amazon just gets better and better.8-4-14 Update: I had movies saved to an external hard drive and I plugged it into the USB port on the Amazon Fire, unfortunately, it doesn't work. It basically did nothing. It made no noise like it was trying to access my hard drive nor did it recognize any USB plugged in. Hopefully Amazon will push out an update to fix this at some point and time. It would be a wonderful feature to have. (Hint, Hint...Amazon).", "verified": true, "helpfulness": "607/680", "author": "R. Colley \"~~RC~~\""}, {"rating": 5.0, "review": "I side loaded XBMC with ADB and to my surprise it worked better than plex . It seems to run smother and faster than my GBox midnight. The Fire Tv is by far the best little stand alone box I have and I have The first Roku , a Roku (Junk) 2,and 3 a Pivos Xios, Gbox (Great), Chromecast (junk), LG stand alone (another piece of junk) Fire Tv For 99 bucks is a steal. Don't listen to the bad reviews from people who don't own it they don't know what they are talking about.", "verified": true, "helpfulness": "16/18", "author": "scribbs"}, {"rating": 4.0, "review": "First off I apologize as this is more of a Question(s) than a Review because there is not adequate information for my purposes. Appreciate anyone who can as obviously Amazon does not.Do you get 5.1 Audio Sound especially from Netflix? If so, is the Optic Cable output sufficient (My older HDTV has just one HDMI input and my Denon 3801 Receiver doesn't have an HDMI input) to get 5.1 sound.Thanks for your help.", "verified": false, "helpfulness": "0/9", "author": "HershonJones"}, {"rating": 5.0, "review": "Was going to get another Apple TV but this had just hit the market so I decided to give it a try. I really liked that my Amazon Prime account was already set up in the unit. The setup was easy and intuitive. I also installed the Plex client without a hitch. I really like the Amazon Fire over the Apple TV mainly for the fact that I feel Amazon will continue to add apps and updates. Apple TV, not so much. The only negative I could think of is that I would like to see a tablet app to act as a remote control. I'm sure the will write one soon.", "verified": true, "helpfulness": "3/3", "author": "Gizmo Guru \"Gizmo\""}, {"rating": 5.0, "review": "I have had all the streaming boxes, roku, Apple TV, boxee, google tv, PS3, PS4, xbox 360 and chrome cast.  they all have benefits but where I see this shine is the speed of getting into and out of applications.  The streaming and downloading is crazy fast.  There is almost no buffer time. The applications load so fast as well.  Another benefit is that you have a huge amount of applications to load. For a first day release i would say amazon is way ahead of any of the competitors. The standout of course is the gaming with the micro console.  The console is super quite and low power.  The games like rayman, walking dead, and puddle look just as good as the xbox 360 version.  The games are much cheaper and would be really great for a young kid to play them.  The parental controls allows for people with young kids to access what is desired.I feel that this product could really replace or put a hurt on nintendo and the young crowd as the fire tv and kindle fire hdx allow really nice integration of gaming and surfing the web.  Looking forward i only see two companies offering similar products, google and apple.Apple does there own thing and heavily sways to do just enough to keep their customers happy. My Apple TV initial release was pretty pathetic.  The air game play really does not work and apple has not upgraded the hardware in close to 2 years. Google could do some nice things with their rumored box but they have a history of just creating cool products and abandoning them very quickly.  Google Q anyone ?So there it is the best Streaming/gaming box so far as of 3/4/2014.  Apple will come next.", "verified": true, "helpfulness": "4/5", "author": "Camera/ PC Guy"}, {"rating": 5.0, "review": "I, like many of the other reviewers, own several streaming devices so know what works and what doesn't.  Amazon tv works.  Great for the novice as setup is easy and seamless and great for the experienced streamer because it's so fast and user friendly.  Voice remote works...think Gary busey, which was a stroke of genius in my opinion.  I'm still laughing over the commercial.  Price is in line with other streamers and aesthetically I like the design better than the others I own.  Looking forward to the future with Amazon tv.", "verified": true, "helpfulness": "6/6", "author": "rt mco"}, {"rating": 1.0, "review": "I order the Fire TV the second it came out!  It looked great and I needed a great way to play Amazon Prime content (The App on my Samsung TV is flaky, at best).  I wanted to be able to watch season 4 of Warehouse 13...since Amazon nixed out NetFlix for the license...at least for right now.Anyway, I was stunned to open the box and find a power Brick!  How 1990's.  My old Apple TV has just a power code.  It looks like a rush design job on the part of Amazon (based on the iFixit photos of the inside of the box) so Amazon engineers did not have time to integrate the ICs or put a power supply on-board.Then when I plugged it is and run it for an hour, it got hot (not so much to burn, more more than just warm).  I did a quick test and it used 5X the power of my Apple TV while playing a movie from Netflix.  It also appears to draw more than 5X the power in standby...But I can't read low enough to accurately measure the Apple TV.Functionally, I can stream video!  One I get some more run-time, I might change my rating...but for now, I am Very sadly disappointed in the designed of the power system and the Excessive power consumption.**** UPDATE ****In a 72F room, the Fire TV was 100F after 12 hours of idle.  After watching Wrath of Khan from Amazon Prime, is was 134F.In a 72F room, the AppleTV was 78F after 12 hours of idle.  After watching Wrath of Khan from NetFlix, is was 108F.", "verified": true, "helpfulness": "15/47", "author": "Howard Miller"}, {"rating": 3.0, "review": "Amazon Fire TV's voice search is impressive, but so far I give the nod to the Roku 2 (don't own a 3).* Amazon Instant video is better on the Roku 2! When I choose Amazon Instant Video on the Roku 2, one of my sub menus is \"Prime Instant Video\".  Choose that and there are all sorts of options within Prime. With Fire TV, you choose either TV or Movies, on of the choices is then Recently Added To Prime, but that's it.* Text is bigger on the Roku 2. If you have old eyes, it's a big plus.* The Roku 2 has more channelsI'll give Fire TV the weekend to prove itself, but I have a strong feeling that it's going back.Added:I returned it.  I suspect that there may be compelling reasons to get one in the future, but, as with software, if it's not the first product in a brand new niche, better to wait than get version 1.0.", "verified": true, "helpfulness": "4/8", "author": "JerryWithaJ"}]