[{"rating": 5.0, "review": "We \"cut the cord,\" and went to antenna TV, after getting tired of the always more and more expensive satellite packages, which gave us many channels, most of which we did not watch.  We decided to add the Fire TV for Prime and other channels.  Easy to set up, although I found that the Edwards' Fire TV book was a help on a number of details.  Even on Friday nights Netflix streams pretty much seamlessly using the Fire TV.  Picture and sound are both fantastic, and there are numerous free apps to choose from, as well as apps for purchase (such as Plex, which I bought and now have the music library on my PC broadcast to my amplifier and speakers) so that you can customize to your desire.  Great product, and the remote is probably the best in the world!", "verified": true, "helpfulness": "1/1", "author": "Dingo"}, {"rating": 2.0, "review": "I purchased this from a friends recommendation.  I may return this and get the Ruku 3.  Though the speed of the apps and the quick set up are nice, being locked into the Amazon world for content is an expensive mistake.For example, the Ultraviolet streaming app Flixster, only allows content in SD on this device.  Vudu is not available at all.  Moving Ultraviolet content to Amazon Prime is not possible.  Losing hundreds of dollars of HD movies because this device does not support this content is not an option for me.The form factor and the build quality are very good.  The sound and video quality is excellent, (video on Prime content).  But getting locked into the Amazon box for content and device integration will be a problem for many prior users of streaming content.", "verified": true, "helpfulness": "2/3", "author": "Trailhawk"}, {"rating": 4.0, "review": "I am giving this four stars. My first two boxes that I bought came DOA. The Amazon support was amazing and they shipped two more out immediately. Upon receiving those one of them was also DOA. Again the Amazon support team was amazing and they shipped another out the same day. The support people were very kind and did not give me a hassle about the returns. Overall the actual devices work amazing. I have had no issues with them over the last few months.", "verified": true, "helpfulness": "0/0", "author": "Emilie"}, {"rating": 5.0, "review": "What a fun product to enhance our entertainment at the house!  We love our Amazon Fire TV and have one in the bedroom as well!", "verified": true, "helpfulness": "0/0", "author": "Noelle"}, {"rating": 5.0, "review": "Easy to set up, literally plug and go. As a long term user of kindle fire products I love it.", "verified": true, "helpfulness": "0/0", "author": "louise kash"}, {"rating": 5.0, "review": "Awesome device.  Very easy to install. I also have a ROKU 3 which by the way was also very easy to install. Between both products I prefer the Amazon fire tv (AFT) because it does allow for you to install additional addons not provided by Amazon downloads for free. The ROKU 3 has many more channels than AFT if you opt to install what they both initially offer. But hands down I enjoy the AFT.", "verified": true, "helpfulness": "1/1", "author": "J. Melon"}, {"rating": 4.0, "review": "Generally. The Amazon Fire TV has performed well.  I purchased it along with Sling tv, but there are still some tv networks that I haven't found apps for.Hopefully they will be available soon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome and totally Worth It", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 4.0, "review": "it works good", "verified": true, "helpfulness": "0/0", "author": "James Sample"}, {"rating": 4.0, "review": "My only disappointment was that it did not come with an HDMI cable (guess I should have read more closely) so I couldn't use it straight out of the box. Would have been willing to pay a little extra to have that included. Other than that I am quite pleased.", "verified": true, "helpfulness": "0/0", "author": "shopanista"}]