[{"rating": 5.0, "review": "This was the best Christmas present I bought my self last year. Love it!", "verified": true, "helpfulness": "0/0", "author": "Jaz"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Robin Mundle"}, {"rating": 3.0, "review": "Works fine. No On/Off button so it usually remains on with no convenient capability to turn it off. Limited Apps and NO Vudu App, only has Flixster which does not contain your complete digital video library. Disappointingly, Amazon Fire TV will probably NEVER add the Vudu app.", "verified": true, "helpfulness": "0/1", "author": "Denny"}, {"rating": 5.0, "review": "THIS IS THE BEST THING SINCE SLICE CHEESE, LOL,, I ABSOUTLY LOVE WATCHING ALL THE PAST AND PRESENT SHOWS AND MOVIES ,, I NEVER GOT TO SEE THE GOOD WIFE ,, I CANT TURN IT OFF, IV WATCHED FOR THE PAST WEEK , AND ITS ALL ON MY PRIME ,MEMBER SHIP,, NOW AFTER 6 MONTHS , IM FINALLY SEEING WHAT ALL PRIME HAS TO OFFER , IM USEING EVERY BIT OF THE BEAUTIFULNESS OF IT ALL , PRIME PHOTOS ,, AND YES THIS AMAZON FIRE TV ---THE BOMB,,, THANK YOU AMAZON", "verified": true, "helpfulness": "0/0", "author": "tammy"}, {"rating": 5.0, "review": "Great !! Pandora streaming , what ever you want to do. My parents almost get it !! Only get one or two calls a week, on how to operate it. Not bad since they cant load a CD !!", "verified": true, "helpfulness": "0/0", "author": "Kristal B."}, {"rating": 2.0, "review": "no better than Netflix.", "verified": true, "helpfulness": "0/1", "author": "jim lipari"}, {"rating": 4.0, "review": "I really like fire tv. What I didn't realize however is how much data it would use to watch. I am being charged an extra $10.00 a month due to my increased data usage since getting fire tv.", "verified": true, "helpfulness": "0/0", "author": "Lisa Lewis"}, {"rating": 5.0, "review": "its worth every penny.  its awesome!!!!!!", "verified": false, "helpfulness": "0/0", "author": "A Jeff"}, {"rating": 5.0, "review": "I originally tried two different Roku boxes. The first generation and the Roku3. Neither would work with my network reliably. The first gen would sort of work but would disconnect very often. The Roku 3 simply would not connect and stay connected to my wireless network. I spent countless hours trying to get them to work for my daughter's bedroom. I finally gave up on Roku and bought this unit.It was set up, connected to my network and playing videos in less than 5 minutes. It is incredibly fast compared to my other streamers and smart TV's.I will eventually replace all of my media streamers with these. Could not be more satisfied.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am so happy to have Fire TV. I didn't think I'd use it a lot but I use it everyday. I totally recommend it especially if you are a Prime member", "verified": true, "helpfulness": "0/0", "author": "MW \"Disney Fan\""}]