[{"rating": 3.0, "review": "Not quite what I was looking for and debated sending it back.  However seeing that it is already paid for, I will just keep it.", "verified": true, "helpfulness": "0/2", "author": "Peter L. Surek"}, {"rating": 5.0, "review": "Love it", "verified": false, "helpfulness": "0/2", "author": "Julie Barnes"}, {"rating": 5.0, "review": "A lot better than Apple TV!", "verified": true, "helpfulness": "0/1", "author": "Paul Whitman"}, {"rating": 4.0, "review": "I'm really not sure what I gained compared with just the TV Fire Stick, as I already had TV mirroring with an existing HDMI computer cable.  I cant get a Fire Stick until mid January, so I can't really compare the advantages to me over just buying the Fire Stick.  I still love Amazon anyhow.I GUESS I PAID TOO MUCH BASED ON THE NEW SALES PRICE OF $79", "verified": true, "helpfulness": "0/0", "author": "C. Winslow"}, {"rating": 5.0, "review": "I especially like the voice search.  We intially got the Apple TV but like Amazon Fire TV so much better.", "verified": true, "helpfulness": "0/0", "author": "J. E. Johnson"}, {"rating": 4.0, "review": "The Amazon Fire TV is easy to connect to your TV. I'm not electronic savvy and this was very simple. The voice makes it simple to find what you want to watch. The remote is easy to use. The only thing that I find irritating with the product is that I have to reset it by unplugging the unit and re-plugging it back in. I have a password protection on it so my children can not watch something that I feel is to mature for them. Every few days, it will start looping (for lack of a better term to use for what it is doing) and not let me finish putting in my password. A few times it has gone to a blue screen and I had to reboot it then also. If this bug could be fixed then I would say this streaming device is perfect. Fast streaming, easy to use and secure for children.", "verified": true, "helpfulness": "0/0", "author": "athadona"}, {"rating": 4.0, "review": "Great product. I buyed it to use the Plex App and works pretty well.The left star is because there's no version to buy in Europe!!Thanks for such wonderful product.", "verified": true, "helpfulness": "0/1", "author": "Carlos R."}, {"rating": 5.0, "review": "I really like the Fire TV. Combined with a Prime membership how can you go wrong. I sort of like gadgets and have Apple TV, Roku and Chromecast. I like the Fire TV the best so far. The voice search makes things very easy to find what you want to watch.", "verified": true, "helpfulness": "1/1", "author": "Suezq716 \"S Murphy\""}, {"rating": 2.0, "review": "Wish I could return this. It has 8GB storage but it won't allow you to download your purchases and view them offline, such as when traveling.  There aren't enough free shows for Prime members to make it worthwhile.  Probably useful if you use Hulu or Netflix.", "verified": true, "helpfulness": "0/1", "author": "John Raffetto"}, {"rating": 4.0, "review": "This is an intuitive device and I will purchase the next version that doesn't have cords. It is difficult to search for movies or TV shows that are included as part of the Prime membership.", "verified": true, "helpfulness": "1/1", "author": "Rachel W."}]