[{"rating": 5.0, "review": "Remote with voice is the best. Perfect picture and sound. Easy to use. Perfect transaction. Extreme happy!", "verified": true, "helpfulness": "0/0", "author": "Joni Kay"}, {"rating": 5.0, "review": "Easy to set up and does what I need.", "verified": true, "helpfulness": "0/0", "author": "HappyGrumpy"}, {"rating": 1.0, "review": "Ruined by ADs.  It seems like amazon has no concern for customers. Bought this with one set of expectations.  Except for regular crashes it was ok. Now suddenly amazon changes the rules and makes me look at  ads on the homescreen with no way to turn it off. This is just poor customer treatment.", "verified": true, "helpfulness": "2/3", "author": "Robert G. Buice \"DrRobert\""}, {"rating": 1.0, "review": "If I could give less than one star, I would. It all started out when my first certified refurbished TV came in the mail weeks ago, I plugged it in and my Fire TV would enter an endless loop. It would go past the white Amazon logo in the beginning and start looping after it shows the Amazon Fire TV logo (the logo with color). After applying the necessary troubleshooting, the Fire TV would still have the same issue. So I contacted customer service, tried their suggestions for troubleshooting, and when that failed they agreed to send me another TV.Fast forward two days later, I receive my replacement TV in the mail with a smile on my face \"knowing\" it will work. Well I was wrong. The second time around, the Fire TV would get stuck on the white Amazon logo in the beginning. Furious, I contacted customer service who said that the problem is most likely a defective power chord because the Fire TV is most likely not getting enough power. So two days later I get the replacement power chord and I still have the same issue. I told customer service and they apologized and said they'd send another replacement TV my way...I'm a baseball fan, so I decided, \"Why not? This is the second strike, so I'll give it one more go\". It didn't go well. The Fire TV struck out. The third Fire TV (2nd replacement TV) had the same exact problem as the the 1st replacement Fire TV. After going through the necessary troubleshooting again, I asked for a refund. I am currently in the process of returning all items. I've ordered a lot of items from Amazon, but who would've thought that Amazon's own product would be the one to ruin my experience. I hope other consumers reading this will either buy another steaming device, or buy a new Amazon Fire TV because I've had a horrible customer  experience with the refurbished one.", "verified": true, "helpfulness": "1/2", "author": "Abiel Malepeai (Ace)"}, {"rating": 5.0, "review": "Good buy.  Much enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Harvey C Bush"}, {"rating": 5.0, "review": "Everything was excellent! I'm glad I purchased this and would like to prefer this to everyone. I give it 5 thumbs up.", "verified": true, "helpfulness": "0/0", "author": "Josh Harrison"}, {"rating": 4.0, "review": "Enjoy watching, but some programs or getting around the site can be difficult to not available.  Many of the sites and shows are pay only.", "verified": true, "helpfulness": "0/0", "author": "pearlyrose"}, {"rating": 5.0, "review": "I own two of these now.  The interface is the best of any other TV device I've dealt with and I love the free and quick purchase library.  Highly recommend, but only if you already are Amazon Prime, which makes everything so much easier.", "verified": true, "helpfulness": "0/0", "author": "Jeff Hunt"}, {"rating": 4.0, "review": "great !", "verified": true, "helpfulness": "0/0", "author": "STEVEN L COALY"}, {"rating": 5.0, "review": "Love it!!! The whole family uses it every day.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]