[{"rating": 3.0, "review": "Would likely be 5 stars -- but the best function of this device (voice search) doesn't let you search on anything other than amazon content.I'm relegated to spelling out letters with my remote for netflix and other apps.Fix the voice search, let me index netflix/plex/hulu and return results with it, and you have a killer app.Right now, it's 'just another' media player.", "verified": true, "helpfulness": "2/6", "author": "Justin Kimball \"justin kimball\""}, {"rating": 1.0, "review": "I was excited to try the voice search as soon as I got my fire tv connected.  I was severely disappointed to learn that it only shows results for things found on Amazon, and that it DOES NOT show me content found on Netflix and Hulu, both of which I pay a montly subscription for.  Fire TV instead only shows me what's available for purchase through Amazon.  Amazon Prime does not carry most of the shows I watch (at least not included in membership---you have to pay extra), and I feel almost cheated and mislead.  I can still watch Netflix and Hulu shows, but I have to go through the cumbersome search using the one-letter-at-a-time-on-an-8-button-remote.  And since there's no app available for my smart phone, I don't have the option of a keyboard to make searching quicker and easier like I do with Roku.  There's a very good chance I will be returning this.", "verified": true, "helpfulness": "35/59", "author": "flash_of_gold"}, {"rating": 3.0, "review": "The good: the device is fast; smooth navigation through menus, solid streaming; the voice search was much faster and more accurate than expected; good for Prime-subscribers and Kindle-owners; compatible game purchases on Kindle are automatically available on FireTV library.The bad: my controller has to be re-paired each time (though it pairs automatically with the Kindle); Minecraft does not work with controller; no clear delineation between Prime-available titles and titles-for-purchase; SD-quality options are hidden; very limited screen space for third-party apps when compared to Amazon products (this is unabashedly not an unaffiliated media streaming device); voice search does not work on third-party services; screen mirroring between Kindle and FireTV is too slow and choppy for practical use.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 4.0, "review": "I have been using the Fire TV for 2 days now. I really like it. It is very, very fast especially on Amazon content. I like the way they did the menus and layout. I have played games and streamed content. Great box.I had one problem on setup. I use a Sony STR-DA 4300ES AV receiver so all signals go to it and then one HDMI cable goes to the TV. With the Fire TV at it's default \"Auto\" for the display setting, it made the picture on my TV blink on and off. I plugged the Fire TV directly into the TV and it was fine. So, I set the display setting to \"1080P 60hz\" and then plugged it back into the Sony receiver. Perfect picture.I like having the tunein app so I can listen to all my local radio stations.I also noticed that I had to manually sync to get the latest episode of a TV show that I have the season pass. It automatically showed up on my iPhone amazon app but I had to go into settings and tell it to sync to get it to show up on in my wish list. Now I don't have to stream Amazon from my Sony Blu-ray anymore. I also have an Apple TV that I like also. But I think I am liking the Fire TV just a little bit more, maybe.Great job Amazon. Please keep improving it.", "verified": true, "helpfulness": "1/1", "author": "Gary Robertson"}, {"rating": 5.0, "review": "I've had this box for a day and a half now and really like it.  Before, I was using the apps in my Panasonic Plasma.  The Fire TV works much better.  Now my TV uses it's computer to just put up a great picture.  There are only a few things I'd like to see on the Fire TV:1. Clearer labeling of what is free for having a Prime Account.  Right now under the picture of the movie there are small boxes with the different prices.  Why not add another box here that says \"Free To Prime Members\".  I know now if you click on the picture, then a box show you the different options to buy or watch the movie.  There you see the Prime Box to click and watch free.  I would like to see this box at the time you highlight the movie.2. A category on the main menu screen to play back the music you own on Prime Cloud.  Just like for movies you bought, how about a category for the music you bought.  I'm sure there are a lot of others like me who have the sound coming from the Fire TV go into their receivers and that have bought cds with the auto rip.  I'd like to play these back through my receiver instead of a movie while puttering around the house.3. Add HBO GO and VUDU so people will stop complaining about the Fire TV not having them.  I'm getting tired of reading reviews with one star from people whining about this.Otherwise it's a great product and thank you for having it available.", "verified": true, "helpfulness": "2/3", "author": "Paul J. Millen"}, {"rating": 4.0, "review": "I have several Roku devices of all flavors. The design of the Amazon Fire TV in comparison is nothing short of amazing. It has a lot of great features, and with a few enhancements, I do believe this device will be a game changer. Let me spell out the best parts for me, and tell you what I think needs to change.The good:1. It's fast. Really fast. Like instantaneous fast. My biggest gripe about the Roku is that it is slow.2. Voice search for Amazon Prime content. The voice search works, and it works really, really well.3. The setup is super simple. I plugged it in, and before I could think about the next steps, it was playing a video explaining how it works. My Amazon Prime account was already preloaded, so that extra touch was very nice.4. The remote is much better than the Roku. It is simple, and I don't need to fumble in the dark to find the button I need to press. The click wheel is perfect.5. Video quality is excellent. It appears to be using a progressive load, so the video starts almost immediately.6. Games. The hardware for this box will be the biggest thing to hit the market that I can think of. I will admit I am biased a bit because I am an Android developer, but the fact that building games will be a snap will bring mountains of content in the future. I am already designing my games to run on this device.7. YouTube. My Roku could not play Youtube videos without a hack. The YouTube app for this device is awesome.Needs improvement:1. As stated by many others, voice search only works on Prime content. Although the search works awesome, it needs to expand to other services (Netflix and Hulu Plus). Amazon Prime has quite a bit of content, but I don't want to have to hunt and peck my searches for those services. This may or may not be an Amazon issue, if the voice search is open for other providers. I'll need to do more research to see if they closed it off.2. SD rentals in Amazon Prime are hidden in \"Other Purchase Options\". Sometimes I like to save a buck. I don't always care about watching a rental in HD, so burying that option is clearly a play for my money.3. The name of the movie title while browsing titles in Amazon content is WAY too small. There is a whole block of real estate under the horizontal gallery of videos. AMAZON PLEASE put the title for the content in bigger letters in that space. That will make the user experience so much better.I know I've only scratched the surface in my review, and likely I will find more features I love or hate in the weeks to come. I believe this device will be as big a hit as the Kindle Fire and its HD derivatives. I will be following it closely, and hope to have my games in the marketplace for this device in the very near future.", "verified": true, "helpfulness": "1/2", "author": "W. Olson"}, {"rating": 2.0, "review": "I bought this the day it came out.  It was easy to hook up, and I was impressed with the speed.  I downloaded Pandora, the load times between songs were like 30 seconds.  I own a Kindle Fire and there are no loads times between the songs.  It was annoying, but the major problem was Netflix.  I went to watch a movie on Netflix, and got a white screen and it froze.  I went back on, and the movie played but kept buffering, then froze again.  I love Amazon and their products, but I think I jumped the gun when I made this purchase.  They have some bugs to work out, and need to add some more apps like WWE network, and HBO go.  I may get one in the future when they fix these issues", "verified": true, "helpfulness": "3/7", "author": "jeremy gravelle"}, {"rating": 5.0, "review": "I have a roku...how is this different? I like my roku and it has hbogo and many other channels...is this better?", "verified": false, "helpfulness": "0/16", "author": "Noelia Gutierrez"}, {"rating": 2.0, "review": "Very simple to setup.Great form factor.Plays Amazon Prime video flawlessly at HD quality over my wifi (at least the one movie I tried)However I plugged in my USB storage device to see how it did with my movies and nothing happened.  I confirmed with the (very nice and helpful) fire tv support person on the phone that the device does not support this.  I have no desire to transfer all of my movies to, and pay for, cloud storage so this is a deal breaker for me.It also would be nice to have a way to put the device to sleep when you are not using it instead of having it display a screensaver, and have a way to only display movies/TV you can watch with no charge.Not bad for a first attempt.  The hardware seems to be outstanding and the software I'm sure will evolve to correct shortcomings.  But no way to play local movies at all, really Amazon, what were you thinking ??????Sadly, it is being returned.", "verified": true, "helpfulness": "7/15", "author": "William P. Oatman"}, {"rating": 5.0, "review": "We're really happy with Amazon Fire TV. It provides quick and easy access to Netflix and Amazon Prime content. There's no disruption when watching movies and it's simple to navigate with the voice command. Would definitely recommend.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}]