[{"rating": 3.0, "review": "Memory issue?  I am experiencing out-of-memory issues with my Fire TV.  When I check it says it has gigs of space left, but it keeps giving me low memory errors -- has anyone else had this happen?", "verified": true, "helpfulness": "0/0", "author": "Corvid"}, {"rating": 4.0, "review": "Update, October 26, 2014:After owning the Amazon Fire TV for a few months now, I barely ever use my Apple TV anymore and I completely disconnected my Roku. The Amazon device has the best interface out of the three (I never tried the Chrome one so I can't compare it to that). It is not perfect, I wish there were more apps and that the apps that it has were better supported by the developers, but I understand it's difficult to get a critical mass of developers working on a new platform. Considering this is the same Fire OS under the hood as on the phone and tablet, I wish they would open it up to allow me to install more apps from the Kindle app store. But that being said, for watching Netflix, listening to music on my Amazon Cloud drive, and watching movies and TV from Amazon Prime, I'm pretty happy with this purchase.One thing Amazon really needs to address is the lack of playlist import into Amazon's cloud from iTunes. Also they need to work on making it easier to navigate a large music library - the voice search is good but sometimes I just want to browse my collection.Original review, July 30, 2014:I just got my new kindle fire tv and I while I like it now, I was pretty disappointed in the initial experience.1. It arrived with outdated software on it, and gave me no indication of this or instructions on updating it. The reason this was a problem is I first tried to listen to my Amazon music library, and that option was not even available. To make matters worse, the \"help\" section didn't work in this version - the help was no help at all. So I wasted the first 15 minutes looking for the music section, and ended up having to call tech support which took another 30 minutes to get the Fire updated, get the Amazon Music library to sync (takes a looooong time), and then eventually to play music.2. The advertising for the Fire TV and Fire HD tablet integration is highly misleading. It looks like you just flick your finger across a video and the video will display on the tv. Tech support explained I have to stop the video and go deep into the tablet settings menu and turn on/off screen mirroring manually. I asked tech support about this and they just said \"that's just how it works\". Ok, well Apple TV with the iPad at least you can do mirroring right from the video app, you don't have to go into the settings each time. But then I was messing around with it further, and discovered that the X-ray and tablet/tv integration when you're playing a video (not screen mirroring) is actually really slick! Too bad tech support didn't mention it when I asked them, I had to find it for myself.3. What the hell is Free Time? I don't have kids, so how do I take that off the main menu? I asked tech support about it, and they said you can't. WRONG - you can! Great news, I don't even want to accidentally enable parental controls, or have someone else do it by accident. But not so great news that asking tech support gives the wrong answer. That's 2 out of 3 questions they gave me wrong info about.Overall my first experience with the Kindle Fire TV has been 20 minutes of frustration, 30 minutes on the phone with tech support, and another 10 minutes writing this because even after getting help over the phone, I was left having to fend for myself and figure this stuff out.Now that I did find out how to access all the features I was interested in and get it working, it's great (I'm giving it 4 stars, after all) but man, getting to this point was waaaay too painful.As an Amazon customer for many many years, kindle fire tv is the first time I have ever really had a bad experience with anything Amazon, and I'm pretty sure it's the first time I called Amazon tech support. I even bought several versions of the Kindle and didn't mind upgrading 3 times when new versions came out. But this has been a disappointment with Kindle TV, and I feel misled by the service techs incomplete knowledge of the product. Step it up, Amazon!", "verified": true, "helpfulness": "5/5", "author": "Carl"}, {"rating": 5.0, "review": "Absolutely infatuated.", "verified": true, "helpfulness": "0/0", "author": "I. Raquel R. \"IRR\""}, {"rating": 5.0, "review": "Greatest thing ever", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"wbingram396\""}, {"rating": 1.0, "review": "I expected a whole lot better from an amazon media device, i purchased this to replace my roku3 box but ended up having to reconnect it instead. the apps on this device does not work well and the voice command only retrieves movies from amazon. i have an amazon prime account but the set back is for movies is that are new i have to purchase or rent.Dear AMAZON. for this extra price for amazon prime you should give your customers access to all movies. lets face it by not doing this nothing sets you above the bar and sets you apart from Netflix which i'm very with by the way because Netflix has no added cost to watch all their content.i would not recommend anyone to buy amazon fire tv, ROKU ROCKS!!!!", "verified": true, "helpfulness": "4/8", "author": "Great gifts"}, {"rating": 5.0, "review": "Wow!  This is so great!  Better, much better than Apple, Hulu , and others.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "A. Diaz \"ADLFL\""}, {"rating": 5.0, "review": "We purchased this to replace our old AppleTV, and the Fire TV immediately became the center of our entertainment system, rather than the accessory we had planned. We seldom watch cable now.The picture is stunning, even for those old standard definition shows. The Prime Video selection keeps our TV time full to overflowing.Economically, this is best system I've seen on the market. The hardware was plug in and go, and movie rentals/purchases are lower cost than iTunes. It's easy to use, ever expands the Prime library and already full of viewing choices, and runs smooth as silk. For families, this gives plenty of shows to keep the kids happy.Music is fun, with graphics, lyrics, and so easy to navigate. We have not tried using Netflix or Hulu, *yet*.Planning to buy a second one for the other room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "you would think that they would give you this free since you have to pay to use it, like a cable box and subscribe to the prime service, or others. cable does not charge you for the box. the usb port does not do anything for content, it is there to mislead you. no web browser, just pay pay pay for service and pay for the box you cannot use unless you pay pay pay more. a cell phone with an org to hdmi adapter would work better.", "verified": false, "helpfulness": "3/9", "author": "Paul Pierron"}, {"rating": 1.0, "review": "Half baked, Unstable at times.The lack of a reboot option from the menu was horrible in my opinion.For some reason netflix and youtube apps kept freezing once in a while. The lack of a restart option made it frustrating because I had to go to the device and unplug it for a minute.If this gets mounted behind a TV, this is going to be hard for some people.The voice search was only useful for amazon content. There isn't much there that I wanted to watch. Most of the content I watch is on netflix and hulu plus.I had kept it longer than 30 days so I was unable to return it. I ended up selling it on the bay site.Got myself a Roku 3 and I am impressed with it.Much better than the FireTV.", "verified": true, "helpfulness": "6/9", "author": "Andrew R."}, {"rating": 4.0, "review": "We like it a lot. Can only say good things about it.", "verified": true, "helpfulness": "0/0", "author": "Betty Demaree"}]