[{"rating": 5.0, "review": "I've had it a couple of weeks now and it is great!  The voice recognition is extremely accurate and makes it very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Soggy in Seattle"}, {"rating": 4.0, "review": "Use it all the time. Menu could be bit easier to navigate.", "verified": true, "helpfulness": "0/0", "author": "Mbgoodchild"}, {"rating": 1.0, "review": "they bought this item back a few months ago and waited for my TV guy to hook it up. Now I find out it doesn't work, it doesn't turn on, and I never got to use the product.", "verified": true, "helpfulness": "1/5", "author": "Donald M. Schwartz"}, {"rating": 5.0, "review": "The Amazon TV is fantastic - it was easy to set up, is easy to navigate, has all of the apps that I wanted to use a \"smart tv\" device for. I had previously used a gaming console to stream Netflix/Hulu/Amazon Prime etc onto my tv, and this is so much better is doesn't compare. The only annoyance that I have is that I cannot watch HBO GO on this, because the account is through Comcast. While this is clearly Comcast's issue, and not the device, I cannot imagine why Comcast cares the mode through which you watch a service you are paying for. Overall- highly recommend for anyone was is a user of Amazon services", "verified": true, "helpfulness": "1/1", "author": "Sara"}, {"rating": 5.0, "review": "Very impressed with this item. Easy to use and saves money. Suggest you purchase it and see.", "verified": true, "helpfulness": "0/0", "author": "Alonzo \"Alonzo\""}, {"rating": 5.0, "review": "Awesome had Apple TV (note says HAD I gave my Apple TV to my mom after getting Amazon TV) it works great easy super easy to use and streams movies where the \"smart\" TVs fail they buffer and clunky I'll never buy a smart TV again I'mm make it smart with Amazon Fire TV! (Get the box not the stick its worth it!)", "verified": true, "helpfulness": "1/1", "author": "Dayle Frye"}, {"rating": 5.0, "review": "SOOO much easier and more fun to use than my Roku 3.......Totally worth the money!", "verified": true, "helpfulness": "0/0", "author": "G. C. young"}, {"rating": 5.0, "review": "sets up easily and works flawlessly", "verified": true, "helpfulness": "0/0", "author": "G. G. Russell \"tech nerd\""}, {"rating": 4.0, "review": "I love my fire TV, I only have one complaint, and that's the search function. when you do a general search. ie \"post apocalyptic\" it will only give you a MAX of 150 movies or TV shows, even if their are more you have to try and add something to the search to get different results... if it only wants to show 150 at a time that's fine but give me a more button to load the next 150. or a refine search you can search many more online because of this limitation I find myself on the website adding movies I can't get to on the fire TV to my watch list.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device is a marvel of engineering and design. It receives video and audio with no buffering and remarkable clarity. The voice activated remote control makes it very easy to find the programs you want to watch. The sleek receiver turns the power off if it is not used. You need to must press the thumb drive button to activate the power. It is very easy to set-up. I highly recommend this product over it's Amazon Fire Stick TV cousin.", "verified": true, "helpfulness": "0/0", "author": "Drumboy26 \"Drumboy26\""}]