[{"rating": 5.0, "review": "I have an Apple TV and a Mac Mini both acting as media devices for my televisions.  Neither come close to the ease of use and performance on this Amazon Fire TV.  I have a Plex server on my network and the Apple TV doesn't allow the Plex app without jailbreaking - and even then the performance is junk.  The Plex app on the Fire TV is awesome - just awesome.I am ordering another for our bedroom - very powerful.Now if ESPN and DirecTV would get on their horses and sign an agreement I would be all set!", "verified": true, "helpfulness": "1/1", "author": "BSomms3"}, {"rating": 5.0, "review": "This is a very great product. I was very impressed with everything from the internal specs to video playback. I haven't tried gaming yet because I couldn't afford the controller too but I'm sure its as amazing as everything else.Pros2 GB of ram which dominates the Apple TV and Roku devicesVoice searchGamingEverything's in Amazons CloudFull 1080p playbackASAP: Which loads movies it thinks you'd likeIs preregistered to your account if bought from Amazon so all of your media is their.USB PortCons8GB of storage which means you can't download a lot of apps or games without having to delete older ones and some games do not save your data to the cloud which means you have to start over.Does not include HDMI cable but this can easily be fixed with purchasing Amazons Basic HDMI cable.You can not hook up a flash drive or external hard drive for more space.Other than these few cons it is an amazing device Amazon always seems to impress me and they always go over the top to satisfy the customer.This device has made me switch from purchasing all of my media from iTunes and using Amazon for my content I will definitely be buying the next one if and when it is released.", "verified": false, "helpfulness": "1/1", "author": "Angela Perkins"}, {"rating": 2.0, "review": "Other reviews said this device predicts what you will watch next. I'll pause Netflix and every time I come back it is back on the \"choose your experience\" screen. Annoying as I will never choose Netflix Kids. Then I have to drill back down, looking for the series I have been watching. Then it buffers before restarting. In contrast, the Apple TV was alway right where I left it. Navigation is odd. The remote has too many buttons.", "verified": true, "helpfulness": "1/4", "author": "P. Adlfinger"}, {"rating": 4.0, "review": "Love the overall experience and speed.  We've quickly adopted the Fire TV as a multi-faceted family entertainment center for games, tv, videos, etc.  This does way more than an Apple TV or Roku.  We've enthusiastically added about 30 apps that we really like.  The problem is that it quickly runs out of memory.  The games in particular consume a lot of storage space (especially the rich graphics games like Asphalt 8).  So we've already reached the memory limit in just a few weeks.We've got about 30 apps total (including the usual suspects like Netflix, YouTube and a handful of games like SevZero, BombSquad, and Asphalt 8 - which I'm told consumes a ton of storage space) and received a message saying to remove apps otherwise performance will slow down.  So, after only using this for a few weeks, we've had to remove some apps from the player.That's a bit of a bummer.  I wish the usb plug could be used to expand app storage.  That would make this a scalable gaming/entertainment platform for people like us who aren't mainstream console players (we don't have an XBox or Playstation).Otherwise, we've been really happy with the Fire TV and highly recommend it.  I'm also guessing that the interface may get refined over time to make it easier to view long lists.  Right now, scrolling through 50+ large thumbnails of movies/content, can be time consuming.  Guessing they'll enable the user to select a smaller thumbnail grid view at some point.", "verified": true, "helpfulness": "3/3", "author": "juice_man"}, {"rating": 3.0, "review": "I would love to get Amazon Fire TV. It's just that there are so few channel choices for national and world news. Include at least 10 news channels (BBC, France 24, CNN International, NHK, etc.), 10 arts channels (Sky Arts, CBC Television, DW TV, etc.) and 10 overseas entertainment channels (TV Monde, etc.), then I'm DEFINITELY buying Amazon TV because it would be great to watch these channels on my 42-inch HDTV rather than my smartphone or PC — and without the cable TV price and reception hassles.", "verified": false, "helpfulness": "3/4", "author": "Moore No Less"}, {"rating": 5.0, "review": "The Amazon Fire TV works great!  I don't have the fastest internet service, but the Fire TV plays a movie without any buffering.  I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "R. Everett \"ROE\""}, {"rating": 4.0, "review": "I prefer the Amazon Fire TV over my Roku 2XD, although most of the channels I used on Roku are already available on AFTV, AFTV has a better game selection than Roku. For someone who mainly watches Amazon Prime, Hulu+, Crackle and/or Netflix, they would probably be happy with either device, for someone who would use the channels that required a cable or satellite subscription to access, then Roku would be the better device, however if Android based games are your thing, then AFTV becomes the device to get. If it wasn't for the developer mode and the ability to sideload apps, I probably would have given 3, maybe 4 stars because it wouldn't have been much different from other devices already available.Pro's:Easy to navigateAndroid GamesDeveloper modeSmall deviceMost of the channels I used on Roku are already available on AFTVCon's:Limited apps (I know they just started, and more apps are on the way)Limited storage (Probably enough for the average user, personally I've already been told to delete some apps because I was low on storage.)I ALSO BOUGHT: - The Amazon game controller to play more games. - Mini Wireless Entertainment Keyboard with Touchpad for use of the developer mode since many of the apps I've sideloaded require a mouse and/or keyboard to navigate. (NOTE: The average user will not need the keyboard/mouse functions.)EDIT: (May 19, 2014) - Reduced from 5 stars to 4 stars. Although I have no performance problems with AFTV, it's just the lack of storage space is ridiculous! Some of these games are over 2.5GB, which means you can only have 1, maybe 2 larger games installed at a time. If you want to reinstall it later, then you'll have to wait a few hours to redownload that huge 2.5 GB file again. This device has a USB port, but the only use I've found for it is a wireless USB keyboard/mouse. It needs to at least allow us to download these large files to a USB drive so if we can quickly reinstall the app at a later date.", "verified": true, "helpfulness": "1/1", "author": "JimBou1981"}, {"rating": 5.0, "review": "I have Apple TV and I decided to try the Fire TV for my bedroom TV or be able to place it in the guest room when I have company.  It was easy to set up and cheaper than Apple TV since you have to buy the remote separately.  I am satisfied with it.", "verified": true, "helpfulness": "0/0", "author": "Rita W."}, {"rating": 2.0, "review": "on most streaming it is \"static\", and the picture freezes for a moment then continues....annoying...I am still in the 30 day period, but I don't have the box it came in so I could return it....otherwise I would...", "verified": true, "helpfulness": "1/3", "author": "Frank"}, {"rating": 5.0, "review": "Who needs a Smart TV when you can get the basic services for hundreds of dollars less! I have movies downloaded at formidable speeds and it only cost me 99.00 instead of 600.00. I did not need a new tv but better service.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]