[{"rating": 5.0, "review": "LOVE IT!  It is so easy to use.  Plus, the voice search function does not have a problem with what some might call my \"Southern drawl.\"  My husband uses it to run KODI, so our whole video library is RIGHT THERE.  Between KODI and Prime, I don't know what else I could possibly need, but I look forward to exploring ALL the things Fire TV can do!", "verified": true, "helpfulness": "0/0", "author": "Kati Schoffstall"}, {"rating": 2.0, "review": "Bought this about a year age when they first came out and liked it other than not be able to stream to my network attached TV and other smart devices. Fire TV Stick has better sharing than the big brother Fire TV box. Waited and figured they would update TV box to have sharing that is not after installing 3 things on box 2 on device and hope nothing causes a crash.", "verified": true, "helpfulness": "0/2", "author": "ddeininger"}, {"rating": 4.0, "review": "Started with chromecast and got tired of it freezing all the time. Amazon fire tv is the way to go. We love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon addict"}, {"rating": 4.0, "review": "better than any other streaming player available in the market. need to work on the app database", "verified": true, "helpfulness": "0/0", "author": "Priyesh Patel"}, {"rating": 5.0, "review": "Excellent, works perfectly.  Been using it for about 3 weeks now and it's been working flawlessly.", "verified": true, "helpfulness": "0/0", "author": "David S."}, {"rating": 5.0, "review": "Works right out the Box. Side loading any extra apps that you need is painless watch youtube for advice. super quick and easy to use.", "verified": true, "helpfulness": "0/0", "author": "william sparks"}, {"rating": 5.0, "review": "Yes it works great, it arrived quickly, was easy to hook up and I am enjoying new entertainment every evening.", "verified": true, "helpfulness": "0/0", "author": "MTM Investment Group"}, {"rating": 5.0, "review": "At first I wasn't sure how I felt about Fire TV... But when I realized that I could link my HBO, Netflix and tons of other apps I was won over.", "verified": true, "helpfulness": "0/0", "author": "Brenda Lafarga"}, {"rating": 5.0, "review": "Love it!!! Its AMAZING!!!", "verified": true, "helpfulness": "0/0", "author": "Lauren Goodwin"}, {"rating": 5.0, "review": "Good product. Worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Rajith Abraham"}]