[{"rating": 4.0, "review": "We went from using a Wii console to this. Needless to say, it is much more fluid and the controller is easy to use. The controller is small and you don't have to even point it at the unit. The unit itself is really small and unobtrusive. The equipment I would give 5 stars. What demoted it to 4 stars is that they still don't separate Prime content from paid content. They should integrate that feature. It is always frustrating to try and navigate between the two. And I buy season passes of certain shows and it did not give me the amount of choices HD vs. regular on the console. I had to go buy regular online and re-sync it. I don't know if it is just trying to sell you the more expensive HD instead. But the apps are great: Hulu, Netflix and many others are really easy to upload and use.", "verified": true, "helpfulness": "1/2", "author": "Kd Koehler \"Graphic Girl\""}, {"rating": 4.0, "review": "This was really easy to set up—plug'n play at its finest, however, it's more of a tease with what's available. Parts of a series will be part of Prime; if you want the rest, you have to pay extra. Movies seem to move in and out of Prime (freebie-wise), and others have to be paid for. The voice search is great in terms of being able to speak the name of a show into the remote, then you need to use the arrows to move up, down, left, or right and to select the program. I'd like it if I could simply tell it to move or select. Minor, really.The TV series have no commercials!! YEAH!", "verified": true, "helpfulness": "1/2", "author": "Kathy Davie \"kddidit\""}, {"rating": 3.0, "review": "The streaming works great.The search voice recognition also works great, however the search results (whether using voice or text search) bring in all sorts of random items in addition to missing some of this items you would expect to be included.Also, no web browser and no YouTube, so I still have to use my tablet in addition to this.It's worth the price if you want to stream Prime, Netflix Hulu since the streaming works so well. It looks like the box is enhancing the picture with increased local contrast and a non-linear color curve in comparison to broadcast signals, but it's tastefully done so not a problem despite having no control over it other than your TV.The last thing that was painful was that there appears to be no way to edit a wireless LAN connection once set up. So if you manually set up the connection and make a mistake, you have to delete the profile and start over. The auto-recognition failed so I had to do it manually.", "verified": true, "helpfulness": "0/1", "author": "MS"}, {"rating": 1.0, "review": "Don't waste your money. Just got mine and am sending it back. I have an account through Netflex and all movies are free but if you use Netflex through Amazon FireTV it charges you. Of course they don't tell you this.", "verified": true, "helpfulness": "8/29", "author": "P. Popp \"onesouljane\""}, {"rating": 1.0, "review": "Cannot get  any sound from it.  I have tried every conceivable connection with  my system amplifier.  Nothing works.  Now I must spend $80.00 to have my electronics installers fix the problem.", "verified": true, "helpfulness": "8/15", "author": "James L. Holm"}, {"rating": 4.0, "review": "I bought this device since I already have Prime for the shipping benefits and I am very frustrated with the performance of Apple TV.  The Fire streams much better with higher quality than Apple TV and there is a lot of good content (unlike Netflix where I can never find what I want to watch).  The only complaint I have is that there are still many movies that are not included at no extra charge.  I understand that for the newer releases but not the older content.", "verified": true, "helpfulness": "0/1", "author": "Jeff Bradford"}, {"rating": 5.0, "review": "Saw that Fire TV supported Plex for my movie server, took a couple of minutes (about 30) to figure out how to setup the box to add the app since it is not clearly explained. Setup the box in my living room and immediately a hit with the kids. I have 3 apple TVs and 1 google Chromecast, love the airplay for apple tv and chromecast, have not figured out if air play could be done for Fire TV but does not appear to be the same, would make it awesome buy if actuall air play or mirror was the same.. If actuall air play was supported you could skip out on apple tv.", "verified": true, "helpfulness": "0/1", "author": "Dr. Benjamin Smith"}, {"rating": 5.0, "review": "I don't write reviews often but this little box deserves much praise.  I have an Apple TV (wired) which is really finicky and super slow.  My wife and all three of my daughters have Rokus which they love but I hate the speed (wireless) and poor picture quality.  This Fire TV (wired) is fast and has great picture quality.  The Amazon Prime videos load instantly and control (FF/RW) much like a DVD player.  Even Netflix works so much better on this box.  I'm not a huge fan of voice recognition products but this works pretty darn good.  If it can understand Gary Busey it should work for just about anyone!If you're looking at a Roku or the Apple TV I strongly encourage you to take a look at this gem ...  I couldn't be happier!", "verified": true, "helpfulness": "0/1", "author": "Dante"}, {"rating": 5.0, "review": "So Far So Good...Very Fast ...Voice Search is ok and pretty cool. Playing Games is a snap and works well", "verified": true, "helpfulness": "0/1", "author": "nyyanksjoe"}, {"rating": 5.0, "review": "So easy to use - voice command a great feature - much better then typing out a search!  So glad I ordered this!", "verified": true, "helpfulness": "1/2", "author": "Connie Springer"}]