[{"rating": 4.0, "review": "Four key things to keep in mind on why this has GREAT potential and maybe why you should it get it...1) Voice search is good and the only one of its kind amongst the competitors.  It's function is mostly limited to Amazon-based products but the fact that it has this feature alone is a plus.2) Video games.  Sure there is a game controller to buy but a lot of the games still run off the remote.  The plus is....a good portion of the games are FREE!  (there are still IAP's but can be restricted.)3) MIMO works better on this unit than Roku 3 (at least, I think so...)4) 8 GB of storage (maybe 5 GB's available) and 2 GB of RAM plus Cloud.The other reviews here cover a lot of the other things so I won't go over all else.  I knocked off a star maybe another half of a star because:  i think it could go down a little bit in price; there should be a feature to manually put the unit in \"sleep mode\" so as to save on the bluetooth remote battery; no Amazon music player (I mean c'mon now! seriously?! that's like forgetting one of your kid's birthdays); needs a browser; needs VUDU; blah, blah, blah.  Hence, Fire TV has potential, a lot of it!So far, it's been worth it.UPDATE: 5/19/14This thing is fast! I should say it is fast especially with its Amazon built-in features.  The add-on apps can have a little bit of lag. But with Prime TV and movies, it's almost instantaneous including with HD shows.  Just watched Star Trek Into Darkness the other day it was perfect in sight and sound.There are a few people complaining about how the \"Prime Movies and TV\" should be separated so it can be found easily.  It is really not a big deal.  For now, the voice search can separate Prime Movies (or TV) for you by just saying \"Amazon Prime Movies\".Pandora is great on here too.  It's fast, very little to no lag.  Get this thing!", "verified": true, "helpfulness": "1/1", "author": "Odii Gis"}, {"rating": 3.0, "review": "The speed, intuitiveness and intelligence is awesome.  There are no pauses between commands the menu base entry process is not frustrating as it is on other platforms.  Lastly the device knew who I was from my IP address, I did not even have to log in.Two major issues for me thought are a lack of Miracast support and it is confined to the Amazon ecosystem,  If you have an Amazon device second screen is supposed to work.  If you have an Windows or Android device that supports Miracast it does not work.  Verified with Customer support and there is no indication this will change.You can only connect to Amazon Cloud services.  While it is a great service lifestyle or work have people using other services such as OneDrive, ICloud or GDrive.  Also services such as BitCasa are much cheaper.The only way to connect to local media is via Plex.  Great program and I use it but DNLA is a standard that is a basic of any system and a very easy way to use this device to play your home movies.I have 30 days to eval I will probably take the next 29 to decide.", "verified": true, "helpfulness": "1/1", "author": "Kim Sell"}, {"rating": 5.0, "review": "I love Amazon and I think I am going to love this product.  Set up was simple, even for an old non-tech like me.  I wanted a way to watch Netflix on my TV, tired of watching from my computer and my old ROKU box was nearly worthless with it's constant streaming interruptions.  I love being able to access so many forms of media on this one small box, however, I've not had a chance to really experiment because my grandson, who lives with me, has the unit from the time I get home from work to when he goes to be, playing games.  I think I will have to purchase a second unit if I ever expect to use it.", "verified": true, "helpfulness": "2/3", "author": "Patricia A. Martens \"triciamartens\""}, {"rating": 5.0, "review": "Man Amazon did an amazing job on the first release of this product. The user interface is clear, clean and easy to use. It has a tone of features/apps/games as well, which is a big upgrade from my Sony TV. This device will add life to any household/party. The picture is clear, and I love that there is no buffering time when watching Amazon movies/tv shows.  I will update this review after I've had a few days to play with this device.Things that would like this better product:* Amazon should lower the price of the game remote* Add the music player app called Rdio its 100% better than Pandora* When I select the Prime Movies/TV option, I've noted that the system returns none prime (free) moves/tv shows as well when they should not be mixed in. Otherwise what's the point of have a Prime Movie/TV option", "verified": true, "helpfulness": "3/4", "author": "dean:"}, {"rating": 2.0, "review": "I commend Amazon for trying to finally put out a proper Google based media streamer and even though it blows away the competition in raw power it falls short in lack of content. To me this is an unfinished product and not in the hardware sense but in software. I knew full well that HGOGO was not available yet but will be later this year so I bought it anyway thinking I would use Showtime to get me by. I was wrong. There are only less than a dozen cable companies that support this device and my cable company isn't one of them. I can't use any app that requires a Charter login so it pretty much leaves me with HULU, Neflix and Amazon Prime. To me that isn't worth $100.I also purchased it with using PLEX in mind but that will run another $5 and the app isn't even up to date. I know $5 isn't a lot but why do I have to pay for it here when you can download it for free on the Roku? This device isn't ready for the living room, not until Amazon comes to terms with most of the service providers. The games are ok but truth be told I didn't buy this device for that purpose. The Fire TV has the potential to be the undisputed king of media streamers but until they can iron out agreements with most of the service providers I would have a hard time recommending this device over the Roku 3. Its going back to Amazon for now but I am keeping my fingers crossed they fix the issues I mentioned above.", "verified": true, "helpfulness": "2/5", "author": "Port"}, {"rating": 5.0, "review": "I purchased one Fire TV unit to test it out, and have since purchased a second unit.  I'm going to intetrate both into my whole house video distribution system, as long as I can sort out a method to have multiple remotes per box.  The interface is great, the apps are great, it's fast and responsive, I have absolutely no complaints.  I know that Amazon is committed to this product, so the app availability will continue to improve.  Overall, a successful effort so far!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Surprisingly good image quality.  A great alternative to all of the other devices out there.  The quality and look of the product is excellent.", "verified": true, "helpfulness": "1/1", "author": "Karl R. Wolfe"}, {"rating": 5.0, "review": "Bought this as a gift for my mother, she's in her 70's.  She said it was easy to set up and she is really enjoying it.", "verified": true, "helpfulness": "1/1", "author": "Mona"}, {"rating": 5.0, "review": "So easy to set up & use.  Was easy right out of the box.  Just plug it in and you are ready to go.", "verified": true, "helpfulness": "1/1", "author": "Diane Biano"}, {"rating": 5.0, "review": "Love it, love it. Easy to set up. Easy to use. Small. We are seniors and very simple to use. Would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "VICTORIA C."}]