[{"rating": 5.0, "review": "Fast shipping. Great product. Easy to set up. Highly recommend buying this. Very cool, small and simple", "verified": true, "helpfulness": "0/0", "author": "Morehead"}, {"rating": 5.0, "review": "I was skeptical about the Fire TV but I figured if I didn't like it, I could easily return it. I have been pleasantly surprised. It is well thought out and responsive. And like other Android devices, it can be tweaked if you are tech savvy. I originally bought it to run Plex so that I wouldn't need to use my HTPC which is necessarily far from silent. Plex runs well, although it is still a work in progress, and I am enjoying easy access to Amazon and Hulu streaming content. I have now finally free of my cable company.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 3.0, "review": "Some good features but organization of titles and ease of finding things not as good as Roku", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "I love this! I have a Roku and decide to try the fire TV since I have Amazon Prime and I am so glad I did. I like this alot better than the roku!", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 5.0, "review": "This is really a sleek system.  We set it up last night and it took about 10 minutes flat from the time we started opening packages to the experience of watching TV on it.  Voice recognition is flawless on the remote.  For a Prime member like me, there is a ton to watch.  As for the other apps, Pandora sounds beautiful, Crackle looks great, and Netflix worked fine.  (Small complaint -- the Netflix app doesn't seem to remember user name/password as yet, and it gets a bit old to have to input it every time.)  Picture and sound are gorgeous.  We watched Hachi and cried our eyes out without any commercial interruptions to the sniffling.  Next step will be flinging HBO GO content from the new Kindle Fire to the Fire TV screen -- if that goes well this system may deserve 6 stars.", "verified": true, "helpfulness": "0/0", "author": "Bearwife"}, {"rating": 5.0, "review": "So far so good.  My voice recognition has been very good, despite some other reviews.  Combined with Prime, I have plenty to watch & do.  Slight lag after a show ends, and before I can navigate on the screen again (freezes), but it clears after a short time.  No problems at all with streaming videos - works great.  I trimmed my cable down to the local channels and high speed internet, so this has definitely fit the bill for my/my family's needs.  Very good price for what it provides.  And my Amazon experience has always been a good one, so I'm confident that I can address any future problems as they come up.  I would definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "R.R. \"Kindle User x2\""}, {"rating": 2.0, "review": "If you leave the unit plugged in it will triple your internet usage and this could result in higher cost's from your provider.It doesn't just \"turn off\" when its not in use.", "verified": true, "helpfulness": "2/2", "author": "Malcolm K. Rawson \"Keith Rawson\""}, {"rating": 2.0, "review": "Why is Amazon still selling this? The product is great, the interface is really good if you mostly use amazon content, everything is smooth but the Amazon stick is also 1080p and is currently $19. If I can still return it and pocket the difference I will", "verified": true, "helpfulness": "2/3", "author": "A. Kellogg"}, {"rating": 5.0, "review": "I have both Amazon Fire TV and Apple TV.The main difference is (obviously) the layout of the screen and software.- There is SO much more on Fire TV than Apple TV. But if all you really use is Netflix and Hulu, and you already have Apple TV, save your money unless you want a few games. I love the solitaire.- Fire TV is just faster. Period. I love my Apple TV, but I love Fire TV for its speed.- Apple TV has a new, faster interface with updated aesthetics, but honestly, it's still subpar to Fire TV. I would recommend Apple TV if you are a Apple fanatic, because you can only access purchased iTunes content on TV through Apple TV. If you're a strictly Amazon user, then Fire TV is the way to go.- Voice search is great, but would be nice if it would give you options for more than Amazon or HuluAll in all, it's newer, has better software, etc. It's a win for me!", "verified": true, "helpfulness": "0/0", "author": "Brandy"}, {"rating": 5.0, "review": "Extremely snappy and quick device. Haven't had any buffering or problems. Much better than my Apple TV. And you can watch your plex stuff!!I'm really considering the Fire tablets and other amazon devices.", "verified": true, "helpfulness": "0/0", "author": "Josh Crosby \"Director of IT\""}]