[{"rating": 5.0, "review": "received my Fire TV and I just love it! I have so many more veiwing options plus I can watch on my TV OR Kindle!!! SO far i haven't been disappointed at all!", "verified": true, "helpfulness": "1/1", "author": "pam"}, {"rating": 4.0, "review": "Setup was a no brainer. It required an update immediately so it did take about 15 minutes to have it in action but the process was very simple.The image quality (movies and games) is excellent. I've tried several movies from Amazon Prime and they look and sound nearly Blu Ray quality as far as I can tell.Navigation is very straightforward and it's generally easy to find anything you're looking for. Installation of games and apps goes very smoothly and generally pretty quickly.The remote works very well. I haven't played with the voice search feature much yet, but when I have tried it, it worked well. The buttons on the remote are well thought out and I prefer it to the Apple TV remote.What I don't like is how Amazon has made it so the\"Prime\" content is mixed with the \"For Pay\" content, with no easy way to just see what is ONLY \"Prime\" content. This is obviously made to divert you into buying more non Prime content...Amazon, please give us a CLEAR way to view \"Prime Only\" if that's what we want. I know we can voice search for anything... and that's great, but sometimes we just want to \"Go Fishing\" and would like to fish in the \"Prime\" pond only. This is a pretty big deal when you compare this to competing (Think ROKU) products that let you do just that.Hard to believe your competition does a better job with presenting your own content than you do. Maybe an update in the near future will \"Fix\" this.", "verified": false, "helpfulness": "5/5", "author": "abraham diakite"}, {"rating": 5.0, "review": "I replaced my Roku 2 with this and couldn't be happier.  The Roku seems unsophisticated compared to Fire TV.  I say that both in terms of the equipment and the TV interface software.  It's quick, sensible, and fun to use.", "verified": true, "helpfulness": "2/2", "author": "Daniel Johnston"}, {"rating": 5.0, "review": "The Amazon Fire is truly terrific....easy to set up, easy to use...an awesome partner to my kindle fire!  THANKS  AMAZON!", "verified": true, "helpfulness": "2/2", "author": "Book Shop"}, {"rating": 3.0, "review": "Its OK...I hope it gets better.  For what it does its cool. But I prefer the PS3 App as it automatically sorts by PRIME and Pay Per View ....this does not.  You get everything in one menu- Pay per View and Prime all in one menu.  I would rather be able to look at just my PRIME bennifits as opposed to searching through the Pay Per View stuff as well....but still have that as an option under \"Non Prime\"  In addition- they need to put in my Amazon Music Library.  You can listen to Pandora on this- but cannot access your Amazon Music Cloud.....not sure what they were thinking there.", "verified": true, "helpfulness": "1/1", "author": "BrettScout"}, {"rating": 5.0, "review": "Work great.  It is the best way to watch not only Amazon but also Netflix and Hulu programing. Only complaint is that the voice recognition feature only works for Amazon content.", "verified": true, "helpfulness": "1/1", "author": "Ticoyo"}, {"rating": 4.0, "review": "I think this is a great start for Fire TV. It is a lot more polished than I would expect from a first gen device. I've owned a Roku 3 (which I dearly love) and Apple TV. I think I will be retiring my Roku.The setup was very quick, painless, and since I have a good high speed Wi-Fi connection the update took only a minute or two and it was all ready.Here's what I like, and then a few things that I hope to see in the future.-----------------------------------------------------------------------------1. Speed - it's really fast, and can stream 1080p content immediately. The menus are snappy and when I connected to Plex the dashboard populated almost instantaneously, which is great.2. Convenience - The voice search is pretty accurate and a refreshing differentiation compared to other streaming devices. It's just a whole lot more convenient than typing on the keyboard.3. Availability of major apps - some good apps (this is also an area of improvement). I got all I wanted as I tend to spend 90% of my time on Plex, Netflix and Prime. Maybe Vevo sometimes. The Youtube interface is terrible. HBP Go is the major missing channel but it's coming this year as we've seen the announcements.What I'd like to see soon---------------------------------1. Integrated voice search across all apps - when I search for a movie I'd like it to pull results from Amazon, Netflix, Plex, and whatever app supports voice search. I read recently that Amazon is opening the SDK for 3rd party to build voice search support, let's all hope it happens quickly.2. Better prime differentiation - right now prime results are mixed with the rest. C'mon Amazon, for a company of your customer orientation it seems improper to try to trick us into buying stuff. Allow for clear Prime differentiation / filtering.3. Voice commands - right now the voice search is a keyword search. For e.g. If I say  \"Netflix\", it shows Netflix as a result. And then I click, choose Netflix app to launch. What should happen is allow for control. For e.g. \"Launch Netflix\" should launch the app. \"Start good wife\" should start the latest episode of Good wife from the watchlist. That's when it begins to get really convenient.Since the hardware is robust, most of these features are software updates and should happen as time goes by. If they deliver on the voice innovations and cross-app integration, we have a winner! The 4* reflects my view that this is a great start with some holes.(I have no interest in games so no review on that aspect. I'm looking forward to the Kindle FreeTime for kids and will update once  I see how that works)", "verified": true, "helpfulness": "1/1", "author": "V Jay"}, {"rating": 5.0, "review": "Best video streaming device yet! There simply isn't a better streaming device on the market. Amazon fire TV is definitely better than all the others.", "verified": true, "helpfulness": "1/3", "author": "Alan Dull"}, {"rating": 3.0, "review": "Easy to set up, easy to use. It needs HBO Go. It could at least have a web browser option, so that I can access it without having to hook my laptop back up to the tv. I'd give it five stars in a heartbeat, but I'm not paying extra to watch Game of Thrones when HBO Go is an option. Add that, and I'll change my review.", "verified": true, "helpfulness": "1/3", "author": "nbarber0000"}, {"rating": 5.0, "review": "We have had Roku for about 3 years now, this is such an awesome device, loads super fast.  It's kicks the SXXX out of Roku.  The voice thing is the best, that commercial with Gary Busey is what it really is like.  Can't speak any higher of this device.Amazon is the above and beyond it's competition...", "verified": true, "helpfulness": "1/1", "author": "Dave86"}]