[{"rating": 4.0, "review": "I like this item, especially for the price  (I got it when Amazon reduced the price to $85 temporarily.)  It's been a little confusing to use with services other than Amazon, but I think I'm getting it down.  I had to \"buy\" a free app for it in order to work with Netflix.  It's terrific for accessing Amazon videos however.  As one reviewer mentioned and demonstrated, the voice search function only works with Amazon.  A search will not pull up titles from other services. It is limited in these ways, but otherwise a very simple device witha very simplistic remote (few buttons) which in the end should make it less confusing than most remotes.", "verified": true, "helpfulness": "0/0", "author": "SunnyBrook"}, {"rating": 2.0, "review": "Remote needs new batteries everyday. Seems to be a problem reported by others on the web forums.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This is a pretty great piece of hardware and for me it runs very well.  I do have some issues with it but they are all software related.  I understand the device is Amazon centric but hiding Netflix and Hulu (or whatever you like to use that is not Amazon prime) only makes me frustrated.  It is FAR to easy to buy movies or episodes if you have children.  Yes you can password protect them but there must be a happy medium in there somewhere between one click purchases and password protecting everything.  Lastly it would awesome if the voice search (which is pretty darn cool) would search within Netlix and other such services.  Honestly that would be a home run right there.", "verified": true, "helpfulness": "0/0", "author": "Donald Francis"}, {"rating": 1.0, "review": "So far, this has been a terrible experience. I've had this for three days, first day it wouldn't let me download Netflix, I stayed up late trying to get it to work. Second day, magically it would download, but I still haven't successfully gotten anything to play on there. So, it was a YouTube/Pandora box. That is, until today, when youtube started crashing every time i tried to play anything, in two different apps. I haven't invested in Amazon Prime yet, I got this as a gift, so I'll have to assume Amazon stuff works fine. But, so far, (take a moment to absorb how sad this is) we keep having to go back to the Nintendo Wii to watch things.", "verified": true, "helpfulness": "3/4", "author": "John Breslin \"johnink\""}, {"rating": 5.0, "review": "I love the Fire TV. It is super fast, the voice search really works, and the interface is easy to navigate. So much better than the Apple TV. I haven't used any of the others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"zip222\""}, {"rating": 5.0, "review": "I have been cable-free for the past 5 years and tried many options to stream media to my TV. From a mac mini to apple TV, Chromecast and roku. Then I tried Fire. Although very similar to the roku, the speech feature makes it really use to find content.", "verified": true, "helpfulness": "2/2", "author": "Ludwig Defrenne"}, {"rating": 5.0, "review": "The Amazon Fire TV is easy to set up, easy to use, and for an Amazon Prime member, a must-have. Every one is reviewing the streaming options, so I'd like to review the ability to play our mp3's from the cloud. Epic! For a music lover, the ease of this is fantastic. Prime has phenomenal free music, and though at this time you have to add it to your cloud first, I do that anyway. Our TV has amazing sound quality, so it's really an outstanding feature. I honestly think my husband enjoys this aspect the most, though he's found some documentary films and other Prime content that is unique. We do have Netflix and Hulu so this is really saying something. A must have for us!", "verified": true, "helpfulness": "2/3", "author": "nansi35 \"Sibi\""}, {"rating": 5.0, "review": "Love it!!  I love this better than the Amazon app on my smart tv.  It's has beautiful screen savers.  Lovely features.  Even better than any Amazon app on a gaming system! So small, so powerful.  Release your inner commander with the voice remote.  It's awesome!!", "verified": true, "helpfulness": "0/0", "author": "Tammy L. Sokol \"texast\""}, {"rating": 5.0, "review": "Very fast and easy to connect. love to watch old movies from YouTube on my big screen.wondering if i can stream from my laptop to my TV via FireTV??if i used the HDMI cable to connect to TV, then what is the use of USB behind?Any Answer???", "verified": true, "helpfulness": "0/0", "author": "Sam Parsi"}, {"rating": 5.0, "review": "So far I haven't had any problems. I'm enjoying this little device.", "verified": true, "helpfulness": "0/0", "author": "Redspikes"}]