[{"rating": 4.0, "review": "I really like how easy it is to use, but as other reviewers have posted that there really isn't as much free movies and shows as I would have liked.", "verified": true, "helpfulness": "1/1", "author": "Wendy Wang \"WangBingWen\""}, {"rating": 4.0, "review": "Such a nice upgrade coming from a Roku 2 XS, the interface is nicely done and snappy. My only complaint is that sometimes the video freezes (audio continues). Hopefully this will be able to be fixed with a software update.", "verified": true, "helpfulness": "0/0", "author": "Lee Hamrick"}, {"rating": 5.0, "review": "This is the way of the future to watch TV, I'm glad Amazon has stepped up to meet the needs- Thank you", "verified": false, "helpfulness": "0/0", "author": "Elaine Acker,"}, {"rating": 5.0, "review": "Kids love it", "verified": true, "helpfulness": "0/0", "author": "Arcelious Sargent"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Fremont J Nebling"}, {"rating": 4.0, "review": "Great little device.  Love the functionality.  Just wish the voice search worked across all my media sources (plex, netflix, HBO.GO, etc.), not just Amazon media.", "verified": true, "helpfulness": "1/1", "author": "Christopher R."}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Izman"}, {"rating": 3.0, "review": "Not impressed! I bought this since I don't have cable but the HBO and other channels need information to show you have a satellite or cable provider. I wouldn't need this device if I had all the channels that require provider to sign in. Frustrating. Waste of my money!", "verified": true, "helpfulness": "0/1", "author": "Finding Love Within"}, {"rating": 3.0, "review": "Ok but the video just does not have the contact that others do. It is great for prime music. Network settings are limited. OK has a way to go.", "verified": true, "helpfulness": "0/1", "author": "Bill"}, {"rating": 4.0, "review": "Being an 'unplugged' television watcher, I have used old computers as my living room tv in the past. I purchased this product mainly to clean up the area around my tv. Since I have become a frequent user of Amazon streaming media, and I wanted the additional cpu power, this product made sense compared to Roku and Chrome's offerings. Below are the high points and low points of my experience with this product. I gave this 4 stars so I am clearly enjoying this product. Don't measure my satisfaction by the number of words I needed to use to describe either the pros or cons.PROS: The voice control works great. This technology has really matured. Sometimes I like to let it diarize a youtube video or other voice recording just to see how much it gets right and it rarely ever fails. The speech recognition models used here are clearly capable of more than just voice search. I also purchased a kit to stash this thing on the back of a television which leaves the tv stand very clean and free of blinking lights and other annoying displays. The device is very small, and sleek and easy to hide.CONS: Aside from speech recognition, the ux isn't great. The ux does not afford any way for a user to discover media. This is a similar trend  with Netflix who recently turned off their public API meaning that their media could not be seamlessly curated by third parties any longer. Rather than trying to get it right, both Netflix and Amazon both appear to be simply giving up on allowing users to surf and share media metadata. I have suspicions that this helps these companies monetize 'shelf space' to media distributors or alternately to promote specific  media so as to offset the pricier distribution deals or the highest margin ones. The end result for me is that browsing is at best like rummaging a thrift store bin. I would almost consider trying to 'outbid' distributors to have the option to curate layers over their media, or in other words I might pay a premium, if such a thing was possible, for the ability to organize the media offered to me as well as owned by me. The only other negative thing I have to say is that there is often no SD option, just HD options, which feels just a tiny bit like ux engineered 'bilking'. My current HDTV doesn't display any appreciable difference between the two formats which adds to that unpleasant feature. I imagine when I upgrade my TV, if there is a difference then I may prefer HD, but I am not in that situation at this time. It is however only a minor inconvenience to purchase the SD version using a different device such as a laptop which is why I say this is only feels like a minor ux bilk. It nullifies the value of this device in that regard and these kinds of revenue engineering instances usually remind me that I need to consider always applying scrutiny when I consider a brand's goods or services and that is something I do not enjoy doing.", "verified": true, "helpfulness": "0/0", "author": "Meadowlark A. Bradsher \"a Kasper Hauser of social order\""}]