[{"rating": 5.0, "review": "Used it right away,easy set up. Amazon prime is a winner,and the line up for shows starting with deadwood makes it so.", "verified": true, "helpfulness": "0/0", "author": "mike c"}, {"rating": 3.0, "review": "When it works its okay but I keep showing my WiFi is connected but with issues memo, so I have to keep restarting the WiFi box by powering down then back up.Its kinda of a pain I don't think you should have to do this every time or maybe my WiFi just sucks.", "verified": true, "helpfulness": "0/0", "author": "Robert Pino"}, {"rating": 5.0, "review": "Truly Amazing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great I love it!!! definitely worth the purchase!!!", "verified": true, "helpfulness": "0/0", "author": "talisha marcellus"}, {"rating": 5.0, "review": "Surprised how much I like this. Thought it would be a nice to have toy, but it has become the primary thing we use for watching TV.", "verified": true, "helpfulness": "0/0", "author": "Wade Fields"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jose Zuñiga Arias"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "john"}, {"rating": 5.0, "review": "Have only had it about 3 days, has met and exceeded my expecttations", "verified": true, "helpfulness": "0/0", "author": "marty"}, {"rating": 5.0, "review": "This is definitely the most fun electronic I've owned. Love the slim remote shape, impeccable voice recognition, sleek slim design of the box itself but the amazing storage capacity it can contain. I love that I can save all my memories on the cloud interface. I bought it for a steal at $60 on cyber monday. Planning on adding PRIME and then cable and me will never had a billing agreement AGAIN!!!Recommended you should buy unless you just absolutely have to have live cable.", "verified": true, "helpfulness": "1/1", "author": "britcharb"}, {"rating": 5.0, "review": "Finally I have it. It's was my only Cyber Monday deal but is worth the money. I recommend it. Now I can make the most of my Prime Membership./Finalmente lo tengo. Fue mi única compra en el Ciber Lunes pero valió la pena lo que pagué por él. Lo recomiendo. Ahora puedo sacar provecho completo de mi membresía Prime. Toodle-loo.", "verified": true, "helpfulness": "0/0", "author": "Almolano"}]