[{"rating": 5.0, "review": "Am planning to buy an additional one even though the TV already has most of the apps on it. The apps are set up better and have a larger selection of apps to add to my system.", "verified": true, "helpfulness": "1/1", "author": "Tom"}, {"rating": 1.0, "review": "one of the worst media players", "verified": true, "helpfulness": "2/9", "author": "Louie"}, {"rating": 4.0, "review": "The Fire tv will start to freeze up. And now you're back to square one into getting the best performance.Quick note, just clear out Amazon's App store data in the settings menu under “applications\" and the memory willl be freed up.", "verified": true, "helpfulness": "0/0", "author": "Gusto"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "joe c morings"}, {"rating": 4.0, "review": "3 stars due to cant listen to Prime Music (Fire Stick can do) & video quality of HD TV shows (Game of Thrones) is not same quality as viewed in PS3. Optical is great to connect to AV receiver to listen music but I wish I can operate what music to play without turning on TV.UPDATE (Jan 3 2015)Gave 4 stars as can play Prime Music via FireTV.  Wish I can select songs or playback from phone without the need to turn on TV.", "verified": true, "helpfulness": "0/1", "author": "SleeplessInPDX \"TechShopper1\""}, {"rating": 5.0, "review": "Received on time and it is as described", "verified": false, "helpfulness": "0/0", "author": "Percival E."}, {"rating": 3.0, "review": "The hardware works prefect, however the Amazon Fire TV needs some \"Quality of Life\" improvements. Like in the store, please don't label \"Try For Free\" games as just Free. They hidden that fact some were in the description of the product instead of just being up front about it. Also make it were you can canceled a download, because if you download something by mistake then you have to wait for it to finish before deleting it. That means you have to let it slow down your internet until its finished. Kinda frustrating to say the least. The UI could use a complete overhaul in my personal opinion, but to each their own. Other then that they could optimize the voice function better, like let you use in apps. For example in YouTube let me voice search for videos instead of painfully typing each word out on the remote. Plus the app market is more the lacking in quality apps, the entertainment apps are fine but everything else is lacking highly in quality and quantity as well. Kinda sad to be honest. A lot of simple quality of life improvements would make this the best steaming/media device to buy on the market for the price range. However, at the moment \"It Would Be Amazing If You Could Do This\" or \"Why Couldn't You Do This\" problems keep this from being amazing.", "verified": true, "helpfulness": "1/1", "author": "Charles Ryan Phillips"}, {"rating": 5.0, "review": "I really like this product alot and it works fine on Guam, USA. For some very odd reason Amazon would not ship this directly to Guam and I had to buy from another source.I really like the Amazon Prime content and I also found that Hulu is a good site to add also. In total, the tv cost per year is about $170 per year versus other tv options.I believe over time this service will get better and better, but I really wish it would be easy to access local news apps available online to stream through the device. I may not be using this correctly though. In general, I really like this device and service.", "verified": true, "helpfulness": "0/0", "author": "Ronald L. Mcninch Jr. \"Real Views\""}, {"rating": 3.0, "review": "Did I miss the part where it says people with direct tv won't be able to watch anything?", "verified": true, "helpfulness": "0/1", "author": "stripedroses"}, {"rating": 5.0, "review": "Great device !!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "jose villaverde jr"}]