[{"rating": 5.0, "review": "This device is extraordinary! The tiny package may fool you, but do not be deceived. I received my Amazon TV Fire last week,,, 10 minutes to setup and I was done. My previous devices, while minimal, cannot compare. They were slow, often pixelated and information entry was horrible. Not so for the Amazon TV Fire, easy setup, lightning fast and simple to operate. I participated in a consumer survey and it took longer than learning the Amazon Fire TV. Nice work Amazon!", "verified": true, "helpfulness": "1/2", "author": "RichardH_OEM"}, {"rating": 1.0, "review": "If you own an Amazon Kindle Fire, then you don't need to buy this product.  You don't need to spend $99 plus the cost of the cable.  Save yourself the money.  The Amazon Kindle Fire does everything this does.I am going to return the Amazon Fire TV. I used it for a couple of days and found that I didn't need it.  I am returning it.ALWAYS READ THE BAD REVIEWSUpdate 4/22/2014:Take care to notice that there is a \"group\" of bullies that feel compelled to write derogatory comments on the 1 & 2 Star Reviews. Feel free to report them as abusive, there's a button there for this. You can also write Amazon's Customer Service.Take notice that the Vote count of whether reviews are Helpful are unusually skewed to the \"not helpful\" in the 1 & 2 Star Reviews. Makes you wonder about the Integrity of what is going on. You're an Amazon Purchaser and Reviewer, are any other products so heavily skewed in the No vote?Take care to notice if the Review is by an actual Verified Purchaser because those are your honest reviews.Take care to notice if the Comment is by an actual Verified Purchaser because those are your honest and helpful comments.If you get a bully comment, take notice that it is from someone within the same group and they actually don't have a Verified Purchase Review.  Again, you can report the Comment and the Commenter as abusive.  You can even write Customer Service.It is time to call out Amazon on what is happening.Thanks!", "verified": true, "helpfulness": "5/24", "author": "Tina"}, {"rating": 1.0, "review": "I was all excited when I saw amazon had their version of Apple TV. My wii stopped connecting to the internet and my boyfriend and I could no longer watch Alton Brown's Good Eats through it, hence my excitement of Fire tv. When we say down to an episode together only a week after struggling to watch it on the wii, his show and seasons were no longer free and under the free prime shows. I want no part of this device or membership if they are going to act like a cable company and changing their \"lineup\" so to speak. I returned it the next day and continue using Netflix, where I know everything is free and what I'm watching will be there the next day.", "verified": true, "helpfulness": "7/21", "author": "J. Goss"}, {"rating": 5.0, "review": "I had Roku and Apple TV. Bought the \"Fire\" mainly because of the direct access to \"Prime TV\" not expecting anything much different. To my pleasant surprise the Fire outperforms both Roku and Apple. I sold my Roku and kept Apple but find myself using the Fire mostly. What's so good about it? Performance, Image Quality and Content. The program listing presentation will be familiar to android users and in my opinion not as user friendly as Apple. I am not a big fan of the horizontal scroll. I'd rather have a page presentation for content. That aside The Fire is a winner and raises the bar, watch out Apple!", "verified": true, "helpfulness": "1/1", "author": "Edgar P Rutten"}, {"rating": 3.0, "review": "The controller that I ordered with my Amazon fire TV is not working and no directions were sent with the controller.", "verified": true, "helpfulness": "0/4", "author": "Jadam"}, {"rating": 3.0, "review": "I like the speed of downloads and smooth playing movies. I find it confusing amazon prime is always logged in if not careful purchases can be made unaware. Apps I am use to like Vudu and HBO on the go  are not available. My kids like the games but I am not a gamer. Voice mode is not as straight forward as in the adds.", "verified": true, "helpfulness": "0/3", "author": "Elbert R. Goodall"}, {"rating": 5.0, "review": "Installation is very easy and there are so many things to choose.  Going to get another.  Great gifts for the price which is so reasonable!", "verified": true, "helpfulness": "1/1", "author": "Mary Ann"}, {"rating": 4.0, "review": "The Amazon Fire TV is a great streaming box, however, it has some growing pains that it needs to deal with.The interface is nice, but could use some work. I think each of the categories, ie TV, Movies, Games, Apps, would benefit from a search function displayed at the end that searches within that category, this will help a lot when the platform matures.I was having a hard time trying to figure out what Apps were available until I realized there are hardly any. The few categories that are presented are all that exist, and the selection is quite low. I would like to see a lot more added, hopefully sooner than later.It is also of course an Amazon box, and I dislike that when you browse by genre more times than not the show you are presented with is not part of Prime. This is annoying as I am sure the majority of users will subscribe to Prime & Netflix but avoid at all costs renting/buying from Amazon, despite their best efforts. I understand why it is setup the way it is, but Amazon would have scored major points if it had seperated all additional paid content into two categories of their own at the bottom of the genres and TV/Movies entitled \"Rent\" and \"Buy\" respectively.Same goes for gaming. I think it was probably a good idea to limit the games that would run on Fire TV in order to make sure quality control is in order. But once again, there is not a large selection.Sadly one of the biggest complaints I have are in regards to the game controller and general input, whether using controller or remote.First off, the game controller is horrible for browsing the interface. The D-Pad being one solid piece of plastic is a detriment to its usability. Nearly every single time I browsed a category and sometimes multiple times, attempting to navigate left or right resulted in the Fire TV registering a slight upward angle on the D-Pad, this either moves you into the tiny heading menu or kicks back to the start of the category. Extremely frustrating. This same D-Pad design ultimately led to the XBOX 360 controller being redesigned and why many, although I admit it is probably no longer the majority, of people prefer the Playstation controller, myself included. I did not try out a 360 wired controller, although I imagine it is at least much better than the Amazon Controller.There was also noticeable input lag when I was playing Sonic 1 & 2. Moreso from D-Pad input than button input. Jumps were fine although not perfect, but D-Pad input lagged, causing me to miss many moves, especially those involving down presses to spin roll through breakable objects. The game itself looked great, probably better than the original Genesis game, although I did not switch inputs and compared to my still hooked up Genesis. [That would have been fun, next time]The input woes contiued with the remote. The navigation control with the remote was nearly flawless. Unfortunately the system would sometimes ignore \"OK\" button presses, meaning the big button in the middle of the navigation circle. I would browse through content to watch press the button and nothing would happen, I pressed it again and the show started playing. Not all the time but enough to make me wonder if I had to press the button again in order to start the show nearly every time, sometimes being true and sometimes merely being an annoying anxiety. Lastly, it is also annoying that holding down left or right in order to return to an item in a category, scrolls much slower than if you tap in the same direction multiple times. This needs to be fixed so that it accelerates faster to a blurring speed in order to return to the first few items. Now that I think of it I guess you could press up, which I did to much frustration so many times on the controller, as long as there is no heading menu like in some of the categories. Or all of this could be avoided by a lopping category, which I would vote for.Voice search is nice and accurate but I think I would prefer the remote w/headphone feature, to each their own.I know my review sounds negative, but I felt it was only important to point out the few grievances I had with the player. Everything else is great. The hardware is excellent, the performance is smooth. I want this player to win the battle for my living room, it just hasn't been able to do so with this first iteration. I realize that more apps will come, but I can also wait. For now the Roku 3 wins, I am sending this box back. But I badly want the Amazon Fire TV HDX to be my end all and be all media streamer/player", "verified": true, "helpfulness": "3/3", "author": "Rene Shabastari \"Slash\""}, {"rating": 4.0, "review": "Works just as well as the commercials imply it will.  Very good quality video, no issues with the interface, and the voice search has been accurate 100% of the time (only takes a few seconds to get a result).  The only negative I have is that it doesn't support \"X-ray\" (information about the actors in a particular scene), which I've come to expect after having had it on my Kindle Fire HDX.  Hopefully Amazon will add this feature, at which point I'd give this product a full 5 stars.", "verified": true, "helpfulness": "0/0", "author": "John Posavatz"}, {"rating": 5.0, "review": "Love it! Saving us a ton of money, works great and fast, voice feature is VERY accurate and fast! Best decision to cut off cable.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Bockenhauer"}]