[{"rating": 5.0, "review": "I have a Vizio smart TV that's a few years old.  When I use the smart function for Amazon Prime Videos it has a lot of problems, among these are making the TV reboot in the middle of a program, it is not happy with pausing for more than a few minutes and if you stop a program and try top start again where you left off it will make the TV reboot.This was really getting annoying, but not enough to throw away an otherwise perfectly good 42\" TV and buy a new one.  Then I found out about the Amazon Fire TV.  I ordered it on my Prime account and payed a little extra for next day delivery.I have been using for a couple of days now an it is GREAT.  It's fast - it has a beautiful user interface - no more rebooting of TV - I can pause it for long periods of time - the list just goes on and on, and if the TV gives up I can just buy a less expensive none smart one.It has voice search - works great.it has a very fast response to everything I have tried.I have not tried any games yet - I may not ever.For those interested this thing uses the Android operating system behind a Very well done smart TV interface.I have it setup with an automatic outlet strip so that it turns power on and off to the Fire TV when I turn the TV on and off (there is no on/off switch - Amazon says it is not necessary because it goes into sleep mode after 30 Min).I have not had time to try all the things this gadget can do, so I'm still learning, but so far every thing is GREAT!", "verified": true, "helpfulness": "2/4", "author": "J. Sutton"}, {"rating": 3.0, "review": "Not available to vuduWould be amazind if applications on the smartphones or other tablets are availiable to mirror other devices to the TV", "verified": false, "helpfulness": "1/12", "author": "javier gonzalez"}, {"rating": 3.0, "review": "It seemed zippy, but voice search only works with Amazon content... it doesn't search across NetFlix which would've made it genuinely useful. Ultimately it's just another little box - the edge goes to Apple TV for content. All the Prime movies were 90's era time warps.", "verified": true, "helpfulness": "1/8", "author": "N. Williams"}, {"rating": 3.0, "review": "I'm still using an old Android-based google TV. I'm not convinced that any of the devices in the market are much better. Amazon Fire TV seems like another me-too product. I hope to see more innovation on the next generations.There are more Internet providers offering giga speed. I really hope that Amazon adds a fast ethernet port to the device on the next generation.", "verified": false, "helpfulness": "1/16", "author": "Keyavash Efatpanah \"Keya\""}, {"rating": 4.0, "review": "Easy set up, seamless connection with Fire HDX.  Able to sling my HDX content onto TV without a problem. No issues with wireless connection. The voice search feature is brilliant,fast accurate searching.  No need to use the type on screen feature that is common and so painful with internet tvs. Nice solid feel to the remote.", "verified": true, "helpfulness": "3/5", "author": "RileyCtr"}, {"rating": 5.0, "review": "This is an excellent method to access Amazon's video products. The videos load with lightening speed. I would highly recommend Fire TV for anyone with an HD TV.  It is more than worth the $99 price tag.  Leaves Apple TV in the dust.", "verified": true, "helpfulness": "3/5", "author": "Loin Boy \"docphoto\""}, {"rating": 2.0, "review": "So, I really wanted this to be a game changer.  I want to use my prime video account more (currently I don't use it).  I thought with the voice search and plex/roku like interface I'd be able to easily access more.  This just wasn't the case.* It isn't easy enough to find content I wanted to watch at a price I was willing to pay.  Maybe it's just me, but don't feel like I get a lot of good content from prime.* It doesn't make it easier to use my personal collection.  I can use plex like I have been, and that's fine.  But it isn't included in the search feature and it feels too removed.  Maybe this isn't amazon's fault.  I just thought everything was more integrated.* Didn't find the gaming compelling.  Amazon frustrates me with their fragmented play store.  Just open it up.* I feel like in Amazon's Fire TV world there are lots of confusing bubbles of content.  The search should help me feel less distracted by the chaos of variety.. it just doesn't make much sense.It feels a bit of a mess... maybe it will change with time.  I just won't be waiting to find out.I'll be going back to my old HTPC with Plex for my media collection, Netflix, and HDHomerun for TV.Maybe Android TV will be better...?", "verified": true, "helpfulness": "6/15", "author": "Jake"}, {"rating": 2.0, "review": "A nice product, well made, works well, very fast and well designed, but the content is lacking, with too much emphasis on selling content . Basically an Apple copy.", "verified": true, "helpfulness": "4/15", "author": "Samuel Dachs"}, {"rating": 5.0, "review": "The Amazon FireTV is replacing my Google TV box I have been using for 2 years.Pros1- I love how small and silence the box is.2- The remote control is very responsive.3- The voice search feature works perfectly and fast even though English is my second language, the box sometimes understand what I say more than my wife.4- The games are surprisingly good I ended up playing for a while.5- The Fire controller is great design and I love the music control buttons.There is no real cons, However there is things can be improved1- The ability do control volume with remote control.2- It will be great if they add Web browser.3- It will be great if it had HDMI In and HDMI out so you don't have to switch inputs.This is a great device and have many potentials if you are in the market for a set-top box or Android game console this is the best thing you can have.Update...I have been using Amazon FireTV almost every day since it came out, and I am even more impressed now. just how fast the box is in general. My wife was never into games, but now we both use the box to play games together.This is the set-top box every one need.", "verified": true, "helpfulness": "5/8", "author": "Albyati"}, {"rating": 5.0, "review": "Pros:The voice search is really cool.  We had a hard time trying to trick it.  It even knew French and Spanish movie titles.The content loads fast and it looks and sounds great.  I thought there might be lags, or the load spinner, or pixelated graphics, but it looks and sounds great.Cons:I spent way too much time this weekend watching TV.", "verified": true, "helpfulness": "4/5", "author": "sgo73"}]