[{"rating": 5.0, "review": "It's a great device!!!", "verified": true, "helpfulness": "0/0", "author": "Thurman Thomas iii"}, {"rating": 4.0, "review": "I got this so the Darling Bride could stream our Prime Instant videos. An added benefit are the apps. For example, we got a fireplace app that looks and sounds phenomenal on our 65\" UHD 3DTV.The only things I would have added to improve this device are: (1) UHD 4K support; (2) 3D support; and (3) HDMI input for pass-through. As it is, I can't connect our Satellite input through the Fire TV... so both have to have their own inputs to the TV. If Fire TV had pass-through, I could connect the Satellite to the Fire TV and then the Fire TV to the TV, giving me the ability to watch either without switching inputs.As-is, though, it's a capable streaming device, especially if you have Prime Video.", "verified": true, "helpfulness": "0/0", "author": "The_Chief"}, {"rating": 1.0, "review": "always buffering slow internet", "verified": true, "helpfulness": "1/6", "author": "jason klimaszewski"}, {"rating": 5.0, "review": "Works just like advertised.", "verified": true, "helpfulness": "0/0", "author": "candace valeriano"}, {"rating": 3.0, "review": "I got it for $85....,but regretting....due to controller issuesPros. Fast and stable as many other user mentioned.Cons. The remote some how is too sensitive or just mine is not function correctly.  It skips or jumps extra as I pressed the navigation direction buttons. I have ordered their gaming controller, I will make the comment after using it.", "verified": true, "helpfulness": "0/0", "author": "Hong Wei Pan"}, {"rating": 4.0, "review": "Pros: Amazon Prime integeration; 2G Ram; fast processor. individual remote controlCons: The UI needs some improvement. Apps store is hard to find thingBasically, very solid device that my other set top boxes or sticks are sitting on my desk and collecting dust.", "verified": true, "helpfulness": "0/0", "author": "Kevin Lam"}, {"rating": 5.0, "review": "Very easy to use and set up.  So very pleased with this purchase. I know it will get a great deal of use.", "verified": true, "helpfulness": "0/0", "author": "T. Barrett \"Phantom Viewer\""}, {"rating": 3.0, "review": "Not too many movies for free not what i thought it was", "verified": true, "helpfulness": "0/1", "author": "Thomas Botha"}, {"rating": 2.0, "review": "Not as good as the Roku. I was not happy with this one. I returned it. I like the remote of the Roku better. It juypest did not live up to the hype.", "verified": true, "helpfulness": "0/1", "author": "TEXAS ROCKS!"}, {"rating": 5.0, "review": "Since we received this we hardly use our regular cable anymore", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]