[{"rating": 5.0, "review": "I'm in love with Fire.", "verified": true, "helpfulness": "0/1", "author": "Jennifer Ward"}, {"rating": 5.0, "review": "Super easy installation and easy to use! You can't go wrong when it's so right! Glad I made the purchase.", "verified": true, "helpfulness": "0/1", "author": "kim young"}, {"rating": 5.0, "review": "After using the Roku HD for several years, I decided to switch to the Fire.  The Fire TV has a friendlier screen, loads faster and scrools much smoother than the Roku HD.  The voice search works very well.  The other stations I used were found under \"apps\" so all is well.", "verified": true, "helpfulness": "0/1", "author": "Albert R. Eurs"}, {"rating": 1.0, "review": "So far sucks", "verified": true, "helpfulness": "1/13", "author": "Bob"}, {"rating": 3.0, "review": "We had nothing but trouble getting it to work. ,I called Amazon and talked to 3 different people and they were not much help,all they did was have me send it back and get a new one. When that arrived it still didn't work . I asked your tech if I needed to buy the Amazon HDMI cable he said no. Well I talked to 2 other people that had them and had the same problems. Number one why don't your techs know that and why arent you telling people that it won't work without that? We bought 2 other ones and they wouldn't work,until we bought yours. You advertise this is easy to set up. I have not talked to anyone who has bought this that agrees.", "verified": true, "helpfulness": "0/2", "author": "S. Pauling"}, {"rating": 1.0, "review": "Does not offer as many channels as Roku", "verified": true, "helpfulness": "1/7", "author": "steve"}, {"rating": 5.0, "review": "Performs like a champ.", "verified": true, "helpfulness": "0/1", "author": "R J Kruppe"}, {"rating": 5.0, "review": "Very fast", "verified": true, "helpfulness": "0/2", "author": "Bajan"}, {"rating": 5.0, "review": "I've only had my Kindle Fire TV for about 3 weeks and I am absolutely loving it.  It is very easy to use.  I took advantage of the 30 day trial offer of Prime and  I have been able to watch quiet a few movies.  I would absolutely recommend it.", "verified": true, "helpfulness": "0/1", "author": "Marlene"}, {"rating": 5.0, "review": "Love the spoken command. Makes it so much easier to get to what you are looking for. Goodbye 'search'.", "verified": true, "helpfulness": "0/1", "author": "Cappy in Naples \"Ken\""}]