[{"rating": 3.0, "review": "Cannot access HBOGO with comcast 105 mbps internet?  The option to select comcast is not there?", "verified": true, "helpfulness": "0/0", "author": "TKv"}, {"rating": 4.0, "review": "Does what they say it does", "verified": true, "helpfulness": "0/0", "author": "JoeFern"}, {"rating": 4.0, "review": "Love the excellent voice activation. Love being able to quickly find anything on Amazon Prime, Netflix, Hulu etc. But it sometimes goes down for no reason that I can tell. I also dislike that it is always on. Reminds me of Apple stuff...I find that wasteful.", "verified": true, "helpfulness": "1/1", "author": "Canary"}, {"rating": 1.0, "review": "Is this compatible with the \"Claro Video\" app?can I download any app from the Google Play?", "verified": false, "helpfulness": "1/6", "author": "Oswaldo Salgado"}, {"rating": 5.0, "review": "Exactly what I was expecting.  Refreshing to get rid of expensive cable/satellite tv.", "verified": true, "helpfulness": "0/0", "author": "Paul L."}, {"rating": 4.0, "review": "I have only occasionally used this device since buying it July 2014. It worked great until this week. For some reason I'm unable to view my Netflx shows. It says my internet connection is solid, and it will pull up the show, but then cannot play it. Anyone else having issues?", "verified": true, "helpfulness": "0/0", "author": "J. Wilson"}, {"rating": 2.0, "review": "I thought that there would be more recent movies and benefits to being a Amazon prime member but the number and quality of free movies and shows was disappointing and more expensive than cable.  I can rent movies for 2.00 at red box or get net flicks for much less. I haven't decided what to do yet and I will keep my prime for shopping and books. I believe amazon can do better than this.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love it!  Easy to use, easy to install, good selection of apps and programming.  Love the ability to watch in a hotel with the new captive portal capability.  Glad to cut the cable cord!!", "verified": true, "helpfulness": "0/0", "author": "Joel"}, {"rating": 5.0, "review": "I have used the unit for a few months now and find it does what it says. The voice search is neat but not a must have. It is very fast and the performance is excellent. The only problem I have had is occasionally when a show I'm watching comes back from commercial break (like when using Hulu) the screen is black but the sound still works. Backing out of the show and resuming the show usually resets the video. This is rare but does happen for me. Not sure if Amazon Fire TV is the problem or Hulu. I do find myself using the Fire TV more often than my satellite these days.", "verified": true, "helpfulness": "0/0", "author": "TJW"}, {"rating": 5.0, "review": "Have had the Fire TV for a few weeks now and my entire family absolutely loves it.  Very happy with the content available and would highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "deejay"}]