[{"rating": 5.0, "review": "About the only programs we watch live are sporting events and news.  Most of the rest of our time spent watching TV is now through Amazon Fire TV.  Granted, my wife and I do not spend a lot of time watching TV, but the time we spend now has a better quality with no advertisements.  We have only had our Amazon Fire TV for a week, so there is still a learning curve, but to this point we love it.", "verified": true, "helpfulness": "1/1", "author": "Erich Wittig"}, {"rating": 5.0, "review": "Hearing about Amazon Fire TV, I bought it thinking it was cheap enough to take a risk.  I plug it in and to my suprise, it worked.  Amazon Fire TV is simply amazing and easy.  Even the voice search works great.  Amazon Fire TV is Amazing.", "verified": true, "helpfulness": "1/1", "author": "Martin Krzywicki"}, {"rating": 5.0, "review": "I had been reading up on these kind of devices.I kept waiting to see if this is something that I could use  and get my money's worth.I love this one. So easy to set up and use.Only had it for 2 weeks and it already has been worth the $$.", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "You will love this it's super great to use and is a great product to buy get one today you will love it", "verified": true, "helpfulness": "0/0", "author": "Jason D. Smith \"Jason Smith\""}, {"rating": 5.0, "review": "My streaming media roots go deep.Sometimes I feel like I have owned every streaming device under the sun...Here is a list, of the streamers I have owned. I might be forgetting one or two.Apple TvRoku 2Roku 3Sony Streaming blu-ray playerNetgearBoxee BoxWD Live TvRaspberry Pi with xbmc (openelec and raspbmc)radxa rocks with android and xbmcHome theater PC with xbmc, plex, medial portal, boxeeThings I like about the box:Design:The box itself is sharp. Its very small, and tends to meld into my blu-ray player so most of the time I don't even notice that it is there. The device feels solid in your hands. I felt like the only other device that felt as solid was my apple tv.Interface:The interface is really a matter of personal opinion. I personally like the clean lines the interface provides. I also like how you have the media root tree on the left with the apps on the right. The interface to me is much better than the WD Live, Netgear, and Sony.Voice support:One of the cool things that I realized was that you can say things that aren't necessarily the title, and sometimes still get the correct results. One example is I let my 19 month old daughter talk into the remote to say, \"Elmo\", and it pulls up sesame street.Response:This has been the most responsive device I have used (sans HTPC, because it isn't a device). Moving back, and forth through menu items is fluid, and fast. I can scroll through multiple movies without the device starting to lag after awhile.Instant Videos:The instant videos are one of my favorite features. It gives you a small glimpse of how streaming video should be across the board, no matter which streaming provider you use.Plex Support:Plex is like a fine wine. It only gets better with time. If you use Plex for local media it has one of the best looking Plex apps. All of the media I have thrown at it seems to work cleanly. However, I am using the plex pass server side, so I think my experience might be a little better than others. As they have an amazon fire tv profile now on the server side.Games:It's really nice that a hundred dollar streamer comes with the ability to play games via a controller. This will be huge down the line when more developers write games to take advantage of a controller. I played Terraria, and sev zero. Both ran pretty well.Things that are \"so, so\":Remote control:I really wish they would have put the back, home, and menu buttons above the navigation pad. I get that they put them there, because on android they are on the bottom, but when using any other remote you expect them to be above the D-pad.Things that can be improved:You need a way to be able to restart the box easily. There isn't an option I have found in the settings that let you restart the box if needed. Power down would also be nice, as I normally like to power down my devices before disconnecting the physical power source to move it or rearrange the wires.Interface:Sometimes you can forget exactly what media tree you are in, and have to take half a second to step back, and remember how to navigate correctly. The interface is not as intuitive as Apple tv or Roku. For some reason to me, it feels like it doesn't take full advantage of the processor that they put in the fire tv. One example of how the interface is a little confusing is the home screen. Sometimes you are going through movies on the home screen, and forget that you aren't in the movies category.Direct local network media support.I use Plex for my local content right now, but not everyone likes to use Plex. There are many users that use low power NAS devices that can't really support the media transcoding that Plex needs to perform from time to time. I would imagine that amazon skipped this part A. They don't make any money off of local content. B. Anyone who has read the Boxee, and XBMC forums knows that when you go down that route you have to dedicate a considerable amount of development effort to get it to work correctly.If you are into local content, and don't have powerful NAS you might want to skip this box for now. You will be left a little disappointed.Voice SupportYes, I do know that it only supports amazon's content right now. I also know that, that isn't just amazon's decision. Netflix as one example doesn't allow search outside of the netflix app. Netflix dissallowed external search some time ago. I think they have a couple partners that allow it, but I don't think it's open to everyone. Even that aside it would be nice to use the voice search with Plex, and Pandora. Hopefully this is something that will be allowed now that the box is open to the public.App Support:Roku's app library is second to none. Amazon really needs to spend some time getting developers on board. There are some apps like spotify, and slacker that I feel like should have been included at launch.It's kind of hard for me to believe that amazon didn't include the cloud player for music. It's one of their services, you think they would have included it. Maybe they are trying to work out something with the record labels.In summation, for someone who has owned more media streamers than he likes to admit this is one of the best. Of all the streaming media players I have used, this one is becoming my primary streaming device. The big three apps that I spend time in are Amazon VOD, netflix, and Plex, so it fits my needs most of the time. When people are asking me what video streamer I recommend I'm now pointing them to the Fire TV.", "verified": true, "helpfulness": "6/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little gem is super!  Had just bought a different streaming product which didn't work at all, when I saw the Amazon Fire TV on your site.  Returned the other one!  Glad I did as this one is exactly as advertised.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I would recommend the Amazon Five TV to anyone who wanted a crystal clear picture, ease of use and a  great selection of movies, TV shows, etc.", "verified": true, "helpfulness": "0/0", "author": "KAREN E. REINAGEL"}, {"rating": 5.0, "review": "First a device I couold hook up by myself, easy not at all complicated.  The menu is clear and concise.The selections are equal if not better to other products, anmd services out there.", "verified": true, "helpfulness": "0/0", "author": "Marian S \"Marian\""}, {"rating": 5.0, "review": "Amazon Fire is way better than Apple TV.  Love the voice activated search feature!  I highly recommend this product .  You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Baby BASH"}, {"rating": 5.0, "review": "So far I really like this device.  Only thing I don't like is that you cannot power the device off.", "verified": true, "helpfulness": "0/0", "author": "Bruce Gubser"}]