[{"rating": 4.0, "review": "It works as advertised but it does not work my universal harmony remote.", "verified": true, "helpfulness": "0/0", "author": "joe ledoux"}, {"rating": 5.0, "review": "Love it!!  So easy to use and set up!  Much better than google chromecastapple.", "verified": true, "helpfulness": "0/0", "author": "T. Page"}, {"rating": 5.0, "review": "Unbelievably easy to setup and use. All my previously bought Amazon Prime movies loaded instantly. I use it every day", "verified": true, "helpfulness": "1/1", "author": "Dolly Malec"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Jennifer Miller"}, {"rating": 5.0, "review": "We love the Amazon Fire! So worth ditching cable for!!", "verified": true, "helpfulness": "0/0", "author": "CLJ0521"}, {"rating": 5.0, "review": "I'm actually surprised at how much I like this. Two things really stand out:1. It's FAST. The one-time setup is fast enough, but then once it's up the speed of selection is amazing. You find what you want and, bam, you're watching it. Really impressive speed.2. It's easy and intuitive. There are hardly any instructions that come with it, but guess what: you don't need them. Plug it in, follow a couple of instructions, and before you even realize it you're in full control.It's got all the features described and expected, but a few others are nice too. One in particular is the Prime Music integration. If you have Prime then you can use Prime Music, and if you run Prime Music through Fire TV (which, again, is really fast and easy) then it will not only play the songs but also scroll the lyrics on your TV in real time. Cool little features like that are found throughout.", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 5.0, "review": "Very nice.", "verified": true, "helpfulness": "0/0", "author": "Scott McCammon"}, {"rating": 5.0, "review": "Everything it claims to be", "verified": true, "helpfulness": "0/0", "author": "zachary carroll"}, {"rating": 3.0, "review": "Its just ok, it didn't live up", "verified": true, "helpfulness": "0/0", "author": "cornell749"}, {"rating": 5.0, "review": "Great item.", "verified": true, "helpfulness": "0/0", "author": "L. Dallal \"kindlelover\""}]