[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Dagny \"Dagny\""}, {"rating": 5.0, "review": "Very nice amazon fire tv , great products , very happy with this tv , it's better than roku , Apple TV , I have other too. It this is very excellent products and fast too , play games on big screen in HD amazing quality ,", "verified": true, "helpfulness": "0/0", "author": "Lalit"}, {"rating": 5.0, "review": "Ingenious device! My only complaints have to do with the remote. 1. It is so small that it is easily misplaced. 2. The keys arent lit.", "verified": true, "helpfulness": "0/0", "author": "Steve Partridge \"CroMagArtiste\""}, {"rating": 3.0, "review": "UPDATE -ROKU - ONCE YOU PAY FOR THE DEVICE YOU CAN USE IT NO MATTER WHAT - FIRE TV? NO- it will only work even for 3rd party apps like HULU & NETFLIX if you have Amazon Prime - if you cancel Amazon Prime those 3rd party vendors DO NOT WORK. Had I known I would not have paid 99 bucks for the FIRE TV to use only one service AND Block the use of 3rd party apps if I cancel my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Anna Engelbrecht"}, {"rating": 5.0, "review": "Bought the Amazon Fire TV for my \"dumb\" TV in the bedroom. Already had Amazon Prime subscription so it only made sense. Never owned any other set top box, so I don't have anything to compare to. It is, however, much faster and easier than the interface of my \"smart\" TV and Bluray player. The box is very easy to set up and use. It has a nice low profile, but a larger footprint than the competition. I have mine hooked up with an Ethernet cable to maximize speed and stability. My only gripe with the design is the bright white LED on the front. The interface is fast and simple to use. Streaming video quality is excellent. Not quite Bluray, but close enough for most people. I haven't played any games on it. Not sure if I will. The game pad is available separately. The included remote is small and simple. I've only used the voice search once-\"Gary Busey\", and it worked. I've read that the voice search won't work inside of 3rd party apps like Netflix. Overall a great product, if you need a streaming device. A perfect compliment to a Prime subscription. Free access to a huge library of TV/movies. The packaging and unboxing alone are worth a hundred bucks.", "verified": true, "helpfulness": "0/0", "author": "Ned Ryerson"}, {"rating": 4.0, "review": "It occasionally will charge me for things I've already bought. Super annoying.", "verified": true, "helpfulness": "0/0", "author": "irene"}, {"rating": 5.0, "review": "It is great, very efficient.", "verified": true, "helpfulness": "0/0", "author": "G. E. WHITMAN \"Glenda-Loves to Cook\""}, {"rating": 1.0, "review": "This item does not work with the hotspot on my cell phone.", "verified": true, "helpfulness": "3/6", "author": "PAUL GUNN"}, {"rating": 3.0, "review": "Great replacement for Roku. Lots of movies and tv shows on prime to take advantage of. Also plays faster with less buffer than my Roku. Only problem, and it is a big one: no HBO GO? You have yo pay for HBO Shows on Amazon.", "verified": true, "helpfulness": "0/0", "author": "Redbird"}, {"rating": 5.0, "review": "I bought it for my wife.She Loves It.The voice activation works great.Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Joseph A Razzano"}]