[{"rating": 5.0, "review": "amazing product.", "verified": true, "helpfulness": "0/1", "author": "Muhammad Azmi"}, {"rating": 2.0, "review": "There are several problems with this product. The Netflix app does not work and there is apparently no action being taken to fix it. Amazon Prime costs about $100 a year. Amazon Fire TV a similar amount. Yet, the two may or may not link. Even when they do, this vast library of movies does not contain many of the movies we are interested in. For those you have to pay extra. Customer service is another issue. E-mails sent with questions are met with the reply to call. If I could have called, I would have. On the plus side, all of this should be correctable if they choose to do so. Picture quality is great. Download speed and connectivity all great. Just not as awesome as billed.", "verified": true, "helpfulness": "0/2", "author": "Craig J. Brown"}, {"rating": 4.0, "review": "It is great for watching Netflix and Amazon movies. The picture provided is fantastic. However I am giving it 4 stars because it is not yet able to replace cable television. There aren't enough channels available yet.", "verified": true, "helpfulness": "0/0", "author": "Antonio Garcia"}, {"rating": 5.0, "review": "Love it!  I wish this had come out a year or so ago--before I bought my Smart DVD player.  I only bought that to have easy access to Prime and Netflix.  The ease in setting this up was straight-forward and quick.  I'm not tech savvy, yet even I had no difficulty with getting this to work.Amazon products, in general, are amazingly simple to use, yet they provide excellent quality. Amazon Fire TV is no exception.  I opted for the box instead of the stick because I wanted to be able to search by voice.  Super easy!  It worked right the first time, and every time since.Bravo, Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Janet"}, {"rating": 5.0, "review": "Incredibly easy to install and the voice command works great. Very easy to use. By reading the reviews, I took the advice to set up my Watch List on Amazon via computer so when I installed it a brought it up, everything I wanted to watch was right on the screen.", "verified": true, "helpfulness": "0/0", "author": "Louis G. Biondi"}, {"rating": 5.0, "review": "Easy to install.  Easy to use.  I love all the prime options and added Netflix which is also easy to install and use.  Playing my prime music is another bonus.  I'm not a gamer but I'd bet that's great too.", "verified": true, "helpfulness": "0/0", "author": "gadget geek"}, {"rating": 5.0, "review": "Was running extra's through cromecast so I had not anticipated the difference.  I am sold on Fire TV and am telling all my friends!!", "verified": true, "helpfulness": "0/0", "author": "Sandra J. Allen"}, {"rating": 2.0, "review": "I purchased this thinking it would provide internet TV and it definitely does not do that.  Previously, using my laptop, I could stream news from local TV stations through their web site.  I could watch earlier episodes of most TV shows on the network web sites.  There are a lot of stations that stream live and none of this is available on the Fire.  If there is someone out there who knows how to access the internet sites through the Fire, please let me know.  For example, how do I watch TBN on the Fire?  it has live streaming available 24/7 on the internet.  The main benefit so far is that I don't need to turn the Wii on to watch Netflix or Amazon Prime movies.", "verified": true, "helpfulness": "0/4", "author": "Dave"}, {"rating": 5.0, "review": "Love it so far!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Way better than other players.  Remote response is quick and screen movement between apps and screens is really quick as well.  Highly recommend!  Looking forward to more apps coming in 2015.....", "verified": true, "helpfulness": "0/0", "author": "P. Robitaille"}]