[{"rating": 5.0, "review": "I LOVE MY AMAZON FIRE TV BOX, I GOT RID OF DISH AND NEVER LOOKED BACK I HIGHLY RECOMMEND", "verified": true, "helpfulness": "0/0", "author": "Ukraine86"}, {"rating": 3.0, "review": "The box itself work seems to work fine for Amazon videos. For anything else, it's a crap shoot.Netflix works fine although good luck finding your queue (seems the Netflix app for Fire TV does not allow you to view your queue, which of course makes the queue totally worthless).Hulu Plus is another matter. It is simply useless on the Fire TV. This app is TOTALLY WORTHLESS. And in case that isn't clear enough, HULU ON FIRE TV IS A TOTALLY WORTHLESS PIECE OF CRAP. It has no problem showing the commercials, but the actual show you wanted to watch? You won't see it. AT ALL. All you will get is audio. No video. The issue has existed for a VERY long time, yet Hulu has never bothered to fix the problem. In fact, multiple attempts to resolve the issue with Hulu support leaves little doubt that Hulu actually does not care that there is an issue. Were they actually dealing with the issue they would give an indication that they are aware of the issue and at least have some clue that it is a problem with the app. Instead they generally act as if the problem is either the fault of the user, their internet connection or their ISP and insist that the user repeat the same process for \"diagnosing\" the issue and repeat the same failed and useless \"fixes\" every single time.IF YOU WANT TO WATCH HULU THE AMAZON FIRE TV IS NOT THE DEVICE TO USE. Go buy an Apple TV, a Roku or some other device. At least, not until Hulu fixes their app for the Fire TV. Which, by all indications, WILL NEVER HAPPEN.", "verified": true, "helpfulness": "0/0", "author": "Leslie D. Martin"}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have just about every streaming device available, and this one is by far the best one out there. It's worth it if you only watch Amazon content, but you can watch other OTT providers like Netflix and Hulu on it as well. The interface is easy to navigate (much better than the embedded Amazon app on smart TVs), and the voice search works well. Content streams without pausing, and it's rare that there's any problems with it. If you're a binge watcher of series, it's great to start watching on TV, pick up a couple episodes on your iPad, and go back to the TV without losing your place.", "verified": true, "helpfulness": "0/0", "author": "uberwench \"uber-wench\""}, {"rating": 1.0, "review": "The first 30 days of owning the product, I found myself having to reboot the box every 2 weeks. After I spoke with customer service, they showed me a quick way to reboot. That has been helpful since now I am having to reboot the box every day, sometimes multiple times each day. This is a real pain in the butt.I am to the point of just tossing this product and buying a new Smart TV.", "verified": true, "helpfulness": "0/2", "author": "Pro/E User from MN"}, {"rating": 5.0, "review": "Great product, I like the functionality of it and all it has to offer even without Prime membership. I haven't been able to find you tube as one of the apps? Is it available for fire tv?", "verified": true, "helpfulness": "0/0", "author": "J. Olarte"}, {"rating": 5.0, "review": "works great. easy to set up. bought one for the in-lawand they love it. When nothings on tv nice to have options. We use it as another option to watch something when nothing else is on. Only suggestion to make this better is to have touch screen option. Or have a keyboard on the remote like the old slider phones.", "verified": true, "helpfulness": "0/0", "author": "michele drozdick"}, {"rating": 4.0, "review": "I haven't had it very long, but I have enjoyed it so far. It's easy to set up and easy to use. There isn't any skipping or waiting to download. The voice search is very good. Usually my southern accent throws voice recognition stuff for a loop. That makes for great entertainment at times, but frustrating when in a hurry. This thing knows exactly what I say. Very impressed. I may edit my review later after using it awhile. Hopefully it will help me ditch that high cable bill!", "verified": true, "helpfulness": "0/0", "author": "Brooke Cornett"}, {"rating": 5.0, "review": "Better than some other brands and I believe Amazon is here to stay.", "verified": true, "helpfulness": "0/0", "author": "Idlehr"}, {"rating": 4.0, "review": "Voice feature is flawless. I am just use to Google smart I bought few years ago having all other features like utube google etc. But I got fire tv for streaming media in master bedroom. It is really good for that and provides lot of other media choices that others dont. If want all smart features on tv AND streaming get cs918 quad core Android for around 50 bucks (ebay )and add wireles keyboard for 15 bucks and can do almost everything. I just purchased this as well for camper. Fire tv is great product if all u want is movies and music features. Unlimited possibility for  MOVIES.", "verified": true, "helpfulness": "0/1", "author": "Dwight K."}]