[{"rating": 5.0, "review": "Excellent!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 5.0, "review": "I had it for a month as Amazon gave me a 30-day trial. I am really satisfied, however I had to return it because $99 is a little more than what I could afford. The voice search function was exceptional, did not have a problem recognizing what I was trying to say. The box and remote were both really pretty, and the texture was awesome. I would recommend people who don't think $99 is too expensive to give it a try. Oh, and I didn't try the gaming part, since I have a PS3 already.", "verified": true, "helpfulness": "2/3", "author": "Kevin Chang"}, {"rating": 5.0, "review": "my family loves this!", "verified": true, "helpfulness": "0/0", "author": "Letitbeforme"}, {"rating": 5.0, "review": "Amazing little box. I demo'd this for free and knew on the second night of using this that I wouldn't return it. The processor speed makes browsing very pleasant, and after installing XBMC to play media from network devices, this is the answer to everything I would want.", "verified": true, "helpfulness": "0/0", "author": "R. Sutherland"}, {"rating": 5.0, "review": "Just switched from Roku and Samsung's built in streamer to Amazon fire. Picture quality and color fidelity is amazing. Easy to navigate and voice recognition works great.", "verified": false, "helpfulness": "0/0", "author": "Irfan Elahi"}, {"rating": 5.0, "review": "Love how easy this was to connect and start to use. Love using my kindle fire along with it.Easy to use", "verified": true, "helpfulness": "0/0", "author": "Christy L. \"galleywitch\""}, {"rating": 5.0, "review": "Awesome! I love mine. Easy set up and get around in very easy to use!", "verified": true, "helpfulness": "0/0", "author": "crannie"}, {"rating": 4.0, "review": "I love the ease of use and set up. Streaming quality is great. I'm definitely hoping for more apps in the near future though.", "verified": true, "helpfulness": "0/0", "author": "Jimbo"}, {"rating": 5.0, "review": "OMG, we love this. Able to get all our things on our big TV.  I trust Amazon completely and wouldn't get anything else.Have Kindles from the original to the HDX. We love them all.", "verified": true, "helpfulness": "0/0", "author": "Gail Drouin"}, {"rating": 5.0, "review": "Love it so far, love amazon overall as a company. So I'm happy they delivered a solid product. My only complaint is that when using this to access hulu+ it still doesn't allow all content. Some programs are listed as \"online only\" which is annoying but I guess it has to do with some licensing issue with televising content. Oh well, after owning it a month I've turned in my cable box for good. I also own quite a few movies thru amazon so it's nice to have access, as well as a surprising amount of movies/tv shows that are accessible free with a prime membership.", "verified": true, "helpfulness": "1/1", "author": "PT-sir."}]