[{"rating": 5.0, "review": "It is a nice change watching videos on the iPad or computer to a large screen tv.  The picture quality is indistinguishable from regular hd channels.  The device is smaller than what I imagined.  The loading speed of the programs are fast.  I think an update is needed to distinguish the movies/tv programs that are prime eligible.  I like the remote that it works through blue tooth.  The device is a good hardware to own that will only improve as the software and content gets an upgrade.", "verified": true, "helpfulness": "3/3", "author": "Jason H."}, {"rating": 1.0, "review": "I have now spent 45 minutes with tech support only to be told that it cannot connect to amazon's server because there are too many people trying to do the same thing. Thus rendering my device unusable. I'm super disappointed :(.", "verified": true, "helpfulness": "32/54", "author": "Zooje"}, {"rating": 5.0, "review": "Unboxing:1) Excellent packaging and form factor. It's about the size of 2 CD cases.2) The remote is well designed, and only as complicated as needed.3) Both the device, and the remote have a good weight to them, they do not feel cheap AT ALL.Okay, first impressions after powering on:1) Really snappy, intuitive and well thought out interface, excellent integration with almost everything.2) The onscreen keyboard is kinda derpy, but you really only use it for set up, the voice search takes over after that.3) Voice Search is okay, not quite as smooth as Google, but not bad.4) For some unknown reason, Amazon Music isn't available, however, I'm confident they'll release an App.Amazon Videos start streaming almost instantly, no buffering or Netflix works great, Pandora works well, and a YouTube app is available.Conclusion, even as a brand new product, this device is what we've been waiting for, apps, and updates will only provide additional features and polish. An Amazon Music app with the same level of integration as Amazon Video would be great.", "verified": true, "helpfulness": "10/11", "author": "David Adams"}, {"rating": 1.0, "review": "This device works great, but it can  only work with one TV.  Its implied networking is not clearly stated.  For that reason I have returned this settop tiny box.  My Directv Genie  controller does all this and is available in the network to all my Directv devices....", "verified": true, "helpfulness": "8/45", "author": "John Moen"}, {"rating": 3.0, "review": "My Fire TV is only 2 days old and I'm somewhat disappointed. Granted it has voice application but it lacks the amount of Apps that I find in my low cost Roku. I'm sick to death of all these children's Apps. Seniors like to explore and expand their horizons (\"it's not over till it's over\"). On my Roku there were Apps for learning a foreign language such as Italian or Arabic. Why isn't there more educational tools on this application. I love playing games like Trivial Pursuit or word puzzles. No such animal on the Fire TV - just more of the same old same old but at a higher price when you factor in the extra bucks for the HTM cable. And by the way I did have to type in my email address  and a password to get Netflix etc. on the Fire TV.", "verified": true, "helpfulness": "3/10", "author": "Robert A. Duncan"}, {"rating": 4.0, "review": "Okay so I am an early adopter; when I heard Amazon would be releasing a tv box/stick I was sold, I am heavily invested in the amazon echo system. So with this box I really really wanted to love it, I have had a chrome-cast and I am not too impressed with it. I also have a kindle fire hdx so I am used to the amazon lockdown and \"custom\" interfaces. I did not however expect some of what I found with the fire tv. Setup was a breeze, using the device is adequate with menus and such, but the lack of customizability or at least an app drawer is a little frustrating.Problems:My absolute biggest gripe with this box has to be the lack of an option to install apps from unknown sources, like really? I remedied this with learning how to install apks over adb (which is very technical for most people) it accomplishes what I want, but what I would like more is the ability to install apps from wherever I dog gone well please on a device I paid for.Now another annoyance of mine, but slightly more minor is lack of a browser, I thought if it had android and connected to the internet it was pretty much expected to have even the most crappy of browsers. even the wii got a browser...The bluetooth it is great because I can connect my red samurai controller, but I can't connect a bluetooth keyboard? I don't know if that is a limitation by the device or the stack they are using or not even a limitation just a restriction amazon is imposing.Now I believe this will be fixed with a future update it hasn't been confirmed, but I have a good feeling; the usb port really isn't used for anything, the device has about 8g of storage, I have a 64g thumb drive, I want to use that thumb drive to expand my fire tv's storage.Now as far as gaming goes I think it will get better, but it really isn't a great experience at the moment, some games will look great and play pretty well while others won't even launch properly (these are ones native to the device not the ones I ported over.) Now I didn't buy this as a gaming device, but I sure would love to play my n64 emulator on my tv when the time comes.Finally I don't like the asap video feature personally, I like the best performance/power I can get so for the simple fact I can't turn it off I don't like it.Now what I like:I love the voice search; it works fairly well and is convenient. I hope amazon expands it to include dictating words to everything instead of needing a keyboard. I love the slideshow screensaver no need to say more it just rocks. I like the content selection so far, but I really hope more is in the works I.E. hbo, and others like it. I like the kindle support.Okay so those are my pro's and con's I can't honestly say I love this box, but I want to so bad! the potential is there if amazon will get a clue.Here is what needs to change for me to give 5*1. Option to install from unknown sources. <absolute must!2. Ability to use my bt keyboard.3. Ability to use my thumb-drive to expand storage.4. Add an app drawer so I can easily see what all my installed stuff is without fishing through menus.All told this is a good device if you want amazon on your tv. Don't buy it for gaming, don't buy it as a mini pc, and don't buy it if you want a totally finished product. I think the fire tv is well worth the money, but I really really hope things get better.P.S. If an amazon rep reads this maybe you could address some of my issues and just let me know you are working on them? I would consider rooting this box and going to a custom rom at this point just so I could do what I wanted on it, but your reassurance would put my mind at ease.", "verified": true, "helpfulness": "5/6", "author": "Justin Reto \"Justin R\""}, {"rating": 4.0, "review": "Pros:  fast navigation, support for popular apps (Netflix, YouTube, Pandora, Hulu+), games play smoothly, ability to play music from Pandora while playing a game is cool, works with Nyko gamepad and comes pre-loaded with my Prime account stuff.  Voice search is awesomeCons:  Arrived late, I don't blame Amazon for this, I blame the shipper in this case UPS for a sorting error.  This item sat in a warehouse in my town for 12hrs before I received it.  Amazon stepped up (as always) and got things sorted out for me.  Now the device itself... Not sure what the usb port is used for as of right now I can't use it to add more storage to the device which is something it sorely lacks the ability to add storage, maybe there will be cloud storage option later, but for now 8gb is small.  At first it didn't want to work with my TV, but after switching HDMI cables it worked.  Setup is slow, with the updates and the intro video which I wasn't able to skip through.  There are still some apps missing that I would personally like to see and no easy way to add various accounts is something that needs to be fixed. Strangely no Amazon Music Cloud service app, something I thought for sure would be there, unless I'm missing something obvious.Overall:  With its high specs this fast system that has voice search and a nice assortment of games makes this a viable replacement for my Roku and Chrome cast.", "verified": true, "helpfulness": "4/5", "author": "P. Hale"}, {"rating": 5.0, "review": "I had to leave the couch to write this review. My review is as truthful and real as it gets. I have owned Apple TVs, The little black box, Ouya, Roku all the above and in my opinion Fire TV is the best on the market today. Specs speak for themselves. Amazon just updated the software content and I am pleased. Every app is so easy to use and it will be the best experience you have ever had with each app on any platform!! Perfect streaming beautiful interface UI. So fluid so sexy this is your new baby next to the baby sitting next to you watching the HOT Fire Tv. Side loading apps is easy. I have been able to install the following working apps: Fire Fox, Facebook, Twitter, Viber, Root file explorer, Smart Office and of course XBMC!!! GOTHAM BETA 4!!!!! No Green screen nearly 100% stable!! Big shout out to the DEVS at XBMC for working on this so swiftly. They are loving this box and taking it seriously. Im watching Bruins vs. Flyers in HD so smooth so AWESOME!!! Do not snooze on this box I am so glad I purchased one you will be too!!Any questions feel free to ask Ill be happy to help especially XBMC' ers..OH Wait I forgot to mention the GAMING!!! SO AWESOME...so smooth no lag mind you I havent played every game yet but this is no Ouya...This is the real deal....wait Voice search too let me stop.The only CON....No power off button or shutdown selection you have to do unplug your device but Im sure there will be a tweak or update coming soon... Thank you AMAZON!!! What an experience...Now back to the game...See ya..  :)", "verified": true, "helpfulness": "13/14", "author": "John"}, {"rating": 3.0, "review": "I got my Fire TV yesterday; setup was a breeze, nice instructional, animated setup video (for the 2 minutes of it that I watched). Simple, standard connecting to house WIFI, absolutely no issues.Big downer when started browsing app options. While they do have ShowTime Anytime app, there was no HBO Go (what the heck!). And then, as Sting sung, a humiliating kick in the crotch, when I attempted to login to the ShowTime Anytime app, they only have a small selection of cable providers and Directv is **not** one of them. So, I can't even use the ShowTime Anytime app and will have to continue watching those shoes on my laptop computer. Bummer!On the up side, when I watched an episode of \"House of Cards\", I used the fast forward and rewind options on the remote. YES !! This is the best interface I've seen: 3 speeds and it shows not only thumbnails of the current frame, but both previous and upcoming thumbnails too. Kind of hard to describe but an awesome, intuitive and very effective FF/REW interface.Once HBO Go and Directv are supported, this is will be a 5 star rating.", "verified": true, "helpfulness": "1/3", "author": "Scott Davidson"}, {"rating": 5.0, "review": "I am a self confessed Apple nut (iPhone 5s, Macbook Pro(s) Time Capsule... essentially everything they sell) and had the Apple TV since day 1 and I have updated accordingly. I received this today and wow... I really mean wow, Amazon have hit it out of the park with this thing. It is blindingly fast and the content looks great.Do yourself a favor and buy this, it is great.", "verified": true, "helpfulness": "4/4", "author": "Duncan Hunter \"Orisons\""}]