[{"rating": 5.0, "review": "Easy to install.  Reasonable selection to choose from with Amazon Prime.  I subscribed to Netflix so I could get some of the tv series that I've missed over the years and now I can catch up.  Already in season 7 of Dexter.  Amazon Fire TV works well for me.", "verified": true, "helpfulness": "0/0", "author": "Ellie Mac"}, {"rating": 2.0, "review": "doesnt go into sleep mode", "verified": true, "helpfulness": "3/4", "author": "ace"}, {"rating": 2.0, "review": "I have had the Kindle Fire TV since July, 2014.  I loved it at first; but, unfortunately something is wrong with the cord.  The white light on the front showing it is on; does not stay on.  It keeps going out.  I have to keep unplugging the cord and plugging it back in everytime I want to watch something on the Kindle Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Yvonne D."}, {"rating": 5.0, "review": "I really love it.  It is one of the best things I have ever bought", "verified": true, "helpfulness": "0/0", "author": "it was great I really liked it."}, {"rating": 5.0, "review": "Love love love this. First - no need for a cable box - just a connection.Easy to navigate - big colorful windows, no brainer remote.Voice commands work extremely well.This introduced me to iheartradio which is great. I loved listening to the classic WLS Chicago - grew up with WLS.I have ordered additional Amazon Fire devices for my other TVs.", "verified": true, "helpfulness": "0/0", "author": "Suzan"}, {"rating": 5.0, "review": "I have found my new way to watch TV!!  I love that I can have season marathons!", "verified": true, "helpfulness": "0/0", "author": "Regyna"}, {"rating": 5.0, "review": "It is *great* to be able to watch streaming video on a big screen with marvelous picture quality! Netflix availability is a huge plus as well. WatchESPN is a great feature ... it is very nice to watch ESPN3 games on something bigger than my phone and ESPN live event picture quality is better than I get from my live ESPN channel on cable. Things that I wish were better: I wish Netflix had voice search capability; I wish FF/rewind actually worked on YouTube. Still, glad we got it.", "verified": true, "helpfulness": "0/0", "author": "Terrence L."}, {"rating": 5.0, "review": "Thank You.", "verified": true, "helpfulness": "0/0", "author": "Anthony Thompson"}, {"rating": 2.0, "review": "I was so excited when this product was announced. I wanted so badly for it to be great. I'm a big fan of Amazon so it is with regret that I must criticize their Fire TV device. Sadly, the device has been a constant source of frustration. Upon first installing it, we encountered an issue with the sound. We resolved the first sound problem only to have a second sound issue arise a few weeks later. Amazon support has tried to be helpful, but the technology is just not up to par.", "verified": true, "helpfulness": "3/3", "author": "Marty Weil"}, {"rating": 3.0, "review": "It's okay.  I just dd not find it to be what I needed to meet my needs.  Most of the movies I wanted to watch I had to pay rental.  I cannot afford that.  It was worth a try but not for me.  It also left a vast world of things out there for my 10 and 13-yr old granddaughters to stumble into.  I can't watch them 24-7.", "verified": true, "helpfulness": "0/1", "author": "B. Essick"}]