[{"rating": 4.0, "review": "It is a good concept - but I wish for spending $100 for it there were more than 90 free prime movies out of the 40,000 ... it is easy to use and small to store.", "verified": true, "helpfulness": "0/1", "author": "Kara L. Wagaman"}, {"rating": 5.0, "review": "This thing is crazy good....! This is like all the entertainment you need without those hefty cable bills.", "verified": true, "helpfulness": "0/0", "author": "samuel \"talentscout\""}, {"rating": 3.0, "review": "It's a good box but not enough space run faster then any streaming device I had", "verified": true, "helpfulness": "0/0", "author": "chalk2500"}, {"rating": 3.0, "review": "A Christmas gift from our daughter...it's OK, but I can get most of these same movies on Netflix. Wouldn't have bought it for myself, but do like the Amazon Prime that came with it.", "verified": true, "helpfulness": "0/0", "author": "Dana D"}, {"rating": 5.0, "review": "Easy setup, smooth wireless streaming.  Small size can be transported easily.  Top rated movies are rare.", "verified": true, "helpfulness": "0/0", "author": "Vern Dewitt"}, {"rating": 4.0, "review": "5 stars once HBO via Comcast works...", "verified": true, "helpfulness": "0/0", "author": "longbri4"}, {"rating": 5.0, "review": "Fire TV is amazing! If you have to leave a show, it's always at the same spot waiting for you. The voice commands are so easy to use and you can find anything! Having a Prine account allows us to watch pretty much anything we want!! Best decision we ever made! Fire TV replaced our ROKU. So much better!", "verified": true, "helpfulness": "0/0", "author": "Kelley Higginbotham"}, {"rating": 5.0, "review": "I absolutely LOOOOOOOOVE my Amazon Fire TV!I still can't believe that so much FREE content is available, from tv shows, movies, and even a FREE channel. I love it.I was totally sold when I found all of the seasons of X-Files available with the 'watch now\" feature.The voice search is accurate and totally easy to use.Love It!", "verified": true, "helpfulness": "0/0", "author": "#MFC"}, {"rating": 5.0, "review": "Love our Amazon Fire TV! We are ditching our cable and getting then for every TV in the house!", "verified": true, "helpfulness": "0/0", "author": "Caitlyn Gates"}, {"rating": 5.0, "review": "this thing just might end cable tv for me once and for all.", "verified": true, "helpfulness": "0/0", "author": "Lou Bruno"}]