[{"rating": 5.0, "review": "Amazon Fire is amazing!  I love that I can pick what I want to watch , when I want with just using my voice.", "verified": true, "helpfulness": "0/0", "author": "Marilyn"}, {"rating": 5.0, "review": "I have to admit that I was skeptical about how easy setup was going to be, but it took a few minutes and I was up and running. I was also surprised at how well the voice search works. It is the best voice interface that I have used and returns the proper voice search 90-95% of the time. Overall I would have to rate this as excellent. My only wish is to have the voice search available for the YouTube app.", "verified": true, "helpfulness": "0/0", "author": "dawajuva"}, {"rating": 2.0, "review": "I gave this 2 stars because Amazon has made sure to mix its free movie content with the pay per view ones -- not nice. This is easy to understand. This is a MARKETING Ploy to sell content. Obviously, you will click on a movie that interests you or may interest you. You have NO IDEA OF  whether there is COST or not. They sell more movies this way.", "verified": false, "helpfulness": "4/8", "author": "manypages"}, {"rating": 2.0, "review": "I got the Amazon Fire TV as a gift - but am thinking about having my husband return it.  I thought it seemed like a really cool thing to have but you really have to spend more money to make it worthwhile.  Or - I am completely missing something on how to use this device?First - without Amazon Prime or an extensive Digital Library on Amazon or a subscription to Netflix, the movie options are very limited.  I can't even get HBO Go or my Xfinity movies to play on the Fire TV (NOT AVAILABLE).  Although I have LOTS of movie options available on my Kindle from these outlets, they still are not available on the Fire TV.Second - mirroring.  I love my Kindle Fire HD, but it doesn't have the ability to Mirror the Fire TV.  I would have to upgrade my Kindle to HDX to do that.........Games - it seems like there are only a few games available on the Fire TV.  My kids would love to play Mine Craft on the big screen.  But the Fire Remote does not work with that game, you MUST BUY the Fire TV remote for an additional $40, each.  Price tag for 2 kids an additional $80.Soooo - for it to be worth it for me to keep my Amazon Fire TV, I'd have to spend $99/year on Amazon Prime, $80 on game controllers and a minimum of $229 on an HDX, although I have an 8.9\" Kindle so it would be $379 to upgrade my current Kindle to an HDX.  I just purchased my current Kindle in February, so not ready to upgrade.......  If I don't spend any of this money - my Fire TV is pretty much going to collect dust.  I already spent $20 to get an additional HDMI outlet......... But I think returning the Fire TV is the better deal.To make matters worse - I just got a free 30 day trial offer to TRY the Fire TV.  I would have taken advantage of that for sure!!!!  I would have returned it after a week, but it would have been better then buying one.", "verified": false, "helpfulness": "4/9", "author": "Diana"}, {"rating": 5.0, "review": "The reason I like it so good is because I can watch YOU TUBE on big screen TV. I can enjoy it  a lot better that way and also pick different video's of my choice.  I had been wanting something like this for a long time. Also to watch movies if I see one I want to watch..The only thing left I would enjoy doing is being able to record some things to a DVD or Video tape though my TV off of Amazon Fire TV.", "verified": true, "helpfulness": "2/2", "author": "K.R. Hunter"}, {"rating": 5.0, "review": "I love my Amazon Fire TV however the only difficult starting point was how to operate the keyboard with only the clicker and no prior instructions. There is no keyboard on the clicker. However, as soon as I got it synchronized with my wireless, the learning curve went up exponentially and got easier and easier as time passed. The voice command is easy to use and actually helps find those hard to find movies. I highly recommend Amazon Fire TV. Oh, also get Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "A. Lauper"}, {"rating": 4.0, "review": "I'm still getting use to using it. I'm liking it so far especially the voice interaction which is amazing. I'm thinking about buying another one for my parents.", "verified": true, "helpfulness": "0/0", "author": "K. KIEL \"irislover\""}, {"rating": 5.0, "review": "I was hesitant in buying this box as I can access Prime Instant video using my PC, iPhone/iPad, Xbox 360, and LG tv free of charge. However, the UI on those devices is terrible. It takes a long time to load and buffer the program I'm watching as well as the menus.The fire tv box loads menus and videos almost instantaneously. I can stream movies in HD over my 1.1-3Mbps DSL internet with zero load times. My other devices won't playback in hd over the same connection.For 99$ for just the box, I'd recommend it to anybody.", "verified": true, "helpfulness": "0/0", "author": "Barrett"}, {"rating": 4.0, "review": "Not knowledgeable on technical  devices...will I still have to purchase Netflix monthly and other applications  if I choose to use them .", "verified": false, "helpfulness": "0/5", "author": "Billie M."}, {"rating": 4.0, "review": "If you want a great streaming box this is a good choice. It is better if you are a Amazon Prime member you get more movies and tv shows included . The icons are very big so you can see them far away.  The speed of the device is very fast to move around.Voice search works great on this device. Load time is very fast for video. The device does not take a lot of room on entertainment area.  I am still waiting for hob go and would like vudu too.", "verified": true, "helpfulness": "0/0", "author": "Sean"}]