[{"rating": 5.0, "review": "Best purchase I've ever made! Cancelled my cable and have never been happier!:-)", "verified": true, "helpfulness": "0/0", "author": "cc"}, {"rating": 5.0, "review": "Works great With Kodi", "verified": true, "helpfulness": "0/0", "author": "DAS"}, {"rating": 5.0, "review": "I am medium+ computer user. My lady-friend bought one so I bought one, too, just for fun. It is SO cute! The Fire pushed its way into my daily \"routine\", and I put it in my purse when I go to the Drs to have something to play with while I wait to be called. I give it an A+!", "verified": false, "helpfulness": "0/0", "author": "N. J. Meyer \"Bridgelady\""}, {"rating": 5.0, "review": "Great device to access all of my Amazon content....extremely happy with this", "verified": true, "helpfulness": "0/0", "author": "Marc"}, {"rating": 5.0, "review": "Everything you could ask for.  Never going back to Cable TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Mixed review here from me regarding the Amazon Fire TV.  I bought it knowing there would be limitations to using it overseas (Currently living/working in Saudi Arabia). I bought it so I could load the TVMC application and that works for me.  I do have issues with the connection speed but since the internet here isn't great, I will not discount the product for that.  I wish the remote had a few more options (like Stop) so I could navigate easier and get to and from where I was at easier so that is why I don't rate higher.", "verified": true, "helpfulness": "0/0", "author": "bombman7"}, {"rating": 5.0, "review": "I have a smart TV but I always had so much trouble loading netflix. Anytime I wanted to watch netflix I would have to reload it six or more times before I could even get the page up then movies would stop and go. There were nights when I couldn't even get netflix loaded up or to play. After buying this I have never had any issues streaming netflix or loading it up! Best money I have ever spent!I also like how it shows you a slideshow of stills from any movie or TV show you are looking at. It gives you a better idea than just seeing the movie poster.Not having tv channels I am able to watch regular shows (you have to pay for most tv shows though) and new movies.There's not a huge selection of free movies but it's decent plus you can rent any new movies (some that are still in theaters).", "verified": true, "helpfulness": "1/1", "author": "Jodie Silver"}, {"rating": 1.0, "review": "not seeing the point of this since i pay for netflix and hulu already so my purchase of this does not incorporate membership to those sites.", "verified": false, "helpfulness": "1/5", "author": "Allison Payne nee' Mobley"}, {"rating": 3.0, "review": "After a lot of research, I bought this product with much anticipation!  But, I was let down that there is absolutely no way to access the major networks for live streaming on this device (i.e. ABC, NBC, CBS).  They do not provide USTVnow as an app, like Roku does.  Also, Sling TV does not provide access to the major networks (and I'm paying extra for that).  By the way, don't call for help.  Nobody knows anything about it and can't help.  I was told to call Slingtv every time.  As a last resort the customer service rep actually told me to complain to the major networks.  Right.", "verified": true, "helpfulness": "1/2", "author": "Beth Tinker"}, {"rating": 3.0, "review": "So far it works fine", "verified": true, "helpfulness": "0/1", "author": "Austin D."}]