[{"rating": 5.0, "review": "Easy to install ! Many choices of movies and music. No on and off button on remote-had to look up how go turn off!", "verified": true, "helpfulness": "1/2", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I do not have cable TV, and wanted, for once, to be an early adopter, so I purchased Amazon Fire on the day after it was released. Am able to access all Amazon Prime content. I connected to YouTube, Hulu, and Pandora as well as other content providers. The voice search for Amazon content works seamlessly. I wish that the voice search worked for other content such as YouTube. One evening I selected a movie from Amazon Prime using my Chromebook, yet when I voiced it into Fire an older version of that film came up. Using the Fire menu I went to Customer Service and selected that they \"Call me now\" on the screen. I immediately got a phone call and the technician helped me with my issue. I was amazed and pleased! I am very glad that I purchased Amazon Fire. I use it often.", "verified": true, "helpfulness": "1/1", "author": "Jule' Ketcham"}, {"rating": 2.0, "review": "Fast piece of hardware, but menu is confusing or takes time to get used to it, selection of movies on Amazon is confusing also - I suspect it has a lot to do with loosing so much space on the left with the menée and having large icons on the screen . In particular year of release and actors are found immediately, need to adjust your eyes and search!The worse part to me is that there are not many apps of interest, even compared to Apple TV. Tokugawa is of course in another category for thisThey probably will have more apps as time goes, but for the time being I am disappointed.", "verified": true, "helpfulness": "1/1", "author": "Pascal"}, {"rating": 4.0, "review": "My son loves playing the games....a lot of the games work with the remote for the Amazon TV....some games require an additional gaming remote.  I love being able to watch Netflix.  It is nice having everything you need in that one little box.  We are traveling this weekend and I'm going to take it with me to keep the kids entertained in the hotel at night.", "verified": true, "helpfulness": "0/1", "author": "Linda P-D \"LindaPD\""}, {"rating": 2.0, "review": "Within a few minutes of receiving our Amazon Fire we realized that all it is is a very sophisticated way to sell additional Amazon content.  The selection of movies and TV shows available for free is minimal - even as a prime member.  Within moments we were back on HBO, seeing what was on.  I will add, the design and user interface is very sleek and nice, we just wish there was more content.", "verified": true, "helpfulness": "1/2", "author": "Evans Longacre"}, {"rating": 5.0, "review": "The FireTV is an outstanding product.  Everything works well from Amazon Prime movies to NetFlix movies.  Music channels like Pandora work as expected although Amazon has not integrated their on player into the FireTV yet.  This seems like a no brainer to me and should be done ASAP.  The few free games we have played have been high quality and the kids love them.I would like to see Amazon come out with a Prime+ service that grants you access to more of their digital content.  Right now I am paying for Prime and Netflix streaming.  Amazon --- I'd gladly pay you the money we are currently sending to NetFlix if you offer more content.", "verified": true, "helpfulness": "0/0", "author": "Michael Smith \"Michael Smith\""}, {"rating": 5.0, "review": "I have not gone thru everything that is on this tiny box. So far it has preformed great, I really like the audio function. Fast forward is different and takes some getting use to. You will not regret getting the Amazon Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "Charles F. Hargrave \"Leto\""}, {"rating": 4.0, "review": "It compares with Apple TV except that in Prime membership if you are outside the U.S.A., you will not be able to see the Prime videos and movies. With Apple TV, you are able to see EVERYTHING!", "verified": true, "helpfulness": "1/1", "author": "Frederick Melville"}, {"rating": 5.0, "review": "We like it so much we are dumping our direct TV!  It performs as advertised.  Couldnt be any happier with the product!", "verified": true, "helpfulness": "0/0", "author": "michael r jones"}, {"rating": 5.0, "review": "Great product and good content from Amazon and other providers. Both unit and remote have frozen up a couple of times, but cycling power resolves the problem.", "verified": true, "helpfulness": "0/0", "author": "Mark J. Reynolds"}]