[{"rating": 5.0, "review": "exactly what I paid, great", "verified": true, "helpfulness": "3/4", "author": "Macspidie"}, {"rating": 1.0, "review": "I give up.  I've tried everything with Amazon FireTV.  First I used the unit wirelessly, constant freezing and errors while watching content.  One movie, I even PAID for and it froze three times during the viewing, causing me to have to unplug the unit and wait for a reset.  Several calls with Amazon later and 'resets' which amounted to nothing but me unplugging it again and I'm back at the same issue.  Now I go to a wired connection thinking it must be something with my connection.  Now, it seems to freeze within minutes of watching any content on the device.  It's completely unwatchable and totally not worth $100.Amazon, please get your act together with this thing.  Either I got a dud or I want my money back.  I'll be looking into one of the other streaming devices and possibly cancelling my Prime account.  Very disappointed.", "verified": true, "helpfulness": "4/11", "author": "Michael Lillywhite"}, {"rating": 5.0, "review": "Excellent, fast just be careful , some shows they charge for unlike Casting from Chrome. Works great.", "verified": true, "helpfulness": "2/2", "author": "valerie young-baldwin"}, {"rating": 1.0, "review": "I love streaming video.  Too much it seems.This product is great.  I am buying them for my family this Christmas, only real flaw with the product itself is 8gb ins't enough and they haven't added external drives yet.BUT here is the ONE CRITICAL FLAW.  This product cost me $20 this month on my Comcast cable bill!Comcast and ATT new 300gb per month bandwidth limit of 300gb!!I used 380 gigs, so comcast charged me 10$ per extra 50gb.Comcast is evil.  They are playing revenge on the cord cutters.  This change stops innovation and stop me from using my Fire TV.This will only get worse with Netflix 4K which will use 7GB per hour giving you only 42 hours of month of TV watching.Then it will cost you $10 per 7 hours, roughly $1 per hour to watch streaming video!!  What a rip off.My ultraviolet collection just became worthless.....  I can't watch anything....", "verified": true, "helpfulness": "7/21", "author": "Sam Beckett \"Quantum Leap\""}, {"rating": 5.0, "review": "Much better than I expected. Thanks Dennis", "verified": true, "helpfulness": "1/2", "author": "DSmyth"}, {"rating": 2.0, "review": "UPDATE 3/17/15 - I've become very frustrated with this thing!  The unit itself is very good, however the reason I purchased it in the first place is due to certain shows being available to view with a prime membership.  Well in short order, every single one of the shows I purchased this for is no longer available on prime.  There were several seasons, each with 20+ shows of a series my father and I enjoy watching, well we didn't even make it a quarter of the way through one of the seasons when ALL of the seasons are no longer available to watch with prime.  I can think of at least 5 series/shows that were listed as prime, then suddenly and without warning are no longer prime and no longer available to watch without expensive charges.  I'd give it 2.5 stars, I understand there are licensing agreements in the background, but I really feel like the whole deal is reminiscent of a bait and switch.  The available shows are dropping like flies (at least the ones I would like to watch).  Frustrating!!!Love it!  My only other experience with a streaming device was a \"smart\" vizio TV.  This unit is much snappier, and videos start very quickly.  I mainly use the Amazon video services, and the YouTube app.  This unit performs well, and is excellent.  A couple of things I've noticed:The YouTube app works very well, with the ability to pair and launch videos from a mobile device.  There is a glitch within this is if you do launch the video from a mobile device then want to fast forward more than 20 or 30 seconds, the unit freezes up and will not play.  The home button will get you out of the loop, but the video will not play.  Play the same video without pushing from a mobile device and you can fast forward all you want.I was very excited to find the RedBull Tv app, the air races are phenomenal!  Once again within this app there is a bit of a glitch, you can only fast forward or rewind by 5 minute and some second intervals.  Just missed what was said?  Hit rewind and be prepared to listen to the past 5 minutes to get back to that point.  A bit frustrating with an app that has such fantastic action.  For a quick replay of that fantastic move be prepared to watch 5 minutes prior.WISH LIST:  I wish that the voice search would work within other apps.  When in the YouTube app, you cannot voice search.  Pressing that button exits the app and returns to Amazon services.  Hope they add the ability for the voice search to work within other apps in the future!It is time consuming to search within other apps using the remote and on screen alphabet.  I got so frustrated with this (and the voice search not working within other apps) that I tried plugging in a USB keyboard/mouse into the USB port on the Amazon Fire TV unit.  The keyboard did not work, however the mouse did. The mouse alone did make using the on screen alphabet quicker to type/search, but I do wish the keyboard worked or better yet the voice search worked within other apps (you'll get spoiled by it on the Amazon services).I would certainly buy it again and recommend it to others.", "verified": true, "helpfulness": "3/3", "author": "C. J. Costa"}, {"rating": 5.0, "review": "great system love it paired with my kindle hdx.", "verified": true, "helpfulness": "1/1", "author": "spyros \"Fantasy Novels 4 Life\""}, {"rating": 5.0, "review": "Wonderful. It does not have all the channels that a Roku has but I love its ability.", "verified": true, "helpfulness": "1/1", "author": "Connie B. Fisher \"Geek woman\""}, {"rating": 5.0, "review": "I am very excited and happy I got this product ! I debated which product or company to go with but I promise this is the best decision for the price I could have invested in .  Picture perfect Quality with NO Lag !", "verified": true, "helpfulness": "1/1", "author": "Robert Buchanan"}, {"rating": 5.0, "review": "Great way to watch our Prime and Netflix movies and shows!", "verified": true, "helpfulness": "0/0", "author": "Momof3lilmonkeys"}]