[{"rating": 5.0, "review": "It has multiple option for operations and each is easy to hook up.  The availability of movies and shows are awesome and with a Prime membership increases the choice.  I use Comcast but I will never use the upgrade or rent movies from them again.  Even with the membership price, the Amazon fire TV whether it is the stick or box and additional price for movies it is more of a value than upgrading with Comcast.  Never going back. Keep the price down and reasonable and you with have a customer for life.  Thanks guys for giving people an option.", "verified": true, "helpfulness": "0/1", "author": "Y. McCrary"}, {"rating": 5.0, "review": "Wow! Can't say enough about it.  The variety of TV is incredible, and almost every title has all of the seasons available to view. The movie selection has been very satisfying too.", "verified": true, "helpfulness": "0/0", "author": "Kathleen"}, {"rating": 5.0, "review": "My husband and I absolutely love this.  No more purchasing movies at the store, and no more Netflix.  It was so very easy to set up, that I was even able to do it myself.  Great purchase.  We are prime customers, and there are so many free movies we can watch.  The best purchase we have made.  The HDMI cable is not included, so make sure you purchase one.", "verified": true, "helpfulness": "1/1", "author": "Little One"}, {"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "PHYLLIS"}, {"rating": 4.0, "review": "Despite requiring an app to watch videos stored on other computers on my home network, and the fact that the voice search ONLY works with prime (not netflix or any other app), I've been very happy with this device.", "verified": true, "helpfulness": "0/0", "author": "Logan K."}, {"rating": 4.0, "review": "This wi fi tuner is much faster than my Roku!", "verified": true, "helpfulness": "0/0", "author": "Richard Jesurun"}, {"rating": 3.0, "review": "Good product.  The voice search feature was disappointing, it only searches on amazon prime for requests, not anything else.  I mainly use hulu and netflix.  My wife has a roku 3 I much prefer and has many more channels, especially the NHL channel.  I will buy a roku 3 to replace this soon.", "verified": true, "helpfulness": "0/0", "author": "christopher m. nagy"}, {"rating": 5.0, "review": "Received it as a Christmas present and went home connected it and WOW I love it. Did not expect to love it this much. It was easy to connect.", "verified": true, "helpfulness": "0/0", "author": "Indy Mog"}, {"rating": 4.0, "review": "Voice command is a great feature that works really well. This is so much better than On Demand services from cable/sat provider. Would have given it 5 starts except Showtime Anytime is not available through my cable provider.", "verified": true, "helpfulness": "0/0", "author": "Mike W"}, {"rating": 3.0, "review": "Love this when it works. I have changed batteries twice. works for a while, but if I dont use it for a few days, it won't work again. Any suggestions?", "verified": true, "helpfulness": "0/0", "author": "Beverly Martens \"Bev\""}]