[{"rating": 1.0, "review": "After a month or so Netflix quit working on the amazon fire...and no matter what we try it will not work...we've tried every trick, reset, clear cache whatever and it won't work, which makes this thing for the most part pointless...running it and typing with the remote provided sucks too....overpriced and poor performance....FYI can play Netflix on PlayStation, PC, smart phone, everything except the amazon fire.", "verified": true, "helpfulness": "0/1", "author": "Heather"}, {"rating": 4.0, "review": "The photos in the screen saver mode are worth the cost of the device.", "verified": true, "helpfulness": "1/1", "author": "W. Buchanan"}, {"rating": 4.0, "review": "I've been using this for 5 or 6 months since I cut the cord from cable.  I'm a prime member and I added on our subscriptions to Netflix and Hulu plus and these cover most of what we were watching when we had cable for a whole lot less of a monthly expense.  When I have had issues with the Fire Tv, I've unplugged it for about 10 seconds to reset it and plugged it back in and then everything was good.  I've had to reset the device maybe 3 times but it gets a lot of use.", "verified": true, "helpfulness": "0/0", "author": "Red"}, {"rating": 5.0, "review": "does all that it says and more,my streaming is bad here because of slow net, this  unit didn't skip a beat so far. I would recommend this prouduct to friends.", "verified": true, "helpfulness": "1/1", "author": "DANKEN44"}, {"rating": 5.0, "review": "Works better then I could have imagined", "verified": true, "helpfulness": "0/0", "author": "Kevin L. Mccune"}, {"rating": 1.0, "review": "Get yourself a media box with xbmc kodi installed.... Will blow this thing away", "verified": false, "helpfulness": "1/2", "author": "keith"}, {"rating": 5.0, "review": "very easy to install and watch movies of your chojce", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Super fast, great quality streaming", "verified": true, "helpfulness": "0/0", "author": "Khanh N. Nguyen"}, {"rating": 5.0, "review": "Great product for Amazon Prime members.", "verified": true, "helpfulness": "0/1", "author": "DrJohnnay"}, {"rating": 3.0, "review": "Being amazon tv has an agreement with Sling tv, why can't we watch sling tv on the kindle fire hd when it is available on android devices?  It would be nice to have an on off button on the remote also.", "verified": true, "helpfulness": "2/3", "author": "Mona Savig"}]