[{"rating": 5.0, "review": "I was on the fence between another Apple TV or the Amazon Fire TV. And hands down the Amazon Fire TV beats the pants off of the Apple TV. From interface, speed and apps.", "verified": true, "helpfulness": "0/0", "author": "Mark C."}, {"rating": 4.0, "review": "Works seamlessly. Amazon provides a great selection of TV and movie offerings.", "verified": true, "helpfulness": "0/0", "author": "Michael Chezy"}, {"rating": 5.0, "review": "Amazon Fire TV is amazing along with all the other benefits that come with Prime.", "verified": true, "helpfulness": "0/0", "author": "nole1964"}, {"rating": 5.0, "review": "We love it!  Lots of viewing options and games!", "verified": true, "helpfulness": "0/0", "author": "Jill J."}, {"rating": 5.0, "review": "Very easy to set up.  Menus are intuitive.", "verified": true, "helpfulness": "0/0", "author": "Virginia Meyers"}, {"rating": 5.0, "review": "Great box glad that I  purchased it!!", "verified": true, "helpfulness": "0/0", "author": "ANONYMOUS"}, {"rating": 5.0, "review": "This is awesome I love it.  It works great I am letting all of my Friends and Family know about the Fire T.V.  I think you will be happy with the Fire T.V.  You can't lose it's a Win Win Situation", "verified": true, "helpfulness": "0/0", "author": "michellevmcfall \"Michelle\""}, {"rating": 5.0, "review": "Love it. It beats apple tv, Roku and all others combined", "verified": true, "helpfulness": "0/1", "author": "jimmyjames7217"}, {"rating": 5.0, "review": "AS EXPECTED!", "verified": true, "helpfulness": "0/0", "author": "STARLETHER WHITE"}, {"rating": 4.0, "review": "The amazon fire tv is in my opinion the nicest streaming device out right now! The look of the box is clean, sharp, and simple. The voice reconization works very well. However it only will recognize titles from amazon instant video not netflix or any other streaming services. The interface of the fire tv is also very attractive and simple. The remote feels very nice in your hand and the material is very smooth and soft. The only problem I could see with the device is that it can not be turned off.... only put to sleep, which is fine, however I wanted to turn it off so I have to literally unplug it... I feel like there should be a power option... There is also fun apps and games that you can download that are very fun to have on your fire tv! This hands down is one of the best streaming devices! I would recommend it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]