[{"rating": 1.0, "review": "I was disappointed to find that there was a charge for most movies or series' (even the older ones) that I wanted to watch...From $2.99 up to $12.99. Most of the free stuff is accessable for free on cable TV. Most of the games required a controller for another $49.99. You have to be careful which movies you choose, most are anywhere from $2.99 to $5.99, which is applied to your Amazon credit card if you have one. Technically, the apparatus is terrific but the cost of using it is not!", "verified": true, "helpfulness": "11/43", "author": "LEOLADY85"}, {"rating": 5.0, "review": "This little box is amazing and by far the best device out there right now. This was so easy to install, so easy to navigate, and it is lightning fast. I am so happy with my purchase that I will be ordering another one. I love how all my favorite apps are right there, easy to access and easy to use.Before this we were streaming through our Blue Ray and you would not believe how much faster and easier this device is. It is worth the money spent. The menu pulls up faster, is slicker, the parental controls are super nice when you have small ones and I love that all my Amazon videos are right there, not to mention with Prime I have access to tons of free content as well.", "verified": true, "helpfulness": "3/3", "author": "kindlemom1 (My Guilty Obsession)"}, {"rating": 5.0, "review": "Searching for a movie or an actor in a movie and not real sure how to spell it?  This is the answer.  Speak it and there the choices are.  Super easy.  After a minute setting it up, I spoke an actor's name and found out that they were in dozens of movies I didn't know about.  WOW!  Tiny box, small, but full featured remote.  I love it.  Still like my Roku 3 and my smart TV's, but this is a clear winner.  Well worth the hundred bucks.", "verified": true, "helpfulness": "3/3", "author": "Robert J. Unger \"Dr. Gates\""}, {"rating": 4.0, "review": "Full disclosure, I have owned and enjoyed every iteration of the Roku streaming box, and currently own and use a Roku 3. Additionally, I have owned and enjoyed every Amazon Fire tablet ever made, and have been a prime member for as long as the service has been offered. I buy and consume almost all of my digital media from Amazon, with the only exceptions being that I subscribe to Hulu Plus, and use Pandora to stream music. Having used the new Fire TV for 24 hours now, the following is my honest comparison.Advantage Roku 3:*Channel selection: This isn't even close. Roku offers over 1200 channels and games, compared to only 180 for Fire TV. While most of the Roku channels are completely senseless, all of the important channels are present. The Roku 3 also finally includes a YouTube channel, and also includes Blaze TV, which is missing on the Fire TV (please keep your political comments to yourself, as this is not the Huffpost blog).*User interface: The Roku 3 interface is cleaner and more simple, while the Fire TV interface is really attempting to push Amazon Prime content. This is not a knock on Amazon, so much as it is a comment on the clutter of the Fire TV interface.*Headphone jack in the remote: Why other streaming products fail to see the value in this is beyond me.Advantage Fire TV:*Voice search through the remote: While this feature only works with Amazon content, it is very helpful for navigation purposes. If you use Amazon instant video for your streaming service, this feature will save you serious time and headaches by not having to type in search queries with the remote control. Every time I have used this function it has worked flawlessly.*Additional film information: Amazon is creating a real advantage in this regard. If you use Amazon Instant Video as your streaming service, you can pair Five TV with your HDX tablet and have all the information regarding any film right at your finger tips. Information about the actors, director, supplemental material, etc. No other streaming service offers anything remotely close to this level of detail.*Speed and power: Let me be 100% clear on this point. If you use Amazon Instant Video as your streaming service, everything in your existing library and watch list will play immediately. By immediately I mean in less than a second! Amazon is leveraging it's massive server infrastructure and pre-queuing all of your content, as well as any content it recommends for you. Unfortunately, this speed advantage only works with Amazon content.*Gaming: Fire TV will accommodate a much more detailed gaming experience than the Roku 3. You can purchase a very competent gaming controller for only $40. If you are looking for the ultimate gaming experience, the Xbox or PS whatever is obviously the way to go.*Future software upgrades: Fire TV is built on the Android platform, which has very obvious advantages. Channel developers who already have functioning Android apps will be able to very cheaply convert to the Fire TV platform. I fully expect Fire TV to experience very quick channel growth. Additionally, I think this factor makes Fire TV a better value than Roku 3. While it costs more upfront, the life of the Fire TV box will be much longer than the Roku product. Roku requires a new box for any significant upgrade of the technology, while the Fire TV box can be significantly upgraded with software enhancements.In conclusion, If you already use Amazon Instant Video than Fire TV is a no brainer. It offers a massive upgrade over what you will get using the Instant Video app on another platform. If you already own a Roku product, and do not use Amazon Instant Video, than I do not recommend you buy Fire TV. If you have yet to purchase a streaming device, and are looking to start using a streaming subscription service, than I hope you find this review helpful.I'd be happy to answer any questions.Tuck", "verified": true, "helpfulness": "28/31", "author": "gtucker7848"}, {"rating": 5.0, "review": "I have a Samsung SmartTV, RokuHD, AppleTV and even connect my laptop for streaming content. No one solution has given me smooth download and viewing of Amazon Prime content so I've never been sure if the problem was Amazon Prime or the device.The past 2 days of Amazon Fire TV has been pretty great, with smooth download and viewing of Amazon Prime Content, Netflix and Hulu.  I'm spending less time waiting and more time watching -- if an HBO Go interface was added I'd be even happier.The remote is very intuitive, voice recognition hasn't had a single error yet and entering usernames/passwords is much more comfortable than the Apple remote.  I've had a few instances of accidentally backing up more screens than I mean to, but I'm going to call that user error rather than a design flaw.AppleTV will remain in my house as a necessary evil, but I prefer this new Amazon Fire for daily use.", "verified": true, "helpfulness": "3/3", "author": "Olivia Waller"}, {"rating": 5.0, "review": "This sounds like something I need to get. I see ease of use, good price point and not a lot gobbledygook with which to deal.Thank you MR. HARDIN. Without your very thorough review I would have breezed right by this product with nary a glance.", "verified": false, "helpfulness": "2/11", "author": "her woofness \"\"Dog Reader\"\""}, {"rating": 5.0, "review": "In its current form, Amazon Fire does not offer any content that can not be obtained by one of the other manufacturers. But what Amazon has done is properly leveraged its cloud technology, which is arguably YEARS ahead of the competition, to provide a stutter free, high definition box that will provide direct connectivity to stream any of you cloud content and access to Amazon's streaming game service. Even thought I hate the term, I will say that like the upcoming Steambox, the Amazon Fire is poised to change the game entirely.", "verified": true, "helpfulness": "3/5", "author": "Dale Rasco"}, {"rating": 4.0, "review": "I haven't bought one myself, but I was able to check out a friends.I made the following observations:1) The voice search works surprisingly well. It's a very nice touch.2) The interface is easy to use, but somewhat overwhelming.3) It's super quick. Amazon made a good choice by going with the high memory and processing power.4) The box itself is small and nice looking. It won't add too much clutter to your TV space.Things that Amazon could improve:1) Develop an ad-based Fire TV (similar to their Kindles) that facilitate a lower price point2) The voice search is good, but it could benefit from some additional refinements.3) Include HBO Go, seriously.4) Develop a Fire TV mount for wall-mounted TVs.5) Keep on being awesome", "verified": false, "helpfulness": "0/4", "author": "Jordan"}, {"rating": 5.0, "review": "Love my new Amazon Fire TV- Received it on April 4th. Amazed at the picture quality and download speed.  The quality of the picture is better than my local HD cable provide.  Closed caption quality is also excellent.  Have been watching Amazon Prime and Netflix.  The voice recognition on the Amazon sections is excellent.  I really the fact that the next show started automatically (within 20 seconds)Some downsides- Does not have the channels sections that the Roku has.  In particular no PBS channel.  The voice recognition only covers the amazon selections; does not cover Netflix.I highly recommend it.  I am hopeful more channels will continue to be added.....", "verified": true, "helpfulness": "3/3", "author": "David J. Higgins"}, {"rating": 3.0, "review": "We've used Roku and Apple TV for years for most of our streaming watching.  Mostly Netflix and Amazon Prime.  When we saw the pitch for Fire TV with the voice searching, we bought one. Two big disappointments so far.  There is no separate Prime channel like on a Roku so you can sort through and just look at the free stuff(which you actually paid for already with your Prime membership).  The Prime movies are mixed in with all the pay-for content.  There's a very small banner in the corner of the movie icon that says Prime.  The second bummer is that the voice search only works with Amazon content.  You can't be in Netflix and use the voice search.  So overall, I think we're going to stick with the Roku for most of our watching.", "verified": true, "helpfulness": "5/7", "author": "James"}]