[{"rating": 5.0, "review": "We ordered Two Boxes and now I feel like buying another one for one more room. My child is already watching her Favorite Movie and created her own Watch List:) I already have my own Watch list and will watch what I really wanted to watch for a while,The Quality of Picture is Perfect. Easy to use as well. I didn't have any of those problems with streaming like others have stated, it works instantly. May be others have low speed internet. I have huge house with 6 bedrooms and Router is on first floor. The Second box upstairs works Perfect picking up the signal without any issues,So far, I LOVE IT because I can also use my Prime Membership for something more than free shipping.", "verified": true, "helpfulness": "4/5", "author": "SkyLight Freedom \"MyWorld\""}, {"rating": 3.0, "review": "I bought this mostly to use as a video streaming device and also for some lightweight video gaming.  Firstly, I do like this device for streaming Amazon videos.  I also enjoy some of the games, though they're mostly simple games ported over from android phones/tablets.  The Fire TV launched with a broad selection of game titles though.  I would rate it 5 stars, but I have a few complaints about how the OS works, the limited features, and how software/media is organized.The video quality for the HD content has been pretty good, and I haven't seen any issues with video lag or buffering.  Browsing for content is a pain though.  The search interface is entirely through the remote control microphone and voice recognition.  The search can quickly find specific video titles, actors, apps, games, etc.  However, it can't handle anything but simple searches.  For example, I found myself wanting to browse through action movies that are free on prime, but my attempts at just viewing 'prime videos' came up short.  I even tried searches such as \"prime videos\" and \"prime movies\", but the majority of content it found weren't prime.  When I searched for \"prime movies\" for example, 3 of the first 5 movies displayed weren't prime.  When I tried searching for \"prime tv\", the top result was the Showtime app.  Despite how simple the search is, the Voice Recognition for the search feature was pretty fast and accurate.The way installed apps are organized and display could use some work too.  I keep longing for a home screen with a list of my installed apps.  That's another place where I think the Kindle Fire does a better job, but to be fair that's probably a good use for the Fire TV's Voice Search function.  Maybe I'll get over the missing home screen if I get more accustomed to using Voice Search.  The lack of a web browser is also kind of frustrating, since this seems like a place where Amazon's Silk web browser could shine.  Quickly voice searching for stuff on google, and dictating emails would be nifty features.  I'd also like the ability to search for and stream videos, music, and other content available on Windows or UPnP shares in my home network.  Perhaps in a future software update?The device itself is pretty small, which is nice.  It's about the size of a square drink coaster, and less than an inch high.  The communication with the remote control is not through infrared like TV remotes.  I really like that it doesn't use infrared since I can hide the Fire TV device in a cabinet and don't need line of sight to use the remote.  The Included remote isn't very fancy, and doesn't have an accelerometer or anything.  I was expecting the remote to work like wii's remote, but it is more similar to a CD player remote.  I do like the tactile feeback on the remote, and the solid feeling 'click' of the buttons.  The remote uses 2 included AAA batteries.  The add-on Game Controller works great for me.  I've read some reviews about there not being a 'dead zone' or something, but I've had no problems with it.  The Game Controller works over bluetooth so I even use it with my Android phone.  Unfortunately, the Game Controller doesn't work with my older Kindle Fire HD.It's helpful to remember that the device doesn't come with an HDMI cable, so you'll need to buy one if you don't have an extra.  It requires a standard/full size HDMI cable, which was disappointing since I had an extra mini HDMI cable on hand for use with the Kindle Fire.  I'd like to see Amazon pick some standards across their devices and make them all similar.  Use Silk on all devices, use the same HDMI cable on all devices, allow all devices to use the game controller, etc.  Having to buy different accessories and apps for similar devices is kind of a pain.All in all, I like the device.  Some features could stand to be improved, but I think this is a great first attempt at a TV streaming device.  I'm sure it'll continue to get better with future software versions and apps.", "verified": true, "helpfulness": "3/6", "author": "Daron Levy"}, {"rating": 5.0, "review": "I really like the user interface for the Fire TV.  Instant movies play seamlessly, with usually no blurry intros you usually get on other devices.  The games are great.  I have been having fun playing Riptide GP2 and Rayman Run, with the optional controller.  I was skeptical that the games would just be lousy cellphone ports, but they have been optimized for the TV screen from what I have played.A couple of things need improvement.  The voice control works great, but does not search across all video apps currently.  This only works for amazon prime content.  I have noticed that sometimes it refers you to hulu plus for a video, but no Netflix voice search.  A second thing is that the Netflix app, just looks like an old version of the user interface compared to xbox or playstation Netflix version.With the power the Fire TV has and the video content, I will be looking forward to the superior games offered compared to other streaming device platforms; and I just don't see how you can wrong for the price of this.", "verified": true, "helpfulness": "3/4", "author": "Mike"}, {"rating": 5.0, "review": "I just accidently found this on Amazon a couple of days ago, and received it today!!! Super easy hookup and so far I haven't had any problems... I actually cancelled my cable, except for 12 channels, to cut down costs...since now, there are so many different things to watch on this cool little box!!!! I actually bought it for my totally disabled son, for his birthday, which is not until May...so that I could preview it before then, in case it wasn't what I expected... Well, I'm planning on using this one now, for myself...without him knowing..and ordering him another one for his birthday!!!! Oops! I guess the one I got today will be my birthday present, since mine is the 12th of May!!!! Sure hope this thing will continue to be as fun as it is today... I don't play games, but just the fact that it's so easy for me to use makes it GREAT!", "verified": true, "helpfulness": "4/5", "author": "Carma Davis"}, {"rating": 2.0, "review": "Music Portion Works Fine, Can't Stream Onto Netflix, Hula Plus or Other Video Offerings. Downloads Updated After Several Attempts, Support WWW Address Advised To Be Contacted Could Not Be Found. DAY ONE, Radio Fine, Rest Very Poor.", "verified": true, "helpfulness": "4/12", "author": "Jim Swede"}, {"rating": 5.0, "review": "Have other  versions of other similar units but have to say this is the best....was waiting for the newer version of Apple TV to update that but not needed now....this is the gold standard now and so fast and user friendly.", "verified": true, "helpfulness": "4/6", "author": "TWM \"TWM\""}, {"rating": 5.0, "review": "I bought this device mainly to take advantage of my Amazon Prime Subscription in full. Along with netflix of course. I have been able to enjoy all the movies/shows i want in my living room now instead of my laptop/desktop. But the real bonus is hooking my xbox 360 controller up to it and playing some games. I've got the official Amazon controller on the way, but for now the wired 360 controller is doing a fine job.all in all this little set top box delivers a ton of entertainment at a very low price point.", "verified": true, "helpfulness": "5/6", "author": "Austin"}, {"rating": 5.0, "review": "I ordered this yesterday and it came today. I hooked it up which was a Breeze. The Voice thing on the remote is O.K. but just seems to be only for use with amazon content, but it does work very well.  I see no difference at all in the Streaming Quality on this than I do on my Roku Player.....However, clicking along the Menu with the remote is much faster than my Roku, I have 30mbps/15 Mbps fiber service for my internet so streaming is not an issue. The Optical audio Output on this doesn't work. Like another reviewer said, I am not new to the Streaming thing either. I had the Original Roku model and now have the Roku 3. I have a Tivo and a Directv Dvr setup as well.UPDATE: I have been really moving around the Fire Tv this Morning. The Results are very good. Quick moving like I said yesterday in between the Menus and it is streaming very well.UPDATE: 4-9-14 I was wrong on the Voice recognition part, sure, it works on Amazon content, however, right below I saw \"Other ways to watch\" I am hands down sold on this!UPDATE: 9-11-14  Still sold on this and very higly reccomend. They have added more content to it. I bought an HDMI Audio extractor to be able to connect to my BOSE Cinemate system. I am more than happy streaming music from this. The first day I got it I foolishly gave it one star, but the more I have used it, the more I am very sold on this.", "verified": true, "helpfulness": "7/20", "author": "P. Mac is.... Mr. Wonderrful \"New England Patriot\""}, {"rating": 3.0, "review": "Received this a few days ago and actually am in a quandary about what purpose this neat contraption actually serves, it is a video streamer and it does do that well but on the other hand so does my smart TV's, it can stream music but in truth I have a Sonos system that does that extremely well offering me more content than I will ever sample, it plays games and for the casual player they aren't bad, consider them 3/4 steps  behind dedicated games boxes and several steps ahead of your cell phone offerings, but the available content is rather minuscule and not sure how often anyone would want to actually play these games and if they are gamers they probably have a Xbox or PS system.I saved the boxes and in truth unless Amazon can tell me what they intend to offer that intrigues me I will likely return it, for those who DO NOT own a smart TV or would like to stream content on another non-smart TV this little box is more than capable, it does deliver outstanding quality and so far my watching experience has been pleasant, most streaming content is available, least any I watch and Amazon does offer their cloud.All in all, sorry Amazon I think you jumped the gun and should have done a little more R&D; before breaking this think out, at least to compete with the offerings already available, what it does it does well there just isn't any compelling reason to own it, at least for me.", "verified": true, "helpfulness": "6/9", "author": "Forrest S. Morris Jr."}, {"rating": 5.0, "review": "Like most people I normally only write reviews when I don't like a product. The number of 1 star reviews on this product concerns me though so I wanted to give it a good review.  Obviously I have only been using it for 1 day since it just came out but my initial thoughts are that its awesome. I don't understand how anyone can say its underpowered compared to its competitors. The main reason I bought it was because the Smart Apps on my Samsung TV are so slow and apple seems to be neglecting the Apple TV. Amazon advertised the huge specs the Fire TV has and that's what I wanted.  It did not fail to deliver here either.Voice only works with Amazon content which kind of sucks but I don't blame amazon for this. It still fully supports Netflix and Hulu Plus just as well as any other platform if not better. I do not have a Roku but I am told Roku does not have Netflix Kids. So I don't understand how you can get a better experience with these apps on any other platform. Sure I would love to see voice search come to these apps but when you have A and you want C and someone gets you halfway there by giving you B its still an improvement.It took me 5-10min to get it setup the first time since it was downloading several patches. I'm sure that the servers hosting these patches where probably pegged the first day just like any console. So reports of it taking an hour to boot up are either the result of a very poor Internet connection or the amazon servers being pegged on day one. By day two when I plugged mine in everything was fine.  The intro movie was annoying but I get the impression they may still be installing stuff behind the scenes and using the video to camouflage that.  I am just guessing though.  In any case its a 1x thing that you forget about 30 seconds after you start using the device and never have to watch again.Interface is a very subjective mater but I think the interface is far better than the Apple TV or the PS4. In particular I find the PS4 very ugly. Very functional and fun but very ugly. I think the Fire TV interface is superior and when I have guests over I much rather hand them the Fire TV remote than a game console remote which is not very grown up feeling.Everything I tried to search for worked instantly.  Even if Amazon did not have the content it correctly interpreted what I said which is big. I have never seen a voice recognition system work so well. It really puts siri to shame.The apple TV will remain hooked up to serve as a airplay device for all my iOS devices but the Fire TV will be my primary media center. It is extremely responsive and a pleasure it interface with.I have no opinion on the games since I have no intention of using them.[UPDATE]I just wanted to comment on the price.  You are getting a quad core CPU with 2GB of RAM and the ability to play 1080p video in a tiny form factor that produces zero noise for $99 which is the same as the the Apple TV and the Roku3 which are both significantly less powerful machines. As I mentioned earlier the spec's are what sold me since I rage at how unresponsive the other devices (excluding the PS4) are that I use are. I cant see the price dropping anytime soon.  I could be made a fool of but I think its a bargain and insane that computing has become so cheap that this is even possible.", "verified": true, "helpfulness": "3/5", "author": "Justin"}]