[{"rating": 1.0, "review": "Same thing as a roku except more expensive and with glitchy voice feature. What are they thinking releasing a 100$ tv addon? Google Chromecast & Roku are BOTH Better.", "verified": false, "helpfulness": "25/259", "author": "Ash"}, {"rating": 2.0, "review": "Installation time: 30 seconds.Update Time 4 minutes.  It updated very quickly.Intro video: Yes, there is one.  And you can skip it.Amazon Prime integration- yes, obviously they want you to have a Prime account.  It's not required.Next, I tried the voice search.  Yes, it only works with Amazon content, but it works GREAT with Amazon content.  I tried about 30 different searches, and it worked every time.So, I went to watch some of my previous Amazon content- here is where I was pleasantly surprised.  They had already hooked it up to my account!  I didn't have to do anything at all- my content was just there.  :)  Very, very happy.The biggest drawback that I saw was that Amazon has inexplicably chosen to include a purely cosmetic USB port.  That's right- the USB port does absolutely nothing.  You can't use it as storage, you can't use it to watch media, you can't plug controllers into it.  It's completely useless. Until Amazon pulls their heads out and address these issues, I can't fully recommend it.  It's a bit amazing to me that in 2014, Amazon had the nerve to release a media box that doesn't natively support media streaming, and has a disabled USB port.  This is the kind of nonsense I would have expected out of AppleTV five years ago.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For the price this thing is blowing me away. I'm impressed it has a lot of Xbox functionality for a fraction of the price. The only thing I wished for (as a developer especially) is a processor that supports DirectX 11 feature set. This is really important for games but sadly Tegra K1 and Snapdragon 805 are not out yet.Pros: Its fast, the interface is great, the remote is RF for media cabinets without glass doors, it works flawlessly with my Amazon content., has wireless N, screen saver mode shows pictures to save older TVs.Cons: The game controller is super ugly, and they should have waited for the new processors.", "verified": true, "helpfulness": "20/25", "author": "ryan gadz"}, {"rating": 1.0, "review": "I would have already bought 2 of them, but it doesn't have HBO go!  Dealbreaker for me.  When you get it, advertise it!  I'll buy it.", "verified": false, "helpfulness": "11/83", "author": "Waleed Mahmoud"}, {"rating": 5.0, "review": "I used to have a roku but just upgraded to the fireTV. Its way better!!! I love sev zero!! Wohoo!!!", "verified": false, "helpfulness": "5/21", "author": "Pen Name"}, {"rating": 4.0, "review": "Just spent a few hours with my FireTV, and am quite impressed.  Setup is incredibly easy, the voice commands work amazingly well, and everything loads quickly.  The lack of storage is a major issue if you are planning on using it for gaming.  Only 5.6 GB's of space is usable, which can be filled quite quickly by games that push past 1GB a piece.On the plus side wired xbox 360 controllers work!Also, this would be a great device for someone who is not tech savvy.  There is a really nice instructional animation that loads the first time you power on the device, and the voice commands make finding content VERY easy.For parents:  There are parental controls, and an option to block all in-app purchases.  This is a godsend if you have kids.EDIT:  There are dozens of reviews from people who don't even have a FireTV.  Look for the verified purchase logo on reviews.  If it doesn't appear ignore that review as they don't have any experience with the device.", "verified": true, "helpfulness": "81/94", "author": "Michael King"}, {"rating": 1.0, "review": "For all you \"types\" that \"decorate\" your nasty little homes with \"satlite-deeches\" (I LOVE the ones on MOBILE HOMES...  (trailertrash hood ornaments !!)for all you who \"think\" that these little \"streaming\" boxes are the answer to ALL your TV viewing. YOU should have STAYED AWAKE in CLASS!!!!YOU will soon find, that while streaming MAY, have SOME value, YOU...will now be doing ALL the WORK to program your TV and YOU...will soon tire of all the garbage you have to WADE thru before you find something to watch.I LOVE it when they talk about the \"DEATH GRIP\" cable has too.DO YOU PEOPLE really think that YOUR INTERNET will stay \"CHEAP\" forever? REALLY? (I bet you also thought OBAMA was going to raise your worthless litttle self out of the gutter and put you in a mansion and a cadillac too !!)SAVE your money, your little streaming box will not save you a penny !!", "verified": false, "helpfulness": "12/405", "author": "Al P."}, {"rating": 2.0, "review": "Nice to see the optical along with HDMI, Gigabit (I believe I am right about that), and a/b/g/n wifi.In all sincerity, I post the following suggestions/questions:Where is VUDU? Where is THEBLAZE? (has been in the top 10 most popular paid apps on ROKU for over 2 years since its launch)When are any of you going to make a 3D capable model since THERE ARE NONE?!I can see paying up to another $50 for that and true 1080p capability + 3D + Kindle audio book reading from non audio Kindle books. I have been a faithful Prime and Amazon Instant Video streaming subscriber since I completely dumped satellite for internet TV and would love to use an Amazon device over Roku. However, if you do not offer the VUDU app, The BLAZE, and 3D, I really do not have a need for this device much as I would love an excuse to spend money on it.Please take this into consideration.", "verified": false, "helpfulness": "18/72", "author": "R. E. Floyd \"tech guru\""}, {"rating": 2.0, "review": "As background I own several Apple TVs, Roku 3's and Chromecasts. Along with plenty of other devices. I also have a large investment in BluRay and DVD, having had over 5,000 films during my peak of building out a Home Theater. With that comes a substantial UV (Vudu & Flixster) and Digital Copy library (iTunes).Initial usage of the Fire TV has shown me that this box is fast and flexible. The voice search is excellent. BUT for some reason the search only picks up Amazon content. It does NOT currently show available media on Flixster or Netflix. This is for something that was touted as an open ecosystem, and not a proprietary one. Well then, how do I access my existing library?Worse, but along with the previous point easily fixable is the fact that my only access to my UV library is through Flixster. Flixster works great on a tablet. But for some reason the Fire TV is not properly caching the content of my movies, so everytime I launch the app it takes minutes to show the content. Further all recent films are NOT available in HD. This is a huge hole in the openness and functionality of the Fire TV.I can't search on my content.I can't watch much of my content in HD.Easy fixes, but a hard sale for someone who owns a Roku or Apple TV.Fire TV needs VuDu as an app, and access to the iTunes library that folks own to be truly open. I'm vested in UV, and Amazon should take note of that as folks like me are typically the leading edge. UV has matured, and Amazon needs to be a much better partner.UPDATE 4/3/2014 I talked to Amazon.com﻿ and they confirmed that NetFlix chose to not enable the search functionality, thus the Fire TV search does not bring up NetFlix content. The same appears true for Flixster, and they confirmed that Fire TV is not currently a supported HD devices for Flixster content. All fixable, but ultimately making the Fire TV currently a closed eco systems with no real access to UV or other parties digital content that customers may already own. It's a tough pill to call up a search for content you own, and only be presented with purchase options from Amazon.", "verified": true, "helpfulness": "831/962", "author": "Jim Long"}, {"rating": 3.0, "review": "Can this box stream content from my NAS?  Without this functionality, this is worthless to me.  My old XBOX 360 does this, but it's old and loud.  My new XBox One does not.  Anybody know about streaming from a NAS from this device?With this, I'll give it a 5.  Without, a 1.", "verified": false, "helpfulness": "4/49", "author": "Simply Confuzed \"Simply Confuzed\""}]