[{"rating": 2.0, "review": "This box looks like it'd work quite nicely for a fairly simple home use scenario, but as far as I can tell it doesn't have an IR port so it can't be used with a Harmony or other universal remote.  Also, folks with local media (particularly MKV files) appear to be left out.  This may not be as much an issue if Fire TV supports Plex, but for me it's a show-stopper.The WDTV Live would be a better choice for folks who have their own media to play, plus it's a bit cheaper:http://www.amazon.com/Live-Media-Player-Wi-fi-1080p/dp/B005KOZNBWAlas, it doesn't stream Amazon video, but my TVs both do.", "verified": false, "helpfulness": "2/14", "author": "Mathew Hennessy"}, {"rating": 4.0, "review": "This is Amazon's first effort in the Roku/Apple TV market - a \"single serving pizza box\" that delivers Netflix, Amazon Instant Video, and most of the other \"usual lists of suspects\" with the notable exception of iTunes (which is no surprised, that's Apple's tight fist not Amazon's competitive instincts).As a streamer for Amazon content, the Amazon TV is SUPERB. We also have access to Amazon content on Roku, but the interface on Roku is not nearly as inviting. Also, Amazon TV _seems_ to buffer better, there hasn't been any \"adaptive downgrading\" of the stream quality (from HD to SD) to compensate for \"slow internet\" or \"internet bumps.\" Image quality has been superb.In terms of design, the \"box\" is high quality in appearance and feel - the bottom is \"soft touch\" coated to reduce slip. Same with the remote control. The remote is \"modern compact\" which is to say, tiny, feels good in my medium sized hand (maybe tiny is good for kid's hands when used for game play), but I would have preferred a large enough device to accept AA instead of AAA batteries to reduce e-waste - AAA have a much shorter lifespan than AA's. But that's a niggle.A more curious choice is the use of an old-tech \"tip\" connector for the power supply, which looks a lot like the Kindle Fire tablet charger (a 10 watt charger, which should  be plenty for this device) instead of a \"micro USB\" connector to power the device.Since the Amazon TV is essentially an \"Android tablet without a screen\" there is no reason why a normal USB charger couldn't have been provided, instead of a \"dedicated\" \"tip style\" power supply. With a normal micro USB connector instead of a tip style connector, we would be able to use this charger for other devices when the Amazon TV has reached the end of its useful life, or breaks. With a non-universal \"tip connector\" the power supply goes into our junk drawer along with all the others of its ilk from past laptops and other devices.Why $99 instead of $49, the cost of a budget Roku, still more than Chromecast?Because this is, finally, what a lot of us have been waiting for - a tablet in a box, optimized for media streaming, instead of a media streaming box with limited RAM, storage, and processor power.Like the Kindle Fire HDX, the Amazon TV has a superb, powerful processing chip with advanced graphics, and a whopping 2gb of RAM. It doesn't run \"pure\" Android, but it is close enough to move Android games over to the Amazon TV.And THAT is Amazon TV's single best feature - game potential - and it's achilles heel, the reason this is rated 4 stars not 5. It simply doesn't have enough storage space to hold very many games. All mid to high grade tablets come with 16gb. This comes with 8gb. You may be viewing this with \"streaming box\" rose-colored spectacles, in which case 8gb sounds like a lot, relatively speaking, but keep in mind even to access YouTube you have to download an \"app,\" just like on an Android tablet, each streaming service is \"app based\" not built in or with functions hosted on the providers servers.Have you checked how much storage space is consumed by Android itself (Fire OS in the case of Amazon TV), even before downloading apps?My kid has a ton of games on his iPad. 16gb isn't enough and he has to cull games then re-download them (for free) if he wants to revisit them again. But at least he has 16gb, not 8gb.I wish Amazon had offered upgrade options to 16gb and 32gb, but I feel they wanted to hit that magic \"$99\" mark with no qualifiers.Within one year Amazon will offer 16gb either stock or as an option, and as these things become the modern replacement for Nintendos, even 32gb will look attractive.I can't recommend waiting for increased storage options since \"tv box as gamer\" is a new concept and tech watchers have been waiting for this from Apple for 3 years. The idea of having the chip and os in a box that is much cheaper than a full tablet or gaming console has been appealing for years, but so far no one has executed on it, or executed well (Ouya). Amazon is poised to change that, but for now they are really selling the ease of streaming Amazon Instant Video, while flying under the radar (slightly under) about the huge potential of gaming with the hardware in this device.But 8gb simply isn't enough!", "verified": true, "helpfulness": "2/2", "author": "MWebb"}, {"rating": 5.0, "review": "Frustration free packaging was (almost) amazing as always except for one thing. The Amazon Basics batteries for the remote control were so tightly wrapped in thick plastic that it literally took 5 minutes to get them unwrapped to put them in the remote control! Other than that little bit of frustration, everything else was quick and painless to get the Fire TV up and running.The product itself is amazing, easy to use, and looks to have so much potential. Now if there could just be a single product to allow access to my iTunes library, Amazon Prime library as well as all the various online services. But that will never happen anytime soon due to competition, which is a good thing. This has a place next to my Apple TV and both are being used regularly now!", "verified": true, "helpfulness": "1/2", "author": "S. Hipp"}, {"rating": 5.0, "review": "Great product. Better than the Roku HD it replaced. Excellent value from Amazon. Easy to set up and use. Love the Photo option.", "verified": true, "helpfulness": "1/2", "author": "GAC"}, {"rating": 3.0, "review": "Fast - responsive - voice works excellent... SO WHY does it have such a limited number of apps?  VUDU and HBOGO are really a necessity for a successful product like this (Showtime to go does not accept DISH as a viable provider either - making it useless for me) - Unless this is added soon- I may decide to return it and go with one of the competing devices that DO offer those apps...", "verified": true, "helpfulness": "2/3", "author": "Patrick Stansbury"}, {"rating": 5.0, "review": "I have tried and own all the video streaming devices in the market. Unlike some of my other experiences Fire TV was extremely easy to set up and use. For example, when using Chromecast I had to go in and adjust my Xfinity modem/router because it didn't work with Xfinity out of the box. Even after making the appropriate adjustments it caused problems for my entire network. Even when working Chormecast performed poorly. I finally had to disconnect it from the network.Although I haven't experienced such bad problems with other streaming devices Fire TV works exceedingly well. The voice search really does work well. My one complaint is that I wish Apps like Netflix also tied into voice search.I was so impressed I bought Fire TV for my whole family and they are enjoying it without my intervention. I've always gone out of my way to arm my family with technology that didn't require me to be systems administrator which is why I moved my family a decade ago from Windows to Mac. Amazon has succeeded in creating an appliance that you simply plug in and use. Kudos...", "verified": true, "helpfulness": "2/2", "author": "LeonW@AWS"}, {"rating": 5.0, "review": "FINALLY!  I have been waiting for this level of technology for years!  It always seemed so possible but just out of reach.  Now its here.  Set up was beyond simple.  Box is tiny.  Remote very slick.  Advanced technology to me is should be simplicity and this is just that.  Almost no instructions come with it because it is that simple to use.  Before firetv  I was connecting my lap top to watch Amazon prime videos and the picture quality was terrible (due to the laptop-tv interface).  With Fire TV it is true HD!  All my Amazon library was there waiting for me just as they said it would be configured for my account.Thew voice search is utterly amazing!  It is literately 100 times better then Siri....If you are an Amazon prime member this is a MUST!  Kudos Amazon!! Seems like nothing is done right anymore but this is PERFECT!!  Worth every penny!", "verified": true, "helpfulness": "4/4", "author": "Sherman"}, {"rating": 5.0, "review": "I have owned just about every Roku there is and when I saw the new Amazon Fire TV I wondered if owning one more streaming device would improve my TV experience. It was hard convincing another family member that we should give this new player a chance since we had just purchased a Roku 3 less then six months ago but after reminding them that the Roku crashes quite regularly (each new model gets worst) and chooses to update itself at the worst times (in the middle of movies and during prime viewing hours) she agreed.The Amazon Fire TV is fast and when I decide to finally watch something after viewing numerous selections there has not been any wait time for it to load. I don't know how they do it, but it works great. I have only tested it using Prime and not another service like Netflix which I only use a few months out of the year but not at this time.The picture quality is sharp and audio is great (I purchased the audio fiber optic cable from them and my sound quality seems to be better than the HDMI digital quality). Setup was a breeze since I am a prime member and had instant access to my account. The player update which takes place when first plugging in the unit only took ten minutes and not thirty like some member claimed. This player updates itself when you are not using it so those annoying updates and crashes from my other player should not be an issue.The navigation isn't hard to get use too but could use some work which I expect to happen in the near future. It works and doesn't pose any major problems but like any other software takes getting used to. The remote is simple to use and is configured  like other remotes so you can navigate through  their system.I build computers and know what makes them work better and the quad-core processor, 2 GB of memory, dedicated GPU does make a difference, so don't be fooled into believing that it doesn't. I attributed the smaller CPU and memory in the Roku as the cause of the crashes (less buffer for the movies and processing power for HD movies) and also the heat buildup due to their small size. The Amazon Fire seems to keep cooler.I have to agree with others that the voice search works great and is much faster than typing in your search. There are many other aspects of this unit that I have not tried out, like gaming, but if I was into low level gaming on my TV through this device I would consider buying their game controller. If serious gaming is your bag you probably wouldn't be buying this unit for that and I wouldn't try to compare it to those other units which are for serious gamers first and TV watching second.The bottom line is this; for $99 dollars this unit blows my Roku 3 away and with time should get better and not worse as my other streaming device has. My only regret is not being able to sell my Roku but since it crashes so much I wouldn't feel right passing it on to others.", "verified": true, "helpfulness": "4/6", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I own the original Roku, a Roku 2, 2 Smart TV's and Google Chromecast and find that the Amazon Fire is an incredible device when comparing to my other streaming methods. Speed is incredible and although there are only a few apps out at the present time, I feel the box is powerful enough to wait and see as new apps are made available. Wonderful unit, would recommend to all.", "verified": true, "helpfulness": "0/0", "author": "Andy G."}, {"rating": 4.0, "review": "The system comes in very nice packaging (is Amazon competing with Apple for fancy boxes?). It is very easy to set up. I was AMAZED that it already had my prime account set up in it. Only grumble was that it insisted on downloading new software as soon as I connected it. I would have like the option to do that later so I could play with it first.The user interface design is very good and the voice activation is easy to use and works well - even with my British accent.", "verified": true, "helpfulness": "0/0", "author": "Nigel Thompson"}]