[{"rating": 3.0, "review": "So far this product is easy to navigate, However I feel the AMAZON PRIME content is lacking. Most of the available movies and TV shows are very old, and when watched via prime does not appear to be in HD.  As a prime member I would expect more.", "verified": true, "helpfulness": "0/1", "author": "Cassandra Morales"}, {"rating": 5.0, "review": "The amazon fire tv box works as described. I enjoy watching television.", "verified": true, "helpfulness": "0/0", "author": "elaine wells"}, {"rating": 4.0, "review": "Cool tool....only issue I ran into is loading Netflix.  I haven't figure it out but will do when I get a chance or call the support line.  I did the initial setup for Prime and Hulu, Showtime, HBO then went out of town.  Hopefully, the Netflix can be loaded.", "verified": true, "helpfulness": "0/0", "author": "John Medina"}, {"rating": 3.0, "review": "I got it for the Netflix. Just about everything else costs more money to veiw.", "verified": true, "helpfulness": "0/1", "author": "Charles B."}, {"rating": 5.0, "review": "It works great but I am disappointed that some TV and movies that are free on network TV are not included in Prime for free and have to be purchased.", "verified": true, "helpfulness": "0/0", "author": "david r. smith"}, {"rating": 5.0, "review": "This is an amazing product that surprised me. I recommend it highly and am glad that I received it as aChristmas present.", "verified": true, "helpfulness": "0/0", "author": "Debra Vinson"}, {"rating": 3.0, "review": "Works but I don't use it as much as I thought I would so far", "verified": true, "helpfulness": "0/0", "author": "David R Hull"}, {"rating": 1.0, "review": "The Amazon Fire TV may be enjoyable to other customers but for me, it was an experience I hope that I'll never have to repeat again. When I received it as a Christmas present, I tried multiple times to stream videos and movies. None of which played and each kept popping up with and error. Frustrated with the Christmas present I called to see what was wrong with the product. Amazon's technical support representatives gave me about an hours worth of instructions and guidance to see what the problem with the TV was. After numerous diagnosis with the product, they were left no choice but to email another individual to see what the problem was. The representative told me that the Saturday after Christmas I would get an email stating what was wrong with it; I never received an email. Calling again, the representatives told me that January 3rd was when I would receive an email explaining what was wrong with the product. I had to wait another week to see what was wrong with the product. Frustrated and losing patience with product and the service I was provided, it had been more than a week since I received this product and yet I still cannot use it as my free one-month watching of prime TV was getting closer to the expiration date. If there was a rating of \"no stars\" I would put it as that because I cannot seem to find the amount of satisfaction with the service and the product to rate it a one. I have great WiFi connection and a fairly new TV so there is no reason for this product to not work. I am extremely dissatisfied with this product and the customer service provided by Amazon. I am questioning whether to purchase another product from Amazon again. Judging by the enormous disrespect and the inability to punctually provide me a simple explanation to what the problem with my Fire TV is, I have no choice but to return this product in exchange for my money. I cannot believe this is how amazon treats its customers like this. It would be a great product if it actually functioned correctly but due to the customer service provided by Amazon, it is unfortunate to say that i had a dissatisfying experience and I will be telling other individuals about the lack of respect and satisfaction provided by this product and Amazon's representatives.", "verified": true, "helpfulness": "4/8", "author": "Nolan"}, {"rating": 5.0, "review": "Simply just love it.", "verified": true, "helpfulness": "0/0", "author": "Beth Edmonds Stewart"}, {"rating": 5.0, "review": "Awsome streaming product! Highly recommend this! Lots of free movies and movie series. Saving $140.00 per month on cable bills. Pandora and too much to mention!", "verified": true, "helpfulness": "0/0", "author": "Steven"}]