[{"rating": 3.0, "review": "If you use the voice command to search Netflix for movies, it charges you $3.99 for each movie.  You must type in the search, instead, so that clever little voice search button is worthless for anything but Amazon Prime.  They should tell you that somewhere, as I paid for a movie, although they are refunding it after about a half hour on the phone talking to their help line, who didn't know why it was charging me, even though I was on the free trail. I bought this to be hassle free, and it didn't turn out to be.", "verified": true, "helpfulness": "0/0", "author": "gary"}, {"rating": 5.0, "review": "UPDATED to add this:ONE-YEAR WARRANTY if defective.Go here to see the full information:http://www.amazon.com/gp/help/customer/display.html?nodeId=201484890===============At times, Amazon is promoting this so that you pay in  5 installments, with *no* interest charged .... so for just under $20(including tax), you can receive and start using your Amazon Fire TV and then you'll automatically be charged just under $20 for 4 more months and that's it.  Easier than paying $99 plus tax up front for many of us.  Check for the promotion; I can't promise it will be available when you order.So happy that this met my expectations, especially having the remote weigh so little and work with just slight pressing -- my hands are not able to hold remotes that weigh what an ordinary remote weighs.And often my fingers can't press hard enough the first time to activate buttons on remotes (or phones or microwaves, etc.).So the remote for the Amazon Fire TV is a treasure and dream come true for me.I bought this to be able to watch Netflix on my TV.  Works like a charm!The extras that I am already using:--Access on my TV to Pandora (free music site I already had joined)--Access to some Kindle apps that I like to see in bigger screen (such as recipes)--Lovely Amazon-supplied screensaver photos ... and I'm a person who doesn't even like screensavers!You don't have to have screensaver turned on.You can use your own photos as screensavers.But till I take some new photos of my own, I'll be enjoying the Amazon photos (nearly 200 breathtaking photos to experience).--The voice search feature of Amazon Fire TV  that works when I'm watching Amazon Instant Video ... an easy way to find other movies with the same actor.The extras that I look forward to using:--Whenever I have a new set of photos I've taken, I can enjoy seeing them as screensavers till the \"new\" wears off for me.--Watching more Amazon instant videos ... I've watched very few on my computer and Kindle, even though many were free.--Finding out what I've overlooked but will enjoy.  (smile)", "verified": true, "helpfulness": "1/1", "author": "devoted reader \"gemini2005\""}, {"rating": 3.0, "review": "I just connected the Fire TV unit a few hours ago.  I think I'm going to like it.  I would have rated it 6 stars and a supernova if it could buffer or stream content to a USB hard drive.  I live in the wilderness overlooking a national park so my internet connection does not approach warp speed.  It regularly tests out between 1.6 and 1.8 Mbps.  I've only tried to watch one episode of Star Trek, and it stopped every few minutes to buffer, while my previous streaming device (Panasonic Blu-Ray player) would play the same content from Amazon Prime without interruption...same wired hookup.  In a perfect universe, anything added to my Watch List would automatically load via the USB port onto an external hard drive so that it could be watched without interruption...allowing the Fire TV to become a Fire DVR.  Pausing the show does not help much because the video does not buffer significantly...definitely not like content from YouTube or Vimeo does on a computer.One note:  an hour after I turned the TV off, the Fire TV still seemed to be pulling significant bandwidth.  I went back in and disabled the screensaver, which seemed to cure the problem.  Maybe it was downloading an update.Please Jeff, issue a firmware update that will make it possible to add Watch List programs to an external drive for those of us who can't stream HD.  I would much rather wait an hour or two for a program to load than be interrupted every few minutes by the little spinning circle.  Even increasing the available memory for buffering would help considerably for those of us who boldly live where no one has connected before.", "verified": true, "helpfulness": "0/0", "author": "F. Mendonca"}, {"rating": 4.0, "review": "I very much like the ease of use and the speed; especially compared to my previous tool (Samsung Blu-ray for Netflix and wii for Prime).  There is no comparison with the speed, reliability, and simplicity being great.  The quality of the picture is good.Thanks to comments posted in reply to my review, I now know that the Fire TV turns off after 15-30 minutes of non-use.  I was disenchanted until I saw the comments because I could not, after searching Amazon etc., find a way to turn off the device.  There is also eventual mention, about Fire Tv turning off and doing updates in the background, in the help video on basic (very basic).  Before the helpful posts, I had unplugged Fire TV to turn it off.", "verified": true, "helpfulness": "0/0", "author": "nancy goins"}, {"rating": 3.0, "review": "We have enjoyed using Amazon Fire.  Setup was more difficult than it should have been because of a problem with the HDMIO cable.  A special one is needed and that information is not provided with the product.  When using the product, it is not clear if a video is free and part of Prime or if there is an extra charge.  Also, some TV series are identified as available, but when you go to individual episodes, none are really available.  Confusing.  All-in-all, I'd get it again if I had the chance.", "verified": true, "helpfulness": "2/2", "author": "Richard R."}, {"rating": 5.0, "review": "Tried it for a few weeks now and I love it when I received itIt was an easy set up love the fact it has voice search NO hunting and peckingLike on Apple TV and Roku  and the picture quietly  is greater then apple and also RokuAgain love itTons of movies and TV shows to purchase  or rentIT's  A GREAT PRODUCTGO OUT AND GET ONE", "verified": true, "helpfulness": "0/0", "author": "ken's time"}, {"rating": 4.0, "review": "I enjoy the FIre TV. ITS FAST!  There  have been a few issues and i had to disconnect the power to restart it. would like to see more apps for more content. also would be nice if the voice search function would work with other streaming clients.  havnt played the games so i dont have any comment about that function.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "One of the best purchases I have made. Great selection of title's.  Does exactly what it says it can do. Voice search is great. Still new to the market so they are working on getting some of the apps like the cw, cbs, abc, Fox etc. They did acquire hbo. Great product. Can't wait to see what's to come.", "verified": true, "helpfulness": "0/0", "author": "Redline"}, {"rating": 5.0, "review": "The speed is fantastic. My only wish is a headphone jack or even bluetooth sound.The only reason I still use roku 3.", "verified": true, "helpfulness": "1/1", "author": "Luther Owens"}, {"rating": 4.0, "review": "The Fire TV was very easy to install and came pre-configured with my amazon account. It's fast and has a small footprint, so it fits almost anywhere. I was very pleased with how easy it was to set up and how I was up and running within minutes. The animated intro was very cute and very informative and the voice search rocks! So far so good! The only reasons I don't give this 5 stars are because it doesn't make it clear enough which are amazon prime items and which are items to purchase, especially when searching. Upon trying the search for the first time, my son accidentally purchased an episode of a tv show - thank goodness it wasn't the whole series! I have since enabled the parent controls to give an extra confirmation to a purchase, that should eliminate problems in the future but I wish it was clearly marked that it was not a free episode. The other reasons are both related to the screen saver. I wish there were more choices and I wish there was a setting to have the time and temperature displayed - I was spoiled with my Roku and is a feature that will sorely be missed.", "verified": true, "helpfulness": "0/0", "author": "Elaine Catherine Lombardo"}]