[{"rating": 3.0, "review": "I like the device and the interface.  Has most all the content I need.  My issue with it is the wifi, I have the hardest time keeping it connected.  I have a new Asus router so I know that's not the issue, plus all the other devices in the house and around the fire stick don't have the same problem.  If the wifi worked better this would be a five star review, maybe I should be giving it a two star.", "verified": true, "helpfulness": "1/1", "author": "Matt Lamb"}, {"rating": 2.0, "review": "Hate that amazon don't let it user root their devices.", "verified": true, "helpfulness": "0/4", "author": "Moshe Siani"}, {"rating": 5.0, "review": "Great purchase! This will provide unlimited entertainment!", "verified": true, "helpfulness": "0/0", "author": "Rita M. Marsh"}, {"rating": 5.0, "review": "I like what I can see so far, just getting to know how to use it and have watch a few shows that I like already. I'm just a beginner.", "verified": true, "helpfulness": "0/0", "author": "A. Rivera"}, {"rating": 5.0, "review": "Being a Prime user, this is Great Product, better than any smart tv software out there, it upgraded our entertainment experience.", "verified": true, "helpfulness": "0/0", "author": "rralcala"}, {"rating": 5.0, "review": "Amazingly easy to set up.....ten minutes and done! Found my home wi-fi all by itself, put in wi-fi password and we were done. Spent the rest of the day trying out the voice search (perfect!) and cruising through the various categories of entertainment. We couldn't be happier.  Two wishes: wish more movies and TV were free to Prime members and always wishing for more additions to those categories.  Also, in your page description of Fire TV, please tell your customers that they will need to buy an HDMI cable. I only learned that piece of information by reading the reviews.  But, 99% a beautiful product! I've already been telling my friends about it.", "verified": true, "helpfulness": "0/0", "author": "gr8rytre"}, {"rating": 5.0, "review": "I just love Fire TV!  In conjunction with Amazon Prime Membership the amount and quality of movies, TV series, and games is amazing.  I rarely have issues with the connection as it is usually my Wi-FI.  Would recommend this to anyone so as not to buy so much cable or satallite services that cost so much more.  Have a great variety of family type shows plus many extras.  The ease of use of the system is great.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "After paying for my amazon fire tv I assumed that the the movies that were on the fire would be accessible to me free of charge. I have to pay for everything. Tell me what the big deal is I can do that with verizon vios and netflex. Why are you advertising this product like you don't have to rent or buy another movie as long as you own the fire. We use it sparingly because I don't get it. I can go over to walmart and purchase a movie for 5 dollars and you want me to rent it for 4.99. Sorry this is useless.", "verified": true, "helpfulness": "2/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Having Fire TV will help break the cord to cable and satellite TV.  All that is left is getting my Tivo DVR to record local channels off my HD Antennae and the plan is complete.", "verified": true, "helpfulness": "0/0", "author": "Tim Somers"}, {"rating": 5.0, "review": "Oh yeah i absolutely love this item from amazon.  Definitly worth having beats out anything that i have owned in the past or seen.  This was a gift from work.", "verified": true, "helpfulness": "0/0", "author": "Everett Taylor"}]