[{"rating": 4.0, "review": "Only issue and reason I won't buy this product, It doesn't have HBO Go,", "verified": false, "helpfulness": "2/3", "author": "Amber"}, {"rating": 4.0, "review": "I also own a Roku 2 which I use on my boat. I use the Fire at home. They are similar and there are things I like and dislike about both. I like the search on Roku better. When you search a title it searches into the different apps and gives you a choice of which apps you prefer. As some charge for content and others offer the same content for free this is a huge advantage. Fire has the voice activated search which is nice but I seldom use it because it only searches Amazon content.  Another thing I dislike is how the preview screens are formatted. I generally cannot read the titles or other descriptions on the Fire as they are rendered too small.Like all of these streaming devices I wish they offered some sort of live news service. To the best of my knowledge none do.", "verified": true, "helpfulness": "1/1", "author": "Fparry"}, {"rating": 5.0, "review": "Very efficient and easy.", "verified": true, "helpfulness": "0/0", "author": "Gerhard K. Maurer"}, {"rating": 4.0, "review": "I received an email with special pricing for this and after researching, I decided to purchase the Fire TV.  It was easy to set up and finding movies/shows is easy too.  The voice search is extremely accurate but as others have said, it only searches the amazon library.  I'm on Verizon WiFi and I get no \"buffering\" pauses like i did when i used my Samsung home theater.  Has a nice picture and sound.  My only complaint is that i cant use \"showtime anytime\" because my TV provider is direcTV and they aren't on the list of service providers when setting up the app.  Not cool.Note:  When searching for a movie/show, be sure to look thru all the apps because you may have to purchase the show/movie on one app but it may be free on another app.", "verified": true, "helpfulness": "1/1", "author": "dawnelle sager"}, {"rating": 2.0, "review": "You do not have many games and most of its content is not available for my country, unfortunately I can not return but I think 99 dollars for youtube is not appropriate. I made a bad purchase.", "verified": true, "helpfulness": "1/1", "author": "Adrian Pulgarin"}, {"rating": 3.0, "review": "Great product easy to use. Prime tv wont stream like netflix and its hard to find whata free and whats not.", "verified": true, "helpfulness": "1/1", "author": "Blondie"}, {"rating": 5.0, "review": "Best darn picture of any device in my house!!!!  If you would have told me this device would give the smack down to all the other digital players well I would  have suggested you were crazy or an idiot.  I have the Fire TV hooked up wireless and the performance is just grand. So good is this device I plan on buying the game control.  Please bring the Steam client!  Good luck Amazon as I hope you can continue to bring this level of device and performance.  First Prime...the Kindle.....now fire TV.  I am almost ashamed to say I am considering a look see at your phone. Oh one more unread piece of advice...keep third party stuff in your media domain. Please resist the idea of locking others out.  Netflix is just wonderful on this device.", "verified": true, "helpfulness": "1/1", "author": "Roland12b"}, {"rating": 1.0, "review": "There was a flaw in the machine that I received.  For some reason, it would not transmit sound to the subwoofers.  So I sent it back.I will admit that the voice-activated search was cool, but the programming is not near as complete as the Roku systems that I currently use.", "verified": true, "helpfulness": "3/7", "author": "R. Michael Allen"}, {"rating": 5.0, "review": "OMG i love my amazon tv i have bought two so far. the best money i ever spent!", "verified": true, "helpfulness": "3/3", "author": "jason davis"}, {"rating": 2.0, "review": "Hardware is excellent.  The interface is bizarre and confusing.  Your personal content is mixed in with all sorts of content that Amazon wants to sell you.App support is lacking. Even amaz", "verified": false, "helpfulness": "1/2", "author": "Alfred Borges"}]