[{"rating": 5.0, "review": "I evaluated all the options out there, and this is the one to get; especially for Prime members! The voice recognition ability alone puts Fire ahead of everything else! It's fast and easy to use! I can't wait to hear what's next!", "verified": true, "helpfulness": "0/0", "author": "Jim K."}, {"rating": 5.0, "review": "Kindle Fire TV was easy to install and easy to navigate it.  I will enjoy it.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Connie Betzer"}, {"rating": 5.0, "review": "I really like this product.  Streaming ability is very good.  Ease if use, voice recognition, and sleek remote style all superb.  I would not hesitate at all to purchase... in fact I may get a second,", "verified": true, "helpfulness": "0/0", "author": "R. Beglau"}, {"rating": 5.0, "review": "Bought this for my husband and he is thoroughly enjoying it.  No problems.  Works great", "verified": true, "helpfulness": "0/0", "author": "JoAnn Vierling"}, {"rating": 5.0, "review": "Great way to watch television", "verified": true, "helpfulness": "0/0", "author": "Kevin C. Meyer"}, {"rating": 2.0, "review": "I have bought several things from Amazon love it I have the Kindle HD I have the Fire Phone love it and now I have 2 Fire TV streaming devices 1st one works perfectly very instant does not pause etc 2nd one well... you would think it would work the same but it has had issues from day one my daughter lovers netflix and it would stream everything but netflix I even raised my how many tv's can watch Netflix on my netflix acct and it still would not stream it finally started working tonight so let's see the 1st one I bought online Amazon 2nd at best buy so....", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent service. Has all my favorite HBO series. I recommend this to everybody.", "verified": true, "helpfulness": "0/0", "author": "richard fielding"}, {"rating": 5.0, "review": "Works for me!", "verified": true, "helpfulness": "0/0", "author": "Lauren Testa"}, {"rating": 5.0, "review": "I really enjoy this one. My TV is a smart TV but starting to become dumber and dumber (wireless and lan modules are failing) so streaming is not working as it used to. With this is like giving a second chance to the same tv. Control takes time to get used to but nothing out of this world.", "verified": true, "helpfulness": "0/0", "author": "CSI GROUP \"JJ\""}, {"rating": 5.0, "review": "We are really enjoying our new Amazon Fire TV.  Wish we had purchased it sooner.", "verified": true, "helpfulness": "0/0", "author": "Dorene Jones \"Doejo2245\""}]