[{"rating": 4.0, "review": "Fantastic item. I can't believe how small it is", "verified": true, "helpfulness": "0/0", "author": "Jeremy Henson"}, {"rating": 4.0, "review": "Makes a dumb TV smart!", "verified": true, "helpfulness": "0/0", "author": "zoe"}, {"rating": 3.0, "review": "I wish I could have rated this 5 stars! Pros: We loved how fast it was, LOVED the voice search, and the setup was quick an easy.Cons: 1) Netflix never worked properly, we had to sign in every single time and it rarely played video at all. Then, when it did play, there was a line scrolling through the bottom of the screen. 2) the layout is annoying and you have to navigate through everything to get to one little icon that you want. There's no quick way to put all the icons you want in one place for easy access unless you just used it and it's in \"recent\".I would love to try it again when they have figured out what didn't work well with the first generation.", "verified": false, "helpfulness": "0/0", "author": "Afole"}, {"rating": 4.0, "review": "Hugely Convenient and works better than other streaming services. Good selection of prime free kid shows and movies but could be better more free/prime movies for adults. Also voice search is excellent but does not work for every category/app.UPDATE ABOUT CONTROLLER:  We also ordered the amazon fire game controller on Dec 22 with this. Its part the reason we bought the unit in the first place. After waiting weeks for it to ship (they state 2 to 3 weeks), the item kept getting further delayed. When I pressed them on the date, Amazon gave me a new date of mid February!  The game controller is OUT OF STOCK and Amazon's claim of shipment in 2 to 3 weeks is NOT TRUE. This morning they canceled my open order of the game controller and will not reply to my emails requesting why it was taken away from my open orders. Don't order the game controller as you wont get it for months.", "verified": true, "helpfulness": "0/0", "author": "Francine V."}, {"rating": 5.0, "review": "I purchased the Fire TV box to replace my Roku.  I am extremely impressed with the streaming quality both with the sound and video.  I stream Prime from an Xbox 360, Roku box, computer and a kindle fire HD.  But by far, the best streaming I a have seen to date is with the Fire box.  It seems to come in at Blu-Ray quality, and almost instantly.  Now, to be clear I have Verizon Fios not Comcast who is known for throttling so I can only speak of my experience in a non throttled environment.I purchased a game controller for this also, I find that some games are designed to use a controller, and those work very well, great graphics, low prices.  But if a game was not designed to work with a controller its not so good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Conan Longshnk\""}, {"rating": 5.0, "review": "Love it! The voice search capability is awesome.", "verified": true, "helpfulness": "0/0", "author": "eRIC"}, {"rating": 5.0, "review": "Wish I would have gotten this a lot sooner!  One improvement that would make it the best thing ever, i wish it would control the tv volume from the remote.  Aside from that, one of the best purchases I've ever made!!", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 3.0, "review": "To install and use is pretty easy and the voice command is great BUT I was disappointed in the offers under prime. Lots of free downloads for far gone seasons of shows and a few older movies but anything recent, your going to pay for.  Many times the system was just not working and I had to come back later ....  My grandkids loved the games but they also had a limit and if you wanted to play further you had to once again pay pay pay!  As my mother once told me ...\" nothing is free\"  and in this corporate run world, its so true.", "verified": true, "helpfulness": "0/0", "author": "Vic \"#1 Vaughn fan\""}, {"rating": 5.0, "review": "Easy to navigate.  Many Prime movies to select from.  Wife just loves it!", "verified": true, "helpfulness": "0/0", "author": "David G"}, {"rating": 5.0, "review": "These things are so perfect especially with XBMC that I now own 2 and I also own a firestick", "verified": true, "helpfulness": "0/0", "author": "Gary"}]