[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"lassie\""}, {"rating": 3.0, "review": "if I have three tv in one house do I need three fire tv?", "verified": false, "helpfulness": "0/3", "author": "janak"}, {"rating": 3.0, "review": "Did not know it's refurbished....", "verified": true, "helpfulness": "0/2", "author": "PeterLilly"}, {"rating": 5.0, "review": "Was easy to connect and start, extremely good quality of streaming video. Very easy to use and understand the remote. Was actually surprised by the quality and vivid picture. Setup took only a few minutes and the download was jut a few minutes and it was and running. Very pleased. Probably will order a second one for another TV.", "verified": true, "helpfulness": "0/0", "author": "BUSTER 1"}, {"rating": 5.0, "review": "Yes.  The only issue we had was there was no instruction book.  I had to order it separately.", "verified": true, "helpfulness": "0/0", "author": "LadyS"}, {"rating": 3.0, "review": "I wanted to love this. Unfortunately, it did not play nice with my DSL internet. It's only as good as your internet! It kept losing my internet settings; even wired ethernet? Really? I could never watch anything. Maybe mine was defective. I don't have patience for troubleshooting. I had to return it. I got a Roku 3 instead, Which works perfectly!", "verified": true, "helpfulness": "0/1", "author": "Sandi P"}, {"rating": 2.0, "review": "Not what I expected based on advertising", "verified": true, "helpfulness": "0/2", "author": "Michael Gerido"}, {"rating": 2.0, "review": "For some, the concept of this product may work. I found it useless after two weeks and it's been unplugged since. - I've a paid cable subscription and Fire has no Time Warner app and the Fox Sports app is pathetically limited. - For my needs I've done much better with a Home Theater PC, which by the way, using Fire you're forced to subscribing to Hulu Plus, whereas Hulu Free is available on PC only.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like this product!", "verified": true, "helpfulness": "0/0", "author": "F Tor"}, {"rating": 5.0, "review": "Have not had the opportunity to use it as much as I would like to. Up to this point I am very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Jeaneen"}]