[{"rating": 4.0, "review": "Having tons of fun with this.  I also love that I am free from paying for cable, which has way too many ads.  I really like my Fire TV  but I do miss some TV.  Mostly local news.", "verified": true, "helpfulness": "0/0", "author": "Anna Beth Stevenson \"beth stevenson\""}, {"rating": 5.0, "review": "I am not very experienced hooking up electronic equipment but I did this all myself, just as advertised.  Love it!  We are cutting the cord with expensive cable TV.  Thanks for the $50 off for trying SlingTV.  We are giving that a try also.", "verified": true, "helpfulness": "1/1", "author": "patty lehman"}, {"rating": 1.0, "review": "Worked  2 hours.  not  good,,,", "verified": true, "helpfulness": "0/1", "author": "marge"}, {"rating": 5.0, "review": "It works immediately after a simple setup. Get 1080p resolution. Simple but powerful but also reasonable price.", "verified": true, "helpfulness": "0/0", "author": "ABKay \"ABK\""}, {"rating": 5.0, "review": "Love my new fire TV", "verified": true, "helpfulness": "0/0", "author": "Brad Smith"}, {"rating": 4.0, "review": "I own several different type of TV top boxes (apple tv, android box, etc ...) I have to say this is the fastest box and the and easy to use GUI interface of them all. However, the apps is very limited  because you can't use Google Store.  I would give it a 5 stars if this box can use Google Store", "verified": true, "helpfulness": "0/0", "author": "QN"}, {"rating": 3.0, "review": "I have had this for a little over two months now and I had wanted to give it 5 stars prior to doing this review. This unit has been a great joy to use when watching movies, Netflix and Hulu but I just bought MLB TV and that is where it is failing I do not know who has dropped the ball on this app. but it is not allowing me to watch more than 30% of the games. I do not understand why some gams come through and most others flash a screen saying your internet is not working and to contact your provider. Is this the box or is it MLB at Bat? I called customer service for MLB and they say they are aware of the problem but do not say whos problem it is. I will update this review if and when this is rectified. I like the products on the other aspects being I have two Firesticks and one Fire Box and hope this problem can be corrected as I love my Baseball.", "verified": true, "helpfulness": "1/1", "author": "David E. Ward"}, {"rating": 5.0, "review": "This is actually my first review ever.  I felt that i owed it to the Amazon community after the many years of buying items and not reviewing a single one.Device ReviewWorks great.  Hardwired into a \"dumb\" 1080p Samsung TV.  i find better overall quality/experience when it's hardwired vs streaming wifi (lots of variables with a network, hardware used, line of sight, etc), and the box + TV is cheaper than the new \"smart TVs\" with inferior streaming capability. The device works great for me, and at a reasonable price.  The horsepower allows you add apps like Youtube, Vivo, etc and rarely (if ever) do i sit spinning waiting for it to load.  I started using this streaming from wifi to a 720 tv, and loved it so much that i went all in on streaming and upgraded my modem, router (hardwired the box to tv), and TV (to 1080p) to prepare for an even better streaming experience. Probably didn't need to, but i felt like it would be a better long term play for the family. The picture is outstanding on 1080p content.  The remote works great - the voice search is often the easiest way to find content.  I will say that the \"sleep mode\" stopped working for me.  So to \"turn it off\" i have to go to settings and select sleep.  Not a deal breaker, more just annoying with the extra step.  I recommend this box to all of my friends and family every time streaming comes up in conversation.  Our DVD player is \"smart\" and can stream as well.  Test for test, Amazon Fire box out preforms my Samsung DVD player hands down. The device even tells you when the batteries in your remote are running low... haha.  Thought that was great and about as \"idiot proof\" as it gets.Now for Content Reviewwhen i first bought this device (about a year ago) i immediately unplugged it and boxed it up.  It was going back because the content was minimal, and/or not worth it. I'll be honest, it sat on my office desk under some papers and i had totally forgotten about it.  several months later (embarrassingly), i was cleaning my office and i found that i had not returned it. I decided to give it another chance because it had been months. Man was i glad i did.  The content is so much better.  The Amazon specific content; Top Notch.  There are a few shows that i think are incredible that Amazon produces: Alpha House, Mozart in the Jungle, Bosch... All 5 Star shows.  The new Pilots - Man in the high castle, Cocked, Mad Dogs and a few others.... All 5 Star shows and i cannot wait for the full seasons to be released.I am impressed by Amazon's ability to produce top-notch quality shows in such a short span of time. If you are already a Prime customer, this is an absolute no brainer. And it's getting better each month as far as movies and TV available.  The \"rental\" cost of movies is usually $1 (sometimes more) cheaper than Comcast.  we have HBO with comcast, so the HBO on Amazon doesn't impress me.  especially since i don't think you can get current episodes; its just older seasons.  Whereas we use comcast for on-demand or DVR of current TV.  Finding content is still a little clunky, but it's a lot better than it used to be.  The movies you get included with Prime are what i expected. It's like Netflix - a few great ones, a few junk, and a lot of just ok stuff.  The Prime TV  offerings have been our favorite part for us because we hadn't seen a lot of what is offered.  But again, it's all older seasons and some older shows, too - like The Unit.  Great stuff we hadn't seen and not available on-demand. Really hope Amazon can strike a deal with AMC, Showtime and a few others.  It would be great to see some of that content available.The kids love the kid shows and movies.  Not much free content (if any) in the Disney world.  Mostly Nickelodeon, and channels my kids don't normally watch.  So i can't say it's any better than regular cable. But it's nice to have a kids section for appropriate content.I recently just started using the Music service.  As a loyal itunes customer i was skeptical.  Amazon did it again.  The music service is excellent.  Lot's of content available included with prime.  You can make playlists easily online and then listen to them through the box if you want.  There are channels you can stream, too.For the price - \"included with Prime\" it's very hard to complain about any of the Movies, TV or Music.  I bought Prime for the shipping.  I feel nervous that the price is going to climb to something more reflective of the value.  It probably should.  Amazon gives you the ability to take advantage of a lot, and i really enjoy the service.  Also, you don't need to buy the box to experience the content (if you're a prime client).  We bought the box because we didn't have a \"smart tv\", and even when we upgraded TV's to 1080p, we opted not to go \"smart\" because the tv + box was cheaper and provided a better streaming experience than most smart tv's in the same price range.Also important to note; we didn't buy this with the expectation of \"cutting the chord\".  it was to take advantage of what Amazon provides with our prime membership already. If you're trying to cut the chord, you'll probably be disappointed in content available.  If you're like us, and just in it to use what you already get from Prime in addition to your cable, it's hard not to be very happy with all the extra value.Keep it up Amazon.  Looking forward to the full feature movies you announced you're producing!", "verified": true, "helpfulness": "0/0", "author": "Andrew J. Ellis"}, {"rating": 4.0, "review": "I really like the Fire TV! I was under the impression that there were more movies for free, but I think for the price I got it for I can't complain. I do like the design of the box.", "verified": true, "helpfulness": "0/0", "author": "Ms. Ma'shun"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "alexander Laverde"}]