[{"rating": 4.0, "review": "Great buy!", "verified": true, "helpfulness": "0/0", "author": "Michele McCormick"}, {"rating": 5.0, "review": "Easy to use and super convenient", "verified": true, "helpfulness": "0/0", "author": "Carol Hester"}, {"rating": 5.0, "review": "good", "verified": false, "helpfulness": "0/0", "author": "wendie"}, {"rating": 3.0, "review": "I really cant review this.  The first one did not work, I sent it back, the second did not even light up, the third did not work. I spent time talking to support people, some clueless since for the one that did not light up I was told to reboot my tv.  Anyway the last person I spoke with told me that you need a fairly new tv, and mine is 5 years old. I sent it back for a refund, no questions asked.", "verified": true, "helpfulness": "1/2", "author": "Anon"}, {"rating": 5.0, "review": "There is a very good reason why this product has over 15,000 5 stars.  It was easy to install, is small, and easy to use.  The voice command feature actually works, giving you the results you asked for.  It has been accurate everytime I have used the feature.  I would confidently recommend the Amazon Fire TV to my friends and family members.  It's worth every penny.", "verified": true, "helpfulness": "0/0", "author": "J. ONeill \"Jim O'Neill\""}, {"rating": 4.0, "review": "I'm still learning what it will do but, so far I'm pleased .", "verified": true, "helpfulness": "0/0", "author": "Ellis Hill"}, {"rating": 5.0, "review": "I'm only use this dispisitev now", "verified": true, "helpfulness": "0/0", "author": "Loida Perez"}, {"rating": 4.0, "review": "My wife and I did battle with Apple TV for about 6 months until our son became concerned that we were sliding towards insanity. Good kid that he is he threw us a life ring in the form of an Amazon Fire TV! Two weeks later he called to see how we were doing with our new device and I told him that my guess is that Amazon bought an Apple TV, gave it to their developement team, and said, \"Fix everything that's wrong with this!\"Long story short that is precisely what they did! From upsizing the controls so you can actually use them to the huge inovation of Voice Search capacity they fixed all the things needing fixing...thanks! Sad to think that a company like Apple built around the concept of meeting customer needs has gotten so large that they seem to have lost their way. As in the subject line of this review I'd interpret Amazon's victory with the Fire TV as a strong \"Sell!\" command if you own any Apple stock. Steve came back the last time Apple lost their way and put them on the right path again...but he's no longer here to rescue them now...", "verified": false, "helpfulness": "0/0", "author": "Bookstore Willie"}, {"rating": 5.0, "review": "I really love this product. My only wish is that there were more free Prime movies available.", "verified": true, "helpfulness": "0/0", "author": "JH"}, {"rating": 4.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "marsha gladding"}]