[{"rating": 5.0, "review": "The connection was simple.  The operations easy.  No problems. It connected our TV to the internet beautifully so we can now use our prime movies.  We have a wifi connection from verizon.", "verified": true, "helpfulness": "0/1", "author": "Margaret A Kaspar"}, {"rating": 4.0, "review": "although sometimes it does drop out on me......hard to figure that out.....any ideas?", "verified": true, "helpfulness": "0/0", "author": "sassystuff"}, {"rating": 5.0, "review": "Very easy to use. love this investment", "verified": true, "helpfulness": "0/0", "author": "Soundtouch"}, {"rating": 5.0, "review": "I love amazon tv! Worth every penny!", "verified": true, "helpfulness": "0/1", "author": "Jenny R Louwsma"}, {"rating": 4.0, "review": "All in all this device is better than average, I own most of its competitors Apple TV, roku 3, android box and the Roku stick/fire stick. I am a huge plex user and lately I found that there are issues streaming through amazon's devices. I run a hefty workload through my network and can assure that my router can handle the workload. I like the plex layout on amazon's devices but the plex tends to freeze quite often especially when I use it outside my network for plex. I have tested other devices and the roku 3 seems to be the most stable.", "verified": true, "helpfulness": "0/1", "author": "orlando perez"}, {"rating": 5.0, "review": "Phenomenal selection! M any apps are free and offer a wide variety of  excellent programing.  We no longer require cable and we do not miss the bill!", "verified": true, "helpfulness": "0/1", "author": "Regina M. Pruna"}, {"rating": 5.0, "review": "Fast, cheap, great remote, and better features than the app via the PS3. The PS3 always needed updates, and I thought i'd use it as a streaming media player as it has more ram/hard drive and a good processor, but the device uses a lot of electricity, so I tried out the Fire TV and will now buy more to pair with each TV in my home.", "verified": true, "helpfulness": "0/1", "author": "Keane"}, {"rating": 5.0, "review": "it works, a little over priced, but it's smooth(not laggy) has a great connection to the internet(the area I had it in, when I used to use it for my xbox 360 would often cut out and go very slow at times as well, but amazon fire works awesomely) and not to mention the awesome instant video that basically has any movie you want. You will likely have to pay to rent it(not always there are a lot on prime video) which, in my opinion, is not a big deal due to the fact I used to use AT&T; to rent movies, which was the same price for about 1 million less choices. Basically if you want to watch Netflix, Hulu, or you like ordering movies, buy this :D", "verified": true, "helpfulness": "0/1", "author": "RnG Ramen"}, {"rating": 5.0, "review": "It is great.", "verified": true, "helpfulness": "0/1", "author": "BERTHA  REDONDO"}, {"rating": 5.0, "review": "Was very skeptical about the whole experience.  I have changed my point of view as there is so much to offer from this unique device.  I am 68 and still much to learn and experience I guess.", "verified": true, "helpfulness": "0/1", "author": "David L. Mccarthy"}]