[{"rating": 5.0, "review": "Great product.  Has made my TV viewing so much more convenient and accessible.  Much better than cable!", "verified": true, "helpfulness": "0/0", "author": "Jon E. Kelly"}, {"rating": 2.0, "review": "Roku is still better", "verified": true, "helpfulness": "1/4", "author": "Philip Guenaga"}, {"rating": 4.0, "review": "Great device, fast and responsive. Works with all types of controllers. The 360 PC adapter generic and genuine work as plug and play. However for emulators you will need a mouse of some kind to select some input options. Not rootable until an update to the root software becomes available. Can install kodi and lama via the amft compainion app.... Google it, its a big time saver for unregistered apps for the fire TV. Over all I am happy with it other than the current inability to be rooted. I will just need to become more familiar with kodi-xbmc.", "verified": true, "helpfulness": "0/0", "author": "jimmy"}, {"rating": 5.0, "review": "I love how easy it was to set up! It is so much easier to maneuver around inside it than my smart tvs. I also love that we can access my daughter's free time account so she can watch even more videos that are age appropriate.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got rid of cable TV for a Sling TV service.  Replaced all my cable boxes on 3 TVs with 1 FireTV and 2 Firesticks.  Smooth transition with all 3 devices delivered pre-configured with my Amazon Prime account.  I even installed XBMC. I used to pay $180/month with cable TV and Internet.  Now less than $75/month.  SlingTV is not perfect but it has most of the channel that I like.  I hope someday Discovery and History channel will be offered. I heard an HBO streaming service will be offered soon.  The controller is awesome with very few buttons.I also own a Chromecast, Ouya and an AppleTV and you can't even compare the power and the functionality of a FireTV.", "verified": true, "helpfulness": "1/1", "author": "jasonc"}, {"rating": 1.0, "review": "disappointed that I can not hook up to my TV. Can someone form tech support call to assist installation. Frustrating when dealing with persons that keep asking you to reboot. Waiting on a new unit, however think it was support person unsure how to help. 201-376-5937 Jim", "verified": true, "helpfulness": "0/6", "author": "James Kelly"}, {"rating": 1.0, "review": "I want to know if I can use it in México?", "verified": false, "helpfulness": "1/11", "author": "ROCIO"}, {"rating": 1.0, "review": "It doesn't work it won't even come on.", "verified": true, "helpfulness": "0/7", "author": "Michael Scott"}, {"rating": 2.0, "review": "Can package nicely and pricing was good but it's not what I want in home entertainment so I'm reading over the return/exchange policy for Amazon because what I had in my for ordering was the Matricim gbox", "verified": true, "helpfulness": "0/3", "author": "SM Roberts"}, {"rating": 2.0, "review": "The specs on this box are awesome. But I bought it primarily to stream video from my local media server. Bought and installed Plex, and just couldn't get it to play cleanly. Lots of stuttering and buffering hiccups, especially on high def videos (GoPro, etc). And I always found the interface to be a bit odd and unintuitive... particularly since I wasn't going to use half of the cloud streaming options. I regrettably returned the Fire TV, but might revisit once the hardware and software (specifically Plex) matures a bit.", "verified": false, "helpfulness": "0/2", "author": "Carl S."}]