[{"rating": 5.0, "review": "I did my homework after selling my large television to try something different....I purchased a 100 Diagonal Electric Projector Projection screen that worked like a charm. I also purchased a P4X Pico Projector.  The tiny projector stands perfectly on the Amazon Fire and all three put out a magnificent view!Previous reviews rated this the best..above Apple TV and Roku...I cannot opine on other options, I am happy I chose this!Have not purchased the Amazon Plus...I simply use Netflix and Pandora, may branch out eventually....No need for cable after this!(BOSE mini was also purchase to create clean and loud audio)", "verified": true, "helpfulness": "0/0", "author": "Deborah Montemayor"}, {"rating": 5.0, "review": "Works well for the few weeks we've had it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I really really wanted to love it. I had a roku 1 2013 model. I may have been over expecting on this thing to be amazing thinking my cheap $40 couldn't compare to this amazing amazon box. The truth is finding a show you want to watch that isn't on amazon instant video is a chore and often finding out which app I needed to open to watch it for free or cheaper required my phone to to just swap the hdmi back to my sol and old roku 1. I was expecting this amazing voice search but the truth is the voice search won't even let you fill in the search field on an app like hulu or Netflix even if you are in the app with the search field open. it will just close the app and show you want is on amazon.I am all for self promotion fo own content roku does it itself. But the fact that after ym amazon app left the recent usage page hitting home made me no closer to finding netflix and the only way i know how to was either voice search or going to the hard to sue and often confusing app store where you find apps in weird mashed up groups with netflix seemingly hidden to oblivion half the time.Basically if roku adds a voice search that is ass accurate as this then this is useless. I really wanted to love it but it made finding stuff like shows and movies with a  certain actor a chore unless i wanted to only watch it on amazon instant video.I asked them if it was possible to get an email to let me know if the search feature is being changed and to have any updates on this but they said no I would have to manually check the site myself.", "verified": true, "helpfulness": "0/0", "author": "MoldyS"}, {"rating": 5.0, "review": "love it!  It's simple and easy to use!", "verified": true, "helpfulness": "0/0", "author": "william cuza"}, {"rating": 4.0, "review": "I have been anxiously anticipating getting my hands on the Fire TV! I ripped that box open and got started as soon as it arrived. Set up was amazingly easy and the frustration free packaging was a plus, too. Setting it all up only took a few minutes. However, downloading all of my apps and getting signed into all of them was a nightmare, but that's no fault of the Fire TV. I love the size and simplicity of the remote and box itself. The voice search feature is truly amazing, though I find that about half of the titles I search for aren't available, but again, that's no fault of the voice feature function itself. About a week ago, I would have said that the Fire TV was lacking in that it didn't have my Prime music or photos available to me, but it must have been updated recently because it's all there now! Now, my only complaint is that it doesn't have enough internal storage (and to my knowledge no external storage yet either). Just a few games and I'm all filled up. I'd love to be able to play more games, as I bought the controller as well, but I can only store about 3 of them, so it's limited in that aspect. Fire TV has really replaced by cable in the bedroom, so anyone who's looking to cut the cord with their cable provider is in for a treat. It will definitely do that for you! You really must be a Prime subscriber though, as everything else costs. I also love that the Netflix app, which I subscribe to as well, is available so that also opens up more available content for me. I was a little disappointed that the Fire TV didn't come with the necessary HDMI cable, but luckily, I had bought one just in case. Don't forget your HDMI cable when buying this.", "verified": true, "helpfulness": "1/1", "author": "Jessica \"I have a very intense, deep love for Amazon- the kind usually reserved for family. If I need it and it's on Amazon, that's where I'm buying it from ^_^\""}, {"rating": 3.0, "review": "The voice recognition is not as good as it should be.  It doesn't work nearly as good as it does for Gary Busey on the commercials.There are supposed to be a lot of movies available on Prime that are free.  So far I haven't found many free ones on the ones that the kids want to watch and the ones that have to be rented are normally higher than they are on Netflix.", "verified": true, "helpfulness": "0/1", "author": "Paul E Roller"}, {"rating": 1.0, "review": "There are four reasons why I do not recommend the Amazon Fire TV.  (1) When you hit the \"back\" button, sometimes it goes back 15 sec. and sometimes it just fast reverses and you have to stop it manually, very annoying.  (2) The large GB memory makes it good for Amazon programs, but if you are trying to watch from another room, say with a Roku device, the Roku keeps stopping because it cannot load anything for such a long period of time, and if it does manage to load and play, it stops and reloads over and over and over within seconds making the competitors device obsolete.  (3) If I try to watch things from Netflix, and not every time but, the video will get out of sync with the audio.  Amazon Fire tech people tell me to delete the Netflix app and re-install it again, which means you have to re-register Netflix again, not a pleasant task, but starts doing again after a while.  (4) The voice search feature is truly amazing but it only searches Amazon programs, not all of the providers, as does Roku.  I ended up buying another Roku and now I do not have any problems loading material with my other device in the other room again!  I love Amazon, but the way the Fire thing works, it feels like it’s trying to force you to use only Amazon for your entertainment selections.  I've griped about this before, but as long as I have your attention, the rates for viewing none-Prime items are totally overpriced.  The whole point of streaming is to be more convenient and cost effective.  Not!  Sorry Amazon but that's my take on the Fire TV. Oh yeah....... the thirty day trial period does not give a person enough time to evaluate the Fire and become aware of these issues, so I was not able to return it before the trial period was up...... so it sits on a shelf in the laundry room.  Okay NOW I’m finished!  :-)", "verified": true, "helpfulness": "6/10", "author": "JP Athey"}, {"rating": 4.0, "review": "I have had my Fire TV for 3 months now which is plenty of time for testing.Pros.Compared to the LG device this replaced it is a 10 star device.The Quad core processor is fast and has not locked up once.Plex App is wonderful as long as you create a free Plex server.Netflix and apps are quick to load.Voice search really works but only searches and Amazon content.WiFi works well and does not disconnect.easy setup. easy to useCons.The USB input is worthless. It does not work with any media.I tried to play media with the USB and it does not even recognize the device.So Plex is your only option.There is no power button but there is a screen saver.Hard to find some content- as a prime customer you have to really look to ensure that it is free to play and even if it is free to play show you still have the option of buying it.Over all it is a Good device and the best device I have seen for playing Amazon Prime content.", "verified": true, "helpfulness": "1/1", "author": "D.Smith"}, {"rating": 2.0, "review": "I love how the \"COMPARED TO ROKU 3\" page says that is has a dedicated Gaming remote (sold separately) and that the roku doesn't. yeah... it doesn't have one sold separately, it gives it to you for free. the accuracy can even be compared to the wiimote.Also, the roku has headphone jack inside remote for listening quietly along with free earbuds.That, and with the radio frequency (instead of infrared) makes it so you can hide the roku and it would still work everywhere.Now, as for the speed in memory, you aren't downloading anything but channels and some games, and i have yet to run out even after all the games I have. As for the processor speed and all that, the roku has never frozen up on me. its just all flashy things you will never use.As for it being the same price, do you think its really any better? they know if the up it they won't get a single sell.", "verified": false, "helpfulness": "1/5", "author": "Wolfgang"}, {"rating": 1.0, "review": "Remote stopped working after the 30 day warranty to return. Cannot find anything in forums to help. Changed batteries several times to make sure they weren't the issue.", "verified": true, "helpfulness": "4/4", "author": "Wasn't Mee"}]