[{"rating": 4.0, "review": "This is a great product, that worked very nicely out of the box--a huge improvement over my Apple TV--fast operations, great picture.... I am extremely happy with it...BUT...won't give it five stars yet...not sure why I can't get my prime music playlists on here, hopefully that's coming soon. Also, it seems I can't buy new video content directly from the Fire TV player (?) I still have to go to the website to do this? Which seems odd on Amazon's own device! I really want to see a movie offering, play the trailer and then click Rent or Buy immediately!!!!!", "verified": true, "helpfulness": "0/0", "author": "Damian"}, {"rating": 5.0, "review": "Took the plunge and ordered the Fire TV unit to replace the ancient Roku XD/S as the wireless in that unit just wasn't as strong with my new Netgear R7000 router signal.Wow.  What a difference.  The Fire TV is 1080p with an unbelievable picture.  The menus are easy to navigate - Prime, Non-Prime Movies and your customized watch list.  Using Netflix is a joy now too.  Everything is SUPER HD and the picture is incredible.  The unit is  quick to respond, and once a command is entered, your show literally starts in a second.  I no longer get that buffering message on either service, and rather than 4 stars on Netflix for a movie download, it's always HD or SUPER HD.  No interruptions thus far - I highly recommend this product.Just one more item, my home is totally wireless.  The router sit in my office on the other side of the house from the Fire TV unit.  The unit itself sits on a shelf in the family room and the \"N\" signal reception is still superb.", "verified": true, "helpfulness": "0/0", "author": "Trimline \"Steve\""}, {"rating": 3.0, "review": "I would like to have TV rabbit", "verified": true, "helpfulness": "0/2", "author": "bohannonm"}, {"rating": 5.0, "review": "I love my FireTV!!!", "verified": true, "helpfulness": "0/1", "author": "Kendra Taylor"}, {"rating": 5.0, "review": "Little perfect wonderbox!", "verified": true, "helpfulness": "0/0", "author": "Christian Scherb"}, {"rating": 5.0, "review": "So glad we bought this. We like movies and Tv series and always plenty we have not seen. Many are free.Just speak into the remote and watch a movie. Couldn't be simpler.", "verified": true, "helpfulness": "0/0", "author": "Ross Bloom"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "hlew \"4 timer\""}, {"rating": 3.0, "review": "Still in the process of learning how to use it.", "verified": true, "helpfulness": "0/1", "author": "John Jimenez"}, {"rating": 5.0, "review": "Exceptional product exceptional price. I switched from Apple TV and am loving it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to setup. Excellent tech support", "verified": true, "helpfulness": "0/0", "author": "Shy"}]