[{"rating": 5.0, "review": "I set up my amazon fire TV in a few minutes and use it to watch movies.  I am completely happy with it.", "verified": true, "helpfulness": "0/0", "author": "EU1234"}, {"rating": 1.0, "review": "item did not come with a hdmi cable to hook the device to my tv. nothing worth watching is free. it might work for someone with prime, but to me it is useless.", "verified": true, "helpfulness": "1/6", "author": "william hoodenpyl"}, {"rating": 4.0, "review": "I like it, I am one step closer to cutting the cable.", "verified": true, "helpfulness": "0/0", "author": "Rosalind Spells"}, {"rating": 5.0, "review": "It works great! No more pauses while streaming.", "verified": true, "helpfulness": "0/0", "author": "Larry L."}, {"rating": 5.0, "review": "This is one of the coolest gifts I have ever received.", "verified": true, "helpfulness": "0/0", "author": "SLCA"}, {"rating": 1.0, "review": "What I received did not match what is shown on your commercials.  The HDMI cable versus the Fire Stick shown in ads.  I was also disappointed in that some shows I was hoping to receive at no cost (due to my Amazon Prime membership),  were not free.To be fair, we have not utilized the Fire system that much but should have a better grasp of the positives and negatives over the next few weeks.", "verified": true, "helpfulness": "1/7", "author": "JimmyO"}, {"rating": 4.0, "review": "it is a nice product. i like it, and can warmly recommend it.There are some problems connecting external hard drive. but a nice machine", "verified": true, "helpfulness": "0/0", "author": "Bo Nielsen"}, {"rating": 5.0, "review": "pretty cool...enjoying it a lot .....", "verified": true, "helpfulness": "0/0", "author": "Audio-file-Tom"}, {"rating": 5.0, "review": "Very simple to hook up and worked perfectly first time I watched a prime movie. I am 77 yrs. of age and not very experienced with some of the new technology .  If I could figure it out with no help from my 8 yr. old great grandson, anyone can !I would recommend the Amazon Fire TV to anyone .", "verified": true, "helpfulness": "0/0", "author": "RLE"}, {"rating": 2.0, "review": "The Amazon Fire TV somehow serves up a version of Amazon Prime that is inferior to its Roku counterpart. Regardless of if videos are available for streaming on Amazon Prime or not, the Amazon Fire TV tries to sell the videos to you. Videos on Prime and available in the Marketplace are integrated, which is great for people with more dollars than sense, but proves to be more of an inconvenience than anything else. Moreover, if you choose to turn on parental controls, even streaming videos will ask for the passcode. Without this inconvenience, though, nothing stands in the way of you and errant purchases.If you're willing to sideload apk files, the Fire TV makes a very capable emulation hub for fans of classic gaming. It's even a fairly decent game system with things like Terraria, Minecraft and Always Sometimes Monsters available for purchase, so long as you can stomach the stupidity of Amazon Coins when every other gaming company has just went the way of the dollar. Of course, it's hard to justify this over the Ouya or even a used Xbox 360 for the same price.In the end, the Amazon Fire TV is a Swiss Army Knife. It's capable of doing very many things, and there are people who are going to like the utility if they're already in the Amazon ecosystem. For everyone else, though, it's merely less than the sum of its parts.", "verified": true, "helpfulness": "0/3", "author": "PerswAsian \"game junkie\""}]