[{"rating": 4.0, "review": "As a Amazon Prime member, I am very glad that I purchased Amazon Fire TV.  Picture and sound quality is great and it was ridiculously easy to install.  Now, I am wishing and waiting for more movies and TV shows----The Hunger Games and Major Crimes on TNT for example, to be made available for Prime members at no additional charge.  Still, there is an almost infinite variety of programming to watch. An added perk is the Cloud feature which allows me to view my cell photos on the HD TV.  I think I'm in love...", "verified": true, "helpfulness": "0/0", "author": "Red Stone"}, {"rating": 5.0, "review": "Love it! Love the games we can play!", "verified": true, "helpfulness": "0/0", "author": "Mercedes"}, {"rating": 5.0, "review": "Works as advertised. It arrived promptly and looked brand new. Set up quickly. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Sullysgirl"}, {"rating": 5.0, "review": "Love it way easier to use that I thought", "verified": true, "helpfulness": "0/0", "author": "Wilma \"Halfstep\""}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "michaeltaylor"}, {"rating": 5.0, "review": "I can't think of a simpler device that I have purchased and installed.  Very well thought out.  The video quality and stream is flawless, very little buffering.", "verified": true, "helpfulness": "0/0", "author": "Brett M. Williams"}, {"rating": 4.0, "review": "I like this a lot, it is very fast and if you are all in on Amazon as I am then it is all good.  Except:  I have had to unplug this and reboot 3-4 times already in less than a month.  What happens?  The lips move with no sound,  an app you close in the back round just starts back up, when I first installed I immediately had to call customer service to walk me through how to get a video to play.  Luckily Amazon's customer service is excellent. Just seems buggy.", "verified": true, "helpfulness": "0/0", "author": "Rick H."}, {"rating": 5.0, "review": "Very impressed with the speed and all of the great content.", "verified": true, "helpfulness": "0/0", "author": "Sal N. \"SN\""}, {"rating": 5.0, "review": "I love it! Super easy to use, great picture and reception. Thanks!", "verified": true, "helpfulness": "0/0", "author": "joanie m allen"}, {"rating": 5.0, "review": "Really like the AMAZON Fire..", "verified": true, "helpfulness": "0/0", "author": "Linda J. Haynes"}]