[{"rating": 5.0, "review": "We have purchased several Amazon Fire TV's as gifts for our family and friends. We love it! We have the Fire TV at our main tv and then we have the Fire Sticks at all other tv's in the house. We take the Fire Sticks with us when we go on vacation. Very handy and definitely worth the price.", "verified": true, "helpfulness": "0/0", "author": "Cwitt19"}, {"rating": 5.0, "review": "Best $100.00 I spent", "verified": true, "helpfulness": "0/0", "author": "Gloria"}, {"rating": 2.0, "review": "The device is great BUT . . .Wished it had a way to better organize the movies like Netflix, Works fast and the voice control is great. But the movie selection is no as good as Netflix. We've had it for about 2 month (incl the free month) and I must say I would not buy it again. We have yet to find a captivating movie, we had not seen,  on the included Prime Video that's not a quadruple B. Disappointed having spent $100 for this and  the content is not what we expected.", "verified": true, "helpfulness": "0/1", "author": "Gabriele Church"}, {"rating": 5.0, "review": "Love the Amazon Fire! I installed (super easy!) about 2 weeks ago, and love the ease with which I can navigate through the features it offers. The voice command is probably my favorite of all the features, because it takes me to the different apps I request, or to a specific program from an app! I would highly recommend the Amazon Fire to anyone looking for an alternative to cable/satellite. And the price is super reasonable! No monthly fee!! It does require Internet access, but even that monthly fee is lots cheaper than cable/satellite.", "verified": true, "helpfulness": "0/0", "author": "dora madrigal"}, {"rating": 1.0, "review": "Beware of Refurb from Amazon.  I purchased two, both had old software and would not update.  Netflix would not load, and one would not even play amazon prime (unknown error).  Amazon issued a refund, but I have wasted alot of time to test their defective units.I have a new one that is a great device, but cannot recommend the refurbs.", "verified": true, "helpfulness": "2/3", "author": "DRK"}, {"rating": 3.0, "review": "5 stars when they update the firmware to make the up/down buttons do simple volume control.  I can't believe this was not included!  My 90's dvd player had independent volume control.  At least make it an option to enable!  Everything else is cool... if you could hear it at a reasonable volume.  Lost the TV remote a long time ago.  Also, clicking back at the home screen, doesn't take you back to what you were just watching inside an app.", "verified": true, "helpfulness": "0/0", "author": "WebSALE.tv"}, {"rating": 5.0, "review": "Love IT!!!", "verified": true, "helpfulness": "0/0", "author": "Bridget"}, {"rating": 5.0, "review": "I'm so glad to have gotten Fire TV. That's all, the original series are terrific, and the service is too.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Hartung"}, {"rating": 5.0, "review": "Easy to set up. Easy to use. I like it!", "verified": true, "helpfulness": "0/0", "author": "Mrs. C"}, {"rating": 4.0, "review": "Quality of picture can vary noticeably", "verified": true, "helpfulness": "0/1", "author": "William P Monk"}]