[{"rating": 4.0, "review": "The Fire TV is the fastest media streaming device money can buy.  Everything works great, looks fantastic, and runs as smooth as butter.  Biggest problem...I installed two highly recommended games, Asphalt 8 and Mickey Mouse Castle of Illusions, as well as a few small games, and I am basically out of space.  8GB of internal storage (5GB actually usable)  is not enough when the games they are selling are upwards of 1.5 GB each.  I'm fine with buying an external thumb drive and using that for storage, but that is not an option.  So..that my friends is a HUGE let down of this device, which seems easily solved.  Step up Amazon and fix this ASAP!!", "verified": true, "helpfulness": "0/0", "author": "S Roth"}, {"rating": 4.0, "review": "I am not going to sit here and regurgitate what others have said. I picked this up for 79.00 before this new promotion that has you waiting 2-3 weeks to receive it.  This is a replacement for my Apple TV Gen 1 because like Apple in true fashion, their products stop working when they deem it to be obsolete.The set up was easy, worked right out the box, after you got through a 2 minute video which would insult the intelligence of any one with a moderate understanding of technology that you cannot bypass.The main issue I had was it automatically assigns the credentials of the person that purchased it to the Fire TV.  So if you wanted to try Prime out or buy apps, guess who foots the bill? This is unacceptable and on first observation could most likely not be detected unless you went into the preferences.  Probably not something that's thought of if you are gifting it to a child. Shame on you Amazon", "verified": true, "helpfulness": "1/1", "author": "Suspekt"}, {"rating": 1.0, "review": "Poor service for movies. Always loading loading loading. you must have to have mega internet service to use it. Very disappointed. Mines for sale..... cheap!", "verified": true, "helpfulness": "1/3", "author": "Steven G. Waters"}, {"rating": 5.0, "review": "really happy with the Amazon Fire TV  box, got it instead of a new smart TV and glad i didGoing to get another one for my office", "verified": true, "helpfulness": "0/0", "author": "Martin Padilla \"SailMan\""}, {"rating": 3.0, "review": "Set up problems that required contacting tech support. Was unable to access about half the content, including Netflix and the help menu!  Had to Google it on my computer to get a phone number. That should be included in the set up guide that comes with the device. Tech guy was very helpful and, from the sound of things, the issues I had were pretty common. All the more reason to include the phone number! Once set up, works as advertised. Voice search function actually works quite well. Many of the really good games in the app store are still not available for the device. My rating right now is based on that. Of the 459 games available, less than half (209) have a 4 star or better rating. Wasn't expecting game platform quality, but did expect a bit more variety like is available for my phone and tablet.", "verified": true, "helpfulness": "0/0", "author": "Roadrunner"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Jacqueline Taylor"}, {"rating": 4.0, "review": "Delivers everything as advertised. Only took a couple of minutes to hook up and get started.Well thought out installation.", "verified": true, "helpfulness": "0/0", "author": "JoeBulldog"}, {"rating": 4.0, "review": "Give it a solid 3.5. Has a USB that you can not use yet to play back video files. Needs work for screen layout. Both are likely possible with software updates and I would then push it up to a 5 Star. I love it's potential and would beconsidering replacing my other Roku systems on other TVs with some improvements.", "verified": true, "helpfulness": "0/0", "author": "TSRace"}, {"rating": 5.0, "review": "Love Amazon Fire TV!!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Weber"}, {"rating": 5.0, "review": "I've been using a Roku XDS for several years. I needed that model to get classic 5.1 Dolby Digital over an optical link because my AV Receiver predates HDMI, and all Rokus since then have dropped that jack. While the XDS is 1080-capable, no one sends it 1080 because the new standard is 1080 with Dolby Digital Plus.While Amazon Prime looks nice at 720, I've been wanting to get 1080 since I've seen 1080 VUDU and YouTube streamed through my Oppo (audio sent 5.1 analog to my AVR). When I heard that the Fire TV not only has an optical audio output but can actually provide standard DD 5.1 over optical with 1080 streams, I bit.I fell in love with its remote's voice recognition, but to get 1080 I had to rearrange my internet equipment to let me run an ethernet cable directly from it to my cable modem. Unless you can get a download speed of 50 Mbps or better, you won't see the \"1080p\" flag show up on screen. Give it half a minute of playing time to switch to 1080 - I think that time is spent accumulating enough data in its buffer to play at 1080 smoothly. (Makes me grateful for studio logo sequences!)Some folks say they get 1080p on Prime with their Fires over WiFi, but I never could, either wirelessly (4 feet from the router!) or through a wired MOCA relay (similar to powerline networking, but MOCA piggybacks on the house's cable tv wiring instead, which is much quieter than the household AC wiring, which has all kinds of noise from electric motors).Another nice touch is that Amazon preconfigures the device with your Amazon Prime login (you can make it forget that through its setup menus if you need). That makes the setup a lot easier than with a Roku - and the Fire's bluetooth remote is a lot more reliable than the Roku 2's, which I set up for my girlfriend, and eventually had her run the device with her Android phone and a Roku app over WiFi when we couldn't get the Roku's own remote to pair.I gave the XDS to my daughter, who has a new 720 flat panel and no smartphone.", "verified": true, "helpfulness": "0/0", "author": "Philip R. Olenick \"Civil Rights and Appellate Lawyer\""}]