[{"rating": 5.0, "review": "works really well and quite easy to setup", "verified": true, "helpfulness": "0/0", "author": "stoneman"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Dorelis gonzalez \"D.G\""}, {"rating": 5.0, "review": "Gteat buy, exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Aramis Cruz"}, {"rating": 5.0, "review": "In the beginning I never saw what the big deal was when it came to these streaming devices, since I had always used my video consoles at home. I only purchased it on a store credit card that I never use in order to keep the card before they cancelled it.  I love this device!  I have satellite television with all the channels and sometimes there is still nothing on tv.  With FIRE there is always something on.  I can listen to music, watch television shows, or movies.  I can catch up on shows I missed yesterday or years ago.  I have even come across current movies offered cheaper to rent than other rental boxes.  The voice command isn't too bad either.  The only problem I have is making myself go to bed.", "verified": true, "helpfulness": "1/1", "author": "SJ"}, {"rating": 5.0, "review": "The unit is very responsive and has met all of my expectations", "verified": true, "helpfulness": "1/1", "author": "John Tyree"}, {"rating": 3.0, "review": "It's not much of a \"stick\" when you factor in having to plug it into a wall adapter for optimum performance. But if you're just watching a few hours of TV from time to time this is probably a good match. Slightly more bulky than you'd expect.", "verified": false, "helpfulness": "1/1", "author": "Brianna Edwards"}, {"rating": 5.0, "review": "Amazing. What a great product.  Better than i thought it could be", "verified": true, "helpfulness": "0/0", "author": "davido \"davido\""}, {"rating": 4.0, "review": "I love my fire tv. It is very easy to set up and to navigate. You won't be disappointed if you buy it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The Fire TV experience is very new to me.  I have had it now for ine week and just adore my whole experience.  It's been wonderful!  A very good choice for me and my family.  I recommend it for everyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This streaming box is great!  As a prime customer i am able to  take advantage of all streaming options. Countless numbers of movies, shows, and games are available.  The box loads fast from one app to another, from one show or movie to another, or one game to another.  I have no issue connecting to my wireless network (ac). The fact that it allows for out of market android programming is nice if you are into that sort of thing. The remote is small and i always lose it, so maybe some kind of locator could be built or something.  I don't like the UI much. I have a Roku 3 and the UI is very plain and easy to use.  The Fire Tv is okay but the point i suppose is to take advantage of Amazon services.  Point well taken.  All that said i would recommend anyone buy it especially if you have a Prime membership.", "verified": true, "helpfulness": "1/1", "author": "Mr. Ray"}]