[{"rating": 5.0, "review": "What a blast. Easy to install and easy to use. I like that the items are categorized by what is included in Prime Membership versus which items cost to watch. My husband is addicted to it.", "verified": true, "helpfulness": "1/1", "author": "Marne F."}, {"rating": 5.0, "review": "Yes", "verified": true, "helpfulness": "1/1", "author": "Alex C."}, {"rating": 3.0, "review": "I figured that if you had Prime, you would have access to view all the movies for free, but you still have to pay for some.", "verified": true, "helpfulness": "0/1", "author": "Amy Anzaldua"}, {"rating": 5.0, "review": "I am in love with my Fire TV! There are so many options for entertainment I can't decide what to watch. And I love the relaxing ocean and rain apps. I'm so glad I got it. Who needs cable or a dish when you have this?!", "verified": true, "helpfulness": "1/1", "author": "DonnaN"}, {"rating": 5.0, "review": "Easy set up and great value.  Exactly right for my husband for Christmas, and I get free shipping!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Should have came with prime will make it better", "verified": true, "helpfulness": "1/2", "author": "Bryan Benz"}, {"rating": 5.0, "review": "Great product  Lots of fun", "verified": true, "helpfulness": "1/1", "author": "Philip M Keefe"}, {"rating": 5.0, "review": "great !", "verified": true, "helpfulness": "1/1", "author": "Daniel D"}, {"rating": 5.0, "review": "So far from what my daughter has allowed me to use I am really enjoying it! ! I am very impressed at how simply it was to set up & the variety of different things it seems endless & a bit over whelming at first! My daughter is 11 she loves youtube & I was kinda broke this Christmas so thank goodness for the Fire TV especially getting it for $79!! She is in love with this thing & every single concept of the \"smart\" TV is amazing to her!! I will update later once I get to use more& they send my Kindle Fire HD hopefully SO OVER then February! ! I will update about the Internet & doing my work from the both!! I can't wait! ! So far it's a 5 star for being easy enough to use for a 11 yr old & myself who knows nothing about technology! ! And for it being the only thing that my daughter wanted for Christmas! ! And being totally fine with that!  Lol", "verified": true, "helpfulness": "1/1", "author": "Kelseypaige.myitworksDOTcom \"Kelsey\""}, {"rating": 5.0, "review": "Easy to sue great features", "verified": true, "helpfulness": "1/1", "author": "Arnaldo Laboy"}]