[{"rating": 3.0, "review": "Tired of constantly removing crappy recommended movies from the lists, same old crap keeps coming back.I am not likely to buy or rent instant videos anymore, I'll just use it for other purposes.", "verified": false, "helpfulness": "1/2", "author": "WDB"}, {"rating": 4.0, "review": "this thing is awesome. can so get rid of cable now. the voice search works really well, but will only search amazon movies for it. dont want to pay for it and it be free on my netflix or hulu. wish it searched all of them.", "verified": true, "helpfulness": "1/3", "author": "J"}, {"rating": 5.0, "review": "I was skeptical about a set top box but the Fire changed my mind.  Great movies and TV series and it couldn't be easier to set up.", "verified": true, "helpfulness": "0/1", "author": "Joe"}, {"rating": 3.0, "review": "Don't know what was the deal but the last time I try to used couldn't connect to any of my services. Was getting an error. Was able to use my tv  services fine so couldn't be my internet connection.", "verified": true, "helpfulness": "1/5", "author": "L. Salicrup"}, {"rating": 1.0, "review": "This thing is worthless if you have a smart tv and probably not worth much if you don't.  You have to have a Prime Account to use it, which of course you pay for, and most of the content has to be bought.  With an AppleTV or a Roku 3, at least you don't have to pay a yearly fee to use it.", "verified": true, "helpfulness": "1/13", "author": "John Darling \"Jack Point\""}, {"rating": 5.0, "review": "Coupled with a prime membership, Amazon Fire TV gives me the most viewing choices in the most economical and most convenient way.", "verified": true, "helpfulness": "1/2", "author": "Donald P. Cammack \"riveted reader\""}, {"rating": 1.0, "review": "Product is a good idea but needs work. Every movie or show I try to watch freezes up. Brought 2 so I am twice disappointed.", "verified": true, "helpfulness": "2/9", "author": "Jerome Fisher"}, {"rating": 5.0, "review": "Works like a charm.  Completely silent, fast, really small box.  For development purposes and hacking it's a cool device: android sdk is fully supported, apk installation, bluetooth... Worked with a USB XBox gamepad. WiiMote doesn't work due to lack of support of pin-less bluetooth devices on Android.Just be careful not start using this device with a non 16:9 screen (i.e. a 4:3 screen) .  Welcome video is not scaled and I thought it was malfunctioning.", "verified": true, "helpfulness": "1/1", "author": "ADRIAN PEREZ JORGE"}, {"rating": 2.0, "review": "I'm not sure if I was just expecting something different or what, but the main problem I seem to have is that it doesn't behave like I'd expect a set top box to behave. The biggest problem is actually the home screen - it's really badly jumbled so that when you need to access the apps you use the most, you have to search for them among things less frequently used. This problem is most pronounced by the recent items list at the top, which ideally would give you access to things you use the most, and would otherwise be a great place to find commonly used apps. Only it really doesn't behave this way.There isn't any way (from what I could determine) to pin apps to a specific spot that you can always find them.Like for example, if you recently watched an episode of Under the Dome just one time, that episode gets a higher priority in your recent item list than say Plex, which I commonly use to watch other stuff.Also, I have all three of Amazon Prime, Netflix, and Hulu. A lot of the shows my mom watches are free in Netflix while they cost money with Prime. She instinctively goes for them in the regular menus, which you can't populate with Netflix items, so she thinks she has to pay money for shows that she can actually watch for free. Roku, for all of its faults, doesn't have this problem. In its search feature; you'll know immediately if you can watch the show for free or if you have to pay via vudu or Amazon.This is especially amplified by the fact that by necessity, Netflix is buried in the menus (because it can't be pinned.) Yes I know it will be in the Apps menu down in the list, but there is no discernible option to prominently place it on your home screen; rather it always remains buried.As mentioned earlier, I'm also a Plex user, and have a bunch of shows and movies archived on a NAS. Ironically, the version of the Plex app Amazon provides for FireTV works with pirated content but not legitimate content in that it doesn't play my direct 1:1 blu-ray rips. This is in theory the same Plex app that I can get for my Nexus 4, Nexus 5 and Nexus 7 via Amazon's app store, and it works fine for those, but not the Fire TV. I don't know why this is the case, but it is. I tried torrenting a copy of the same movie, and that copy worked fine on Fire TV.If it were up to me, even though I have a prime subscription, I'd prefer to hide the Prime video on demand content entirely so that the recent items menu doesn't get cluttered with that junk, and so that I don't have to worry about having to tell people that they don't need my pin to watch some of those shows (they can just launch Netflix instead) as I almost never watch Prime VOD anyways. That doesn't appear to be an option however.Initially I replaced a Roku 3 with this and moved the Roku to another lesser used room where I need an STB (right now it has no TV at all.) I moved the Roku 3 back to the main room and I'll have to find something else for that other room (I'm thinking Chromecast at this point.) The Roku 3 has kind of a bad UI for Plex and is quite slow compared to Fire TV, so it's a shame in that regard, but it at least WORKS with all of my content, and is easy to navigate.Also, I will NEVER buy digital movies or TV shows on Amazon Prime. Why? Because Amazon is already known to just arbitrarily deny you access to it if the publisher asks for it. It's in their terms and conditions (search google for 'amazon christmas disney movie' (no quotes) and read the ars technica article on the topic) which is another reason I don't want Prime TV to be listed there.Sadly, in spite of all of my high hopes (and the overall love for the Android OS and all derivatives of it) I'm going to be returning this.", "verified": true, "helpfulness": "5/6", "author": "Herp Dee Derp"}, {"rating": 4.0, "review": "Being a new user I've been impressed. The only problem is having to learn how to use it. I would recomend the Fire to anyone tired of paying huge cable bills.", "verified": true, "helpfulness": "1/2", "author": "Ron E."}]