[{"rating": 5.0, "review": "I HAPPENED TO BE ONLINE ON OR ABOUT 2 APR 14 WHEN THEY DEBUTED (AMAZON FIRE TV,) IT ARRIVED IN ABOUT 1.5 DAYS (UPS) I WAS HOOKED UP AND GOING IN NANO TIME.  MY FIRST DEBUT OF THE VOICE REMOTE WAS A SEARCH FOR \"MR SELFRIDGE, SEASON ONE\" FROM PBS.  WITHIN 2.5 SECONDS IT HAD FOUND THE ENTIRE SEASON ONE SIMPLY BY VOICE SEARCH VIA PRESSING A BUTTON ON THE REMOTE.  I FEEL THI$ IS A DEAL BREAKER FOR THO$E WHO WANT TO SELL $MART TV'$ AT GREAT EXPEN$E.  THE DEVICE DOWNLOADED AND INSTALLED ALL THE DATA IT NEEDED (ABOUT 1.5 MINS)  NOT THAT THEY ARE NEEDED BUT USER FRIENDLY TUTORIALS ON SCREEN.SPREAD THE WORD, THIS IS THE CURRENT DEVICE TO HAVE + IT PLAYS ALL MY SONGS STORED AT AMAZON IN THE CLOUD.  WHAT FUN TO INSTANTLY STREAM (ABSOLUTELY NO BUFFERING OR DELAYS OF ANY KIND OUT OF THE BOX) WHO KNEW THAT I WOULD BE ONE OF THE FIRST IN A SMALL TOWN IN A REMOTE LOCATION IN THE ROCKY MTNS TO HAVE THE NEW TECH IN 2.5 DAYS, THIS WILL BE A BINGE WATCHING WKNDFOR CERTAIN:-) FOR PEOPLE WHO MAY BE OVER 50YRS OF AGE AND WANT A NEAT/ULTRA EASY GIZMO, I SUGGEST AMAZON FIRE TV.I AM STUNNED THAT THERE ARE SOME PEOPLE WITH ONE/TWO STAR REVIEWS & SCATHING COMMENTS.  FOR THE REST OF US WHO MAY NOT WANT THE MOON, THE STARS & THE OCEAN IN ONE TINY BOX, BE THANKFUL THAT FOR THE REST OF US I/WE LOVE AMAZON'S OUT OF THE BOX FIRE T.V. AS MOST KNOW WHEN SOMETHING IS LAUNCHED/DEBUTEDIT TAKES TIME TO CONSIDER THE MULTIPLICITY OF WANTS/NEEDS OF MILLIONS/BILLIONS OF USERS.  I EARNESTLY FEEL MY FIRE TV, HAS A AMAZING FASSTTT FIRESTORM START.THE OTHER TECH SNOBS (IMO) PROBABLY WOULD NOT BE HAPPY WITH A 80 INCH $39,999.00 SMART TV-- IF IT WERE GIVEN TO THEM.  I HAVE BOUGHT AND USED AMAZON ALMOST FROM THE START. I COMPLETELY \"\"TRUST\"\" AMAZON:-) I CANT THINK OF ANY PROBLEMS I HAVE EVER HAD WITH THEM.  I COMPLETELY \"\"TRUST\"\" AMAZON WILL EVENTUALLY UPGRADE THE DEVICE WITH ADVANCED FEATURES.  IN A EVER HIGHLY COMPLEX EXPONENTIALLY DIZZYINGLY FAST MOVING WORLD IT IS \"\"REFRESHING\"\" TO FIND A NEAT ITEM THATMAKES MY LIFE FAST, FUN, VERY EASY AND ENJOYABLE:-) BRAVO AMAZON.  I NEED TO TAKE ANOTHER LOOK, BUT I THINK THE KINDLE FIRE ALSO INTERACTS WITH FIRE TV.I ALSO GOT A ETHERNET SPLITTER TO GO BACK AND FORTH BETWEEN FIRE TV & (DIRECTV WHICH IS GHASTLY EXPENSIVE) IMO. I GOT A SPLITTERWITH A SIMPLE BUTTON PUSH TO GO BACK N FORTH.  WHILE I AM WATCHING FIRE, AT THE SAME TIME I AM RECORDING MY OTHER PROGRAMS RE: DIRECTV'S HD DVR GENIE.YES I AM BIASED FOR AMAZON, BECAUSE I HAVE NEVER EVER HAD ANY KIND OF PROBLEM WITH OR FROM THEM FROM THE DAY THEY WENT ONLINE.", "verified": true, "helpfulness": "1/8", "author": "ROCKYMTNMALE"}, {"rating": 3.0, "review": "I am a huge Amazon fan and have been a Prime subscriber for years (and will stay for the $99 a year rate increase).  I ordered the Fire TV on the first day it was launched and there were 0 reviews.  Now 2 days later, there are over 500 reviews!  The reviews are \"excellent\" and cover most pros and cons of the product.  My review is strictly about the Parent Control Software.  I also own the 1st generation 8.9\" Kindle Fire HD, which my kids are always using to watch Prime Instant Videos, so I thought I get the new Fire TV for their TV in the office and I can get my Kindle HD back (they also borrow my Nexus 7).  Set up of the FIre TV was simple and easy along with the quick software update (via my 30mg cable wifi, I suspect some of the issues other reviewers had were related to their slower wifi connection, streaming HD video requires a minimum of 15mgs).  Anyway, I turned on the Parental Control in Settings (put in my passcode) so my kids can't order a bunch of paid programming (also turned off 1 click buying on my Kindle HD), which I thought was a great feature of the Fire TV for my intended use.  At first when I the visited the Home screen, I saw basically a bunch of paid content displayed but figured out how to get the Prime content to show.  Just do either a text or voice search via the remote and then select \"Prime Instant Videos\", now the Prime Video content is displayed.  However, every free Prime Video show / movie I selected (test run), it required my passcode to watch it.  That defeats the purpose of limiting my kids (7 & 12 year olds) to watch only the free programming if they need my passcode for each video viewing.  They are smart computer literate kids who will figure out to how to go to Settings to enter the same passcode to turn off Parental Control.  I believe I understood the Parental Control instructions, which basically stated Parental Control will limit / stop your children from ordering paid programming.  A parent can't be expected to be present for all of the short Prime Videos viewing (Sponge Bob SP is a favorite) and then have to tell the kids to close their eyes while the parent enters the passcode for the next viewing.  I do realize this is a brand new 1st gen product and some bugs need to be worked out.  Thank you Amazon for providing a firmware fix ASAP so I can start using it for the kids - then I will bump my review to 4 stars.  I guess I have 30 days to return it if I am dissatisfied.", "verified": true, "helpfulness": "1/2", "author": "Cobra"}, {"rating": 5.0, "review": "This Amazon Fire TV is amazing!It's FAST! It has all the major video apps (Netflix, Hulu Plus, Amazon Video, etc...), Plays games & it's hackable!I've installed XBMC and Firefox on it and both work great and its super easy to install them.  Just Google \"Fire TV XBMC\".This box will only get better as time goes on and more apps and games are added.  Super impressed with it.  Goodbye Apple TV!", "verified": true, "helpfulness": "14/16", "author": "Gregory O'Connell"}, {"rating": 5.0, "review": "I was thinking of upgrading my Roku to a Roku 3 a few months ago, but I held off for the Amazon Fire TV. It took only a few minutes to install, a few more minutes to update itself, and then a short video which explains the features. My first test was starting a show, and the response time seemed faster than my Roku or PS3. However when I resumed that show about 30 minutes later after checking out other options on the Fire TV, it was amazing - lightning fast. I then tried out the voice search, and to my surprise the voice search actually WORKS! Yes, there were a few times it would get it wrong, but I would say over 80% of the time it would get it right. I spent a better half of an hour just playing around with the voice search - it's pretty cool to say the least. I did download a few games and try them out - not bad and a nice option to kill some time.Overall, I am a very happy buyer of the Amazon Fire TV, and hate to say it, but as one of the first users of Roku many years ago, I will admit that Roku dropped the ball in the last few years and didn't put new features out quick enough. I may check out the next Roku if it looks exciting enough, but the Amazon Fire TV is years ahead of Roku.Great Job Amazon!", "verified": true, "helpfulness": "2/2", "author": "Rico"}, {"rating": 4.0, "review": "Overall I really like the Fire TV. The interface is fast and Amazon content begins playing extremely fast. I won't repeat what all the other reviews say regarding the hardware itself.However, I am disappointed at the moment as the Showtime Anytime app does not allow DirecTV customers to use it. I also own an AppleTV and bought the Amazon Fire TV primarily to use it with Showtime Anytime since Showtime Anytime is not available on the AppleTV. I use the AppleTV for HBO GO (which is not on the Fire TV at the moment), so I figured I would just switch between the two devices in order to get Showtime Anytime and HBO GO.I am hopeful that Showtime Anytime will be available on the Fire TV for DirecTV customers soon, and also hope that Amazon is able to add HBO GO in the future so I can just use the Fire TV for everything.The Fire TV has potential, but if you are a DirecTV customer and want to use Showtime Anytime be aware that this is not possible right now.", "verified": true, "helpfulness": "1/1", "author": "Josh"}, {"rating": 5.0, "review": "I purchased this because it's an Android based small form factor Quad Core HTPC. I have used a Kindle Fire, IPad, PS4, PC, to stream movies, and yeah I forgot to mention GBoX Matriicom....Fire TV blows all of these things away...I installed XBMC and XBMC Hub and within minutes I was enjoying content like never before..all Apps load so fast, I was amazed, and also found it to be stable...As far as Netflix and Amazon Prime which I am currently a subscriber of both there were no issues, no stutter, no shadowing.For $99.00, you get spdif out, HDMI, and wifi....Bluetooth remote and games!...playing Minecraft and Despicable Me....Buy it period!", "verified": true, "helpfulness": "6/7", "author": "Amzn88buyer \"Prime is awesome\""}, {"rating": 5.0, "review": "Just got my Amazon Fire TV today, hooked it up, and here's the scoop:- Fast, flawless setup- Clean, engaging UI- Solid hardware design and build qualityWho should be concerned:- Roku- OuyaVery, very concerned. This box has great channels and solid gaming; best of both worlds. Also, the OUYA controllers work perfectly with it, so if you're hesitating to switch because you invested in a few OUYA controllers, no worries. :)", "verified": false, "helpfulness": "4/6", "author": "David Balmer \"Geek.\""}, {"rating": 5.0, "review": "This is a great piece of hardware. The performance is ultra fast, graphics and sound are stellar. The voice search feature works flawlessly. Works better than my Apple TV. I LOVE THIS DEVICE. GREAT JOB AMAZON. I JUST ORDERED ANOTHER FOR MY BEDROOM. FIVE STARS ALL AROUND.", "verified": true, "helpfulness": "6/6", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Have only tried it for maybe an hour or so, but so far i like it. Very fast. very user friendly. The voice search works well. The only thing i wish they would improve on is the results of the search. Say i do a search for mel gibson. I wish when it showed all the movies. which ones where prime eligible. Pay ect instead of having to click on the movie to find out. Its not a huge deal. but would be a convenient feature.", "verified": true, "helpfulness": "3/3", "author": "magoo"}, {"rating": 4.0, "review": "My points of comparison are apps like netflix on wii and roku.  The UI and remote are much easier and faster to use.  Search works.  It is extremely responsive when transitioning between apps.  Picture quality is great.  I tested an action game with the remote and it worked great.  I can't wait for the controller to arrive.  I'm very impressed.", "verified": true, "helpfulness": "3/3", "author": "G. Cohen"}]