[{"rating": 4.0, "review": "Only four because I am not familiar with all it can do", "verified": true, "helpfulness": "0/3", "author": "Alexander J. Gotko"}, {"rating": 5.0, "review": "I just started using it, so far I like it", "verified": true, "helpfulness": "0/2", "author": "Michael"}, {"rating": 5.0, "review": "It does everything I need it to do. I might just get the stick to take on the road.", "verified": true, "helpfulness": "0/2", "author": "Eric Midder"}, {"rating": 3.0, "review": "I like my Fire TV for the Netflix and other activities with great results.  However, when watching any shows/movies through Amazon Prime, the show is in poor condition.  I contacted Amazon and customer service was great in trying to help me.  Even sent me a new replacement for my Fire TV.  Everyone was very helpful, but no matter what, the quality of Amazon shows/movies is terrible.  Plus, I am not finding \"thousands\" of free shows/movies - maybe a hundred or so.  Otherwise you pay for rentals or purchases....per episode or seasons...that is not free.  Since everything else works great, I plan to keep my Fire TV.", "verified": true, "helpfulness": "1/2", "author": "LuAnne"}, {"rating": 5.0, "review": "Such a nice way to watch movies in ones home through WIFI.", "verified": true, "helpfulness": "0/2", "author": "CKA"}, {"rating": 5.0, "review": "Simple to install, basically worked right out of the box once I connected to my WiFi.  Picture quality is great, I'm beginning to  love the voice control, and, most amazingly, the control unit is in a closet behind a closed door and the remote works flawlessly from across the room.", "verified": true, "helpfulness": "0/1", "author": "Richard S."}, {"rating": 4.0, "review": "If my wife can operate it anyone can. Very easy to use and I have had no issues with it on the hardware side. On the software side I only give it 3 stars.", "verified": true, "helpfulness": "0/1", "author": "George"}, {"rating": 5.0, "review": "Wonderful streaming device. No cons at all. Stable, good picture & sound quality. Fast delivery & already configured to my account. Set it up in 2 minutes flat", "verified": true, "helpfulness": "0/1", "author": "John P."}, {"rating": 1.0, "review": "It works as promised, but the customer support I received was horrible.  It took me two calls and 80 minutes on the phone with no resolution to my issue.  I went through about 8 different transfers to find the right department to even tell me what was causing my issue.  And it still doesn't work. They did offer to let me return it, but would not gaurentee me a refund.  I don't understand their customer service policies, but they really need to work on them.", "verified": true, "helpfulness": "1/5", "author": "Christopher S Wilkens"}, {"rating": 4.0, "review": "I wish there were more free movies/programs.  Seems a lot of the movies I want to watch, I have to rent or choose something else.  With the Netflix subscription ($7.99 a/mo), I have more variety.  I have loved watching several shows on Prime such as Downton Abbey, Transparent, Orange is the new Black, etc... It's still worth the money!", "verified": true, "helpfulness": "0/1", "author": "Brian L."}]