[{"rating": 3.0, "review": "Everything is fine but I'm not able to cast from my mobile's YouTube app...I tried a lot to get this done but I'm not getting the option to choose firetv in the cast.If this I get it then I'll give 5 stars for it.", "verified": true, "helpfulness": "0/0", "author": "Suveer"}, {"rating": 4.0, "review": "So far it's been good .. Fast and no troubles getting around in menu", "verified": true, "helpfulness": "0/0", "author": "Jim D."}, {"rating": 5.0, "review": "Works Amazing!!!!!", "verified": true, "helpfulness": "0/0", "author": "Monique Maloney"}, {"rating": 4.0, "review": "Woks as expected,  would like to see more apps like CBS, NBC ...", "verified": true, "helpfulness": "0/0", "author": "Paul J Powell"}, {"rating": 5.0, "review": "Great device. Please don't stop people from downloading Kodi on it. Also, MLB tv and showtime would be good additions.", "verified": true, "helpfulness": "0/0", "author": "Neil Christensen"}, {"rating": 3.0, "review": "It is fast and pretty and simple, but holy cow - it is EXTREMELY Amazon-centric. If you live on Amazon Prime, you are all set. If you like Netflix, Hulu Plus or anything BUT Amazon... good luck. If I search for a program I follow on Netflix, it constantly brings me to that same program on Amazon to buy, even if I say, for example, \"Burn Notice on Netflix\" Even saying Netflix won't get you to Netflix.And if you use Google Play - just don;t even bother. There is no app for that, and I doubt there will be in the near future. Why? Amazon. It can be done, but you have to root your Fire TV and I'm pretty sure that's void your warranty.So if you are content to run mainly Amazon content, this will be great for you. I do not like being so strongly pointed away from my other alternatives, so this is going up for sale. (I kept it beyond it's 30-day return period.) I'm glad I didn't sell my Roku.", "verified": true, "helpfulness": "0/1", "author": "Dave in Vegas \"RescueDave\""}, {"rating": 5.0, "review": "I am so pleased with this. I order a second one for my grand daughters room so she can watch her favorite cartoon shows. She watches her shows and it allows me to watch mine.  Yeah!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Gloria Bennett"}, {"rating": 3.0, "review": "remote stopped working after 3 weeks.  Amazon was great about the customer service, but at the end of the day we prefer ROKU over FireTV and Apple TV - even though we are HUGE apple people.  The navigation on ROKU is BY FAR the best....so simple and easy to use.  FireTV is so amazon prime centered...it's actually annoying (and we watch a lot of prime movies and TV).  AppleTV does not have an Amazon Prime TV app....so that really stinks.", "verified": true, "helpfulness": "0/0", "author": "Greg Hodges"}, {"rating": 4.0, "review": "My reservations are based on its music handling.1.  No Prime Stations.  Why not?  They have Prime Playlists, but not the stations.2.  TV dependent.  Have to turn the TV on and off to make music selections, and turning off the TV pauses the music...I have to hit play again on the Fire clicker to restart.3.  Which leads to...would be great to have a phone app that would control the music on this device, at the least.  Again, having to turn the TV on and off all the time to change the music...irritating.Other than that, it's GREAT.  No more \"loading please wait\" which I got all the time with TV shows on the Roku.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"TheMentat\""}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Carl Beck"}]