[{"rating": 1.0, "review": "I'm really mad that this doesn't support DIRECT TV. The whole reason I purchased this was to be able to watch programs I PAY for on Direct TV on this unit when Direct TV isn't working like when it snows, rains, or is cloudy or windy. I have no cable for 5 days straight sometimes so I ordered this expensive useless device only to find out I can't watch A&E; or HBO or any of the programs I PAY for on this! I think amazon should have a list on the order page where you type in your cable company and it lets you know if it supports the one you have! The only non cable thing I like is the pluto but that is constantly stopping every few seconds then it shows the round loading button and it will start whatever I was watching from the begginning! extremely frustrating so I paid eighty bucks for a dust collector. I have a smart TV I didn't need a box to watch Amazon Prime stuff, I wanted it to be able to watch my cable channels. BOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO", "verified": true, "helpfulness": "0/7", "author": "EraseGreed"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Dale R. Avery"}, {"rating": 5.0, "review": "My #1 reason for purchasing was to use it as a steamer for my digital music, so everything else is a bonus.  We don't play the games very often, but they are a nice little bonus. Voice recognition is awesome.  The FireTV was worth the money for me and I probably use it to 20% of its full potential.", "verified": true, "helpfulness": "0/0", "author": "P. Morrison"}, {"rating": 1.0, "review": "It would be awesome if it actually worked.  I had a Fire TV stick and it died in a few days.  I liked the product a lot while it was working however.  So I returned the Fire TV stick and upgraded to the Fire TV.  Again, within a few days the unit was dead.  Everything else in my TV works just fine to include the Chromecast I've had for months.  It could be just that I'm just unlucky, so I will order a third.  However, if this ends up happening to you, know that you are not alone.  I think they may have released the product too soon without enough testing.", "verified": true, "helpfulness": "0/2", "author": "Samuel H. Tunes \"~ In God we trust\""}, {"rating": 5.0, "review": "Excellent product that works well for Netflix and Amazon Prime - also has some kind of sound booster it seems that provides really good quality audio which I hadn't expected.Really fast delivery.", "verified": true, "helpfulness": "0/0", "author": "Gareth C Heatley \"G C Heatley\""}, {"rating": 3.0, "review": "When it was finally up and running I would rate it  very highly. Unfortunately the first two devices that I received were defective and needed to be returned. That seems to me to be poor qc at the point of manufacturing. So the elapsed time from ordering to ultimate customer satisfaction was over one month!", "verified": true, "helpfulness": "0/0", "author": "joeyjeter \"joeyjeter\""}, {"rating": 5.0, "review": "Fire is performing well above our expectations.  It has a voice recognition system that has worked flawlessly from day 1.  I would recommend this to anyone, and have to family and friends.", "verified": true, "helpfulness": "0/0", "author": "L. Stevens"}, {"rating": 2.0, "review": "I bought this device to use with a new slingbox 500. It disconnects frequently, audio is out sync with video. Not sure if its a hardware or software issue but it does not work well!", "verified": false, "helpfulness": "0/0", "author": "Mike"}, {"rating": 2.0, "review": "I bought this for 2 reasons only: To watch Amazon Prime movies (which it does very well) and to stream my Blu-Ray Digital copies, and this is where it fails miserably. The box loads fast but the lack of support for digital copies was a huge deal breaker for me. I have several Blue-Ray disks and I bought this hoping it would resolve the issue of my disks getting scratched by allowing my kids to watch their movies without having to swap disks out all the time.Digital Copies are very popular and can be streamed on many apps including Vudu (which I prefer), but none of these apps are available on the device, and I think that's crazy. The one app that it does that supports digital copies is Flixster, HOWEVER Flixster only streams in standard definition AND Flixster does not have an agreement with Disney, so my kids are not able to watch their Disney digital copies.Pros:-Very fast and excellent menu layout-Good Voice support when searching for Prime Movies (voice search is not compatible with Netflix)Cons:-no Blu-Ray Digital Copy streaming app-Netflix app has major issues. Every couple of weeks it loses its ability to stream a Netflix movie or TV show and it gives an error saying it cannot  play back the desired movie and it tells you try a different video but that does not resolve anything. The only way to fix it is to go into settings->apps and find the amazon movie app and clear the cache 5 or 6 times (doing this once does not resolve it) and then you need to scroll down to the Netflix app and clear the cache on this as well, AND THEN you have to unplug the device for about 30 seconds and then reboot, and then it will work for a couple more weeks until it happens again, and then repeat the tedious process.Hopefully they fix it, but until then if you are on the fence, buy a Roku BoxI own 2 of these boxes and also a Fire TV stick, but now they just collect dust because I replaced them with a Roku box which has every app the Fire TV has and many more...most importantly it has VUDU so my kids can happily stream to their hearts content.Hopefully they add VUDU in the near future, but from what I read sadly I don't see it happening.", "verified": true, "helpfulness": "0/0", "author": "Bryan H."}, {"rating": 5.0, "review": "Product looked beams new highly recommended a refurbished one!", "verified": true, "helpfulness": "0/1", "author": "MD \"MD\""}]