[{"rating": 5.0, "review": "Love it  and works as advertised.  Easy to install . And the streaming is excellent,  And with the firestick and the fire TV  and don't have use my tablet for Amazon streaming  and in any room I choose.  And the voice command is fabulous. .", "verified": true, "helpfulness": "0/0", "author": "puttputt \"Della\""}, {"rating": 5.0, "review": "I would love it more if my husband didn't decide to take it over. Amazon, please make something to make my husband bend to my will!!!", "verified": true, "helpfulness": "0/0", "author": "BayouSweetie"}, {"rating": 4.0, "review": "Got this as a Christmas gift from hubby! Easy set-up and love the voice recognition on the remote. Lots of apps and free tv shows/movies to choose from. Can transfer it from one tv to another without worrying about cable outlets. However, it keeps getting disconnected and the screen would go blank periodically. Every time this happens, we would check the HDMI connections, and they all seemed secure. We'll try another HDMI cord to see if this resolves the problem. Otherwise, love it, and highly recommend! :)", "verified": true, "helpfulness": "0/0", "author": "visayan1"}, {"rating": 1.0, "review": "I was finally able to have someone assist with set up and am advised this product is incompatible with my tv.  I cannot use it.", "verified": true, "helpfulness": "0/4", "author": "Betty S."}, {"rating": 5.0, "review": "This is so much fun!!  I can play bridge on my TV, watch new episodes, download lots of great programs on my large HD TV", "verified": true, "helpfulness": "0/0", "author": "Emily W"}, {"rating": 5.0, "review": "This equipment performs as advertised; easy set up and easy to use. The streaming process is excellent providing a superior video and audio experience. This is the one to purchase - it excels when compared to it's rivals. It's well worth the investment!", "verified": true, "helpfulness": "0/0", "author": "Larry Drake"}, {"rating": 4.0, "review": "Enjoy the ability to view series I have not heard about but not able to see. Great range of offerings movies, TV, games and music.", "verified": true, "helpfulness": "0/0", "author": "Tricia Mitton"}, {"rating": 1.0, "review": "This go of in the  middle of the  tv show 3 to 4 times  in a hour . I unplug it and plug in NetflixBox with the same cords and it never go of  lThink there's  a short in this Fire TV box.Net", "verified": true, "helpfulness": "0/0", "author": "Lindy L Brownie"}, {"rating": 5.0, "review": "Got rid of cable TV. Voice search actually works.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "For the apps that are included I like what it does. Good picture, good sound. The interface is close to the Kindle so I am already used to it. Installing apps is easy. I would also like to be able to stream movies from my laptop and that is turning out to be problematic. Amazon does not include many apps for the Kindle and Fire lines which work well with outer Android devices.", "verified": true, "helpfulness": "0/0", "author": "quicksilver"}]