[{"rating": 1.0, "review": "This is very fast tv box however it needs lot of improvements, what really surprise is that why would not add a power button there is no way to turn the power off to this unit. That is very disappointed makes me very sad. Even you are not watching anything it is still streaming high quality images for no reason. If you are on limited bandwidth then stay away from this box it's not for you. You won't even know it will be sucking up the data like big monster in it. And there no fix for this no fix I would suggest wait for next version hopeful Amazon team would realize that they are missing the power down button.Otherwise games works really good. Works very smoothlyAmazon most act on it. Good looking box but lack of features. They should get this fix very soon. I hope I won't be getting a letter from ISP regards to high usage all of a sudden. I have started power off by pulling power cable but I hope I won't corrupt the firmware Some day I hope notPlease fix.", "verified": true, "helpfulness": "3/4", "author": "Kamaljit Jammu"}, {"rating": 5.0, "review": "Great little device. It is small and doesn't take up much space. I wouldn't even know it was there if I didn't see the little light on the front of the box. Just plug it in and a few more simple steps and your own your way.", "verified": true, "helpfulness": "0/0", "author": "angela lowe"}, {"rating": 4.0, "review": "well, It took three boxes but I finally got one that works. the first two started off ok, but when they went to sleep they would not wake back up. so far number three is working just fine and therefore I really like it", "verified": true, "helpfulness": "0/0", "author": "Tony  Batchelor"}, {"rating": 1.0, "review": "While trying to watch a movie, every fiew seconds I got a wait bar. The first couple times I chalked it up to happenstance, but it kept on and on. This is not instant TV", "verified": false, "helpfulness": "1/2", "author": "Lucy"}, {"rating": 5.0, "review": "I love my Amazon tv! It has everything I was looking for and then some. I recommend it to anyone who doesn't like cable or watches it enough to be paying for a monthly subscription.", "verified": true, "helpfulness": "0/0", "author": "MzBailey"}, {"rating": 1.0, "review": "The system only worked one time and now it will not even turn on.Have not been able to resolve this issue yet", "verified": true, "helpfulness": "0/1", "author": "Roger Green"}, {"rating": 5.0, "review": "I Love It.", "verified": true, "helpfulness": "0/0", "author": "nicole hardy"}, {"rating": 4.0, "review": "Easy set up.  Everything worked smoothly as advertised.", "verified": true, "helpfulness": "0/0", "author": "R. Olson \"edman*\""}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "JOHNDRISCOLL"}, {"rating": 5.0, "review": "This thing is freaking awesome!  It took me all of 10 minutes to set it up. If you're an Amazon prime member, getting this thing is a no-brainer. The voice navigation works amazingly well.  All of my Amazon videos, music are all in one place and easy to get to. The greatest part of this whole deal is the \"SLING TV\".  It's a subscription Internet streaming service that streams the most popular Cable/DirectTV channels, ESPN/ESPN2, HGTV, TNT, Travel Channel, Cartoon Network adult swim, Turner Broadcasting, and a couple of others that I don't watch for $20 dollars a month. The video quality is HD but that depends on your Internet bandwidth, if you don't have high speed Internet service, you're going to be pretty disappointed.  My Internet speed is around 25 Megabits/second and the video quality is 720p or better. A big thumbs up!!!", "verified": true, "helpfulness": "0/0", "author": "Wayland Yan"}]