[{"rating": 5.0, "review": "I love it!  Works great.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 2.0, "review": "Bought the Fire TV to watch Hulu and NetFlix. Hulu was a huge disappointment (using paid account, direct wired high speed Ethernet connection). Very pixelated video. Far from HD. Looked no better than their mobile app. I know this is not directly Amazon's fault, but it's a marque app on the device and is an insult to the Fire TV. World War Z movie was better quality, but still not the HD I was expecting.Watched some Prime Videos. I was surprised by how few free offerings I could find. The Fire TV page totes the long list of stuff you'll get for free with your prime membership, but nearly everything I found was $3 and up. West Wing? $50 per season. That's $350 for the entire series!!!! The box set is $79.95 right now on Amazon. $350 vs $80???? Who do you think you're fooling Jeff? Even after my $100/yr Prime membership?Other Notes:Setup manual is too sparse. Says plug in HDMI and Power and you're good to go. Actually, an orange light flashed on and off for nearly an hour until anything happened. No such mention in the two page pictograph pamphlet. I was about to pack it up and return it when it finally showed a green light and turned on.On screen ABC keyboard was a PITA. What happened to Qwerty? The Android and iOS devices use Qwerty. The Netflix Fire TV app uses Qwerty. Get with the times Fire TV.Box is very shinny. Fancy finishes and very annoying wrappers that take 10min to unbox. So much for the delightful 1 step to extract packaging I came to love with the Kindles.Suggestions:Great device, poor content. Fix your content problem. Jeff, can you buy a major studio or network perhaps? That would be a game changer.", "verified": true, "helpfulness": "4/6", "author": "J. Hoeler"}, {"rating": 5.0, "review": "This is great", "verified": true, "helpfulness": "0/2", "author": "R. Parr"}, {"rating": 5.0, "review": "I have had more fun with this system.  So much easier to use than others.  Another reason I love Amazon and Prime.", "verified": true, "helpfulness": "0/0", "author": "Debra Davis"}, {"rating": 2.0, "review": "The technical specs chart is very misleading.  The Google Chromecast does include a \"remote with no line of sight required\" it's called your phone.Also this is yet another box to pile somewhere on or near my tv.  Since my tv is mounted on the wall I don't want any unsightly cables running to yet another box.  So the chromecast plugs in to the side, out of sight, perfect!other specs, processor, ram, Ethernet, who cares?  you packed in more/better stuff, which partially explains the price.  This isn't a pc it's a device you use to watch movies.  surround sound, digital out ??? why?  your tv routes through your receiver to play surround sound.The only thing I wish my Chromecast had was an amazon prime video app, but guess what, it can stream web pages too!  log in, start the movie, and cast to your chromecast, so simple!  and $35.  (and I *do* get HBO go unlike with the amazon fire tv! hello game of thrones)sorry this is not a game changer.  just a bloated and overpriced device pushed by a multi-billion dollar company.pass.", "verified": false, "helpfulness": "2/8", "author": "Nick M."}, {"rating": 5.0, "review": "Love this thing.  voice search works great.  love the design and layout of the software.  replaced cable box in bedroom saving $10 a month.", "verified": true, "helpfulness": "0/0", "author": "Gordon Squires"}, {"rating": 3.0, "review": "The sound is slightly distorted.  It's much better when I play my Prime videos  through my computer.  I like the ease of use though.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simple, great entertainment, great quality.", "verified": true, "helpfulness": "0/0", "author": "Pablo Garcia"}, {"rating": 4.0, "review": "Haven't gotten  to all the features yet but so far so goon.", "verified": true, "helpfulness": "0/0", "author": "Wade Kuroiwa"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/2", "author": "Akram Elhaddi"}]