[{"rating": 4.0, "review": "I love fire tv but finding the remote is a pain.it blends into everything and it's super hard for me to find it during the night.", "verified": false, "helpfulness": "0/1", "author": "Victoria Swedorski"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "Robert"}, {"rating": 5.0, "review": "great except that I paid $99 and this week it is on sale for $84.", "verified": true, "helpfulness": "1/4", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I have used all of the media streaming devices and this one is my favorite.  The device itself looks great, modern and clean cut.  The UI is very easy to use, and quite nice to navigate.  I will say that they need to have a better section for selecting apps such as Netflix, but other than that I love it.  The remote is the best in class and is very natural to use, I also enjoy the voice search.  Its so fast too! if you are debating between this and another player, CHOOSE THIS!", "verified": false, "helpfulness": "3/3", "author": "Heather Morgan"}, {"rating": 4.0, "review": "A nice set top box, with a polished UI.Good access to Prime and NetFlix, and great selection of add ons.", "verified": true, "helpfulness": "0/0", "author": "Randy Johnson"}, {"rating": 5.0, "review": "I am an avid roku user, got this and it is much faster and navigation is a breeze.  I love it.", "verified": true, "helpfulness": "1/1", "author": "Tiffany B."}, {"rating": 1.0, "review": "I'd love to get the Fire but it isn't supported on my  super-duper Vizio 3D (Roku is) and they apparent have no plans to add it. Amazon, a little our a lot of pressure please :-)", "verified": false, "helpfulness": "0/14", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I really enjoyed the Amazon Fire T.V. for my 30day free trial period. I liked the games the most of all. Amazon Fire T.V. has all the competitors beat in the game market. The prices is higher than the others which is why I didn't buy it after the 30days. Amazon Fire T.V. is really not worth it with out Amazon Prime and a game controller. But if you have around $250.00 to spend on Amazon T.V., Amazon Prime and a game remote its all good!", "verified": true, "helpfulness": "0/0", "author": "troy"}, {"rating": 4.0, "review": "Fast and responsive and always on. A friend of mine jokingly asked me why I would need this if I already had an Xbox that could basically do everything the Fire TV already does. Well, the answer to that is speed. I love the fact that the Fire TV is always on standby and is ready to go at a moment's notice. My Xbox takes at least a 1-2 minutes to get booted up and ready to go. Plus the remote is much more natural for navigating the UI.That's the only drawback to the Fire TV -- the UI. It's clean and simple, but it's somewhat quirky as well. One example is how it launches apps. One of the first apps I downloaded was Netflix. Whenever I go to the home screen there's a call out for \"popular Fire TV apps\" and one of them is Netflix. When I click on the Netflix icon it tells me that I already have the app and cannot download it again. So I have go back a few menus to find the Netflix app rather than just launching it from the Home screen. It's a minor annoyance, but it should be smart enough to just launch the app, not tell me I already have it. And there are a few more of these odd use cases that can making navigating around the Fire TV a little less than intuitive.But for the most part, I love it. Especially since they separate out the Prime content from the paid content. Very nice.", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 5.0, "review": "I love it,  super easy to use", "verified": true, "helpfulness": "0/1", "author": "Sarah King"}]