[{"rating": 5.0, "review": "I have to reboot the device to get a source switch--the major fault among many virtues.", "verified": true, "helpfulness": "0/0", "author": "Michael Mendle"}, {"rating": 5.0, "review": "Great, I have used the Western Digital, Rasbery PI , Roku and the Sony boxes and the Fire TV is the best of them all.", "verified": true, "helpfulness": "0/0", "author": "Marine"}, {"rating": 5.0, "review": "enjoy the variety of entertainment or whether there are a lot of hidden costs that should be upfront so the consumer will know", "verified": false, "helpfulness": "0/0", "author": "paul j letendre"}, {"rating": 5.0, "review": "I use it more than my Chromecast now and I was a cast junkie. Its a little more convenient having most of the apps I use on the device and having access via a remote rather than my phone. It is lightning fast compared to other devices (roku) and the voice feature is very accurate. Wish you could use it with Netflix and other apps. Overall I have no regrets will get the controller next to try out the games. Can't wait to try the Echo next.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Blazing fast", "verified": true, "helpfulness": "0/0", "author": "Nasser A."}, {"rating": 5.0, "review": "I love this, its my favorite Christmas present", "verified": true, "helpfulness": "0/0", "author": "sue stuart"}, {"rating": 5.0, "review": "I absolutely love it so far!", "verified": true, "helpfulness": "0/0", "author": "Cait"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Kerry Harwick"}, {"rating": 5.0, "review": "Box works very well. So much so I had to upgrade my wireless system. The Amazon content is excellent. I'm going to dump my cable tv.", "verified": true, "helpfulness": "1/3", "author": "Jerry"}, {"rating": 5.0, "review": "This Fire works really well, it is more expensive than I thought it would be to buy movies and shows but I will keep it.", "verified": true, "helpfulness": "0/0", "author": "Naoma Timmerman"}]