[{"rating": 5.0, "review": "This is a very high quality product not like the cheap and flimsy products like Roku or Chromecast. This actually works and works very well. Get it, use it and judge it for yourself. Don't listen to stupid reviewer, who don't even own the product. Amazon should start controlling these fake reviews or they will loose lot of business coz their product reviews are getting skewed all the time just for these fake and useless reviews.", "verified": true, "helpfulness": "22/34", "author": "M. Rahman \"mzr\""}, {"rating": 4.0, "review": "I'm giving it a 4 from just what I read. If I end up getting one that may go down or up. I use, and really like the Apple TV. This wouldn't be a replacement, but rather an addition. I like options. This for one would make it a snap to use my Amazon Prime streaming.It's not a threat to Apple TV. Especially since I strongly believe a new souped up one is around the corner. But heck for $99, I may give this a try.", "verified": false, "helpfulness": "2/43", "author": "John Denning"}, {"rating": 5.0, "review": "Update April 14, 2015:Just over a year after the Amazon Fire TV came out there is a significant OS update with new features. OS 1.5 should be on your FireTV already and if not you can check for updates in settings. Here is a summary of features:The USB port on the fire TV now supports external storage expansion. I had to remove some games when I ran out of space. No more! Approved devices include the popular PNY Turbo USB 3.0 Flash Drive which is fast and well made (I have one!).Bluetooth Headphone devices are now supported for private listening. I just paired it with my Amazon Echo and it works perfectly. Excellent!Fire TV now supports internet access requiring a login (like in hotels) so you can take this very portable device on the roadThe informative x-ray feature I've come to enjoy on my Kindle Fire HD 8.9 tablet is now available on the Fire TV. The X-Ray options appear on the bottom of the screen when the scene is paused with the select button. Use the up on the ring to being them into the controller focus and to get more information.Music has been improved. You can now browse Prime music share and your own playlists.The purchase pin numbers are now hidden from view when entered.Shortcuts (press and hold the home button) to quickly tell your Fire TV to sleep or share its screen.This is a pretty significant update with a number of very useful features. Well done Amazon!The main review is below:I have had my Amazon Fire TV since the day after it was released and I've lived with it a little while now. I'm sure many other reviewers will focus on specs and quad core gigabytes, and other stuff. I'm focusing on my experience using the Fire TV.This very compact box is a bit smaller than a slim external usb CD/DVD drive and a bit heavier - which is still quite light. It has a white light on the front which is one when it isn't in sleep mode. On the back there is a hdmi connector for your TV or home theater, a network LAN jack if you (like me) have hard-wired Ethernet available, a connector for the external power cord, an optical audio connector for those who may be able to use this for high definition audio, and finally a USB connector for media and maybe more.Setup was oh-so-easy. Connected it to my wired LAN switch and an HDMI input on my Samsung TV plus power. It came tied it into my Prime account so I was watching Prime HD content within minutes.I was able to setup the WiFi connection easily, but since wired LAN access was convenient I went wired. I feel it's just more reliable.Note: Amazon Fire TV does NOT come with a HDMI cable. I had one available so no worries here.One of the first things I noticed and have come to find really nice is the texture on the remote. It feels very nice to hold and is both smooth silky smooth and easy to keep hold of. This simple little remote does a fine job with the directional ring around the selector button, the back, home and menu key. This is in addition to the back, play/pause and forward buttons. Some products made their remotes too small, but I think Amazon got it just right.Best of all is the voice search button. On voice enabled apps it uses voice recognition to perform searches. I found it incredibly accurate and very fast. It *really* beats using a screen keyboard and click-click-click-select over and over! The voice search is the best and really works well.The user interface is very smooth and responsive. The antithesis of my Panasonic DMP-BDT220 Blu-ray which is clunky and slow by comparison. It's faster than my Tivo S3 and Premiere too. The speed and smoothness makes operation a joy.My impression is 2 GB of RAM and a quad core is a lot of power for simple streaming. I think Amazon intends for this to be much more than a streaming or light gaming device. Whatever the eventual target may be the Amazon Fire TV has a bunch more computing power than other boxes out there and it shows in the great user interface experience.I'm not a gamer so I'll leave that part of the review to others.The selection of media sources covers everything I use except for Live365 Internet Radio, but I get that with my Tivo so no big loss. Still, it would be nice if it were added in the future. The lack of HBO-GO may be a disappointment for some but does not bother me. I expect it to be added eventually.My impression is Amazon Fire TV is a great device with the potential to add in many more features and services moving forward. Well done Amazon.I'll be updating this as I learn more and have experiences worth sharing.UPDATE: April 26 2014I've been using my Fire TV for a while now and I keep liking it more and more. I have been loading some apps and one is worth mentioning here. It is the Frequency app. This curator of web video brings a plethora of web sources across the web to Amazon Fire TV. The intuitive and easy to setup app added great value to my Fire TV and solved a problem with getting C|net TV on my Tivo!I recommend getting the free Frequency app for your Fire TV.", "verified": true, "helpfulness": "36/39", "author": "Stephanie Sullivan"}, {"rating": 5.0, "review": "This review is solely for the purpose of offsetting the people who are giving one-star ratings despite saying they will \"never buy it\" or \"refuse to pay Amazon even more money.\"I purchased the Fire TV yesterday and will update this review tomorrow night after I use it for a little bit.UPDATE: This is the actual review.After using Fire TV for a few hours, I've found the UI very fluid as the system is easy to navigate and is much quicker than other products in the market that I've owned/played with. The content available is still lacking (hence the 4-star rating) but what's available is certainly sufficient for me. I look forward to the days when HBOGo and Spotify are available. The voice search function on the remote works exactly as you'd expect. I ask for something and it does its best to find it, usually successfully. Being someone who already has Amazon Prime, Netflix, HuluPlus, HBOGo, and Showtime Anytime, this little device is a steal at $99.00.", "verified": true, "helpfulness": "34/51", "author": "Stephen M. Codd"}, {"rating": 1.0, "review": "I was really excited but then I read the specs. If this was a DLNA device that let us play the music and videos we already own, then it would be great.  As it stands I need this to stream and another box to do DLNA.  So I'll just keep the X-Box 360 as it does both now.  There is absolutely no incentive to buy half a solution.  Remember we want a connected home and the least amount of devices to do it with.  Unfortunately this has great potential but is like owning a sports car with only two wheels.", "verified": false, "helpfulness": "68/321", "author": "Thomas Drew"}, {"rating": 1.0, "review": "I think at a lower price would definitely be a must buy. I'm already paying for Prime and will soon go up in price to $99. Plus the Fire at another $99. I think Amazon should lower the price.", "verified": false, "helpfulness": "30/270", "author": "Pablo"}, {"rating": 4.0, "review": "While many reviewers are shooting down Amazon FireTV for a lack of content. I have a different view on what it does not offer. Many folks are looking for the streaming devices to also include a browser in the product. If Amazon FireTV offered Chrome browser, it could be an instant winner. . . My choice going forward is the Asus Chromebox which is a SFF mini computer no bigger than the size of FireTV. It offers the most flexabilty while on-line.", "verified": false, "helpfulness": "4/29", "author": "JimmyL"}, {"rating": 1.0, "review": "To be honest, one doesn't have to have this box to make a review. The set top box is a -very- crowded market, with Roku and Apple TV being the more popular products depending on what you want. Now the Amazon Fire TV Lessee... - Fire TV has all the popular channels Roku has, but Roku has a lot more still (Roku has at least 750 public channels, and a heck of a lot more private channels). - Game-wise, Roku is more open-sourced compared to Fire TV, only the placing of channels into the public is closed (per review of Roku's staff). - The controller (the Roku's remote) is INCLUDED in the $99 version, and the remote also is not reliant on IR (last I checked, it's RF or BT). The Roku remote also has gyro-sensors for play with Angry Birds (also included in the $99 Roku). - Amazon can't beat Android's set top box on controllers (Any USB and BT controller is compatible) - My Android set top box has the same specs, but my remote is better (full QWERTY keyboard). - My Android device has access to almost all the library Amazon's Fire TV has (take a guess which one is NOT on Android), and a lot more (also like Roku) - From what I saw, Amazon's Fire TV uses Android (AGAIN) for its OS (hence the better \"voice search\").Why not simply put Amazon's Instant Video apps ON Android instead of trying to make your own devices. Then you can make more money off Android users instead of having a niche market.", "verified": false, "helpfulness": "26/278", "author": "Michael S. Lile"}, {"rating": 3.0, "review": "PRO:-- Open source will allow coders to unlock potential a la other Android devices-- Excellent hardware allows for a lot of potential, although it's currently untapped-- A couple interesting features, the ASAP feature is cool, and the speech searching is nice-- Amazon has a lot of money to make this device workCONS:-- Kind of like a reverse Ouya. It focuses more on the streaming and less on the gaming.-- $40 controller additional cost means hardly anyone is going to play these games. Real gamers will just play their gaming consoles. Casual gamers won't care to spend the extra $40. At $140, you have to wonder why a person wouldn't just buy a used PS3 or Xbox and stream with that and play much better games (even if you restrict yourself to cheaper indie titles and PS Plus free titles you'd be way better off).-- Lack of some critical channels, such as HBO GO, Youtube, Spotify, MLB. I would imagine these will get added later, but for now they are lacking.-- Doesn't have one of the best features of the Roku 3, which is the ability to plug in headphones to the remote.-- ASAP only works on Amazon streaming at the moment -- would be a killer feature if it supported Netflix as well.So, when it comes down to it, if they had included the controller or developed a remote that was also a controller, I think you could make a case for this being a better device than the Roku, and even throwing out the games, it has the potential to become a better device than the Roku with the addition of missing channels, and outside potential from community developers who could come up with something special.Until then, though, this is a device that I wouldn't recommend to friends over a Roku, unless they want to take the gamble that this will one day be a better device.", "verified": false, "helpfulness": "19/53", "author": "Jason Lindig"}, {"rating": 1.0, "review": "I have att DSL and without a hard drive I can't watch anything during prime time even though I'm supposed to have 2.5mbps..", "verified": false, "helpfulness": "27/240", "author": "Mike D"}]