[{"rating": 3.0, "review": "Games on it are cool, but lacks the functionally of chrome for a much higher price point. Server connection errors, app will re-set and lose all info, random glitches.", "verified": false, "helpfulness": "0/0", "author": "Joseph A Buantello"}, {"rating": 5.0, "review": "I've owned a roku, smart tv and a bluray with streaming technology and none of them compare to this thing. It loads quickly and is the only one that can play Amazon Prime videos without a hassle(using an xbox 360 to stream was by far the most aggravating thing ever).", "verified": true, "helpfulness": "1/1", "author": "Michael Sharpe"}, {"rating": 5.0, "review": "Very powerful device in a small package. Comes in great no hassle packaging. Easy to side load apps to. Works great with XBMC. Would recommend to anyone looking for a media streaming device.", "verified": true, "helpfulness": "0/0", "author": "Anthony I."}, {"rating": 4.0, "review": "I've never owned a similar device previously, so I don't have anything to compare it to, but...  I've found the advertising to be true; It IS easy to set up.  it DID recognize my WiFi instantly.  The voice search IS amazingly accurate.I originally looked at Chromecast but was dismayed to see that I needed a laptop or pad, or some internet device to \"cast\" the service to my TV.  I was drawn to Fire by the ad for the Fire Stick, but I liked the idea that the Fire TV box had the voice search, and more processing power.  Besides; at 4\" square, it's extremely portable anyway, and totally inconspicuous.  After bundling it with Prime, it barely cost any more than the stick.I live in a rural area and have minimal broadband speed (equivalent to 3G), but most things I've watched have been totally seamless.  While viewing through the apps, like ESPN (which doesn't give you much, by way) and History, there were some brief stalls on occasion, but I'm sure a better internet connection would alleviate that.I did have one weird experience on the second day I had it.  I turned it on, along with the TV, but it just sat there with a black screen.  I thought it maybe took a while to download something, like when satellite or broadcast TV downloads a new program guide, but after 3 or 4 minutes, I realized nothing was happening.  I unplugged the power, plugged it back in, and everything was fine.  In the week since then I haven't had that happen again, so I hope it's not an issue.On a related side-note; Prime, which I bundled with Fire TV for a discount, is only \"okay.\"  Yes, there's a lot of free stuff, but most of the free stuff is not what I really want to watch.  The movies and shows I was hoping for are mostly extra - usually around $1.99 to $2.99 each.", "verified": true, "helpfulness": "0/0", "author": "Craig Clausen"}, {"rating": 5.0, "review": "Easy setup.. Still finding my way around.. So many options..WoW", "verified": true, "helpfulness": "0/0", "author": "Bob Reilly"}, {"rating": 5.0, "review": "awesome, we are very excited to use our new Amazon Fire TV streaming device. so many options to choose", "verified": true, "helpfulness": "0/0", "author": "Papou4553"}, {"rating": 5.0, "review": "Its still in the box, I hope to use it soon", "verified": true, "helpfulness": "0/1", "author": "Rick W Peters"}, {"rating": 5.0, "review": "Love it ,so does the grandchildren", "verified": true, "helpfulness": "0/0", "author": "RHETT R SIMPSON"}, {"rating": 2.0, "review": "When I got it I could not get the netflix part of it to run. so I called and it took a 2 hour down load they said to update. We then tried to watch house of cards on netflix and it just keep streaming about every 3 mins, was not fun to watch a show while it was waiting to load. I was using the chromecast so we went back to that, I tried this because amazon prime will not play on the chromecast. Oh well, most of the things we wanted to watch on amazon prime cost more money to watch anyway!", "verified": true, "helpfulness": "0/3", "author": "lookn cookn"}, {"rating": 3.0, "review": "I think the FireTV is a great product with poorly tested software. At present, I'm having to constantly clear data and cache of the Amazon app to make netflix video playback work correctly.", "verified": true, "helpfulness": "0/1", "author": "Ry"}]