[{"rating": 1.0, "review": "My ROKU works so much better. I have slow internet but the ROKU did just fine, the fire failed.", "verified": true, "helpfulness": "2/5", "author": "Aretta M Hudlow"}, {"rating": 4.0, "review": "I really like my Fire TV. I have to get used to the interface, since I've been using an Apple TV for the last 4 years. It works great, I hope they continue to develop great apps. I wish they would incorporate the Seagate media App into the Fire TV like they've done for the Kindle Fire HDX. I like streaming my home movies, and my own films (I'm an indie filmmaker) from my Seagate Central. I would love to see them also develop a VuDu App as well. Since my kids love to watch their favorite movies. There is the Flixster app, but that doesn't show all the films we own, unlike the Vudu app. It's a solid box. With a few more great apps, and this would be the box to get.*As far as I know this won't play any videos purchased via the iTunes Store.", "verified": true, "helpfulness": "0/0", "author": "Gus M. Guillen"}, {"rating": 5.0, "review": "I love it! I had an issue with the remote going through batteries every week. I called tech support and they sent me a new remote. The customer service was excellent!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Dr. Jeff Pack\""}, {"rating": 2.0, "review": "ordered a movie keeps telling me internet not strong enough", "verified": true, "helpfulness": "0/3", "author": "dani brit"}, {"rating": 3.0, "review": "I have owned Roku LT, Apple TV, Chromecast, and Roku 3. Strangely, the oldest streamers ( the LT and the Apple) performed extremely well compared to the newer devices. Roku 3's audio never worked correctly and is now sitting in a drawer. The Fire TV is very glitchy--sometimes Netflix videos won't play at all. Hulu Plus videos often begin with 10-20 seconds of black screen before the video begins. I am underwhelmed.", "verified": true, "helpfulness": "0/0", "author": "Michael R. Hanson \"teach\""}, {"rating": 5.0, "review": "Love it. amazingly wonderful.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As soon as I got the package, I took out the little unit (it is soooo small) and the remote. I plugged the internet and HDMI cable (both not included) and Amazon immediately showed up on screen asking me to press the play/pause button to continue. It was that fast!After I press the play/pause button, a cartoon with a man talks about  instructions on how to use the Amazon Fire TV. It is immediately connected to my Amazon account!  I just had to enter my sign-on and password for the other accounts (e.g. Netflix or Hulu Plus). All my Amazon-purchased music is available for playing. It is EASY! The video is clear and the voice is crisp.The first thing  I did was look for Gary Busey using the voice search. He had 90+ movies! Then, when my husband got home, he drove me crazy using the voice search for everything like John Wayne, Justice League, etc. It makes the search for music and movies so simple.I got it a day earlier than estimated and that's the cherry on top!", "verified": true, "helpfulness": "0/0", "author": "Gladstone Frau \"Harshrealm112\""}, {"rating": 5.0, "review": "This item was shipped quickly and it took me maybe 5 min total from opening the box to having it fully set up and working.  Yes the batteries needed to be replaced but who cares it's two AAA batteries. Unlike other reviews it connected with my homes WiFi and made a quick update. It's easy to search for shows and navigate. Some other reviews said there was no way to.power it down, this is also false.  You can quickly go into setting and there is a sleep mode you can use. It takes about 5 sec to find it and enter the sleep mode. We are an amazon prime member and it is so worth it for the fire tv. There are future plans to include the nfl Sunday ticket at end nfl games. When this happens I will cancel my cable/dish immediately.  There isn't a show you cant find, and best part NO commercials. Great product!Update... the remote is very very small, easy to loose. My kids lost it but if you have a smart phone download the free fire tv app. It's better than the remote.", "verified": true, "helpfulness": "0/0", "author": "amanda eric"}, {"rating": 5.0, "review": "As expected", "verified": true, "helpfulness": "0/1", "author": "Andrew Lion"}, {"rating": 5.0, "review": "Outstanding.  This is the best OOBE that I've seen in a consumer device in years.  I have a number of other devices for streaming and buying media, but the setup and experience with Fire is the best I've seen.  I'm using it to navigate Netflix as well as Amazon.  It is much more responsive than the apps in TV or other TV devices.", "verified": true, "helpfulness": "0/0", "author": "Brad Wheeler"}]