[{"rating": 3.0, "review": "i see the answers to everything but this.....I have a ton of movies on my hard drive, will this stream from my PC so i can watch them on my tv? the only reason im looking into this...", "verified": false, "helpfulness": "5/72", "author": "greg belkiewicz"}, {"rating": 5.0, "review": "Amazon Fire TV in one word is simply: Awesome! I received mine as a gift and this is one is a keeper. Bye-bye Roku and no need to consider Apple TV or Google Chromecast. This unit has everything I need and works great. Amazon has hit a grand slam with Fire TV and has definitely raised the bar for streaming services. This is not just a little improvement over the competition but literally blows them away with the quad-core processor and voice activated remote. No more stalling during a movie and hopefully no more rebooting which the Roku likes to do on a regular basis.Aspects about Amazon Fire TV that I like include:+ SET-UPSet up is extremely fast and easy and I did not encounter any problems. Literally plug into your television, hook up to your internet connection, and enjoy. You are ready to go. The box is sleek and very unassuming.+ CHANNEL SELECTIONAmazon Fire TV has everything I want: Amazon Prime, Netflix, YouTube, Hulu Plus, Vevo, Pandora, iHeart Radio, and more. Roku does not have YouTube so this is a nice feature for me.+ VOICE ACTIVATED REMOTE SEARCHINGThis is huge. Not only does the voice activated remote control work but it makes searching so much faster and easier. No more clicking through the alphabet, making a mistake, having to delete the incorrect letter, go back to the correct letter, and then search. You will love the remote.+ PROCESSORWith a quad-core processor streaming is fast and uninterrupted. No more stopping in the middle of a movie because your processor is too slow.  Our Roku would also reboot on a regular basis in the middle of a movie which is disrupting and annoying. While my Amazon Fire TV is brand new I have not experienced it rebooting.+ PHOTOS & VIDEOI can easily look at photos and watch videos that are saved in the cloud. It is great to see these on a large screen compared to a smaller computer screen.OVERALL ASSESSMENTThe Amazon Fire TV is a must have in my opinion. The competition has just been eliminated. Fire TV is easy to set up, has great channel selection, the voice activated remote for searching works great, the streaming is uninterrupted, and this just works flawlessly.  This unit provides so much entertainment that I will be cancelling my cable service which just raised their monthly rates. This unit will pay for itself in one month’s time.Get Amazon Fire TV. You will not be disappointed.", "verified": false, "helpfulness": "31/42", "author": "Tradecraft"}, {"rating": 1.0, "review": "What Amazon Vine reviewers, paid reviewers, and fanboys won't tell you, but thousands of Amazon customers know well:The CC for the hearing impaired which comes with nearly all video products today is stripped out of nearly all Amazon video content. Amazon only streams the CC for the hearing impaired on the small percentage of video on which it is required by law.If you or any member of your family uses this CC, you will not be happy with Amazon Video. And probably not with Amazon's new box, either.Amazon has made a corporate decision to strip the CC from their offerings. That decision is short-sighted and foolish, but it's Amazon's decision to make. It's difficult to understand, however, why Amazon refuses to be upfront with potential customers of their video offerings regarding this altering of the streaming product.", "verified": false, "helpfulness": "135/426", "author": "Amazon Customer"}, {"rating": 4.0, "review": "When Amazon recently raised their Prime memberships from $79 to $99 annually, members were up in arms threatening to cancel or not renew their Prime memberships at the end of the year (I confess, I was one of them).  Anticipating the negative reaction to the new higher pricing tier, Amazon was armed and ready to roll out a new proprietary gadget that, like the Kindle, would not only ensure Prime members would have incentive to stay around for good, but would go head-to-head with the competition and pose a serious threat to streaming services from devices like Apple TV,Roku 3 Streaming Media Player and Google Chromecast HDMI Streaming Media Player.FireTV is THE hottest new device from Amazon since the Kindle Fire HDX, and they've just upped their game!At $99, FireTV is evenly matched against both the AppleTV and Roku 3 and it does pretty much everything that they will do... only much, much MORE.  The most attractive feature for me is the ability to use Voice Control to instantaneously search and access titles without having to cumbersomely scroll through menu after aggravating menu to find what you are looking for.  Anyone who has ever tried browsing through Netflix's sub-categories of so-called \"genres\" and having to navigate to choose letters for a search query knows just how frustrating this is and SLOW.  With 2 gigabytes of onboard RAM memory and a Quad-Core processor chip, FireTV will instantly respond and let its virtual fingers do the walking for you while you relax and have a drink.  Just speak into the remote and it will obey your commands!  It's just that simple.  No more thumb cramps from navigating with the remote.  FireTV cuts straight to the chase and lets you get on with the show.  Bravo!All of the popular streaming services apps come fully loaded on here.  You can listen to streaming radio channels from Pandora, Tune-In and Vevo, watch movies and TV shows on Netflix, Hulu+, Crackle, Flixster, YouTube and several others like Showtime Anytime and Bloomberg but as an Amazon Prime member you have access to all of Amazon Instant Video's vast library of tens of thousands of movies, music and television shows including Amazon Series Originals.  Use X-Ray with Second Screen from your Kindle to have access to fully interactive information and content while you watch  movies too.  FireTV is virtually the All-in-One media device consumers have been dreaming of!But wait!  There's MORE!You also have the ability to play online games like Minecraft, Sev Zero, The Game of Life, et al, with the addition of the FireTV game controller (sold separately).  While I think this is a neat feature that will be enjoyed by many, including children,  I do feel like this feature still has a long ways to go to compete against Microsoft's Xbox One and Sony's PlayStation 4 consoles and online networks but the fact that they have included this ability demonstrates they are willing to take a bold risk and venture forth into the highly competitive online gaming arena.  Currently there are only about a hundred or so games but they say thousands more are coming and most are only a buck.  Game On!  What's AppleTV got for games?  Nada!You get all of this in one little black box that connects to your television with a simple HDMI cable for only a hundred bucks? SOLD!As a long time Apple supporter, I immediately saw the advantages of defecting to Amazon's FireTV.  I was frustrated with my inability to watch my iTunes movies on any platform other than Apple's proprietary devices with their DRM (Digital Rights Management) and felt like the gatekeeper was controlling how, when, and where I wanted to watch my media.  With Amazon's FireTV, I feel like the shackles have been unleashed and I am no longer bound by the restrictive constraints of digital control.  With FireTV I feel like a kid let loose in a virtual toy store.The only catch?  I have to continue to be an Amazon Prime customer to take full advantage of all of the FireTV's incredible and extensive features.Ok, Amazon,  you got me. Take my money!!!", "verified": false, "helpfulness": "26/42", "author": "Dave Cordes"}, {"rating": 2.0, "review": "Please increase the video streaming programs to include VUDU and HBOplus. To compete you'll have to include more streaming program options and content. People who subscribe or have made purchases on VUDU etc...don't want to lose the ability to access their content from these providers.", "verified": true, "helpfulness": "12/88", "author": "Raymond Howard \"Raymondh13\""}, {"rating": 3.0, "review": "I looked closely at this and compared it to other devices like it. It's very slick and very nice but, really, it doesn't offer much that a dozen other devices don't. The voice search feature seems to be the only actual part of it that is unique - and I think that is great but I question it's usefulness. Time will tell on that.It does offer games and that is great. But the games offered are... they are not going to replace my Xbox any time soon, let's just put it that way.The channels are nice. I guess for some, the inclusion of Bloomberg tv will be a selling point, but not for me. The rest of the channels seem to overlap the dozen or so other devices in the same market - and Roku far exceeds the channel count.Point blank this has nothing that really makes it stand out. Voice, right now, is a gimmick. Games aren't a draw on this device (Not now anyway - that might change). And the channels it can use are far overshadowed by other devices. It's perfectly capable if you don't have a streaming box yet, of course. But there is no reason to toss out your current device if you have one.", "verified": false, "helpfulness": "5/64", "author": "Timothy Collins"}, {"rating": 1.0, "review": "No HBO GO is definitely a deal breaker for me.  Was really excited about this until I found that out.", "verified": false, "helpfulness": "17/254", "author": "Guido"}, {"rating": 3.0, "review": "If I get that I will get all the subscriptions free or I have to pay for each subscription??????? Because I saw that in one part said that a I get prime for 30 day free trail????", "verified": false, "helpfulness": "1/75", "author": "luis"}, {"rating": 3.0, "review": "Jeff Bezos, can this device allow my broadcast channels to be accessed? TX Dr. Paul. I did not see a box for questions...How else will you improve w/o/ questions?", "verified": false, "helpfulness": "1/77", "author": "Doctors Chiropractic \"unnoticed and unknown\""}, {"rating": 4.0, "review": "Before I get into a detailed and technical review, I would like to review it for a non techie person. If you are looking for a device to replace your cable, this may be the one. Unless you enjoy live news and TV shows daily, there is no reason to keep paying for cable. There are some other devices that work very well but Amazon Fire TV is by far the simplest solution there is.  You simply plug it in and in few minutes you are ready to speak to the remote to search or simply browse for content. No complicated setup required, you can use WiFi and that is easy as typing your wireless key in. There is no need to download anything, Amazon has thousands of movies and TV shows and it is constantly growing. You could use Netflix or Hulu but I ended up cancelling my subscriptions for those because Amazon's video library is continuously growing. I expect it to surpass all other streaming services very soon. The voice search is simply amazing, it is way too accurate. After it finds the result, it is a matter of seconds before the video starts playing. The device is very small and elegant and simply fast. Everything responds instantly and smoothly. This is by far the best device available for a non techie person and it maybe for most techie people.After using the Fire TV for quite some time I have discovered a lot of positive aspects of it along with some negatives. There are endless possibilities for this device such as Sideloading Apps, Rooting, XBMC, PLEX, Keyboard & Mouse Support, External Hard Drive support and more, most of these features are obtainable at this moment for somewhat advanced users. But for the basic users who want those features might be out of luck. Google has announced Android TV and it most likely will address most of the Fire TV problems out of the box. So it may be worth waiting for. I am downgrading my rating to a 4 star because the device has a lot of potential but Amazon didn't include it all with the device.Quick Summary: I have used the WD TV, Roku 3, Apple TV (for a short time) and now the Fire TV. Of course I have a Google Chromecast but to be fair, it should not be compared to these media devices because of the price difference. Amazon Fire TV is by far the best one yet. Roku 3 has some advantages such as the ability to plug in headphones in the remote and microSD memory card slot. But Fire TV's performance and features like ASAP and voice search easily burns them all. If you have an Apple TV and you have a lot of media on iTunes, then I don't think Fire TV is the right choice for you, unless you want are an advanced user who can use third party software to make your iTunes content work. There are alternatives like used PS3 and XBOX 360 (in the same price range) if you are more into gaming, I will discuss that at the end. Amazon must have been taking notes on all the problems with other devices and this Fire TV addressed most of the problems that I experienced with the other devices and added much more features. Some of the notable problems with the other devices are: poor sound quality, slow OS interface, steaming problems, limited content, lack of advanced features and few other issues. This device is a no brainer for a person who wants to enjoy thousands of TV shows, movies, games, music and more with ease and without any problems.What is it and what is it used for?It is an Android based media player/ entertainment system that supports a various media types including movies, TV shows, music, apps and games. Most of the media is free if you are an Amazon Prime member and others are fairly cheap. Here are some of the things you can do with it:***Watch thousands of movies and TV shows in 1080P resolution using Amazon Instant video as well as Netflix, Hulu, etc.***Listen to music using apps such as Pandora and iHeart Radio***Play games such as Asphalt, Sev Zero and Minecraft, few choices now but more to come***Use Apps such as PLEX or XBMC, few choices now but more to come***You can play all your files that you have on external hard drive or computer. Movies, Music and Pictures using third party Apps like PLEX and XBMC. Almost all formats are supported.***Other things will be possible with this device over time, it is an open platform OS (Android) and there are many possibilities (Currently many USB and Wireless Keyboards and mouse is supported along with Firefox browser)Also to address those who must have the feature of playing your own video and music files, you can with the app called PLEX. You can also use XBMC if you are more of an advanced user. It is very easy to setup and you can watch MKV, MP4, WMV, AVI, FLAC, MP3 and other files from your computer or network drive. I have tried MKV, AVI, MP3 and FLAC files and they work perfectly. You don't have to leave your computer on to access these media if you have a NAS drive that is supported by the third party apps.As for people who are not happy about the fact that Amazon does not have their App available for Fire TV, please give it a few weeks and they will have it. I have already noticed new apps showing up in the market daily. HBO GO is already available through ADB install. Also there will be a way to install apps from Google Play store soon. The low rating of the Fire TV is misleading; the rating is between 4 to 5 stars from people who actually used it.Setup was very easy; I just plugged in the power cable, HDMI cable, Ethernet cable (you can use Wi-Fi too) and turned it on. A quick 3 minutes update was required, I am a Prime member and it came with my account already logged on, and that's it. There was a nice 3 minutes animation at the beginning after updating that shows you how to use the voice search feature along with other features of Fire TV. Please don't buy this for gaming alone, it is not intended to compete with gaming consoles such as PlayStation and Xbox, it allows you to play android based games and that is enough for light to moderate game lovers. It is very FAST; everything responds instantly, absolutely no lag. If you have bought any amazon products before, you know how excellent the quality is and you always get more for your money. Continue reading for more basic details and some advanced technical details.By default the Dolby Digital Plus is disabled, so make sure to turn it on under settings when you first set it up.One major flaw I realized recently is that the device has around 5GB of space to install games and apps. I only have 3GB remaining after installing Asphalt 8 and Sev Zero game. I am very disappointed at the fact that Amazon intended this device to play games but it has no space to store the games. I hope there will be an update to allow games to be installed on a separate hard drive plugged into the USB port. This alone can be a deal breaker for many. I will keep you guys up to date if anything changes.Positives/Notable Specs:***Quad Core Processor - The device is incredibly fast, everything responds instantly. NO LAG. I was able to navigate through the menu very quickly and apps work seamlessly.***HDMI 1080P - Crystal clear display, some might wish it was 4K capable but I think it's a good move not to have it. Having 4K would increase the price of the device and most people won't have a 4K TV for at least 1 more years. Then there probably will be a newer version of Fire TV with 4K support.***Optical Audio port - This is a huge plus for many people that care about sound, including me. This allows you to enjoy surround sound without worrying about your TV limiting you, simply plug it in to your home theater system using the optical port and get the full surround sound. No more worrying about HDMI not outputting the full 5.1 or 7.1 sound. The sound quality is amazing, it is much better than any other devices that I used before; my 5.1 system really comes alive.***Certified Dolby Digital Plus Sound - This is a bonus and it does make a difference if you have a 5.1 or 7.1 surround systems. I have the Fire TV plugged in directly into my 5.1 Bose system and it sounds amazing for HD movies and music***2GB Memory - It is more than triple the amount of RAM compared to other media players and it increases the speed a lot, this helps the gaming performance***ASAP (Advance Streaming and Prediction - Although I had a short time to use this feature but I am already in love with it. ASAP allows videos to start playing within a second of clicking play. It learns what shows you like and pre buffers the shows and movies. It gets better the more you use the Fire TV. ***Surprisingly great gaming graphics and performance - I did not expect great gaming performance, but I was wrong. This plays many basic games such as Asphalt and Minecraft flawlessly. It will probably support many advanced games but not as advanced as PS4 or Xbox one would. You can't expect that from a device that costs $100. There are several hundred games available now but thousands more are coming. This is Android based open platform, so there are many possibilities and many more things to come. You will need to buy the $40 controller if you intend to play games on it. I will have to wait until April 8th to try the controller.***Mimo Wi-Fi and Ethernet - This is one of the faster Wi-Fi cards and I no longer have to rely on Ethernet. It also has Ethernet if you desire to use it.***Voice Search - I have used this feature for a short period of time and it is fairly accurate and returns very results quickly. You can search all Amazon movies and TV shows and Apps that are on your device or in the Amazon Market. I searched for \"Person of Interest\" and \"The Big Bang Theory\" and it returned the results instantly. It's as accurate as my HTC One M8 Android phone. You simply say what you want to watch and it will bring it up.***Bluetooth remote - This is a very convenient feature. You don't have to worry about pointing the remote at the device; you can have your Fire TV hidden and still control it. Since it has Bluetooth, it is possible that there might be a keyboard available to use with it soon. A Wi-Fi remote would have been better but this is almost as good.***Optional Controller - The optional controller is a must have if you want to play games on it but it does cost $40. It works flawlessly with all the games***Android Based OS - This is a huge plus because there will be a huge amount of apps coming soon. Android is an open platform and one of the hottest platform right now.***Tons of Apps for multimedia - Many apps such as Netflix and Hulu***Hundred and thousands (coming soon) games - If you are not a gamer but you still like to play some games then this is the perfect solution. If you are like me, you don't want to spend $500+ dollars on a gaming system and hundreds more on the games themselves to enjoy some games. The Fire TV is the perfect fit for me because it satisfies my needs and much more. It also provides a real controller similar to Xbox controller. On another note, Amazon has hired some well-known game developers to develope games for them. So stay tuned.Negatives:***Price - I honestly don't think the price is too high but most people will complain because the gaming controller is separate and costs $40. I think the price is fair based on the amazing hardware that it contains.***No HDMI or Optical Cable included - Many people will complain about the absence of HDMI cable, which I think should have been included. The HDMI cable is a very cheap cable and I think it should be included because you can't use the device without it. Since you will need an HDMI cable to get started, please remember to order one with the device. The optical cable is not a big deal because most people don't use one.***No Infrared(IR) sensor - I can't use my Harmony remote, this might be a big deal for some because Harmony remotes are awesome and now I have to use two remotes.***Limited HD Space/ NO SD Card - After using it for more than a day, I ended up downloading many apps and two games and I only have 3GB left. I hope some kind of update is provided soon to fix the problem and allow external drives.***Headphone jack for the remote should have been added, similar to the Roku 3***Not all functionality is available when launched and will not be- The controller is not available until a week later, the parental control app is coming later, more games are coming later. Also many features such as playing your own media content are not supported natively. I kind of wished they had waited until more of these ready at launch. But it's not a big deal because it already has a ton to offer.***Wish it came out sooner - I spent too much money on other devices.The device itself is very slick and light. It is similar to an external DVD player for laptops, a little smaller. It does not feel cheap, very good quality materials and seems durable. The menu bar is on the left hand side which includes: Search, Home, Movies, TV, Watch List, Video Library, Games, Apps, Photos, and Settings. It is very fast and easy to navigate through. The picture quality is very clear. I use Ethernet cable to connect but I have used the built in Wi-Fi to connect too and the video had absolutely 0 lag. It was very clear and it did not freeze once. There are around 200 apps and games available but Amazon promises to bring thousands more soon and I am sure they will keep their promise. I didn't know how to turn off the device and I contacted Amazon and they told me the device never needs to be turned off. When not in use, it goes to screensaver and after about 30 minutes the led light turns off.Searching for content was very fast and everything showed up instantly. The voice search made it so easy to find what I wanted. I could search for apps and movies in the Amazon Market and it brings it up almost instantly. Netflix and Hulu apps were somewhat slower than the Amazon Instant video. It wasn't a lot slower, just slightly slow enough to make you notice the difference. But I still consider it to be fast compared to anything else that's there. Amazon has little control over performance of third party apps; a lot of it is up to the developer. Very often the apps are updated to fix lagging issues. As I mentioned before I love the ASAP feature. Videos that I searched for played instantly, it predicted what I wanted to watch and very accurately. So I tried to trick it by selecting something at the end of the search results and it wasn't as fast to play but it did play faster than my other devices. It took about 4 seconds compared to the 1 second, but that will depend on your internet speed and connection strength if using Wi-Fi.Overall, there are some downfalls but the other positive aspects of the Fire TV makes up for some of it. I think version 2 should be in the works to address the negatives and to compete with Android TV which should outperform this device. Even with some of the annoyance, it is still the best media player available right now.So what other alternatives do you have?To get all the benefits there isn't any alternatives, especially if you like the complete multimedia experience. If you lean towards gaming more then there are two routes that you can go and spend around the same amount as you would with Fire TV. You can either get a used PS3 or Xbox 360. They are similar in many ways and choosing one would depend on your preference of Microsoft or Sony system. They both provide a good amount of multimedia such as Movies, TV shows and music but they do not present it in a great simple way as the Fire TV does. I will explain the PS3, but Xbox 360 would work similar way. A good condition used PS3 slim costs around $140 on eBay, which is the same price as Fire TV with the controller. PS3 has many of the apps such as Netflix, Hulu, Pandora and other streaming apps. One advantage that PS3 and Xbox have over Fire TV right now (Fire TV may support this soon) is that, you can play your own music and movies that are stored in the hard drive. You can get a subscription for PlayStation Plus for around $5-$6 a month to get access to a good number of free advanced and basic games, Amazon doesn't have a monthly fee. Xbox also has monthly fee for their LIVE subscription. After you get a subscription you can purchase hard core games such as BioShock but they can cost a lot more than Android games. Fire TV has games for average of $1.50 vs. average of $20 for PS3 or XBOX games. But as a result you get a much (a lot) better game from PS3 or Xbox. Remember this solution is only beneficial for moderate to serious gamers who does not have money for PS4 or Xbox One. Over a year you end up spending a lot more than you would for Fire TV and its gaming experience. The monthly subscription and the purchase of game can add up quickly. So as you can see these are very good alternatives, it all depends on if you want a gaming system with multimedia or a multimedia system with games.I do not own a Kindle Fire tablet, so I can't comment on the ability to pause a movie on the tablet and just flick it to the Fire TV. It supports it and it should work easily.I downloaded Asphalt and played it for about 30 minutes using the remote and it played flawlessly. I didn't notice any lag and graphics was good.", "verified": true, "helpfulness": "302/354", "author": "WiseShopper"}]