[{"rating": 5.0, "review": "Love it!!! We are so happy that we purchased Amazon Fire TV!!!!", "verified": true, "helpfulness": "1/1", "author": "Steve Epkins"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "T. Michael Young"}, {"rating": 5.0, "review": "fire tv is a bargain especially if you've got Prime, we love choices", "verified": true, "helpfulness": "0/0", "author": "Richard F."}, {"rating": 3.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have recently terminated my contract with Direct TV and went to a Amazon Prime-Netflix bundle...... LOVING IT!!!  I am saving the $100 a month I was paying for TV and only buying the shows I want to watch.  I will keep telling my friends how great switching over to Amazon has been.", "verified": true, "helpfulness": "2/2", "author": "Rick"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "1/1", "author": "Janet Moore \"Suzi Moore\""}, {"rating": 5.0, "review": "I have been eyeing up Fire TV for awhile now being that I have been an Amazon Prime member for quite awhile now.  For a long time I relied on the smart hub within my Samsung TV to provide my streaming services.  A few weeks ago I finally ordered my Fire TV box.  It works so smoothly and the picture and performance it provides blows away the functionality my Samsung Smart TV was providing.First the setup is very easy. If your a prime member the box will already be registered to your account when you get it. It was just a matter of connecting the box up to your TV and providing power to the unit.  You press any button on the remote to get the setup started. I did have to replace the batteries that was provided in the remote with new fresh ones that I had on hand.  It automatically finds your home network (in my case wireless) and confirm it and lets you provide the security password. It will then check for updates  and it does ask you if you are you.. concerning using your account.  Then it will let you watch an introductory video to the Fire TV system.  Other than that you are pretty much ready to go.The performance of the thing is amazing.  I used to get buffering issues from time to time with the Smart Hub packaged with my Samsung when watching Amazon through it and also really had to refrain from trying to use HD through it.  There are NO buffering problems with the Fire TV.... I can watch HD videos without any problems. The picture is crisp and clear. Great sound.Personally I like the user interface with how the menus are organized and its easy to scroll through the various categories of TV and Movie options.  The voice command function for searches works great for the searches that I have done with it. I really have had no problems with it.Now knowing what I know I wish I would have purchased the Fire TV awhile ago.  It would have saved me a lot of grief from time to time when I was trying to watch stuff through the Samsung.I highly recommend the unit.", "verified": true, "helpfulness": "1/1", "author": "Wade"}, {"rating": 5.0, "review": "Oh goodness me! This is brilliant. Yes the voice command system is better than Siri.", "verified": true, "helpfulness": "1/1", "author": "Robert Newby"}, {"rating": 3.0, "review": "Haven't been able to watch. Apparently my signal isn't strong enough", "verified": false, "helpfulness": "0/2", "author": "John Roush"}, {"rating": 5.0, "review": "With the Amazon Fire TV, In addition to the Amazon Prime movies and tv, you can gain access to HBO to go, Showtime, Netflix and a host of other streaming movie services! The box is small and installation is quick and easy.", "verified": true, "helpfulness": "1/1", "author": "G. Bonner"}]