[{"rating": 5.0, "review": "This has been an awesome purchase for us. Rather than having to continuously hook up our Kindle Fire HD via HDMI cable, this box allows us to access movies and TV shows (as well as other features) directly from our TV.", "verified": true, "helpfulness": "0/0", "author": "jeking1961"}, {"rating": 5.0, "review": "No moew cable for us!!", "verified": true, "helpfulness": "0/0", "author": "Ru2bsi \"Agi Cortez\""}, {"rating": 3.0, "review": "No comments", "verified": true, "helpfulness": "1/1", "author": "Darren"}, {"rating": 5.0, "review": "I ditched my roku after a week. Sure I miss my HBO go app, but I can watch those shows via my laptop.", "verified": true, "helpfulness": "0/0", "author": "Zach"}, {"rating": 5.0, "review": "Great product.  Small and compact, couldn't have been any easier to install.  Love the remote and the voice feature.", "verified": true, "helpfulness": "0/0", "author": "JoJo44"}, {"rating": 4.0, "review": "I just think it's better thin cable, an if you have prime it's even better.you get see what you want , not what they have on today. now if you can put sport on it you good to go.", "verified": true, "helpfulness": "0/0", "author": "Joann clark"}, {"rating": 5.0, "review": "Very gods buy", "verified": true, "helpfulness": "0/0", "author": "Dermo"}, {"rating": 5.0, "review": "Finally decided to get rid of cable. Bought 2 of these which cost about the same as I was paying per month for the television portion of my cable. Wish I had done it sooner. This is so much better. Quality, function, ease of use, all great. I paired this with my existing amazon prime, Netflix, and added hulu. So much better than cable. The wifi built in also made hooking up in living room very simple. Do it, do it now. You won't be sorry.", "verified": true, "helpfulness": "0/0", "author": "J. Porter"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "H. Lugo"}, {"rating": 5.0, "review": "Check out the Amazon Fire TV stick to see if it will meet your needs. Looks to me that you are getting pretty much the same thing for a lot less. Wish I had known the stick was coming. That said, this puppy is smooth. I wanted easier access to the Prime movies and shows than hooking up my laptop to connect through the website. I wish I could access my library more directly and sort my way. It does what it claims,  but $39 for the same thing I paid $99 for is not making me feel good about my purchase.", "verified": true, "helpfulness": "0/0", "author": "daniel"}]