[{"rating": 3.0, "review": "Since I've been an Amazon Prime customer, I've wanted a Fire TV and when a great deal came up last month, I ordered one.  I already have Apple TV, so I can't help but compare the two.  The big plus for Fire TV is that it allows access to all the Prime streaming video choices.However, Fire TV seems heavily weighted toward getting users to use paid videos from Amazon.  I can access my Netflix account, but I had to look for user groups online to figure out how to do that, which required downloading the app to the Fire TV.The interface seems a bit clunky.  Apple TV displays all the icons for the various channels/networks such as HBO Go, Vevo Vimeo, YouTube, etc. Fire TV doesn't and I find accessing the various apps is more complicated than it needs to be.  Even accessing the Prime streaming video isn't seamless.  The easiest way to access anything seems to be with the voice recognition on the remote, which works really well.Also, although Apple TV and Fire TV are connected to separate HDMI ports on my television, I have to unplug Fire TV to use Apple TV.  Fire TV doesn't seem to play nicely with other streaming devices.So, I like my Fire TV with reservations.", "verified": true, "helpfulness": "1/2", "author": "Patti Almonte"}, {"rating": 4.0, "review": "Well,its ok, but to be honest it is not as user friendly as I had hoped.Speaking into it is a challenge, because it does have trouble understnading. I speak perfect english. It reminds me of Siri on my smartphone,which was why I did hesitate. But I watched the video, & thoght it would be ok. It takes some gettig used to as any new tech gadget does,& I am clearly not real tech\"savvy\". But I will say that I LOVE how it streams my photos! & I love Iheart radio app.", "verified": true, "helpfulness": "0/0", "author": "gardengnome"}, {"rating": 5.0, "review": "Great product.  I have Apple TV as well but this product has alot of great content that Apple doesn't.  It is a must have for Amazon prime customers.", "verified": true, "helpfulness": "0/0", "author": "Jason Spicer"}, {"rating": 5.0, "review": "My fifth one.", "verified": true, "helpfulness": "0/0", "author": "Lothario"}, {"rating": 5.0, "review": "Great product! I hate voice activated options normally, but I was shocked how good this one was. very accurate!", "verified": true, "helpfulness": "0/0", "author": "Christina Guzzi"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Debra Ghostone"}, {"rating": 5.0, "review": "Awesome device.  I love how I can install other apps to it that aren't included in the app pages. I can add music, photos and videos from my phone and display them right on the TV for my friends and family. It connects to my phone and tablet making things so much easier.", "verified": true, "helpfulness": "0/0", "author": "Xeene"}, {"rating": 5.0, "review": "I very much enjoy my Fire TV. But the only so far that I dislike is that Comcast whom is my cable and internet provider so far does not support Fire TV HBO GO & Show Time. That is my disappointment. With Prime I am able to watch a lot of movies and shows free. I will not say that it is free but with the membership it is affordable. Having Prime has it's pluses on ordering off of amazon 2 day delivery if it has the prime written beside it, music, books and movies. Not a one time membership. Have to renew membership once a year like you would Cosco. Good deal if you have internet. That is a must have. Enjoy......", "verified": true, "helpfulness": "1/1", "author": "Toots"}, {"rating": 4.0, "review": "The first two units were defective and I had to send them back, lets hope three times is a charm.", "verified": true, "helpfulness": "0/0", "author": "david martini"}, {"rating": 2.0, "review": "According to the specs on FireTV, this unit can stream up to 7.1 surround sad.  That is NOT true as Amazon does NOT support 7.1 surround sound with the FireTV.  I ordered this because that was an option I definitely wanted (I have a 7.1 surround sound system).  When I couldn't get this to work, I reached out to tech support and was emailed....\"I'd like to inform you that at this time, 7.1 audio is not available with Amazon Instant Videos.  I'm sorry\".I was also disappointed in the lack of FREE titles available to Prime members.  There are few out there (unless you are looking for a very old title or, for myself personally, a program that wouldn't interest me at all).  Movies and TV shows I would want are \"pay per episode\" or \"pay per season\" and those costs are not affordable for me.  A prime example - Damages (which seasons have passed years ago)..Now, the only reason I didn't give it 1 star was for the voice command.  That feature worked PERFECTLY right out of the box.This product has been falsely advertised and marketed as having a capability it does not.  I have lost a great deal of faith in Amazon and their products due to this situation and my experience with their tech support.  Because of that, my Prime Membership will not be renewed on May 3rd.  I'm just really disappointed in Amazon at this point.  After years of continued business I have always been extremely impressed with their wonderful customer service and support.  This instance was a complete FAIL and has left me with a bad taste in my mouth.", "verified": true, "helpfulness": "0/1", "author": "Luv My Pups"}]