[{"rating": 5.0, "review": "I used to have a sony system that I enjoyed when I was on Fios.  When we connected to UVERSE with ATT it could not interface.  After learning how to link my kindle to my tv screen, I had enough confidence to try this product.  It was easy to set up and I love it.  Works Great.", "verified": true, "helpfulness": "2/2", "author": "angeltoes"}, {"rating": 5.0, "review": "I really like the Amazon fire due to the voice command and ease at which it sets up with our television. I will be purchasing more of these for some of our other TVs real soon! Outstanding product!", "verified": true, "helpfulness": "1/1", "author": "Anthony J. Rankins"}, {"rating": 5.0, "review": "This is the best of the media-streaming devices.  I've used most of them, and I prefer the ease of use of the Fire TV to the other brands.  The voice search works well, too, and the library is very good.", "verified": true, "helpfulness": "2/2", "author": "jffielde \"jffielde\""}, {"rating": 3.0, "review": "If/When the voice search function works in Netflix, I'll be ordering one.  Until then, while the speed and smoothness is appealing, I can't justify buying one.", "verified": false, "helpfulness": "2/9", "author": "Amazon Customer \"rocket_scientist\""}, {"rating": 4.0, "review": "I would really like if the voice control worked for other applications like Netflix.  Plus, there is no way I will be spending 40 dollars on a gaming controller unless there are some better games available.  I really hope the game choices get better quickly.  I also wish there was an option to search only through the free material.It works great otherwise, though.  It's extremely fast and responsive, the voice control makes it very quick to get to any show or app, and I love the screensavers that come up, especially when just listening to Pandora.  Also, it's nice that pressing a button to power on the FireTV turns on the TV as well.  I think the fact that it's portable makes it worth the buy even if you do have consoles and smart TVs that do the trick.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Incredibly small and may be the most simple device I've ever used or installed.  The packaging alone is really impressive!  Drop the other guys and go for this one.  Love the voice activated search, they really have it down.", "verified": true, "helpfulness": "1/2", "author": "James Cox \"Jimc\""}, {"rating": 4.0, "review": "Pro: Setup is simple. Con: takes 3 or 4 minutes to download software and updates longer than Roku. Con: the Channel Store is extremely limited compared to Roku. Con: it does not have earbuds like the Roku 3 nor a volume control on the remote. Pro or con: (depending on your POV) it does not have porn channels like Roku does in Private channels. In fact, I could not find any private channels at all. Con: it does not have a wriststrap like the Roku does. Pro: it have an introduction video that shows you how to navigate. Pro: it offers many more games than Roku does. If it had earbuds, a wriststrap and private channels I would have been totally satisfied", "verified": true, "helpfulness": "1/3", "author": "Rey Solis"}, {"rating": 5.0, "review": "Very nice. When you start a video it starts up almost instantaneously.This box replaced my media computer and im very happy with it.", "verified": true, "helpfulness": "0/2", "author": "Pablo Escobar"}, {"rating": 5.0, "review": "Small but mighty. Sets up easily and voice control works great. A lot to offer on screen. So far ,experienced no problems.", "verified": true, "helpfulness": "2/3", "author": "Christopher D. Bracke"}, {"rating": 2.0, "review": "As mentioned in other reviews, be aware that the audible search steers you to amazon content.  What this means is that if you have netflix and you seek a movie available to you for free via voice command, your search will pull up amazon's version. The movie may not be on prime which would mean you would believe that you have to pay to see it, not realizing that a separate search on netflix would be necessary to find your free version.  On top of that there is often a $3.99 HD version up front and you have to click thru to realize there is often a non hd $2.99 version available.  As a costumer, not happy with these corporate tactics that seem to \"nickle and dime\" its own members in a sneaky way.On technical side my box has issues. At times stops to \"load data\"  every 10-20 secs.  although box is hard wired via cat 5 to cable modem.  At same time i can pull up same show on tablet via wifi and watch with no interruptions. Tried one pay per view and would not load, received message \"verifying pin\" and would go further.  Called and amazon help refunded cost of movie and is sending replacement unit.  until then....", "verified": true, "helpfulness": "5/10", "author": "Yasanthi Alahendra"}]