[{"rating": 5.0, "review": "Amazing productJust love itSpecially you can talk.and order videoVery happy with the purchase", "verified": true, "helpfulness": "0/0", "author": "Ayesha Pervez"}, {"rating": 3.0, "review": "A lot of stuff but not a whole lot we have not already seen on cable.  Not sure how this makes tv any better and now we have had it for a few months we do not even use or think about using this.", "verified": true, "helpfulness": "1/1", "author": "Michael Derflinger"}, {"rating": 3.0, "review": "This little box has a lot going for it.  I got it on the cheap from Staples and was immediately impressed by the interface and how snappy the unit operated.  After having it for a month or two now I can't help but disappointed in a lot of things though.  For one Amazon needs to light a match under developers and get some updates to their apps.  For example Netflix is using a last gen interface.  Even my Vizio \"smart\" TV has the updated interface which in my opinion is better.  Plex doesn't support 5.1 audio...a big minus and per the Plex dev team it is due to Fire TV's OS.  Hulu is somewhat sluggish and shouldn't be on a machine with these specs. HBO Go...nowhere to be found. I get it that it may be on its way but when my Xbox One is getting channel after channel (FXNOW, FOX now, Plex with proper support) and my Fire TV which is supposed to be media focused is so far behind I can't help but have some buyer's remorse.  I ditched my Roku for this box and in many ways I kind of regret it but I know Amazon will come through and make this box magic...it just isn't right now.", "verified": true, "helpfulness": "1/1", "author": "Wil"}, {"rating": 5.0, "review": "The best.", "verified": true, "helpfulness": "0/0", "author": "sclare"}, {"rating": 5.0, "review": "Greatest platform for all my viewing needs. Netflix, Amazon Prime Video, WWE", "verified": true, "helpfulness": "0/0", "author": "matthew patrick"}, {"rating": 5.0, "review": "I have to admit, I was kinda shakey on it at first!  It really is a great little box.  It doesn't take up much space and the movie quality is excellent.  I hope this will help someone who's on the fence about this little device, it's really, really worth it!  Thanks", "verified": true, "helpfulness": "0/0", "author": "C. Carter"}, {"rating": 5.0, "review": "I  recently received the Amazon fire tv as a gift.  And the Amazon fire tv is worth every dollar spent.  I definitely recommend it", "verified": true, "helpfulness": "1/1", "author": "Chris T. Brennan"}, {"rating": 5.0, "review": "I had a RoKu 3, and I didn't think that anything could come between that love...until I was introduced to Amazon Fire TV. It was love at first sight, and love at first sight can be misleading, so I waited until I turn her on and  because, I'm  already a  Amazon Prime member, she was ready to go, there was no website to visit and no codes to enter. First, I looked around and them we watch a few of my favorite TV. shows, them moved on to movies, I search the internet and listened to music in the cloud. It's been the best time ever. If i had to find something wrong, I would say that the small issues lies with the remote control, I do wish that it had a strap and there needs to be some ridges in the indent located in the back where the batteries. I recommend this item.", "verified": true, "helpfulness": "1/1", "author": "Loyal Amazon Customer"}, {"rating": 5.0, "review": "We love it!  Very cool TV experience.", "verified": true, "helpfulness": "1/1", "author": "Clarity H."}, {"rating": 5.0, "review": "LOVE IT. Another awesome amazon product. We cut cable because we don't need it anymore with this.", "verified": true, "helpfulness": "0/0", "author": "Lawless"}]