[{"rating": 4.0, "review": "I like almost everything about the Fire TV. There is just one thing that is disappointing. The MLB.tv app, that I dearly wanted to be able to use wireless, will not work properly. I consistently get \"buffering\". I checked the Amazon site for others that may have found the same issue and had a solution for it. There is no solution. I don't know who developed the app, but it fails terribly on the Fire TV. The app works on my PC and on my iPad perfectly and is completely wireless. I had to hardwired from my broadband router to the Fire TV to get it to work. Lucky that my router wasn't too far from the Fire TV, otherwise I would have had to return the Fire TV and missed out on all of the other really good applications.", "verified": true, "helpfulness": "0/0", "author": "William J Bridges Jr"}, {"rating": 5.0, "review": "We love it! Works perfectly, may buy it again for downstairs tv.", "verified": true, "helpfulness": "0/0", "author": "Me"}, {"rating": 5.0, "review": "If you don't own this, WHY?  Set-up is mindless and completed in minutes, operation can be performed by almost anyone.  I use Fire TV much more frequently than Apple TV and if I had it to do over, would not even have purchased Apple TV.  GREAT investment!", "verified": true, "helpfulness": "0/0", "author": "Tom Chamberlin"}, {"rating": 4.0, "review": "Love the movies and tv shows and all the Apps.", "verified": true, "helpfulness": "0/0", "author": "Nubia"}, {"rating": 5.0, "review": "Great choice", "verified": true, "helpfulness": "0/0", "author": "Alexandru andrei Dumitrescu"}, {"rating": 5.0, "review": "This thing is amazing. Very fast speeds, connects easily wireless or wired to my WiFi and has great picture quality. SlingTV works on this device too for live TV feeds.", "verified": true, "helpfulness": "0/0", "author": "tobybossard"}, {"rating": 5.0, "review": "This tv box is probably one of the best and most powerful.", "verified": true, "helpfulness": "0/0", "author": "J John"}, {"rating": 5.0, "review": "The best thing since sliced bread!!!", "verified": false, "helpfulness": "0/0", "author": "Christopher Payne"}, {"rating": 3.0, "review": "When I set it up it never gave me instructions on setting up prime or even a free preview offer which I thought it would.  I use it for Netflix which is great but so far that is all I use it for.  If you have a free preview offer I would love to try it out to see if it is something I would sign up for.", "verified": true, "helpfulness": "1/1", "author": "Stephen Perez"}, {"rating": 5.0, "review": "good product.  Easier to use than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Marshall F Simmons"}]