[{"rating": 4.0, "review": "Like the new content - pilots. When are you going to do new episodes?", "verified": true, "helpfulness": "0/3", "author": "Michael Allan Scott, Author of the Lance Underphal Mysteries \"Michael Allan Scott\""}, {"rating": 1.0, "review": "Amazon Fire TV box sucks period!!!! I have gone back to the ROKO3  because the streaming stops all the time! And its not due to a slow connection speed! I have 100MG and ROKO works great Fire Sucks PERIOD Dont buy this product!!!!!!!", "verified": true, "helpfulness": "1/15", "author": "Bobcat"}, {"rating": 2.0, "review": "I have seen the Fire TV in action at friends, but I have put off getting one for myself because it does not seem to able to be controlled via an IR based universal remote control. I don't want to be forced to use the Fire remote and my main remote (which controls everything in my system, including the lights). The voice function is cool, but I would like to use my system remote for basic functions like pause, fast forward, rewind, etc. for most operations. Most people I know want one remote to operate the basics, and hate having 2 or more remotes on the coffee table. Let me know when you will add IR control, and I'll buy one.", "verified": false, "helpfulness": "1/6", "author": "Max"}, {"rating": 4.0, "review": "its good yes, but it doesnt have hbo go which is all i need... :P", "verified": false, "helpfulness": "0/5", "author": "Nick"}, {"rating": 5.0, "review": "This is the one. No, I haven't tried any of the others, but why mess around? I knew that if I hated it, Amazon would take it back in a heartbeat. We do netflix, youtube, mlb.com, espn, hulu, crackle. Awesome voice search. Always, always get what I've asked for and it's quick. We did have a little blip involving removing parental controls and moving residences to a new wifi. I got locked out. Called Amazon. They shipped a new unit, it got here THE NEXT DAY, and I printed a label and reused the box to send the old one back. Do it. Push the buy it now with one click button. You won't regret it.", "verified": true, "helpfulness": "1/2", "author": "mberwise1"}, {"rating": 5.0, "review": "Easy to set up, very fast streaming. Amazon should expand streaming library for its Prime members.", "verified": true, "helpfulness": "0/1", "author": "farshid"}, {"rating": 5.0, "review": "Since purchasing the Amazon Fire TV (AFTV) I've actually started using my Prime and Netflix memberships for viewing TV and Movies more often. It is so quick and smooth! Much much better than my Roku 2XS. I was never happy with the Roku interface and slowness.The AFTV remote is bluetooth, so I cannot use my Logitech 650 remote, that is a downside. That said though, the remote does feel nice in my hand and is simple and user friendly. I do wish it had an information button that would allow you to see the Time and a description of what is playing.I'm very happy with this product and highly recommend it.", "verified": true, "helpfulness": "3/3", "author": "Brian"}, {"rating": 5.0, "review": "Simply, but seems to do most everything. I recently purchased 2 more to use throughout my house. Works great with Harmony remotes as well. I've recommended it to hundreds of friends and coworkers.", "verified": true, "helpfulness": "1/1", "author": "Christopher Crone"}, {"rating": 1.0, "review": "I'll admit since it arrived 6/25 I wasn't able to try it out for almost 2 months due to personal issues; however, since I started trying to use it in the past 2 weeks, I've had nothing but trouble.  I have a green screen & everything that comes up is either green,pink or a blend of those colors -- start up screen to movies, etc. are NOT watchable.  I have tried everything suggested in the help section; however, it's really difficult to find ANY form of help beyond the pat answers printed on the help page -- & none of that addresses my problem.  I did finally click on the \"instant help\" that can be found in the settings area; however, when it comes up you'll see that if the problem is solved, you'll be charged $36 or more for the help & I am outraged at this!  How dare Amazon make me pay for help getting an Amazon product  I've bought in good faith thinking they stand behind their products!  I refused & finally called Kindle Support & as always, they are great.  Took my problem seriously, got me to someone who could help & lo & behold, they've never encountered this green screen problem!  The young man promised he'd either have some Fire TV find a solution within 2 days or they'd replace the Fire TV & I believe he'll do as he promised -- I sincerely hope so.  Bottom line I'm really wishing I'd gone with Hulu or checked another brand, but IF they can get it working correctly I'm sure I'll love it the way I have my other Amazon products -- we shall see.", "verified": true, "helpfulness": "4/7", "author": "Riverrat \"riverrat\""}, {"rating": 5.0, "review": "We love our Fire TV! We have been using it for about 4 months now. I have never owned Roku/Apple TV/whatever else is out there, so this was a first for me. We are now able to access Prime Video, Netflix, MLB live, etc all on one device. Speed is great! Takes no time at all to load a video or show (versus getting content via our BluRay which took forever.) Anyone who wants to access their Prime content should definitely get the Fire TV.There are only two things that I am not happy with: 1 there is no Vudu app, and 2 no HBO Go app :(", "verified": true, "helpfulness": "5/5", "author": "Desiree"}]