[{"rating": 5.0, "review": "I finially cut off cable and it was the best decision I EVER MADE. WE LOVE our FIRE TV. With Amazon Prime and Net FLIX we have soooo many more choices of stuff we actually want to watch than the packaged crap that cable offers. The only draw back is that you will have to wait to see a current season of your favorite show...but on the upside ...you get to see the season all at once. I am saving more than $60 bucks a month by not having cable (that's $720 dollars a year). A basic cable package plus internet was costing me $180 a month....$2160 a year! Now I have my internet cost, Amazon prime, net flix and hulu plus...all this combined is sooooo much cheaper than a basic cable package.", "verified": true, "helpfulness": "0/0", "author": "Sherry"}, {"rating": 3.0, "review": "Streaming stops numerous times during a movie.", "verified": true, "helpfulness": "0/0", "author": "Ann F."}, {"rating": 5.0, "review": "Dang good product", "verified": true, "helpfulness": "0/0", "author": "Stephen Wilson"}, {"rating": 1.0, "review": "I have three Apple TV's that I love, other than I can't get Amazon Prime on them.  I purchased The Amazon Fire TV Stick, because of the price $19.99, and the ability to get Amazon Prime on my TV.First off, the power management on this thing is terrible, I had to rearrange all of my HDMI ports on my TV, because of this poor design, it had to go to the top port because the power wouldn't plug in with other cables above it.Secondly the interface and OS is not reliable, it spontaneously rebooted twice and hung once in the first 15 minutes of use.  This was after the install of the updates to the OS.The playback of the Prime video worked fine, color was good.The ESPN application colors were terrible, and the video was jerky, I know this is live stream but on my Apple TV's the color is great and the video is smooth.The Plex app is not functional, I can't even get 30 seconds of video without it hanging.I really hope that they get this updated to where it can be used for more than just Amazon Prime.It is worth the $19 price tag, but there is no way I would pay $49 for it.", "verified": false, "helpfulness": "1/7", "author": "JeffHaddon"}, {"rating": 5.0, "review": "Delivery was fast.  Wireless setup was easy and painless.  Unit works as advertised, very easy to understand setup video.", "verified": true, "helpfulness": "0/0", "author": "Chuck Zelle"}, {"rating": 5.0, "review": "My cable bill was astronomically high once the deals expired. I bought Amazon Prime and Hulu Plus for a year for less than what my cable costs for a month!! Love it. Incredibly easy to hook up and navigate.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 2.0, "review": "Overall, this is a solid device.  Basically, an Apple TV clone but with a better remote.  Access to Amazon Instant Video, which is on almost every home theater device (blu-ray players, smart TVs, etc.) nowadays so not a clear need to have it, except that it also gives you access to your Amazon music (both free Prime stuff and songs/albums you've purchased).  If you don't have/use Amazon music, then you really don't need this device.  The voice search on the remote works reasonably well.What it lacks:1. Bluetooth support for 3rd party hardware, namely keyboards.  So you're forced to use the remote rather than be able to use a bluetooth keyboard to search for stuff.  Apple TV does support bluetooth keyboards.2. IR sensor and therefore lack of full/complete support for Harmony remotes.  If you have more than 2 devices you really should use a Harmony remote to simplify your user experience, but unlike Apple TV, there is apparently no IR support on Fire TV.  Oddly, my Harmony Ultimate One remote is able to control a lot of menus in Fire TV but is not able to activate it from an off state (like it can with Apple TV) so you need to turn off screensavers in order to use the Harmony Ultimate One remote to control the Fire TV.3. Auto off/sleep.  Unlike (again) Apple TV, this device will stay on continuously unless you go to the settings menu and manually put it to sleep.  Odd and annoying, but not a big deal if you use a Harmony remote (see #2 above).4. Ability to dim/turn off that super bright LED light on the front of the device.  You can't turn off/dim the light in the Apple TV either but at least that light is much smaller/dimmer and not as distracting as the light on the Fire TV box.In summary, this is an okay device that really only adds Amazon music if you already have access to Amazon Instand Video on one of your other devices (and all my devices have it except, of course, our Apple TV).  I'll keep it since I do have a bunch of music purchased from Amazon but otherwise I would have returned it as it is in most ways inferior to Apple TV and redundant to the apps found on almost all home theater/media devices.", "verified": true, "helpfulness": "0/0", "author": "Impetigo"}, {"rating": 4.0, "review": "It works fine for me.", "verified": true, "helpfulness": "0/1", "author": "reviews 4 free \"cover2cover\""}, {"rating": 1.0, "review": "This box is not performing at the level that it should be considering all that it possesses inside. I have returned one in hopes that the problem was just that one box, but unfortunately the second one that they sent me has all the same problems. Both of them left apps running in the background and thus overworking the ram memory. After running multiple apps, at seperate times of coarse, like hulu, netflix, twitch, mlb, nba, twit, vevo, youtube and amazon instant are my constant regulars, when returning to one later on they wouldn't load they would just open where i left off. Over time after opening enough apps it just begins to fail to play video. This happened repeatedly with the message \"cannot play this video\". Worst of all it would happen to hulu, netflix, and amazon mostly. To get this not to happen i would have to go into the settings and go to the applications section and manually start to \"force quit\" the apps that had been used. And of coarse i could unplug the thing and that did the same thing, but none of this should have to be done. Also when going into each app i found that certain apps would begin to build up a very large cashe. 4 to 5 times the size of the app sometimes.  I also own three roku 2s & a apple tv, none of them do this. They actually have a reset inside the main menu that basically does a refresh. The fire has a \"factory reset\" witch will fix the problems but also removes ALL settings!  I really wanted this thing to work for the gaming aspect alone. Yes i ordered the controller to witch is nice. Ive been on the phone with support and mentioned the possibility of a software update to fix these problems but they didnt really have any answers.  I actually dont know why if thats really the problem, then that means there should be many others out there with the same issues and i would have thought by now there would have been a fix sent out.  Wish i would have just upgraded to a roku 3!", "verified": true, "helpfulness": "18/18", "author": "Gary Tilse"}, {"rating": 5.0, "review": "I like the Amazon Fire TV, It works great, its easy to use, it comes in beautiful....it looks beautiful.....Very sleek looking. I have two of these and a Ruku2 they both work well, but I prefer the Fire TV...............", "verified": true, "helpfulness": "0/0", "author": "Bmac20"}]