[{"rating": 5.0, "review": "Only been using the Fire TV for a few days but am already impressed with the functions - My 5 year old grandson did order something (not sure how he did it) but was able to cancel the unwanted order - Access to all my Amazon content is excellent", "verified": true, "helpfulness": "0/0", "author": "Colorado Hi"}, {"rating": 4.0, "review": "Lot of apps but still missing some.  Would like to see MaxGo, StarzPlay and many of the other cable apps.", "verified": true, "helpfulness": "1/1", "author": "DS"}, {"rating": 5.0, "review": "Simple and clean interface.  Voice controlled remote works very  well. System is extra fast. We have apple tv,  roku 3, and chromecast in addition to this, and this is my husband's favorite.", "verified": true, "helpfulness": "0/0", "author": "clp"}, {"rating": 5.0, "review": "The Fire TV is great. I love it, from the tv shows, to movies, to music we found this a great asset to entertainment in our home. It's easy to set up, easy to use and is so enjoyable. No commercials just pure entertainment, a great invention!", "verified": true, "helpfulness": "0/0", "author": "Diane Faris"}, {"rating": 5.0, "review": "Everything we wanted this to be.  Excellent choice of movies and tv shows. Movies organized and easy to find.  The music  is also a nice addition but I would like to suggest one thing concerning the shuffle option:  it only applies to shuffling  songs within individual albums and I would like it to have an option to shuffle all of your songs off of all one's available albums. Other than this,  my husband and I love this!", "verified": true, "helpfulness": "0/0", "author": "Kathy R. Tornatore"}, {"rating": 5.0, "review": "I love it. It make my TV have more options.", "verified": true, "helpfulness": "0/0", "author": "Bruce Fickel"}, {"rating": 4.0, "review": "Wonderful product! The voice search is amazing! However the app selection is less than one of its competitors.", "verified": true, "helpfulness": "0/0", "author": "Curt"}, {"rating": 5.0, "review": "Amazon Fire with the voice activated remote is everything I hoped it would be.  I'm a huge Apple Fan and own an Apple TV as well.  But as a prime member with all the free content I use the Fure twice as much!  Easy menu and the voice remote is the best!", "verified": true, "helpfulness": "0/0", "author": "guppy"}, {"rating": 5.0, "review": "We're really enjoying all the features. Much better than Netflix.", "verified": true, "helpfulness": "0/0", "author": "Bernie Valencia"}, {"rating": 5.0, "review": "too many benefits to list, will take months to experience them all", "verified": true, "helpfulness": "0/0", "author": "johnk 0418                                                                                            johnk0418ndle Customer \"JOHN\""}]