[{"rating": 1.0, "review": "One thing I noticed and don't like about fire tv. It's ASAP predictive streaming is causing bandwidth caps on my ISP (mediacom). I Noticed it when I called direcTv about on demand programming malfunction that started happening a day after installing fire tv.  Directv came out, checked all signals and claimed the reason my download on demands were failing was slow internet speeds, I.e., mediacom had started capping my bandwidth due to excessive HDTV downloading.  This after years of no problems.  Traced back to what I had just changed--the addition of the fire tv!---and figured it was that ASAP predictive streaming downloading what it thought I would want to see next was downloading hd content all the time.  So I unplugged the fire tv just to check.  Sure enough the problem went away for my directv genie box a couple days later (when the temporary bandwidth cap was removed).  So now I just unplug  the fire tv every time I'm done using the fire tv.  Works-but a pain in the keyster.  What is needed is the ability to disable the ASAP streaming.  Until they provide that option I give it only one star.  Otherwise, I love it.  We also have amazon prime and I have a kindle fire hdx that I can mirror on the fire tv. So fire tv is a great fit. Just wish I didn't have to unplug it every time or not use directv on demand downloading in the background.", "verified": true, "helpfulness": "5/8", "author": "hawtdawg"}, {"rating": 4.0, "review": "Love it fun to play games and movies are great. But no Amazon Cloud Music. But overall I would recommend it to others without a doubt. Just want my music.", "verified": true, "helpfulness": "1/1", "author": "C.Chapman"}, {"rating": 1.0, "review": "Wait for the next generation of this product because there are serious flaws.1.  No power off button.  You must unplug the unit to disable it.2.  Even though an item is offered by Prime, you must know exactly how to get it that way under \"other purchase options\" or they will charge you.3.  My very first time trying it, it lost the signal on a streaming video (one hour) halfway through.  I continued watching the video one I got up and unplugged the Amazon Fire and used my smart TV's system.  It didn't lose the signal.4.  I have not tried accessing my video library via Amazon Fire but I am sure it will try to charge me for movies already bought if I'm not careful.5.  Even though Amazon now features a music player (formerly the Cloud Player), you can't access it from this system.I repeat:  Wait for the next generation of this system.  This one is annoying crap.", "verified": true, "helpfulness": "5/16", "author": "Ellen Anthony \"author\""}, {"rating": 1.0, "review": "Amazon Fire TV does not work!!!  It stalls out, despite multiple calls, Amazon will not rectify. We have never been able to watch more than 10 minutes of uninterupted TV. This product does NOT work!!!! Do not purchase this product.", "verified": true, "helpfulness": "3/13", "author": "Chmadre"}, {"rating": 5.0, "review": "I've been streaming video in my house for many years -- way before they had devices like ROKU, Apple TV, etc.  I've built my own custom media appliances to stream video, show pictures, and listen to music on my TV.Most recently, I had been using a mixture of various devices around the house.  As soon as I saw the Amazon Fire TV was available for pre-order, I ordered it, and within days it had arrived!It took only a few minutes to hook up, and it was already configured to my Amazon Prime account when I turned it on.  Within seconds of turning it on, I was streaming video from my Amazon library, and Prime Movies.It is very fast!  Over twice the speed the fastest device I had been using.  The voice-search is incredible, and the kids thing that is the neatest thing ever!  I have no complaints.  All of my apps, such as Plex, NetFlix, Amazon Instant Video, Pandora, etc., all work great.I'm planning on replacing the other 2 media player devices with Amazon Fire TV's very soon!", "verified": true, "helpfulness": "5/5", "author": "Amazon Customer"}, {"rating": 4.0, "review": "But the main thing i was expected was voice search on youtube. Voice search does not works for youtube. This is very bad :(", "verified": true, "helpfulness": "0/2", "author": "Soso"}, {"rating": 1.0, "review": "The power plug has to be unplug and plug back in almost every time to get it to work right, then you have to wait for it to reboot.I have a DSL-1 phone line from AT&T; for internet connect that is not always fast enough for HD movies, so you have to wait for it to buffer more content make it hard to keep up with the move.", "verified": true, "helpfulness": "5/20", "author": "Jesse L. Holmes"}, {"rating": 4.0, "review": "Ordered it and got it.  Hooked it up to my HTS receiver and LAN without any issues, watched the intro and did some setup.  The picture is nice once I set it up for 1080p.  The sound, once I set up Dolby, is nice also.Am an Amazon prime customer, so got this to take advantage of the prime content.  Noticed that some of the content has a \"Prime\" tag, but when I click on it, it has a cost attached.  ????????  Can you assume that if it has a \"Prime\" tag, it comes with the membership, or is there a cost for everything?  Looked for this information, but couldn't find it.  Don't want to try it and get a bill.Would be nice if it were clearer on what was free to Prime members and what was extra cost.  Would be nice if you could also search for \"Prime\" content and ignore at cost content.Maybe someday..........Have watched a couple of things, now that I know I won't get a bill.  Works well so far.  No streaming issues yet on my Comcast provider internet.  I have both F/O and HDMI hooked up to my HTS receiver, so no lip sync issues I have heard about when using HDMI only.", "verified": true, "helpfulness": "1/2", "author": "Oldfart48 \"Oldfart48\""}, {"rating": 5.0, "review": "I don't own a dvr so this has allowed me access to many movies, documentaries and TV series.  I would definitely recommend this device.", "verified": true, "helpfulness": "0/0", "author": "Mary Ann Woolsey"}, {"rating": 3.0, "review": "I have a Kindle Fire HD, a Vizio TV with Amazon built in and a Fire TV, all three have access to Amazon Prime, and all of the other Amazon features for Movies and TV shows. However, all three run on different programs and do not give the same choices.Amazon TV seems to be limited in what it offers on the home screen. I get more choices off my Vizio app.It also mixes your library. With the Kindle fire and the Vizio app, my TV and Movie Libraries are separate. With Amazon fire TV, they are all mixed together.I like the voice search, but some uniformity among the various devices would be nice", "verified": true, "helpfulness": "1/1", "author": "Michael"}]