[{"rating": 4.0, "review": "I purchased the Amazon Fire TV, when it was delivered I unpackaged it and installed very easily.Set up a few things and everything seemed to work Great.  Next day it wouldn't wake up...Called Customer Support and they promptly apologized for the inconvenience and sent me a replacement.  This was on a Friday night after 9:00pm and they were able to get me a replacement promptly on Sunday... I was very impressed with this service.Hooked everything up and all worked fine..... I tried it the next day and was still working :).Very Happy with it so far.", "verified": true, "helpfulness": "0/0", "author": "Wayne H"}, {"rating": 3.0, "review": "I thought Netflix would be included in the purchase price.  I had to pay to purchase the app.  Most other details were accurate, not quite as easy to install as I would have liked, but it could have been my TV.  Mostly happy with the purchase, and it saved me the purchase price the first month over cable TV", "verified": true, "helpfulness": "0/0", "author": "Martha Bradshaw"}, {"rating": 1.0, "review": "It worked for a couple of hours but now it won't turn on. Im very desapointed with the device, it seems to be good but I got a defective device which wont work at all. I've bought some new HDMI cable but the problem realy is the device", "verified": true, "helpfulness": "2/4", "author": "Guilherme"}, {"rating": 5.0, "review": "Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Suzanne Hawkins"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 5.0, "review": "I love that I can put \"popcorn time\" and \"showbox\" on it. Playing Clash of Clans on the big screen is kind've fun as well.", "verified": true, "helpfulness": "0/0", "author": "J. matta \"Your Daddy\""}, {"rating": 5.0, "review": "I love this device. I have a guest house in back of my property, The Internet connection is so slow on my Panasonic TV and Blue ray player, I could not stream movies or listen to music. The content was always buffering, meaning stopped. I got the Amazon Fire TV and the dual internet antenna is AWESOME, what a difference it made. No more buffering on any site I use it on.The Internet connection is super fast allowing uninterrupted listening and viewing. The sound quality is amazing, there is so much more bass response and clarity than my two Panasonic devices that have Amazon access in sub menu. THe connectivity is so easy and the voice remote is so simple to use. The voice command is really cool and easy for searching for movies or music. It came preloaded with Netflix, Hulu, Pandora and  over 20 more streaming programs. I am very happy with this.", "verified": true, "helpfulness": "0/0", "author": "A. Bell"}, {"rating": 5.0, "review": "Works very well.  No difference from the one I bought new.  I would now probably get a Fire Stick as I have had good luck with one in a guest room which lacks a cable connection.", "verified": true, "helpfulness": "0/0", "author": "William W Pendleton"}, {"rating": 5.0, "review": "sweet", "verified": true, "helpfulness": "0/0", "author": "A. Rahman"}, {"rating": 4.0, "review": "I was pleasantly surprised with the ease of operation of Amazon Fire TV. Before purchasing the device, I would connect the Kindle Fire directly to the T.V. with mixed results, mostly a black screen (a very poor connector from the Kindle to the T.V.). With that said, I am not really a fan of \"streaming\". I truly prefer recorded media—then, when I buy a DVD, I own the product. However, space has its limitations and studios are happy to get away from disks and control their content.  Now for my disappointment: Amazon Prime's freebies—some \"free\" movies I bookmarked for future watching ended up being priced by the time I got to them a few months later. For instance, the 1973 sci-fi film \"Soylent Green\" was free a year ago, today it costs to view it. Why? I don't like how Amazon changes some titles from free to paid viewing, at a whim. Frankly, as I've learned, the best (and most popular) titles on Amazon prime are never free. I think the monthly fee should include all content. So, I am using Amazon less and Netflix more now. Sorry, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Dr. Morbius"}]