[{"rating": 4.0, "review": "We got for a third room. We were used to using our Xbox 360 and Playstation for viewing netflix and other video services. I like the box and it's ease of use however, I am disappointed in the limited access to different apps. We use Vudu quite often, and despite people answering that it was available it is not and hbogo was added but it has limited cable providers and ours (Charter) is not one of them so we can't use it for hbogo. Hopefully Amazon will add more access in the future.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Killed my cable bill, now i just have to worry about the internet cost.", "verified": true, "helpfulness": "0/1", "author": "Julian Oliver"}, {"rating": 5.0, "review": "Lots of free filmsSome you will eventually have to payThanks", "verified": true, "helpfulness": "1/5", "author": "yvon lavoie"}, {"rating": 5.0, "review": "We are loving Amazon Fire! We miss a couple of shows I can't seem to get now, like Gravity Falls, but most of the others are available thru Hulu, etc. But the voice remote works great, the streaming is effortless and it's very fast. Absolutely frustration free. I bought the game bundle, since it was the cheapest way to get the controller. My kid has been thoroughly enjoying Sev Zero, which came free with it, and Minecraft, which we purchased. Her Minecraft game from her iPad could be transferred to the Amazon fire game, which I didn't know it could do. All around great experience with this product. No lag at all.", "verified": true, "helpfulness": "2/2", "author": "kindaSortaMe"}, {"rating": 5.0, "review": "Easy to operate, any problems, just use the Kindle fire and have immediate help.", "verified": true, "helpfulness": "1/2", "author": "laurel Turner"}, {"rating": 5.0, "review": "Really pleased with this Fire TV.  As a previous Apple TV user, this works much better and easier to navigate the menu.  I cut the cord with my cable provider and couldn't be happier.  This product has definitely made the transition enjoyable.  I am a prime member, so I like having easy access to the free prime stuff.", "verified": true, "helpfulness": "0/0", "author": "glj104"}, {"rating": 5.0, "review": "Once you got the backing off to put in battery  Easy as Pie.", "verified": true, "helpfulness": "0/0", "author": "Deborah Walker"}, {"rating": 1.0, "review": "I was not aware that you had to have a really strong wireless connection to have it connect.  I'm able to use my Iphone and Ipad just fine but kept getting an error about not having a good enough connection to be able to view anything when I would try and use your product.", "verified": true, "helpfulness": "4/6", "author": "Kathy Maurer"}, {"rating": 5.0, "review": "This is a good device, that can be the best on the market. Amazon has severely limited the capabilities, like many manufactures of android hardware, so unless your willing to root, and have one that can be rooted, there are better options. The three biggest drawbacks are the limited storage space, especially if you plan on playing any games, locked down USB port, the inability to change launchers, and the inability to display sideloaded apps on the Amazon launcher. That being said, and despite these limitations, this is one of the best streaming TV boxes on the market, but could really be the best if Amazon would add just a few more abilities or stop trying to purposely sabatoage the comunities rooting efforts.", "verified": true, "helpfulness": "4/4", "author": "Kevin"}, {"rating": 5.0, "review": "Works great, easy to set up, excellent home entertainment for the price.  The Netflix app was tricky to download - you need to do a system update on the Fire TV first before the current version of the Netflix app will download and work.  Once I did this it worked perfectly.", "verified": true, "helpfulness": "7/7", "author": "Kenneth P. Carter \"Ken\""}]