[{"rating": 5.0, "review": "Great purchase.  We were streaming thru our Wii and this works so much better I'm sorry I waited so long to buy it.  Easy to connect to the TV and works just like playing a DVD and more advantages like not worrying about getting the movie back on time.  You can stop watching for any reason and then start where you left off without a long search.", "verified": true, "helpfulness": "1/1", "author": "Just me \"Jimmy M\""}, {"rating": 5.0, "review": "Love this .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Loving it we are going to be getting rid of the cable TV.", "verified": true, "helpfulness": "0/0", "author": "Snuggy"}, {"rating": 5.0, "review": "I love it. It does exactly what I need. It gives me a huge list of new and classic television and film to choose from. It allows me to do marathons of entire series. It's easy to use and install and it hooks into my amazon prime so I get tons of free stuff. I wish there was a way to mark something as viewed, but if the worst thing that happens is you view it twice oh well. I do wish it had integration with Showtime. I have DirectTv and they are not yet playing nice together. For a hundred bucks it was a steal. I'm a regular Amazon Prime subscriber so beyond the initial investment, it didn't cost a thing.", "verified": true, "helpfulness": "0/0", "author": "mjweir"}, {"rating": 2.0, "review": "it was to hard to operate................every time you wanted to watch tv you had to unplug it and then when you wanted to use it again you had to go through putting in your pass word for wi fi", "verified": true, "helpfulness": "0/0", "author": "larry .k \"wood man\""}, {"rating": 5.0, "review": "Great device would recomend, can watch all prime play games, The music is a great add on if you get I heart radio and you don't need cable any more if this comes out more and more. Great price too.", "verified": true, "helpfulness": "0/0", "author": "mk109"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "GM"}, {"rating": 5.0, "review": "M.L.B. WAS PUT ON FIRE TV THIS EVENING, NOW IM HAPPY...I would be even happierif cloud player would show up.", "verified": true, "helpfulness": "0/1", "author": "Leroy M L"}, {"rating": 5.0, "review": "LOVE IT!  Just got it today and am crazy about it.  I am not very good at hooking up electronics but, I had it hooked up and working in 5 minutes tops!  It is everything they claim and is as simple to use as they say.  If you love Prime, you need Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Virginia Robertson"}, {"rating": 5.0, "review": "So far I am loving my Amazon Prime Fire TV. A great choice of movies, tv shows, apps and music. Easy to hook up and use.", "verified": true, "helpfulness": "0/0", "author": "mysteryfan"}]