[{"rating": 5.0, "review": "Great!  better picture quality than cable, easy to set up plug in in and you're on.  Great apps.", "verified": true, "helpfulness": "0/0", "author": "Tim Tulley"}, {"rating": 1.0, "review": "I never got it to work and threw it away.  F. Parker", "verified": true, "helpfulness": "2/20", "author": "mastermixer66"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Floyd Little Sr"}, {"rating": 5.0, "review": "We had been debating replacing our 4 year old flat screen TV with a smart TV.  We want to access Prime and other subscription providers without the hassle of setting it up through game system or DVD player. Then along came Amazon Fire.  Easy to install, HDMI cable, and easy to use.  And the voice recognition feature really works.", "verified": true, "helpfulness": "0/0", "author": "D. Perkins"}, {"rating": 5.0, "review": "Kids love it and play games on it daily. Plus it works with our x-box controllers so that is a plus, but needs a wifi adapter to work.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 3.0, "review": "Comparing to Apple TV:It's got more RAM, good for you.It's more powerful, good for you.It's blablabla, good for you.But it doesn't have an iTunes Store, that allows rentals and purchases from anywhere in the world.With Hulu, and Netflix, it's always messages like \"This content is not available in your region\", or \"You have to be in the United States\". I would love to be in the US, but we don't all have that luxury, so why don't you just let me play the content! iTunes Store does.Therefore, no matter how weak the Apple TV might seem, it's got content for me while the others don't. 3 stars is for the hardware and very attractive price point.", "verified": false, "helpfulness": "0/5", "author": "AngryBuffalo"}, {"rating": 5.0, "review": "Work well compact and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Sam72 \"Sam\""}, {"rating": 5.0, "review": "I LOVE LOVE LOVE IT", "verified": true, "helpfulness": "0/0", "author": "De'Marko Gordon"}, {"rating": 5.0, "review": "Very impressive.  Extremely fast and fluid, best UI I have ever seen on a streaming device, and the voice search is fantastic.  Would be nice if it could play local content on my NAS, but haven't even looked into that yet.  Not sure if it can - probably need to buy an app like Plex to do that.", "verified": true, "helpfulness": "0/0", "author": "Sunseeker"}, {"rating": 5.0, "review": "Amazon fire is outstanding. It is a great substitute to wean us off the expensive satellite TV. There's a lot of options. I'm not a tech geek, so keep that in mind. It's good enough for those of us not familiar with tech snobbery.", "verified": true, "helpfulness": "0/0", "author": "C. Carpenter"}]