[{"rating": 5.0, "review": "I have two and now my Mother wants one as well!  Great buy and a great addition to EVERY Prime membership!", "verified": true, "helpfulness": "0/0", "author": "Angela Worthington"}, {"rating": 3.0, "review": "A nice product with one flaw. It must be turned off when not in use or it will not work properly after a few days and has to be rebooted. The picture will black out and you cannot watch your selection. It flickers off and on. I had to purchase a $12.00 extension cord with an off-on switch because I cannot get to the transformer where it is plugged in to the wall. It needs to have its own switch.", "verified": true, "helpfulness": "0/0", "author": "Michael A."}, {"rating": 5.0, "review": "I ordered this box because I want to cut my Directv off. I can not believe how much I pay for garbage programing. I have had this for 5 months and love it. I do not even turn the DIrectv on any more. My contract with them is up in 3 weeks and I am tickled pink to be able to cancel. There is plenty of programing to choose from and they add apps all the time. I also have a 10 year old who has found some awesome stuff to watch. I am going to order another today.PROS:No buffering---I have not had it buffer one timePlug and Play--The only thing I had to set up was the wifi.Portable-- I can take it anywhere that has wifi and use it. It is easy to set up the wifi so no issues. Moving it from room to room at home a breeze.Cost-- unit was reasonable and my only monthly fees are what I choose. Like Netflix and HBO GOCons--Nothing", "verified": true, "helpfulness": "1/1", "author": "Kimberly Clem"}, {"rating": 5.0, "review": "So far I have only one complain, Clint Eastwood movies are all pay for view.", "verified": true, "helpfulness": "0/0", "author": "Forrest B Comstock"}, {"rating": 5.0, "review": "Works way better than APTV2. Not constantly having to update fast response no need to point the control directly at it. Mines is mounted behind my TV and no issues I know own 6 best purchase ever!!", "verified": true, "helpfulness": "0/0", "author": "Rosa Coreas"}, {"rating": 5.0, "review": "Plugged it in and as it booted up it automatically scanned for wireless networks. Asked me to choose and then I put it the password. And it was ready to go. So much easier than finding my show or movie on the Kindle and then mirroring it to my Push2TV. And much better video quality!!! Smooth streaming video! Love it!", "verified": true, "helpfulness": "0/0", "author": "slin"}, {"rating": 4.0, "review": "I will admit at first I was totally worried about the user interface more then anything, however I find that it is actually easy to use. I mainly use it for Prime and slingtv but all the other apps work great also.  Voice search works well expect I wish it would include searches from non amazon apps or sites like Netflix.  Right now do a search for a movie and it only list movies on amazon.", "verified": true, "helpfulness": "0/0", "author": "Lesley Manley"}, {"rating": 5.0, "review": "I received my Fire TV quickly, as with all purchases when you're a member of Amazon Prime. It was so easy to connect to my HD TV. Everything went smoothly and worked perfectly. I've never had such a positive experience when dealing with electronics! I am enjoying all of my favorite TV shows and movies with the flick of a switch! SO HAPPY and my husband is thrilled too! I told him it was a Fathers Day gift! Ha!", "verified": true, "helpfulness": "0/0", "author": "Pammysue55"}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/0", "author": "Fernando Garcia"}, {"rating": 5.0, "review": "Great unit", "verified": true, "helpfulness": "0/0", "author": "Joseph Saba"}]