[{"rating": 4.0, "review": "I was ready to push the \"buy\" button to replace my Roku 2 when I realized it does not have HBO-GO.  Deal breaker.  No HBO-GO, no Fire TV.  Add HBO-GO, AND STARZ-play, and you'll have a customer.", "verified": false, "helpfulness": "1/2", "author": "George k 43 \"George k 43\""}, {"rating": 5.0, "review": "The device was easy to set up and is very easy to use.  It's nice having movies at your fingertips.", "verified": true, "helpfulness": "0/0", "author": "Barbara L."}, {"rating": 2.0, "review": "Having an issue with both the Hulu and Netflix app. The video will freeze and the audio will continue to play. After several seconds the video catches up. I followed all the trouble shooting tips from both netflix and hulu but no fix. The problem is these apps are several versions behind. My Internet is 60mb per sec so it's not that. The box will be returned until amazon can get better apps. Be warned unless you are a prime subscriber the other apps are garbage.", "verified": true, "helpfulness": "1/3", "author": "William Thornton"}, {"rating": 5.0, "review": "it was easy to install - ordered the HDMI cable which made it easier to install - its very easy to learn how to use.. I would recommend it highly....", "verified": true, "helpfulness": "0/0", "author": "Sally"}, {"rating": 4.0, "review": "Amazon has winner with the new Fire TV.  It is amazingly easy to use, especially the voice recognition search, which has worked perfectly for my first month.  The number of available options continues to grow, with the obvious Netflix, Hulu Plus and Amazon Prime features leading the way.  I have used and enjoyed the MiLB Radio Station search for late-night baseball, as well.  I understand that more things are coming, such as the newly-announced WWE Network addition.  The $99.00 cost is very reasonable, and the 30-day fee trial was a nice touch.  Installation was a breeze, even for someone like me with little technical skill.  Only one suggestion as of now - the service could use a way to separate Amazon Prime's no charge items from the PPV items.  Perhaps a new section called \"Amazon Prime Member's Collection\" or similar so that all of the vast inclusive no-charge AP content is together and searchable.", "verified": true, "helpfulness": "1/1", "author": "Thomas P. Joseph"}, {"rating": 5.0, "review": "This is a great product and a real threat to Roku. Only thing holding it back is the limited number of app vs Roku, but I believe Amazon will get that taken care of.  Can't go wrong with this purchase, way to go Amazon.", "verified": true, "helpfulness": "0/0", "author": "Bryan Jordan"}, {"rating": 4.0, "review": "It turned on instantly (well, technically it never turned off, just went to sleep, I guess). I could fire up Netflix or Watch ESPN in a flash. Couldn't be easier to set up. The buttons on the remote were kinda loud so scrolling through menus can get annoying with all that clicking. I have a PS3 that I use to stream media, so I don't really need this product, but it turns on quicker. My PS3 can get a little loud with all the fans and stuff and this little thing makes zero noise, and at a fraction of the size, I can hide it behind stuff and you'd never even know it was there.. If my PS3 ever quits working, I'll consider buying Amazon Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Bradley J. Perala"}, {"rating": 4.0, "review": "Great product!Fast ,reliable great quality all round.Would like to have more channels available ,but there is still plenty of viewing options available.Over all I love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Shawn Zapata"}, {"rating": 5.0, "review": "We love the Fire TV box. It is very easy to use and very convenient. The only down side is, I wish there was a category to show \"new apps\" or \"recently added apps\" so I don't have to look through all the app categories hoping to find a new app.", "verified": true, "helpfulness": "0/0", "author": "Donal Elms"}, {"rating": 4.0, "review": "Other people have written much more thourough and comprehensive reviews, this is just my personal opinion on FireTV. I've had my FireTV for a few months now and I really like it a lot. I can watch Prime Videos, Hulu, Netflix, play games, listen to music, and look at pictures on it. I'm a big fan of on demand TV so this is a perfect fit for me. I think that Amazon did a great job with the hardware, the interface, and the technology with FireTV. My only gripe is that I wish FireTV had more apps available for it. Some of the apps I have on my Kindle Fire I would love to have on my FireTV as well. I'm hoping that more apps will be available in the future, but until then I will still enjoy and use my FireTV and still am glad I purchased it.", "verified": true, "helpfulness": "1/1", "author": "whistlepete"}]