[{"rating": 1.0, "review": "Not happy that there is no internet browsing capability", "verified": false, "helpfulness": "1/10", "author": "w.chan"}, {"rating": 5.0, "review": "This is the best streaming box out there. Roku, Apple Tv, Chromecast, I have them all and this is the best one. This is basically a quad core android pc and you can do all kinds of things with it that the other devices can't. The games are great, the interface is slick, and its fast. I just wish it had more then 8gb of onboard memory but since it has a usb port and can be rooted there are all kinds of things you can do. Just get it, you won't be sorry.", "verified": true, "helpfulness": "0/0", "author": "Brian L."}, {"rating": 2.0, "review": "After I received it I found out that it doesn't work at my country", "verified": true, "helpfulness": "0/4", "author": "Tariq M. Alhassawi"}, {"rating": 3.0, "review": "I like the Fire TV, however I did not realize that I would have to psy for so many of the programs. The free movies are not popular ones. I spend hours searching for something to watch that I don't have to pay extra for. I purchase Prime thinking that I could to watch free.", "verified": true, "helpfulness": "0/1", "author": "Motivational Training Center (Consignment)"}, {"rating": 5.0, "review": "Excellent product. Easy to setup and easy to use. The menu is nicely organized and has just the right amount of features I shoud have purchased it sooner.", "verified": true, "helpfulness": "0/0", "author": "calvin j gasaway"}, {"rating": 5.0, "review": "Great shows but if you rub them together theyb won't start a fire", "verified": true, "helpfulness": "0/1", "author": "MoBoarder \"MoBoarder\""}, {"rating": 5.0, "review": "Awesome product. Plug then play hours and hours and hours and hours and hours and hours, eat, then play hour and hours and hours more. Don't forget to live a life when you buy this.", "verified": true, "helpfulness": "0/0", "author": "Stadar Heng"}, {"rating": 5.0, "review": "We have this, a Prime membership, Netflix and an HD antenna(life saver for football season!) to get basic cable. With most current shows also free on Hulu(and I refuse to pay for commercials at this moment, so free Hulu it is!), we're not missing out on much. I recommend this set up to anyone that wants to get away for paying a bazillion dollars for cable.We did look at Chromecast and Roku and all those and ask our friends, but ultimately we chose the Fire TV because I have a Kindle, already had Prime and Netflix, and it's super fun and easy to switch back and forth between the Kindle and the Fire TV. An Amazon Prime account and a Netflix account seem to go together very well too. There's a lot of popular and quality shows that you have to pay for, and that is not cool, but there's still tons of material with the membership. The voice control works pretty good and I think the menu set up is easy to follow and search through. With the Recent apps at the top of the screen, after awhile you'll just accumulate all the ones you use constantly so it's real simple to find the things you want.Downsides to this and every cutting the cable cord route is that when the internet goes out, you have nothing(I mean, I can't imagine someone having this AND cable. That would be kind of silly). You might actually have to spend time with your family or play board games or talk. And you have to ween yourself off of browsing aimlessly through channels for something to numb your mind with. For the Fire TV itself: I wish there was a shuffle mode or something, that would be fun. \"Typing\" out stuff with the remote also makes me question my life decisions for a few minutes and I would love a keyboard.", "verified": true, "helpfulness": "1/1", "author": "Jessica"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "1/1", "author": "Diane T."}, {"rating": 4.0, "review": "The devise works like it supposed to, however the speak search stop working and there are a lot of movies that aren't free.", "verified": true, "helpfulness": "0/0", "author": "Shelley Green"}]