[{"rating": 2.0, "review": "I purchased this device, although I already own Apple TV, because I wanted a better experience in steaming Amazon Prime & Instant Video. What I was not expecting from Amazon or a device with the hardware specifications included with Fire TV, was a less pleasant experience in streaming Netflix videos. While viewing a Netflix program, Fire TV will pause while it buffers additional content. This may occur two to three times in a 45 minute episode. This is not acceptable behavior. This is a new device, and all new devices will experience early release problems (although I find it hard to believe a problem like this escaped beta testing). I do hope that Amazon quickly provides a software update that resolves this issue. Otherwise, I see no reason to use Fire TV when there are a variety of functional streaming devices available.I called Fire TV support and discussed this matter with a technician. She said she was unaware of this issue, but would pass it along to the support team.", "verified": true, "helpfulness": "4/10", "author": "steve g"}, {"rating": 5.0, "review": "Best commercial I have seen in ages. I knew the moment I brought Amazon.com up last night and saw the skeletal jubilant face of the almighty, that something wonderful had happened to the world. I watched the ad.Now let me explain, I hate ads. I hate them with every fiber of my being. Very few actually entertain or move me to buy a product. In fact most ads I've seen make me want to run as far as possible from your product, unless I'm so upset I feel the need to light it on fire. I adblock my life away. I cancelled cable years ago and never ever looked back. I very much loathe advertising.Then, Gary Busey.One glorious ad from Amazon changed my life. I had heard about FireTV. It sounds cool. I already use a mixture of streaming platforms to watch content from Amazon and Netflix along with a couple random providers. I did not NEED this device. I have not looked into compatibility, specs of any sort. I generally nerd out on every purchase I make, prior to throwing money at it. I still have yet to look into what the FireTV actually has to offer. All I know, is that when Gary Busey asked for Gary Busey, it gave him Gary Busey.I don't think I need to know more.", "verified": false, "helpfulness": "7/8", "author": "T. Howe"}, {"rating": 5.0, "review": "Very easy to hook up.  Very easy to operate.  With my Amazon Prime membership it makes it easy to find something to watch when there is nothing on TV worth watching.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "...to make a good first impression!I ordered Fire TV (against all my lifetime experiences with first day introductions) the day Amazon announced it.  Two days later it arrived on time, well packaged.Configuration of the unit was as advertised and uneventful.  Power-up was where things went south.I never expected a brand-new, just announced, just made available product would have to (apparently) download Encyclopaedia Brittanica, Tolstoy's \"War and Peace\" and the collected works of Joseph Conrad BEFORE I could even see if the stupid thing worked! (A 40 minute download for a software \"update\" on a brand new unit? Seriously?)And I was not pleased that it took several jump-starts of plugging and unplugging to finally get all the initial hiccups out.But it does work, and the picture quality and fast buffer are a vast improvement over my previous streaming configuration (Wi-Fi adapter into Blu-Ray  player into our HDTV HDMI port)We've watched movies for the last couple of nights and have been generally pleased.  We bought it for streaming movies and having the option of switching movie vendors (that I didn't have with the Blu-Ray player).  So my observations are limited to movie streaming and don't address (or care) about gaming, music, apps, et. al.My \"nits\" for Amazon:1. When you deliver the unit, make sure it's firmware is up to date.2. In follow-on models, permit operator direct control of power (provide a power switch).3. In firmware updates, include a search listing  for ALL Prime eligible videos, not just the \"Recently Added to Prime\" section.4. In firmware updates, restore the \"genre search\" mode (Action, Drama, Classic, Documentary, etc.)In summary, it does (so far) pretty much what we wanted it to do and allowed me to clean out some of the excess wiring and units required for my old configuration.Having said that, we will be exercising the system thoroughly in the weeks ahead and will not hesitate to return it within the 30 day  clock if it disappoints.", "verified": true, "helpfulness": "0/4", "author": "RJ \"R.A.J.\""}, {"rating": 3.0, "review": "It would appear that the Amazon Fire is a nice unit, but you can get the streaming video for less with a smart Blu Ray player and get the player as a bonus.", "verified": false, "helpfulness": "0/12", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Let me start of by saying that I own a Roku 1 and 2 Roku 2's, a Kodak Theatre HD box, Chromecast and recently bought the PLAiR 2 as well.  I won't compare the items here, they are all different and better/worse in their own ways.  For this review, I'll stick to the Amazon Fire.  When I opened the box, I was impressed by the initial presentation of the Amazon Fire.  There was a place for everything and everything was in it's place.  I liked the quality and appearance of the Amazon Fire.  The remote had a nice rubberized feel to it.  Setup was WAY slower that I expected.  It literally took me 30 minutes for the software update to install.  I had to reboot my router 3 or 4 times before it would recognize my wired Ethernet connection.  I'm not sure what did it...but it eventually worked.  It might mean I need a new router...IDK.  I didn't like having to unplug and re-plug in the Amazon Fire multiple times to reboot.  It's seriously lacking a power button and/or reset button on the front/top of it.  Once the software update finished and I finally got to the main menu...it made all of the hassles worth getting there.  The interface is awesome!  Everything seems to be organized and easy to access.  I immediately tried the voice search...worked perfectly.  I still wish that Amazon had the amount of content that Neflix has...but that's a different story.  For those of you on the budget level high speed internet connection like me, you'll be impressed with how much faster load times for Netflix is!  It's about 75% faster than the Roku 2's.  I like instant satisfaction when pressing the button to watch a movie.  It's what sets this product above the rest.  As another review I read said it so well, \"It's worth it if only for the HOUR of time you'll get back in your life each month not waiting for the other device's to load your content\".  I've only used this for a day thus far.  I ran it through it's paces though.  I played the game of Life with the family...works well.  And it's nice not having to drag out the board game version and hunt down all of the missing pieces.  I checked out Plex...which is my ATF media app.  I'm glad you don't need the premium account with this app.  It works as expected.  It's also WAY faster than the Roku version as well.  I was able to watch my movies from my pc in the other room without much loading times.  I hope more apps jump on the bandwagon for this device.  I'd LOVE to see the A&E; app...or even the PLAYON app would be nice...I could access A&E; with it.  I like to watch Duck Dynasty...and Prime members only get like 1 or 2 seasons for free...again...Amazon content sucks.  Netflix has all of the seasons.PROS-Small device...portable...can save money in hotels during business travel.-SUPER FAST loading times...even on a crap low level high speed internet connection.-Nice games! (You Don't Know Jack trivia was fun, so was Game of Life).-Easy setup/installation of the apps.  I didn't need to go to Netflix.com and enter some stupid code for it to work.CONS-Took me 20-30 mins for it to find the internet and install new software.  Although...could have been my router.-No Power/reset button easily accessible.  I don't like the \"pull the power cord\" solution.- Very little troubleshooting info can be found (probably since this is such a new item).  I searched their website...not much info on what to do when the thing doesn't connect to your wifi/wired ethernet.-CONTENT.  Until Amazon decides if they want to be a movie rental service or a Prime Video access service....it'll never compete with Netflix.  Most of the shows I like (Revenge, Duck Dynasty, Survival type shows) are either missing or only have 1 or 2 seasons.  They probably do that to whet your appetite so you pay to buy other seasons.  It seems too much like a sales pitch to me.  They recently increased their subscription fee...but so far I'm not getting anything in return.  No new content....unless you consider movies from the 1980s new content...it seems they do.", "verified": true, "helpfulness": "1/1", "author": "Psych"}, {"rating": 5.0, "review": "The FireTV was super easy to setup and is really easy to use.  In fact, the setup was the easiest of any of my internet-connected devices.  Didn't have to put in any router information, no IP addresses, didn't even have to type in my Amazon username or password and all my Prime content was instantly available.The voice search feature is wonderful: fast and accurateI really like the Photos feature.  After downloading a client app to my Android phone from GooglePlay, my phone photos automatically sync'd to the cloud and were accessible by the FireTV.After having put up with an aggravating online experience with my Sony Blu-ray player, the FireTV is a welcome change.  The one feature the FireTV lacks is support from my Logitech Harmony universal remote.  I'm hoping Logitech will add support soon.UPDATE 4/28/2014: Logitech now has Harmony support for the FireTV.  It was easy to configure and works great!  I'm really happy with my FireTV purchase.", "verified": true, "helpfulness": "0/0", "author": "pdxmusicman"}, {"rating": 2.0, "review": "i was so excited when i picked up this product couldn't wait to get home and hook it up. What a disappointment to find out it is not linked to Direct tv yet. Love what i can do on it but very limited since can't use anything you have to register your tv provider to use. Really hoping they get this worked out with other providers quickly as I love what i can do with it and do not want to return it!", "verified": true, "helpfulness": "1/17", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device is very fast.  I am not a super techy guy, but know enough and use my tech beyond really basic features.  I have had no problems with its offerings, but I also researched before I bought it it fit all my uses.  My favorite feature thus far is linking my iphone to the device to search for things like youtube videos on my phone and have them play through my tv.", "verified": true, "helpfulness": "3/3", "author": "Andrew Moore"}, {"rating": 5.0, "review": "We have an older flat-screen TV in our bedroom and no XBox or Wii to stream Netflix or anything through to it, so I decided to get this when it was available and it's great.  I have a Prime account and watch a lot of movies through Amazon since they're more widely available than on Netflix, but I've been streaming stuff from several places and it was so easy to set up.  I think it's a great deal for $99 plus your yearly Prime membership which I would have kept anyway.  Much better than viewing stuff on my ipad if my husband is watching something else on the set-up downstairs.  I'd highly recommend this.", "verified": true, "helpfulness": "1/1", "author": "dcr"}]