[{"rating": 1.0, "review": "CONNECTED TO MY NETWORK EASILY BUT WOULD NOT CONNECT TO AMAZON.COM.WENT TO THE SUPPORT PAGE,OH WAIT IT DIDN'T EXIST YET. THIS PRODUCT PROMISES MUCH BUT COULDN'T DELIVER THE BASICS,LIKE CONNECTING TO AMAZON.", "verified": true, "helpfulness": "13/34", "author": "JZC"}, {"rating": 5.0, "review": "Performance, voice search that works, games, comparable content to other devices. Awesome! Thanks for meeting and/or exceeding expectations as always, amazon. Can't wait for what may or may not be to come!!!!", "verified": true, "helpfulness": "0/1", "author": "Nic \"Nic H\""}, {"rating": 2.0, "review": "It is easy to setup (I had to unplug and replug to get it to read the ethernet right).  The voice function is marginal...try Jurassic Park without saying it real slowly.My main gripe, and it is huge, is the USB port apparently does not and will not support playing video and music files.  I read two articles that quoted Amazon as this is not in the future.  This is a really, really, really big problem for me and my video setup, as now I must use another box to do that.  This simply is a HUGE failure, at least for me.The mirroring a Kindle HDX is a joke.  It takes THREE keystrokes, including pulling menus down.  Further, IT DOES NOT WORK if the fire tv is on ethernet....they both must be on the same wireless access point.  On fast wireless, HD breaks up and the video quality is horrible, far far worse than Miracast.  It is unwatchable.  Even SD breaks into noise blocks with the Kindle.Regular ether net connections produce stable video, but the black level is so white on this you will need to reset color settings when watching the FireTV.This is going back.  It is the first of 7 Kindle products I have returned.", "verified": true, "helpfulness": "6/10", "author": "Telstar"}, {"rating": 3.0, "review": "Pros:Faster and more responsive UI than other similar units (such as WD TV Live)External box is aesthetically pleasingConvenient to stream Amazon Prime and rent or purchase Amazon moviesActs like Chromecast, I was able to play my movie from my Surface Pro thru it with PlexRemote is actually a great design and comfortable.For some (not me) the voice search is cool and more accurate than othersCons:Remote is Bluetooth, cant program it to an universal remote.*Remote is tiny and heavy, always slides between my sectional's seats to the floor when I drop it. (easy to do when you have to deal with two remotes)Plex App is poor. (don't buy, just for thisContent is lacking but still similar or better than other devices (no HBO go, but does have Showtime Anytime)For me, I'll probably only use this to steam Amazon, nothing more. (I want to use my $400 universal remote)*Some say one can purchase an USB remote with an IR reader for a PC that will work. I ordered one. We'll see.UPDATE: I was able to purchase and test an Ortek Windows 7 Media Center MCE PC Remote. I connected the USB infrared receiver to the Amazon Fire TV. The IR remote it comes with works great. So then I programmed my Logitech Harmony One to use it. Unfortunately, the commands work, but send too many signals. Even tweaking with the Harmony, the best performance I can get is spotty. Sometimes each button press sends 2 signals, as if I clicked it two times. Not much can be done about it. Perhaps it will work better on another universal remote? Good luck.", "verified": true, "helpfulness": "3/4", "author": "Charles Forsyth"}, {"rating": 2.0, "review": "Where are all the apps? How are there only 4 sports apps. No MLB.tv? How is that possible?Time to switch back to my Roku 3.", "verified": true, "helpfulness": "4/11", "author": "James"}, {"rating": 4.0, "review": "I bought this device to partially replace my PS3 that I mostly use for watching Amazon Prime and Netflix content.  My old PS3 is getting long in tooth and takes a long time to load content.  There are a number of other reasons I'm getting disgusted with the PS3, but I won't go into them here.I was pleased with the easy setup, the speed and solidity of the Fire TV unit, and the simple remote that includes everything you need without being cluttered.  A surprise bonus is that the picture quality of this unit when playing both Amazon and Netflix content is actually superior to the PS3, though the PS3's audio seems a slight bit better. (using optical output for audio on both units)  And the device is extremely fast to switch between various content.  The fast-forward and reverse features are intuitive and work far better than in the same apps on PS3.  The menus are intuitive and logical for the most part.  I have yet to have this unit stumble during playback of any content as well, nor downgrade the quality due to it having any connection issues like my PS3 likes to do.  So far, truly it \"just works.\"There are a few things that I find lacking though, that hopefully Amazon will rectify in later software updates.  An easy to find Youtube player is not present that I've found.  Nor can you currently play any of your music stored in Amazon's \"cloud\", which seems like a glaring omission.  A good DLNA player app would be much appreciated as well, though there may be one available for download, I just haven't looked hard for it yet.  I also don't see HBO to Go as available.  The voice search, while excellent in Amazon's player, does not work in any other apps that I've found and the text entry with the remote is slow and tedious.  The 'home' button on the remote is poised directly above the pause button, making it easy to hit when you don't want to.  This is mitigated somewhat by how utterly quickly the unit resumes playback when you make this mistake.  The USB port also does not seem to be currently enabled for any use.I have not tried the parental controls so I cannot comment.To sum up:First the pros:-It's tiny and feels very well built.-All the ports you really need: Ethernet, HDMI, optical for audio, USB (though not active yet)-The processing speed is very fast--there is no perceptible lag when performing almost any action.  Part of this is due to pre-emptive loading of content in the background.  I've fooled it into taking time to load things, but it's very nearly precognitive.-Playback is flawless and nearly instantaneous.  It has yet to fail to play any content I've chosen or downgrade the quality.-Voice search is fast and accurate.-The Bluetooth remote is comfortable to hold in your hand and the controls have a nice \"click\" to them.  Since the remote is RF instead of IR, you can pretty much stick the Fire TV unit anywhere you want without worrying about line-of-sight to use it.  I'm thinking of mounting the unit on the back of my TV with velcro.-The price is extremely reasonable IMHO for what you get, though the game controller is a bit pricey.-While the hardware specs aren't going to make the Xbox or PS4 huddle in shame, it's nice that you can do some decent casual gaming with the unit if that's your cup of tea.  It would be nice if Amazon's fork of the Android OS was compatible with more games/apps though.Now the cons:-No Youtube, HBO to Go, Amazon cloud player, or DLNA (I'm now told there is a Youtube app)-The USB port is not apparently enabled yet.-The apparently unskippable initial setup video.  (I just tuned to something else and let it play)  I could see how it would be useful for your non tech savvy family members though.-Voice search only works in Amazon player and text entry is tedious with the remote.-Amazon is likely soaking up a goldmine of free demographic info from you when using this.-With only 5GB? of user storage, you're going to need to ration the apps/games you choose to keep on it.-I have seen HDMI cables as low as 47 cents on Amazon at times.  It would be nice if one was included with the unit, though to be fair, most manufacturers do not include these.**Edit 4/13--I'm told there is a Youtube app for download, so disregard my comment about its absence.  Also, I'm told (paraphrasing) to \"wait for updates you impatient clod\" and that the USB port apparently supports a wired keyboard.  Well I am waiting for updates, patiently enough I guess--I'm just stating my perceptions of the unit in my review.  And I don't really see how wonderful it is to be able to use a wired keyboard for searches.  Maybe if the unit was on my desk and not in my entertainment center.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "One of my engineering coworkers was showing off his Amazon Fire, called me in to see it. We work for the ABC-TV  Network, West Coast and I watched it for about 15 minutes, said goodnight and promptly went home and ordered mine! It showed up in a day early, and Friday night 4/11/14 I plugged it in. It updated itself, knew who I was, and my Prime Account content was right there. I watched 3 episodes of the last season of \"Eureka\" and then what I think is the best Star Trek movie, II. The Wrath of Khan! Damn it all looked excellent on my 55\" screen. Sound was sweet! The unit is simple to use, gets warm, but does not get hot, and more and more content is being dumped into my Prime viewing bucket! Hey like I said, I am a Television Engineer, if it's good enough for me, the rest of you are going to love it!!!!P.S. I have been a Prime member since I discovered Amazon, without the benefits of Prime, the content cost will start to add up. . Just join Prime, it will pay for itself. I shop quite a bit, so for me Prime makes sense. Now more than ever it is paying for itself since the access to free content movies and TV is growing!", "verified": true, "helpfulness": "3/3", "author": "P. Sullivan"}, {"rating": 3.0, "review": "I love the concept of the Amazon Fire TV, but when we go to use it to find something we want to watch, we find that we need to pay for it. The only movies/TV that we can find are much older programs, nothing that we would want to watch. Most programs are those that we have already seen or those that we do not want to see. That is the most disappointing part of this....", "verified": true, "helpfulness": "1/6", "author": "L. Holleman \"Happily Married!\""}, {"rating": 4.0, "review": "I love it so far.It is in it's earliest stages and i do antipicipate more to come.Wish more older classics was on  Prime but i", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Hate it...will be sending back! This Fire TV does not do what it says it does.  I'm not sure exactly why it is so \"fire\"!", "verified": true, "helpfulness": "7/44", "author": "marcella overton"}]