[{"rating": 4.0, "review": "We are huge fans of Amazon and loyal Prime members. I have an original Kindle Fire which I have had for 4 years and love, so I was very excited when my husband bought the Fire TV for Christmas. It works great, but does have a few issues. It sometimes gets disconnected from our WIFi and will not reconnect. The only solution seems to be unplugging the box since it does not have a restart button on either the unit or the remote. My husband loves the voice search option, and I like the organization of the home an other menu screens. Overall it is a great product, but it does have a couple little bugs that can get frustrating.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Like I said, I own them all. Roku hands down beat them all. None of these services are complete to me. What I can't stream on my Xbox, I do on Amazon Fire, and I still have to mirror my IPhone or turn on my Apple TV to access yet still different content. Man, I thought I was getting a deal. I got the stick for $20 and that's enough. I wanted to be able to play some old school games and not power up my big pimp X box One and I got suckered. Them games are primitive and look home made. Very few marquee games. A very big plus on the Amazon Fire is the indexing feature on Amazon content.", "verified": false, "helpfulness": "0/0", "author": "Cathy Ann Broadus"}, {"rating": 5.0, "review": "Wow this is awesome.  I used to have cable, now I just watch everything with this.  Easy to use.  Just click a button and tell it what you want to watch, and if available there it is.", "verified": true, "helpfulness": "0/0", "author": "Gotta Latte Espresso"}, {"rating": 5.0, "review": "have only had it a short amount of time but just internet, prime, and sling TV saves me 55 bucks a mth over cable. pictures is just as good as cable and only has a little fuzz for a few seconds once per tv show and never on videos, movies, etc. But that can be contributed to wifi vs a direct connection. arrived sooner than expected. Was very simple to set up. Just plug in power cord and hdmi and you are good to go.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "This was so easy to install, just follow the instructions.  I do think there should be information about how to shut it off.  I did find the information on line.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth L"}, {"rating": 5.0, "review": "You NEED this!!If you are an Amazon Prime member looking for a way to watch movies and shows on your tv instead of the computer, if you're a Netflix or Hulu subscriber, or if you simply want to rent and stream from Amazon's extensive library: This is the device for you!!We love our Amazon Fire TV. We haven't had any issues with it whatsoever, and we regularly use it to binge-watch shows together.It's quick to setup. The box is fast. The quality is is superb. Navigation is easy.Compared to other devices:We use this in conjunction with our Chromecast device. We prefer streaming YouTube videos to Chromecast, though Amazon Fire TV offers an app for it. If you have both devices, it's really up to preference.We also have the Amazon Fire TV Stick for another tv in the house. While I like it, it's not as perfect as this box-top Fire TV. The box is much more reliable and faster than the stick. To me, it's a noticeable difference.How to improve your experience with Fire TV:Use an Amazon Fire tablet with it. Apparently, you are able to stream from your tablet's screen to the Fire TV. (I don't own the tablet so this hasn't been tested on our end but if it works, I think it would make our experience that much more improved.)If we buy a device again in the future, it will be this one!", "verified": true, "helpfulness": "0/0", "author": "The D'Amico Family"}, {"rating": 4.0, "review": "Overall great product. It replaced our Google TV and Apple TV. The big disappointment was that the voice search only works with Amazon and does not extend to Netflix/Hulu Plus, or other apps. It would be less disappointing if Prime had a greater selection of TV/Movies than are currently offered.I wish that there was a clock somewhere on the home screen or way to pull up a clock. I would also love an app for Google Music, but understandably, it is not available.", "verified": true, "helpfulness": "0/0", "author": "Ratcliff"}, {"rating": 5.0, "review": "I have been a very happy Roku customer for years, upgrading as new hardware came out. I have them on every TV in the house. We cut the cable in 2009, and I have been happy.I have decided to try Sling TV. Not sure if I am going to keep it for the long haul yet, but I got a deal on the Fire TV when I signed up for 3 months. Sling really exposed the lack of power of the Roku, and was very difficult to use on that device. Simply too much lag.That has been an seemingly ever-increasing problem with the Roku... lag and freeze-ups due to its lack of processor power.The Fire TV, on the other hand is FAST. I have experience no lag whatsoever on any channel, and the experience has pointed out exactly how I have become used to lag as a necessary evil of IPTV. It turns out lag is not.The other thing that I have to say about this device is that Amazon really undersells the value of the voice search. Sure, it does not search Netflix. That should be there, but I can live with it searching my Amazon environment. The ability to speak a TOPIC, and have the device gather up all the video and apps makes navigation really easy. I have an idea I will be spending much more time with Amazon content.The one bad thing, and it is hard to figure out, is that the device does not have an Audible app.There are a couple of minor things that Roku does that there are not apps for so far (like Simple.tv), so the Rokus are staying for the time being. I am sure it is just a matter of time....", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 4.0, "review": "Easy to set up and easy to operate. One fault however is that if you have any issues with your bandwidth speed, you will either have to suffer through the constant stuttering of HD video or set Fire TV to a lower resolution. We use it primarily with MLB.TV and have no issues with it at all. Nor with Netflix. Only with Amazon movies.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 3.0, "review": "product is quick and efficient but there is a series lack of selection for free stuff on Amazon Prime Movies.  Very few new movies with a lot of old out of date not popular movies available unless you want to pay to rent or download to own.  You almost have to have Netflix to make it worth while.  I do like the voice command stuff which finds shows by just speaking into the remote and the system does stream super fast.  I think the best part of the Amazon deal is the Prime Shipping which guarantees 2 day shipping because I order a lot of products online.  So if you already have Prime, then go ahead and buy this as a nice additional bonus.  Or if you order a lot of stuff off Amazon and want to get the Prime shipping.  But if you are someone who orders products seldom off Amazon and are looking for a product to stream online movies, don't expect much selection from this.  They do advertise over 40,000 movies and TV shows but I can honestly say the I probably won't watch 97% because I paid for a year subscription and why would I pay more for movies I want to watch when I can just download the Netflix app and have a larger selection for a lower monthly price.", "verified": true, "helpfulness": "1/1", "author": "Guywhodoesstuff"}]