[{"rating": 1.0, "review": "Came bricked", "verified": true, "helpfulness": "1/3", "author": "jeffrey lagpacan"}, {"rating": 5.0, "review": "Just starting to use it now even though I bought it for myself with my Christmas bonus money.  Allows us to watch movies and TV shows on my big screen TV in our living room.  I watch the movies mostly and my brother watches the TV shows.  Eventually I want to get away from cable and this is one of the reasons I bought it.  I am sure this is much more to it but my brother and I are not very technologically savvy. LOL", "verified": true, "helpfulness": "0/0", "author": "dottybgood"}, {"rating": 5.0, "review": "I've tried  many media servers. The firetv is my favorite.  Great product!", "verified": true, "helpfulness": "0/0", "author": "Raymond Jackson"}, {"rating": 4.0, "review": "My Fire TV worked fantastically for about a month.  All of a sudden one day it stopped holding a wifi connection.  I hadn't changed its location, nor that of my router.  I tried every troubleshooting thing possible, until I finally broke down and contacted Amazon about it.  They had me go through all of the same things I had already done - to no avail.  Ultimately, they shipped me a replacement since we couldn't get mine to work anymore.  I set up the new one and - SAME THING!  Would connect to the internet, then lose the connection - rinse and repeat.  I racked my brain over what the problem was, and that's when I remembered that I had recently plugged in my DVD player, which the Fire TV was sitting on top of.  I pulled it out from under the Fire TV box, and voila!Moral of the story - DVD players have magnets in them that interfere with the wifi connection to the Fire TV box!  If you find that you are having a connection problem and none of the troubleshooting is working, look for items near that box that may contain magnets!  Hope this helps alleviate some frustration for someone!", "verified": true, "helpfulness": "2/2", "author": "Rebecca"}, {"rating": 4.0, "review": "Liked it but my internet sucked", "verified": true, "helpfulness": "0/1", "author": "Rwenk"}, {"rating": 3.0, "review": "Purchased for my parents. They have trouble navigating the menus from time to time (late 60's) it's not idiot-proof, but it works well. Amazon is sneaky in that they list free prime content mixed in with pay-per-view or purchased content on the home screen. It's designed to generate sales, but is insulting to prime subscribers.", "verified": true, "helpfulness": "4/4", "author": "Brad Humphrey"}, {"rating": 5.0, "review": "Great product easy to setup and use. The voice search feature is pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Ericmaghvac"}, {"rating": 5.0, "review": "Works much better than my old apple tv 2,  love how quick if opererates, allows me to add android tv apps", "verified": true, "helpfulness": "0/0", "author": "Ron Martin"}, {"rating": 3.0, "review": "I wanted to like this more then Roku but I can't, Only because of the non Amazon content and not being able to have a place to pin app so you don't have to constantly search for what you use the most. Now the gaming is nice I love the gaming and so do my kid's. Content lacks for tv channels unlike RUKO that has some great channels like U.S. Weed Channel and many many more channels that Fire just does not have. Again the gaming  on the fire is great and is the only reason I will be keeping it. I really wanted to love this!!!!", "verified": true, "helpfulness": "2/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fire TV is awesome.", "verified": true, "helpfulness": "0/1", "author": "Wayne Williams \"tetebull\""}]