[{"rating": 3.0, "review": "Price is great. Build quality seems great. Programing is less than average.Two reasons for not getting 5 stars:Glitchy - when using competitor apps (Netflix, Kodi) it hangs up and must either be restarted or I have to got to app settings and clear the cache. which is a pain. Didn't have to do this with xbox 360 but the 360 has a way longer start time, bigger foot print, cost more and uses more energy (otherwise I would just use the 360 (hello Microsoft) instead of having two devices.User Interface - the menu guide is less than helpful when using this thing for a media box. Have to use third party PC programs to download none amazon approved apps (not for the faint at heart). Amazon puts movies and tv programs as suggestion when they are for paid instead of free. When moving to and outside of Prime content is clunky and seems to take too many button pushes.Overall great value for the components, remote, seems fast when moving in and out of running apps and great start times (near instant on from sleep mode). Less than average for user friendly, app management, and playing friendly with other competitor apps.", "verified": true, "helpfulness": "3/3", "author": "J. White \"wedol\""}, {"rating": 5.0, "review": "LOVE,LOVE,LOVE!!!", "verified": true, "helpfulness": "0/0", "author": "Debra D. Collins \"Debbie\""}, {"rating": 5.0, "review": "Very impressed, got rid of my Roku 3 since I bought the fire TV. Amazon Prime membership is a must if you wish to utilize the unit to it's full potential.", "verified": true, "helpfulness": "0/0", "author": "D. Subba"}, {"rating": 5.0, "review": "Compared to roku 3, fire TV is better, based on my experience so far. The native apps are better,  plus side loaded apps work great; just use agk fire app to sideload. Fire TV also beats all of the Android TV boxes I've tried. Kodi works great on the fire TV. Last of all, the picture is better on our TV, when played on the fire TV.", "verified": true, "helpfulness": "0/0", "author": "Sherry Burke"}, {"rating": 1.0, "review": "Does nothing for me, thought I could replace my WD player with this, should have done some research first.While I can connect it to my old style TV like I did my WD player, using a HDMI converter.As soon as I try to do more than look at the menu's it tells me its not directly connected.(This is due to their decision to use HDMI HDCP to protect their media)So I give it 1 star, it sits in a drawer, maybe I'll replace the TV someday, in the meantime my WD player still works.", "verified": true, "helpfulness": "1/5", "author": "John Pendzich"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/1", "author": "ROGER FOOR"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "Lowell B."}, {"rating": 3.0, "review": "it's ok", "verified": true, "helpfulness": "0/2", "author": "Chris"}, {"rating": 5.0, "review": "finally the answer for high priced cable", "verified": true, "helpfulness": "0/0", "author": "Thomboze Amazon Customer"}, {"rating": 5.0, "review": "Made my TV smart.", "verified": true, "helpfulness": "0/0", "author": "Laura"}]