[{"rating": 5.0, "review": "So I bought the Fire the first week it was out so that I would no longer have to use my PS3 as a tool for streaming media. So far the box has exceeded my expectations. This little, and I mean little box, is amaaazing!! As an Amazon Prime member for over three years, I am still wowed by the ways we get to enjoy the ideas and reality this great company delivers!! Keep it up boys and girls...please :-)  The remote is simple, kudos for that!.  The box is small and simple, kudos for that!  The box generates little to no heat, kudos for that!  The effort it took to connect and get going was simple, kudos for that!  The interface is beyond simple and FUNCTIONAL, major kudos for that! My only complaint is that when I watch an Amazon video, I do not have the option to \"play from the beginning\" like I do on the PS3. Please update this and make my dreams come true of a simple, efficient, and amaaazing thingy-ma-doodle which allows me to enjoy watching movies/tv without the hassle of thinking after a long day of work :-)  Amazon, you continue to push the boundaries of keeping it simple and functional for us all. I will only say...you guessed it....KUDOS to you Amazon!! Keep the good stuff coming!!", "verified": true, "helpfulness": "2/2", "author": "Chris Ridley"}, {"rating": 3.0, "review": "There are many things I like about Amazon Fire TV, but I get tired of having to reset it a lot of times. I have to unplug and plug it in after every use with Netflix. For some reason the screen turns white the second time I use the app ( would be great if you could fix this issue)! Considering it took me an hour to get it initially started because of an update, which makes no sense for a new product it has worked so so... It freezes up when streaming videos on HULU a good bit. I would like to have the option to remove shows from your watch list, especially when I view a show for the first time and don't like it. Sometimes the shows will start and then go right back to the homepage. This should not be happening without a button being depressed. I guess everything new has bugs but my question would be when is Amazon going to update the product and fix some of these bugs!!", "verified": true, "helpfulness": "1/1", "author": "George Welling"}, {"rating": 4.0, "review": "I like the device. I had the Apple TV. THE Amazon is better than apple and Roku. The only network Amazon needs is the WWE Network app. There is a lot of WWE fans out there with Amazon that would love this app.", "verified": false, "helpfulness": "0/1", "author": "BioHazardSamurai92"}, {"rating": 3.0, "review": "I really enjoy the Amazon Fire TV.  I only have trouble locating all of the Amazon Prime movies and tv shows in one grouping.  I wish I could stream only the movies and tv shows that is included with my Prime membership.  Otherwise, this device works excellent.  The install was a breeze.  Glad I purchased it.", "verified": true, "helpfulness": "1/1", "author": "Gena Mueller"}, {"rating": 4.0, "review": "We live in an RV and we get internet through our phones Hotspot or from free WiFi in RV Parks.  Fire TV is sometimes the only way to pick up the TV Shows we have missed.  I have not been able to find CBN or The Blaze TV on the device.  Those and two of my favorites that I used to watch on the Roku device that I miss.", "verified": true, "helpfulness": "1/1", "author": "Missy"}, {"rating": 5.0, "review": "in the middle out and had to wait for it to reboot I'm glad Im glad I purchased the Amazon Fire TV thank you.", "verified": true, "helpfulness": "0/0", "author": "G. P. Smalarz \"G.P.Smalarz\""}, {"rating": 5.0, "review": "I really like the Fire TV box so far.  The voice search thing is pretty good, but I just wish it had the ability to surf the internet.", "verified": true, "helpfulness": "0/0", "author": "Erik"}, {"rating": 4.0, "review": "Received my Amazon Fire TV 2 weeks ago. It works good very responsive with quad core but the interface seems  very limited on apps the main ones are there Amazon of course, Net Flix, and a must have PLEX. but missing a lot of others, Still like ROKU 3 as a main streaming unit a little slower but chucked full of apps. Amazon needs to get with it if they are going to lead the pack here. also the speech search is not useable with Net Flix or any of the other apps only works with amazon. this is definitely loaded heavy on the amazon side, It makes no sense to have a great feature that cant work with the whole package.I would recommend to others but tell them of the draw backs so they know what they are getting in to here.Great product but needs some one  to help it along.", "verified": true, "helpfulness": "0/0", "author": "jrodie"}, {"rating": 5.0, "review": "The product is user friendly, easy to hook up and a great deal for the price.  I would recommend you give it a chance.  Easy to compare to the competitor's product.", "verified": true, "helpfulness": "0/0", "author": "Jim Wiggs"}, {"rating": 5.0, "review": "We love it.  Bought one for family room and the office.  Easy to install and use.  LOVE all of the options for things to watch.", "verified": true, "helpfulness": "0/0", "author": "LynnVe"}]