[{"rating": 5.0, "review": "THIS IS TOP NOTCH! VERY FAST TRANSITIONS!NOT ALOT OF GAMES AT THIS POINT AND TIME BUT THEY WILL COME.BEATS ALL OTHER STREAMING DEVICES I HAVE OWNED!", "verified": true, "helpfulness": "2/3", "author": "Joshua scruggs"}, {"rating": 5.0, "review": "So far I am impressed and excited about Amazon Fire TV.  I'm going to keep this review brief and to the point.My favorite features:1. I love that it has parental controls - haven't fully integrated them yet but I am so glad the feature is there.2. I love the format. The menu is easy to navigate and I appreciate that the Amazon content is available without having to scroll and click on several links.3. The remote is awesome. The voice feature works well and has been easy to use, but even if your just scrolling and typing in usernames and passwords the remote feels good in your hand and is not awkward.4. This is one of my favorite features... It's FAST!  Using other devices there has been a lag and shows have been slow to load etc.  Not at all with Fire TV.We use 3 other devices to watch TV & Movies through apps. 2 are gaming devices, 1 is a Blue Ray DVD player and by far, this is the best solution we have for streaming.  Very please and considering purchasing a second one for an additional TV in the house I love it so much!  Well done Amazon!!", "verified": true, "helpfulness": "4/4", "author": "Erinboarder \"erinboarder\""}, {"rating": 1.0, "review": "I purchased the Fire TV in order to watch MLB.TV, which Amazon advertised as being available.  Guess what?  Not available!!!!  *CURSES*", "verified": true, "helpfulness": "4/20", "author": "Roubaix Rider"}, {"rating": 3.0, "review": "I know it's relatively close to all the other media boxes out there but where it excels in many areas that I have been hoping for it falls off in some key areas that I just can't accept. It needs to update the amount of video and audio files it can play BIG TIME. Also it seems a bit glitchy and hopefully they iron these things out.If they ever update this thing to meet those requirements I'd rate this #1 in it's class.", "verified": false, "helpfulness": "0/5", "author": "Jeff"}, {"rating": 4.0, "review": "much better picture quality than Roku 2, apple TV, Chromcast or google TV, wireless HDMI (have all of them).No enough channels yet.FYI showtime doesn't work with comcast/Xfinity.Nice piece of tech but need more channels to be really appreciated.No regrets recommended.Cut the cable", "verified": true, "helpfulness": "1/1", "author": "MyShy"}, {"rating": 5.0, "review": "I can say this much about the FireTV... It works. It works just like they advertise. I can do the voice commands and within a few seconds, I get a result. So far 100% correct. I downloaded a few games for the kids... they play those just fine and are all smiles... Seems perfect right? WRONG! After installing Netflix, HuluPlus and Pandora I have yet to see a full TV episode, or a full movie in its entirety. In fact, I haven't see the opening credits on anything yet!! Each time I try to play a feature or TV show, it acts as if it's going to play and then either the app (Netflix and HuluPlus) quits or if I try to play a Prime selection, I get the \"We are having trouble loading this content. If the problem persists contact support...\" But as another reviewer already pointed out, I don;t have time, nor do I want to be a Beta tester!! So to sum up: everything works, right up until you really want it to work in so much as watching content provided by the FireTV... I hope they fix this. It has potential.So I was a bit premature in my review... After a simple reset by unplugging the device  and plugging it back in, everything works as it should. I knew the potential was there and so glad I did a simple power cycle to clear the digital debris. Amazon FireTV is now my new Go-To device and well deserving of a 5 star review.", "verified": true, "helpfulness": "2/10", "author": "Donald Stoker"}, {"rating": 5.0, "review": "Set up was extremely easy..even my grandmother could do it.Before getting this device,  I used to use my ps3 to stream content.I am glad I am a subscriber to amazon prime which makes getting the fire a must.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My Amazon Fire TV ReviewI like it better than Apple TV.Fire TV is better than Apple TV. Not only is it a lot more powerful, (look up the specs), but it has voice search capabilities -  though it's currently limited to Amazon Prime.  You won't believe the level of customer support Amazon is putting behind this $99 product - as I found out when at first my device wouldn't stream movies. The Help menu has an option for Customer Support to call you. I clicked \"yes\". My phone rang in less than 5 minutes. I was greeted by Carlos, who spoke clearly and in fluent English! Carlos stayed with me for almost 30 minutes, going through all possible solutions. He couldn't figure out the problem, but promised he would speak to the Amazon engineers and call me back the next day. True to his word, he called me with the engineers report. The problem was with the HDMI splitter I was using (so I could plug 2 devices into one HDMI slot). Sure enough, the Fire TV fired up as soon as I switched connections and the movies streamed quick and flawlessly.  Later, when Carlos called me back to see if his fix worked, I was almost sad to say yes.", "verified": true, "helpfulness": "2/2", "author": "J. C. Smith"}, {"rating": 4.0, "review": "I was looking for a streaming option which had closed captions (subtitles)  for two of my sources, Netfix and Amazon because I wear hearing aids and my wife is also hard of hearing.I have a Sony TV, a Sony Bluray player and a Samsung Bluray player.  Netfix was no problem but none of the above  devices would show captions with Amazon streams.  I really ding Amazon for not using what ever caption system Netflix uses which works on all devices.Problem is solved!  the Amazon Fire Tv is great with captions.  It has additional options to set the font size, color (black or yellow) and background.The reason I did not give 5 stars is because of the remote.  It is a non-standard bluetooth. All the rest of the world uses infrared for entertainment devices .  I have a very complex entertainment system with many devices so that I use a Logitech Harmony universal remote which eliminates the hassle of having 8 different remotes cluttering up the place.  But now I must keep at least two remotes handy when ever doing streaming.  One can't live with out a remote for volume.", "verified": true, "helpfulness": "2/2", "author": "Edward B. Smith"}, {"rating": 3.0, "review": "If you have used or are familiar with ROKU, you may find Amazon Fire TV Lacking.  I purchased the new Amazon Fire TV to replace an older generation ROKU.  After set up, I found that the \"Fire\" had no \"Channel Store\" feature like the ROKU.  I had a number of religious and other channels (BYUTV) which I liked but found nothing like it on the \"Fire\".  It does a great job with Amazon's own site.  I placed my ROKU back in service until Amazon catches up (if they're so inclined). YouTube would also be great.", "verified": true, "helpfulness": "3/5", "author": "BAR1138"}]