[{"rating": 5.0, "review": "I have the fire tv stick. It kept buffering too much while watching Netflix and MLB.TV. decided to try Amazon TV. The results are much much better. No buffering with Netflix and glad that it has an Ethernet connection if I want to connect directly to router.", "verified": true, "helpfulness": "1/1", "author": "Jose Camacho"}, {"rating": 4.0, "review": "do not use at this time", "verified": true, "helpfulness": "0/1", "author": "irene m gusciora"}, {"rating": 5.0, "review": "I love my Fire TV! I got the game controller, too and so glad I did. It is a perfect companion to your prime membership. I watch TV, movies, listen to music, play games, browse my YouTube subscriptions, catch up on favorite TV shows. I highly recommend the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Alexcia L Kolokithas"}, {"rating": 4.0, "review": "This is a definite contender for the Roku 3. The ability to handle games is a big plus. I recommend getting the gaming controller to go with this if you plan on playing many games.I only have a few minor issues that I wish Amazon would consider. I would prefer the option to power this off when I'm not using it so it's not always on. I understand that it's easier to update apps and firmware and all that if it's always on, but I would like the option to power it off when I'm not using it.The other issue I have, and I've only had it happen once, is the screen is completely black, and it would not respond when I pressed any buttons on the remote to wake it up. I had to unplug it and plug it back in.Again, I've only had this issue one time, so maybe it was a one time thing. Overall, this is a great streaming device and for now it has taken the place of my Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Rey"}, {"rating": 5.0, "review": "Worked exactly as described.", "verified": true, "helpfulness": "0/0", "author": "Stefan"}, {"rating": 5.0, "review": "I bought this for my sister. She loves it. She doesn't even use cable anymore.", "verified": true, "helpfulness": "1/1", "author": "JHC"}, {"rating": 5.0, "review": "My husband was skeptical about purchasing this device/product but once it was installed and we were able to use it that same evening, he loves it. I would love to get rid of cable because Amazon Fire TV is enough for me. My husband won't give up his sporting, hunting and fishing channels though so we compromise.", "verified": true, "helpfulness": "0/0", "author": "VM Brown"}, {"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "Guillermo"}, {"rating": 1.0, "review": "I ordered this product on July 30 th instead of using the 2 day prime shipping I paid 4.99 for 1 day shipping.  I just received the item today the 8 th.", "verified": false, "helpfulness": "0/3", "author": "Karen Z. \"kdz\""}, {"rating": 5.0, "review": "For this I'm rating the unit it's self, not the Amazon service since I haven't really used it much for the Amazon prime videos.  For the fire tv it's a awesome device and if you are in the market for one and your deciding between this and the fire stick it's worth the extra money since its hardware is a lot better and add in the Ethernet port when watching videos there is no lag.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}]