[{"rating": 5.0, "review": "love it want one for my bed room now.", "verified": true, "helpfulness": "0/2", "author": "Marge B."}, {"rating": 5.0, "review": "This is perfection and I know this moreso because my husband who is difficult to please can't stop singing its praises. I love how easy it is to set up and use. I love the tiny box. I simply can't get enough of the voice recognition. I have found that with so many things here, for example my voice navigation system, the difference in accent is not an issue here. I can speak and it always get my request right. For that I am very grateful. I can tell that a lot of thought went into its development because even those that are technology afraid can be successful users of Amazon tv.", "verified": true, "helpfulness": "1/1", "author": "verona francis"}, {"rating": 3.0, "review": "I like it but not updated with Netflix and been having problems connecting to Netflix. Haven't used it in months.", "verified": true, "helpfulness": "0/2", "author": "tiziana douglas"}, {"rating": 3.0, "review": "So far, there is nothing decent in this market for the visually impaired audience and their families when we seem to be in an age where technology could certainly support such products.  I decided to give this product a try over other similar products because my son is blind but still enjoys TV shows and movies.  In fact, due to other physical and cognitive impairments, \"watching\" TV is one activity my son can still do with family and friends, IF ONLY DESCRIBED VIDEO SERVICE WAS OFFERED BY ALL CABLE SERVICE PROVIDERS ON ALL TV PROGRAMS AND ON ALL BLU-RAYS, DVD'S AND STREAMING MEDIA DEVICES JUST LIKE CLOSED CAPTIONING IS for the hearing impaired.  As the parent of child who was not born blind, I have observed that many advancements in technology further isolate the visually impaired population by focusing on features that only a sighted person can use.  Perhaps this topic will become more important for more people as the population ages.  In the meantime, I am BEGGING the makers of this product to get a jump on the others by adding a feature that will allow the visually impaired audience to enjoy the video content with descriptive audio when it is available (not all shows and movies have it which is another problem altogether).  It would really be AWESOME IF DESCRIPTIVE VIDEO SERVICE WAS AVAILABLE regardless of whether or not it is offered by the cable provider or on the TV itself.  Features that would allow viewers to select descriptive video service, like choosing a preferred language or choosing to enable the closed captioning, would vastly accelerate the appeal of this product.  The voice search is a great start....please continue to move forward for the visually impaired and their families!!!!", "verified": true, "helpfulness": "0/2", "author": "= Access for the Blind"}, {"rating": 5.0, "review": "Bought this for my mother's birthday so I can't personally say how wonderful or terrible this product may or may not be but from the input I've heard from her this product is very enjoyable. Even if it did take her a month to finally hook up- lol.", "verified": true, "helpfulness": "0/1", "author": "Andrea Hoskins"}, {"rating": 5.0, "review": "Easy to set up - works great. love the voice search. (but it only works on the Amazon site, if you move into netflix or hulu or something, the voice search is \"off\"). Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "V. Kibler \"vjkb\""}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/1", "author": "Keisha"}, {"rating": 4.0, "review": "it.s all good its just not what i need i had to disconnect my DVD player in order to connect this device and then i was not able to play my DVDS.", "verified": true, "helpfulness": "0/1", "author": "geronimo"}, {"rating": 3.0, "review": "Ive had Apple TV for several years and decided to switch to Fire TV,  and yes,  the list of movies is endless.  However, I'm findingthat so many of them are for rent and not free.  Then another reason I bought Fire was for the games and there is the HUGEdisappointment,  Amazons advertised hundreds of games,  but most are for sale,  and the free ones are totally boring.  NOW,let me say that the remote player,  first comes with NO instructions on how to use it,  or at least very little.  Im sure if I were12-15 years old, I would instantly get it,  but Im not and I don't!!!  I feel like its $50 wasted.  Unless you have young children in thehouse I would not recommend buying this.", "verified": true, "helpfulness": "0/3", "author": "Frank Garner"}, {"rating": 5.0, "review": "better than my roku.  roku is too slow.  fire is fast and easy to re-program.", "verified": true, "helpfulness": "0/0", "author": "Kai Yuen Kwan"}]