[{"rating": 2.0, "review": "Ended up sending it back because the controller did not work at all.  Amazon refunded me 100% but the inconvenience and disappointment of having to return it made me question buy refurbished again.  Not to mention, the refurbished cost wasn't really much cheaper then the cost of a new Fire TV.  Instead I bought a Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "dwoolf"}, {"rating": 4.0, "review": "kids love it", "verified": true, "helpfulness": "0/0", "author": "Karyna"}, {"rating": 2.0, "review": "Amazon promises the world with the fire TV, but they don't tell you how bad the prime selection is. Their is no separation of free and paid content, so often times you see an old movie you want to watch say Mad Max come to find out they want 4 dollars the movie was filmed over thirty years ago. Spongbob cartoons past the second season are 2-3 dollars. the selection of apps for streaming content from your computer sucks. overall I would say save your money unless you like to pay high prices for old content.", "verified": true, "helpfulness": "0/2", "author": "KM"}, {"rating": 4.0, "review": "its about the same as the stick, same interface let downs but the hardware is great", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "We use this device everyday and love it", "verified": true, "helpfulness": "0/0", "author": "Teresa Anderson"}, {"rating": 5.0, "review": "I love my Amazon Fire TV!  I ordered the box and it arrived on schedule. It came already registered to me so the set up was quick and easy and since I am already a Prime member, I was able to start watching all my favorite TV shows, and movies right away.  The light and sleek matte finish controller is exquisite! I wish all controllers were so easy to use. I plan to add this item as a gift for family. My best purchase this year!  I highly recommend this product....Thank you Amazon!", "verified": true, "helpfulness": "1/1", "author": "LAURA ORTIZ"}, {"rating": 4.0, "review": "Only reason I am not giving it 5 stars is because I purchased the Fire box and stick to eliminate my 170 dollar direct tv bill.  The wording in the description made it sound like paid for features, such as hbo go would be included with my Amazon Prime membership.  When I connected both the box and stick, the set up prompts me to choose which cable company I have to be able to watch HBO and Showtime.  Lame, the whole point of buying these items was to disconnect my cable company.  Why would I need these devices, if I still had cable?  Lame.  Otherwise, it's fast and has lots of great features and access to movies that do come with my prime membership.", "verified": true, "helpfulness": "1/1", "author": "j. jones"}, {"rating": 5.0, "review": "Amazon Fire TV is the best box for Internet Streaming. The processor is extremely fast, responding instantly to all commands. I have been using a TIVO to stream Netflix and it is so slow that I have to use my PC to add movies to My List and just watch them using TIVO, even then it takes several seconds to respond to each command. The Fire TV appears to have enough excess processing power to keep up with the software as it continues to develop.Fire TV is the only streaming device that supports Surround Sound with a separate output so I can connect it to my old Surround Sound System. Other boxes support Surround Sound but you must have a Surround Sound System which switches HDMI Signals. Now I can listen to surround sound when streaming movies. This box also supports captions which is very important to me since I am hearing impaired.I am very happy with this purchase and would recommend this product to anyone needing an Internet Streaming Device.", "verified": true, "helpfulness": "0/0", "author": "GAP"}, {"rating": 5.0, "review": "Works great.  This item is extinct with the release of the Fire TV stick.  I have both this an the stick.  There is no difference in quality: I should have purchased all sticks instead.", "verified": true, "helpfulness": "1/1", "author": "Pipsqueak"}, {"rating": 5.0, "review": "excellent box very fast download", "verified": true, "helpfulness": "0/0", "author": "no name"}]