[{"rating": 4.0, "review": "I am enjoying my Amazon Fire TV, and it is wonderful for Amazon Prime shows and Premium Channels (I had to subscribe to HBO to watch all the old programming I have missed over the years. Six Feet Under -OMG!)  I am frustrated that there isn't a Comcast Infinity App, and that is the reason for the 4, rather than 5, stars.", "verified": true, "helpfulness": "0/0", "author": "Jan Coffelt"}, {"rating": 5.0, "review": "My family enjoys watching nix on it. It's really nice.", "verified": true, "helpfulness": "0/1", "author": "babygj"}, {"rating": 5.0, "review": "It's great. Once I got the correct connections for my older Bose surround sound system it's absolutely great. I needed to take the fiber optic sound to component to hook it up with my Bose systemI love it !!!!", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 3.0, "review": "Great for Amazon-related stuff, but pretty weak otherwise. For me, I use many ecosystems equally, so it wasn't great...probably can be improved by software (as with Boxee Box, which went from nearly useless to awesome within a year.)", "verified": true, "helpfulness": "0/0", "author": "Mint Octopus"}, {"rating": 3.0, "review": "This was an impulse buy.  I should have researched more.  The ONLY thing I like about it is the microphone.  It adapts quickly to your voice and responds accurately.  Other than that, I am disappointed in the number of programs, movies, etc. you have to buy.", "verified": true, "helpfulness": "0/0", "author": "Camella J. Stiemke"}, {"rating": 5.0, "review": "Easy to use. Could use more entertainment apps, but I am still happy.", "verified": true, "helpfulness": "0/0", "author": "Lisa Rebsomen"}, {"rating": 4.0, "review": "The quality picture for Netflix is Poor. Everything else is 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Gonzodud"}, {"rating": 5.0, "review": "Great streamer! Snappy and easy to set up. Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "John Aloia"}, {"rating": 4.0, "review": "I would have liked to keep this device except for one major thing: Amazon Fire tV does not support Dramafever! That happened to be the one channel that my wife loved and watched the most, so I had to order a Roku 3 for her. I could stream it from her iPad via Airplay, but that seemed to defeat the purpose of having this super media streamer. I struggled a little bit on deciding to return the Fire TV, even after getting a Roku 3, as I really like it.Everything else about Fire TV is what you would hope for in a media streamer. Easy set up, fast and powerful, voice search, games..Nice, compact foot print and well desgined remote. The one thing that most others do not have (except Apple TV)  is optical audio output. Streaming HD movies from Netflix and Amazon Prime is a whole new experience, no hick-ups, almost no buffering what so ever. I have not had a downgrade to standard definition even once the whole time I used this device.If not having Dramafever is fine with you (I guess that is true for 99.999% of population), then by all means the Fire TV should be on the top of your list, when buying media streamers.", "verified": true, "helpfulness": "0/0", "author": "H. Dinh \"shooter\""}, {"rating": 5.0, "review": "I love it! This is the first item like this that I've purchased and it was very easy to set up and use. I'm really happy to learn that by the end of the year we can get hbo go on it too. The voice search is great and I love how compact and light the box is. We have it located behind our tv so its out of sight and we have no issues. I would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "jcourt"}]