[{"rating": 5.0, "review": "So happy and pleased with my new Fire TV, it couldn't be any better. Voice search and quality of the product itself is quite impressive.", "verified": true, "helpfulness": "0/0", "author": "doina"}, {"rating": 1.0, "review": "not working out of box. had to reset many times. bought fire tv mount and mount it behind tv. 3 days later it fell and broke. now amazon say they will not do refund. suck", "verified": true, "helpfulness": "1/2", "author": "Baljinder Jassal"}, {"rating": 5.0, "review": "Love my Fire TV, so easy to use!", "verified": true, "helpfulness": "0/0", "author": "booksuper8 \"booksuper43\""}, {"rating": 5.0, "review": "we love it we have all the channels on direct tv but can't watch a whole season at once.", "verified": true, "helpfulness": "0/0", "author": "Kary Kutzler"}, {"rating": 4.0, "review": "I love it! It did take me a little bit of time to get used to all it can do.  I'm not a geek....far from it and it was pretty simple to use.", "verified": true, "helpfulness": "0/0", "author": "Vera M. Krampen"}, {"rating": 2.0, "review": "Worked fine for a few days.  Then the unit would not power up.Trying to return and replace.", "verified": true, "helpfulness": "0/0", "author": "Mille Quinn"}, {"rating": 5.0, "review": "Easy set up.", "verified": true, "helpfulness": "0/0", "author": "l.delong"}, {"rating": 5.0, "review": "So Wonderful that I can Watch Soooo Many TV Shows & Movies with out commercials & pause for a snack, answer important calls, etc., & pick-up where I left!! There is much more to learn & enjoy! It's Amazingly Affordable! THANK YOU AMAZON!!!", "verified": true, "helpfulness": "0/0", "author": "Judy Brown"}, {"rating": 5.0, "review": "This is so much better than my Roku!", "verified": true, "helpfulness": "0/0", "author": "Caffenate"}, {"rating": 5.0, "review": "This is a great little device.  Does what it claims to do well. Picture is great, speed is great. I love the voice search button too. Love how prime videos are separated and when you click more ways to watch it will show, in case hulu has it for free.  Two things though. 1st of all please fix the bug that hulu plus has right now. I don't get the picture,  only sound, which is a common problem from the reviews.  2nd of all the cable that connects to the device and TV is sold separately.  I wish I knew because I had to wait for the cable after I received the device. Other than that it's great.", "verified": true, "helpfulness": "0/0", "author": "sesame"}]