[{"rating": 5.0, "review": "So easy to hook up and use,  I have Chrome on another TV and will eventually replace it with another amazon fire TV. I love the remote!!!", "verified": true, "helpfulness": "0/0", "author": "happy grandma"}, {"rating": 4.0, "review": "Extremely easy set up, responsive controller, and a relatively user-friendly interface...I have only had it about two weeks and have really enjoyed it. The reason I gave it four stars out of five is that sometimes the streaming is inconsistent. Although, that issue may not be the fault of the Amazon Fire TV box, but might have something to do with my internet service. Also, if you are buying it for apps like Netflix, Hulu, and other TV and cable channels, you might be surprised to find that they are not front and center on the main screen and that you have find them in other pages. There are numerous gaming apps which is great if you have kids but might become an irritant if you already have a gaming console or don't want to play games. That's my only gripe. Other than that, you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 4.0, "review": "it's  really cool!!", "verified": true, "helpfulness": "0/0", "author": "patricia davis"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "james"}, {"rating": 5.0, "review": "simple and easy to set up and use/very pleased with the service, much cheaper than renting most everything from Comcast on Demand----Amazing amount of \"included\" Prime viewing.", "verified": true, "helpfulness": "0/0", "author": "Robert C. Schultz \"PO'D\""}, {"rating": 4.0, "review": "I haven't figured out  all the options yet but I'm trying something different each time I log in.  So far I really enjoy many of the selections I have especially the old westerns, mysteries, and old and new TV series.  In the short time I have it I find myself watching NETFLIX more than the TV. So far I'm at 4 stars it may be 5 stars the more I get into it.", "verified": true, "helpfulness": "1/1", "author": "Cheri"}, {"rating": 2.0, "review": "We cannot access comcast/xfinity on the Fire here in the Bay Area.  There is a software issue where we have to reboot it regularly, almost every time we turn it on.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon Fire TV is great.  It is fast, easy, and has a great selection of programming.  I gave many as gifts this year as it is truly the gift that keeps on giving!  Voice activated search makes searching for anything a cinch. I particularly like the blue tooth feature that allows you to hang it on the back of the TV out of sight.", "verified": true, "helpfulness": "0/0", "author": "Kaye Elam"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Very easy set up and the box is not huge which makes it easy to place by the TV. Happy with the voice control and not having to manually search for titles. Only down side is I was hoping to receive more free movies and shows with my prime account. Everything is either a rental or buy very limited selection for free movies.", "verified": true, "helpfulness": "0/0", "author": "Scott Miller"}]