[{"rating": 5.0, "review": "My friends are delighted with this gift.", "verified": true, "helpfulness": "0/0", "author": "Philip E. Madrid"}, {"rating": 2.0, "review": "The reproduction of video is much superior to the older device I was using.It has a major flaw in the way it requires searching through menus to find the free Prime payment option.  It defaults to the pay method when the next episode is selected by an unwary viewer incurring a SEASON purchase charge.Other sources are not searched by the voice search only Amazon.", "verified": true, "helpfulness": "3/3", "author": "Old Mac user"}, {"rating": 5.0, "review": "Great streaming experience. By far the best compared to other devices in the market.", "verified": true, "helpfulness": "0/0", "author": "gg"}, {"rating": 5.0, "review": "This almost fully replaced my Roku2. With the exception of a few lacks, and a few issues with the UI, it is a great joy.The good:Youtube works better on it than it ever will on Roku. The only exception is Youtube constantly asking me to sign-in/link to see videos.The UI in general for frequently used programs is niceThe ability to side-load things onto it that aren't available on Amazon.The vast majority of things.The bad:I can't get the one app I really want on it, but this is their fault, not Amazons. Amazon has given me a little wiggle room in their side-loading, but it doesn't make it a lot better.The UI can get clunky finding anything beyond what it wants me to see. Luckily most of what I look for is Netflix and games, but I would love the ability to trim the menus and get it a bit slimmer. And the lack of the ability to change the UI makes it a bit annoying in that we have to go to 3-4 different menus, and enter a password, just to run applications we have installed. This is an unreasonable pain.So really, if they just fixed up the UI a bit? This device would be pretty much perfect. I do worry about gifting one out though, as it would probably come pre-configured as me, so I am thinking I might end up getting my friends a gift card or something with instructions: \"Go buy this.\"", "verified": true, "helpfulness": "0/0", "author": "J. Kelly"}, {"rating": 5.0, "review": "I read a number of the reviews on this item and I was just a little skeptical...we have Comcast and I know how expensive it can be to rent/buy movies.  One of the reviews was from a woman who also had Comcast and raved about how much of a difference this Amazon Fire TV has made.  So I decided to give it a try...luckily Amazon was offering a reduced cost for Prime members and that's just what I was looking for.  WHAT A GREAT FIND!  This was not only extremely easy to set-up but once set-up, exceeded my expectations.  Even my husband was impressed when I walked him through it.  I am so glad I gave in & purchased the Amazon Fire TV...now I can watch anything I already own on my Kindle plus my Prime Instant Video selections for movies/TV.  Definitely recommend this item!!", "verified": true, "helpfulness": "0/0", "author": "MommaDukes \"MommaD\""}, {"rating": 5.0, "review": "AWESOME!!!", "verified": true, "helpfulness": "0/2", "author": "Ray R."}, {"rating": 4.0, "review": "It opens up new worlds of entertainment.", "verified": true, "helpfulness": "0/2", "author": "Douglas C. Smyth"}, {"rating": 5.0, "review": "I have been using the Fire TV, for about a month.  It is easy to set up, and use. The size is very small, allowing you to set it anywhere.  I love the feature, that gives recommendations. This allows you to see lots of content, you wouldn't other wise be aware of.  I do wish it had an off switch.  I have had to unplug it twice to get it to turn off.  Other than that, I think it is excellent.", "verified": true, "helpfulness": "0/1", "author": "rosie"}, {"rating": 5.0, "review": "Awesome device, super simple setup and use. Limited app support mainly due to its newness. Much easier to use than a chromecast for those less technically inclined. Works awesome with my plex server.", "verified": true, "helpfulness": "0/0", "author": "A.Technohollic \"Technohollic\""}, {"rating": 3.0, "review": "First, a perspective: I own an Apple TV (3rd gen/720p), Roku 3, and Chromecast.  We've been Prime Members (two in our household each paying $79 now $99/year) since its inception.  We spend a ton with Amazon, own multiple Kindles, and have a large (purchased) Amazon Music library.I purchased the Fire TV (locally at Best Buy) when we added a TV in our basement and I needed to \"back fill\" streaming on a lightly-used spare bedroom TV.Unboxing: the package is quite heavy compared to the other products.  This is obviously due to the quality device (as an aside, while substantial, the remote isn't as hefty as I thought it would be).  Note to folks with wall-mounted TV's and small spaces - weight could prove to be an issue finding a place for Fire TV (we hang the Roku on the back of another TV and the cables do a fine job holding it up).  Another note: like all similar devices, there are no wall screw holes - it's just shiny black plastic on top/edges and dull plastic on the bottom.Now for the punchline (and the most important reason that I returned it after two days) - PBS Kids (and other kids channels) are for-fee in a subscription.  This is NOT trivial: with a couple kids (separate profiles), this comes out to $119.88 per year.  This was a key reason for purchasing the device - kids shows.Yes, ESPN, Netflix and other services are here.  But the \"binding\" to \"Amazon first\" and differentiation via gaming (plus need for a $50 controller) tipped the scales to other devices.Other annoyances:- The remote isn't as natural to use as I've come to expect from Amazon's hardware (Kindle, Kindle Fire, etc.)- The video quality wasn't as good as other services- I felt \"bound\" to Amazon's library and services.  Kind of like Kindle Fire (tablet) drives to Kindle books first.- \"Watch Disney Junior\" is an \"app\".  It's a \"purchase\".  I actually have it in my queue to \"review\".  On Apple TV and Roku, it's a channel.", "verified": false, "helpfulness": "3/3", "author": "lindros"}]