[{"rating": 4.0, "review": "Gift from my Daughter to replace my Roku.  It is great.  Using it as my primary TV smart addition.", "verified": true, "helpfulness": "0/1", "author": "Paul I."}, {"rating": 5.0, "review": "Love it.  Streams great, simple to set up, easy to search (especially with the voice search), love having a prime menu because I'm a cheapskate and like to find free tv/movies.  No complaints so far.  Thanks Amazon!", "verified": true, "helpfulness": "1/1", "author": "kevin"}, {"rating": 4.0, "review": "It was easy to set up and use. The only issue is that a lot of the time I cannot download a movie due to slow internet. But if I use the Netflix app, no issue with internet speed. When all the starts align and the net speed is okay, it is great. ( I have the highest speed DSL with AT&T;).", "verified": true, "helpfulness": "0/0", "author": "Carolina Conn"}, {"rating": 5.0, "review": "This is a great product with a lot of free services", "verified": true, "helpfulness": "0/0", "author": "Gary N Whiteside"}, {"rating": 5.0, "review": "Love it--makes getting movies and series easier.", "verified": true, "helpfulness": "0/0", "author": "Teach \"Pode2\""}, {"rating": 5.0, "review": "I canceled my cable way before it was popular to do so.  I subscribed to Netflix and Amazon Prime and used several different devices to stream over the years.  Hands down, Amazon Fire TV is the way to go.  Not only does it have voice recognition and the best menus I have seen, but if you have a person who likes to play games, you get Play Station and X-Box type games for free or very inexpensive.  My daughter is still talking about how much she loves the games and everything else about this product.  Amazon knocked it out of the park with this one.  I also love my Kindle Fire and looking very forward to getting The Amazon Echo.  Move over Apple, Amazon is taking over.", "verified": true, "helpfulness": "1/1", "author": "Stephen M. Geraci \"Steve-o\""}, {"rating": 5.0, "review": "I'm very pleased with my new Fire TV unit.  It offers some of the best programing choices I have come across.  I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Charles L. Muessle"}, {"rating": 5.0, "review": "Fire TV is exactly what we had hoped for. With all the movies to choose from and music we have had lots of enjoyable days and nights", "verified": true, "helpfulness": "0/0", "author": "Eugene Pozzi"}, {"rating": 5.0, "review": "Love this. Now my TV is smart and I enjoy Prime selections", "verified": true, "helpfulness": "0/0", "author": "ABootthang"}, {"rating": 3.0, "review": "Had several difficulties getting set up but enjoying many features.", "verified": true, "helpfulness": "0/0", "author": "Karen Swords"}]