[{"rating": 4.0, "review": "Would be 5 stars if the CBS app was available on Fire TV and Fire Stick", "verified": true, "helpfulness": "1/1", "author": "Kevin Hammann"}, {"rating": 5.0, "review": "With a little bit of research and tinkering this has replaced pretty much everything on my entertainment center. Does not disappoint!!", "verified": true, "helpfulness": "0/0", "author": "cody umphlett"}, {"rating": 5.0, "review": "Great device; runs all the major apps and unlike any other device, let's me watch my home TV via a slingbox app.", "verified": true, "helpfulness": "0/0", "author": "Michael E. Hughes \"MEH\""}, {"rating": 5.0, "review": "I was very pleased with item and with the speed of delivery. The only complaint I have is it doesn't have an app for my vudu streaming account.", "verified": true, "helpfulness": "0/0", "author": "daniel moore"}, {"rating": 3.0, "review": "It has some nice features like the voice search & Apps such as Netflix load quickly. However, the sound often has a high pitch sound & when I unplug it to reset it, the sound is fine but for only about a week. I contacted customer service & tried what they said, but still at the same issue. I was going to get another one but doubt it now.", "verified": true, "helpfulness": "0/1", "author": "K50"}, {"rating": 5.0, "review": "I absolutely love it! I am an Amazon prime member and Fire TV absolutely enhances the prime experience!", "verified": true, "helpfulness": "0/0", "author": "Cory"}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "Pvtbubba"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Ted"}, {"rating": 5.0, "review": "Very handy to have to see all my favorite apps! Our SmartTV in our bedroom came with pre-added apps and wouldn't allow us to download Amazon Prime TV on it! I was so upset- that was the whole reason we bought that SmartTV so this is the perfect inexpensive solution. Works great! We love it!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Colyar"}, {"rating": 4.0, "review": "Great product, it gives you access to numerous things to watch for your viewing pleasure. The remote could/should be update so that the functions are clearly marked.", "verified": true, "helpfulness": "0/0", "author": "BJ"}]