[{"rating": 5.0, "review": "Again... easy to set up, navigate and enjoy.", "verified": true, "helpfulness": "2/2", "author": "Bryan Pfeifer"}, {"rating": 5.0, "review": "It is a great advantage for the entertainment. At this moment I or better we used more than DTv. It will give more options to watch if u used it with prime.", "verified": true, "helpfulness": "1/1", "author": "Frank J."}, {"rating": 5.0, "review": "We absolutely love our Amazon Fire TV. After deciding to cut back on our cable plan, we purchased the Amazon Fire. We rarely watched cable and when we did, it was mostly kids shows (we have two sons). Anyway, this item is awesome! It was easy to get set-up, and it's very easy to use. There is tons to watch for free and when we've wanted to purchase a particular movie or show, it was quick, easy, and painless. :)  We love our Amazon Fire and use it daily. I would highly recommend this product! Great job, Amazon!!", "verified": true, "helpfulness": "1/1", "author": "MinionMomma7"}, {"rating": 5.0, "review": "The big brother of the FireTV stick, this is a superb media playback device with access to a large variety of apps. Watching Hulu Plus, Netflix, Amazon Prime Video and much much more has never been this easy.", "verified": true, "helpfulness": "0/0", "author": "Abele Stoelwinder"}, {"rating": 5.0, "review": "Thought I would not like this and sand it back but now that I got into this am glad to buy This and will buy it again for my other tv", "verified": true, "helpfulness": "0/0", "author": "timothy"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "1/1", "author": "Stephanie M."}, {"rating": 1.0, "review": "Really love Fire TV, but hate that Amazon has started adding commercials.  Since I'm paying for Prime, I shouldn't have to watch these ads.", "verified": true, "helpfulness": "2/3", "author": "David"}, {"rating": 5.0, "review": "Great alternative to traditional cable, easy to install, mount and use, The voice command function is great", "verified": true, "helpfulness": "1/1", "author": "Don Griffin"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 3.0, "review": "It's okay. Definitely overpriced", "verified": true, "helpfulness": "0/0", "author": "blake"}]