[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Robert T. Sonnenberg"}, {"rating": 5.0, "review": "So far best one.", "verified": true, "helpfulness": "0/0", "author": "Sorka"}, {"rating": 5.0, "review": "Awesome! Love it! :)", "verified": true, "helpfulness": "0/0", "author": "Blackjack"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Monica Finley"}, {"rating": 1.0, "review": "This thing was going to be a media hub for my collection of digital movies, but it's been nothing but a pain.  I bought this on sale with the expectations of using Plex to stream much of my local media collection.  As I stated in my Plex review, this worked perfectly with the very first launch of the app, but hasn't since.  I live in an area that doesn't have a major broadband carrier, so I use one of the sattelite providers.  This means that my bandwidth is metered and not very fast, which also makes the other functions of the FTV almost useless.  I really hope I can get a refund on this thing because so far it's been $70 down the drain and nothing but a headache....", "verified": true, "helpfulness": "1/3", "author": "Papa007"}, {"rating": 4.0, "review": "Easy to install, however some of ads are misleading such as free HBO to go and TV shows current ones are not free like Justified.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Loy"}, {"rating": 5.0, "review": "Comes preconfigured with your Amazon account details.  Enter your network info and it is plug and play.", "verified": true, "helpfulness": "0/0", "author": "GSB"}, {"rating": 5.0, "review": "This device works seamlessly.  Easy to set up.  Easy to use.  The design is simple.  Upon completion of watching a show, or a certain period of inactivity, it will automatically go to scenic pictures for the screen saver.  The pictures change, as in a slow motion slide show.  The pictures are stunning.  I had a friend over and noticed this.  He has a Roku (which I am not familiar with).  He was amazed at the pictures produced from this device. He was wishing he had purchased the Amaozn Fire instead of the Roku.  I can not think of any complaints.  I signed up for SLING TV through Amazon.  Initially, I was unsure where to find it.  When I called Amazon for support, the agent was not familiar with it.  I had even forgotten what the app was called, as it had been awhile since I signed up for it.  Went back to my account and found that it was SLING.  Fairly easy to use once the app is opened.  The agent and I discovered how to navigate the app by trial and error.  I prefer this over the Fire stick.  It is not difficult to move from one TV to another if you desire to do so.", "verified": true, "helpfulness": "0/0", "author": "Vicky R."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Robert  E. Sherman"}, {"rating": 1.0, "review": "Do you have to have WiFi to use this", "verified": false, "helpfulness": "1/9", "author": "Aundrea"}]