[{"rating": 5.0, "review": "I was quite suprised at how small this little box is.  But, it proves size does not matter.  It is what it can do that matters.  I hooked it up in an area that has a weak signal for all my other wifi devices.  Not only was it able to hook up just fine, there has never been a lag with it.  The remote is also small, but it really is well designed.  It's voice recognition works very well too.  I have tried it out with a few different movies and tv shows, and it had no problems bringing up what i was looking for, first time.  I really like this little box.  As a Prime member, this answered my problem easily to watch movies on the tv, instead of my other devices.  Just wished it  was a little cheaper.", "verified": true, "helpfulness": "1/1", "author": "Ted L. Desanti"}, {"rating": 5.0, "review": "This is awesome and so easy to use.  I love it! I recommend it to anyone.  It streams the best.", "verified": true, "helpfulness": "1/1", "author": "Jane Walker"}, {"rating": 1.0, "review": "I have changed my rating to one star.The device often requires restarts, APP re-installs, and account resets.  When compared to the ROKU, the Fire losses in every single category with the lone exception of voice search. The ROKU is easier to use with better menus and more services all in a more stable hardware platform. If you really feel the need to speak to your remote control, then this is the device for you. You could buy a far superior product and just forget the hype.If you are new to online streaming and an Amazon Prime Member this might be an okay option. If your a current Roku user this may not be worth upgrading to.I purchased one the day it became available.The Fire TV came well packaged, but those with limited motor function may have a difficult time with the plastic wrap.  It is solid an appears well made.Set up was easy, although the information about how to \"Sling\" your Kindle Fire to your Fire TV was lacking.As a prior Roku user, I will be using it as a comparison.As it is now, The voice search function is part useful and part  gimmick. It searches within the app list or Amazon. For example, you could say \"Hulu,\" and it will go to the Hulu app. You can also say a movie title and it will search for that movie title. Here is the catch though, it only searches within Amazon movies. Roku has a search function (not voice) that allows you to search the vast number of apps with movies available. For example, if you were to type movie title XYZ into the Roku search box, you could get results listing the movie on Amazon for $2.99, Redbox, $1.99, Crackle Free, and Netflix Free. Now, that's an useful search tool! The Fire TV's voice search does work well within its limited abilities.The number of apps available on the Fire are very limited. I will not list all the available channels on the Roku, but it is vast. The Fire came with but the tiniest fraction of these. Some of the apps left off the Fire are puzzling. One was the Amazon Music Cloud Player. This is available on the Roku, but not the Fire?  This is a silly oversight by Amazon.The Fire TV's menu is functional but not fantastic.  It's limited number of apps make it useable now, but if new apps are added, and lets hope they are, the menu could easily become an ugly mess.The Fire is a powerful little device. It  beats Roku in speed and stability. Hulu is a notoriously buggy system hog that can cause the Roku to stop or stutter. The Fire while not immune to Hulu's issues handled them so much better. While the Roku may crash over dealing with Hulu, Fire simply required a button push to get back on track.Over all, this is a powerful little device with a lot of potential. Unfortunately, its very limited number of apps even ones offered by Amazon on other devices  limit the Fire TV's appeal.", "verified": true, "helpfulness": "3/3", "author": "B. Phillips \"BLP\""}, {"rating": 5.0, "review": "I was afraid to dump my dish for fear of not having anything to watch, well FireTV has tons of stuff to watch if you get Prime with it. And all the apps you can add-on just give you more.Recommend it to anyone who is thinking about cutting the cable bill.", "verified": true, "helpfulness": "1/1", "author": "eekster"}, {"rating": 4.0, "review": "Very fast, streaming is high quality. Would like to see a unified search function. Lack of an hdmi cable is a bit on the stupid side Remember out of box experience amazon, if you have to run the store to pick up a cable that would have cost amazon a few dollars, it will cost you an additional $10 at least.", "verified": true, "helpfulness": "0/0", "author": "Robert Carte"}, {"rating": 5.0, "review": "easy set up - getting used to it was easy - just need more time to view thing on it", "verified": true, "helpfulness": "0/0", "author": "Alan Isaacson"}, {"rating": 5.0, "review": "I kept looking at this and reading about it until I bought it. I love it and talk about easy to setup. This is something I am telling my family and friends about.", "verified": true, "helpfulness": "1/1", "author": "Sue"}, {"rating": 4.0, "review": "Free titles include, \"Godzilla, King of the Monsters\" and \"Zeta One\" a story about topless large-breasted women who come to earth to capture men to repopulate their planet. Oh joy. There are many more. How about, \"Prison Girls\" or \"Women's Prison Massacre\" or better yet, \"Caged Women in Heat?\" I'm gettin' right on that one, yeah. On the bright side, there are some good movies you can watch free, but you do need to sift through the enormous pile of junk to find them. Wait...\"GI Joe\" is free...C'mon Amazon, give us what you implied you were giving us. I wanted to watch an \"Bringing Up Baby\" from 1938, and it's 2.99 to rent. WHAT???", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Harman Books\""}, {"rating": 1.0, "review": "I wish I could give it a negative star!Right out of the box this unit had trouble.  The opening set-up blinked on and off and made it nearly impossible to enter our password for our home wi-fi.  Had to call Tech Support and they couldn't solve it after factory resetting it.  Amazon was supposed to send me another unit to try and I was supposed to get it Tuesday, 4-29-14, but it did not arrive.  Very upset with this experience though Mary in tech support really tried to help us and was very professional.", "verified": true, "helpfulness": "4/8", "author": "Linda C."}, {"rating": 4.0, "review": "The only reason this isn't 5 stars is due to apps/content not being there.I replaced my Roku 2 LT, which was slowly dying.  The Fire TV is much improved device.  The UI is fluid and responsive, where the Roku was getting very laggy.  The voice search works very well, but has some room for improvement.  It will be much nicer when other apps finally integrate it.  Gaming on the remote isn't too bad, but waiting for the controller to be delivered today.This can shape up to be the dream \"casual gamers\" device.  The streaming capabilities are top notch, and gaming will only get better.  I just wish there was an option for removable storage.", "verified": false, "helpfulness": "1/1", "author": "J. Smith"}]