[{"rating": 4.0, "review": "The Amazon Fire TV lives up to its claim of faster buffering and easy use. I am using this with a \"smart\" TV and I have noticeable improvement on picture quality and buffering. I would have given it 5 stars but I am disappointed in the limited app access. I realize its purpose is mainly to promote Amazon products but most popular content is still \"buy me\". My intention is to replace my Direct TV with this service plus Netflix and Hulu Plus. I realize there's a reason Direct TV costs more but I wish I didn't have to give up so much to get the savings from discontinuing service.I would happily pay a reasonable monthly fee to Amazon for additional apps to A&E;, FX and some of the others that provide free current episodes of their popular shows. Hopefully this will be a future offering as Amazon gets feedback on their product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to use... functions great. I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "ramyx123"}, {"rating": 5.0, "review": "So far our family has really enjoyed having this. You can rent the latest movies and not have to worry about return fee's.  We are considering the prime for a year to go along with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I did not race out and buy this right away because I have a Roku and figured why get another similar device.  Additionally I realized that my internet and probably the general public as a whole does not have the ability to have the speed and capacity to provide this device the same service that it touts in Amazon's private demonstrations.  Amazon offered a 30 day trial before payment.  I accepted.  The device is faster than Roku but don't be fooled, the \"spinning icon\" is still there.  It is faster, that is true, and so far all of Amazon's prime programing is \"instant\" so that is much improved over Roku.  Much more access to things like HBO, Showtime etc. but those still have the \"spinning icon\" and for me that is what makes it just 3 stars.  I am not a video gamer so that portion is of no interest.  All in all it's just \"ok\".", "verified": true, "helpfulness": "0/0", "author": "RM"}, {"rating": 5.0, "review": "Have been very pleased so far with the fire tv", "verified": true, "helpfulness": "0/0", "author": "David JOhnson"}, {"rating": 5.0, "review": "working w/ xbmc  awsomenessss", "verified": true, "helpfulness": "0/0", "author": "manuel yniguez"}, {"rating": 4.0, "review": "Great media streaming, it is fast, great searching , and a good add on for mainstream tv/cable, it would be easy to cut the cord if you could log online with google and watch shows for free online such as AMC channel, it doesnt seem like there are many options for free shows even with Prime a lot of what I wanted to watch is more available with netflix or hulu plus....overall this product is good, what would make it great is a software upgrade where u can search the internet and more Prime shows and movies for free. Regardless it outperforms all the competition!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I really liked this product until I searched movies, shows, etc.  Amazon has grouped everything available in Prime together with items you must pay for.  Unfortunately, you can not just search for Prime content which if a member, is free.  From what I have found, every show I am interested in has a cost.  Or, worse after you get hooked on a season, as you get further into it, you have to start paying.I am using Netflix and Pandora though.  Netflix are crooks as well, as all you get are the movies that you could have previously picked up at the local movie store for .99 cents.  Do not expect to watch anything new on Netflix.It is a neat little box though, well put together with alot of potential.  Prime needs to enable the user to watch anything for free, or charge a little more.  I would quit paying for netflix if I could get the movies for free through prime.If you have a smart TV, you probably will not have much use for this.  If you dont, and want a smart TV and dont want to spend the money, this box will help you get to that platform.  I have an older plasma tv that is still great, but had no ability to be a smart tv.  With the Fire TV, I now have that.", "verified": false, "helpfulness": "1/1", "author": "andrea bellew"}, {"rating": 5.0, "review": "Worked out of the box.  Like the speech search.", "verified": true, "helpfulness": "0/0", "author": "Bill Walls"}, {"rating": 5.0, "review": "its awesome everyone should have one every product that amazon makes is always a home run!!! if you are a prime customer like me this should be in your home entertainment arsenal its one of their best items noe if we can get them to desighn a 10\" kindle?", "verified": true, "helpfulness": "0/0", "author": "kerrvin"}]