[{"rating": 2.0, "review": "The Amazon fire TV uses an RF (Bluetooth like) remote, while almost all the other entertainment devices you own use IR (Irfrared) remotes.  Most universal remotes (such as the reasonably priced Harmony range) work only with IR.  This means most universal remotes cannot operate the Fire TV.  I did not see this important fact mentioned on the web site, though it was probably mentioned in some reviews ( I didn't read them all).The Amazon Fire cannot work alone; it needs a TV and ideally a sound system to make it complete.  This incompatibility with the Fire remote means you must use two remotes anytime you are using the fire TV.  One for all components in your system EXCEPT for the Fire TV, and the Fire TV remote.  The Fire TV remote does not have back-lit keys, so is hard to use in the dark.It’s a pity because otherwise the unit works well, even though it is missing DTS sound output, which is a problem for some movies.While the free-Prime material is OK, much of the material available from Amazon is pay per view and is EXPENSIVE. $2.99 to rent a TV show - $45 for the whole season is beyond excessive.", "verified": true, "helpfulness": "3/8", "author": "Mike Palmer"}, {"rating": 5.0, "review": "best buy of the year", "verified": true, "helpfulness": "0/0", "author": "cher"}, {"rating": 5.0, "review": "love having my prime on the tv, ive rented lots more movies since ive had it, its lightning fast compared to all the others ive tried, if you have a prime membership you must get this and if you dont get a prime membership and get it.  the voice search is awsome, if you ask for a movie or show that isnt on prime it takes you to the app. where it is. I love this and its so convenient for my subscriptions like the walking dead and american horror story.", "verified": true, "helpfulness": "1/1", "author": "angela mace"}, {"rating": 1.0, "review": "Please anybody ? Can somebody tell me do u need TO HOOKED UP CHANNEL TO USE THIS ONE?!", "verified": false, "helpfulness": "0/15", "author": "Monalisa.shamory"}, {"rating": 5.0, "review": "This is a great device. GREAT. I'm not sure there's much else to say. If you've owned a Roku or Apple TV, you sort of have an idea what you're getting. The main difference with this player is that it is truly fast and the voice search, while gimmicky, does work and work well for the channels that it is able to be used on. So I'm keeping this review fairly short.Pros, Pluses and good things:Fast. Very fast. Since I've got it I haven't experienced any reboots or issues. My Roku 3, while a great device rebooted once in the first 2 weeks I owned it. The Fire TV doesn't show any signs of lag or slowdowns whatsoever.Great audio options. It's a great to hook this up to a high end entertainment system because you're going to get high quality sound. Not that the others don't offer high quality, but the Roku 3 doesn't offer Dolby Digital Surround, which would be a big deal to people who do own receivers and equipment that is Dolby Certified.Games and Android-y stuff. I'm not a gamer, which is why it's so ironic that one of the biggest reasons I got the Fire TV was because of the ability to play games on it....good games, cool games, not just Angry Birds.Teeny, Tiny, To-the-point control - and might I add, it works great.Lots of onboard storage so you will likely be able to grab quite a few games as they are released and appeal to your fancy.Wifi works great from my perspective. My apt. is by no means huge and is only on one level but where my wireless equipment is housed, I have had issues in the extreme opposite rooms when it comes to signal. Not with the Fire TV, videos come in crisp and clear and there's no buffering or lag.Enough popular channels that it would be worth it to choose the Fire TV over the alternatives if you wanted to play games on your little streamer box. FWIW, I rarely find myself using anything more than the staple channels like Netflix, Amazon Prime Video and Hulu on any of my systems. If there's one that I do really miss though, it's my anime fix, Crunchyroll which I can only get on my Roku 3.Not sure where else to go with the Good stuff so on to the Not-so-Good stuff.Cons, Negatives and not nice stuff:There are way less channels than what's available on the Roku 3. This isn't to say it's a bad thing. If you only use so and so channels then there's no reason to pass on the Fire TV, just know that there are less channels.The Fire TV has a closed in ecosystem in many respects and there are options coming to the market soon that will have a more open way of doing things, meaning that soon enough the Fire TV won't be as appealing for everyone. I am speaking about a device called the Nexus Player. It's almost a carbon copy in terms of what the device will be able to do and the channels it will have....it will have a game pad as well and even a voice control enabled remote, it will however be more open which means that you'll be able to cast the screen (screen mirror) from most if not all Android devices with the capability vs. the Fire TV which only supports casts from Fire Tablets (boo Amazon, boo!). Likewise, you can control your Roku 3 and Nexus Player from most Android phones and Tablets while you can only do so from a Fire device. I understand the reasoning behind it - however now that there is direct competition head to head, it may be a good idea to open the Fire TV up a bit more.All in all it's a great device as I have mentioned. Would I buy another or would I buy one right now? Unfortunately not. With the Nexus Player coming, I believe that will be a more worthy device due to being more functional on more Android devices. If you ONLY buy or own Amazon branded Tablets or their Smartphone then there's a good reason to get the Fire TV as the Amazon ecosystem (like Apple's) works pretty well within their wall.I'd rate the device a solid B+.", "verified": true, "helpfulness": "1/1", "author": "Neoprimal \"Tech Kid\""}, {"rating": 1.0, "review": "Horrible!! Broke in less that 3 months verry disappointed!", "verified": true, "helpfulness": "2/8", "author": "Cheyne J."}, {"rating": 5.0, "review": "I bought this because it was cheap, and because I figured I should utilize my Amazon Prime subscription for more than just free shipping.The voice-activation system is shockingly good, selection is quite nice as well. I've used it for a month or two now, with no problems. It connects to my WiFi with no issues, plays movies perfectly well with no excessive buffering times you see in other devices (though I'm sure at least part of that is due to my very high-speed internet). I don't think it's more than 5 seconds (if that) between the time you select a movie and it actually plays.Briefly used an AppleTV. Ungodly long load times which you don't see here.Quite happy with it.", "verified": true, "helpfulness": "1/1", "author": "Action Jackson"}, {"rating": 5.0, "review": "I love my Amazon fire TV, fast and nice", "verified": true, "helpfulness": "0/0", "author": "Ibrahim Qattan"}, {"rating": 4.0, "review": "I really like the Amazon RV with exception to the fact that there in no HBOgo App or others. Basically it's Amazon, Netflix and Hulu. I need access to other services that I subscribe to. \\Checked the Amazon App store and they are not available.", "verified": true, "helpfulness": "0/0", "author": "JessD \"Jessica\""}, {"rating": 5.0, "review": "Love it so much we got a second one", "verified": true, "helpfulness": "0/0", "author": "schue"}]