[{"rating": 3.0, "review": "Easy to set up and the voice recognition works good; however, voice commands don't work with Netflix streaming.  A major missing feature that other media player products provide (e.g., Roku, Western Digital) is the ability to connect a USB flash drive or external hard drive and view content such as shows, movies, videos, and photos.  If Amazon decides to at least meet the competition by providing this feature, I will by a 2nd Fire TV.  Amazon Fire TV has a USB port, so hopefully it's not to difficult to add this additional capability.  On a similar note, I like the Gary Busey Fire TV commercials.", "verified": true, "helpfulness": "1/1", "author": "HP_Steffey"}, {"rating": 5.0, "review": "Super easy to setup and use. It picks up wifi well, it can be far away and pick up our network. Remote is somewhat easy to use, wasn't sure what the black ring was for until I played with it. For whatever reason, the designers did not make an on and off button for the device on the remote. It eventually turns itself off. Voice activation always amazes me when I use it.", "verified": true, "helpfulness": "0/0", "author": "M. Barnard"}, {"rating": 2.0, "review": "im giving the product 2 stars just because the have changed the price since i bought it... it makes me refrain from buying and products as soon as they are out and wait till they get cheaper.. it is unfair for all of us who bought it for 99$ .. im waiting to see what will amazon will do to make it up for the early costumers ...", "verified": true, "helpfulness": "2/12", "author": "K.Man"}, {"rating": 2.0, "review": "you tube I mostly watch, now the big but .my reg.SUBSCRIPTION on YOU TUBE the ICON was missing.going back and forth to the  computer to pair it is waist of time.hope you fix this,if so I will purchase amazon fire tv again [I returned fire tv ]otherwise your product is excellent", "verified": true, "helpfulness": "2/5", "author": "Kindle Customer"}, {"rating": 5.0, "review": "SO CONVENIENT TO HAVE IN ANOTHER ROOM AND VERY EASY TO SET UP AND IF YOU HAVE AN AMAZON ACCOUNT IT IS ALREADY REGISTERED SO NO NEED FOR EXTRA SET UP AND FOR PURCHASES TOO.", "verified": true, "helpfulness": "0/1", "author": "Ritz"}, {"rating": 5.0, "review": "Its  a dream come true.  I can get moves I forgot about and loved.  It so easy to use and I am 81 years old.  so if I can do it any one can.Thank you AMAZON for my hours of enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Lorraine USTIN"}, {"rating": 3.0, "review": "I was needing to replace one of my Rokus that has been acting up lately (especially dropping wifi signal).  I was about to purchase another Roku when I cam across the Amazon Fire TV and since it was $15 cheaper than the Roku, I decided to give it a try.  The Amazon Fire TV is a fine product but with several personal drawbacks that would prevent me from replacing the Roku all together.  Simply put, the Fire TV is great for my basic 23\" kitchen TV but not for my 60\" inch plasma w/ 7.1 surround living room set up.  Below is a list of pros and cons (the later of which I am hoping future firmware and app updates can correct).Pros:1.  The Fire TV resolved completely my problem with wifi signal drops that I was experiencing with my kitchen Roku2.  Easy to set up3.  Voice command is a very nice feature for Amazon Prime (minus the fact that it doesn't limit itself to just free Prime content)4.  Compact design made it easy to mount on the back of the TV5.  Integrates well with Amazon's App Store6.  Gaming is a big upgrade over RokuCons: (mainly shortcomings related to Amazon's abysmal App Store selection)1.  No 7.2 surround sound support via PLEX App for DTS-HD master audio.2.  No Spotify App available (EDIT: I did find a neat trick to side load non-Amazon approved apps as a workaround)3.  The PLEX App pales in comparison to the one available on Roku.  The Fire TV App does not allow for genre search, release date search, etc.  You basically have to thumb through your entire catalog.4.  No voice search on third-party apps such as Netflix and PLEX.5.  Unlike Roku, some apps (such as PLEX) are an additional charge.  Roku offers all of their apps for free.6.  Overall, much limited content compared to Roku.Again, Amazon Fire TV shows much promise and is a nice alternative for a basic, non-DTS-HD audio sound set up.  However, until Amazon and third-party vendors update some of the shortcomings, my Roku is not going anywhere.", "verified": true, "helpfulness": "4/5", "author": "C. Wright"}, {"rating": 2.0, "review": "I want to love this device, but I can't due to a glaring issue limiting how I can integrate it into my home theater setup.  Whenever you connect it through HDMI through another device, you will get occasional static for a few seconds, then the picture\\audio will return including a toast message from the device that indicates \"Headphones Disconnected\" (or something to that effect).  If I restart the device it will generally cure the problem until the  next time I switch inputs on the pass-through device.  The two devices I have Fire TVs hooked up through are: 1) Xbox One and 2) Bose Lifestyle V35.  Both exhibit this problem, and every other device I've tried hooking up through these don't have an issue.I've waited for software update that may fix the problem but it hasn't arrived.In response to a comment regarding the problem being a bad HDMI cable:I've tried multiple (4) HDMI cables, and it occurs on both units with separate HDMI cables. One of the HDMI cables being used is the one sold by Amazon as an add-on to the unit. The HDMI cables never showed issues with the Roku I purchased either. Also, if it was the cable, why would a reboot of the device fix the issue until I switched inputs back and forth again?", "verified": true, "helpfulness": "3/6", "author": "Michael Stark"}, {"rating": 5.0, "review": "Just got the FIRE TV.. Its pretty impressive. I have AMAZON PRIME and had been using a Playstation 3. The Fire TV really improves the viewing and the finding of programs experience. I have been iusing the voice feature much more than I thought I would. It is great for finding music as well as Amazon content. Examples \"Toby Keith\" pulls up music videos... Saying \"24\" pulls up the tv series via amazon prime. Then you can even get more technical and say \"24 Season 1\" it pulls up season 1...The unit has alot of games that could be interesting for a family- I saw \"Life\" which caught my attention.. If I can find Monopoly I would download it. Be pretty cool to play that with the family. Lots of slots and poker type games... As well as alot of other stuff, fitness videos, other games, etc.It has an Optical out for audio..I would recommend this unit if you are looking for a online content system... The voice feature makes it worth the price... It understands voices. Even my 8 year old niece did it.... A++++ Product.", "verified": true, "helpfulness": "5/5", "author": "Greg \"Greg\""}, {"rating": 5.0, "review": "Nice unit.  Like the voice activated search feature.", "verified": true, "helpfulness": "1/1", "author": "Clinton A. Ford Jr. \"Flivver\""}]