[{"rating": 2.0, "review": "Sorry Amazon a little late. I have a Roku and paid 1/3 less for it. My Smart Tv in the living room does a lot of what this box does and it didn't cost me $99.", "verified": false, "helpfulness": "13/94", "author": "Roger Westfall"}, {"rating": 1.0, "review": "No HBO-Go makes this box a no-go in our house.  We watch a lot of HBO content.  The other boxes have HBO-Go, who not the Fire?", "verified": false, "helpfulness": "24/256", "author": "DKF1219"}, {"rating": 1.0, "review": "This cannot play many video file formats.  For the price you should be able to play ANYTHING you want! NUFF SAID", "verified": false, "helpfulness": "22/226", "author": "Steven"}, {"rating": 4.0, "review": "I have 3 ATVs , and 3 Rokus. biggest complaint on both items is why they don't do a WIFI broadcast when you use eth.*** Edit , a paltry 10/100 port was listed at the bottom. Not bad for well switched homes. Add a wifi hot spot when it's on Wifi and this is golden. was looking forward to a native device as a prime user since it was Beta.", "verified": false, "helpfulness": "1/52", "author": "Terrence N Thurber"}, {"rating": 5.0, "review": "Hbo go coming to fire tv next month!!So there are several points to mention in reference to this product. First, I'm not quite sure how so many people are giving it negative reviews before actually purchasing it. I literally bought it the second it was available after the launch and mine just got here today. Unless their fed-ex guy delivers before the start of the work day, they haven't gotten it and just have a lot of free time on their hands to criticize a company that is clearly \" customer driven\".I've gotten it today and it's amazing. I am pretty sure that I am canceling my cable subscription because I personally feel that every month getting my comcast bill is like lighting my money on fire. I pay for movies and channels I will never watch. I'm a prime member and I don't know any other company that gives you so many options for being a member. Some people complain about the 20 dollar price hike. Who the heck are you people? I have two young children and for an extra 20 dollars a year it saves me having to drive to target or babies r us standing in long lines, fighting through tantrums because they want everything, and finding a parking space after sitting in traffic.The device is not bulky and is classically designed. No more giant comcast box on my media console. The remote is sleek and does what it's suppose to do. The fact that they used Garry busey as their spokesperson is the funniest thing ever. I'll report more when I try the video games but as a prime member who is tired of watching all of my amazon prime and netflix shows on my phone or tablet, it's amazing!!!!", "verified": true, "helpfulness": "56/73", "author": "hgriffenk"}, {"rating": 4.0, "review": "I have not purchased this yet but am seriously considering.  I will buy this product immediately if you add the MLB.com channel.  The other features will be awesome once I purchase it.  But I want to wait a bit so maybe new channels will become available.Once I get the MLB.com channel, my rating will be changed to Love it!!", "verified": true, "helpfulness": "5/46", "author": "Vicki L. Gadolin \"vgadolin\""}, {"rating": 1.0, "review": "Why cant Amazon actually listen to its customers and put a drive in the damn thing - Tired of having to tie up my bandwidth streaming titles I own and should be able to download to a device and watch locally.  STOP RIPPING US OFF by charging us full price for movies and then treating us like rental customers.  I have hundreds of dollars wrapped up in Amazon Movies and Music - wont buy another title or song until you give me a solution that allows me to watch locally.  As it stands, I am better off paying a buck more for the DVD and passing on your \"Own a rental copy you have to stream every time you want to watch\"  This is just idiotic and an irresponsible way to do business on the internet.", "verified": false, "helpfulness": "50/308", "author": "Ogre"}, {"rating": 3.0, "review": "HBO GO is a major missing item. Also, there is no mention whether the device can be connected to a DLNA server to stream video and music. I'm looking for a device with a nice user interface that can provide that function. Apple TV has a great interface, HBO GO included but can only connect to iTunes.", "verified": false, "helpfulness": "8/61", "author": "Paul Loberto"}, {"rating": 1.0, "review": "I do not want this stuff, I do not understand why Amazon is so persistent for me to buy it.  I do not want them to  create the need for me I do not have the need this machine", "verified": false, "helpfulness": "15/330", "author": "Sevasti Gan"}, {"rating": 3.0, "review": "Please add Gaiam TV, and I'll buy this in a heartbeat.  I already have an AppleTV, so that is the only thing that would make this worth my while.", "verified": false, "helpfulness": "5/65", "author": "Shannon"}]