[{"rating": 1.0, "review": "Question::: interested in this and was wondering do you have to have cable TV for this to work, or is it self ran.  Also do you need WiFi??", "verified": false, "helpfulness": "1/6", "author": "alison carlton"}, {"rating": 2.0, "review": "I have had my box for a few months and used it rarely. Then I decided to adventure on into the kids realm to see what i could expect, and lo and behold i have officially locked myself inside DisnyXD because i need a pin to exit. I havr tried everything, I went to Amazon and logged in and tried resetting the Amazon Instant Video Pin to no avail. It remains locked evrytime i try to decode it .Fire Tv is about what its going to be if i remain in the kidz zone", "verified": false, "helpfulness": "1/4", "author": "kclower"}, {"rating": 2.0, "review": "If using to watch netflix you end up buffering a lot, to the point it becomes frusterating.", "verified": true, "helpfulness": "1/3", "author": "lblw"}, {"rating": 5.0, "review": "TV plus games all in one. Great. It is worth the investment. The movie selection is not as robust as netflix but the ability for two in one is great for the young children and adults both.", "verified": true, "helpfulness": "0/0", "author": "RPN"}, {"rating": 5.0, "review": "I like all the cool apps", "verified": true, "helpfulness": "0/0", "author": "Dwight"}, {"rating": 1.0, "review": "Be prepared for advertisements on the home screen, content that autoplays despite autoplay being turned off, recommendations for content on hulu even if you don't like or use the hulu service, even if you have removed the hulu app, constant and distracting images that blink, preloaded applications that you will have to remove yourself, and a complete disregard for a users who might not like any of these things.  It's not an experience that can be personalized.  It's a box made to intrude upon your life with constant sales pitches.  You pay for the service, you pay for the box, but apparently that isn't enough, you have to endure the whim of whomever pays them the most to shove product at you.", "verified": true, "helpfulness": "5/7", "author": "David Hadley"}, {"rating": 5.0, "review": "Turn your tv into a smart tv, One stop shop. Every easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mervin John \"Mervin John\""}, {"rating": 4.0, "review": "can i use my hotspot with this?", "verified": false, "helpfulness": "0/0", "author": "runnngflower"}, {"rating": 5.0, "review": "Worked great right out of box. Added KODI without any difficulty.", "verified": true, "helpfulness": "0/0", "author": "Tamara"}, {"rating": 1.0, "review": "1*", "verified": false, "helpfulness": "2/7", "author": "mike"}]