[{"rating": 5.0, "review": "\"Love speech to search feature!\"", "verified": true, "helpfulness": "0/0", "author": "P. Sheltz"}, {"rating": 5.0, "review": "[[ASIN:B00CX5P8FC Amazon Fire TV]I'd expressed interest in Amazon Fire TV after my son ordered a unit.  He a surprised us with one as a gift.  It offers many things that I didn't expect.  I was wondering why, as a 'Prime' member I would want one for movies, etc.  There are so many things available in free Apps that link you to science, automotive, gardening, cooking shows, news, music, etc etc that I was surprised.  This might be an answer, somewhat, to the high priced cable/satellite TV we pay for.  It's still new to us, so we're still exploring the possibilities!", "verified": true, "helpfulness": "0/0", "author": "J. Rich"}, {"rating": 5.0, "review": "great hardware.  due to distance from router, I did buy and extender and both work flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Co I"}, {"rating": 5.0, "review": "Awesome, it is really fast with great apps. Easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "mark"}, {"rating": 5.0, "review": "Excellent as advertised.", "verified": true, "helpfulness": "0/0", "author": "M. J. Cosentino"}, {"rating": 5.0, "review": "Great flexibility and depth. The voice commands actually work! I assume that it will take several months to fully explore all of the features. For now, the quad processor and 2 Gb of memory are very nice features, and readily apparent in use.", "verified": true, "helpfulness": "0/0", "author": "Phasr \"phasr\""}, {"rating": 5.0, "review": "Love it, bring on more movies and shows so I can stop my cable subscription!", "verified": true, "helpfulness": "0/0", "author": "sharon"}, {"rating": 5.0, "review": "I've used it for a week. Easy to use, absolutely no complaints. Enjoy the stills that are aired before deciding what to watch. Again very enjoyable.", "verified": true, "helpfulness": "0/0", "author": "william"}, {"rating": 1.0, "review": "Worked well for the first 5 months, now it's a pain in the **s. Constantly freezes up have to unplug it, then plug back in. Piece of junk ! I'm back to using my BD player for streaming.", "verified": true, "helpfulness": "1/2", "author": "Tyke \"Thoughtful Advice\""}, {"rating": 1.0, "review": "When it works, it works very well.  I have experienced nothing but problems with the Fire TV since the day I got it 4 months ago.  I constantly experience random crashes.  Sometimes it will freeze up and crash 3 times an hour!  I have contacted Amazon support multiple times and get the run around every time.  They are useless.  I do not recommend this product.  I will be purchasing a Roku instead.", "verified": true, "helpfulness": "0/1", "author": "EV"}]