[{"rating": 5.0, "review": "Awesome! Much better than Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Monique"}, {"rating": 1.0, "review": "Have to pay for everything even if u r a prime member. Shame on them", "verified": true, "helpfulness": "0/1", "author": "Donald Baldwin"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "jesschristine"}, {"rating": 2.0, "review": "Got this to replace a 2-year old sony Blu Ray player, does everything better except for the unusable usb port in the back. I can't play anything off of a thumb drive, and that's the most frustrating thing for me. Should have done more research first.", "verified": true, "helpfulness": "0/0", "author": "Brandon Engel"}, {"rating": 5.0, "review": "The best of all products", "verified": true, "helpfulness": "0/0", "author": "Rabea Qutub"}, {"rating": 5.0, "review": "I recently found a way to \"cut the cable\" and say goodbye to my $120 a month cable bill.I signed up for Sling TV for only $20 a month which streamed the 5 main stations I watch at night after work.They had an offer for $50 off of an Amazon Fire TV box or a free Fire Stick. I had Prime already so I figured I would like the box and went with that. The ease of use is astounding, the picture and sound Excellent and the apps are plentiful! I have this hooked up to a Visio \"55 240Hz 3D Smart TV and the picture is sharper than some blu-ray discs! Very happy!", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 4.0, "review": "The device is easy to install...just had one problem and that was the input button on the remote is different than the input selection on the tv, but once that was cleared up, it was a wiz. Some tv shows that have been off the air for about 20 years; it costs to rent the episodes, I that I can't understand.", "verified": true, "helpfulness": "0/0", "author": "George T. Alexander"}, {"rating": 5.0, "review": "I now have two of them.  I cancelled my cable and have one in the family room and the other in the basement.  Both are excellent in picking up my wifi which is located on the second story of my house.  I have absolutely no problems in streaming Amazon Prime videos or Netflix.", "verified": true, "helpfulness": "0/0", "author": "Joseph Drouin"}, {"rating": 4.0, "review": "Good but not really impressed with the voice controls.  Usually use it for Netflix and Amazon TV.  Works, is reliable and does what it says.  Easy to hook up and start using.", "verified": true, "helpfulness": "0/0", "author": "I Shop Too Much \"Ishoptoomuch\""}, {"rating": 5.0, "review": "best streamer on the market today I love it", "verified": true, "helpfulness": "0/0", "author": "FRANCIS J KOSTICK"}]