[{"rating": 2.0, "review": "could connect to tv", "verified": true, "helpfulness": "0/10", "author": "richard trapasso"}, {"rating": 4.0, "review": "It is a bit more difficult finding what I want on it than I expected.", "verified": true, "helpfulness": "1/3", "author": "Mary E Ellis"}, {"rating": 4.0, "review": "Love the service and apps.  My one suggestion is to hook up with dramafever and get an app for that.  I would love to be able to watch dramafever on the TV.", "verified": true, "helpfulness": "1/3", "author": "OUTCAST"}, {"rating": 3.0, "review": "This is a decent box, but you're basically forced to buy it if you want to watch Prime content on your TV, otherwise you're stuck with your computer.You have to go in and clear the app too often - if you have no sound, that's the problem.  Also, since I bought it, and I PAY for prime, I shouldn't have to be subjected to all the ads.  AND I AM SICK AS I CAN BE OF SEEING THAT STUPID TRANSPARENT AD.", "verified": true, "helpfulness": "2/4", "author": "David Pavlakovich"}, {"rating": 5.0, "review": "So far works great", "verified": true, "helpfulness": "1/3", "author": "jeff  Wilson"}, {"rating": 5.0, "review": "Love it. Very fast and convenient", "verified": true, "helpfulness": "1/3", "author": "Lindsay"}, {"rating": 5.0, "review": "All that and more!!!! Love it!!", "verified": true, "helpfulness": "1/3", "author": "Michael Barnswell"}, {"rating": 5.0, "review": "Great! I've used the Amazon Fire TV for about 1 month (primarily for SlingTV) and love it. I've demoted the Apple TV and will likely not be going back! :)", "verified": true, "helpfulness": "1/3", "author": "Melinda T"}, {"rating": 4.0, "review": "Works very well - it is really fast. Also works great as a portable, so when I take it to my dad's on weekend trips, the kids have something to watch. As of yet, I have not used any of the game apps, so can't comment on that aspect of the Fire. The only reasons it doesn't rate 5-stars are 1) It doesn't stream pictures from my laptop (only from the Amazon cloud), and 2) the wonderful voice search only works for Amazon products - I would so love to use it when in another app. Basically, if you use Amazon Prime a lot, this is great.", "verified": true, "helpfulness": "0/1", "author": "Richard Rohde"}, {"rating": 5.0, "review": "Awesome one of the best on market", "verified": true, "helpfulness": "0/1", "author": "Justin Tran"}]