[{"rating": 5.0, "review": "I really love my new Amazon Fire TV.  It was super easy to install and to start using.  It's very user friendly, even for the novice techies out there.  I highly recommend this amazing gadget.", "verified": true, "helpfulness": "1/1", "author": "Cindy Bush"}, {"rating": 4.0, "review": "For this being Amazon's first media streamer it is amazingly mature.  From a quick and fairly intuitive menu interface to the speedy hardware that never lags Amazon has definitely caused a ripple in the world of media streamers.  I have an Apple TV, Chromecast and a sony blu-ray player that adds the Amazon Instant Video option so when I purchased the Fire TV it seemed superfluous, but I was interested in at least trying it out.  While not imperative, in order to receive the full value of this device an Amazon's Prime Membership is must as it allows you to stream a large collection of movies and tv episodes without additional charge.  Coupled with Netflix and Hulu plus memberships you have a great streaming device that is second to none. My Apple TV was my go to streamer, but now I prefer the Fire TV because of the faster load times and it just responds effortlessly from my voice as well as my input from the remote control.  The voice search option is useful and I hope Amazon has plans to carry this over into searches with third party apps like Netflix, Hulu Plus and YouTube.  Now I have also used a Roku (and always wanted to like it), but it always felt experimental to me.  Roku's apps always had a hidden cost (in-app purchase) that wasn't apparent from download and I never felt secure with my purchases as to cancel recurring in-app charges many times was not straight forward.  With Amazon, payment is linked to my account and apps are purchased with-in Amazon's App ecosystem (model is similar to iTunes) so management of in-app purchases from third party apps is also through Amazon's ecosystem (Amazon covers this info here http://www.amazon.com/gp/feature.html?ie=UTF8&docId;=1000788541).So why four stars?  Well because I really wanted the voice search to extend beyond Amazon Instant Video app and I hope Amazon plans to carry this feature over so searches become universal. For example a \"voice\" search for \"zombie movies\" would provide results from Amazon Instant Video AND include Netfix, Hulu Plus, etc...I still use my Apple TV and Chromecast, but my Fire TV is the go to device in my household at the moment.", "verified": true, "helpfulness": "1/2", "author": "Splat Matt"}, {"rating": 5.0, "review": "The installation was very simple. The quality of the product seems to be excellent. I would recommend this product. The quality of the picture was Great, and even better than other devices that I've had in the past.I would make recommendations for some more product features. I am hoping that the USB port would be used for downloading and storage of more video and music files.I look forward to more features.", "verified": true, "helpfulness": "1/1", "author": "Clarence P. Martin Jr."}, {"rating": 1.0, "review": "Received my Fire TV on the 9th.  Prompt shipping by Amazon.  Batteries included were dead (from reading many reviews before ordering, I'm not alone).  Batteries were a minor inconvenience.  Now, the major inconvenience.  It would not / could not find or connect to my wi-fi network.  When it searched for a network on the initial set-up, it found my neighbor's down the street - but not mine 12 feet away.  Unplugged it and tried again.  From that point on, it did not even give me network connection options on the screen.  Just a blank screen except for the words \"connect to a network\".  The remote would not let me do anything.  After several attempts, called Amazon.  Chris, there, was as helpful as he could be.  I made it clear to him that I have a half dozen other devices (including 2 Kindle Fire's) that have no problems connecting.  The conclusion is the unit is defective.  Amazon is sending me another.  Defects happen and I really hope the replacement has a better \"nose\" for sniffing out my network.  Because of my call to Amazon, I found out there is a way to reset the Fire TV to factory settings (which, of course, in my situation - did not solve the problem).  To reset: hold down the right directional area on the navigation button and the back arrow button at the same time - for 15 seconds.  When I receive my replacement, I will update and hopefully be able to give this \"puppy\" 5 stars.UPDATE 4-13-14:  Got the replacement in Friday.  VERY disappointed.  Sending it back.  My 2 year old Xbox 360 streams Amazon Prime videos MUCH better than this \"the latest thing\" device.", "verified": true, "helpfulness": "352/398", "author": "Lee Monk III"}, {"rating": 5.0, "review": "Exceptional product for streaming to your TV. If you are having problems connecting your smart TV or DVD player to your network due to signal lose this is the product to buy. If you have tried Chromecast and experienced as many problems as I did; this is the product to buy.", "verified": true, "helpfulness": "1/1", "author": "David L. Miller"}, {"rating": 3.0, "review": "I like the small design and the voice remote.  But the  all the other apps and station's are too pricey for me.  I didn't do any research before I made my purchase.", "verified": true, "helpfulness": "1/2", "author": "Micael Johns"}, {"rating": 4.0, "review": "I was looking forward to this product. It sets up easily. The only complaint I have is that it is difficult to get all the videos available on Amazon prime to be brought up on screen.  Other than that it is as . I would have expected.", "verified": true, "helpfulness": "1/1", "author": "Kathy"}, {"rating": 5.0, "review": "Let me say thank you amazon for coming up with this item Fire TV is what I been waiting for I had Roku box for years but this is faster and better so I will tell others I been very Happy with this so far.", "verified": true, "helpfulness": "1/1", "author": "smiley1961"}, {"rating": 4.0, "review": "Works great for all MY families streaming needs, seamless with Netfilx and Plex. The remote is a nice change in size from my Vizio Co-Star, but I do miss the keyboard at times.Pros: Small, quick. beautiful interface. very easy to transition from other streaming devices.Cons: As many reviews have listed the voice function only works with Amazon content, not the end of the world for us but could have better integration. Only other complaint is also about the remote, no power or volume buttons to control the tv it is connected to. This is is by far my biggest complaint, 3 buttons and an ir transmitter could make this product the total package for us.", "verified": true, "helpfulness": "1/1", "author": "Cloudgazin"}, {"rating": 1.0, "review": "this product is for someone who doesn't have an xbox or ps3..or vizo tvs with hulu netflix and prime built in...i feel like i wasted 100 bucks... o well better luck next time.. Its a nice product but its a lil late to the market...wait for a price drop to 50 bucks...", "verified": true, "helpfulness": "3/19", "author": "Rel82meboo"}]