[{"rating": 3.0, "review": "I like the fire TV but some movies, the latest is james bond Firefall , has no volume. Most movies and all games have volume but a few I have started watching do not have volume. Everything else is great, Bluetooth and wifi work great", "verified": true, "helpfulness": "1/1", "author": "Jack Boyt Jr"}, {"rating": 5.0, "review": "Full 1080p HD.Excellent apps available. YouTube, WatchESPN, Vimeo, Netflix.Fantastic browsing speed.Only negative is with search within 3-party apps.", "verified": true, "helpfulness": "1/1", "author": "Brian Gutowski"}, {"rating": 5.0, "review": "I live in the mountains.  I can't get more than 2 local channels via antenna and they are usually only available on clear days.  I just cut my digital tv (through the phone company) and I get much MUCH better picture quality from the fire than I ever did with my digital cable.  Direct TV (and others like it) didn't have picture quality that compare to the Fire TV.  I'm very pleased with this little gem!  Most of the movies and tv that I would typically watch are available through Amazon, but Hulu plus and Nexflix can also be accessed via this great little device.  I'm very happy and extremely pleased with this.  I think I've found the tool that will work for me!", "verified": true, "helpfulness": "2/2", "author": "M. M. Robinson \"voracious reader\""}, {"rating": 3.0, "review": "I jumped all over this 'cause of Amazon's offer for terms, etc. Worked well at first. Bought game controller, didn't see a game I wanted to try. About 2 weeks in, it kept error messaging, wouldn't download, despite Amazon tech intervention, after a third error message interrupted my programming, I returned it. Still holding out hope, buy my Vizio TV with Amazon App built in is less buggy.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This review is for both the 8.9HD Kindle Fire and Fire TV.Once I decided to go with the Amazon Kindle products, I went round and round about what Kindle products to get. I originally bought the 8.9 HD thinking it would be connected to my TV and it would be used for that purpose only. When I got it, I found that using it as a tablet became so much more important for reading, playing games, checking e-mail, and limited surfing (I still like my lap top for major on-line work) so having it connected to my TV didn’t work for me. I sent it back and ordered the 7.5 HDX with the Fire TV in a bundle - thinking I could use both in conjunction with each other- great idea but I found that the 7.5 tablet was a bit small and it was hard to read from – I am getting older and my eyes aren’t what they used to be. The HDX had a lot more features but I found I really didn’t need them.  So I sent back the 7” HDX tablet but kept the Fire TV which is amazing! - It has a remote - so being able to sync my tablet with the TV wasn’t as important even though it would be nice. The HD will connect with the Fire TV but I haven’t figured that out yet.The TV Fire - works great! It is easy to navigate and connects to all the services I wanted to use it for – Hulu, Netflix, Amazon prime and more I haven’t tried yet. I was able cut my Dish subscription in half! I have found much of what I watched on dish can be found for free or cheaper on-line with many more benefits like movies and TV shows. Once you figure out what you want to watch you can limit the subscriptions you will want to pay for monthly. What is on Amazon Prime duplicates some of what is on Netflix or Hulu plus. I am trying them all right now and will figure out which ones I need. The tiny Fire TV box freed up space on my TV stand it is small but it is very powerful. It is worth the $100.00 price tag. If you are going to go to on-line TV watching this is the system to get. I re-ordered the 8.9 Fire HD which is terrific! The size makes it easy to read and navigate between Aps and is clear enough to read magazines with pictures that are easy to see. The 8.9 is a bit heavy but after using it for awhile I got used to it and it is manageable. The 7”HDX was extremely light weight but getting the bigger screen is a trade off that I was willing to deal with.The combination I ended up with is the best choice for me. It took me a lot of time trying things and sending stuff back and forth (Thank God for Amazon Prime – it saved me a fortune in postage). The Amazon People are great about returns. If you are looking for a combination of tablet, reader and on-line TV this is a good one.I suppose the best combination would be the Kindle 8.9HDX and Fire TV but I thought that cost of the bigger HDX was beyond my budget an extra $150.00 seems a bit high to me.I hope this helps for people that are looking for the right combination of Amazon products maybe you won’t have to go through all the trouble I did.", "verified": true, "helpfulness": "2/2", "author": "Joe"}, {"rating": 5.0, "review": "It was easy to start up and run as Amazon products usually are. I am enjoying my Amazon Prime and Netflix on it. The only issue I had was that the directions did not tell me to call it a \"receiver\" when I hooked it up to my TV. I figured it out the next day.", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 5.0, "review": "This version of media streamer is the best I have seen.  Voice recognition through the hand-held remote is so cool.  Now all I have to do is get some more bandwidth from my ISP so that I can watch in HD!!", "verified": true, "helpfulness": "1/1", "author": "67Shelbynut \"TimB\""}, {"rating": 5.0, "review": "Easy, peazy to install. Great for those of us who don't want to support big corporate cable companies. I highly recommend ten dollars a month for the GAIAM ap. It takes some getting used to because your viewing choices are different.", "verified": true, "helpfulness": "0/0", "author": "Peyhota"}, {"rating": 3.0, "review": "Does not have the channels that I watch, other vendor product meets my needs.", "verified": true, "helpfulness": "0/2", "author": "Gerald Partsch"}, {"rating": 5.0, "review": "I have used the Amazon Fire TV every day since I received the unit and so far I am well pleased with it so far.  Elvert Clawson", "verified": true, "helpfulness": "1/1", "author": "Elvert J Clawson"}]