[{"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/1", "author": "Sheca"}, {"rating": 4.0, "review": "I like it a lot the only pros I have is you need a service cable provider to watch HBO, SHOWTIME, ENCORE, AND MORE.....  And I really dislike that VH1 is not free to watch....  On amazon prime....  :-(", "verified": true, "helpfulness": "0/2", "author": "Kashun Stevenson"}, {"rating": 5.0, "review": "Awesome product. Couple it with Prime membership and you have an unbeatable entertainment value.", "verified": true, "helpfulness": "0/1", "author": "William Hay"}, {"rating": 5.0, "review": "It was good. Great specs.", "verified": true, "helpfulness": "0/1", "author": "daniel smith"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "George D Wilson"}, {"rating": 5.0, "review": "I found this on accident. What happened was I wiped my hard drive on my desktop using dban always do that nothing irregular, meanwhile my laptop has an encrypted second bootloader on it similar to TrueCrypt but way better. Anyways the bootloader some how had got infected with a polymorphic worm that made it's way past the RSA encryption. I'm a Forensics nerd. Never seen this before so I usually would stream Netflix through my machines but they are both brain dead right now so in the meantime I was going to order the roku box but that thing looks like a piece of plastic box that's over priced. Amazon Fire TV runs off an Android system. Or very similar as it uses quadcom so basically its like a phone for your TV. They need more apps but still this all you need. Yes you have to pay for some services like Netflix but chances are your ISP (internet server provider) might have TV services like AtT uverse. You can take the Amazon fire TV box to a friends and watch hbo, showtime, encore, and many other services. This is really cool it could be a lil faster but I'm pretty sure if you root it you can overcloak the speed. It has fun games. Lots of free apps along with free TV. Free movie apps. This is like a mega cheap Xbox or phone for your TV. Worth 99 bucks? Maybe 80. I love that I can plug my fiberobtic Ethernet cable in the back of the device but you can use wifi. It also reminds me of a Wii with apps in a way. It would be cool if they added a motion remote like the wii. This isn't just for streaming; its for gaming, music, connect your PC to it, movies, TV shows, maybe you have a home security camera system well if it has a network system on it you can watch your cameras on this TV. I might suggest instead of using ccleaner for memory boosting the devs should add Bleachbit instead. Works way better. Regardless this was a great buy.", "verified": true, "helpfulness": "1/4", "author": "Joshua Medina"}, {"rating": 2.0, "review": "The Fire TV uses too much data when in dormant mode.My data consumption sky rocketed since this has been active- almost 15 - 20 GBs per day.I also have a Roku and Apple TV and have never experienced extreme usage.", "verified": true, "helpfulness": "0/1", "author": "Robert Rosenbaum"}, {"rating": 4.0, "review": "Very great product for someone to get rid of cable. We only have Internet but want some choices. We bought the fire TV as prime members. We have free choices because we have Prime- if you don't you most likely will want to. Otherwise not really any choices. but Netflix and Hulu and such you must pay monthly for- it's not really in writing that's the case. On the upside it's really fast and still saving us money!!", "verified": true, "helpfulness": "0/1", "author": "C.Pong"}, {"rating": 5.0, "review": "This item is awesome works perfect. I replaced my google chrome for Amazon Fire and it was a great choice", "verified": true, "helpfulness": "0/1", "author": "Gregory Marcotte"}, {"rating": 4.0, "review": "Very cool device.  It will sinc up with I Phones and I pads.  The only thing I don't like is you have to pay to watch some tv station like tbs or abc family  etc.  to watch episodes and you can watch them if you go on to there web sight for free. but Amazon wants you to pay to watch. Dumb", "verified": true, "helpfulness": "2/4", "author": "Josh G \"Josh G\""}]