[{"rating": 5.0, "review": "MUCH better than CABLE!!!!  I have this, along with a Hulu Plus and Netflix account and can honestly say that I don't miss cable tv AT ALL. Now I think of Cable TV as Windows Vista, it was all that was available and it sort of worked. The few commercial breaks you see are short and I actually find myself pausing TV shows to go get a snack or use the bathroom. With cable, you knew you had several minutes. This is GREAT. I can pause, rewind, and do all the stuff that my much more expensive DVR box did WITHOUT having to program anything. I use to watch most TV on my DVR anyway because of my work schedule, as did the rest of my family. Hulu Plus shows most network shows the next day, which is when I was watching them already, so now I don't have to worry about missing anything, or having the DVR mess up and record the same episode 487 (ok that's an exaggeration) times. I am saving about $85 a month with this amazing box, even with the Hulu Plus, Netflix and Amazon Prime memberships.TIP: Get this full box rather than the Fire Stick. The Voice controlled remote alone is worth it, but it is also nice to be  able to download more apps and games to the Fire TV box.", "verified": true, "helpfulness": "5/5", "author": "Lyle \"ProPhotoNC\""}, {"rating": 1.0, "review": "This is great except two deal breaking flaws:1) There is no \"on\" button on the box and2) The remote consumes ~ 2 AAA batteries for each 30 minutes of passive TV viewing.This is a real problem because it makes paying a cable bill or even a whole street or two's worth of cable bills seem very cheap by comparison. It also makes point number 1 more problematic, because you can't turn the device on before inserting new batteries.On the positive side, I have successfully watched 3 episodes of Downton Abbey using the free PBS app. This is the most expensive free TV I have ever watched.In summary, this is a great device for a battery magnate or heiress.", "verified": true, "helpfulness": "4/9", "author": "Melanie Neely"}, {"rating": 2.0, "review": "just annoyed. within 3 hours of buying it and a few days after getting prime and all that, they just now put it on sale with no way to stop it even though it wasnt shipped. Though i have stopped packages before  due to reasons. With the sale and how much i have spent the past week on amazon i could have really used the deal and the item isent that perfect. im just bummed and not happy at all not really sure why with prime there isent the choices i had when it was regular. this isent what i expected.... and now expecting a product thats highly overpriced even with the sale price of 84 is high :/", "verified": true, "helpfulness": "0/3", "author": "Brooke"}, {"rating": 5.0, "review": "My 78 year old mom loves this.", "verified": true, "helpfulness": "0/1", "author": "Julieandra"}, {"rating": 5.0, "review": "I have directv, cable and chrome cast but amazon fire tv is what we use the most and it's worth every penny it's a no brained if you are have prime membership. I totally recommend it.", "verified": true, "helpfulness": "0/2", "author": "Melissa Cavazos"}, {"rating": 5.0, "review": "I have to start by saying that this device is awesome. We bought three, and both see insanely heavy use. In fact, I don't recall the last time we watched anything using our cable TV subscription. We put one in our child's room using Freetime, one in our room, and one in the living room. I'll cover how much use, and what things are good and bad for each (not everything is applicable to either use case). If you're going to game on your Fire TV, don't read this review for gaming review points. We don't game on it.First, the kids room. Usually after homework and some playtime, our 5-year old likes to watch historical documentaries (strange, perhaps) or documentaries about animals. Occasionally, she likes to play a game. She can do all of it without taking up the Kindle, and with defined limits (Freetime is really, really cool).  Now, her TV is a fair distance from the Wireless router, so this was a really good test of how well the antenna works.Fire TV (kids) pros:- Great wireless signal.- Easy to use. Simple remote.- Decent selection of kids content.- Control over what the kids can use or do in your account.- Freetime granular control over bedtimes, time limits, and activity time limits.Cons:- Voice search doesn't work for Freetime.- Massive plug. It takes up two spots on our power strip.Our room, we use it to watch Netflix, Amazon Video (using this more and more as time goes on. Netflix is pretty rare), and Hulu. This is our \"winding down parent time\" entertainment hub, and it serves its purpose extraordinarily well.Normal Fire Pros:- Great selection of content.- Voice search is amazingly accurate.- We can get to all of our streaming subscriptions easily.- Prime content easily accessible.- Easy to get apps/games.- Dead simple. So simple, even my horribly untechnical parents could use it without asking me a million questions.- That wi-fi antenna is awesome. Our PS3 can't seem to hold a signal, but this thing has no problems at all.Cons:- Power plug. Again, why so huge?- Can't access the music library to browse/purchase/add to prime account natively. I'm sure this functionality will come soon, but this makes us just use our phones for music.- Voice search doesn't work for apps built for Fire TV. Netflix, Hulu; none of those support voice search. Doubt it's Amazon's fault, but yeah.- Easy to lose the controller. It'd be neat if Amazon put a \"find my remote\" chime button on their next iteration. That remote is tiny, and in a chaotic living space, it gets lost or flung around only to be found under a paper on the desk or something.All in all, this thing is great. The kiddo loves her Fire TV, and we can see that she's learning while using it. We love our FireTV and barely use anything else for watching videos/movies/TV shows (unless we're watching DVDs/blu-ray). Keep up the good work, Amazon!", "verified": true, "helpfulness": "2/2", "author": "Darth Spader"}, {"rating": 1.0, "review": "I have to say this thing has turned into a piece of junk.You can't depend on it working...it works and doesn't work at it's own whim.I am tired of of the frustration of the Amazon Fire TV ....it isn't worth the effort.It is good, it works.....kind of sometimes.I am noticing that out of all the Thousands of Prime content movies, many many are junk filler and frankly would be very tedious and boring to watch.Why would you go to an \"All You Can Eat Buffet if they are serving mostly Dry Toast?\"I would rather they Offer LESS but of Higher Quality.The new Pilot Programs are \"Sponsored\" so you get to watch a Commercial as a Bonus!I don't care for that.I have plenty of Commercials in life already and if the price of watching a pilot is also watching a commercial, i have other things i would choose to do.....I'll pass on the Pilots.I don't need more commercials in life especially when I am paying for Prime.All said though there are lots of apps and games and access to other venues such as Netflix and asst. Streaming.The voice search is neat but you end up having to sift through many worthless programs and the better ones are Pay per view.For the money though and the additional shipping benefits I guess it is worth it.All things considered I would rate it overall a \"LOW B\" experience.I would purchase it again.", "verified": true, "helpfulness": "1/3", "author": "volcanohouse Hawaii"}, {"rating": 5.0, "review": "FANTASTIC", "verified": true, "helpfulness": "1/2", "author": "Debbie Gutierrez"}, {"rating": 3.0, "review": "In less then a week the price has gone down $15...?", "verified": true, "helpfulness": "0/0", "author": "robert medwick"}, {"rating": 3.0, "review": "Ended up not needing it but if I had it would have been nice.  Wish the commercial told you that you had to pay for the channels.", "verified": true, "helpfulness": "1/2", "author": "Debi"}]