[{"rating": 4.0, "review": "The Fire TV device worked very well for one day and then died. Waiting on a replacement.I've got two fire tv sticks which have been great, a roku and an apple tv. I recently signed up for Sling TV and picked up a full Fire TV box. The Fire TV box is more responsive than then sticks which helped with the Sling app experience (which I like, but is kind of slow and awkward to navigate at this point). It also seemed to deal with streaming with the plex app much better than the sticks (video is jumpy with the sticks no matter the stream quality, full Fire TV box is smooth). I didn't get to play with it much beyond that because on day two I couldn't get a signal out of it and it doesn't power on. Amazon was responsive and initiated an order for a replacement but I'm getting an estimated delivery time a week out so it'll be a while before I get into it again. So as of now, 3 out of 5 stars for a device that I'm sure is great when it works.update - I got a replacement and it has been running for a few days without a problem. I ran into an authentication issue with the plex app that was resolved by deleting it and loading it back up, but its not streaming smooth video no matter what quality or streaming settings I'm using.All the other apps I have work great, and everything from navigating the menus to loading apps is much more responsive than the fire tv sticks. I'd give it five stars except the disappointing plex streaming quality - outside of amazons hands but one of the reasons I went for the better hardware in the fire tv device", "verified": true, "helpfulness": "1/1", "author": "Jon"}, {"rating": 5.0, "review": "My wife is having a lot of fun!", "verified": true, "helpfulness": "0/0", "author": "Wilfred J. Castellino"}, {"rating": 4.0, "review": "I like my Fire TV, I use it with my Plex server which here are my only 2 complaints with the device:1. I had to pay for the Plex app when everywhere else it is free (thats the appeal of plex).2. I don't care what kind of beef they have with Walmart, I would love to see a VUDU app. I have a VUDU account and them not having an app for it isn't going to deter me from using it, Vudu is a great service.I just wish that Amazon Fire was the one stop shop....now I will probably purchase a Roku or something so I can get everything in one (for the most part). Now Amazon lowered their price one week after I purchased it and they did refund the difference. 5 stars for service, otherwise I do like the Fire and would love to get another one for my main TV so I can stop using multiple devices.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 3.0, "review": "Great product with one glaring exception--current software does not allow using hotel wifi. Since this product is really good for traveling, that is a fatal flaw for me.", "verified": true, "helpfulness": "0/1", "author": "dstevens@dragoninc.com"}, {"rating": 1.0, "review": "The first Fire TV box we purchased stopped working within two weeks of the purchase. First, it decided it didn't recognize the remote. A few days later, the wireless card died, making the unit entirely useless. We returned it to Best Buy, where we bought it, and exchanged it for a new Fire TV box. We had the second box for about six months before getting rid of it.I hated the interface. My fiance didn't mind it, but it was too heavy on the Amazon Prime content and it just wasn't intuitive. Not to mention, Hulu Plus RARELY worked on it. Trying to watch videos on Hulu Plus was a nightmare because it spent more time buffering than playing the video, and it crashed pretty frequently. While all \"apps\" and \"programs\" crash from time to time, it was especially frustrating with the Fire TV because there is no on/off power button. Not on the remote, and not on the unit itself. So, if it crashes or freezes, you have to literally unplug it and start over. Pretty frustrating when you've spent twenty minutes waiting for your half hour program to finish buffering, only for the unit to freeze up.But the absolute WORST part of the Amazon Fire TV? It's a data hog!!! My internet provider allots me 250gb of data to use each month. We were watching videos on the Fire TV every evening after work, for three or four hours, and intermittently on weekends. And somehow, we were blasting through 20 to 30gb of data each day! This obviously meant I was going over my data cap, and my internet provider was fining me for doing so.When I contacted Amazon about the data usage, and if there was any to limit how much data was being transmitted, the response I got was \"Well, your internet connection is just so fast that we want to make sure you're experiencing the highest quality viewing we have to offer.\" What does that translate to? \"We don't care if you have a data cap. If your internet connection can support Super HD, we're going to stream in Super HD and there's nothing you can do about it.\"We have since gotten rid of the Amazon Fire TV and have switched over to a TCL Smart TV with Roku. And I absolutely LOVE Roku. The interface is smooth and easy to use, and guess what? I'm using 1/4 of the data each month with Roku as I was with Amazon Fire TV, even though we have NOT changed any of our viewing/internet habits!!!", "verified": false, "helpfulness": "4/12", "author": "Samantha McLeish"}, {"rating": 1.0, "review": "the system does not have any news channels it cost money to watch and the transmission is not good", "verified": true, "helpfulness": "1/6", "author": "Bassim Sulaiman"}, {"rating": 5.0, "review": "I now own 5 of these devices.... soon to be 6.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "jstraw"}, {"rating": 4.0, "review": "One thing you should understand: AVAILABLE SHOWS and MOVIES cost extra to rent or buy. Not all of them, but just about anything new or current costs extra! Amazon wants money for shows and movies that are free on Tv and/or Netflix and have been for years! Amazon does have new shows that only air here, so that kinda makes up for it...I LOVE THE VOICE REMOTE...", "verified": true, "helpfulness": "0/0", "author": "Liz Lawrence"}, {"rating": 5.0, "review": "We love it!  It has made integrating our Netflix and Plex so easy.  My son loves watching You Tube on the big tv now!  Definitely worth the cost!", "verified": true, "helpfulness": "0/0", "author": "Tricia Squire"}]