[{"rating": 1.0, "review": "This thing is lousy. Constant error messages, despite my reliable and lightning fast internet. I'm returning it and buying an Apple TV.", "verified": true, "helpfulness": "6/30", "author": "Joseph Santa Maria"}, {"rating": 5.0, "review": "I love Amazon Fire TV! I don't really have anything to compare it to so I can't say it's the best of its type, but it's great for my needs. Simple to figure out and use too.", "verified": true, "helpfulness": "2/3", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I was looking to order ROKU and saw the Amazon Fire TV.  When I saw that it had a voice activated search, I ordered. For my hubby, who is a little bit of a remote challenged person, this is great.  The amount of buttons on the remote is 7....how much simpler could it be?  While there are many selections, many of them require you to signup.  I did have logins for many of them but would have like to have known that up front.  Still a great purchase!", "verified": true, "helpfulness": "1/1", "author": "CrdnlSTL1"}, {"rating": 5.0, "review": "Overall the best media player I have ever used. Amazon has set the bar really high on this one. The voice command works better than advertised.", "verified": true, "helpfulness": "2/3", "author": "Anthony M. Mckay"}, {"rating": 5.0, "review": "I had a Chromecast and a TIVO HD and I wasn't very happy with the quality and speed of the streaming video through either. I've had the Amazon Fire TV for a couple of days now, and the streaming quality and speed is really good. Since I'm also an Amazon Prime user, I am able to view a good selection of free movies/TV shows. Overall, I'm very happy with this device, and I'm glad I pursued this relatively cheap option before I decided to fully upgrade my entire TV/system.", "verified": true, "helpfulness": "4/5", "author": "Julie B"}, {"rating": 5.0, "review": "This is a great box that supports playback via XBMC. The wireless signal/speed is fast enough to stream 1080P content (~10-15GB movies). This deserves a better rating then the 3.5 stars it has received on Amazon. The only reason i think its so low is really just because people are impatient about support for the device when it clearly was just released. Give this device time and it is going to be very polished with support for a wider range of apps.", "verified": false, "helpfulness": "5/5", "author": "Erik"}, {"rating": 4.0, "review": "I have had My Fire Tv for 2 days now.  I wish the voice search worked on more things(with in apps) like Netflix and Hulu.  I thought that the voice search results would brings up choices for all the services you have installed, for example, if my voice search inquiry was in more places than just Prime, say Hulu or Netflix it would display them all, not just Amazon Video.I wish the apps (like \"my apps\", games, etc.) were not just in one straight row where you have to scroll all the way through to find something.  Rows and columns would be nice in each catagorey, not just the main screen.Have an app so I would be able to use my android smartphone or Kindle fire HDs keyboard to type in my searches in Netflix or any app.MLB.tv  HBO Go.  Some live channels like BBC News, CNN(US or International)  Music service, like Spotify.More Game Controller pairing choice(I have a Fire Game Controller ordered, but also have an Xbox controller.I do like the Optical Digital Out, now I can finally watch Netflix in surround sound, thank you.  In time I think you guys can dethrone Roku3 as the #1 streaming box!!", "verified": true, "helpfulness": "3/3", "author": "Eugen Holmes"}, {"rating": 5.0, "review": "Amazon (Because it's LARGER than life) -- Fire (Because it's freaking HOT) -- TV (Because we get to DUMP CABLE, save money, and actually watch what WE, the customer wants & w/o commercials).Bottom line: The device works flawlessly, and between Prime, Netflix, etc., you basically have everything you could possibly want from a streaming device right at your finger tips -- and more. Voice activation rocks, and hardware speed and functionality, indubitably, were designed to impress even the most discriminating techie -- such as myself. I am very hard to please, but this purchase was a slam dunk, IMO.No need to write some lengthy, boring review here, talking about irrelevant technological comparatives that in a day or two most of us won't even care about anymore. If you want it, buy it. It is exactly as advertised and a real no brainer for the entire family.Live life - Smile oftenHappy streaming -", "verified": true, "helpfulness": "5/5", "author": "Jimmy H"}, {"rating": 5.0, "review": "I was reading the reviews on here before I decided to buy.  Most said that it doesn't hold a torch to boxes like roku and other set tops.  Oh how wrong they are.For the average user, yes, the roku and other boxes with more choices for channels would be a better choice.  Something along the lines of a family box, the fire TV would not fall in that category.For the advanced user it is an amazing box.  First thing I did was sideload apps that I wanted.  This included Es file explorer which makes finding files on my Google drive a breeze.  Then I loaded XBMC and the flood gates opened up and the true potential of this little box was released.  Anything I threw at it, it had no issue playing.  Streaming from servers on XBMC was trivial and worked flawlessly.On top of that I had the chance to have a Nintendo emulator on there and played some classics( yes I own the originals).  Playing R.B.I. Baseball on a 50 inch television and being able to switch right to Netflix when I'm done is something out of fantasy.Netflix, Hulu, amazon video and other appstore apps play and work flawlessly.  Dead trigger 2 is especially fun!In the end if you are looking for a good starter box for a family, I would avoid.  If you have a little know how then this $100 investment is probably the best for your money in terms of specs.  Once you make this box yours in terms of the apps you want, its amazing.  I was originally looking for an android TV box but couldn't find one that seemed to meet my needs.  Then this gem came out and I purchased.  Do yourself a favor, if you are debating it, buy it.", "verified": true, "helpfulness": "6/8", "author": "Andrew F."}, {"rating": 4.0, "review": "Without even trying it, Fire TV must be the greatest thing since sliced bread.  Their ploy of getting Gary Busey to advertise for them, showing that the biggest of imbeciles has no trouble using it, then its got to be good, no questions asked.  Thanks for the laughs.", "verified": false, "helpfulness": "3/12", "author": "rocco c."}]