[{"rating": 5.0, "review": "Fastest streaming box I ever bought.Great and crystal clear picture.", "verified": true, "helpfulness": "0/0", "author": "mzfarooqui"}, {"rating": 5.0, "review": "It was very easy to hook up. The video set up was great. The voice activate search was easy i am glad that i have amazon prime to get the great movie selections for free. The next day i cancelled Netflix. Thank You", "verified": true, "helpfulness": "0/0", "author": "Joseph Jankowski"}, {"rating": 4.0, "review": "I have an Amazon Fire TV, Roku 2, (2) Chromecasts and was previously an owner of an Apple TV. The Fire TV has been the most fluid device and has the nicest looking user interface of the bunch. I purchased it mainly to have all my apps in one such as Netflix, Hulu Plus, Plex, Crackle, Amazon Video/Music, etc. The app selection has been quite smaller than I expected and sometimes apps crash. It also has the options to download games, but the 8GB it comes with isn't nearly enough to have multiple games installed. It needs to have more storage or allow users to connect a hard drive. The controller is nice, small, and responsive with voice search and about the size of the Roku controller. I had to get accustomed to it's button layout because of the familiarity I had with my Roku, but that's not a huge deal. It's not perfect, but its a very nice streamer and seems to be worth the $99 pricetag.Also, if you're familiar with rooting android devices, then you won't have any problems sideloading apps such as the xbmc/kodi android apps and other apps not included in the Amazon App Store to get more value for your buck.If an new Fire TV were to be made, the storage capacity definitely needs to be upgraded and maybe the memory to make it a better device overall.", "verified": true, "helpfulness": "0/0", "author": "RJ"}, {"rating": 5.0, "review": "Love it. Way faster than apply tv", "verified": true, "helpfulness": "0/0", "author": "sela bryant"}, {"rating": 3.0, "review": "Now that the system has been re-designed it works much better. Am considering going to fire stick when I renew. fire is overrated and to expensive.", "verified": true, "helpfulness": "0/2", "author": "Alan"}, {"rating": 5.0, "review": "HD screen, shape and speed are good!Lots of charge(pay) channel are not good", "verified": true, "helpfulness": "0/0", "author": "Soon C."}, {"rating": 1.0, "review": "I returned the product because it does not allow you to view NetFlix as advertised.", "verified": true, "helpfulness": "2/6", "author": "John Barr"}, {"rating": 3.0, "review": "I like it, the only thing is the video buffering is slow and often.  It interrupt the show.", "verified": true, "helpfulness": "0/0", "author": "Shakila"}, {"rating": 5.0, "review": "Couldn't BE MORE PLEASED with this!! Now... I Do GET ACCESS to my Netflix AND Amazon (& more) Accounts ON ONE UNIT!!!!YEAH!!!!", "verified": true, "helpfulness": "0/0", "author": "Lady \"Lady V\""}, {"rating": 4.0, "review": "Great player with many great apps. Reason why I give it four stars is just because the amazon prime videos are not very clear like netflix movies. Videos just seem a lot more clear on netflix. So happy HBO Go is now available. Love watching music videos on youtube with HD quality", "verified": true, "helpfulness": "0/0", "author": "Eber"}]