[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Lacey \"Lace\""}, {"rating": 5.0, "review": "Very easy to use. I hooked it up and started  watching movies.", "verified": true, "helpfulness": "0/0", "author": "Annette"}, {"rating": 5.0, "review": "This is the best streaming device i have ever purchased. The item is very well made and durable.If anyone is looking for a streaming device that works and has a lot of features---> Amazon Fire TV it is.Don't buy cheap android boxes, i did that and it was a bad idea. Sticking with my AFTV.", "verified": true, "helpfulness": "0/0", "author": "Alberto"}, {"rating": 5.0, "review": "It great to watch newest movies on", "verified": true, "helpfulness": "0/0", "author": "Claudia T."}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "ezekwe"}, {"rating": 5.0, "review": "Easy to set up Easy to use.  Voice command works well.", "verified": true, "helpfulness": "0/0", "author": "D. R. Markel"}, {"rating": 5.0, "review": "Great,", "verified": true, "helpfulness": "0/0", "author": "Janice Bodak"}, {"rating": 5.0, "review": "I enjoy using the fire tv. I am able to easily watch all of my Amazon movies and tv shows. The only drawback I can think of (actually 2) is I can't run the device through my blu-ray surround sound system. It may be able to be done, but I don't know how to hook it up. A minor drawback is with the tv I have, I have to change input unlike my single blu-ray with wi-fi where I can choose Amazon when I turn it on. Besides these two non-critical items, I thoroughly enjoy using this device! There are days at a time where I only watch from my Amazon Fire tv. I am very, very, very happy I decided to buy this!I also bought the mounting device and it mounts right on the back of my tv, so there are fewer obvious wires to see. This I am also happy I purchased!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it works great!!", "verified": true, "helpfulness": "0/0", "author": "Gcb2820"}, {"rating": 5.0, "review": "No hotel TV with all the ads. What a relief! Now we enjoy our evening. Not too hard to set up.", "verified": true, "helpfulness": "1/1", "author": "Robert C McManigal"}]