[{"rating": 5.0, "review": "The systems works great! We have used it to operate Sling TV mainly (which we LOVE!). The system is easy to use, very intuitive and very responsive. The remote works as expected. Love the system. Highly recommend it for non-cable TV watchers.", "verified": true, "helpfulness": "0/0", "author": "Danielle Schuh"}, {"rating": 4.0, "review": "I'm giving 4 stars only because I have discovered an issue with sound. Sometimes we have to turn the volume up to the max and still it can be difficult to hear. Otherwise, I am very much pleased with this!", "verified": true, "helpfulness": "0/0", "author": "r"}, {"rating": 2.0, "review": "Was always in queue. After 2 weeks we never once watched an entire episode of something without it restarting or pausing/skipping/going out of sound sync.", "verified": true, "helpfulness": "1/2", "author": "Stephanie Brown"}, {"rating": 1.0, "review": "I will be sending it back....What a rip off!  You have to pay for almost everything on there.  Not pleased at all.", "verified": true, "helpfulness": "2/4", "author": "Macy_tracy"}, {"rating": 4.0, "review": "So happy I took the chance!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome investment", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very nice and easy to use. Very satisfied!!!!", "verified": true, "helpfulness": "0/0", "author": "Vernon Klontz"}, {"rating": 3.0, "review": "Does Amazon Fire TV stream Indian Premier League 2015 live, the hugely popular T-20 Cricket tournament which is taking place in India now?", "verified": true, "helpfulness": "0/0", "author": "PM"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "DF"}, {"rating": 2.0, "review": "Goodbye apple TV!  this is my go to box now for watching anything.nice easy to use and has everything you need.Update:  while this box is still great, the remote has started acting up. it skips over things and is now hard to navigate to select what i want without going past it 2 or 3 times.  it is not used for anything besides navigation, we do not play games on box.  i am dissapointed with the remote, and the fact that a replacement is $30 bucks.  guess i will use my phone, but that is inconvienient", "verified": true, "helpfulness": "0/0", "author": "Robert McCully"}]