[{"rating": 5.0, "review": "Very responsive and good quality", "verified": true, "helpfulness": "0/0", "author": "Terry Bates"}, {"rating": 5.0, "review": "Beats Roku hands down!", "verified": true, "helpfulness": "0/0", "author": "Alessandro J. Veralli \"Chef Sandro\""}, {"rating": 5.0, "review": "everything as good as advertised", "verified": true, "helpfulness": "0/0", "author": "Ronny Magoun"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Shortcut"}, {"rating": 5.0, "review": "This is the greatest little box  close enough to a full hd android computer .The best alternative up to date for these looking for rootAccess with having to go thru hell .", "verified": true, "helpfulness": "0/0", "author": "Latint81 \"tommy_boy\""}, {"rating": 3.0, "review": "This is my first device like this and I love the content it provides to the TV. However, I have had some trouble with the audio going out. It does not go out completely but it sounds like the speakers blew. I originally thought that is what happened so I bought a sound bar and it did not solve the problem. The problem fixes itself it you unplug and plug it back in. That is my gripe about this so far after about 2 months of use.", "verified": true, "helpfulness": "0/0", "author": "Ryan Mulford"}, {"rating": 3.0, "review": "I was very excited when I initially set it up and started using the voice search function. It was all easy to use and made sense, and I was ecstatic when I was able to stream Pandora. I was extremely disappointed when I tried to find prime movies as they sometimes mix up the prime eligible ones with the free ones; it shouldn't say new on prime if the movie isn't free. I understand they want to sell movies but this just makes me not want to use Amazon Fire at all. It is even more frustrating that I can't use the voice search function on video tube, so you have to type all of your searches to find the free videos you would normally find.I love Amazon in general, but Prime has been a bit disappointing and I'm reconsidering putting my cable back on or looking for other options because of this. Even the pricing seems off because it makes no sense to buy a single episode of anything for $4. It is just not worth it, so they need to fix their pricing schemes. I really hope Amazon makes improvements to make Amazon Fire be all that it can be.", "verified": true, "helpfulness": "2/3", "author": "James D. Simon"}, {"rating": 4.0, "review": "We have borrowed one to try it out and am very impressed even though our ISP is a little slow.  I have two questions: 1) Is it possible to download all or part of a show and then begin watching so it doesn't interrupt by buffering?  2) My surround sound has no optical audio input and I hate to listen on my TV speakers.  Any suggestions as to how to work around this?By the way this is the simplest, best remote control I have ever seen.", "verified": false, "helpfulness": "0/0", "author": "Tomas"}, {"rating": 5.0, "review": "small, solid, fast, reliable. verbal search is a nice feature. remote control is compact and efficient. 5/5 would buy again.", "verified": true, "helpfulness": "0/0", "author": "Tim A. Diesch"}, {"rating": 5.0, "review": "WE HAVE TWO. LOVE IT.", "verified": true, "helpfulness": "0/0", "author": "XFILESGIRL"}]