[{"rating": 5.0, "review": "Love this!  We purchased the Amazon Fire TV for our main TV and are thrilled!  We watch Amazon, pay-per-view and Netflix for most of our entertainment and this makes getting to our Amazon content and choices super easy.  The voice search is amazing!  Definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "S in Alexandria, VA"}, {"rating": 5.0, "review": "Best thing since sliced cheese", "verified": true, "helpfulness": "0/0", "author": "Rex W. Clark"}, {"rating": 1.0, "review": "Extremely disappointed.  We followed the so called easy instruction. Nothing happened.  No prompts on TV nor on computer. NOTHING!  I was so embarrassed because it was a Christmas gift. The receiver opened and we installed as directed and NOTHING! We had all the wires and the right type of TV. There is high speed internet, wireless and the area is Wi FI. NOTHING!  So the product is being returned. I guess those who are satisfied with Fire TV are the lucky ones who received a working unit.  I  put a star ratinf for the on time delivery that's it.", "verified": true, "helpfulness": "2/3", "author": "helen feghhi"}, {"rating": 5.0, "review": "The best accessory for non-smart TV's ever!", "verified": true, "helpfulness": "0/0", "author": "Gerald"}, {"rating": 5.0, "review": "Its does what its supposed to and so much more.", "verified": true, "helpfulness": "0/0", "author": "-Anonymous"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "ShananM"}, {"rating": 3.0, "review": "Beautiful little powerful box that is severely limited. I can't install all the android app", "verified": true, "helpfulness": "0/0", "author": "Vince H"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Barbara A. Morrison"}, {"rating": 3.0, "review": "The wi-fi on this thing is not very good! No matter how good my router or internet is it doesn't seem to want to pick up the signal consistently, so I can't watch movies without constant interruption or an error message saying poor internet, try again later! If you want to use this I suggest you hard wire it to you router.", "verified": true, "helpfulness": "0/0", "author": "Shauna Koehler"}, {"rating": 5.0, "review": "I absolutely love this thing!", "verified": true, "helpfulness": "0/0", "author": "Omar Perkins"}]