[{"rating": 3.0, "review": "I like the product, it basically integrates all my online streaming content (Amazon Prime, Netflix, HuluPlus). The problem is that when using the search function, it brings up paid Amazon content before other streaming options. I've searched for \"20 Feet from Stardom\", great documentary by the way, and the only option presented was to purchase it from Amazon (I have Amazon Prime, so it wasn't included in Amazon Prime Instant Video). I had to go to Netflix and manually search for it, and it was there, for free. I do understand that Amazon might be selling the hardware at a loss, in order to recoup the cost by selling streaming content, but why make it inconvenient for people who have other streaming content?Another feature I disliked was not being able to search YouTube using the voice search feature. I have to manually type what I'm looking for.Despite the voice search feature being heavily advertised, it's supremely limited, and Amazon will try to push their paid streaming content, even if it's available for free with other streaming services.", "verified": true, "helpfulness": "0/0", "author": "Simon"}, {"rating": 3.0, "review": "This device is cool, however like Netflix the movies are old and Amazon charges for many of the TV shows that Netflix gives you for free. I like that I can buy movies and store them on the Amazon cloud to download to my readers. I get the same result when I connect my \"Fire HD\"  to a TV. Not the Fire HDX due to no HDMI port. So I suggest Fire HD your only loss will be the remote.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Compact, fast, and very easy to setup and navigate...love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The Amazon fire is great. Installation was fast and effortless. The only complaint I have is the difficulty in finding Amazon Prime movies. There should be a list of prime movies by category.", "verified": true, "helpfulness": "0/0", "author": "Annell james"}, {"rating": 3.0, "review": "Really enjoy this except You can't use Netflix very well with it.", "verified": true, "helpfulness": "1/1", "author": "Cindy"}, {"rating": 4.0, "review": "I've had this about a month now. I have yet to try all its features but it meets my personal needs", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Its very fast, which is nice.  But I thought it would be better you can't use the USP port  as a \"portal\" so why have it.  Unless I can't figured out I can't surv the internet, or go on facebook, like you would on a Blueray.  The Voice comand is nice, but it only works for certain things.  I should had just gotten a BlueRay.", "verified": true, "helpfulness": "1/6", "author": "Gidalty G. Esparza"}, {"rating": 3.0, "review": "When this is on the tv clicks off and on constantly.  I like the idea but need to get it working better", "verified": true, "helpfulness": "0/0", "author": "RubeJM"}, {"rating": 5.0, "review": "It's amazing. What would you like to watch, there is. So, you can enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Armen Soghbatyan"}, {"rating": 5.0, "review": "Love this! Install easy as everyone has said. User friendly. Thank everyone that reviewed. I value the reviews. It helps me make good buying decisions.", "verified": true, "helpfulness": "0/0", "author": "Peggy"}]