[{"rating": 5.0, "review": "Couple this with the new Sling TV service and hopefully the big cable companies will shape up!  (I doubt it!).I used this to watch some of the NCAA Tournament games this year on my new Samsung UHD 4k TV and was immensely pleased! It is a great supplement to any SMART TV on the market right now.*The ONLY thing that is a negative is the THICK electronic plug.  My 50 in TV is mounted on the wall and the plug behind the TV could not clear the fat plug, so I had to get a small extension to get around it.You MUST have this device!  AMZN rules!", "verified": true, "helpfulness": "0/0", "author": "James Liaw"}, {"rating": 5.0, "review": "WISH WE HAD BOUGHT IT SOONER!  kicks others to the curb.... your access is HUGE.... do wish there where more \"free\" or included with prime options, but you can finds and watch just about anything you want.", "verified": true, "helpfulness": "0/0", "author": "jlee"}, {"rating": 5.0, "review": "Loving it so far, it can be improved though.I liked the voice command option, but it would be better to be able to use it in other apps as a keyboard, for example, searching something in youtube.", "verified": true, "helpfulness": "0/0", "author": "Berny Cardenas"}, {"rating": 3.0, "review": "I am not too impress with the Amazon Fire TV. I wanted to try it out, because I have a kindle and love it. I think I am going back to the Roku.", "verified": true, "helpfulness": "1/1", "author": "Tyra Scott"}, {"rating": 5.0, "review": "I enjoy my Fire TV. I just wish that some of the shows that I watch were included in my amazon prime membership. Having to pay 5.99 to watch a movie is way too high when I can rent one from Red box for 1.50.", "verified": true, "helpfulness": "1/2", "author": "Sharon Gaston"}, {"rating": 5.0, "review": "VERY EASY TO USE!  MAKES MY OLD FLAT SCREEN LOOK LIKE BRAND NEW!  LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Joy Handy"}, {"rating": 5.0, "review": "Easy to set up and quick to use.  I decided to use the Fire TV because of the ability to hard wire into my modem rather than use WIFI.  Wire is faster.  It has more storage than the Fire Stick.  I was also interested in Amazon Prime which is a good investment if you get either the Fire Stick or TV.  I use this strictly for TV and Movies.  Unfortunately the app for my Kindle Fire HD doesn't work that well with it, I believe the HDX works better.  Not a good move on Amazon's part.  I did purchase a Chromecast.  The Kindle wouldn't work with that either.  I also have a ROKU for the basement TV which is also very good.", "verified": true, "helpfulness": "0/0", "author": "PATRICK RECORDS"}, {"rating": 5.0, "review": "device is very fast  and fun to work with. I give it four stars. I have to take one star away for the music app, must download to cloud from desktop computer and then play on device.I hope one day I will get a update fix for that.had to update my review. had to give the device 5 stars excellent music sounds Chris on my system have access to all my Amazon Prime music, also some music plays words on the screen for karaoke nice!", "verified": true, "helpfulness": "0/0", "author": "elgin"}, {"rating": 5.0, "review": "I love love love this. Its so easy to use and the voice search is awesome.", "verified": true, "helpfulness": "0/0", "author": "Shannon baker"}, {"rating": 4.0, "review": "I would like if more apps were available. not sure if they are not due to contracts or not. Apps like FX Now And I know some of it is kick back from the TV providors but not having a provider really limits some of the apps to be used to full extent of the amazon fire box.", "verified": true, "helpfulness": "0/0", "author": "Robert"}]