[{"rating": 5.0, "review": "Very fast load times. Great tool if you have digital content on Amazon.com. Better than apple tv and roku as of this review, so it is no brainier.", "verified": true, "helpfulness": "0/0", "author": "Baris B. \"Silent Guy\""}, {"rating": 5.0, "review": "This item more than met my expectations.  I have two ROKUs and have just ordered a second Fire TV to replace one of them.  All the disappointments I've had in previous streaming episodes, such as inconsistent rewind or fast forward, are gone.  Just a few more refinements in programming and I can dump Comcast for good.  I just need to find a worthwhile ISP.  Thanks Jeff B., you've scored a home run with the Fire.", "verified": true, "helpfulness": "0/0", "author": "RMD \"Robert Marvin Dailey\""}, {"rating": 5.0, "review": "I had to see it for myself.  It is staying. Fire TV has a new home.Just as I was about to paint my TV as an object d'art nouveau, This little box n sleek remote came and rescued me from my cable TV doldrums. So-o-o easy to install,soo-o- easy to sync with your internet apps n stuff, n the 99 a year subscription outdates all your fond DVD collections. After all, why block your living space wwith obsolete plastic storage trinkets. It's still plastic,poly-vinyl chloride in its pure form,With Cloud type storage systems and 50,000 title to stream, why get all huffy n proudful n boasty about owning a DVD ? You can stream Prime n anything anytime !bring on the Spring Yard Sales n reduce your clutter.5*******stars.", "verified": true, "helpfulness": "0/0", "author": "Keith Nathan Albrecht"}, {"rating": 2.0, "review": "Sling TV streams better on my Roku 3. The Amazon Fire TV frequently causes the Sling TV broadcast to be low quality, freeze, or completely \"kick out\" of the app. Both devices are located in the same room, using the same network. It seems to work fine with Netflix and Amazon Streaming, but I hope they fix the Sling app soon!", "verified": true, "helpfulness": "0/1", "author": "Doug J. Disch \"The Dischman\""}, {"rating": 3.0, "review": "Works well, good picture and runs circles around my DVD player with Netflix, etc. I do have to resign into Netflix often and it needs more features.", "verified": true, "helpfulness": "0/0", "author": "G. T. Kelley Sr"}, {"rating": 5.0, "review": "This little box is fantastic. You will see your tv in a different form", "verified": true, "helpfulness": "0/0", "author": "Sharon Evans"}, {"rating": 4.0, "review": "It meets my expectation. Recommend it for others", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Fantastic. Wish we had gotten one sooner.", "verified": true, "helpfulness": "0/0", "author": "Zachary Intille"}, {"rating": 5.0, "review": "I've owned every appleTV till date i never felt its inferior our outdated untill i had the FireTV!", "verified": true, "helpfulness": "0/0", "author": "K. alsanea \"Kliffy\""}, {"rating": 5.0, "review": "Love it :)", "verified": true, "helpfulness": "0/0", "author": "Ashley Fritsen"}]