[{"rating": 1.0, "review": "everything it does and more is already available on the Sony Google player, including voice search, HMDI input to control and voice search your cable box,  a Chrome web browser, QWERTY keyboard remote, two USB ports, dual core 1.2Hz processor, 8GB internal storage, and much more.Yes, it is $30.00 more but what do expect for less, another \"me too\" streaming device?", "verified": false, "helpfulness": "16/138", "author": "Francis H."}, {"rating": 4.0, "review": "I've been playing with this for a few hours now and I am impressed.  Big time.  The Fire TV is fast, responsive and easy to use.  The hardware (a quad-core processor and 2Gb of ram) far exceeds that in competitive devices...I suspect that this is very low margin item, with the bulk of future profits projected to come from increased movie and TV show sales.When you first connect the Fire, it hunts for the remote control and automatically syncs the two.  Configuration for a wireless network is through on-screen menus; if a wired network is used, it's just plug it in and you're off running.  If you've ordered it through your Prime account, it comes preconfigured with your account information.  Downloading a series of software updates took a couple of minutes...if you order one after the initial production builds, it'll probably come with the updates already installed.  The ability to dynamically update the software is critical because it allows the installation of new capabilities. No HBO GO today?  When/If Amazon and HBO reach an agreement, it can easily be added.  In the meantime, though, this tiny box has the computer horsepower to do what it needs to do.In operation, pictures are sharp and the menus are fast.  There are menu spots for Hulu and Netflix, but the apps need to be downloaded, installed and linked to your device.  The process only takes a few minutes for each.  For Hulu, an activation code is displayed which you then enter on hulu.com/activate.  For Netflix, you enter the information directly, using an on-screen keyboard.  Both methods work.Watching from the Amazon library is even easier.  Because it's already linked to your Prime account, Amazon servers already know which programs you watch and are ready to serve them up almost instantly.Nothing, though, is perfect and the Fire TV is no exception.  Not surprisingly, Fire TV is totally outside of the Apple infrastructure.  If you are a heavy iTunes user, it doesn't give you access to any of that material.  I assume that I'll be able to access my music that's stored on the Amazon servers, but there's no way to currently do so...that's the reason that I've docked it a star.  No cables are included, but I suspect that most people buying this already have a small stash of them.Long story short...if you're an \"early adopter\", buy this.  It has the horsepower to add more features and run more apps.  If you're more conservative, wait a while and see what shows up.  But for only $100?  It's not like you're risking a heck of a lot...", "verified": true, "helpfulness": "19/23", "author": "W. B. Halper"}, {"rating": 5.0, "review": "Oh man, I just bought a Roku 3 a week ago. But this looks so tempting.... Is this better than the Roku?", "verified": false, "helpfulness": "2/32", "author": "Emma Navarro"}, {"rating": 5.0, "review": "Finally a streaming product for the TV that I actually like. Here is my assessment based on products I had in the past:Roku:* Cons: interface is too slow, hard to navigate, awful platform for games (even casual/simple)* Pros: variety of appsChromecast:Cons: too limited, need to always have your smartphone with you. Not good for kids. Horrible internet qualityPros: cheapApple TV:* Cons: very few apps, hard to navigate, don't like the interface* Pro: AirPlayFire TV:* Cons: HBO-Go is not there* Pro: very nice voice search, nice games for this kind of device, nice and quick interface, am sure that more and more apps will come", "verified": true, "helpfulness": "8/14", "author": "Rosa Amelia Leda"}, {"rating": 5.0, "review": "I noticed with these reviews those that actually have the device and are reviewing it are giving it high marks.  Those with low marks don't have the device but are stating their opinion about the features and the fact Amazon even has this.  So not really helpful when it comes to knowing how well the actual device performs to its advertised features.That being said - I actually have this device.  I will use it mainly for Amazon Prime so my review is based on that.  It was very easy to setup - but immediately loaded a software update.  That surprised me given it was just released yesterday.  But no big deal.It is very fast when loading the shows etc.  My Roku is a rather old version so not sure how it would compare to the newer Roku's.  Overall this is what I wanted.", "verified": true, "helpfulness": "43/50", "author": "Lisa"}, {"rating": 4.0, "review": "After putting it through its paces, I'm very impressed with the Amazon Fire TV. You can tell it has a beefed-up processor and 2GB RAM. Scrolling from section to section is amazingly fast - no noticeable lag whatsoever. Menus are easy to navigate, and the system is very responsive. Neither Roku (which I've owned) or AppleTV (some relatives have the latest gen AppleTV) can match the speed of the Fire TV.Set-up was a breeze. After plugging in the HDMI cable and the power, the system will prompt you for which WI-FI network you want to connect to (unless of course you are on Ethernet). Once connected, it downloads and installs the latest version of the software, plays a quick Help Video (really unnecessary, but you can always access it again under Help in Settings), and then you are on the Home Screen. Since I have both, I installed NetFlix and HuluPlus. I also installed the Plex app.Navigation is intuitive, easy, and quick. The Voice Search works well. Contrary to what others have experienced, some of my voice searches actually had options to play it on Amazon Prime or HuluPlus. For example, I said 'Silence of the Lambs'. The Fire TV found it. I went to 'Other Ways to Watch', and it showed options to Rent or Buy, Watch on Amazon Prime, or Watch on HuluPlus. HuluPlus doesn't show up for everything (even for programs i know they have), though. Whether this is an Amazon issue or the HuluPlus app issue is unknown.Like others, i would like an easy way to play content from my NAS. This would allow me to access my content without having to run a Media Server. The Fire TV is brand new, and I'm sure it won't take developers long to come out with apps that will allow you to do just that. In the meantime, I had installed Plex on my PC and tried out the Plex app on the Fire TV. All I can say is - excellent! I had no lag at all playing my content. If you are familiar with Plex, the app takes full advantage of what you can do with Plex. It was certainly a pleasant surprise.I'm very happy with the Fire TV. It can only get better as more apps become available for it.", "verified": true, "helpfulness": "24/29", "author": "FireTVGuy"}, {"rating": 3.0, "review": "There are some very detailed (and great) reviews here on Amazon for FIRE TV.  Kudos to Amazon for posting the good and the bad.  My review here is quick and basic.For $100, this becomes a letdown.  I've used Google's Chromecast; I have a Roku 3 (the best still) and a so-called Smart TV with APPS as well as a TIVO Roamio (newest version TIVO with APPS).  The TIVO and the ROKU 3 are great products but the ROKU 3 still prevails as a BEST CHOICE.  It has VUDU and M-GO but Amazon's Fire TV does not.  The ROKU 3 is plenty fast and it continues to deliver a solid product even after a years worth of technology advancements.Fire TV delivers a great remote!  If I like talking to a remote...  Beyond that, it delivers a unprepared allotment of APPS and misses the mark at major APPS as one would have hoped for.Maybe it will get better but now, it's just another toy with a cute remote.  Worth $49-$59 but certainly not $99.I'm experiencing far too many programs that I attempt to play (Amazon Instant/Prime) that claim to be included with PRIME MEMBERSHIP (and they are) but they fail to play on the FIRE TV unit.  There was a firmware upgrade but it did not help.  When I attempt to play basics, I get a on-screen advisement saying it isn't available at that time.ROKU 3 is far more reliable and READY for performance.", "verified": true, "helpfulness": "12/18", "author": "IFLYMAUI"}, {"rating": 4.0, "review": "A powerful new streaming box that challenges the competition!Pros:-- Sleek, thin, good looking and powerful hardware - fastest box available currently-- Good video and sound output (HDMI, Optical Audio out)-- Fast, responsive UI and streaming - good hardware/firmware, ASAP feature works well-- Nice remote with novel Voice Search feature (works very well)-- Gaming controller and internal GPU (Graphics Processing Unit)-- Games are fun on the Fire TV, graphics are surprisingly good!-- Decent array of apps at launch, tons of content available-- Quiet, cool operation, super easy set-up and easy to use-- Good support for local networked content via Plex Media Server and apps-- Potentially great gaming with some good titles available now (Asphalt 8, Riptide GP2, Sev Zero)Cons:-- No SD card slot or other local storage expansion-- USB port not functional? Some reports say a USB keyboard will work, have not tried it yet.-- Voice Search only for Amazon content currently-- Some apps (HBOGO, RDIO, etc.) not yet available-- No HDMI or Audio cables included-- No easy way to search free Prime Video content only (mixed in with pay to view)-- Could use a head-phone jack and/or std. audio out as well as opticalWith a 1.7 GHz quad-core CPU, 2 GB of RAM, a GPU and 8 GB internal storage, the Fire TV represents a big leap forward in power for a streaming set-top box.  Add in dual-band wifi, ethernet, and Bluetooth support as well as a USB 2.0 port (not useful at present), HDMI, and optical audio out and you have a sleek and capable hardware unit, though missing a few nice things like an SD-card slot(Amazon wants you to use the cloud or networked storage).  The power and memory at hand here promise a fast, smooth user experience and the Fire does seem to deliver that based on my initial use. With these specs, this is the fastest box out there, currently.This is also a box that is somewhat serious about gaming support as it has an internal/onboard GPU and an available controller.  Many game developers seem excited about the prospects (and market) this device represents. (Currently, you get a free game and 1000 Amazon coins for each controller you purchase.) [*** Update, I have tried several games and they are great fun. Graphics are surprisingly good, controls smooth, really pretty impressive for this type of system. ***]With 1080p streaming and Dolby Digital Plus 5.1 Surround Sound the picture and sound is great. It runs Android (basically 4.4.2 KitKat) so lots of apps should be available right out of the gate with lots more to follow.Some people are grousing about the $99 price, but I do not feel it is out of line at all, and indeed, it seems like a bargain compared to the competition's hardware capabilities to me. You get a decent amount of performance hardware for your money, so I think it's fine (and I'm sure there will be specials later for those who can wait). I could not wait myself and ordered one immediately.  I like the Roku (I own several), but this was too tempting to a geek like me.Clearly, the Fire TV aims to challenge the other contenders such as Apply TV, Roku, and Chromecast.  Each has their strengths and weaknesses, but the Fire TV seems like it will appeal to many.  You might not be too tempted if you already have a Roku 3, but if you are a resident of the Amazon ecosystem, you may find the Fire a great asset. Those new to the game will find it worthy of consideration.There are still a few rough edges as with any new product, but none that seem too significant to me. Most will probably be addressed in short order, but the main thing is that there's plenty out of the box that Amazon got right and the Fire delivers a great experience.  Set-up is very easy and straight-forward.The Bluetooth remote is a nice touch, for example, and the voice search is promising.  While it currently seems limited to Amazon content, hopefully this will expand at some point. Even so, it's fun to use.Streaming seems to be smooth and glitch free in my tests so far(mostly with Amazon Prime Instant and Netflix). I will do more testing and update this review as I learn more. Load times are generally very fast, sometimes almost instantaneous, and the Fire TV is quite responsive. Video quality is very good.The menu is decent enough, similar to Roku and others.  It is a bit Amazon-centric as you might expect.  Hopefully future updates will allow one to customize it a bit more.  But simple and sweet is what most people want and that's what you get here. Your Amazon video library and watch lists are available, of course.A lot of my favorites like Prime Instant, Netflix, Pandora, iHeartRadio, and so on are here. (Rdio is missing and I hope it gets added soon.) I'm sure all the main ones will get on board, it's just too big a market to ignore.I have not had time to set-up Plex yet, but that promises to be a great feature for sharing photos, music, and videos from other devices, including a PC, laptop, or tablet. I have Plex in the past and it generally worked very well. I will be very interested to see how it goes with the Fire TV (and will update here).Amazon seems to have taken particular care to address the buffering issues sometimes experienced with devices of this type and I have not seen any such issues, so far, at all. Nice!More to come as I have more time and experience with this device. Giving it a solid 4 stars for now pending further time with it. I really like the Fire TV and likely will upgrade to 5 stars if no glitches turn up. *** Upgraded to 5 stars *** Everything working well, gaming is a lot of fun, gfx better than expected.  Everything loads faster than any other system I have used (Sony, Netgear, Roku, etc.). Everything looks great. I feel like the value is there, especially if you are already in the Amazon ecosystem. (But non-Amazon stuff like the Netflix app also work well.)I hooked my Amazon Fire TV up my Epson projector and gamed big and it was a blast. Prime Instant Vids and Netflix looked great as well. The fast, responsive interface and overall snappy performance make for a great experience.Gaming:I got RipTide GP2 for the Amazon Fire TV.  Still waiting for my game controller, so played using only the Fire TV remote, but even so it was a lot of fun (especially big screen using my projector). Reminds me of  PlayStation games (a good thing). The graphics are darn good, better than I expected, and the game is a lot of fun and fairly easy to pickup and play. The game controls work well, even using just the remote. This is the first game I've tried on the Fire TV and I was very surprised and pleased with the quality. Definitely worth a try if you like racing games.[*** Update - got my controller - works well - Asphalt 8, Riptide GP2, and Sev Zero all look great and play great.  Very impressive!  I think the Fire TV is going to surprise a lot of people in the area of gaming. ***]Tip:  In Parental Controls, you can set up a PIN (or use your existing one) and enable \"pin protected purchasing\" so that a PIN is required for any purchase made via the Fire TV. Although meant primarily to prevent kids from purchasing without a parent's approval, it's can also serve to prevent accidental 'one-click' purchases of your own.-----Note: If you're interested in more details, you can find PDF's of the User Guide, Quick Start, Controller Manuals and so on here: www.amazon.com/gp/help/customer/display.html?nodeId=201348270`", "verified": true, "helpfulness": "17/19", "author": "Bron \"Bron\""}, {"rating": 1.0, "review": "I am a real owner of the Fire TV, and also the Roku 3, Apple TV and G-Box MX2 by Matricom. I've been anticipating the fire tv since I first heard about it and really wanted to love this box. Unfortunately it just misses the mark on every ground that I expected it would excel. First of all, it took about an hour to get the device to boot all the way in. It had to download a few updates then forces you to watch a long video. If you try to bypass the video it just restarts. Finally after waiting for the video to finish I got in. The user interface is ugly, but clean. Surprisiginly being so simple the interface still gets laggy when moving quickly through the menus.First thing I noticed is the wifi is weaker than my other streaming boxes (Roku/ATV/MX2). I couldnt even use it in the bedroom I wanted to replace my Roku 3 in because it wouldnt stream from that far. The Roku of course streams fine from this room. I had to move it to the living room instead.This thing is just plain exasperating to use. If you want to watch a Prime movie or video, no problem - pretty much everything else is just too much for the box's processing power. Playing games on this thing will make you pull your hair out from all the jittery laggy moments when everything just freezes for a split second. For games like Minecraft, this box is fine but for action games like Asphalt 8 and Sev Zero - the lack of power this box has really shows. Furthermore this is the 600 series Snapdragon processor. It's rather a joke by today's standards. It will NEVER do 2K or 4K video decoding. Something \"this revolutionary\" should at LEAST have hardware capable of TVs being sold on the market today.The voice recognition is the worst I have ever experienced. Not only does it take approximately 10 seconds for the box to \"think\" about what you said, half of the time it doesn't come close to getting it right. This feature is more annoying than it is useful.I installed the latest XBMC Gotham using ADB. The video playback is choppy and erratic for any HD content. Although it plays standard definition content without a problem this player can't be taken seriously for XBMC with choppy / erratic HD playback. Since I didn't expect XBMC to work properly anyways I didn't judge my review based on this point.Like many complained already, there's no HBOGo. For me it's not a deal breaker, however the lack of support for local media playback, no 4K video decoding, DLNA issues, VERY limited media file format compatibility, VERY laggy/stuttering game playback is just a few of the reasons I'm going to return this thing. Maybe it will get better in the future, but after my day's run with this thing it feels like it was rushed to market and still needs some refining.The best thing I see useful with this box is Amazon Prime, but overall I feel like this box is just another way for Amazon to get more subscribers to Prime. Without Prime this box wouldn't be nearly as useful.Overall I am not impressed at all. I prefer my G-Box over all of my streaming devices, but the Fire TV is going back home to Amazon.", "verified": true, "helpfulness": "590/736", "author": "Jeremy"}, {"rating": 5.0, "review": "So far so good, nearly instant set up, great access to all our amazon digital purchases as well as netflix and youtube. Nice controller and I love the Bluetooth remote, no more reaching to aim at the right box.", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}]