[{"rating": 3.0, "review": "This thing works ok but has nothing on the Roku3, roku has more apps and works just as good if not better. Games is the only difference if you dont want games dont bother. Roku 3 is better.", "verified": true, "helpfulness": "1/1", "author": "Robert Tryon"}, {"rating": 5.0, "review": "My husband and I received the Amazon Fire for Christmas. What a wonderful device! We have been able to watch TV series we were unable to view before. The Amazon Fire TV is great! The fee for extra broadband usage...not so much!", "verified": true, "helpfulness": "0/0", "author": "Deb P"}, {"rating": 3.0, "review": "First off, I'm a amazon GUY.  About 90% of the stuff I buy, I buy here.  Wish you sold Ammo.  So I have a Ruko 3 and honestly in hind sight they two do the same things.  The reason I bought the device is for the USB port, so that I could play movies off my external drive without having to hook my laptop up to my tv.  End of the day its my bad for not researching a little better, the USB port does nothing, its just there?!?You guys need to unlock that thing so you can mount an external drive even if to read files.Pros:Slick piece of hardwareNice remoteEasy set upWorks great with prime and netflicksPhoto steam from amazon icloud very slickConsUSB does nothingGaming remote to expensiveinternal storage is lite", "verified": true, "helpfulness": "0/0", "author": "Adam R. Weaver"}, {"rating": 5.0, "review": "This is a wonderful piece of technology! I do not know why I waited so long to get rid of Direct TV. All of my programs are a click away, and being techno slow, I had no problems setting it up and turning it on. It took approximately 5 minutes and then I was watching my favorite shows.", "verified": true, "helpfulness": "0/0", "author": "sherry stanton"}, {"rating": 5.0, "review": "Arrived before stated shipping date. Video stream perfectly with no delay. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We received this as a Christmas present.  Absolutely love it.  Wish we had it sooner.", "verified": true, "helpfulness": "0/0", "author": "R, Cabin"}, {"rating": 4.0, "review": "Disappointing in that there are charges for lots of shows and movies.  Wonderful in that it carries shows such as Gilmore Girls for free.", "verified": true, "helpfulness": "0/0", "author": "Gail E Owen-Smith"}, {"rating": 5.0, "review": "I was a bit skeptical but this device is not only easy to use but convenient as well. Money well spent!", "verified": true, "helpfulness": "0/0", "author": "Victoria A. Pedrotti"}, {"rating": 5.0, "review": "Very happy so far", "verified": true, "helpfulness": "0/0", "author": "Michael LeWinter"}, {"rating": 5.0, "review": "Easy set-up; no dragging, immediate connection to requested programs, and voice recognition works great every single time!!! So happy we bought Amazon Fire TV!!!", "verified": true, "helpfulness": "0/0", "author": "Cindy Voorhis"}]