[{"rating": 5.0, "review": "Not only is this item fantastic and all that it is advertised to be, but the packaging the Fire TV came in is artistic, functional and superbly designed. One usually tears through a package to get to the good stuff, but this package is a beautiful and grand gateway to the Fire TV experience. I hope the product packaging designers are celebrated along with the Fire TV developers.", "verified": true, "helpfulness": "0/0", "author": "Mary & Bruce"}, {"rating": 5.0, "review": "Best hardware of any streaming box I've had.  My only complaint is that the software is very Amazon-Prime centric.  I own an Apple TV, a Roku 3, and a Google Chromecast.  Each has its benefits, but for sheer hardware this one takes the cake.  They also made a good decision to deliver content quickly at low quality and then scale the quality up as you watch.  Most shows literally start playing immediately when I press play and play at a low quality for less than one minute before the picture is full HD.  If Amazon Prime is your thing, why don't you own one of these?  The main difference I have seen is that the Fire TV offers a minimum of double the RAM (2GB) of any of its competitors.  I also use the voice search a ton and love it.  The voice search only works for Prime instant video, but it works well for that.", "verified": true, "helpfulness": "1/1", "author": "Algernon"}, {"rating": 4.0, "review": "Easy to hook up. Fairly easy to use. Search options could be improved. Would recommend to friend.", "verified": true, "helpfulness": "0/0", "author": "Rae A Gronewold"}, {"rating": 1.0, "review": "The FireTV went down 15 bucks within 2 weeks of buying it.", "verified": true, "helpfulness": "3/10", "author": "Ynema Mangum"}, {"rating": 5.0, "review": "I own a couple Apple TV devices and the FireTV was a great addition for media room options. Simply added to another HDMI port and now I have the most streaming options available. Amazon original series with Prime makes this a no brainer purchase. Easy to watch Netflix as well. Games option a great bonus ... Flappy Bird is just as fun on a 65 inch screen!", "verified": true, "helpfulness": "0/0", "author": "Jay J Couzins"}, {"rating": 5.0, "review": "works great!  the voice search isn't 5 star worthy but easy access to prime videos and it's memory make it a winner", "verified": true, "helpfulness": "0/0", "author": "Josh A. \"Maxito's dad\""}, {"rating": 5.0, "review": "Great device. Makes my TV watching experience complete", "verified": true, "helpfulness": "0/0", "author": "Nicholas Stockwell"}, {"rating": 5.0, "review": "I love my Amazon Fire TV!  My husband and I decided to get rid of the cable box upstairs and use our Fire TV instead!  It's easy to navigate and I love that I can speak into the remote to search for something to watch.", "verified": true, "helpfulness": "1/1", "author": "Nacl75"}, {"rating": 5.0, "review": "If you are a Amazon Prime member this is a must have.  Works great, I have had no problems with the unit so for.  Easy to setup and easy to use.", "verified": true, "helpfulness": "0/0", "author": "James Lanham"}, {"rating": 5.0, "review": "My thoughts after about a month of use. I had a Roku 1 for a while which was my introduction to streaming devices, and I liked it. As time passed I read a lot about how much faster the Roku 3 was than other versions, so I started to do some research. My wife and I had been thinking about joining Prime, which sweetened the deal and was a deciding factor for me in purchasing the Fire TV. Having made the decision to purchase a Fire TV stick in Nov. (bought the Fire TV in Dec.) to replace the Roku it was an easy decision to go with the Fire TV as I loved the stick! Here are some key points about the Fire TV:-Load times are fantastic! Sub-30 sec. load times, so virtually no waiting for movies or tv shows to load, and if you use Netflix it will automatically load and start the next episode of a series.-If you have a surround system,  it's important to change the audio setting for Dolby Digital Plus via HDMI or Dolby Digital via optical (depending on your connection) as it makes a huge difference in audio quality-Easy setup (great little intro video to walk you through setup) although after updates (15-min.) I had to input my Wifi SSID again! (Mildly annoying) but not a big deal. Overall the experience was great!-Interface is the same as Fire stick, so easy to navigate and if your a member of Amazon Prime, you can search \"Prime video\" so you don't have to sift through a ton of paid content-Voice search is extremely accurate. I wasn't sure how often I would actually use this feature, and honestly to date I've probably only used it a handful of times, but when I do choose to use it, it's amazingly accurate and so far it's NEVER given me the incorrect results-Battery compartment (remote) Oh my God! This is my main grip. The battery compartment needs to be redesigned as I felt like I was trying to break into Fort Knox while simply trying to install batteries. This is the most difficult time I've had putting batteries in anything! I ended up using a flat head screw driver to remove the compartment door. You can find some helpful videos with a quick search.-Remote (general) I have big hands and I found the remote to be very comfortable and easy to use. I love the nice rubbery feel of it as well, the Fire stick remote does not have that coating, it's just smooth plastic, which is fine but the added coating gives it a more quality feel. The other thing I like is the overall size, it's a couple inches longer than the Fire stick remote, and for me that made a big difference as far as ease of use. I find it a bit more difficult to type on the smaller stick remote than this one.-For kids/parents, \"Free Time\" is included and can be accessed right from the main interface. Using a pin code, it prevents younger kids from ordering or viewing content you don't want them to see. You can block certain channels/apps, setup a profile for your kids,etc.. Great feature that doesn't come with the Fire Stick.", "verified": true, "helpfulness": "4/4", "author": "Dragon76"}]