[{"rating": 1.0, "review": "They advertise this as 'cheap', but it's the most expensive box out thereNO HBONO VuduNO realistic pricingThis is the worst of the worst. There are MUCH cheaper devices out there that offer the SAME, EXACT functionality.Amazon is the LAST player in this game, and they expect us to pay a hefty fee for this? Not likely", "verified": false, "helpfulness": "30/400", "author": "T. Whiting"}, {"rating": 1.0, "review": "since we pay every year and now that the cost is increasing you would think the price would be lower if not free with your amazon prime membership. giving it to us would also get all of us to replace apple tv or chromecast with amazon fire as it is the only device to get us amazon streaming for the movies. a win win for everyone.It would be a great way to get more people to sign up, and we all know every new membership is more profit for them. come on amazon do the right thing.", "verified": false, "helpfulness": "41/380", "author": "Todd A. Levy"}, {"rating": 5.0, "review": "Wow, I love this thing. Having used a few generations of Roku, 2 Apple TV's and other solutions... I was always left wanting. When I'd first heard rumors of Amazon doing a set top box I got excited, when I saw it was available for sale it took me all of 3 seconds to go \"yup I'm going to order and pay for local delivery\"Pros:1080pOptical AudioVoice search (which works better than Siri on my iPhone) instead of a painful searching with the remoteAllows for gaming (I most likely won't use but still neat)4x the RAM of competitorsFaster processorMajor Cons:I wish the remote would have a lion battery, if using voice search often I can see it draining AAA's fast.Minor Cons:No HDMI cable, I don't get why manufacturers want us to buy them seperate, slap one in the box and markup the price the cost of the cable.While I've only played with it for an hour or so, my first impressions are it's well worth the price. It's snappy, I actually have a reliable way to watch prime videos on my television now (which means I'll actually watch them, I've watched 1 episode of Red Dwarf on my kindle fire and an episode or two of stuff on my iPhone... in 3 years of being a prime member). As far as looks, I love that it's black (all of my home theater stuff is) and the finish is nice (doesn't reflect the LED from my tv's name badge or the power LED on my subwoofer).And the thing I'm most happy about, I can now be a cord cutter! Some of my shows I watch I can get over the hair with an HD antenna, the rest are all available either for purchase or for prime streaming!Update April 25th, 2014: after having used for some weeks now I've decided there is one flaw, while viewing a video if you press the home button it dumps you out to the main screen without any confirmation. It would be really nice if, while playing a video, a confirmation came up when pressing the home button.", "verified": true, "helpfulness": "123/164", "author": "Ryan C. Mercer"}, {"rating": 5.0, "review": "Everyone complaining about this box not having HBO GO at launch needs to realize that it will probably come soon. If HBO provided a subscription outside of the cable monopoly then I would be complaining with the rest of you. Most cable-cutters are not having this issue so HBO isn't a must-have for the intended crowd.I am looking forward to using this tomorrow and comparing it to my Roku 3. I will update this review with my experience in a few days.In the meantime stop complaining about HBO GO and get on their backs to provide more subscription options!*Update 4/6/14- I have spent several hours with the Fire TV and I can vouch for its ability to load content a lot faster than my Roku 3. Also, the picture quality is fantastic. The screen seems to need a lot less time/if any to render 1080p while my Roku 3 takes a full minute or longer into the program to become clear. Just by elminating this issue I have a new favorite streaming box!I would like to see Amazon eventually release a remote that has a built-in headphone jack instead of waiting to bring that feature to Fire TV 2 because the hardware is quite future proofed.***Update 4/23/14*** HBO GO is coming to Fire TV by the end of 2014. In the meantime HBO shows that do not air anymore will be added to Amazon Prime in a few weeks. A small victory for us all!", "verified": true, "helpfulness": "41/69", "author": "David Kavic"}, {"rating": 3.0, "review": "Couple of things caught my eye on this new device.  Voice activated search: finally an improved way to find your programming , yes!  The ability to mirror from my tablet to my TV, yes! The ASAP feature, no more buffering? Yes! That would be awesome!  Finally the quad processor  and more memory  is a step up. These are the reasons I bought the Fire TV.EDITED COMMENTS: After receiving and using the Fire TV: Disappointed :(  , voice activation works, yes, finally got mirroring to work. Its is faster, granted, no problems whatsoever playing Amazon content, Netflix movies took a bit longer to load but played fine. The lack of a broader spectrum of apps is disappointing, I hope that improves. Until Amazon gets the number of channels i use on Roku, I'm keeping my Roku 2 for now. Luckily, both units use the same cords so easy enough to unplug one and plug in the other if I want to watch content on the Roku. Seems the Roku is staying number one for now, but keeping the the Fire as I am sure Amazon will add more content with customers demanding it.Bottom line, great for Amazon movies and TV, games: meh, I dont play them and they look very childish, lol. Replaces my Roku? not quite. Better than Apple TV? I dont know, never owned one. Sorry Amazon, three stars for just OK. More content, more content, more content. Need to catch up with Roku, lol", "verified": true, "helpfulness": "36/58", "author": "Chow"}, {"rating": 5.0, "review": "My box is on order. I dumped Time Warner 4 years ago.and watch video on my laptop...rarely watching broadcast tv.  This is a step forward to my mind. I do have s subscription to Acorn Tv and would love to see this on Amazon TV", "verified": false, "helpfulness": "9/44", "author": "C"}, {"rating": 5.0, "review": "Good move adding HBO Go!", "verified": false, "helpfulness": "0/0", "author": "J&J Wiley"}, {"rating": 1.0, "review": "You are kidding right? Zero stars right now until you get HBO GO, then we can start talking.HBO has the best shows, without HBO GO I don't see how far you can get.", "verified": false, "helpfulness": "25/364", "author": "Alex theodo"}, {"rating": 3.0, "review": "....seems like a bit of a dealbreaker to me. if i wanted a game controller/set top box, i'd go with a good/old 360...seriously. A used 360 + a good deal on an xbox live sub will generally cost less than $150. for not much more bucks, you get a whole lot more bang", "verified": false, "helpfulness": "5/134", "author": "teejay"}, {"rating": 4.0, "review": "First thing I noticed out of the box is the size of the unit. Amazons press release said its as small as a dime (obviously a dime standing on end and not as thin as a dime). Setup was a breeze and its pre-registered to your amazon account so Prime is ready to go right away. I also have a Google Chromecast and the faster speed of the FireTV is noticeably faster than the Chromecast and has no lag.As far as the apps go my first big disappointment is the lack of HBOGO. How can I finish binge watching Game of Thrones before season 4 comes on this week? I'm kidding no HBOGO sucks but you have to have an HBO subscription anyway so I can just watch that on my other TV until Amazon adds it (I read somewhere that HBOGO will be coming soon). Showtime Anytime and espn apps are a big plus since I do not have those apps on Chromecast. For most people the Netflix and HULU apps are going to get the most use. And Plex is pretty coolThe remote is simple, just a few buttons. You speak into the remote for voice search. Voice search was what GoogleTV was supposed to be, except google made a large clumsy remote with a full keyboard rather than simple voice. UPDATE: ok after using it more voice needs refining. Every search returns results from Amazon Video and they will sometimes have a \"other ways to watch\" link that takes you to Hulu. No option for Netflix or Showtime. I searched for Dexter and only Amazon's offering came up saying I could rent it or buy it, no mention of it being on Netflix (which it is) or ShowtimeAnytime. I tried to search for a Netflix only show and tried Orange is the New Black and it couldnt find it at all it only brought up House of Cards.... You can only get to Netflix shows by opening the app. That makes the voice search much less useful....As far as the hardware goes, there are ports for HDMI, optical audio, and ethernet cable. Using a wired connection is great for me since my wireless router can be spotty at times. The gaming controller is extra ($40).I haven't tried the gaming yet. I will update when I do. I expect it to be something for kids or casual gamers. More competition for Wii users than PS4 or Xbox. Things like this just aren't as powerful enough for more serious gamers. you won't find titles like call of duty or GTA on this thing but you'll probably see more fun oriented less graphics dependent simple games.I don't have kids but it has the same kid options as the kindle fire. FreeTime etc.The mirroring only works if you have Kindle Fire HDx tablet. didnt work with my Samsung tablet. Which sucks since I figured I could just mirror HBOGO on my tablet.If your looking at one of the $99 streaming devices I'd say go with this over the Roku3 and AppleTV. There just seems to be more advantages to the FireTV than what you'd be giving up by going with the other 2, especially when HBO is added. As for the Chromecast, its performance is not close to FireTVs but it only costs $35 and thats a major advantage if all you want to do is watch Netflix HBOGO and Hulu (chromecast has more apps than that I know, i'm just simplifying it). FireTV has all that, its faster, and has a gaming and voice search option.", "verified": true, "helpfulness": "16/20", "author": "Banquero"}]