[{"rating": 5.0, "review": "Easy, intuitive and the voice search works. I have purchased two more.", "verified": true, "helpfulness": "0/0", "author": "roostertom"}, {"rating": 5.0, "review": "Love it.  With Prime, Hulu, and Netflix who needs cable?", "verified": true, "helpfulness": "0/0", "author": "TDiggity3000 \"John Doe\""}, {"rating": 5.0, "review": "An excellent product and easy to install and operate.", "verified": true, "helpfulness": "0/0", "author": "Craig Adamson \"CGA\""}, {"rating": 5.0, "review": "all great", "verified": true, "helpfulness": "0/0", "author": "Judith Durant"}, {"rating": 5.0, "review": "Totally worth it. The delivery was on time. It was easy to install and it works perfectly", "verified": true, "helpfulness": "0/0", "author": "sahar"}, {"rating": 5.0, "review": "A++", "verified": true, "helpfulness": "0/0", "author": "Jose Huerta"}, {"rating": 5.0, "review": "Pretty good up to Now.", "verified": true, "helpfulness": "0/0", "author": "Claude Surena"}, {"rating": 5.0, "review": "I got this as a gift for Christmas and honestly couldn't be happier with it. Primarily I thought I would mostly be using netflix with it but after having prime for 2+ years I've finally got some use out of the prime instant video.It was so easy to set up, very easy to navigate (the voice feature, LOVE).My only complaint would be that the prime content be separated from what you have to pay for when you're just scrolling through videos, etc.Also, HBOGO still isn't available for my tv provider so that's a bummer.Overall I would HIGHLY suggest the Amazon Fire TV(I've used apple tv for 2 years prior to and it just can't compete)", "verified": true, "helpfulness": "0/1", "author": "AmberR"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Rebecca Veilleux"}, {"rating": 5.0, "review": "Set up was easy after we realized we needed to go out and buy some kind of extra (inexpensive) cable for the audio to play through our tuner/speaker system. If you are going to play the audio through your tv, you'll be ok and won't need the cable.We love the small size and ease of using the box. It works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "J. Gustafson \"Retired School Counselor\""}]