[{"rating": 5.0, "review": "This is my first time using such a device and I absolutely love it.  Excellent design and the most easiest piece of equipment I have ever used.  Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Carlos C Gonzales"}, {"rating": 4.0, "review": "I really love it.  It's so much nicer than my old Roku box.  MUCH better remote.  When I pick it up and push the button it automatically comes on and has been changed from cable T.V. to the Fire for Netflix movies or games and Amazon Prime if you have it.  No grabbing the Other remote to change the input.  It's real worth the money.", "verified": true, "helpfulness": "0/0", "author": "Neater"}, {"rating": 5.0, "review": "Amazon Fire TV is easy to set up and even easier to use.  It allows you quick access to new and old programs and movies by whatever search criteria you establish.  It can even be done by voice.  This user friendly system makes it much easier to find the entertainment you are in the mood to view.", "verified": true, "helpfulness": "0/0", "author": "Gary C.Friebus"}, {"rating": 4.0, "review": "I love everything about amazon, so even though it's pricier than a Roku, it's worth spending the money on.Couple things I didn't realize (which I should have known), does not come with HDMI cord and DirectTV does not support showtime anytime. You have to download and activate all apps on your computer, which in my opinion is kind of inconvenient, but it only takes an extra step.Overall, everything is good, also the voice search is easy and user friendly, so that is a plus!", "verified": true, "helpfulness": "0/0", "author": "Kayla Mahaffey"}, {"rating": 4.0, "review": "I just bought Fire TV after reading the reviews. It lives up to its promise. It was easy to install and use. I had an issue with Netflix, but that was a Netflix problem and they fixed it. It mirrors my HDX easily and as well as the Push2tv.  It still needs the voice search to be directed to the app you are using and a much wider selection of content.  Having been an Amazon customer for years and buying new technology, I am confident that there will be many upgrades coming to address these and other reviewers concerns.", "verified": true, "helpfulness": "1/1", "author": "Tom Henderson \"musician in my mind\""}, {"rating": 5.0, "review": "I love this product. the voice search is what I like the most compared to other brands. I got the product the next day it was great", "verified": true, "helpfulness": "0/0", "author": "Calvin C."}, {"rating": 3.0, "review": "If the menu was set up like it is on line it would be easier to use. It gets flustrating trying to guid thrugh the movies.", "verified": true, "helpfulness": "0/1", "author": "ronale e moberly"}, {"rating": 5.0, "review": "Here are some comparisonsApple TV: this is a great product for your apple products it has a low processing power and might take a minute to load you shows or videos. There are no free tv shows/movies to watch in the iTunes StoreAmazon Fire TV: the fire tv looks great very thin but slightly larger than the Apple TV. I hardly notice mine. It has a vast App Store and games you can play on the tv. You get a free trial of amazon prime which gives you access to thousands of free tv shows and movies!", "verified": true, "helpfulness": "0/0", "author": "Patrick is your pal"}, {"rating": 5.0, "review": "It works as advertised, which is great.  The most difficult task was opening the box! I would definitely recommend it to friends.", "verified": true, "helpfulness": "0/0", "author": "mslahip"}, {"rating": 1.0, "review": "Netflix is purposely difficulty to use with an outdated interface making it necessary to hand inter such information every time.", "verified": true, "helpfulness": "3/12", "author": "Amazon Customer"}]