[{"rating": 5.0, "review": "I am amazed at the quality of Amazon Fire TV!  It was very easy to set up. Then there is a large variety of TV shows and movies. But the HD picture is truly awesome! I thought my cable HD looked good but the Fire is so much clearer. I especially like that I can see certain TV series from the first season on for free (especially Eureka and Warehouse 13). The one thing I don't like is that you don't know what is free vs what costs extra as all of them are mixed together in the menus.  If there was a way to differentiate free vs cost per menu that would be helpful.  But overall I enjoy the Fire and haven't watched much cable lately. I highly recommend it.", "verified": true, "helpfulness": "2/2", "author": "treez"}, {"rating": 5.0, "review": "I am very pleased with the Amazon Fire TV. It is a snap to install and delivers a great picture through my HDMI. It is so small that I can easily move it from room to room with no problem. I think that the price was fair because of the quality of the product.", "verified": true, "helpfulness": "1/1", "author": "Cleo Wright, Chicago, IL"}, {"rating": 1.0, "review": "- I'm not going to repurchase apps and games with amazon just so I can try to play them on my TV.- App store is limited.- Amazon refuses to release an instant video app for Android, so I am refusing to keep this device.- Old version of Android on the FireTV.- had better playback with a wireless chromecast than a wired FireTV box. (This shouldn't happen).- Voice search was clunky and didn't work the best, no real search features for anything else other than paid Amazon Content.- Can only cast with the amazon tablets.- No clear method to see pricing unless you click on an individual title.- had to pull the plug and cycle the power several times when using because it would show a \"Can't play video\" error.- Didn't include an HDMI cable.  Really?!- No Google Play Music, Google Search, Google Play Store, Google Maps, Google Earth, Real Google Youtube App, Google Play Games, Google Hangouts, Google Movies & TV, etc.", "verified": true, "helpfulness": "5/11", "author": "nerdshowandtell"}, {"rating": 5.0, "review": "Ordered before lunch on Thursday and in my hands by about 2:00 pm the next day - Outstanding processing of my order and delivery from Nevada to Oregon.Very easy setup and quality of delivery of content through the internet, something I hadn't been satisfied with just through my service providers efforts.Amazon is more and more becoming my first choice of provider on a wider and wider range of purchasing needs.", "verified": true, "helpfulness": "0/0", "author": "Stephen R Walsh"}, {"rating": 5.0, "review": "Amazon Fire TV is perfect for my wife and I. Love every aspect of it including the watchlist.Well thought out and executed.Way to go Bezos!", "verified": true, "helpfulness": "0/0", "author": "Mark Wells"}, {"rating": 5.0, "review": "I really like this device.  It makes using Prime a breeze.  It also has a number of apps that I use all the time now (eg.  IHeart Radio.)  This past week I installed XBMC on it and now I can access all my music and movies on my NAS.  XBMC offers a whole bunch of other apps and skins to make it your own.  I'm still playing with XBMC but am happy with it so far.  Instructions on how to do this are on the internet with videos.  Amazon needs to include XBMC as an available app.I am now thinking of getting SONOS speakers so I can have music in different zones with the Fire TV.I wish Amazon or someone would come up with an Android and/or Apple app to control the Fire TV with a smart phone or tablet from anywhere in the house.  My AV Receiver has that capability and it is great.Still playing.", "verified": true, "helpfulness": "0/0", "author": "Pdljmpr \"JT\""}, {"rating": 2.0, "review": "Very easy to set up.  As soon as I started watching a show it started to freeze the picture.  I tried another show and did the same thing.  I'm returning it.  Hopefully Amazon will fix the kinks.", "verified": true, "helpfulness": "1/1", "author": "Lindy Donat"}, {"rating": 4.0, "review": "Overall I'm happy with my Fire TV. It's used more than my Xbox 360 and Blu-ray player now. Easy to setup. Quick to start up. Voice search works well. I only have two knocks against it:1. Voice search doesn't work everywhere, specifically Netflix. It's not a huge deal, but it's still annoying.2. It crashes every now and then. I'll be searching for something to watch and suddenly get a blue screen. After a few seconds it reboots and I'm good, but it's crashing more than I would expect. Around once a week or so.Other than those things I really like the Fire TV and would definitely recommend getting one if you're thinking about it.", "verified": true, "helpfulness": "0/0", "author": "C. Ruzin"}, {"rating": 2.0, "review": "It wasn't @ all what I expected. First with prime you hd to pay for movies that had been out for awhile. Second I didn't plan on paying for movies. A waste of 100 dollars. I should've been satisfied with Netflix.", "verified": true, "helpfulness": "1/5", "author": "LaVella Green"}, {"rating": 5.0, "review": "I love this thing!This has much better hardware than the Roku and is the main reason why I purchased it. Despite this fact, it is the software that will make or break it. The apps that are on it work very well, but they are no where near as many as on the Roku. But give it time and I suspect the Fire TV will be filled with as many great apps as the Roku.Note to Plex users: Plex subtitles do not work that great and are out of sync. Also HDHomeRun currently does not work in Plex on this device.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]