[{"rating": 5.0, "review": "I'm loving the fire TV. I was under using my PRIME account and now have access to so much more at no additional charge.  This is a no brainer for PRIME members.", "verified": true, "helpfulness": "0/0", "author": "George G Burke III"}, {"rating": 3.0, "review": "It is an okay product that could use a number of upgrades.A lot of stoppages with a slow DSL (1.3) internet connection.Perhaps, it should have a much larger internal buffer.The menu seems overly difficult to locate various offerings.Some of the apps such as PBS don't offer much that I would like to watch.", "verified": true, "helpfulness": "0/0", "author": "EMudgeSr"}, {"rating": 5.0, "review": "Works great easy to set up", "verified": true, "helpfulness": "0/0", "author": "Dmart444"}, {"rating": 4.0, "review": "I was impressed with the interface.  I have always used AppleTV.  Since I was a prime member, I thought I would order one to see the difference.  I am pleased.", "verified": true, "helpfulness": "0/0", "author": "Curtis LeMaster"}, {"rating": 5.0, "review": "I am very impressed with for t.v this product have exceeded all my expectations by a long shot. Another goes to Amazon in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Richard Bailey"}, {"rating": 4.0, "review": "Yes we are enjoying the Fire TV,  There are a couple things that are bothersome like how can you have different kinds of music other than the only selections all ready in Pandora.  We only have 4 choices.  Why don't they have the prices for renting the movies that aren't Prime instant videos posted with the movie info?", "verified": true, "helpfulness": "0/0", "author": "Karen S. Gruntman \"ksdacinci\""}, {"rating": 5.0, "review": "Very easy to work with.", "verified": true, "helpfulness": "0/0", "author": "Jon Y."}, {"rating": 4.0, "review": "Good player for Netflix, Hulu, and Amazon Instant Stream. Very fast player, also most no lag with the control. Has a control app for your android phone. I took off a star because the search only accesses Amazon Instant stream and Hulu. It needs to be applied to youtube and Netflix and than this will be perfect.", "verified": true, "helpfulness": "0/0", "author": "NiW"}, {"rating": 5.0, "review": "I love it. It does everything it promises to do.", "verified": true, "helpfulness": "0/0", "author": "Marybeth Westby"}, {"rating": 4.0, "review": "It's everything I was looking for. The interface UI could be a little more clear, but otherwise it's GREAT. Love it. :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]