[{"rating": 5.0, "review": "Ejoyable", "verified": true, "helpfulness": "0/0", "author": "JOE HAAS"}, {"rating": 5.0, "review": "Two words- LOVE IT", "verified": true, "helpfulness": "0/0", "author": "David J MacIntosh"}, {"rating": 3.0, "review": "I do like like this product.  this is probably just me however I would take my Roku any time .  the amazon fire is hard to get into hula or netflicit works well with the voice but you have to know what it is you are looking for.  It really pushes for amazon movies  and tv  then they are mostly a charge to use them.", "verified": true, "helpfulness": "1/2", "author": "karon johnson"}, {"rating": 5.0, "review": "happy so far, has worked well for my non internet tv, only one issue is you can't talk into it and Netflix stuff comes up.  only applies to amazon movies and tv shows not another other ones for talking features.  and unlike Netflix, amazon has a lot more you have to pay to watch vs flat fee a month for Netflix,  but solved out issue of being able to watch Netflix on a non internet tv.  Small box is easily hides from site, and is clean look.  I hate wires showing this was easy to conceal.", "verified": true, "helpfulness": "1/1", "author": "Thomas"}, {"rating": 5.0, "review": "I have also an atv2 but this is better and faster. The prime service is a very appreciated add-on.", "verified": true, "helpfulness": "1/1", "author": "Simeons"}, {"rating": 5.0, "review": "5 star experience", "verified": true, "helpfulness": "0/0", "author": "King"}, {"rating": 4.0, "review": "Enjoyed it very much. It was easy to use.  I plan to keep using it.", "verified": true, "helpfulness": "0/0", "author": "skysoldier69"}, {"rating": 4.0, "review": "Please either add an option for a software reboot, or fix the error whereby amazon videos don't play anymore after days of being on. I don't want to have to walk over to unplug and replug to fix.", "verified": true, "helpfulness": "1/1", "author": "Gregg Durishan"}, {"rating": 4.0, "review": "excellent works terrific", "verified": true, "helpfulness": "0/0", "author": "Gray Wolf \"Gypsy\""}, {"rating": 3.0, "review": "The physical device works quite well. I was especially impressed with the voice recognition system that let's you speak your search requests.Unfortunately, for my purposes, the media offered does not interest me.  I get more entertainment value from YouTube via my PC or Mac..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Ack, who else?\""}]