[{"rating": 4.0, "review": "So far, I am very happy with this device.  I'm hoping that some live news channels will appear in the line up so that I can eventually get rid of my other TV service and use this exclusively.  I waited for the price to drop and when it did, it was a great deal at $69 for that one day so I grabbed it; glad that I did!", "verified": true, "helpfulness": "0/1", "author": "Holly Rubino"}, {"rating": 5.0, "review": "Great device, easy to set up.  Streams fast and the voice interface works better than I thought it would.  Love the fact that all my prior Amazon purchases (music and movies) are automatically available.", "verified": true, "helpfulness": "1/2", "author": "B. P. Bunn"}, {"rating": 4.0, "review": "the remote is very limited -otherwise the picture is nice", "verified": true, "helpfulness": "0/1", "author": "Sol Akerman"}, {"rating": 5.0, "review": "Very intuitive, far better than the TiVo solution we were using before!", "verified": true, "helpfulness": "0/1", "author": "Mary Pertner Churchill"}, {"rating": 2.0, "review": "Not extreemly impressed. I actually like my roku 3 better. Easier to manage and it is setup like a playstore on my android. This fire tv is kind of weird how its setup.", "verified": true, "helpfulness": "1/4", "author": "Phantom"}, {"rating": 3.0, "review": "I like that it is fast loading, great pic quality, and easy to hook up.  Imo the menus are not user friendly and seem to always favor Amazon content when searching.  I ended up going to the Roku which I liked better.", "verified": true, "helpfulness": "0/1", "author": "nowisthetime"}, {"rating": 5.0, "review": "I upgraded to this unit from Apple TV2, and I am very happy that I did.  It is smooth and responsive, and as a Prime member; you cannot go wrong with such combination.", "verified": true, "helpfulness": "0/1", "author": "Nhan Van"}, {"rating": 5.0, "review": "This is a great device. I currently have the FireTV, a 2nd Gen Apple TV and a Chromecast. While I have many things in the Google ecosystem and will continue to use the Chromecast for those things I will be retiring the AppleTV and the Fire will be my go to streamer for most likely 80% of my viewing. It really is simple to setup and use. The menu is easy to navigate, voice search works quite well and the display quality is excellent. The one quibble I have with the Fire is the remote app on Android. It is only so-so and the touchpad in that app is far too touchy, Amazon would likely be better served to have their app include a directional keypad rather than the touchpad as the touch is just too sensitive and prone to false clicks/selections.", "verified": true, "helpfulness": "1/1", "author": "shinerburke \"shinerburke\""}, {"rating": 5.0, "review": "I love it. Not a big TV or Movie guy. So i can listen to my music, stream music, or watch Youtube videos.  Only negative part is the voice command sucks. You can live without it. A+++++++++++", "verified": true, "helpfulness": "0/1", "author": "Matthew Pauley"}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "PS"}]