[{"rating": 3.0, "review": "I just received the Fire, trying it out for 30 days.  Easy to install no doubt.  The whole premise of getting a Fire, Apple TV, etc. is to dump my cable, which I am sure is most peoples reason.  So upon setting it up and reviewing the apps, I see where the Showtime Anytime app still requires a cable subscription, which defeats the purpose of the Fire IMO.  I called Amazon and the rep was completely surprised at this dilemma, or so I was led to believe.  He informed me that Amazon just provides the platform for the showtime app, and I could get a monthly subscription via the showtime website.  Well that is not the case, as he and I soon learned upon further research.  I mean Fire basically does the same thing as my new smart tv, so I am trying to find the value of having fire.  I was under the impression when first researching fire that I would get showtime under some partnership they had with amazon, so it made sense for me since I watch a good deal of showtime.  I am debating on keeping fire, dumping cable, watching showtime through Netflix, or prime, whenever the shows are available.  Not 100% sure yet.  Also I am sure the ESPN app is going to fall under the same parameters, requiring a cable subscription to view, which again almost defeats the purpose of going the non cable route.  Also I see that coming in the fall fire will offer the ABC TV ap, so will I have to have cable to view this as well, or is it pure streaming?  A better explanation needs to be provided on the front end of how this all operates IMO, but I know it is a numbers game for amazon and they know a certain amount of purchasers will point out the dysfunction, while most will not.", "verified": true, "helpfulness": "4/6", "author": "Angela Fischer"}, {"rating": 4.0, "review": "this is a good option for movie streaming. It has the app for Netflix and Hulu as well as a few others. It's not as good as Ruko for the \"extra\" channels so if you plan to cancel cable this may not be for you. It's very easy to set up and use. Love the voice search but wish there was a  better \" alphabetically search every movie we have \" option.", "verified": true, "helpfulness": "0/0", "author": "AL412"}, {"rating": 4.0, "review": "So the FireTV is pretty sweet, it has a few drawbacks but the ability to play videos and music is solid. You have to have a prime account for this to be a worthwhile investment. It does the search via voice thing pretty well, if it's in Amazon's catalog. I use Plex for my local media and it's nice to have a full screen gui... Lots of eye candy. The remote they give you is double edge, it works great with the FireTV but if you want a universal remote it's another purchase of a WMC dongle and following a guide that you can search for (it has the model of dongle to purchase too). The size and weight of the unit is on par with the others in the group of small media players. My main player is a Roku 3, it has a larger selection of OTT video providers, it's also the senior member of the players and has large development community. The FireTV is catching up, if it's a large commercial video or music provider it should be available if not now/soon. I like it, 4 out of 5.", "verified": true, "helpfulness": "1/1", "author": "John Benson"}, {"rating": 5.0, "review": "This is what TV should be! You do not have to watch all the garbage while waiting on a good program. You go to what you want and click on it. You want a snack you pause it. No goofy commercials, best of shows...Even if I bought EVERY show I want to watch I do not think it would reach the amount I pay for cable. I pay for Prime which pays for itself by shipping and now pays again for free shows, movies etc. It is simple and easy to use. It is just about plug and play. Only thing you have to have is your Wi-Fi password and your ready to go.", "verified": true, "helpfulness": "1/1", "author": "E. Hamilton \"Satisfied Customer\""}, {"rating": 5.0, "review": "I bought this to replace my Apple TV unit and I have not been disappointed. The hook up was incredibly easy and it boots up instantly. The voice recognition is great. There is no stutter or lag from streaming and the interface is great. If you are listening to Pandora the unit will switch to some incredible scenery photo's as screen savers after a few minutes of Pandora screens. The pictures are incredible.You will not be disappointed with this unit", "verified": true, "helpfulness": "0/0", "author": "cav vet \"2CavVet\""}, {"rating": 4.0, "review": "Having said that, a comprehensive selection of apps is necessary to enjoy this device. Well worth the money. Can't wait for upgrades", "verified": true, "helpfulness": "0/0", "author": "Adirondack Al"}, {"rating": 5.0, "review": "I'm in my mid 40's so I don't do gaming , but this is a great addition to my tv. It has everything I like. Very very easy set up . It basically set itself up. Videos stream very good. Great purchase", "verified": true, "helpfulness": "0/1", "author": "lisa"}, {"rating": 2.0, "review": "What a disappointment. I figured I would be able to access the Prime free movies. I should have known better. They are mixed through pay movies, to hard to find. Yes you can access Netflix and others, but not by voice.", "verified": true, "helpfulness": "1/1", "author": "Trag"}, {"rating": 5.0, "review": "From being able to watch ALL of the Soprano series for FREE to all of the other options.... I LOVE MY AMAZON FIRE TV!!!  :)", "verified": true, "helpfulness": "0/0", "author": "Michael Pullinzi"}, {"rating": 4.0, "review": "The only thing holding me back from rating this a 5 is the fact that it is extremely frustrating to find what you want to watch free in Prime. All titles are mixed in together. You might luck up and find something but you'll have to have the patience of a saint. I end up watching Hulu or Netflix so as not to pull my hair out in frustration. Overall, not bad though,that being said. Also you cant get Showtime unless you  are already a Showtime subscriber through your cable company, this is true for the Espn app too. I cannot wait for them to come up with an update that will eliminate free/rent merging together. Lastly, easy installation and selections load fast.", "verified": true, "helpfulness": "0/0", "author": "Barbara Smith"}]