[{"rating": 5.0, "review": "This was a gift for my parents and they love it. They really like the voice command feature. My brother also got the Fire TV set up after he talked to the folks and he loves it the same also.", "verified": true, "helpfulness": "1/1", "author": "Robert Erickson"}, {"rating": 3.0, "review": "My second one works good, 5 otherwise", "verified": true, "helpfulness": "0/1", "author": "terry schramm"}, {"rating": 5.0, "review": "A lot of joy and entertainment in a very small box. It hardly takes up any space.  I turned my TV in the kitchen that's not connected to my cable or anything into a \"smart\" TV with my Fire Box.  I am loving watching movies and TV shows while I am cooking or just hanging out in my kitchen.  Fire TV is so easy to set-up and the voice-activated remote control is awesome.  Plus, my photos can be shown on my TV as well.  I'm putting together photos for Christmas that can be shown while we make the Christmas dinner.  Fire TV  was one of my best purchases this year.", "verified": true, "helpfulness": "2/2", "author": "Stella C"}, {"rating": 5.0, "review": "I was surprised how easy it was to set up.  My wife is very happy therefore I'm happy.  Thank you.....Ray", "verified": true, "helpfulness": "0/1", "author": "raymond wickl"}, {"rating": 5.0, "review": "I really like it for what I wanted to do with it which was to run SPMC. But in terms of a media player is slightly below an Apple TV (Roku is the best). There is no NHL Gamecenter which is VERY disappointing, but luckily I can us an app in SPMC it get it working. I would buy more of these to replace the Roku and 2 Apple TVs in our home but they have disabled root access in the latest models.If you want the best media player get a Roku, if you are in the iOS ecosystem get an Apple TV. If you want something that's always trying to sell you stuff, get a fire. You can still load XBMC even without root access it's just not as fun.", "verified": true, "helpfulness": "1/1", "author": "Vladimir"}, {"rating": 5.0, "review": "I was very pleased when my Fire TV arrived.  I plugged it in and it knew it belonged to me and had my Amazon Prime already loaded.It is easy to use and I love the voice search option.I also liked the special price I paid.  What a savings!Thanks!!", "verified": true, "helpfulness": "0/0", "author": "Daniel DeSiato"}, {"rating": 5.0, "review": "I love the Fire TV so far, I have been using it for only a few days but setup was soooooo simple and quick. I love the voice search it works great and the interface is very intuitive and fast. I am using it with a Pany Plasma TV and an onkyo 7.1 surround sound receiver. I use a HDMI from the fire box to the TV and a digital audio cable from the fire box to the onkyo receiver. The apps are good at this point only using the pandora app. Movies stream very smooth even over DSL. Overall very pleased", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is going to be a good thing", "verified": true, "helpfulness": "0/0", "author": "Walter L Shields"}, {"rating": 5.0, "review": "All is great", "verified": true, "helpfulness": "0/0", "author": "Lawrence jones geder"}, {"rating": 4.0, "review": "I like fire TV, the apps are great. The only thing is amazon needs to put a better movie selection up for Prime.", "verified": true, "helpfulness": "0/0", "author": "Michael Bovard"}]