[{"rating": 5.0, "review": "I had used the Chromecast and was not really happy with it. I ordered the Amazon Fire and I love it! The response is quick and I have no hesitation at all.", "verified": true, "helpfulness": "0/1", "author": "Diana's Fire"}, {"rating": 4.0, "review": "So far it has worked as advertised.  Very easy access to Prime content and the interaction with Netflix is very easy to use.The voice recognition has been perfect to date.It is my preferred set-top box.  The Apple TV is getting dusty now.", "verified": true, "helpfulness": "0/1", "author": "John Nelson"}, {"rating": 5.0, "review": "No comments other than great product.  I particularly enjoy the variety of selections and seamless ease of use.  Plan on purchasing additional units for other TVs", "verified": true, "helpfulness": "0/1", "author": "Kenneth Elmassian"}, {"rating": 5.0, "review": "I haven't used it much.  It is in a guest bedroom with no cable.  The picture was perfect and the response was extremely fast.  The voice commands work great.", "verified": true, "helpfulness": "0/1", "author": "Johnnie Johnson"}, {"rating": 3.0, "review": "The picture quality is great and plays high definition media well.  My biggest letdown is that it is currently not capable of passing through high definition audio such as DTS-MSTR or TRUE-HD.", "verified": true, "helpfulness": "1/2", "author": "PcRocks \"PC Lover\""}, {"rating": 4.0, "review": "I see a lot of good shows, but there is some scheduling as per seasons allowed and further additionsThat will e added. If you have \"24\" as only a season one, that may not be enough due to everyone knows thatThere is about 6 seasons available now, but more new ones may start up.Another item to look at is a menu for other things like netflix. If you feel the need to compete there, then youMay need to show screens as good as netflix has now. A person who uses netflix now and wants to switchBetween amazon and netflix, should be able to do so with the same screen formatting there too.", "verified": true, "helpfulness": "0/1", "author": "ALLEN F JOHNSON"}, {"rating": 4.0, "review": "This is one step closer to a la carte television programming.We recently went through our Dish Network Channels that we have with the 200+ packaging and identified all of the channels we have ever watched, even if it was just 1 time, and had a total of 46 channels we ever watched and only a hand full of those are on a regular basis.From a cost perspective, FireTV may just become our video provider. I would like to see some type of sports packaging come available. But, other than that, it performs fantastic. We have Comcast Highspeed and we have not noticed any buffering issues. I hoe this continues to be enhanced with additional viewing options. Maybe allow for an antenna interface to pass local channels through the same video connection.", "verified": true, "helpfulness": "2/2", "author": "Larry D Heiken"}, {"rating": 5.0, "review": "This little piece of equipment is a great way to watch movies and TV series. It's so simple to use.", "verified": true, "helpfulness": "1/2", "author": "BONNIE"}, {"rating": 5.0, "review": "I have had Apple TV and Roku for over a year and I can say without reservation that the Amazon Fire TV is far better for two reasons:  1. The program/movie I want to watch starts IMMEDIATELY with a single click, unlike Roku and Apple TV which can take forever at times after several clicks. 2. Voice search. Having to type search can be cumbersome and a nuisance. Unless I want to watch one of the ITunes movies I own on the Apple TV, I always use the Fire. It's simply better!", "verified": true, "helpfulness": "1/1", "author": "Ian Keeper"}, {"rating": 1.0, "review": "I connected one end of the hdm1 cable into hdm1 port so on.  turned on tv. no screen guide for set up", "verified": true, "helpfulness": "2/6", "author": "Audrey Macedo-Burman"}]