[{"rating": 3.0, "review": "I'm disappointed that you can't get more channels without having existing services like USA, lifetime, Disney channel. The whole purpose of buying this was to get rid of paying high cable bills.", "verified": true, "helpfulness": "1/12", "author": "Judy Stogner"}, {"rating": 3.0, "review": "Haven't had too many issues with keeping connection however the voice part stinks!!", "verified": true, "helpfulness": "0/6", "author": "SCJ"}, {"rating": 5.0, "review": "Wish I would have purchased this sooner! LOVE, LOVE, LOVE IT!", "verified": true, "helpfulness": "0/3", "author": "Carol Donovan \"Luv my Westie pup\""}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/3", "author": "Darren"}, {"rating": 2.0, "review": "I didn't care for this, I returned it", "verified": true, "helpfulness": "0/14", "author": "Margarita Perez"}, {"rating": 4.0, "review": "love the product, but sometimes goes crazy when it gets hot. and it gets hot fast because it is so small. I thought it was bigger. But good product.", "verified": true, "helpfulness": "1/3", "author": "Dennis Forbus"}, {"rating": 5.0, "review": "I never really take the time to review an item that I have purchased. Never see the point. On this purchase I do. I can say Amazon got this right. I have had this item since it has come out. We have taken it everywhere with us, on trips, camping and etc. It has never let us down. As long as you have Wi-Fi you have Amazon Fire T.V.Now with all things there is on con to the fire T.V. I have yet to find out how to save several Wi-Fi network keys on the devise. Which means in order to reconnect you have to walk through setting up he network all over again. Besides that its a great buy. If your a prime member this is a great buy!!!!!", "verified": true, "helpfulness": "2/3", "author": "love"}, {"rating": 4.0, "review": "Just installed this a couple of days ago and so far I am very happy with the layout and content.One issue installation frustration I had, which was not directly an issue with the AFTV box, was that the AFTV box was not being recognized as a component on my Samsung Smart TV when I plugged the HDMI cable into the TV set. I tried all different combinations of HDMI cables, ports, etc. but to no avail. After some investigation I found that you need to \"unplug\" your TV and all together for a few minutes and then connect the HDMI, then power on the TV and finally power on the AFTV box. This worked and I've had no problems since then. This probably does not happen that frequently but I hope this will help someone who might be going through the same frustration that I did during the installation / setup period.", "verified": true, "helpfulness": "3/3", "author": "Mike & Kim Learned"}, {"rating": 5.0, "review": "Better than the Roku box I had. Faster download.", "verified": true, "helpfulness": "0/0", "author": "WV Man"}, {"rating": 5.0, "review": "I am impressed with the Amazon Fire's features and ease of setup... Works well and streams programs with high quality.  Love the speak feature.", "verified": true, "helpfulness": "0/0", "author": "Nick Poindexter"}]