[{"rating": 2.0, "review": "I was looking forward to this device because I use my Amazon Prime benefits pretty extensively; the movies, TV, books, music and 2day shipping. However, once I got it hooked up I quickly realized that movies and TV is all it does (well you can add games apps but I don't get into those so this review doesn't address games at all). Don't get me wrong, the picture quality is great, the digital audio works very well and the voice search is very fast and really cool. The problem is that that's all it does. Its an Amazon device and I can't browse Prime content on it like I can the Roku. The Fire TV comes with optical digital audio but I can't stream any of my Amazon music with it and keep in mind I'm writing this at the same time Amazon released Prime Music without any plans to access it with the fire TV. I can however, install the Amazon cloud player on the Roku!?!? The Netflix app is also better on the Roku. Listen, if we're going to pay more for an Amazon device then we should be able to access more Amazon features through it than on another device. What about shopping, music, our books and why doesn't it communicate with the kindle fire? The only feature that's supposed to work with the Kindle fire is flinging movies and TV to the Fire TV, and that doesn't work all the time. A stationary Amazon device that connects to your TV and audio system, interactively talks to your other Amazon devices and lets you access your Amazon account and all its services is a great idea; call me when that product hits the market.", "verified": true, "helpfulness": "4/6", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Would like to buy but waiting for HBO Go Please, or other wise will have to buy the Roku 3", "verified": false, "helpfulness": "1/4", "author": "David"}, {"rating": 5.0, "review": "I've never used an internet TV system or anything other than connecting my smart TV up to the internet. The Amazon Fire TV is a STEAL at $99. This thing is amazing, and it could do SO many more things than it advertised. The movies are in perfect 1080p and it is so simple to setup and use. Took a total of 30 minutes for it to be setup and working after updating the software. It is so much better with the addition of Amazon Prime Music. I love it and I am hoping that it can replace my DirecTV soon!", "verified": true, "helpfulness": "0/0", "author": "Travis Weed"}, {"rating": 5.0, "review": "I was spending $200 a month on U-verse.  Since I was already a Prime subscriber I read some reviews and jumped in.  At 64 I do not even care to keep up with the latest technology.  I purchased my 1st PC in 1986.  (An Eagle for Silicon Valley old guys)  At any rate, life is too short to live at the cutting edge of every new invention. But, saving money is a priority.  Amazon Fire is easy to set up.  Easy to figure out.  And Easy on the wallet.  I added Hulu to the package and feel I have plenty of options.  Internet connection and Hulu are my only set monthly TV expenses.  I'm saving at least $100 per month.  What's not to love?", "verified": true, "helpfulness": "2/2", "author": "Heinymann"}, {"rating": 5.0, "review": "I orginally owned the Chromecast for watching netflix in my bedroom with a non-Smart Flatscreen TV. Chromecast with netflix only works if your cellphone is powered on. With the Fire TV, I have alot of media available at my fingertips. Great Product.", "verified": true, "helpfulness": "0/0", "author": "Timothy Lake"}, {"rating": 5.0, "review": "I don't have a ton of experience in this category.  I know the options and have family and friends with them, but have never experienced them myself.  This product has exceeded my expectations.  The speed is amazing and the voice recognition is spot on, I even tried speaking in an accent and it still was able to pick it up.  Amazon listens to their customers and does an outstanding job updating and tweaking the software as needed, this is something I know other companies are not as upbeat doing.  This is Amazon's biggest strength, they reach out for customer feedback and actually act upon it.", "verified": true, "helpfulness": "0/0", "author": "chris timmerman"}, {"rating": 3.0, "review": "I ditched the cable TV subscription-cost too much and too many commercials.  Instead, I used Netflix, which kinda stinks in the quality programming category, but at least has no ads.  Then I got Amazon Prime which has many choice not on Netflix.  So when I saw this box, I bought it.  It said I would get AP, Netflix, ESPN and a bunch of other things. At lest those were the big picture claims at the time of the product launch.  And, i liked the Gary Busey ad about voice control.  So here is the reality.  Voice control is flawless (unless you have an unusual accent - my New Zealand born exchange student says it doesn't work well for him.)  With my family's standard American English, it never misses a beat, BUT it ONLY works with Amazon Prime.  Anything else requires the old hunt and click.  Not what I expected.  Next, I figured you would have to have a Netflix account or Hulu or whatever else you want to watch, but I figured Amazon had made a deal with ESPN so you could watch some of their programing through the box.  Not so.  It  appears to require you to have a cable TV subscription. Again this was not made clear in the initial offering materials.That said, is it worth it?  Yeah, I guess it is better than the blinking rip-off that cable TV has become. It works well, movie streaming is good quality, but it isn't anything you can't do with an iPad or computer.  That's it.  It is worth 3 stars unless you are a cable customer, then maybe 4 stars, but then why would you want it.", "verified": true, "helpfulness": "0/1", "author": "KTS"}, {"rating": 5.0, "review": "Our son recommended that we buy a Roku device which I did.  However, before we could even get it out of the box, I saw the email about Fire TV.  I have loved my Kindle Fire since I got it a couple of years ago and watch many videos on it, television programs and movies, especially when I am on my treadmill.With the Fire TV, my husband and I both can now take advantage of my Prime membership and we do nearly every weekend.", "verified": true, "helpfulness": "0/0", "author": "Margaret Champion"}, {"rating": 3.0, "review": "I have a lot of music, videos, TV shows and movies stored on my computer.  I am very impressed with this unit, except for the fact that it is NOT DLNA compatible.  I cannot access the media on my computer.  I can with my bluray player and my PS3, with no problem", "verified": false, "helpfulness": "0/1", "author": "waltzer002"}, {"rating": 4.0, "review": "Great visual output, features can and will get better I'm sure. Sometimes when I hit the home button before I turn on the tv (and not the other way around), I lose the volume. The voice search is also cool but I do wish the feature is not just limited to amazon's own content.", "verified": true, "helpfulness": "1/1", "author": "yesto"}]