[{"rating": 4.0, "review": "5 stars means something is perfect and that is tough for me to say about anything.  Fire TV was exactly what I wanted.  I own a Sony Bravia xbr2 and it could not get wifi.  So I wanted something that would connect to Netflix, Hulu, Amazon Prime etc.  So I had quite a number of choices, None of which I own before this puchase. Blue-Ray HD player,X-box, playstation, chromecast, Roku and Amazon Fire TV.  Just to name a few.  After carefully looking at capabilities, price and needs, I decided to purchase the Amazon Fire.  I was very impressed with the packaging.  It is a very small square black box with a small simple remote control.  It was very easy to connect since I already signed up for Prime I had an account and I already had Netflix. The Fie HD did not have any problem finding my wifi and I was able to view movies right away. T", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the design, speed is really fast and the voice recognition is the best!Would definitely refer this to a friend!", "verified": true, "helpfulness": "0/0", "author": "Ted"}, {"rating": 5.0, "review": "It was hard to imagine such a tiny box and remote of being capable of all it can do. I'm impressed with the set-up of the menus. Like most everyone else, I wish I could browse prime-only content, but searching by genre is good enough. I really like that I can click onto my iheart radio and listen while I browse for something else.I haven't tried any games yet, but I also have not bought the controller. I think I want to see more games added before I do so.The voice search works great. The remote is so small my cats think it is a toy so I have to constantly watch where I put it.Out here in the country, its hard to get Dish or Direct; and cable is outrageously priced. So for me, this is a purchase I do not regret. I will not return it.", "verified": true, "helpfulness": "1/1", "author": "Taylor P."}, {"rating": 4.0, "review": "this streaming device does very well.  i love the quad core to help it jump through some processing faster than other products in this space.", "verified": true, "helpfulness": "0/0", "author": "Keil F. Nitz"}, {"rating": 3.0, "review": "We own this and an Apple TV. I wanted to step outside our usual Apple environment, so know My preconceptions of a set top box come from Apple.The menus are a little awkward at first, but not too bad. The settings menu is oddly useless and unintuitive.The biggest problem is that it is obviously set up to try and dupe people into buying Amazon content. There is NO way to keep paid content separate from \"free for prime members\" content in their videos. This has me considering dropping the product entirely. I don't like having to triple check that I am not about to buy something every time I want to watch something, and I shouldn't have to populate my watchlist from a computer to be \"safe.\" It should be separate, period.Even things marked prime make you wonder, especially if you have parental controls on (which requires password entry for pretty much everything).The availability of apps and the selection of videos on prime are good, and the design of the unit and remote are good; however, it gets dinged two stars for the obvious trap of buying content when you didn't want it.", "verified": true, "helpfulness": "1/2", "author": "SomeChick"}, {"rating": 5.0, "review": "Just got this yesterday and so far it works great, much better than I ever imagined.  You will not be disappoint if you buy this, the voice command is where I thought I would have problems but it works great 100% perfect.  The remote is fast and responsive ,much better than any other remote I have..  A lot of thought was put into building the Amazon Fire TV...", "verified": true, "helpfulness": "1/1", "author": "CAPT  RON"}, {"rating": 5.0, "review": "Use it and you will never go back to Roku, Or Chrome or any of the others.  It's lightening quick on Amazon Prime Streaming and Netflix.  The voice search on Amazon (and soon on Netflix) is quick and I haven't had an error yet!  I even bought a controller because I can play the original Tetris on it (it's Tetris so I can't speak to amazing game play, but I'm pleased with the way Tetris is the regular console game and it still winds up beating me!!!!!!).  I think gamers will be happy tho.  But the basic box is amazing.  The picture is great it provides the source sound as well.  The only thing you might want to know is that you can't turn it off except by unplugging it!  I do consider this a negative and can't imagine why they left it out of the design.  But the box does go to sleep after 30 minutes of no activity.  So just change your video source, put the remote away and it'll sleep quietly until you need it again.  I'm not deducting a star because I'm sure they'll realize their mistake and correct it in future versions, but even now it's only a mild annoyance and the speed of instant streaming makes up for it and then some.  It's truly amazing and you have to see it for yourself.  In other words, despite that one minor flaw, I highly recommend Fire TV!", "verified": true, "helpfulness": "1/1", "author": "Richard The Buying Hearted"}, {"rating": 5.0, "review": "Great product, so easy to use. This product makes watching shows and movies so much more enjoyable.So easy to install. Definitely would highly recommend.", "verified": true, "helpfulness": "1/1", "author": "linda urgo \"lauthehut\""}, {"rating": 5.0, "review": "I tried one of the other devices before the Fire TV and hated it.  The Amazon Fire TV is excellent, easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "M. Parrish \"South Georgia Girl\""}, {"rating": 4.0, "review": "Think Amazon has taken cues from Apple for great packaging!Setup was EASYMicrophone works with Amazon but not sure it works within HULU or NetflixFigured out how to show subtitles!Looks to be well thot out!", "verified": true, "helpfulness": "0/0", "author": "MaryMartha \"MMW\""}]