[{"rating": 5.0, "review": "thank you", "verified": true, "helpfulness": "0/0", "author": "PITTMAN LEARY"}, {"rating": 5.0, "review": "Amazon Fire exceeded my expectations- very easy, \"viewer friendly \" remote controls.", "verified": true, "helpfulness": "0/0", "author": "Richard B."}, {"rating": 3.0, "review": "Was expecting better features and friendlier navigation through watching options. Not impressed!", "verified": true, "helpfulness": "0/0", "author": "Jose Estrada"}, {"rating": 4.0, "review": "I like the fast user interface.  It's similar to the Roku, but faster and more refined.  Video quality is great and all of the main streaming providers are there.  Roku seems to have more apps available to download.  Amazon claims thousands of apps available, but when you go into their categories, some of them were pretty empty and only had a handful of choices.My main complaint is the clicking sound on the remote.  It clicks whenever you press a button which gets annoying if you're trying to be quiet.  The click is somewhat loud and feels cheap.  This is a physical click, not a digital sound of a click, its actually cheap plastic rubbing against each other to product this annoying click.  The Roku remote is silent.  No audible button noises.", "verified": true, "helpfulness": "0/0", "author": "Hamburglar"}, {"rating": 4.0, "review": "What a great product. I can't get the voice commands to work all the time, though.", "verified": true, "helpfulness": "0/0", "author": "B. Drake \"darjeeling42\""}, {"rating": 4.0, "review": "It is OK, but buying a box to do what my Blue Ray does already was not as expected.I already have a Netflix membership and I did not have to buy a separate box to view their movies.Many of the Prime movies I can see on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Carlos Atherton \"USA Outlet Stores\""}, {"rating": 5.0, "review": "I didn't do that much research before buying. I went with Fire TV because I already had Prime. Set up was very easy and navigation is good. The reason I give this 5 stars is the voice search and the number of available movies from the 1930s through the 1950s. While I do watch some current movies by far I prefer the older movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So much better than any other media player!  I've recently tried a WD model and Amazon wins hands down!", "verified": true, "helpfulness": "0/0", "author": "Christopher Petrimoulx"}, {"rating": 5.0, "review": "Handy little TOY!  Works Great", "verified": true, "helpfulness": "0/0", "author": "JD Taylor"}, {"rating": 5.0, "review": "Really like the many choices to choose from on movies and TV shows and games! I also like the sceneries on the screen saver features", "verified": true, "helpfulness": "0/0", "author": "Travis Patterson"}]