[{"rating": 3.0, "review": "Remote if very fragile. It stopped working shortly after the wrranty ran out. Good news is that the tv remote seems to work with it but not all features are functional.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Streaming performance is not as reliable as I'd like, but a great product if you're tired of paying for all that cable", "verified": true, "helpfulness": "0/1", "author": "Daniel Christenson"}, {"rating": 4.0, "review": "I love being able to see my Instant Video purchases on the big tv, accessing YouTube and other streaming applications and the easy browsing options available.  The only Con is the lack of a power button on the remote.  Sometimes, at least in my experience,  you need to power cycle the fire tv box for it to sync with your WiFi.  How nice it would be to accommodate my couch potato mind set by adding a power on/off button on the remote and allow me to bypass the 5 steps to the Fire TV box, unplugging it and plugging it back in. Come on Amazon,  think if your couch potato customers and consider an simple on/off option on Fire TV.", "verified": true, "helpfulness": "0/1", "author": "why do they always ask for a pen name?"}, {"rating": 5.0, "review": "Thank You", "verified": true, "helpfulness": "0/1", "author": "jose mercado"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/1", "author": "hector brito"}, {"rating": 5.0, "review": "I haven't been able to hook it up yet", "verified": true, "helpfulness": "0/4", "author": "debbie"}, {"rating": 3.0, "review": "Well, I think my \"experiment\" with the Fire TV has come to an end after only one year. It's too bad, because I liked the capabilities of the Fire TV generally. Unfortunately mine has developed a glitch where the screen will simply go blank every now and again, and it requires unplugging the power to reset it. That's extremely frustrating when you're in the middle of a movie or a game because your flow gets interrupted. I've tried various ways to fix it, including resetting back to factory config (losing all my game data in the process), assuming that it was a misbehaving app that I installed, but the problem persists. I'm now thinking it's a memory location that's gone bad, which can't be repaired short of buying a new one.As I said, generally I liked the Fire TV. At the time I bought it it allowed me to combine a number of features that I had separate boxes for into a single, tiny unit. Scrolling through the menus with the remote annoyed me a bit, but given the limitations of the TV-style remote interface it's hard to imagine how else it could have been implemented. Playback was nice and smooth, even with the more graphics intense games, and there were plenty of different external connections that allowed me to hook it into my existing entertainment system in the way I wanted. There was always plenty of content to try, so it never got boring. In fact to a certain extent it was the opposite: there was so many things to try I sometimes didn't know what to try next.Would I buy one today? I'm not so sure. Smart TV's, which continue to get cheaper, incorporate many of the services today that were only available through something like a Fire TV a year ago. The main things that Fire TV offers in comparison are games and music, and there are other ways that one can add those abilities into an entertainment system. Still, for the money it's hard to beat the Fire TV. It packs a lot of features in a tiny box at an impressive price point.", "verified": true, "helpfulness": "1/2", "author": "S. Owens"}, {"rating": 4.0, "review": "Good product and easy to setup. Still learning to use all the features.", "verified": true, "helpfulness": "0/1", "author": "Hiker \"Dutch\""}, {"rating": 2.0, "review": "Disappointing.  Most of the free movies are either boring or filled with crude or dirty language.  Hoping things will improve.", "verified": true, "helpfulness": "1/6", "author": "ABI"}, {"rating": 1.0, "review": "Amazon Fire didn't work for me. Another waste of money and time. I got a no-hassle return, yes, but I was disappointed with the quality of the product. The image stream was always blurry no matter the quality of the Wi-Fi signal. Just to give an example/comparison, on one TV I had Netflix streaming through a \"smart\" DVD, here the image was crisp and in high definition. On another TV, at the same time, I had Netflix streaming through Amazon Fire, and the image was always blurry...", "verified": true, "helpfulness": "1/4", "author": "Csotoneira"}]