[{"rating": 5.0, "review": "I'm an exceedingly picky person about my technology and did a lot of research before buying the Amazon Fire TV, and I'm very glad that I did. It packs a huge amount of horsepower into a tiny little box at what I consider a very fair price point. (they do go on sale, however!) The single biggest reason I bought this unit was because of it's ability to \"sideload\" third party applications. This means you can add Android apps which aren't necessarily part of Amazon's store. Why would you want to do that? Well, the amazing little free application, Kodi/XBMC has been ported to android and it works perfectly on the Fire TV. Kodi/XBMC has the slickest interface of any media browser I've yet seen and as an open source project it's infinitely expandable with third party add-ons. What's even better, you can use Kodi to launch other Android apps from its own interface. That means, if you set things up right, you might never even have to look at or use the Amazon GUI. Of course, it's still there and you still have access to everything within it's purview, but you can just as easily take any application you'd access under Amazon Fire OS and create a shortcut for it inside of Kodi.I keep all of my media on a networked attached storage box in my basement. Using Kodi on the Fire TV, I can now play that content through a familiar interface using that singular, shared media resource. This goes for movies, television, pictures, music, etc. Kodi has the added benefit of being able to store its library metadata on a MySql database so every instance of Kodi/XBMC can share s singular library meaning my \"previously watched\" statuses or items in progress will be synchronized across every \"seat\" in the house.Another must-have feature for these boxes that only the Fire TV has is the wired ethernet port. Wireless is convenient and works great in many cases, but for streaming 1080p video there's really no substitute for a wired connection if one is available. Wireless has a lot of data irregularities that require re-transmissions of packets. Generally not a problem under typical conditions but when we're getting into heavy bandwidth, low latency, the wired connection becomes much more reliable.All in all, Amazon made a brilliant choice when they let end users side-load their own applications without having to \"root\" the box. This opens up incredibly powerful opportunities. There are lots of other android based streaming products out there, plenty of them here on Amazon for sale, but the brand reputation and support of the Amazon product with the extensibility of adding third party applications made this one a no-brainer for me. Bonus points because a certain office product retailer tends to offer $25 and $30 off coupons from time to time...and they carry this in their store, but even at MSRP this is a good value.", "verified": true, "helpfulness": "1/1", "author": "Adam Mikolajczyk \"ajm15\""}, {"rating": 5.0, "review": "Works like a charm.  Very easy to install.  I have Amazon Prime so I get a huge amount of free entertainment.", "verified": true, "helpfulness": "1/1", "author": "Joanne Hutchins"}, {"rating": 4.0, "review": "I'm very happy with this equipment. Fast, user friendly, small.The best part is the voice activated remote control.I'm having a lot of limitations with the available programs because I live in Dominican Republic, but with NetFlix available, I can live with it. Any way I purchased it knowing that it was going to happen.", "verified": true, "helpfulness": "1/1", "author": "Guillermo Roman"}, {"rating": 4.0, "review": "Fire tv is so easy to use. I have a little trouble finding what I want on the netflix app but I just need more practice. The picture is clear,the sound great and there is no studdering of the program. The remote is much easier to use than the apple tv my husband has. The voice control is great. It really works!", "verified": true, "helpfulness": "1/1", "author": "Phyllis Tafoya"}, {"rating": 5.0, "review": "The best money I've ever spent!  Unit is easy to set up (hint: purchase the cord when you place order for unit. You will need it). Unit is easy to operate and the voice command feature REALLY WORKS!!! You will not be unhappy with your purchase.", "verified": true, "helpfulness": "1/1", "author": "phantom girl \"phantom girl\""}, {"rating": 5.0, "review": "The Fire Tv more than meets our expectations. There  is a nice selection of apps and channels to watch and the Fire Tv is very fast in response.  This is a great product for the price.", "verified": true, "helpfulness": "1/1", "author": "mcGravel"}, {"rating": 4.0, "review": "I did not expect to find so many programs and movies as pay per view.", "verified": true, "helpfulness": "1/1", "author": "Ronald L. Mitchell"}, {"rating": 5.0, "review": "Best purchase EVER! Beats the HECK out of Netflix!!!", "verified": true, "helpfulness": "1/1", "author": "elizabeth glenn"}, {"rating": 4.0, "review": "We enjoy Amazon Fire TV.  Its been a nice change to renting--we do not need to return the \"rental\" when finished.", "verified": true, "helpfulness": "0/0", "author": "Kellyann P. Sousa"}, {"rating": 1.0, "review": "Returned terrible description. I had to return it", "verified": true, "helpfulness": "1/5", "author": "Laverne Randall"}]