[{"rating": 1.0, "review": "I have yet to get this to work. I have tried it on 3 TV sets with no results. It will not turn on. We just get a black screen and have tried several different input methods. I will probably order another Roku.", "verified": true, "helpfulness": "2/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product, love it!!!", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "I have been an avid user of the original ROKU streaming video boxes for the last three years (I have 4). This is hands and above the Roku and Google Chromecast. It not only has the hifghest quality video that we have enjoyed but also has some cool games that we have used with the optional game controller. I like the crisp, clean, easy to use format as well as YOUTUBE whiich is not availabel on Roku. In addition, the voice activated search works well although it brings up all the choices you have to rent or purchase also. It would be better if there were a setting to bring up results from Amazon Prime and other channels or streams like Netflix which you have. The voice activated search will unfortunatly not bring up other channels videos. Will only work with Amazon. That being said, great entertainment for a great price! I am retiring the roku's one at a time and have purchased two of these babies so far.", "verified": true, "helpfulness": "0/0", "author": "Sir Freelancerlot"}, {"rating": 4.0, "review": "really enjoying fire tv", "verified": true, "helpfulness": "0/0", "author": "Shelley Osso"}, {"rating": 4.0, "review": "Works good and is very fast.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 2.0, "review": "I am a loyal Amazon customer, so I purchased this instead of a Roku or Apple TV.  I am very disappointed to say that my Blu-ray player serves more of a function than this device.  It has practically NO APPS COMPATIBLE with it.  I wanted to use this primarily for my children's shows, and there are no options besides the same episodes on repeat available through Prime.  I wish I could get my money back, as I will likely be buying another streaming device to replace this one.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Really a nice product for the price.  It was delivered very fast and was just as advertised.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "We stopped watching satellite once we got Amazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "Matt Johnston"}, {"rating": 5.0, "review": "Great product, we love it", "verified": true, "helpfulness": "0/0", "author": "marco antonio perez"}, {"rating": 5.0, "review": "Very easy to install.  Works very well.  Love the voice control.  Great for movies, but try the music app too.  Works great!", "verified": true, "helpfulness": "0/0", "author": "MurphSurph"}]