[{"rating": 5.0, "review": "LOVE IT. Ten million times better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Claire"}, {"rating": 5.0, "review": "Alright, they won me over, they have a device here on par with the Apple TV.  There are a bevy of features and video sources available to the user.  I doubted they would at first but they have corrected the initial problems that made this product unusable, it is a remarkable turnaround only through software updates; their programmers must have been given some kind of bonus to produce results as it indeed worked.  I have never seen a turnaround so fast before.  For me however due to Apple's ecosystem and my adoption of it, the Apple TV is the better fit for myself personally.  I would recommend the Fire TV over the Roku now without question.  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Jason S."}, {"rating": 5.0, "review": "Being able to sideload app is a plus and due to high spec, app runs really smoothly. And the annoying random wifi drop issue which is seen on fire tv stick is gone as well!", "verified": true, "helpfulness": "1/1", "author": "rex"}, {"rating": 5.0, "review": "Easy to setup!  Great picture and very powerful device.", "verified": true, "helpfulness": "0/0", "author": "Maria Castillo"}, {"rating": 1.0, "review": "Very disappointed. Poor out of the box experience. Advertised as being compatible with Netflix, however an additional \"app\" was required, selected the app to download but the app never downloaded. My other device, Royku streaming stick, worked as advertised out of the box.", "verified": true, "helpfulness": "2/13", "author": "Howard G Page"}, {"rating": 5.0, "review": "had to hook up my laptop to the TV before. this is much easier and always ready.", "verified": true, "helpfulness": "0/0", "author": "TR"}, {"rating": 5.0, "review": "absolutely love it, makes my amazon Prime, pop!", "verified": true, "helpfulness": "0/0", "author": "Paula"}, {"rating": 4.0, "review": "Pros:• The voice search on the remote is a great solution to the frustrating key input necessary on my Apple TV and on a roku.•  5.1 surround via ooptical output works very well• Responsiveness of the devices is very fast to user input via remote• The speed at which video playback starts is freakish. So fast. I just don't get how they do it.Cons:• From the second you plug it in, you are reminded amazon doesn't do good user interfaces. Force you to watch an intro video with no skip.• The user interface for content navigation is not good. Within a category they only provide you a few items to scroll through at time which makes browsing lists of TV shows and movies tedious.I prefer the technology on this device to my Apple TV so we end up using this more often as a family. Especially good for kids who aren't proficient spellers to be able to speak into the remote to find their favorite shows. But the UI really is so bad that I end up browsing for more content in netflix on my Apple TV, building lists and discovering content and then maybe coming back and just playing it on the fire.", "verified": true, "helpfulness": "0/0", "author": "Alastair Halliday"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/1", "author": "Christopher Tower"}, {"rating": 1.0, "review": "Need more games", "verified": true, "helpfulness": "1/16", "author": "jerry outlaw"}]