[{"rating": 5.0, "review": "Love it!  Makes finding my daughter's videos so much easier!", "verified": true, "helpfulness": "0/0", "author": "Alice Bayer \"AllyCat\""}, {"rating": 2.0, "review": "I had high hopes for this unit. I wanted an easy way to watch AmazonPrime Movies. It does that well, but the Netflix interface is horrible. Very slow to load. The remote is neat with the voice activation, but it is Blue Tooth. No iR control. This means that if you have a universal remote or control system you are out of luck controlling the unit. Also, you can't push anything to it like an AppleTV.", "verified": true, "helpfulness": "0/2", "author": "Andrejs N. Reskevics"}, {"rating": 3.0, "review": "so can i completely not have to cable anymore??", "verified": false, "helpfulness": "0/3", "author": "Donna Ward \"loverandwife\""}, {"rating": 5.0, "review": "I was on the fence as to whether to buy this or the Apple TV since I use an iPhone, iPad and Mac.  Since the ability to use my Mac with the product was not important to me, I decided to give the Fire TV a try.  I store some of my photos and slideshows on the Amazon Cloud, so they are available to view with the Fire TV and look terrific.I purchased this for our main TV when it was on sale and we were so pleased, I waited for it to go on sale again and purchased a second for another TV. It is so easy to set up and navigate.  The picture quality is excellent, better than what we get on cable.  Since purchasing, I returned our two DVRs to the cable company and downgraded our service which saved us $55 a month.  I joined Prime and I am amazed at all the wonderful free programs we can watch.  The reduction in our cable bill will cover the cost of Prime in just two months.  Although the Fire TV does not come with a Users Manual, it's so intuitive, you really don't need one.  For anyone who would like to have a manual, there is one available online that can be downloaded.The voice search feature on the remote works perfectly and makes it so easy to find just what you're looking for.Don't hesitate to buy this product.  You won't be sorry.", "verified": true, "helpfulness": "1/1", "author": "Survivor77"}, {"rating": 5.0, "review": "This is the best! absolutely love this product!", "verified": true, "helpfulness": "0/0", "author": "A.Zunk"}, {"rating": 5.0, "review": "Having a lot of fun with this, even though I don't know all the commands yet.  Lots of things to watch and it was easy to install.", "verified": true, "helpfulness": "0/0", "author": "DLT"}, {"rating": 3.0, "review": "I got increased speed on my Internet service from my Cable company and even with that increase there are many services thru Amazon Fire TV that are slow. Netflix and Amazon Prime are good but many others are not. I hope Amazon will fix this and also add VUDU movie service too plus other services. Good for Amazon, not so good for customers. Hoping Amazon will do it's usual good job of making it's offerings better and better.", "verified": true, "helpfulness": "0/0", "author": "James M. Furth"}, {"rating": 3.0, "review": "Needs to come with instructions.", "verified": true, "helpfulness": "0/4", "author": "Keith"}, {"rating": 3.0, "review": "OK for most functions but the lack of USB connectivity and incompatibility with other remotes are serious limitations in the design...", "verified": true, "helpfulness": "0/4", "author": "Dan Krebill"}, {"rating": 4.0, "review": "Easy to install and use", "verified": true, "helpfulness": "1/1", "author": "ternersgrammy"}]