[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Brenda L Rowell-Gray"}, {"rating": 4.0, "review": "I can't give it 5 stars because I'm still trying to figure it out.", "verified": true, "helpfulness": "0/2", "author": "JRD"}, {"rating": 2.0, "review": "Having two controllers, using my Fire TV, I was not able to separate two players thus making the game portion of Fire limited & not user friendly. Fire needs to be able to take signals from each controller  to make gaming work! For movies is ok, but it fails to separate movies by family members. Is all or nothing!", "verified": true, "helpfulness": "0/1", "author": "AC"}, {"rating": 5.0, "review": "Great, flexible, responsive device. Sleek remote, snappy interface. Love that it has an ethernet port on it. Would highly recommend.", "verified": true, "helpfulness": "0/1", "author": "Sean S. Sharp \"The Tru Sammael\""}, {"rating": 2.0, "review": "not exactly what i expect.I had to ad programs and apps", "verified": true, "helpfulness": "0/2", "author": "violet canchola"}, {"rating": 1.0, "review": "Just learned after a call to help that captions are not available for Samsung TVs made before 2012.  What?  Unacceptable.  I will return the fire and go with a company that is fully concerned with accessibility for people with hearing disabilities.", "verified": true, "helpfulness": "0/4", "author": "L. A. Loman \"Tony\""}, {"rating": 1.0, "review": "Terrible nothing we want.", "verified": true, "helpfulness": "0/9", "author": "Carrie"}, {"rating": 5.0, "review": "I love everything about it!", "verified": true, "helpfulness": "0/2", "author": "Joycelyn"}, {"rating": 5.0, "review": "I am very happy with the Fire TV. I purchased it for an old TV to have streaming. Works great. Runs faster than my Samsung Smart TV. Easy to travel with as well.", "verified": true, "helpfulness": "0/1", "author": "drooplug"}, {"rating": 4.0, "review": "Have had a little trouble with the bass cutting out on my sound system only when using Fire tv, and 1080 resolution is pretty much relative to band width. It gets pretty annoying when the resolution cuts in and out. Aside from these complaints I have really enjoyed it.", "verified": true, "helpfulness": "0/1", "author": "Matt Garner"}]