[{"rating": 5.0, "review": "We must have gone through changes with our cable carrier.  For about 6 months, we were able to view and download movies.  Then they changed our cable boxes and the buffering of the movies became a problem - the movie would stop and have to be reset at least 6-8 times per movies.Spent the weekend watching movies - no buffering problem - it was great!!", "verified": true, "helpfulness": "1/2", "author": "DeeK"}, {"rating": 5.0, "review": "As a long-time Roku user, I knew i was ready for an upgrade and almost placed that order a month ago but cash flow did not permit. Suddenly, Amazon Fire TV was released and I did my homework--read all the reviews, compared the options, learned the differences. Amazon Fire TV arrived and it was an easy set-up and transition from Roku. It is faster (as promised)--it cut down on the buffering problem I was having--and has a really cool voice-control option that I've used to find movies I've missed before. TV display is colorful, the remote is small, easy to use, and I am so happy I made the switch. You will be too!", "verified": true, "helpfulness": "0/1", "author": "bonlee"}, {"rating": 5.0, "review": "This is so amazing...the voice activation is wonderful; but beyond all is the quality of the picture you get.  Set up was just plug it in and go...So intuitive.  My only problem was that I thought it had internet browser built in..my mistake.", "verified": true, "helpfulness": "0/1", "author": "Hummingbird"}, {"rating": 5.0, "review": "Its a excellent product but needs more apps!I look forward to more for Amazon fire tvWhen something new is rolled theres always some bugs but in this caseThis product is excellent but needs more.", "verified": true, "helpfulness": "0/1", "author": "Shiro"}, {"rating": 1.0, "review": "The movies are very expensive! Anywhere from $1.99 to $5.99 for any movie.  Also if you have an XBOX 360 or XBOX ONE I wouldnt bother getting this device.  It does everything your xbox does for renting movies.", "verified": true, "helpfulness": "6/14", "author": "MATTHEW D. CHARTIER"}, {"rating": 5.0, "review": "it helped us to move away from very BAD tv programing. we would like to have more change in the menues weekly.more romance less of the vilant type. we like being able to use hulu and other movie co. keep up the good work we love it.we are already telling others about it thanks again. DALE AND EVELYN 77 YRS YOUNG", "verified": true, "helpfulness": "0/1", "author": "dale g.shively"}, {"rating": 5.0, "review": "Had a great weekend using the fire tv along with game controller. This product is a great start to Amazon taking it's service to the next level. Video starts immediately as advertised. Voice search is right on time and very useful. Would love to see Voice Search integrated with other services on the fire tv.", "verified": true, "helpfulness": "0/1", "author": "RTstratSpring \"RTstratSpring\""}, {"rating": 5.0, "review": "If I get Fox Fire can I cancel direct T.V.?  Because I am trying to lower my Direct T.V. bill", "verified": false, "helpfulness": "0/2", "author": "Olivia Jones"}, {"rating": 5.0, "review": "I only have cable service for my internet connectivity and my big HD CRT TV has been used solely for over-the-air news broadcasts for the past few years.  Now, the TV has once again become a Black Hole for time and productivity!  I have subscribed to Hulu+ and Netflix and can now watch all the shows I have been missing from cable.  Being a Amazon Prime member, there is a lot of content I can watch for free.  The box was simple to set up and so far am quite happy with it.", "verified": true, "helpfulness": "0/1", "author": "S. Remington"}, {"rating": 5.0, "review": "I just upgraded from Roku Player which is essentially the same device, only this device is far smarter, faster, and more user friendly by a long shot!  Seriously worth the upgrade!", "verified": true, "helpfulness": "0/1", "author": "Jason A. Ales \"J\""}]