[{"rating": 5.0, "review": "I absolutely LOVE the Amazon Fire TV!  I love the parental controls, the apps, the access to movies, we love everything about it!", "verified": true, "helpfulness": "0/0", "author": "Melinda Bailey"}, {"rating": 4.0, "review": "This was very easy to set up and begin using.  There just isn't enough information about what happens next.  I understand that some TV and movies are included with prime, but how often do new shows and movies get added?  Do the old ones get taken off?  When you purchase something to watch, is it saved in your watch list so you can watch it as often as you want without paying for it again?", "verified": true, "helpfulness": "0/0", "author": "Amy Faatz"}, {"rating": 4.0, "review": "We got this to replace our Roku 1, which finally went the way of the Dodo bird. We were impressed with the speed in which the Fire TV reacts to our requests. The download speed for new apps and games is a little slow, but that could very well be our internet service. I would've given this five out of five stars, but there are some apps we had on our Roku that aren't available on Fire TV (Vudu, MLS Live, etc).", "verified": true, "helpfulness": "0/0", "author": "The Jack Knife"}, {"rating": 4.0, "review": "I love the access and organization of all the content.I love the sleek and small design.I would have rated it 5 stars if the game controller was not so delayed when playing more rapid activity games like Pin-Ball.If Amazon could figure out a better response time in gaming the Fire TV will be the only device need.If a cd-dvd blue-ray 'ROM' could be added keeping the size of this unit the same and this device would be the only device ever needed.", "verified": true, "helpfulness": "0/0", "author": "Damon"}, {"rating": 5.0, "review": "This turned my HDTV into a Smart TV, it is easy to use and works as advertised unlike the others.  Navigation & set-up is a breeze meaning it was worth the price.", "verified": true, "helpfulness": "0/0", "author": "John an Amazon Customer"}, {"rating": 5.0, "review": "great for what i bought it for, watching twitch.. But it spent countless hours trying to get it to sign in on my account. I had to have someone from amazon manually reset it so it could work.", "verified": true, "helpfulness": "0/0", "author": "Tyler Conlin"}, {"rating": 5.0, "review": "Very easy to install. Had to try 2x before updated software downloaded, but then, started right up. Instructional video was helpful. Easy to use. LOVE IT! Streaming is great! Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Alice M Vanko \"alicemv\""}, {"rating": 5.0, "review": "The remote is the key to cutting the cable cord.", "verified": true, "helpfulness": "0/0", "author": "deborah"}, {"rating": 5.0, "review": "We have a smart TV so I wasn't really sure why we would need an Amazon fire. But the voice recognition, the video games and the superior app experience has made it well worth it.", "verified": true, "helpfulness": "0/0", "author": "Katie Brizendine"}, {"rating": 3.0, "review": "I really like this product but feel somewhat duped by information that's out there.  After reading about the product and talking with Amazon customer service, I couldn't seem to get a straight answer about \"mirroring\" my Kindle Fire. I decided to buy it anyway and discovered it is not available. Also disappointing is the lack of \"live\" TV apps/sports channels. ESPN is the only one I could find. Not sure about other cable providers, but Comcast Xfinity does not work \"as yet.\" If you are Prime, Hulu and NetFlix users, this thing is great. Love the voice search. Amazingly fast.", "verified": true, "helpfulness": "0/0", "author": "ju"}]