[{"rating": 5.0, "review": "The Fire Tv is blazing fast. I use it with XBMC to play all my local media, and the Mash Up app works amazing for streaming content from the internet. I love this thing.", "verified": true, "helpfulness": "0/0", "author": "FatFarley"}, {"rating": 4.0, "review": "I purchased the Fire TV so that I could stream Netflix.  The device works quite well and was very easy to set up.  The obvious advantage of all streaming devices is convenience and instant gratification; no more waiting for DVDs to be delivered.  My only disappointment is that the voice feature only works for Amazon offerings, each of which requires payment, either for individual items or through Amazon Prime.  As with all Amazon devices (I am a committed Kindle user), Fire TV is designed as a means of selling Amazon content.A disadvantage of streaming vs. DVD delivery is that  there are far fewer offerings.  It is to be hoped that this will change eventually.", "verified": true, "helpfulness": "0/0", "author": "Paul Lang"}, {"rating": 1.0, "review": "Mostly works great. Has a quirk with the sound.  Sometimes the next day it has none until you pull the power cord out and reboot. Amazon replaced the unit but new one does the same thing.", "verified": true, "helpfulness": "4/5", "author": "William S Miller"}, {"rating": 3.0, "review": "When I originally looked into it, it appeared to have a ton of free TV and movies. Actually there is barely anything free on it. Without Netflix, Pandora, and YouTube, it would be pointless", "verified": true, "helpfulness": "1/1", "author": "Christopher Cody Tucker"}, {"rating": 4.0, "review": "Loved the Amazon Fire TV, it was fast and easy to use. The remote control search made finding TV shows or Movies easy. Needs more video providers ie History Channel App, etc...", "verified": true, "helpfulness": "0/0", "author": "William Parker"}, {"rating": 5.0, "review": "Read instructions hooked up in minutes. Great picture.  Granddaughter listens to pandora A LOT.  As always a great value for variety in entertainment.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It's the same price as an Apple TV.  It's more expensive than some blu ray players that have Netflix and Amazon instant video built in.The problems:1. Netflix on the Fire TV seems impossible to coax to display video above 480p.  One time it did and then about a minute later, it switched back to 480p.  This is unwatchable.2. I have a blu ray player with Amazon video built in and I played the same movie both using the Amazon video app on my blu ray player and the Fire TV.  The quality on the blu ray player was vastly better.  The Fire TV version looked overcompressed or something - areas that should be smooth color transitions of color had bad compression artifacts.  My blu ray player is a few years old - the Fire TV is the brand new latest/greatest technology.3. Something that would be nice to be able to do is use display mirroring on my Kindle to pipe the audio through my receiver (and thus my good speakers) but not have to turn my TV on to do so.  For example, if I want to listen to Amazon Prime music on the good speaker system, I wouldn't have any need/desire to run the TV to do that.  I have no idea if this is the fault of my receiver or if the Fire TV, but if I turn off my television, no sound from the Fire TV comes out of my speakers.  If I try and connect my Kindle to display mirroring while the TV is off, it declines to do so.  I have an Apple TV and this exact scenario works just fine with my Apple TV - I can connect iTunes to my Apple TV and pipe music through the receiver and speakers, even if my television is turned off.  If I play an Amazon movie on the Fire TV and turn off my television, the audio will still be played through my speakers (which isn't especially useful), but I can't push the Kindle's audio to the Fire TV.4. The display mirroring function needs some kind of zoom feature.  I have a Kindle Fire HDX 7\".  The screen is slightly taller than 16x9 and so if I do display mirroring, there are black bars on either side of the screen.  Okay, fine, but if I'm watching a 16x9 video, it needs to be smart enough to remove the black bars on its own or else let me zoom in.5. The remote is really annoying.  They took the minimalist concept from the Apple TV, but then did it not as well.  It required more pressure to click the rocker than it does on the Apple TV and your thumb will get tired if you have to \"type\" anything.  By the way, if you have an Apple TV, there is a remote app for your iPod/iPad/iPhone that any time you have to enter text will let you do so on your device rather than using the hunt and peck method with the remote.6. The interface is fine when it's a touchscreen tablet.  I'm not an Apple homer by any means - I like the Kindle interface on the Kindle and find it much better than the iPod/iPad/iPhone interface because I don't have to hunt for the things I frequently use.  But just because something is a good touchscreen interface doesn't mean it will be a good television interface where you're controlling it with one directional rocker instead of swiping.", "verified": true, "helpfulness": "24/27", "author": "David"}, {"rating": 5.0, "review": "I have tried Apple TV, Roku 3, Visio Co-Star and Chromrcast. The Fire is the best overall so far. I use it & Apple TV only", "verified": true, "helpfulness": "0/0", "author": "frank"}, {"rating": 5.0, "review": "Great device love I'm loving it so much I have been waiting for this. It is better than the Apple tv", "verified": true, "helpfulness": "0/0", "author": "A. Antonio"}, {"rating": 3.0, "review": "I have had the Fire TV on a thirty day trial from Amazon, for which I'm grateful.  I've sent it back pending further thought on whether I'll actually purchase one.  Hardware-wise it is a very responsive set top box.  The netflix app was quick, much improved over the TiVo implementation on their Premiere dvr.  The remote was solid and has a great feel.  Voice search is limited (as of the date of this review) to only Amazon content.  Voice search does not search programming on either Netflix or Hulu plus.  I did \"sideload\" an app, so I can verify that it works, however the sideloaded app does not get its own icon on the home screen, making the user wade into the settings menu to find and load the app.  There is a workaround for this which, if I'm reading the how-to correctly, entails loading an app from the Amazon App Store to become sort of a sacrificial lamb and it becomes the target for your sideloaded app.  It won't have the name of the sideloaded app so I imagine if you did it for one app you'd be fine, but several (and then explaining your logic to the rest of the family) seems like it would be inelegant.  Also, out of the box, content may only be steamed from the cloud, not from a PC over a LAN.  There are third party apps that can fill this role, but in my ideal scenerio, I would like to purchase content, download it once and stream it from a PC over my LAN and would like this functionality baked in natively to the box. The cloud is convenient but I'd rather host locally and not need to spend money each month on a higher speed internet connection.So Fire TV did not quite fit my needs, but it may meet yours if you are heavily invested in the Amazon ecosystem.  As of this writing it has not had an update since April and in that time Amazon has announced some great new products, including Amazon Prime Music, which I have to believe will be enabled in a near future update.  Also the ability to search just in the video selection available free to Prime subscribers is a much needed enhancement that is overdue.", "verified": true, "helpfulness": "1/1", "author": "Edward Hurley"}]