[{"rating": 2.0, "review": "Gave as a gift to husband to watch NFL and movies;  very poor quality, choppy video.  Upgraded internet speed and still not great. Sorry to say,  I doubt we will get much use out of it.", "verified": true, "helpfulness": "0/2", "author": "Sleepy6"}, {"rating": 4.0, "review": "very nice i may buy again  it later on  atm it does notb have enough for i needed in it so i could take my Sony player off line", "verified": true, "helpfulness": "0/3", "author": "noname"}, {"rating": 5.0, "review": "Amazing, more shows than I could ever watch", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works like a champ.  Just what I needed.  Easy to setup and go.", "verified": true, "helpfulness": "0/0", "author": "David E. Smith Jr. \"Aspoonful.com\""}, {"rating": 5.0, "review": "Cool little box. Working very well after several weeks now. I was skeptical about streaming video, but this device does it without buffering or loss of HD quality. We are using it wirelessly with no issues. Intuitive interface. If you need a dummies guide, you really are a dummy. Voice command is cool, but hardly ever needed. Great content with Amazon Prime. Just wish they'd put Pushing Daisies back up. We got Netflix too. It shuts itself off when not in use in case you were searching for the power button. Oh, and the screensaver pics are glorious! Amazon wins the streaming box category award! Did I mention we are saving about 100 bucks a month now? Cut the Cable today.", "verified": true, "helpfulness": "1/1", "author": "Cudgel"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Faisal Deen"}, {"rating": 2.0, "review": "Buffering every few minutes makes watching anything nearly impossible. I feel blessed when it doesn't happen. Would return it if I could but for now I resort to my 2-3 year old Apple TV that works flawlessly. I hope a fix is on the way.", "verified": false, "helpfulness": "0/4", "author": "Thomas Mackelburg"}, {"rating": 2.0, "review": "I agree with the previously posted comments regarding the difficulty in searching for free content. The reason we pay for the Prime membership, is for the Prime movies/shows--if we have to click on a selection before knowing if it is free or if we have to pay, it becomes frustrating very quickly. I only use the Fire for Netflix watching now, and will likely cancel my Prime membership unless this oversight is fixed.", "verified": true, "helpfulness": "0/2", "author": "Emily E Wright"}, {"rating": 4.0, "review": "Easy to set up and use, it has been great to add to the entertainment.", "verified": true, "helpfulness": "0/0", "author": "Mike Walton"}, {"rating": 5.0, "review": "It was simple to set up and get running, took maybe 5 minutes (and most of that was just spent opening up the packaging).  It's quick and responsive, the voice search feature is handy, and it has all of the streaming services I'd ever want (Amazon, Netflix, Hulu+, Pandora, Youtube) and best of all it was extremely cheap.  My wife and I are extremely happy with it and glad to finally cancel our Xbox Live sub (neither of us play games on the Xbox any longer and the only reason we kept it around was for watching shows)", "verified": true, "helpfulness": "1/1", "author": "Daniel Harris"}]