[{"rating": 5.0, "review": "It is very good device. Perfect streaming video. Love it.  Need to including more video channels", "verified": true, "helpfulness": "0/0", "author": "ramas samy"}, {"rating": 1.0, "review": "Bought as gift for wife.  She never uses it.  Basically useless unless you subscribe to Prime which costs $99 per year. Even subscribing to Prime does not provide several movies and TV shows without a further additional charge.", "verified": true, "helpfulness": "5/14", "author": "OWEN S."}, {"rating": 5.0, "review": "This is the best one by far. I have the apple tv, chromestick and had roku for a week. The firetv is by far the best. The real question is what you can run on these devices, because after all they all have hdmi etc.Once you root this thing put xbmc on it, hdd support and all those goodies, it becomes a super device in a small box. Worth mentioning I paid 64 with 20 off @ staples and amazon pm. The streaming is just flawless.", "verified": true, "helpfulness": "0/0", "author": "Tesla \"Tesla\""}, {"rating": 4.0, "review": "Was surprised at how east it is to set up.  I installed my Plex Server on my Apple mini and then the app on the Fire tv and in seconds i had my 1,000 movies and 20 GB of music.  I was unable to play the 200 or so Digital movies I have with iTunes but its expected.  One thing that is a pain is search in Hulu Plus app,  its difficult to get back to the Hulu Main Menu at times when your in a series it seems to take an unimaginable amount of clicking.  Unlike Apple TV hit the menu take right back the the hulu main menu then shows the shows thats was just watched and other if. There were a few other things née I remember I will update.All in all I have unplugged my apple TV from my Living room and the Fire TV is all thats connected.Pros:Very easy set upQuick, responsiveWorks perfectCons:Unable to stream digital content from iTunes", "verified": true, "helpfulness": "1/1", "author": "blk182atn7"}, {"rating": 4.0, "review": "It isn't perfect yet, waiting for HBO Go. The app selection is kind of weak. It really NEEDS a remote control app for phones so I don't have to keep looking for the remote. The voice search doesn't search on Netflix.Other than that I picked this box over Roku for the potential. Now Amazon... realize that potential.", "verified": true, "helpfulness": "1/1", "author": "remotecody"}, {"rating": 3.0, "review": "I bought this hoping to cut down on cable costs - unless you never ever want to know what is going on in the world or watch any current television shows I would recommend not buying this. I don't watch that much television but I still think that this was a waste of money. It also has some bugs in it - the one thing I was most excited about was the mlb.tv (for some reason if I pay for a subscription through Verizon the signal scrambles and I cannot watch). Last nite I sat down to watch a game only games don't load. Spoke with a great customer service rep who told me it \"was a known issue.\" They expect to have it corrected soon. So, yesterday in addition to the cost to buy this nifty box I spent $19.99 for something that right now I cannot watch.My plan was to remove one cable box and see what this was like before my contract with the cable company is up in a few months. I placed it where I thought I wanted it. About two hours later I wanted to see local news - cannot do that with this box. I typically watch \"CBS this morning\" on Sunday - cannot do that. Did I know this before I purchased? I did but did not realize how annoying I would find it. I am not sure long term unless these not-cable boxes can get some local programming (why don't they have a built in antenna so you can get local stations?) or HGTV-like stations that they will ever be mainstream. So this morning I am now wondering which other TV to connect it to - if I put it in the main living area and someone visits and wants to see something that's \"on tv\" do we all go in and sit on the bed to watch the TV with cable? Because remember my plan was not to have an adjunct to cable but to save money - this will not do that I don't believe.Do I like it? Sure it came well packaged and is cute. As someone who hates cords and cable boxes this is a definite improvement. It is slick and the remote is pretty nice. But now I am going to have to connect it AND my cable box to a TV which has saved nothing (actually cost me money) and just given me more electricity expense (you cannot it seems turn this off either) and boxes sitting around - sigh.But, you say if you have prime you get to watch free movies. Quite honestly, they don't look all that great, and I could have watched on my computer anyhow. Cable has a bunch of old movies or movies to purchase also. I can listen to music on cable (and actually prefer those stations to pandora, which seems clumsy and difficult to work with on the TV). Am I returning this? No, I have great hopes for the future of these boxes. But it fails utterly to meet the needs of a consumer who wants to save money on cable. This is not unique to this device - they are all the same way when it comes to local programming and what are typically cable-tv shows. So, unless you just want a new gadget to sit around because you like new things save your money - the cost of this will pay half a month's Verizon bill :)", "verified": true, "helpfulness": "0/3", "author": "PAL8535"}, {"rating": 4.0, "review": "don t have all apps like rugu", "verified": true, "helpfulness": "0/2", "author": "David Viscuso"}, {"rating": 5.0, "review": "I HAVE FIRE TV,ROKU 2 N GBOX N MY BEST IS FIRE.........let me not forget the games on fire vice city,fishing etc. It's like your right there n the games so crisp,picture perfect I store all my pictures n also use my pictures for my wallpaper it's just so incredible..", "verified": false, "helpfulness": "0/1", "author": "pamela"}, {"rating": 4.0, "review": "Needs more apps for streaming.", "verified": true, "helpfulness": "0/0", "author": "John featherstone"}, {"rating": 5.0, "review": "Amazing, very Happy", "verified": true, "helpfulness": "0/0", "author": "manrique mora"}]