[{"rating": 5.0, "review": "I have purchased all sorts of smart TV boxes, Roku, Apple TV, smart DVD players, etc.  but Amazon Fire TV is the greatest.  The voice remote is just unbelievably accurate and easy to use!  With Prime membership, this is the deal of the century.  Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Russell"}, {"rating": 5.0, "review": "Purchased a Panasonic DVD player solely to take advantage of the built in streaming software.  It was a disaster.  Netflix for example would take 2,3, 4 minutes to load.  Constant buffering issues.  What a mess.  Bought the Fire TV unit.  Unpacked it, set it up, and was watching Netlix in less time than the DVD player would load Netflix.  No more buffering.  Picture quality is fantastic.  Amazon Prime and Netflix offer so much for our viewing pleasure and the Fire delivers.Viejo", "verified": true, "helpfulness": "1/1", "author": "Viejo Majadero"}, {"rating": 5.0, "review": "Having suffered through one letter at a time Roku, Amazon Fire brings a new level of convenience to finding those lost treasures in television.  The hardest part of getting the Fire ready to go was getting the wrap off the box.  The other downside is hearing my wife talking during the night as she switches from one movie to another while I am trying to sleep.", "verified": true, "helpfulness": "1/1", "author": "Kenneth A. Gaddis"}, {"rating": 5.0, "review": "On Thursday I received my Fire TV. After setup(which was a breeze) I got a call from my wife so excited I couldn't believe it. While I was in route to the store to purchase something for my new set up, I had my daughter take my phone and order a second one to be ordered next day. This is the future of TV. We love it.", "verified": true, "helpfulness": "1/1", "author": "P. Dempsey"}, {"rating": 5.0, "review": "10x better than the apple tv. I have both, an the apple tv has been collecting dust. Furthermore, i believe it lets you MIRROR even with APPLE products. I havent tried it, but the symbol is there.Although I must say, this product was a bit late in the game to make the splah it could have made, nevertheless, thank you for the lack of restrictions put on the device!", "verified": true, "helpfulness": "0/0", "author": "Chirag patel"}, {"rating": 2.0, "review": "The voice activation feature is nice but not being able to tell what items are free vs. paid is extremely frustrating and I suspect this was an intentional design to bolster rental fees.", "verified": true, "helpfulness": "2/4", "author": "Todd D. Ensign"}, {"rating": 1.0, "review": "There are two many things and are missing.A number of illustrations would be helpful.It is not clear as to how to start and stop the service.", "verified": true, "helpfulness": "4/13", "author": "Charles W. Haeckler"}, {"rating": 5.0, "review": "Five stars no trouble hooking up easy to use  and understand.Everything i want on my  big screen thank you amazon", "verified": true, "helpfulness": "0/0", "author": "Robert Perles"}, {"rating": 5.0, "review": "The fire tv is absolutely amazing !!! If you are looking for a change in viewing experience and to \"cut the cable\" from your expensive service ... this is the way to go. It works flawlessly and the picture is awesome ... we love it !!!!", "verified": true, "helpfulness": "1/1", "author": "Mickey Quinn"}, {"rating": 5.0, "review": "We love it !! we were wanting a streaming media player to save our gaming consoles. we watch so much streaming media I was starting to worry about burning the lasers out in the Playstation. I looked at apple TV, Google chromecast and a couple others for the price and quality of product this was the best choice. it's super easy to setup and even easier to use ! highly recommended !!", "verified": true, "helpfulness": "0/0", "author": "chad sizemore"}]