[{"rating": 4.0, "review": "We cut the cord last week and started using Amazon Fire TV exclusively since we were already a prime member it was a no brainer. I wonder why I haven't does this sooner. Thanks Amazon your saving me a bundle", "verified": true, "helpfulness": "0/0", "author": "Mark G Allen"}, {"rating": 2.0, "review": "Hard or difficult to navigate.  No internet (Internet Explorer, Google, Mozilla Firefox) browser capabilities.40,000 movies ???  Difficulty in navigating movie data base other than what Amazon wants you to watch.Most of my TV shows are at a pay-to-view status - even with the Amazon Prime level.  Still checking it outduring my Prime Trial membership subscription.  But, I will probably take it back to Best Buy.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works very well, I like it more than my apple tv", "verified": false, "helpfulness": "0/0", "author": "Jenna"}, {"rating": 5.0, "review": "Very nice and intuitive interface.", "verified": true, "helpfulness": "0/0", "author": "Doug Morrison"}, {"rating": 4.0, "review": "Fire TV has an annoying bug where Netflix will give error: \"We're having trouble playing this title right now. Please try again later or select a different title.\" and will not play ANY title until you follow a specific procedure to make it work again.Fire TV performs noticeably better than the Fire Stick. GUI is faster (scrolling, GUI effects) when comparing FireTV vs FireStick. GUI itself could use improvements (not having loop-scrolling is annoying).Overall it is a good device, looks awesome and I hope software catches up wit the awesomeness of the hardware.", "verified": true, "helpfulness": "6/6", "author": "Reviewer"}, {"rating": 5.0, "review": "Reliable, easy to setup, easy to use, tons of content.  It's also surprisingly fast for a wifi connected device.  No issues, delays, buffering, etc. when watching HDTV.", "verified": true, "helpfulness": "0/0", "author": "Ron C."}, {"rating": 5.0, "review": "Bought this a few weeks ago with the Sling TV promotion, so I got it for around $35. It works great! Prior to that, I was using my PS3, and this seems to have a much faster load time. Between Netflix, Hulu, Amazon Prime(which I really got just for the delivery options, but the streaming is a great plus!), and now Sling TV, I have everything I need! $36/mo versus the $85/mo with DirecTV.", "verified": true, "helpfulness": "0/0", "author": "Mark W. Roy-Brooks"}, {"rating": 3.0, "review": "I was very interested to test this device because of the Power and the Internals are twice as fast as other competitors. After my test I still like my Roku 3. Surprisingly roku is faster than amazon fore TV. I really don't know how, Even Amazon Prime content is Faster in Roku than Fire TV. I think Now a days all devices connected to internet are trying to colect information on what we are watching, what time we are watching..ect to find a pattern of the customer lickings. I think because of that all the internet connected devices are getting slower. ( Ex. Amazon Fire TV, Android Devices). Apple Don't do that, they don't spy.,everyone else does.  Fire TV menu also little difficult. More Marketing stuff than real user friendly.Amazon you need a big Change in all electronic devices you make.", "verified": true, "helpfulness": "0/1", "author": "Kay"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So easy to install, and user friendly. Great selection of movies. If you use Amazon cloud you can do slide shows and watch back videos you took.", "verified": true, "helpfulness": "0/0", "author": "onecoolmom"}]