[{"rating": 1.0, "review": "I found this very disappointing. I already had a digital media device and have been using Amazon for video for years, both through my Prime account and purchasing videos.Pro:Voice Search is great (with caveat below)Cons:Eats up lots of bandwidth even when I'm not using it. Suggestion: give it an off switch.Buffers constantly despite a high speed connection that doesn't make any other device buffer. Suggestion: perhaps allow SD for  watching Prime material.Voice search doesn't work for all material. In fact if I'm looking for a particular TV series it only gives me paid material when free is available in Prime. It doesn't even show the free stuff that is available.From my perspective Fire TV makes a great service, Amazon Prime, look like a bait and switch scam.", "verified": true, "helpfulness": "2/5", "author": "DR Bulley \"deebee21\""}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Eamon K Raftery"}, {"rating": 5.0, "review": "It turned my TV into a full fledged tablet. I can watch YOUTUBE like I watch TV. The apps, music, video and movies sync with my Amazon account. The box and the remote are very small and don't get in the way of anything. Set up is extremely easy. I was up and running literally 2 minutes after I plugged it in.", "verified": true, "helpfulness": "1/1", "author": "redsox09"}, {"rating": 4.0, "review": "That's great for the device play high-definition video,the color and the sound iquality is great, but the Usb port can't identify NTFS file system？I had trouble with how to play video on the usb storage.", "verified": true, "helpfulness": "0/0", "author": "Kindle 客户"}, {"rating": 1.0, "review": "Whats the point of buying this device and not being able to use it outside the US. Being an international customer I have a Prime account for which i get free shipping on most products within the USA but I'm not allowed to use the benifits of the account like stream movies etc since I live outside the US. I guess Amazon should to something about this.", "verified": true, "helpfulness": "2/5", "author": "Akshay Sundaram"}, {"rating": 3.0, "review": "I am no stranger to media streaming boxes. I have owned a couple Roku's, a WDTV, WDTV Live, etc.. and I have to say I am very happy with the Amazon Fire. There are a few things that I am hoping Amazon will see fit to add to the Fire and I will list them below.I want to keep this review short and to the point so let me give you the rundown.**** Here's what I like:1. Super fast! It starts up quick and loads apps such as Netflix is just a couple of seconds.2. Beautiful 1080p video and perfect audio via HDMI.3. Small footprint. It's the smallest media box I've yet to own.4. The graphics quality on some of the games come close to Xbox 360 quality. It's much better than I expected. As an owner of a PS4/PS3/360/Wii U, I didn't expect to even bother playing a game on here...but I was really impressed with the quality on games such as Asphaut 8, Table Top Racing, The Walking Dead (TellTaleGames), SEV Zero, ZEN Pinball, and more.5. Voice command for searching. It's extremely accurate and quick to display results, but..BUT! This should also be integrated into other apps such as Netflix, Hulu, and more.[UPDATE 08/24/14]:The Netflix CEO said a while back that Netflix is working on setting up its video library to work with Amazon's voice search, and expected it to be ready this year. Waiting on Netflix, not Amazon. This would be a welcome improvement. - Source: Amazon user, Sacpinplayer6. Cross-Buy. Apps which are available for both the Kindle Fire HD/HDX will show up for free on the Fire TV. This was a nice surprise to see that I could install Sonic the Hedgehog, Sonic CD, Double Dragon Trilogy, and Tabletop Racing onto the Fire TV.**** Here's what I like, but it needs some improvements.1. It includes support for Bluetooth controllers... BUT, only a few, including a $40 Amazon controller which isn't the best.They could have opened this up to other controllers and even let users use their Wii Remotes and Wii U Pro Controllers. Many gamers have several existing controllers laying around. It would make sense (for us) to use these with the Fire TV. The Wii Remote even shows up when searching for a BT controller. Another option [see 3.]2. The Fire TV includes 8GB of storage, BUT, 3 GB of is is used for OS and driver files. So we only get 5GB, or so, to use for our apps. With games such as Assphalt 8 using over 1GB of space this is just not enough. A possible fix.. see below//3. It includes a USB port. As of this review Amazon doesn't allow us to use a USB stick for additional storage space. With memory sticks so cheap this would be a perfect solution when you are running low on space. I.E.64GB USB memory for $25.You can actually use the USB port to connect an Xbox 360 wired controller or even a 360 wireless receiver.**** Here's what I dislike... if Amazon can fix these I will add the last two stars.1. The only way to play your own local media filse on the Fire TV is by way of streaming (Transcoding). This essentially is using the DNLA standard via the apps available. The Roku is also like this. The WDLive offers this right out of the box and often works well. The problem with Transcoding/DNLA is that it's taking your original movie file and then re-encoding it yet again in order to send it to the Fire TV. The results can vary depending on your PC speed, resolution, and bitrate.This would be an easy fix to allow an app which could handle simple folder sharing from a server, along with some basic codecs (MKV, AVI, MP4, mp3, etc). You can actually do this with XBMC, but it's a bit unconventional to get it working and most people probably won't even attempt installing it.) The Fire TV is more than adequate to hand decoding of 1080p videos.2. Why is there no web browser? It seems like they would include Silk or at least have the option to install it. It's convenient to have.3. There are so many apps available on the Kindle Fire Store, but NOT on the Fire TV. I understand with some of the touch based games, but many of them are not and still haven't made it here.Well, that's about all I can think of. I'm sure the main reason for the lack of local media playing, voice controls with Netflix is most likely because they want the Fire TV to be the portal to all that is Amazon.Is it worth $99? YES!", "verified": true, "helpfulness": "2/2", "author": "M. Henzel \"Amazon Reviewer\""}, {"rating": 5.0, "review": "In love with this product! Changed the way I watch tv. Love the compact size.", "verified": true, "helpfulness": "0/0", "author": "Daniele"}, {"rating": 5.0, "review": "Love my FireTV!", "verified": true, "helpfulness": "1/1", "author": "Sergio Najera"}, {"rating": 1.0, "review": "Not at all as advertised. What good are all of the 'category killing' specs if the biggest feature, voice command, doesn't work properly? I've also taken note of the lack of apps, etc.Loved all of the Kindles, but this device will cause me to not purchase any more Amazon hardware devices, Fire Phone included. Huge fan of Amazon, but will not purchase any more devices from Amazon.", "verified": true, "helpfulness": "2/6", "author": "bluehen86"}, {"rating": 2.0, "review": "Plus:Small footprint.Quality materials.Good transfer rates.Minus:No personal video streaming without Amazon cloud or sideloading applications.Forces you to sideload apps to make the device really useable due to the small number of applications available compared to the Google PlayStore.Customer support is not provided the tools or information to really give any real support at all.___________I will never understand why Amazon takes a platform as powerful and open as Android just to take an Apple approach and lock it all down.  Hello? people want freedom.", "verified": true, "helpfulness": "0/0", "author": "Todd"}]