[{"rating": 5.0, "review": "This is a wonderful device with a vast array of movies and shows to watch. The device proved very simple to set up and the remote is small and simple. The voice feature really sets this device apart from its competitors and makes browsing a delight.My one request to Amazon would be to include ACORN TV so that subscribers to the service can watch all its programs for free.", "verified": true, "helpfulness": "0/0", "author": "Harry L. Park"}, {"rating": 4.0, "review": "Amazon Fire TV, with its quad processor,  is quick to respond.  Much faster than Apple TV which I also have.  The only reason I did not give it five stars is the software.  The software is adequate, but it does not take advantage of the quad processor.  More movies could be displayed on one page for easier access and less scrolling, for example,  and the voice command needs work.  Overall, however, it is a great device!", "verified": true, "helpfulness": "0/0", "author": "Nate Jolley"}, {"rating": 4.0, "review": "After owning an Apple TV, and playing around with a Roku, I can say that the Amazon Fire TV is my favorite streaming device to date. I love the ease of use and app store (unlike Apple TV). I have yet to use the voice search much, but it has been spot on every time I have used it. My only wish is that you could use the voice search feature to search in whatever app you want.", "verified": true, "helpfulness": "1/1", "author": "Jason Crawford"}, {"rating": 5.0, "review": "I have been thinking about some sort of TV link for some time. Others I looked at seemed to be limited. The Fire TV as advertised seemed to fill the bill with promises of easy set up and wireless connection to Prime and Netflix. The promises were true, it was easy to set up the wireless connection took more time than I thought but still very quick; total time about 15 min.I have had no problems viewing movies and TV shows, however I have high speed broadband and cannot speak to lower speeds or direct TV connections. On the whole an excellent addition to my home system.", "verified": true, "helpfulness": "1/1", "author": "Steve Lancaster"}, {"rating": 5.0, "review": "Very easy to use. Set up super easy!! Would highly recommend the voice recognition is one of the best around. The picture is very crisp and bright.", "verified": true, "helpfulness": "0/0", "author": "Shrasey"}, {"rating": 5.0, "review": "The Fire TV is very easy to use and very fast. The movies can be viewed without any disturbance that we normally get using TW On-Demand.", "verified": true, "helpfulness": "0/0", "author": "Joseph Mcgarry"}, {"rating": 4.0, "review": "Pros:Nice interfaceFantastic playback qualityGames look amazing for such a little boxCons:Content is so mixed it can be a pain to navigate purchased content is located right next to free prime contentParental lock is not locally stored - (this means you need a network connection to do anythingCant just parental lock purchasesCant connect to a new wireless network without a network connection to remove the parental lockWhen using parental lock you have to connect to the internet with hardware to unlockIf amazon upgrades to deal with the cons I will purchase more - If not roku 4's will be the next purchases.", "verified": true, "helpfulness": "1/1", "author": "dave boettger"}, {"rating": 5.0, "review": "Outstanding add to my cut cable action, and it add more to my tv input that will make goal makeable", "verified": true, "helpfulness": "0/1", "author": "Pete A Hall"}, {"rating": 5.0, "review": "This is the first streaming device I have purchased and used. I love it! We recently decided to cancel our cable subscription & go with a streaming device.  After lots of research we chose the Amazon Fire TV. I am already a Prime member and it seemed like the best available option out there at the moment (vs the Roku & Apple TV). I find it very quick in navigating as well as loading content. We also signed up for Netflix & Hulu Plus.Cons:Difficulty searching for free content included with Amazon Prime.Voice search only works for Amazon content.Pros:Fast.Easy to navigate through the different applications.Super easy set-up.Great picture.Remote is sleek & easy to use. (My husband finds it too small & easy to misplace, so it could also be a negative to some.)Overall - I love it! I wish we had cancelled our cable subscription a long time ago. I find there is more content to watch at my fingertips now that before. I seriously love it!", "verified": true, "helpfulness": "1/1", "author": "Pattylouyse"}, {"rating": 5.0, "review": "Almost the best media player on the market, and I have had them all, the one thing that would make fire tv the best would be including ultra violet copy the the amazon library. I have a lot of ultra violet Videos, and would like to be able to view that content via fire tv, and I would drop target ticket and vudu. Until then I have to use both. Other than that it's been my go to player, and I just sold my ouya, and roku 3. I still have my roku 2 in the bedroom so my wife and daughter,  can watch what we already paid for.", "verified": true, "helpfulness": "1/1", "author": "oBIGTo"}]