[{"rating": 4.0, "review": "It's great except you can only use flickster app and not Vudu. Not all my movies make it over to flickster. Works great especially the voice search option.", "verified": true, "helpfulness": "0/0", "author": "Gideon H."}, {"rating": 5.0, "review": "Just throw Kodi, also known as XBMC, on the Fire TV and you'll have yourself the best experience with the Fire TV. A BUNCH of TV shows and games to enjoy and it runs like a beast, I'm not sure how this little box does it but it doesn't lag or anything at all, it's basically flawless.Amazon made sure that their TV was the best not only with hardware and the remote but with the open-sourceness of it as well. You can sideload apps onto it to make it even more awesome than what it already is when it comes out of the box.I'll never regret the day that I decided to order the Amazon Fire TV! :D", "verified": true, "helpfulness": "0/0", "author": "Colton P."}, {"rating": 3.0, "review": "I'm disappointed in the Fire TV and Amazon.  They advertise that you can watch programming from the internet and mirror your tablet on the TV.  That's not completely true.  I work early hours so I don't stay up for later TV programs.  I bought this so I could watch past programming off of the networks' websites.  Turns out you can't do that.  You can only watch programming from the apps that loaded on the Fire.  You can only add other apps that they have preselected for it.  Then I asked about mirroring my Kindle Fire HD (2nd gen) so I could bring up the internet programming on it and mirror it to the TV.  Nope can't do that either.  Only the Kindle Fire HDX, Fire phone and other tablets that are using a certain version of Jellybean operating system can do it.  I would have thought Amazon would support their own tablets.  Wrong again.  Oh well.", "verified": true, "helpfulness": "0/1", "author": "Ed H."}, {"rating": 4.0, "review": "It has a very wide variety of useful tools and application ease of use. The only thing I personally did not like was there is no power down button, you have to unplug the box if not using it or decide to leave the box on.", "verified": true, "helpfulness": "0/0", "author": "Russell"}, {"rating": 4.0, "review": "There should be a way to turn it off when not in use. Other than that I like it and have used it. It is fast and responsive to comands from the remote. My Internet provider (Hughesnet) has usage limits, so I don't get as much use as I would like.", "verified": true, "helpfulness": "0/0", "author": "Carl S Slaughter"}, {"rating": 5.0, "review": "I own two Roku 3 devices and wish I had two Amazon Fire TV's instead.  I have a Roku on a tv upstairs and a Roku and Fire both hooked up to my main tv. I purchased both Rokus first and as a afterthought picked up the Fire because of a great price at Christmas and a promotion for buying a tv off Amazon. The price was too good not to give it a try. Even at full price I would opt for the Fire over the Roku that I purchased $20 under list. The voice recognition to find what you are looking for is great. The layout of apps and finding what is available is better and the unit has worked flawlessly. Cannot say the same for the Roku which I have had to reconnect (wireless) to the internet and pair the remote again.", "verified": true, "helpfulness": "0/0", "author": "LJD \"LJD\""}, {"rating": 5.0, "review": "Love the voice activated feature", "verified": true, "helpfulness": "0/0", "author": "David M Collins"}, {"rating": 5.0, "review": "So far, it is great. But it is early and when I get to use it more, then we'll see if it is so great.", "verified": true, "helpfulness": "0/0", "author": "DEMAREE D DEWEESE  SR"}, {"rating": 5.0, "review": "I'm not a tech-nerd so hopefully this helps people more like me... Setup is a breeze. Picture quality (via Netflix, Hulu and Prime) is simply astounding. Likewise for sound quality of movies and Pandora. My only gripe is so minor it doesn't even count; the voice search feature of the remote is exclusive to Prime content not all registered services. This thing is fast, smooth, easy to use and worth every penny. Now all I need is a 70\" or bigger TV and my entertainment nirvana will be reached.", "verified": true, "helpfulness": "0/0", "author": "CO1897"}, {"rating": 5.0, "review": "Very happy with how well it works.", "verified": true, "helpfulness": "0/0", "author": "John Boy"}]