[{"rating": 4.0, "review": "Works nicely ! code input easy to work with ,picture quality on tv is much better than Roku", "verified": true, "helpfulness": "0/0", "author": "RC"}, {"rating": 5.0, "review": "Very good product. Easy to use. I love it. The best thing  since sliced bread.", "verified": true, "helpfulness": "0/0", "author": "W. cowan \"big daddy 45\""}, {"rating": 2.0, "review": "Lacks the clean interface and seamless functionality of an AppleTV. Don't waste your money until Amazon improves on this one.", "verified": true, "helpfulness": "0/0", "author": "M. Sennott"}, {"rating": 5.0, "review": "Great device.  We cut the cord and this comes on handy for Hulu, Sling TV, Amazon Prime Video, etc.I hooked up an Xbox 360 controller to it and my 4 yr old loves the games.The remote is solid and I like the voice search.The only request I would have is customization of the home screen.  I want to be able to quickly access my apps.  The UI can be a bit cumbersome to navigate when you are looking for  an app you haven't used in a while.", "verified": true, "helpfulness": "2/2", "author": "Janeen Dubay"}, {"rating": 5.0, "review": "Wow do I love having Fire TV from Amazon.  I have many things Apple and have been resorting to using my iPhone or iPad to play Amazon Prime video through my TV system.  Too painful with dropped connections, etc.  I know have both Apple TV and Fire TV mounted to the back of my Panasonic HD plasma TV and loving the rich selection of movies and TV shows offered by both.  There is redundancies having both, but if you are Amazon Prime member, it makes all the sense in the world to purchase this Fire TV.  It installs incredibly easy and already connected to your account, provided you ordered it from Amazon using your Prime account.  It mentions connecting directly to your TV's HDMI port but I connected it to my receiver port with one HDMI from the receiver to the TV.  Same connection as all the other devices and it works great.  No more interrupted shows due to interrupted or dropped signals.  FireTV as a Prime member has so much to offer and is a great addition to the Apple TV if you are an Apple nut and have everything Apple.  I was hoping that someday Apple and Amazon would pair up but I took that upon myself.  Highly recommend this Fire TV.", "verified": true, "helpfulness": "1/1", "author": "TB \"TB\""}, {"rating": 5.0, "review": "I have only had the box set up for two days but so far I LOVE it.  It was easy to install and it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jen in Seattle \"Jen in Seattle\""}, {"rating": 5.0, "review": "Love it so far! Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "K. Bolinger"}, {"rating": 2.0, "review": "I did not know you can't get android apps on iOS i-pod.", "verified": true, "helpfulness": "0/1", "author": "steve"}, {"rating": 5.0, "review": "This little box made my TV SMART. I can now steam movies & programs from my Amazon Prime w/o buying a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "DenverR"}, {"rating": 2.0, "review": "I didn't realize there is no OFF switch and do Not want this always on and connected (downloading) while I'm not around... (trust issues) I also wish it were a bit more organized in showing me what shows/movies etc I can view free for being a prime member. The 1st option to watch something is the 'rent/buy' option and it just becomes cumbersome to have to go into the video and select 'other ways to view> prime meber' etc etc..... Haven't used it since I bought it..", "verified": true, "helpfulness": "2/2", "author": "Esteban Montantes"}]