[{"rating": 5.0, "review": "We have the Fire TV for about a week and LOVE IT!Updated review: We still love Amazon TV but I find it difficult to search the \"Prime only shows/movies.\" I will find something I want to watch and realize it is not included in my prime. That is frustrating. Nevertheless, I am still happy with Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "mandy"}, {"rating": 5.0, "review": "Amazon did a great job with the Fire TV products. We are extremely pleased with it.", "verified": true, "helpfulness": "0/0", "author": "Val A."}, {"rating": 5.0, "review": "Just plug it in and that's it your done.", "verified": true, "helpfulness": "0/0", "author": "Allen Titzer"}, {"rating": 5.0, "review": "Works great, as advertised, great price and great alternative to Roku and Apple TV (which I also own).  Very easy to set up. No negatives yet.", "verified": true, "helpfulness": "0/0", "author": "James Delaney"}, {"rating": 5.0, "review": "like it but getting use to all the features still.", "verified": true, "helpfulness": "0/0", "author": "N Maxwell"}, {"rating": 5.0, "review": "Have two now and cable is gone.replaced with Netflix and hula plus.big savings", "verified": true, "helpfulness": "0/0", "author": "SuperNana"}, {"rating": 3.0, "review": "Did not come with HDMI cord, will not let me connect it to my dorm's wifi that asks for username and password or the hotspot from my phone ... haven't even been able to see the interface.", "verified": true, "helpfulness": "0/2", "author": "Camila Donoso"}, {"rating": 5.0, "review": "The Amazon Fire replaced a Roku (1st generation).  Another member of my family replaced the same 1st gen Roku with a Roku 3 and saw no reduction in buffering delays and also no noticeable difference in picture quality.  Based on that experience I opted for the Fire.  Absolutely no regrets.  Picture quality is excellent and I have yet to have one occurrence of buffering delays when streaming.  The UI is nice, it has the apps that I need.  Voice search, where enabled, works well.I'd recommend this over a Roku 3 hands down.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "good items!", "verified": true, "helpfulness": "0/0", "author": "SOOHAN BAE"}, {"rating": 5.0, "review": "I bought this because a friend suggested it to me and didn't think to much at first after having it for a week I would fight someone if they tried to take it away.", "verified": true, "helpfulness": "1/1", "author": "Levi galvan"}]