[{"rating": 4.0, "review": "Perfect, installed and works great", "verified": true, "helpfulness": "0/0", "author": "Fehti D."}, {"rating": 4.0, "review": "Hi. I am still considering between the amazon fire tv and roku 3. Please let me know of your experiences if you have actually used both devices. I have a question: Does the amazon device support JW Broadcasting? I know that roku does.", "verified": false, "helpfulness": "0/1", "author": "Mthunzi"}, {"rating": 5.0, "review": "Super fast, straightforward menus, includes Amazon Instant Video, and voice recognition that works!We have PS4, PS3, old Sony set box and some Samsung bluray players that can do streaming, but I like this one the best.  Blazing speed (and we're using wireless connection) which means like no wait times for loading video.  The voice recognition actually works very well for me, female voice.  Very small footprint.  I might get the device to hang it off the back of the TV.  Set up took awhile because it had to load 2 updates in addition to all the set up questions, but it was extremely straightforward and no problems or confusion.  The remote is simple to use and well thought out.  A backlight may be the only option that could be useful.I recommend this unit.  If I need another box, this will be the one.", "verified": true, "helpfulness": "1/1", "author": "Dog Lover"}, {"rating": 5.0, "review": "WE Love it.  we have both.  Firer tv and The Firer stick.  Don't miss out on a great Product.", "verified": true, "helpfulness": "0/0", "author": "Carol A. Sederman \"AC\""}, {"rating": 5.0, "review": "So far, so good.I'm looking to cut the cord with my cable service, but I need a device that is simple enough for anybody to use... this could be it.I have a few small issues.Sometimes, the remote control reacts to a single tap with a rapid-fire response.Some apps are unreliable (I'm looking at you, YouTube).And I'm still looking for the best way to airplay from my iPhone.Overall, I'd recommend, and have recommended this product.", "verified": true, "helpfulness": "1/1", "author": "Dr. Jim"}, {"rating": 5.0, "review": "Excellent glad I cut the cord on cable. I do miss Detroit Red Wings and Tigers. Some college basket ball. Guess I can go to sports bar down the street. The only reason I had cable was for live sports. Love the amazon fire. Easy to setup and use.", "verified": true, "helpfulness": "1/1", "author": "James Berlin"}, {"rating": 5.0, "review": "Love this thing.  We bought this when our Chromecast died.  We were debating if we should get the stick or the box then the box went on sale and we decided box it was.  We have never been happier.When we first got it it was all set up to our account but this did pose a problem.  There were a few apps that just wouldn't instal such as Netflix.  It knew we had the app on our account but just wouldn't instal it to the device.  It was weird but all it took was reseting the device to factory defaults and then resetting it up.  This could be a real buzz kill for someone who isn't tech familiar but for us wasn't even a problem.", "verified": true, "helpfulness": "1/1", "author": "Jonathan Timberlake"}, {"rating": 5.0, "review": "Could not be more please with the product. It turned my son's TV into a smart TV saving me hundreds in not having to buy a new TV. The voice command search is an especially cool feature. With just a click of a button or voice command he has all the Amazon prime movies/tv shows, Netflix, etc. at his disposal, not to mention access to any family pictures we have stored in our FREE Amazon cloud.  Great product.", "verified": true, "helpfulness": "0/0", "author": "js9422"}, {"rating": 4.0, "review": "I got this this when it was offered as a 30-day free trial. I was intrigued and so I gave it a shot. I have to say I love it. The voice search works (basically) exactly as advertised, the UI has no lag, and videos really do begin pretty much immediately. I have a friend who has an Apple TV and this tops it in every aspect of usability. The only reason I chose not to keep it and will likely not take the plunge is that like every other streaming box out there, it relies upon my (often unreliable) internet connection. I'm sticking with Blu-ray for my movie buying because I don't have to worry about my internet connection. The one thing that would cause me to make the switch would be if Amazon included some more storage and allowed downloading of videos to the device like it does on the Fire tablets. Until that happens, I'm sticking to Blu-ray for my purchased movies and my Wii U & PS4 for streaming.", "verified": true, "helpfulness": "0/0", "author": "B. Davis"}, {"rating": 4.0, "review": "If you have an ASUS RT-N66U router make sure you connected to the 5Ghz; I was trying to do it on the 2.4Ghz and wasn;t able to connect...nice little box", "verified": true, "helpfulness": "1/1", "author": "Alfredo"}]