[{"rating": 5.0, "review": "The best of the best!", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 4.0, "review": "It's fairly easy to set up, but there are things not said.  You generally are going to be paying more than the price of the Fire TV as you will need a subscription to other services, like Netflix or Amazon Prime or.........so there are generally costs associated with these providers. Also there are the prices for the movies outside the subscription service, so if you're looking to save money on streaming, better be careful as you can rack up a lot of costs for viewing.  Whenever you sign onto another streaming provider, you are placing an order through Amazon for that service, and there'll be a confirmation email sent to you.  Also, when I switch from TV to the Amazon Fire, I need to press the center button on the Amazon Fire remote to activate the Amazon Fire.  That's not described.  Also if you need access to your wifi network you will need whatever security password/ID to log in.  Having said all that I am doing alright with the unit and think it will provide a value for the money for me.", "verified": true, "helpfulness": "1/1", "author": "R W W \"Naldr\""}, {"rating": 5.0, "review": "love it, easy to connect, love it.  I ordered another one for the living room.  don't want anyone bothering the one n my bedroom.", "verified": true, "helpfulness": "2/2", "author": "helene mills"}, {"rating": 3.0, "review": "Right up front I must say I am a novice to whole streaming scene - I only enrolled to NetFlix for the duration of the free membership but did not find myself utilizing it so often to incur the added cost to my budget. So here I am w/ Amazon Fire box. First off - nice & compact unlike the multiple components of varying media players. Significant hdmi cord length ( purchased separately) allowed to place this unit in a smaller cubby of the ET unit. The streaming has been relatively quick very little download time & little to no lag or signal loss Netflix via mobile device.Pet peeves- only one port for a game controller? I am not much of a gamer myself but head to head gaming w/ the family is a entertainment I think most would enjoy. The voice search is nice if one has the resources to spare for rental fees of streamed content. Voice search is keyed to Amazon content and not say HBO content.Over all I guess this is the 21st century mode of entertainment", "verified": true, "helpfulness": "1/1", "author": "Patrick Brown"}, {"rating": 5.0, "review": "Better than my original expectations so easy too use and the voice command is amazing that it catches what you say every time wish I could get my phone to work that good. It is nice not having to type in every time you want to look for something not only does the voice command show it immediately but it also shows things related to the stars or type of search. For the price you really get your monies worth plus with this feature you can watch movies from your kindle on the big screen even on the older kindle, that's pretty cool in itself. I think amazon is really leaping forward in some of the tech department I will keep a look out for what's next.", "verified": true, "helpfulness": "1/1", "author": "7Trumpets"}, {"rating": 1.0, "review": "returned it", "verified": true, "helpfulness": "0/6", "author": "Venkata M Lakinana"}, {"rating": 5.0, "review": "Excellent product. Bought the bundle. Great bargain. Easy to set up. Would recommend.", "verified": true, "helpfulness": "1/2", "author": "Satisfied Southern Girl"}, {"rating": 5.0, "review": "Best thing we ever purchased. We just got a second one so that everyone will stop fighting over the first one and I may purchase a third so that I can watch in my bedroom all for myself.", "verified": true, "helpfulness": "1/2", "author": "belle"}, {"rating": 1.0, "review": "So far -- this is a total dud.  Although we have nearly 30 mBit/sec download speed at the TV, every movie we've tried to watch has contained so many audio dropouts that they are unwatchable.  Sometimes, you may get up to as many as 15 seconds of uninterrupted sound.  Only \"Suits\" would play back properly -- but we didn't watch that much.  Not sure if I want to keep this or return it.  If It can't play back movies it's going back.", "verified": false, "helpfulness": "0/2", "author": "A. Youngblood"}, {"rating": 3.0, "review": "I'm not impressed, where is the selection of channels? I prefer my Apple TV and Roku 3 to this Fire TV.It is fast, I like that, but the lack of channels made me dislike this thing right the start.", "verified": true, "helpfulness": "0/0", "author": "Ted Hopkins"}]