[{"rating": 4.0, "review": "We have had our Fire TV for 6 months now. It was incredibly easy to setup. We have a lot of Macs in the house - iPhone, iPad, MacBook and an iMac. We also have a kindle fire and a galaxy S4, so we're a mixed Android/Mac house. The Fire TV was incredibly easy to setup, and we're very pleased with the UI, speed, and as Prime members the selection is great. We also use Netflix.My only frustration in the 6 months we've had it, is that the voice search had stopped working on the remote. However, I installed the Fire TV app on my Android phone, and that works fine so we have a work around until I get Amazon support on the phone to see what's up with my remote. I've found it incredibly easy and reliable to use...so much so that we've completely eliminated cable and just use the Fire TV, Netflix and an HD antennae now. I'd have given it 5 stars if the voice search worked in more apps, but I read that is coming.", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 5.0, "review": "I love my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Barry M"}, {"rating": 2.0, "review": "I was loving this box.  It is so easy to use and find new options.  I found I was using it every night and almost all weekend.  I'm not new to streaming, and my habits have really not changed by much, just changed the device.  Fire TV seems to have a huge bug in data usage or leakage.  The other day I went up to my internet and did a normal check on my speed and usage (I do this about every 3 months or so).  I saw a huge spike in usage, so I started looking for what would cause this issue.  Eventually I identified the cause my new fire TV, I unplugged the device and the problem went away.  How could one box use 80 gigs in a single day?  I have streamed with other devices for 10 hours and never got close to this level before, the highest I ever saw before was 20 gigs in a day.  Amazon has reported that there something about about the screen saver setting of mosaic causing this problem, but I do not have that setting turned on so this is not the cause of the huge data usage.  It is very clearly something else with the device and I would caution anyone who is looking to purchase that there is outstanding bug that has not been addressed.It is a good thing my ISP does not enforce the data limit (which by the way all ISPs have they just don't talk about)  so I don't have to really worry, but I will be unplugging the box (that is the only way to turn it off).  I will keep the device and use it hoping that amazon will fix the problem some day, but it will not be used for long periods of time.", "verified": true, "helpfulness": "0/1", "author": "Wendy"}, {"rating": 5.0, "review": "Excellent product! I'm  very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "sandy warnock"}, {"rating": 5.0, "review": "Works great no longer wasting money on direct TV. Just turn it on and pick the shows I watch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The package is excellent. No one wants to burn up a three to five thousand dollar computer just in streaming video on the internet.ONE DRAWBACK! Comcast will not support 3rd party internet devices. They will not allow HBO or Showtime access to what they call their Internet You rent the Comcast box for access to HBO or Showtime. 4.5 hours on the phone with Comcast dancing from one employee to another.BOO to Comcast or xifinity out of this world (pricing)", "verified": true, "helpfulness": "0/0", "author": "Mr. Paul Sanders"}, {"rating": 4.0, "review": "I am having problems when accessing the Hulu app that I never had on the Ruko I was using prior.  I have contacted Hulu and they blame Amazon, or my internet provider, but again the problem isn't on the Ruko.  This amazon tv is a good deal, over all I am very happy with this purchase.", "verified": true, "helpfulness": "0/1", "author": "J. Hajduk"}, {"rating": 5.0, "review": "The best bag for your buck. So far o good. It's fast and has great definition. Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "alex2011"}, {"rating": 5.0, "review": "Amazon Fire TV is a fantastic and economical entertainment option whether you're dumping cable/satellite or just looking to expand access to available content.  My reason was the latter, and Fire TV has been a joy to work with; I would recommend it o anyone without reservation.We have satellite TV, but even with all those channels, things are repeated so often, it can become monotonous.  Looking for even more content, I had previously tried Google Chromecast but found that there was often a delay in the soundtrack during video playback - couple that with having to use the Google Chrome browser to cast from the computer, it was just a hassle and often didn't even work.  The only thing Chromecast has over Fire TV is that with Chromecast you can project your browser content onto the television screen - maybe useful to read email from the couch or something  - but for entertainment ... not so desirable when with videos there is the inevitable soundtrack lag causing the words and motion to be out of sync.Fast forward to my experience with Amazon Fire TV:  The Fire TV remote works perfectly - no need for a separate device (computer or iPad to access my content).  No streaming delay, voice and motion in perfect sync.  Works perfectly and such a variety of movies, television series and games, it's incredible!There's just no way Chromecast is in the running.  In fact, with Fire TV, I have access not only to the enormous variety of Amazon Prime Movies and Games, but I can also access Netflix (for which I have an account) with properly synced voice to motion on the videos; as well as, the free HBO Go app (since we get HBO on DirectTV), and also the free Flixster app (through with I can access my entire digital video library).  In every case ... there has never, ever been an issue with streaming.So, get one for yourself and enjoy", "verified": true, "helpfulness": "0/0", "author": "Mary E Fitz"}, {"rating": 5.0, "review": "Have a ps3 to stream all my stuff but this is better I get all my Hulu Netflix amazon music and even my kids tablets are snycd with this its awesome great gift and for urself as well I don't think it has a browser on it but still learning it but love love love it", "verified": true, "helpfulness": "0/0", "author": "Ashley Jenne"}]