[{"rating": 2.0, "review": "We bought the Fire act as a home theater movie server (specifically to run XBMC and Plex). We encountered significant audio issues that made the Fire unusable in this capacity. More surprising was the issue with Plex. It turns out that 5.1 surround is not supported in HDMI on the Fire. The stereo audio quality was poor producing a tinny sound.Setup was very simple and the voice search feature is amazing. The Fire also integrates well with our Harmony remote. Despite some added content the Fire will not be replacing our Apple TV. We would have returned the Fire but missed the 30 day deadline (much of it spent on blog sites trying to solve the audio issues).", "verified": true, "helpfulness": "0/3", "author": "Kyla G. Akin"}, {"rating": 5.0, "review": "Hook up was so simple. TV was ready to go within minutes of plugging it in. The selection is varied but I'm still exploring possibilities. I've already watched two movies and a portion of a TV series. And I've only had it hooked up for one afternoon. I can't get over how small the device is. Like the size of an 8-track tape ... or a Playstation video game for the younger readers. The remote is small but effective. Buttons are few, and spot on. No need for anything else. I've already memorized their placement so I don't have to look while scrolling. The voice command is also spot on. The only clarification I would make to the new user is that you are to hold down the voice command button and say your selection and THEN release the button. I was pushing in the button and talking without any results. I had to play around to figure it out. This is going to be great!", "verified": true, "helpfulness": "0/0", "author": "Mary F."}, {"rating": 5.0, "review": "One hundred dollars and I'm free from the tyranny of Comcast and Verizon? Yes, I like that. This device, and an antenna got me away from the Devil (read: cable provider). And the Amazon Fire device allows me to access my Netflix account, so even more reason to like it.", "verified": true, "helpfulness": "1/1", "author": "BMoore"}, {"rating": 5.0, "review": "On time delivery and I use it every day. Before fire I had to wait and wait for downloading movies now it's almost instant.", "verified": true, "helpfulness": "0/0", "author": "Joseph nockelin"}, {"rating": 5.0, "review": "nice media player and is it quick!....MLBtv app could use a update, should be able to go straight to the inning you want...good for those archived games...haven't tried it for gaming but that's not why I got it. And helped that I got it onsale for $85....Was waiting for a good sale.Picture and sound ave been great, and if you got Prime this is a no brainer!", "verified": true, "helpfulness": "0/0", "author": "S. Ott \"Shoprat\""}, {"rating": 4.0, "review": "Easy setup. Voice search only works in Amazon. Seems that Netflix is being throttled (loading slow) on the weekends, not Amazon - just Netflix. Overall very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Heather Pierce"}, {"rating": 5.0, "review": "I love it. It was just a plug 7 play. It comes from Amazon \"pre-configured\" with my information, must probably the serial number related to my info in the Amazon database. No initial setup needed. It \"knew\" it was me, no need to enter names, addresses or even credit card information.", "verified": true, "helpfulness": "0/0", "author": "Eduardo Fuenzalida"}, {"rating": 2.0, "review": "Not able to watch Hulu plus, once you start an episode it plays the first ad the kicks you completely out of Hulu. The only fix we have found is to delete the cache from the app and then have to go back in and sign in, this only works about 30% of the time though. Wasn't able to watch Amazon Prime shows either, just kept getting a message that there was an error with the content.", "verified": true, "helpfulness": "0/0", "author": "J. Betcher \"Jay Betch\""}, {"rating": 5.0, "review": "The picture is really awesome. It is practically perfect for my 1080p HD TV. The sound is excellent, too. I bought an e-book on the Fire TV and it told me how to activate the Dolby Surround function on the Fire TV. That was one of the main reasons I bought it because it is the only device to support Dolby Digital sound. I am enjoying streaming Dolby Surround sound to my sound system. The Amazon Fire TV can do a lot more than just stream videos. Also, when streaming, I don't have to wait for \"buffering\" at all. Everything is supper fast, almost instantaneous. Plus, finding content or anything by simply speaking into the microphone is a super addition to the streaming experience. I love it!", "verified": true, "helpfulness": "1/1", "author": "B. Stokes"}, {"rating": 5.0, "review": "so simply to set-up just as what was described  couldn't be happier Thank You", "verified": true, "helpfulness": "0/0", "author": "judy broccoli"}]