[{"rating": 5.0, "review": "Really am impressed with user friendliness.  It's plug in and go.  I am counting on Amazon giving us live sports and live series so we can drop the cable.  Thanks amazon.", "verified": true, "helpfulness": "0/0", "author": "dag"}, {"rating": 5.0, "review": "Love love love", "verified": true, "helpfulness": "0/0", "author": "Lee Greenwald"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "the boss"}, {"rating": 5.0, "review": "Love allows us to get off DISH. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Tracy Cobbin"}, {"rating": 4.0, "review": "Now I Can Watch Prime Movies On TV I Don't Like Watching Them On The Computer So This Is A Good Buy For Me", "verified": true, "helpfulness": "0/0", "author": "David P. Mathews"}, {"rating": 5.0, "review": "Bought this for our bedroom TV, I wish I would have got this sooner.  This works better than any of the \"smart\" TVs in my kids rooms.  It's very easy to use, my wife has no problem with it and she's not exactly \"tech savy\".", "verified": true, "helpfulness": "0/0", "author": "Jason Behrens"}, {"rating": 2.0, "review": "when I received this pakaging was good everythin was fine was unable to download any apps or watch netflix I at that time was using an appleI was also unable to access Amazon PrimeCustomer help was of no use  They tried to tell me it was because of my router set up Yet I could watch on my computer with the same router set up. I do not think it liked when you are using and open vpn for security Anyway I returned produck to hasselI then purchased a Roku which works great with the security and I love it", "verified": true, "helpfulness": "0/2", "author": "JDW NORTHERN ONTARIO"}, {"rating": 2.0, "review": "System is easy to use and very portable, and might be perfect if you want made-for- TV specials. Movie titles are limited, tend to be older, and offerings have not changed much in past several weeks.", "verified": true, "helpfulness": "0/2", "author": "R Brown"}, {"rating": 5.0, "review": "LOVE it!!!", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 1.0, "review": "Doesn't work. Won't connect to Amazon.com. I spent 90 minutes on this, half that time on the phone with Amazon. They concluded it was a software issue and said they are going to send me a new one. When I asked for a free $3-4 movie fir all my time and trouble, the rep said because she was expediting delivery, there would be no free movie.Poor business acumen. It's not my fault this thing didn't work and they are acting like it's mine. Assuming I can get the new one to work we will see how many movies or other things I order from them. Smart business people should want to keep customers, not shove them away. And this is a good way to do it.", "verified": true, "helpfulness": "1/2", "author": "Carol Greenberg"}]