[{"rating": 3.0, "review": "I am not sure how to use this product.  I thought that I could automatically turn on after setting up with TV", "verified": true, "helpfulness": "0/1", "author": "Karen Martin"}, {"rating": 3.0, "review": "The functionality is amazing and worth every penny!However, we use it a lot less than we thought because we watch Netflix as much or more than Amazon movies and this does not even search and display these titles (it should be able to search all third party content it's signed into).  Secondly, it's almost under-handed how they try to mix the paid and Prime content together in a way that is very hard to distinguish.  Prime should be displayed totally separately of have \"Prime\" stamped on it prominently.If these two problems were corrected then I would give it 5 stars easy and consider it up there with smart phone levels of paradigm breaking....", "verified": true, "helpfulness": "0/0", "author": "William Ratcliff"}, {"rating": 5.0, "review": "AppleTV has been left behind with this wonderful new gadget by Amazon. Amazon fire TV is fantastic because you can search by voice and say things like the directors name, a movie title, or actors names and get immediate feedback on what's available not only through prime but also for purchase or rental. You can pay forward in $20 installments and it cost the same as the Apple TV. I still have AppleTV my living room, but I now have the Amazon fire TV in my bedroom, and it has become my easiest way to watch films, to do searches and to get going. I wonderful gadget and easy to install, so easy that my kid installed it quickly.", "verified": true, "helpfulness": "0/0", "author": "A. Roca"}, {"rating": 2.0, "review": "When this unit stream full HD it bufferes a lot. I am using comcast blast and 5Ghz wireless connection.. It look like the cache gets full very fast. My Apple TV and Roku stream full HD without any buffering.But all other function/ interfaces are looks beautiful..", "verified": true, "helpfulness": "1/1", "author": "Fleming \"FGP\""}, {"rating": 5.0, "review": "Small and fast.  Great selection of videos - both tv and movie. So many I haven't made a dent in the choices.  Outstanding help if you need it.", "verified": true, "helpfulness": "0/0", "author": "Marsha Shoreman \"forrestag\""}, {"rating": 4.0, "review": "The device is easy to setup, just connect all the necessaries connectors to it e.g. internet cable, HDMI cable, power supply and fit in the batteries to the remote control, and ON the power supply, switch your TV to the connection and there you are it display and give a demo on how to use the FireTV.", "verified": true, "helpfulness": "0/0", "author": "Billyroar"}, {"rating": 5.0, "review": "Easy to hook up.  The voice feature is great!! Lots of shows, movies, games to choose from.  Glad I purchased this!!", "verified": true, "helpfulness": "0/0", "author": "Glinskit"}, {"rating": 5.0, "review": "Works same as my smart TV ads never show you have but the movies when they make it look free", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it ! All my friends are buying one when they see my unit at home, easy to use and it's really small, doesn't take much space", "verified": true, "helpfulness": "0/0", "author": "Marie's Books & Stuff"}, {"rating": 5.0, "review": "This replaced an aging Blue Ray box and did the trick immediately. Easy to setup and fast and efficient. Very easy menu driven setup and use.", "verified": true, "helpfulness": "1/1", "author": "D. J. Livanec"}]