[{"rating": 5.0, "review": "I am very happy with this unit. We plan on shutting down Directv because we have so many options. We already had Netflix and I am a Prime member, so this is a great deal for us. Simple to install and use.", "verified": true, "helpfulness": "4/5", "author": "J. A. Burris"}, {"rating": 4.0, "review": "Have had it now just over a week and see so much potential, looking forward to getting couple more apps added, like twit tv..I love how sega is making games for this, wish they would make a genesis emulator so could buy all my old favorite games and not have to steal them, hopefully there are listing.. as far as amazon games studios, hoping to see so really good stuff to come from them..This box is almost everything ive been wanting in a set top box for a great price....", "verified": true, "helpfulness": "2/3", "author": "steveonbroadway"}, {"rating": 5.0, "review": "The only flaw I found is that the product has no off/on switch. It does shut off automatically after 1/2 hour, however, one has to unplug it to turn off and replug it to turn on. Other than that one thing, I love this product. The picture is so clear and crisp. I was watching movies on my Kindle Fire but the screen is small for movies. With the Fire TV I can watch movies, TV show  and it has more features that I won't use such as games but for my use it is an excellent product.Amazon has updated the Fire and now one can turn it on and off from the remote. Love it.", "verified": true, "helpfulness": "4/6", "author": "Kindle Customer"}, {"rating": 5.0, "review": "We watch a lot of TV, so we decided to try Amazon Fire TV.  This is truly a great set up.  It is so easy to use and set up I can't believe it.  The voice search works like a charm and the selection is huge.  It is well worth the money if you get most of your entertainment at home.  The only problem we have is that some of the TV shows and movies we would really like to watch aren't free, and the TV shows especially are very expensive.  Given the amount of TV we watch, we can't afford to rent or buy them.  We would much rather pay a monthly subscription, as we do with Netflix, and have access to everything instead of the way Amazon is doing the prime versus paid viewing now.  But the prime selection is huge, so it's not like you suffer terribly unless you pay. It is just very frustrating that Amazon has the shows you like but unless you want to pay hundreds of dollars, you can't see all of them.  I hope Mr. Bezos rethinks the subscription idea because I really like Fire TV.", "verified": true, "helpfulness": "4/5", "author": "Jane"}, {"rating": 2.0, "review": "Even though I'm on line, Amazon Fire won't stay on line. I watched a movie last night and it lost connection 6 time during the movie. If it continues to do this, I'll dump it.", "verified": false, "helpfulness": "2/6", "author": "Jeff Gladwell \"Jeff G.\""}, {"rating": 3.0, "review": "Wish it supported more video formats like MKV, avi and others like WDTV. Until its start supporting more video formats i wont be getting it and will be force to be stuck with my wdtv.", "verified": false, "helpfulness": "3/11", "author": "Michael Nguyen"}, {"rating": 1.0, "review": "I do not understand how an Amazon built streamer could end up being the absolute worst way to watch Amazon Instant Video on the market today. The absolute worst operator Interface off all the Amazon Instant Video players we have tried.1. NO sorting of you video library? I mean who is the complete idiot that thought this was a good thing. All Movies and TV episodes in your video library are in one single 1000+ item list from newest to oldest and you have to scroll all the way through from item 1 to find anything (and don't say search every single time you want to find something that is very stupid if you just want to look at what you have and then pick something)2. NO indication of previously watched content or progress bars in the listings to let you know you only watched half and episode.3. Advertised episodes for Hulu right next to your already purchased copy. Does this make any damn sense at all. I just paid 1.99 for a TV episode but you know what I think I will skip the commercial free copy and watch it on Hulu instead. Thanks for giving me that choice Amazon. /sarcasmHow can every other Amazon player on every platform be better than their own player? The iPad app is far superior. The ROKU player is far superior. the player on our Sony BD player is far superior.Why is Amazon the only digital content provider that does not let you sort your own video library into genre and movie/tv etc. it has always been lacking but this player makes it stupid with no sorting options.", "verified": true, "helpfulness": "23/43", "author": "dennis headley"}, {"rating": 5.0, "review": "Very fast very smooth great product love all the options even has the mobile espn app including espn 3 great for sports fans", "verified": true, "helpfulness": "1/1", "author": "Brett Lewis"}, {"rating": 4.0, "review": "The aps are quite limited at this time. I would have thought that Amazon cloud player would be good on this box. Also. button arrangement on the controller is a little off the normal configuration, if you are to a Roku. Otherwise I like the box. It is quick and has the possibility of replacing a couple of other units. I hope they increase the ap store and add more capability.", "verified": true, "helpfulness": "0/2", "author": "William A. Christian \"software engineer\""}, {"rating": 5.0, "review": "Great entertainment box!  Easy to setup, play etc.  it was even easy to setup  XBMC. Seems like it's playing great. Oh, and it's super fast. Like several times faster than an Apple Tv2 and an Ouya.", "verified": true, "helpfulness": "3/3", "author": "Michael D. Rudy"}]