[{"rating": 5.0, "review": "Glad I bought this. The wife and I love it. So much faster than our Apple TV", "verified": true, "helpfulness": "0/0", "author": "Brian Reed \"crank\""}, {"rating": 5.0, "review": "I love it.  Sleek design.  Plug and play.  Not sure if I still need exfinity....what is bundled with what and all that is confusing.  but I like this tv experience and LOVE voice control searching.  YES!", "verified": true, "helpfulness": "0/0", "author": "nachomama"}, {"rating": 5.0, "review": "Love it! I watch movies, music and more from it!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "I like the Amazon Fire TV, my friend at work told me about. It's super easy to install and I was watching TV in a few minutes. Very happy with the fire box.", "verified": true, "helpfulness": "0/0", "author": "G. Iverson"}, {"rating": 5.0, "review": "We love it!  We also have a fire stick, and a roku 3 which we need to get the NHL app.  The voice search works perfectly and the grandkids love playing the games they have on their kindle on the big screen. You really need the game controller which is sold separately in order to access the most games.  I have only one complaint that don't a effect most people.  I really wanted to buy this for a friend of mine that's elderly and I had just taught to stream video she is also blind and the fire tv don't have voiceover  the only streaming box that does is Apple  i am not a apple fan  but I did buy her one so she could watch Netflix but she couldn't watch amazon prime the apple tv is several years old and has accessibility  I would think that a device that's is no much better and newer would have this feature. I love amazon and hope they address this in the future", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I was apprehensive about getting the Fire TV for my husband as a gift after reading the reviews about internet and TV compatibility problems.  But I decided to take a chance and order it.  We live \"out in the sticks\" in Kansas and use internet that is comparably slow to what we experience when we stay at hotels and with relatives.  I was betting that we'd have buffering issues.  Also, our TV is an old Vizio, and I wondered if that might cause problems.However, we've been using the Fire TV all weekend watching movies and TV shows and have no issues at all.  Once in a while there will be a pause of maybe 2-3 seconds but that doesn't occur often.Now I'm thinking that I made a mistake getting the Fire TV for my husband because the honey-do list won't get done!", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "Surpassed our expectations. We haven't regretted cutting the cord at all.", "verified": true, "helpfulness": "0/0", "author": "Ashley Robinson"}, {"rating": 5.0, "review": "Get chew one!  I garontee, you'll love it.  No joke.", "verified": true, "helpfulness": "0/0", "author": "Skward"}, {"rating": 5.0, "review": "I am extremely happy with the Amazon Fire TV product, the incredibly quick shipping and the Amazon Prime privileges.", "verified": true, "helpfulness": "0/0", "author": "HappyHeart"}, {"rating": 5.0, "review": "Fantastic device and worth every penny. Initially purchased the Fire Stick but hubby couldn't get all the games he wanted so we moved to Fire TV. We'll be keeping the Fire Stick for another TV or travel. The Fire TV is a great investment, simple to install and works beautifully. Love it!", "verified": true, "helpfulness": "0/0", "author": "Carol M. Thomas"}]