[{"rating": 3.0, "review": "Neat design and easy to use. Good for streaming Prime movies, hulu, and Netflix, but everything else is kind of a let down. At the very least I was hoping to have access to the same Amazon apps that are offered for kindles.", "verified": true, "helpfulness": "0/1", "author": "JWoods"}, {"rating": 2.0, "review": "They advertise as you can access your Amazon Music that you pay, and you CANNOT! But no one answers you! Why will the advertise you can listen to your Amazon Music library if you cannot??", "verified": true, "helpfulness": "2/5", "author": "Ursula \"Ursula\""}, {"rating": 5.0, "review": "Best thing you ever came out with!", "verified": true, "helpfulness": "1/2", "author": "MAb"}, {"rating": 3.0, "review": "I was so excited for my Fire TV to arrive. I was so looking forward to a faster quad-core processor, 2 GB of memory, voice search, optical audio out and more games. All the things that Roku 3 didn't have. I like the interface better, it's more polished and easier to navigate and I especially love the optical audio out that I can plug directly into my HiFi stereo. The reason I only gave Fire TV three stars is because1. It has the Plex app which allows me to watch ABC, CBS, NBC, The CW, A&E; and USA. The Plex app interface is also fantastic but constantly while watching any video on any of the networks, it pauses, and starts, pauses and starts. I thought this was a Plex app problem, it is not. It does the same thing on Hulu Plus. I only have a 3 GB internet connection and I don't use a wireless connection, it's connected by Ethernet. On the Roku the Plex app had an occasionally hiccup but for the most part was always smooth watching on the channels mentioned. On slower servers it constantly would start and stop, so I stop watching those channels. But Hulu Plus never had that problem ever on the Roku 3.2. The Plex app on the Roku 3 was less polished but once installed and configured it was good to go and if I wanted to make changes to the settings it was still good to go. If I change any of the settings in the Plex app on the Fire TV it is guaranteed that when I try to watch a video from one of those networks, not all but at least one, I will get unable to play video error, empty directory error or the server can no longer be reached error. I have to either clear the cache and data on the app, go through the setup again or uninstall and reinstall the app again and go through the setup again, make all changes to settings that I want but never make anymore changes at all and then watch a video and put up with the video starting and stopping and sometimes just plain crashing. Once it crashes, I once again have to clear the data or reinstall the app.3. The available channels on the Fire TV compared to the Roku 3 is very slim. The Fox channel being one of them. There are a lot of games but only if you buy a 39.99 game controller. After having already bought the Fire TV, I stumbled onto an offer that you could get the Fire TV, an HDMI cable and a game controller for a whole lot less. Was very disappointed about that.4. I used Hulu Plus a lot on the Roku 3 to be able to watch a lot of tv shows that I couldn't get on Plex but I'm not fond of Hulu Plus because of the constant repeated commercials I have to sit through. So I had made up my mind that I was going to start buying 6 of my most favorite TV shows through Amazon Instant Video because you could get a season pass for $1.89 an episode which would have roughly cost me about $45 a month. I would have been charged automatically for each episode and all I had to do was watch the new episode when it arrived. But Amazon went and changed that and now in order to get a season pass for ANY TV show you have to pay for the whole season at once. Most of the shows are $39.99 for a complete season. And yes, that is soooo much cheaper than paying a $1.89 per episode BUT how many people can afford $239.94 up front for complete seasons of 6 shows? And yes, I can still buy each episode for $1.99 but I have to go into to each show and buy it each and every episode. I liked the convenience of the way they had it set up before and so they have lost a lot of money from me because of the lack of that convenience. I now have gone back to Hulu Plus, which as stated above constantly starts and stops and the constant repeated commercials.So in conclusion, over the last week of using the Fire TV I have many times considered switching back to my Roku 3 but I haven't yet. I believe that Fire TV has so much potential and I am hoping that with future updates these problems will be addressed and fixed. If not I will go back to my Roku 3 and use it until something better comes along and something better will come along and my Fire TV will sit on a shelf collecting dust.", "verified": true, "helpfulness": "2/2", "author": "Karen K. Ash \"krash56\""}, {"rating": 3.0, "review": "The speed on the FIRE is much better than the ROKU and the voice recognition on the Search is very good. I couldn't give it 5 stars because the Search does not search Netflix as well as Amazon for example. Also, you cannot tell it to only search Prime content. This is the same problem with the watchlist. Cannot just have Prime on the watchlist and as things move back and forth between prime(free) and paid, you never know if a selection will be free or not till you've clicked on it. Very annoying. My watchlist is now huge and most of it is pay(when selections were originally free). I actually attempted to keep it cleaned up with only prime selections by deleting items that turned to pay. But why should I have to spend hours selecting items for the list and then spend hours again deleting from the list?There should be a Prime ONLY voice search and a Prime ONLY watchlist. This would make it so much easier to manage with family and kids as well as myself. I end up having to pay for movies my kids see on the watchlist (that were free but now are not). By the time you have browsed through the lists to select, the kids get excited over something and I am either disappointing them or spending money. Why pay for Prime under these circumstances? At least on Netflix, what you see is what you get. Also, the new selections do not change enough. It is very difficult to search categories in Prime. If Amazon made the improvements I and others in these reviews have mentioned, they would have a HIT. You also need a favorite Channel List we can go to for non-amazon movie channels, news channels, apps etc. Also, we need more screen saver choices we can select under screen saver in settings (not have to physically run an app). All in all, the Fire is a great device and does everything it is purported to do. The Amazon Selection screens need to improve before I can give this 5 star.", "verified": true, "helpfulness": "0/1", "author": "Philosopher"}, {"rating": 4.0, "review": "I will say this as an application developer, Amazing, but I do have one gripe, and don't we all. I would give this 10 stars, if there was more memory. You have a quad-core processor unit with only 8 gigs of memory, that's like having people over to watch the football game, and you have the chips and dip, HD 50\" TV, the hot wings, but someone forgot to put the beer in the frig, so now you have warm beer. You have awesome games, but every game is 1/2 to 1 gig, so if you want to download and play, you have to keep deleting things. Irony in full effect, the two games I got for free for buying Amazon Fire won't fit together on the console, so I had to play one at a time, in your defense I do have other apps downloaded, but not many. But over all great experience, I just have to be the \"Memory Director and Chief\" making sure that we are not going over budget on memory.", "verified": true, "helpfulness": "6/6", "author": "Ray \"RIA Developer\""}, {"rating": 3.0, "review": "Free content is lacking for the money.  Get all the major networks on board and some of the other prime time shows from cable networks and it would be worth the money...I would even pay more to not have to deal with monthly cable bills.", "verified": false, "helpfulness": "0/4", "author": "T-Rev"}, {"rating": 5.0, "review": "Love the ease of having all my favorite apps,shows and movies at my fingertips with Fire TV.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Will not connect and there us not a phone number to be found only a general help forums and questions...I am ready to return this item ASAP", "verified": true, "helpfulness": "1/3", "author": "janet"}, {"rating": 5.0, "review": "Works well with Amazon Prime and Netflix.  Having a problem with the remote.", "verified": true, "helpfulness": "0/1", "author": "Leland O. Karras"}]