[{"rating": 4.0, "review": "I like it very much and it looks very tiny and elegant; however, I can't figure out how to enter my passwords for Pandora, Hulu, Netflix, etc... what am I doing wrong? I know it must be simple because nobody has addressed this problem, so it must just be me.Can someone please tell me? I only saw the onscreen keyboard when I entered my Wireless pass code, but not when I have to log in to my other stations.", "verified": true, "helpfulness": "0/0", "author": "Gizzyfied"}, {"rating": 2.0, "review": "Does not work that well with my DSL connection. Also ask me to purchase the movies and other items. That was not mentioned when I was reading about it or when Mr. Busey was describing it on the Amazon commercial ad.I would like to return them. Only opened and tried one of them.I am current using Direct TV only because of the Bundle option and that is not a very good combination as there is really nothing to watch of interest except local and national news.Just not pleased with the product.", "verified": true, "helpfulness": "1/1", "author": "Michael E."}, {"rating": 5.0, "review": "I love this option but the price of things should be listed on the thumbnails or something instead of waiting until I click on the product....but hey, that's marketing for ya.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've considered it to be obnoxious and arrogant and demanding before and I still do.  I like the fire tv.  That's all I have to say.", "verified": true, "helpfulness": "0/4", "author": "Susan French \"SusanHypno4Success\""}, {"rating": 3.0, "review": "10GB is not nearly enough space!!  Just a few apps and games and it was already full and I had to go and delete things in teh first night of using it.  Very disappointed there is no expansion slot.Its fast and easy otherwise, with the exception of the somewhat annoying click the remote makes.  Would be nice if the middle round button was touch-sensitive for easier scrolling and less noisy navigation.", "verified": true, "helpfulness": "2/3", "author": "Michael Hastings \"sublime311\""}, {"rating": 4.0, "review": "I really wish that that the audio search extended to apps like netflix.  Also, what is the usb port for?", "verified": true, "helpfulness": "1/2", "author": "Robert G. Losi"}, {"rating": 5.0, "review": "Device came already registered since I'm an Amazon Prime customer. Plug in the power and the HDMI cable (not provided) and a couple of minutes later you are watching movies. There is never a buffering delay and the picture quality is great. I am very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "I bought the Amazon Fire TV because it looked like it would be a great replacement for our old and failing Roku.I was right! It does everything the roku did plus it has games too. The picture quality is a lot better also.We love this little box.", "verified": true, "helpfulness": "0/0", "author": "Daniel Wright"}, {"rating": 4.0, "review": "I brought 1 and it works great so I got another one to try on another TV which has only component inputs and brought a HDMI converter. It does not work with it. It would be a great help if Amazon would list what if any converters would work with the Kindle fire TV.  Also the Kindle Fire TV won't work with all HDMI cables if you plan to use a HDMI Switch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Our daughter has both Roku and AppleTV devices and we weren't impressed, so we decided to get the Amazon Fire TV. Good choice. It arrived late yesterday and took no time for hubs to get it up and running. There was a short and clear video explaining how to use it with the remote. Netfix quickly installed and I logged on and found my wishlist, then navigated with no problems finding the same thing on Amazon Prime.Oh, and for you Comcast people -- no problem, because you connect via Wi-Fi. Using the remote control, you select your network from a list displayed on the screen, or enter it if need be, type in your password and voila!", "verified": true, "helpfulness": "1/2", "author": "Penelope"}]