[{"rating": 5.0, "review": "great price super easy to use", "verified": true, "helpfulness": "0/0", "author": "Andrey"}, {"rating": 5.0, "review": "We were very pleased with the large selections! Plus the fact that you can view your own photos on the TV!", "verified": true, "helpfulness": "0/0", "author": "louise"}, {"rating": 5.0, "review": "This thing is awesome for a compact, complete HTPC! The main HTPC apps I use are Netflix, Amazon Prime, Hulu, and XBMC to my home NAS server. The Fire TV handles all of these services brilliantly for a very, VERY reasonable price. Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Richard M Loranger"}, {"rating": 5.0, "review": "This has completely changed my TV viewing in positive ways.  Great selection of wonderful programs.  I especially like the series from BBC.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Great! The packaging is pretty and the product is nice. The batteries that come with the package for the remote die very quickly, so have some extra AAA handy. Voice recognition is very accurate. So far I enjoy all that it has to offer, but would like more programs that offer closed captioning.", "verified": true, "helpfulness": "0/0", "author": "Mrs_Graham"}, {"rating": 5.0, "review": "Love It! Combined with my Optimum On Demand I'm all set!", "verified": true, "helpfulness": "0/0", "author": "Patricia Z."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Arrived and it's not plug and play. It requires a wall outlet and it basically gives you the same type of online access to shows as Netflix - which we already have - so it really wasn't worth it to keep it. Looks like a nice assortment of shows and movies though.", "verified": true, "helpfulness": "0/2", "author": "JG MILLER"}, {"rating": 5.0, "review": "Wow, talking about excited!  I just got my Fire Tv , it took less than 5 minutes to connect. It's a cure for our boredom. Get it you'll be happy you did!", "verified": true, "helpfulness": "0/0", "author": "sese2007 \"kriskris\""}, {"rating": 5.0, "review": "Great product. Very easy to install and comes already linked with your account. Remote and functions are much better than Apple TV which I also own. The voice search works very very well. This will basically completely replace our Apple TV with the exception of our already purchased iTunes content.Well done. Highly recommend for someone looking to stream digital content.", "verified": true, "helpfulness": "0/0", "author": "ShelT"}]