[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "robert"}, {"rating": 5.0, "review": "Great little box !!! Love it", "verified": true, "helpfulness": "0/1", "author": "WIL RIVERA"}, {"rating": 5.0, "review": "What more can I say?  I love it !!!", "verified": true, "helpfulness": "0/1", "author": "Christopher K. Coffin \"Designer to the stars\""}, {"rating": 4.0, "review": "I am pleased with Amazon as a whole.  I bought this device with the hopes of Amazon adding HBO Now as advertised in commercials.", "verified": true, "helpfulness": "0/1", "author": "John Kottori"}, {"rating": 5.0, "review": "Yes, my family loves it! Im thinking about getting a few more for our house!!", "verified": true, "helpfulness": "0/1", "author": "Janice Olga"}, {"rating": 5.0, "review": "So much better than the fire stick!", "verified": true, "helpfulness": "0/1", "author": "Tom Groner \"t. groner\""}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "Kevin D."}, {"rating": 2.0, "review": "First, let me say that belong to the Church of Amazon and love my Fire TV. However, after you have it for a few months, Hulu Plus will start freezing up.  It happened on both my Amazon Fire devices.  The picture will freeze but the show will go on.  Very annoying.  I can stream Hulu Plus through my computer and have no problems.  I got a different streaming device specifically for Hulu Plus.  It does not affect any other apps but for some reason, Hulu Plus is not compatible with the Fire TV box.  I have done exhaustive research and spent hours on the phone with both Hulu and Amazon.  If you read the reviews on the Hulu Plus App when you install it on Amazon Fire, you will see others mentioning the same thing.  I would not buy another Fire TV box again.", "verified": true, "helpfulness": "0/3", "author": "Jan Rowe"}, {"rating": 5.0, "review": "ireally like this product", "verified": true, "helpfulness": "0/1", "author": "Ruth Nims"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "Thomas G Selby"}]