[{"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 1.0, "review": "I was unable to stream movies, it keeps interrupting and stopping. Not sure why, I am signed in to the wifi at our house. Darn it.", "verified": true, "helpfulness": "1/4", "author": "Tammy Wolf"}, {"rating": 5.0, "review": "Love my Fire TV.  I have had many other products that are geared to doing the same thing, but so far this is my favorite.  I appreciate how easy Fire TV makes it to access Amazon Prime.  The ability to search content by voice makes finding something to watch extremely easy.  I do wish the voice feature worked in other apps as well such as Netflix, but as of right now it only seems to work in Amazon Prime. The remote is also a nice thing to have.I have also used Fire TV to stream music, view my photos (which are on the Amazon cloud), and access to movies previously purchased on Amazon.  I enjoyed all of it.  I haven't played a game yet, but there appears to be many fun options out there.I'm looking forward to continuing to explore all the additional apps (e.g fitness, cooking, etc) available for download.  This device has made my TV much more fun!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "love it can get nexflex anything want thru amazon fire good price yr beats 58.00 mo dish", "verified": true, "helpfulness": "0/0", "author": "beverly gerner"}, {"rating": 5.0, "review": "Best money I've spent in a long time.  We only have cable on our flatscreen tv in the living room, so this is great for the upstairs bedroom.  Since we already had Prime, this was perfect.  I am catching up on tons of shows I missed over the last decade (when we didn't have cable) and the Kid's TV options are great too.  Best feature of the unit itself is the voice command.  It works much better than I expected.  Set up is easy and fast.  We'll probably get the Stick for the living room tv.  Nice job Amazon!", "verified": true, "helpfulness": "0/0", "author": "K. Carver \"iansmom\""}, {"rating": 5.0, "review": "Great while recuperating from surgery.", "verified": false, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "While the Fire TV is fine and does what it is supposed to do and supports a lot of platforms, including Hulu and Netflix, I totally disliked the customer support by Amazon. After finally responding to seemingly endless emails to purchase this (after buying a new TV from Amazon), I paid the \"Best Price\" of $99 for it. Within a week it was lowered to $79. I noticed the price drop a few days later. Called Amazon and was denied the price difference. When I expressly asked, \"So too bad, so sad for the customer\" I was told, \"Yes, Amazon doesn't match prices except in first few days of purchase so YOU have to keep better track of prices to get the reduction.\" Even other big box stores that I was forced to edit out of this review have better customer service than that - and I will prove it to myself with my next purchases!!", "verified": true, "helpfulness": "0/2", "author": "Skeeter's Flicks"}, {"rating": 5.0, "review": "LOOKING FORWARD TO TRYING IT", "verified": true, "helpfulness": "0/1", "author": "Marci Shipley \"Born Again\""}, {"rating": 5.0, "review": "LIKE IT", "verified": true, "helpfulness": "0/1", "author": "James W. Wagner"}, {"rating": 5.0, "review": "I like this device better than my rokunot many apps on the app store but has all what I needGames are the most fun part I like about the Fire TVall the games that I like on my android tablet now I can play on my big screen TV, which is awesomeand that too with the controller awesomeeerStorage is one down side which I wish would improve in next versionas like with any android device I would like to have the next versiona better CPU and GPU, expandable memory through a memory card slot which would helpinstall large size games on deviceand more games and apps specific to Fire TV", "verified": true, "helpfulness": "0/0", "author": "Rakesh Ranade"}]