[{"rating": 4.0, "review": "Nice product- but draws power in sleep mode ALL the time unless you unplug it. :(That seems very wasteful of energy-  I wish it had an off button - but no you just walk away and it sleeps 30 minutes later...", "verified": false, "helpfulness": "1/1", "author": "Monika"}, {"rating": 5.0, "review": "This is the fastest and highest quality streaming player that I have found. Very fast performance, and the gameplay is a nice plus.If you have several videos at home I recommend setting up a Plex account, and attaching your Amazon Fire TV to your Plex server to stream your content to your TV once you install the Plex application. Absolutely the best method of doing this sort of thing.Love the device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little box is amazing. It's fast, includes photos and videos and has all my favorite roku services at twice the speed. Plus, it allows me to take advantage of the Netflix \"profiles\" to differentiate my que from my kids. Definitely lives up to my expectations and all the hype. No concerns about it. Strongly recommend!", "verified": true, "helpfulness": "2/2", "author": "Sam A."}, {"rating": 5.0, "review": "Very easy to set up and very easy to use.  Much more than expected.  Spent a while trying to decide between Fire TV and other choices but with all the options available through Amazon Prime, this was the obvious choice for us.", "verified": true, "helpfulness": "1/1", "author": "J. Schmeltekopf"}, {"rating": 5.0, "review": "The product works but comes with virtually no instructions on setting it up. The little guide is ok but just a leaflet. The big issue I had is the remote buttons for navigation are not labeled and I did not even realize they WERE buttons.There should be a short guide on what the remote does and how to use it to set up the wireless connection. I had to call Amazon for help. I finally realized the other buttons were there and then was able to enter the codes for the router and move to the right network.So far the speech recognition works pretty good and the system suggests things to watch based on what you ask for.", "verified": true, "helpfulness": "1/2", "author": "R. Speizer \"thebooktiger\""}, {"rating": 1.0, "review": "I bought this thinking that I would have access to the 40,000+ shows in the description or whatever number. I will say this...if you have an xbox 360 DO NOT BUY because it is essentially the same thing if you already have netflix and prime (which are the predominant things I use).Selection:You really dont have as much selection as you think. The way it was marketed to me was that it would replace cable but I really dont see that. Honestly 95% of the time I revert to netflix while on this thing because Crackle (which has ads during your videos btw) and the other stations DO NOT provide much variety and Amazon Prime is very limited to what it has. Half the shows and movies I have never heard of. Most popular shows are ones you have to pay for which is a rip off.User interface and prime members \"benefits\": Ill give it some credibility for its speed, it is really fast at loading what you need and moving around and the remote is spot on accurate to what you say, even adapting to how you speak which is nice. HOWEVER, when you search for shows it DOES NOT automatically tell you whats available on prime...it only takes you to the one you have to pay for, and then you have to manually check if the show/movie is Prime compatible. Why not just direct us to movies/shows that work for prime accounts when we voice search? Im not paying for the fire so I can buy show seasons and movies, thats what Amazon Prime is for! If that was the case I wouldve gone chromecast or just plugged my laptop to my TV. The fire TV needs to be tailored better for it Prime members.Internet connection:Ive noticed that with the fire TV my internet bandwidth is crazy screwed. I suppose I can unplug it when its not in use.Design:Its a sexy looking thing, very convenient. Very classy look. Flat black box, sleek and quiet too.Gaming:No comment. Ive got an N64 and an xbox360, i dont need to play Amazon games but i cannot accurately critique or praise their gaming interface.All in all I am unimpressed with this product of Amazons. I am an arduous Amazon follower but to see this product is very saddening. Make it more accommodating to Prime members for their money's worth is where it should start. I feel more access to shows FOR FREE (like netflix) via Prime should be something. Also fix the voice search to show you only Amazon Prime compatible things, not stuff we have to pay extra for. If the necessary things I listed cant be met I honestly feel customers are better off with their xbox360s or laptops with HDMI -- yes it is a bit slower but why pay more for Fire TV when you essentially have everything the Fire TV offers on your gaming counsel or laptop?", "verified": true, "helpfulness": "5/8", "author": "Eli"}, {"rating": 5.0, "review": "I liked this device because it allowed me to have a \"smart\" TV without having to buy one.  Since I subscribe to Amazon Prime it gives me a chance to download free movies and TVs without depending on my TV service", "verified": true, "helpfulness": "1/1", "author": "Adriana Albanese"}, {"rating": 3.0, "review": "UPDATE: The majority of my review still holds, as the software has not been updated significantly. That said, you are now able to listen to Amazon Music on the Fire TV, but it makes the glaring omission of Spotify and other music services that much more apparent in terms of available apps. The other problems I described (small amount of available storage, poor management of RAM, etc) are still there. I'm hoping that the next generation of Fire TV integrates somehow Android L for TV, considering that there will be plenty more apps for Android TV than Fire TV, which could then just be ported over.In theory, the Fire TV has it all: the ability to play your favourite content on your television with a slick user interface without too many button clicks or setup hassles. To that end, the device is actually really great. Picture and audio quality is what you'd expect which is to say that they're excellent. I'm not a Prime member, and yet the Fire TV has proven to me to be the best thing you can plug into your television. That isn't something I say lightly, considering I have an Apple TV, PS4, Wii, PS3, and a Chromecast.That said, there are a number of things where I'm left scratching my head because Amazon apparently didn't think these things necessary.- You're limited to 5 GB of storage for your apps. They might tell you that you have 8, but the reality is that the OS takes up a little under 3 GB by itself. I don't take issue with the fact the OS takes up that much space. I take issue with the fact that there's a USB port in the back that can't be used to store more apps and games. As it stands right now, I only have 1 GB of storage left on my Fire TV and I've only installed 3 games. I'm really hoping that this issue is resolved in a software update.- The Fire TV visibly slows down after continued use. The device doesn't actually enter any standby mode, it just starts up a screensaver that turns off when you press a button on the remote. It's pretty, but there really should be a dedicated sleep button somewhere in the UI because as it is right now, it's pretty clear the device runs out of usable RAM fast.- It would be really cool if you could shop on Amazon from your television using your Fire TV, but again, Amazon had other ideas.- The processor and GPU aren't as great as Amazon would have you believe. Take for instance, Asphalt 8, a game highly advertised as a playable game for the Fire TV. Asphalt 8 gives you the options to change it's graphical quality (Gameloft opted for a straight-up Android port) from low, medium, and high. The game looks gorgeous on the highest graphics setting, but the game starts experiencing significant lag and dropped frames. MirrorMoon EP has similar problems with dropped frames and believe it or not, so does Sev Zero (the game Amazon made exclusively for the Fire TV). It's a real shame, but if you're hoping to buy the Fire TV as a microconsole, you're probably better off waiting for the second generation of the hardware. Hopefully we'll get an Nvidia Tegra K1 in here next time around.Lastly, at the time of writing there's a few apps and games missing from the Fire TV's selection of available content that would be greatly appreciated on the device.- TED Talks- LOGO TV- Spotify- Bit.Trip Run! by Choice Provisions- Mass Effect Infiltrator by EA- Galaxy on Fire 2 by FishlabsIf you're buying the Fire TV solely for television and movie content, you'll do great with Amazon's huge library built in, and you'd likely do even better when you pair it with a Prime subscription. If you're buying it for that in addition to the ability to install and use your favourite media apps, you may have to wait a bit for those developers to make the app available if it's not already on the store. If you're interested in getting a Fire TV as a microconsole, you're gonna be much better off buying one when the next generation of it comes out next year.", "verified": true, "helpfulness": "2/3", "author": "mpstudies"}, {"rating": 5.0, "review": "This is the real cats meow when it comes to streaming movies!  It is easy to hook up as well as operate.  I give it a very high recommendation!  Could not be better!", "verified": true, "helpfulness": "1/1", "author": "Tom  W."}, {"rating": 5.0, "review": "This is a pretty cool product. I bought a roku some time ago and this goes a bit further in that it has a better selection of games, shows your amazon cloud pictures and videos as well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]