[{"rating": 5.0, "review": "(Edit got netflix installed) Will change to 5 stars when they fix the netflix app currently cant even install it. So im pretty mad about that I want my netflix. I have only had this thing about an hour and aside from Netflix this thing seems pretty good. I would recommend it", "verified": true, "helpfulness": "1/1", "author": "Rege"}, {"rating": 5.0, "review": "I purchased this device over all of the others because of the \"Voice Search\" feature.  I can say, \"Childrens movies\", into the remote  and, instantly, I get a huge listing of shows that my Grandkids can choose from.  It really saves time, especially when a 4 year old wants to see some kids shows NOW.  Technically, I feel that a lot of engineering went into this device.  The picture quality is exceptionally clear, and I have NEVER seen the image freeze for buffering.  I would recommend this device over all of the others.", "verified": true, "helpfulness": "0/0", "author": "Joey the K"}, {"rating": 5.0, "review": "We are very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Terri Esiline"}, {"rating": 1.0, "review": "too expensive must have amazon prime don't use it any more now", "verified": true, "helpfulness": "0/3", "author": "john f hilton sr"}, {"rating": 5.0, "review": "Awesome product. I love it!", "verified": true, "helpfulness": "0/0", "author": "betty richardson"}, {"rating": 5.0, "review": "Got my amazing fiya TV today. It's awesome. Easy set up. Had to connect w/ my wifi. Small snafu but connected just fine.", "verified": true, "helpfulness": "0/0", "author": "T. Hopkins"}, {"rating": 5.0, "review": "Was very surprised how great this device is. What makes it great is being able to install XBMC and using it as a Media player. Otherwise it would be just another media player box.", "verified": true, "helpfulness": "1/1", "author": "Nunnia"}, {"rating": 5.0, "review": "I have been using this for a few weeks now and I love it. It was so easy to set up and works flawlessly. I love the remote control microphone. So happy with the Amazon Fire TV I ordered another for the family room. May be canceling cable TV.  Worth the money.", "verified": true, "helpfulness": "0/0", "author": "Tess"}, {"rating": 4.0, "review": "haven't used it as much as we should but with winter here getting used to if nice", "verified": true, "helpfulness": "0/0", "author": "Thresa Larson"}, {"rating": 5.0, "review": "At first it was Time Warner raising bills, left them to go to Direct TV and their rates went up as well. I'm tired of having to pay $150+ for TV. Decided to give this a try and couldn't be happier. As a single dad this is great. Prime allows me to all the shows my 4 year old daughter likes and with HBO I get what I like. With Fire and digital antenna I am saving $1500.00 a year!!! Single parents know when you actually get an hour or two to sit down and watch TV you only watch certain things and Amazon TV and Prime deliver. Happy I made the switch, as long as the Prime membership doesn't sky rocket up in the next year this is all I need.", "verified": true, "helpfulness": "0/0", "author": "Bryan Holt"}]