[{"rating": 4.0, "review": "Just hooked it up and been using it for a couple of days.  It's extremly easy to use I like the voice search option.  The family lives having all the movies and shows at their finger tips.  Hope that Amazon adds more it lacks all the options of the roky", "verified": true, "helpfulness": "0/0", "author": "Donna Lintz"}, {"rating": 5.0, "review": "Awesome awesome..how do I power it off?", "verified": true, "helpfulness": "0/1", "author": "Amy"}, {"rating": 1.0, "review": "Way too many movies have to be purchased and some at very high prices, even old movies.  I'll stick with Netflix.", "verified": true, "helpfulness": "2/8", "author": "Barry Wyner"}, {"rating": 5.0, "review": "Great option for watching movies and playing music. You'll want Amazon Prime to access lots of movies, music & games.", "verified": true, "helpfulness": "0/0", "author": "BIGFOOTDWR"}, {"rating": 3.0, "review": "We like the Roku better. It seems to have a lot more options for apps. Did not realize that you still have to pay for most of the shows on Amazon Prime also. Would have thought that since you pay for the service the shows would be included. We will not be keeping that either.", "verified": false, "helpfulness": "2/6", "author": "Theresa Garrigues"}, {"rating": 5.0, "review": "We have had a Google Chromecast over a year and although I originally liked it just fine, it would have to be reset quite frequently to \"cast\" and sometimes we would have to reset the router and wait. Then you have to look up whatever you wanted to watch on your phones tiny screen so if they family is trying to decide on stuff you had to huddle together and decide.NOT on the FIRETV! Everything is straight on your screen and you just hunt by voice search or if you have prime you can go online and build your free library. Only con we have found so far is voice search shows you everything free and paid items, so if you are a primeMember and want to utilize only your free videos you have to weed through them and you can't see if they are free unless you click on them, I suggest you go online and \"add to watch list\" all the videos that you are interested in that are under \"free prime video\" search. This way you have a nice strong library and do not get frustrated searching through paid and free videos alike.other than that quirk, FIRETV is an amazing product and we are sorry we wasted our time with the Chromecast.", "verified": true, "helpfulness": "2/2", "author": "Amanda Frame"}, {"rating": 5.0, "review": "💜", "verified": true, "helpfulness": "0/2", "author": "Mercedes Moreno"}, {"rating": 5.0, "review": "How can I give this less than 5 Stars?  I haven't had to pay for Cable or Dish in the last 7 years after installing my own HDTV High End Outdoor Antenna system.  Since, I've enhanced my tv experience that costs me a total of $0 (nothing) per month by adding a couple low dollar items like Netflix & Hulu as well as RabbitTV (just $5 a year) and since have had gone a bit further with Roku, Netgears Push2TV to stream everything on TV (far better than Chromecast which is limited) but is no longer supported if you run Windows8.1.  In short, I'm all about \"the best of tech\" and after getting the FireTV (much better than Fire Stick TV with twice the memory (no buffering lag time anymore) better gaming, talk to tv commands to the remote instead of to your phone, etc and worth the additional $30), I in short am selling off all my other devices.  Roku, Netgear Push2TV3000, SmartDVD players, all getting sold excluding a simple blue ray DVD player, because Amazon has really raised the bar!  Gaming with great graphics (many coming from Windows 8 apps like Gameloft), and Amazon did a phenominal job in the menu system, memory of where last left off, I can keep going on.The Result = I've purchased 8 more of these units (4 for my house and 4 for Christmas gifts).  I hope Amazon holds the lead over all others especially with Google entering the game now and will be a good competitor I would imagine but as of right now, this is by far superior to anything of all the devices I've used and highly recommend it.  It's tiny size is extremely decieving to what it does and offers!  Thanks Amazon!", "verified": true, "helpfulness": "3/3", "author": "Mary Spagnolo"}, {"rating": 5.0, "review": "Gift for my wife and we use it daily. Very fast and easy to use and voice search is awesome. Probably use this more than the satellite now.", "verified": true, "helpfulness": "0/0", "author": "Cody Matheson"}, {"rating": 3.0, "review": "Downloading preinstalled apps is a pain and then they dont work. Buffers varias times during shows even when all other wifi devices are off.  Remote is very sensitive.", "verified": true, "helpfulness": "0/1", "author": "javon"}]