[{"rating": 4.0, "review": "Wish it had Vudu App.  Put a lot of my physical media on the cloud this way and would love to use my Fire TV to view.  Pretty good, otherwise.", "verified": true, "helpfulness": "1/1", "author": "Brian S \"bsamiam\""}, {"rating": 1.0, "review": "sent it back - had an issue w power adapters", "verified": true, "helpfulness": "0/1", "author": "R. Parker \"wreques\""}, {"rating": 5.0, "review": "This is one of, if not THE best media streaming devices available.If you're interested in using KODI (formerly XBMC), there really is no better alternative... and if you don't know what KODI is, do a quick google search, and then go buy an Amazon Fire TV.Almost everything that Apple is bragging about, with the new Apple TV, the Fire did first. At half the price. Get one!", "verified": true, "helpfulness": "0/0", "author": "David R. Roche \"Kindle FTW!\""}, {"rating": 5.0, "review": "Works great. Makes me want to cut cable.", "verified": true, "helpfulness": "0/0", "author": "Paul Johnson"}, {"rating": 4.0, "review": "Replaced my Apple TV with combination of the PLEX media server app. So much better than iTunes and (broken) Home Share.Only gripes:Must be connected to same WiFi as iPhone to control remotely without remote.Otherwise requires remote at all times; easy to forget when traveling.Can't change WiFi without remote; need same WiFi settings set to operate. Catch-22.Doesn't work with universal remotes that work on IR; annoying having to keep an extra remote handy.Supports BlueTooth but can't autosync with phones, mice, keyboards unless you have the remote with you.", "verified": true, "helpfulness": "0/0", "author": "Mario Kroll \"Mario\""}, {"rating": 5.0, "review": "I replaced my WDTV with this. I couldn't be happier. The fact that I can side load KODI media center on this and access all my videos from our home network is a great addition. There is a great tutorial online for adding KODI and it was simple to follow.  The device is very responsive and Netflix has never been easier to navigate. FireTV goes to sleep after not being used for a while and there is no need to turn it off. It wakes up instantly when you push any button.", "verified": true, "helpfulness": "1/1", "author": "T. J. Ebling"}, {"rating": 5.0, "review": "I LOVE LOVE LOVE my Amazon Fire TV!  It was very much worth the money!  Lots of programs/apps can be added to it, making it my go-to device for all my needs.  The ONLY thing I wish they would improve upon is subscription apps.  We ordered Sling for our Amazon Fire TV, and after a few months decided we wanted to go to a less-expensive subscription for it.  There wasn't a way I found other than cancelling it.  Now that we have cancelled it, I can't find a way to add it back and just pay the less-expensive subscription.  That is my ONLY complaint about this great deal!", "verified": true, "helpfulness": "0/0", "author": "Carly"}, {"rating": 5.0, "review": "Use it all the time. Love it.", "verified": true, "helpfulness": "0/0", "author": "R. Hamilton"}, {"rating": 5.0, "review": "My only complaint is that it's so hard to search in the YouTube App. I don't know if these is a problem with Amazon or Youtube, but it's impossible. You have to type out what you are searching for by scrolling to every letter and space. Wish the voice demand was available in the apps.", "verified": true, "helpfulness": "0/0", "author": "Ann-Marie"}, {"rating": 4.0, "review": "Does what I expected it to do. I do think the search options for prime content could use some work but the vice search works awesome and for using sling tv and Netflix it works great. It is also very small so you don't even notice it by your tv", "verified": true, "helpfulness": "0/0", "author": "Kevin  Jackson"}]