[{"rating": 2.0, "review": "What can it do more than what my PS3 has done for years,, You still have to pay for the services of the different channels except for a few others.. I just don't get it.. And I have a lot more channels too. $99? I don't think so.. You can try it but it'll have to come way down in price before I'll go for it, and most likely won't ever.. Just my 2 cents worth, and yes you can come down on me for that but I really don't care. For me it's not a good deal at all. I mean if my PS3 can't handle it my computer will and already has through Amazon's service..If you have the set up I have why spend any  more $$??  To each his/her own....... bye........", "verified": false, "helpfulness": "7/57", "author": "Michael A McGowan"}, {"rating": 2.0, "review": "I purchased this because I have a prime membership and I wanted to try something simple like my Roku. Well, I should have read the specs closer, this falls short in several key areas.Pros:Voice search and remote and kinda coolCons:No streaming from PC or network storage - this was a huge surprise at this high-end price point.No Airplay, Play on or Cast feature unless you have a KindleNo functioning USB port for pictures or additional storage.The limited Amazon ecosystem of apps.Price - Its in the same price category as the Roku3 and is far inferior.I am very disappointed in myself for falling into the Amazon vortex. I am resolving to give Amazon less of my money from now on.", "verified": false, "helpfulness": "15/48", "author": "mrproost"}, {"rating": 5.0, "review": "+UPDATED AT THE BOTTOM+To sum it up before diving in: I would choose this over the current roku and appletv options, this box is aimed to have more gaming functionality, and has far better hardware specs/capability and thus more potential for whatever amazon decides to add to it. Yes, it's missing some functionality/apps at launch, but what box ever started out with EVERYTHING?i've mostly used roku, as well as some other boxes such as patriot box office, as well as some smart-tvs, but for the moment i'm just using my computer and home media center for netflix because no current box available that i like has optical audio output. Hence i hit the buy button the moment i saw that firetv included that output.Pros:-More speed and memory than the competition-Loads everything far faster-Voice search that is actually useful(but with limitations)-Gaming looks very promising(claims lots more titles coming)-small box(competition basically the same)-simple, easy to use interface-Dedicated properly designed game controller-Bluetooth remote(no line of sight needed)Cons-Some might think the interface is toooo basic (not me)-Some channels not available yet, like HBOGO-The remote can be used for gaming, but order the overpriced controller if you plan to game-Overpriced gaming controller-Not as full featured in terms of apps(yet)+Streaming performance:Seems just fine, but this of course will also depend on both your internet connection as well as your wifi connection(unless you're wired) Many negative reviews of streaming devices are totally undeserved because the reviewer has a poor internet connection. It's obvious they streamlined the amazon prime video aspect of this, but the others like netflix are there too and play just fine.+Computer file playback:Missing apps for it, but Plex is there and works. Looking forward to the app developers making it available for firetv, which shouldn't be too long considering it's android based already. The USB port i was hoping for direct file playback, but for the moment it does not seem possible. The firetv specs list support for numerous video file types, but perhaps we just need to way for some app developers to make already existing such apps available and open up this type of functionality. It doesn't look at all like amazon will limit what can be done with this box. I'm very interested to see what comes of it.+Design:WHO THE HELL CARES. Seriously, if the design of this or any little streaming device is a deciding factor in your purchase, you're completely hopeless. All these things are small and can be tucked away.+Apps/gamesNo it doesn't have millions, but neither did its competition at launch, but amazon has made it clear that many more are on the way. It's android based, so anything available on android should be an easy update for app developers to make it available for fire.In short, i think it's the box to get for streaming/maybe some gaming/future interesting things. It is by no means perfect, the competition has things that this does not, such as a headphone jack on the roku remote, and appletv's itunes integration. But amazon seems pretty clear that they are aiming to have this be a competition-less box in terms of its abilities, for instance their inclusion of their main streaming service competitor: Netflix.I've not had a gaming system for a long time, for several reasons. the roku's added game functions were nice but i used them for all of 15 minutes. Amazon seems intent on this being a usable albeit not xbox/playstation capable gaming unit.Much of the criticism i've seen so far is related to apps/lackthereof, but it JUST launched people, apps will come, and we'll see how much power this thing has under the hood.++UPDATEPower usageFirst off, i checked the power consumption, when not in use/sleep, it hovers around 3watts. when in use i haven't seen it go over 6watts. The power supply is rated at 14watts.Game ControllerLikely the biggest minus so far: the Analog sticks have significant dead zone, meaning precise/minute aiming/movement is not dooable. hoping they improve this, as it significantly affects gameplay.Plex streamingTried with a 1.64gb 1080 mp4 with direct stream and direct play on, and tried 10,12,20mb 1080 settings(i believe the prior settings negate the mb settings) and the movie played for awhile with no glitch but then started to hang up here and there, it seemed just pressing pause/play would get it going again. will need to do further testing, tried both 5ghz and 2.4ghz wireless settings, need to try wired, and also try without direct stream/direct play.", "verified": true, "helpfulness": "25/28", "author": "Darren Levine \"That Photo/Video/Tech Guy\""}, {"rating": 5.0, "review": "Does this work anywhere in the world, or only in the U.S. I want to use it in the Middle East.", "verified": false, "helpfulness": "1/21", "author": "Shahzad Gidwani"}, {"rating": 5.0, "review": "I own 2 ROKU boxes the intermediate and the high end models. This unit blows them away with a dedicated cpu, memory and options. I purchased the game ctlr. with the box and it works great. Looking forward to more games to come out. Setup was simple, easy, quick with out a hitch. This is sleek with a small footprint design. Compared to the ROKU, this unit does not get hot like the ROKU does under heavy use. I also have to reboot the ROKU at least once a week because of memory filling up. Once the memory fills up, the ROKU stops working so I have to reboot to clear the memory. Amazon ahs done good here! Five Stars in my book and this from a 3 year ROKU owner/user.", "verified": true, "helpfulness": "15/18", "author": "Mike"}, {"rating": 5.0, "review": "Set up was extremely easy on the Fire TV. I love the voice search feature-- that's a game changer. It's really, really fast compared to other devices (we're a Roku family and have 3 generations). What sets this box apart from others is the gameplay, speed, voice functionality, and Kindle Fire crossover (love it!).I'd love to see HBO Go, Vudu, and Aereo on the box soon!We're very happy with this one and can't wait for the future upgrades and additions that are inevitable.", "verified": true, "helpfulness": "6/7", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Wow - I just love how there are so many 1-2 star reviews on here from people (trolls/Apple fanatics) who don't even own the device. Whatever - seems weird to me to take the time out of your day to do that. Anyhow, I actually own the device and this will be immediately replacing my Roku 3 (which replaced an Apple TV). For starters, this thing is FAST - general performance and buffering speed is noticeably faster than Roku 3 and completely blows away the Apple TV. If you use Amazon's video services for renting or owning movies and TV shows, you will be blown away by how quickly your video library begins to play. Second, the voice search works and it works very well. Speak an actor's name, movie title, game title, etc and you are served results instantly - and they are accurate! I have already used that feature many times. Lastly, the games... I own a PS4 and an Xbox One so I don't imagine this will be my \"hardcore\" gaming machine of choice. But, for indie titles and smaller games, this device gets it right.As it stands this is a 4-star device for me. It's insanely fast and integrates perfectly with Amazon video services (obviously). It's brand new though - let's see what is added over the next few months - Amazon mp3 integration, more games, android apps, etc. This device lays the foundation for a pretty amazing media platform, so lets hope the ongoing first party and developer support is strong. If that turns out to be the case this device will easily be a 5-star purchase.So please have an independent mind and see through the blind negativity. If possible, try the device out for yourself. If you are an Amazon media consumer you will not regret this purchase at all. Have fun!", "verified": true, "helpfulness": "24/30", "author": "mhenderson83"}, {"rating": 5.0, "review": "If you are going to rate this product one start--at least have purchased it first. I'm adding the weight of 5 stars as mine will be in the mail tomorrow and If it does not live up to expectations then I will reduce the stars, but I see no reason why I would not enjoy. I used both Roku and Apple TV in the past at friend's and families homes and this product by far has better specs and will go well with my Amazon Prime Membership.", "verified": true, "helpfulness": "17/28", "author": "Joshua Murphy"}, {"rating": 5.0, "review": "Amazon Fire TV has all popular services ( Like Netflix, Amazon, Hulu Plus ESPN  etc.)Support Gaming too.Voice Search is awesome, No other devices supports this feature.Free time feature is very useful for kids", "verified": true, "helpfulness": "8/12", "author": "UDAY SINGH"}, {"rating": 1.0, "review": "I would definitely consider this, but they need more of a channel line up and they need to carry The Blaze TV. I think in the meantime I'll stick with my Roku.", "verified": false, "helpfulness": "18/209", "author": "Mike"}]