[{"rating": 5.0, "review": "very responsive user interface, nice and snappy. So glad I cancelled cable, using time warner cable's menu system was so slow and frustrating!Back to fire tv: finding content on amazon prime was really easy, and using hulu plus and netflix was also pretty simple. Can't wait for hbo now to become available for fire tv.I haven't tried using the fire tv to view the content on my media server yet, I downloaded the plex app for it but haven't set it up yet. Will update if I have any problems with that, otherwise no issues with this product. It's super small, doesn't make any noise, and looks very modern in my media center setup.", "verified": true, "helpfulness": "2/3", "author": "Ericson"}, {"rating": 5.0, "review": "Love my Fire TV!  It is extremely easy to use and the definition is so clear!", "verified": true, "helpfulness": "1/2", "author": "Katherine Rose \"kvicr\""}, {"rating": 5.0, "review": "I ENJOY THE PACKAGE. BUT I HAVE SOME PROBLEMS HOOKING UP TO SOME OF THE LINKS WITH PASSWORD PROBLEMS.", "verified": true, "helpfulness": "0/2", "author": "Chris Bilotta"}, {"rating": 5.0, "review": "Love it, so easy to use, completes my Amazon household.", "verified": true, "helpfulness": "0/1", "author": "Ella P"}, {"rating": 5.0, "review": "Great product...", "verified": true, "helpfulness": "0/1", "author": "Eric"}, {"rating": 5.0, "review": "Very nice item I love it.", "verified": true, "helpfulness": "0/1", "author": "John W."}, {"rating": 5.0, "review": "Three words: We love it! I purchased this at Christmas last year because it was easier than plugging up my Kindle Fire tablet to the TV. You plug it in and leave it. If you buy often from Amazon, you probably already have prime. If you don't and you want to get the Fire TV… you need to get prime. Prime pretty much pays for itself with watching movies and free games…not to mention the free shipping and other quirks of being a prime member. With that being said, the Fire TV was everything I expected and more. If you have Netflix, you can access it through this. I have both prime and Netflix so I can access a kazillion movies of all genres. If you have Hulu…you can access it as well. The voice remote makes it easy to navigate to just what you want to do. I listen to all of my prime music through this when I just want to relax or even when I'm cleaning house. The music choices are great…and free with prime. I purchased the game controller so that my son and now son-in-law can play games (again, many are free). I have found myself playing them, too, which may be a negative because I get too addicted to them. Ha! I haven't had any major issues with the Fire TV. Once when it froze on Netflix I was able to contact amazon support…and the resolution to the problem as simple: unplug and  replug system. Being someone that works with a lot of technology I felt pretty stupid at that because it was something I should have figured out myself. Still, it was great being able to chat with Amazon and know that they could walk me through any issues that I MIGHT would have later. The only thing that you can't do with this unit that I would like to see as an upgrade is read your Kindle books. However, that's not a big issue for me. I love accessing other apps that allow for you to watch different TV shows (free) including the old ones from years ago (westerns, comedy, etc.). It has a special section to help you monitor what the kids are watching or doing…and will limit them from making purchases. I purchased a bunch of coins to allow us to purchase different games…. I still have a bunch left because many apps are free. One app is a Christmas countdown…which younger kids and kids at heart will love. I have not regretted my purchase at all. In fact, I'm considering purchasing a fire stick for when we go out of town and use it at hotels…and use it on TVs in bedrooms. Just make sure that your TV has HDMI compatibility before you purchase (most new TVs have that option). A friend of mine has the AppleTv…and regretted her decision. She's going to purchase a Fire TV because she loves mine. So, if you are debating between the two…consider the Fire TV.", "verified": true, "helpfulness": "3/4", "author": "BrownEyedGirl \"BrownEyedGirl\""}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "Arthur E Wallace"}, {"rating": 5.0, "review": "Love it, works great!", "verified": true, "helpfulness": "0/1", "author": "Chris"}, {"rating": 5.0, "review": "Glad that we bought this! It was so easy to install and we are really enjoying all the features. Will recommend this highly.", "verified": true, "helpfulness": "0/1", "author": "buddy'smom"}]