[{"rating": 4.0, "review": "I love the fire tv but the user interface is better on the Roku 3. The fire is fast and very easy to set up, would be nice to have voice search for all of the different services not just Amazon.", "verified": true, "helpfulness": "0/0", "author": "jason Blumenthal"}, {"rating": 5.0, "review": "Combined with the Amazon Prime the Fire TV gives lots of programming options.", "verified": true, "helpfulness": "0/0", "author": "Concerned"}, {"rating": 4.0, "review": "Very fast operating. Easy set up and operation.CONs: Not as big channel selection (even when it is enough for me) or audio in remote control as Roku 3 (I also own one).", "verified": true, "helpfulness": "0/0", "author": "Ricardo G. Platt"}, {"rating": 5.0, "review": "pleased with the purchase. Was easy to hook up and has a wide variety of movies and shows. This morning I came across a great yoga video to try out and yesterday we watched Curious George with our three year old grand daughter. Easy to access and NO Commercials!! Have not tried any games yet but plan to. Amazon Prime has been a great investment and this latest Fire TV has added to our satisfaction. I've had great service from Amazon and any time I needed to return an item the process was quick and easy. Two day shipping sure beats two weeks from other online vendors.", "verified": true, "helpfulness": "0/0", "author": "F. Roberts"}, {"rating": 4.0, "review": "Bought this item refurbished and it has worked great. Very easy set up out of the box. This thing is way faster than the Apple TV. So glad I ditched the Apple product. I'm not giving the review 5 stars because it was 3-4 days late from the expected arrival date. Most likely not Amazon's fault and is UPS's fault.", "verified": true, "helpfulness": "0/0", "author": "Trevor Ruocco"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Kevin S. Lockwood"}, {"rating": 4.0, "review": "I like the viewing options but Most of the movies you have to pay for in order to rent them and I would prefer more free options.", "verified": false, "helpfulness": "0/0", "author": "Joanne Sonderling"}, {"rating": 4.0, "review": "It would have been a 5 star except for the \"crap\" that PBS put ME THROUGH TO SIGN IN, The PBS folks reject the Amazon email and pass word--WTH! I finally was able to sign in using my Google email and pass word!", "verified": true, "helpfulness": "1/1", "author": "R. Leslie Turbeville \"novice reviewer\""}, {"rating": 5.0, "review": "i really like this item / there were some issues i tried to resolve with cust/ techsupport in programing prime music  i could not understand the person i was connected to/ is there a person that speaks good english that i can speak to with my issues  thanx jim k", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 5.0, "review": "So happy to have purchased Amazon Prime....so much is available to us", "verified": true, "helpfulness": "0/0", "author": "Donna Sonnet"}]