[{"rating": 5.0, "review": "This is so great if you don't have cable, tons of apps for cooking, fitness, movies, videos and more! Options for games to play, need to purchase controller, but well worth it!!! So glad I returned my Apple TV and got this instead. Thank you Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this great streamer. It is very simple to operate. Now I watch my Prime videos on my TV.", "verified": true, "helpfulness": "0/0", "author": "Jim Ed"}, {"rating": 1.0, "review": "I have 1.5 speed DSL but that isn't enough apparently. After spending much of 2 days on the phone with Amazon trying to get this thing to work they finally admitted it takes at least 5.0 DSL to work.  Should be noted in the required specifications so people don't waste their time.", "verified": true, "helpfulness": "5/9", "author": "Kim Lafolette"}, {"rating": 5.0, "review": "Great item my Girlfriend LOVE it and the VOICE Command is awssome", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 1.0, "review": "I have a xbox 360 so I'll be comparing this to that.PROS:Everything is much faster.CONS:It only searches amazon's selection. If it isn't free on amazon and is available on Hulu then it'll have that option. But if amazon doesn't even have it but Hulu does it won't show up.For example, if you search for The Amazing Race it show Seasons 1, 7 and 10 available for purchase for $1.99 per episode or for free through Hulu. But it doesn't show all the other seasons even though these are available in Hulu. You'd have to launch the Hulu app separately to watch them.", "verified": true, "helpfulness": "3/8", "author": "John"}, {"rating": 5.0, "review": "We are very pleased with this device.  Voice recognition is great.  So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Maestrak"}, {"rating": 2.0, "review": "This machine forces you in the prime ecosystem. Netflix/Hulu have much more variety, but you default search is prime. Voice search only works with prime. False advertised and doesn't live up to its potential.", "verified": true, "helpfulness": "1/4", "author": "Frederick Bohnen \"FB\""}, {"rating": 5.0, "review": "Better than Apple and Roku", "verified": true, "helpfulness": "0/0", "author": "Reviewer"}, {"rating": 5.0, "review": "Just ordered a 2nd one to replace my ROKU 3.", "verified": true, "helpfulness": "0/0", "author": "Sunil Prasad"}, {"rating": 5.0, "review": "LOVVVVVEEEEE ITTTTTTT❤️", "verified": true, "helpfulness": "0/0", "author": "Ontea"}]