[{"rating": 2.0, "review": "So far, it seems clever, but wants a pay per view limited youtube at 1.99 rates. I want the freedom to watch my own content. If I can get my tablet viewing on the big screen, I'll keep it, else it goes back. $2 day X 30 days = $60/mo. That is costly. No, prime is not the answer as the content switches between bouts of plenty of good free choices, then dry spells designed to get you to pay. Amazon instant video has problems, too, as the categories can't be controlled. You log in and pages of kids cartoons are presented. Um, no thanks. I want things more customized.", "verified": true, "helpfulness": "1/5", "author": "Pointofdiscovery"}, {"rating": 5.0, "review": "love it  whole new way to watch tv", "verified": true, "helpfulness": "0/1", "author": "Christopher Freeman"}, {"rating": 5.0, "review": "Got mine 2 days ago, replacing 1st gen ROKU, this is fast!! not crazy about the menu to access netflix, etc, cause they are apps. Apps are listed in order of down load so it end up deep in the Q, still, this is a must have for Amazon Prime memebers.Awesome pic and sound!! Super fast ! Will be ordering the \"stick\" soon for my \"non smart\" LED TV's.", "verified": true, "helpfulness": "0/0", "author": "Erroll C. Williams"}, {"rating": 5.0, "review": "I don't know where to begin...this is just amazing...I FREAKING love it...can't imagine anything better...I can talk to it and it listens, much better than my husband ever did !", "verified": true, "helpfulness": "1/1", "author": "skagit*"}, {"rating": 2.0, "review": "The device wont store your favorite apps in a static display and continuously rotates through recent apps. So, if you are expecting a response like Roku or other media devices you'll be disappointed. The device also has very limited storage capacity so you cannot really take advantage of the games function. It also logs me out of Netflix periodically for some reason. Finally, the voice search feature is okay but it will mostly find stuff available on Prime, not all TV networks. All in all, it was not a worthy replacement to my existing Roku device but I am keeping it to see if it improves.", "verified": true, "helpfulness": "2/5", "author": "Kvalen7"}, {"rating": 5.0, "review": "like it a lot", "verified": true, "helpfulness": "0/1", "author": "Toni Ferreira"}, {"rating": 5.0, "review": "Love the voice command lookup of possible viewing.  I have too slow a connections for seamless viewing. I start something and pause it for later. Seems to work much better later. I wish I could put something on the watch list and it would cache it. I wish there was an easy  way to set fire tv to sleep without going to settings and system then sleep.  I need to get a bigger broadband pipe.", "verified": true, "helpfulness": "0/0", "author": "KayArOh"}, {"rating": 5.0, "review": "Just the item we were looking for to help beat the high cost of cable!", "verified": true, "helpfulness": "0/0", "author": "G. Douglas Ponsler"}, {"rating": 5.0, "review": "Excellent its a lot better than other streaming devices in its price range. I recommended to every who likes amazon movie library.", "verified": true, "helpfulness": "0/0", "author": "Jose.H. Santiago"}, {"rating": 5.0, "review": "I got the fire TV because i heard so many good reviews about it. The price tag of 124.00 for the device plus a controller was worth it as this box has replaced both hulu and netflix as far as my fiancee and I are concerned.  While netflix and hulu provide their own benefits in a way, I feel that the price tag associated with their content is a bit out of touch with the average american living under the poverty line. I am enjoying the prime membership to its fullest and feel that $100 a year for such a great service is little compared to a so far endless enjoyment. The only thing id wish they would include would be more amazon fire applications that would be compatible with the TV.  I am inspired to get an amazon fire tablet just so i can take the quality and the functionality with me.If you are looking for a product that offers the same service as netflix and hulu but has a decent price tag per year.. Grab this device.", "verified": true, "helpfulness": "0/0", "author": "Jason Stockwell"}]