[{"rating": 5.0, "review": "After struggling with a Blue Ray player to watch Netflix, I finally said to heck with it and bought this gadget!  Easy to set up. Much easier and more reliable than the expensive Blue Ray player I had. This is one of the best purchases I have made this year. It offers more choices, but a manual is not included. That is the only thing I can say negative about it. It is so easy to use, that once you look through the instructions online, you do not need a manual.", "verified": true, "helpfulness": "0/0", "author": "Sue Johnson"}, {"rating": 3.0, "review": "Compared to my current streamers (WD TV Live and Chromecast), this is absolutely a 5-star product.Amazon does not hide the Android OS/Google TV ancestry, which is not a bad thing. There are many apps available from the get-go, and the interface is so easy to use my wife picked it up without me having to explain a thing (and without her watching the mandatory introduction video). It's also incredibly responsive.Once it supports HBO GO and Max GO, I'll update this to 5-stars... I'll finally have all my streaming providers coming from a single non-PC appliance!My only wish is for a force-sleep option...or a configurable timer. It currently waits for 30 min before powering itself off, which is the only way it can.UPDATE (5/10/14): Spent the evening streaming many shows... found weird behavior: Netflix streamed fine, but Prime Video had some stutter. I'm on Fios 75Mbps on a gigabit hardwired network, so it's either the hardware or Amazon's servers. Either way, you'd think their video would be one of the top performers.UPDATE (5/17/14): A week later and now Netflix is also stuttering.  Almost unwatchable.  Again, I'm on Fios 75Mbps on a gigabit hardwired network, so it's got to be the hardware.  Extremely disappointed in Amazon.UPDATE (5/21/14): Called Amazon Fire TV support.  We tried a few things with no luck.  But then - Eureka!  My issue was my 720p TV and the Fire TV's inability to auto-detect 720p over 1080p.  Once I forced the Fire TV to 720p, my Prime video no longer drops frames, and my Netflix frame drops *mostly* went away (an occasional frame drop here and there, but nothing as drastic as 5/17).  Up to 3 stars now that I'm happy again...+1 when HBO Go launches and +1 when Voice Search is implemented across more apps.", "verified": true, "helpfulness": "1/1", "author": "Count Rugen"}, {"rating": 2.0, "review": "The unit is way too expensive when compared to chromecast and roku stick.  And as I stated in the headline, MLB is not availale on it.", "verified": false, "helpfulness": "3/10", "author": "Lewis Edward Williams"}, {"rating": 4.0, "review": "The FireTV is awesome, very easy to set up and quick to get started (after update)! It is super fast and is seamless in starting programs to watch. I would recommend this to anyone with a Prime membership, it is definetly a nice perk with thousands of titles to choose from. The only downfall is it is much easier to assemble your watch list by using a standard computer to search titles. Otherwise, great buy!", "verified": true, "helpfulness": "0/0", "author": "Kaylee Owen"}, {"rating": 4.0, "review": "(NOTE: This review will be UPDATED below now that I've actually been able to both get it working AND spend some time with it in order to give it a fair shake.  See \"UPDATED\" below for any additions or changes.)As much as it pains me to say this, I tend to believe that perhaps Amazon launched this thing into the marketplace well before they should have for development purposes.  It's difficult to pen a review about a product that doesn't do what it's supposed to do, but I'll give it a go and try to represent the facts as clearly as I can.I received this item after ordering it in early April.  Excited I hooked it up to my HDTV with hopes to watch on my large screen some of the programming available as an Amazon Prime Instant member.  Shortly after living through the set-up phases (which are very, very easy so kudos there!), I detected my wireless network, connected to it, put in my passsord ... only to be informed that my password was incorrect.  (???)  Now please keep in mind, this is the exact same password that I use on my two fully-working Kindle Fire tablets, so I was a bit confused.  (No, for the techies out there, there's absolutely nothing unusual about my password choice in any estimation but for reasons that I can explain it simply will not allow me to connect to the network.)  I've also spoken with my ISP, and I have unlimited product usage in my home so this isn't an issue with either my network or my wifi router disallowing me b/c of too many instruments.  I have a top-of-the-line router as my primary responsibility is a work-at-home employee, so I'm online constantly.I contacted Amazon mid-to-late April to report the issue, and -- after three exhausting telephone calls trying a whole variety of options (including an ethernet connection which works like a charm but, unfortunately, is on the other side of the house from where I want to use the Fire TV) I was told that the matter would have to be review by Amazon's technical/design team as my box's behavior made no sense to anyone (me included).  I was promised a follow-up within seven days.Approximately 7 days later, I did receive an email, and it asked me the question regarding my password that I had already answered (and was noted in my customer service calls) three times previously.  Hopeful that there were signs of life that Amazon was well on their way to resolving this matter, I sat and waited ... and waited ... and waited ...Frustrated with waiting, I called Amazon again today (two weeks after reporting the issue), and I was told that they had extracted a data stream from my box that showed that the box WAS connected to my network but they had absolutely no explanation as to why it kept kicking me out with a prompt screen saying \"invalid password.\"  So -- as far as Amazon was concerned -- the device was connecting to my network, and now they had absolutely no explanation for why it wouldn't allow me service at the prompt.  I was today assured that the design team (is this a bad joke?) are still working on the issue as they have zero explanation for this operating glitch.In the meantime, I'm left with a hundred dollar paperweight.UPDATED:Ok, here's the thing: I've had plenty of time now to play with the Amazon Fire TV, and it truly is an exceptional piece for any home entertainment system.  Sure, the library may be limited at present, but that can always change given Amazon's exposure and command of the marketplace (no, it'll probably never be what Netflix is, but they're certainly off to a great start).  Unlike others, I've had absolutely zero problems using the voice interface to accomplish any searching; still, I would agree with others who point out that there should be a better way for Amazon to list the breadth of its library instead of -- out of 150 top series -- listing each individual season of, say, 24 actually among the top 150; with 8 seasons, that actually reduces the top 150 series to factually 142 series AND 24's 8 seasons ... but, as you look, you realize that several other shows also list their separate seasons as individual series.  That's not proper, Amazon, and I would hope you would make that adjustment.  But back to that vocal search interface?  I've found it working perfectly.The issue that I had with the Amazon Fire TV when I first got it was that it simply wouldn't work.  When Amazon's techs had me hook it up with an Ethernet connection so that they could review the performance data, they kept assuring me that it WAS working despite the fact that it wasn't.  On three separate occasions, I gave them my contact information and, on each three occasion, I never heard back from them.  Finally, I was given a verbal assurance that a member of the Design Team would be calling me to discuss the issue further, and I never heard from that person as well.While some may think it a small complaint to point out the Amazon's customer service really dropped the ball with this one, I as a consumer think it's still a pretty big deal.  Amazon, here's my suggestion: if you SAY you're going to do something, then do it.  Otherwise, all I feel at the end of this was I wasted my time trying to get further info from the vendor (namely, you, Amazon) to assist me; you really provided none.  That's why this thing won't ever get a five-star-rating from me.What was wrong with it?  All it took me to find out was a phone call to the manufacturer of my wireless router, Cisco (I used the Linksys E2000 for all of my internet connectivity, and I'd never experienced any problems with it whatsoever).  I explained the situation to the manufacturer's service representative who was kind enough to explain to me that despite what Amazon was insisting the router was NOT successfully establishing a connection back to the Fire TV because of differences in the way that unit and the Linksys router have an ongoing relationship to 'share' complex data.  Yes, the router may acknowledge that the Fire TV was, in fact, connected; but that connection would not allow any exchange of data because of the way Amazon's data is encrypted.  Hence, it was a combination of data failure between the two units ... and why Amazon didn't adequately explain this was at a loss to that representative.I get that it's new and all that jazz.  I get that it's easier to tell a customer something's working when you can't explain why it isn't working.  But if all it took was a single telephone call for me to get to the bottom of it, you'd think a department full of Amazon technicians could've picked up the phone and done the same.Again, not mincing words, I do love Fire TV.  Again, it could have a larger library.  It could give regularly updates about which titles are being removed from Amazon Prime's library instead of allowing users to figure it out on their own the next time they try to access that title.  But at first blush?  If you have all the right pieces, then you're probably in for some real fun.", "verified": true, "helpfulness": "4/7", "author": "E. Lee Zimmerman \"Trekscribbler (aka Ed)\""}, {"rating": 5.0, "review": "Love it!  Super easy to connect, setup and use.  I don't have any need for the games portion so cannot contribute any narrative as to its features.", "verified": true, "helpfulness": "0/0", "author": "JayCee"}, {"rating": 2.0, "review": "I GAVE ONE TO MY MOTHER WHO IS DOWN WITH CANCER. SHE GAVE IT BACK TO ME. SAID EXTRA CHARGE FOR PRETTY MUCH EVERYTHING, BECAUSE MOST THINGS FOR FREE SHE HAD ON NETFLEX. I ALSO GAVE ONE TO MY 28YR OLD GRANDSON WHO IS WELL EDUCATED AND HE DID NOT LIKE IT EITHER. HE DID NOT TELL ME WHY BUT I THINK HE DID NOT WANT TO HURT MY FEELINGS. I THINK IT MUST NOT HAVE ADDED TOO MUCH TO WHAT HE HAD. SO I GUESS I HAVE TO GIVE IT ONLY TWO STARS.", "verified": true, "helpfulness": "5/7", "author": "Kathy Taft"}, {"rating": 2.0, "review": "This machine is a sleek, fast, and has decent voice recognition. But without crunchyroll and many of the apps being unfinished. I've got no use for it.", "verified": false, "helpfulness": "4/7", "author": "Seth Miles"}, {"rating": 4.0, "review": "I took a strange path to my current Amazon Fire TV ownership. I bought this unit from Best Buy after reading initial online reviews from satisfied customers. I kept that unit exactly 48 hours before returning it to Best Buy to exchange it for the Roku 3. I was initially put off by the overwhelming layout that Amazon uses which places their content so far out front that it's literally hard to locate third party content. I was also unhappy with the amount of third party content offered on the device.Once I got home with my new Roku 3 however, I found the video quality on all of my favorite streaming apps were not even in the same universe as the Fire TV device or an older 1080P Apple TV unit I own. The Roku 3 video resolution in my opinion wasn't even as good as the 720P Apple TV that I also own. The audio was also thin and tinny sounding on the Roku 3 as well. So back to Best Buy the Roku 3 went. This time for a refund. I decided that the 1080P Apple TV was going to stand as my streaming device of choice.The problem with this decision that was once I hooked the 1080P Apple TV unit back up to my TV, I had to admit that while good, the video resolution wasn't as clean as the Fire TV device had been. Also the audio output from the Apple TV wasn't as good either. The Fire TV had a big, full surround sound output that caused the sub woofer on my system to sometimes rattle the pictures on the wall.Once again, I was on my way back to Best Buy. I purchased another Fire TV unit and have been satisfied since. It's just plain better than both the Roku 3 and Apple TV at this point. I also purchased the optional game controller this go around and must admit, I am pleasantly surprised at the quality of the gaming on this unit. Something that simply can't be matched by any other streaming device of it's kind or price point.Now for my problems with the device... I'm still not sold on Amazon Prime yet and have not purchased it past the 30 free trial period. In my opinion, amazon needs to do a better job at cleaning up the operating system so one can be sure as to whether they are scrolling through content that's free through Prime or pay per view. The system is currently cluttered and it's sometimes hard to determine where one thing ends and another begins. Also the absence of an HBO Go app is huge for me right now. I hear it's coming, but let's get 'er done! Another thing is the limited number of cable/satellite subscribers eligible to use the Showtime Anytime app. DirecTV is not a provider in the list?? Come on man!All in all a very good device for the price point. I believe the Amazon fire TV will only get better with age.", "verified": true, "helpfulness": "2/2", "author": "fammdw"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Joanne E Robinson"}]