[{"rating": 3.0, "review": "I like everything about the way it works! Good quality, fast and organized! My only problme is that most shows you have to pay to watch them! Even many movies and tv shows that are free in netflix! The selection of movies and shows are also some how limited too! You would think that when you pay for the service you will get all those show as part of the deal! I understand you have to pay for new movies, and shows! But old ( really old) shows!!!! Not fair!", "verified": true, "helpfulness": "2/5", "author": "Pen Name"}, {"rating": 5.0, "review": "Simply love it. It is fast. Very little or no buffering. Picture quality is great.  I only wish I could handle volume with the remote. I strongly recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Harsh"}, {"rating": 5.0, "review": "Worth the money watch it every night", "verified": true, "helpfulness": "0/0", "author": "Catalina Girl \"Catalina Girl\""}, {"rating": 3.0, "review": "If you're buying this unit for \"rooting\" purposes to install 3rd party apps then forget about it. Amazon has now blocked this feature with it's new OS 51.1.3.0. Also, I believe it automatically starts download and installing even if it ships with an older, \"rootable\" version of it's OS. To me, not being able to modify this streamer is like a car dealer selling you a new car, at full price but locking out the stereo so you can't change the channel.As far as using it as Amazon intended I still give it 3 stars. The remote voice control only works with Amazon Prime, not netflix and the Bluetooth capabilities only work with Amazon's gaming controller (sold separately). FAIL!", "verified": false, "helpfulness": "3/7", "author": "oeight74"}, {"rating": 4.0, "review": "Awesome.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent fixture I feel that all concerned and people that are craving for better use of TV \"MUST\" get and own this fixture. Since I registered for Amazon Fire, I no longer watch the Netflix site because I feel that Amazon Fire is gives you value and better education for its price.", "verified": true, "helpfulness": "0/1", "author": "Wilfred C."}, {"rating": 5.0, "review": "only  thing against it would like  to get TV series  soonier", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"homie123\""}, {"rating": 5.0, "review": "Question: Can I open up and view websites from the internet?  Some TV shows are only shown for free on the channel website.  Right now I have to use my computer but would like to use one of these streaming boxes to view internet sites.  (I do not own this, I'm researching first).", "verified": false, "helpfulness": "0/2", "author": "M Grace"}, {"rating": 2.0, "review": "Too many glitches. And to slow.", "verified": true, "helpfulness": "1/5", "author": "alex"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "omar sufi"}]