[{"rating": 5.0, "review": "Hottest Item on the Market - Good Bye Apple TV!!!", "verified": true, "helpfulness": "0/0", "author": "Jerrell L Vaughn"}, {"rating": 5.0, "review": "Love it!  No problem to set up.  I have it tied in to my Logitech clicker, so turn it on separately and select movies using the Fire TV clicker, and use Logitech for volume, etc.  It did a good job recognizing my voice command for a movie title.  Great movie selection to choose from.  My wife, who just doesn't get along with hi-tech, has nevertheless found it possible to use this.  We are totally pleased with Fire TV - so glad we bought it.", "verified": true, "helpfulness": "0/0", "author": "CDG"}, {"rating": 5.0, "review": "My husband and I bought this because we didn't want to buy cable and I already had an Amazon Prime account. This purchase has been great. We have not had any other system i.e. Roku, chrome cast, or apple tv so I am not sure how it can compare. The voice search has been accurate. I like how the Amazon team set it up so you can look at items that are on Amazon prime vs items that you have to pay for. We use it every day and love it.", "verified": true, "helpfulness": "0/0", "author": "SpencySpence"}, {"rating": 5.0, "review": "An Apple product user, we found this to be really superior to Apple TV in many aspects.  We have a Prime account, though use Apple TV in our main room, so got this to take advantage of catching up on some TV series we don't DVR or watch normally.  The sheer speed, simplicity of use, and range of content is what surpasses the Apple product.  We don't have music or photo content stored with Amazon, yet still can take advantage of using the connection to our home Mac to pull content.The remote is very understated and higly versitle since it is RF, no need to have the box in the open.  The voice search is highly accurate as well.  Not more more to say other than this is a top notch TV content box that can supplement cable/satellite, unless you just want to pull down OTA digital and use this as other programming.  Job well done on this one Amazon.", "verified": true, "helpfulness": "1/1", "author": "VAHeel93"}, {"rating": 5.0, "review": "I love it,, I get to watch different movies and also from Netflix.. very happy person!", "verified": true, "helpfulness": "0/0", "author": "charolette koerber"}, {"rating": 4.0, "review": "Love it! Better than my Cromecast. Can even use my XBOX controller with it for gaming. Just wish it had HBO GO. 1 star off for that.", "verified": true, "helpfulness": "0/0", "author": "PrincessEm2014"}, {"rating": 5.0, "review": "Works perfect.  Even a non-techie like me can sort through and watch movies but I am disappointed in the quality of the offerings.  Have tried to find \"funny\" and got some seriously unfunny films.  No fault of the device.  Easy to install and make work.  Voice search is a great feature and really works well.  Am wondering if this device is needed and how it will interact if I buy a Fire 8.9 HDX tablet.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love this product, all you need is to connect it and that's it, no configuration needed other than to connect to your wireless network at home.  I travel with it and use it in hotels and can access all my stuff and movies (much cheaper than renting from a hotel).  A great buy.", "verified": true, "helpfulness": "3/3", "author": "Penelope Hampton"}, {"rating": 4.0, "review": "I got this for my main entertainment system as I had Chromecast but moved it to another TV in my house. Haven't played too much with the voice on demand system, just don't really need it. I listen to TuneMeIn and Pandora a lot in my home so use it for music almost more than TV shows but I do use the Amazon Prime viewing and Netflix", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great! Love it!", "verified": true, "helpfulness": "0/0", "author": "Nicole"}]