[{"rating": 5.0, "review": "Love it - was super easy to install and worked perfectly. Can't ask for more in my book.", "verified": true, "helpfulness": "0/0", "author": "Laura Cooksey"}, {"rating": 5.0, "review": "Bought this with replacing cable TV in mind. The unit was easy to setup and worked immediately, love it! Using Amazon Prime, Hulu Plus and Netflix for about $30 a month I get better viewing selections than with my preferred cable subscription. I will compare them for another month, but expect to drop my ties to the cable box in March and save more than $70 a month with a significant improvement in viewing content with the Fire TV.  Obviously I will have to keep my high speed internet connection, but I won't miss the hundreds of cable channels filled with mind numbing reruns and \"reality\" (in what universe?) TV.", "verified": true, "helpfulness": "0/0", "author": "D. Richner"}, {"rating": 1.0, "review": "If you want to watch a movie on this piece of,all you will see is buffing on screen.Called amazon said that they are up dating the software and they would call me back to see if its working,still waiting for call back and still buffing.Don't purchase this piece of .", "verified": true, "helpfulness": "0/1", "author": "Jeffrey Martens"}, {"rating": 5.0, "review": "It has worked perfectly. The thing I like the most is that is an independent device, doesn't need my computer or phone to work. Image quality is excellent.It's beautify designed, and it looks good on the tv set.Things I like:* Small form (it's not small as the Fire Stick or ChromeCast but is still a small form)* Voice commands work surprisingly good, it recognize my accent very well. If not it will offer you several options to choose from. (barely use it but when i do, it works so... yeah a plus right there)* Several apps to choose from.* Amazon Prime VIdeo works like a charm, obviously is focused on this service but Netflix works excellent too, also other apps like Hulu.*Ability to install apps outside the Amazon Appstore, giving several opportunities to to whatever you want. (maybe this one is the biggest one)*It's fast and interface is nice, not the best but nice for a device like this.* Spotify connect (this one needs your phone to stream music)* Optical audio out, a must if you have a custom audio setup, its also nice if you don't have one right now but maybe in the future you will.Don't like:* Sometimes the remote controller lags a little bit when my internet connection is very weak.* As a positive thing I said that it doesn't depend on your pc for functioning, but sometimes i want to stream something from my pc but i don't know how to do that.(maybe this one is my bad)Also, i wanted to note that its system openness offers lots of options for people who like to thinker around and expand capabilities, obviously that must be done by someone with knowledge on the subject or you'll damage the system.Edit:Forgot to add, before this device i had the Chromecast which i think is really good, but limited, it's obvious that they are not in the same price range or league. but I got tired of the Chromecast dependency of other devices, I'm always with my cellphone battery low so... that gave me several headaches... also i just wanted something that's ready to work instantly. This is more of the needs you have or matter of taste. This Fire Tv is the right for my needs.", "verified": true, "helpfulness": "1/1", "author": "Ched2k \"Ja\""}, {"rating": 4.0, "review": "Voice search is great and processing speed is fast. Sometimes the remote is too sensitive and will go too fast when using the navigation buttons. Also the box stays on and it gets hot.", "verified": true, "helpfulness": "1/1", "author": "Deborah Bennett"}, {"rating": 5.0, "review": "Love it.......!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "cherise"}, {"rating": 1.0, "review": "Has an unusable USB port! This company STILL has not updated this! Why have a port that literally can do nothing?  Save money and buy ssomething else if you desire to plug a storage device into a usb port in order to show pics, documents, or videos", "verified": true, "helpfulness": "2/6", "author": "S. Conley \"pitbull\""}, {"rating": 5.0, "review": "My wife loves her kindle fire, I got her the new Fire HDX and Fire TV for Christmas. She loves them both and we spend alot more time watching prime movies in our bedroom this way rather than through the xbox in the living room.", "verified": true, "helpfulness": "0/0", "author": "MBC"}, {"rating": 5.0, "review": "So much easier to find what we want to watch by talking to remote.", "verified": true, "helpfulness": "0/0", "author": "Sheri"}, {"rating": 1.0, "review": "I plugged it in and did the set up.  I return five hours later to watch it and the system either will not turn back on or the power supply failed.", "verified": true, "helpfulness": "1/2", "author": "Marc Perrone"}]