[{"rating": 5.0, "review": "Love it. Cut the cord and start saving money today. Combine this with amazon hd antenna and amazon tv recorder and you can still watch almost anything you want for a quarter of the price.", "verified": true, "helpfulness": "0/0", "author": "dan"}, {"rating": 5.0, "review": "Nice product, does what Amazon says it will do.", "verified": true, "helpfulness": "0/0", "author": "David L. Long"}, {"rating": 5.0, "review": "Perfect if you need something for streaming. Smart and simple.", "verified": true, "helpfulness": "0/0", "author": "M. Smith"}, {"rating": 4.0, "review": "What a great box. It works fantastic. It would be great if there could be additional applications available for the Fire TV. It is worth the investment.", "verified": true, "helpfulness": "0/0", "author": "Satori"}, {"rating": 4.0, "review": "Wish you would added more of the current movies for Prime.", "verified": true, "helpfulness": "0/0", "author": "Josette"}, {"rating": 5.0, "review": "I love my fire", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 5.0, "review": "I love it. Very easy to set up. I use it mostly to watch  Netflix or Hulu on my TV so it serves it's purpose. Exactly what I was looking for!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "We're long-time cord cutters who have been using a Roku 3 for the past year and have been eying the Amazon Fire TV since it was originally announced. When it went on sale, and then Amazon partnered with Sling TV to offer an additional promotional discount, we didn't hesitate. We were really excited to be upgrading to an Amazon Fire TV.What a disappointment. This thing is terrible, and we'll be returning it. The quality of streaming is much poorer than the Roku 3, even on identical services, and rather glitchy (sound out of sync with video, for example). Apps are of much lower quality and frequently crash. The voice search is fun, but only works with Amazon of course, so isn't really practical if you make use of multiple services. The box is also physically much bulkier and heavier than the Roku, making it more difficult to mount without purchasing additional accessories.We really wanted to love this device -- we even had taken down the Roku, removed the batteries from the remote, and packed it all away thinking we wouldn't be using it anymore! But the Roku is coming back and the Fire TV is being sent back. This device needs a lot of work before it'll be ready for prime time.", "verified": true, "helpfulness": "2/3", "author": "neil1892"}, {"rating": 3.0, "review": "For 2 months I had intermittent signal from my WI FI making using this device almost if not impossible,.hours and hours on the phone with my internet provider and alternately amazon fire box tech support turned up nothing wrong,until 8 weeks into this disaster a tech support person from amazon told me that the settings on the modem needed tobe changed and what changes those were. I was able to get comcast to do that with and for me. it has worked perfectlyever since. Why was it so hard to get this information. I talked to dozens of people before this one person knew what was wrong.he told me it had happened to him to and he Knew the \"Fix\", and he did or I may of never gotten this to work.no other wireless device in my home had a problem EVER, and the signal was Very good. but my wi fi setting was blocking the fire boxpossibly as a threat.", "verified": true, "helpfulness": "1/1", "author": "Anita Danielson \"MsAnnasbooks\""}, {"rating": 4.0, "review": "Great little product.  User interface is better than the Roku, The screen resolution is better than the Roku, The buttons on the remote are more responsive than the Roku, The build quality seems better with better internals than the Roku.  It just seems to have better overall quality and functionality than the other options currently on the market.  The only downsides are that it has fewer channel options than the Roku (including channels that offer older shows like Hogan's Heroes or The Addams Family) it seems like the apps that can be put on it are more geared toward games than watchable stations (which i assumed would be the primary purpose of the unit), and that the option of speaking into the remote to find movies or shows only brings up results that are Pay-To-Play instead of a mix of results including those that are in your app catalog that are free or from services that you already pay for (like Showtime, HBO, Netflix, or Hulu).One last thing, downloading apps on the product could be made a little more streamlined like on the Roku system.  having to go through three separate pages just to do one app, then having to go back 3 pages just to get to the list is a pain, especially when putting on multiple apps.  if there was a one click option on the search list, it would be a lot easier.", "verified": true, "helpfulness": "2/2", "author": "Sean"}]