[{"rating": 5.0, "review": "This is a really cool device! Well lets see. I bought this to think about cancelling my cable provider all together, but i cant. You still need your cable/satellite provider to get an activation code to watch different programs such as the History Channel, CBS, and much more. I have sent this this information already and there is still some work that needs to be done with it, but its still a good device. It is NOT good to be connected to your Xbox One. When connected to the Xbox One, it does slow down 'a lot' and gets very annoying.  When the HDMI cable is connected from the Amazon Fire TV directly to the TV itself, then it works very good! working at a high speed and resolving my frustration i had when i had it connected through my Xbox One. Watching a small set of movies does require to rent or buy IF its not part of Amazon Prime. TV shows does require a activation code to your cable/satellite, and which still requires you to keep your cable/satellite provider for the basic channels. Using this can lower your bill quite a bit to only keep the basic channels to convert it to the Amazon Fire TV where you can also watch mostly free movies, series such as Star Trek Enterprise and others.Overall its a great buy to watch movies, play games, listen to music, look at photos, and still needs some work on TV programs that still require a cable provider. It MUST be connected to the TV directly to work at its full potential at good speeds, and NOT to be connected through the Xbox One. It still needs some work for the TV programs that require a activate code for every program you want on your Amazon Fire TV, but its still a great buy and its a must to get! the voice works very well i must add. i just say what movie or show i want to watch, and it comes up. I dont have to say 'search for' or 'find'...just say your show or movie and there it is!", "verified": true, "helpfulness": "1/1", "author": "Ray A."}, {"rating": 2.0, "review": "I thought that fire tv would save me from a cable bill every month but it's not like that. You spend more money on fire tv than cable I know this was a mistake for my family now, you don't get news or anything. Lucky you can buy Netflix and WWE..Fire tv is not good for single parent", "verified": true, "helpfulness": "0/4", "author": "Latricejohnson"}, {"rating": 5.0, "review": "Great,  helped or streaming issues we had with our Sony\"smart\" tv", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "\"Connected with problems\" and no way to determine what the problem is!", "verified": true, "helpfulness": "1/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Im really getting to love this", "verified": true, "helpfulness": "1/1", "author": "rob"}, {"rating": 3.0, "review": "Amazon fire continues to exceed my expectations.  I am really enjoying the control that I have with my viewing and game choices. I have only had this system for 6 days, and I have already decided to join amazon prime.", "verified": true, "helpfulness": "2/2", "author": "K. L. Roberts \"KLR\""}, {"rating": 3.0, "review": "Too much buffing going on to download a movie. Maybe its our wifi.", "verified": true, "helpfulness": "1/2", "author": "Trudy Gordon"}, {"rating": 2.0, "review": "Although there are some neat features I'm very disappointed in the amazon prime selection for movies & I cannot search the internet in a browser that I have found. Its not easy to figure out the share between kindle fire & tv", "verified": true, "helpfulness": "1/3", "author": "Beth Laborte"}, {"rating": 5.0, "review": "Great user interface.  I was very impressed with the overall user experience.  The voice search function is awesome, very accurate and a big bonus to overall features.", "verified": true, "helpfulness": "2/2", "author": "Dare 2 Live"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "2/2", "author": "Scott Marcus"}]