[{"rating": 5.0, "review": "Worth it! We dropped cable and just use this.  So many things to watch.  And being a Prime member has so much added benefit.  So glad I'm not paying that cable bill anymore!", "verified": true, "helpfulness": "0/0", "author": "Lisa Resciniti"}, {"rating": 5.0, "review": "It's sleek and fast.  I rooted it an installed Kodi.  That was super easy to do.", "verified": true, "helpfulness": "0/0", "author": "C. Strock"}, {"rating": 5.0, "review": "love it.  works great.", "verified": true, "helpfulness": "0/0", "author": "Thor1973"}, {"rating": 5.0, "review": "My family and I are very pleased with the product. Easy to operate.", "verified": true, "helpfulness": "0/0", "author": "marjorie bowden"}, {"rating": 5.0, "review": "Awesome device.I wish Amazon would have better layout and browsing capabilities, such as Netflix'sBut I'm very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Mahmoud."}, {"rating": 5.0, "review": "Amazon TV....helping to replace the cable company and their over inflated bills.", "verified": true, "helpfulness": "0/0", "author": "Diana L Jack"}, {"rating": 5.0, "review": "Nice I really like the Fire TV fast steaming, Bought two.", "verified": true, "helpfulness": "0/0", "author": "Larry J. Moya \"The System Man\""}, {"rating": 1.0, "review": "2 out of 4 that I purchased failed to boot", "verified": true, "helpfulness": "1/3", "author": "Thomas Njuguna"}, {"rating": 3.0, "review": "Has never worked correctly. I have to unplug it every time I'm done watching to ensure that I have no problems when I want to watch again. I'm now having trouble with the pause feature. Sometimes it works and sometimes I have to keep playing with it. I would have returned it but I couldn't figure out how and there was no phone number to call to talk to a customer service rep. I even bought the book to help me but it was useless and a waste of money.", "verified": true, "helpfulness": "1/2", "author": "Sandi Ashton"}, {"rating": 5.0, "review": "I looooove my Amazon Fire TV!!!  Bought the box, then two sticks and plan on buying two more sticks!  One of the best investments I have made in awhile.  It has allowed me to seamlessly cut my satellite cord!", "verified": true, "helpfulness": "0/0", "author": "Angela Whitecotton"}]