[{"rating": 5.0, "review": "I really love this item. I am writing because I got this for Christmas and now it is on sale $20 less. Does Amazon follow the within 30 day purchase match, when something comes on sale within that time the purchaser can get a credit for the difference.", "verified": true, "helpfulness": "0/1", "author": "Timothy Cheatham"}, {"rating": 5.0, "review": "So much more then I expected and I do have the Prime for the year (originally for shipping) but it amazed me how many movies music and so much more for the Fire TV... I am a very happy man... And my grandchildren love it too I am going to get the remote game control for them this week... They will have a blast maybe I will even try a few when no one is looking...", "verified": true, "helpfulness": "0/0", "author": "Roy P."}, {"rating": 5.0, "review": "Easy to set up. Easy to use. What's not to like?", "verified": true, "helpfulness": "0/0", "author": "Ryan G"}, {"rating": 5.0, "review": "Great graphical interface , good applications and superb streaming capabilities...Really an excellent device !", "verified": true, "helpfulness": "0/0", "author": "Alfred"}, {"rating": 5.0, "review": "good prodcut", "verified": true, "helpfulness": "0/1", "author": "mark a.  nowell"}, {"rating": 4.0, "review": "It is pretty good and it has a good choice of movies, it also has the most well renown music apps. One thing that would be awesome is that it  could have internet browser or at least connection with different devices out of Amazon ones.", "verified": true, "helpfulness": "1/1", "author": "Gilberto flores"}, {"rating": 5.0, "review": "Easy to install. The voice activated remote is amazing! I love watching movies, TV, documentaries, etc., on my TV instead of my Kindle. I am going to order another one for my bedroom television. I no longer feel hostage to cable companies.", "verified": true, "helpfulness": "0/0", "author": "Lynn Ellen Martin \"LEM\""}, {"rating": 5.0, "review": "absolutely love the fox fire tv can watch  so many movies it does everything  it says and more. is so worth the money  would recommend to everybody specially if your in area where you dont get cable  you can watch 1000's of movies for  free and  being a prime member  i get  can  get movies  as well cheaper.and downloading music and can  take photos and put hem on my tv through the fox fire  am gonna invest in game controllers next so  when i find games i really want to play i can  highly recommended to all very easy to set up and you can set up parent controls as well how much tv  time you want for your children to watch tv  this is  absolutely a must have lil box lol", "verified": true, "helpfulness": "1/1", "author": "stacey"}, {"rating": 5.0, "review": "Love!!!! Fire tv", "verified": true, "helpfulness": "0/0", "author": "tina doogan"}, {"rating": 5.0, "review": "I love this.", "verified": true, "helpfulness": "0/0", "author": "kelly whitehead"}]