[{"rating": 1.0, "review": "If it won't play movies stored on your home network, it is useless.  Streaming form the internet is only a small fraction of what I watch.  Most video, of interest, must be downloaded to be played.", "verified": false, "helpfulness": "13/35", "author": "TUHSD"}, {"rating": 4.0, "review": "I have or have used pretty much every streamer out there. This is my opinion of what this unit is all about.1 - Selling amazon content, everything about the unit is directed to amazon content, the voice search only gives amazon, the menus all show mainly amazon content, etc. It is not unexpected, apple shows apple content. But it will be nice if they add the other apps into the voice search etc. because it is a sweet option.2 - It is fast, smooth and a great box to use. Menus are fast and the app support should grow quickly. Amazon video is as advertised, FAST almost immediate start on everything I watched, and the quality looks great. They need more 5.1 contentNetflix seems to have more 5.1 on the same content. But for Prime members this is the box to have.3 - No DTS No 24p No bitstream of HD audio (PLEX) or even surround at all on plex, but they are working on it.4 - You can use the MOGA controllers, and they work great. If you have a android phone get the mogo, you can use it on bothand the pro is the version to get.5- I really like the box, it needs a little help.Netflix is the old ugly interface?? this box just came out and has the old interface from 6 months ago?? Not sure why?VUDU needs to be on there , or amazon needs to join Ultraviolet. A lot of the movies you buy have the codes, and people have large collections of them, it is nice to have them on your streaming option. I know it is kind of competition to amazon but so is netflix.  If amazon used ultraviolet then it would be fine as well.HBO GO needs to be added, it is killing them without it. the other options have it and it is a huge omission. But that is a 2 fold issue anyway. Like showtime, it is up to providers to offer it, right now showtime app is useless to a ton of people as well, no direct tv, or cox, or many other subscription allow use on the fire tv. Even if it had hbo go, with this limitation it is useless to millions anyway.And Music?? This one baffles me?? Amazon box with no access to your amazon music collection etc.6- PLEX, It looks nice the app works but no 5.1 anything yet. Just 2 channel audio. they are working on the fix, and should be soon.7 - Apple TV , If you have apple content and tied to apple IPhones tablets etc. it is the best option. The airplay access to content etc.  Apple tv is the best option for apple users, no big surprise. HBO go, but no vudu and never will. Used to not be a big deal but most movies now are not including itunes copies, just ultraviolet. So itunes or amazon for content?? But amazon at least has the option to use other content with apps, etc. Apple is closed content as of now.  But airplay does open up plex options etc. For the apps that can use it properly.8 - ROKU 3 , Roku is nice, tons of content, etc. But to me it is just not polished, The apps look terrible to me, not hi-res,etc. But is works, Plex, hbo go,Vudu it pretty much has everything, just not as fast or elegant as the other options to me.This box had potential to be great, the interface is nice, it is very fast, for prime members it is awesome. But they need a little more. Which I am sure they will get, it has only been out not even a week so there is nothing but upside from what I can see. The only thing that may sway me is the android tv. Open platform, should have all the apps, etc.Time will tell but amazon PLEASEHBO GO and SHOWTIME with access from more providers, right now it is pretty bad.VUDU or join UltravioletVoice Search across apps, Like ROKU does but with your sweet voice option.But KUDOS so far a nice entry into a crowded arena.", "verified": true, "helpfulness": "16/16", "author": "KEVIN M PUMPHREY"}, {"rating": 3.0, "review": "UPDATE:  Warming up to the device.  It IS definitely faster than the Roku, although we're keeping both so we can go to those channels that Amazon Fire does not have (i.e., Weather channels, Livestream, Free Speech TV, SkyNews, etc.). And on Sunday, Netflix wouldn't load, so I just hopped over to Roku.  One thing that would have made Amazon Fire TV a HUGE hit, and taken it head and shoulders above the two other major streaming devices would be a built-in web browser. Can't find any simplistic instructions for side loading a web browser(even if can even be done on the Fire TV)for the one who is not a super geek - just a minor geek.  That would be a selling point that would blow the others out of the water.  Are you listening Amazon?END OF UPDATEPerhaps Amazon shouldn't have launched their product until they have a much more competitive product.  I am a big Amazon supporter - especially customer service - however, this is not their best effort and even though I have a Roku 2, at this juncture I am inclined to purchase the Roku 3 and return this device.PROS:It is fast, when it comes to Amazon streaming and the initial functionality of the interface.Has potential, but definitely not there yet..CONS:Way too few apps (channels).Mixing regular apps (channels) and gaming apps all in one category is annoying.  They should be separated out so that if one does not do gaming, one doesn't have to scroll through them just to find movies or shows or non-gaming \"channels.\"They don't even offer a Weather app, whereas Roku has two, Weather Nation (free), and Weather4Us (one time charge of $3.99 for life).Navigation and location of channels is not nearly as user-friendly as Roku.  Not being able to easily search across all platforms is a definite negative, compared to Roku's searching ability and organization of channels.Combining all Amazon streaming movies and television shows and not separating out Prime selections is a big thing.  Roku's interface for Amazon streaming is head and shoulders above Amazon's!Perhaps if you have never had another streaming device it would be okay, but for now, my money is still on Roku unless something is done to remedy some of the major issues I have with Amazon Fire TV.I wanted to like it ... I really did ... but there is nothing about it that is compelling enough to keep it - not yet, anyway.", "verified": true, "helpfulness": "10/14", "author": "SeaGail \"SeaGail\""}, {"rating": 5.0, "review": "I love the product very much! The only thing I wish is that the voice search worked within apps. But if you mostly use Amazon to rent and buy videos, then you'll be fine. I love the product - the size is great and the remote is sleek. Please add more apps!", "verified": true, "helpfulness": "0/0", "author": "K. Summers"}, {"rating": 2.0, "review": "I have been a Roku 3 user since it came out.  It works great and the picture is flawless.  I was interested in this new product, but was just amazed to see that they don't support HBO Go (but they do support Showtime Anytime).  Regardless, until this product supports HBO GO, it just has no appeal to me.  Also, I do NOT want it to show favor to its own service (Prime).  I do have Prime, but it is not the end all, be all.  Come on Amazon, get it right the first time.  Disappointing.", "verified": false, "helpfulness": "6/24", "author": "Robert Hornbeck"}, {"rating": 5.0, "review": "I have had a streaming Sony blue-ray, Roku and the Vizio thing and this outshines them all. From the beautiful packaging to the super fast and sleek user interface, I feel like I have found a streaming media player to complete me!", "verified": true, "helpfulness": "1/1", "author": "Anthony N \"Anthony N\""}, {"rating": 2.0, "review": "No YouTube and no meta search. If there is a free movie on Netflix it will direct you to the $2.99 version on Amazon... a little tricky whereas ROKU will list every vendor of your selection, regardless of price. Conflict of interest?Sleek, sexy and a little disappointing.Bill Kelly", "verified": true, "helpfulness": "9/18", "author": "William Kelly"}, {"rating": 5.0, "review": "Pros: - it works with my xbox 360 wireless joystick - it works with keyboard and mouse - there is ADB option which is awesome! It means you can run ANY android app on it. I was able to run:  - DLNA  - MX Player to play content from my DLNA server  - Play emulator games with xbox 360 controller using droidemu [...] and download games right from TV using DroidEmuROMGetMore details about uploading apk to your firetv could be found here: https://developer.amazon.com/public/solutions/devices/fire-tv/docs/installing-and-running-your-appCons:  - do not see so far! Great android device for a great price!", "verified": true, "helpfulness": "6/6", "author": "Maksym N."}, {"rating": 3.0, "review": "It only recognizes voice for amazon prime.  They should have been more open about it. Otherwise it appears to play well", "verified": true, "helpfulness": "3/7", "author": "Fran Weiss"}, {"rating": 2.0, "review": "It's a simple decision for me.  No HBO-GO means no deal.  If Amazon can add that, I'll be all in.  If not, it's Roku.", "verified": false, "helpfulness": "3/17", "author": "Amazhopper"}]