[{"rating": 3.0, "review": "its definitely not what I expected. Most shows are not even available and for $99 I paid for this piece of shit and the $99 im about to get charged for the service, I was hoping to get more free media but I guess amazon is just a money whore", "verified": true, "helpfulness": "0/3", "author": "esteban"}, {"rating": 4.0, "review": "I really like the Amazon tv. It's what I had expected and more! There's much more that Amazon tv offers than I though and I'm really enjoying it!", "verified": true, "helpfulness": "0/0", "author": "Alicia"}, {"rating": 4.0, "review": "I honestly do like the concept. But I have concerns: Can I record movies and TV programs for later watching? If I get a TVO can I record as many programs as TVO will let me? Can I finally get rid of my cable network? I am paying now over $150.00 a month for what I con ceder way over pricing. I am a 72yr old Veteran and would like to get it better. I love Amazon's features and all the services that I have used so far. THANK YOU AMAZON !", "verified": false, "helpfulness": "2/3", "author": "Larry Maddox"}, {"rating": 5.0, "review": "I love it.  Would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "It's a great media player very easy to navigate through very quick at buffering media just wish it had support for a flash ddrive", "verified": true, "helpfulness": "0/0", "author": "karen"}, {"rating": 3.0, "review": "its ok, but:-There is absolutely nothing to view on it when you first receive it. I had great trouble downloading any apps as I use a VPN to access UK television. switching this unit to Amazon UK was easy, getting the apps was not, as Amazon UK only allows downloads with a UK credit card billing and shipping address. My CC is with an overseas bank.Finally got it sorted but found my internet speed, even though between 2 and 4 meg is not enough to view anything without constant buffering, making the unit unusable.still looking into how to stop the buffering, even without the VPN it is the same, yet I can stream perfectly on my laptop the same things with no buffering.", "verified": true, "helpfulness": "0/1", "author": "Darryl Jackson"}, {"rating": 5.0, "review": "I use this thing everyday! I love it! it's especially beneficial if you're an amazon prime member, which I am. the apps are fun too! Awesome!", "verified": true, "helpfulness": "0/0", "author": "Jesse M. Lara"}, {"rating": 4.0, "review": "It was difficult to contact a real person with set up question, ie. could not find a phone number.  Once I did the persons were very helpful.", "verified": true, "helpfulness": "0/0", "author": "mort's place"}, {"rating": 5.0, "review": "Love it lots of fun", "verified": true, "helpfulness": "0/0", "author": "brenda shelburg"}, {"rating": 3.0, "review": "The fire tv works great for amazon content. I use it mainly for amazon video on demand, Netflix, pandora, and YouTube. Lately I've been having trouble with pandora and YouTube, the won't load, take a long time to load, or are just constantly buffering. I get that amazon want you to use there services, but I like to use other apps, besides I purchased there product so I expect it to work as advertised. I don't dislike the fire tv,it's fast and works well for there apps. I also enjoy playing some of the party game with friends. I have yet to find a streaming player the does everything I want flawlessly. I've had several Google tvs and am currently using a cromecast on another tv. If you want to use a lot of non amazon apps this isn't for you. If you like the amazon experience then this is a great device.", "verified": true, "helpfulness": "0/0", "author": "Bill"}]