[{"rating": 3.0, "review": "Bought the Kindle Fire box to replace an older RCA box. Much faster and nice voice search feature. Wanted to access  Free Prime  content but had trouble.... seems you have to mine real deep past several layers of pay options first. So as not to err and pay for something I  turned on all limited settings (child locks). It would be great if Amazon developed a Prime setting just to access Prime member benefits.", "verified": true, "helpfulness": "0/0", "author": "el8"}, {"rating": 5.0, "review": "We have two smart tvs in the house that are idiots.We have assumed that the reason was the fact that the TVs were far away from the wireless router.With Amazon Fire TV we have never suffered any programs with connection issues.Not needing line of sight for the remote is cool.....voice control that actually works, priceless,", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "We're very techy at our house and have many other devices to stream content on; from tablets and smart-TV's and BluRay players to PCs and Chromecast dongles. You name it we've likely tried streaming/viewing content on it. (we're cord cutters so no cable TV for us)After getting a Chromecast the $99 price seemed very high, comparatively. I received a promotion for $20 off and thought \"why not give it a shot?\" we're big fans of Amazon Prime in all its various glory.First thing: unboxing. Normally I wound't say anything about this but the packaging was really awkward to get the unit out of. Had to flip it upside-down and let it fall out. Then the protective films were oddly frustrating and then: no cables or connectors other than power. Being a geek household we had every one needed (HDMI, Ethernet, Optical) but it goes a long way when a company includes those cables when you get their product... especially at a $99 price point.Then, the bane of my existence (hyperbole of course)... there's no \"Start from the Beginning\" for all the Amazon Prime content!! How could the interface (which is otherwise fantastic) not have that feature?! I have many purchased-TV shows and movies and what happens when I want to sit down and start them over? Go into them, at whatever previous scene, and then rewind? 98% of all other interfaces have a \"Start from Beginning\" button. This box badly needs that. I beg you Amazon.Otherwise, the interface is really very snappy, the UI is very clean and pretty (the little lens flare that goes over each title when you highlight it is a little irritating) everything is intuitive and the pre-load means the whole streaming experience is made that much better. Not to mention the picture quality. I don't know the exact specs are but compared to console-streaming and even streaming over a nice BluRay player (ours anyway) the picture is absolutely fantastic.Glad we have it at the price-point we paid, but looking forward to the UI update to include the restart show/movie button.UPDATE: there's now a watch from beginning button! Also, the addition (or i missed it in the beginning) of playing Amazon digital music. Brilliant! Full stars ahead!", "verified": true, "helpfulness": "1/3", "author": "T. Durden \"Do I know me?\""}, {"rating": 5.0, "review": "I simply love my Amazon Fire TV. I It brings my Amazon streaming world straight to the big screen (my 48\" TV).LOL!", "verified": true, "helpfulness": "0/0", "author": "postcrdprincess"}, {"rating": 5.0, "review": "I am a Amazon Gal in a Amazon dot Com world! Unbelievable clear and sharp images at my fingertips.  The AFTV was easy to attach to my set and powered up before I knew it was ready to work.  I have enjoyed selecting the various programs that fit my mood.  I highly recommend AFTY to any one considering a streaming device. Only one  caution, careful of binge watching on programs you have missed. :)", "verified": true, "helpfulness": "1/1", "author": "nanal1430 \"Mich. Nana\""}, {"rating": 1.0, "review": "Did not work with our Internet service. We live where we can only use wireless Internet through VERIZON.  So sad it didn't work.", "verified": true, "helpfulness": "4/5", "author": "Jahn Smylie"}, {"rating": 4.0, "review": "I've had the ROKU, Apple TV, Chromecast and now this and they're all about the same. I'm not real crazy about the interface but sound quality is great.", "verified": true, "helpfulness": "1/1", "author": "Charles Donald Shader"}, {"rating": 5.0, "review": "absolutely love this. haven't figured out everything yet (still looking for all the \"channels\") and very much wishing they had the Mhz network but other than that... I cancelled cable and am happy with this.", "verified": true, "helpfulness": "1/1", "author": "Sable Jak"}, {"rating": 1.0, "review": "I just received fire TV and set it up. It will not work for more than five minutes. It keeps telling me that I have less than a megabyte of bandwidth. However when I check it, I have over 15 MB. I spent an hour with their service department and no one knows anything. Save your money and go with AppleTV.", "verified": true, "helpfulness": "1/3", "author": "Michael Ryan"}, {"rating": 4.0, "review": "Bought this for my husband for Father's Day. Super Easy to set up, love the walk through. Voice command is my favorite feature. We need an additional cable to connect to our older TV in the living room, it would have been great to have a headphone jack as we could have connected easily then but works great on HDMI equipment. Will be even happier when Prime Music is rolled out to the Fire TV to save switching back to the PC to stream the free music.", "verified": true, "helpfulness": "2/2", "author": "Kathryn Tate \"Britsh reader overseas\""}]