[{"rating": 5.0, "review": "Getting use to it.  Finding my way around.  I got fed up with the high cost of cable TV, bought the Amazon Fire TV, brought the cable box back, and now viewing so many new things.  My friends have been coming over to see it and move around the different things Amazon Fire TV has to offer.  Two were impressed enough to purchase Amazon Fire TV too.There is no local news so use my computer for that.  I have yet to figure out how to get the football game live.  I hope that both of these things will be taken care of soon.", "verified": true, "helpfulness": "0/0", "author": "hvmcw"}, {"rating": 4.0, "review": "I like the devise ok, it's the cost to operate. No where does Amazon tell you before u buy what the cost to watch TV or movies is $1.99  --2.99 to watch 1 episode of TV if it's not under Prime and that cost 99.99 a yr. and much more to catch a movie. I would never have bought it knowing the price I am going to return. Cost to watch Netflix or hulu if u don't already subscribe", "verified": true, "helpfulness": "0/0", "author": "LaMont Baker"}, {"rating": 5.0, "review": "Love this system. It makes it so easy to watch movies that I've missed, television series that I hadn't had time to watch and it's easy to use as well. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Kate Turner"}, {"rating": 1.0, "review": "Very unhappy with this purchase. Was a Christmas gift and the remote doesn't work out of the box. Right scroll button works only intermittently. Seemed like a good product, but quality control is clearly lacking.", "verified": true, "helpfulness": "1/3", "author": "Bruce C"}, {"rating": 5.0, "review": "WOW. Nothing could be easier! I am \"stoked\"! It was harder to unpackage the Amazon Fire TV than to hook it up.", "verified": true, "helpfulness": "0/0", "author": "peruser"}, {"rating": 5.0, "review": "Works well. Very portable, just a power plug and HDMI cable. Netflix works well. You tube is a little tough to use without a keyboard but other than that it is a great little player", "verified": true, "helpfulness": "0/0", "author": "Shawn Larsen"}, {"rating": 4.0, "review": "Does not offer RCA outputs. Very expensive to convert HDMI to RCA output and the picture quality is grainy. Other then that issue, the unit is great when using the HDMI output. I have not yet figured out how to project an Android phone or pad to the TV.", "verified": true, "helpfulness": "0/0", "author": "Gordon"}, {"rating": 4.0, "review": "Should be even better when I get the game controller.  A lot of stuff available as a prime member.", "verified": true, "helpfulness": "0/0", "author": "Chris Dowty"}, {"rating": 4.0, "review": "Works great.  Fast response.  Clear picture.  Only issue is it very rarely will go into SLEEP mode, so it stays on.  I have to manually go to settings and select \"sleep\".  Add a \"on/off\" button.", "verified": true, "helpfulness": "0/0", "author": "Shopper4Family"}, {"rating": 5.0, "review": "love it bought two", "verified": true, "helpfulness": "0/0", "author": "mark a. toppo"}]