[{"rating": 1.0, "review": "Unfortunately nothing has went right for me with this, game controller wouldnt sync, box is always loosing connection to my wifi even though I have high speed. Not sure why I bought this, hopefully it will get better", "verified": true, "helpfulness": "0/1", "author": "Heather"}, {"rating": 4.0, "review": "would be five star except I'm disapointed that it has no browser capability at all and the amazon/google thing limits some of your choice. if you are a prime member its great, if you have all your movies on google play better get something else", "verified": true, "helpfulness": "0/1", "author": "Peter Jefferson"}, {"rating": 1.0, "review": "I cannot find out how it works to my advantage.  I know I can get other platforms, but do I have to buy a movie each time", "verified": true, "helpfulness": "0/2", "author": "Constance Taggart \"cecurkil\""}, {"rating": 5.0, "review": "great technology, am enjoying it a lot......", "verified": true, "helpfulness": "0/1", "author": "Henry Kpardeh"}, {"rating": 5.0, "review": "The device works great for YouTube, Netflix, which we watch all the,time. My husband installed it easily, too. We love it.", "verified": true, "helpfulness": "0/1", "author": "Julia"}, {"rating": 5.0, "review": "Best thing that I ever bough. Has everything including extras out of the box like 2 day shipping, music, etc.", "verified": true, "helpfulness": "0/2", "author": "Felix R. Latorre"}, {"rating": 4.0, "review": "I am still learning about all the various aspects of AF TV.  Overall, I am pleased with the purchase. It was very easy to set up and get started.  The only down side, and this is my lack of research, is that many of the apps require purchase of a separate subscription (such as Hulu, Showtime, HBO GO, etc).  If I purchased all of those subscriptions I would quickly be paying more than I did with cable.  I have noticed that some apps have more advertising than I expected to see.  On a positive note I am very much enjoying the benefits of steaming such as fast forward and rewind as well as the ability to skip directly to the next episode of all of those cable series that I love.  Have noticed that many of those series offer season 1 free then must pay for the next seasons (bait and hook approach).  I understand paying for the current season, but not for past seasons.", "verified": true, "helpfulness": "0/1", "author": "Shelly Trojanovich"}, {"rating": 5.0, "review": "I lost my Vizio smart tv by a well placed lightening bolt so when I replaced my TV I purchased just a regular TV an the Amazon Fire TV.  Wow the combination works SO much better than my Smart TV.  The Fire TV is a lot easier to use and it had more features.  The overall price of the TV and Fire TV saved me about $50 over another smart TV.  Anyone considering purchasing a Smart TV should look at this option instead.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "My wife bought this, along with two game controllers, as an anniversary gift to ourselves.  As expected, the unit is very much geared towards Amazon's services.  But, we already had Netflix and hulu plus subscriptions and those apps work great!  A couple weeks ago, I saw that amazon was having a promotion with their Amanzon Prime where you get 5% back on purchases made with Amazon Store Card.  It became a no-brainer and I purchased Prime.  Having Prime on the Fire TV REALLY opens up the capabilities of this devise!  It has so many options and works so nicely.  My wife uses the Fire app on her IPad to control the Fire TV and that works great.  The unit is ALWAYS very fast and responsive.  Very impressed!  Only reason it didn't get a 5 star rating is because their aren't many two-player games available.  And many of the \"two-player\" games require using points or a monetary purchase to unlock the two-player feature.", "verified": true, "helpfulness": "0/0", "author": "Bryce A. Lancour \"Bryce Lancour\""}, {"rating": 4.0, "review": "I bought this as a partial replacement for a Linux Mint media server.  Over the years, the interface I was using on the server (XBMC) slowly lost support for streaming content, such as Amazon Prime, Netflix, and YouTube.  While I still use the server to play stand alone content, having a device like the Fire TV for streaming video is excellent.  So far, it has handled all streaming video without any problem at all.  The device itself is small and unobtrusive, about the size of a CD case.  The remote is reliable and easy to use, and you can control the device with your phone as well.  Ine thing I didn't particularly like is the voice search function.  It only searches Amazon Prime content, so you couldn't use it, say, for searching YouTube.  I would have also liked to see a wider range of support for stand-alone files (.mkv comes to mind).  Overall, however, it has proven itself to be a good device and a worthwhile purchase.", "verified": true, "helpfulness": "0/1", "author": "Kalaab M. Pickering"}]