[{"rating": 5.0, "review": "Innovative and an amazing addition to a home system!", "verified": true, "helpfulness": "0/0", "author": "Enthusiasm enthusiast"}, {"rating": 5.0, "review": "What  can i say? Its the best Ive had Roku chromecast and apple Tv This is by far the most versatile Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "paulbainjr"}, {"rating": 5.0, "review": "...at least that's how this purchase made me feel. I have Apple TV and Nintendo Wii Fit, that I use to stream through. There's no comparison. I can't review it with specs and stats, but I can tell you that for me...it's a smart buy. It's super fast and super uncomplicated. BUY!", "verified": true, "helpfulness": "0/0", "author": "MzJC"}, {"rating": 3.0, "review": "Works great. Easy setup from Amazon. The only thing I don't like is that you can't delete the unused/unwanted icons. I was buying this for my 75 year old technology slow parents. They seem to have issue using it saying it wants them to pay for everything. I had set up Netflix and Amazon Prime on it for them, but they can't figure it out well enough to use just them. (I have HBO GO on my Apple TV, but the Fire won't let me put it on because it doesn't allow Xfinity customers to add it? I don't know why that is, but that lost a star rating). So basically, I have this really neat streaming device that has a bunch of extra crap on it that I don't need or want and I can't delete it off. I can't even hide it, I just have to scroll through all the crap until I can find the services I subscribe to. So, meh.", "verified": true, "helpfulness": "0/1", "author": "Dr. Awesome \"Fire Destroyer\""}, {"rating": 5.0, "review": "love", "verified": true, "helpfulness": "0/0", "author": "Bernice Simmons"}, {"rating": 2.0, "review": "In the effort to try and ditch \"The Dish\" and other like it, by the time you pay for the channels you want it ends up being no different. Also the movie rental prices don't begin to compete, very high.", "verified": true, "helpfulness": "0/1", "author": "Lee Houk"}, {"rating": 5.0, "review": "Item as described", "verified": true, "helpfulness": "0/0", "author": "prosit"}, {"rating": 4.0, "review": "This is clearly a very powerful device as I have seen zero issues with delays or any other issues mentioned in reviews for Amazon TV's competitors. So if you are an Amazon Prime member and want to take advantage of the free TV shoes and movies that are available to you, then why not get this? Well, the key here is that the shows you want to watch might not be free. I have seen many popular TV shows and some movies that are free, but not as many as I would like for what I pay for Amazon Prime. I am not disappointed, because I have plenty to watch that is free and the service provides HBO GO, Showtime Anywhere, and all the other services out there. You can literally just pick an HBO/Showtime show and watch the whole series from start to finish if you have a subscription already, which I do with FIOS. That is pretty awesome to me!", "verified": true, "helpfulness": "0/0", "author": "B. Schwarzenbek"}, {"rating": 5.0, "review": "Installation = 10 - HDMI, Setup Wizard and Ready to GoSetup = 9 - Love the introduction video.Packaging = 10General Thoughts:  Very positive!Areas of Improvement:  Overall quality of software (3rd parties) to work with other cord-cutter technology like Plex and TabloTV.  Things are just not plug-n-play but have improved tremendously over the past 12 months!Application = 7 - The only reason I am giving this a **7** is because in all honesty, cord cutting is not a simple, plug-n-play and for non-technically minded people. I've been using a Chromecast (which we like a lot for ease of screen casting), Apple TV and Roku.  All have their advantages but overall, my first impression with Amazon Fire TV is it is better than the rest.  I was looking for something that passes AC3 and also works with TabloTV and Plex.  If you are using this for Amazon Prime, Netflix and Hulu, Great headend unit, especially with the optional TV mount.", "verified": true, "helpfulness": "0/0", "author": "C. Cantrell"}, {"rating": 5.0, "review": "I love prime TV and I'm so pleased with the service I've recommended to several people... the voice remote is easy to use and very reliable ...I 've also enjoyed the prime old movie selection as well as the BBC series on prime...if they can work out the bug for streaming prime to my android I will be even more pleased..all in all the value on this prime membership and fire TV package is well worth the money...", "verified": true, "helpfulness": "0/0", "author": "craig potts"}]