[{"rating": 5.0, "review": "This thing is a beast. I have been using an Apple TV 2nd Gen for years, but was craving 1080p with the ability to use apps like Plex and Kodi. The Fire TV's quad core processor swiftly streams all video types and high quality 1080p videos look amazing. Interface is a bit clunky out of the box, especially if you don't have Amazon Prime but used the FiredTV app and it makes the experience much better. HBO Go app not great, but works for the most part. My biggest complaint is the lack of a decent LAN port. My wi fi is pretty stable but always prefer the hardlined route. Other than that, very happy!", "verified": true, "helpfulness": "0/1", "author": "Bo Beard"}, {"rating": 5.0, "review": "Works just as advertised!", "verified": true, "helpfulness": "0/1", "author": "Crashcorigan"}, {"rating": 5.0, "review": "Oh my, I was using either my smart tv or my smart bluray player, they sucked. Slow and never updated apps. I love using Amazon Prime Streaming and Netflix and Youtube are about the only apps I usually use. Well as you would have guessed, the Amazon Streaming App is Amazing. So much better then the \"smart products\". The YouTube apps works just as good as the one on my PS3, and Netflix app is great.Amazon has done an excellent job working on this FireTV box. I love the instant on, just press button and you see it on the screen. I have my modem plugged directly into the FireTV, which also means I get great picture quality instantly.Years ago I had a Sony streaming device, but at a certain time it just stopped getting updates. I do hope this will never fall like that did.", "verified": true, "helpfulness": "0/1", "author": "Charles"}, {"rating": 5.0, "review": "The unit is a breeze to set up and I was watching Hulu in a few short minutes. The remote control is easy to understand and even my technology challenged girl friend found it easy to master. The fire TV seems to work much better than my PS4 or Xbox One for streaming movies and TV in full HD without pixilation or buffering. I will be moving my Fire stick to the spare bedroom and buying another Fire TV for the bedroom.", "verified": true, "helpfulness": "0/1", "author": "Nathan Adams"}, {"rating": 5.0, "review": "I am in love with my FireTV! I have mine hardwired so haven't tested the wireless, but everything is flawless. I haven't had any buffering or other lags with this device. It is fast. I really like the user interface. The only thing else that I would like to add to it is the ability to add OTA channels directly.", "verified": true, "helpfulness": "0/1", "author": "Ryan A"}, {"rating": 5.0, "review": "It's amazing!!! I'm in love with this magical device. Why can't the DVR controls work this well.? My only concern is that now that I've unlocked the potential of Amazon streaming, I may become an addict. I LOVE Catastrophe and can't wait to discover all the other content. Many thanks for a wonderful product.", "verified": true, "helpfulness": "0/1", "author": "B-ART"}, {"rating": 5.0, "review": "I have both FireTV and AppleTV. FireTV has a better interface and loading times by far. The systems are similar and offer similar apps, but the added Prime Instant Videos with FireTV gives it the edge with a Prime account.", "verified": true, "helpfulness": "0/1", "author": "Charles Y."}, {"rating": 1.0, "review": "It stopped working after one week. If you use it all the time and keep in pluged in its best to buy a better one.", "verified": true, "helpfulness": "0/1", "author": "Fay Pitts"}, {"rating": 5.0, "review": "Easy to follow instruction on setting up Amazon firemTV, the tutorial on how to use is very useful.  No disappointments on purchasing Amazon Fire TV!", "verified": true, "helpfulness": "0/1", "author": "Tom Gage"}, {"rating": 3.0, "review": "Would be awesome but doesn't seem to do VC-1/WM9 decoding in hardware (probably not mpeg2 either), which is utterly lame and makes it next to useless for Kodi use.  If you just want Netflix and Amazon instant it's good, but just get the fire stick instead, it's cheaper and has enough power.", "verified": true, "helpfulness": "0/1", "author": "Frankie"}]