[{"rating": 1.0, "review": "This device will sell big if it works with other Operating System (OS). I bought ang returned this right away upon learning its downfalls.", "verified": true, "helpfulness": "3/18", "author": "therealjammer \"Speak your mind!\""}, {"rating": 5.0, "review": "love it!!", "verified": true, "helpfulness": "0/2", "author": "Kulena"}, {"rating": 2.0, "review": "I have had it only a little while, but right now I can tell the font size is too small on the move info and other fonts.If I was seating at my computer monitor , it would be okay, BUT seating in my ease chair 10 or 12 feet from the TV I see it. I have to get out of my chair and move up to the TV to read it.  If the font size doesn't increase, I'll be returning it, as not usable.", "verified": true, "helpfulness": "3/9", "author": "DONALD J."}, {"rating": 4.0, "review": "Voice search doesn't work.  Also, most movies were \"for sale \" and not \"for rent.\"  Plus, price dropped $15 two days after I bought it; bad timing, I guess.", "verified": true, "helpfulness": "0/1", "author": "Ryan Bannon"}, {"rating": 1.0, "review": "The device is severely limited by Amazon's restrictive & limited app store selection.  The Plex app was smooth, but the video playback was choppy and pixelated.  This device replaced a Roku 3, and it's video was crystal clear.  Sideloading apps and rooting is possible, but it requires complicated steps to boot directly to XMBC.  In the end it's more effort that it is worth, when I can do everything I want with the Roku 3.  Also, wtf, no Spotify app....really?At this point I am planning on returning it.", "verified": true, "helpfulness": "7/10", "author": "Robert Rowe"}, {"rating": 4.0, "review": "Can't understand why Amazon has failed to add their own music app into Fire TV ecosystem...I made the purchase in hopes to stream music (forthcoming) and to transfer music library over (allegedly forthcoming)..  Either I have missed how to do this technically, have to wait for some sort of upgrade, or be satisfied status quo.  Come on Amazon be the total package and make the magic happen!Upside: The remote control features are great and entertainment selection is solid.  If your a prime member it is excellent compared to the competition.I'll give the 5th star when one of the two music features I'm looking for is added.", "verified": true, "helpfulness": "1/1", "author": "Mark"}, {"rating": 5.0, "review": "I have only had my Fire TV for a short time and I feel I have already totally gotten my money's worth of great viewing.  The picture quality is awesome, there is a ton of free stuff to watch, and the ease of the guide is much better than DirecTV.  I already had Prime, which pays for itself with Kindle book savings and free shipping, so I am receiving all this great programming for nothing!!  I had a question about the set-up  (I'm older and not at all techish) and my question was answered courteously and immediately-Wow.  Huge thumbs up to Amazon for this great product.  Next I'm hooking up an OTA receiver and antenna--goodbye DirecTV--hello money in my pocket!!", "verified": true, "helpfulness": "6/6", "author": "cheryl martinson"}, {"rating": 2.0, "review": "One of the reasons I bought this is I wanted to get my kids off the games, I didn't realize it came with games, you can parental that out, but it also blocks apps to like netflix, I would just like a box that has nothing but TV programs, that we watch every now and then.", "verified": true, "helpfulness": "1/7", "author": "Ernst Borchert"}, {"rating": 3.0, "review": "Got a HDhomerun Prime or Plus?  Want to use the FireTV as a cable box?  Nope.  FireTV does not support MPEG2 hardware decoding, you basically have to turn hardware acceleration off in XBMC 13.2 and switch to software rendering, only to see lots of uneven interlaced frames, making any channel painful to watch.  Raspberry Pi running OpenELEC handles MPEG2 far better, but it has buffering issues on 1080p channels.", "verified": true, "helpfulness": "1/5", "author": "Amazon Customer"}, {"rating": 4.0, "review": "STORAGE, STORAGE, STORAGE......  The only thing wrong with this unit is that they went cheap on storage. there is a Unusable USB port and NO SD card slot.  yet there are 300+ games avalable... Lets see 8GB Unit... over a gig for the OS and updates take some. then after you format any storage you lose more. with that said i have 5GB Free on a brand new unit and 2 games GTA and Modern Combat. and now its saying FULL!!!  C'mon Amazon let open that USB port up to External storage and you will get your 5 stars.  Also get TWCTV that way i can totally get rid of my ROKU.", "verified": true, "helpfulness": "7/7", "author": "Joker Electronics"}]