[{"rating": 3.0, "review": "Plagued by intermittent stoppages.", "verified": true, "helpfulness": "0/0", "author": "S. Leshin"}, {"rating": 5.0, "review": "Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Tina L Perkins"}, {"rating": 5.0, "review": "My son and I love this device.  I purchased it, so I would not have to connect my Kindle to the TV when I wanted to watch a movie.  As an added bonus, I purchased a receiver so that my x box controller could be used with it for the gaming function or as an additional remote.  It is not an x box (my 14 year old can attest to this), but my 6 year old absolutely loves it.  I have Amazon Prime, so a lot of the movies we watch are free, but all other movies and games are very reasonably priced.  Could not be happier!", "verified": true, "helpfulness": "0/0", "author": "Kari Moore"}, {"rating": 5.0, "review": "The Amazon Fire TV is really a nifty little device. It's performance and quality is top notch, an it out performs Samsung's Smart TV built in player for Netflix and Amazon Video. It has most of the popular apps, such as HBO, Youtube, but also has some very interesting less-known apps, such as PBS. The games it supports also work well, although the Game Controller seems to be slightly less responsive than other gaming systems. Nonetheless, for the money it delivers a very high quality of performance for video playback. If you enrolled in Amazon Prime, the Fire TV delivers all thousands of free videos and TV Shows in crystal clear high-def. In fact, I'm still amazed amazed at it's performance -- when I click to start watching a video -- it begins immediately without hesitation, no loading or waiting for a spinner. Good stuff Amazon!", "verified": true, "helpfulness": "3/3", "author": "Christopher Cordray \"RootGeek\""}, {"rating": 5.0, "review": "My family has recently ditched satellite television in favor of streaming only. I needed a box easy enough for a 4 year old to operate that would work consistently. We use a PS3 for streaming on our main TV and wanted something less expensive for the one the kids use. This has been perfect. I hooked it up, connected to our Netflix and Hulu accounts, and it was ready to go. It loads quite a bit faster than the PS3 and the UI is much easier to operate.Since I have four children using this device, I obviously don't want them purchasing everything they see on Amazon, so I enabled the PIN for purchases. This automatically turned on the PIN requirement for watching shows as well, but this function can be turned off without turning off the PIN completely. Overall this has been a great little device and we're looking forward to saving $1500 a year without paying for satellite TV.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon Fire TV is the best streaming video player available today. I have had the opportunity to own and use Roku and Apple TV. My adult sons are now using and enjoying those boxes. First, ALL of these players are magnificent in my opinion. All three have great user friendly interfaces. I like Apple's interface best, but it is just a matter if opinion. If you subscribe to a number of different video providers and are agnostic in your devotion to them, I'd suggest Roku because its ability to search for programs across these different content providers is very helpful. If you're an Apple person, devoted to ITunes, by all means, buy the Apple TV. If you are an Amazon Prime member, you should buy the Fire TV, no question. At least with my system, the video quality of Fire TV wins hands down. It is amazingly fast to load. If you haven't experienced Fire TV's speed, this may not seem like a big deal, but it is once you've experienced it. Also, with Fire TV, it is easy to search back and forward. Every time I tried this with Roku or Apple TV, I slammed the remote against my forehead and muttered, \"Why to I do that!\" If you haven't bought a streaming video device yet, buy one.  Your life will be better!", "verified": true, "helpfulness": "1/1", "author": "Terrier Fan"}, {"rating": 2.0, "review": "Not bad", "verified": true, "helpfulness": "1/3", "author": "Mike"}, {"rating": 4.0, "review": "fast", "verified": true, "helpfulness": "0/1", "author": "bill donner"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great little device", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]