[{"rating": 1.0, "review": "The audio through the Amazon Fire TV is very tinny.  When we stream the same program through our Blu Ray player the sound is much better (played through the same sound bar). The Fire TV is not used because of the audio problems.  Save your money.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV is a pretty exceptional little device. First off, it is small and unobtrusive, making it easy to store just about anywhere. Second, the remote feels solid and well made. The voice activation is incredibly easy to use; you hold the 'mic' button down on the remote, and speak into the built-in microphone (on the remote). This is important, because I don't feel like I have to yell, like I do sometimes with my Xbox One's Kinect.The interface is easy to use and navigate and is very responsive. Apps launch within a second of selecting them. All in all, I am extremely pleased with this purchase, as I was considering several other options. Definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Brian Miller"}, {"rating": 3.0, "review": "My big problem is getting Netflix. I have to try again and again. Amazon says it is Netflix fault and Netflix says it is amazons fault. I have called both many times and tried every thing I have been advised to do, but still a continual problem. It can take 7 or 8 tries to load Netflix. When are you going to get the new Netflix app?", "verified": true, "helpfulness": "3/3", "author": "jeanette"}, {"rating": 5.0, "review": "I would love to purchase another one for another tv, but, it is not an hd/hdmi  tv.it is not an older tv, it is a flat screen but not an hd..... is there a plug in or something to make this tv an hd? can I use an antenna, do I have to buy another one or will my one I have work for two tvs? would really appreciate input from this. also is there a way to get a longer hdmi cable? where?  please reply asap....... barbninidaho@aol.com  thank you so much", "verified": true, "helpfulness": "0/0", "author": "Barb Novack"}, {"rating": 5.0, "review": "Outstanding in all parameters. Fairly isolated on Kauai,so very much a blessing", "verified": true, "helpfulness": "0/0", "author": "Joseph C. Clifford MD"}, {"rating": 1.0, "review": "Voice commands do not work on remote.  Only reason to buy this over Apple TV is the  remote so big mistake.", "verified": true, "helpfulness": "2/10", "author": "RH S."}, {"rating": 4.0, "review": "This is the best smart tv add product I have worked with.  It is far better than any Roku products, has more capabilities than Google Chrome, and since it is an Amazon product, you can run prime music and video on it, which gives it leverage over Apple's iTV.  A great buy, it works like a charm.  Videos stream in good quality and with no notice blue resolution or formatting issues.", "verified": true, "helpfulness": "0/0", "author": "Tank Fordham"}, {"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "Billy D"}, {"rating": 5.0, "review": "Love using Fire TV", "verified": true, "helpfulness": "0/0", "author": "J. J. Bain"}, {"rating": 5.0, "review": "Outstanding product Voice search is fantastic. Works perfect and super fast. HD is beautiful. Had a Roku but image quality was failing after two weeks. (Only down side is i could not find Gary busies pants in voice search). GREAT PRODUCT AMAZON", "verified": true, "helpfulness": "0/0", "author": "Chris Evans"}]