[{"rating": 3.0, "review": "Really like amaOn fire tv.  The only draw back is that it DOES NOT HAVE HBO GO.  Roku does.  Other than that love it voice search is awesome.!!!!", "verified": true, "helpfulness": "0/1", "author": "Josh"}, {"rating": 4.0, "review": "I decided on the FireTV after having two Google TV boxes die on me (one Co-Star and one Logitech Revue).  I was pleasantly surprised with the speed of the device as the Google TV boxes always seems sluggish to me.  The app selection is very good so far (The core apps I wanted were Plex, Netflix, Disney Junior and of course Prime).  Now for the cons.  I hope the voice search will be universal at some point as not having a remote with an embedded keyboard is a little bit of a let down after coming from Google TV.  Additionally I still miss the core Google apps such as Play, Google Music and Chrome but I am finding alternatives.  Overall really happy with my choice (as I even bought a second one) but there is always room for improvement.", "verified": true, "helpfulness": "2/2", "author": "Scott \"born2prank\""}, {"rating": 5.0, "review": "Voice search is so cool.Like we can watch Prime video and Netflix in one box.", "verified": false, "helpfulness": "0/1", "author": "Simon Guo"}, {"rating": 4.0, "review": "This is a great alternative to the Roku 3 or Apple TV. Beware that this device is extremely Amazon centric and all of your other \"apps\" like Netflix, Hulu+, etc, are all relegated to second tier status, but they are easy to find. Hopefully Amazon will provide some software updates to the UI because it is a bit confusing to navigate. I'm used to the Roku's super easy UI...the Fire TV UI is still very clunky.Now I can say that this thing has no problem displaying HD video. With Roku it usually has to buffer in the background, before it will display a movie at HD res, same for my PS3. The Fire TV does not have this issue. So it gets high marks for that.Aside from the clunky UI, everything else about it is great. Also, it only supports HDMI, so be sure to use this only with an HDTV w/HDMI.", "verified": true, "helpfulness": "2/2", "author": "King P"}, {"rating": 4.0, "review": "i'm enjoying Amazon Fire TV. I do wish there was a way to filter out R-rated movies and other suggestive programming.", "verified": true, "helpfulness": "0/1", "author": "watchbird"}, {"rating": 5.0, "review": "My wife bought me this for father's day at my request this year, and I am in love with it.  Now, my household cut our cable cord about three years ago, so we have lived by the good grace of Roku's ever since, and were very aware of the capabilities and limitations of streaming going into this purchase.Now, with experience using, in great length, the Roku HD, Roku XD, Roku 2, and Roku 3, I must say that I think this beats them all hands down, and here is why:Pros:Speed.  The speed of this unit is fantastic.  It has the ability to find, load, and play content faster than just about any other streaming box out there that you can buy.  If you stream literally 100% of your content, loading time will, in fact, add up to a significant amount of time at the end of the year.  The reduced speeds mean more time watching the shows and movies that we want to watch.Speech search functionality.  This is great!  Bear in mind that she speech search function only works for Amazon content, be it paid or Prime.  So, you won't be able to search content on Netflix with it at the moment.  That's alright with us, as a lot of the shows my children and I watch are through our Prime account.Games.  When you pair this with a game controller, that is where this console really shines.  With two younger children in our home, we've had a difficult time finding games that they can easily play on our Wii that also has an affordable price tag.  Also, with our new setup in the living room, we don;t actually have a way to hook our older Wii up without a ream of cables dangling from our wall, uglying up the joint.  So we've gone about 1 year without being able to play video games in our living room, which has made me a sad Panda.  With the Amazon Fire, I can get back into the game, and so can my kids.  There are countless titles that they love, and tons that I can't get enough of, with more titles being added every month.Now, here's where the FireTV falls short:Less Content.  As it is owned my Amazon, they simply don't allow competitor apps on there.  Obviously.  This means no HBOGo at the moment, and no Vudu either.  Now, I have a decent little Vudu movie collection.  Thankfully, they were all bought through Ultraviolet, which means I can play them all on my Amazon Fire TV thanks to the Flickster app. Also, as I have cut the cord years ago, HBOGo isn't even an option for me anyways... so neither of these are bad things for my family, but I can certainly see why these are detractors for other buyers.You need Prime.  Now, you don;t need a prime account to use the FireTV, but you are sorta screwing yourself out of a lot of its functionality by not allowing yourself access to their massive library of free TV shows and movies.  True, you can still get Hulu Plus, Plex, Netflix, and Crackle on here, but it really is great having Prime Instant videos to round out the mix.For my money, I would buy the FireTV again.  It has been a solid performer, and has given me and my family pretty much no grief at all.  It's worked, and worked extremely well.  And, on top of that, it has become a nice little multimedia center for us, allowing us to stream music, tv shows, movies, and even play video games together once more for game nights.  I would recommend this device to anyone looking to transferring their lifestyle from traditional TV to streaming.  You really can't go wrong.", "verified": false, "helpfulness": "1/2", "author": "Aaron W. Sinn \"Mr. Sinn\""}, {"rating": 5.0, "review": "I love the selection of tv series that I haven't seen.  Commercial free is a big plus.  Lots of movies to choose from. A few popular movies, but most I've never heard of.", "verified": true, "helpfulness": "0/1", "author": "dlee"}, {"rating": 2.0, "review": "Lots of bugs still. Not all impressed. I keep getting \"unable to play error, please contact customer service if the problem continues\" The only way to solve it, Is to unplug the box and restart it. perhaps a power button would be nice for those of us who have this hidden behind our TVs on the wall!!!Video playback for me stutters at times, while my Roku does not. Maybe this is a work in progress. I feel I will go back to my Roku in the meantime.", "verified": true, "helpfulness": "3/3", "author": "michaelÂ driggs"}, {"rating": 5.0, "review": "Briefly: this is great. Cable bill vs amazon fire w/ prime: do the math. There is a lot of programs that come with prime. I rarely watch old movies; however, I watched 'Grease' the other day and my daughter came by and could not believe how clear the picture is.", "verified": true, "helpfulness": "0/1", "author": "Marlene"}, {"rating": 3.0, "review": "The Amazon Fire TV is an impressive device. I purchased two Fire TV's near the time when Amazon debuted it. I do have a gripe however and that is that both of my purchased devices have a bug. Both of the devices play fine but when I'm not using them there is some kind of yellow light that one can barely see and it tends to stay lit, and from reading on-line about what others have to say regarding this it has something to do with the devices screen saver. I have adjusted my settings accordingly and only one of my devices responds by turning the yellow light off completely. The other device stays lit despite the setting changes that I've made and I'm forced to unplug the device. I don't think that many people are experiencing this issue because I have not seen many complaints about this from others who have purchased this device. There seems to be only a remote few who are affected by this data usage issue. I know that in regards to another individual who had communicated with Amazon his concerns about this, that Amazon is supposedly addressing this. I do hope that Amazon fixes the bug soon because having to unplug a device every time one uses it really takes away from the overall experience. I think that Amazon is a quality company but with regards to this device all of the bugs should have been worked out before this product was pushed out to the public, even if many people are not being affected by this. I thank everyone for their time in reading this. God bless.", "verified": true, "helpfulness": "1/1", "author": "Ty A. McClain"}]