[{"rating": 4.0, "review": "Nice... but what would make it near perfect is native support for IR remotes (so you wouldn't need a third-party IR receiver to support universal remote controls like Harmony), and an official web browser app.", "verified": true, "helpfulness": "0/0", "author": "Safari John"}, {"rating": 2.0, "review": "No HBO GO, no thank you. Stick with my multiple Roku devices, more channel options than any other streaming player. Streams Amazon Prime quite well, and separates free shows/movies from those with additional cost.", "verified": false, "helpfulness": "0/1", "author": "Ronald"}, {"rating": 2.0, "review": "My needs for this little black box were minimal. I wanted the device for viewing my Amazon video library and prime movies. I also wanted it for mirroring my iPhone and iPad via airplay.Well working in reverse mirroring my devices was easy to setup and works flawlessly. Shockingly perfect. So easy that it's almost worth the $100 just for that...almost. I love this. I watch my Lynda.com content on the TV and that's tremendously better than using the app on my device or PC.The good: When the fire tv works and works well. All my Amazon content is right there in my face just as I want it. The voice search works well, controls work as they should, moving through the content and apps is speed, video is perfectThe bad:Nothing but troubles with sound. Sometimes there isn't any sound whether scrolling content or watching video. Other times I hear menu clicks but no audio at all, no device feedback, no audio during playback. Each time unplugging the fire tv and plugging it back in resolves the issue but the act gets old as I have a pretty elaborate home theater setup and I need to get on my belly  to get at the fire tv to cycle the power. For reference I'm using HDMI from the Fire TV to a Yamaha RX-A2030 Receiver.I have researched some internet forums, I am not alone with this issue. I keep hoping for a software update to resolve this.", "verified": true, "helpfulness": "0/0", "author": "A. Schur"}, {"rating": 5.0, "review": "Love it.  Easy to set up and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Brenda Leonard"}, {"rating": 5.0, "review": "Love the streamer.  Now I hardly watch satellite anymore.", "verified": true, "helpfulness": "0/0", "author": "Stanley Wilson"}, {"rating": 1.0, "review": "Netflix is better and cheaper.  What they don't tell you is that after you purchase Prime, you still have to purchase subscriptions to the other programming.If you don't mid watching the older shows, go with Netflix or AppleTv!", "verified": true, "helpfulness": "1/7", "author": "Stephanie Toler"}, {"rating": 5.0, "review": "I am so glad I purchased this! I feel like I am in the 21st century now. I had been envious of family who could watch all kinds of tv shows, You Tube, etc. on their home TV and I could not. It is simple to work which explains the sparse \"book of words\" about it enclosed in the box. The only thing I have to figure out is how to make my soundbar/subwoofer system work with it. Currently, I listen to shows via TV's speakers which are not bad.", "verified": true, "helpfulness": "1/1", "author": "MG Gal \"Herd fan\""}, {"rating": 5.0, "review": "It's far better than the Apple TV.", "verified": false, "helpfulness": "0/0", "author": "Philip Freeman Sr."}, {"rating": 5.0, "review": "My wife and I elected to get rid of cable (just cannot justify the cost since we don't watch much television, nor do we care for much that is on) and decided to go with the Amazon Fire.  We absolutely LOVE it.  So easy, efficient and fun!  I have resorted to buying all of my movies/Television shows now from Amazon and playing them on the Fire. The Netflix application also works well.  And don't forget the voice feature, which is such a nice luxury to have.", "verified": true, "helpfulness": "1/1", "author": "Corazon78"}, {"rating": 3.0, "review": "overall product quality is good.Interface / UI is not very intuitive; Amazon must work on improving the user experience,Not allowing Google Play store - make this Android based device close to useless, because Amazon App Store does not have all the apps; this it Amazon allow Google App store on this device. this would be win-win for consumer and amazon. we can run lots more useful app on this device (at our risk) many may work and some may not work... leave this up to the user to decide.AMAZON: Please re-think your strategy and make it easy for us to install and use Google Play App Store on Amazon Fire TV and other devices.Thanks,", "verified": true, "helpfulness": "0/0", "author": "B. Kumar \"bk\""}]