[{"rating": 5.0, "review": "So much better for my apps than a gaming system!", "verified": true, "helpfulness": "1/1", "author": "Court Torres"}, {"rating": 5.0, "review": "if you know how to program it Right it's the best device you will ever buy.You will love it more then any other device you have I guarantee it.", "verified": true, "helpfulness": "1/1", "author": "forest"}, {"rating": 4.0, "review": "Works great with Amazon.  I ended up getting a TiVo DVD which let's me access Amazon and many other streaming video sites.  I do like the voice search function a lot.", "verified": true, "helpfulness": "1/1", "author": "HappyAmazonCustomer"}, {"rating": 3.0, "review": "The HDMI connection is not the greatest, had to insert it very forcefully to make a proper connection. Used the same cable that I used for my now disconnected Roku box, also tried my AppleTV cable, same result with both cables. I hope that the connection does not degrade over time.The Amazon Prime video interface is awesome and the main reason for purchasing this device. I still use my AppleTV for Netflix and other APPs .", "verified": true, "helpfulness": "0/1", "author": "RT_Aramcon"}, {"rating": 5.0, "review": "love the Amazon Fire TV", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great, has HD streaming nothing bad to say about it.", "verified": true, "helpfulness": "1/2", "author": "Amalio quiles"}, {"rating": 4.0, "review": "I am sure it would be fine if I could hook it up. Have had it 30 days. Haven't been able to use it  yet.  It DID work out of the box easily enough thru the TV --but NOT thru the Sony Home Theater. I  have HDMI cable as well as recommended optical audio cable. Talked with Fire TV Customer Service via phone and \"we\" decided I did not know enough about the set up and I should call an Audio Tech to come and set it up :(  I might try it on my other TV with the Onkyo receiver for surround sound. Had the  Fire Stick and sent it back for same reason.", "verified": true, "helpfulness": "0/2", "author": "K. Bates"}, {"rating": 5.0, "review": "Love it. Easy to set up and operate.", "verified": true, "helpfulness": "1/2", "author": "Christopher Lorch"}, {"rating": 5.0, "review": "Great product. It delivers great entertainment.", "verified": true, "helpfulness": "1/2", "author": "carlos a. medina"}, {"rating": 5.0, "review": "I absolutely love my Amazon Fire.  It has changed my TV viewing for life.  It has all the great shows that my wife and I love and then it also has many different titles for my two kids.  It so easy to navigate and find exactly what you want and to make things easier the voice search is a great tool as well.  I highly recommended this product to all my friends and family.  Thank you Amazon for making my life that much easier!", "verified": true, "helpfulness": "2/2", "author": "Justin"}]