[{"rating": 5.0, "review": "Thank youElisabeth", "verified": true, "helpfulness": "0/0", "author": "Glitter Gal"}, {"rating": 3.0, "review": "Great device but I got it for one reason only, to watch Game of Thrones on my tv and not on my computer. Unfortunately Amazon and Comcast do not have an HBO Go deal in place. Maybe they will work something out in the future but until then the Fire TV is not living up to its potential. If you have HBO Go through Comcast it will NOT work with this box.", "verified": true, "helpfulness": "1/1", "author": "T.J. Robinson"}, {"rating": 5.0, "review": "I love this!", "verified": true, "helpfulness": "0/0", "author": "sharon r long"}, {"rating": 1.0, "review": "Edit: Revising my formerly 5-star review after using the Fire TV for a month. As highly as it is touted, it is not any better than a Chromecast. I routinely have problems streaming Netflix through the Fire TV, and have to power-cycle or clear the Netflix data every couple of days, or the \"jerks and stutters\" in the streaming get to the point where it is unwatchable. I would compare it to listening to a CD that skips, only its the video stream that seems to \"skip\" a couple times a minute. The quality is fine, no buffering issues, obviously not a network problem. I have never had this issue with the Chromecast, or just streaming Netflix through my smart TV. My internet connection is fine, and normally tests at speeds between 40-50 mbps. I have also had issues with apps randomly crashing, sending me back to the home screen in the middle of a show or movie. Currently, I would not recommend spending your hard-earned money on this.Update: After SEVERAL conversations and troubleshooting sessions with Amazon customer service over the course of 2 months, they FINALLY allowed me to exchange my unit for a new one, which works much better. The original that I had was obviously defective, and it was extremely annoying trying to convince Amazon of that fact. The new FireTV seems to work flawlessly so far, so if it keeps up I will increase the rating, since the problem seems to have been (hopefully) just a fluke. I can't bring myself to give 5 stars because of the awful customer service.Update #2: Same problem has returned. It's only an issue with Netflix, and Amazon obviously doesn't care enough about anything except Amazon content to fix the problems with this app. Lowering my rating to 1 star, and would recommend sticking with a Roku, Chromecast... pretty much anything but FireTV. Cheap product, awful customer service = 1 star.", "verified": true, "helpfulness": "0/0", "author": "Hendo1024"}, {"rating": 5.0, "review": "Great little black box to access movies and tv shows. Switched from Apple tv found the fire tv easier to operate", "verified": true, "helpfulness": "0/0", "author": "Disappointed in MD"}, {"rating": 5.0, "review": "Great product.  Just learning all of the great benefits we have!", "verified": true, "helpfulness": "0/0", "author": "Lori Petersen"}, {"rating": 2.0, "review": "My fire box downloaded my apps but Netflix won't  play and today it isn't responding.", "verified": true, "helpfulness": "0/0", "author": "Ramona G. Hickey \"ramona\""}, {"rating": 5.0, "review": "If you are already a prime member and you have netflix, why would even think about getting another box.  Combination of netflix and prime makes it the best box out there.", "verified": true, "helpfulness": "0/0", "author": "Matthew Green"}, {"rating": 4.0, "review": "I got the Fire TV to watch ESPN a via Sling TV on my TV. I only have DSL internet service in my area and AirPlay to my Apple TV was choppy at best.  The Fire TV is the perfect solution plus I get easy access to Amazon Prime video. The home screen does not have dedicated icons for apps, that is why I subtracted a star, only the most recent apps show up. Sling TV and Amazon partnered to offer the Fire TV at a discount with Sling TV service, a great combination.", "verified": true, "helpfulness": "0/0", "author": "Sara Strottman"}, {"rating": 3.0, "review": "Got rid of Dish $80/mo expecting this to be better.  Still need a TV service provider to make Fire work.", "verified": true, "helpfulness": "0/0", "author": "XXXXX"}]