[{"rating": 5.0, "review": "It was really great.  Glad it would work on a 6 year old Visio TV.", "verified": true, "helpfulness": "0/0", "author": "Barb P"}, {"rating": 5.0, "review": "Wonderful & very user friendly", "verified": true, "helpfulness": "0/0", "author": "James O. Taylor"}, {"rating": 5.0, "review": "Awesome customer experience.  Out of the box and up in running in minutes!", "verified": true, "helpfulness": "0/0", "author": "Richard A. Garay"}, {"rating": 5.0, "review": "So many functions and uses. Love it. I might even replace my cable box with it.", "verified": true, "helpfulness": "0/0", "author": "Evan Morgan"}, {"rating": 5.0, "review": "Its absolutely perfect, able to get everything I wanted on my TV.", "verified": true, "helpfulness": "0/0", "author": "jill"}, {"rating": 5.0, "review": "This is the way we will be watching tv in the future. NO commercials, all content at the fingertips just a button push away. Have yet to try gaming but it is almost irreplaceable for the kids now. All the free shows are super quick to load and find. All of the movies and pay to watch titles are just as easy and fast. Takes me up to 5 min to start watching a movie on the bluray player, only a few seconds to start watching on my Fire TV. Bluray has gotten so frustrating to use compared to the Fire TV I don't even buy hard copies anymore, unless they come with a free digital copy.", "verified": true, "helpfulness": "0/0", "author": "CG33"}, {"rating": 2.0, "review": "While speed and snappiness are great, this Amazon Fire TV is terrible from a consumer standpoint. The fact that Amazon has been tooting its own applications/products WITHIN Fire TV's interface is well documented on various reviews of the 'Net.Amazon has even taken the time to \"personalize\" your Fire TV BEFORE shipment. Yes, it comes already loaded with your name and other info! Too bad they didn't take the time that they spent doing this and fixing the horrible home screen! One has to weed through the listings to find something that doesn't cost something...Oh, and that issue with the Plex server app? Now that was an experience. See: https://forums.plex.tv/index.php/topic/148852-forced-to-buy-plex-pass/Two things are for certain. One, Amazon succeeded in getting $4.99 from me in order for me to go beyond watching my own movie/tv show content on my own Plex server. Just think how much they make getting $5 from everyone who uses Plex! Oh yes. You can certainly download the Plex App from Amazon for \"free.\" But then, when you try to use it, you will only get to watch 1 minute of video before that horrible window pops on the screen pushing that $4.99 \"one time fee.\" And that so-called \"voice command\"? It works great! But it ONLY works with Amazon's own products. That is, when you \"voice\" a search for a certain show, it will \"return\" only Amazon products that fit the command. An example, I have past \"Revenge\" shows on my Plex Server. When I voiced a command for \"Revenge,\" what I got was Amazon Prime's versions ONLY. Guess what? Oh yes, you have to purchase them at $2.99/episode! So, in essence, the \"voice command\" featuree is worthless for most people...The second certainty is that I will be returning the Amazon Fire TV after only 2 days of trying to like it. Yes, I will be ordering a Roku 3 in its place. While the Roku isn't as fast, at least its interface is neutral and doesn't try to push corporate products down your throat... I have the Roku 2 and it works great, but I was thinking of upgrading, so I ordered the Fire TV--what a mistake that was! Bsck to Roku it will be!!", "verified": true, "helpfulness": "0/1", "author": "Vintess"}, {"rating": 3.0, "review": "We  have had constant problems getting programs and movies to load .  We have  xfinities fastest  internet speed and wi-fi but still having  problems with incomplete loading of  everything.  The load meter shows a full program, the program starts but stops several times during viewing to reload.  It takes 2 or 3 times longer to watch most things even if the commercials  had been downloaded with the shows!  It,s extremely aggrivating!", "verified": true, "helpfulness": "0/0", "author": "frog"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "KMM"}, {"rating": 5.0, "review": "We love it. Great access to shows and movies for adults and children. We have both Fire TV and Fire TV stick and we love them both. Combine this with sling TV and an HD antenna for your house and you can consider kissing cable goodbye.", "verified": true, "helpfulness": "0/0", "author": "MJMK"}]