[{"rating": 5.0, "review": "Excellent......", "verified": true, "helpfulness": "0/0", "author": "Rolando"}, {"rating": 5.0, "review": "My whole family is enjoying it. My 5 year olds really like the games.", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "Easy setup, great selection of shows. We're really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Aimee L"}, {"rating": 5.0, "review": "I love the Amazon Fire TV. I have a Roku 2, a Chromecast, and also The Amazon Fire. I love the voice command that is lightning fast. Once you set up your account (which is easy) and pair it with your Showtime and HBO accounts, you have access to thousands of hours of entertainment, not to mention all the Amazon Prime offerings if you don't have HBO or Showtime. It is much easier to use than Chromecast (my wife is not a techie and doesn't like to have to use a smartphone to control the TV), and the voice command makes it easier to use than Roku 2. I love all three and use them interchangeably without any difficulty but for my wife the AMAZON FIRE is her favorite. They all work seamlessly with Netflix so if you don't have cable, no problem, you can spend your days on Netflix or Hulu (if you subscribe). These devices make it much easier to cut the cable.", "verified": true, "helpfulness": "0/0", "author": "Centroid_314"}, {"rating": 4.0, "review": "The best", "verified": true, "helpfulness": "0/0", "author": "Francisco Tellez"}, {"rating": 5.0, "review": "Great purchase highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "David Shaw"}, {"rating": 2.0, "review": "Love how fast it is. Love the voice control and you can't beat the price of $79.99!  However, not easy to use because it is not well organized. Don't like the fact that prime movies and shows are mixed in with movies and shows you have to pay for. This should be fixed and made to be more user friendly. The Netflix ap does not work at all and that is not good because is now how this device is advertised! I was going to give this device as gifts but now I won't because it is by user formerly at all. You need to get this devices updated ASAP!", "verified": true, "helpfulness": "0/1", "author": "Maria Reyes"}, {"rating": 3.0, "review": "I've had this for a few weeks now and love it, needs a few more things like local tv stations and I can't get discovery channel app but I can on my phone. I don't understand why I can't get it on fire tv they both come from the Amazon app store.", "verified": true, "helpfulness": "0/0", "author": "nicholas north"}, {"rating": 5.0, "review": "Bought for my son moving out! With the prime membetship its Perfect for kids with not a lot of money to start out for cable. He loves it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Awesome product, two big obvious misses on this product are the ability to connect storage drive to play movies off of, and the needing to transcode all locally stored media before playing through plex app.", "verified": true, "helpfulness": "0/0", "author": "Kevin C"}]