[{"rating": 1.0, "review": "Dec 24: family ready for a movie night: FireTV lets me down big time. Telling family about network issues (emberrassing). Dec 31: same thing all over again. Finally I plug back in my old Roku (just for giggles). Roku works perfectly, family movie night is saved. FireTV is toast. Must be an inferior desing (FireTv that is). Not sure what it is, but you can't rely on it in real life situations. Stick to your Roku...Sorry to write this review, big time Amazon fan, but this is just unacceptable.", "verified": true, "helpfulness": "0/5", "author": "Tamas Gloetzer"}, {"rating": 4.0, "review": "Easy to install...works great with simple navigation! Spreading the word about my new stream machine!", "verified": true, "helpfulness": "0/0", "author": "Peter Polo"}, {"rating": 5.0, "review": "We love it!!!  It is so easy to use and has many more apps and extras than we ever dreamed of.  It's simply outstanding.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Andersen"}, {"rating": 5.0, "review": "haven't hooked it up yet again too busy", "verified": true, "helpfulness": "0/1", "author": "thomas leo martinez"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Karen C"}, {"rating": 5.0, "review": "Exactly what I was looking for!!  My son loves it!!", "verified": true, "helpfulness": "0/0", "author": "Z Star \"Z\""}, {"rating": 4.0, "review": "Greats but needs external storage without root. Very powerful device.", "verified": true, "helpfulness": "0/0", "author": "MICHAEL J JOHNSON JR"}, {"rating": 3.0, "review": "It took forever to load content so I got a wifi extender and still it buffers during movies to the point of being unwatchable sometimes. Is it the fault of wifi, or some other internet speed thing. I have Charter which is rated at 60mb. Im not sure what to do next.", "verified": true, "helpfulness": "1/1", "author": "mr.Jeffrey R. Miller"}, {"rating": 4.0, "review": "Didn't unde", "verified": true, "helpfulness": "0/1", "author": "Sally Nakamoto"}, {"rating": 4.0, "review": "Love the Amazon Fire TV - got a great deal with a discount for purchasing an HDTV. The reason I chose this over Roku is that it has a separate optical audio output.The only negative is that the optical output produces either straight stereo, or Dolby Digital Plus - my older receiver can't understand the Dolby Digital Plus and hence I have to use straight stereo. I'm told this should be backward compatible, however this might not be an issue at all with the Fire TV. Maybe it's time to upgrade my receiver.", "verified": true, "helpfulness": "0/0", "author": "Simon Wynn"}]