[{"rating": 5.0, "review": "Easy to use straight out of the box. Provides good quality streaming of video. Let's me readily show my Amazon prime videos and listen to prime audio. It also works alright with Netflix but I find it easier to still watch my Netflix items using my TIVO premiere.  Not very expensive and provides good value for the modest cost.  It also passes the spouse test as my wife finds it easy to use, even though watching through the home theatre system requires switching to HDMI2 instead of HDMI1 for the TIVO feed.Most difficult task of the setup was trying to figure out how to open the battery compartment. Took me 30 minutes and some intemperate language and finally resorted to finding a Youtube video that revealed the secret. (Which way does the cover come off: answer the big part comes off, not the top) A simple illustration in the extremely sparse setup pamphlet would have helped. Doesn't take up much space on yourI recommend it if you are an Amazon Prime customer.  Probably not quite as useful if you are not. Do remember it only works if you have a reasonably decent internet connection. Before I purchased I read all of the reviews for FireTV and FireStick.  I think the majority views FireTV as a better bargain overall but it is three times the cost.She particularly likes the voice command for search. It recognizes both our voices quite well.  Would be nice if you could call up a genre of videos using the voice command.  Maybe the next iteration of the software will support choosing Sci Fi, Action, Romantic, Comedy or whatever.", "verified": true, "helpfulness": "2/2", "author": "Observer of the Scene"}, {"rating": 5.0, "review": "Would be a lot better if it supported 4k hope there i s a fire tv coming soon otherwise great product would reccomend", "verified": true, "helpfulness": "0/0", "author": "pat miller"}, {"rating": 4.0, "review": "I don't own one and am thinking of getting this but I wanted to know if it replaces cable TV.", "verified": false, "helpfulness": "0/1", "author": "Professional Herbalist \"Avid book lover and geek/herbalist\""}, {"rating": 4.0, "review": "Great quality and love the feature set. Only wish FireTV could control volume. Hate having to use 2 remotes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the fire.  I'm planning on taking it with me on a trip so I can have all my favorite shows and music where ever I go.  Great quality.", "verified": true, "helpfulness": "0/0", "author": "Clgood"}, {"rating": 5.0, "review": "We love Amazon Fire TV, even more than we thought we would. Haven't had it long enough to play games or use some of the other features...The streaming is good. A glitch every so often, but not worthy of it being a problem. I got it for a great price, 50% off with the sling tv subscription. The voice search is handy and saves time and frustration. I am very pleased with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Shirley E.Ontiveros"}, {"rating": 2.0, "review": "I anticipated getting so much more with this device.  The app for Spotify is absolute garbage.  If one of the reasons you're interested in Fire is to stream your music, I suggest you look elsewhere.  I haven't been able to mirror my iPad either.  It seems like Amazon is sacrificing a ton of functionality to protect its exclusivity.", "verified": true, "helpfulness": "1/2", "author": "Zzz39"}, {"rating": 5.0, "review": "Works great! Love it. Fast and smooth. Will buy another.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 5.0, "review": "its very nice and is worth the money", "verified": true, "helpfulness": "0/0", "author": "ANDRE HUNTER"}, {"rating": 4.0, "review": "cut the cord. While this is not as convenient as a cable or satellite subscription, it does have the appeal that its free access as a amazon prime member. With this and an outside TV antenna, You still have a large amount of viewing options available. go with a sling TV account for 3 months and it knocks off $50.00. free if you get the fire stick. cancel before the end of the 3 month trial and you will have gotten 3 month of sling TV for free. ( means you will have paid full price for the Fire TV box but you were going to buy that anyway.)", "verified": true, "helpfulness": "0/0", "author": "R. Avera"}]