[{"rating": 5.0, "review": "I love this product.  So easy to set up.  My apartment building recently changed our wifi to a vpn, so I couldn't use chromecast anymore.  This was the perfect replacement because it's everything I had and more.", "verified": true, "helpfulness": "0/0", "author": "C"}, {"rating": 5.0, "review": "It is simple to setup...when I open it, my prime account is already there. So Amazing. It does take time to update the software when you first open it. Remember the center of circle is Enter key. Very fast and much clearer to watch compared to Xbox 360, which I have one for more than 3 years with about $50/year to maintain the capability to watch Netfix for Amazon prime. Fire TV is fantastic. The Voice search is a treat. The design is simple but very comfortable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"stanford scheller\""}, {"rating": 5.0, "review": "Received my new Amazon fire today and the device is wonderful and the picture quality is outstanding I would say the Amazon Fire is worth the money", "verified": true, "helpfulness": "0/0", "author": "Vincent"}, {"rating": 1.0, "review": "did not find it to be as good as they said have prime 30 day trial have to pay to watch 5 - 10year old movies .", "verified": true, "helpfulness": "6/17", "author": "vic frankiewicz"}, {"rating": 5.0, "review": "This is a great (fantastic)  video streamer ! , Very well made, looks great in my living room , very high tech! (lovely).Works perfect! I can't communicate more that most new users  have already about the product. The reality is that Fire TV is all that...... Perfect.Apple Inc, should be concern. Very concern.", "verified": true, "helpfulness": "1/1", "author": "Lovely Texas"}, {"rating": 5.0, "review": "I am a fan of all the amazon devices so far. I have owned a kindle since the first gen as well as each iteration of the fire. So, when I saw that amazon was releasing a tv streaming device I jumped on board.Out of the box it worked great. Though I had a problem with getting netflix to work for about a week everything else worked instantly and streaming quality was amazing. Voice commands are awesome and with some time and tweaks will be even better. The only complaint I have is there is no real good way of separating and searching for the prime eligible videos from those that are not. If you are searching for a video and don't want to spend any money it will take you some time. All in all this is the best streaming device I have used.", "verified": true, "helpfulness": "0/0", "author": "darthhiggy23"}, {"rating": 4.0, "review": "I like my Fire TV because it gives me access to my Amazon movies, TV shows, games and movies. It needs more channels and I hope that comes with time. The downside to it is that I don't have ANY pics or music in the Amazon ecosystem. I really just watch movies, watch videos (Vevo) and TV shows on it. I'm waiting on the controller to come out so my kids (and I) can play games it. I need more in the Amazon ecosystem to take full advantage of it.", "verified": true, "helpfulness": "0/0", "author": "E. Anderson"}, {"rating": 5.0, "review": "I purchased this Amazon fire TV a couple weeks ago all.  I thought it was way too good to be true and so took my time to finally install it.However, what I have seen tonight after working with it this is every bit as good as they say and probably far better than I've been able to figure out at this point!  To say it is awesome is an understatement.This is my first night using it. I am not much in the gaming and my controller is on order.  However, from what I am seeing tonight, this is great.And I must tell Amazon, we the people in Florida hate you for the way you have sold.  Build warehouses somewhere else and don't screw us with the tax.", "verified": true, "helpfulness": "0/0", "author": "Iron Mike"}, {"rating": 5.0, "review": "I have a RUKU and Apple TV.  This is head and shoulders above both of them.  I highly recommend the Fire TV to anyone interested in a media player.", "verified": true, "helpfulness": "1/2", "author": "Reviewer"}, {"rating": 5.0, "review": "I was actually nervous with the many mixed reviews. I originally was using a wii to watch Hulu,Netflix, etc. I hated the wiimote and I wanted to get out from under the wii in general. So I took a Chance on the amazon fire tv which I am very glad I took that chance. It is flawless. I haven't had a problem watching any of my shows on Hulu, Netflix, Or even amazon prime. Actually, I just finished watching the full 3rd Season of Teen wolf in between Amazon and Hulu and it was perfect. I got a couple of free games and they've worked perfectly as well...Not to mention that I love the whole Speech Recognition thing. It works unimaginably good. I definitely would recommend this to a friend.", "verified": false, "helpfulness": "0/0", "author": "Jamie L. Crafton"}]