[{"rating": 1.0, "review": "Downloaded all the time", "verified": true, "helpfulness": "1/5", "author": "Momo"}, {"rating": 5.0, "review": "I love this thing!", "verified": true, "helpfulness": "0/0", "author": "Joanna P."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 4.0, "review": "Had a love/hate relationship with this thing for a few months.  It worked great for the first few months.  Super fast response time.  Super fast buffer time (never lagged).  Then all of a sudden for a few months it would barely work.  I'd start a movie and it either wouldn't play it or it would reboot.  It was very frustrating and my wife almost threw it out the window several times trying to watch The Good Wife, to no avail.  However, recently it's worked perfectly again so I'm not sure what the problem was.  Hopefully it's been fixed for good.", "verified": true, "helpfulness": "0/0", "author": "Ryan S."}, {"rating": 5.0, "review": "Really neat - love the voice actuation feature.", "verified": true, "helpfulness": "0/0", "author": "Charles Prewitt"}, {"rating": 4.0, "review": "Amazon Fire is great, the one thing that would make it WAY better is if you could do voice search across all apps for programming and not just PRIME programming. OR EVEN if you could just do search across all apps for programming like you can do on ROKU where it tells you every outlet that has a piece of content and the pricing on each outlet. This is the only thing I liked better about my ROKU player.", "verified": true, "helpfulness": "0/0", "author": "Robert F."}, {"rating": 5.0, "review": "Easy to use and set up.  Provides variety and flexibility in viewing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Had to increase our internet speed to operate but so far am enjoying it.  We're in a rural area without cable access so this is a nice complement to our viewing options.", "verified": true, "helpfulness": "0/0", "author": "Bev Mauerman"}, {"rating": 5.0, "review": "MY HOUSE IS ON FIRE NOW. thx", "verified": true, "helpfulness": "0/0", "author": "Jason Ryan"}, {"rating": 3.0, "review": "so far we're only using it for Allrecipes.com videos. The netflix account doesn't provide sound for some reason, we think it just might be Netflix issue. We also don't have Hulu Plus or anything. it's very fast though and i love the display.", "verified": true, "helpfulness": "0/0", "author": "Tmoney"}]