[{"rating": 3.0, "review": "Product is almost buyer beware. Hit or miss if it will work after it flashes the current system update. I own three that function fine. Fourth one after booting up and registering died during a soft reboot. No lights, no power, nothing. Amazon was quick to send a replacement which behaved exactly as the first. Ran five minutes, when rebooted never again came to life. Just dropped and then dead. No lights, no power. I'm figuring they've done something to the firmware to try and circumvent the hackers with that efuse crap or whatever it is but instead it is just killing the box. Now Amazon says they can't replace it because they've already sent a replacement for it. Looks like we'll be pushing for a return and refund. Didn't really get the unit for Amazon content anyway but the Prime material was nice since I had Prime anyway.  I'm not going to recommend this to anyone else unless they specifically want to access Prime video on their tv. There are other boxes close to this price range that can run other apps that aren't hindered by Amazon's quest to keep you in their environment only.", "verified": true, "helpfulness": "3/3", "author": "JOE W HOLT"}, {"rating": 5.0, "review": "It was easy to install, worked right away, is comparable in price to its competitors.Also, Amazon Prime is easy to navigate and is also comparable to its competitors.", "verified": true, "helpfulness": "0/0", "author": "M. Travis \"cricket\""}, {"rating": 5.0, "review": "easy to use great product", "verified": true, "helpfulness": "0/0", "author": "Tim127"}, {"rating": 5.0, "review": "What a brilliant concept and a most functional product! I used to spend significant time coding titles of movies into the television, punching one-letter at a time via a remote control. This Amazon FIRE TV is perfect at voice recognition and was 100% successful from initial setup! It's an absolutely amazing product and now I can easily view and access all Amazon's video library with my voice; almost an impossibility using the touchscreen. This system works flawlessly and is so simple to use and the box is barely noticeable under my television. Just can't say enough good things...........", "verified": true, "helpfulness": "1/1", "author": "Analytical Consumer"}, {"rating": 5.0, "review": "Very quick. Great HD and digital surround quality. Small package big in features.", "verified": true, "helpfulness": "0/0", "author": "Steven E. Axne"}, {"rating": 4.0, "review": "Excellent device -1 star for overly limited gaming options.  I don't see why I can not play more Android based games when I have the fire controller as well.  Games like Shadowrun, Baldurs Gate, or many of the Tier 1 games can't be played and I know its not a hardware/power issue so whats up Amazon?  If they fix the gaming on this will give it 5 stars.  There are a few decent titles but a lot of the games on here are phone games that are for being bored waiting on a plane or in a bus/train.  Not meant for couch gaming, I understand this isn't a gaming device but that is pretty much the reason to upgrade this over the fire stick so make it worth it.  For everything else its way better than the roku 1 I had or useless chromecast.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE my amazon fire TV so much, I got one for my daughter also.  I love the parental settings on it.  She can only see and choose the movies and channels I allow! Awesome!", "verified": true, "helpfulness": "0/0", "author": "BBQ Girl"}, {"rating": 5.0, "review": "Kindle Fire TV is great! I don't have cable, so I just watch Prime and use Netflix. My only issue is that sometimes it doesn't connect when I select it from my t.v.", "verified": true, "helpfulness": "0/0", "author": "Meghan K. Reid"}, {"rating": 4.0, "review": "At first this device was awesome, but then you know you use a device for more than a day and you start to find out its \"quirks\".- Netflix app on FireTV - once and awhile you have to \"clear the cache\" as the darn app will cause the firetv to run amock. My nexus player - doesnt have this issue. So you clear the cache, then have to re-login to get netflix up and running again.- Amazon Free Play - if you have bought one of these \"tablets\" or the service, it automatically allows your firetv to enjoy the same benefits. GREAT for a 4 year old who needs to read books and play games right on the tv.- PLEX for Android on FireTV - Plex has been doing some SHADY business practices lately requiring a \"plex pass\" to use thier plex app on PS3 / PS4 and XBOX 360 / ONE. But if you paid for PLEX for Android off the Amazon marketplace you can install the app here too and use your plex server with no PLEX PASS required!- Games - didnt think it would be worth a damn to get the game controller. boy was I wrong. GREAT for playing android games and for free time.So do yourself a favor and buy this thing while its on sale. Best investment I ever did. Also I bought this to replace my old Apple TV2 and have never looked back.", "verified": true, "helpfulness": "1/1", "author": "RubAnADUB \"Customize it, as stock is never all that.\""}, {"rating": 5.0, "review": "I've tried just about every type of streaming TV unit available on the market and Amazon Fire is far and away the best (assuming you have a Prime membership). It runs on the android platform which is amazingly stable. I love the customization as well.The fire TV makes heavy use of Prime videos and nearly every app you can imagine. We were able to completely get rid of our cable (~$170/mo) and buy 3 fire TVs to replace everything. If you haven't gotten one of these yet, do your self a favor and buy one. The picture quality is crisp and clear and this little $99 unit will blow your mind with all of its robust features.My only complaints are mostly cosmetic. I'd like to see a bigger remote (I lose mine all of the time), but there is a remote app I can use in a pinch. I'd also like to see an Amazon branded keyboard. A keyboard is NOT needed, it's just a preference.", "verified": true, "helpfulness": "2/2", "author": "Ryan"}]