[{"rating": 1.0, "review": "Right when I plugged this thing in, it started stuttering and locking up.  Now during any show, regardless of the app, there is a constant stutter in the picture.  I bought this because a friend had recommended it but so far I like the Roku3 we have had for a year WAY better.", "verified": true, "helpfulness": "0/4", "author": "Jason"}, {"rating": 5.0, "review": "Goodbye, cable. I shouldve done this a lot sooner.", "verified": true, "helpfulness": "0/0", "author": "Christopher L. Stine \"clstine\""}, {"rating": 3.0, "review": "Sleep mode is not working", "verified": true, "helpfulness": "0/2", "author": "Paul Man"}, {"rating": 5.0, "review": "SOOOO AWESOME! We got a second one for our bedroom and the apps and downloads show up on both devices. We'll never go back to regular cable! Only issue is our cable provider doesn't give us access to HBO GO but that is an issue with Xfinity.", "verified": true, "helpfulness": "0/0", "author": "Kelsey"}, {"rating": 5.0, "review": "Great product.  I ordered this at $99 and, when it went on sale a few days later, I emailed Amazon and they immediately refunded me the difference before I even received the thing.  Love this product...it is way better than a similar fruit-related product which I also own.  Would recommend this to anyone...", "verified": true, "helpfulness": "0/0", "author": "Jerry M Harre"}, {"rating": 5.0, "review": "Good prduct work perfect", "verified": true, "helpfulness": "0/0", "author": "tito"}, {"rating": 5.0, "review": "I wish this had been available years ago. I am so glad that I got rid of satellite tv. There is a lot of great programming available and I'm saving about $60 per month...", "verified": true, "helpfulness": "0/0", "author": "Kandi Crill"}, {"rating": 5.0, "review": "Good for kids and adults", "verified": true, "helpfulness": "0/0", "author": "C & C Pillion"}, {"rating": 5.0, "review": "Fire tv is just amazing. The amount of potential this box has is pretty epic. I now understand why its $100. I'm definitely buying another soon. The roku doesn't even compare (after owning it and returning it) to the fire tv.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 3.0, "review": "Good general purpose media box.  Using Netflix only, the box needs a power cycle once in 2-3 weeks, or the video becomes choppy.  This is with a wired ethernet connection, and when the video gets choppy on this box, the same video streams fine on the PC.", "verified": true, "helpfulness": "0/0", "author": "Y"}]