[{"rating": 5.0, "review": "Much easier for wife to use than old PS-3.  I like it because you can hardwire it through your Ethernet cable. I was using Chromecast but had too many connectivity issues. The sound and picture quality are a WHOLE lot better than Chromecast.  The picture quality is better than my PS3 as well too.  Netflix movies looks great and pay per view on Amazon is great too!!! Best purchase I've made in a while.", "verified": true, "helpfulness": "9/9", "author": "Ken Wohleking , Road Warrior"}, {"rating": 5.0, "review": "I love it. Very easy to use and fast. Loading times are quick and snappy. Great interface, that is easy to use, even for my kids.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my Amazon Fire TV.  Works great, easy to use and great customer support from Amazon", "verified": true, "helpfulness": "0/0", "author": "Chet"}, {"rating": 5.0, "review": "Works great, smooth interface.", "verified": true, "helpfulness": "0/0", "author": "JayAZ"}, {"rating": 4.0, "review": "Does everything (except my iTunes library of course) that I need it to do. Setup was easy, video and audio are great. The only complaint I have, and it is a small complaint, is the side-scrolling menu system bothers me. It is inefficient and not the best way to find anything. The voice search helps a little with that, but I believe the menu system could use a lot of improvement.", "verified": true, "helpfulness": "0/0", "author": "RR#1"}, {"rating": 4.0, "review": "Changes needed: the release of voice search on Hulu and Netflix, being able to search directly for free Prime movies, you have to pay for too many movies and shows.", "verified": true, "helpfulness": "0/0", "author": "Mags"}, {"rating": 5.0, "review": "I love it. I am the ultimate fan of old movies. With amazon fire TV and prime I am content.", "verified": true, "helpfulness": "0/0", "author": "J. McClure"}, {"rating": 4.0, "review": "I will change it to five starts when they get HBOgo app running. It has been promised by the end of this year.", "verified": true, "helpfulness": "0/1", "author": "FlemFlam86"}, {"rating": 5.0, "review": "Love it! It arrived quickly, was a breeze to set up, and we used it the first night! I love the screen saver photographs as well - I'd like if it would be possible to see those photos while playing music but they're great if you pause or on the home screen. We use the Amazon Prime video streaming or Netflix video streaming at least a few times a week. The voice search is not always accurate, but maybe I'm not clear enough? Overall, I'd highly recommend it and have already talked my parents into getting it after showing the free prime videos available. I also would love to add that we're able to use the remote through a solid cabinet door without needing to buy an additional Rf transmitter and receiver like we did for our cable box, and DVD player, etc., we are able to hide it away and it still works!", "verified": true, "helpfulness": "1/1", "author": "Charm"}, {"rating": 5.0, "review": "The main reason I went with FireTV over Apple TV was the ability to stream Amazon. As an Amazon prime member, this was key to me. The only negative I have is that the audio is digital, and my (very expensive) Harmon Karden Zone 2 is analog. This is actually more of a knock on the Harmen the the Fire TV. I have ordered an adapter for Zone 2, and hopefully that will solve the issue. The Fire TV is so so so much faster then my \"smart\" DVD player was. I love it!", "verified": true, "helpfulness": "0/0", "author": "Kalee Blythe"}]