[{"rating": 2.0, "review": "Needs MAJOR improvements. The once free tv shows I watched last week are no longer free. Which is a HUGE disappointment and I'm now wondering why I purchased a prime subscription. I attempted to watch a documentary this morning and it is constantly interrupted by McDonald cafe commercials. It's occurs so often, and in the most inappropriate times that I didn't finish watching it (extreme disappointment since it was a great documentary). Not to mention they are ALL the same McDonald commercials. Streaming is stop and go, and interrupts the continuation of the documentary, which when it doesn't start it jumps to MULTIPLE McDonalds commercial. I'm so annoyed by the commercials that I have zero desire to sip a cup of McDonalds coffee.  Buffering issues need to be fixed, the once free tv/movie shows need to return as free, commercials with in shows need to be removed (before/after ok). We're hoping this will change since we waiting for amazon tv to be released and decided against Apple TV, however Apple TV seems to be back on the table.", "verified": false, "helpfulness": "4/17", "author": "veronica anderson"}, {"rating": 3.0, "review": "Amazon Fire TV: Thoughts So FarPros:1) Fast Searching and Watching. Everything loads up nice and quick.2) Thumbnails of the shows/movies are a nice feature.3) Voice search mostly works well.4) Some random shows available for free through apps.Cons:1) Non-intuitive app controls, depending on the app.In the Vevo app, sometimes Back will take you out of the video you're in, sometimes not (requiring you to hit Home and go back in the app to change videos).Or in iHeartRadio, hitting pause and back to exit the app works, until you hit play in another app, and then you unpause iHeartRadio and you're playing your music/movie from another app.In Pandora, selecting certain choices from one part of the app, like Start New Station, doesn’t work at all, and you have to find the same choice somewhere else in the app to make it work.2) I can’t emphasize enough how frustrating it is when the app navigation doesn’t work. It's a mess and needs to be standardized across all apps.3) There’s a USB connection that does… nothing. Yet. Hopefully there will eventually be some way to search an attached USB drive, for an easy way to access music, movies, and photos.So, yeah, I early adopted it and now I need to deal with its troubled youth, but I’m still surprised at how buggy it feels. If I only watched Amazon Instant Video on it, the experience would probably be fine. But I could already do that on my PS3, so that’s nothing special. They need to fix the rest of the experience or the Fire TV is going to go <<puts on sunglasses>> up in flames.", "verified": true, "helpfulness": "1/4", "author": "Andy Goldman"}, {"rating": 4.0, "review": "Performance is excellent in every app I tested. Prime, Netflix, and Plex all work great with no usage issues. I am a little disappointed that the voice search feature doesn't work inside apps like Plex. Another item of disappointment is that there doesn't appear to be any way to filter the display to only show free products and shows. If amazon corrects these 2 short comings I think they may very well have a top tier product on their hands.", "verified": true, "helpfulness": "2/3", "author": "Kelly Slavens \"kwslavens\""}, {"rating": 2.0, "review": "The unit is unique look and has style.The price is way too high considering many option in the same price range have dvrs or ability to records.I should include prime or at the least the movies free to rent.Its not interactive with a PC like Xbox and others have done for years, so again another option missed.If Amazon wanted to be innovative they should have made it different, not just improve and put fresh paint on what was donealready for years.I know many people love what Amazon does and the Kindle line for the most part is and example on Innovation.The Fire TV, is nothing specials. Sorry amazon, in two years this will be old news as you did not create something new on your ownyou just reinvented the wheel. You need to hire CEO's that are visionaries.", "verified": false, "helpfulness": "4/16", "author": "MrBuzz"}, {"rating": 5.0, "review": "So many viewing options!User friendly for non-Geek guys like me!Easy to install!Pre-registered in my name once I bought online thru AmazonBest purchase I've made in a long time.", "verified": true, "helpfulness": "3/4", "author": "2020"}, {"rating": 4.0, "review": "Pros: + Set-up was very fast and easy.  I'm not sure how but the device already knew which Amazon account to link me to.  Very nice. + It's very fast and responsive.  Better than my Roku. + It shows pretty pictures when I'm not using it turning my TV into a cool \"art\" showcase. + You Tube!Cons: - Come on Amazon... let me use voice search in all my apps.  I want to find videos I can watch on my Netflix account too.  At least integrate \"voice recognition\" into text fields on any app so I can speak what I want to type. - Mirror cast has never worked well.  Fix it!  On this new device, I can set up a mirror cast only one time after a fresh re-boot of the Fire TV.  Then, when I try to do it again, it always fails.  The devices start to talk, but then they time out before the video is established.  Sucks.", "verified": true, "helpfulness": "2/3", "author": "Joshua B Kilpatrick"}, {"rating": 5.0, "review": "If you are thinking about which ecosystem to use - Apple's or Amazon's, this device could well tip you over to the Amazon content system.  I have a fair amount of video already on Apple, but the Prime content is so good, I have been gradually switching over to Amazon because of the Kindle Fire HDX.  This device will accelerate that process for me - I don't think I will be buying another AppleTV, but I will be buying more FireTVs.My main impetus for writing a review, however, was to give a shout out to the absolutely gorgeous photography in the included screen saver.  It's a real pleasure just to watch the various photos cycle through - each one a window into a scene I would love to visit.  I would gladly pay a subscription fee for regular delivery of additional photos of this quality.  (I only wish the menu button on the remote would bring up details about each photo instead of throwing you out of the screensaver.)", "verified": true, "helpfulness": "5/6", "author": "Kindle Customer"}, {"rating": 5.0, "review": "this is what i was waiting for a long time...love it ,,,,,recomand  this 100% . very easy to setup ,perfect HD,,voice search is easy and accurate.  thanks amazon", "verified": true, "helpfulness": "3/3", "author": "shane"}, {"rating": 3.0, "review": "i would have bought it if it had hbo go, but it didn't. too bad. maybe in the future they will add it.", "verified": false, "helpfulness": "1/13", "author": "Phantasy reader"}, {"rating": 1.0, "review": "I picked this up with the controller as a little gaming getaway for another room of the house as well as the movie streaming, but I've had to unplug this machine multiple times just on the set up freezing or having connection errors. Have to click multiple times on anything for it to register. Device will work for about 30 seconds and then won't connect or display anything. I haven't even been able to watch a movie or play a game yet. Maybe the servers are being overloaded, but seems odd.  Waste of money so far.", "verified": true, "helpfulness": "15/28", "author": "Kyle Johnson"}]