[{"rating": 5.0, "review": "I just received mine today 4/7 and it was so easy to install and set up.I love the voice commands as I have many, many movies in my library and this eliminates having to scroll through them to find one.  I know some people would say that is a lazy way to do but the option is there so why not take advantage of it.One thing that surprised me are the screensavers.  They are so beautiful.  I was not expecting them.  They come on a few minutes when you pause your movie.I am really glad I purchased this device.  My son is going to use the ROKU box that I was using.", "verified": true, "helpfulness": "6/6", "author": "Sue"}, {"rating": 1.0, "review": "On my new amazon fire tv controller I have to pay for tv episodes that I get for free on my kindle fire from hulu plus,Netflix and get this, even on amazon pime ,but with the amazon fire tv controller you have to pay for it,shame on you amazon sometimes the sound is distorted will I recommend this item at this time not until amazon work out the bugs", "verified": true, "helpfulness": "15/48", "author": "james coleamn"}, {"rating": 5.0, "review": "OK, I admit to being easily amused, but Fire TV just blows my mind!  Is this the best screen saver EVER???And finally we get true Dolby sound from a streaming device, and the lips actually follow the sound! :)It connected instantly to my wireless network with no lags or buffering like my Roku or Tivo.I am impressed!", "verified": true, "helpfulness": "6/6", "author": "Ron Hughes"}, {"rating": 2.0, "review": "This box is great except there is no HBO go. I tried it out at a friends house and its cool if you watch a lot of Netflix and instant prime but I watch HBO go more often than either of those I can watch all 3 on my xbox so why spend the money just for voice search? The bottom line is if it had HBO go I would buy one tomorrow. No HBO go then no sale", "verified": false, "helpfulness": "3/17", "author": "Lockmandan"}, {"rating": 3.0, "review": "Looked good out of the box.  Packaging was top notch and the device looks really nice.First bad sign.....I ordered this device the day I saw it released.  Received it promptly.  Set it up and it spend 10-15 minutes updating itself.....hmmmmm....first official release and immediately it is playing Microsoft update......I would have expected it to be shipped with the most current firm/soft ware.Watched a movie on it and was very impressed.  Flawless playback.  Very nice.Second bad sign.....interface for entering passwords is screwed up.  Don't get your password wrong, even by one character....you will have to start over.  Tried over and over again to get Pandora to work.....gave up.....which leads to my third bad sign....Third bad sign....Pandora....yes I know my password....I use it on my tablet, my phone and on 3 desktops.....Amazon...first of all I should not have to start over every time I need to correct my password....and two...I know my password.....fix the Pandora app.....gave up after this, don't have the patience for stupid.I will look at other features tomorrow when I have time.....in the mean time, Amazon, let Microsoft ship crap, they are good at that....you stick to sending us good stuff.......you are, or at least were, good at that.....", "verified": true, "helpfulness": "6/17", "author": "Raymond O'Connor"}, {"rating": 5.0, "review": "I dumped cable TV about five years ago and have been streaming video since.  Used Fire for a few days now.  Simplicity.  Convenience. Intuitive.  Replaces use of Xbox for watching Amazon movies (paid in ass remote). Works much better than Amazon through Samsung apps on TV/DVD.  The video quality is top notch though not as good as blue ray.  It just works well, really well.  Wife loves it too.The ONLY thing missing is volume control.... Would love to have a programmable volume and power off button for my TV on the fire remote.Bravo Amazon.", "verified": true, "helpfulness": "3/3", "author": "Lewis Chamberlain"}, {"rating": 1.0, "review": "You are wasting your money, chances are, your cell phone has better specs, and hdmi-out,Just another cheap Android based money box..", "verified": false, "helpfulness": "6/63", "author": "Bob"}, {"rating": 3.0, "review": "Bluetooth audio out would make cabling so much neater.The problem in a nutshell:The Screen and the Projector are meant to be far apart  Bluetooth sound bars are meant to be near the Screen  Video sources are meant to be near the Projector.But the only way to get audio from the FTV to the soundbar is with a cable (either optical or hdmi)... so instead of having this beautiful setup:IMAGE:  [Projector] >>>>>>>>>>>>>>>>>> [Screen]SOUND:  [FireTV]  b-l-u-e-t-o-o-t-h  [Soundbar]... I need to do this (ugh):IMAGE:  [Projector] >>>>>>>>>>>>>>>>>> [Screen]SOUND:  [FireTV]====C==A==B==L==E==S===[Soundbar]I was hoping that a Bluetooth dongle in the FireTV USB port would make the FireTV \"pair-able\" with the soundbar, but no luck.How can I avoid cabling between the FTV and the Soundbar??", "verified": true, "helpfulness": "2/4", "author": "mmmmmmm"}, {"rating": 1.0, "review": "I have tried to rewrite my review so that both technically inclined and the not so much can benefit:)Here are list of questions to ask your self before you buy something like this:Q1 - Is this right for you?A1 - If you have or are getting an Amazon Prime account and that is pretty much what you are going to stream aside from Netflix and Hulu One; then yes, this is a good fit for youQ2 - Will it work with my Apple Items?A2 - If you bought the Videos through iTunes, No.  If you bought music through iTunes, it might; MPA? No, MP3? Yes.Q3 - Do you have a lot of videos and music you have ripped yourself?A3 - This device supports a limited amount of video audio formats.  If you are using a lossless codec whether in Video (MKV) or Audio (FLAC); the answer is not supported.  If you have ripped your movies as ISO's, the answer is no.  So for the more advanced user...this is not the best choice.Q4 - What is the speed of this device?A4 - It depends on what you are doing or trying to do with the device.  It should run fairly well without any issues, the hardware is stable but the software...in this case, Android Jellybean is not really designed for Native HD video and sound.  It can do it, just not as well as software designed from the ground up to do it.Q5 - What is the wireless network speed?A5 - The wireless is a standard \"N Class\" which means theoretically, it will go as fast as anything else you have hooked up.  Jellybean has ALWAYS had problems with Dual Band Connectivity and so you will see this as slower than what you want to are happy with.Q6 - What is the \"wired\" speed?A6 - This is a standard 10/100 networking speed which was actually standard about 10 years ago.Q7 - I just want something to plug in and never have to hassle with and have it do what I want, is it right for me?A7 - Perhaps.  I have yet to come across a piece of equipment that will do that for somebody and while sometimes they are happy for a month or two...Q8 - I am a bit more technically inclined so is this right for me?A8 - No.  You will be much happier with a Minix Neo7 or something like that.  They will be rolling theirs out here in another couple of weeks if not sooner and the holdup has been getting KitKat on to them.Q9 - What other devices have you tried?A9 - I have an Apple TV 1st, 2nd & 3rd Generation, a WDTV Live and Live Hub, A Roku 3 and a Minix Neo7 with XBMC on it.  The Neo7 is nothing short of amazing and you can tell it was designed by people who enjoy devices like this.  XBMC for those who are wondering has been around for about 10 years so it is rock-solid stable.  The Amazon Fire is an iteration of a board room meeting where someone said lets put out an Apple Equivalent...Apple TV for iTunes, Amazon Fire for Prime.  Minix is the One Ring that rules them all...I do not address PLEX on this because I do not use PLEX and do not think it is worth the time.  I know people who love it, I know people who hate it.  But, with a good box, you should not need it.", "verified": false, "helpfulness": "9/43", "author": "Jedi_Donkey"}, {"rating": 5.0, "review": "I used to use my Blueray player to watch Netflix. It worked, but took forever before I could actually get the show playing. That is not the case for the Fire TV. In a matter of seconds you can browse and start a movie. The Fire TV doesn't do everything (i.e. HBO, streaming media), but what it does do...it does perfectly. I'm using Wifi and the quality of Netflix, HuluPlus, Pandora, and Amazon content is great. The device is tiny and can be easily tucked away thanks to the Bluetooth remote.", "verified": true, "helpfulness": "2/3", "author": "SDTim"}]