[{"rating": 2.0, "review": "Very dissapointed in the Fire Box, my Roku worked so much better.  I don't have the greatest internet and the Fire TV box connects intermittently.  We try to listen to music and it plays a bit, stop, play a bit, stops completely.  Very frustrating.  I bought the Fire Box and moved the Roku to another TV downstairs, may just have to go buy another Roku since it had no issue connecting at all.  And the Hulu app for the Fire TV is horrible (watch on the Fire Stick downstairs), the video freezes and the audio keeps going.  Happens constantly, so I have to watch via Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Julie Sloan"}, {"rating": 5.0, "review": "We LOVE it!!", "verified": true, "helpfulness": "0/0", "author": "Amie Rea"}, {"rating": 4.0, "review": "I am very pleased with the Fire TV. I do not want the pricey premium cable services and find this a reasonable alternative. I'm already a Prime member, so I like streaming from that. And the voice search works pretty well. I'm glad I got this rather than the stick.", "verified": true, "helpfulness": "1/1", "author": "Lynn"}, {"rating": 4.0, "review": ".Very easy to instal and use. I have both this and the Android one. Both are equally useful and comes in handy.", "verified": false, "helpfulness": "0/0", "author": "Nelly Farbo"}, {"rating": 5.0, "review": "Researched Apple TV, Roku and Fire TV.  I had planned on getting Roku or Apple TV since I had used both of those in the past, but decided to get this in the end because it got great reviews and streamed Netflix and Amazon Prime.  So glad I got it.  I won't comment on the specific technical aspects - other reviews have - but it is incredibly easy to use and so much more reliable than Roku or Apple TV.  There is no problem connecting to the TV or my sound system and the WiFi is solid - very rare buffering pauses and it never disconnects.  Plus, it is so user friendly that even my elderly parents (who are overwhelmed by my DVR) were able to use and navigate the entire thing.My only complaint is with the voice control.  For whatever reason there seems to be a bug and if I try to activate voice control it instantly starts searching before I have a chance to speak.  Minor complaint, because the text search works so well.", "verified": true, "helpfulness": "0/0", "author": "Noodloo"}, {"rating": 5.0, "review": "So happy to be off cable !!!! Love the voice command remote feature.", "verified": true, "helpfulness": "0/0", "author": "McLovin"}, {"rating": 5.0, "review": "So easy to install and navigate. Voice search is good. Nice to find the things for the kids without having to buy a whole dvd.", "verified": true, "helpfulness": "0/0", "author": "Jim.winegeek"}, {"rating": 5.0, "review": "It is easy to use and small.  I use mine mainly to watch Netflix and my son uses it to play games.", "verified": true, "helpfulness": "0/0", "author": "Sarah Cook"}, {"rating": 2.0, "review": "I love Amazon, love Prime.. I used to connect to Prime instant video and Netflix through my son's Wii just fine.  I bought this for the convenience ( or a least that was what I expected.. ) and to give my son his Wii back.First unit - received fast, set up was easy - it worked perfectly - it went to sleep and the next day I could not get it to turn on.  I tried all the trouble shooting - called Amazon - they sent out a replacement.Second unit - same exact thing happened again.Called Amazon again.. am now being told that it is a KNOWN issue and my number is to be added to a list for the engineers to look at - they will get back to me tomorrow - a replacement cannot be sent at this time.Would this be acceptable to you?", "verified": true, "helpfulness": "0/1", "author": "Carol Mevoglioni"}, {"rating": 4.0, "review": "Can you leave this plugged in & stay connected at same time to Direct TV? Also if you are Prime member do you only have access to Movies only marked Prime? Same with Hulu?", "verified": true, "helpfulness": "0/0", "author": "Rachelle K."}]