[{"rating": 5.0, "review": "Awesome box. Has a lot more options than some of the other boxes", "verified": true, "helpfulness": "0/0", "author": "joe rovira"}, {"rating": 3.0, "review": "Apparently it was refurbished because it had someone else's name on it. I shouldn't blame the equipment. It was a gift from my company. Aside from that it works fine.", "verified": true, "helpfulness": "0/0", "author": "Melissa Diesing"}, {"rating": 5.0, "review": "Much better than the stick!", "verified": true, "helpfulness": "0/0", "author": "Herman A. Brown"}, {"rating": 1.0, "review": "Wish there was a rating for zero star", "verified": true, "helpfulness": "1/6", "author": "Charles James"}, {"rating": 5.0, "review": "Love Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Jeanne Platano"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "wesley thomas"}, {"rating": 4.0, "review": "Easy to set up and use. Much cheaper than cable even when other services are added. I now get to decide how much I spend on tv and what I watch.", "verified": true, "helpfulness": "0/0", "author": "JACQUELINE"}, {"rating": 4.0, "review": "It arrived quickly and was very easy to install.  I'm a prime member and had no difficulty finding free prime content.  The one thing keeping me from giving it five is that my son don't like playing games on it too much.  For example, when he plays a Sonic game, he finds that Sonic moves even when he isn't pushing the forward button on the controller and the same is true when he plays Minecraft.  Besides that, I would recommend it for anyone who is looking for an alternative to cable.", "verified": true, "helpfulness": "0/0", "author": "pauline felizardo"}, {"rating": 5.0, "review": "Everything I was looking for. I think only a TiVo box that can tie my regular TV, a guide, and my internet channels together would exceed this. Very easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "John N"}, {"rating": 4.0, "review": "Good player", "verified": true, "helpfulness": "0/0", "author": "roy tjandradjaja"}]