[{"rating": 5.0, "review": "excellent, easy to set up, easy to use, cheap and  finally freedom from cable TV. Currently we have only the living room connected. we are mostly a 1 room tv family.  great picture quality, no interruption in service adn with Amazon Prime, there are lots of viewing options, especially for kids.", "verified": true, "helpfulness": "1/1", "author": "esliber cisneros"}, {"rating": 1.0, "review": "Its only steaming play not the Casting player like chrome cast.", "verified": true, "helpfulness": "1/5", "author": "Rajkumar"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Enrique"}, {"rating": 5.0, "review": "Absolutely love this fire tv!", "verified": true, "helpfulness": "0/1", "author": "Norma J. McDonald"}, {"rating": 5.0, "review": "I have absolutely no complaints with this thing. It's small, fast, powerful and meets all of my entertainment needs.", "verified": true, "helpfulness": "1/2", "author": "J. Nichols"}, {"rating": 4.0, "review": "I love it...I only had one issue and that the instructions are not very clear and I had to go to my daughter who has it and ask for help.", "verified": true, "helpfulness": "0/1", "author": "Vicki W."}, {"rating": 3.0, "review": "Not quite what I was excepting but the system is ok. Hopefully I can work thru all the bugs.", "verified": true, "helpfulness": "0/0", "author": "keith"}, {"rating": 5.0, "review": "love love love Fire TV. While I do have an active Apple TV account, I just Fire TV to discover new movies and TV shows.", "verified": true, "helpfulness": "1/1", "author": "K. Cole"}, {"rating": 5.0, "review": "Absolutely love it... Better than I expected", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 5.0, "review": "Having only used gaming machine and Smart TV apps to access additional content in the past, I was hopeful that this could even come close to its claims.Wow, what a surprise! The interface is smooth and responsive, with no lag. The UI is well organized with plenty of options. There are a multitude of apps available in the Amazon App Store that can be used on this device. And, this is the absolute best way to access all the content available on Amazon Prime!I cannot compare it to Roku, but when compared to PS3 or Samsung & Sony Smart TV apps, Amazon Fire is light-years ahead.", "verified": true, "helpfulness": "0/0", "author": "Stevie Jay"}]