[{"rating": 1.0, "review": "I am unable to rate this because I guess I missed the part that I had to buy a separate HDMI cable....", "verified": true, "helpfulness": "2/11", "author": "G"}, {"rating": 4.0, "review": "Good little device. If you stream a lot of amazon movies it works great. You need to clear the data once a week or other apps may not work correctly.", "verified": true, "helpfulness": "0/0", "author": "Robert Qualls"}, {"rating": 5.0, "review": "Love love love this unit.  Gets all the radio stations and movie streaming companies.  Also lets you see photos on your tv.  Great device and easy to use.  Works with my Amazon account.", "verified": true, "helpfulness": "0/0", "author": "Kimb"}, {"rating": 5.0, "review": "OMG - This is awesome- the menu is sooo nice!", "verified": true, "helpfulness": "0/1", "author": "J. Keeney"}, {"rating": 3.0, "review": "Not user friendlyIssue with navigation.Not intuitive. Additionally I found out that manual is not on line and one need to purchase the instruction “how to” on Kindle books….. strange", "verified": true, "helpfulness": "0/0", "author": "Janusz Wypior"}, {"rating": 5.0, "review": "LOVE it!. Works right out the box and already registered to me, awesome! Very user friendly and most importantly, the wife loves it!", "verified": true, "helpfulness": "0/1", "author": "Mr. M"}, {"rating": 5.0, "review": "Good product but you can used only with an IP address in USA.", "verified": true, "helpfulness": "0/1", "author": "Miguel Blanes"}, {"rating": 1.0, "review": "This was an attempt to cut the cord but unsuccessful. Not worth it if you have a Smart TV. Only tried because I was offered a free demo from Amazon.Didn't like that they pre load your account to the device. Can't use without Prime Membership or pay $3.99 to watch Tv episodes that i can view online for free.Only good thing about this item was the remote worked very well. But I only found this out because I search through the endless categories to try and find some free videos to see how well the video looked. But I couldn't find one. The search features be need massive improvement, filter settings, sort, etc.", "verified": true, "helpfulness": "1/4", "author": "Brian Cote"}, {"rating": 5.0, "review": "Gets most of the popular streams. Easy to use", "verified": true, "helpfulness": "0/0", "author": "Beverly A. Sears \"Bird's eye view\""}, {"rating": 5.0, "review": "Great product! I bought two.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]