[{"rating": 5.0, "review": "Easy to set up, easy to use. Would buy again. Love the ability to search for a show using voice commands.", "verified": true, "helpfulness": "0/0", "author": "Barun Chandra"}, {"rating": 5.0, "review": "Thanks to Amazon Fire TV I no longer have to sit at my computer to watch certain movies, videos, or when listening to music.  I Love it!", "verified": true, "helpfulness": "0/0", "author": "Diane B."}, {"rating": 5.0, "review": "What can I say about this device that has not been said already? Like most geeks I got a chromecast the day it was announced available and I was very pleased with it. I never had a need for a smart TV since I had a dedicated HTPC setup in my entertainment hub and I was able to anything I wanted to from there.I got FireTV since there was no way for me to be able to stream my Amazon Prime video content via Chromecast, actually there was a way, but it was not simple. As soon as I plugged this in, I was floored by the richness of the experience! The UI was stunning, reminded me of the Xfinity X1, except this one actually worked! That it took me through all the steps to be able to use it kind of made me impatient, but as a Service Delivery professional I knew that this would keep the support calls down, so I slogged through it. That said, I go one for my 72 year old mom and she was able to follow instructions and get it up and running without any help, so it does work :)The selection of apps available is fantastic, I am not too much into Android games, more of a PS guy, but the fact that the device is powerful enough to run them is a great thing. The sound and streaming is beyond good and I have to say again, the fact that the UI is easy on the eyes is a blessing. I thought Chromecast did good things, but this is just a step above.The one thing I can say is that had I thought it through, I would have ordered the fire stick instead since I am not going to be gaming on it it. I can't see how anyone can fault this device.Is it without flaws, no, but then again nothing is. This device however comes close to doing absolutely everything I want. I recommend it with a caveat, if you are just into the streaming of movies, music then get the stick, if you are looking for an Android gaming experience on your HDTV then get the box.", "verified": true, "helpfulness": "0/0", "author": "Jose Bordetas"}, {"rating": 4.0, "review": "The unit is easy to install and works great right out of the box.  I have 6meg and it works great.  No problem with buffering at all.  However, I will say it is a real pain in the butt to find free movies and T.V.. I called about it and people at Amazon are real hard to get a hold of and get straight answers.  When I told them about how hard it was to get in contact with them they told me they made it that way so the owners would work harder at trying to figure it out for themselves!  Overall it is pretty good.  Much better than NETFLIX streaming....even though all movies and T.V. are free it is really hard to find what your looking for.", "verified": true, "helpfulness": "0/0", "author": "ken kiser"}, {"rating": 4.0, "review": "I love this product... Looking forward to Amazon creating a larger library for Prime and better parental controls that allow restrictions within the prime library, currently only able to restrict by category such as apps, games, or through free time. Finally, need to get HBO Now on this platform as soon as Apple exclusive runs out", "verified": true, "helpfulness": "1/1", "author": "Bryan Topnick"}, {"rating": 5.0, "review": "Installation was a breeze I just wish there was more free programing. Not the fault of the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Eric J."}, {"rating": 5.0, "review": "The Amazon Fire TV come in 03/10/15.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Senad Purisic"}, {"rating": 5.0, "review": "Thank You Amazon. Fire is the bomb!!! So handy; using my blu ray wired sucked, slow, poor resolution, etc.Fire TV delivers. HD resolution, fast loading everything I want it to do!!!", "verified": true, "helpfulness": "0/0", "author": "jjincencal"}, {"rating": 5.0, "review": "I love the Fire TV! I had a Roku 3 for a few months and returned it after 1 week. The interface did not do it for me nor the fact that it was pretty slow, yes it has a lot of apps but what do you like quantity or quality? I prefer quality and the Fire TV is that. It has great apps and the ease of using and navigating the Fire TV is awesome. The voice search works 100% of the time, I was skeptic about it but it works great! I know people have complained about this device being hard to navigate or the apps not being organized etc... but come on what else do you want this device to do for you, brew a cup of coffee. I use device for games, movies, music etc.. and what makes it even better is Amazon Prime, I prefer Amazon Prime over Netflix and yes I had Netflix for a while and I cancelled my account. I have the promotional 30 day Amazon Prime and once it expires, I am keeping it.The Five TV is for everyone, my nephews love the games and shows they can watch, my Girlfriend loves all the apps and games and movies etc.... When family come over they use it and browse around and fall in love with it, this device is fast at loading content and the controller is very simple to use specially with that voice search. Trust me, I was skeptic since I had a Roku and the first day I used the Fire TV, I knew I was keeping it. Overall the Fire TV is a real treat, it’s fast and has nice good quality apps and if you get the Amazon Prime, you will be set when family or friends or if you have Kids and or nephews, they will be entertained. If anyone is hesitating on getting this device just get it and  trust me you wont regret it.One bad thing for me as an  IT  individual was the info on the device under  ”System- About”  I expected to see the processor speed and Memory and I don’t see that and can’t seem to find that info. Also under Storage capacity it says 3.50 GB available of 5.49 GB??? To me that means I have 1.5 GB free? I thought this device came with 8 GB of Storage.. Maybe I am missing or reading the info wrong. I felt this info gives me the impression of getting less of what I was supposed to get.", "verified": true, "helpfulness": "0/0", "author": "Enrique Olmos Jr."}, {"rating": 5.0, "review": "I love it and with my Prime membership I can watch movies anytime I want.", "verified": true, "helpfulness": "0/0", "author": "Kay Parker"}]