[{"rating": 5.0, "review": "I can only say how awesome this device is, this would actually be my second purchase in addition to the Amazon FireTV sticks that I have. I do wish that the voice control would search the other apps like Netflix, Hulu, and YouTube as well, but I guess that really depends on those companies releasing API's that would support it. However when browsing Amazon content it is truly fabulous since you not only get voice search but you also get prefetching so it will load menus, screencaps, and video ahead of you even clicking the button. Sure this uses up more data but makes for a much more streamlined experience. I can only hope this functionality makes it into all the streaming services one day, and I thank the good people at Amazon for showing the way.", "verified": true, "helpfulness": "0/0", "author": "sraz"}, {"rating": 2.0, "review": "We were happy with it at first and then we also ended up buying an AppleTv.  We like the AppleTV better for a couple reasons but the deal breaker is that on out Amazon Fire TV Netflix will play but there is no audio.  We have no problems with audio on the Netflix on the Apple TV.  We watch a lot of Netflix so this a DEAL BREAKER.  We were going to buy an Amazon TV Stick for another TV but the issue with Netflix is a BIG NO!  Good luck.  It does have some good points but the audio issue makes us rarely use it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very useful device in my effort to cord cut. Wished it had FXNOW app", "verified": true, "helpfulness": "0/0", "author": "John S Merritt"}, {"rating": 3.0, "review": "Amazing concept and great content.  Love the voice search on the remote.My only problem is that for it to talk to the tv I need to unplug it for 20 seconds.  Every time! Very frustrating.", "verified": true, "helpfulness": "0/0", "author": "David Weikel"}, {"rating": 1.0, "review": "Returned, difficult to keep unit connected with WiFi.", "verified": true, "helpfulness": "1/2", "author": "Henry"}, {"rating": 4.0, "review": "My wife & I really, really like the device - one thing that I would recommend is better descriptions for the various apps & requirements for activation on screen. Voice search is nice, but the search by typing feature interface is so antiquated...c'mon folks, it is 2015, not 1983.I've been wanting to get another unit for our bedroom & another for my parents, but it seems that Amazon has been out of stock for several months - with no idea when they'll get more - what's the problem? Is Amazon canceling production?", "verified": true, "helpfulness": "0/0", "author": "Kent Simpson \"Realtor, Green Chile Addict\""}, {"rating": 5.0, "review": "Being self-taught, and not technically clever, it took a bit to figure out how to move around and access things we wanted to watch and use the settings.  Joined Netflix too and between that and Amazon we could spend all day in front of the TV....but don't, of course.We were able to find series and specials that we had missed earlier and really enjoying the freedom to \"binge watch\".  It is easy to lose the thread of plots when you have to wait a week for the next episode.  There is so much available that we haven't experienced yet and looking forward to doing that.This gadget is good for people of all skill levels and adds a lot to our viewing pleasure.", "verified": true, "helpfulness": "0/0", "author": "Sandib \"Sandi\""}, {"rating": 5.0, "review": "So far it is great.  The only thing that I do not like is when you talk to the remote, the search always takes me to purchase the TV show instead of taking me to the app!", "verified": true, "helpfulness": "0/0", "author": "Julia Polasek"}, {"rating": 5.0, "review": "Amazon Fire TV is amazing.  I've just started using it, but already enjoy the benefits.  No more streaming from my tablet or laptop.  Right on the TV I can get Amazon Prime Video, Netflix, HBO to Go, games and so much more.  Its a great product and so easy to use.  I bought a 2.99 manual for my Kindle which I haven't read yet, but plan to so I get all the benefits of this great piece of tech.", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 5.0, "review": "Extremely fast and easy to set up. For me, I'm a bit disappointed with the offerings of free movies from Amazon Prime Instant Video in the sense there aren't many that interest me, although I will say there is a very large selection of free movies. It's just that virtually all of the movies on my must see list are not free. I will say that I'm really happy to be able to watch YouTube content on my TV which I find myself doing more than anything else so far. Very happy with the purchase!!", "verified": true, "helpfulness": "0/0", "author": "Stephjam63"}]