[{"rating": 5.0, "review": "Fun and easy to operate...Many thanks and more power.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Zumel"}, {"rating": 1.0, "review": "Should of waited", "verified": true, "helpfulness": "1/15", "author": "Murnet"}, {"rating": 4.0, "review": "It's a great streamer, with the worst out of box experience I can imagine. I've spent fifteen minutes trying to get through an obnoxious, unskippable intro video. But don't accidentally press \"back\" on the remote! It will make you start all over.I've hit every button on the remote trying to skip this thing.Once set up... it's great!", "verified": true, "helpfulness": "0/1", "author": "IB"}, {"rating": 5.0, "review": "Performs very well. I bought it for the optical out so we could connect our surround sound system. That has been a plus for watching movies etc. Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Gerry"}, {"rating": 5.0, "review": "Love being able to watch my Vimeo videos on the big screen with my family!", "verified": true, "helpfulness": "0/0", "author": "Christopher"}, {"rating": 2.0, "review": "But I'm afraid hate is starting to win out.  When I first put it on I was thrilled.  The remote flies through the screen and after having had a neo streamer before this one, that was a welcome change.  The neo was like scanning through molasses and that is the main reason I wanted to get a new streamer.THE GOOD:  The remote is lightening fast and the voice option works GREAT!  I haven't had it fail to understand me yet.  There is a nice little cartoon guy who walks you through the functions.  The screen layout is very pleasant and it even has a beautiful screen saver.THE BAD:  From the start Netflix would not work.  After googling it, I found that I was not alone in this problem.  Since Netflix is the number one app people are streaming, that is a huge problem.  I called customer service and got a foreign woman who was utterly clueless.  After wasting an hour on the phone with her my fire tv still did not work.  She followed up by sending me two emails with information on how to fix 2 problems that were unrelated to mine.  I waited a few days to be less frustrated and called back.  I requested a US operator who was wonderful and walked me through the problem and again, another hour but it was fixed.My power went out and guess what?  The streamer does not work again.  It repeatedly wants me to pay for shows on Hulu Plus and Netflix even though I have subscribed to them and have properly downloaded them and set them up on fire tv.  I have now had to reset my fire tv FIVE times to factory reset which means that I have to re-enter all codes and information again.  Further, that nice little cartoon guy that walks you through set up?  There is no way to skip it so I have now heard his spiel FIVE times.  He's not so cute anymore.I have had the Fire TV for about a month and have been able to enjoy it one evening.  It has not worked right the entire rest of the time and that's why I give it two stars.  Ok Neo TV is slow as hell but it worked!This unit does not have an off button.  Perhaps if it did I would not have lost everything because of a power outage.  My neo did have an on/off switch.I am very, very disappointed in this unit.  It had such promise but now it is clear that this is going to be nothing but a major headache.  Amazon has a great product in the making here but it is not ready.  I have to give this item an epic FAIL :(", "verified": true, "helpfulness": "4/5", "author": "Peggy"}, {"rating": 5.0, "review": "I own 2 Roku's and 1 Fire Tv.The Fire Tv is a lot better and more responsive.it is missing the head phone option that Roku has but over all it is build solid and I love the game option.", "verified": true, "helpfulness": "1/1", "author": "djp"}, {"rating": 4.0, "review": "The FireTV is great.  I had a smart TV already but the interface was awful, so I picked up the FireTV and have been pretty happy with it.  I also have a roku 3 on my other TV and the Firetv gets a slight edge.  The one feature I miss from the Roku is a universal search.  I love the voice search, typing with a remote and on screen keyboard is maybe one of the most tedious things ever, if they could just integrate the voice search with Netflix and Hulu I would be a happy boy.  The fact that it came pre-configured to my prime account so there was almost no setup necessary was icing on the cake.", "verified": true, "helpfulness": "0/0", "author": "Dan Martins"}, {"rating": 3.0, "review": "have to pay for old movies", "verified": true, "helpfulness": "0/1", "author": "ola jones"}, {"rating": 5.0, "review": "So far loving fire tv.  Streaming pandora & amo zin prime movies mostly.  Haven't opened full potential yet! Good product!", "verified": true, "helpfulness": "0/0", "author": "Mike c \"Mike c\""}]