[{"rating": 5.0, "review": "This is an excellent, easy to install, easy to use device.It allow us to take full advantage of all our Kindle Fire HDX has to offer!!!I highly recommend this device as it allows the whole family to enjoy our Kindle at the same time instead of one at a time.", "verified": true, "helpfulness": "0/0", "author": "William A. Leyrer"}, {"rating": 4.0, "review": "Love it.My only gripe is that my Logitech Harmony universal remote cannot adjust the volume when using the Amazon Fire TV.  Also, the audio search won't search Netflix.", "verified": true, "helpfulness": "0/0", "author": "Mike Canger"}, {"rating": 3.0, "review": "Bottom line; I would not buy this product if I had it to do over again.  On the other hand, I don't dislike it enough to go through the hassle of sending it back.Build and packaging quality are high.  And, the interface is pretty straight-forward.  However, Amazon has decided to take a page from the Apple playbook and has designed this device so that it does not play well with others.  If you own music on Google play, do not buy this.  If you own movies on Vudu, do not buy this.  If you want to surf the web on your TV, do not buy this.On the other hand, if you want to watch Netflix and Amazon Prime video and pretty much nothing else (except maybe play games), this device is perfect.After using this device for a couple of weeks, and even sideloading some apps in an attempt to make it more usable, I'm left wishing I had gone with a Roku.", "verified": true, "helpfulness": "0/0", "author": "RICHARD J BROWN"}, {"rating": 5.0, "review": "Easy to use and very helpful for TVs not connected to cable box", "verified": true, "helpfulness": "0/0", "author": "bbaker"}, {"rating": 5.0, "review": "This is great", "verified": true, "helpfulness": "0/0", "author": "Derrick Eakin"}, {"rating": 5.0, "review": "The only thing it's missing is my iTunes. :)", "verified": true, "helpfulness": "0/0", "author": "Ian Clark \"Clark\""}, {"rating": 5.0, "review": "Excellent.  Use every night.  Much better than my previous experience using a smart Blu-ray player.", "verified": true, "helpfulness": "1/1", "author": "Ron McPhail"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Rachelle Anne Martini"}, {"rating": 5.0, "review": "Fast and voice activation is great.", "verified": true, "helpfulness": "0/0", "author": "Gary Elsesser"}, {"rating": 5.0, "review": "I've had the Fire TV for 2 weeks and I'm still trying to find a flaw in it. The set up was a breeze, taking less than 5 minutes. The user interface is excellent and the rrremote is easy to use, having only a few buttons to control all navigation. I think it can only get better as more content and apps become aailable. I'm on my way to being cable free.v", "verified": true, "helpfulness": "0/0", "author": "Joel Snyder"}]