[{"rating": 1.0, "review": "Stopped working after 1 month. Changed cable, reset device no change.", "verified": true, "helpfulness": "1/2", "author": "Christian C."}, {"rating": 1.0, "review": "SUPER Limited channels- not worth it for a voice search.  Voice search only works inside Amazon app, no You tube, no sports channels, I kept looking and trying to find the most basic channels that my 2008 Roku One box even has and nada. The game device is kinda worthless, my 7 year old was really let down.", "verified": true, "helpfulness": "5/6", "author": "Autonomy \"aaspender\""}, {"rating": 1.0, "review": "I am very very very very very very very very very very very very very very very very very disappointed. It cannot connect directly to network drive, it needs a computer!", "verified": true, "helpfulness": "0/7", "author": "TONY TRAN"}, {"rating": 5.0, "review": "Excellent!  My kids love it and my wife and I enjoy the movies!  We will order another FireTV box when we can afford it, the kids love the games they can play on it, hint to parents, get the game controller for the games, excellent for anybody wanting to play the games offered.  Amazon Prime is also well worth the money, lots of kid shows too.Edit:We home school and the FireTV is an excellent addition to our tools of education for our kids.  Plus I would like to add how powerful the box is.... for $100 it rivals much more expensive boxes.  Lots of bang for the buck.Had it for about a month..... we don't regret the decision to buy it.", "verified": true, "helpfulness": "1/1", "author": "Rebecca Lahr"}, {"rating": 5.0, "review": "GOOD", "verified": true, "helpfulness": "0/0", "author": "mark b. kreusch"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Bryan Sculthorpe"}, {"rating": 5.0, "review": "Not enough stars to give this product.  Its so nice to be able to watch so many movies and other choices.  Love that there is games too.  Highly recommend.  Was so simple to set up and no problems.", "verified": true, "helpfulness": "0/0", "author": "Heidi"}, {"rating": 4.0, "review": "The device is fantastic!  I have more content available that I'll never outlive, YAY!!  Recently, I found that I must have ANDROID-based devices to really get the most out of the unit.  It's inferred in Amazon's advertisement but it's more like a subliminal message.  Does that make me buy another device?  NO!  I'm flush with devices and remotes.  What I really want to know is why is there a USB port and NO documentation on how to use the port.  I hate that, they don't even give it in technical details.  Amazon implies it's all so simple, so anyone have a good answer?  I did find you can hack the device and port in a hard drive with movies, videos, etc. but I'd rather not.", "verified": true, "helpfulness": "1/1", "author": "TDaddy"}, {"rating": 1.0, "review": "Dont buy it...... all this little box do is charge you for everything that any computer with internet gives you for free and i f you dont like it you have to stick with it Amazon customer service department cant help you with it .... paying 14 dollars for an old movie that you can watch for free is ridiculus....", "verified": true, "helpfulness": "1/7", "author": "Mario Andre Morera Gutierrez"}, {"rating": 5.0, "review": "Amazing...a COMPLETE home entertainment system. Your kids can play games, watch kid shows, and you can watch great movies/TV shows with your spouse. All for only $99 a year for Amazon Prime. Homerun in my book! We will be buying more for all of the TV's in our house.", "verified": true, "helpfulness": "0/0", "author": "Andre L"}]