[{"rating": 4.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "maury A. Herman"}, {"rating": 5.0, "review": "The Fire TV is worth the investment hands down, especially if you are a Prime member!", "verified": true, "helpfulness": "0/0", "author": "Dos Mstr"}, {"rating": 5.0, "review": "It would be nice to have still in Theatres area like direct TV", "verified": true, "helpfulness": "0/0", "author": "Karla"}, {"rating": 2.0, "review": "Pros:Nice, clean, compact unit. Easy to set up. Easy to use.Cons:Chews through data like a beastChews through data like a beastAnd name but not least, Chews through data like a beast.That is just watching regular shows, while using their data saving tips i.e. using the correct setting for the screen saver.Until that issue is resolved, I can't give it a higher rating. I should have saved the $100 and just streamed directly from my laptop.", "verified": true, "helpfulness": "0/0", "author": "A. Woods"}, {"rating": 5.0, "review": "I'm happy with it, but I can't help but wish one could control the sound level from the remote control and to be able to turn the TV on and off with it.  I gave it 5 stars because it does do what it promises to do.  We cut the cord to pay TV, so it is nice to still be able to access movies, recorded shows and music from the TV.", "verified": true, "helpfulness": "0/0", "author": "Zusiqu \"zusiqu\""}, {"rating": 5.0, "review": "My best choice since I gave up cable.  If you don't have cable at all, it's still limited, but I hope to see changes and improvements in content available.  The growing group of cable dumpers should make this a growing genre for tv addicts like myself.  Let's hope Amazon sees the value and continues to add free and really, really low cost options.", "verified": true, "helpfulness": "0/0", "author": "Valerie A. Archibald \"Postal Bunny\""}, {"rating": 5.0, "review": "Totally awesome! I refuse to pay for cable TV or a dish network and this allows us to view Amazon Prime live stream movies,Netflix, it has free games, and much more. I wish we had purchased it sooner.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "More than met my expectations. Easy to set up and use. So I bought  2 fire tv units for the oher TVs.  No disappointments.", "verified": true, "helpfulness": "1/1", "author": "Steve Cook"}, {"rating": 2.0, "review": "Sorry , nice box .keep freezing up !!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Daryl Mosley"}, {"rating": 5.0, "review": "Great product👍", "verified": true, "helpfulness": "0/0", "author": "Gerardo Pino"}]