[{"rating": 2.0, "review": "Not What I expected, but may be good for others.", "verified": true, "helpfulness": "0/7", "author": "def"}, {"rating": 5.0, "review": "bye cable, hello world of free internet shows and movies", "verified": true, "helpfulness": "0/2", "author": "Arestak"}, {"rating": 5.0, "review": "Absolutely love it", "verified": true, "helpfulness": "0/2", "author": "rachel ma"}, {"rating": 5.0, "review": "Very cool device", "verified": true, "helpfulness": "0/2", "author": "Chris Kashmir-Green"}, {"rating": 5.0, "review": "THE BEST THE BEST THE BEST..... EASY TO USE... WILL BE USING FOR A LONG TIME.. I AM A PRIME MEMBER... AND BUY ALMOST EVERYTHING ON AMAZON..  GO AMAZON.", "verified": true, "helpfulness": "0/3", "author": "Andy"}, {"rating": 5.0, "review": "It was so easy to connect and get working out of the box.  Having this option on my TV has been the perfect add on.  Extends my Prime benefits to more of my daily life.", "verified": true, "helpfulness": "0/0", "author": "L. Burgess"}, {"rating": 3.0, "review": "I've been loyal to Amazon.com for many years. I have very little qualm with them. The Fire TV is just not a total hit for me.First, Netflix programs initially buffer Really Slow. And several times in one 30-minute program, it re-buffers, even slower.  Even our older Wii streams Netflix faster, with very little to no re-buffering. We actually bought the Fire to replace using the Wii, but I don't know that it's reduced any frustration with Netflix ( we stream Netflix through a PS3 and a Roku 3, and they buffer very fast. Same when we used an Xbox 360. So I don't think it's a Netflix issue).Amazon prime content can be found. It hasn't been as much a headache as for some. But I just don't like the layout with the Fire. I've also tried setting parental controls, but no matter the setting, certain movies or programs come up with images not suitable for some members of our family. It's annoying that we seem to have no option for controlling what pops up. I see, however, all device makers do that. There are some really disturbing images.Fire does do Amazon streaming just fine.Amazon please do something about Netflix, and better parental settings for the initial screen layout.I'm pretty sure we'll still keep Fire TV. But to be honest, I like our Roku 3 better (sorry amazon).", "verified": true, "helpfulness": "0/0", "author": "BusyMom"}, {"rating": 4.0, "review": "Amazon Prime Member, was connecting laptop to TV via HDMI cable to watch Amazon Video, Hulu, Vudu, etc, I love Amazon Fire - no more cables stretching across my living room!  The setup process is insanely easy. The response is fast; so far no issues when searching apps, channels, video's, etc.  Limited use of the voice search function, but what little I have used it, it has worked well.  I choose Fire over Roku because of the advertised increase in processing speed with Fire as opposed to Roku.  There are three things I wish Amazon would incorporate into Fire at some point - I would definitely be willing to purchase a new system if it included:  (1) A remote with backlights - so hard to see in the dark and almost all of the buttons feel the same  (2)  An outlet for headphones on the remote, like Roku - I almost purchased Roku just for this feature and (3) a way to better search out programming that is free for Prime.  All in all, I am very happy with the purchase and the functionality of Fire.", "verified": true, "helpfulness": "0/0", "author": "Alan Newman"}, {"rating": 1.0, "review": "The reason why I give it a 1star is because it was a surprise gift but you do not have the access to all of its features if you are living in the Caribbean hope Amazon will work on this as people in the Caribbean deserves the same credit. Sorry if I upset anyone but that is reality", "verified": true, "helpfulness": "1/6", "author": "Potty"}, {"rating": 5.0, "review": "I was using a PS3 to stream Amazon Video. But after my last PS3 \"upgrade\" the streaming video stopped working, it just gave me endless interruptions saying my internet was not fast enough. So I got Fire TV. No more interruptions! Streams like lightning. I have not had good luck with the voice search, though. But I have not tried it more than a few times. All in all I am very satisfied. It's really cute, too.", "verified": true, "helpfulness": "0/0", "author": "Stan \"Khan\""}]