[{"rating": 3.0, "review": "Sent back didn't do what I wanted.Also took to long to setup.", "verified": true, "helpfulness": "0/3", "author": "Michael Sultzer"}, {"rating": 3.0, "review": "I gave up my satellite tv (Dish Network) because it was not worth the cost of the package that was available.  The price for satellite tv is continually increasing, so I turned to Amazon Fire TV.  First,  it is only worth it if you get an Amazon Prime Membership ($99), for there is very little that you can watch without it.  Next, even with the selection that Amazon Prime membership offers for its Fire TV, there is so much that you still have to rent or pay for to watch it.  This is disappointing to me, especially shows like Once (have to rent or pay for each episode), Say Yes to the Dress (have to rent or pay for each episode) all the eleven seasons which my wife loves, and so on.  There are some old shows like X-Files and Poirot that are available for free through the Amazon Prime Membership, as well as some of the games available that garners Amazon Fire TV a three-star rating.  Yet, there are very few popular movies available to watch for free with your Prime Membership.  I plan on keeping this for a year, and I hope they make improvements and make more available through Prime Membership being that it is still in its infancy, but unless they make some improvements and more available through the Amazon Prime Membership, I may have to look elsewhere.", "verified": true, "helpfulness": "0/1", "author": "SabreFan \"SabreFan\""}, {"rating": 3.0, "review": "To much hardware for so little in software features. All this power is wasting. I can't use my uk prime account on it. I can't watch my home collection. Options outside the USA are sooo limited!", "verified": false, "helpfulness": "0/1", "author": "Dapo Ajose-Adeogun"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/2", "author": "jaylee"}, {"rating": 5.0, "review": "So far so good.  My niece connected it for me and she said it was pretty easy for tech people.  Love being able to speak my choice.", "verified": true, "helpfulness": "0/0", "author": "Emily Rios"}, {"rating": 3.0, "review": "Love the concept! Now if only I could have gotten it to update so that I could have actually used it! Kept freezing during the update. I gave up and sent it back.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "R", "verified": false, "helpfulness": "1/5", "author": "Beth rolon"}, {"rating": 3.0, "review": "Not much different from apps I have on my Sony Blue Ray.  I'd have hoped I'd have access to shows by default using this box - doesn't seem so..... or at least it's not intuitive enough to discover such.", "verified": true, "helpfulness": "1/1", "author": "Rabsy"}, {"rating": 5.0, "review": "Parents love it!", "verified": true, "helpfulness": "0/1", "author": "soakingwetcat"}, {"rating": 5.0, "review": "I LOVE Amazon Fire TV.  It is amazing, all as advertised.  Thank you, thank you, thank you Amazon!!!I can watch TV without commercials - YAY, and I cancelled my way too expensive cable TV - triple yay.I wasn't sure about getting Fire TV because my HDTV is 6 years old and has 1080i rather than 1080p.  I researched for a week trying to figure out if it would compatible with my TV.  I really didn't think it would be but I took a chance on ordering it anyway because I'll be upgrading from an 18.5\" TV to a new 32\".  My TV speakers are awful so I have desktop computer speakers plugged into the TV.Anyway, Fire TV is even better and more amazing than Amazon's ads.  It was simple to hook-up, and very user friendly even for this 65 year old person.  And with a single click I was able to upload all of the music, photos and videos on my computer.I absolutely LOVE Amazon Fire TV and highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Nan"}]