[{"rating": 5.0, "review": "This is a great way to watch Prime movies and shows. I find it extremely easy to use. I've had no problems with it whatsoever. The voice search can be used by anyone as long as you speak clearly.", "verified": true, "helpfulness": "0/0", "author": "Tracie Brown"}, {"rating": 5.0, "review": "GREAT!!!", "verified": true, "helpfulness": "0/0", "author": "Junior"}, {"rating": 5.0, "review": "If you don't have cable or satellite you must get Amazon Fire TV. Sleek, small footprint, and the setup was sooo easy.And the amount of program viewing available is fantastic. Who needs cable.", "verified": true, "helpfulness": "1/1", "author": "Delvina Belzil"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "shirley a sartin"}, {"rating": 5.0, "review": "Yes you can say Gary Busey and it shows items related to him.", "verified": true, "helpfulness": "0/0", "author": "Betsy"}, {"rating": 5.0, "review": "This is a must for anyone who is a prime member and intends to remain one. Setup is fast and easy. Quality is excellent. Very unobtrusive and will fit in very cramped spaces. Movies load quickly with great picture quality. I set mine up to run thru my Yamaha amp. Netflix works better with this unit than it does with Xbox. I've not yet installed any of my subscription cable channels but will do so when time permits. It is too bad that Apple and Amazon don't have an agreement to use Itunes but I have far fewer movies on Itunes than on Amazon so I can't complain. This unit is well worth the price.", "verified": true, "helpfulness": "0/0", "author": "George Hamilton"}, {"rating": 3.0, "review": "I was excited when Amazon sent me an email to try Fire TV risk free... However, it would've been nice to know that it is HDMI compatible (only) and does not come with the cable . Also, if you have a lower end DVD player with surround sound there isn't a way to plug it in.. Everything else seems ok.. I guess.... since I'm having to watch on a 17 inch monitor.. I  have wasted my entire day on this thing.. Very unpleased...", "verified": true, "helpfulness": "0/2", "author": "Alexa Goff"}, {"rating": 5.0, "review": "Fantastic!  I use this over my Roku 2, everything is so fast and reliable on the Fire TV.  Plex works flawlessly.  I'm tempted to buy another for my other TV.", "verified": true, "helpfulness": "0/0", "author": "A. H."}, {"rating": 2.0, "review": "The reason I do not like: It is limited. If you have an amp  that is digital(optical) audio incompatible it is of no use to you. . I would like to have tried it. My review is not from a performance point of view but one of appliance limitation.", "verified": true, "helpfulness": "1/4", "author": "Roger L. McAllister"}, {"rating": 5.0, "review": "I love this damn thing! I initially tried Amazon Prime (without Fire TV) and I didn't like Prime because I had to watch TV on my computer. A year later--after my cable bill reached 124.00 per month, I decided that it was time to consider streaming again. So I went with NetFlix. I discovered that Amazon Prime was far superior in selection of TV/Movies--I didn't even consider that Prime had lending library and other features. So step one was to get Amazon Prime and then I got Fire TV. I absolutely love the selection of videos (TV/Movies). In addition, I think Amazon has a \"relationship\" with cinema where it can provide Television and movies in a fairly decent time. The Apps selection is kind of limited and needs improvement but I have faith in Amazon that the apps selection will get better. Fire TV coupled with a Prime Membership is just awesome programming.Also, on a side note, I called my cable company to cancel cable. They wanted me to stay so bad that they knocked my bill down to 83.00/month with no changes in service; so thanks to all of you who are going off the cable grid to such a degree that it is making the cable company offer any deal possible to keep us.", "verified": true, "helpfulness": "0/0", "author": "C. Hughes"}]