[{"rating": 3.0, "review": "It is equivalent to a Samsung Smart TV but a little faster. If you have a Smart TV do not get this device.", "verified": true, "helpfulness": "0/0", "author": "Robert G. Burford"}, {"rating": 5.0, "review": "I cannot believe something this small and easy to use works so great! This is probably the best thing I have bought in years. I cannot say enough good things about it. Took 2 minutes to install, takes up the space of a CD cover, works PERFECTLY and at last I have something in my house that listens to me! How great is this?", "verified": true, "helpfulness": "0/0", "author": "Linda Lou"}, {"rating": 5.0, "review": "Amazon fire tv is Awesome thats all i can say about it just awesome", "verified": true, "helpfulness": "0/0", "author": "Shawn Carter"}, {"rating": 5.0, "review": "Amazon Fire is fast and easy to use. The voice search option is very convenient and, as so many others have stated, it actually works! I may be easily entertained, but I'm amazed at how well it understands what I say. I really have no complaints with this device whatsoever, and am grateful for all the good reviews that convinced me to buy it. I'm not techno-savvy at all, and have to rely on the kindness and experience of better-informed strangers when it comes to purchases like this.", "verified": true, "helpfulness": "1/1", "author": "Java Mama"}, {"rating": 5.0, "review": "Absolutely awesome product. My heart started beating just a little bit faster as I plugged it in and whispered to myself \"Bye Bye Comcast; Here comes the future of TV\". So easy to set up. I take that back: I didn't have to set it up. Literally and figuratively plug and play. Voice search is an absolutely brilliant. Well done, Amazon! And hey, why didn't I dump Comcast sooner?", "verified": true, "helpfulness": "1/1", "author": "X. Li"}, {"rating": 5.0, "review": "love it…. way better than rival wifi boxes, voice command is the kicker, tag your prime account and I am seriously thinking of ditching cable", "verified": true, "helpfulness": "0/0", "author": "Corbyusa"}, {"rating": 5.0, "review": "LOVE LOVE LOVE Amazon Fire... OMG!  My cable company isn't going to be happy when I seriously downgrade our \"rip-off\" movie channels that I am going to cancel.  Should have gotten this long ago.  Great free movies as an Amazon Prime member too.  My favorite thing is the voice command feature... I say \"Robert DeNiro\" and all his movies pop up onto the screen... LOVE IT, since I forget movie titles", "verified": true, "helpfulness": "0/0", "author": "Love to Laugh"}, {"rating": 5.0, "review": "Great Product!!", "verified": true, "helpfulness": "0/0", "author": "Larry Greer"}, {"rating": 5.0, "review": "Love it bought it to mirror kindle", "verified": true, "helpfulness": "0/0", "author": "Lois Schippert"}, {"rating": 5.0, "review": "We turned off the cable and got this instead!! We also subscribed to Netflix. We love it!!", "verified": true, "helpfulness": "0/0", "author": "Julie Erickson"}]