[{"rating": 5.0, "review": "got this as a gift for Christmas ordered the second one for a gift to someone else...", "verified": true, "helpfulness": "0/0", "author": "Paw Paw"}, {"rating": 3.0, "review": "I had a higher expectation of the service and am finding that many of the available movies have additional fees to watch them, even with my Prime membership...  The other big issue I've had with the three movies I've paid to rent is that the audio is non-existent. I can watch the Trailer and other reviews, but the movie becomes silent with no audio.Not sure if it is my settings, or the movie, but I have had it happen three times with different movies.UPDATE: I was able to get in contact with a tech and he assisted me in troubleshooting my settings. I will update again if I receive successful results.Quality of the components is excellent and I look forward to getting the issues taken care of. Amazon Fire is very simple to use and the voice recognition search feature is excellent.", "verified": true, "helpfulness": "0/0", "author": "D. A. Cabral"}, {"rating": 5.0, "review": "I really love this", "verified": true, "helpfulness": "0/0", "author": "Clyde S Holliday"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Amy Atkins"}, {"rating": 3.0, "review": "After all the hype I expected more from the product than it could deliver. Specifically, as an extension of my Amazon Prime account I expected more free movies and shows. Plenty of \"access\" but all the content is not free.", "verified": true, "helpfulness": "0/0", "author": "Wayne Hawkins"}, {"rating": 5.0, "review": "Let me say that I have seen ads for all the others, Apple TV, Chromecast, Roku but chose the Fire TV product.  First it was on sale which was a plus and it was close to Christmas and when it came in, it was super simple to setup and was already activated with my Amazon Prime account, so I could watch what I wanted via way of HuluPlus and Netflix and Amazon Prime. Since I had never used any type of TV add-on, except my Smart Blu-Ray Player I am very surprised to see this work flawlessly with my wireless network, I was streaming a movie on 1080p and it looks amazing.  I purchased \"Maleficent\" as an HD purchase and got to watch the entire thing without any stops/drops/quality problems.  I am impressed, but it would be nice if the USB port can be used for offline videos, or older converted VHS movies. Some people have movie files that simply need a method to watch.  Currently it has to be rooted to be used.  Maybe they can fix it in an update one day?", "verified": true, "helpfulness": "0/0", "author": "Matthew Waldron \"Musician since 2003\""}, {"rating": 5.0, "review": "I absolutely Love this device! At first I was disappointed ?!? Why?! Because I didn't give it a chance! The thing is at first it gives you limited shows...but... What you have to do is stream or search for shows or movies of your interest !! Give it a lil time! And you will have shows pop up on recommended option! Or just keep checking! In search! You will see a charge on shows you like them a week later it's on Prime for free viewing! IT'S MINE! I'm keeping it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Since I don't have cable in my bedroom, the Amazon Fire TV is perfect for watching movies before I go to bed.", "verified": true, "helpfulness": "0/0", "author": "mimi"}, {"rating": 5.0, "review": "good product, not what expected", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Luv it!!!", "verified": true, "helpfulness": "0/0", "author": "Aramorra"}]