[{"rating": 5.0, "review": "11 out of 10! Better than my expectations were.  Great pictures great programming love it.", "verified": true, "helpfulness": "0/0", "author": "Aaron Houston"}, {"rating": 5.0, "review": "Easy to hook up, great picture (better than satellite )!", "verified": true, "helpfulness": "0/0", "author": "Chuck Hill"}, {"rating": 1.0, "review": "You have to pay for just about everything.  There are hardly any free movies that are actually worth watching :( sent it back", "verified": false, "helpfulness": "2/6", "author": "DIANNE"}, {"rating": 5.0, "review": "This amazon fire TV pad is better than the apple TV! The only thing amazon fire tv need to improve is add more NEW PRIME's shows, series, movies, etc! But, i will still give 5 stars to this awesome TV pad!", "verified": true, "helpfulness": "0/0", "author": "Roberth"}, {"rating": 3.0, "review": "Limited channel options. Had more on roku. Not the greatest for slower connections as many things run HD and with limited internet capabilities HD programs run very slowly. Very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Eric Bouchard"}, {"rating": 3.0, "review": "There are a lot of pro's and Con's to Fire TV. Big issue for me was there is no Vudu app. I own like 75 movies on vudu. The Game are the only major plus. The remote that you can talk to , to find your movies only works for amazon not like hulu or netflix. I own a lot of streamers because I am a gadget freak  the Apple Tv Streamer I sold that because was so not worth it. I own a Roku also and I would say it is still the best Netgear also has a streamer that is very good. Visio has one that will surf the web. Witch by the way you can not surf the web with fire tv either. Its a ok buy but dont break your neck to get it. Roku has way more apps. When you call customer service I swear its like they dont care and they cant give any time table as to when anything like the vudu app will be on Fire tv.", "verified": true, "helpfulness": "1/1", "author": "P."}, {"rating": 4.0, "review": "Great entertainment media player! For any occasion.. It's packed with great apps, and also the latest andriod software its makes this media player go 0-60 mph real fast!! And colorful this was a nice purchase", "verified": true, "helpfulness": "0/0", "author": "Letttsome@Sam"}, {"rating": 5.0, "review": "Exceededmy expectations Do not know how I watched without it!!!", "verified": true, "helpfulness": "0/0", "author": "Stanley M. Slonka \"SMS\""}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "Morrine Rutberg"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "tom"}]