[{"rating": 5.0, "review": "My kids and I love the amazon TV...if u have kids and they like the games u should get the game remote as well...very good investment...couldn't b happier!", "verified": true, "helpfulness": "0/0", "author": "Brandy Rodriguez"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Kendrick King"}, {"rating": 2.0, "review": "I bought this because I previously had a Sony box that was just becoming a bit out-dated. I LOVE the Fire TV. I have use my Prime Account daily, either listening to music, watching tv/movies or ordering something or other.There is only one thing that I was disappointed in: you can't use voice search for anything other than the prime products. You can't use it in the apps like Netflix.I've only just scratched the surface too on usage, so I'm sure I'll continue to discover new things.Update 5/15/15 - I'm not so happy I purchased this now. I'm sick of Hulu Plus freezing up. I'm sick of not being able to watch movies on Netflix because the sound doesn't work. I'm going to return this and get a roku.", "verified": true, "helpfulness": "0/0", "author": "Pcleo1794 \"Pcleo1794\""}, {"rating": 5.0, "review": "It was fairly easy to install.  It upgrades my upstairs tv to a smart tv.", "verified": true, "helpfulness": "0/0", "author": "dianne dunchock"}, {"rating": 5.0, "review": "Love it so much better than Roku.", "verified": true, "helpfulness": "1/1", "author": "Janet Y Bertling"}, {"rating": 5.0, "review": "I stream everything now. Might get rid of cable altogether. Picture quality is higher than Time Warner Cable, easy to use and find new shows. Spent four days binge watching all three seasons of House of Cards.Totally happy.", "verified": true, "helpfulness": "0/0", "author": "kathleenkaiser"}, {"rating": 5.0, "review": "Its works great thank you.", "verified": true, "helpfulness": "0/0", "author": "Jazmin Serna"}, {"rating": 5.0, "review": "Great device, great packaging. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Pablo A. Godel"}, {"rating": 5.0, "review": "This device is great.  Definitely easier to use than Apple TV.  I just wish they had a Starz App.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "William Sheridan"}]