[{"rating": 3.0, "review": "Because I don't want this review to be a trasher, let me say that there are some really awesome things about the Amazon Fire TV. The tiny footprint is amazing. There are plenty of options for TV (though the HBO Go omission is critical) and internet video. I love the way YouTube syncs with my other devices. Voice search is a great idea, because remote text input sucks.Sadly, that can't make up for the poor search experience. First of all, that voice search only works on Amazon content - no Netflix, YouTube, Hulu, etc. To search in any of your other channels, which is where I spend all my time, it's back to the remote control to enter one letter at a time.Let's say you're okay with that and don't mind sticking to videos in Amazon's library. Well, they've decided not to make it clear in their search results whether something is including free with a Prime membership or pay-to-play, so you have to go an extra step to see if you can watch.Lastly, there's no way to get any of your content to it. If I want to watch a video from another website, I'm out of luck until they make an app for it. If I have a movie on my hard drive I want to watch, too bad. The USB port does not allow you to bring in files from a flash drive. I've decided to return this and purchase an Apple TV so I can use it as a second monitor in Mavericks and to mirror my iPad.So for me, there's lots of good ideas at work with the Fire TV, but it's making me work too hard to find content and make my own experience.", "verified": true, "helpfulness": "1/4", "author": "M. Hodges"}, {"rating": 4.0, "review": "I need to be able to use HBO-GO, This is a feature that I miss. I have to be using my PC for this.", "verified": true, "helpfulness": "0/4", "author": "Derrick Scott"}, {"rating": 5.0, "review": "This player works much better than the Roku player that it replaced! It is easier to use with Amazon Prime, Netflix and YouTube. Even with my slow DSL connections I have not had any problems with delays while watching movies or YouTube videos!", "verified": true, "helpfulness": "2/2", "author": "SR8586"}, {"rating": 5.0, "review": "It's working very well and wish I had more time to use it's capabilities. It will be used much more when the weather goes bad again.Thank you!Lucas", "verified": true, "helpfulness": "0/0", "author": "LUCAS B."}, {"rating": 5.0, "review": "We watch all sorts of programs and movies.  My son especially loves it to watch old episodes of sit-coms.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Trish Osborn \"Trish Osborn\""}, {"rating": 5.0, "review": "I love the fire tv.  The voice recognition is spot on.  The content is good and I will definitely be cutting the cable cord very soon!", "verified": true, "helpfulness": "0/0", "author": "Joseph Teply"}, {"rating": 5.0, "review": "I have not had any other streaming device before and got this because of the features and the mirroring capabilities for the Kindle Fire HDX.  I have not had any issues and it connected did the update and has worked just fine.  I use it mainly for Prime, Hulu+ and Netflix.", "verified": true, "helpfulness": "0/0", "author": "MJ"}, {"rating": 5.0, "review": "Amazon Fire TV is great.  Was very simple to install and set up.  We've only used it with amazon prime and netflix so far and have had no problems with those apps.  Would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Mahealani"}, {"rating": 5.0, "review": "Love it wish I had a long time ago. Wonderful product just wish they offered more carriers to add showtime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've been a Roku user for years,  but when Amazon Fire TV came out with a microphone so you don't have to key in everything,  that was it! You can say a movie or TV show and it pulls it right up.  But even better,  if you have favorite actors,  say their name and everything they ever did comes up.  Amazing! And if you're an Amazon Prime member,  even better... Many movies are free as are the games.  Good job Amazon! Please note,  membership to Netflix or Amazon makes this work,  although there are other options for free, like Crackle.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]