[{"rating": 5.0, "review": "Great appliance.", "verified": true, "helpfulness": "0/0", "author": "Papa"}, {"rating": 5.0, "review": "This is a great alternative to cable TV-there's nothing I miss after cutting the cable.  The apps I tend to use the most are PBS, MLB.com, Netflix, You Tube, Twit, Smithsonian, Bloomberg & CBS News.  As a Prime member there is a huge selection of music and movies.  Between Netflix, PBS and Amazon there is also a large selection of TV programs.  I've experienced no downside to this purchase.", "verified": true, "helpfulness": "0/0", "author": "RS"}, {"rating": 5.0, "review": "Awesome works great just make sure you have fast enough Internet", "verified": true, "helpfulness": "0/0", "author": "JACK A SMITH JR"}, {"rating": 5.0, "review": "Have about 8 to 10 different media boxes.  This one comes in tied for first with the best box's I have ever used.  However, since you can no longer get the other box made this is a most excellent choice.  If you pay attention, check your choices on what you can do, this box can be and is for me a CABLE CUTTER.  With a regular antenna and the Fire TV box I no longer need cable.  It's not quite as easy as cable, but the trade off is if you want to watch something at 7:15 PM you can watch whatever you want, whenever you want on the Fire TV", "verified": true, "helpfulness": "0/0", "author": "Jeffryn L Norwood"}, {"rating": 4.0, "review": "Very fast and fluid, easy to use/setup, very cool.  The only reason I am not giving it 5 stars is I have to reboot it frequently to use Netflix after having used a different app.", "verified": true, "helpfulness": "0/0", "author": "Matt Freestone"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Wanda Connors"}, {"rating": 5.0, "review": "Good selection, can't get enough!", "verified": true, "helpfulness": "0/0", "author": "bruce geddes"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Glenn R. Elliott"}, {"rating": 3.0, "review": "I like everything but it does not have a web browser I wish you did.", "verified": true, "helpfulness": "0/0", "author": "Thomas Lind"}, {"rating": 5.0, "review": "Works great.  Would like more movies (especially older ones) included with my Prime account.", "verified": true, "helpfulness": "1/1", "author": "jov! ani"}]