[{"rating": 2.0, "review": "It is okay, but couldn't get sports like we had hoped.  The one kids movie our grandson wanted to watch was expensive.  Maybe with more time we will use it more.  It was a gift, so we will give it a try.", "verified": true, "helpfulness": "0/0", "author": "Gloria Aplin"}, {"rating": 5.0, "review": "Very good variety of movies and games. Glad I am a prime member!", "verified": true, "helpfulness": "0/0", "author": "Richard Collins"}, {"rating": 5.0, "review": "This was a Christmas gift.  We are enjoying using the movies since so many programs are reruns now.", "verified": true, "helpfulness": "0/0", "author": "L. Jones \"collector\""}, {"rating": 5.0, "review": "love this product.  I travel a lot and this is a perfect fit for me.", "verified": true, "helpfulness": "0/0", "author": "kathy zeller"}, {"rating": 3.0, "review": "Unable to google", "verified": true, "helpfulness": "0/0", "author": "Lolita  Clarke"}, {"rating": 5.0, "review": "Love IT !!I have tried ROKU, CHROME TV and APPLE TV. SO far Fire TV is the best.Its very responsive compared to ROKU. I have used Roku 3 and its speed/response time is crawling compared to Fire TV. Fire TV is lightening fast in switching the Apps and streaming the content.When Streaming Youtube on FIRETV from your mobile you would see the difference between FIRE TV and all the other devices.It has more storage compared to all the other devices.Cons:1. Fire TV do not have an option to restart the device from the interface in case if the device doesn't respond because of some crappy App. We need cut the power and bring it back ON.2. Voice search doesn't work on other apps like Netflix, Youtube etc.,", "verified": true, "helpfulness": "0/0", "author": "Mohan Krishna Aswapuram"}, {"rating": 4.0, "review": "Needs an all in one remote. Still have to use two remotes for volume and switching inputs.", "verified": true, "helpfulness": "0/0", "author": "Lisa S. Findley"}, {"rating": 4.0, "review": "Would've been 5 but it doesn't play on 1080i TV", "verified": true, "helpfulness": "0/0", "author": "KingPin"}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 2.0, "review": "Plugged mine in, checked it out, boxed it up and promptly returned it.  You are locked into the Amazon business model (nickel here, dime there for content) instead of the all you can eat Netflix model, but sort of expected that since we have a Kindle in the house.Dealbreakers:  No easy way to install Google Store apps (although you can sideload them pretty easily) and no USB drive capability (although you can utilize a NAS for access).Without the ability to access my media via a directly connected drive, its pretty much useless to me.  Nice concept and fun to evaluate, but they need to address the USB drive issue.  With that, it gets 4 stars, without only 2.", "verified": true, "helpfulness": "0/0", "author": "Palibe"}]