[{"rating": 5.0, "review": "Have only had for about two weeks.  This is awesome even better if you have Amazon Prime!!!!", "verified": true, "helpfulness": "0/0", "author": "ymcjean"}, {"rating": 3.0, "review": "The Netflix app will not function. It states that it is installed but when I click on the app it does not work. This is a deal breaker. I should have kept my Roku 3. Finally got Netflix to work.", "verified": true, "helpfulness": "0/1", "author": "Matthew R. DelRossi"}, {"rating": 4.0, "review": "So far very happy with it. Great picture quality. Works well with Plex and XBMC. Might not be as customizable as Roku but worlds above my Apple TV (which I only use for HBO Go anymore) in that regards. We'll see how it holds up with use and hope future updates make it better with out messing up previous functionality ( as has happened with Apple TV).", "verified": true, "helpfulness": "0/0", "author": "Frederick S Rolingher"}, {"rating": 4.0, "review": "Compared to my Samsung Smart TV, this device has significantly improved my viewing experiences with Netflix, Amazon Prime videos, and YouTube. It is blazing fast and my shows start instantly after I select them. No more waiting in limbo hoping the show will eventually start.The voice command for Amazon videos is impressive and making that feature available for other apps would make the Amazon Fire TV almost perfect. The home screen is designed for Amazon offerings and you have to scroll all the way down to select on \"Apps\" which takes you to other apps for Netflix,Youtube, etc. It would be less annoying if my top three apps were available at the top of the home screen of if I can simply click on Apps as the second option on the home screen.", "verified": true, "helpfulness": "0/0", "author": "NYC Joe \"NYC Joe\""}, {"rating": 5.0, "review": "I absolutely love this box! It's super easy to set up, and super fast. I definitely recommend it!", "verified": true, "helpfulness": "0/0", "author": "Lady E \"pro shopper\""}, {"rating": 5.0, "review": "I'm very pleased with my Amazon Fire TV, it's easy to use. I love it !!!!", "verified": true, "helpfulness": "0/0", "author": "Raymond E. Tidwell"}, {"rating": 4.0, "review": "Easy to set up, a nice selection of Prime movies and TV shows for our two little ones.  We are happy!", "verified": true, "helpfulness": "0/0", "author": "Amanda McQueen"}, {"rating": 5.0, "review": "Bought this product for our living room TV instead of getting another gaming system like the Xbox one.  For the price you can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Katie Helms"}, {"rating": 5.0, "review": "glad I purchased", "verified": true, "helpfulness": "0/0", "author": "GregEPS"}, {"rating": 5.0, "review": "This is the best streaming device available to date. The blue tooth remote is smooth and responsive. In my opinion its better than the roku 2, PlayStation 3 and Chrome cast dongle.  I have had all four of these devices.", "verified": true, "helpfulness": "0/0", "author": "Israel Gonzalez"}]