[{"rating": 5.0, "review": "I love Amazon Fire TV.  We cut the \"cable cord\" and are using Fire TV on one set.  So far, no issues or problems.", "verified": true, "helpfulness": "1/1", "author": "Patricia Stolz"}, {"rating": 5.0, "review": "It is a wonderful device. It has a ton of apps and a wonderful interface, plus u can add apps 😃", "verified": true, "helpfulness": "0/0", "author": "A.J. Sonnier"}, {"rating": 2.0, "review": "Update April 18, 2015.I've been using Fire for several months now. I still find it very unfriendly compared to Roku. It's incredibly annoying to have to log in for Amazon Prime every time I want to watch something. More often then not, I don't bother. Viewing is often plagued by audio lag. My router is an Apple Time Machine that can handle just about anything that can be streamed. Neither my Roku nor my Chromecast have issues with audio lag.I also notice differences in definition and color. I've noticed when I came to write this update that Amazon has made some changes to Fire. I hope they are for the best. I'm sorry that I didn't return my unit as soon as I noticed problems. I should have waited for the bugs to be resolved. Since there are so many good reviews for Fire, I have to believe that I bought too soon. End update.--------------------------------------------------------------------When this product first arrived, I thought it was great. Sleek, Apple like packaging and beautifully designed. After using Fire TV for several months, I can say that I would not purchase again. Voice search is nice, but unless you know exactly what you want, it doesn't offer any other options, Roku does. The user interface could be much better. What irks me the most with this unit, is that it keeps losing my login info. I've had to reconnect Amazon several times, despite the unit supposedly being synched with my Amazon account. On at least a weekly basis, I need to find my login info for Netflix to reconnect when Fire disconnects me. We all know how much fun it is to enter that info via a remote.I have 2 Rokus and a Chromecast, both give me far fewer problems than the Fire TV. I have never had to re-enter my login info for apps on the Rokus. My recommendation would be to purchase the Roku 3. It's much more reliable, and if you're into specialty programming, you can download tons of channels. Another thing I prefer about the Roku 3, is the remote. It doesn't have voice, but it's simple, easy to use in the dark, and I've learned that I can't live without the headset feature. That comes in handy when I want to watch TV late and night, and don't want to disturb anyone else. I love Amazon, but I give them a thumbs down on this device.", "verified": true, "helpfulness": "0/0", "author": "JOANN LEFEBVRE \"Vibrating at the frequency of me.\""}, {"rating": 5.0, "review": "I had a Xbox that I bought for my grand kids when they were at my home. Now that they live across the street I gave it to them. I mainly used it to watch videos. With the Fire Tv I can watch all of the same video sources. One thing I found is I can play music and videos I have on my home computer. Worked right out of the box with no problems. It hooked right up to my wireless system. I used the Vimu app to connect to my home computer. I used to optical out to connect to my sound system. The voice command doesn't work for everything but didn't find this to be a big deal. I do like how i can sync my  android tablet  to YouTube.", "verified": true, "helpfulness": "0/0", "author": "Kemp J."}, {"rating": 1.0, "review": "Freezes up all the time, full of bloatware. Roku was much better, i had such high hopes for this thing with the stats they gave. I am really let down by the quality. If they could fix the constant freezing it would be fine. Hulu and Netflix both do the same freezing. Rouk still works fine though with same wifi connection.", "verified": true, "helpfulness": "4/5", "author": "K Sully"}, {"rating": 2.0, "review": "Having difficulty getting Netflix to work with this.  I am really disappointed.", "verified": true, "helpfulness": "0/1", "author": "Jimmy"}, {"rating": 5.0, "review": "Just wishing for a TabloTV app, and Vudu, then I'd have everything I need in this one little device.So far it has been working great, I bought it instead of a Roku streaming device (even though Roku offers the two apps I mentioned) because a) I'm a Prime member and can enjoy my prime video & prime music and b) the specs were better and 3) I have hopes to see the apps in the near future.  (don't disappoint me Amazon ;) )", "verified": true, "helpfulness": "0/0", "author": "JWFlournoy"}, {"rating": 5.0, "review": "cool thing. Made our basement TV useful", "verified": true, "helpfulness": "0/0", "author": "A. Danilenko"}, {"rating": 4.0, "review": "It doesn't have the instant streaming I was led to believe it had, but overall it is really nice.", "verified": true, "helpfulness": "0/0", "author": "Barbie Young"}, {"rating": 1.0, "review": "Bought it mainly for Netflix and Showtime Anytime. For starters, Netflix doesn't work at all (and Amazon tech support was rude and didn't have a date when it would be fixed). Secondly, they didn't have my tv provider for Showtime Anytime...I'm pretty sure a huge chunk of the country uses Comcast and they don't have it.Mis-leading and not well supported", "verified": true, "helpfulness": "3/4", "author": "Max McDonald"}]