[{"rating": 4.0, "review": "Streamers, rejoice!  Here it finally is: a streamer, made with excellence, packed with power, that will handle any 1080p video you can throw at it.  It handles the Amazon ecosystem to perfection, and so much has been written about this ability in blogs and reviews.  I have Roku, which has the most comprehensive content out there, but not made for streaming beyond its ecosystem.  I have Chromecast, which handles anything you can cast, but still somewhat limited in what you can cast (even though there are some multi-step workarounds to overcome the limitations).  I have Android Mini PCs, which opened up the entire online video experience, but at a cost: dual-core processors, which didn't help with buffering issues.  The Fire TV ably addresses these issues.  All the major streaming players are here, Netflix, Hulu Plus, Sling TV, HBO Go, etc.  And since the operating system is an Android fork, you can sideload other providers as well (again, there are forums to show you the way).Two shortcomings, which I believe Amazon is in the process of addressing:(1)  Voice Search is great where you can use it (basically, the Amazon ecosystem), but it is not provider agnostic.  In other words, any voice search will take you to Amazon's product.  It's Amazon's project, and I understand that it functions as a platform to open their ecosystem.  Customers want access across providers (remember cable and satellite menus, which bring you various providers?).  It would actually create more customer loyalty to Amazon, if Amazon would unlock this feature where possible.(2)  Please activate the USB port.  With about 5 GB of space to load apps, games, etc., it fills quickly.  I sideloaded Clean Master to keep as much space open as possible.  I have, however, a 32 GB thumb drive ready to provide more space when Amazon opens USB capability.  Come on, tech team, you can do it!  Just a little code to write!  Please help us!  You did so much else right here.I'll wait for these things to happen, and I'll give them 5 stars.  It is, hands down, the most powerful video streamer on the planet!  Thank you, Amazon!", "verified": true, "helpfulness": "1/1", "author": "Dale Hughes Thornton"}, {"rating": 5.0, "review": "Love it, love it, love it. The HBOGO app keeps me from having to pay my satellite provider for HD service; same with the Hulu app (I suspect it won't be too long before we can all tell cable/satellite providers to piss off altogether). Not to mention being able to watch practically any movie ever made whenever I want. I should mention though that I was going to watch the whole Star Wars saga and none of those movies are available, as well as almost every Monty Python movie, not available either. Nevertheless this product is really quite amazing! I am quite pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Bryon Bean \"Rock n Rolla\""}, {"rating": 5.0, "review": "Amazon Fire TV is the best!!!!", "verified": true, "helpfulness": "0/0", "author": "Quoc"}, {"rating": 2.0, "review": "I prefer Romantic Movies and I find that they are so old and the good ones, you still have to pay for.  Not Happy!", "verified": true, "helpfulness": "1/4", "author": "Sue Fulmer"}, {"rating": 5.0, "review": "Less content than ROKU which was mostly junk. Much faster and easy in all regards.", "verified": true, "helpfulness": "0/0", "author": "Michael Berdine"}, {"rating": 5.0, "review": "Perfect little gadget to watch movies and tv shows at home WHENEVER you want to. I have spent most of my spare time watching movies since I bought it a couple of weeks. Love it. My only small concern is the sensitivity of remote. Sometimes it takes a couple of clicks to get AFT to respond.", "verified": false, "helpfulness": "0/0", "author": "Qi An"}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "Gerald S."}, {"rating": 5.0, "review": "Very impressed with this device. Primary (no pun intended) is to watch movies from Amazon.Very easy to setup, basically plug and play, just had to put in our wifi code.", "verified": true, "helpfulness": "0/0", "author": "britinusa"}, {"rating": 5.0, "review": "Easy to install. Very user friendly.  Fun to browse lots of options for TV and Movie viewing -- most free with Amazon Prime.  Highly recommend this item.", "verified": true, "helpfulness": "0/0", "author": "sac"}, {"rating": 5.0, "review": "Excellent product. Worked as expected. Large library of films. Arrived on time.", "verified": true, "helpfulness": "0/0", "author": "marcelino gonzalez"}]