[{"rating": 2.0, "review": "This box does what Chromecast does but it is almost 3 times the price.  I prefer my Apple TV since I can mirror all of my Apple products and have access to everything I like to watch.  Give free access to prime content and it my be worth the cost.  Since Prime price has increased seems a waste to pay for it and the box to watch the content.", "verified": false, "helpfulness": "9/59", "author": "J. Lindley"}, {"rating": 3.0, "review": "Fire TV is a very capable device, it does what it should and it does it well. It is just missing some key apps that would allow it to be my only set-top box. Right now I own an Apple TV (2nd Gen), Roku XS and Onlive Microconsole. That is a lot of little boxes taking up way too much room. They all do one thing the others don't, so I keep them all around. Unfortunately, Fire TV doesn't bring anything new to the party so it may get boxed up. The Apple TV allows me to stream my iPhone, the Roku has Aereo and Plex and Onlive lets me play real games. Fire TV needs a killer app or comprehensive functionality to be useful to me. Adding Aereo and OnLive would let me get rid of the Roku and the microconsole. I would still keep the AppleTV since I am in that ecosystem.As it stands the only cool thing is that it works with my OnLive universal controller. That saved me $40 so I am happy about that. Unfortunately, there is only one good game at launch (Sev Zero) and that is not worth keeping this thing around. This device may or may not evolve into something useful but at this point I just don't need it and the Roku Stick or Chromecast are both a lot cheaper and more useful. There is a lot of power under the hood on this thing, but I am not sure what it is for. Good try, but Amazon should have got everyone on board (including HBO Go) before launching.", "verified": true, "helpfulness": "4/8", "author": "dandercore"}, {"rating": 5.0, "review": "I have been an Apple TV fan for the past couple of years and decided to buy one of these. I have owned Roku (which leaves much to be desired).Hands down Fire TV is the best on-demand, streaming player available.Does Dolby Digital sound Out (DTS, 5.1 Etc) Via Optical or HDMINetflix In HD (Some android based players couldn't do this)Pros: everythingCons: none", "verified": true, "helpfulness": "10/16", "author": "marihstn"}, {"rating": 4.0, "review": "I purchased this system to replace my Roku which I used mostly to watch Netflix and play downloaded content on my computer via the Plex app. For Netflix, the FireTV is a champ. For Plex...it's terrible. If you choose any audio format that they offer (AAC/DD+/DTS), you get no audio. If you try to play videos at 720p or higher, you get audio pops and clicks and video freezing and stuttering to the point of being unwatchable.I tried every combination of DirectPlay on/off, Direct Streaming on/off, the experimental transcoder on/off...no luck. My Roku had no problem with this and like the Roku, I connected the FireTV through Ethernet to my gigabit network; it's definitely not a bandwidth issue.It's a shame...but back it goes to Amazon.***UPDATE 4/4/14*** Changed from 1 to 3 stars. if it wasn't for the Plex issue, I would have kept the system and given it 5 stars. I do plan to purchase again once I can confirm that the Plex issues are resolved. Not sure why others aren't having any problems as I definitely struggled with this.***UPDATE 4/17/14*** So, while I'm sure that Plex may eventually work, I was able to find the latest version of XBMC (12.4.2), a version written especially for FireTV and it works flawlessly. Not as easy as using the Plex app (you have to go into Settings, Applications, SPMC, Launch Application), but I finally have a unit that play my media, Netflix, and games...exactly what I purchased it for.", "verified": true, "helpfulness": "21/56", "author": "Lorne"}, {"rating": 4.0, "review": "I really like the hardware. It's solid and comes with an Ethernet port. On the software side, it's what you get from other companies but much faster. Haven't seen any slow down in the menus and streaming starts quickly.It's a good start, however; it doesn't really do much that other products don't. Overall, the video app selection isn't great yet. The Netflix app seems to be the exact same as the one built into my Vizio smart TV so there is nothing new there.. It doesn't have HBO yet and for some reason Showtime doesn't work with my area.. I'd like to see more partnerships with live TV providers so this could actually replace cable.Otherwise.. I'm happy with it so far and excited to see where it goes.*It helped me find out that \"The Unit\" is on Amazon Prime so I'll be busy re-watching that for a while.", "verified": true, "helpfulness": "9/10", "author": "Charles"}, {"rating": 4.0, "review": "I received my fire TV late yesterday morning. Setup was very easy as was connecting to the internet and getting my netflix and hulu accounts working. The initial update took a few minutes and after that I have had no issues.The sound when watching content is absolutely amazing and so much better then what I was getting from using netflix and hulu through my Samsung bluray player. Nice job Amazon!My personal wishlist would be a more simplistic or minimalist home screen. I would rather click on something to open up what's new or suggestions etc then to have them plastered all across the screen.  This is my only negative so far and the only reason I score it 4 stars instead of 5.The voice search works really well and I was somewhat surprised as to just how well it works but a bit disappointed that it searches only amazon content and not netflix or hulu but with that being said it is an Amazon product after all and understandable why it is this way.", "verified": true, "helpfulness": "11/12", "author": "Jeanne Winfield"}, {"rating": 2.0, "review": "The item that would set this device apart for me is access to my Amazon MP3 files which I do not see.  Amazon never thinks of the digital music customers!", "verified": false, "helpfulness": "8/39", "author": "Kim B"}, {"rating": 5.0, "review": "Amazon got this right! We had the unit up and running in minutes. Very easy to hook up. I am an Apple fan but this has it all over Apple TV. Quicker response and the voice feature is awesome.", "verified": true, "helpfulness": "6/7", "author": "Kenneth M. Potalivo"}, {"rating": 5.0, "review": "Fire TV installed great and we have used many of the apps and other features. This make our prime membership much more enjoyable and it's so easy to use. The menu is done well and I was glad that we ordered one for every TV in the house.", "verified": true, "helpfulness": "6/6", "author": "T. L. Gibby \"John\""}, {"rating": 1.0, "review": "Why spend $99? How much do you think it cost them to make this, probably like $20. Just buy a chromecast for $20-$30 used or new for $35.", "verified": false, "helpfulness": "13/199", "author": "U.A"}]