[{"rating": 5.0, "review": "Low profile and FAST! Love it. I replaced my Roku 2 with it.", "verified": true, "helpfulness": "0/0", "author": "William W. McConkey"}, {"rating": 4.0, "review": "I think the amazon fire TV was one of the best devices I purchased. I did research on all the similar devices and am glad I chose the Amazon fire TV. Another good thing is if u have the kindle HDX you can mirror display onto ur big TV. Kinda cool feature. I like the YouTube app as well....I am not a gamer so I have not played with that part of it. Watching movies with amazon or Netflix is cool. I am so pleased I purchased this. I recommend this product for sure.", "verified": true, "helpfulness": "0/0", "author": "shelley jones"}, {"rating": 3.0, "review": "What I think sucks is they give you a show to watch then after a few of them they make you pay for them and when you have prime ( and you pay for it ) there is not a lot of movies that you get free", "verified": true, "helpfulness": "1/1", "author": "Kyle A Nagy"}, {"rating": 5.0, "review": "Perfect for my needs, very easy to use and voice commands work great.", "verified": true, "helpfulness": "0/0", "author": "Kenneth P. Aspan"}, {"rating": 5.0, "review": "Beats cable by a long shot! I could never find anything to watch on cable. With Fire TV I play Amazon free prime movies, Netflix, and Hula Plus. Voice command works great! There is also an app called Flixster I recently downloaded for free that tells you about movies-upcoming, in theaters, and on DVD. Very useful app. I could go on and on! I am happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 5.0, "review": "I was using my Wii system to watch Netflix, Prime, etc and it was such a hassle. The Fire is much better.  Set up was simple-basically plug in, set up your applicable accounts on screen and go.  Well worth price.  Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "BigM"}, {"rating": 4.0, "review": "It is a good player and very quick.  I like it better than Apple TV (not part of the Apple ecosystem) but, for me, Roku 3 is still the tops.  UI on Amazon Fire is quicker, and voice search is ok...but voice search only works for Amazon properties (i.e. it won't search Netflix or Plex).", "verified": true, "helpfulness": "0/0", "author": "Daniel Bruno \"Opinionated Geek\""}, {"rating": 5.0, "review": "I could not wait until my Amazon Fire TV arrived!  I was not disappointed.  Take that Comcast!  It's easy to install and looks good too.If you purchase this product, you won't be sorry.", "verified": true, "helpfulness": "0/0", "author": "J!"}, {"rating": 5.0, "review": "My daughter is using it for now and she loves it. Amazon content loads well even on our slow DSL connection...other applications depend on your internet speed but that's valid for any device.", "verified": true, "helpfulness": "0/0", "author": "Vlad"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "James J."}]