[{"rating": 5.0, "review": "I will admit I am am amazon addict so I like to buy their products so I decided to give this a try.  This device is awesome and really organized all of my streaming services nicely.1. The voice remote works flawlessly.  If you have any issues with it it will likely be due to your accent, lisp, or the number of adult beverages you have consumed.2. Being able to side load any android apps to it is a cool feature.  I always prefer a company that isn't afraid to let their customers customize the product that they have bought and own.  Yeah, that's a snub toward Apple if you noticed.  The best way to do this is using app2fire on an android phone to send apps to the fire tv.  You will have to google the process because it takes a few steps to configure the fire tv to do this.3.  I highly recommend a Prime membership because Amazon has set this thing up to be partial toward their products.  Now, its not necessary to enjoy it but I like to get the most out of what I buy.  I already had the membership anyway and its well worth it overall.", "verified": true, "helpfulness": "0/1", "author": "J. Goulding"}, {"rating": 5.0, "review": "i love this. would like to buy it for all my friends", "verified": true, "helpfulness": "0/1", "author": "Janice Anheluk"}, {"rating": 5.0, "review": "I am very happy with the simplistic of this device.  So easy to install and set up.  l am still learning but l am very pleased with it.", "verified": true, "helpfulness": "0/1", "author": "Billibob A."}, {"rating": 5.0, "review": "Easy setup, variety of programs to choose from", "verified": true, "helpfulness": "0/1", "author": "Eastr 0067 \"William Easter\""}, {"rating": 5.0, "review": "Basically an upgrade of the fire stick with slight improvement- more memory and better performance", "verified": false, "helpfulness": "0/1", "author": "Jenny Hulse"}, {"rating": 5.0, "review": "love the ability to add a usb device such as a keyboard and has an intuitive interface.", "verified": true, "helpfulness": "1/2", "author": "azuser1110"}, {"rating": 5.0, "review": "I added a medium-sized flat screen TV when I built-out my home office. My original plans were to run an additional cable line to it so I could keep news, sports, etc. playing in the background while I worked or relaxed in my new space. Well, I never got around to running the cable and to be honest, I'm probably not going to.In fact, it has really made me question why I pay close to $230 per month for cable anyway. What good is having a few hundred channels that are not worth watching in the first place? Besides, thanks to \"bundling\" I unwillingly support channels & views I don't agree with (okay, I'll save that rant for another day).With this little honey, I get YouTube, Hulu Plus, Netflix, Pandora, HBO Go, and a ton of movie options available from Amazon Prime...all on demand. Yeah, some of them are subscriptions, but I can always opt out of them if I get bored or something better comes along.The long and short of it is this: The Fire TV will be the reason I drop all but basic cable, save myself quite a few bucks and forever stop ranting about bundling : )I absolutely love this thing. If you're a Prime member, it comes out of the box ready to go (in fact it took longer to unpack than to set up). The directions were easy to follow and I literally use it most every night. I'm sure there's more that I can do with it, but as for now...I'm very happy I didn't run the cable.", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Sandra"}, {"rating": 5.0, "review": "We bought this mainly for travel.  We check into a hotel, hook this up to the TV and wireless, and just like that we have all of our Amazon library, Prime, etc.  It works well, and only one older TV so far has been a problem.  It has worked fine in a half dozen hotel rooms.  Once we got it, however, we discovered that it is also nicer in many ways than our smart TV.  It is easier to use, and the voice search is great.  For such a little box, it does an amazing job.", "verified": true, "helpfulness": "1/2", "author": "William A. Nolan \"freeholder\""}, {"rating": 1.0, "review": "Everything you want to see cost $. You have to be subscribers of HBO,SHOW TIME ,CINEMAX. to access.", "verified": true, "helpfulness": "2/6", "author": "Howard Mitchell"}]