[{"rating": 3.0, "review": "Had to return this, due to issues with the sound quality. The sound quality, even with our HDMI cable was horrible. It sounded like it was coming from inside a tin can. I think you would need a sound system for it to be better. None of the sound quality options on the unit made it better. Other than that, I would have loved to have kept it! I liked the voice command/search options and second screen capability. It responded quickly and pulled up information very fast!", "verified": true, "helpfulness": "0/0", "author": "Jessie Monks"}, {"rating": 5.0, "review": "I LOVE my Fire.  Small and unobtrusive on my cabinet.  Packed full of great stuff.  Use it to access Prime, Netflix, youtube, photos, etc.  Fantastic device.", "verified": true, "helpfulness": "0/0", "author": "Dawn"}, {"rating": 1.0, "review": "What channels are on this junk?!  LIST THE FULL CHANNEL LINEUP.", "verified": false, "helpfulness": "1/1", "author": "Christian Eidsmoe"}, {"rating": 4.0, "review": "This is my first time using a device like this, as I debated getting the Apple TV or Roku.  But I use Amazon so much it made sense to get this device.  It took a minute to figure everything out, such as Closed Captioning and some other settings, but it seems to work as advertised. It does lag a little bit, not sure if it's my connection or just the way it operates.  The remote seems very intuitive, but it lacks a volume control.  I hope there will be more apps in the future.", "verified": true, "helpfulness": "0/0", "author": "L'Doleur Exquise"}, {"rating": 5.0, "review": "LOVE my Fire TV!!!!  Especially because I'm a prime member. In the past I would have to hook my laptop up to our TV in order for my husband to watch prime movies/tv series with me. But now with the amazon tv, it's so much easier.  And I really like how you can talk into the remote and it will pull up whatever actors, movies, tv shows that you say.", "verified": true, "helpfulness": "1/1", "author": "Lynn Snow"}, {"rating": 5.0, "review": "Holy Macro! I love this little box of entertainment!!!!!!!! you can do so many things with it! The voice search is absolutely on point!", "verified": true, "helpfulness": "0/0", "author": "Will A."}, {"rating": 3.0, "review": "My husband talked me into keeping it because it is a very convenient way to scroll through photos on my 55 inch screen.  However,  I am disappointed in the prime movies that were offered.  I thought there would be a better selection.  There are very few I would even be interested in watching.  I can't see how my prime subscription helped me much.  I might as well go to Red Box and spend $1.69.", "verified": true, "helpfulness": "0/2", "author": "Jcuc"}, {"rating": 5.0, "review": "Two \"issues\". The thing works great, however it is really aggravating that Amazon sees no problem with disallowing access to the \"root\".  OK, so some won't know how to use it, and may \"brick\" the box, but that could be easily fixed with an online link to default reset the thing from the internet, and for those who know what they're doing, there are lots of configuration things that could be profitably adjusted with full access.  Such as what shows up on the home screen, so that you don't have to do a bunch of drilling down to get access to add on apps.  Also, since Amazon has decided to play ghost daddy, then I respectfully request that the guru's there create a home page choice that excludes pay per view.  And, concerning that......I have Directv, and for what I pay for that, which is not cheap, I get to see all of the current fare of TV shows, series and what have you.  To see a past season tv show from a series costs 4 bucks?  A 8 or 10 year old movie, like Pitch Black, is 4 bucks just because it's still popular?  At these prices, I'm guessing that Amazon has promised to not encourage people to migrate to web services like theirs for their entertainment, which is part of the reason for this device.  A bunch of the free stuff is throwaway.", "verified": true, "helpfulness": "0/1", "author": "R. Hackney \"protek25\""}, {"rating": 5.0, "review": "Amazon Fire TV is great! We also have Apple TV but Amazon has \"ease of use\" mastered, including the voice command feature!  Set up is so easy!!", "verified": true, "helpfulness": "0/0", "author": "L. McClure \"A Non-Fiction Reader\""}, {"rating": 5.0, "review": "Loving the Amazon Fire TV and the fact that I no longer have a hefty satellite bill to pay each month!", "verified": true, "helpfulness": "0/0", "author": "Heather Ward"}]