[{"rating": 5.0, "review": "Pulls up shows so fast, loads quick, and it streams seamlessly.  love it! wish the tiny remotes didnt cost so much to replace. I'm sure its just a matter of time before one goes missing! My fie year old can tell it what he wants to watch and it pulls it up for him. So super easy to run. There are parental controls that are great so you can lock purchace's so your little ones aren't ordering shows.", "verified": true, "helpfulness": "0/0", "author": "mommoffourboys"}, {"rating": 4.0, "review": "Works great. We have a google TV that wouldn't get Hulu so this solved that problem and speeded up the whole process.", "verified": true, "helpfulness": "0/0", "author": "cn43idaho"}, {"rating": 5.0, "review": "I love this little box!  When streaming Netfilx or Amazon content through my laptop, there was always a lag - at times the speech and the actors mouths were WAY off and it was very distracting.  There is none of that lag with this box.  It is very simple to use and I love that it has a remote.", "verified": true, "helpfulness": "0/0", "author": "Diane Carroll"}, {"rating": 4.0, "review": "The biggest down side is that it burns through the batteries in the remote every couple of days.  I'm taking the batteries out between uses", "verified": true, "helpfulness": "0/0", "author": "Paul the Air Head"}, {"rating": 5.0, "review": "My wife bought this for us for Christmas...I will say if she had asked me prior to buying it I would have dusuaded her.  I thought...what do I need this device for, I have cable and access to Netflix and YouTube...what's this doing for me I can't already do.Well let me say it's just simply awesome.  The voice feature works great.  I feel like all videos are upscaled better than 1080p...because when I rent movies from Comcast they do not compare in quality to fire tv.  The games are awesome...just overall great purchase love it.", "verified": true, "helpfulness": "0/0", "author": "UGK26"}, {"rating": 1.0, "review": "No! The remote will not work", "verified": true, "helpfulness": "1/2", "author": "Pat myrick"}, {"rating": 4.0, "review": "Well I was initially excited to get the unit but using it is really expensive.  I think it is more cost effective just watching shows on HBO", "verified": true, "helpfulness": "0/0", "author": "Roger \"Jolly Roger Roatan\""}, {"rating": 5.0, "review": "Like being able to watch ontv and not just kindle. I don't like the fact that it's easier to browse shows and movies on my phone but not on tv. The ones you have to pay for should be separate.", "verified": true, "helpfulness": "0/0", "author": "Dixie"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "kelli a cowley"}, {"rating": 4.0, "review": "Easy to set up, but validating the different apps burdensome.  Netflix trick is to find the white on red app as the red on white is a no go.  Hint: it's buried in the app selections.  Once setup it's very good.  The voice search is amazing, but we all know that the best stuff isn't prime - still, a small fee beats a trip to the cinema.  It's much smarter than the \"smart TV\" to which it's attached.", "verified": true, "helpfulness": "0/0", "author": "Mary A. Dye"}]