[{"rating": 5.0, "review": "I say glad.", "verified": true, "helpfulness": "0/0", "author": "VENNIE - LOUISVILLE, KY. \"FLOYD WILKINS\""}, {"rating": 3.0, "review": "I previously had a Roku 3 and decided to move to the Amazon fire based on the specs (and low price).. The only real downside to the Fire TV is that they don't seem to have a remote app for a smartphone or tablet yet.. I keep my Fire TV in my media closet which is too far away from some of the rooms with my TV's.. the remote included does not reach far enough.Amazon, please release a remote app for iOS!Other than this, I'm pleased with it so far.. and bought one for my grandparents as well.", "verified": true, "helpfulness": "1/1", "author": "Brett"}, {"rating": 5.0, "review": "Not a tech or gamer  but love this little gizmo! It meets all my needs AND I don't have to get another stupid cable box for $6.99 a month.", "verified": true, "helpfulness": "1/1", "author": "Diana"}, {"rating": 5.0, "review": "I was replacing a first gen Apple TV 160 gig in my bedroom. I use the Prime Movies quite a bit as well as a few shows we buy seasons of to get the HD content and skip the commercials. I was shocked to see the speed of this little guy. My apple tv took a few minutes to load HD content, sometimes an hour if a big movie but the FIRE is instant. I am VERY happy with the purchase! My only quandary is the only way to turn her off is allowing the auto turn off (30 minutes). The great news is that HAS happened each time so great! I WOULD suggest a firmware upgrade that allows the play button or other to turn it off if you press it for 5 seconds like the Apple TV does? Small issue though. If you want a LIGHTNING fast way to watch TV/movies etc, this is it!", "verified": true, "helpfulness": "0/0", "author": "Speed Freak"}, {"rating": 5.0, "review": "Very good product. You have smashed the competition. I have a few things that I would like Amazon to consider if they would be so kind.1. I am an Amazon Prime member but my voice control will not work with Netflix. This is a big downer for me because I have heard a lot of hype about the voice commands. When the voice commands are used on Prime they do work well.2. It would be nice to have a volume button added on the remote so you could use this remote as a one stop shop as Fire TV is able to accept the signal from anywhere it is positioned in the room.3. Could you make a single selection menu button that holds all of the apps that you would like to have similar to Xbox? I do not need to decide if I would like to play a game or watch tv every time I turn the tv on. I would like to have Netflix, Amazon Prime, and whatever other app that I might choose from displayed on the screen at startup. If I would like to play a game or do something else every once in a while I do not mind clicking my way to the game.4. Could you make a controller that gives you some kind tangible response to pushing the button without it making a CLICKING noise when you are scrolling through titles.5. THANKS. EXCELLENT PRODUCT AT A GREAT PRICE.", "verified": true, "helpfulness": "0/0", "author": "Cole"}, {"rating": 4.0, "review": "Review from an owner of a Roku 3 & Roku 2.  First, the picture quality is awesome!  This outshines my Rokus.  Navigation is ok with remote, no better or worse than Roku.  I love the voice search!!!!  Works great!  In fact I bought this for my parents bedroom tv, as the voice search is spot on, and they are easily able to navigate without putting on glasses!Reason a star is removed????  There is a USB port, but NO functionality to hook an external hard drive up to watch movies!!!  This needs to get up & running by Amazon; hopefully an update will be released soon!  Honestly I would have removed 2 stars but due to the exceptional picture quality, I did not.", "verified": true, "helpfulness": "1/1", "author": "S. Miller \"smiler713\""}, {"rating": 5.0, "review": "great quality!!", "verified": true, "helpfulness": "0/0", "author": "Kristen Vanderoudermeulen"}, {"rating": 5.0, "review": "I will not bore you with a lengthy review. In my opinion this device is worth the money. The voice search actually works albeit only for Amazon content. I would like the voice search to operate across all platforms, particularly Netflix. The so-called \"In-App\" purchasing opportunities are annoying although you can set controls for them. Overall, this is a wonderful device, and like anything, there is always room for improvement. Great job Amazon.", "verified": true, "helpfulness": "1/1", "author": "fraufoust"}, {"rating": 2.0, "review": "Too expensive watch a movie !!!", "verified": true, "helpfulness": "1/5", "author": "marguerite filippo"}, {"rating": 3.0, "review": "I like the product but Prime does not work outside the USA.", "verified": true, "helpfulness": "1/1", "author": "Johan Prieto"}]