[{"rating": 5.0, "review": "I'm Hooked! Great entertainment!", "verified": true, "helpfulness": "0/0", "author": "TC"}, {"rating": 5.0, "review": "Great wireless media player with optical audio interface to my legacy Hi-Fi equipment.  This incredibly small box has an amazing list of capabilities.", "verified": true, "helpfulness": "0/0", "author": "Warren P Reif"}, {"rating": 5.0, "review": "Very easy to use. The voice command works good and is very useful.", "verified": true, "helpfulness": "0/0", "author": "HAT5"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "JOHN P VANLEER"}, {"rating": 5.0, "review": "wish it had more newer shows and movies", "verified": true, "helpfulness": "0/0", "author": "Brent Deckard"}, {"rating": 2.0, "review": "Love its availability, but hardly anything I enjoy is on it. I play Candy Crush and am a big Facebook user, and neither of them are available on Fire TV. Now, don't get me wrong---I love that it has Kindle Freetime and transfers between my other Amazon devices, but in order to get a higher rating, this product needs to have a much wider variety of FREE features as well as the most commonly used apps other companies have.", "verified": true, "helpfulness": "1/4", "author": "Anne Cover"}, {"rating": 5.0, "review": "Can't say more than what everyone else has said, we love it!  Didn't know our tv required a cable to connect it so wasn't able to enjoy it on Christmas  day but once we got the cable, its been fantastic.  I think Amazon oversold us on the number of movies we'd be able to watch though, as most are for rent, and not \"free\" and the movies that are free are not that great of a selection, yet.  Amazon charges $1 less than what we pay for movies on demand through our cable company.", "verified": true, "helpfulness": "0/0", "author": "BOOK REVIEW"}, {"rating": 5.0, "review": "Like that I can watch whatever I wish with going to the store to rent it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jomni\""}, {"rating": 1.0, "review": "You have to pay more for new release rentals than going to redbox", "verified": true, "helpfulness": "2/6", "author": "Tiffany Taylor"}, {"rating": 4.0, "review": "I had an Apple TV, but got rid of it because it did not have an Amazon Prime app.  I like the features of the Amazon Fire TV with the voice search, but think the menu on the Apple TV is much easier to navigate.", "verified": true, "helpfulness": "0/0", "author": "Monica"}]