[{"rating": 2.0, "review": "I noticed right away one of the shows that was free on my computer in my prime account was not on the FIRE box. Most of the free content was NO WHERE to be found. Apparently this is not going to happen. You can't search just free prime content so sometimes you have to go through almost 100 items to find one thing available for free. Unless you pay for alot on prime I would suggest saving the headache.Te voice feature is amazing though. Spot on every time, but because it doesn't do me any good so we are returning the box . If they add a prime only search feature for free content I would buy again.", "verified": true, "helpfulness": "3/5", "author": "Courtney M. Addis"}, {"rating": 5.0, "review": "My past history of streaming players consisted of a Netgear NeoTV Streaming Player NTV300, a WD TV Live Media Player Wi-fi 1080p,Roku 3 Streaming Media Player, and Google Chromecast HDMI Streaming Media Player.  I ditched the Netgear for the Western Digital (which was a huge upgrade at the time).  I then got a Roku 3 for another room.  The comparisons between the Roku 3 and the Western Digital were night and day.  The Roku was everything the Western Digital wanted to be.  Fast, fluid, lots of content and especially played content WITHOUT locking up.  The Western Digital was just sluggish and would lock up multiple times in a row.  I almost smashed it with a hammer and I was about to replace it with another Roku 3 until.... Amazon announced their FireTV.Now in my younger years, I would have jumped on this device the day it came out.  I was the kind of tech guy that needed to have a new product first, without having read any reviews.  As a more mature adult, I am more reserved.  I'd rather read reviews and take my time before buying anything these days.  I spent a week, gathering opinions from various tech sites as well as reading reviews about the FireTV.  After hearing all the positives, especially from Roku 3 owners, I decided to pull the trigger.  I purchased the Amazon FireTV.Hands down, this product is very solid and I haven't even given my Western Digital SMP an afterthought since I replaced it.  The interface is well built, has a VERY fluid GUI, and streaming via various apps is top notch.  I attribute this mainly due to the advanced hardware, as the FireTV's internals are way beyond anything out there in the market.  I suppose as a comparison, you could compare it to computer ownership in the past.  Have you ever had a computer that aged with time... only to replace it with a brand new one.  And then you were so amazed how slow it was compared to the new one, you couldn't imagine using the old one ever again?  That's the FireTV compared to the Western Digital.  The closest competitor to this thing is the Roku 3.  Each has their pros and cons, which I'll get to shortly.  I only anticipate that Amazon put such advanced hardware in this device simply to make it future proof and with software updates, this will last at least 2 years until they replace it with a FireTV 2.  You see, my ownership progression of the Netgear to the Western Digital to the Roku 3 all occurred in the past year and a half.  In that short time frame, something as crappy as the NeoTV was usurped by the Western Digital (and 2nd generation Rokus).  The Western Digital was considered the pinnacle of streaming media players until the Roku 3.  The night and day differences between each model is astounding.As I mentioned, since the closest competitor is the Roku 3. Both products are the same price, but you get much more advanced hardware with the FireTV.  Since the Roku 3 was released 1 year ago, I personally think that Roku will have to up the game with the new competition.  You see, the Roku 3 was released in March 2013, over a year ago.  Prior to that, their previous version of Roku 2s were released in July 2011.  That's almost 2 years of differences between models.  You can expect that Roku might have to update their product within another year.  However, the Amazon FireTV is not the end-all, be-all product for streaming.  At least not yet anyway.While others have hit on the minor points, such as voice search limitations, lack of local USB function (for streaming of USB content), no headphone jack (Roku only does this), Bluetooth-only remote, lack of integration to Amazon MP3, etc, I won't get into that.  I'll get to major points of the FireTV.]With the great hardware comes great speed.  Not just via the GUI (the interface) but streaming as well.  Streaming is so fast, this thing doesn't even seem to buffer anything compared to the Roku.  With the Roku, buffering can take anywhere from 2-10 seconds but over time, those 2-10 seconds can amount up to a lot!  The *ONLY* speed hiccup I've seen is when I downloaded a bunch of apps and browsed around while the apps were downloading/installing.  During the installation of apps, you could see this get choppy, but it didn't last long.  The latter point is really moot since nobody is going to install apps more than 1% of the time.]The FireTV is new.  Prior to Amazon releasing it, nobody published anything about it.  It was hush-hush like the NSA.  Because of the lack of publicity, there are not many services/apps/games available on it.  While the product page lists a comparison of \"services\" to Roku's matches up nicely, Roku has HUNDREDS of \"Channels\".  These \"Channels\", available through the Roku Channel Store, pretty much has everything a video lover would want.  The FireTV?  Not so much.  Of course the main ones are on there like Netflix, Hulu, Amazon Prime, etc, but beyond that, there's really nothing else of use.  I'm not a financial person, so I don't really care about Bloomberg.  I don't use Vimeo, so that is pointless for me as well.  Consider the lack of content to be a CON, but I do expect it to get better with time as developers have more time to program for the FireTV.]Sure the FireTV boasts 100s to upcoming thousands of games for the FireTV, but a lot of them will probably require the game controller, which costs $39.99.  Their big push for gaming is probably the reason for the heavy-hitting hardware, but their gaming library is pretty much useless unless you have the controller.  Luckily when looking through the gaming library, you can sort games by either the FireTV remote or the Gaming Controller.  Just know that games available for just the FireTV remote are dismal.So for those of you wondering, my setup with my Fire TV only includes a SmartTV and a 5.1 channel sound bar sound system.  I am using HDMI for my audio, which is being output by the TV via optical to the soundbar.  I mainly use the Plex app, Netflix, Hulu Plus, and Amazon Prime for my video streaming options.  For music, I use Pandora or iHeartRadio.  Despite the Plex app costing $1, it is 100% worth it if you have the Plex server on your home PC.  If you want to stream any kind of content from your PC to Plex, do it.  It blows DLNA out of the water.  I've converted to Plex and have not looked back.The FireTV is a fine purchase.  If you want my opinion on whether to get the Roku 3 or the FireTV, I can say you can't go wrong with either... BUT considering the same price-points on both products, I would opt for the FireTV.  It's newer, it's faster, and streaming-wise, it can do everything the Roku 3 can do if you use the major popular apps.  The only downfall is the lack of content, but if you're patient, it will come.", "verified": true, "helpfulness": "2/2", "author": "Hyoun Kim \"Faluzure\""}, {"rating": 5.0, "review": "This is the first streaming set-top-box I have ever owned, so I can't make any comparisons. This thing is a beast though. Very fluid and smooth UI. The remote is simple, which I like. The voice search works flawlessly. Yes it does not bring back results for all streaming services, only amazon. I believe this will be corrected once the 3rd parties update their apps. There have been new apps popping up every day. This is an android device- so the port from google play store to this will be a breeze for devs.One thing I have noticed- which I don't know is an issue with other streaming devices or not- is the fact I have to change the volume for almost every app. I wish there was a volume stabilizer or something built in. I use a soundbar with a subwoofer, so the loudness intensifies when I go to a new app and play something- then shake the entire condo and probably wake the neighbors. The explosions, music and everything else are sooo much louder than voices also. It might be my soundbar sucks too as well. When connecting HDMI from my laptop to my TV I have to use the volume stabilizer built into my laptop's audio driver or I will have the same issue. I have just turned off the soundbar and use the TV speakers now and it seems much better. I don't think this is an issue with the fireTV itself, it's just there is no uniformity or protocol to follow for the 3rd party apps. I will have to look into a expensive a/v receiver and speakers with volume control to remedy it myself.All in all- this thing makes cutting the cable effortless", "verified": true, "helpfulness": "0/0", "author": "jradish"}, {"rating": 5.0, "review": "I've been apprehensive in purchasing one of the streaming devices. I was going to get a Roku 3 when Amazon Fire came out and I purchased the Fire TV. Simple plug & play use (since I am already a Prime member it came loaded to my account). Set up was easy, it downloaded new software and in 10 minutes I was watching it. It streams great on my ATT wireless router (which I will be updating to fiber optics DSL soon for better streaming & faster download speed). ATT is phasing out copper based DSL and will not be supporting any longer (according to service tech). I would highly recommend this device to anyone. Its simple sleek design blends in with TV base where the only thing you can see is a small white light telling you it's on.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Allen"}, {"rating": 4.0, "review": "We are still learning this device. So far we love it. Will post again in about a month to let you know if we still love it.", "verified": true, "helpfulness": "0/2", "author": "Mamaism"}, {"rating": 5.0, "review": "I plan on getting another for another room in the house because its that awesome. I just need to get it to work with my harmony Logitech remote so i don't have 2 remotes.", "verified": true, "helpfulness": "0/0", "author": "keith"}, {"rating": 4.0, "review": "I own all the brands except Apple TV and the video quality looks to me to be better than even my Roku 3. It is a lot faster in its response time too.", "verified": true, "helpfulness": "0/0", "author": "B. Woodley"}, {"rating": 5.0, "review": "Love it, very fast and works like described. Easy to set up and use. My wife even thought so. Great!", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 5.0, "review": "I really like how easy it is to use and access both Netflix and Amazon Prime.It is SO MUCH EASIER than accessing through XBox", "verified": true, "helpfulness": "0/0", "author": "Frequent Online Shopper"}, {"rating": 5.0, "review": "I do not know how I was living without this! Apps run faster than expected. Fantastic features. Voice control works super well.", "verified": true, "helpfulness": "0/0", "author": "Jenay Rhoads"}]