[{"rating": 5.0, "review": "I love it is is so awesome", "verified": true, "helpfulness": "0/1", "author": "Sylvia Mendez"}, {"rating": 5.0, "review": "Can't say enough about AMAZON FIRE TV.  Fast to connect, ease in use, speed in delivering movies  the selection is amazing  Nothing to say bad about this tiny box of wonders. The voice activation is so simple with immediate results. My wife and I love it.  There are two things I hope to see in the future one is more old Oscar wining movies that are free ( this extra charge was a surprise) though copyrights are the reason. I also would love a good news channel. Then we can rid ourselves of the high cost of satellite or cable. This is really wonderful. The clearest picture we have ever had.  Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "John Rogers"}, {"rating": 5.0, "review": "Just Got ours today, So Far its great, we've watched a prime movie, watched you tube, played music videos and played games.. Looks to be a cool addition to our entertainment center..Had for well over a year now Still Love it.. With apps like plex and amazon prime it has become the center of the living room!All of a sudden it wont stream video anymore.. all it does is buffering buffering...", "verified": true, "helpfulness": "0/0", "author": "Jason Davie"}, {"rating": 4.0, "review": "I was under the impression that all TV programs would be veiwablw through Amazon Fire. However, I discovered that quite a lot of the latest showa are either not made available immediately, and are released two ro three weeks later, or when they are available you would have to pay to watch them. Time Warner Cable already had most of these on demand programs available for free. Just be aware that you can't replace your cable company by having Amazon Fire.", "verified": true, "helpfulness": "1/2", "author": "Zareh Khachatoorian"}, {"rating": 4.0, "review": "Love it, but only giving it 4stars b/c you can't tell if this is a purchase or free with Amazon Prime until you open the movie or TV program...it would be very helpful to know this info when scrolling thru the movies or TV programs!!", "verified": true, "helpfulness": "1/2", "author": "Tharen"}, {"rating": 4.0, "review": "Wish there were more movies and shows on Prime", "verified": true, "helpfulness": "0/1", "author": "Lori J."}, {"rating": 2.0, "review": "haven't found a use for it", "verified": true, "helpfulness": "0/8", "author": "Charles Spain Verral Jr."}, {"rating": 1.0, "review": "I'm blown away amazon would release this device without full functioning amazon mp3.  I have 3 rokus.  i purchased fire tv assuming I would be able to enjoy prime music I couldn't access on roku.  Wrong!  Fail amazon.  What have you become?  You expect me to want a fire phone after this?  Should i assume that device will also not give me access to prime amazon music?  Don't make your customer suffer by releasing crap just because your developers didn't hit their targets.  Not difficult to understand.  The device has your name on it.  Shouldn't it provide full blown access to your content?  I can stream prime music from my idevice for god's sake.", "verified": true, "helpfulness": "11/12", "author": "dannyboy"}, {"rating": 5.0, "review": "Update. after some tweaking and testing the surround works great with .mkv and my amazon prime music appeared and works great.Great Job Amazon. you nailed it!I'll probably get 3 more.", "verified": true, "helpfulness": "0/2", "author": "Glenn T."}, {"rating": 2.0, "review": "We have had this for about a month now and there are very few shows that I actually want to see available through prime. Nearly everything requires additional payment.", "verified": true, "helpfulness": "1/4", "author": "Sarah"}]