[{"rating": 4.0, "review": "I like the little box for putting my content on the big screen. There is one fly in the ointment though. It's got Bluetooth for game controllers, but not for headsets. I'm very hard of hearing, and to crank up the volume for me to hear it, makes it uncomfortable for others. I have Bluetooth headphones and use them on all my other devices (Kindle Fire, IPad, cell phones). To enjoy a movie with my wife and others, it would have been very nice to be able to use my Bluetooth headphones. Fire TV dropped the ball in this one way. Other than this one flaw, it's a very good little unit. I'm sure my family will enjoy it, to bad I can't join them.", "verified": true, "helpfulness": "2/2", "author": "Harley"}, {"rating": 5.0, "review": "I've had Roku, I've had Apple TV, I have two PS3's, but nothing is as easy to use as the Amazon Fire TV.  LOVE the voice search!  You can find anything instantly!  By actor or by show name.  It's awesome, I highly recommend it!  Use your other apps on it, use Amazon Prime instantly on it, it's great!", "verified": true, "helpfulness": "0/0", "author": "CL"}, {"rating": 5.0, "review": "i lost my remote", "verified": true, "helpfulness": "0/4", "author": "theodore walker"}, {"rating": 4.0, "review": "The information is very helpful, but it is very hard for me to hold the remote and tablet, and watch the screen too. Besides, I'm a slow learner at 85 years of age. I wish I had the fast thinking mind I had a few years back. But I accept the challenge, knowing it will take me longer than someone younger.", "verified": true, "helpfulness": "1/1", "author": "Ray Ranallo"}, {"rating": 5.0, "review": "you have not bought the amazon fire yet / I give you a tip. Buy two or three you will like this product so much ,that a extras might come in handy for the upcoming HOLIDAYS.", "verified": true, "helpfulness": "0/0", "author": "Lucky Leo"}, {"rating": 2.0, "review": "How do you shut this thing OFF?  We are not into wasting energy, which it seems we are forced to do.  Once we return it to the Home Screen, and shut our TV off... the little blue light remains on.  We want to shut it OFF.We've had this about 3 weeks.  3 days ago it lost audio.  We bought a new HDMI cable (ours was only a few months old) and did a factory reset.  That seemed to work.  Although, with this device being only 3 WEEKS \"old\", a factory reset should not be necessary.  Yesterday, it not only lost audio once again, but began flashing a gray screen every few seconds (the type of screen normally seen with the sound of static and squiggly lines).  We again did a factory reset.  I walked away out of frustration, as this was my bright idea of a fun winter purchase for the family, and it seems to be causing more headache than anything.  I will be returning this should it falter again in the next 48 hours.I'm sure that adding an on/OFF button would help the system work for longer than 3 weeks.  I'm disappointed, Amazon.", "verified": true, "helpfulness": "0/8", "author": "A. Wasser"}, {"rating": 1.0, "review": "Well, I was going to keep my Fire TV after the 30 day trial but with the price reduction I guess I'll return it and buy it again.", "verified": true, "helpfulness": "2/20", "author": "Rick"}, {"rating": 2.0, "review": "It does not work very well. Our internet country service must not be enough. Sometimes we can watch something but it is almost always interrupted by slow signals. Our I Pads and laptop work fine but Amazon Fire...not so great.", "verified": true, "helpfulness": "2/9", "author": "me@59"}, {"rating": 1.0, "review": "Update 10/31 - I never got around to sending the second back and it mostly worked fine.  Amazon just changed the Roku app though and now I'm done done.  They literally removed the Most Recent Played list and your Watchlist.  You have to search for anything you want to watch.  Even if you just watched it.  I am shocked at how bad Amazon is at technology.I purchased this streaming box, in spite of the fact that it can't access either HBO Go or Vudu, mainly on the assumption that I would be buying a controller and purchasing some games for my son.I've now had two units and both have had the same sound issue.  About 25% of the time, the sound is distorted.  The only way to fix the issue is to restart the whole unit.  This can only be accomplished by unplugging it.  How stupid is that?  Also, one time, the device failed to play Netflix content at all.  I ended up just using my Chromecast (it worked fine).  So, I will be sending a second Fire TV back and looking at the Roku 3 or perhaps see what the next Apple TV looks like.This thing is simply not ready for prime time (TV pun!). Along with the Fire Phone failure, I think I'm done with Amazon as a tech manufacturer.", "verified": true, "helpfulness": "2/6", "author": "Mr. Robert M. Nowak"}, {"rating": 5.0, "review": "I love love love my Amazon fFire TV. Easy to use right out of the box!", "verified": true, "helpfulness": "0/1", "author": "Bonita Koelker"}]