[{"rating": 5.0, "review": "Setup was a snap. Clean, simple UI, very responsive. Voice reco works very well (hasn't missed yet). Amazon has done a great job hiding the stream buffering - playback starts pretty much immediately every time so far. All in all, a well executed design.", "verified": true, "helpfulness": "0/0", "author": "happy"}, {"rating": 3.0, "review": "I have been using the Fire TV for several months now and have enjoyed it for the most part. When I first started to use it the streaming was fast from Amazon as well as the browsing speed. After several months I am now finding some of the browsing to be sluggish. I tagged the problem with my kids playing games on the Fire like Minecraft and filling up the memory resources.I have also noticed this issue over time when the device has been on for awhile. Again the memory shows as starting to max out. In these cases I have had to unplug to restart the Fire TV.Another issue is the layout. I understand Amazon wants to sell their media, but I feel I have to hunt down my other Apps like Hulu, Pandora, Plex, and so on.. I didn't have this issue with Roku. It would be nice if they allow an App slider on the Home page.Overall if I am streaming anything from Amazon it is super fast and bo issues, when the Amazon servers are up. Funny thing is that I sometimes finding myself just using my Chromecast as it is still faster then scrolling through Amazon's window maze of options.", "verified": true, "helpfulness": "0/0", "author": "Carpe Diem"}, {"rating": 3.0, "review": "I wanted it primarily because of the voice-search but that feature does not work searching through the youtube catalog which is where I spend most of my online media time.  Otherwise I was impressed, it does work, but for others ...not for me.  If you are buying movies all day, you will be able to search for them with this feature.  Also, I can't remember but I think the apps TUBE and others are very clunky and still no one is allowing you to simply browse with these devices.  I have every online device now (I think) and the NeoTV (Netgear) is my favorite so far. The remote is comprehensive and full of features.", "verified": true, "helpfulness": "1/1", "author": "David Boxton"}, {"rating": 5.0, "review": "Nice and easy. If the remote doesn't work it's cause the Amazon batteries that came with it are dead.", "verified": true, "helpfulness": "0/1", "author": "Shane M Keyes"}, {"rating": 4.0, "review": "Better than pay-per-view on Satellite or cable. As long as you have Wi-Fi internet at home. Also, I have my CD collection on Amazon, and Amazon Prime,  so I can listen to it through my stereo system. The voice part works also.", "verified": true, "helpfulness": "1/1", "author": "Douglas Willett"}, {"rating": 5.0, "review": "Where to start?  I'm a big Roku fan, have one for every TV but This amazon Fire TV beats the roku hands down in my book, so much so that I'm getting them for every TV and swapping over.  I love the remote, very user friendly and feels really substantial not clunky. The speed is really great, the voice search is awesome, yep I really like everything about it.  All of the apps I need are available, Netflix, vudu, flixster.  And bonus I can upload my pictures (unlimited) and access them from the box, this was a big hit with the grandkids over Thanksgiving, they love seeing themselves.  Yes I could do the same with picasa using Roku but the Amazon Fire TV just works better.  We enjoyed the Amazon prime music once I figured out that I had to add the albums to my library, lol.  And when I'm watching something on my kindle I can send it to the TV box when I come back into the house.  So cool. Just can't beat this, Like I said I've bought more just waiting on delivery.", "verified": true, "helpfulness": "1/1", "author": "Mema \"Wife, Mother, Mema, Sister\""}, {"rating": 5.0, "review": "I Love my fire tv its the  Bomb.", "verified": true, "helpfulness": "0/0", "author": "Dave Wilson"}, {"rating": 4.0, "review": "Overall a pretty good deal for the money. I had some issues getting the Netflix app to download, and the \"tech support\" people had no clue on how to fix the issue. After the first software update I was able to get it to download. The only other issue I've had is that the remote is very sensitive. We have really enjoyed it so far. I'm considering dropping my cable package because we use it so much.", "verified": true, "helpfulness": "0/0", "author": "Christina Derr"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"Girl With Kaleidescope Eyes\""}, {"rating": 5.0, "review": "Easy setup love it", "verified": true, "helpfulness": "1/2", "author": "Kathy D. Bell"}]