[{"rating": 5.0, "review": "I AM excited", "verified": true, "helpfulness": "0/0", "author": "vale baldassari"}, {"rating": 5.0, "review": "My husband loves it.i bought it for a Christmas gift.", "verified": true, "helpfulness": "0/0", "author": "dking"}, {"rating": 5.0, "review": "I am catching up on TV shows I have never seen before..", "verified": true, "helpfulness": "0/0", "author": "Brian & Deb"}, {"rating": 4.0, "review": "Its pretty amazing. We have only used the Prime viewing movies and Netflix, but in doing so, we cancelled HBO, Showtime, and Cinemax on our dish service along with 99% of the crazy channels that we never watched and it paid for the box in one month. I wish that there was a way to have just one remote control, but perhaps that will come in the future.Being a Prime subscriber is certainly worth the money and now its even more useable!I like not having to go looking for many items in a store because of the amount of items that Amazon offers on their Prime delivery - now we get free movies and if we decide to rent a movie from Amazon its a buck less than the Dish network, and we get a full 24 more hours to watch them! We have not made the leap to ditch the dish altogether because we still like our evening news and the DVR feature -- but we are hoping to even look into possibly getting rid of it as well one day.In our opinion the Fire TV box is totally worth the wait and the bother of clicking  away to get into the menu!", "verified": true, "helpfulness": "0/0", "author": "CMac -Amazon Addict!"}, {"rating": 4.0, "review": "Worked as advertised!", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 1.0, "review": "I was under the impression that as an Amazon Prime \"member\" we could stream numerous TV shows and movies at no additional charge. We have found that just about everything we want to watch has a charge associated. It really makes it rather useless.", "verified": true, "helpfulness": "5/9", "author": "Linda Pullen"}, {"rating": 3.0, "review": "This is a great device, it works really well and overall I like it. BUT I can only give it 3 stars because the ABC player App is missing and HBO doesn't work for Comcast clients. Also, while the setup is super easy I had problems downloading Netflix. The device kept telling me that I already have a Netflix account and that it would start downloading soon..which it never did. I had to upgrade the software of this \"new\" device\" which fixed the problem. This was a bit frustrating and Amazon didn't really have much help to offer. I found the solution to this problem in some online forum, it seems to be a common problem. So, I'm hoping that the ABC player will be added soon, otherwise I may have to add/switch to Apple TV", "verified": true, "helpfulness": "0/0", "author": "ABO27283"}, {"rating": 4.0, "review": "Very nice!  It does everything they claim.  Works like a gem, and no problems so far.  I'm not giving it the fifth star because it could use a little more internal memory, first thing my kids wanted to do was download all the games.  Someone at Amazon should have seen that coming.  So the only drawback, it could do with more than 2GB memory.  But I'm happy with it.", "verified": true, "helpfulness": "0/0", "author": "H. Smith"}, {"rating": 5.0, "review": "I gave this as a Present and it was the hit of all presents, Buy a HDMI Cable when purchase that's makes you ready to go when thebox is opened ! This will change the way you watch TV and all movies !", "verified": true, "helpfulness": "0/0", "author": "Jimmy Deese"}, {"rating": 4.0, "review": "Really easy to setup, plug it in connect to internet and go. I knocked a star off because there's no obvious on/off button (still haven't found it if there is one).", "verified": true, "helpfulness": "0/0", "author": "Joseph F. Abboreno"}]