[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Rebekah Trice"}, {"rating": 3.0, "review": "Found it hard to use, not clear as to what you able to receive and not.", "verified": true, "helpfulness": "0/0", "author": "dthms \"DA Thomas\""}, {"rating": 3.0, "review": "Interface is far from excellent. Comcast is evil so no HBO GO indefinitely...", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 4.0, "review": "The Fire TV was simple to set up and works perfectly. I especially like the voice search. I'm very happy with it.", "verified": true, "helpfulness": "1/1", "author": "GabCy"}, {"rating": 4.0, "review": "I am using it for the last two months and I must say that its hardware specifications boosts the performance and its faster than all the tv boxes around. All the important features are related to Prime account. So If you have prim membership and also looking for tv box do not have second thoughts. Go for it. Games are good you can hook up any controller with usb adapter. I personally attached wireless keyboard mouse through the usb port and using it. Only con that i have faced till now is the absence of dedicated web browser for this lovely piece of hardware. Going through the spec sheet i was hoping that an unmatch browser experiece will be available. But to my surprise there was no supported internet browser available. And also the lack of youtube is also disappointing. I use dishworld app in my smart tv but that is missing here. Rest all looks good.", "verified": true, "helpfulness": "1/1", "author": "Vigneshwaran Vairavel"}, {"rating": 5.0, "review": "Saves you big dollars on the cable Bill.", "verified": true, "helpfulness": "0/0", "author": "Steve Craig"}, {"rating": 4.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Traci Johnson"}, {"rating": 5.0, "review": "best box so far im a techie am very suprised at the ease of use and you can root and add kodi mbox.Update after 2 months,Rooting and adding kodi took about 2 hours but It is still the best box so far. I also purchased the matricom 8 core and it is fast but it does run out of memory and need to be rebooted a lot and the ease of use isnt quite there with the matricom. So I got the fire box and I could have returned it many times but its just so useful. The amazon fire box is the way to go.Update 3 months, The Amazon fire box is definitely the way to go, it is harder to get kodi on it but after you do youll never look back, the only complaints I have is using additional remotes or keyboards are difficult to install. The amazon fire box is great for anyone techie or non techie. The simplicity and gui is superb. I can watch a lot of stuff on amazon prime but after adding kodi its the only box I need. With kodi and the add ons for genisis its much better than my tivo and thats after using tivo all my life. Having kodi is like having a dvr that has every show you could want or need, I can watch any show imaginable including movies that just hit the theatre. I have saved so much money. No monthly cable bill, no expensive movie tickets, I can watch my favorite tv shows the same day as a new episode comes on, esp the Walking Dead. This box was purchased as a backup for the matricom box but It took me a month or two to get the matricom box where I wanted it. Now the amazon fire box is all I will ever need.http://www.tweaking4all.com/home-theatre/xbmc/kodi-on-amazon-fire-tv/#step1-software-needed", "verified": true, "helpfulness": "2/2", "author": "j0vian \"thanks for reading...If you found this product review helpful, please give me credit where its due.\""}, {"rating": 5.0, "review": "Amazon Fire TV is awesome.", "verified": true, "helpfulness": "0/0", "author": "Patricia M."}, {"rating": 5.0, "review": "Works exactly as described!  I love the ability to search for Amazon Prime movies and shows, but to also be able to use Netflix from the same device.  I haven't used most of the apps you can get, but from what I can tell there are a good assortment of apps to choose from to be able to watch movies, listen to music, etc.  For me, it's a great device for the money you pay.", "verified": true, "helpfulness": "1/1", "author": "Smc6288"}]