[{"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Tina Febre'"}, {"rating": 5.0, "review": "I was nervous about getting it in the beginning as I did not think I could put it together and get it to work.  But it was very easy. The tech support has been very helpful.", "verified": true, "helpfulness": "0/0", "author": "Beverly Finn"}, {"rating": 5.0, "review": "Love it. Very good backup since there is nothing good to watch on television.", "verified": true, "helpfulness": "0/0", "author": "lynchurch"}, {"rating": 4.0, "review": "Good device, the voice search is a bit of a gimmick and the remote build quality seems to be on the poor side however the interface works really well. My main complaint so far is the constant need to have to input my pin to access certain applications already installed on the device. Yes i know i can modify it under parental controls but in order to activate purchase protection it requires that a pin be used for \" Non standard\" applications.Also the game thing is a waste of time without the $40 controller.", "verified": true, "helpfulness": "0/0", "author": "david m lawrence"}, {"rating": 5.0, "review": "Love it.  Does everything I was expecting.", "verified": true, "helpfulness": "0/0", "author": "Derek"}, {"rating": 5.0, "review": "Awesome -- voice recognition works 100%, watch list is awesome -- far better than Apple TV", "verified": true, "helpfulness": "0/0", "author": "W Page Greenwood"}, {"rating": 4.0, "review": "I love amazon fire! It's user friendly and offers lots of shows with amazon prime. I also watch my Netflix on there, rent movies, listen to pandora and go on YouTube.  The remote it poor quality though.", "verified": true, "helpfulness": "0/1", "author": "Ashleigh Smith"}, {"rating": 5.0, "review": "Unbelievably responsive and great picture. Have roku 3 which is great, but this seems to work on another level", "verified": true, "helpfulness": "0/0", "author": "Gian"}, {"rating": 2.0, "review": "When watching any content from Amazon the amount of data coming down the pipe is huge compared to Netflix. The first month I had the device I received a notice from my ISP that I had used over 360GB & my plan is 250. I saw the forum post blaming it on a screensaver so I disabled that but usage is still high. Please allow users to set the quality of the stream so we can stay within the limits of our plans.", "verified": true, "helpfulness": "1/1", "author": "Charles F. Pritchard"}, {"rating": 3.0, "review": "This device works great.  The voice search is very helpful.  The only complaint I have it that my data usage has become very high since I hooked this device up.  I would give it a five star rating except for this issue.", "verified": true, "helpfulness": "0/1", "author": "Tom Barnett"}]