[{"rating": 1.0, "review": "your advertising is misleading to say the least.  You indicate netflix, hulu, and a whole lot of other stuff, but not mention that there would be a charge.  I am going to start a campaign with my numerous contacts about your false advertising scam.", "verified": true, "helpfulness": "2/14", "author": "RD Cargill"}, {"rating": 1.0, "review": "This negative review does not speak to the user experience after installation. Skip this review if that's what you're looking for, but make sure you buy an HDMI cable if you go ahead with the purchase.I am highly disappointed Amazon doesn't include an HDMI cable in the box or prompt a customer to buy one upon purchase of the Fire TV. I do see the need listed in a detailed box after 3-4 scrolls down on the product description page now that I am looking for it, but come on. Why isn't it listed more prominently on the page or as an required accessory? Isn't it more important for customers to be able to use the product after purchase instead of using accessories section solely as an up-selling tool (ie, game controller)? Now, I have to go to Best Buy and pay 2x for an HDMI cable just to make this thing work. Thanks Amazon for wasting my time (1 hour) and money ($5 extra at Best Buy in-store) and taking away from my initial satisfaction. A blown opportunity.", "verified": true, "helpfulness": "4/12", "author": "Mark Seward"}, {"rating": 5.0, "review": "So easy to install. ..so much to choose from since cable and satellite are way too expensive.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Had it for 3 weeks,  worked ok the first 2 weeks.  now it freezes all the time, and now it will not un-freeze am returning it.  VERY disappointed that Amazon would sell such crap!", "verified": true, "helpfulness": "2/8", "author": "Andersons"}, {"rating": 5.0, "review": "Amazon has really set the bar high. Bought 2 fire sticks and then the fire tv. Running XBMC on these and with Prime and Netflix and we have replaced 2 HTPC units, a Apple TV that was jailbroken, and a Roku. I recommend you do some research with what all that can be done using these devices. There are also lot's of content that can be added from Amazon. These will also work to cast from Netflix and You Tube from a android device just like Chromecast will. Only thing I would like to see is better application management. From the browser (home screen) without having to access the app tool. That is my only complaint and it's minor. Oh another thing that is very cool is that you can say play music using Prime and also search for a movie. This will let you do 2 things at once.", "verified": true, "helpfulness": "2/2", "author": "mtlmn"}, {"rating": 5.0, "review": "Works much better than Roku from my usage so far.  Also, as it runs Android, there are tons of video-related apps for it.  The new Fire Stick works equally well and is much cheaper, but you don't get the awesome search-by-voice feature unless you use your phone as a remote.", "verified": true, "helpfulness": "0/0", "author": "The Great and Powerful GOZ"}, {"rating": 5.0, "review": "I thoroughly enjoy the unit, it is as advertised. When setting up I had a problem with connecting to Netflix so I went to help where they had a representative call me within 30 seconds, yes call me to help. As it turned out it was just an update that had to be downloaded which she walked me completely through. I think if I had waited it would have downloaded on its own. I actually bought two so when I set the second one up I went to help and completed the upgrade without having them call. This is so easy to use you can't go wrong.", "verified": true, "helpfulness": "1/1", "author": "D. \"D.\""}, {"rating": 5.0, "review": "I have a 4 y/o sharp Smart TV, works great except never would stay connected to the internet well for Netflix.  Got this Amazon Fire device so I could also take advantage of the Prime movies and it is AWESOME!  Connected to the TV and off you go.  Great picture, quality and all.  Highly recommend especially if you have Prime and want to watch those movies on your TV.  Small enough you can take with you to hotels and such as well.", "verified": true, "helpfulness": "0/0", "author": "DalTX04"}, {"rating": 5.0, "review": "Love it.  I feel the interface could use a little simplification, but other than that, it works wonderful.", "verified": true, "helpfulness": "0/0", "author": "Christopher Clark"}, {"rating": 5.0, "review": "SO easy to set-up & use!!! And the Amazon content is plentiful.Cable prices are skyrocketing in my area...just did the basement over & added a large TV & I'm not going to even bother hooking cable to it now...the Amazon content of TV & movies etc is WAY more than when I expected. Great Company & this is a great product!", "verified": true, "helpfulness": "0/0", "author": "JOHN G DE VITA"}]