[{"rating": 1.0, "review": "The Amazon Fire TV is disappointing. There are several apps which I had loaded on my Roku 3 which are not available on Kindle Fire TV. Vudu is a key app as this is where the bulk of my video collection is They do offer a workaround with Flixster, but it has limited functionality. Amazon apparently moved to the Android platform, but you cannot download Android apps to the system unless they are in the Amazon store for the Fire TV. This seems like a waste if you cannot use Android apps. Many conversations on the Internet indicate they are trying for the Apple experience and limit choices to ensure \"quality\". I am not sure how a downgrade from an earlier system is considered a quality customer experience. Quite frankly, if I wanted the Apple experience, I would have purchased Apple TV. You could potentially work around these limitations with the USB port,but they have decided that should no longer be available for use by customers, only developers. I had high expectations for this system, but was very disappointed in the end result. It has limited functionality, clunky navigation, and features that are unusable by customers.", "verified": true, "helpfulness": "2/4", "author": "Michelle Halsey"}, {"rating": 5.0, "review": "We will never, ever, ever be paying for cable again.", "verified": true, "helpfulness": "0/0", "author": "Justin S."}, {"rating": 5.0, "review": "Worked great right out of the box. Software updated easily enough. Netflix worked great as well. Voice commands with remote worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "RKbeantown"}, {"rating": 5.0, "review": "So far it's great! Very easy to navigate with voice commands.", "verified": true, "helpfulness": "0/0", "author": "mitchell a ruiz"}, {"rating": 5.0, "review": "I really like this it works for my Husband and myself and with Amazon Prime we have a lot of movies to choose from.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Daniel"}, {"rating": 5.0, "review": "Requires an HDMI cable.  With that, it hooks up easily and works intuitively.  Amazing amount of material available.", "verified": true, "helpfulness": "0/0", "author": "Andy Reese"}, {"rating": 5.0, "review": "I have both Roku 3 and now a Fire TV. I love them both and am not going to go into a lot of detail because of the amount of great reviews already on Amazon, but here are a few quick points.Fire TV.-Faster response-Voice search is nice-like the remote more than the Roku'sRoku- I personally feel the Roku has a better, more simple interface.- Not as fast as the Fire TV but still fast and responsive-No voice search-Bigger collection of apps and channels available however most of the are garbage IMO.Overall both are great choices, but for me I prefer the Fire TV. That said I think the Roku has a more simple interface and is more user friends in that regard. Because of this I gave my Roku 3 to my mother in law and she lives it because its easy to use even for a 60 year or technology inept mother in law. Really you can't go wrong with either though.", "verified": true, "helpfulness": "0/0", "author": "Israel Arguello"}, {"rating": 5.0, "review": "I love fire TV. I gifted it twice this Christmas. I gave one to my Daughter and another to my son in Indiana.", "verified": true, "helpfulness": "0/0", "author": "Steven Stempien"}, {"rating": 5.0, "review": "Works great-works just as I expected", "verified": true, "helpfulness": "0/0", "author": "Jerome W. Horan"}, {"rating": 5.0, "review": "This was a terrific purchase, it is mainly for my husband because he cannot go out on his own. This gives him access to enough entertainment to keep him happy. Thank you so very much.I would recommend this t everyone that likes movies and other programming.", "verified": true, "helpfulness": "0/0", "author": "DEANNA TEETER"}]