[{"rating": 5.0, "review": "quick, easy and lots of content.  the voice search is cool.  I did a voice search on \"Laurel & Hardy\" and came up with gems I never heard of before.  Well worth the cost and better than apple TV because of content.", "verified": true, "helpfulness": "0/0", "author": "M. Stevens"}, {"rating": 1.0, "review": "Update this thing is piece of crap don't waste your money freezes also 2 remotes later screen still frozen my 30.00 Roku stick works way better !", "verified": true, "helpfulness": "0/0", "author": "Rose"}, {"rating": 4.0, "review": "[Edited after a few days of reflection]Really wanted to give this product five stars, as there's a lot to like.  Great specs, terrific voice recognition, and excellent integration with the Amazon ecosystem, obviously.  I'm really enjoying exploring the capabilities of the system, and with the arrival of my game controller, more fun is on the horizon.The one area where I'm really disappointed, and the reason for my initial, infuriated review, was my shock at finding that for some bizarre reason the Watch ESPN app for Fire TV is not the same as the version for the Kindle HDX or the Apple TV (or Roku, for that matter).  The Fire TV app is an old version that doesn't support all the ESPN channels - most problematically for a huge college FB fan like me, no SEC Network or SEC Network +.  How can this be?  It's absolutely ridiculous to have this ancient app version as the only option for Fire TV, while the newer version is already available for Amazon's tablet offerings.  I guess I'll be using the Apple TV to watch football this fall, at least until Fire TV comes to its senses and updates this app.  Annoying, as I'd put the Apple TV away for good, otherwise.  Still, the Fire TV is overall a great product, and as Amazon makes its app universe more robust, an excellent set top option.", "verified": true, "helpfulness": "0/3", "author": "Wilkun"}, {"rating": 5.0, "review": "We almost don't even watch regular TV because of this thing", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 3.0, "review": "Right now I'm only giving Amazon Fire TV 3 starts. It has the potential to be great. I have a prime account; $99 per year. Thought that Fire TV would be great to have with this. Well I finally hooked it up and to my dismay almost all the games I liked were not compatible with Fire TV. The movie collection is nowhere near as good as Netflix and there are no good recent release movies to choose from. Everything that is good has to be purchased. It's like all you get are leftovers you wouldn't watch for anything. What's up Amazon not getting enough money out of us? $99 for Amazon Prime + $99 For Fire TV + $40 for a controller. I would think I would get better for my money.", "verified": true, "helpfulness": "1/4", "author": "Ron Prusa"}, {"rating": 1.0, "review": "Very dissapointed. I got this thinking I was replacing older technology in my 3 year old Roku and figured with all the specs it had to be better. In this case newer wasnt better.  I really gave this a chance and used it for a month but ended up sending it back and hooking the trusty old Roku up. Going back to the Roku after using the Fire for a month felt like a huge upgrade. I think I will stick with Roku!There are still some huge bugs to workout with the Fire TV and they may have released it too early.Cons:It constantly had a problem streaming in high def with Netflix and Amazon and would play the videos in horrible quality.Amazon content layout is bad and no way to browse prime only content like you can with other players.Unit froze up a few times and had to be unplugged.Pros:Voice search. Thats about the only thing that I liked about this unit.", "verified": true, "helpfulness": "4/8", "author": "Heather L Drawdy"}, {"rating": 3.0, "review": "Read the other reviews. This does NOT replace Roku. I'd forgotten that. Was interested another time and decided not to purchase because reviewer said this. Did not read reviews this time and bought and am not delighted with it.  If you or a child like to play lots of games then this would be more stars. I gave to grandson because that is what he is interested in. You better set up a parental control or you will find unauthorized charges on it next thing you know. Read review on Amazon coins. Misleading, misrepresented Am coins. If not for my grandson, I would have returned the Am Fire TV. Bought the game controller to go with it and that makes playing the games very nice. Other than games you can watch Netflix, Hulu, YouTube, HBO and blah blah blah, same as on Roku. If I had it to do over again I would not buy this item.", "verified": true, "helpfulness": "2/5", "author": "Darlah F."}, {"rating": 2.0, "review": "The Amazon content works great, but Netflix and Hulu are continually having problems loading. I'm going to have to go back to my Roku; very disappointed in the FireTV.", "verified": true, "helpfulness": "2/2", "author": "Christel \"Chris\""}, {"rating": 5.0, "review": "Just bought this today and I am absolutely blown away by this thing. First off anyone complaining about limited apps, games, etc is a complete moron. These are the same people that will go out and buy an Apple TV and RAVE about how awesome it is lol. This device has almost unlimited potential compared to any other media player device. You can practically sideload any Google Play app on this thing (XBMC, MOBDRO, etc). The fact that you can get an XBMC media player device for $100 is worth it in itself. The device is blazing fast and I had XBMC working within 20 minutes of opening the box. It also outputs 5.1 and 7.1 sound Dolby Digital Plus. This is a great device for beginners, intermediate, and expert level people as far usability goes. I say this because if you like simplicity this device provides it( Simple remote controls, Voice Search, easy navigation). If you want to explore a little bit and unlock the true potential of this tiny box you have that option also (XBMC, Rooting, Sideloading). The voice search feature was a great idea. I tested it using various voice commands and the accuracy on this thing surprised me. The only negative thing I have to say about it is that it only works for certain apps. It does not work system wide. Maybe this will change in future updates. As of right now I'm a firm supporter in this media player device but that could change since I've only had this for one day. Usually problems arise months after use so we will see. I will try to update my review after several months of use if anything comes up.", "verified": true, "helpfulness": "1/1", "author": "Mastachintu"}, {"rating": 3.0, "review": "Very user friendly, not as many free movies or tv shows as netflix.  It is confusing on what is free even on prime.", "verified": true, "helpfulness": "1/1", "author": "DAVID PIFER"}]