[{"rating": 1.0, "review": "Amazon Fire TV is a restricted device that makes users pay for apps that on any other Android platform or device are normally free. Go with a Roku and get MyMedia Free, Chrome and get Plex Free, stream anything you want. Amazon charges. Furthermore, apps you buy for other Android devices don't transfer to Fire like they do other Android phones and tablets. You will have to re-purchase all your software. Search also doesn't search subscription sites, only Amazons pay as you play movies and content.", "verified": true, "helpfulness": "2/3", "author": "Socrates Foot"}, {"rating": 1.0, "review": "i bought this in Nov. 2014. my thoughts were that amazon would only put out a quality product. i was very disappointed. the on screen format is difficult figure out (it is not set up like Roku). then when you play a movie the screen will go black and you only hear sound or nothing works. so you go back to home screen and try again. sometimes it works. but more than likely i turn on my Roku 3 it hasn't failed me yet. BUY AMAZON FIRE AT YOUR OWN RISK.", "verified": true, "helpfulness": "2/4", "author": "win707"}, {"rating": 5.0, "review": "Runs very quickly and was easy to set up.", "verified": true, "helpfulness": "0/0", "author": "JJ Larson"}, {"rating": 4.0, "review": "The Amazon fire hd is great!  It has a great selection of movies and tv shows.", "verified": true, "helpfulness": "0/0", "author": "Anthony Lokken"}, {"rating": 5.0, "review": "Lives up to the hype. Only thing I would suggest is that the remote be able to control volume", "verified": true, "helpfulness": "0/0", "author": "Gary McLaughlin"}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "diaa hussein"}, {"rating": 5.0, "review": "Exactly what I expected.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Amazon Fire!", "verified": true, "helpfulness": "0/0", "author": "Ari"}, {"rating": 5.0, "review": "Love this thing. Especially love it's android based. Way better than my old roku", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am pleased with the reception and app choices. Only problem I am having is I signed up for HBO Now but the Fire TV device does not recognize my Amazon account so will not complete the subscription.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Richmond"}]