[{"rating": 5.0, "review": "Good programs", "verified": true, "helpfulness": "0/0", "author": "research guy"}, {"rating": 1.0, "review": "We've been using the Amazon Fire TV for a few months now, and while it started out great, for the last month it has become unusable. About 90% of the shows we try to watch have an unbearable high pitched screech. It's not a constant screech, it's only when people are talking.I have written to Amazon about this problem when it occurs and they have always refunded the cost of the movie.  But it's gotten to the point where it's not worth even attempting to watch something as the odds are very high that it will be unwatchable, or more accurately, unlistenable.This occurs whether we listen to the audio from our sound system or just through the TV itself.  It occurs for new movies, old movies, and Amazon produced shows. This problem has never occured from our cable, Netflix, DVD or PC hooked up to our TV. It is strictly an Amazon problem.By googling the problem I have seen that other people have also reported it, but I have yet to see a response from Amazon. We have pretty much decided to take Amazon Instant Video off of our list of media sources.I would ask for a refund on this device, but I haven't given up hope, yet, that they will fix it. It would be nice if they would acknowledge the problem and notify people when they have a fix.", "verified": true, "helpfulness": "5/8", "author": "Steven Kilner"}, {"rating": 4.0, "review": "Easy to use containing a lot of different choices.  I was disappointed that Dish Network did not offer any choices for viewing as all of the other major broadcasters did such as Direct TV, Cox, AT&T;, etc.  I would recommend getting the total mount system as this makes installation very easy.  It's just hard to go wrong with Amazon.com", "verified": true, "helpfulness": "0/1", "author": "ALLEN \"Retired former trial and corporate lawyer practicing his craft for over 40 years. Loves legal thrillers, mysteries, and dog related stories.\""}, {"rating": 2.0, "review": "This thing is a $100 waste of space. All services that are not amazon based are streamed with extremely poor video performance. I switched from an XBOX 360 to avoid paying for the live service, since I only use it for Netflix and other streaming services. I will gladly pay for that service again if this is the quality I receive from such an obviously inferior product.", "verified": true, "helpfulness": "0/4", "author": "Edward McConnell"}, {"rating": 4.0, "review": "Works great. Held back one star because I thought prime video would include more TV series and more current movies.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like the Amazon tv...No complaints by me...I'm all smiles", "verified": true, "helpfulness": "0/0", "author": "Icky Rodriguez"}, {"rating": 1.0, "review": "can't get it to work. undoubtedly because of crappy internet service provided by centurylink", "verified": true, "helpfulness": "0/7", "author": "eflynn \"eflyn\""}, {"rating": 1.0, "review": "all the free movies are old or just bad", "verified": true, "helpfulness": "0/4", "author": "billr"}, {"rating": 5.0, "review": "thanks", "verified": true, "helpfulness": "0/0", "author": "charles roark"}, {"rating": 5.0, "review": "Love it! Easy to operate for this low tech person, and so much cheaper than cable!", "verified": true, "helpfulness": "0/0", "author": "Kathleen Kennedy"}]