[{"rating": 1.0, "review": "Update 9/16/14!Update!I returned it today , the voice search only works for Amazon content , the FireOS is too locked down and I can't use my apps from Google play store , getting it to work with local content like DVD's i own and backed up to HD is too much of a pain. If they had released it with Android 4.4 unlocked i would have kept it.!Update!I have owned many of the streaming boxes and all have their faults and weakness . I give the Amazon Fire TV 3 stars for now , it would be 5 stars if they would allow apps that work on other android devices like ES file explorer and offer DNLA support and local media streaming options, its just too locked down for me . PLEX isn't that great for this IMHO . I wasn't able to use the USB port to play movies of a USB stick either right out of the box.I had to modify some settings and I was able to side load ES file explorer app though after a little googling and I was able to see my synology NAS using the es file explorer app LAN option once installed on the fire TV so I could play my local media as well as all the media Amazon offers online that works out of the box. XBMC app also worked once side loaded to stream my local content .", "verified": true, "helpfulness": "6/6", "author": "Tekpc007"}, {"rating": 5.0, "review": "I just got this setup which took about 5 minutes and was very easy. Watching my first prime movie and this thing is so sweet! I will report back if i find any issues. Way to go Amazon Fire!", "verified": true, "helpfulness": "1/1", "author": "David O."}, {"rating": 3.0, "review": "I find it works pretty good, fairly easy to operate. I have the same complaints as others about the fast forwarding and the have to sort thru pay and free  stuff. I also have a problem watching hula plus and Netflix, with hula cant seem to get most thing loaded and when they do it buffers a lot. Netflex is better and I don't have this problem with Amazon content at all. Don't know if this is common or not. My internet speed is good so I would think if there was a problem all would affected.", "verified": true, "helpfulness": "3/3", "author": "carl wilson"}, {"rating": 5.0, "review": "Great product.  I use it constantly to watch what I want.  Works well with Direct TV and gives me a lot of choices.Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Jim Wade \"Shutterbug\""}, {"rating": 5.0, "review": "Great product,fast shipping,I love how fast it is and great picture quality,lots of free movies with prime.xbmc runs great on it.", "verified": true, "helpfulness": "0/0", "author": "del"}, {"rating": 5.0, "review": "ok so this device kicks... well you know what i mean but thats not the point, this device i picked up and it is way fast i mean glad i got rid of my apple tv for this its faster than my apple tv, better then a roku, and better streaming then chromecast, amazon you have a winner.", "verified": false, "helpfulness": "0/0", "author": "Aaron Cross"}, {"rating": 2.0, "review": "I would be more than glad to buy the Amazon Fire if you were to add to it a one year free subscription to Amazon prime. I also have family and friends that would buy it with this deal.", "verified": false, "helpfulness": "3/10", "author": "Barbara J Dunbar"}, {"rating": 3.0, "review": "Faster than my Apple TV and Roku 3, but missing what I see as key features and apps.  Voice feature is fast and accurate, but only searches amazon content.  Roku's search feature did not have voice function, but searches across nearly every major app on the device.No PBS app, which is something even Apple offers.  Of course, you have the option to pay per episode on Amazon's store.If content is your primary consideration, go with Roku.", "verified": true, "helpfulness": "1/1", "author": "Seth R Brown"}, {"rating": 1.0, "review": "Not as great as advertised. Only thing it's really good for is games. Logitech revue still a far better choice.", "verified": true, "helpfulness": "3/10", "author": "mynameis"}, {"rating": 5.0, "review": "So far i love it.It streams very good, have only watched a few things and picture was good.Best of all there was no buffering.", "verified": true, "helpfulness": "0/0", "author": "Michael K. Schrader"}]