[{"rating": 2.0, "review": "Reading the description and specs for the Amazon Fire TV I think my Roku II that I recently purchased for $79 has a better feature. While the Amazon Five TV has a faster processor and more memory the overall speed will still be dependent on the internet download speed and the quality of the wireless router. I traded up to the new Roku II because when I used headphones there was no volume control with the old Roku. With the new Roku II and Roku III you can plug headphones into the remote and it has a volume control. Since I like to use headphones, especially if I am on my exercise bike, that feature alone makes the Roku a better choice. Amazon needs to consider that with their next model. Speaking of which my Kindle Fire has become quickly outdated as the new models have rapidly come to market. Will that be the same for Amazon Fire TV?", "verified": false, "helpfulness": "17/174", "author": "Curtis L. Crotts"}, {"rating": 2.0, "review": "I have a media library on one of my computers at home which I stream via a DLNA server (Serviio) to a TV (WD TV Live) and tablet.  There is no mention of DLNA anywhere on the Fire TV page so it seems safe to say this doesn't support it.  Too bad as the hardware specs look really good and my WD Live can be a bit slow and flaky at times.", "verified": false, "helpfulness": "34/206", "author": "Amazon Customer"}, {"rating": 3.0, "review": "can you play xbox 360 on this tv? please answer asap it would really be helpful thanks so mucg everyone", "verified": false, "helpfulness": "2/164", "author": "Jolal"}, {"rating": 3.0, "review": "4/24  The are improving search beyond their content which is great.  Thank you Amazon, keep going and this may make it to 5 stars.4/8  Factory reset resolved the audio problem.4/8 IMPORTANT!!! ------Audio out is pretty worthless. I just hooked the system to my 7.1 system and It has huge problems putting out consistent audio that works.  Though enabled I have no sound from menus and games but I can hear audio in the movies, though it is out of sync playing back AMAZON CONTENT!!!!------Read below but I am now rating the FireTV 1 star because of Amazon customer service.  If you have a problem they don't care.  They buried this review for example. Looking at what has happened thus far in the last few years they get you to like something and then start raising the prices AKA Amazon Prime. I don't want to be drug into a other content specific device.  I threw away the packaging so I will toss it in the drawer sooner rather then later.  Good job Amazon!!!I have posted a quick video on YouTube; search \"Amazon Fire TV quick unedited review\" through Google Glass.One thing that evens the playing field is the fact FireTV supports Plex.  For those of you with your own media Plex was the answer I had been looking for. Put the server on decent computer and it will stream 1080P with surround sound.  It transcodes any format your device can't play by real-time transcoding.  Plex supports server and client apps on a huge amount of devices.  That not enough; it also adds video covers and meta data about the show. $80 for full Plex features and $5 for clients is cheap for what it does, but most users will just need to buy the $5 client.  Play-on is another option to get HBO but it is very clunky. HBO on Demand is available from most major providers as a part of the package so not much of an issue, but definitely a detractor.Roku supports HBOtoGo but for example not if you get HBO through DirecTV. The only device I am willing to buy that DirecTV and HBO support is my previous Samsung TV.I own AppleTV 1-3, Roku 1-3, WDTV, Windows Media Center, XBMC, MythTV, Rasberry-Pi, a couple of Android streamers, XBOX, XBOX360, XBOX1,  PS3 & 4, Ipads, Andoid tablets, Chromecast, and Synology 1513+ server.  Roku 3 is the device to beat, and the lack of an audio remote on FireTV is a real concern because I use it all the time when the wife is sleeping.Gaming:  Get the developers to allow any game you already own that is android compatible to be freely used on the FireTV and you have a real game charger.  I refuse to buy another version of the same games I already own on other devices.IN-HAND Comments:  Setup is close to the same as any other device in length and the type of account info you are asked for.  Be sure you have your Prime 5 digit pass code, it asks for it at least a half dozen time between setup and watching a few movies. Device blends in with the black TV stand which is also black and it is close to the foot print of AppleTV and Roku.  Parental control is pretty basic but at least it is something.  Faster menu then any other device I have owned, but load times and feel for Netflix felt no different. No personal content can be played with the exception of what you own on Amazon, and picture you load to Amazon Cloud; very disappointing!  Plex which is the best program to watch personal media was free and loaded the video covers much faster then any other device. I loaded a couple of games like Riptide and have to say that the video was very good for a small device; at least PS2 quality bordering on PS3.  Voice search is amazing in its ability to hear.  I held it in my lap and talked in a normal voice and it responded.  The game controller was easy to setup through the settings menu and feels close to a XBOX controller.Voice search and gaming set the box apart from the competition and it does both well.  Better voice search  then the XBOX One.  Once nice thing is that I asked for war movies and found the selection interesting to find something to watch.This isn't a Roku killer unless those two things are important to you.  Amazon's entry in the market is starting off very well but they can do more to improve the device through firmware and I hope they take this seriously.  Adding audio to the remote and a way to control the TV is my only real complaint about hardware function; lets hope these functions make it into generation 2.  In application voice searches needs implemented.", "verified": true, "helpfulness": "290/412", "author": "Tim"}, {"rating": 5.0, "review": "I have one simple word for all of you. PLEX!Why do any of you pay for subscription services when you can just use plex? This device murders all the rest in terms of speed, memory amine other things. I guess if you like throwing you money away on subscription services go ahead but plex is a free all in one solution. Go here and educate yourself: plex.tv", "verified": true, "helpfulness": "15/109", "author": "James Wahlman"}, {"rating": 5.0, "review": "I've had Fire TV a few days and I'm glad I bought it.Prime movies play better and sharper than my previous box (an older Google TV) and I'm very pleased overall.No problems so far.  I've ordered the game controller (I'm not a gamer at all so its a good way to tiptoe in to that).The best feature its its near instant play on the next episode of a series.The worst feature is offering me stupid things I could not possibly want - for example a $2.99 daily rental choice or play for free on prime.  Why would I possibly want the former?  Somebody should explain to the programmers that nonsensical choices should be left off.But this box is overall, really great.", "verified": true, "helpfulness": "20/95", "author": "Tampa Buyer"}, {"rating": 2.0, "review": "Not much mention of the ability to watch your personal videos direct over your local network - like Apple TV does via iTunes or XBMC (patched, older generations) - or like WDTV Live Streaming does directly to network shared folders.Yes it does Plex, but if you're ever tried Plex - it's quite messy (similar to XBMC).  The Fire TV box doesn't seem to be able to play direct from network folders, but relies on other media server software.", "verified": false, "helpfulness": "13/173", "author": "Karyn O"}, {"rating": 1.0, "review": "How can this even be a competitor to Roku 3 without HBO Go support? Save your money, at least until Amazon fixes the no HBO Go glitch.", "verified": false, "helpfulness": "32/393", "author": "Jared Jeffers \"PC Master Race\""}, {"rating": 3.0, "review": "I was actually really impressed with the price. I owe Amazon some brand loyalty here because I love my kindle.However, I live in Australia with an average Internet speed of 200kbps. We don't have netflix here, can you give me some reasons why I should buy this?", "verified": false, "helpfulness": "6/125", "author": "Christopher"}, {"rating": 2.0, "review": "On reviewing the Amazon Fire TV specs I'm not seeing how it is even as good as Roku 3 or even Roku 2.  I'm not a gamer but those I know have systems devoted to gaming first but games are no use to me anyway.  I'd miss a lot of Roku channels not available and Prime is just a rip off as far as streaming videos are concerned.  All the movies/shows on Amazon free with Prime are available on Netflix and every one I watch from Amazon I'd still have to pay the same price for with or without Prime.  Roku is actually cheaper than sited in the spec comparison, I got my Roku 3 new for $79 and you can get a Roku 2 much cheaper than that.  And as for the voice control, who cares?", "verified": false, "helpfulness": "16/179", "author": "JFG"}]