[{"rating": 5.0, "review": "I love it awesomeEasy to operate", "verified": true, "helpfulness": "0/0", "author": "Charles Berzack"}, {"rating": 5.0, "review": "Love my  Amazon fire Tv... so many different shows and movies to watch.. would recommend this to other shoppers..", "verified": true, "helpfulness": "0/0", "author": "cherie"}, {"rating": 5.0, "review": "Just buy it! Great alternative to cable, watch on demand movies in HD for 5 bucks! Sometimes you will get a couple minutes of non-HD, but it doesn't last. Couldn't be happier...", "verified": true, "helpfulness": "0/0", "author": "K. Curtiss \"Gigantes!\""}, {"rating": 5.0, "review": "I absolutely love my Amazon Fire TV. I don't have a smart tv and didn't want to purchase a new tv since the one I have is still fairly new. Amazon fire TV box solved my problem. Its definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Brittany"}, {"rating": 5.0, "review": "I absolutely love this!  I was hesitant about purchasing the Fire TV coming from a Roku 2 due to the negative reviews about the remote.  I will state that I have changed the batteries in the remote on average every week to four days depending on usage.  The ONLY negative part of the Fire TV is the battery drain of the remote.  If Amazon could come up with a better remote design that does not drain the batteries and send it to all of us who purchased the Fire TV then that would make it even better.  The smooth operation and the voice control is amazing.  The quality and clarity of the playback is amazing.  When the Fire TV goes to sleep I love that is has a screensaver mode and it is calm and soothing to wake up to in the morning after having fallen asleep with the Fire TV on.  I did purchase a couple of game apps for my 10 yo daughter, one of which requires the NOT INCLUDED game controller (addtl. $40).  I have not purchased the additional controller as of yet, but I am getting ready to look at the reviews for it.  Purchase the Fire TV, you will not be sorry!  Just stock up on batteries for the remote!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We have three Amazon Fire devices and love them. We ditched cable and switched to this platform for entertainment. The device itself is so simple to connect and set up. It's also small and sleek and not as clunky as cable boxes. It works seamlessly with various apps. One thing to note is that the voice search does not search through all apps to find what you're looking for. It's limited to Amazon Prime selections and HuluPlus, but it's still a useful feature, and my 6yo loves being able to search for programs without punching in letters since he's a beginning speller. There are also good parental controls on the device to filter programming as necessary or to block kiddos from making in-app purchases. We took a chance giving up cable, but we've never regretted it.", "verified": true, "helpfulness": "0/0", "author": "K. Prejean"}, {"rating": 5.0, "review": "Love just wish u could pay 1 price for all apps like Netflix Hulu etc", "verified": true, "helpfulness": "0/0", "author": "james criss"}, {"rating": 5.0, "review": "Easy to set up and use! Love that my photos and videos are accessible. Finding shows and movies is simple. The whole process is very intuitive. Thanks Amazon for another great device!", "verified": true, "helpfulness": "0/0", "author": "bravefan23"}, {"rating": 5.0, "review": "Great purchase!", "verified": true, "helpfulness": "0/0", "author": "Vernon Vaandrager"}, {"rating": 5.0, "review": "Great system with everything Amazon has to offer.  I have a kindle fire hd7 and had trouble with it not being able to stream movies to my tv.  After purchasing an hdmi wireless adapter and downloading extra software and much frustration from trying to make it work, I got a fire hd tv and instantly fell in love.  This system allows you full benefit of near everything my tablet offered except portability.  This system is used daily in my home.  Great product.  Requires prime membership for full use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]