[{"rating": 2.0, "review": "Love the Amazon Fire TV but after about two months it stopped working and I have not been able to get ahold of anyone to see how we fix it.  Lacking support from Amazon on this one!", "verified": true, "helpfulness": "0/1", "author": "Ronald W Weimer"}, {"rating": 5.0, "review": "Excellent product and design, works perfectly- needs an off button or process", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "very responsive1080p..no problemif it only had a web browser...and access to google play and my google account..:(", "verified": true, "helpfulness": "0/0", "author": "Parrish T."}, {"rating": 5.0, "review": "Excellent...", "verified": true, "helpfulness": "0/0", "author": "Rylan Vindas"}, {"rating": 5.0, "review": "Voice search is terrific.  Easy to install and use.", "verified": true, "helpfulness": "1/1", "author": "kdh"}, {"rating": 5.0, "review": "The only thing that's missing is screen casting.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Could be a little more user friendly. My system keeps shutting down...", "verified": true, "helpfulness": "0/0", "author": "Alisha"}, {"rating": 4.0, "review": "I've had the Fire TV  for a little over a month now and I have little to no complaints. The one thing Fire TV could use is more useful apps and games. The game selection is big but most games seem extremely underwhelming. Quantity over quality so far but it is also early days.", "verified": true, "helpfulness": "0/0", "author": "BG"}, {"rating": 5.0, "review": "Absolutely soooo easy to install.  Is also very user friendly.  Love it!!!", "verified": true, "helpfulness": "0/0", "author": "CAROL"}, {"rating": 5.0, "review": "I give it 5 stars because I love the product. It came today and setup was rather easy.. What I am upset about is the fact that I purchased this the day before yesterday, log on to Amazon today and the price has dropped to $84 from $99 in less than 48 hours.. Thanks a lot,  Amazon!  :(  From a loyal customer for years.... :(  :(", "verified": true, "helpfulness": "0/2", "author": "alwaysonamazon"}]