[{"rating": 5.0, "review": "LOVE LOVE LOVE fire TV, kicks Apples butt!", "verified": true, "helpfulness": "0/0", "author": "Lori Smith"}, {"rating": 5.0, "review": "Did a bunch of research before buying this little gem and i am pleased to say it does what i want and thats just about everything.  It has netflix and prime which is nice but i also have 150 tv shows and 750 bluray movies in my collection which i have digitized onto several harddrives. This box wont stream those unless you tweak and side-load some apps which i did and it works beautifully.  An easy app to do this with is 'apps to firetv' on google play. This app makes side loading a breeze. I went with kodi (xbmc) with the eminence skin and loaded a bunch of addons that get me anything my heart desires. Even launches netflix from within kodi, still working on prime. Takes some work to get it where it needs to be but i enjoy a good project like this.", "verified": true, "helpfulness": "2/2", "author": "Doc"}, {"rating": 5.0, "review": "Easy set-up, beautiful packaging, ergonomic remote, intuitive menus, and flawless operation for a week.  My only gripe is that the introduction video is too long and it forces you to watch it, if you absolutely made me list a con.", "verified": true, "helpfulness": "0/0", "author": "Ops Guy"}, {"rating": 4.0, "review": "My kids like it.I think Netfix and Prime are all they watch on T.V...... when they're not Tweeting on they're iPhones.", "verified": true, "helpfulness": "1/1", "author": "Disc writter \"paperbender\""}, {"rating": 5.0, "review": "Super fast! I debated on which streaming player to get and I decided to go with the Amazon! I am very happy with my choice! it is really fast and streams sling and other video services really well!", "verified": true, "helpfulness": "0/0", "author": "Matthew Brown"}, {"rating": 4.0, "review": "much better than the Sony Blueray players that I replaced it with.  It shows all internet programs with a minimum of buffering.", "verified": true, "helpfulness": "1/1", "author": "Wylie Miller"}, {"rating": 5.0, "review": "Works great until it died Amazon quickly replaced so I'm happy", "verified": true, "helpfulness": "1/1", "author": "Kirk Ericksen"}, {"rating": 5.0, "review": "Amazon just put $150 back into my pocket every month now that I've canceled satellite", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Get it unlocked? Better than cable", "verified": true, "helpfulness": "0/0", "author": "charles smith"}, {"rating": 5.0, "review": "Very useful, access all my pay movie channel. s with this, very quick", "verified": true, "helpfulness": "0/0", "author": "David Moen \"dmo\""}]