[{"rating": 5.0, "review": "Would recommend this to anyone.  Beautiful display and very easy to use.", "verified": true, "helpfulness": "1/2", "author": "JThomas"}, {"rating": 3.0, "review": "I'm still trying to figure out how it all works. I read previous reviews where everyone seems to be happy with it, however they are all using Prime. I was under the impression I could watch some stuff without signing up for Prime, but so far I have not been able to get Nexflix going, the free shows are laughable and there is a fee to watch shows that are broadcasted daily on regular TV. I'm still deciding whether or not I will return this product. Feel free to share your thoughts or something I may be missing about this magic box, because right now I just don't get what all the hype is about.", "verified": true, "helpfulness": "1/5", "author": "Marley"}, {"rating": 5.0, "review": "I always wanted something like this. Thanks a lot.", "verified": true, "helpfulness": "1/2", "author": "loren montgomery"}, {"rating": 3.0, "review": "Exactly the same at the $39 stick. I bought the $39 Fire Stick at a brick and mortar store and it works well.  I wanted to get another one so we did not have to carry around the stick, and saw this product, which is twice as expensive, and wondered if there is any difference between them. There isn't. According to \"Shivam\" an Amazon \"retail specialist\" (who is so special he had to check with someone else before answering my question about the differences between the two) said other than \"portability\" there is absolutely no difference between Fire TV and Fire Stick except for the price of course. SO I would say buying a $39 stick is better than buying a $79 box since they do exactly the same thing. I guess that is why the stick is sold out until January on the site and the TV is still available.", "verified": false, "helpfulness": "4/9", "author": "karen in milford"}, {"rating": 1.0, "review": "Great for Amazon Prime content but horrible for everything else. Voice function worked well but only searches Amazon content which is frustrating. Dissapointing that they lowered the price after I bought it.", "verified": true, "helpfulness": "1/8", "author": "Jonathan Ballard"}, {"rating": 3.0, "review": "Great concept but doesn't work all the time.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fun and easy to use", "verified": true, "helpfulness": "2/3", "author": "Lori K"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV and I couldn't be happier. A friend of mine had instructed me to purchase the Apple TV because that is what he had. I decided to research all options and I'm glad that I did. When you look at the product comparisons it's clear to see which product is the frontrunner in regards to technology and on demand content, it's Amazon. The integrated voice search was a bonus feature that works like a charm. I would recommend the Amazon Fire TV to  anyone looking to break away from cable.", "verified": true, "helpfulness": "1/1", "author": "Michael J. Craveiro \"Mike\""}, {"rating": 5.0, "review": "A", "verified": true, "helpfulness": "0/1", "author": "barbara lawson"}, {"rating": 5.0, "review": "Works amazingly!  1st one was defective but Amazon made it right within 2 days.  Was already a prime member and this has made it an even better deal!  This has put my smart tv to shame.....can't praise it enough", "verified": true, "helpfulness": "1/1", "author": "Gary Martin"}]