[{"rating": 3.0, "review": "I REALLY wanted to like this player. I've been waiting for a streaming box to rule them all.... I'm still waiting. If you only use Amazon for your streaming needs, this box is for you. If you use Plex, Netflix, Hulu and others, you may want to keep looking. The Amazon stuff works amazing, everything else is still a little sketchy. I returned it.I've owned two AppleTVs, 2 WDTVs, and a few other streamers... still waiting on the one to rule them all.", "verified": true, "helpfulness": "1/2", "author": "Justin Anderson"}, {"rating": 5.0, "review": "I love this much better than I thought so easy to use and fast loading! Small takes up no space.", "verified": true, "helpfulness": "0/0", "author": "spirithing \"eak\""}, {"rating": 5.0, "review": "Absolutely love having this!! I am able to watch my netflix and hulu without using my Wii which is on the other side of the house and I can watch my amazon prime movies. Its easy to use, easy to set up, and worth every penny", "verified": true, "helpfulness": "0/0", "author": "C. Munoz"}, {"rating": 1.0, "review": "I have this box sitting right next to my Roku unit and it requires so much more bandwidth it's impossible to use.  I can only get Verizon high speed Internet at 15MB down and that's not enough.  Considering this is an Amazon product - going to Amazon sites, since I have prime times out and finally calls-up stations that my Roku does in seconds.  Then it continues to time-out as I'm watching with bandwidth warnings along the way.  I don't know what CODEC's they used, but they are awful.As far as the voice activated - the commercial was a good representation in that you have to yell at the box for it to hear and understand you.  Then it returns stupid results of things like - Star Trek Star-Trek Star Trak, whatever that is.  So, I find it faster in the long run using my Roku that trying to get it to hear me, picking from redundant lists of the same names and then waiting for the spinning globe to finish going around before anything comes up.I guess it's a great idea very poorly implemented and doesn't do as advertised for sure!", "verified": true, "helpfulness": "4/12", "author": "Alan Hanslik"}, {"rating": 5.0, "review": "I'm so happy with this purchase! I needed a little help with set up so had to call Amazon and the Amazon rep was a little impatient and got testy with me but we worked through it and once I figured it out, it was pretty easy. Note - I've never had a VCR - DVD, anything that plugged into my TV (so I was a little technically challenged). I've always watched movies through my cable company but my current company isn't set up for movies so I purchased this and it works great! I love that it's hooked up to my Amazon and Netflix account. Ordering movie is a breeze! And I love the voice control! I agree with others, if you are searching for something it won't search on Netflix - only on Amazon to try to get you to pay for a movie (where you may be able to get it on your Netflix account) but I still like the feature! Would definitely recommend!", "verified": true, "helpfulness": "2/2", "author": "sacstt"}, {"rating": 5.0, "review": "Makes watching TV with my amazon account very convenient, also netflix. I'm going to downgrade my cable to basic and save some money. Remote is easy to use, unfortunately it's small and easy to misplace.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As awesome as advertised. Voice search is flawless.  Haven't played gamwa, but apps and video are great. Get it now.", "verified": true, "helpfulness": "3/3", "author": "gregg ryback"}, {"rating": 2.0, "review": "Today this device is totally useless. I can't get it to work at all and I now see the return window closed 1 week ago. Imagine that. I have spent the whole evening trying to see what I could so about it but to no avail. The power LED on the Kindle Fire TV is yellow and pulses to a brighter yellow. I have rebooted everything multiple times, changed batteries and rebooted the internet provider's modem. I am out of ideas and I am thinking this device was pushed out before it was really ready. I am out $99. My advice is to not buy it but wait till Amazon works out the obvious bugs. I bought it the first time it on Amazon. I think I am probably too gullible.", "verified": true, "helpfulness": "5/9", "author": "Daniel J Durell"}, {"rating": 2.0, "review": "I LOVE Amazon, and though I already have two Rokus, a Chromecast, and various tablets, I was so excited to hear about the Fire TV that I bought it on day 1.While playback was mostly smooth, apart from a few connection problems, I returned it because I could not stand the user interface: Sitting in front of a large TV and only seeing one title at a time,  when browsing for content, is a big waste of my time and patience. I am not half blind, I can handle more than one cover  at a time! To make matters worse, when you reach the last title in a row, it doesn't automatically jump back to the first. Oh no, you have to scroll all the way back.One.By.One!Search is fine when the remote understands you, but when it doesn't, you have one long line of letters from a to z ... One line. For real, Amazon?! What were you thinking? At least give me a keypad!Of course, then there is the fact that voice search is only available for Amazon content, that Netflix is listed  amongst other apps (the Roku has a better way to display providers side by side, which is understandable, but not user friendly), that only Prime content is not searchable yet, that the content and app categories are organized in a very bad way, and that there is no web browser, which I was kind of hoping for, being that the box is based on Android. Also, I was hoping that apps would be added very quickly, but that was not the case at all. In the month that I had it, I didn't see a single new app I would have wanted. A ton of channels I have on the Roku are not (yet?) available.I may try it again next year, but for now, I ended up always using my Roku and never my Fire TV, so it did not make sense to keep it.Have I mentioned that I don't like the interface?", "verified": true, "helpfulness": "4/6", "author": "xendula \"avid e-Book reader\""}, {"rating": 1.0, "review": "As a huge Amazon fan I was happy to get this as a gift and wanted to love it but.........No Vudu, No HBO Go, No Cinema Now, No way to search Amazon Prime Videos.........No THANKS!", "verified": false, "helpfulness": "4/12", "author": "MrFootin"}]