[{"rating": 5.0, "review": "This product is everything they say it is, The voice command controller is awesome for the kids. Daddy doesn't have to \"find my show\" endless content with prime and so many features when bundled to kindle we haven't explored them all yet.well worth the low price and your one step closer to saying goodbye cable", "verified": true, "helpfulness": "1/3", "author": "Jerry"}, {"rating": 3.0, "review": "My current streaming player quit working, what I can't see listed is...1. Does it have the ability to stream video files from your PC?2. What file formats does it support3. They didn't compare it to a WD TV live that allows to stream from all the popular services, and will play just about any type of file you have on your PC.3. They have not created or released a remote control app for Android or iOS, which work better than remotes that ship with streaming players.", "verified": false, "helpfulness": "0/6", "author": "KENDALL DEMOTT"}, {"rating": 5.0, "review": "Awesome Product. Easy to setup, Fast,and has a high definition picture that seems better than similar products such as the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Stevenj521"}, {"rating": 5.0, "review": "Love this product, I plugged it and it worked...just like that! Super easy to hook-up and use. I also like that we could easily unplug it and take it anywhere with us. It would be nice of the voice search worked on all apps instead of Amazon products only.", "verified": true, "helpfulness": "0/0", "author": "MommaShopsAlot"}, {"rating": 5.0, "review": "I have tried every device under the sun. I do NOT have cable - so I depend on 100% streaming and an HD antennae.I have AppleTV, Roku, GoogleTV variants, Chromecast and every other one out there.  I am sick and tired of Apple's dooshfest and locking all of your media into their world. So I walked away. AppleTV is easy to use ... but I have grown to hate their business model.So ... FireTV ... It is BLAZING FAST. The movies are cheaper. You can choose SD instead of HD and save $1 ... and there is not much difference. So movies are really $2.99 to rent. The apps are improving ... so I use Chromecast ($34.99) to supplement FireTV as they expand. There is NOTHING that I need between FireTV and Chromecast.I have kids ... so it is even more challenging. They are fine ... no issues.  We rent movies, use Netflix, share HBO, Netflix, HuluPlus with family members ... so it is affordable. It sure beats paying $170/mo for cable ... and now only about $60 for high-speed internet ... so we are saving $100/mo ... so even if we purchased 30 SD movies a month ... we are still saving money over cable. Its a no-brainer. Cut the cord.My parents are retired ... and they cut the chord too ... no problem. It is easy to use.", "verified": true, "helpfulness": "4/5", "author": "Confirmed Buyer Review \"S.M. Saunders\""}, {"rating": 5.0, "review": "My most critical thing is it being wireless wifi because I see the Ethernet plug in but it'd be nice because I'm so far away from my internet.", "verified": false, "helpfulness": "0/3", "author": "Noah J. Williams"}, {"rating": 4.0, "review": "This unit now works well in all of it's apps. The previous problem with Netflix was resolved. For me the only improvement I would suggest would be the ability to do a search from one setting of all of the video content that is  available from all of the providers; Netflix, Amazon, Hulu plus, etc.", "verified": true, "helpfulness": "1/1", "author": "Gawain Beeswing"}, {"rating": 3.0, "review": "Overall good, but remote needs some work.Remote could benefit from buttons that have a glow so they could be identified in the dark.It would also be nice to be able to access my have is on fire TV via a universal remote (I use a Control 4) as I can with my Apple TV.", "verified": true, "helpfulness": "0/2", "author": "P. Harold Wallar"}, {"rating": 5.0, "review": "Its great .", "verified": true, "helpfulness": "0/0", "author": "shane"}, {"rating": 1.0, "review": "I should have bought another Apple TV.1. The Prime offerings are few and far between. Don't buy this for Prime content.2. Apple TV has many more Apps.3. The main purpose of this device is to create rental and purchase of content from Amazon.4. At half the price I would give it 5 stars.", "verified": true, "helpfulness": "3/11", "author": "All-access Customer \"Unhappy_w_Amazon\""}]