[{"rating": 5.0, "review": "I have two of these devices and they work flawlessly.  My only suggestion would be to include a on\\off button.  Currently the devices only have a sleep function which kills power but doesn't shut it off.", "verified": true, "helpfulness": "1/1", "author": "MKD \"bombaman\""}, {"rating": 5.0, "review": "Gorgeous!  I have had this since september 3rd 2014, works great, only issue I have is from the terrible internet providers we have at the moment, all n all.... great going Amazon, I have and love your stuff! If I need it replaced or anything on this site it gets done well, only had one real issue on the site from being a customer. And it's been said n done. So very happy, baught this for myself. I haven't baught anything like this in a long time.  Even the remote works really well with sonic!! ALSO, working on the gaming control fun once I get it. Will update when I can about it.I was going to buy this when they were on sale, but a week after made me upset, so found at best buy and it was still on sale woohooo! I had no idea that best buy even carried these!  I was going to go back here n buy, but unfortunately,  was a think between timing. So satisfied. Very, except the fact I wanted to buy it here.ALSO as well, if u have any issues with this device, let their customer service know, personally I have had NO issues with their service!EDIT UPDATE 10, 8, 2014: found out that even tho this is a gaming device, I popped up a quite a few villager and zombies trap.  Lags horridly doing that, but anything else so far is fine.Still a great device. Don't be discouraged of this.", "verified": true, "helpfulness": "0/0", "author": "Shady Glaives Of Death"}, {"rating": 1.0, "review": "Well it worked allright for a couple of days. After that it can't maintain its connection. But my trustee WII game player never fails its connection and my Vizio smart televisions never lose their connections either. For a $100 bucks I expected better. Just more junk. Thanks Amazon, how about a little lube the next time you want to stick it in.", "verified": true, "helpfulness": "1/8", "author": "Thomas Warren"}, {"rating": 4.0, "review": "We have had an Amazon Fire TV box for a few months, and yet again the Netflix app is broken -- for the third time since getting this box. We've never had trouble with Netflix on a Samsung Blu-ray player, on a Roku box, or on a Samsung Smart TV. The repeated failures of the Netflix app on the Fire TV box make me wonder whether Amazon intentionally sabotages Netflix. Selecting the Netflix app tonight caused a short snippet of XML code to appear where the main Netflix menu should have appeared. The only way to exit was to press the Home button on the remote control.==========================Update on October 5, 2014:Here is what Amazon customer service emailed me overnight:--------------------Hello,I'm sorry for the inconvenience caused to you in accessing Netflix App on your Fire TV. This is definitely not what we want our Customers to experience.Since you're frequently facing this issue on your Fire TV, I request you to try the below steps:1. Firstly, try restarting your modem, and router by turning them off, waiting 30 seconds, and then turning them back on, usually solves connection problems like this.2. Uninstalling and reinstalling the Netflix App which usually resolves any intermittent issues. To do this:1. From the Home screen, select Settings, and then select Applications.2. Scroll up or down to find the app you want to uninstall, and select it.3. Select Uninstall, and then follow the onscreen instructions.Once this is done, reinstall the App and try accessing the App and check if the issue is resolved.--------------------Step 2 solved the problem, but then I had to re-enter the Netflix email address and password. I'm bumping my rating from two stars to three stars, as a result.==========================Update on October 6, 2014:Here is what Amazon customer service emailed me today:--------------------Hello ...,My name is Linda with Amazon Customer Support. I've read your recent review regarding the Fire TV and the Netflix application.I'm sorry that the application isn't opening. I see you contacted customer service last night regarding this issue and it seemed to be resolved. I investigated this issue further and saw that this is something our technical team is working on currently, and should be resolved shortly.If you still need help, please contact us.--------------------Thanks to this notification that Amazon's technical team is working on the Netflix app problem now, I'm bumping my rating from three stars to four stars.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "i got this machine had it for only 3 days and it stopped working wouldnt play any thing on any of the apps even my prime videos would not play it would say having difficulty playing that title,than i try netflix it would not play any movie and hulu too.I switch to my tv and the netflix works so i know its the machine breaking down it is not a machine that is anything to brag about it does hardly have anything on it the mtx 2 midnight by matricom is a by far better machine does way more than that fire tv.", "verified": true, "helpfulness": "0/1", "author": "ticha petit"}, {"rating": 5.0, "review": "great edition to your entertainment system", "verified": true, "helpfulness": "0/0", "author": "William L Popham Jr"}, {"rating": 1.0, "review": "USB port not working to stream from external HDD = inferior to ROKU 3. The Roku 3 which is at least one year older can stream movies from your external hard drive... Why place a USB port in a device that doesn't work. It is meant for support or developer service but that doesn't make sense. Will send it back ASAP as it is inferior to my ROKU3.", "verified": true, "helpfulness": "3/6", "author": "CookieCat"}, {"rating": 1.0, "review": "One major problem/flaw with the Fire TV.My wife can't watch her videos from her prime account on my unit.She could do that with my previous devices like the GoogleTV.The Fire TV only works with one account. I may need to buy another Fire TV just for her account.But, I would have 2 units attached to one television. And TWO identical but different controllers! Another option would be to give her my Fire TV and register it to her account.But, my purchasing games and apps would bill her credit card.We would have an argument. I could purchase Amazon Prime just for this unit. But, that isn't happening.I don't want to pay for movies and other things that she may purchase.And, now my credit card would be billed.Another argumentFinally, I could tell her to cancel her Prime and just used Netflix instead.She will argue that I am an idiot for buying even more useless junk which she cannot use. (checkmate - she wins)For now I will have to have two units - the Fire TV and either a Roku or GoogleTV for her.I'll probably go with the GoogleTV as she likes the keyboard for Netflix (as do I)For now arguments are the usual ones. Too many devices,remotes,cables and confusion.I was hoping to get a new toy/gadget and live with one box. Solve some arguments.Make everyone happy. (even the toddler)It would be nice if they could let someone log in and out of Prime Video on it.The unit is all about Amazon and Amazon Prime. You would think that Amazon would offer the best solutions and options for using their service with their device. I may need to get rid of this when AndroidTv is released.That is Amazon has an app on those units of course.This stuff never ends.Just wait till she notices the Fire TV game controller I have hidden in the drawer. - I'm dead.At least I have finally disconnected the VCR and put this in it's place (this is smaller)Update: Contacted customer support and they said that need to purchase separate Fire TV for everyone.Edited Nov 4 2014Lowered to 1 star. Subscribed to my own prime account as per customer service recommendation to try out Amazon videos.  Doesn't work . System is constantly crashing and restarting. Netflix too.My wife asked if it should be doing this. I said no.Junk", "verified": true, "helpfulness": "2/3", "author": "C. Robbins"}, {"rating": 5.0, "review": "now that i figured it out..love it..dont have to buy a smart tv ..would recommend to anyone..works great", "verified": true, "helpfulness": "0/0", "author": "reba"}, {"rating": 5.0, "review": "We love it - Only have 4 local channels and now we can watch movies, series, etc with our prime account.", "verified": true, "helpfulness": "0/0", "author": "cinrae"}]