[{"rating": 1.0, "review": "Loyal Amazon Prime shopper for a long time. So all the bashing that follows is strictly for the little Fire TV box.1. No extendable storage scheme like flash drive. Only 8 gig available and some of the best games are nearly 2 gig.2. Search cannot be limited to Prime only content. (I rented a movie from Amazon ONCE! The rest of my viewing is Prime only.)3. Search does not include Netflix and Hulu content. (Get a Roku for a search that is really superb.)4. Obviously designed with the primary purpose of selling more Amazon content. Its primary purpose should be providing me with entertainment smoothly and efficiently. It has failed miserably!5. Difficult, if not impossible to search or browse Amazons wealth of content. They have a lot of movies ,good luck finding out what they are.6. Can't turn it off. No power button. I don't know how much power it consumes but in an energy conscious world this is a no-no.7. Video freezes in Hulu app leaving black screen or frozen screen while audio plays on. Video sometimes unfreezes and characters hurry along at hyper speed like a lot of Charlie Chaplins as they catch up with the audio. Usually though I have to completely exit the Hulu app and start all over again.This last one is a deal breaker. We would return it. But it is probably too late to now. It took us a long time to diagnose the problem and nail it down to the Hulu app. Customer service will tell you to unplug this and that and restart this or that and call your ISP because they must suck if our product doesn't work properly and unplug this cable or uninstall and reinstall the application.I USED to be an avid Amazon Prime fan. But the Fire TV has cost them a lot of credit with me. They have lost a lot of my trust. I will be keeping an eye on them in the future and will not be so ready to buy into their products. I am embarrassed when I recall how naïve is was when I made this purchase. I thought that since it came from Amazon it would be something really special. Instead it was a roaring disappointment.If possible I am going to return this sleek little brick to them. Regardless I am buying a Roku 3. Ironically I will probably buy it through Amazon, but I will be checking Wal-Mart first.", "verified": true, "helpfulness": "5/8", "author": "Busy Body"}, {"rating": 5.0, "review": "Love it. I like how it uses your pictures from the cloud as a screen saver. Very easy to work. Very quick. I wish the voice search would pull up Netflix titles if they are not offered on Amazon Prime.", "verified": true, "helpfulness": "1/2", "author": "Tyler P."}, {"rating": 5.0, "review": "It met every expectation I was hoping for. I mean c'mon guy $20 bucks a month (sling tv), obviously a little more if you link up your hulu and Netflix account, but still way less than satellite or cable.  Easy to use and for free you can play some games listen to music and watch YouTube videos.  Great buy guys.", "verified": true, "helpfulness": "0/1", "author": "Alexander Rosiles"}, {"rating": 5.0, "review": "I absolutely love Amazon's Fire TV.  It has thus far exceeded my expectations.  Hands down blows away the abilities of my Samsung so called Smart TV (picture is amazing, Apps not so much)  I purchased both the Fire TV and Fire Stick to enable our family to cut the cord from Direct TV.  After being a loyal customer of Direct TV for several years, it reached a point where I could no longer justify paying thousands of dollars a year to watch a handful of channels.Prior to purchasing the Fire Stick & TV, we signed up for 3 months of Sling.  In doing so we got a free Fire Stick and Fire TV for $89, a total savings of $50.The biggest benefits of the Amazon's Fire TV are as follows:Voice enabled remoteHuge App SelectionAllows you integrate all of your devicesFire TV App; allows you control the Fire TV or Stick with your phoneIntegration of Amazon Prime Featuring, including photos and musicGaming (I have not personally tried this out yet)If you are looking to cut the cord and saving thousands, I recommend that you seriously consider the Fire TV and or Stick", "verified": true, "helpfulness": "0/1", "author": "Jason A. Anderson"}, {"rating": 5.0, "review": "I love Amazon Fire - I have bought two for my not so smart TV's!  Way cheaper than buying smart TV's!  Am getting ready to get rid of cable all together!", "verified": true, "helpfulness": "0/1", "author": "Manners Mom \"Elaine Manners\""}, {"rating": 5.0, "review": "I have no complaints.  That's very rare for me as a techie.  Can't exactly explain how that happened outside of the fact that Amazon has built a pretty solid streaming box.", "verified": true, "helpfulness": "1/2", "author": "Jeremy Lieb"}, {"rating": 5.0, "review": "Good", "verified": false, "helpfulness": "0/1", "author": "Michelle Spencer"}, {"rating": 5.0, "review": "We are SO enjoying streaming movies and TV shows for free with our Amazon membership!", "verified": true, "helpfulness": "0/1", "author": "Linda Adams"}, {"rating": 5.0, "review": "Love it. I've been able to watch programs that I had originally missed....and no commercials.  What could be better?  I'm looking forward to watching more things that I've missed.", "verified": true, "helpfulness": "0/0", "author": "Cookie37"}, {"rating": 3.0, "review": "Its a love hate relationship, this device works perfectly when it does work. But other times it constantly freezes, the voice till continue to play and the picture is stuck. Its okay, but it has flaws and it's really aggravating!", "verified": false, "helpfulness": "0/1", "author": "Jade the Great Aunt!"}]