[{"rating": 5.0, "review": "The Amazon Fire exceeded my expectations in its ease of installation and operating convenience.  The voice recognition feature is impressive for a product of this cost and size.I wish that Amazon would add \"Acorn TV\" to the media provider list.  We prefer the British TV series to the TV series that are currently offered by the current media providers.", "verified": true, "helpfulness": "0/0", "author": "E. A. Sack"}, {"rating": 5.0, "review": "I already buy 3..1for my brother ..1 for my Friend and of course 1for myself ..the name for the Amazon Fire tv in my house is: The little mistery box.", "verified": true, "helpfulness": "0/0", "author": "Roberto Abreu"}, {"rating": 5.0, "review": "I love it. Works great. I was using my dvr which was very slow due to lack of memory. Fire TV works without any delays. I will look forward to see larger memory since the price of the memory chips are dropping every day.", "verified": true, "helpfulness": "0/0", "author": "pervaiz sial"}, {"rating": 5.0, "review": "Awesome. Best 100.00 you could spend", "verified": true, "helpfulness": "0/0", "author": "Adam Purcell"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "david orquiz"}, {"rating": 2.0, "review": "The device itself is okay but HULU is much meter as you don't have to pay to watch prime time TV shows. I could have saved money and gotten a ROKU.", "verified": true, "helpfulness": "0/0", "author": "Vicki"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This is not about the system itself, its about the service, if the user is outside of US the amazon fire tv will only works with netflix. So i dont think $99 worth it just for netflix.", "verified": true, "helpfulness": "1/4", "author": "JOsue"}, {"rating": 3.0, "review": "Ehhh, seems like there are a lot of shows on Amazon Prime that are really old, unless you want to pay MORE...... Yeah, it's ok. One of the good things is that it ties into Netflix as well, which definitely has more shows.....and, yes, still have to pay for that as well. It's ok.", "verified": true, "helpfulness": "0/0", "author": "Hunt4Steve"}, {"rating": 5.0, "review": "Works as expected.  Still have to get a bit more educated on what it can do but Lovin it!", "verified": true, "helpfulness": "0/1", "author": "Barbara"}]