[{"rating": 5.0, "review": "I own a Roku and now the Fire TV. I already love the Fire TV WAY WAY WAY more than my Roku. That will be put in y daughters room. We are still learning our way around it, but find it incredibly easy. As a Amazon Prime member it came already registered to me, so I did not have to fuss with signing in and all that jazz. The initial install took a minute, but that was due to my wireless connection in my home. So far my child has played games on it and we have watched a couple shows. The quality of the picture is great compared to my Roku. Great deal! I love everything Amazon :)", "verified": true, "helpfulness": "3/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is my first stream TV box and Amazon nailed it.  It may not be for every techno-geek, but for a family that wants to pick the content it watches, it's a winner.  We have Amazon Prime (and access to Prime Instant Video), and Netflix, so we have fairly good access to a world of content.  Certainly not everything, but enough to make the kiddos very happy.The one call-out is the voice search.  EXCELLENT!  It works well.  I can search by Actor, Genre, or by Actor + Genre.  Way better than typing in a search box, letter-by-letter. Also fun to watch old personal videos and slide-show of pictures that I have in the Amazon Cloud.Other call-out:  the GAMES!  Kiddos love the casual games.  Certainly not for hard-core gamers, but intuitive and fun enough for the kids.  I bought the Game Controller so I hope that makes it even more fun.One thing I wish it had:  access to my Amazon music...  Hopefully that'll come soon!", "verified": true, "helpfulness": "4/5", "author": "Young Lee"}, {"rating": 4.0, "review": "I don't have much new to include that hasn't been touched on so far.  I found that the set up was as easy as promised.  2 wires to connect, a WiFi signal to find, and that was it.  once it was set up, I was easily searching my video library.  I do have a pretty good sized AIV library built over the course of 3 fires now, so it works well for me.  The voice search worked for me.  The loading speed for Amazon videos is nothing short of incredible.  it is quicker than anything I have ever seen, including DVD or bluray.  The loading speed for Netflix is a bit slower, but is still better than any other device I have seen myself.The low number of apps can't be ignored, but this device is not even a week old.  The picture quality is very good for all the video I have seen.  however, I have noticed some lag on both AIV and Netflix.  They are mostly flickers here and there, but are noticeable.  Haven't tried the games yet.  I think I will look for quality low cost Bluetooth controller and avoid the $40 Amazon branded one.  Overall, I am glad I got this and look forward to an expansion of apps.edit: after a few days use, i have one thing to update.  for hdx owners, beware when you screen share.  i left mine on for a couple days and it really ate up battery.  that was even when i wasn't using video.  it is easy enough to break the link.  just something to keep in mind.", "verified": true, "helpfulness": "3/6", "author": "O. McConville"}, {"rating": 5.0, "review": "I have toyed with the idea of Apple TV for some time but never really understood what it was.  I am over 70, female, and while comfortable enough in the world of Windows and love my iPod, I am still intimidated by my iPhone. (My old Android was beyond me.) In other words, anything complicated in the world of technology is more of a challenge than I need in my life.However I adore my Kindle.  It is easy to use, does exactly what it says it will do and has added to my life's enjoyment.  So when I read the Amazon had just announced their new Five TV I was very interested.  It was going to let me watch Netflix (something I thought you had to have a Nintendo or other game console for, and gaming is beyond me) and it had movies I could watch at no extra cost because of my Amazon Prime membership....which I got for other reasons.  And, since I also have an Amazon credit card with points, it was also inexpensive.It arrived and, huzzah!, it was ready almost right out of the box.  I had ordered the extra HDMI cable which came in the same container, and I had it up and ready to login in five minutes.  Biggest challenge was entering my WiFi router password but when that worked I was good to go.  Had to reboot the machine to download Netflix but that just means unplugging the power cord for 10 seconds and then plugging it back again.  In two days I have watched a movie, a whole series of TV shows, and am in love with this device.  It is designed for people like me, tech appreciators but not up to remembering a series of functions every time  you want to use something.  It is idiot proof.  There is a good startup video to show you how to use the super simple remote and I do like the voice activation function.  Never could get that going on my iPhone.  I expect to have years of fun with this device.", "verified": true, "helpfulness": "5/6", "author": "Lotusland Lady"}, {"rating": 5.0, "review": "Received the Fire TV  on 4/4 and been using it quite a lot since. Set up was easy and s/w update took about 10 min.  I cannot compare to other streaming devices since this is the first I’ve owned however been watching free Prime shows and everything seem to be instantaneous and I can’t tell the difference in picture quality from DVD’s that are  played on a  Blu-ray player and what shows up via streaming.  The main reason I bought this is I’ve have been a prime member since it started mostly for the 2 day shipping, ended up buying several models of their readers for the massive book selections including lots of free and $0.99 books.  Decided to take advantage of the free prime movies and TV shows since I’ve been buying British Mysteries box sets for the last few years and realized most of the shows and movies I would have bought are free with prime. Bottom line I would have spent much  more than $99  buying box sets of shows and movies  and  I haven’t gone  wrong yet with Amazon products.", "verified": true, "helpfulness": "2/3", "author": "Phil J \"Phil\""}, {"rating": 1.0, "review": "The worst part is there is NO Support phone number for the Fire TV, so I have no choice but to return it to Amazon.  Is it worth trying to have them replace it?  Who knows.", "verified": true, "helpfulness": "11/25", "author": "K. Rogoway \"Prestige Gaming\""}, {"rating": 3.0, "review": "The device is just as competent as my AppleTV 1.  However, my Apple TV 1 can control the volume of its output.I understand the FireTV remote is bluetooth.  My Vizio TV also has a Bluetooth remote.  I don't know why the FireTV remote can't have the up/down sections of the ring button control my TV volume.  This is a bummer, a major missed opportunity, and forcing me to keep two remotes on the coffee table will be a constant source of irritation when comparing it to the AppleTV.", "verified": true, "helpfulness": "3/11", "author": "Mark \"Mark\""}, {"rating": 5.0, "review": "Love this little box! my search is finally over for a perfect streaming box. With this one, I'm replacing my NUC htpc, Roku and my Minix X7. I use it mostly for online streaming (netflix and amazon) and XBMC for my local media. This little box perfectly fit my needs providing a remote control friendly UI, DD/DTS passthrough audio and awesome performance.", "verified": true, "helpfulness": "2/3", "author": "Alpha S \"alpha\""}, {"rating": 5.0, "review": "Perhaps there are other devices that also allow you to play all the Amazon video content you've purchased over the years, but none let me do this so easily as the Fire TV.  Right out the box, I was able to see all the purchased content, get to Prime content and quickly download and immediately view content.  This is the bomb if you're knee deep in all things Amazon.  I suspect this will continue to be a solid, well-designed product.  I'll probably buy a second Fire TV for the home office.I have 2 of the Fire HD devices and have been very pleased with their performance and longevity.  I expect the Fire TV will perform just as well.  The design and engineering of the Fire TV is impressive.  For the Amazon-entrenched user base, this is a great streaming device.  Well worth the $99 IMHO.Update as of 4/13/14If you're like me, you have 200-300 DVDs in your video library and find yourself replacing the old DVDs with Blu Rays and digital copies.  What a racket first of all...  Second, I find myself not appreciating a book case solely dedicated to an ever growing collection.  With that said, I am now trying to build a digital library (with less physical media) and Amazon makes this easy.  The value-add here is Amazon supplements my collection with an ever expanding Prime library.  Yeah, iTunes is jumping on the bandwagon as well as the UltraViolet consortium.  I say bring it on and let the consumer pick what works best for them!Happy surfing!", "verified": true, "helpfulness": "3/4", "author": "Akumal Larry"}, {"rating": 5.0, "review": "Very easy to hook up and to view.  I have hulu, pandora, netflix and amazon.  Super easy to sign up.", "verified": true, "helpfulness": "1/2", "author": "S.D. Katt"}]