[{"rating": 5.0, "review": "its great once I found out how the remote worked", "verified": true, "helpfulness": "1/1", "author": "wonderful"}, {"rating": 5.0, "review": "If you're a Prime member you won't regret purchasing Amazon's Fire TV. I received my Prime TV two weeks ago when Amazon offered a limited time special price offer of $84.00 (still available as of Aug.26).  Within 5 minutes after opening the package I was up and running without experiencing any problems whatsoever. The voice feature on the remote works great. When it comes to streaming I've had no problems even though my mbps speeds average between 2.-3.. Photos, music, watch list, apps, all downloaded with no problems.  HBO Go is supposed to be added later this year along with other apps which will give Fire TV even greater appeal.", "verified": true, "helpfulness": "3/3", "author": "dewzter"}, {"rating": 3.0, "review": "The Amazon Fire TV is everything it claimed to be, so it's hard to knock it -- but it wasn't everything I hoped for.  It fell short of the grand (and probably unfair) expectations I placed on it.  I ended up sending it back after two weeks.Pros:It's an attractive, sleek little box.Quick and easy setup - it took just minutes to go from unboxing to browsing content.  I never even had to log into my Amazon account.  (That was presumably pushed-down to my device when I first-connected it to wi-fi.)  That allowed me to hit the ground running and gave a great first-impression.It's fast, and it's butter-smooth.  It handled everything I threw at it like a never-stuttering champ.The remote.  It's so simple, but it's exactly what it needs to be.  It's responsive, to the touch and within the UI.  The microphone for searching is a great feature.Voice search - it's every bit as fast and accurate as advertised.Cons:(Limited) voice search - This is my biggest knock.  Search ONLY searches across Amazon's content.  That's great for Amazon, but crummy for us.  Why should we be willing to pay $1.99 to watch a (non-Prime) show streaming through Amazon if it's already included in a monthly subscription cost for Netflix or Hulu.  If the voice search feature searched across multiple content distributors, I probably would have kept my Fire TV.Resolution detection - the Fire TV had a little trouble detecting what its resolution ought to be when I placed it behind an HDMI 4x2 matrix.  (Both display devices were capable of 1080p, but the Fire TV scaled down to 480p.  It never had this problem when it was directly connected to a display device.)Prime Music.  Where was Prime Music?  I was able to access my purchased Amazon Music content -- a couple hundred songs --, but not the 1+ million songs that are supposed to be accessible to Prime members.Cons (that probably aren't fair to hold against it):AppStore - Ugggggh...  I get what Amazon is trying to do, but coming from Android, it's painful.  It's not just a lack of content (by comparison), it's also that you're expected to re-purchase content that you've already purchased through Google's Play Store.  There were apps that I wanted to try, but I never got over this mental hurdle; couldn't re-purchase something I'd already purchased.Bluetooth HID - my passwords are complex, and having to type them using the on-screen keyboard was painful.  Eventually I just connected a USB keyboard, but it would have been nice to be able to use a wireless Bluetooth keyboard instead.  (I found no way to pair one.)Bluetooth A2DP - it also would have been nice to be able to pair the Fire TV with a pair of A2DP Bluetooth headphones (like the Google TV-based Vizio CoStar did) for audio streaming.  That's a criminally-underrated feature; easily the most-convenient way to watch content without disturbing others.All-in-all, I was very impressed with the hardware, but couldn't get on-board with some of Amazon's platform decisions.  The lack of a Universal Search and the inability to (locally) sideload apps that I already purchased through the Google Play Store are what ultimately lead to me returning my Fire TV.", "verified": true, "helpfulness": "8/9", "author": "Christopher C. Mulkey"}, {"rating": 5.0, "review": "I don't know how I lived without it", "verified": true, "helpfulness": "1/2", "author": "Sindye T."}, {"rating": 5.0, "review": "Very nice unit. Voice search is flawless for me. Love everything about it.", "verified": false, "helpfulness": "0/1", "author": "Al"}, {"rating": 5.0, "review": "Love our Fire TV!  Simple to use, parental controls work and it's fast!", "verified": true, "helpfulness": "0/1", "author": "KristaMG"}, {"rating": 5.0, "review": "A great product for a companies first try. I was shopping around for something similar and nothing seemed to have what I wanted but the Amazon Fire TV does. It's fast and very logical to use. It's hard to imagine many more improvements there could be to it but if I was able to want something, it might be web browsing. Other than that, I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Daniel E. Crago"}, {"rating": 5.0, "review": "No complaints. Size makes it easy to connect anywhere. I bought this mainly to replace my Sony blu-ray player for watching Netflix streaming content. The Amazon Prime Instant Video a plus, as they have additional content not offered by Netflix. Connection speed is fast - video/audio quality (I have it set up on a receiver w/ HDMI switching) is great and rarely, if ever are there any buffering interruptions.  Even recognized the Fire TV unit on Logitech Harmony remote set-up.  Good selection of music apps. Like it better than Apple TV and look forward to more available apps.", "verified": true, "helpfulness": "0/0", "author": "runner007"}, {"rating": 5.0, "review": "Works great, Just needs crunchy roll app and for Amazon to put Prime Music on there and it would be perfect.", "verified": true, "helpfulness": "0/1", "author": "Mr. \"I.E James Sunderland\""}, {"rating": 5.0, "review": "I have had FireTV for 3 months now. Using my PC as a media server for the PLEX App, I can stream 720P quality TV shows and movies onto FireTV flawlessly. This alone makes the FireTV excellent. Combine it with Amazon Prime Videos (HBO stuff is great!), Music, Apps such as Youtube, Netflix, it is really great. FireTV voice feature is a nice addition and I also brought a FireTV controller for some games. There is a limited amount of games you can install, which is one of a few gripes with this product. 8GB internal storage isn't enough, hopefully the USB slot will allow use to expand the memory for additional apps. I do wish for Amazon's Prime Videos to expand into more movies and TV shows, as well as interesting apps for local news, etc which will ultimately make it a Cable TV killer.All in all, for $99 its not bad at all. If you don't have setup box for your TV, Roku, AppleTV, and a decent internet provider, then I suggest you look at the FireTV.Side Note: I had it froze on me twice, but I just clear the cache and it works fine again. 8GB is too low of internal storage-major yet only flaw I can gripe about.", "verified": true, "helpfulness": "0/0", "author": "L. Hou \"JournaL\""}]