[{"rating": 4.0, "review": "We've been very pleased with this so far (about two weeks).  The interface is easy and intuitive though it would be better if it were more customizable.  My only issues with it so far is storage space and heat.  The space issue was caused by a driving game that downloaded 1.3 GB.  Sure, it is an unusually large game but I would have thought the device would have at least 64-128 GB of storage space.  The heat is only a concern because I have mine in a cabinet.  There is plenty of open air around the device but, when combined with the heat from the other devices, the cabinet air gets surprisingly hot.  The device itself is strikingly hot to the touch.", "verified": true, "helpfulness": "0/0", "author": "Michael Friddell"}, {"rating": 1.0, "review": "I have tried to get help from Amazon help, they had no clue about this product. I also purchased a hdmi cord, pluged in one side to Tv and other in fire tv,  it did not work, the white light shined on the fire TV for about 3 seconds the turned to yellow, However my biggest If I bought the fire TV I could watch 200,000 FREE movies, I didn't know that I would have to pay more.  I am very unhappy, and going to send it back to get a refund.  YOU DID FALSE ADVERTISING.  This is the second time that I got burned from Amazon, Never again....  I have told a lot of my friends not to make this same mistake.", "verified": true, "helpfulness": "6/8", "author": "Irene Ramey"}, {"rating": 3.0, "review": "Great for people living in the US. If you try to use it abroad, you really cant watch much without being charge for every single chapter or movie that you watch.", "verified": true, "helpfulness": "0/0", "author": "Miguel"}, {"rating": 5.0, "review": "Great device! Super easy to use, and I love the blue tooth remote... Thx Amazon!", "verified": true, "helpfulness": "0/0", "author": "Steven Mercier"}, {"rating": 5.0, "review": "We love it. Easy to use. A must have for Prime members.", "verified": true, "helpfulness": "0/0", "author": "Matthew Kerbow"}, {"rating": 1.0, "review": "I buy a lot of products from Amazon and am largely pleased with most everything I've purchased.  I don't think I've ever written a negative comment before, but this devise was a significant let down and I replaced it quickly with my old Apple TV.  The Netflix app is terrible; its unreliable, gives poor picture quality and doesn't have nearly the features as the Apple TV.Amazon is a great store and I really value it, but if this is what they're going to manufacture and market then I fear they're going to lose some customers who may not come back.", "verified": true, "helpfulness": "2/3", "author": "Rob"}, {"rating": 5.0, "review": "I love my FireTV - solid device, small and easy to use.  I use the voice search more than I expected.", "verified": true, "helpfulness": "0/0", "author": "Lee Uecker"}, {"rating": 4.0, "review": "Needs an Internet browser of some sort", "verified": true, "helpfulness": "0/0", "author": "Conor Breen"}, {"rating": 5.0, "review": "so glad we got this. really enjoying its use.", "verified": true, "helpfulness": "0/0", "author": "Sally Kelley"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Mohamed Aboseada"}]