[{"rating": 5.0, "review": "Everything you would expect and then some.", "verified": true, "helpfulness": "0/0", "author": "Bradley white"}, {"rating": 5.0, "review": "I bought this on a lark, just to check it out compared to the Apple TV.  I find it much more interesting and easy to use than the Apple TV. All Amazon Prime shows are free through the Amazon TV.  The voice command is great for ease of finding shows and navigating.  We were able to install the Hulu app and watch all our Hulu Plus shows as well.  It has become the Go-To add on TV box for our household.  I wish I could get pictures from my iPhone up to the screen as easily as I can on the Apple TV, but that doesn't detract from how great the Amazon TV is otherwise.", "verified": true, "helpfulness": "0/0", "author": "Mark A. Lunsford"}, {"rating": 5.0, "review": "I'm very pleased with this product.  Setup was straightforward, and it has performed flawlessly.  The only recommendation at this time is to incorporate voice recognition within the Netflix app.", "verified": true, "helpfulness": "0/0", "author": "gary"}, {"rating": 4.0, "review": "Love it. Wish I could voice search for all apps and not just Amazon like you can with Roku.Nice for us cable cutters.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "Works great. connected in one minute. would buy again.", "verified": true, "helpfulness": "0/0", "author": "Gregario"}, {"rating": 5.0, "review": "Perfect!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I sent it back because it did not work. It was easier to send back than to get the person to understand that I wanted to replace. Now it costs $20 more to purchase.", "verified": true, "helpfulness": "1/7", "author": "richard joyner"}, {"rating": 2.0, "review": "We so wanted to love the Fire TV as it seemed to consolidate a lot of the features our 3D tv already offered with the Prime offerings and the access response seemed a lot quicker.  Unfortunately, our first issue was while watching selected video offerings, it would suddenly halt playback necessitating a restart of the box.  It got to a point where we couldn't finish any video offering without a restart.  We were also disappointed that DirecTV hadn't seen the light and was not on the list of interfacing cable/satellite companies (couldn't believe DISH was) which was a huge disappointment as I was hoping to be able to access my DTV paid-for NFL satellite offerings.  And now, less than 30 days from installation, the box is totally dead.  Don't know exactly what the problem is but from these reviews, we don't seem to be the only ones with a dead box.  I'm sure we would have been pleased if everything worked since Amazon has never disappointed us before, but now we're hesitating purchasing the FireHD without a lot more research.", "verified": true, "helpfulness": "0/1", "author": "AK FishMan"}, {"rating": 4.0, "review": "It's easy to use and leave you plenty of viewing options. I'd like to see the Prime libraries beefed up a bit - especially in the fitness category - but, otherwise, I can't complain. It's also got great options for kid friendly viewing!", "verified": true, "helpfulness": "0/0", "author": "smhtorres"}, {"rating": 4.0, "review": "Love my Fire TV!! I feel it's very resonably priced. My only issue with it so far is when your on Netflix watching movies and even know your signal is very strong it cuts out the movie and has to reload a few times per movie.", "verified": true, "helpfulness": "0/0", "author": "Richelle Tharp"}]