[{"rating": 5.0, "review": "Love it.  Took me a while to get it up and running(the instructions were not very helpful).  Just getting into it and will give it a two thumbs up!", "verified": true, "helpfulness": "0/0", "author": "patisu"}, {"rating": 5.0, "review": "Much better interface then my Samsung smart tv. Will probably purchase another.", "verified": true, "helpfulness": "0/0", "author": "stephen"}, {"rating": 1.0, "review": "I've had the Amazon Fire TV for less than a week and the remote control doesn't work already!  Absolutely ridiculous!", "verified": true, "helpfulness": "0/2", "author": "Leslie A. Sollid"}, {"rating": 4.0, "review": "I liked it so much I bought two", "verified": true, "helpfulness": "0/0", "author": "D. Cairns"}, {"rating": 5.0, "review": "Good job", "verified": true, "helpfulness": "0/0", "author": "crimebuff"}, {"rating": 5.0, "review": "After I receivedmit it took me literally a few minutes to hook up and start to use it.  It could have not been easier or faster to do.", "verified": true, "helpfulness": "0/0", "author": "Jan"}, {"rating": 2.0, "review": "Some things work well on this, others don't.  Tried renting a movie from amazon on it and it gave me errors.  Tried the same movie on a blueray player and it worked fine.  The game controller works on some things, you have to use the TV remote on others.  It plays some android games from your Amazon apps library but oddly enough not all of them.  Pluto TV gives a lot of errors.", "verified": true, "helpfulness": "0/1", "author": "Goldberry"}, {"rating": 4.0, "review": "Every moive i wanted to watch was not fee and movie was 10 years old or more", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 5.0, "review": "Wow", "verified": false, "helpfulness": "0/0", "author": "Todd Thomas"}, {"rating": 5.0, "review": "Awesome works great. perfect for sling tv.only thing is needs vlc or similar to play my own movies etc.", "verified": true, "helpfulness": "0/0", "author": "WR \"Will\""}]