[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "John Bennett"}, {"rating": 1.0, "review": "The main reason I purchased this was to watch baseball using the MLB app. Amazon support was unable to get this working for me due to an account sync issue so I returned the device.", "verified": true, "helpfulness": "2/2", "author": "Mike Allen"}, {"rating": 4.0, "review": "Works great and has some great features. The only negative is they need to sync Prime music though Amazon Fire as well. I can only play music that I purchased or uploaded to my cloud.", "verified": true, "helpfulness": "0/0", "author": "Craig H. Kinaman"}, {"rating": 3.0, "review": "A little difficult to figure out..", "verified": true, "helpfulness": "1/2", "author": "Lisa Marshall"}, {"rating": 5.0, "review": "Fabulous tech toy . . . practical too . . . unknown numbers of \"free\" films from classics to recent productions.  Don't know how we got along without it . . . but we have it now and we love it.  Best feature . . . talk to it and it does what you want; i.e. \"The Graduate\" . . . three second and the film is ready to watch (no charge).", "verified": true, "helpfulness": "0/0", "author": "Edmonds' Kitchen Captain"}, {"rating": 5.0, "review": "Was not sure what Amazon TV was going to be & I took a chance.  Am glad I did.  This adds depth and quality to my entertainment options.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 2.0, "review": "Its a fast media player but it lacks memery and the ablity to use a external hard drive. Also I dont think it has a browser. A cheap media player maybe a better choce", "verified": true, "helpfulness": "0/0", "author": "Brian Harzheim \"Brian\""}, {"rating": 1.0, "review": "Unfortunately the voice feature will not work for the Netflix library and I don't do Prime.", "verified": true, "helpfulness": "7/8", "author": "Laaurence W. Michalski \"tantumergo\""}, {"rating": 5.0, "review": "AWESOME!!!  Running XBMC as well and it is so far very stable and works great!  Love it love it!!  I have had the Boxee, Apple TV first gen and G-Box.  This is by far better than all of them.", "verified": true, "helpfulness": "0/0", "author": "S. LIM \"tech junkie\""}, {"rating": 5.0, "review": "In the past I've used Boxee, Roku, Apple TV, Chromecast, OUYA, Chinese Android boxes and 3 generations of WD TV.The Amazon Fire TV is the best all purpose device. It has great hardware specs, including a Bluetooth remote (so the Fire TV doesn't need line of site). It supports a lot of online streaming services including Amazon Prime. and best of all XBMC can be side loaded onto the device with minimal effort. XBMC does have a bit of a learning curve but there's a lot of community support.This device is a game changer.", "verified": true, "helpfulness": "1/2", "author": "Darrell"}]