[{"rating": 4.0, "review": "The Amazon Fire TV is perfect for what I wanted. I got rid of cable in my home office, where I do all my work. I can stream music or watch Prime or Netflix. The addition of HBO to Prime was perfect timing.I can't wait for the HBO GO app.The voice search works great, although, like others, I wish I could search other apps, like Netflix, with it.Also, seeing all my cloud drive photos and videos on the tv is awesome.NEGATIVES:MORE APPS! I wish it had network apps, like ABC or even TNT.Cloud Player--where is it? I purchase a lot of music from Amazon, and really thought this would be there. Very disappointing.Games: I have not purchased the controller because it doesn't seem to have enough games to justify $40. As more come on line, I'm sure I will purchase it.All in all, a great purchase. The negatives take very little away from the beauty of this little box. I'm sure that more apps and games are on their way.", "verified": true, "helpfulness": "0/1", "author": "Constantly Reading Momma"}, {"rating": 5.0, "review": "We had this hooked up and ready to use in only a few minutes. I had Chromecast but all I could watch with it was Netflix. I figured I would try this and if I wasn't happy with it I would just return it. It turned out to be far better than I expected. I have access to almost any show or movie I can think of. It is still new to me so I spend a lot of time just playing around with it and getting more comfortable using it. It really is simple to use and is just the right match for my big, beautiful TV.", "verified": true, "helpfulness": "0/0", "author": "A. Boleyn"}, {"rating": 2.0, "review": "amazon prime is not worth $99.00  dollars. you have to pay for every thing. you say that moves are free and there not.", "verified": true, "helpfulness": "2/9", "author": "Mike de Loera"}, {"rating": 4.0, "review": "Apple TV does have a more intuitive UI, but without Amazon Prime, it's basically a wash between the two. I'll put it this way: my wife bristles at anything tech. She never checks her email account that I had to set up for her. Same with social media. She was fine with the Apple TV for the last two years or so, once she got used to it. Within one week of having the Fire TV, she stopped using the Apple box completely.", "verified": true, "helpfulness": "1/1", "author": "P. Cusick \"pc\""}, {"rating": 4.0, "review": "Out of the box, plugged in, and streaming in 30 minutes or less.  Once the WiFi relationship was established, everything went smoothly.  Content is easy to find (though limited from Amazon Prime) and manage.  We now find ourselves with too many remotes again, but that is more a problem of the remote-challenged in the household than any indictment against Fire TV.  Having sucked it up and paying for Amazon Prime, I now exploit it by ordering more from Amazon than I might otherwise since I get free 2nd day delivery and free Kindle loans of books.  All-in-all, a fine value, even if it is one of the priciest ways to stream content.", "verified": true, "helpfulness": "1/1", "author": "Nataraj \"eyeDance\""}, {"rating": 5.0, "review": "Honestly I have lagged behind when it comes to streaming video etc...So I can't compare to the other products that are out there but I can say the Fure TV does everything and more for my needs. Movies games and TV..couldn't ask for more. Just love this product.", "verified": true, "helpfulness": "1/1", "author": "wrrodger"}, {"rating": 2.0, "review": "If i had to do it again,that is purchase the amazon fire tv.i would get support from you guys.may be in the future i will purchase it once again.", "verified": true, "helpfulness": "0/5", "author": "DR.DREW"}, {"rating": 4.0, "review": "We have really enjoyed the Amazon Fire TV.  The only thing we have not been pleased with is the lack of parental control available.", "verified": true, "helpfulness": "0/0", "author": "hainsc"}, {"rating": 5.0, "review": "Everything it said it was and more.  Easy set up and playing in less than 20 mins. Love It and it it easy to transport from the house to our summer camper.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the ability to search via voice command versus selecting one letter at a time on a remote.  Thank you!", "verified": true, "helpfulness": "1/1", "author": "Jerry A Gleisner"}]