[{"rating": 5.0, "review": "I purchased a wireless Roku that had terribly streaming problems. Every time the audio wouldn't work. I had very high speed internet service and the Roku sat next to the router. I gave up. I was going to buy the highest model Roku had, but I bought the Amazon Fire TV instead. It is a wired connection plugged into the back of my wireless router and it works great! Set up was so easy! I'm not sorry I threw away a new Roku, it isn't worth the money that Amazon Fire is worth.", "verified": true, "helpfulness": "0/0", "author": "SPark"}, {"rating": 2.0, "review": "I found after only having this product for less than 6 hours of using this product it would cost a fortune to rent movies. Not only having to rent the movies the selection of what was mentioned in the selling advertisement you get thousands of free movies and other things you certainly DO NOT. It also will block your digital antenna from picking up your T.V.  channels. I only had 2 channels that would work when this was plugged into my T.V I had to unplug the power plug of this product to be able to view my T.V.  channels again. Not happy with this product and feel paying $99.00 to listen to a lot of music channels and music free wasn't worth the price. Biggest gripe is not much of selections of free movies and I can rent movies elsewhere cheaper. The good side of this product was the setup was very easy, plug in and go, but one flaw you need internet. REALLY. Why buy a product to view movies and games if you have internet and pay for it? I would not recommend this product as it would be very costly and not a big selection of free movies or T.V. channels or shows free. You have to purchase those to.  I certainly returned the product based on it would cost a fortune to view movies and not a lot of selection of movies or games. Glad I didn't purchase a game remote.", "verified": true, "helpfulness": "2/7", "author": "thagrumpet19"}, {"rating": 5.0, "review": "Let me start by saying this was very easy to hook-up, but be sure to buy the cables that come separately.  I've watched a couple of free movies using my Amazon Prime membership, which is a great feature.  I originally purchased the box so I could use it with Netflix, but I may wait to subscribed to Netflix until I've gone through some of the movies on Amazon. :-)  I also like being able to listen to Pandora while I have visitors or I'm doing house cleaning.  Great box!", "verified": true, "helpfulness": "0/0", "author": "DivaDO"}, {"rating": 5.0, "review": "I can't believe how much I like this Amazon Fire TV. The picture compared to my Wii (which was used to watch internet TV channels before), is so much better! The response time is faster and choices are fantastic. I love the voice function as well. The remote is small, but sturdy. I definitely recommend this for watching channels w/out cable or satellite. I also love the beautiful pictures that are displayed on the screen saver when the fire isn't in use.", "verified": true, "helpfulness": "2/2", "author": "A. Hewes \"AngFoo\""}, {"rating": 2.0, "review": "I was disappointed at the lack of channels offered by Amazon Fire - it in no way compares to my Roku. I am hoping that this is a matter of it being so new and other apps and channels will be added in the future. One of the reasons I was excited about the Amazon Fire was voice searching. I have just discovered that the voice search only works with Amazon Prime -- not for other channels like Netflix. While I have no complaints for it's performance, I will continue to recommend going with the Roku", "verified": true, "helpfulness": "2/6", "author": "Gwinnetta Crowell"}, {"rating": 1.0, "review": "now it just says \"wireless connected, connection problem\" no other details.  Reconfigured wireless a couple times, set a static IP to make sure there wasnt a conflict.  Roku, samsung, and HDXs stream fine over wireless.  Very disappointed.", "verified": true, "helpfulness": "2/8", "author": "D. Peterson"}, {"rating": 5.0, "review": "I'm very pleased!  Don't hesitate with this acquisition.This is a simple device, with lots of free viewing if you're a prime member.  One little controller does it all.  So easy to relax and watch TV - isn't that what tv is all about?We've cancelled our cable tv and our netflix;  saving a substantial amount of money.  Thank you Amazon - you've made my day (er, night)!", "verified": true, "helpfulness": "1/1", "author": "Hattie"}, {"rating": 5.0, "review": "I read a LOT of reviews for anything I am considering buying and this device was no exception. While numerous people reported an extended update time the first time they plugged in their device, I did not experience that. I left a room to get a glass of water and when I returned it had moved pass updates.The rest of the process went just as smoothly. It literally took longer to unpack the device and controller and insert batteries in both devices than it took to get the device up and running (including updating). I do have the highest speed DSL offered by ATT in my area, so I guess that made the process quicker. Pairing the controller to the device was also easy. I just had to scroll down to setting on the main menu, scroll over to controllers, press the round button, and follow instructions. Selecting aps was just as easy.While I have not had time to use the device extensively, I have accessed Amazon instant video through voice search, checked new releases in Amazon Prime movies and TV shows, accessed my watch list, accessed Netflix, and play one game. I had no problems in any area. In fact, I found the device to operate quickly.", "verified": true, "helpfulness": "3/3", "author": "TRiley"}, {"rating": 1.0, "review": "The Blaze TV is inexplicably not included but it is included on Roku. Also the comparison with Roku is very interesting as it only applies to the subset of channels considered to be \"Games\" (this miss-lead me a bit at first but I have been corrected). I've had Roku since it first came out due to its superior WiFi connectivity. It beat out Apple TV and BeeBox which were the the big 3 back then. My Roku 3 has well over 350 channels but I do not know how many are games since step 1 on installing a new Roku is to delete Angry Birds to free up DASD. I am a big fan of Amazon and their Kindle products too so I am very disappointed that they feel they must mislead us in this subtle way. But, no big deal. It actually could be an attractive product for TVs in our house other than our main TV (we stream much more TV than broadcast TV). Except I feel miss-lead plus The Blaze is missing. Why would this popular channel be missing? PS. Google Chromecast is a great alternative we use on our other TVs. It will play whatever you can play in a Chrome browser, like The Blaze TV, on any modern HDMI TV. I got one free to test and I was surprised that I liked it so much. There are little drops and freezes and quirks here and there but no more than regular cable or our Directv really. So we like Roku on our main TV ($100). Then, at $35 plus a laptop, iPad, iPhone or Android device, Chromecast on the other TVs. I hope this helps...", "verified": true, "helpfulness": "4/16", "author": "ibn Saud"}, {"rating": 3.0, "review": "You have to wait up to 5 minutes before you get volume. The other thing I hate is amazon.com customer service. I dare anyone to try to get a hold amazon customer service is a joke.", "verified": true, "helpfulness": "1/5", "author": "Bullet"}]