[{"rating": 5.0, "review": "Very nice.", "verified": true, "helpfulness": "0/0", "author": "S. Varga"}, {"rating": 5.0, "review": "Love it.  We use it almost all of the time we watch TV.", "verified": true, "helpfulness": "0/0", "author": "Dakota's Mom"}, {"rating": 2.0, "review": "If you have trouble with the remote, just try getting help for it! There is no telephone contact, no fast and easy way to get help. I just spent two hours with the so-called troubleshooters,,who concluded that the remote was defective. Then I got an email message telling me to contact troubleshooting! When I finally tracked down a phone connection--oh yes, they call you, you can't call them--I spent another hour on the phone, mostly on hold, trying to get a $29.99 replacement remote.This is entirely unacceptable.Oh, just to update this, the replacement remote has been delayed for about least two more days. And I am to pay the postage to return the defective product??? I am paying for a service that does NOT deliver.  Who does that ???The worst service nightmare.", "verified": true, "helpfulness": "0/2", "author": "Barbara Correll"}, {"rating": 2.0, "review": "I have bought this several months ago and just decided it was not for me. Unless you like to pay form your movies (which I can do on my DirecTV) I would not recommend this device. Most of what I would have liked to watch are rentals which cost $3.99 and up, even though I am an Amazon Prime member and am supposed to get access to thousands of free movies..", "verified": true, "helpfulness": "0/4", "author": "Conrad Perl \"Opera fan\""}, {"rating": 5.0, "review": "Way better than apple TV. Faster, more efficient, easy navigation, and EXCELLENT support. Glad I bought it.Looking forward to Echo which I hear might be able to communicate with Amazon TV.", "verified": true, "helpfulness": "0/0", "author": "J. Adame \"New Man\""}, {"rating": 1.0, "review": "Greatly disappointed with this item. Worked fine for a few months then started having problem with distorting sound. Rebooting it fixed it, then it would happen again after a day or two. I contacted tech support and got the usual wave a dead chicken over it while resetting it to factory default. No joy. Given how much time I had to waste getting tech support I have better things to do with my time than waste more of it trying to get Amazon to replace it. Have cancelled my order for their latest plug-in since I can only assume it will be of similar quality.Greatly disappointed and would recommend folks stick with Roku if you want a streaming device.", "verified": true, "helpfulness": "1/5", "author": "Dr. Miguelito Loveless"}, {"rating": 5.0, "review": "Bought this and it's great so far. Does what you expect. I am wondering whether or not I should turn it off after use though. Unlike the chromecast which uses the tv as a power source and turns off automatically once the tv is turned off, the amazon fire tv remains on as long as it's connected to an outlet. Does leaving it connected wear it out sooner? Should I unplug it after every use?Thanks!", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 5.0, "review": "Love it. Best Plex box I have ever had.", "verified": true, "helpfulness": "0/0", "author": "G.Younis"}, {"rating": 4.0, "review": "Very good stream box . Needs usb", "verified": true, "helpfulness": "0/1", "author": "david"}, {"rating": 3.0, "review": "I just got the original Fire TV today. I won it at a work event. A week before that I preordered the stick, so now I'll have two of them. I also have a Roku and an Apple TV.  Out of the box the fire tv was simple to set up and connect to my network. The menus look good and the navigation is smooth. After about 15 minutes of trying things out I decided to switch back to my AppleTV so I can use the FX App... I'm hooked on old Simpsons right now.There is nothing bad about the Fire TV, but nothing great yet either. It's missing the app selection other devices offer.  If you have iOS / Mac devices the AppleTV may be the way to go. If you just want the apps and an open platform go Roku. I have not tested the Kindle Fire integration but it looks close to the iOS / AppleTV concept.Day 2 update: If you have DIRECTV you can't use the Showtime Anytime app on the Fire TV.  For some reason the login option is not there yet.  It does work with the AppleTV and Roku.2 Months in: The original Fire TV has been good, but the Fire TV stick is always losing it's WL:AN config and needs to be rebooted.  I keep getting logged out of the Netflix app too, but that may be a specific Netflix issue.", "verified": false, "helpfulness": "1/1", "author": "CW"}]