[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Ace"}, {"rating": 5.0, "review": "Works very well thanks", "verified": true, "helpfulness": "0/1", "author": "Gerald Rapp"}, {"rating": 5.0, "review": "This is not the first streaming product I have used.  I have played with a ROKU owned multiple Apple TV first generation, multiple Apple TV second generation and a third generation Apple TV.  I was so impressed with the functionality and capability of these machines that I have since sold all of my Apple TVs.  Everything from the remote to the on screen performance is phenomenal.  I did have a small issue with one of the remotes connecting, however after less than 2 minutes and a reboot it synced up and have had no problems.  They work just as well a new one at a reduced rate.  If you are an Amazon Prime member, I would highly recommend this product.", "verified": true, "helpfulness": "0/1", "author": "jal9626"}, {"rating": 5.0, "review": "Great product and delivery was as promised.", "verified": true, "helpfulness": "0/1", "author": "Joel Jacob"}, {"rating": 1.0, "review": "This device is cumbersome as it requires switching between input ports. Would not purchase again.", "verified": true, "helpfulness": "0/6", "author": "Robert D. Bruce"}, {"rating": 5.0, "review": "We use it every day", "verified": true, "helpfulness": "0/1", "author": "From Houston"}, {"rating": 4.0, "review": "Love the Fire TV. It's fast and the UI is convenient. Coming off a ROKU and this is far superior. Removing one star because I have to restart it more often than I think I should for Netflix, Amazon and Youtube to play.", "verified": true, "helpfulness": "0/1", "author": "tristan espiritu"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Kelli F."}, {"rating": 5.0, "review": "Love my Amazon Fire TV & the Fire Stick!  I have two sticks and one fire tv.  I am somewhat techie but not overly so.  I was able to finally cut the cord with my cable tv provider.  Thank you, Amazon.  Between Prime, Netflix and Sling TV, I am just as entertained and am still finding new things about this new entertainment venue. In the past month after my divorce from Cox, when I have time to watch tv I have always found something interesting and entertaining to watch.  The voice activated remote is awesome.  Only problem I have now is my internet usage is through the ROOF!  I went from using less than 100 gb a month to over 500 in the past month or so.  WOW.  I wonder if I need to unplug some of these devices to limit the inadvertent usage. Any advice, Amazon techies?", "verified": true, "helpfulness": "0/1", "author": "Rita Foster"}, {"rating": 5.0, "review": "so easy to use. i love it", "verified": true, "helpfulness": "0/1", "author": "daysi patsos"}]