[{"rating": 4.0, "review": "1) Need to support complete suit of Audio formats being supported. Like FLAC is missing from the list2) Needs one more USB for direct HDD read and also Memory stick3) NAS access support must have4) Very good App which is not just a remote (boring) but can also open HDD/NAS -> folder -> media files -> play music / movie = all from tablet, smartphone (Android/IOS) example : Stream Magic app from CAComparison of product is not complete. I would like to see this product is also compared with WD Live TV too which has NAS/HDD access.", "verified": false, "helpfulness": "0/4", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I would not buy anything you use Prime with.  Just discovered that my prime membership was canceled.  Amazon rep I chatted with stated that I turned off the auto renewal.  I did no such thing. NOW, the price of prime went up $20.  Seems like some shady practices here Amazon.  Very disappointed in this service. Thinking of selling my kindle fire HDX for something else. Service like this will make me want to spend my money elsewhere.", "verified": false, "helpfulness": "8/130", "author": "Allen W"}, {"rating": 4.0, "review": "The Amazon Fire TV offers just about any streaming content you could wish for. It's very easy to set up, fast and easy to use. The voice controlled search is gorgeous and works beautifully. I've only found two problems so far.The Fire Box Seems to default to Stereo sound, you need to go into settings and turn on Dolby Digital Plus for the best sound. After I did that, there were several programs and movies that suddenly didn't have any sound. It wasn't until I set the sound option back to 'stereo' that the sound came back on those programs. Amazon needs to fix that issue.My second complaint is more of a puzzle. The Fire TV works very well in 'mirroring' the Kindle Fire tablet and allows you to play video content from your personal computer on your TV by downloading it onto your Kindle Fire and then mirroring the Kindle Fire on the Fire TV. But instead of going through all that, why can't the Fire TV just connect with your PC through your wireless network and play the content for you? With the horsepower Amazon gave the Fire TV, it seems to me that a direct link with your content in your computer would have been a no brainer.Is Fire TV worth the money? Yes! It's fast, it's easy, it offers a LOT of content and the voice search is exceptional and will probably do nothing but get better. Well worth the money.", "verified": true, "helpfulness": "7/8", "author": "Rabid Reader"}, {"rating": 4.0, "review": "This is a setup tour for those getting it to know what to expect! Overall, the the hardware is great and the software is very simple to navigate through. Games play extremely well and there are no software hiccups do to the powerful guts. Do check out the other videos of mine on the dargadgetz youtube channel!", "verified": false, "helpfulness": "6/8", "author": "Dan"}, {"rating": 3.0, "review": "This is a good box for somebody on a budget that wants to get both video streaming and gaming in a cheap solution, but if you want a refined TV experience the fire tv is inferior to Roku in every way other than speed.I own many different internet tv/content streaming devices including an HTPC, Western Digital Live, ROKU 3, 2.......The Fire TV is excellent hardware in almost every way surpassing all other devices in speed.  The only hardware observation I made that was not excellent is the remote.  It is very responsive and the layout is good, but itfeels funny like it was not made for my hand.  I realize that's subjective, but it feels inferior to the roku remote that fits your hand in a comfortable grasp.  The fire tv remote seems too small.  Overall excellent hardware.having had so many of these devices i was expecting the fire tv interface to be buyer-centric & app-centric.  By this I mean an interface that shows you all your apps as a home screen and lots of user settings to make the device behave how you desire and find content, not an interface with an agenda (sell amazon product).  If I hit the home key on my roku3, I quickly get to a nice graphical display of all my apps.  In fire TV you have to hit the home screen, scroll down about four clicks and then enter the apps list.  I also did not see a way to organize this apps list as well and so were talking 5 to 10 clicks to fire up netflix if you have a number of apps.  This might seem like a stupid complaint, but I've already had it the good way with Roku not favoring a particular app as well as the ability or organize as I see fit.  I can quickly do a global app search on roku that blows amazon's search away less the voice (the voice search is excellent just poorly executed in what data it will provide you with).  The roku search will show me the actors and movies I want, and then after I select a title it show me every app that has it with the price including free if it's prime or netflix.instead of putting games on it, or should I say before they spent the time putting games on it, they should have made the search global across all apps.  They should have made good filters for amazon content (I like my roku 3 amazon app more than I like using the fire tv for amazon content!) like show prime only in certain genres.  Amazon does not seem willing to put the labor in to their content library to make a powerful search.  Netflix does a poor job too, but Amazon rents many movies for five bucks a view.", "verified": true, "helpfulness": "5/10", "author": "M. Smith"}, {"rating": 4.0, "review": "Why recommend this to me if it is not available outside the USA, as a British ex-soldier, and a staunch supporter of the USA, it does annoy me a little to receive offers like this, and also offers which could be available to UK service and ex-service personnel, but are not.Please Amazon, if these offers are not available to your countries greatest allie and closest friend, then don't insult us by sending details.Thank you.", "verified": false, "helpfulness": "1/14", "author": "scotsjohn6004"}, {"rating": 5.0, "review": "It works beyond what I expected.  Voice has been spot on and installation was done in just minutes.  I'm not a cloud user really but the integration between this device and the cloud worked great.  I've uploaded some of my vacation pictures and video and now they are a click away.  I haven't tried the games yet but I did order the controller.  If you are on the fence about this device I have to say hop off, it's a perfect device.  To be honest I'm not sure it could be any better.", "verified": true, "helpfulness": "5/7", "author": "Michael Harris"}, {"rating": 4.0, "review": "There are quite a few things to like about the Fire TV, and it's a promising competitor with future releases to the already established heavyweights of Apple TV and Roku.There were however, quite a few frustrations.  For starters, the immediate updates required (understandable for software) took a little while.  To the point that I walked away for a few minutes to attend to natures call and when I came back there was a video playing.  I tried to rewind the video, or stop it, or pause it... all to no avail.  I'm not sure how much I missed, or what it was talking about, but i do know it was frustrating that the video didn't wait for my input before it started.Starting to use the device was as easy as you would want it to be.  The menu's were easy to navigate, following a familiar layout.  The synchronization with the cloud drive was very nice and the fact that it was set up upon launch was great.  Thumbing through the photos on my cloud drive was FAST.  I scrolled through 500 thumbnails before there was a pause to reload additional.  After this, another 500 scrolled without delay.  The frustration here was finding one picture that was somewhat questionable for the whole family and wanting to delete that single photo -- but there was no (immediately apparent) way to do this.  I could find a way to add new pictures, but none to delete.Finding Prime Instant Videos appears easy on the surface; however, once you get past the first 100 or so advertised prime videos on the main menu, finding more is a bit of a pain.Everything you've heard about the Fire TV being fast is true.  This thing is a beast!  I was very excited to trying the gaming - however, and another frustration, the controller I ordered on launch day along with the Fire TV did not arrive on time.  As always, Amazon's customer service was so much more than any other company - but no amount of apologies or compensation would produce a controller in time to spend the weekend with it.  While I appreciate Amazon's legendary customer service, my comment back to them was this: \"Fire TV was your secret, your closely guarded product launch... why wouldn't you, Amazon, have your products ready to ship?  In fact, why didn't you offer Fire TV with your much lauded same day shipping?\"  I'll have to update this review when I get the controller.Like many others, I'm frustrated to have yet another remote controller that can't be integrated with my master remote.  But the vocal controls worked great.  Even when we spoke titles that were not in the Amazon library, the screen displayed exactly what we stated.... though Magnum P.I. came across as Magnum Pi.The last frustration that I noted on day one with the device was more of a minor issue.  Once the device went into screen saver mode, we were very much enjoying the Amazon provided photos but after about 20 min, the device went to sleep.  Knowing our viewing habits, I went into settings to change the sleep timer, only to find that there was no way to adjust the sleep settings.  That was a minor issue and a major frustration.UPDATE:Having used the system for about a week now, the menu system is becoming a major point of contention.  The issue that I have is that while scrolling with the remote it's fairly easy to accidently back out of the menu you're in because of the way the carosels scroll and react while browsing titles.  While this whouldn't be a terrible inconvenience, when you try to go back into the carosel that you were just in to resume your browsing, you get bumped back to the beginning of the carosel.  This is a major pain in the patookus and a significant distraction to the Fire TV experience.  Especially when you're 70 titles into a 90 title carosel and then you accidently get kicked out - the experience of having to go back into the Carosel and scroll 70 titles to return to your browsing point is an EPIC FAIL.  Hopefully there is an immediate update coming to fix this experience.", "verified": true, "helpfulness": "2/3", "author": "Jason G. Troxel"}, {"rating": 5.0, "review": "There are many, many praises and complaints of what the Fire can and cannot do, but there is no mention of picture quality.  On my screen (Panasonic plasma) the picture is noticeably better than the Roku 3 I have been using for the last year.  At least on Netflix and Amazon Prime, picture quality is as close to Blu-Ray as I have seen so far.", "verified": true, "helpfulness": "8/9", "author": "Richard K. Ziegenfuss"}, {"rating": 5.0, "review": "Finally i've found a great replacement for my AppleTV2 (which mostly was used for XBMC).- Great performance with XBMC (720p & 1080p)- YouTube streaming from iOS/Android- Games are impressiveThis is all I need!", "verified": true, "helpfulness": "3/6", "author": "PG"}]