[{"rating": 3.0, "review": "I have been playing around with this device for a few days and I have to say that I am impressed with the overall quality. It has a really nice finish to the remote. The quality of the box itself is very good. I think Amazon really took some time to make this box a really professional looking product. I also love the user interface and I find it to be polished as well.I currently own a Roku 3 and for the longest time I have been waiting for the next Roku device. 512 MB of Ram is not enough. I find that the Roku 3 has an interface that is responsive but not fast. The FireTV interface is quick as lightning. The performance blows away the Roku devices. Yes, there are some people that have been complaining about the lack of headset support. If that bothers you, then get a Roku device for your room. That is what I have done with mine. I have put that in my room and the FireTV as a living room device. I find that the Roku company is floating along as if they are waiting to be acquired from someone. They don't push the technical envelope hard enough.So, why not 5 stars? The reason is because of Amazon. They literally get in the way of themselves. They want the benefits of Android without sharing. All of those apps that you purchase from play store have to be purchased AGAIN. They believe in what I call \"The Borg Business Model\". They build proprietary devices that interact with their own product lines. That reason is the same reason that I will not buy an Apple product, The Ouya, or Amazon cloud services. No reason when I am already invested in the Google Play store. They are shooting themselves in the foot as they could really push their boxes, tablets, and Prime memberships to a wider audience if they were not so proprietary.Some people also complain about the gaming aspect. Forget it. The FireTV at best will a secondary android gaming device. The only games I will buy on this device are the ones proprietary from Amazon Game studios OR ones that will only work on this device and not on my other android devices.You want an awesome android gaming device? Get an NVidia Shield. It is absolute ridiculousness in the Awesome category. Great android device that has UI Mapper for the controller for games that are touch only. It also operates in console mode hooked directly to your TV.Pros:Great quality of the productNice UIFaster than a RokuWorks great as standalone streaming deviceCons:1 star for \"The Borg\" Business model and its proprietary services and not utilizing the Google Play store.1 star for stupid things like the coin system. Didn't they learn from Microsoft that its a waste of time to do that nonsense. Just have everything in the local currency. Why display dollars and coins? Stupid.", "verified": true, "helpfulness": "6/10", "author": "Amazon Customer \"7web\""}, {"rating": 5.0, "review": "Fantastic product and its footprint is remarkable, had it set up and running in <10 minutes and my first movie downloaded shortly after.  Fantastic!!!!", "verified": true, "helpfulness": "2/2", "author": "Carl J Baltes"}, {"rating": 5.0, "review": "Ordered on Thursday, arrived on Saturday, running Sunday at noon for movies that night. Voice search worked fine and pointed to movies I had not been able to get on a competitive service. The movie ran without a flaw and started immediately.One con - the manuals say nothing about setting it up to run through a receiver for a surround sound system. The manuals or the online help should explain this approach. If for no other reason than to assure us it will work.I hooked the HDMI to my receiver as input 4 (game system), renamed the input as \"Amazon\", and like magic the audio is stripped out by the receiver and goes to the 7.1 speakers and the video passes to the TV like all the other boxes (sat, DVD, Blu-Ray).", "verified": true, "helpfulness": "7/7", "author": "A. Adkins \"Disneyphile\""}, {"rating": 5.0, "review": "I have never owned a set top box but have always been intrigued by the idea. With the Fire TV I finally pulled the trigger and purchased one. This little box has performed better than I ever would have expected.The speed and ability to show crystal clear HD shows/movies is remarkable. I would recommend this to anyone who is looking for a set top box.P.S. - The gaming capabilities are quite impressive as well.", "verified": true, "helpfulness": "3/3", "author": "Riley \"Peter\""}, {"rating": 5.0, "review": "This device replaced a Roku 2 that we liked.  This Amazon Fire TV is AWESOME!  It is way quicker going through the menus.  The voice search capability is incredible. We added our Netflix account to it as well as the Amazon Prime account.  They both work very well.  The picture on this seems to me to be much more crisp as well.  This is well worth the switch.  I was going to put the Roku on another TV but, I think I am going to buy another Amazon Fire TV instead.  I would tell anyone to purchase one of these.", "verified": true, "helpfulness": "6/6", "author": "tshef"}, {"rating": 3.0, "review": "I like it, amazon video products work well and fast, but Hulu Plus and Netflix are slow, specially Hulu. Never had this problem when I was streaming them in my PS3. Also, Netflix and Hulu+ on the FireTV do not support Voice Search. Hopefully a software update in the future could possible fix all this problems.", "verified": true, "helpfulness": "30/35", "author": "xairo"}, {"rating": 3.0, "review": "The Fire TV has a lot of potential but it has some serious shortcomings.  I have faith in Amazon and assume they will fix them in time, but for now, be sure it does what you want it to do before you spend your hard-earned money!The basic functionality is good.  It boots fast.  It integrates well with Amazon video.  The app store interface isn't bad.Voice search works very well if you are looking for something on Amazon.Voice search does NOT work well if you are looking for something elsewhere.  There is integration with Netflix and other apps.  So if you want to search for a video that you suspect is out there for free somewhere, you can use the voice search feature to check and see if Amazon has it, but you have to use each lame online keyboard in each app to check each app to see if it might be there.  Disappointing.There is no integration with Amazon Cloud Player.  If you are hoping to use this box to access your cloud music, forget it.  It is NOT like an Apple TV.  I have the Amazon cloud service and uploaded my huge music library to it a while back, and was hoping to use the Fire TV to access it.  No joy.  To be fair, they do not promise this.  I assumed it would be there, but I was wrong (and disappointed).  Adding the cloud player seems like a no-brainer.  Perhaps they will get around to it.  One side effect of this lack is that you can't use voice search to find your music, even if it IS in the Amazon cloud.There is no good way to stream media from a local library.  I have a bunch of videos on a NAS, and on various other platforms I can navigate to that NAS, select a video, and play it.  There appears to be no support for this sort of thing in the Fire TV.  The only app I found that sorta kinda does it is PLEX.  The problems involved in getting PLEX set up and working is worthy of a serious rant, but that isn't the point of this review.  Once it is set up, it is glacially slow and bad.  Suffice it to say that going the PLEX route is much more complex than navigating to a network device and picking a video.  You shouldn't have to deal with it anyway - who would have guessed that a network media player would lack the capability of playing media from your network?I trust Amazon for the most part.  When they fix this stuff, which I would expect to see as basic functionality, I will update my review.", "verified": true, "helpfulness": "3/4", "author": "John Grieggs"}, {"rating": 5.0, "review": "Take the apple TV and add Siri-like voice recognition powered searches, an app store / support for third party apps, fun games, and tight integration across many of Amazon's other product lines such as streaming AIV or mirroring videos from a Kindle Fire, similar to Apple's AirPlay, and you end up with the Amazon Fire TV.  There were a few hard to notice UI bugs such as menu footers spilling over from previous entries, and also I could find no obvious way to skip the somewhat annoying and mandatory cartoon video tutorial that launches when you first setup the device, but other than that the device was flawless and has replaced use of my Apple TV for cases other than needing to access content I already bought off of iTunes.", "verified": true, "helpfulness": "3/4", "author": "Joseph Johnson \"joe johnson\""}, {"rating": 1.0, "review": "MLB is not available...Last time I checked, the baseball season has already started.  MLB and HBO are not available.What's the point?Returned it.", "verified": true, "helpfulness": "11/53", "author": "John Peanut"}, {"rating": 3.0, "review": "Where is Spotify? Where is YouTube? Where is Slingbox? Where is Amazon mp3 for goodness sakes?! There are some key content apps missing on fireTV. Maybe I missed it, but I didn't see an \"app store\" where I could go and download / purchase more apps. That implies I have to wait for firmware refreshes, and we all know that is at the whim of the product managers at Amazon.It is otherwise a great OTT box with fast load times. Gaming will definitely differentiate from other boxes out there. I agree with the posts from those with hearing disabilities - should have CC from Day 1.Folks at Amazon rushed this one out the door though, and it should have more content availability, especially now that most home systems are integrated (TV w/ sound system). Voice search needs to be applicable to music and inputting text, not just finding video content.", "verified": true, "helpfulness": "0/3", "author": "Bengalito"}]