[{"rating": 2.0, "review": "Not quite ready for prime time. I would seriously look at all your options before spending money on these gadgets.", "verified": true, "helpfulness": "2/2", "author": "Jimbo"}, {"rating": 3.0, "review": "I toyed with the idea of buying a new \"smart\" tv, but was reluctant to invest that much money into a TV that might not be compatable with streaming from Amazon. Seems only some will, other may not. I wanted to replace my very early model Roku device with something more dynamic. So, I decided I'd try the Amazon TV.I can say it arrived very quickly, faster than I expected or was predicted.I can  say it was NOTeasy to set up, primarily because the \"booklet\" included on the setup was written as if nothing ever failed to do as predicted. Not much help troubleshooting when it did NOT respond as the documents expected.I can also say I was losing my patience just trying to find a way to get some assistance on this setup, I finally did find a link that led me to a real contact when I started the process of returning the item. There, I saw a statement that this product came with technical support.I can say that when I did get someone on the phone, he was very pleasant and helpful. He was tolerant of my irritation, and walked me through a number of steps designed to help master the mystery. He, too, indicated that his documentation was not very clear on some things. But, we soldiered through it, only to conclude that my Sanyo TV was simply not compatible with the newer technology of this device.  He said this was true of some other manufacturers' models as well, but I will not poison the well by naming them. It may well be that it applies only to specific models, not the entire line. (Sorry, Sanyo, I am speaking from experience on this one.) I will add that my TV is about 2 years old, and not a terribly \"smart\" model.I can also say that the man I spoke with emailed me a return label immediately, so I could return it without any trouble.And, I can say that I just received notice that my purchase price on this has been refunded.What I cannot say is whether the device itself is one I would have praised or panned. I simply never got the chance. Consequently, I am not going to declare this to be a dud!One last thing, if you do not need all the bells and whistles of this type of streaming device or if you have a technology-challenged TV, I'd recommend a Roku. The \"dumber\" the TV the simpler (cheaper) the model should be. It may be cheap, but it works on my TV.", "verified": true, "helpfulness": "2/2", "author": "SHEILA"}, {"rating": 2.0, "review": "There are major problems with the Amazon Fire TV that render it less useful than a PS3 or Xbox360.- This cannot mirror your desktop from any device except a Kindle Fire.  That means that you can't get any of the functionality from a computer internet browser and have to rely solely on apps and cloud storage.- The app selection is weak, which makes the problem of not mirroring your PC much worse. There is no HBOGO app.  You can purchase HBO shows from amazon but why would you want to purchase show individually when an HBO subscription allows you to watch any show for free?  Forget watching Game of Thrones or any of the amazing shows HBO has made without paying for them all over again.  There is in SEC Network app or many others.The Amazon Fire TV is super fast, looks amazing, incredibly intuitive, has a great interface, the voice feature works almost perfectly and quickly, is small and attractive, the control is simple and great, and ... it can't even bring the content to your screen that an average gaming system brings.  There is really no reason to have it which is incredibly disappointing considering if I could just connect to my desktop and install common sense apps it would be my favorite device in my living room.  Instead, I'm returning it.", "verified": true, "helpfulness": "2/4", "author": "Jesse"}, {"rating": 1.0, "review": "I bought this mainly for use with Netflix, Amazon Prime streaming, and Hulu.  I thought it would be a really cool device and better than using my PS3 or built-in smart TV apps.  The setup is really easy and the device is slick.However, once starting to get going with it during the first several hours of use, it was using way too much bandwidth to download different content in the background that the image quality was low (worse than Netflix on my Wii) and all the streaming video had to rebuffer.  The content was therefore unwatchable.  My ISP isn't super fast (7 mbps), but that is far greater than the minimum connection speed Fire TV told me (during the rebuffering) was needed of 800 kbps.I wanted to love this thing--but it terrible in its current form and I'm sending it back on the same day I got it.  :-(", "verified": true, "helpfulness": "3/4", "author": "C. McColm"}, {"rating": 5.0, "review": "We love it. So easy to set up. Being able to use the control to ask for what we want is awesome.Eliminate a lot ofsearching.", "verified": true, "helpfulness": "0/0", "author": "Agnes"}, {"rating": 5.0, "review": "I was sooooo excited when I received my Amazon Fire TV.  I have been looking for a similar device for some time.  I love that it is easy to set up.  There are also a lot of apps that you can download.  I only wish that they would offer HBO GO and 3ABN.  I am hopeful that this will change.  The speed is great.  I have not have a lot of buffering issues.  I love to be able to binge watch television shows on Hulu plus and Netflix.  The remote operates several games an it is easy to use.  The graphics are okay and it is like having my tablet on my TV. I do wish that there was a separate Prime video library.  I hate having to go into more viewing options to see if it is eligible. I know now that there is a small white slash at the top that indicates that the video is also available on Prime, but it can be hard to see depending on the background of the tile it is on.  I would also like a place for the videos that I ordered to be.  When you go to your videos, it will show the series as opposed to the episode of that series.  I wish that the voice control worked with the apps as well.  I have to warn you that the box and remote are smaller than they appear to be.  The remote really blends into most background.  The only other thing that I wish they would do is add an off button.  The device is constantly in sleep mode so if you accidentally press the remote the Amazon Fire TV will come on.  Over all this device had paid for itself in entertainment value alone with my family.*******Update********I found out that I can mirror my Kindle Fire HDX to my TV through my device.  What does that mean? It means that I can use any of my apps from my Kindle on my Fire TV.  It makes the amount of apps that you can use increase.  I am now able to watch 3ABN and HBO GO on my television.  This is a great work around until they add those apps to the device itself.  I used the Mayday button on my Kindle and they directed me to live help for the Fire TV right on my device.  The gentleman I talked to walked me through the steps to mirror my device.  I love the product even more now than before.", "verified": true, "helpfulness": "1/1", "author": "Cherryreads"}, {"rating": 2.0, "review": "I thought Amazon Fire TV was supposed to be top of the line with new technology?  Why no wireless a/c 5 ghz wifi connection? Now I feel that I'm on Shark Tank............ \"For this alone, I'm out.. \"", "verified": false, "helpfulness": "1/8", "author": "DougA"}, {"rating": 5.0, "review": "The packaging is very good - no problems, all arrived in perfect shape.  Setup was very easy, and everything worked the first time.  Selecting and installing apps was also very easy.  Video and audio performance are excellent.  The remote could not be any simpler to operate.  Overall, everything about this product is 'easy' and 'works as advertised'.I can't think of anything that I don't like...highly recommended.Ron", "verified": true, "helpfulness": "0/0", "author": "RIppolito"}, {"rating": 5.0, "review": "Edit: After months of using the fireTV I must say that it's one of the best investments I've ever done. With the continual additions to the apps section, be it games or not, and additions to the video library I always find myself with something to do. Huge plus being able to watch the History channel, YouTube, and more outside the Amazon's Prime selection.I'm not a huge gamer so the selection I have is great. Some of the games don't work properly on it even though they are compatible but those that do work are enough to keep me satisfied.As for music, well we have our mp3 library, YouTube, Vevo, Pandora and now Spotify. You do need a paid subscription in order to use Spotify so I don't use it but more than enough with the others. Overall it's a great device!Original Review: The video image and sound are great. Games, movies, music... It has everything you can possibly ask for. It even as a photo cloud drive to see your photos as a slide. It's very easy to install and have had no issues with it. I have never had a roku or anything of the like so I have nothing to compare it to but I am highly enjoying it.  Only downside I see at the moment is that I cannot listen to the music I've personally bought from Amazon but I did notice that this feature will be coming soon. I also purchased the game controller and it works great as well. This has even made me stick with Prime as I got another free trial for purchasing it. Kudos to Amazon. I just can't wait for the update to listen to my music as well.", "verified": true, "helpfulness": "0/0", "author": "Josue"}, {"rating": 4.0, "review": "I have plenty of streaming devices so I purchased this with the game controller to get more variety in video games.  I purchased it within a week of it being released so I've been using it a good 2 months.I started using this instead of my more expensive streaming devices (PS3, Wii U), and I really like it!  The form factor is really small so it doesn't take up much space.  The streaming is seamless (although I have had to deregister and register my device a few times because occasionally if something is on prime it defaults to me having to pay so beware of that but deregistering and registering it again works and Amazon is supposedly working on a fix for this bug).  It instantly starts streaming, no buffering on this baby, YAY!  I have used it for Netflix and Amazon Prime; I do not have Hulu Plus.Also, a bonus, which you might laugh at, is the screensaver.  I walked away from my fire TV and came back and the unit had gone into screensaver mode, which is awesome photos of scenic and architecturally interesting places around the world.  I was mesmerized by that so I started watching that for awhile.  I wish they had a little caption that told me where these places are.  A few I've recognized, but with them changing the photo every 5 seconds, with 20 minutes (240 pictures) they had not repeated!  I suggest streaming music and letting the screensaver run at the same time; it's awesome!  I'm at 32 minutes now and still no repeat photos LOL.The 4 stars instead of 5 is for having to deregister and register it over again occasionally.", "verified": true, "helpfulness": "1/2", "author": "Jillybean"}]