[{"rating": 1.0, "review": "I'm a little upset with Amazon right now.. I have been a prime member for several years now and I love the service.. So much that I spent $800 dollars on a new smart tv that includes an Amazon app already on the tv.. And it doesn't work! Amazon says they're working on the problem.. Visio says they're working on the problem.. Hmm now it seems Amazon has been working on this new unit , which explains the problem. Amazon is by passing roku and Visio by creating their own streaming unit. Great move for them , ( the Visio doesn't work with my roku either)but now I have a tv that came in a box that had amazon pictured all over the box!! I'm feeling duped :(", "verified": false, "helpfulness": "16/165", "author": "Regina Herring"}, {"rating": 5.0, "review": "i just got my fire tv i love it, it is very fast loading up i love the voice search and i be glad when they add other apps , i will be ordering another one  this is a up date on the fire tv i been having it for a week now  i still love it people is complaining about a closed ecosytem  well apple tv does to , roku box as have a lot of junk channels u have to pay for them also. i think people need to get over their selfs.people complaing about hbogo fire tv dont have it ,i have comcast and i have a roku box  comcast want let u watch hbogo on the roku. this is one of the best boxes on the market.o by the way i did get me another one.", "verified": true, "helpfulness": "9/10", "author": "Tracy"}, {"rating": 5.0, "review": "This review is to try to offset some of Roku employees that are on here trying to knock this device.The first thing you notice after plugging everything in, is a 3-5 minute demo that you can unfortunately not bypass, even if you know your way around these types of devices. You will only see it once, and then you're good to go. The device is small and beautiful. The remote is better than any other device, including Roku 3, and my WD TV Live.First the PROs:- It's the fastest media streamer, by far. That's not only a good thing if you own one, but it will force Roku and other companies to stop skimping on the hardware, and firmware updating.- The menu is intuitive and easy to maneuver.  You can't move things around yet, but I'm sure they will eventually let you customize your own page.  As of now, the apps (which would be at the top, if I could change it) are at the bottom. Apps are larger and higher resolution than the Roku.- The voice button is amazing. For a first attempt, they almost got it right.  I understand this is a proprietary device, so they will always want you to use Amazon instant video for your viewing. But this option should search for all of your linked accounts, including Hulu, Netflix, etc. I'm not sure that they will ever fix this, because they will lose money and viewers. Even so, it's still a PRO, because it does work well.- Streaming quality - WOW!  Everything I've tried buffers so quickly, that it's almost already at 1080p when it starts playing.  With my Roku, Netflix looks great, but it takes 5-10 seconds to get there. I currently have 100Mbps of internet, so I'm not sure what everyone else goes through, but I can tell you this streams better than Roku. Period.- Overheating and reboots - My Roku 3 cannot handle more than a couple of hours of viewing before it decides that was too many rows of stairs. It gets exhausted, and it has to reset itself. This device is more powerful, and after using it all day today, I can say my Roku 3 will be immediately up for sale, once they add the Time Warner Cable and HBOgo apps.-- PLEX -- Okay, I always blamed my Plex for the long delays on my Roku. With my internet speeds, I could never understand why it was always loading at 1080p settings, regardless of the bitrate. Anyway, I was wrong. It's the device. Not only does the Fire TV have a much better PLEX app (which is beautiful, btw), but everything streams at maximum quality within seconds. No re-loading (buffering) during movie playback. And the movies are in a much nicer grid layout, so I don't have to sift through one row to get to a movie selection.Now the CONS:- Obviously it's still missing some apps. You are crazy if you think HBOgo will go much longer without being added. The same for other apps. They built it, so they WILL come.- Interface - it is nice, but as I stated in the PROs, you can't make changes to it, hopefully just for now. If it stays this way, it will be a little annoying to have to scroll down all the way just to get to my apps.- One major issue that is very upsetting to me, is the fact that they couldn't add two very important things - USB 3.0, and 802.11ac. If Amazon claims they were listening, they would also know that these two things would dramatically improve the user experience.  I haven't plugged my WD 4TB hard to it yet, but it is a 3.0 hard drive. Now it will unfortunately revert to 2.0 speeds.  Don't build a supposedly forward-thinking device with two things that are now considered dated. I have a feeling this was done to make money off the Fire TV 2. Thanks for that.Overall, it is the best device currently available, and they really made the experience fun.  It does make you want to call your cable company and cancel service. Buy it...you will not regret it.", "verified": true, "helpfulness": "312/355", "author": "Juan2three4"}, {"rating": 2.0, "review": "I won't give this one star, because that descriptor says I 'hate it' which isn't the case. Since this product is brand new on the market I thought I'd give it a try. What can I say, I'm a gadget junkie. So for the review:Pros:1. Works well for Amazon Prime and if you're a gamer then you might like this. (I'm not a gamer)2. Well built and interesting concept with voice search which worked fairly well.Cons:1. If you have your own DVD/BluRay collection in digital form and use Plex you're going to be disappointed. The big fail here is DTS and Dolby Digital do not work. Oh, and you have to buy the Plex app for the Fire TV. The UI is not as clean as the Plex UI on Roku.2. Overall experience with FireTV UI is kind of mishmash. It's nicely laid out, BUT it's primary focus is Amazon Media (duh, it's an AMZ product) so unlike the Roku which is relatively media agnostic, all apps appear equal on the Roku, whereas the Fire TV is not.3. HBO Go and Showtime // HBO Go just isn't and Showtime is not available for DirecTV customers. Again, Roku just works.Summary: If you have your own collection of media and use Plex then go Roku 3. Although the FireTV has more memory and a quad core processor, I tend to think that this extra room and power are to make this a good gaming set top box. It's UI is no faster than the Roku 3. Plex works perfectly with DTS and Dolby on Roku. Not so with FireTV (although I suspect this will be rectified shortly).I wanted to really like this box but it's first iteration isn't quite there. It has all the engine under the hood but the software and apps just aren't there yet. If all you want to do is watch Netflix (which worked fine and Dolby was fine) or Amazon video (prime or not) then this is probably a good choice for you, but you can get the same experience with the Roku 3.The differentiator between the Roku 3 and Fire TV is this: The Roku has ear buds that plug into your remote and the Fire TV has voice search. Other than the cons listed above with the Fire TV it just depends on what you expect to get out of this box.I'll keep my ears on re. updates to this device but for me, sorry Amazon, I just returned the device.", "verified": true, "helpfulness": "61/72", "author": "BillyBob"}, {"rating": 2.0, "review": "First, if you're going to release a device designed to be an Amazon sales tool, you should price it appropriately. Second, it doesn't have programming as extensive as Roku, such as Crunchyroll, and it costs more. Maybe next time", "verified": false, "helpfulness": "9/56", "author": "StJim"}, {"rating": 5.0, "review": "I want to know if it would work in south america (PERU)???? I think its really cool and I want to purchase it!!!!", "verified": true, "helpfulness": "3/19", "author": "Ricardo Barrios"}, {"rating": 1.0, "review": "The best video service is vudu, only one offering 1080p video. Any device that won't offer that won't waste time in my home.", "verified": false, "helpfulness": "13/138", "author": "B. Knight \"kanighit\""}, {"rating": 5.0, "review": "Amazon is going to the next level! Amazing little box! Better than expected. Ignore the one starts this product just came out and is not yet complete. Updates should come soon.", "verified": false, "helpfulness": "6/15", "author": "Giovanni Chavez"}, {"rating": 3.0, "review": "Amazon has done some things really right on its new Fire TV to create a great customer experience but has at least three big misses.One really nice things on the Amazon Fire TV is that out of the box its already setup to access your Amazon Prime account--no configuration necessary (assuming you are a Prime member and ordered it online from Amazon). That is a great customer experience: Setup should be easyAlso well thought out is that the on-device help system can trigger an instant phone call back from customer service... no dialing a number, waiting on hold, etc. Again, great customer experience: Great support is brand buildingVoice search seems to do really well at recognizing what you are searching for but choosing which results to display are an area where it falls short. The voice search seems to only display results from Amazon. Even if you are in the Netflix app on the device and use the voice search the results only contain content from Amazon. Amazon is touting search but on Roku you can search in an app (Netflix, Amazon, etc.) or do a universal search to discover which services have the show you are looking for.One of the biggest areas that the Fire TV falls short (especially for a parent of young kids) is displaying free playable content. When I put my kids in front of Netflix whether its on a computer, mobile device or TV, everything they see, they can watch—without asking Dad to purchase it for them. Amazon has lots of content free to Prime members but with lots of other premium content that requires a payment to purchase or rent. The Fire TV has no way to show only content that does not need to be paid for (i.e. Prim, rented and purchased). This will be very confusing to the kids and will lead to lots of purchase requests (which is not what I want when I put a new device in the house). Bad customer experience: Know your audienceAmazon does have have a feature they call Amazon FreeTime that they say \"lets you easily limit screen time and create personalized profiles just for kids.” Unfortunately they also say: “coming soon.”Amazon TV takes Roku’s notion of Channels (Netflix, Amazon, Hulu) and calls them Apps and lumps them in with games. They let you turn off games and apss but not games or apps. So if I don’t want the Fire TV to become a gaming machine I have to also turn off Apps and since Netflix is an App I’d be turning off one of the main reasons for having the machine.The new Amazon TV box is generally a good experience and all of these issues can probably be addressed in a software update… if Amazon wants. The question will be, is Amazon trying to create the best streaming TV box or the best box to sell Amazon content. Time will tell.If you already have a another box there doesn't seem to be a need to switch up to Amazon TV Fire but if you have been thinking of getting a device like this its worthy of consideration. If you have Amazon Prime and not Netflix or want to buy your content a la carte, Fire TV is probably the box to get but if you have a Netflix streaming package the choice is a lot harder.", "verified": true, "helpfulness": "24/28", "author": "Joshua \"-josh\""}, {"rating": 5.0, "review": "Got this today and explored it.Surpass my expectations, great for kids awesome parental controls, now don't have to worry kids downloading stuff they shouldnt. Nice combo of tv and game apps, some nice free stuff too. Roku tried the game portion not too successful, games limited, this has all the other  viewing i need. Prime, Netflix, hulu plus, crackle, you tube,  I think the game controller going to be a must for game players,im glad we have the option for game controller, the whole house is getting Christmas early this year, Amazon did what roku and big fish couldn't. Speed is great, very fast gizmo. After trying this out bought 2more  amazon fire tv and 3 controllers. This gizmo is priced right, and future looks bright for this product. I love the voice activated search, with Roku you had to put in every letter and hand got tired, and this voice search makes looking for something easy.I'm the owner of all the Rokus  that came out, owned many wdtv media players. Finally a gadget that serves all my needs , finally thank you amazon", "verified": true, "helpfulness": "19/23", "author": "Kindle Customer"}]