[{"rating": 5.0, "review": "It's simple and easy to use.The voice command made it a lot easier.", "verified": true, "helpfulness": "0/0", "author": "Carlos A. Ramirez \"CarRam\""}, {"rating": 4.0, "review": "It is great but not having the option to change to Spanish makes it difficult to use product to its full potential and all the movies do not have the subtitle options", "verified": true, "helpfulness": "2/3", "author": "Orestes Gonzalez"}, {"rating": 1.0, "review": "Ok", "verified": false, "helpfulness": "2/20", "author": "Lennox"}, {"rating": 2.0, "review": "Unfortunately I didn't know anything about streaming TV before I purchased this device.  While it seems to work great and it does seem to offer more than the current competition has, it doesn't meet the need that I had in mind which was to watch regular TV without having a cable or satelite bill every month.", "verified": true, "helpfulness": "1/3", "author": "Michael H"}, {"rating": 5.0, "review": "So far it's great. The FTV gets a bit warm if left running for a while, so I hope your setup isn't too cramped. Got two of these for two different rooms. The box is also light enough that you can use some adhesive backed velcro to mount this flush to a wall.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 4.0, "review": "Need sports channels without subscription", "verified": true, "helpfulness": "0/0", "author": "kevan braun"}, {"rating": 5.0, "review": "I love this gadget. The remote will work as a game controller & The voice recognition has worked every time so far.", "verified": true, "helpfulness": "0/0", "author": "CDEvansJr \"CDEvansJr\""}, {"rating": 4.0, "review": "Does everything it claims.  Easy install (one needs the HDMI cable).  Having Amazon Prime service is good.  And you need good fast broadband cable service, which we have at home.  When we are away at remote vacation home, using verizon card, the Fire will not work for us.  Didn't really expect it to work, but we gave it a try.", "verified": true, "helpfulness": "0/0", "author": "momentary lapse \"lapse of reason\""}, {"rating": 4.0, "review": "Overall I love the Fire TV. The only thing not quite perfect is you don't have access to the prime music. It's on the Kindle and Fire Phone so why not Fire TV too? With that addition, I would give it 5 stars.", "verified": true, "helpfulness": "1/1", "author": "Wesley Lamb"}, {"rating": 5.0, "review": "I love this thing!!  It's SO much better than the other streaming devices I've had.  And the remote control is fabulous!!  Way to go Amazon!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}]