[{"rating": 5.0, "review": "Easy to install -- no instructions needed. Easy to connect to your Amazon account. Your video and music library appear magically. The picture is awesome. Lots of apps, lots of games. More coming! (Make sure you buy a good quality HDMI cord to get the most out of Fire.) The remote control is very intuitive. the voice command thing is awesome. The whole thing is intuitive. Now I have all my stuff at my finger tips on my HDTV. I love it! Amazon, you hit it out of the park!", "verified": true, "helpfulness": "1/2", "author": "Book Lover"}, {"rating": 5.0, "review": "Better get it now while it is still rootable. I easily sideloaded the Slingplayer android app, transmission, and XBMC making this device incredible. The only thing that needs improvement is the USB port. If it was USB 3.0 it would be unstoppable. As of now, I can remotely login to my firetv and have it download torrents right to a connected usb hard drive that are immediately ready to play with xbmc. If the root gets patched, people will be willing to pay premium prices for FireTVs with the firmware of today. Don't sleep!", "verified": true, "helpfulness": "2/4", "author": "Paul Bange \"Thirteen Thirty Seven\""}, {"rating": 5.0, "review": "Purchased this hoping to augment my cable and ended up canceling it saving $70 a month! My download speed is 33 mbps and this system works fantastic with zero delay. The content on Prime is impressive, purchase or rent the rest at reasonable prices. Other apps add further value. One comment to Amazon - since I don't watch commercials any longer I have to way to know new programs that are out, or that one of my favorite shows has updated with a new season. There needs to be an update feature, or \"people who watched this also liked\" for TV shows.", "verified": true, "helpfulness": "1/1", "author": "Robert M"}, {"rating": 1.0, "review": "I have not been able to get it to work properly", "verified": true, "helpfulness": "1/5", "author": "Kimberly Marcotte"}, {"rating": 5.0, "review": "Hands down the better device over Roku.  Easy to set-up, just plug in to the wall, then the hdmi to hdmi and turn on the TV, open the input (mine was #2) and you are ready to log in to your Wi-Fi after the intro message from Kindle Fire TV.  I did find a few issues with content as I have HBO and it wanted to charge me for content, then again I would not mind paying for content after I close my Cable account. LOL...  I spent 3 days setting up the Roku in my bedroom, this was a snap and I am ready to take my time adjusting to a different viewing experience. Good job Kindle Fire TV developers!", "verified": true, "helpfulness": "0/0", "author": "J. Reid \"TenFeet2Hands\""}, {"rating": 3.0, "review": "It's ok.  I agree with some of the posts I've read about the gaming but fortunately I don't much care about the gaming.  Why my nephew has to delete one game to play another in 2014 is a head scratcher but whatever.  The device works fine for Netflix and Prime, Hulu etc.  Not as many aps as Roku but the voice search works as well as any I've ever seen.I did not know that I'd be charged a fee to use this if I decided that I didn't want to use Prime but fortunately, considering shipping costs and the new music feature, it's a good value and has saved me plenty already so I'll use Prime instead or in addition to other services like Netflix but Netflix has much more content included with the subscription.  I've got no real problem with Prime except to say that the included content is definately lacking specifically when it comes to movies.Now you can rent the movies and television not included but try and figure out their pricing system for rentals.  Why a fifty year old movie nobody's heard of is a 5.99 rental while a more current popular movie may be 5.99 or 1.99... who knows.  Half hour TV shows rent for 2 dollars an episode?  Search any actor with the voice command and you'll instantly have a vast list of movies you'll have to pay for to see because usually you'll see hardly any that are on Prime.  With so few movies included with prime and their bizarre rental pricing I could see paying hundreds of dollars a month just to watch movies and a few shows I like. I can't be the only person to notice the somewhat deceptive marketing regarding the costs.  I'm not saying give me everything for free but if you're going to have so few movies included for free and considering the ease of access to the content it seems to me Amazon is making a huge mistake in not marketing some kinds of cost effective rental packages.I mean, they have a brilliant business model and I'm willing to bet that our viewing habits information is valuable to them as well, I'm not begrudging them that data to use as they want and to figure out how they can squeeze the most money they can out of the business model they've chosen but I think if they're trying to squeeze me for 200 bucks to watch all the episodes of the Adams Family (50 year old TV) then they can go fly a kite.  I mean, give me an option to watch certain things I'm really into for a reasonable price.  Once you get everyone to do that you'll own the whole world.", "verified": true, "helpfulness": "3/4", "author": "jrhall"}, {"rating": 5.0, "review": "I love it and bought one for my wife for use on the same Prime account, cable and wireless router.  The quality of picture on both simultaneously is unrivaled, and the selections available superb.  My three computers have no problem operating with all of them on together. My wife is enthralled and ecstatic about my gift.  Gift it and wait for your results!", "verified": true, "helpfulness": "0/1", "author": "Calspete"}, {"rating": 3.0, "review": "They need more free prime movies ,netflix has better selection of free movies.easy to setup and use. Had more movies tv shoes I would have given a 5. Renting movies or buying them adds up.", "verified": true, "helpfulness": "2/4", "author": "Zazzy"}, {"rating": 5.0, "review": "Great deal in the bundle; however, I thought I would be able to throw the screen from my Kindle Fire HDX onto the TV.  It doesn't mirror everything on my Kindle, although it does with the videos.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I'm a long time Roku user but I am also deeply immeshed within the Amazon Prime ecosystem.Even when using my Roku 3, I spend well over 90% of the time in Amazon Prime.Netflix is a JOKE!I cancelled my Netflix membership 4-years ago, because they didn't have anything worth watching.Netflix also kept blaming their lack of content on others, instead of owning up to their shortcomings as a company!In the meantime, Amazon is taking over. I just got my Fire TV and the setup time was non-existent.I was using it instantly and I am completely blown away by the speed and sound.I have 7.2 Dolby surround sound via an HDMI pass through! The Amazon Prime and Vevo apps both look and sound fantastic, as the video is vivid and engaging.I really love this device and it will exclusively drive my Amazon content in my home theater. I will still use my Roku 3 for everything else, like Vudu, HBOGO and other content areas that are currently not supported by Fire TV.I highly recommend this device for Amazon content streaming.Amazon has a real WINNER with this streaming box!", "verified": true, "helpfulness": "1/3", "author": "orandy"}]