[{"rating": 1.0, "review": "very poor selection of options.extremely cumbersome way of making selections -- having to type in each letter on a silly keyboard.", "verified": true, "helpfulness": "1/2", "author": "Kenneth G Hurto"}, {"rating": 3.0, "review": "I like it.  Very simple to set up and connect.  However I have \"Amazon Prime\" and it's always promoted to having access to so many movies and tv shows.  However most of them you have to pay for by episode to watch.  That's why it's only receiving 3 stars", "verified": true, "helpfulness": "1/1", "author": "tonyfire \"Tuna\""}, {"rating": 5.0, "review": "All the reviewers that rate the Firetv  or FireTv Stick below 5 stars don't or can't understand the full potential these Amazon android based streaming devices are capable of.  Apple TV, Roku or Chromecast and others lack the ability to add XBMC/KODI on them.  If your not sure what I'm talking about, take the time and learn how to add KODI/XBMC on Firetv/Stick. You will be very pleased you bought these boxes.Go to YouTube and find out all you need to know about KODI on FireTv..", "verified": true, "helpfulness": "0/0", "author": "gerald w burns"}, {"rating": 2.0, "review": "You have to pay for a lot of movies. I wouldn't have purchased it had i known that before hand!", "verified": true, "helpfulness": "0/1", "author": "Jeanie Boggan"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "ZP"}, {"rating": 5.0, "review": "Easy set up. Easy operation. Lots of great choices. The best way to watch movie and more at a great price. No more big dollar cable bills for me.", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Love this and watch everything I could on cable. I turn my cable off and haven't looked back.", "verified": true, "helpfulness": "0/0", "author": "Amy Green ~My Book Obsession~ \"Amy Green\""}, {"rating": 5.0, "review": "Fire tv is the best thing they came up with. I will have this as long as this is around. Please keep this around forever.", "verified": true, "helpfulness": "0/0", "author": "cece"}, {"rating": 5.0, "review": "PS3 was starting to age and have issues, great replacement for those of us who have cut the cable.", "verified": true, "helpfulness": "0/0", "author": "MoSigma"}]