[{"rating": 5.0, "review": "if I keep using this item and keep getting this kind of service I may drop my cable.", "verified": true, "helpfulness": "0/0", "author": "michael armstrong"}, {"rating": 3.0, "review": "I've had issues with the Amazon fire TV going blank if I change the input source from the fire box to something else (cable box) and then go back.  It basically doesn't want to play the movies.  So that is super frustrating.  Other than that, it is a nice interface to all of the amazon content.  Certainly not worth it without prime.  Would probably go with something else if I were to use it with other services.", "verified": true, "helpfulness": "0/0", "author": "Purdue_Al"}, {"rating": 5.0, "review": "Incredibly easy set up. My husband loves the voice remote. I love it, I'm going to get rid of cable. The box was much smaller than I expected, but it is powerful and fast. I love it!", "verified": true, "helpfulness": "1/1", "author": "Corrina Moody"}, {"rating": 3.0, "review": "Although it is very fast and overall quality is good, there are not enough apps. Sure it has the main apps like Netflix, Hulu, etc but sorely missing things like NHL Gamecenter and a few others. Been out over a year and still nowhere close to AppleTV or Roku devices as far as app development. It's like buying a Windows phone instead of Android or iPhone. Not to mention you have to be a prime member to access most of same content as Netflix or Hulu. You still have to rent new releases. For my money, it's Apple or Roku.", "verified": false, "helpfulness": "0/2", "author": "Curtis L. Anderson \"CurtAndy\""}, {"rating": 5.0, "review": "Very nice. It took longer to set up Wifi extender, and that took less than five minutes. I'm hook up to wifi and it connected right away, it came all ready setup with my prime membership so nothing to set up. Speed is very fast as far as going thru the icons no lag time. If you don't here back then there is nothing wrong.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"over 50 gamer\""}, {"rating": 5.0, "review": "Just received my Fire TV.  Replaced a Roku Plus that had a lot of issues.  Setup was a breeze.  I really like the audio search feature.  Seamless install and great picture and audio.  Enabling apps", "verified": true, "helpfulness": "0/0", "author": "jeb1951"}, {"rating": 5.0, "review": "This box is good but it becomes great when you throw in xbmc", "verified": true, "helpfulness": "0/0", "author": "Kilvio"}, {"rating": 5.0, "review": "I've only had it a couple of months, but so far it's great. I'm a prime member so I get a lot of free shows and movies. It doesn't have everything I want to rent; some you have to buy[so I rent on-demand], but I found 2 early 1960's Dr Who movies that nobody's heard of and I was sure I'd never find.", "verified": true, "helpfulness": "0/0", "author": "ncm"}, {"rating": 5.0, "review": "is not worth the money nothing free", "verified": true, "helpfulness": "0/1", "author": "tom"}, {"rating": 5.0, "review": "I've used pretty much every streaming device out there.  Those can not compare.  The fire tv is so fast!  Buy this, subscribe to Amazon Prime and Hulu Plus, download Crackle, and you will never miss cable.", "verified": true, "helpfulness": "0/0", "author": "Thor"}]