[{"rating": 5.0, "review": "This device is great because prior to having this my son was actually hooking up his laptop to the TV to view Netflix so now he doesn't have to do this and the Amazon Fire TV has a lot of great features.", "verified": true, "helpfulness": "0/0", "author": "patricia vanish"}, {"rating": 5.0, "review": "We've tried many streaming devices as we have amazon prime and netflix and don't have cable tv. We also use a media server to stream content. We've tried the xbox which was great but you also have to pay money each year for that service. Roku was slow and crashed constantly, and then you had to re-sign into every single app. Blu-ray players are also very slow. We've had fire tv since it came out and it's by far the best! It's always fast and never has loading issues! The interface is really easy to use as well! And, you can load your pictures on the cloud and have a slideshow play when you're not watching a show! Amazon, great job!!", "verified": true, "helpfulness": "1/1", "author": "n/a"}, {"rating": 4.0, "review": "Pro'sThe UI is blazing fastStreaming from online services is great, Netflix, Hulu, Amazon Prime, etc.ConsMy biggest concern is it cannot connect to my local NAS drive to play my own media. If it could do that it would be the best product on the market.", "verified": true, "helpfulness": "0/0", "author": "Jaime Esper \"jaimeesper\""}, {"rating": 5.0, "review": "What a wonderful device!  With Amazon Prime, the horizon continually expands.  The remote with voice search is a real sweetheart.So glad we purchased the Amazon Fire TV!  Cable, with it's brutal bombardment of commercials is fading in the dust.  Suspect a cord cutting is imminent.", "verified": true, "helpfulness": "1/1", "author": "Ed \"Eagle\""}, {"rating": 2.0, "review": "Amazon Fire is surprisingly a bare-bones streaming media device.  Among the surprises are the lack of access to my Amazon music cloud and the price.  The Roku LT, for example, can be purchased for sixty dollars less than this device and, oddly enough, has an Amazon music cloud app.  Although Amazon promises to offer the music app \"next spring,\" why would I buy the Fire when it denies access to an Amazon app?  The only benefits to the Fire are 1.) better menu than the Roku LT, 2.) ability to have a wired connection, and 3.) YouTube access.  For an additional sixty dollars, though, those three benefits are not worth the price of admission.  Thank you, Amazon, for letting me try the Fire for free for sixty days, but your plan actually backfired, since the not-ready-for-Prime-time device is inferior to the Roku LT.", "verified": true, "helpfulness": "1/3", "author": "H. Mensonge \"Hank Mensonge\""}, {"rating": 1.0, "review": "Bought this to replace my Roku 3.  After several months, I went back.  Whether using Netflix, Youtube, or Amazon to stream content, the video randomly stutters.  The movies I've rented from Amazon to watch were refunded automatically by Amazon as they detected the content was poorly streamed.Same apps run on my Roku without issue despite the Roku being less powerful.", "verified": true, "helpfulness": "3/7", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Still learning how to use but what I see I like. Have already linked my Netflix account to it and looking to add Hulu-Plus. Anything to stop the high TWC fees.", "verified": true, "helpfulness": "1/1", "author": "Wes Huggins"}, {"rating": 4.0, "review": "I'm slowly moving toward cutting the cable in my home and slowly each TV is gaining the capability to stream content.I have a Roku 3 in my home office and my family room TV is a \"smart\" Sony that allows me to connect to all the major content providers. I wanted to connect the master bedroom TV not long after Amazon introduced the Fire so I thought I'd give it a try.  I especially liked that you could search for programs using your voice rather than the slow and clunky process of picking letters with the remote like I have to do with the Roku and the Sony. More on this later.Installation couldn't have been easier. I have it connected to a receiver which then sends the video to the television. It passes through with no problem. Amazon had already initialized the device so it knew my account information and that I was a Prime member.  I also subscribe to Netflix and Hulu + so I had to download their apps to the Fire and sign-in. Easy. Connecting to my home wifi was also painless. A minor nit - when I switch my receiver to the input I'm using for the Fire I'm greeted with a black screen. The Roku 3 has a Roku logo floating across the screen that lets you know you're connected to it. You press the \"home\" button on the remote and you're ready to go. The Fire TV just sits there until you press \"home\". No, not a big deal but a certain member of my family who will remain nameless got confused by it the first few times.I find using it to be pretty straightforward. It's very similar to the Roku 3 and much easier than my Sony TV. But, I have a beef. I'm withholding a star because of the voice search. It works great but it only returns Amazon content which, if you're not careful, could cost you money for something you're already paying for. An example, I used the voice search to find the tv program \"Grimm\".  The Fire found it and displayed the result but it also showed a per episode charge.  Since I've watched Grimm on the Roku and the Sony I knew that I shouldn't be paying for it because Hulu + carries it. That's when I found that the voice search only works for Amazon content and you had to do text searches for other providers.But, and I'll give this product the missing star when this happens, I read that Amazon is working on expanding the voice search to the other providers and some will roll out this summer.  Fire TV is already a worthy competitor to the Roku 3 and, I think, makes buying a Fire TV the better choice with the voice search feature.", "verified": true, "helpfulness": "2/2", "author": "joetagaz \"joetagaz\""}, {"rating": 2.0, "review": "My mom wanted this but we found it was to complicated for her. She didn't understand that amazon prime didn't come with it and rented movies. I had to take her card info of Amazon so she couldn't rent anymore. We finally had to send it back.", "verified": true, "helpfulness": "1/4", "author": "Jean Rippentrop"}, {"rating": 1.0, "review": "i would like to save my emails and passwords for things instead of typing them constantly..and the nonworking flash?  when i called they said its not working yet.  its like buying a  car without tires?  wtf?  who sends out half done s***?as for customer service.  they are the best with american english speaking people thank god.  the apps are okay, but there is not alot available.  and prime free stuff SUCKS TO HIGH HEAVEn with just enough to keep you paying for the membership.  Come on, make it worth my while.  Give me some good movies that arent B C or F rated.  Especially scary ones, did you get that at bad actor training school?As for the fire, i like it.  I think its a nice little gadget.  I would like to see a subscript for hbo and showtime without being a cable subscriber.  That would be nice and i woulld pay for it 14.00 a month per premium sounds fine.  Satellite Direct is actually a better deal at a better price if you want cable tv.  And it would be nice if you could add that onto the amazon fire tv.  i am looking for new programming so i can CUT the cable cord and if we all did so it would force them to lower their obnoxious rates.The device is great for kids, and them gaming.  it turns the tv into a type of basic VERY BASIC android device.  If i could load my content onto it it would be better.  And if i could use it as a dvd player for my netflix rentals.  But it was worth the money.  I will add xbmc on it and go from there.i had problems with sound on some series programming on amazon instant and netflix with no sound working.  Customer service is quick, reliable and understanding for that they deserve a raise and kudos to their service.  Quick call back, kindle mayday and helpful more so than anyone i have ever called.Living in the boonies, I like the music ability on the amazon fire tv.  Just got it yesterday and can stream music since my radio local stations are horrible in my area.  Love that.  And the kids havent used it yet, being out of town.  they will soon i am sure.  The games on our living area main tv is worth the price being lower cost than xbox, wii or any other system on the market.  However the game controller should be 19.99 or included.  I dont buy a device to spend extra money for extras.  The streaming is good and no lag mixed up words or stuff.  So thats a great quality on the fire.  The kindle fire hdx which i will mention has great sound and video quality as well.get the usb working and i will be totally satisfied.  Three days later I cant get hbo go, the choices on apps are horrible and the limited games.  total cost of device with prime (by the way very limited good movies and shows)  and old stuff, and the gaming remote you need for almost ALL the games 250.00 just buy a smart tv.  WOWgot a roku 3 with memory slot and usb that ACTUALLY WORKS TODAY AND NOW.I find more choices, gaming is great even with standard remote with gaming remote only being 29.99I will cancel my prime, thanks to it only being a trail and I can watch hbo go.  the kids are already gaming on it whenthey wouldn't even try on fire tv.So all in all amazon is deceptive waste of time and money and costs extra.roku is already surpassed it at a lot less the price.  save money and time buy roku 3.  FOR SURE.  and I have both.", "verified": false, "helpfulness": "1/3", "author": "Elizabeth"}]