[{"rating": 3.0, "review": "The Netflix and Hulu Plus streaming are horrible. After trying for a couple months, I went back to streaming these services on my ancient Wii. The Prime content streams perfectly, as does some content from other sources (Pandora, PlutoTV & Smithsonian). I'm hoping Amazon will continue adding sources for streaming (Gilad's work outs & the Atheist channel in particular). If Amazon can fix their Netflix & Hulu Plus apps, I'd abandon the Wii completely and spend more time with the Fire but for now, meh.I'm not happy that Amazon's content doesn't have separate categories for their free-to-Prime-members content; pay to own/rent is mixed in with free so you have to check every movie & show you're interested in. Poor choice if they want Fire TV owners using their device exclusively.It was amazingly easy to set up, mostly because I read reviews and ordered the correct cords for HDMI & optical audio so pay attention to exactly HOW you want to connect this to your existing media devices.", "verified": true, "helpfulness": "2/6", "author": "Curious"}, {"rating": 5.0, "review": "My grand children love to watch all their movies.", "verified": true, "helpfulness": "1/1", "author": "mary"}, {"rating": 1.0, "review": "Amazon, I recently bought a Amazon fire tv and it looked great until I realised that the Fire TV doesn't pass through DTS audio and mostly Dolby Digital doesn't pass through either (unless you buy media from Amazon). When is this going to be fixed Amazon, I understand that it's more of a licensing issue? (or lack off) For the people who have local media and want to play in surround sound do not buy this and get a Roku instead. Without surround sound, this device is better used as a drinks coaster.", "verified": false, "helpfulness": "5/11", "author": "Peter Hynes"}, {"rating": 3.0, "review": "Is an OK product. While you might just take a look at the features it offers, it really comes down to quality and not quantity. The only way I can compare this product to the Apple TV is like this:You buy a ford Focus and a Toyota Corolla... When you are at the dealer looking at the cars and choosing features, the Ford kicks the Corollas butt because of all the features and amenities it offers. Two years down the road you realize that you should've bought the Corolla because the Focus s not holding very well.I learned my lesson... that's why I will not recommend this product.Buy quality. Don't just looks at how many toys they are giving you.I also had to toss two out of three Microsoft software operated LAPTOPS in the last three years because of faulty parts and software problems. Three years back I bought an Apple laptop which, it is still working like the first day I bought it. Plus not having to install software for viruses is awesome.", "verified": false, "helpfulness": "1/8", "author": "Mickey A."}, {"rating": 5.0, "review": "The product came in as expected.  I am very pleased with the merchandise.", "verified": true, "helpfulness": "0/1", "author": "Ruso Minnifield \"PrinceHappy2\""}, {"rating": 3.0, "review": "netflix does not work", "verified": false, "helpfulness": "1/4", "author": "Sherry"}, {"rating": 4.0, "review": "Performs as stated. Very easy to use.", "verified": true, "helpfulness": "1/1", "author": "Stephen J Sutton"}, {"rating": 3.0, "review": "This was very easy to install and set up.  It's very easy to navigate also.  The drawback is there aren't that many apps compatible with fire tv as there are on a tablet.  And you still have to have a provider account (dish, direct tv, etc.) For many of the apps... So cancelling my charter account, like I had hoped to do may not be as gratifying.  I'm hoping once this fire tv gets going they will ad more content.  Don't forget to buy an HDMI cord as this does not come with fire tv.", "verified": true, "helpfulness": "1/2", "author": "Summertime1986"}, {"rating": 3.0, "review": "I find it a little confusing to use, but the main reason i gave it a 3, is because you're very limited to what apps you can download, you're actually getting your apps from their cloud program, so you don't have the freedom to download any other apps of your choice. It also freezes often, I belief its this set up is what's causing it.", "verified": true, "helpfulness": "2/4", "author": "George Arce"}, {"rating": 4.0, "review": "We really like the fire tv.  We do not have cable or any other service like that and fire fills the gap quite well.  I do not like having to pay extra for so many features however.  It can get pretty expensive, pretty quick if you use the movie services.  Definition is good and a good bit of selection but no all inclusive.  Now to qualify this, I am a student and I get a student rate which is 1/2 of the regular price.  I think that is a fair price for the service offered and I would not share the same feeling if I paid the full price.  So, as a college student in a college student price it is fair. Normal full price it is not worth the expense.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]