[{"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "Judy Gladden"}, {"rating": 5.0, "review": "works fantastic did everything I wanted to do", "verified": true, "helpfulness": "0/0", "author": "Vincent Gonzales"}, {"rating": 5.0, "review": "Very Impressive.  Makes my TV a very smart TV!", "verified": true, "helpfulness": "0/0", "author": "A. H."}, {"rating": 4.0, "review": "Easy to set up and use. Great image quality .I have noticed the voice search only applies to Amazon prime videos hence my 4 star rating. It would be very helpful if the voice search can be extended toNetflix, Hulu and the other content providers that I am subscribed to and watch via Amazon fire.", "verified": true, "helpfulness": "1/1", "author": "Romulus Apolzan"}, {"rating": 5.0, "review": "I love my Amazon Prime Tv, cheaper than cable, although I am not an avid TV watcher, but I like knowing its there, when I watch movies. ~RomanticScents.com~", "verified": true, "helpfulness": "0/0", "author": "RomanticScentsDotCOM"}, {"rating": 1.0, "review": "It suuuuuucks never again will I buy anything with the word amazon on it roku was so much better", "verified": false, "helpfulness": "3/5", "author": "brandon"}, {"rating": 5.0, "review": "Easy to set up and also easy to operate.", "verified": true, "helpfulness": "0/0", "author": "David J Harris"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "sharon"}, {"rating": 4.0, "review": "Week one, loving it!", "verified": true, "helpfulness": "0/0", "author": "Ben O."}, {"rating": 2.0, "review": "If you are only streaming content from the internet then the Fire TV works great.  If that's all you want it for, though, there are cheaper options that will work just as well.If you have any local content then the Fire TV a bad choice.  Why?  If the internet goes out it bricks the Fire TV.  I found this out the hard way recently when a storm knocked out our internet service for a few days.  The Fire TV refused to load any Apps or Games (with a \"Sorry, X is Unavailable\" message) until the internet came back.  I could not use Plex to stream content locally from my server, I could not play any games, I could not use an AirPlay app to display content from other devices.  The Fire TV was completely and totally useless for anything.Maybe there was some buried menu setting, some trick, or some hack to fool the Fire TV into letting me use local content without the internet.  I neither know nor care - I want my entertainment devices to \"just work\", and the Fire TV simply doesn't.", "verified": true, "helpfulness": "2/3", "author": "KT"}]