[{"rating": 5.0, "review": "It works great and the discount that came from signing up for SlingTV was even better. It sure would be nice if we see HBONOW available on it in the near future.", "verified": true, "helpfulness": "0/0", "author": "Donald J. Coker"}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "Hassan Ali"}, {"rating": 5.0, "review": "Smooth, fast, and lovely!", "verified": true, "helpfulness": "0/0", "author": "Gor"}, {"rating": 5.0, "review": "Fire TV is the best streaming media box I have used. I only wish it had a webbrowser.The picture and sound are awesome. The fire tv box is fast, much faster and a better picture than xbox 360, ps3, and visio smart tv.", "verified": true, "helpfulness": "0/0", "author": "J. Chapman"}, {"rating": 5.0, "review": "Works great easy setup and the entire family is enjoying the programs", "verified": true, "helpfulness": "0/0", "author": "Lynda"}, {"rating": 5.0, "review": "Best streaming device on the market!", "verified": true, "helpfulness": "0/0", "author": "saedy"}, {"rating": 5.0, "review": "Better than expected.", "verified": true, "helpfulness": "0/0", "author": "carlos"}, {"rating": 5.0, "review": "There have been many in depth reviews that can tell you all about the specs of this device and what it does and doesn't do. Here I just want to stress the ease of use. I have this combined with Sling TV and use it for my cable box. This thing works nearly flawlessly. I had one freeze up on the device since I got it hooked up over a week and a half ago and I think it was the app I had running that caused the issue, and not the Fire Box itself. It is very intuitive to use accept for getting it to sleep. I read earlier today that there will be an update soon that will fix this.I also want to mention the Voice Command on it. It does only work with the Prime content, but it works flawlessly just as the interface does. All and all I am very pleased with my new alternative to cable and so is my wallet!!!", "verified": true, "helpfulness": "0/0", "author": "Rick J"}, {"rating": 5.0, "review": "Like it better than my roku", "verified": true, "helpfulness": "0/0", "author": "Robert Porkolab"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Rodney N. Porter \"stringbean\""}]