[{"rating": 5.0, "review": "Purchased this to supplement our OTA antenna when we cut the cable from DirectTV.  We added the Sling Tv app which is a great product for the price of 20.00 per month.  Fire TV is a nice little product and it opens the various apps very quickly and is very user friendly..  The only downside we see right now is the inability to record shows from it.  I understand why but was a great feature with satellite.", "verified": true, "helpfulness": "1/2", "author": "david brubaker"}, {"rating": 5.0, "review": "Really...I must question some of these reviews! Fire TV was easy to install and set up, exactly as the instructions say. Easily and instantly connected to our home network.  It does everything as advertised and was easy to learn. Gives us access to all of our Prime movies and Prime music playlists in our home entertainment center. Can be controlled and mirrored with our iPhones.  C'mon man! If you can't figure this out, there is nothing easier.  Met all expectations and for $99 it's definitely 5-star rating!", "verified": true, "helpfulness": "2/2", "author": "M. Palmer \"Write On\""}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/2", "author": "Dennis Morgan"}, {"rating": 5.0, "review": "im hooked in these devices (i have apple TV and amzn fire)1 thing id note is that Fire's interface for netflix & hulu is better than Apple IMHO", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The worst! A streaming device that does not stream! Half of the selections fail out right or you wait and wait for maybe, it eventually to start and stutter. What they offer you to pay at every turn and sit and wait for. Stick with Roku. Amazon is good at some things but streaming? Not by a long shot.", "verified": true, "helpfulness": "2/6", "author": "Michael A. Henderson \"michael\""}, {"rating": 3.0, "review": "I have been looking for a simple device for years that would let me leave Directv. We now have Fire TV on 3 TV's, and did cut the cord. The units are very easy to set up, essentially just putting in your router password, and off you go. The only thing we had trouble with were the 3rd party interfaces that let you use older TV's before a HDMI connection. Order the exact same converter and one worked and 2 did not. Prime programming led us in short order to get Netflix. I find Amazon's programming to be limited and difficult to find content unless you know exactly whst you are looking for. Netfix does not nickel and dime you with wanting to charge you to get something in HD, which we do not care about anyway. We have made 2 changes in 20 years in our entertainment provider, if they want to keep customers like us, they will need to do two things. Provide more A level content, and I can't stress this enough, if these new \" commercials\"  for Amazon products and content, you have inserted, in a non volume controlled manner, blaring in my ear, I will head elesewhere! If I wanted commercials I would have stuck with broadcast TV.", "verified": true, "helpfulness": "3/4", "author": "Christopher D."}, {"rating": 4.0, "review": "it is simple to use and voice command works as advertised.  I listened to music one nite and movies another.  Just started a tv series and have had not issues with streaming.  I wish there were more newer movies to pick from that were prime eligible.", "verified": true, "helpfulness": "0/1", "author": "M.K. \"M&M;\""}, {"rating": 4.0, "review": "took awhile to get it working right......but ok now", "verified": true, "helpfulness": "0/1", "author": "Sby"}, {"rating": 4.0, "review": "Easy to use...just plug and play. I'd definitely recommend it to those looking for a streaming option.", "verified": true, "helpfulness": "0/0", "author": "chammeek"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/1", "author": "Christopher L Campbell"}]