[{"rating": 1.0, "review": "Got my package in THREE business days even though guaranteed 2 day shipping with prime. Set up the fire tv box and went through the tutorial just fine. Watched Hulu plus for about an hour. Turned the tv off and when trying to use Amazon fire tv later that night it did not work. I am on day three of trying to make it turn on and No luck!!!! Either I have a faulty device or faulty power cord for the device. I am so disappointed. This was a gift for my husband and he didn't even get to use it before it crapped out ! Never buying Amazon crap again if it's not gonna work after one time use !", "verified": true, "helpfulness": "4/6", "author": "Elsy R Blanco"}, {"rating": 5.0, "review": "Plex server gets lost sometimes, but overall a good buy.", "verified": true, "helpfulness": "0/0", "author": "K. Howland"}, {"rating": 5.0, "review": "Cool! Picks up on your voice with ease. Say the name of the movie and it pulls it up. Love it!", "verified": true, "helpfulness": "0/0", "author": "leon hicks"}, {"rating": 2.0, "review": "KEEP YOUR MONEY. IF YOU HAVE A WII, STICK WITH IT. THE WII IS BETTER .", "verified": true, "helpfulness": "0/0", "author": "shelly"}, {"rating": 5.0, "review": "I love it but I am still getting used to the features and all. our kids gave it to us as a gift for Christmas. After seeing the results we cancelled cable TV.", "verified": true, "helpfulness": "0/0", "author": "robin clark"}, {"rating": 5.0, "review": "Finally, you can cut the cable.  Fire TV is the best!", "verified": true, "helpfulness": "0/1", "author": "Rick Savage"}, {"rating": 5.0, "review": "I love this little black box. It does everything I wanted and makes watching my Prime movies and TV shows a breeze. I have another streaming device which I also love but it does not have the Amazon app and even after years of begging by their customers, including me, to add it, they have not. So now I'm switching between that other little black box and the Amazon Fire TV depending on what I want to watch. The only thing I wish it had was a browser to go online with. I will email them and ask. Other than that I am very happy with it.", "verified": true, "helpfulness": "0/1", "author": "Lexxie"}, {"rating": 5.0, "review": "Good buy!", "verified": true, "helpfulness": "0/1", "author": "Tina doyle"}, {"rating": 5.0, "review": "Better buy than the Stick, because it includes the voice recognition remote and some features not available on the Stick.", "verified": true, "helpfulness": "0/0", "author": "Son of Soren"}, {"rating": 5.0, "review": "Best thing I've received.  Love it.", "verified": true, "helpfulness": "0/1", "author": "Fran"}]