[{"rating": 5.0, "review": "I use Amazon Fire TV to replace my Apple TV.  Faster speed. More service and love the voice command. Great design. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Gadget Hunter \"Shane Kuo\""}, {"rating": 4.0, "review": "The Fire TV is a great buy if your in the market for high speed processing device. Video playback, depending on your connection, comes in very clear. HD quality for sure. The user interface is all amazon, which I'm not very fond of. Its easy to navigate but I wish it were more customizable. Developer option allows for other third party add-ons witch is great. Over all I like it and would recommend it.", "verified": true, "helpfulness": "1/1", "author": "Kenny"}, {"rating": 4.0, "review": "There's a lot to like about this product - the performance is superb, the design is great, and the voice input for searching is clever (though ultimately somewhat useless to me until Netflix is included later this year).Why dock one star? I want a headphone jack in the remote like my Roku 3. That is THE killer feature for it in my opinion - it's a wonderful option for parents of small kids. Until the Amazon Fire TV adds that, I can't use it as my primary player. It seems like Roku has given up on stand-alone players (it's been 14+ months since the Roku 3 was released) so I hope Amazon eventually adds this feature.This is a great v1 product that I look forward to watching evolve.", "verified": true, "helpfulness": "0/0", "author": "Jason Dunn"}, {"rating": 5.0, "review": "We bought the Amazon Fire TV because we do not have cable TV but like to watch movies and plan on using our prime membership to stream them or Netflix.  It came within 2 days and we had it installed in minutes - up and running.  We are not tech type people at all.  We are 2 grandparents around 60 and we were able to do this without having to call our kids to come set it up.  It works great, it's fast and very easy to use.", "verified": true, "helpfulness": "3/3", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love the fire TV.  It is fast and easy to navigate.  It stays where I left it, so that when I want to watch again it picks up right where I left off with a push of a button.  I have it on the upstairs TV and when I pause it to go downstairs, I can pick up my tablet or phone and keep right on watching what I was watching.  I will never have cable again!", "verified": true, "helpfulness": "3/3", "author": "eb71"}, {"rating": 5.0, "review": "Works fine and quality is very good as everyone has mention on the other reviews.", "verified": true, "helpfulness": "1/1", "author": "Manuel G. Raggi"}, {"rating": 2.0, "review": "The interface is reasonably fast but the Netflix app is very far out of date and even though it has a USB port, you can't plug in a USB drive and play your own content (mpeg, avi, mp4, etc.) which is ridiculous. I guess Amazon would rather force you to buy content from them. If I had it to do over again, I would just get a Roku.", "verified": true, "helpfulness": "1/1", "author": "jacko"}, {"rating": 5.0, "review": "Once you root it and put XBMC on it, it's a wonderful device.  Beware, however, that the newer firmwares are cannot be rooted and you won't know until it arrives.  Nowadays I would spring for the Google Nexus Play which doesn't have as many software limitations baked into the OS.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 4.0, "review": "I haven't been able to use it much since I don't have internet on it. I managed to get it for $65, a steal I might add. What little I have messed with it at my parents house has made me really excited to use it. I even bought a Kindle the other day, just because I can't wait to see the Kindle Fire HDX-Fire TV integration and how well the work together. Also, the Spotify app is quite cool. Pretty much allows you to turn your TV into a bluetooth speaker…Which is cool, but really worth it if you have speakers that provide great sound.", "verified": true, "helpfulness": "0/0", "author": "Hunter C."}, {"rating": 3.0, "review": "I want to like the Amazon Fire TV more than I do.  The software support has not been great.  For instance, it still doesn't support 5.1 sound in Plex TV for Amazon Fire, something all of its competitors do with no problem.  This has potential and the high power hardware (quad core processor, etc) to succeed, Amazon just needs to push the software support to beat Roku, etc.", "verified": true, "helpfulness": "2/2", "author": "Nick P."}]