[{"rating": 3.0, "review": "Only 2 star because it doesn't support hardware level mpeg2 decoding.. hopefully they will enable this feature. Like rest of the android community is doing with Nexus Player \"M\". Once they enable mpeg2 hardware decoding this product is 5/5.", "verified": true, "helpfulness": "0/0", "author": "Maitreya \"Maitreya\""}, {"rating": 5.0, "review": "Easy set up and personalized directions.", "verified": true, "helpfulness": "0/0", "author": "Nicci"}, {"rating": 5.0, "review": "We decided to do away with cable. This is the perfect solution to being able to stream shows through all the available subscription services. It makes watching to shows and listening to music a breeze!", "verified": true, "helpfulness": "0/0", "author": "Leslie"}, {"rating": 5.0, "review": "Great if you have an Amazon account.", "verified": true, "helpfulness": "0/0", "author": "Paul Bradley"}, {"rating": 3.0, "review": "I bought the Amazon Fire TV before a Roku 3. On specs alone, Fire TV seemed like a winner. But I should have listened to my friends.Fire TV is nice. It's compact and slick looking and it's easy to hook up and get going. But....there are a few important BUTs. Firstly, the voice search is limited to Amazon Prime ONLY (the Roku 3 also has voice search and it looks into EVERY streaming option to find what you're looking for). The UI on Fire TV is pretty and fancy looking, but it's difficult and counter-intuitive to navigation: there is a lot of scroll up/down looking for apps. Also, the apps automatically line up according to the most recent use (vs the Roku 3, where you can arrange apps in the order you want them to appear).Fire TV also has limited apps. It's only recently that they got HBO Go, whereas the Roku 3....you can download 100s of FREE channels that are \"private\" but where you can find loads of free streaming films or tv shows (just Google \"Roku 3 private channels\" and there are many websites that list the most current new channels/apps). Amazon Fire TV? No such thing. You're limited to what they allow you to have, which leaves very few options.One other issue that completely put me off Fire TV: I was recently watching a tv series and was on the finale episode. It wouldn't load on Fire TV. I tried and tried, it kept saying, \"We're sorry, cannot connect at this time.\" Excuse you? I disconnected/reconnected, unplugged/replugged...and nada.Unplugged it and plugged in the Roku 3 and the episode loaded, no problem. Went back to Fire TV...problem loading. Back to Roku 3, no problem again. Just checking to make sure I wasn't just imagining things or unfairly blaming Fire TV, but no. The issue was with the Fire TV, not the program (which was on Showtime Anytime). I'm not sure what in the Fire TV was having issues connecting, but I haven't had that problem with the Roku 3 at all yet.At this point, I'll be selling my $99 Fire TV and replacing it with a second Roku 3 (the actual box, not stick, which is slower) for my living room. I kind of love Roku 3. Amazon Fire TV? Lots of flash, some dash, but not enough substance.Plus, Amazon Prime is a rip-off, mirror of Netflix, except on top of paying $99/year, you also get the joy of paying for per episode in many instances. Why would I choose you, Amazon Prime/Fire TV over all-inclusive content on Netflix and my zippy Roku 3? I wouldn't. Oh, but you have 100s of games when compared to Roku 3? BIG DEAL. I want the free tv/film streaming options; I have an Xbox for gaming.Major buyer's remorse here.Goodbye Fire TV. Hellooo, my second Roku 3.", "verified": true, "helpfulness": "3/3", "author": "Dorian M."}, {"rating": 5.0, "review": "Loooooove it! Just get it... you wont be disappointed.", "verified": true, "helpfulness": "0/1", "author": "D. Shultz"}, {"rating": 5.0, "review": "I've had it about 2 weeks and I love it. It helps when there's nothing on, you can always find something on fire with prime.", "verified": true, "helpfulness": "0/1", "author": "Deborah A. Abrams \"ravenous reader\""}, {"rating": 5.0, "review": "Absolutely LOVE our Fire Tv!!! I would recommend this product to every one! It has home beyond put expectations!", "verified": true, "helpfulness": "0/1", "author": "Keri Wickersham"}, {"rating": 4.0, "review": "I've been quite happy and impressed with my Fire TV.  The video quality is nice and the overall options offered are pretty solid.  My only complaint is the lack of customization available within the UI but it's more of a personal thing than a functional issue.", "verified": true, "helpfulness": "0/0", "author": "Drake Cox"}, {"rating": 4.0, "review": "My only complaint is that I can't seem to adjust the text size. I have a small TV across the room from me and it's very difficult to read the white-on-black text. I have 20/20 vision. I know a larger TV with 1080p would drastically improve legibility but an option to turn on larger text would be nice for those of us with older equipment.", "verified": true, "helpfulness": "0/0", "author": "Geoff Thibeau"}]