[{"rating": 5.0, "review": "Very good!  We have 3 Chromcasters, and this works soooooo much better.  It also includes Netflix and other apps that we use.", "verified": true, "helpfulness": "0/0", "author": "mico8143"}, {"rating": 4.0, "review": "We do like it, but you should send a booklet to explain how to use it.  Even my cell phone has an instruction booklet.  It is hard to learn the ways to use the thing without  a booklet.  Perhaps I am not like other people, I need to be able to read the instructions not just watch a video.Carolyn Estepp", "verified": true, "helpfulness": "0/0", "author": "Carolyn"}, {"rating": 5.0, "review": "works very well, easy to setup, after you buy an hdmi cable.", "verified": true, "helpfulness": "0/0", "author": "D. Pritchard"}, {"rating": 2.0, "review": "It skips and freezes a ton. Very frustrating", "verified": true, "helpfulness": "0/0", "author": "Katherine Becker"}, {"rating": 5.0, "review": "It was a wonderful gift from our children.", "verified": true, "helpfulness": "0/0", "author": "MK"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Paul Dugan"}, {"rating": 4.0, "review": "It worked as expected. I own 2 Rokus and I am seriously thinking about going with just the Amazon Fire TV for all of my TV's.", "verified": true, "helpfulness": "0/0", "author": "Judy Hunt"}, {"rating": 3.0, "review": "I have a Roku and i bought this for a different tv. The main reason i got this is for gaming. The apps are pretty much the same as the Roku. Roku has amazon music and amazon video but its not as polished as the Amazon Fire TV version. The games are many and that was the reason i got the Amazon Fire TV. How ever some games are so big I had to uninstall them because it took up too much space. The 8gb storage is  not enough! I currently have about 5 games small games. Large games like Asphalt and Grand Theft Auto are not an option for me, they are too big. The game controller works fine but its a bit over priced. So if you want this for music and video it is fine but if you want it for gaming go with some android box or something else the storage isn't big enough.", "verified": true, "helpfulness": "0/0", "author": "JAIME SOLORIO"}, {"rating": 5.0, "review": "it works great and was easy to set up and work with", "verified": true, "helpfulness": "0/0", "author": "jerry pease"}, {"rating": 5.0, "review": "It's nice to be able to watch episodes of TV series that I missed, and it's all commercial free.  It's simple to use.  It's a great alternative to watching cable TV which has an amazing array of nothing good to watch.", "verified": true, "helpfulness": "0/0", "author": "retsteno"}]