[{"rating": 5.0, "review": "This little device is a cute and inexpensive way to enjoy free movies all day long,and if you wanna pay you can get latest releases.I  have had only one problem I can't get enough.", "verified": false, "helpfulness": "3/3", "author": "Elizabeth"}, {"rating": 5.0, "review": "I've had it for a week now and am very happy with it.  My wife and teenage kids are pretty impressed with it and I got rid of my ridiculous cable bill so I highly recommend it.", "verified": true, "helpfulness": "1/1", "author": "Louis P. Joseph"}, {"rating": 5.0, "review": "I have had this for only a couple of days but in comparing it to the WD HDTV plus it is far superior.  Very easy to set up, basically just plug it in and play!The interface is a little different but a bit more intuitive than the WD.  It is also much faster.  I like the ability to watch from Prime as well.  I never really got to take advantage of that feature before.All in all, this is a great buy!", "verified": true, "helpfulness": "0/0", "author": "Conley Nichols"}, {"rating": 5.0, "review": "Great, and I buy all the new content box's.  Just 1 suggestion, can you make the remote with buttons that light up so I can see them in the dark.  Unplugged my Google TV devises, all 4.  Probably will get rid of my daughters RUKU as well once she tries the Amazon Fire.  Amazon has out smarted the pack and clearly has been out executing them over the last 1-2 years. I even bought 2 of their HD Kindle Fire tablets, no more new iPads at $750 + per shot and I will order their phone and finally be free of apple, well almost,  the Air MacBook's will stay. I have not been drinking the Amazon Kool-Aid, I am in the tech business and follow this space very closely.  Still can't get the kids to try the game controllers, they will hold onto their X Box One control pads until you pry their cold dead fingers away.  These things are a no brainer, Netflix integration is the best out there, it is seamless.  It works with all my Showtime, HBO etc., subscriptions.  I have full blown,  fully configured,  desktop gamming PC's driving each smart TV in the house. This is the first time I think I can actually do without some of the PC's and the private cloud I have installed.  I have a 5ghz wireless network with 4 wired AP's so I have strong high speed coverage, I don't know how well this devise performs if your wireless is spotty but best to run a CAT 6 if you can.  I don't work for Amazon, never have.", "verified": true, "helpfulness": "2/3", "author": "Gene Lederer"}, {"rating": 4.0, "review": "Had several issues wherein the screen was just gray even though I tried resetting it and re-connecting wires.. voice search is very responsive and mostly accurate, but should include other libraries, such as Netflix.  Overall, was a very good buy.. decided to keep it after the free trial because of the games and ease of use compared to other devices.  Will definitely recommend to family and friends!", "verified": true, "helpfulness": "0/0", "author": "Maria O."}, {"rating": 2.0, "review": "Unit works great, especially the voice command feature.  My problem is with the Amazon library - most of the content is not covered by Prime and prompts you to purchase or rent content.", "verified": true, "helpfulness": "11/12", "author": "Dustin"}, {"rating": 5.0, "review": "This is the best streaming system I bought. I've had it for awhile and have'nt even got through all  of the folders & apps yet. Alot of stuuff. Wont get bored for along time or run out of material to view.", "verified": true, "helpfulness": "1/1", "author": "Billspann"}, {"rating": 4.0, "review": "Well here is my review! I received my package and opened up the box. Well the package that amazon delivered the item in was packed excellent and can pretty much sum it up that you will get your item safely (well packaged amazon (:  ).So I opened up the shipping box and took out the Amazon Fire TV and It consisted of a remote, plug adapters, manual, and Fire TV.  I firstly connected the power cord then attached the HDMI cable. Once I made all the connections. I turned on my TV and Amazon Fire TV and wuala it was connected. I logged in my Netflix and I started to watch my Episodes of The Walking Dead and Breaking Bad. The Amazon Fire TV is really convenient and awesome. I would like to see the remote compatible with a universal remote. Having that extra remote causes some confusion since all my devices are controlled by one remote. Other than the remote issue everything else is superb!", "verified": true, "helpfulness": "0/0", "author": "CVREV \"Clear View Review\""}, {"rating": 5.0, "review": "Its a bit of stretch but I think in the next 20-30 years almost all movies and shows bought will be via digital download and the Kindle fire shows that.  Its easy to use easy to set up and there is an almost endless variety of movies and tv shows out there.  I think it would be nice if they expand their library on the fire of movies and even old games like the sega genesis or playstation 1", "verified": true, "helpfulness": "2/2", "author": "Adam Scarborough"}, {"rating": 3.0, "review": "Like how it loads faster than my Roku, and the voice activation.  We put it in our bedroom where the tv is 22\", which makes the writing to small to read, especially if we are in bed with our glasses off. WE accidentally clicked on a movie that we were charged for because we didn't realize it.  We immediately clicked off of it, but was still charged, We never had this problem with the Roku, because we can see the writing well enough to read it. we still use the Roku on our main tv because it has more channels with old classics, which we prefer.", "verified": true, "helpfulness": "0/0", "author": "grumpy"}]