[{"rating": 4.0, "review": "Remote control to simplified. If you planning to buy game controller, don't do that, games are phone-like - poorly designed and you will waste your money for that accessory. I'm unable to activate showtime, it simply has no Amazon Fire TV in their list of providers. Pretty much restricted and everything for additional charges, even with prime membership. That's frustrating. In general the device is well designed and powerful.", "verified": true, "helpfulness": "0/0", "author": "Victor"}, {"rating": 3.0, "review": "I love amazon prime But Roku has a easier more friendly format to navigate.PROS:It is Fast! Almost no waiting for a show to load.The Voice search is awesome With this feature and its accuracy you should never have to use an onscreen keyboard again.Easy to buy or rent anything, It's to easy please read the Cons list about this.CONS:On the home screen they offer you many options and recommendations for only amazon content. Its hard to navigate to find competitive channels like Netflix, Crackle, PBS kids,  ect... . My Roku 3 was easier to navigate and played friendly with all channels, I even liked the amazon prime on the Roku better. It didn't try to sell me anything it showed me the free content first, thats why I pay for my prime membership.Once inside a \"Show or movie\" they give you many options to buy it whether its free or not. The layout is confusing my first day I couldn't find how to play a free movie but they offered for me to buy it and save it. Example my 5yo son accidentally purchased 5 programs because he clicked \"Buy episode\" link directly below a picture of a FREE the program. Why would they give a Free kids program an option to buy if its free, With prime I have unlimited access to watching it FREE! Amazons solution is to sell me another subscription for kid friendly free content called \"Free Time\" for an extra $3 month (looks similar to roku), or set up the parental controls with pin numbers. :/I would wait a year till amazon straightens out the software, but I would highly recommend the roku 3 I still have it and prefer to use that one!", "verified": true, "helpfulness": "1/2", "author": "J. Burton"}, {"rating": 5.0, "review": "Do not like writing reviews but will take a moment out to tell that after having multiple Roku's and nothing but issues, the Amazon fire tv box is the best, have no issues with it, never drops the sound like Roku. I wish that I bought this a long time ago. Goodbye Roku.", "verified": true, "helpfulness": "2/2", "author": "E. J Mazzi \"Eric J Mazzi\""}, {"rating": 5.0, "review": "Excllent serivce got product right away", "verified": true, "helpfulness": "1/2", "author": "Phillip Lui"}, {"rating": 5.0, "review": "In my opinion this is the best and well priced media player to date. Specially when combined with SPMC/XBMC.Would have liked it if the Ethernet was a Gig port and the wireless was AC. Besides that no other issues so far.", "verified": true, "helpfulness": "2/2", "author": "ASadani \"Navigates\""}, {"rating": 5.0, "review": "The Amazon Fire has made our streaming experience so much better.  Before we were using our Wii and it was working okay, but now I feel as if I am working a TV remote (well almost).  I'm so glad we switched especially since we don't have regular TV (cable) and the interface is so much nicer than using our Wii too.", "verified": true, "helpfulness": "0/0", "author": "Tennille F."}, {"rating": 3.0, "review": "it's oky but my old tv doesn't use usb cable.", "verified": true, "helpfulness": "0/1", "author": "Aout"}, {"rating": 5.0, "review": "LOVE IT!  Needs more compatible apps for viewing shows that aren't available on amazon Prime.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer \"Aaron Christopher\""}, {"rating": 2.0, "review": "Simply does not work for more than 3 minutes if you are 2.5mbps or slower dsl.", "verified": true, "helpfulness": "0/1", "author": "Steve K"}, {"rating": 5.0, "review": "I hardly write reviews, but this Amazon Fire TV is so good I just had to, I have my Kindle Fire HD, and I had it for a while now, and I love it, so not to long ago my daughter in law bought me the Roku Stick, I like it very much, but it will freeze and the Stick got too hot, so I got Amazon Fire TV, unbelievable how this one looks, and they give you the Prime Membership one month free I  like it also so I am getting that one too, they have so many games, they have tons of free channels free, I will not pay cable again!Thank You Amazon, I really like this!", "verified": true, "helpfulness": "3/3", "author": "Nancy Rojas"}]