[{"rating": 5.0, "review": "Easy to install.  Easy to use.  Not a lot of free movies but I like it.", "verified": true, "helpfulness": "0/0", "author": "NYreviewer"}, {"rating": 5.0, "review": "Love! Very easy setup! If you can plug a cord into an electrical outlet then you can do this setup! I love how Amazon Prime Video is accessible!I'm loving all the movie and TV series choices. Just watched 5 seasons of a Canadian TV series. Registered with Netflix, HBOGo and ESPN. I love not having a $200 a month cable bill!", "verified": true, "helpfulness": "1/1", "author": "Book Princess \"Books Alive\""}, {"rating": 5.0, "review": "This product is extremely easy to install.  It is also very user friendly to operate.  So much so that after having it on my theater TV for a couple of months, I went out and bought another one for the family room TV to replace the Apple TV which was horrible.  I am pleased every time I use it and we use it often now.  My wife had said she would probably never watch TV again if anything happened to me because she had no clue how to go through all the motions to get Apple TV to work.  She love the Amazon Fire TV and turns it on without a problem now.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome... love Amazon", "verified": true, "helpfulness": "0/0", "author": "Herbert J Saxon"}, {"rating": 5.0, "review": "Love this box!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "rlope777"}, {"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "kermit severson"}, {"rating": 5.0, "review": "It will be better with air mouse and keyboard", "verified": true, "helpfulness": "0/0", "author": "Alexander F."}, {"rating": 5.0, "review": "Just what I needed", "verified": true, "helpfulness": "0/0", "author": "Chuck Missler"}, {"rating": 5.0, "review": "I was pleased at how easy it was to set up!  Still getting the hang of using it but so far we are very happy with it.", "verified": true, "helpfulness": "0/0", "author": "melwest"}, {"rating": 2.0, "review": "Returned item.  We purchased the Fire Stick and the Fire TV.  The Fire Stick works perfectly.  No issues.  The Fire TV would not stay connected to the internet.  We called customer service and were  last told they would call us back in 24 - 48 hours.  That was 6 days ago and they have never called.  The agents we spoke with prior to that didn't seem to know anything about the Fire TV.  I am not sure they were even in this country.  We finally decided to return the box and will just use the Fire Stick.  It does everything we need and it works.  We have not had any issues with the Stick.", "verified": true, "helpfulness": "1/2", "author": "chergess"}]