[{"rating": 5.0, "review": "Haven't used it much but it seems to work as advertised.", "verified": true, "helpfulness": "0/0", "author": "MDW in VA"}, {"rating": 5.0, "review": "I bought Fire TV for my husband for Father's Day and combined with my existing Prime membership, it's already paid for itself. Yes, you have to do a little hunting on the computer to find the freebie series, but once you add them to your watchlist they stay there until you are ready to watch. Gave us plenty of entertainment during the hot, humid days.", "verified": true, "helpfulness": "0/0", "author": "Jennifer L. Hart"}, {"rating": 2.0, "review": "I like the idea of the fire TV. When it isn't lagging like crazy (which happens to be most of the time), it makes things like watching Netflix, Amazon Prime, and YouTube a lot easier. Sadly, however, it DOES lag like crazy, so after owning this for only a couple months, we've gone back to solely watching video on our PS3, which is using the same wireless connection as the Fire TV. The only difference . . . no lag on the PS3.Don't waste your money like I did.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Bob Brown"}, {"rating": 3.0, "review": "user friendly .. fine for watching Netflix,  not much useful to me otherwise..", "verified": true, "helpfulness": "0/4", "author": "Frank Pierre Calvi"}, {"rating": 5.0, "review": "I have both Apple TV and now the Amazon Fire. My whole family prefers the ease of use and many more options of the Amazon Fire TV System. Will be purchasing additional units for other TV's in the house.", "verified": true, "helpfulness": "1/1", "author": "Todd Fetzner"}, {"rating": 1.0, "review": "Most everything I would like to watch is an upcharge. Also portal to netflix jittery, not the case when I used my DVD player as a portal", "verified": true, "helpfulness": "2/7", "author": "Richard Stafford"}, {"rating": 5.0, "review": "easy to use. love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to set up and use.  Great way to eliminate those monthly cable box bills. You can even \"throw\" shows from a Fire HDX app onto your television.", "verified": true, "helpfulness": "0/0", "author": "Dr. R"}, {"rating": 4.0, "review": "Love it so far, but I wish it had the HBO GO app.", "verified": true, "helpfulness": "0/0", "author": "Ann May"}]