[{"rating": 3.0, "review": "No one told me that you had to have WiFi. Sad.", "verified": true, "helpfulness": "0/1", "author": "Allison Harrison"}, {"rating": 5.0, "review": "Works Great!!! Watching HBO and many others. The only thing in which I believe will be coming out in the future is the a-la-carta' subscription (picking only the channels you want) not how it is today 100 channels you do not want to watch and requires an active cable or satellite subscription.", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 4.0, "review": "Other than being entirely trapped in the world of Amazon, it is a very good product.", "verified": true, "helpfulness": "0/1", "author": "MJ"}, {"rating": 5.0, "review": "Contains a variety of useful apps. Netflix is very easy to access.", "verified": true, "helpfulness": "0/0", "author": "ashlee"}, {"rating": 4.0, "review": "Great product. I'll be able to cancel most of my cable with the options it offers. Had a little problem with the set up. Sometimes I have to reboot it to get sound. But otherwise it's great.", "verified": true, "helpfulness": "0/0", "author": "Guy Pellitteri"}, {"rating": 4.0, "review": "It is a great device!  I'm pretty well hooked into Amazon so this device works great for me.I will say if you have Vudu or other files on a hard drive that wont display or audio on this device, you're stuck using your computer...no big deal for me but it might be for you.I will say the navigation is super easy....finding what you want is all there for ease of use.I converted from Ruku to this....and am very happy with my change.One thing I have found is it will hog your internet connection....I do not currently have a large throughput and when my Wi U turns on for an update, my Fire Tv doesnt like it and will take a significant amount of time to catch up.I have had to reboot mine a couple times due to this....the answer/solution is to NOT use Wifi connection to your router...instead, use a wired connection.  That solves the issue.Overall,  I highly recommend this device.", "verified": true, "helpfulness": "0/0", "author": "Zippy"}, {"rating": 5.0, "review": "Product is great!!!", "verified": true, "helpfulness": "0/0", "author": "Adam Gibbs"}, {"rating": 5.0, "review": "Everything they advertised, no streaming problems, great video, use it all the time. Easy to install, easy to navigate.", "verified": true, "helpfulness": "1/1", "author": "James Orlando"}, {"rating": 5.0, "review": "very good love all the choices", "verified": false, "helpfulness": "1/1", "author": "Shannon T."}, {"rating": 5.0, "review": "So easy to hook up and find a wide variety of things to watch. Wish I had this years ago.", "verified": true, "helpfulness": "0/0", "author": "Buttercup \"kitten foster\""}]