[{"rating": 5.0, "review": "I bought this for a friend that was terribly disappointed in the funtionality of her blu-ray. She does not have a really strong wi-fi connection. Although the initial set up took a while to download due to the slow internet, she has no trouble with the connection now! It works really well. I'm really happy with the purchase!", "verified": true, "helpfulness": "1/1", "author": "Jen_m"}, {"rating": 5.0, "review": "Sleek little black box, hooked up very easily to my LCD TV, and have been using it without an issue. Flips very quickly in the system, including in 3rd party apps (i.e. Netflix). Yes, it has no iTunes, but I prefer Amazon Instant Video anyway (it's much easier to access content across different laptops by just signing into my account, rather than requiring iTunes). The search could probably be improved to expand across all apps, but Amazon hasn't let me down in its development yet, and this is only a new-released product. If they continue to improve this similar to how they did the Fire Tablet, then I have faith.Also, yes, HBOGO is not available, but this doesn't impact me because Comcast has always hindered other systems in accessing the content. As I'm on Comcast, this continues to be an issue.It has all of the apps I'd ever used (Hulu, Netflix, Instant Video).", "verified": true, "helpfulness": "0/0", "author": "Scott Ryan"}, {"rating": 4.0, "review": "This is a really good unit for streaming, with many improvements over the Roku 3.  But Amazon needs to build in more content, as it is missing HBO GO, MAX GO, Spotify, VuDu and many many other providers.  I suspect this will happen over time.  Some bugs, like videos freezing on occasion.  However, the voice search functionality is a major win for Amazon.  All in all, a good purchase.", "verified": true, "helpfulness": "1/2", "author": "Jim W."}, {"rating": 5.0, "review": "Would like to say that this is the best streamer out. I tried them all and mostly came away disappointed. This thing is super fast and quick load times. Don't listen to most of these reviews that have not even tried it. It is a premium product that has a premium price. If you are looking for a budget streamer, look elsewhere.", "verified": true, "helpfulness": "3/3", "author": "Shawn C."}, {"rating": 4.0, "review": "Being a Prime member, I had it in just a couple days.  Pulled it of the box and plugged it in, but it wasn't quite ready out of the box.Once plugged in and turned on, it had to download and install new updates, I was a little surprised since it is such a new device. It took a little longer to load than I wanted at the moment.Once up and running, it is great.  Takes up no space, no commercials, and paired up with FiOS, no buffering.This was a great purchase, especially since the wife is happy.", "verified": true, "helpfulness": "2/2", "author": "Todd Holman"}, {"rating": 5.0, "review": "This is by far the best thing!At first I was hesitant as the Roku 3 works great but when my husband showed me the Amazon Fire I was taken back.For starters I am a Prime customer and it list all the Prime Movies which is really awesome and helpful.As for the Voice Command it is way to cool and you dont even have to be specific. For example I searched War Movies and it listed so many.I highly recommend this and I have the Roku 2, 3 and Apple TV!", "verified": true, "helpfulness": "6/6", "author": "Mary Boschetto"}, {"rating": 1.0, "review": "This lacks far too many useful features for me to switch. The ROKU, with Aereo TV (if available in your area) is the only comprehensive solution for \"Cable Nevers\" such as myself. The remote alone on the Roku 3 does laps around the Fire TV. Avoid this product.", "verified": false, "helpfulness": "6/51", "author": "M. Milsap"}, {"rating": 5.0, "review": "I received the Apple TV unit for christmas it worked so poorly I returned it. I still have a hard time believing Apple could put such a bad product on the market. I then purchased the Roku 3 which works great but with some buffering issues.The Amazon Fire is so easy to set up and use there is no comparison to the other units. The voice command works great, there is a great selection of shows and movies to watch, tons of games and apps and I'm sure with Amazon behind it things will only get better.", "verified": true, "helpfulness": "6/6", "author": "crane guy"}, {"rating": 4.0, "review": "It seems to work fine so far (2 Days with it). What I don't like is how Amazon has made it so the\"Prime\" content is mixed with the \"For Pay\" content, with no easy way to just see what is ONLY \"Prime\" content. This is obviously made to divert you into buying more non Prime content...Amazon, please give us a CLEAR way to view \"Prime Only\" if that's what we want. I know we can voice search for anything... and that's great, but sometimes we just want to \"Go Fishing\" and would like to fish in the \"Prime\" pond only. This is a pretty big deal when you compare this to competing (Think ROKU) products that let you do just that.Hard to believe your competition does a better job with presenting your own content than you do. Maybe an update in the near future will \"Fix\" this.", "verified": true, "helpfulness": "5/809", "author": "Dallas"}, {"rating": 1.0, "review": "minecraft is horrible and is just the pocket edition. if i wanted to play minecraft pocket edition i'd take out my phone and tablet as the controls are pretty poorly done. but the other games are also just not very good even for a casual gamer like me.streaming content is lacking a few key apps but also amazon instant video content is pushed too much. the voice search always shows amazon content only. with a few hulu things but then it doesn't deep link into the hulu episode. :(", "verified": false, "helpfulness": "5/36", "author": "T Le"}]