[{"rating": 5.0, "review": "I was really happy with the easy install of this device.  I plugged it into the tv and waited a couple of days to select that hdmi port to try it out.  I've been dealing with a husband in the hospital since January (still in the hospital) and I didn't want to deal with any stress so I waited a couple of days to even turn it on.  Once I did the set up was so easy.  It saw my wireless network no problem.  I have a 10 digit key code password and that was easy to enter.  Once I connected it did the software upgrade on it's own.  Then I watched the instructional video and I was on.  I watched a couple of quick selections (I don't have Netflicks but I am a prime member) I already have a kindle fire but I haven't played with that with the fire tv yet.  But the picture on the television was gorgeous and the sound very impressive from the fire tv.  It was pretty much instant when I selected what I wanted to watch.  Easy menu to move thru so I was very happy with my purchase.  No stress and easy to install for this old lady.  I think once Amazon provides even more videos on prime it will be even better.  I even ordered the game control but don't have that yet.", "verified": true, "helpfulness": "3/3", "author": "Carol Joy Hartley"}, {"rating": 4.0, "review": "I was greatly excited to get my new Fire TV and ordered it as soon as it was available.  The setup hit a snag when the device could not detect the remote control - once it powered up and was connected to my network, it started a software update (probably why it didn't detect the remote) but since it didn't detect the remote I was unable to continue the setup once the update completed.To resolve, I power cycled the device and it detected the remote after that.I think companies should ensure the device is a working state before beginning an over-the-network update - I know many hardware devices do this, and they have a higher setup failure rate because of it.", "verified": true, "helpfulness": "0/1", "author": "C. J. Smith"}, {"rating": 5.0, "review": "This is the best thing in electronic gadgets in a LONG time.I normally don't write reviews but this thing is awesome. My kids 6,9, and 12 absolutely love it. With the additional Netflix subscription they can easily access Netflix kids and find a zillion TV shows just for them.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer \"slinginmom\""}, {"rating": 4.0, "review": "$99/year for Prime is a great deal if you take advantage of it. If you only borrow 12 books a year, that'll cover it.  Now with the Fire TV, you can ditch cable or satellite and save tons.  I ditched my $120/month TV bill two years before the Fire TV came out, and now it's more convenient than ever. The average US household pays close to $100/ month for television service.  That's $1200/year!  For Amazon Prime + Hulu Plus + Netflix you'll pay $291/year. In my case $195/year.  Prime and Hulu have more than I can find time for. And now with all the Fire TV apps to access even more content for free, well, you get the picture.  What will you spend your extra $75/month on?For those of you on the fence about cord cutting, you're likely only hesitant for one of two reasons: 1) You might have to give up the current season a few favorite shows. Trust me, there are so many shows you'll want to see that you didn't even know we're available, you won't notice the lack.  And after a wait, your shows will be available to stream at no additional cost. In the mean time, you'll have found more favorites, available from season one episode one. 2) The second reason could be that you don't have the money or maybe the expertise to set up an HTPC.  The Fire TV clears this hurdle.  (Now I can repurpose my HTPC.)", "verified": false, "helpfulness": "5/5", "author": "Yendao42 \"Randy Drawdy\""}, {"rating": 5.0, "review": "Love it and it is so easy to set up and use! Would definitely recommend it! I love the voice remote control.", "verified": true, "helpfulness": "0/0", "author": "love it"}, {"rating": 4.0, "review": "First a bit of background...  I've used a variety of media boxes including HTPCs, the Sony SMP, Apple TV, a PS3, a Raspberry Pi running XBMC, an Ouya, and a Chromecast.  So I have a pretty good basis for comparison with the Fire TV.Based purely on hardware, the Fire TV would easily get a 5-star rating.  The system is faster and more responsive than any other media box I've used except a full-powered HTPC (and that's including my PS3, btw).  The MIMO wireless picks up signals that would be too weak for other devices, and the remote is simple but elegant and well designed.  And the Fire TV is capable of playing full-HD media with no problems whatsoever.  For $99, this hardware is a steal.So why only 4 stars?  The software.  There are quite a number of issues with the interface and other aspects of the software that make using the device less pleasant than it should be given the capabilities of the hardware.First, as others have mentioned, the voice search is remarkably fast and accurate, but currently only provides results for Amazon content.  This seems to be both a fixable problem and one that's more to blame on Netflix and those other services than Amazon.  But wherever the blame lies, it's the user that suffers.  If you use more than just Amazon's content services, don't expect to find a lot of use from this otherwise admittedly very nice feature.Second, even Amazon Prime members might find discovering content frustrating.  While there are a couple of categories specific to Amazon Prime content, there doesn't seem to be any way to look specifically for Prime content outside of these categories.Third, the interface has a number of minor frustrations.  For example, the categories don't loop around, requiring you to either scroll back through 80 results to get back to one at the beginning, or else back out to the home screen and come back.  Similarly (and more frustrating), the onscreen keyboard doesn't wrap around, which requires even more button presses when using an already slow input method.  It might sound nit-picky, but it all adds up to a less pleasant experience than it should be.Finally, there's the issue of apps, and there are a lot of issues here.One of the strengths of an Android-based media box compared to alternatives like the Roku or Apple TV is the number and variety of apps available.  However, the number of apps currently available in the Amazon App Store for the Fire TV is fairly small other than those for Netflix and other streaming services, and a handful of games.  You don't currently have access to the hundreds of thousands of apps available for other Android devices in the Amazon App Store, much less the million available in the Google Play store (since Google Play isn't available for the Fire TV).  While this is sure to change as developers add the Fire TV to the list of compatible devices for their individual apps, it's currently a bit limiting.Notably missing from the list of currently available applications is an app allowing you to play local media.  Plex is available, but this is a paid app and requires you to run the Plex server application on another computer on your local network.  Want to play media from a network share?  There's not an app for that.  Want to play media from a external hard drive?  There's not an app for that, either...... though it wouldn't matter if there were, because the Fire TV doesn't yet have support for external storage.  (This is a software issue, by the way, not a hardware issue, since the Fire TV's USB port works for keyboards and other devices.)  This is almost certainly something that Amazon will add in a later update, since the 8GB of internal storage isn't nearly enough if Amazon is serious about making the Fire TV a game console.This lack of available apps is a limitation that's exaggerated by the difficulty and inconvenience of sideloading apps.  While, as with other Android-based apps, the Fire TV provides the ability to sideload apps, doing so requires you to use developer tools (adb) rather than simply opening and installing the app's APK file.  Even worse, if you do go through the effort to sideload an app, those apps don't appear in the home launcher, and can only be accessed through a submenu (Home -> Settings -> Applications).I don't want it to sound like the software is a deal-breaker.  Actually, the interface is considerably better than that of some other media boxes I've used, and I'd even say without a doubt that the Fire TV is currently the best $100 media box on the market.  But the software simply doesn't currently live up to the promise of the hardware it's running on.  Fortunately, software problems are fixable.  The number of apps available in the App Store will naturally increase in time, and the addition of support for external storage is almost inevitable.  Amazon is also likely to tweak the interface in response to user feedback, and if the Fire TV becomes popular, it will put pressure on app developers to incorporate the Fire TV's voice search capabilities.As I said in the review title, this device is definitely worth watching.  Despite its flaws, it is an excellent media player.  And since its flaws are all correctable through software updates, it's likely to get even better in time.  While I'm currently docking the Fire TV a full star for the various software-related issues, I expect to update this review in a couple of months to give it a 5-star rating.--------------------------------[Update/Tip]:  While sideloading apps on the Fire TV isn't as easy as it should be, after using the Fire TV for a couple of days, I highly recommend going through the effort to install XBMC on the Fire TV.  At least for me, the inability to play local media was a severe limitation.  Installing XBMC doesn't add support for external storage, but it does allow the Fire TV to play media from other devices on the local network, including Windows shared folders,  UPnP/DLNA media servers, and NAS devices.Also, since plugins for XBMC allow you to launch other apps (like Netflix) from within XBMC (and to do so more conveniently than launching sideloaded apps from the Fire TV interface) and even for XBMC to automatically launch at startup, it's possible to eliminate essentially every software-related problem (with the notable exception of the lack of support for external storage) by sideloading XBMC.Hopefully, XBMC will eventually be added to the Amazon App Store for the Fire TV.  Until then, the Fire TV page of the XBMC wiki provides instructions for sideloading XBMC.  The SPMC build works extremely well for me.", "verified": true, "helpfulness": "15/16", "author": "Matt Burns \"Avid reader and film buff\""}, {"rating": 5.0, "review": "I'll start by saying I don't write reviews. This thing is such an incredible piece of equipment that I feel like it's my duty to give my .02. Setup is as easy as plug in and give it a minute to update and that's it. The voice recognition is amazing it even decodes my southern draw!!! The speed that it loads programs is nothing short of outstanding ( easily twice as fast as my Apple TV and my lg smart tv). Picture and sound are excellent as well. One of the best $100 investments I've ever made.", "verified": true, "helpfulness": "3/3", "author": "scott@atomicchaircompany"}, {"rating": 3.0, "review": "It's ok, but several flaws keep it from being useful.  First, search doesn't work across apps.  Second, it doesn't support IR remotes like the harmony remotes.  Third, the gui is somewhat cumbersome, putting apps several clicks away.  I'll use it for amazon services on the tv that doesn't have an xbox 360, but it's definitely a second class citizen in my device stack.  I'm wishing I chose a roku instead.  Hopefully it improves over time with software updates.", "verified": true, "helpfulness": "1/1", "author": "eXPerienced"}, {"rating": 5.0, "review": "I don't have cable TV but do have Netflix and Amazon Prime.  I've just started using it, but so far I am enjoying the Amazon Fire.  It's easy to use and the voice command feature is great.", "verified": true, "helpfulness": "0/0", "author": "S. Mandoki \"music collector\""}, {"rating": 4.0, "review": "Build quality is superb.This thing is super fast.  Fastest of all the set top boxes.It came setup for my account out of the box.  So cool.", "verified": true, "helpfulness": "0/0", "author": "S. Fishman"}]