[{"rating": 5.0, "review": "I love this thing!!  I can't tell you how happy I am that I made this purchase!  My family loves it and it's so easy to use and it was easy to set-up.  I didn't realize how much of my Amazon Prime membership I wasn't using until I got this.  I'm so happy.  My sister and her husband are Prime members as well and if they don't purchase this (I totally recommended it to them in a ridiculously long email) they will be getting it as a gift...because it's AWESOME!  We also use it for Netflix, Hulu Plus and games.", "verified": true, "helpfulness": "1/2", "author": "Ellen.in.StL"}, {"rating": 3.0, "review": "Works fine as did Roku - maybe it just me, but raising your cost of rentals seems to offset the value. Prime seems to only have old, old movies and TV series, for the most part.", "verified": true, "helpfulness": "1/2", "author": "RadioBill"}, {"rating": 5.0, "review": "I bought this as a birthday present for my wife and she has really enjoyed it. It has a very simple interface, the voice interface really works well. There are lots of entertainment choices and apps. We are avid Amazon Prime members and as an interface to prime movies and instant video the fire tv is great.There are only two minor issues:1) if you're a prime member be careful of how you choose content - it's easy to choose a pay option when the same content is available for free but you have to explicitly choose prime2) As someone who thought that using Voltaire to introduce Kindle fire was a very powerful and compelling pitch, Gary Busey is kind of a let down for fire tv :)", "verified": true, "helpfulness": "1/3", "author": "Bradley S. Mabe \"Bradley S. Mabe\""}, {"rating": 3.0, "review": "Being an Amazon Prime fanatic and always buying everything on Amazon I had resisted Apple TV and Google Chrome and Roku waiting for Amazon to bring out its TV product. I have to say I was somewhat underwhelmed. The inability to connect my phone or tablet to it was disappointing as well as not having HBO was also a downer. I used it to show a TV program to my grandson but beyond that I have really not used it much. We will obviously use it for Amazon Prime movies and TV shows but not for our own content as uploading pictures and videos to the Amazon Cloud is painful and the device takes forever to buffer home video despite a cable modem connection that is lightening fast for our computers, not so much for Fire.", "verified": true, "helpfulness": "0/2", "author": "James E. Dion"}, {"rating": 5.0, "review": "I love how small and compact and efficiently-designed this device is. It's extremely user-friendly and a great addition to my home entertainment library. I would recommend this to anyone who is ready to start streaming their TV content.", "verified": true, "helpfulness": "0/1", "author": "the king of pencils and sharpeners"}, {"rating": 1.0, "review": "After paying $99.00 +Tax, we have to pay to watch anything on it. I have Jadoo Tv also and I don't buy any shows or movies. If its about Netflix, then i could have connect my computer to the TV. I might have just stick with Dish Network.", "verified": true, "helpfulness": "10/22", "author": "Taj"}, {"rating": 5.0, "review": "Amazon Fire TV works great.  It was simple to install and simple to use.  As long as you have high speed internet it will work great!  I can't see why anyone would buy anything else!  And being a prime member you have tons of shows at your fingertips.  The best thing about it is the voice search.  You really do just speak into the remote and it will bring up whatever you are looking for.", "verified": true, "helpfulness": "0/2", "author": "KIP1958"}, {"rating": 5.0, "review": "It performs much better than my Roku with my marginal isp speed.  The picture quality is much better and the voice recognition finds everything I'm looking for.  My only negative is that it doesn't have Vudu where I have all of my movies stored.", "verified": true, "helpfulness": "0/1", "author": "Paul"}, {"rating": 3.0, "review": "The  voice  part  did not work good  and  it would not  pick up closed caption as was promised  but  it  worked  great  .", "verified": true, "helpfulness": "0/0", "author": "Dallas Short"}, {"rating": 5.0, "review": "I was using a connection with my laptop to view Netflix.  I also use a Wii for my other tv.  This Fire TV works better than both.  Not only do I get right to Netflix, but also Prime and many other freebee stations.", "verified": true, "helpfulness": "0/1", "author": "patm"}]