[{"rating": 2.0, "review": "I bought the Fire TV & it worked for like 5 minutes & quit working & I had to return it for a new one. Not a good start to a device I looked forward to using.", "verified": true, "helpfulness": "0/0", "author": "Pam Austin"}, {"rating": 5.0, "review": "I love my Amazon Fire TV. Since I bought this, I hardly watch TV at all. Thanks to Amazon Prime and Netflix, Youtube, Vevo and all the many more apps Fire TV offers I am very occupied on the days I choose to veg on some TV. Fire TV also functions fast and the remote works fine. The only issue I would say I have is that the Solitaire app I downloaded crashes frequently. But Im not sure if that has anything to do with Fire TV itself. I havent had problems with any other apps.", "verified": true, "helpfulness": "1/1", "author": "janice"}, {"rating": 5.0, "review": "LOVE THIS!  Especially that it has a remote!  I watch mostly Netflix, PBS, Amazon Prime and a few others. So convenient and easy!", "verified": true, "helpfulness": "1/1", "author": "Eileen J. Glick \"EileenJG\""}, {"rating": 4.0, "review": "The connection and speed are amazing and the vice command search feature is really awesome.  Though there is a lot of content  available most of the good stuff has to be individually paid for.  Most of the free stuff you would not watch if you were stuck waiting in the maternity ward waiting room for 12 hours..", "verified": true, "helpfulness": "1/1", "author": "Droid"}, {"rating": 5.0, "review": "I bought this for my Father. He has had only basic cable until now. I went to check on him and he was using the voice search and everything. He can figure out if it is on prime by himself so I don't have to worry about him charging movies to my account. It was very easy to set up and searching is also easy.", "verified": true, "helpfulness": "0/0", "author": "Trobs"}, {"rating": 5.0, "review": "The best streaming box I've ever used.  And I've used just about all of them.  I now have 3 of them.Rich", "verified": true, "helpfulness": "1/1", "author": "rich584"}, {"rating": 5.0, "review": "We are in love with our Fire TV! so easy to use we even cancelled our cable!", "verified": true, "helpfulness": "0/0", "author": "Deanna Alfonso"}, {"rating": 5.0, "review": "Waiting", "verified": true, "helpfulness": "0/2", "author": "Sally Edwards"}, {"rating": 4.0, "review": "WOW, DOUBLE WOW, compared to my Roku this device \" Tres Magnifique \" no more buffering when scrolling back a little, very little when fast forwarding , or reversing. 1080p and closed captioning are crystal clear, season of shows play continually , unless interrupted. Tiny little box, voice activation  that works, down load your apps first, Ernest is impressed. WOW !!!!!!", "verified": true, "helpfulness": "1/1", "author": "Mr   Fixit of Altus"}, {"rating": 5.0, "review": "Best streaming device I have used. It is very smooth with little to no delay. I don't use a ton of apps. My main use is streaming video and music with Plex, Slingbox, Netflix, and music.I have tried Sony Google TV,  Roku, and Chromecast. I still use the Chromecast for its simplicity with a tablet, but for overall speed and interface, the Fire TV is best for my use.", "verified": true, "helpfulness": "0/0", "author": "Matt K"}]