[{"rating": 5.0, "review": "It was more than we expected. Easy to set up. Took 10 minutes. Lots to watch. No more cable tv for us. Love it!!", "verified": true, "helpfulness": "0/0", "author": "JLC"}, {"rating": 5.0, "review": "This is the second box in outrhouse. Its nice to stick it to the cable company", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 3.0, "review": "It's an okay system. I'm not totally blown away.  With the given specs I expected it to blow the Apple TV out of the the water but it doesn't.  The apps tend to stop from time to time so I'm giving it to the kids and keeping the Apple TV.  The system layout has a lot going on and its not simple at all.  You can't power off or restart so that's a bummer too.", "verified": true, "helpfulness": "0/1", "author": "Franscoir Hart"}, {"rating": 5.0, "review": "Love my Amazon Fire!", "verified": true, "helpfulness": "0/0", "author": "SpacedIt"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "anthony"}, {"rating": 5.0, "review": "I bought this for the wife and kids.  We had been using a DVD player to access Amazon Prime content.  I thought this would be much easier and it truly is.  It was simple to set up and within five minuets we were watching a movie.  The only grip I have is Comcast is not supported.  With Comcast not being supported we do lose some functionality of the apps, such as HBOGO and any that require you to sign in to your cable provider.  I'm sure that eventually Amazon and Comcast will come to some sort of agreement and all will be well.  Since we have a full cable package as well as the Fire, this isn't a huge problem for us but if you are relying on the Fire to provide those channels then you have to make the call.  Overall I think this was a great purchase.", "verified": true, "helpfulness": "1/1", "author": "Matthew"}, {"rating": 5.0, "review": "Good product as per Specification and performance.", "verified": true, "helpfulness": "0/0", "author": "Narinder Kumar"}, {"rating": 5.0, "review": "It is awesome and affordable however unless you have amazon prime you will never get the full benifits of such an amazing machine.  I strongly recommend fire tv over its competitors I had apple tv and I was really dissatisfied with the limited usage plus it broke in like 2 months.  So go buy an amazon fire TV if your in the market because it has a ton of value.", "verified": true, "helpfulness": "1/1", "author": "Scott Carlson"}, {"rating": 4.0, "review": "I could have used more instructions as to the operation and selections.", "verified": true, "helpfulness": "0/0", "author": "Roger Corbit"}, {"rating": 5.0, "review": "My roku3 started to act up, constantly unplugging it to reset. I got tired of it and pulled the trigger on a Fire TV, so far I am very happy with it.  I notice a faster response from remote to system, which was the biggest complaint i had with the Roku3", "verified": true, "helpfulness": "0/0", "author": "PK"}]