[{"rating": 4.0, "review": "I have very mixed feelings about the Fire TVPros: Good hardware very responsive (entertainment loads quickly and plays smooth).Good simple remote that just works from any position.Cons: The remote batteries need replacing once a month.Amazon's available programing is old (prime member). Any time you approach newer programming it requires additional payment.Layouts on screen are too repetitive and the categories are often annoying.The fire TV needs better descriptions of programs and access to trailers. They do own IMDB, so I can't imagine why this would be difficult.Purchasing programs from Amazon are not returnable and therefore not refundable if you don't like it or it doesn't work.If you are  thinking about cutting the cable, you may want to wait for newer software and or better policies from Amazon.", "verified": true, "helpfulness": "1/1", "author": "DJ"}, {"rating": 5.0, "review": "Awesome device! recommended for everyone!", "verified": true, "helpfulness": "1/1", "author": "Matias Diano"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Good:Amazon Fire TV is a great addition to any TV. It's a significant upgrade over the Fire TV Stick. You get two dual-band Wi-Fi antennas for a more reliable connection, and it features a quad-core CPU with 2GB of RAM to accommodate the latest apps and games. That's a lot more power than you get in competing devices from Apple, Roku, and Google. And if you buy it at the right time, it's well-priced as well. Bundled with the device is a slick remote with seven buttons and a directional control pad to make navigation easy. It communicates over Bluetooth to the device, so it doesn't require a direct line of sight and allows you to stash the Fire TV in a cabinet. Unlike the remote that comes with the Fire TV stick, this one also includes a microphone for voice recognition, a potentially handy feature to make searching for content easier (I say \"potentially\", because it's not there yet; more on that later)Also unlike the stick version, the set-top box offers the option to connect over Ethernet (actually a requirement for high-end games) which is nice to have in case Wi-Fi is not a reliable option in your home. Amazon has also been frequently adding apps to their lineup, exceeding 1,800 earlier this year keeping it caught up with the competition. Popular examples include Netflix, Flixster, Hulu, HBO Go, and Starz Play. The set-top version also features an optical audio out connection that let's you easily connect it directly to your home theatre if you feel the need to. An optional add-on accessory is the Amazon Fire Game Controller which can be had for $40. If you're planning to play games, this is a nice option to have.The Bad:First of all, one of the most-touted features is also one of the device's biggest weaknesses: voice recognition. Currently, you can only use the feature to search across Amazon's ecosystem consisting of Amazon Prime, Amazon Music, etc. It does not search 3rd-party apps such as Netflix. If Amazon truly believes in providing a user-friendly interface that is geared towards the customer, this issue needs to be addressed at some point. I expect that it will, considering its number-one competitor, Roku, does allow you to search across every installed app. It can be a game changer should Amazon decide to match the competition in a future update. The potential that they could at some point is enough to convince me that this isn't a major concern yet. If we're still having this conversation two years from now, then we can talk about throwing in the towel and lowering the rating in this review.Another handicap is the absence of Vudu. I suspect that since that app is owned by Walmart, Amazon has zero interest in allowing it to exist on their device. They would rather you purchase movies from Amazon's movie offerings, than to continue to add to your Vudu library (and essentially, adding to Walmart's pocket). It's doubtful that Vudu will ever make it onto Amazon's Fire TV, so if you're on the fence and Vudu is important to you, don't buy the Fire TV expecting that someday it will be added. That's not likely to ever happen. It's unfortunate in this day and age of \"cutting the cord\" and \"internet openness\" that a device as prominent as this one would try to force you to take a step backwards, but that's the nature of the beast I suppose. The workaround to accessing your Vudu library is to install Flixster and create a login that's linked to your Ultraviolet account. Then, you'll see every title that's you've added to Vudu appear in your Flixster library. Had it not been for this workaround, I would have certainly deducted a star, maybe two.And finally, there's the interface. In most aspects, it is user-friendly and easy to navigate. My only complaint here is there's no way to customize it. It would be nice to have the ability to place the most frequently-used 3rd-party apps on the home screen or just one menu deep off the home screen. Unfortunately, that's not possible. It's almost as if Amazon has gone through great lengths to bury 3rd-party apps several menus deep in an attempt to discourage their use. Again, not a deal-breaker but it's worth noting.Conclusion:The upsides of the Fire TV outweigh the negatives by a significant margin. For me, it's all about performance and hardware features, and the Fire TV crushes the competition in this regard. Load times are quick, wireless capabilities are what you'd expect, and if you're into gaming or plan to look into it at some point, no one else comes close to matching the Fire TV. That alone is worth a 5-star review. Amazon has some ways to go to further improve the device, but as their first entry into an already crowded market, they did pretty well.", "verified": true, "helpfulness": "0/0", "author": "Carl"}, {"rating": 3.0, "review": "Amazon Fire TV is good but the remote eats batteries fast. Get maybe 2 days use before I have to install new ones. Resorted to removing the battery when not in use. Oh, there is also a Remote App for the iPhone that I use too. It works as a great substitute for the Amazon Fire remote controller.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "I'm enjoying watching shows I would've not been able to see.", "verified": true, "helpfulness": "0/0", "author": "Ida E Smith"}, {"rating": 1.0, "review": "Received two of these boxes. First was the original purchase and the second was a replacement for the first. Both boxes worked well right after initial setup but once they went to sleep they never woke up. I tried to troubleshoot the problem with the Fire TV department but all they said was that they would inform their engineering team of the issue and I would be stuck with yet another replacement. I couldn't do it so I returned the Fire TV.  Purchase at your own risk.", "verified": true, "helpfulness": "0/0", "author": "Kyle Mitchell"}, {"rating": 5.0, "review": "This is great!", "verified": true, "helpfulness": "0/0", "author": "Venita DeFreeze"}, {"rating": 5.0, "review": "AWESOME!!!", "verified": true, "helpfulness": "0/0", "author": "Kelli"}, {"rating": 5.0, "review": "So far so good -I like the simple set up and operation of the functions.", "verified": true, "helpfulness": "0/0", "author": "geor"}]