[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Manuel"}, {"rating": 5.0, "review": "Only way to watch TV.  Great product for the money.", "verified": true, "helpfulness": "0/2", "author": "Robert L Pike"}, {"rating": 5.0, "review": "We live in Japan on a Navy base and they recently lifted restrictions on viewing Netflix, Hulu, Amazon etc. by coming to an agreement with Japan for US Navy bases. We got this and it has been awesome. We sure like not having to hook up our CPU to the TV. Glad someone finally looked out for the US Armed forces over here!! Great device easy setup and works great with our music and photos in the Amazon cloud and watching free Prime shows is a bonus!!", "verified": true, "helpfulness": "1/3", "author": "Kristina M. Moreland"}, {"rating": 1.0, "review": "I am extremely disappointed.  I am a shareholder and a heavy user of Amazon Prime for shipping / buying virtually everything through AMZ.  I already own a Roku 3 but wanted to get the Amazon Fire TV thinking I would actually use the Prime video content everyone always talks about.Roku 3 vs Amazon Fire TVEven - no advantageSleek packaging and form factorSet up simple and relatively quickAdvantage Amazon FireEasier to navigate when entering passwords, email addresses etc.Voice navigation is cool but it does not designate Prime content so you have to click the show to find out there is a rental fee requiring you to use two devices:  PC to manage your Amazon queue and the device to select it on a menu buried deep in its channel optionsDisadvantage to having multiple technologies in the houseEverytime I want to access Netflix on different devices it deactivates me on the prior device and I have to re-register - MAJOR PAINDifferent menus and controllers (minor issue but irritating when you want to rely on muscle memory to play, pause, etc.)Advantage Roku 3Speed / flexibility - both devices side by side using the same HDMI cable and same wireless network watching the same content operate completely differently.  Roku is nearly instant upload and rewinding / fast forwarding are easy with images every 7 seconds to select where to restart content.  Fire TV takes several minutes to upload and several minutes every time you want to catch what was just said a few seconds before.  My wife wanted to look at a lamp in a prior scene and so I tried to back up - major mistake!  It took so long she got bored and went upstairs to wash her face for bed - she came back and it was still uploading at 82%!  Then a few minutes later (after we agreed we cant back up for anything)  the remote slipped off the couch and landed face down pausing the action.  We both groaned in horror in fear that it might reload again...fortunately it was just paused.Finally the main reason I bought it (other than my true loyalty to Amazon) was to be able to have an advantage / simple way to access all the great Prime cointent - have only watched 2 movies on my laptiop - it is not my preferred way to access this content and I was hoping to be able to get more value from this aspect of my Prime membership.  AMAZINGLY this is not only less convenient it appears to be DESIGNED to be less convenient to drive more revenue.All in all I am extremely disappointed in Amazon.  I believe Jeff Bezos will get this right in the future, but right now it is NOT READY FOR PRIME TIME!  NO NOT BUY THIS PRODUCT!", "verified": true, "helpfulness": "7/10", "author": "Amazon Customer"}, {"rating": 4.0, "review": "A very good addition for movies and TV. I was using a Sony Blu-Ray player to access the same content I now get thru The Amazon Fire TV. It was slow loading each time you tried to view something new. Fire Tv is super fast, I really like it. But....... The sound is sometimes lost, you have to power off and back on to recover the sound....... There should be a way on the home screen to access just the prime content.. we pay for the prime.. we should have an easier way to get to it. That's the reason for the 4 Stars....  But it is a great product other wise.", "verified": true, "helpfulness": "1/1", "author": "Janice  Kennedy"}, {"rating": 3.0, "review": "often the audio - stereo output through hdmi - is veryyyyyyyyyyyyy tinny (a high ring that is consistent throughout the audio).  I hope they improve this.  The content is fabulous included with a Prime membership.", "verified": true, "helpfulness": "0/1", "author": "Daniel"}, {"rating": 4.0, "review": "Really great product.  Razor sharp images, smooth streaming.  Occasional problems with volume that can only be solved by turning everything off and on again.", "verified": true, "helpfulness": "0/0", "author": "Ben C."}, {"rating": 5.0, "review": "Love it so far! I was streaming through my Blu ray previously, and my husband thought the Fire TV was redundant, at first. I'm an avid Prime member, but Fire TV took a little getting used to at first. It seemed to default to the items that required payment first, instead of to the Prime content. Couldn't have been easier to set up, pretty much plug and play. I love the screen saver feature, sometimes I just enjoy watching the scenery for a while, and playing \"I've been there.\" There is more to customize, apps and such, but happy with my purchase so far.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like amazon fire overall. i like the speed of the device and the apps that are available (youtube, bloomberg, netflix, etc). the home page is a little confusing and disorganized (and i dont think you can change it), but overall i am happy with the device.i do not like the  geographical restrictions to Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "kijana mack"}, {"rating": 4.0, "review": "There is still room for improvement and I hope Amazon will send constant updates and improved apps. I see some are jsut web apps and sometimes the video takes time to load especially in vevo app.", "verified": true, "helpfulness": "0/0", "author": "S_11"}]