[{"rating": 5.0, "review": "We had been streaming Netflix through an old Wii and started looking at options. Received an email from Amazon offering the Fire TV on sale. GREAT device - super easy to set up and so much easier and less cumbersome to use than streaming through the Wii. Love the voice command feature - works great. Also love the 30 day free trial of Prime and will keep that going since there are some series on Amazon that aren't on Netflix - Justified being one. My only hesitation is they currently do not offer HBO GO but supposedly will by the end of the year.", "verified": true, "helpfulness": "0/0", "author": "Brenda in TX"}, {"rating": 5.0, "review": "Whole family loves it!Better than Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Demetrios Drakos"}, {"rating": 2.0, "review": "Can't seem to play arbitrary podcasts and apps not from amazon store don't appear on the apps screen. The PLEX app can't access the surround sound,", "verified": true, "helpfulness": "0/0", "author": "David Most"}, {"rating": 5.0, "review": "Excellent... a big improvement over my old Roku. I especially like the Bluetooth wireless connection for the remote.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome ! Much better than the dvd wi fi that i was using before.  Hardly any buffering. Surprisingly very small, so no bulky extra equipment.", "verified": true, "helpfulness": "0/0", "author": "christopher diaz"}, {"rating": 5.0, "review": "Woooow and woooow... I love it. I had a roku, but it is much better than roku. It's an adroid and you have a lot of options to get more functions. I will buy another one.", "verified": true, "helpfulness": "0/0", "author": "Saul Nova"}, {"rating": 5.0, "review": "It's truly fantastic!", "verified": true, "helpfulness": "0/0", "author": "Charles E. Addington"}, {"rating": 5.0, "review": "AWESOME", "verified": true, "helpfulness": "0/0", "author": "Peter Dudas"}, {"rating": 5.0, "review": "I had a little problem, they walked me through it in about 5 minutes. Great selection, I still have cable but I am thinking about getting rid of it.", "verified": true, "helpfulness": "0/0", "author": "O. Cummings"}, {"rating": 4.0, "review": "The most amazing feature that this tv has is the voice recognition..you can automatically browse through thousands of movies by just speaking to it I find that to be amazing I have never seen anything like it and its only for 100$ you can’t go wrong.", "verified": false, "helpfulness": "0/0", "author": "James Hoover"}]