[{"rating": 2.0, "review": "Does it work if you don't have wifi", "verified": false, "helpfulness": "0/3", "author": "Tiffany jones"}, {"rating": 4.0, "review": "Debating between 3 and 4 stars. It does what it's supposed to do and works just fine. I wish the USB port was functional - I have a hard drive that I'd like to be able to access.", "verified": true, "helpfulness": "0/0", "author": "☆Megan☆"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/1", "author": "jen frost"}, {"rating": 5.0, "review": "Bought this as a bundle with the game controller and the HDMI cable. Can't comment on the HDMI cable for I gave that to the same person I gave away my old/original Roku which this replaced.Using my existing HDMI cable, and having a Prime account this was a cinch to setup. I also chose to go with wired over wireless for wired is faster and wireless is not 100% reliable.There are a few aspects to look at this and understand this is coming from a 41 year old male that is a long time user of the Roku and I also and still own the Roku 3 upstairs.1. In comparison to the Roku or Roku 3 it's better in some aspects and others not so much. If you want to use this strictly for Amazon Prime Movies/Music/Games then it's well worth the money. If you are going to use this just to stream lets say Netflix and that will be your primary reason for this then go elsewhere.2. Netflix and other services work on this, but in comparison to lets say Roku (any of their versions) navigating to things that aren't Amazon specific takes a bit more effort to locate.3. Now, if you are utilizing Amazon Movies and Games then this thing is a better choice. I really dove head first into the games and love it. I picked more games than I have played but being a casual gamer that doesn't want to spend hours being good at a game it's the perfect choice. Yes you can get more from XBOX and Playstation, but if you are a casual gamer and have specific things you like and don't want to put hours to develop skill then this is for you. I have played a kick-ass driving game (2 actually) and a shark game. All 3 of those are my favorite. I bought and installed the game of \"Life\" for my fiance but yet to play it but looks good so far.4. The voice command SO OVERRATED!!! I tried it twice and I think it's completely lame and totally unnecessary. Hell I barely talk to Siri on my IPhone and now I have this Amazon thing. Pass! Just glad that wasn't their primary selling feature for if it was then I wouldn't have even bothered with this unit.5. I almost bought the Fire Stick but if you really look at the games and size and other items, the Stick is very limiting. In fact, the Stick is perfect for one particular thing IMHO: traveling. If you are a big traveler especially to hotels that offer WIFI and the ability to plug into their HDMI ports then the stick is a good choice for that. Past that the Fire TV is a better choice.6. Google compatible Flash Drives for this device for if you download as much as I did you will run out of space quickly. I went with a 128GB PNY Flash Drive USB 3.0 but hasn't arrived it so can't comment on it past that.So again, it really depends on why you want a streaming device. Amazon specific services this is perfect but for other services not Amazon specific I personally would recommend Roku.This is one thing I didn't expect but it's not a big deal. I personally own/use a Logitech Harmony Remote and was using that for the Roku before I replaced it with this. The universal remote I own uses infrared where the Amazon Fire TV is bluetooth. Keep that in mind if that is important to you to be able to use your universal remote for this. If that is an issue, the only thing I can tell you is get the bluetooth universal remote OR just use the universal remote to set it to the TV to the correct input.The choice is yours.***Update on 6/1/2015***Since my last review I have received/installed the 128GB PNY USB 3.0 Flash Drive. I also immediately transferred all the games that I downloaded to the device. 2 nights ago from today I played several of the games one being very graphical and large in size. I couldn't tell any difference with the device currently being stored on the USB to when I played it and it was stored on the device itself. So in short whether it's the Flash Drive I chose or how it works there was zero negative results of doing that.The only thing I didn't like and probably isn't a big deal is now that the flash drive is installed, I can't see the present situation with storage on the local device. I did check the flash drive and it's has a ton of room. Also note while it's a 128GB Flash Drive it does not truly provide 128GB of storage space; but what storage space it does provide is more than sufficient. There is no need to presently concern with yourself on storage. If you do, cut back on how much you download at a time to the device.Last thing, I also downloaded a new game and it defaulted without prompting me to where to install/download to. So after I did that I transferred it to the flash drive and like all the other transfers that took 5-seconds or less.To conclude I am pleased with this device and choosing to buy it. With that said, I still prefer Roku in some ways, and other ways I prefer the Amazon. If I could change anything on the Amazon Fire TV it would be two things:1. Remove the voice command. IMHO it's not a selling point and quite pointless.2. I would embrace what you have with the Roku 3 and add the ability to plug-in headphones to the remote. Great tool when you want to watch TV and not disturb the person next to you that is sleeping before they go to work that night.No plans to update this review anymore unless something causes me to do so. Feel free to ask questions if you have any but I feel I pretty much covered everything.", "verified": true, "helpfulness": "4/4", "author": "Ivy"}, {"rating": 5.0, "review": "I needed one more box and got this one refurb on Amazon. Works great, no problems. Cut the cable TV, saving a lot of money, and haven't looked back. Everything looks great, streams with no problems. Just need Vudu on it, maybe someday.  The interface is easy to use, and intuitive. Only drawback is the bluetooth control. Great for using without being in line of site, but not an IR remote like most AV equipment. The logitech remotes that use the new Hubs have bluetooth. They pair with the Fire TV Box, and operate it no problem. However, you lose voice search if you use it.", "verified": true, "helpfulness": "1/1", "author": "Grimmace \"Grimmace\""}, {"rating": 1.0, "review": "Cool product but mine has a problem with developing a high pitch 'whistle' or 'hiss' through the audio.  A reboot fixes it temporarily.  Tried a different TV and better HDMI cord.  Researched and seems I am not the only one with this issue.", "verified": true, "helpfulness": "2/4", "author": "Darin"}, {"rating": 4.0, "review": "I am still learning things on my Fire TV but I am enjoying it a lot. The remote and sound search  is great but I have to re-boot the system a lot and screen keep freezing but I don't know whose problem is that, netflix, Hulu or Fire TV", "verified": true, "helpfulness": "0/0", "author": "birdy123"}, {"rating": 5.0, "review": "Is a fantastic product.", "verified": true, "helpfulness": "0/1", "author": "Carlos Bolivar"}, {"rating": 5.0, "review": "Amazon Fire TV is the second video streaming unit I have purchased. The first one, a Roku 3 streaming box, purchased from Amazon (see my review on this device) is extremely limited in connection capabilities. The Roku engineers have stupidly and deceptively marketed a device that will not connect to the internet if your network utilizes private static IP addressing. No Roku device has the capability of connecting with static private IP addresses, and any all Roku devices will only connect via DHCP (confirmed by two supervisors at Roky Tech Support). The deception by Roku comes when they fail to mention this vital information in any of their literature, their manual, their advertisements, their sales information, even here on Amazon. How short-sighted these Roku engineers can possibly be, I cannot fathom, there are millions of networks in homes, offices,wherever that choose, for better control, for another layer of security or for private reasons, to configure their networks with private static IP addressing. Almost every network connection devices, from modems, routers, firewalls --- everything,EXCEPT the Roku --- welcomes and uses as an alternate method of connectivity, static and private IP addresses.After spending over 3 hours with incompetent Roku tech support unknowledgeable people, who speak bad English, two English speaking supervisors both confirmed that it is impossible to configure ANY Roku device with static IP addresses.  So, back to Amazon the unit went for a full refund --- the device was useless to me and I had no idea of this incapability when purchasing the device. Woe be to those purchasers who deceptively buy one of these Roku things only to find that their seller is not as accommodating as Amazon and they end up stuck with a useless device.I immediately, as I should have in the first place, purchased this Amazon Fire TV device. It arrived (via Prime) within two days and within 20 minutes after unpacking, the device was up and running perfectly, connecting into my static private IP addressing network. It has been running flawlessly for several days now, and the enjoyment from it is perfect. The device was used to add streaming capability to a great older Sony Bravia LED TV that did not have built-in streaming (was prior to smart TV introduction), but still yields a magnificent picture in high definition. I could not be more happy with the device, it performs exactly as advertised, and has been used daily.I liked this Fire TV box so well that I went back to Amazon and purchased their Fire TV stick for another beautiful LED flat screen TV in my office that did not have streaming built in. While I will write a second review for the Fire TV stick (which has wonderful additional options, like the ability to carry it with you away from your home of office), the Fire TV stick configures exactly the same as the larger Fire TV box, and both deliver perfect reception in High Definition to all the same sources.Amazon has beat the competition, every other device that I have seen and read about, and there have been several, with their Fire TV offerings, Like most things that Amazon does, they do it right the first time.  I can highly, and most enthusiastically recommend either device to anyone who wants streaming capabilities on a older HD TV , whether your IP addressing is DHCP or Static. You will not go wrong here, and like me, you will be immensely pleased and satisfied!  Thank you, AMAZON !", "verified": true, "helpfulness": "2/2", "author": "John in SoCal \"J\""}, {"rating": 1.0, "review": "Im disappointed..", "verified": true, "helpfulness": "1/13", "author": "sherice major"}]