[{"rating": 5.0, "review": "The best streaming device this far. Works well with my terrible internet. Although, when downloading apps, there's no pause which conflicts with my terrible internet. Only thing though!", "verified": true, "helpfulness": "0/0", "author": "Benwho"}, {"rating": 1.0, "review": "30 day free trial was horrible - I returned the item and they still charged me even after calling customer service with proof of UPS delivery within the 30 days. Worst experience ever.", "verified": true, "helpfulness": "1/5", "author": "paul"}, {"rating": 4.0, "review": "Is much more better that appletv... Great product...", "verified": true, "helpfulness": "0/0", "author": "Ark The Doo \"Arkdoo\""}, {"rating": 4.0, "review": "elegant - simple - effficient", "verified": true, "helpfulness": "0/0", "author": "Christy B \"golf girl\""}, {"rating": 5.0, "review": "Easy to install and use.  Streams seamlessly. Voice control command function works amazingly well.", "verified": true, "helpfulness": "0/0", "author": "Stratman"}, {"rating": 5.0, "review": "I've always been a fan of Amazon devices and this one takes the cake. I literally pay $0 for cable anymore, just a monthly subscription to Netflix and Hulu Plus. The best device out there for this sort of thing!!", "verified": true, "helpfulness": "0/0", "author": "Yer Diestler"}, {"rating": 4.0, "review": "I just love my Amazon Fire TV!  The clarity on my non-HD TV is incredible!  And I enjoy the ability to mirror my Kindle HDX to it. Way better than the Roku.", "verified": true, "helpfulness": "0/0", "author": "glthornton"}, {"rating": 5.0, "review": "Amazon Fire TV is amazing. It is the easiest piece of technology to setup ever. And it is so easy to use. I love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Lisa Holmes"}, {"rating": 5.0, "review": "It has worked well, it required an upgrade with Neflix that was easy to manage. My husband likes the voice control", "verified": true, "helpfulness": "0/0", "author": "Barbara M"}, {"rating": 4.0, "review": "Works great would have beenjoyed 5 stars if it came with the game controller and allowed SMPC or XMBC to be downloaded.", "verified": true, "helpfulness": "0/1", "author": "Dustin Blea"}]