[{"rating": 3.0, "review": "I am currently starting to use my Amazon Fire TV.  It is fast (I have the WDTV as well which is much slower but read on).  So far it appears to work well with the Amazon Cloud Drive and Amazon content.  I plugged my WD Passport into it and got not response.  Can't find info. anywhere on what the USB port is for.  Maybe someone here can tell me.  Would sure like to play my 2 TB of photos and Personal Videos on the HD through it to my TV.  Appears so far not possible.  They all play perfectly on my WDTV.  That is the only reason for 3 stars.  If it could I would give it 5 stars.  Why put a USB port on it and not inform anyone what it is for.", "verified": true, "helpfulness": "2/4", "author": "Michael D. Reif"}, {"rating": 5.0, "review": "I have two Roku 2 XSs and a Boxee box (which doesn't get used much). Rokus have served me well, but he biggest limitation was the old Netflix interface that didn't support profiles or kids' mode, and I've been wanting something that does for a while now. FireTV does the job perfectly, and it's noticeable faster at Roku -- it's a pleasure to use!Hopefully Netflix will get integrated into the voice search to make it truly useful -- until most apps can use it, it's a bit of a gimmick. It does do voice recognition very well, though.", "verified": true, "helpfulness": "2/3", "author": "Stan"}, {"rating": 5.0, "review": "What a great buy,  I love not having to go rent movies anymore and can watch movies that are still out in the theater right from the comfort of my living room and on my own flat screen and sound system. Love the voice activated search. I have cancelled my over priced cable and satellite and now watch everything threw my internet provider. Saving money that's the best part about amazon fire.  Along with the simplest of all installation.  P.S. Get a HDMI cable.  Not included  Thanks", "verified": true, "helpfulness": "1/1", "author": "Tom Woodworth"}, {"rating": 5.0, "review": "I have issues with my internet connection, for me is normal to expect buffering from any device while watching Netflix, so I have gone through several streaming boxes trying to find the one.I own several streaming devices, Netgear NTV200, Sony NSZ-GT1 Google TV, Roku and Chromecast.Do to issues with my internet connection, some of the devices are constantly buffering and disconnecting from Netflix they are the Netgear NTV200 and the Chromecast, they are cheap badly made devices, and when you have problems with your internet service, they do not perform well at all.Until now the only device that was reliable and had the software and hardware to overcome my bad connection was the old Sony NSZ-GT1.I got surprised with the Amazon Fire TV, the tiny box has a lot of power, and the performance is incredible I have no interruptions while watching Netflix. I have seen it buffering few times, but it is extremely fast and much better than the Sony NSZ-GT1.The Amazon Fire TV is very compact device, feels solid and dense, it dissipates the heat uniformly so there are not hot spots in the device is just a little warm across its surface.The remote control works excellent, and it has that little nice and quiet click feeling in the buttons. The voice search works very well, but is not something that I really care about it, and it only works for Amazon content. The remote control is well made, feels solid and responds very well, since it is Bluetooth you do no need to point it directly to the device.The installation of the Fire TV is fast, and it detected my wireless router immediately, after you turn it on for the very first time, a short help video will pop up to guide you on how to navigate the menu and settings. There is a help section on the menu, which you may visit later on, if needed it. Right after the help video ended, the device downloaded an update, it took some time and I had to turn off and on the device, but I blame that in my internet connection.The packing is excellent with a very nice presentation, very detailed with a lot of finesse.The Good updateYou can do changes to the wireless IP or DNS (you can change the IP on the Chromecast, but not the DNS)The BadThe Amazon Fire TV does not have an android app, like Roku, Netgear, Chromecast and Sony that allows you to use your smartphone or tablet as a remote control. The Amazon Fire TV does not have an internet browser.Conclusion even though the Amazon Fire TV is an excellent device, I still do not have the one device that has it all, so I have a Chromecast attached in one HDMI to watch YouTube (is the only thing that plays without constant buffering and disconnecting), and I have the Amazon Fire TV in the other HDMI port to watch Netflix and Amazon Prime. I have a tablet or smartphone to control the Chromecast, a remote control for the TV, and the remote control for the Fire TV.The only device that has it all is the old Sony NSZ-GT1, but it is heavy and bulky, with an old Google TV version that will not update. But this old junk has a remote that controls my TV and the device, it has a keyboard, it has a browser, Netflix, YouTube, and an app that allows me to control all from a tablet or smartphone, but it doesn't have Amazon Prime.", "verified": true, "helpfulness": "5/5", "author": "Alex CK"}, {"rating": 1.0, "review": "I wish I could give 0 stars!  This was a waste of time ordering and installing!  We were so excited to try the Fire.  We have 4 Roku boxes in our home, one quite old and 3 Roku 2 and Roku 3 boxes.  I would choose our Dinosaur Roku over this piece of trash any day!  We installed and started checking it out right away.  Show after show we started playing would play for a few minutes and then freeze.  Is this box defective and others are great?  Or are they all garbage?  I don't have the patience to try another.  My experience says FORGET IT!!  We are sticking with Roku and will spend our hard earned money on another new Roku box to replace our old one.  Also if you are excited about the VOICE FEATURE, make sure you read through and understand it is only going to work on your Amazon Prime account and not your other providers, like Hulu, Netflix, etc.", "verified": true, "helpfulness": "14/28", "author": "Angela R. Perona-hartwich \"Angie\""}, {"rating": 4.0, "review": "I purchased the Fire TV box the first day it was available. When it came I was amazed at how small it was.It was quick and easy to install. The picture and sound are great.I do wish the USB port was functional and could access my media drive.", "verified": true, "helpfulness": "1/1", "author": "David L. Miller"}, {"rating": 3.0, "review": "I bought this the day it came out, and i will probably use my roku2 more. they removed some of the functionality. Like the \"start from beginning\" , which i use a lot as a prime member. now there is only resume and buy really. I know some will say just hit fast rewind,, but ,, well why remove the start over.Also on the my watch list, the amazon interface on roku had separate lists  movies and TV, now they are rolled into one long list all mixed into one. if you have 40 items on it,, it is annoyingThe set up was pretty much done before it got here which was nice,  but leaving the simple things out like start over and whole watchlist now one list is annoying.. hopefully they will put back those simple features. but until that happens i am staying with my roku.", "verified": true, "helpfulness": "2/2", "author": "ChrisInNH"}, {"rating": 5.0, "review": "This is really amazing I almost purchased the ROKU but the salesman at Best Buy told us that the Kindle Fire TV would be better since we purchased the Kindle Fire from Amazon. My husband really loves it and recommends it to others. The things that you can do with it are amazing.", "verified": true, "helpfulness": "0/0", "author": "Sheri Harris"}, {"rating": 5.0, "review": "There is not enough space here to talk about the union of this wonderful Amazon Fire TV and Amazon Prime service as you should get both to fully enjoy the many TV shows, movies, etc.I have never experienced such accuracy in a voice control device and it gets you so amazingly quickly to the media you want.  It will connect flawlessly to your wireless network, but for the highest performance, try and run an Ethernet cable to your Router, and of course make sure you have a spare port to accommodate it.Fantastic product especially if you enjoy the many great TV shows available and you'd rather watch it on your television!", "verified": true, "helpfulness": "0/0", "author": "Stephen Surfaro \"SteveSurf\""}, {"rating": 1.0, "review": "I was excited about the idea of not having to type titles anymore. However, the search only works for Amazon titles. You can't search Netflix or Hulu with just your voice. Making the feature worthless to me. I feel the entire thing was designed to promote Amazon's own agenda from their Fire Tablet to Prime library. Don't get me wrong, I do like Amazon Prime. But I will be returning this and purchasing a Roku 3 instead.", "verified": true, "helpfulness": "28/41", "author": "Scott Hall"}]