[{"rating": 5.0, "review": "Very impressive! Easy to use and sync with my phone and laptop", "verified": true, "helpfulness": "0/0", "author": "anthony baruso"}, {"rating": 4.0, "review": "Great product...easy to use. I would give it 5 stars if I could actually use the usb port to add external storage. I would purchase more content if I had room to store it......duh", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "Love it !!! Very happy with this product as a Prime member", "verified": true, "helpfulness": "0/0", "author": "Judi Asmondy"}, {"rating": 5.0, "review": "i love love love my amazon fire stick! so much easier to use than the apple tv apparatus. i highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "anne carlo"}, {"rating": 5.0, "review": "If I was not notified I was purchasing a refurbished item, I would think it was new. Works without any problems.", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 4.0, "review": "Great tool, Easy installation  reasonably priced allows  Prime members to watch mutiple television shows and movies. I especially enjoy the voice command. Nice going Amazon", "verified": true, "helpfulness": "0/0", "author": "Kenneth R OBrien"}, {"rating": 5.0, "review": "Amazing device! Applications connect super fast. The menu is easy to follow. Just over all a great product!!", "verified": true, "helpfulness": "0/0", "author": "Gil Lopez"}, {"rating": 4.0, "review": "Very very good, easy to install, good picture.", "verified": true, "helpfulness": "0/0", "author": "Felton Vickers"}, {"rating": 4.0, "review": "not quit as good as i expced but maby i do not know all that is avable", "verified": true, "helpfulness": "0/0", "author": "paull"}, {"rating": 4.0, "review": "Pros: Overall very good viewing experience. Easy to navigate and has a very intuitive user interface.Cons: Lack of volume control, the voice search is not app specific", "verified": true, "helpfulness": "0/0", "author": "Srikanth V Ravisankar"}]