[{"rating": 3.0, "review": "Love this but the shows are old and boring.  Very easy to set-up.", "verified": true, "helpfulness": "0/0", "author": "Cara H."}, {"rating": 5.0, "review": "after my son installed amazon fire TV  I have enjoyed it  greatly.", "verified": true, "helpfulness": "0/0", "author": "olive bailey"}, {"rating": 1.0, "review": "As a streaming media center this box is the best.On that alone I would give five stars.But.... there is an issueI bought this to also play games on and there is not enough space. They say there is 8 gbs available but reality is about 5.5. Now if you don't want any games that's more then enough. But I tried of the racing games with all my other games and apps, and it wouldn't play untill I freed up space. This box should of come with 32 gb of usable storage or open up the usb to be able to plug in an external hard drive.I'm saddened to say the lack of space is why this received a low review.", "verified": true, "helpfulness": "2/6", "author": "brad"}, {"rating": 5.0, "review": "Excellent value - easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Rena Offutt"}, {"rating": 4.0, "review": "Works very well. Love it.", "verified": true, "helpfulness": "0/0", "author": "David Hall"}, {"rating": 5.0, "review": "She loves it.", "verified": true, "helpfulness": "0/0", "author": "john revis"}, {"rating": 5.0, "review": "Amazing! This was so easy to set up. The voice feature is so cool. I have only had it hooked up for one day, but I am loving it so far. It is very small so it fits nicely on my tv stand. The remote is also very easy to use.There are two minor gripes......first is : since this requires an HDMI cable, it should be included with the purchase. Second: I bought this for $99.00 and now it is being offered for $84.00. I feel somewhat cheated.", "verified": true, "helpfulness": "0/0", "author": "Snowshoe"}, {"rating": 5.0, "review": "Just works like it's supposed to.", "verified": true, "helpfulness": "0/1", "author": "Tango Mike"}, {"rating": 5.0, "review": "I have had this device for about 1 week. So far its been all good. This device was easy to install and offers great content which you can use voice control to find just about anything to watch.", "verified": true, "helpfulness": "0/0", "author": "Danny J. Smith"}, {"rating": 5.0, "review": "Can't go wrong with this purchase! I got rid of cable...and bought this over the Apple TV....I use Amazon more for streaming content....It streams fast and quality is very high! Love the voice command remote control! Easy to set-up and use....so no reason not to get one!", "verified": true, "helpfulness": "0/0", "author": "C&E"}]