[{"rating": 4.0, "review": "I love the free videos , movies etc that are available but do admit I was disappointed that there were so few I want to watch.  It is easy to hook up, easy to use.  The voice activation is fun and really reliable.  I am a Amazon Prime Member and that is why I purchased.  I was also disappointed in the number of apps available.  I would have liked several others that are free but they are not available.", "verified": true, "helpfulness": "0/0", "author": "J. Jones"}, {"rating": 5.0, "review": "Amazon Fire TV, Wow what a gem you are!  Absolutely a five star rating!  So easy to set up and use.  Streaming movies come in so clear without interruptions.  Love the talking function, works great.  If you have amazon prime, there are so many free movies and entrainment .  Love this device!!!  I would highly recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Donna SALISBURY"}, {"rating": 5.0, "review": "This box is very small, very easy to connect and use.  The voice control actually works even with some background noise.  I am a casual user.  I like having my Prime options, NETFLIX, etc... available in one place.  I know I'm prejudiced because I love all my Kindle and \"Fire\" products and recommend them to everyone.", "verified": true, "helpfulness": "2/2", "author": "Txgrl"}, {"rating": 5.0, "review": "So far we are really enjoying the Fire TV.  Easy to plug in and begin using.  We already had Amazon Prime with a Kindle Fire so we plugged it in and began watching movies and listening to movies right away.", "verified": true, "helpfulness": "0/0", "author": "M. Miller"}, {"rating": 1.0, "review": "I do not recommend purchasing this device. It is very limited in terms of app selection, there are a lot of firmware problems, and the devices ability to connect to wifi seems very limited.I was disappointed to find that many of the tv apps that I  currently pay for and enjoy on other devices are not available on fire tv. HBO Go and Crunchyroll are two that I am sorry not to see available. Not that it matters, the device claims that I have a \"slow internet connection\". I have tested my internet connection, and found that I have over 2mbps in that area. All of my other devices are working fine, but even when they are disconnected from the internet, fire tv is still not making an acceptable connection over wifi. I can only conclude that there is a problem with the device's ability to connect to the internet via wifi.In addition, I have come across several instances where I had to re-download an app because the data was \"corrupted\". This may be a result of the device's inability to appropriately connect to the internet via wifi, but it is a problem that I have never seen in other android based operating systems.And along the lines of the operating system, I find it ethically questionable (at best) that amazon would consider it ok to resell android apps through their own store. No other android os device (with the exception of amazon's kindles) does this, but now I have to pay again for any games that I may want to play on fire tv.Overall, I am very disappointed with this device. Even at $100 the device is not worth the frustration it causes.", "verified": true, "helpfulness": "4/13", "author": "Jeremy"}, {"rating": 4.0, "review": "It will be once more prime movies are added.  Selection of TV series very good.  Very easy to operate.  Nearly plug and play.", "verified": true, "helpfulness": "0/0", "author": "Cinda Raupe"}, {"rating": 4.0, "review": "I've had the Fire TV for a few months now, and can safely recommend the device to anyone looking for an extremely low-profile media streaming system. Easy to navigate interface, capable of light gaming. Overall very solid device.", "verified": true, "helpfulness": "1/1", "author": "Raymond B \"RDB\""}, {"rating": 5.0, "review": "I love the Fire TV. I have had Amazon prime for several years as well as netflix streaming. With the FIre TV I don't get any video lagging even though it's a wireless router connection. I also bought an AmazonBasics Extreme Performance HDTV antenna. Now I get movies, local tv, and lots of other stuff. I cancelled my cable TV that was costing me 112.00 a month for only a few good channels. Now for less than 18 bucks  a month I get netflix and Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Woody1"}, {"rating": 5.0, "review": "Purchased Fire TV the first day it could be ordered. Then saw that a year of Amazon Prime is included for non-Prime customers. I called to request that those who are already Prime customers have a year added to our membership with the purchase of Fire TV. The representative stated the offer was for non-Prime members only. I asked that my concern and request be given to whoever could address the issue. When the Fire Phone was announced those who purchase and are already Prime members will get a year of Prime added with more years for more Fire Phones; \"purchase three Fire Phones, get three years of Prime\".Thus, I again request that Fire TV purchasers who are already Prime members can have our membership extended by one year.I will appreciate Amazon's consideration.", "verified": true, "helpfulness": "1/4", "author": "Sense Wonder \"Sense Wonder\""}, {"rating": 4.0, "review": "Just passed my 30 day free trial. Looked at the wife and she said \"It's a Keeper\". She is adverse to tech, finds much of it 'too complicated to use'. She was surprised that with a  very small amount of coaching from me (mostly of the 'you can do this' variety) she is able to operate the Fire TV and without the use of \"Colorful Phrases of the Drunken Sailor\" variety.A couple of positive thoughts as of this time:1.The Fire TV is extremely fast in accessing/playing content compared to the blu-ray player that I had been using to connect to Netflix.2. The voice recognition is very good.3. The picture quality is very good.4. The remote is well designed and easy to use with a simple layout and just enough buttons.5. The Prime Content on Amazon is improving daily.6. With Prime and Netflix you have most bases covered. If Netflix doesn't have it quite often Prime does and visa versa (example: streaming \"The Sopranos\" - Netflix no - Prime yes.Some 'could be better' thoughts...1. Searching for \"Prime Streaming\" content is a pain both on the Fire TV and Amazon's site. There should be a \"Prime Streaming\" category on both.2. The layout of anything you add to your watch list is single line, left to right, so if you have 50 items in the watchlist and what you want is number 50 - get ready to \"scroll, scroll, scroll yer 'mote...\"3. Searching for other apps is the same scroll, scroll, scroll. A simple grid would be nice of say 15 - 20 icons and then scroll to the next page of icons.4. Would be nice to be able to reorder your watch list in a similar manner as Netflix. As it is now when you add a new item it goes to the head of the line and it's scrolling time.I was going to purchase a Roku box but I am very happy with the Fire TV and can see it only getting better in time with feedback from those of us who own it.A very good beginning.I", "verified": true, "helpfulness": "3/3", "author": "Dokrok5150 \"Dr. Rock\""}]