[{"rating": 5.0, "review": "I had tried serveral streamers,I had problems wife could not adjust.I am tech she is not,the voicerecognization made this for us she uses the fire tv on Amazon no problem.Goodbye Comcast", "verified": true, "helpfulness": "3/3", "author": "tommy \"tmech\""}, {"rating": 4.0, "review": "I enjoy my Amazon Fire TV, I discover new things every day, but...I do not enjoy turning on/off by plugging in/out. I cannot believe Amazon did not take this into consideration when they designed it. All in all, the size is very convenient, the ease of searching with my voice is great, but it sure dampens all my comfort when I have to get up at the end of my evening just to unplug this unit.", "verified": true, "helpfulness": "1/1", "author": "Jammn3"}, {"rating": 5.0, "review": "I love it, I love it.  I love it.I had been using my Wii to view movies. The Amazon Fire TV is awesome.  I no longer experience loadings in the middle of the a movie or tv show.  It is so much more clearer than the Wii.  When I speak in to the voice thing it actually works and understands me.  The Amazon Fire TV is the best.  I only use mine, I no longer look at regular tv.  I find my self using my Amazon Fire TV all the time.  My Wii is gathering dust.  The speed that Amazon Fire TV loads really fast.  I no longer have to wait to see my favorite shows.  The Amazon Fire TV is the best.  I love mine.", "verified": true, "helpfulness": "2/2", "author": "gloriagrandma"}, {"rating": 5.0, "review": "Enjoy the variety this device offers..Much better than Google's.  Easy to use interface and voice activation is nice!  Thank you Amazon!", "verified": true, "helpfulness": "2/2", "author": "Diana Ramirez"}, {"rating": 3.0, "review": "amazon blew this one not as many apps as other streaming players and the voice only works on amazon video not other apps like hulu plus and netflix like i was told....very disappointed with product wouldnt recommend buying this", "verified": true, "helpfulness": "0/4", "author": "shane mcbain"}, {"rating": 5.0, "review": "Love it.  Rock solid performance, great interface, expedited access to Prime content and intuitive user experience.  I've owned Roku and Apple TV boxes; Fire is so far superior it's not even a fair fight any more.Nice work.", "verified": true, "helpfulness": "3/3", "author": "Tom Dwyer"}, {"rating": 5.0, "review": "I own both Apple and now Fire TV. I have to say the Fire TV is so much faster and the quality of the image is extremely better. I watch Netflix and Prime from Amazon as well as U-tube. I bought the Apple for my wife to stream her ipad and you can't get a full screen on the TV, very disappointing. Go with Amazon. You'll be happy with it. The hook up took about five minutes, so easy. The remote is better then Apple too.", "verified": true, "helpfulness": "2/2", "author": "Sammy"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV from Best Buy (because I didn't want to wait for it to be shipped! :) ) on May 9th, so I've been using it for just over a week.I had previously been using my son's Apple TV, but was frustrated at not being able to watch AmazonPrime.The Amazon Fire TV was extremely easy to set up.  The interface is snappy, and easy to navigate.  (Compared to the Apple TV, which I thought was slow and clunky.)  I like the remote, it has a nice shape and and the buttons are just right - they aren't too sensitive, nor does it take a lot of pressure to get a response (which was sometimes the case with the Apple TV remote).I have cable internet and have had absolutely no issues with buffering on any shows or movies I have watched on AmazonPrime or Netflix.I've used the Pandora app, and it worked very well.  I haven't tried any other apps or games.  (It is highly unlikely I will choose to play games via the Amazon Fire TV, as I have a Kindle Fire that I use for that).I tried out the Netflix app, and I have to say, I really prefer the interface in the Amazon Fire TV to the Netflix in the Apple TV.  (I am still amazed at how different the Netflix interfaces can be between smart TVs, DVD players, and these little boxes!)I tried out the voice search, and it worked (not the first couple of times, I was probably speaking too fast).  I doubt that I will use this feature very much, especially since it's limited to the Amazon content, but I did test it.I am very very pleased.  I would definitely recommend to anyone looking for a device to access multiple services for video content.", "verified": true, "helpfulness": "2/2", "author": "C. Minor"}, {"rating": 5.0, "review": "There are very good amount of reviews written by Amazon community members who are very thoughtful by sharing their views on this product and I must agree with them that this streaming media player is geared towards one main goal that is to get 'Amazon content' to your TV at lightning speeds! - Kudos to the engineers and developers on this amazing piece of hardware & extremely clever software programming delivering a product that is 'user friendly' and very well presented & executed - Bravo! Bravo! Bravo!The quad core 1.7Ghz Snapdragon processor combined with dedicated Adreno 320 GPU shows its `raw power' when you navigate screens & view content. It is by far (according to my experience) the world's fastest streaming media player till date in terms of hardware specs. Everything is `snappy fast' and instantaneous when viewing content from Amazon and other apps. There are no streaming delays or wait loading content ever. I must admit that after using more than a year with Prime Subscription running on discontinued Logitech revue (Google TV)'s poor Amazon Video application I consider this Amazon Fire TV light year ahead of the game in all respects. For people who are still hanging on to Logitech Revue my suggestion is give up on Logitech Revue and switch to FireTV. Trust me you not regret it.The voice search capability is by far the best I have seen in any platform till date and I must admit it works extremely well for searching Amazon content. I hope to see the feature extended to popular apps in the future making it even more productive.The FireOS which is actually a very heavily tweaked Android OS but credit must go to Amazon's software developers for customizing Android OS for making it extremely user friendly while still keeping it open for tweakers to side-load unsupported/untested/unofficial applications if needed via ADB. Amazon has made this legal & official and is documented on Amazon's developer portal if you want to get third-party apps side-loaded.The `official' third party application support currently available on Amazon's web portal is not that great but IMHO will improve over time since this hardware is capable of doing much more than what it is currently being used for. The first application that got my attention was `PLEX'. Installing PLEX app gives you the capability to stream all your local media files while still maintaining the same look and feel of the excellent UI. You will however have to dedicate a PC to run their server software for trans-coding unsupported file formats but using PLEX gives you beautiful backdrops & information that is worth the effort for dedicating a PC just for media streaming. PLEX also opens up the world for 1000's of channels that is currently not available for Amazon FireTV.You can side-load XBMC media center (XBMC 13.0 Gotham for Android (ARM))if you are familiar with can also give you similar experience like PLEX without having to dedicate a transcoding server on your home network but XBMC still needs a lot of polishing & skins to match what Amazon FireTV UI has to offer. I am sure developers of XBMC will come up with an official app soon to take advantage of the raw hardware Amazon FireTV has to offer.The YouTube for FireTV application is also one of the best that one can get in any platform making this streaming media experience a joy to use. The Dolby Digital Audio out from FireTV makes the video and audio experience very good. YouTube app needs some polishing but the instant playback of video makes up for all the current bugs & short falls.You *do* need a decent broadband internet connection (3Mbps or better) for best content streaming experience. Most of us already have a good internet connection that we already pay for every month and barely use it. Once you have a good internet connection there are plethora of channels that you can spend hours browsing & viewing them at lightning speeds. There are popular channels like Netflix,Hulu Plus etc; etc; I personally do not own a Netflix account but it is there if you like and will get better over time with many more channels to come as content providers rush to capitalize on Amazon FireTV's excellent raw hardware power to deliver their content alongside with Amazon's content.Amazon fire TV is great for what's worth for watching Prime instant videos & occasional gaming on big screen TV. Voice search is very good too using the included remote but there is one issue that being the fact that the remote is 'Bluetooth' not 'IR' so that means you cannot teach your programmable universal remote with the command sets from Amazon Fire TV remote. I have been trying various methods to use my universal remote which I use to control all my audio/video pile of Equipment of my home theater to seamlessly work with Amazon Fire TV but not an easy task since the remote is 'Bluetooth' based.After doing some research on-line I found that certain 'IR remotes' which were designed to be used with Microsoft Media center (MCE) somehow do work but only certain picky types of MCE IR remotes. I took a gamble and bought this Ortek Media Center MCE PC Remote Control and Infrared Receiver since it looked pretty much same (Especially the controller) and I can confirm that this works with Amazon Fire TV and I was able to use the included remote and program my other universal remote all the basic commands one needs to navigate Amazon fire TV's user interface. The only thing that does not work with the IR remote is the closed caption choice (CC) button which is no big deal! the other benefit of using IR remote is that you can put the Amazon Fire TV to sleep by pressing the power button which even the original Bluetooth remote from Amazon cannot do it :)There are so many good content to view from Amazon Instant video with Prime membership and completely commercial free that Amazon fireTV has to offer that by paying yearly $99 for Prime membership (which has other benefits like free 2 day shipping) and one time $99 dollar investment on this streaming media player you can `cut the cord' from your cable company for good.I have owned several streaming media players in my life over the years but this is by far the best $99 I have spent on a streaming media player till date and I love it.- Full five stars!", "verified": true, "helpfulness": "6/6", "author": "rbhatta \"A Dinosaur you can trust!\""}, {"rating": 5.0, "review": "Nice gadget. Works great, user friendly, makes watching tv on my streaming apps easy as pie! Even my technology impaired boyfriend can figure it out!", "verified": true, "helpfulness": "1/1", "author": "nugget31"}]