[{"rating": 3.0, "review": "Got this to use for Prime video and Netflix and Netflix does not work . When the problem with Netflix is fixed I will up the rating.", "verified": true, "helpfulness": "0/1", "author": "Mary Lutz"}, {"rating": 5.0, "review": "It is just like Amazon says it works and is easy.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "This was a great addition to my entertainment system! Love the voice response feature as well!", "verified": true, "helpfulness": "0/0", "author": "Oscar Blanco"}, {"rating": 3.0, "review": "works well, but we are having to get more bandwidth on our cable service as streaming is constantly interrupted when looking at movies.  Hopefully others don't have the problem, but something needed to be looked at before making the purchase.", "verified": true, "helpfulness": "0/1", "author": "D. Smyth"}, {"rating": 4.0, "review": "Great device. A little hard to find how to turn it off", "verified": true, "helpfulness": "0/0", "author": "Jeffrey W. Weekes"}, {"rating": 5.0, "review": "Great since I have Amazon Prime membership. I can use plex media server with it and it works great. I got it on sale over the holidays so even better for me.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "I will admit something... I get incredibly annoyed with over complicated technical gadgets. Love to use them, can read directions and set them up if I have to, but if the manufacturer makes it user friendly and simple I am a passionate fan for life. That is certainly the case with Amazon Fire. Here's all I had to do. 1) open the box 2) put the small black box next to my TV 3) plug the charger into a wall socket, 4) plug in an HDMI cable one side in the TV and the other in the Fire box. 5) turn the TV on.  Presto, a world of Movies and TV shows at my disposal. The voice button on the remote works flawlessly. Really love this - only downside is that I have not done any chores in the house this week because I'm a little obsessed with how much there is to watch. Balance :)", "verified": true, "helpfulness": "0/0", "author": "Leyden-Mom"}, {"rating": 5.0, "review": "The new Amazon Fire TV was easy to set up and use.  The voice search feature on the remote is unbelievable!!", "verified": true, "helpfulness": "0/0", "author": "Jamie Ward"}, {"rating": 5.0, "review": "Great technology!", "verified": true, "helpfulness": "0/0", "author": "don"}, {"rating": 5.0, "review": "Love the fact that is has netflix AND amazon prime streaming in one device.", "verified": true, "helpfulness": "0/0", "author": "phpaquilla"}]