[{"rating": 5.0, "review": "Where do I begin? The Fire TV is an amazing device full of potential that hasn't even been tapped yet. They don't even advertise the most incredible things that it can do so I'd recommend spending some time on Google. One of my favorites is side loading OnLive and using my fire TV and even my fire TV stick as $2000 gaming PCs. Seriously Amazon should look into partnering with or buying OnLive it's the future of video games. If you are debating which set top box you should get to make your dumb TV smart or your let's face it, worthless smart TV even smarter this is the device for you. On a side note for those interested, the Fire game controller is awesome and works well with OnLive.", "verified": true, "helpfulness": "2/2", "author": "Kevin"}, {"rating": 5.0, "review": "I also have the Amazon Fire Stick which I recommend if you want to spend less.  The IPAD has the Fire app for voice controls so a separate voice remote is not necessary for either the \"stick\" or the \"box.\"", "verified": true, "helpfulness": "1/1", "author": "Jeffrey J. Stone \"flag fox\""}, {"rating": 5.0, "review": "This little box is awesome! The CPU bearly breaks a sweat playing everything I can throw at it including 50GB bly-ray rips. Amazon FireTV is a joy to use.", "verified": true, "helpfulness": "1/1", "author": "Ryan D."}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Gloria F Carroll"}, {"rating": 5.0, "review": "Best Product I bought on Amazon so far.  It is easy to setup and even easier to use.", "verified": true, "helpfulness": "0/0", "author": "Anthony Como"}, {"rating": 3.0, "review": "The unit works great but we got hooked on a free BBC series season 1, and season 2 required a $26 fee was a shock.", "verified": true, "helpfulness": "2/3", "author": "Elvis J. Nelson"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Francisco Coronado"}, {"rating": 5.0, "review": "We received this as a gift from our sons and absolutely love it! A great alternative to satellite TV.", "verified": true, "helpfulness": "0/0", "author": "Paula Dorminy"}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Raymond Gilman"}, {"rating": 5.0, "review": "So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]