[{"rating": 1.0, "review": "Not enough options.  I have most of my video library on VUDU and that is not available on Fire TV.  they do have Flixter which shares most of the library, but not any of the TV shows that have been purchased through VUDU.  I will be switching to Roku which offers much more", "verified": true, "helpfulness": "2/4", "author": "Randy Houck"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "1/1", "author": "Lori"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Julio A."}, {"rating": 5.0, "review": "We love our new alternative for entertainment", "verified": true, "helpfulness": "0/0", "author": "LISA S."}, {"rating": 3.0, "review": "Works - lots of surprise channels not listed specifically on product site.  Only wish that Fox news had an app on this Fire TV.  This will be the end of cable bundles as we know it.  All TV and cable channels will migrate to this option soon.  Internet bandwidth will be the next evolution for this service.UPDATE!!!!After 3 weeks of this product and it being a prime source for TV I have realised it is in it's infancy.  The channel CBS news is so pathetic it has only 3 advertisements - how many times can I hear about Titan Fall and the stupid Microsoft cloud.  Really?  About 40% of the channels charge a subscription of approx. $9.95 each month - I guess that is the pain threshold for a purchase.  Hulu plus is a joke of a different type  and has by far the worst movie line up ever.Again, product is like the Model T or the internet in 1992.  It has a long way to go.Some saving graces are the History channel and Pluto tv.Apps crashing so much it must by running on Windows Vista!  Seriously Bloomberg, BBC and others crash on a regular basis.", "verified": true, "helpfulness": "1/1", "author": "Joyce Mack"}, {"rating": 4.0, "review": "I like it a lot. It's easy to use and set up. I'm mostly happy with the amount of channels that are available. I'm a little disappointed that there are no free media player channels. I also have a roku 3 and there is a free media player channel available for it. It looks like it will be somewhat challenging to get it to play content from a flash drive on it from what I've read. Also I wish the roku 3 and the Amazon fire TV could get the abc family app.", "verified": true, "helpfulness": "1/1", "author": "Miranda Thoen"}, {"rating": 5.0, "review": "Easy To Use, and Excellent picture and sound.", "verified": true, "helpfulness": "1/1", "author": "Kevin White"}, {"rating": 5.0, "review": "We love it! Super fast and easy to use. The only thing i wish was different: an easier way to turn it off/sleep.", "verified": true, "helpfulness": "0/0", "author": "Jennifer L."}, {"rating": 5.0, "review": "I am so excited and pleased.  Wonderful gadget.", "verified": true, "helpfulness": "0/0", "author": "Angie Thomas"}, {"rating": 5.0, "review": "We are so in love with this thing I wish I had purchased it sooner!!!  So user friendly, set-up was a snap and easy to navigate through.", "verified": true, "helpfulness": "0/0", "author": "L. A. Reynolds Wallace"}]