[{"rating": 3.0, "review": "I used the FireTV for 2 to days and tested the apps I use on Roku 3 as comparison. I think the device has potential, but its in it's early stages.  Things I didn't like:The menus are focused primarily on Amazon Prime Content.Voice search only searches amazon.  By comparison, the ROku 3 search searches numerous apps for your desired content.Apps with commercials had significant delay between commercials and made it feel like you're watching internet content.The remote clicking noise is considerably loud.The one feature I really loved is the Spotify Connect server it has worked well.It's just not near the device or content support of the Roku 3, and focuses too heavily on Prime content and games.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 3.0, "review": "This product can be great, or below average, depending on your needs. I have been searching and searching for the ultimate home theater box that had all the content I wanted, and was easy to use. I had extremely high hopes for this device before I bought it, but sadly, this doesn't fill the spot either.First, if you pretty much only watch content from the internet, and especially from Amazon, then this box will probably be great for you! It does a great job at streaming Amazon content (and this is because Amazon is greedy and blocks a lot of other companies from doing this...) and it does have a lot of choices for online content. The voice search they talk so much about, only works for Amazon...(though I think they are going to add Netflix maybe?)so that isn't near as useful as they brag about. The device is very fast, though mine bogs down fairly quickly and I have to pull the plug and restart it every couple of days if there is a lot of usage (I never had to do this with my Apple TV...so much for all those better specs). When it doesn't bog down, it runs great, and has a lot of games as well, which at first, I thought was just a gimmick, but they have actually turned out to be really handle when you are entertaining. There are several trivia style games that you can play on the TV and everyone can use their smart phones as controllers. This alone is a huge bonus for this device, it has lead to a lot of fun nights.My big problem is local content... I have a lot of media stored at home that I want to watch. The Fire TV does support Plex, but unfortunately Amazon took shortcuts and has VERY limited codecs for video/sound, and very poor surround sound support. This leads to a LOT of problems using Plex on this device if you care about sound quality at all, and even a lot of videos that just won't play. So if you have local content that you are expecting to play using Plex, and especially if you have surround sound, go elsewhere, other devices have much better support, like the Roku.", "verified": true, "helpfulness": "0/0", "author": "Jay Edgemon"}, {"rating": 2.0, "review": "Biggest reason I bought this was being able to stream live events from YouTube and watch them on my TV. Unfortunately,  the device refuses to do so. It says, it is unable to play the video.  No go. I wanted to take it back to the store but my girlfriend  likes the Netflix app. So, I'm stuck with it. Bummer.", "verified": false, "helpfulness": "1/3", "author": "Ozan"}, {"rating": 4.0, "review": "Awesome.  Love the Voice Search.", "verified": true, "helpfulness": "0/0", "author": "R. Anthony Solis"}, {"rating": 5.0, "review": "2gb ram ( 4x more than Apple, Chromecast, and Roku)The system itself is a matte black finish and quite small. It is oddly very heavy though. The voice search is fast and works pretty well. The drawback is that it does not work within apps. If you try it just takes you back out to the home screen.The system looks just like a Kindle Fire tablet looks.The apps are very good, Actually Amazon just inked a deal with HBO, HBO Go is coming soon. It has Netflix, Hulu, Twitch, Youtube, Showtime, WatchESPN, etc.The gaming feature on this is second to none. The remote is a separate buy and cost $40. It is similar to an XBOX 360 generic remote. There are 300+ games on here and they run very nice. I let my son play sonic and it’s a great babysitter.Here are some cons:Chromecast has an app Plex which allows you to stream from your pc!The search is terrible. It is a carousel feature where you have to select each letter one at a time. Most other units show a full keyboard and you can wiggle around. This search is long and painful.", "verified": false, "helpfulness": "0/0", "author": "49erJoe"}, {"rating": 3.0, "review": "Could not find a question/ answer area. Does the Fire TV work with my computer? Will I be able to see what I am looking at on my computer with the Fire TV?", "verified": false, "helpfulness": "0/1", "author": "William"}, {"rating": 5.0, "review": "easy to use - kids seem to enjoy all of the options", "verified": true, "helpfulness": "0/0", "author": "PATTI A FARLEY"}, {"rating": 1.0, "review": "How asinine is Amazon and Kindle to develop a Wi-Fi based product without provisions for a proxy that included terms of service on Wi-Fi accounts. If you have Wi-Fi that requires terms of service in a browser, you've just wasted money on a door-stop. They've had this problem for years. It seems, and they just don't care.", "verified": true, "helpfulness": "2/9", "author": "Brent Worls"}, {"rating": 5.0, "review": "This is really cool , compact size both the box itself and the remote , very modern , beautiful! It works well , I like it better than I do My Roku.", "verified": true, "helpfulness": "0/0", "author": "Taisto O Pitkonen"}, {"rating": 5.0, "review": "I love this! I'm thinking about buying a second one. I decided to drop cable and so far with this device along with my Amazon Prime membership, Hulu Plus, and Netflix is more than enough to do without cable.", "verified": true, "helpfulness": "1/1", "author": "Jillian Gingery"}]