[{"rating": 5.0, "review": "Loving this product. Seems to be able to do it all. Super easy to install and navigate.", "verified": true, "helpfulness": "0/0", "author": "Steven Mora"}, {"rating": 5.0, "review": "I love it. the Voice recognition works great. Very cool. The only change I would like to see is to easily tell what progarms are free with Prime...and what you will have to purchase.", "verified": true, "helpfulness": "0/0", "author": "Todd williams"}, {"rating": 5.0, "review": "Love it. I have an Apple TV, that I am unable to use. The Apple TV has a weak/slow processor and is not user-friendly. Amazon Fire TV is incredibly easy to use, easy to navigate, and has amazing speed. Love it!", "verified": true, "helpfulness": "0/0", "author": "Derek A Hickman"}, {"rating": 5.0, "review": "OMG!!!  Where has this little box been all of my life????  This technology is absolutely phenomenal and exceeds my expectations on all levels!!!  LOVE IT!!", "verified": true, "helpfulness": "0/0", "author": "Rochelle Skipper"}, {"rating": 4.0, "review": "Very good box.  Had a couple of problems where movies on HULU would not open.", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "Love it lots of family time !!!!", "verified": true, "helpfulness": "0/0", "author": "joanell word"}, {"rating": 5.0, "review": "Great product!! Fire TV has made online streaming so simple even my 5 year old son knows how to work it. The interface is user friendly and is really fast. The voice search is a nice feature I just wish it would find show within Hulu and Netflix not just Amazon Prime.  Overall this device helped my drop cable and go to online streaming only.  Thinking about adding another Fire TV or even the Fire stick to all my TV's.", "verified": true, "helpfulness": "0/0", "author": "Jared Mieczkowski"}, {"rating": 4.0, "review": "Setup was so easy - my daughter had it up and running in 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "ElleMada"}, {"rating": 1.0, "review": "It is very slow and all searches take you to prime which requires payment for shows that Net Flix has for free", "verified": true, "helpfulness": "1/2", "author": "Jill Silva"}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Monica Guzman"}]