[{"rating": 5.0, "review": "Returned the ROKU streaming stick and bought this instead. Since I already had Amazon Prime, it came preconfigured, all I had to do was connect it to our wireless network. It's very quick; movies load quickly and there is no buffering. The voice remote is amazing, no more painful typing out of words using a remote. I'm very happy with this, was worth the cost. Love it!", "verified": true, "helpfulness": "1/1", "author": "Jan Dye"}, {"rating": 4.0, "review": "I really like how easy the entire process was from set up to use.  The first device I received was a lemon but Amazon was great about replacing it quickly. The content on Amazon Prime is pretty extensive with varied choices.  I enjoy the ability to use some of the apps on the system, particularly the music apps although it would be great if there was an option to blackout the picture and just have the music run.Overall, I am very happy with my Fire TV and use it regularly.  Would definitely recommend it to anyone not wanting to subscribe to a monthly subscription service.  Simply pay the once a year membership for Prime and watch as often as you like.", "verified": true, "helpfulness": "2/2", "author": "Hollywood \"Tap\""}, {"rating": 4.0, "review": "This is a neat gadget. It isn't as intuitive or user friendly as I'd like it to be. It can be awkward to navigate and sometimes takes a few minutes to figure out. That said, this is worlds better watching via a laptop or our Google Chrome. Well worth the price.", "verified": true, "helpfulness": "1/1", "author": "Chris \"Chris\""}, {"rating": 5.0, "review": "This device delivers performance that its competitors apparently can't as far as Ian tell. It's super-easy to install, has super clear images and loads super-fast. I am delighted with it.", "verified": true, "helpfulness": "1/1", "author": "A Happy Amazon Camper \"Book GAB\""}, {"rating": 5.0, "review": "I have an older bluray player that is \"smart\" but moves with the speed of a glacier (I guess we will need to come up with a new term to indicate slow movement - maybe move with the speed of congress?) I really like the way amazon has delivered a device easy to install/configure and use.", "verified": true, "helpfulness": "1/1", "author": "Richard H. Markuson \"rmarkuson\""}, {"rating": 4.0, "review": "Works great.  Easy to attach.  Unobtrusive - the white power / activity light goes out after a while if you are not using it so it is not a distraction in the bedroom at night.Voice search is really nice - however as it has been noted on many product reviews, voice search only works for videos in the Amazon library, and there are not many free (recent) videos.", "verified": true, "helpfulness": "1/2", "author": "WHASHBURN"}, {"rating": 5.0, "review": "The Amazon Fire TV is truly a fantastic product, small, unobtrusive, extremely easy to hook-up and start using immediately.  If you are an Amazon Prime member and you have a Television this is a very useful device to own.  We love the voice search capability.  This feature saves a lot of time finding the TV show or movie you want to watch.", "verified": true, "helpfulness": "1/1", "author": "kls0854"}, {"rating": 5.0, "review": "I'm one of those people who have WAY too much.  An Apple TV,  seven Roku devices from the original to now two Roku 3s.  I certainly did not NEED the Amazon Fire but I bought one anyway.  GREAT decision.  FAST, FAST, FAST!The voice system is exceptional.  To see my six year old grandson push the button and say \"Sid, The Science Kid\" is wonderful.If there is something more I would wish for is the headphone jack and volume control as on the Roku 3.", "verified": true, "helpfulness": "1/1", "author": "Gary"}, {"rating": 4.0, "review": "This thing is great, the video quality looks truly fantastic, and you'd have a hard time telling this apart from a bluray.  It also outputs a signal that makes my stereo receiver light up like a Christmas tree, and output the cleanest 7.1 sound I've ever heard over anything streamed online.  I don't get the same effect out of my ps3 or laptop.The device does have one major issue, every now and then, video will play choppy.  Resetting the picture scale helps.  It seems like a software issue, as the choppiness is confined to certain shows. (BBC's Dr.Who is just unwatchable on this).  So its either the compression on the steam, or the way this device decodes it. Still, 95% of content looks absolutely stellar.", "verified": true, "helpfulness": "2/2", "author": "D. Muya"}, {"rating": 1.0, "review": "So, I own an Apple TV that I'm extremely happy with, but I was looking for another streaming device for another room and one day I received an email from Amazon offering a free 30 day trial of the Fire TV so I figured I'd give it a shot. Once I got to the home screen I browsed around and downloaded a couple of apps like Netflix, Twitch TV, and YouTube, all which worked fine. So far so good. I then tried to find the free Prime TV shows/movies since I added my wife's Prime account to the device...and had a hard time really finding them. I'm used to an individual Amazon app like on my PS3 and 360 that will show me exactly what movies and TV shows I can watch, but the organization of that stuff is horrendous on the Fire TV. They are all mixed in with the movies you have to rent/purchase to watch. I did eventually locate some sections of free movies that I should be able to watch through my wife's Prime account....but no...when I tried playing them I got a message saying something like \"Prime Coming Soon\". It told me that it's taking longer than expected to add my wife's account to the device so I can stream movies to it. This went on for two days and never went away. I logged out and logged in again and still the same message appeared. The voice navigation works ok, so...that's a plus I guess..  Anyways, I'll be retuning it. I expected it to work a lot better than Apple TV since it's brand spankin new, but I don't care for the organization at all and I'm disappointed that it doesn't work with the Amazon Prime account.", "verified": true, "helpfulness": "7/12", "author": "gldoorii"}]