[{"rating": 5.0, "review": "Amazing device ! Best in streaming devices.", "verified": true, "helpfulness": "0/0", "author": "christian abarientos"}, {"rating": 2.0, "review": "Plex is my favorite and most often used App. Fire TV cannot handle Plex although it claims to support it. Yes I have a fast connection.My Roku 3 works great with Plex on the same connection. I see now that I was foolish to think I could throw it over for the new kid on the block. Fire TV just stalls, stutters, and usually will not reopen a video it has just tried to play. Supremely frustrating. I can't wait for UPS to get this and remove it from my home.", "verified": true, "helpfulness": "0/1", "author": "Just Jim \"Just Jim\""}, {"rating": 5.0, "review": "A nearly perfect TV entertainment device, wish it also had the functionality of Chromecast to be able to send content from your local network and tablets to the device.", "verified": true, "helpfulness": "0/0", "author": "Tungar Gencel"}, {"rating": 5.0, "review": "I absolutely love the Fire TV. It's small but does the job well. The connection to the remote is awesome. The speed is great and I actually like the interface. We got rid of our cable box and now just use Amazon Fire TV saving us at least $50/month for TV and internet. I ordered the Roku for our bedroom just to compare and I'm returning for the Amazon Fire stick.", "verified": true, "helpfulness": "0/0", "author": "Denise Moore"}, {"rating": 5.0, "review": "Awesome system for watching movies or surfing apps.  Easy to use and optional mounting system is a must for this.", "verified": true, "helpfulness": "0/0", "author": "Bob Sutton"}, {"rating": 5.0, "review": "Stable and lovely it does everything it should.  Best of all it does it FAST!Very nice especially with the game controller.", "verified": true, "helpfulness": "0/0", "author": "Chris Santapaola"}, {"rating": 5.0, "review": "Great box", "verified": true, "helpfulness": "0/0", "author": "michel valdivia"}, {"rating": 5.0, "review": "Very easy interface to use,  quick easy set up.  The box is near my router so I have it directly connected and the choices seem almost instantaneous.  No Issues so far.  Have been using for about a week.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "I am extremely happy with my Amazon Fire TV (I gave my Son my Amazon Fire TV Stick).  The Fire TV is an improvement over the Stick, which is also an excellent product, but much more basic.  The Fire TV truly expands your TV / HDTV adding many features only found on televisions costing thousands of dollar more than the average person would care to spend on the television.While I found several issues, they have NOT been with the Amazon section of the Fire TV.  Unfortunately not every company puts as much time, effort, and desire for a quality product (e.g. app).  I found issues with various applications written by others either because of a lack of documentation or simply a lack of good testing.  This review is not about those applications, as they're not by Amazon, but I wish NetFlix did a better job of documenting how their fast forward and fast reverse worked.  It certain isn't like the Amazon movies and thus unexpected and unconventional (for Fire TV users).One enhancement would be for the Amazon Fire TV to provide a setting forcing all video applications to use the same remote control button combinations.  Thus if you know how to fast forward with Amazon Videos, you'd know how to do it with Flixster, Netflx, YouTube, etc.Honestly you can not go wrong with the Fire TV or even the Fire TV Stick.  If you can't get nor want both, the Fire TV is the one to buy (or hold out for if money is an issue).", "verified": true, "helpfulness": "2/2", "author": "Bert in Chicago who is a happy and loyal Amazon Customer. :-)"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jennifer Pascucci"}]