[{"rating": 5.0, "review": "It was easy to hook up and works great. I have not had it long enough to explore all the options.Just select the movie on your Kindle and press watch on Fire TV and enjoy the movie.", "verified": true, "helpfulness": "0/0", "author": "charles carlson"}, {"rating": 5.0, "review": "The Amazon Fire TV Box is best with it's quad-core chip. HD streaming is superb compared to Apple TV 3 or Roku.The remote has a voice activated feature for searching with indtalled Apps like Netflix or Hulu. You can also connect an external USB keyboard for convenience of searching.Good Luck", "verified": true, "helpfulness": "0/0", "author": "Theater Guy"}, {"rating": 5.0, "review": "Very responsive and it is easy to use", "verified": false, "helpfulness": "0/0", "author": "Kurniawan Chandrajaya"}, {"rating": 5.0, "review": "Great product.  I'm going to drop my cable provider and go solely amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Jason Poelstra"}, {"rating": 1.0, "review": "While the device is easy to set-up and use, I'm only giving it one star due to the fact that I constantly get a \"low memory\" warning. While it states 8gb of memory, my understanding is only 5.5gb is useable. I'm not a gamer and have only a minimal number of apps stored. I even deleted many of the apps that came with the device, yet I'm still getting the \"low memory\" warning. This issue also affects the quality of video streaming.", "verified": true, "helpfulness": "0/2", "author": "John W"}, {"rating": 5.0, "review": "Works great.  I like how programs can be switched from other devices to Fire tv", "verified": true, "helpfulness": "0/0", "author": "David Fine"}, {"rating": 4.0, "review": "Pro: Easy install, very fast, no buffering so far.  Con: needs more apps. Dish anywhere would be my choice", "verified": true, "helpfulness": "0/0", "author": "Bob Hillegass"}, {"rating": 5.0, "review": "I love my Amazon Fire TV.  I have access to so many movies, music videos, and radio stations.  Love it, love it, love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Cynthia White"}, {"rating": 5.0, "review": "I ordered my FIRE TV in a bundle deal with Game Controller and HDMI cord. I LOVE my Fire!!!! It is so easy to use! Right out of the box. We have a ROKU, and this is by the easier of the two!!! There are games we paid for on our ROKU, or I would keep only my FIRE TV. I love it!!! Yes, I would recommend it to anyone!!!", "verified": true, "helpfulness": "0/0", "author": "cork999"}, {"rating": 5.0, "review": "Bought this for an XBMC client and so far it's working flawlessly. Will probably use this for other apps as well, just haven't done it yet. Great product!", "verified": true, "helpfulness": "0/0", "author": "Randy Higgins"}]