[{"rating": 5.0, "review": "i love this product! only one thing i don't know how to access my HBO now on it. Thank you Deloris Harris", "verified": true, "helpfulness": "0/1", "author": "deloris harris"}, {"rating": 5.0, "review": "I love it. I use it all the time, now all I have to do is get my wife to agree to cut off dish and I'll be a happy camper!", "verified": true, "helpfulness": "0/1", "author": "Robert C Davis"}, {"rating": 5.0, "review": "It not only met but exceeded my expectations. It is, by far, the best purchase I've made in many years. I now have more entertainment choices than I could possibly enjoy in a lifetime. It is a fantastic product, particularly since I also have a Prime account.", "verified": true, "helpfulness": "0/0", "author": "Chris Younger"}, {"rating": 5.0, "review": "I don't regret buying this.", "verified": true, "helpfulness": "0/1", "author": "Kouraga"}, {"rating": 1.0, "review": "I purchased the Fire TV shortly after it was released and was excited as it looked in video demos to surpass other systems/ applications in the market.  So very disappointed....Amazon has a way to go to make the Fire TV any where near what Roku.The TV and movies, prime, rent, new releases or purchase are all mushed togetherWatch list same TV and movies listed together.Same with the movies and tv shows you purchase.They want to compete with Roku and others need to make some updates to how content is displayed.Now see they stared using top of screen to advertise apps, TV movies.Really Amazon Roku and Apple TV had been out several years before you released Fire TV. Your product should have been the next step up.Seems that you just wanted to get the product release and make no improvements since.I am disappointed. For the price I should have purchased the newest version of Roku.", "verified": true, "helpfulness": "0/3", "author": "Kim"}, {"rating": 5.0, "review": "good price", "verified": true, "helpfulness": "0/1", "author": "steve hages"}, {"rating": 5.0, "review": "I a very good buy", "verified": true, "helpfulness": "0/1", "author": "jose solano"}, {"rating": 4.0, "review": "I am not technical at all, my husband connected the unit to the TV.  My only disappointment was that the Prime offers at no cost were not as many I had thought.  I do like that I can listen to my playlists through Fire TV.  I am hoping to find more perks once I am more familiar with the unit. I also like the fact that there is no subscription fee once you purchase the unit.", "verified": true, "helpfulness": "0/1", "author": "Alex"}, {"rating": 3.0, "review": "Good functionality. Clear picture. But, I get more video that is choppy, out of sync with audio than I've seen n quite a while. Restarting seems to clear it up for a while. Good news is it restarts much faster than the streaming player I replaced. It''s wired (RJ45) to my network so not a wireless signal problem. So only the one real issue but it's a serious issue for the device. Have not had time to look and see if there is any user action required to trigger a SW update check/download. Will update the review if I find a solution.", "verified": true, "helpfulness": "0/1", "author": "MAF1957"}, {"rating": 5.0, "review": "Very fast and it's way better than Apple Tv's.", "verified": true, "helpfulness": "0/1", "author": "AmazonP"}]