[{"rating": 3.0, "review": "If you are new to streaming, and you just want to stream amazon prime or netflix items, this is perfect for you.  If you have a roku or other device you will be very underwelmed.1. No amazon music app, Really they say it is coming I have it on my roku??????2.  A very limited number of other apps.3.  A very small amount of games, and most do not work or work correctly on the fire tv.4.  the voice search works well, but because it only works on amazon, most of the time I forget it is their.5.  No kindle app?? Audio books?I love amazon,  I do 90% of my shoping with them, and rave to my friends about the service. I am sorry to say this is the first time I regret ordering something with the amazon name on it.", "verified": true, "helpfulness": "1/2", "author": "David Swain"}, {"rating": 5.0, "review": "A little bit of a learning curve, but it is nice to be able to pull up movies and shows by titles. Have not used the voice module much, but it seems to be better recognition than usual.", "verified": true, "helpfulness": "0/0", "author": "Wm Barry Turner"}, {"rating": 5.0, "review": "I've had this a few weeks now and I am very happy with all aspects of the product.  Installation was easy, navigation is smooth and it's a joy to finally be able to utilize this part of my Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Tina_K"}, {"rating": 3.0, "review": "i like some of the things i can watch but i have a problem with it freezing up continually, so often sometimes that i can't watch the program at all and it does not give all it advertised.", "verified": true, "helpfulness": "0/0", "author": "bonesa"}, {"rating": 4.0, "review": "hello! very nice the size, way it looks, futures and l will like to continue describing unfortunately lam getting my internet from a jetpack(Verizon) which its crazey the data usage so l cant use nothing downloading data otherwise l would it keep it its very nice!!", "verified": true, "helpfulness": "0/0", "author": "the Rocker"}, {"rating": 4.0, "review": "Was using a laptop before getting Amazon Fire TV.  With Fire TV, everything is so much easier.  Being a Prime member means tons and tons of free viewing.  It’s great.", "verified": true, "helpfulness": "0/0", "author": "Alvin L. Williamson \"Leroy Williamson\""}, {"rating": 5.0, "review": "The Fire is an awesome little machine and performs as promised.  However, there needs to be a way to easily filter out non-Prime movies and TV shows.  Either that or Amazon needs to expand its Prime selection.", "verified": true, "helpfulness": "0/0", "author": "S"}, {"rating": 4.0, "review": "I havn;t tried this product yet, as I'm waiting for it's arival now. However, I am a longtime user of the Roku 2 box and I absolutely love it! I just want to point out Amazon's obvious slight to the Roku by ignoreing the fact that Rokus bluetooth remote is also a dedicated game controler that is included with the box and is also very advanced as it uses a gyro and acceleromiter for exelent gameplay(Angry birds sans pushing buttons takes the game to a whole new level). Actualy, I'm very supprised these features were not included by Amazon. I love Amazon and am a little saddened they went this route!!!", "verified": false, "helpfulness": "0/1", "author": "R. Milazzo"}, {"rating": 5.0, "review": "I really like the power of the fire tv it has lots and lots of features that really improve the experience of your life.", "verified": true, "helpfulness": "0/0", "author": "Nadim"}, {"rating": 4.0, "review": "I understand that this will change with time, but there are not many applications available presently.There is no question that this device out performs almost everything I have ever used for a media center device.Comparing it to my WDTV Live is like comparing the internet speeds we get now, to early 1990's speeds. It opens, downloads, and loads all applications at an outstanding rate. It scrolls, plays, fast forwards, and rewinds video without hesitation.The Roku 3 I owned holds up better in comparison, and far out strips it in application content. But even that cannot compete with the lightning fast reflexes of this device.The voice function is very handy, though I do not use it much as I am not like Gary Bussey with my taste for talking to inanimate objects.But all things considered, I cannot say that I find much use for it as of right now. Yes, I can watch Netflix, and Amazon video on demand content, but the wealth of media centered, and game centered, applications available on the Play store that I cannot access, decidedly deters me from using this great device for more than background noise when I'm trying to fall asleep. ( it has been relegated to my bedroom until its usefulness out-performs that of my HTPC ) So, I will say this. HURRY IT UP DEVELOPERS!", "verified": true, "helpfulness": "1/1", "author": "Nick"}]