[{"rating": 2.0, "review": "Great Product but after I bought Amazon decides to lower the price of it 5 star for the product 0 stars for amazon", "verified": true, "helpfulness": "0/3", "author": "CPS36"}, {"rating": 5.0, "review": "Excellent device. Love it. Watch it daily.", "verified": true, "helpfulness": "0/0", "author": "Jesus E. Peralta"}, {"rating": 5.0, "review": "A great piece of engineering. Highly recommend the item.", "verified": true, "helpfulness": "0/0", "author": "jmar1943"}, {"rating": 5.0, "review": "I finally got the streaming box that I was looking for.  All the must have apps (Hulu, Amazon, HBO, Netflix, ESPN) on one platform and now with Sling TV and games.  The box came fully configured for Amazon so it was literally plug in and use.  I had Apple TV for three years bc it was the best product out there but I was never able to utilize my Amazon Prime membership properly.  Although I could Airplay the Amazon app from my iPhone, it was always a chore to browse and select a movie.  Then pray you didn't get a phone call.  I'm sure Apple made it that way so you'll purchase from iTunes instead.I've had it for a week now and it's great.  Putting the Apple TV on eBay!PROS:Single box for all your TV apps.App layout and menus look good and are easy to navigate.  Better than Apple TV's layoutEasy setup.  I like the pre-configuration with my Prime membership.Picture quality is good.  Equivalent to Apple TVGamesCONS:I would like to customize the menu.  Place my favorite apps at the beginning.HBOGO not available for Comcast customers at this time (I'm currently using my brother's TimeWarner acct).  Please work on that Amazon, I'm on your side.The unit does not turn off.  I'm not a tree hugger but I hate wasting electricity.  It does go into a sleep mode but I want it off.", "verified": true, "helpfulness": "0/0", "author": "Gilbert Lopez"}, {"rating": 5.0, "review": "Greatest amazon purchase yet!", "verified": true, "helpfulness": "0/0", "author": "Knifecollector"}, {"rating": 5.0, "review": "awesome!!", "verified": true, "helpfulness": "0/0", "author": "lisa"}, {"rating": 5.0, "review": "Very good☆", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just got my fire tv today and so far, I love it!", "verified": true, "helpfulness": "0/0", "author": "Taylor Worm"}, {"rating": 2.0, "review": "For the most part I don't mind using the Amazon Fire TV, but there are a couple features that irritate me quite a bit.Having a bluetooth remote probably has some advantages, but having to have a special remote for the Fire TV and then a separate remote for everything else is kind of a pain.The fact that the Fire TV will not go to sleep while certain apps are playing (such as Netflix) is a bit annoying, but what's more frustrating is that there is still a signal going across the HDMI when the Fire TV does go to sleep.  This prevents the TV for recognizing that there is no longer an input signal and automatically shutting down.Other than that, the Fire TV does what I need it to do, it plays movies and TV shows, but there is definitely some room for improvement to be more user-friendly.", "verified": true, "helpfulness": "0/1", "author": "Troy Pugliese"}, {"rating": 5.0, "review": "good and easy to use, I am not a techy, but managed to connect this and get it hooked up to netflix etc.", "verified": true, "helpfulness": "0/0", "author": "maggie braun"}]