[{"rating": 3.0, "review": "I returned this item. While you can download a lot of movies there were quite a few streaming channels that I wanted that wouldn't work Amazon Fire, I was very surprised  even after being on the phone for 45 minutes with a tech we both came to the conclusion they didn't have access to the programs I wanted. I returned it with no problems and bought ROKU which I am very happy with.", "verified": true, "helpfulness": "0/0", "author": "Karebu"}, {"rating": 5.0, "review": "I don't usually right reviews but so far I think I made a good choice purchasing the amazon tv it has a lot to keep you entertained from tv shows,movies,and games for all ages. The best thing I like is that I can pause and come back to what I was watching anytime I can't finish watching something..  I've been watching different shows that I haven't seen in awhile since Wednesday after I received it and set it up...So Far I Love It... Another Review Coming Soon!!!", "verified": true, "helpfulness": "0/0", "author": "Heather Porter"}, {"rating": 3.0, "review": "I really like it when it works, but I  often have to do a reset on it to make it work right", "verified": true, "helpfulness": "0/0", "author": "Greg M."}, {"rating": 3.0, "review": "I've been using a connection to internet streaming using a 5 year old blue ray player, mostly for Netflix. It worked fine, but was showing its age. I decided to get a family Christmas gift for my kids and wife and bought the Firebox along with 4 game controllers.Analysis:Pros:The graphics quality was better than my 5 year old device.It was very simple to install and set up the Firebox device.Cons:The limited amount of games and free movies was disappointing but I'm hopeful that over time this will get better. My boys are teenagers and are used to playing MMO with their friends using Skype and Windows PCs. They quickly got bored with the very limited Android games via the Firebox. But this is not what made me drop my score to a 3 out of 5.Major CON!This device is a total bandwidth hog...even when it is not in use! I work from home on occasion and finally had to unplug the Firebox in order to get enough bandwidth to keep from getting my connection to work's virtual server from being disconnected.Bottomline:If you don't use your internet for anything else but TV, this is a good device for you and you won't notice that it is sucking bandwidth like a blackhole!Otherwise, Run away!!!!! Don't do it! Not until you know that it has been fixed. I wish I was told about this issue before buying it. Totally disappointed.", "verified": true, "helpfulness": "0/0", "author": "Mrs. Soap Maker"}, {"rating": 5.0, "review": "Yep, love it!!", "verified": true, "helpfulness": "0/0", "author": "A vet"}, {"rating": 5.0, "review": "I already had Hulu Plus and Netflix, but with the Amazon Fire TV you'll have a lot of option. I'm really happy with my Amazon Fire TV.", "verified": false, "helpfulness": "0/0", "author": "Jose Romero"}, {"rating": 4.0, "review": "Would be 5 stars if mounting bracket came with it as standard equipment..", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"David Garman\""}, {"rating": 5.0, "review": "I cannot think of more fun that I have ever had out of such a small package. Easy to install. Easy to operate. The voice interface seems to work flawlessly. There is a huge library of free Amazon Prime shows and movies. I think I am just beginning to figure out all it can do. So far, so Great!", "verified": true, "helpfulness": "0/0", "author": "Brooks Griffin"}, {"rating": 5.0, "review": "excellent voice command. Grate picture. excellent menu display. easy to use. and set up.", "verified": true, "helpfulness": "0/0", "author": "Ror cheng"}, {"rating": 5.0, "review": "Worked fine. 15min setup was easy.", "verified": true, "helpfulness": "0/0", "author": "Ronald R. Clayton"}]