[{"rating": 5.0, "review": "Haven't had long, but so far it's great!! UNBELIEVABLY EASY TO SET UP!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth A Liebman"}, {"rating": 4.0, "review": "It's a great media player box, powerful and entertainment, but it still needs some teaks in my opinion, for example the LAN card, it is only 10/100, it could be nice that the card also supported 1000 mbits of speed for streaming, specially with HD 1080p videos.Also I understand that only support up to Dolby Digital 5.1, but what about if you have a 7.1 home theather system or even with DTS-HD, it shuld be very nice that also have it integrated. I bet that are not mayor teaks and could make of this tiny box a piace of art, very complete, everything you could imagine in one simple place.One more thing that I didn't like it and that why I am not giving to it 5 stars is that in my first days of use I got an error trying to play Amazon prime videos, I don't recall exactly the message but was something like \"can't play this video at this time, please try again later\", was the same message for all the Prime content. So I get in touch with Amazon customer service and after several minutes give him on the line, he prompted me to go into the Settings -> Manage Applications -> then Clear cache and memory for the Amazon Prime App and the restart it (pressing the OK and play button of the remote a the same time) and the issue was fixed. In less than a week I have done it twice which is kind of annoying and can't be happening, not acceptable.Beside that, I love it. Hopefully Amazon fix that issue soon.", "verified": true, "helpfulness": "0/0", "author": "RMGG \"HDTV Fan\""}, {"rating": 5.0, "review": "Works as advertised.  Easy setup and great value with Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Olin B."}, {"rating": 4.0, "review": "When I first starting using it, It wasn`t doing what I expected. But after I started using it more and more everything started coming into place. I figured how to get everything to work and it did. I actually am getting more out of fire tv than I ever expected !!!! It is one of the best investments I ever made for entertainment purposes. Thank you very much !!!", "verified": true, "helpfulness": "0/0", "author": "Maria Birk"}, {"rating": 5.0, "review": "Really wonderful product liberated us from TV times to using our own schedule", "verified": true, "helpfulness": "0/0", "author": "marcia spare"}, {"rating": 4.0, "review": "Certainly simplifies the streaming experience. But be aware that a lot of the preloaded streaming sites are looking for cash. So you still need your paid accounts for most everything but the free Amazon Prime stuff.... Which really isn't a lot in the end. Great little remote.", "verified": true, "helpfulness": "0/0", "author": "Fred Zimbelman \"Zderf\""}, {"rating": 5.0, "review": "LOVE this little thing- I have access to so much content, I may never leave the house again!  It's super easy to set up and use.  You should note that many of the apps available are for services that require a subscription- this device does not bypass that necessity- but if your TV is dumb, this is a great option!", "verified": true, "helpfulness": "0/0", "author": "DHB"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Evon Gomis"}, {"rating": 5.0, "review": "Oh wow!!!!! I love Amazon Fire TV!!!!!!", "verified": true, "helpfulness": "0/0", "author": "LE Anglin"}, {"rating": 5.0, "review": "We really like the Amazon Fire, I also bought one for my daughter's birthday.  Hope she likes it too!", "verified": true, "helpfulness": "0/0", "author": "Dawn Nelson \"DawnBaby\""}]