[{"rating": 5.0, "review": "Very cool little box! Especially after loading Kodi (XBMC) Media Center!! Love the remote.", "verified": true, "helpfulness": "0/0", "author": "Justin Fichtner"}, {"rating": 4.0, "review": "So easy to set up and use. I like that there a lot of choices of movies and programs included with prime.", "verified": true, "helpfulness": "0/0", "author": "River1"}, {"rating": 1.0, "review": "Its no better than Apple TV.", "verified": true, "helpfulness": "1/2", "author": "ken papa"}, {"rating": 5.0, "review": "Love Love Love it!!!!!  I have an apple TV...but this is so much better....easy as pie to setup too!! Only draw back is.....the NETFLIX app does not work right....it doesnt show hardly any icons...and just this one little box with a bunch of small icons in it that you cant select...and then one selection that I have never watched...no options...this needs to be fixed...I read many reviews on the app and many people are having problems...please fix and this would be the most awesome 'TV ever....", "verified": true, "helpfulness": "0/0", "author": "Teresa L Choate"}, {"rating": 5.0, "review": "Easy setup,, and works as described. The controls are very \"user friendly.\" I have recommended the unit to several friends.Thanks for a great product.", "verified": true, "helpfulness": "0/0", "author": "Uncle Bob"}, {"rating": 5.0, "review": "amazing application recommend highly", "verified": true, "helpfulness": "0/0", "author": "Peter Schinella"}, {"rating": 5.0, "review": "The specs to price are great plus it is easy to sideload apps such as firefox and Kodi. check them out at http://sideloadfiretv.com/", "verified": true, "helpfulness": "0/0", "author": "Constantino Soria Jr"}, {"rating": 4.0, "review": "Better than appleTV", "verified": true, "helpfulness": "0/0", "author": "Nick Walker"}, {"rating": 2.0, "review": "When you have so many options on a new TV, what would there be a need for this device?  Pretty slow and buffering is not great when hooked up to the wireless router.  Netflix had to be reinstalled. Just easier to watch Netflix on my computer and copy a movie to a usb or put it in a DVD or Bluray player.  This device would be ideal for the person that just has an moblie phone or tablet without a computer.", "verified": true, "helpfulness": "0/1", "author": "Kent Dalpan"}, {"rating": 3.0, "review": "Another item to access my Netflix. I got it for Christmas. Its alright if I didn't have 4 other devices that does the same thing. the only reason its not 5 stars is because It wont let me stream Videos from my PC.", "verified": true, "helpfulness": "0/0", "author": "Rafael Canales"}]