[{"rating": 5.0, "review": "I have been streaming through my MacBook Pro but purchased this for convenience.  I should have done it long ago.  Great unit.  I cannot imagine anyone having trouble with the 5 minute install.  Remote is very intuitive as are the menus.  Started using all functions immediately without reading any instructions.  A good purchase.", "verified": true, "helpfulness": "1/1", "author": "P. D. Carroll \"The Carrolls\""}, {"rating": 1.0, "review": "Return", "verified": true, "helpfulness": "1/17", "author": "shashi"}, {"rating": 4.0, "review": "very good product", "verified": true, "helpfulness": "0/0", "author": "Onessi"}, {"rating": 4.0, "review": "Excellent - Small works really well and is easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "As Expected.", "verified": true, "helpfulness": "0/0", "author": "Richard K. Wheeler"}, {"rating": 4.0, "review": "Very nice unit. We love the voice commands.", "verified": true, "helpfulness": "0/0", "author": "Lonnie Moreland"}, {"rating": 3.0, "review": "The device works great but there needs to be much better apps.", "verified": true, "helpfulness": "0/0", "author": "Steven King"}, {"rating": 1.0, "review": "I have been using Amazon fire tv for about a week. Everything is great except the remote battery life. I have to change the battery every 2 days. One of the AAA battery even pop out (explode). The battery is from Costco so it is not a cheap China made one. will try to contact Amazon for replacement.", "verified": true, "helpfulness": "2/8", "author": "NA"}, {"rating": 4.0, "review": "We don't watch much TV, So we canceled our cable. And purchased the Amazon Fire TV. And have been watching the free programing with our prime membership.", "verified": true, "helpfulness": "0/0", "author": "darin"}, {"rating": 5.0, "review": "I thought I rated this before this but I guess not. Fact is, I CANNOT LIVE WITHOUT MY AMAZON FIRE NOW! They tell me I purchased it in April which means that I've had it for six months now and it has become absolutely indispensable to me now. I'm now retired and one of my favorite pastimes is watching movies either by myself or with my 6-year-old granddaughter. While I consider purchasing \"Fire\" a smart move, I consider purchasing \"Prime\" another smart move. Together, my viewing world has broadened to unimaginable heights since it makes so many more movies \"FREE\". I've seen many new movies, 2014, and oldies as far back as 1938, and nearly everything in between without spending an additional penny! New Prime movies released every month. Plus, there's my Netflix (I pay for that separately but view it on \"Fire\"). There are so many categories of entertainment on my \"Fire\" that I can never be at a loss for something to do including gaming, shopping and other worthwhile endeavors. The best part is that I get billed only once yearly for Amazon Prime which I use for Amazon.com as well for huge discounts and free shipping. That's a win-win for me! If you don't have an Amazon Fire yet, GET ONE NOW! It's only $99. You can't go wrong on this one. EZ install & set-up (although the remote is really sensitive but you get used to it) and don't forget to get the replacement plan. If ANYTHING (Murphy's Law) goes wrong, it will be REPLACED NOT REPAIRED! I recommend it, I love mine and NO MONTHLY CHARGES! (BTW, I'm NOT getting paid for or receiving any benefits for this endorsement.)RapidRabbitt", "verified": true, "helpfulness": "1/1", "author": "RapidRabbitt"}]