[{"rating": 5.0, "review": "I absolutely love my Amazon Fire TV...", "verified": true, "helpfulness": "0/0", "author": "Daniel W. Gordon \"purple person\""}, {"rating": 2.0, "review": "It is very easy to set up, but has nothing worth watching without paying a great deal extra. Maybe I will grow into liking it more...", "verified": true, "helpfulness": "0/2", "author": "S. Wilson"}, {"rating": 5.0, "review": "Super simple installation, faster wireless speed & better picture & sound than my blue ray player, remote is great - simple & fast, good selection of video, music video choices are fantastic!", "verified": true, "helpfulness": "0/0", "author": "midliferun"}, {"rating": 4.0, "review": "i love the idea of amazon fire tv but i live in Malta (europe). any chance the magic will happen in the near future? or is there any other way i can legally watch from my country? here's hoping", "verified": false, "helpfulness": "0/0", "author": "kcos"}, {"rating": 4.0, "review": "No off button. I just turn off the TV and when I return the next day it is off. Bizarre. How hard would an on-off button been to include? Pushing the middle button turns it on but not off. A smarter interface would be nice. For example, I am onto season 3 of Downtown Abbey, but I still have to go to season 1 which I put in my Watchlist. Too much work. Just have the next episode ready for me to start after I turn the unit on. Also, when I am scrolling through all the episodes, they are not marked as \"already viewed\" and so it can be difficult to remember which one I need to watch next. Some of the apps, like Disney HD are useless unless you already subscribe to them on cable/satellite. I keep forgetting it has voice recognition. Maybe that is how you turn it off.", "verified": true, "helpfulness": "0/0", "author": "Jsp \"Catawba Bear\""}, {"rating": 5.0, "review": "Just got this today. Super fast/east set up. No lag time. I expect to get rid of satellite at the end of the month. Looks like all I'll be needing from now on.", "verified": true, "helpfulness": "0/0", "author": "Sherrill"}, {"rating": 2.0, "review": "We enjoy the Fire Tv but I will say that I expected much more for being a prime member.  You get everyone started watching season 1 of a show and starting with season 2 you charge 2.00 or so a show.  Im not happy with that.  But I love having everything in 1 place.  I am disappointed with how money hungry you all are.  I get everything on Netflix for the price I pay.  No hidden charges. Hmm go figure.", "verified": true, "helpfulness": "1/3", "author": "Pala J. Harvey \"paula h\""}, {"rating": 5.0, "review": "So awesome!  Haven't had time to try everything out yet, but have used it a LOT.  Still getting used to it, but am pleased that we can access so much with it.  And it's easy to take from one room to the next.", "verified": true, "helpfulness": "0/0", "author": "Rainey Funnyname \"rainey\""}, {"rating": 3.0, "review": "Good for the most part. Excellent picture quality, ease of use.My main problem is that ona  32 inch TV the screen is so jam packed with titles and movies the text is difficult to read.I would also prefer that the voice command search applied to all the appllcations (like Roku) and not just Amazon's own catalog.", "verified": true, "helpfulness": "1/1", "author": "Cynthia L. Davis \"texasdogs.com\""}, {"rating": 5.0, "review": "Love it so far.", "verified": true, "helpfulness": "0/0", "author": "elaine schutter"}]