[{"rating": 5.0, "review": "The best video and game streamer I have ever used. It is wonderful.", "verified": true, "helpfulness": "0/1", "author": "Ransom I. Simmons"}, {"rating": 5.0, "review": "Bought this as a replacement for aging Boxee Box. Loved that thing, but it was on its last legs and long since not supported.If you are a Prime customer and live in US (or use a proxy to US), this device works really well. Interface is nice and clean - though as many others have said, it's too bad that search functionality cannot be used by other programs (e.g. can't voice search in Netflix).Ability to install Kodi to view your local content is what makes this box truly well rounded. This allows you to both view your local media and stream various online content all in one clean interface.", "verified": true, "helpfulness": "0/1", "author": "T.V.D."}, {"rating": 3.0, "review": "Although its a nice device, I have lots of problems with it.  It freezes on occasion and is very slow to load things and disconnects from the internet at least once a day(I run other devices on the same internet and they never disconnect).  I have had 2 remotes in 2 months and neither one has lasted more than 2 weeks.  I am also disappointed by the movies/tv shows that are free else where but cost a ton on here.  Movies that are 4 dollars to rent when I can go to Walmart and buy the dvd for 5 bucks and have it forever.  I have the fire stick as well which is WAY worse.  I plan on getting my parents a device to view netflix but it will not be a fire tv till they can improve the connectivity and reliability of the devices.", "verified": true, "helpfulness": "1/2", "author": "Ashley Tomey"}, {"rating": 5.0, "review": "It is super!!", "verified": true, "helpfulness": "1/2", "author": "AZlady"}, {"rating": 5.0, "review": "very nice", "verified": true, "helpfulness": "1/2", "author": "minivanja"}, {"rating": 3.0, "review": "the fire remote is easy to use and I like the search capabilities but am disappointed that every movie I have looked for is a fairly high rental fee.  I assumed that with Amazon prime there would be something to watch for free. Using it to log into my netflix account not Aamazon.", "verified": true, "helpfulness": "1/2", "author": "Alison Monasterio"}, {"rating": 3.0, "review": "remote doesn't  work properly. It double and triple clicks on a single click.", "verified": true, "helpfulness": "0/2", "author": "SA \"frosty\""}, {"rating": 5.0, "review": "I really like it but why is there commercial in it you are already paying for it , no commercials on Netflix", "verified": true, "helpfulness": "0/2", "author": "Eric K."}, {"rating": 5.0, "review": "Pretty good", "verified": true, "helpfulness": "1/2", "author": "eddie"}, {"rating": 5.0, "review": "thank You", "verified": true, "helpfulness": "1/1", "author": "Mike D."}]