[{"rating": 5.0, "review": "Easy to set up.  I merely plugged in the power connection, hooked up the HDMI cable from the tv to the box, searched for my wireless router (also has an ethernet port in case your internet modem is not wireless), put in the code from the modem, and after a short update download and install, I was up and running.  Very user-friendly product, and LOADS of movie/tv/game options for Prime members, in addition to access to other media apps.  I think this will finally give me enough choices to finally bag the cable criminals.", "verified": true, "helpfulness": "4/6", "author": "AK in WA"}, {"rating": 5.0, "review": "I love the voice search feature. Finally I can play all my Amazon library movies with a small device, which is about the same size as an Apple TV. The internet connection seems to be better than my Roku device. I can get Netfix, Hulu, Pandora and other applications. However, there is no HBO GO. Overall, the design is sleek and sexy just like an Apple TV.", "verified": true, "helpfulness": "5/6", "author": "DP"}, {"rating": 1.0, "review": "Purchased this because of tech problems with Apple TV.  Spent two days trying to get the Fire tv to pair with remote--nothing.  Ya gotta wonder what % of units are DOA.", "verified": true, "helpfulness": "11/30", "author": "Jeffrey Lowder"}, {"rating": 5.0, "review": "CAN'T WAIT TO GET THIS NEW STREAMING TV DEVICE.I own Google Chromcast and Apple TV and really want to compare this unit to those now older models I am still happy with. Each one of those I own cover their own niches but I expect this one to extend the variety and be easier to use.", "verified": false, "helpfulness": "2/13", "author": "DJ Dude"}, {"rating": 5.0, "review": "Great device already, a multimedia powerhouse,but has a lot more potential. Can't wait for FreeTime and Amazon music streaming!  Like the integration with the kindle fire tablets.", "verified": true, "helpfulness": "3/5", "author": "Nathan J Birckhead"}, {"rating": 5.0, "review": "Quick, User-Friendly Interface, and packed with much more content than Apple Tv. In the video i give my first impressions of Amazon Fire TV. Some things I liked and other things that i wasn't so happy about. Hope It Helps!", "verified": true, "helpfulness": "4/6", "author": "Wayne"}, {"rating": 5.0, "review": "Five SUPERB Stars!  (Review update after a year of Fire TV use) Amazon Fire TV trumps similar TV-internet systems, such as Apple TV, with the \"voice search\" command on the remote. You can get to where you want to go whether movies, games, and TV shows almost immediately by pushing the button and speaking the title (Fire TV 'listens' and `thinks' for a second, actually, then executes the command, if its available. Voice Search is limited to the Amazon universe, however: it can take you to the home screen of NetFlix, HuluPlus, ESPN or whatever universe outside of Amazon, then you are on your own.First, Amazon fireTV's 'quick start' instructions are easy, plug in the power and the Amazon logo popped up on the screen immediately without hooking up the router cable. immediately began automatic updates, no action required other than not powering down during the online system update process. Then there is a nice, short intro video with an animated guide giving a simple direct verbal quick start. Purchasing my first movie was like my first Kindle book experience via Whispernet, the purchase was quick, very smooth, and the movie was ready to play immediately.* Fire TV is a larger, heavier device which does not depend on `line of sight': the remote can be pointed away from the fireTV device and still `command' the box both digitally and vocally from up to 40 feet away, even around a corner out in the garage. Apple TV is small, like a light-weight hockey puck, and it slides around on surfaces, sometimes turning away from the user, because the HDMI cable outweighs it, and `line-of-sight' is necessary to execute commands from the AppleTV remote.Now the remote:* Amazon's fireTV remote is larger, fits well in the hand, the thumb seems to hover over the `back' button which I use a lot and there is that matter of the voice command that cuts to the chase without a lot of button input. The silver metallic AppleTV remote by comparison is very small, thin, and cumbersome to use if you have to input a lot of information, even to navigate to a movie;* With fireTV, screen 'pauses' are immediate and the picture is sharp. The AppleTV remote is sometimes slow in responsiveness when trying to `pause a scene': it requires timing because the pausing is not immediate, requiring going back and forth, over and over to get to the exact moment needed.* As a fan of closed-captioning, I was happy to see Amazon has given priority to this feature with its own CC button on the remote (three parallel white lines, on the right side) with quick font adjustments and then back to your show, without going thru layers on AppleTV to reach it.Con for fireTV:* The power brick/connector takes up too much room at the wall receptacle, rendering one adjacent socket unusable.* The remote failed after 3 months use, as did a remote for Echo.At this point in time, FireTV is ahead of the competition, thanks to the wide variety of movies, TV shows, and great video games on the Fire TV system and the versatile remote, but mostly because of the \"voice search\" command (and of course, 'text search' is available too). Adding the wide variety of games available to Amazon Fire TV only adds more attractiveness for those who want a different group of new video games to play. I'm still a big AppleTV fan and now an Amazon Fire TV fan and use them both, exploiting their differences. More updates, coming. My Highest Recommendation. Five SUCCESSFUL Stars! (1 Fire TV, remote, 2 AAA batteries, and quick start instructions.)", "verified": true, "helpfulness": "0/0", "author": "RBS \"rbsprods\""}, {"rating": 5.0, "review": "It is sooooo easy to set up and use! You will love it. Just know that the voice command only works for your Amazon Prime account, but I still love it!", "verified": true, "helpfulness": "3/3", "author": "Kim Bebee"}, {"rating": 5.0, "review": "I was looking at buying Apple TV or a playstation 4.  I am so glad I did not purchase either of these.  I ordered Amazon Fire TV the first day it came out and I have not been disappointed.  The set up was quick and easy.  I was easily able to sync my HuluPlus, Netflix and of course Amazon Prime accounts.  I am still shocked that this only cost $99.  The design is sleek and small.  The console can be placed almost anywhere due to its small size.  I could not be happier with my purchase of the Amazon Fire TV.", "verified": true, "helpfulness": "3/3", "author": "Frances"}, {"rating": 4.0, "review": "I had an interesting experience with Prime.  When I first signed on I discovered the show \"Sherlock\".  A few weeks later, I discovered that Sherlock had changed to an Amazon pay program.  When I found it was on Netflix, I signed on to that service as well to satisfy my new addiction.  And the monthly fee was cheaper than paying every time I watched the show on Amazon.  Like everyone else, I've found the search function clumsy on most streaming devices, so I immediately ordered the Fire TV to take advantage of the voice function.  Well, that works wonderfully but only if you use it on Prime.  When I'm on the Netflix site (where Sherlock is free) and say \"Sherlock\" into my remote, it instantly takes me to the Sherlock on Amazon where I have to pay per episode.  The same thing happens if you choose the option to input the name of the show manually.  So if you don't pay careful attention, you may end up ordering something from Amazon instead of the free material available from Netflix.  When the promo for the device says, \"Works with Netflix\" I don't think they make it clear that the outstanding voice function will only work with Prime.  I've studied the scant instructions that came with the device and I can't see any way to make voice search work with services other than Amazon.  If anyone can tell me whether there's a setting to change that opens up the voice function to other apps, I would certainly appreciate that guidance.  Am I glad I made the purchase?  The speed of processing is superior to my Roku and my Blu-Ray player and on that issue the Amazon TV wins hands down.  But I am hungry for the voice function when I stray from the Amazon provided content.", "verified": true, "helpfulness": "4/5", "author": "Robert A. Boyce \"ipod newbie\""}]