[{"rating": 5.0, "review": "love it works great kid loves games in it bout order the controller so he can play more games usps took 3 days to deliver had a 2 day shipping but other then that love it", "verified": true, "helpfulness": "0/1", "author": "face"}, {"rating": 5.0, "review": "So far so good. Need to use a few weeks longer though.", "verified": true, "helpfulness": "0/1", "author": "marsha j mazzei"}, {"rating": 5.0, "review": "What can I say!?  This is a truly solid product. The finish is premium as is the software. Objectively, it's a new product, but unlike most android based boxes you can tell this box is so well designed. It plays HD video with no problem. We sideloaded Kodi and took notice that it is smother than our windows 7 machine.  The only set back is a lack of an integrated keyboard on the remote, but no deal breaker by any means. Don't hesitate, but it!", "verified": true, "helpfulness": "0/0", "author": "Jose Ferrer"}, {"rating": 5.0, "review": "It's great I love it", "verified": true, "helpfulness": "0/1", "author": "Edward Jones"}, {"rating": 5.0, "review": "Has replace the Apple TV for a lot of TV watching and movies. Able to get 1080i/p video streams on Fire TV more than I can with the Apple TV - had to reduce to 720p on my 12Mb download speed with whatever codecs Apple uses. For Prime members, this thing is great. Tons of free movies, music, and exclusive programming. Partnerships with other networks (including HBO) has introduced us to a lot of good shows we've never had an opportunity to see. Enjoyed reminiscing through every episode of Chapelle's Show from CC - classic.Interface is fast and fluid and the voice search is a must have (6 and 7 year olds can find things they're looking for with ease). Tried the FirtTV stick first, but the wireless network was a bit weak in my network/AV closet which caused streaming problems. The hard wired connection on the full FireTV works best for me and integrated easily in my AV cabinet. Only gripe with the hardware is the bluetooth controller - IR would have allowed me to use my existing Logitech Harmony remote. The FireTV remote is now a sidekick that I have to keep around as well.Only gripe with the interface is the organization of content - so many categories that seem very redundant - I much prefer Apple's very simple Movies, Music, TV, etc with the ability to put apps directly on the home page. The various categories with featured, prime, recent, etc. on FireTV can be a bit tedious to navigate.", "verified": true, "helpfulness": "1/1", "author": "Kevin Smith"}, {"rating": 4.0, "review": "Just getting use to it.", "verified": true, "helpfulness": "0/1", "author": "June Thinnes"}, {"rating": 4.0, "review": "Works fine", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/1", "author": "James Bonney"}, {"rating": 4.0, "review": "My wife and I use this fairly regularly.  It is very easy to set up and use and the remote control is nicely done.  The software could be much better.  The arrangement of the movie and TV program titles seems haphazard.  Putting the Fire TV box to \"sleep\" after use also is a cumbersome procedure requiring multiple steps.  We do like the original programming offered, and access to the many movies in the database.  I believe Amazon will continue to improve this product, and I look forward to using software that allows me to sort my genre, or latest release, or actor, etc.Hopefully that is coming soon!", "verified": true, "helpfulness": "1/1", "author": "Ken430TX \"Ken\""}, {"rating": 5.0, "review": "Love it. Instant on, no lags, stuttering or other issues I've seen on similar products. Worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Steve"}]