[{"rating": 5.0, "review": "My husband and I are so happy that we purchased the Amazon Fire TV....It's amazing!  I would HIGHLY recommend this to everyone who is thinking about purchasing this!", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 5.0, "review": "Let me start with saying that the amazon fire tv is amazing I have own apple tv and the roku 3.I had a lot of issues with the roku hdmi output but the fire tv was very easy to setup the voice search is cool and very accurate I had no hdmi issues.The games on the fire are ok some are great others are more tablet like we do need more games other than that its cool Get It is Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Luistar51 \"lui\""}, {"rating": 5.0, "review": "Love it. I have been watching loads of movies with it. Plan to catch up on old shows with it. So convenient", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was purchased to add to the other streaming devices in the house - a Roku 2 and Google Chromecast. This is by far the fastest interface and smoothest streaming device out of the three. From almost the first use of the interface, you can see that the additional memory and choice of processor makes this screaming fast. I have streamed many shows from Amazon, Netflix, and other sources with buffering of the stream almost non-existent. Playback starts very quickly as well.The only complaint, is that there is less content with the Amazon FIre TV at this point. But, it's a new device with content sure to be added as time goes on.For anyone without a streaming box today, this is one that should be seriously considered.", "verified": true, "helpfulness": "1/1", "author": "Steve Alexander \"Steve\""}, {"rating": 2.0, "review": "I love my roku and was so excited that amazon was coming out with a product -- believing that if it was from amazon it would be great.  I purchased this as a gift for my parents and when we worked with it found that when searching for a movie always got kicked out of the app we were at and redirected to the amazon -- pay for movie app.  This is very frustrating and my parents immediately didn't want it because of the frustration level.  I sent it back and got a roku for my parents and they love it!  Amazon was very quick with the return and refund -- that is what I expect from amazon -- but this product they are going to have to up their game to live up to \"amazon standards\" I have come to expect.  this product also does not support the acorn tv app ---  that is also frustrating.", "verified": true, "helpfulness": "2/6", "author": "Rene L."}, {"rating": 5.0, "review": "Awesome piece of entertainment. Hours and hours of fun. I listen to it everyday. Pandora and Netflix are my favorites.", "verified": true, "helpfulness": "1/1", "author": "Cornelius Daniels"}, {"rating": 4.0, "review": "My only complaint is theres no rca outputs to hook up to your surround sound system! Everyting else works great!", "verified": true, "helpfulness": "1/1", "author": "Richard Kanski"}, {"rating": 5.0, "review": "I really enjoy my new toy, it listens to me and sometimes even predicts what I want to watch even when I have not a clue what I am in the mood  for.  I am very impressed with this tool for my entertainment needs!", "verified": true, "helpfulness": "1/1", "author": "Juliet M Sykes"}, {"rating": 4.0, "review": "works great what more can ya say recommend it to anyone voice search really works not many do for me", "verified": true, "helpfulness": "1/1", "author": "Mike S."}, {"rating": 5.0, "review": "Attractive layout, simple and easy to set up. Heaps better than my Apple TV, a few more channels and an update to the latest Netflix app and this will beat the pants off my Roku 3 too.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]