[{"rating": 5.0, "review": "Easy to install, user friendly.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Ms. P"}, {"rating": 5.0, "review": "Love being able to binge-watch missed tv shows...and with no commercials", "verified": false, "helpfulness": "0/0", "author": "Jean Ann Bryant"}, {"rating": 3.0, "review": "I think it is ahead of the other streaming companies, such as Hulu and Netflix, but you have to sometimes \"Pay\" $2.99 for an episode you can catch said episode for \"Free\" on Hulu or Netflix. Really??...$2.99 just for an episode.", "verified": true, "helpfulness": "1/1", "author": "Lee"}, {"rating": 4.0, "review": "Very good device and lightweight for mobility. It is the Chromecast with an Ethernet port minus Android OS requirement. Still exploring the Fire TV so I could rate higher down the road.", "verified": true, "helpfulness": "0/0", "author": "Janell Burton"}, {"rating": 3.0, "review": "I really like the design of Fire TV which is very compact and elegant. Menu screen is easy to navigate and friendly. The 2 biggest disappointment is the lack of apps (still way behind Roku) and the extremely limited memory space (~5.5 gig for apps).", "verified": true, "helpfulness": "1/1", "author": "Ken Wong"}, {"rating": 3.0, "review": "Make sure you can attach the audio from this to your television", "verified": true, "helpfulness": "0/0", "author": "Walter H."}, {"rating": 3.0, "review": "Great product but apps need to be up to date. Not sure if it's a amazon thing or development is really slow on Amazon but apps shouldn't be two to three versions behind. Besides the apps this product is very sleek and fast. The ui (user interface) is good enough but can be slightly confusing, the voice recognition is awesome but I would like an option for it to show images or at least go directly to the person I'm searching for instead of a link showing up.", "verified": true, "helpfulness": "0/0", "author": "SiM"}, {"rating": 2.0, "review": "I have a amazon fire tv and an apple tv. Although the fire tv offers great apps and games its connection lags, the screen quality goes in and out, watching it buffer every 10 minutes is not cool, and the only way I can see my hbo stuff is through a prime account. Apple tv provides more apps and access to all the third party apos without a iTunes account. I feel to get the most out of the fire tv you have to purchase amazon prime and thats a shame.", "verified": true, "helpfulness": "1/1", "author": "j williams"}, {"rating": 5.0, "review": "So far, so good.  Streaming is high quality, set up was extremely easy.", "verified": true, "helpfulness": "0/0", "author": "James C."}, {"rating": 4.0, "review": "(sigh) If not for the problems with Netflix, it would have been ideal...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]