[{"rating": 5.0, "review": "It's an amazing piece of equipment.  I will enjoy it tremendously  !!!", "verified": true, "helpfulness": "0/0", "author": "Linda Braley"}, {"rating": 4.0, "review": "I love my amazon fire tv box. It was so easy to hook up to my tv and to the internet... Now I have access to my youtube account and my pandora and my amazon music... It's much more convenient to watch music tutorials for piano now that's it's on a bigger screen... I just wish that there was a bigger selection of movies.", "verified": true, "helpfulness": "0/0", "author": "bregirl94"}, {"rating": 3.0, "review": "None", "verified": true, "helpfulness": "0/0", "author": "Pete"}, {"rating": 5.0, "review": "The only thing I don't like about the TV is you can't turn it off, you have to unplug it or just let it go to sleep.", "verified": true, "helpfulness": "1/1", "author": "Alektra"}, {"rating": 5.0, "review": "Excellent, Now I have to figure out all the features so I know how to really use it to my advantage.So happy to have Fire TV rather than commercial T.V. and cable!", "verified": true, "helpfulness": "0/0", "author": "sally"}, {"rating": 5.0, "review": "Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "carmela walker"}, {"rating": 5.0, "review": "Love it Love it Love it !!", "verified": true, "helpfulness": "0/0", "author": "The Rogers Family of Memphis."}, {"rating": 3.0, "review": "I purchased the Amazon Fire TV because it had superior hardware specs and offered all the apps I wanted to use. Now that I've had it for a few weeks, it seems that several of those apps are really holding back the potential of a very capable device. I don't play games on it, and I only use a handful of apps, so I'll mostly stick to my experiences using those apps.The menus and general interface are attractive, and they usually load instantaneously. Things feel a bit faster and snappier on this box compared to other streaming players, though I do wish the menu's interface was less focused on pushing Amazon's video content to the forefront.The Netflix app and Amazon Prime streaming have worked quite well, and the YouTube player is fine although nothing special. The Plex app has a very nice interface and is loaded with features, but I wish that the Fire TV supported more A/V formats natively so that my PC wouldn't have to so often be burdened with the task of transcoding my media in order to stream.The twitch.tv app (not available on some competitors like Roku) was originally a selling point for me, and I expected good things from it since Amazon now owns Twitch. I was very disappointed to find that the app has almost no features and does not show streams in their source resolution. What a letdown. For me, the whole appeal of the app was the idea of watching streams in sharp HD-goodness on a large screen. The current app seems to generally display streams in ugly standard-definition. Additionally, there doesn't even seem to be a search function. I really hope this app receives significant improvements in the near future.The only other app I really wanted to use was Crackle, and this one was the worst of all. I could initially only get as far as \"Browse Episodes,\" where the app would get stuck on a loading wheel until I would give up and exit to the Fire TV home menu. Later, when I'd be using other apps (like Netflix), they would suddenly close of their own accord and be replaced inexplicably be Crackle. I've since deleted and reinstalled the Crackle app, and it seems to actually work now, at least. I'll just have to wait and see if it behaves.Perhaps it is unfair to criticize the Fire TV for the failings of apps from other developers, but wherever the blame lies, things definitely need to be improved. The Fire TV runs a custom version of android, but its apps seem to lag behind in updates compared to the standard versions available on the Google Play Store. I bought my Fire TV in December 2014, more than six months after release, and I'm disappointed that things are not better sorted out by now.Ultimately, despite its excellent hardware, I'd have a hard time recommending the Fire TV over something like a Roku 3 (or Apple TV if you already have lots of other Apple devices) until some of the apps are improved.", "verified": true, "helpfulness": "1/1", "author": "Daniel M"}, {"rating": 5.0, "review": "Although it would be nice if it had directions, if can be easily figured out.  There is an incredible amount of TV shows and movies to watch for free, especially if you are and Amazon Prime members or have a Netflix subscriptions.  The Netflix offerings are crazy.  I really love it.", "verified": true, "helpfulness": "0/0", "author": "John Herringer"}, {"rating": 5.0, "review": "Excellent, instant on from sleep, great for streaming from other apps not just amazon.  Wish it had more apps, and built in web browser.", "verified": true, "helpfulness": "0/0", "author": "John K."}]