[{"rating": 5.0, "review": "Perfect, Great Transaction and no Problems, even got it pretty darn quick.Thanks", "verified": true, "helpfulness": "0/0", "author": "Todd Bojarski"}, {"rating": 5.0, "review": "Love amazon fire TV. Getting rid of satellite and picking up local cable news channels only.", "verified": true, "helpfulness": "0/0", "author": "William Cartier"}, {"rating": 3.0, "review": "I thought this was going to be a good replacement for a Roku stick, but after using it a while, I'm noticing there is a lot of buffering going on. I have it connected via Cat-5, so there shouldn't be any transmission issues as none are evident when I use the Blu Ray player which is also connect via the same switch. It's great when it works well, but there are occasions when it doesn't. Disappointed.", "verified": true, "helpfulness": "0/0", "author": "NYCSteeler"}, {"rating": 3.0, "review": "Amazon Fire Tv need more apps to be able to compete or beat the Roku 3 or even apple tv. ex: Crunchyroll app is not supported on the fire tv. It is great to have powerful hardware but if you don't have enough apps to run on your device it not worth it. Roku 3 in my opinion for now is still a better choice than the fire tv.", "verified": true, "helpfulness": "0/0", "author": "MR"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Howard Zipser"}, {"rating": 5.0, "review": "I'm a big apple fan but the Fire Tv blows Apple TV out of the water!Great product!", "verified": true, "helpfulness": "0/0", "author": "M. Guaman"}, {"rating": 5.0, "review": "I am very happy with Amazon Fire,  is so much there I am still learning about it. Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "jef"}, {"rating": 5.0, "review": "Voice activated and easiest way to netflix and crackle streaming.  Easy, Easy Easy.Amazon Video super fast and simple to use.", "verified": true, "helpfulness": "0/0", "author": "Jeffery Johnson"}, {"rating": 5.0, "review": "I've completely ditched the SEVEN AppleTV devices I have installed ... which is pretty major for someone who only uses Apple hardware (iMac's, MacBooks, iPhone, etc.).  The Fire TV is MUCH faster with a significantly better user experience than both AppleTV and Roku.  The remote is bluetooth and much more comfortable to operate than the aluminum AppleTV and plastic Roku remotes.  The device itself is super responsive.  Add in a Prime membership, Netflix, and the Plex app, and you'll never look back to cable.  I've actually pre-ordered multiple Fire TV STICK devices because of this unit... as well as buying more Fire TV units.", "verified": true, "helpfulness": "1/1", "author": "Fred Lackey"}, {"rating": 5.0, "review": "It is great still getting use to it but so far so good", "verified": true, "helpfulness": "0/0", "author": "Louise Manzi-gray \"lulu\""}]