[{"rating": 3.0, "review": "Disappointing.  Roku 2 and 3 are much preferred.  There is nothing about the Fire I would rate higher.  I bought it with Prime - going to cancel ...  Better selection of movies on Netflix plus HBO-GO and TWC.  Even Roku2 has a better interface in my opinion and is only marginally slow almost unnoticeable using wireless vs Enet cable for the Fire", "verified": true, "helpfulness": "1/1", "author": "Dexter S. Kekua"}, {"rating": 5.0, "review": "It really is as easy as the advertisements state.We love watching Amazon Tv.My husband loves the selections of radio stations.", "verified": true, "helpfulness": "0/0", "author": "Sheri Wood"}, {"rating": 5.0, "review": "Hello to all.For me is an excellent device if you consume services from Amazon Digital (Music, Videos and Games).It seems to me a good product, in fact I recommend it, as long as you make frequent use of Amazon services.Among the things that catch my attention is that we should not really expect to load the movie, I do not understand how, but it's great.There is fun to play and control games helps the gaming experience.Miracast works great, but yes, do not connect the Kindle FireTV and HDX via a repeater, both devices must be connected to the router.Thank you.", "verified": true, "helpfulness": "0/0", "author": "David Villalobos"}, {"rating": 5.0, "review": "I was surprised by the performance and quality of FireTV.  I have an HDMI connection to my TV and an Optical Connection to my Dolby 7 Sound System.  HD Video is excellent and audio delivers Dolby sound separation accurately.  The remote is easy to learn and the speech search function works really well.", "verified": true, "helpfulness": "0/0", "author": "LThompson"}, {"rating": 5.0, "review": "ok the picture on tv is awesome.  i know it all is hdtv but i think the fire make it truly hdtv.  awesome picture, easy to install, up in five minutes, no hassle, just easy to get to other menu opitions..  when making this the consultants must have been people who were not computer savvy,  it is so easy to operate.  thank you for that.what impressed me most was the instructions were on one piece of paper.. no 500 page novel to read.  love it love it.have not done all the things it can do yet", "verified": true, "helpfulness": "0/0", "author": "Daniel R. Dause \"tahlequahdude\""}, {"rating": 5.0, "review": "LOVE IT PERIOD! Work great and the voice commands are flawless. Hard to believe it is so right on. Will tell others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely wonderful ! I can watch anything I want at any time.😃time to cut the cable , fire tv is well worth it.", "verified": true, "helpfulness": "0/0", "author": "Shaun Hiltz"}, {"rating": 1.0, "review": "I was surprise that all the features of this device is not supported outside USA.I wish from Amazon to solve this issue.", "verified": true, "helpfulness": "3/11", "author": "Saad B. Al Jabri"}, {"rating": 5.0, "review": "I'm about as mechanically-inclined as a spoon, so my First Star is for the ease in setting it up.  My Second Star is for not needing an instruction book because once you turn it on, it asks how YOU want it set up!  Third Star is for the \"World's Simplest Remote!\"  (Took me about 2- minutes to memorize ALL). Fourth Star is for the very large amount of movies, t.v. shows, games and apps available and the Fifth Star is for the Amazon Prime which then gives you over 200,000 movies and More Shows, etc.  AND, you get the first 30-days of Amazon Prime for FREE with the Amazon Fire TV!  Recommended for anyone tired of paying those hefty cable or satellite bills each month!", "verified": true, "helpfulness": "1/1", "author": "Denise"}, {"rating": 5.0, "review": "On the seventh day God rented...This is a VERY good product. The voice recognition is superb and makes it easy even for my 80 year old mother to watch scathing films of half naked men. It simply works and it works reliably too. It's a ton of fun and well worth the money. Once again, Bezos proves his genius.", "verified": true, "helpfulness": "3/5", "author": "Mark"}]