[{"rating": 3.0, "review": "i thought it would compete more with cable. lacks a good up to the minute news station", "verified": true, "helpfulness": "0/1", "author": "James J. Waleur"}, {"rating": 5.0, "review": "Amazon has done a great job at making this easy to set up and easy to use. Set-up was amazingly easy! Then it came to actually using it. The display is excellent. The layout is intuitive - I was able to navigate to what I wanted to see without having to read any instructions. The thumbnails for movies are nice and large, and it's easy to read the descriptions from a distance away (unlike my smart TV in another room).Then I tried the voice search. Very impressive! I spoke the name of a movie I wanted to go to, and the link immediately appeared on the screen. One click and I had my movie.I've had my Amazon Fire TV for about two months and am completely impressed. Nothing else I've used compares. My next \"toy\" from Amazon will be the Amazon Echo. Mine is scheduled to be delivered in ten days. Can't wait!!!!", "verified": true, "helpfulness": "0/0", "author": "M.Reed \"Photographer\""}, {"rating": 5.0, "review": "Love it.  Easy to use.  Easy to set up.  Loved it so  much, I bought a second one....", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "I was expecting apps for NBC, ABC, CBS, and FOX. I was hoping to ditch cable. I also did not know that I would have to pay to watch everything and that Prime still does not give me the basics I need.", "verified": true, "helpfulness": "1/2", "author": "Carl D Whitney"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Rebecca Walker"}, {"rating": 4.0, "review": "Great product was surprised how easy setup was", "verified": true, "helpfulness": "0/0", "author": "anthony d monforte"}, {"rating": 5.0, "review": "Love this!  Best gift ever.", "verified": true, "helpfulness": "0/0", "author": "Ann Frizzell"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Jesse Espinoza"}, {"rating": 5.0, "review": "I bought this to better make use of Prime Instant Video, but it has changed the way I watch TV. It was easy to hook up, and came registered to my account already. The remote works perfectly and fits in your hand just right. I love it.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Amazon Fire TV exceeded my expectations. Setup very easy. Navigation even easier. I love the screen saver feature. You can use your own personal photos. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Katurah Smith"}]