[{"rating": 3.0, "review": "looks like when you put this product on the market you took the good movies and put it where you had to pay for them and put some movies older than me on the list", "verified": true, "helpfulness": "2/5", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The Fire TV does what I need it do. It streams Netflix, Amazon Prime video (if you have Prime), and you can download other streaming apps. I can say that the whole \"gaming\" aspect is really underwhelming. Most of the games available in the Amazon store are smartphone or tablet games, I bought a controller to use with the Fire TV before I realized there were very few free games worth playing.The voice search is very accurate and convenient, but it ONLY searches Amazon's library. If you are in the Netflix app and do a voice search for a show, it will show you results from Amazon's library. As is usually the case with Amazon products, its designed to sell you more stuff.For my needs, I could have bought a Chrome stick or the Amazon Fire Stick for less than half the price and still been able to stream Netflix. I'm hoping more content becomes available on the Fire TV in the future to actually put the extra hardware to use.", "verified": true, "helpfulness": "2/2", "author": "alex"}, {"rating": 5.0, "review": "Works great and easy to use", "verified": true, "helpfulness": "0/0", "author": "Jen marie"}, {"rating": 2.0, "review": "too many add on to make it work", "verified": true, "helpfulness": "1/6", "author": "malcolm"}, {"rating": 5.0, "review": "Love love love it! I cancel Cox Cable. Saved 113$ a month !", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "I bought this for my wife who streams shows on Netflix.  We already had the Apple TV but needed another box for a second TV in the house.  There were some initial issues when trying to set this up but my wife called Amazon Customer Service and they walked her through the process of upgrading the firmware and now it works fine.  So far the streaming has been flawless and if you are just streaming Netflix I think it's a great value compared to the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Thomas Monroe, Jr."}, {"rating": 1.0, "review": "no! i have so called high speed internet, through centurylink 5.5mbs, best i can get out here in the country. i thought i would be able to temperarlyrecord some amazon prime (free tv shows, without waiting every minute for it to buffer. not the case. you have to buy or rent a show or movie,to record it. it was a waist of about $100 dollars for me. live and learn.", "verified": true, "helpfulness": "2/6", "author": "rsully660"}, {"rating": 4.0, "review": "Great quality and internals. Easy to configure. A must with Prime! Only issue is the remote kills batteries. Just downloaded the update for remote, hopefully that fixes it!", "verified": true, "helpfulness": "0/0", "author": "Rocco Falvello Jr."}, {"rating": 5.0, "review": "This product has been exceeding my expectations!  Was able to cut my cable. I have everything I want now.", "verified": true, "helpfulness": "0/0", "author": "Lindsey Taylor"}, {"rating": 3.0, "review": "The product is great, but there is one design flaw that is truly annoying and Amazon should fix in the next software update. Photos that I backup to Amazon cloud drive show up automatically on the Fire TV. I don't want that. Photos are private. There's an option to force parental controls for photos but that's just a hack solution and forces everything else to be locked as well. The correct solution is a setting that says to disable Photos completely or to choose not to sync with an Amazon account.", "verified": false, "helpfulness": "2/4", "author": "Oded Shopen \"odedia\""}]