[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jerry D Olmstead Jr"}, {"rating": 5.0, "review": "I got it for Christmas and my husband has really enjoyed it, but it keeps him occupied.  Maybe one day I'll be able to choose a show.", "verified": true, "helpfulness": "0/0", "author": "LT"}, {"rating": 5.0, "review": "I received Amazon Fire TV for Christmas, and it was definitely my favorite gift! I love all of the choices (i.e.: their app selection - Netflix, HBOGO, Hulu, etc.), and it's really easy to use. If you are an Amazon Prime member, it's really a no-brainer purchase! Not only can you easily connect to your Prime Movies, but you can also access you music, photos, etc. The box is small & sleek too, so it can fit in any space. I would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Vanessa"}, {"rating": 5.0, "review": "So far, it's all I could have hoped for. It's fantastic !!!  I converse with it daily and it listens better than my wife and daughters.", "verified": true, "helpfulness": "0/0", "author": "Bruce Johnson"}, {"rating": 5.0, "review": "Very happy with the performance. Side loaded some android apps. Makes a get alternative to cable or satellite", "verified": false, "helpfulness": "0/0", "author": "Chance C."}, {"rating": 5.0, "review": "Far superior to other like devises. Easy to setup and easy to use.", "verified": true, "helpfulness": "0/0", "author": "HC Smith"}, {"rating": 5.0, "review": "Easy to use, easy to set up", "verified": true, "helpfulness": "0/0", "author": "kacie"}, {"rating": 5.0, "review": "Excellent product!Simple to setup.Simple to use.Very fast loading and playing shows and movies.I was a FIOS subscriber.Excellent picture quality.", "verified": true, "helpfulness": "0/0", "author": "EC MD User"}, {"rating": 5.0, "review": "A great Christmas present.", "verified": true, "helpfulness": "0/0", "author": "Kurt Gustafson"}, {"rating": 5.0, "review": "I received this as a Christmas gift and boy was I excited to hook it up and use it. Setup couldn't have been simpler and within 5 min I was loading my favorite apps such as Netflix and Hulu plus. It loads everything almost instantaneously and performs flawlessly.  I love the sleek design of the actual unit and the rubber backing on the remote feels nice in my hands.  Voice search is very impressive. It always understands what I am searching for.  The only thing I wish, is that I could mirror my kindle fire hd with it, I don't have the latest hdx model which is what the fire tv was really designed to be compatible with. Overall fantastic unit. I am thinking of purchasing a second one for my living room, as I have this one set up in my bedroom.  Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Kerry"}]