[{"rating": 4.0, "review": "My husband and I love this. We are able to watch so many things. Now there is no need for cable.", "verified": true, "helpfulness": "0/0", "author": "Beatrice Hernandez"}, {"rating": 5.0, "review": "If you have prime, this is great for you tv.!!! Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is a great unit! It is easy to set up. All you you have to do is plug the HDIM cable to your TV, plug the power cord to Fire TV in then using your WIFI enter the password and you are done. The Fire TV was all set up for my Amazon Premier account and ready to go. Now with my WIFI there is no lag when playing any movie, but if your WIFI is slow you can plug from your WIFI to Fire TV using and Ethernet cable and you should have no more lag.  Movies and shows I watch while using Fire TV are in HD and it is like being at the Movies. This is a great if you have Amazon Premier account you can chose from Thousands of Movies and TV shows and you can also use for Nexflix and a lot more movie programs. I do recommend that if you play games on it buy the game controller.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "This has been a great item.  This is the third unit that I have picked up and connected in a different room. The selection of programming is fantastic. I would recommend this to anyone looking for quality entertainment.", "verified": true, "helpfulness": "0/0", "author": "bpbshooter"}, {"rating": 5.0, "review": "Been a great addition to the viewing options in the house.  Early on had some issues with loading and or streaming, but it must have been loading the update to the unit.  But now seems to be no problems and great quality of viewing.And love the control of what I want to watch, when I want to watch, and skip all of these political ads and or any commercials.Nice...", "verified": true, "helpfulness": "0/0", "author": "C. Tone \"constitution\""}, {"rating": 4.0, "review": "A bit hard to use for us (82 and 89years of age, but we like it and so far the first six movies we have chosen to watch and rnjoy", "verified": true, "helpfulness": "0/0", "author": "Albert and Mary Fulton  11/17/25"}, {"rating": 5.0, "review": "I love Amazon Fire TV! So easy to use and fun too!", "verified": true, "helpfulness": "0/0", "author": "TD"}, {"rating": 4.0, "review": "Excellent unit and a no brainier to set up.  Wish it had \"local\" rabbit ear channels.", "verified": true, "helpfulness": "0/0", "author": "Bentley"}, {"rating": 5.0, "review": "Fast,  slick and easy to operate", "verified": true, "helpfulness": "0/0", "author": "Matt S. Soders"}, {"rating": 4.0, "review": "I wish I can give half stars cause it's not quite a 5 but I love it so much!!! Almost everything about it is great..... Having the option to put the apps you want on there is a wonderful idea!!! Cudos to whomever came up with that one!!!! Unfortunately they don't have some of the apps I would want... Like some tv watching apps.... Okay so about the voice command... Thats great!!! The only thing is that it only works if your looking for stuff on Amazon prime. So if you were watching Hulu or Netflix and you wanted to search for a movie or tv show you won't be able to use the voice command because it would just take you back to the prime movies.... You would have to do it old school and type in your search....=( not having to point the remote at the tv is another good thing unless you have kids like I do. You can't put that remote down for anything around my kids... High places only....They touch the buttons or sit on it by accident, I have to start the movie over...lol... Everything else is great!!!! No complaints. Had it for a month now and my family and I love it!!!! We also have the Apple TV and fire tv is way better.... The setup is better.... The visual aspect is also better!!!", "verified": false, "helpfulness": "0/0", "author": "Evangilise D."}]