[{"rating": 4.0, "review": "I've gotta say, that the Amazon Fire TV has the potential to be simply *AWESOME*...but it's just *pretty good* right now.Here's our story:  We had a SMART TV for 18 months, until one of our kids decided to throw his toy sword at it.  :-(  We primarily used the SMART features to stream media from Netflix (80%) and Amazon Prime (20%).  So, when we started looking at replacing our old TV and saw that the Fire TV would run Netflix for us, we were intrigued...after all, if the price of a TV is about $100 higher with SMART functionality, then we might as well get the Fire TV because it'll do all the same stuff, plus some extra stuff (games, voice-search, etc).  So we decided to buy a regular HDTV with the Amazon Fire TV, rather than a SMART TV.  And I'm happy that we did; I think this will be the better decision in the long run.Comments after a few days of operating it:Pros:--The remote control is cool.  Well-designed, elegant, very functional.--The voice-search function works really well...HOWEVER, see below--The various apps and games look cool.  I haven't had a chance to try them out very much yet, though.  Personally, I like it that you can get games for the Fire TV; I imagine that I'll likely buy a few games if they turn out to be worthwhile.Cons:--The voice-search function DOES NOT WORK on Netflix!  Come on, Amazon people!  It can't be that hard; make it happen.  If my wife has Grey's Anatomy saved in \"My List\" on Netflix (where it's free), then there's no reason it should bump her to Amazon Prime (to pay for it).  What should be the case is this: Searching for \"Grey's Anatomy\" should show ALL the various options for playing that TV show (Netflix, Prime, Hulu, whatever), and then give us the option to choose which provider we want from there.  Pushing us only to Amazon Prime is just stupid.--It is not possible to search in Amazon Prime for only content that is free with my Prime membership.  So my kids get excited to see a movie or TV show, only to have me click on it and discover that it costs $1.99/episode or $19.99 for the movie.  They get disappointed, and I get annoyed.  This is obviously a cheap selling tactic, and it makes me not want to use the Fire TV's cool search functionality.  Again, this should not be the case; fix it, Amazon!So, the Amazon Fire TV could either be a top-of-the-line 5-Star product that has no true competition in today's market...or it could be a mediocre 3-star product, which is functionally no better than an Apple TV or Roku device.  It all depends on whether or not  Amazon decides to update their system with functionality it should've had from the start.", "verified": true, "helpfulness": "1/2", "author": "Trev"}, {"rating": 4.0, "review": "Sorry Roku, I've been waiting for you to up your game for years and the roku 3 was not at all an upgrade.  The Amazon Fire is miles better and faster.  One star off because I have noticed some of the smooth menuing system has gotten a little jittery in the month since I bought it.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 3.0, "review": "Amazon has to add support for all apps within voice search. Some reviewers act like the voice search is \"good\" it's not good. It's GREAT. The voice search is the one thing that means the difference between spending a minute or more trying to get what you're looking for or having it play within 2 seconds of me starting my search. I hate wasting time. However, I'm giving a whopping minus 2 stars because the voice search feature only browses amazon content and vevo if you're looking for music. This is unacceptable. Amazon probably does this to get you to buy something from them, however if I know that a particular series is on netflix I want ot watch I'm not going to buy it from Amazon just because that's the only thing that pops up. Even if I don't know I'm still going to check all my other subscriptions before I make a purchase. If I want on demand content I'm going to get it from Amazon anyway, because typically they are cheaper. I don't see why they decided to do this. Anyway 2 stars get's taken away because of this. Otherwise this device is perfect and an amazing invention comparative to other streamers (mainly Roku). This thing beats out Roku by a long shot.", "verified": true, "helpfulness": "0/2", "author": "Ben"}, {"rating": 5.0, "review": "Works great. Really like the voice control & the way the remote works.Lots of programing on prime. Some newer movies.", "verified": true, "helpfulness": "1/1", "author": "Raymond L. Taylor"}, {"rating": 5.0, "review": "Amazon Fire Tv is amazing it has all that I need for entertaining myself. The device itself performs and make all the entertainment needs available but the cost of buying can be costly and in my case my internet provider is Hughes Net and my data is limited but as a back up to my antenna tv it is perfect.", "verified": true, "helpfulness": "1/1", "author": "E. Levett"}, {"rating": 4.0, "review": "Would have given it a 5 star rating if it would seperate my free prime movies or  my netflix movies from all others when searching...I'd like to see those first.", "verified": true, "helpfulness": "1/3", "author": "Larry Tierney"}, {"rating": 3.0, "review": "My Prime membership benefits notwithstanding, the Amazon Fire product is cool primarily because of the voice recognition feature. Otherwise, it compares well to another one or two streaming video services and products I already have.", "verified": true, "helpfulness": "0/0", "author": "Dennis McDonough"}, {"rating": 5.0, "review": "Very easy to use. Wish there were more apps and an app killer feature. Some kind of soft reset would be nice as we'll instead of unplugging it", "verified": true, "helpfulness": "0/0", "author": "Allyson J Pope"}, {"rating": 3.0, "review": "I returned the Fire TV after living with it for a month. The voice search was a great feature that worked well. Problem was the Fire constantly lost my wireless network (Apple Airport Base station) and went into a long buffering waits. When I replaced it with the AppleTV that had been there previously, the Apple worked fine.", "verified": true, "helpfulness": "2/4", "author": "LgR"}, {"rating": 1.0, "review": "I bought amazon firetv as a ludite, knowing nothing about built in to modern TV's copy protection HDCP. I have a many thousands of dollar old Sony Plasma screen and will not part with it willingly. Amazon should explicitly highlight that all tv's bought before the current content protection scheme was built in (HDCP) are incompatible with Amazon fire TV. There are many, many million of these.  My experience: I  tried  to install firetv unsuccessfully, called the fire TV help, who gave a list of suggestions which did not work, including replacing the firetv and all cables, which I did. No one mentioned HDCP, which I had never heard of. I finally found from the web  that amazon flash had a similar problem, and emailed firetv help to enquire whether firetv had the same problem. The first person did not know, and said I would receive an answer. After a day I asked again, and the answer was that yes indeed, HDCP prevents the box from booting on a non-HDCP tv. I am returning all purchased items.", "verified": true, "helpfulness": "3/14", "author": "anil nerode"}]