[{"rating": 3.0, "review": "I don't play games and this box doesn't give me access to HBO GO which is what I am looking for in a set-top box.  Why no HBO GO?", "verified": false, "helpfulness": "7/154", "author": "James M. Whaley \"Old Surfer\""}, {"rating": 4.0, "review": "This device is kind of an OUYA without the Noisy Fan and XBMC now works well on OUYA (Android Based) and in fact the version I have on my MotoG works as good as my Raspberry Pi. I would expect this product to be open or slightly locked down where an OUYA XBMC will soon be installed and YouTubed within DAYS, Can't wait for the video upload.", "verified": false, "helpfulness": "7/109", "author": "StreamKing"}, {"rating": 5.0, "review": "looks good, the controller needs improving as it seems really blocky and basic, however please stay with the 360 design as it works better than playstation.when can we expect this product in the UK?", "verified": false, "helpfulness": "8/107", "author": "Mr. T. Arnold \"TOMA\""}, {"rating": 4.0, "review": "Sounds like a real break-through in terms of price and specs as well as offering the gaming part which is missing from other boxes.When will it be available in Europe?  Can't wait to get it  :)", "verified": false, "helpfulness": "7/105", "author": "LC_Roma"}, {"rating": 5.0, "review": "Beats Roku, Apple TV and Chromecast easily.At first I thought it was an April Fool's prank, but it isn't!Going to get it imported in, if the mirroring and gaming features grow. Good Going, Amazon!", "verified": false, "helpfulness": "4/83", "author": "Amazon Customer"}, {"rating": 4.0, "review": "After a quick glance at the comparison chart, I see two issues right away. As far as I can tell, there's no headphone jack and I don't see NBA League Pass in the program list. My Roku 3 has both.", "verified": false, "helpfulness": "9/118", "author": "Bob in New Mexico"}, {"rating": 4.0, "review": "If I didn't just buy the Roku, I would have bought this instead. Wish I knew about it before I bought the Roku on Amazon.But, Does it have the free channels that Roku has???", "verified": false, "helpfulness": "9/138", "author": "Michele"}]