[{"rating": 5.0, "review": "We love this.....very easy to use and I love that I can listen to my music library on my tv!", "verified": true, "helpfulness": "0/0", "author": "Robert Reynolds"}, {"rating": 5.0, "review": "Excellent customer service! Love the voice control. Love getting to see content on my tv that I only watched on my Kindle previously. It's much easier to use than Comcast on Demand, and I can watch some content for free that I would have to pay extra for on cable. I pay for Prime anyway, so Fire TV is a bonus. I'd enjoy the availability of even more documentaries, though.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "I have trouble believing that Amazon had YEARS to study the Apple TV and then still come out with an interface this bad. The biggest advantage the Fire TV has over the competition is access to thousands of free titles via Amazon Prime. However, they blew it by making it IMPOSSIBLE to search through their free collection.Last night I tried accessing Flixster, but it crashed on me twice before I got it to run. Then while trying to watch my movie, it stopped to buffer every 45 seconds. This is just unacceptable and makes it unwatchable. I've never had buffering issues with my Apple TV or any of the apps on it. This is a complete waste of money and I'm not surprised that Amazon is aggressively discounting it a few weeks after release.", "verified": false, "helpfulness": "5/8", "author": "madoka"}, {"rating": 5.0, "review": "I had an Apple TV and I was streaming Amazon Instant Videos from my iPad or MacBook Pro, but it lost the signal frequently so I decided to try the Amazon Fire TV instead.  I couldn't be happier with the product.  The initial walk through was pretty cool.  I plan to get a couple more of these for different TV's.", "verified": true, "helpfulness": "2/2", "author": "V. Dean"}, {"rating": 4.0, "review": "Excellent the only reason I didn't give it. 5 stars is because it needs more apps also needs Chanel's and it could catch up with roku & Apple TV", "verified": true, "helpfulness": "2/2", "author": "Richard L. Aeriel \"rick 7\""}, {"rating": 5.0, "review": "Love the function of this product", "verified": true, "helpfulness": "0/0", "author": "R. S."}, {"rating": 2.0, "review": "We loved this when we first got it, and much preferred it to Apple TV. However we can't get netflicks to work on it, and are now having trouble with the streaming video. Plus they have now dropped the price, which for those of us who got it right away is a bummer.", "verified": true, "helpfulness": "2/2", "author": "kid Katz"}, {"rating": 2.0, "review": "Having owned a Sony, WD, and Ruku 2 and 3 I was really interested in the Fire. I got it and tried for a day. It was not what I expected.  The user interface was a mess. I have to say that the Roku 3 us the winner when it comes to streaming media boxes.The Fire was boxed up and sent back.", "verified": true, "helpfulness": "2/2", "author": "Kcgreen"}, {"rating": 5.0, "review": "I LOVE this product!  For me, this is fabulous.  I am a sucker for old movies and I have been really frustrated with Comcast as they have gotten very stingy on how frequently they update Streampix and their inventory in on Demand.  Or at least it sure seems that way to me.  So being a Prime user, I thought what the heck let's try this.  I am sitting here watching what is probably my 8th movie since getting this - so it's already been worth it to me.  I am going to see what Amazon does with pricing -- let's just say Comcast has me wary of \"deals\" and then jacking up prices - but if all goes well over the next month or so, I am dropping a  lot of my Comcast since this little device and service is just fitting the bill -- at a reasonable cost -- for me.It was a piece of cake to set up - so absolutely no issues there. And now they're trying original programming - so that is something I am looking forward to trying.  This is a winner Amazon - just don't mess it up by getting stingy on what you're offering for free...that would make me scrap it like I plan to do with much of my Comcast  :)", "verified": true, "helpfulness": "1/2", "author": "Maggie"}, {"rating": 5.0, "review": "Roku to Fire TV... Way Better is all I have to say", "verified": true, "helpfulness": "0/1", "author": "Anonymous"}]