[{"rating": 5.0, "review": "Great love it", "verified": true, "helpfulness": "0/0", "author": "Mark S Geesman"}, {"rating": 5.0, "review": "I bought this to replace my Roku XDS and I don't regret it. I won't dare to compare the 2 as far as performance since the Roku XDS is 4 years older. Feature wise and ease of use, the Fire TV has the Roku beat, but then one could argue that Amazon had time to learn from others like Roku to see what works and what doesn't and time to think what extra features to add.When I got this I was looking at the Roku 3 and Google's Chromecast. I went with those over the Roku because I do have Amazon Prime and that I could get many of the same channels that I had on the Roku XDS on the Fire TV. The reason I didn't go with the Chromecast was because I learned it's not really a set-top-box type of device with channel on the device but instead relied on your mobile device, or laptop/desktop, to beam content to it which for me is pretty limiting and restrictive.I'm not a cord-cutter, yet, but that's mostly because  the rest of family have no interest in that doing that, plus I would like to have an OTA DVR also I do watch a lot of the movie channels on my cable when I'm not watching the DVR recordings.I almost got the Fire TV Stick but felt that was more suited for someone that travels a lot.", "verified": true, "helpfulness": "0/0", "author": "WBJ"}, {"rating": 5.0, "review": "Works perfectly. No lag or freezing during streaming.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It is a  great  product however,  you would think with amazon Prime you would be,able to watch most things...you still need to PURCHASE a lot of movies etc to be able to enjoy this product", "verified": true, "helpfulness": "0/0", "author": "Ms Fabulousity \"Fish from JA\""}, {"rating": 5.0, "review": "Quick and fast response. Makes watching tv a breeze.", "verified": true, "helpfulness": "0/0", "author": "Nathan Key"}, {"rating": 5.0, "review": "I have this connected on a tv upstairs and not near my wifi setup and the connection is excellent with little to no buffering.  Another device I connect in the same room will always say marginal or poor connection saying 27% or 35% so I'm very pleased with it.  I have a roku box too on another tv and while the roku has more apps I would still give the fire tv 5 stars because you know that up front.  The roku has more small or speciality apps like  the newspaper in the county next to me has one,  a lot of churches have their own apps, one person has put up a cat tv app showing videos of cats.  I like both the fire tv and the roku box.", "verified": true, "helpfulness": "0/0", "author": "Kathryn Wozniak"}, {"rating": 2.0, "review": "The interface, the remote, the speed, everything about this device is perfect. However, having to plug it directly into the TV to avoid a particularly awful sounding dialogue distortion and the fact that the best sound you can get is with optical because of the terrible dialogue distortion when plugged into a home theater receiver over HDMI does not warrant anything above two stars for me due to poor engineering in the sound department. I don't know why anyone would think that that is a good idea. You should be able to set up a device like this in anyway you would like, just like the Roku and AppleTV do.  It is really a shame because the rest of this device is perfect.", "verified": true, "helpfulness": "0/1", "author": "E. L. Marshall"}, {"rating": 1.0, "review": "Not a bad device... However Bezos decided not to let iOS users mirror their devices on the Fire TV, he only wants to let amazon tablets/phones mirror. News flash... Those devices suck! If you are an iOS user, amazon made your decision really easy for you... BUY AN APPLE TV!!! I am taking this back today.Also, I did not like the OS on this device and I do not feel like it is very intuitive.", "verified": false, "helpfulness": "1/7", "author": "ShayLyn Geisler"}, {"rating": 5.0, "review": "This is the best ever.  Not sure why I did not buy this earlier.  LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Christopher Dreier"}, {"rating": 4.0, "review": "Easy to set up and easy to use.  Wish the text was a little larger for us older adults with sight problems.", "verified": true, "helpfulness": "0/0", "author": "Brenda \"BCS\""}]