[{"rating": 1.0, "review": "This really sucks the big one !!!! Not worth the price and if you have slow internet it does not work !!! I spent the money for the conspiracy Ch. and it does not work at all ! There are no real ch. to pick from! I though I would use it as an alternate to regular TV but I was truly wrong! Don't give up your cable or other device because after one week you will wish you had it back !!!! One of the biggest wastes of money I have ever done! Also no real TV ch. like you would find on normal television, just snips of internet streams that you can find on the web without paying for it! Amazon really needs to go back to the drawing board and come up with a better product !!!", "verified": true, "helpfulness": "3/5", "author": "Craig Tompkins"}, {"rating": 4.0, "review": "I fine amazon fire tv and controlter to be a good investment.", "verified": true, "helpfulness": "0/0", "author": "solomon"}, {"rating": 5.0, "review": "Very easy to set up and very user-friendly!", "verified": true, "helpfulness": "0/0", "author": "Jordan Barksdale"}, {"rating": 5.0, "review": "This is probably one of the best $99.00 that I've ever spent!  I love the voice search option... if you know the name of an artist, director, etc., you can find what you're looking for.  The mostly free documentaries are great too.  I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Rod"}, {"rating": 5.0, "review": "My favorite media steaming device. I have owned wd media centers and apply tvs but this knocks them all out of the park. Super fast and the user interface is great. Awesome that you can play games on it too. Would highly recommend to anyone!", "verified": true, "helpfulness": "0/0", "author": "Caleb"}, {"rating": 5.0, "review": "Didn't know there was so much available on fire tv!", "verified": true, "helpfulness": "0/0", "author": "ukeplayer16"}, {"rating": 5.0, "review": "Workd great.  Very intuitive and user friendly.When will they add the HBO-Now app?", "verified": true, "helpfulness": "1/1", "author": "Art Kohlberg"}, {"rating": 3.0, "review": "I have tried so many times to get this device to work with my internet. I gave up... I am not sure why it will not connect.", "verified": false, "helpfulness": "0/0", "author": "Karen Biondi"}, {"rating": 5.0, "review": "like reinventing the wheel.the best ever. thank you!", "verified": true, "helpfulness": "0/0", "author": "DOUG"}, {"rating": 4.0, "review": "Customer service was helpful.. Shipment arrived within 6 days. Device is very good...just wished it had more memory.", "verified": true, "helpfulness": "0/0", "author": "Michel Gerard"}]