[{"rating": 4.0, "review": "I was able to obtain this device on a 30 day trial.  At the writing of this I am about a week into the trial.  So far I like it.  It came already attached to my trial of Prime.  Not sure if the entire package is worth $200, but I am enjoying the trials.The device is easy to hook up.  I ended up connecting mine through the 2nd hdmi input on my blu ray player and it seems to work fine with this configuration.  The only other hook ups are power and an ethernet connection.Device streams very well.  Voice search works well.  The menu is intuitive.  I was able to connect my Hulu Plus and Netflix accounts to the device and they work fine.  I like the blue tooth remote as I was able to install the device in a room behind my tv and the remote works flawlessly.The only problem I have had is on a few occasions I have had to un-plug and re-connect the hdmi cable as I get flashing video and sometimes static.  I have tried 2 different hdmi cables in 2 different inputs on the blue ray player.  Fairly sure the device has a slight bug in regards to the video output.I'm hoping in the future this device will output true 5.1 and 7.1 surround sound.  Right now it seems to be only 2.1 at best.", "verified": true, "helpfulness": "0/0", "author": "Slayv65"}, {"rating": 5.0, "review": "I have a lot of digital content I usually stream via a laptop hooked to my TV. Moved into a new house and set up several more TVs... Ran out of laptops. Decided, why not get something like this. Looked all over for a streaming box, none seem to play SMB shares over a Windows network. However, with the help of the wonderful people at the XBMC community, it does if you side load their app and it works perfectly. Flawlessly playing even 1080p content over the network wirelessly. Couldn't be happier. Bought a second FireTV the next day.Edit:If you have 2 FireTVs in the same house, the remotes will not conflict. The remotes are paired to the FireTV, so they can be literally on top of each other without issue.I am also having some buffering issues on the wireless with XBMC. I don't know if the wireless card is quite as powerful as I wanted, but I will be running wires soon. NO ISSUES WITH NETFLIX, my buffering issues are streaming my local media from my server via XBMC. I have seen no hiccups on supported official streaming. I'll report back what wired does for me when I get into my walls.", "verified": true, "helpfulness": "1/2", "author": "Kevin"}, {"rating": 5.0, "review": "Going from using streaming capable devices that were made for another primary purpose to watch Netflix/Amazon Prime/Hulu to using Amazon Fire TV is like going from driving your serviceable car with a sticky clutch to driving a brand new sports car. The little quirks that were just part of watching T.V are gone. This is high performance with a lovely purr under the hood.", "verified": true, "helpfulness": "1/1", "author": "Rena Linker"}, {"rating": 4.0, "review": "The thing that I don't know is how to send videos like from YouTube, netflix, or hull plus to the fire tv from my kindle", "verified": true, "helpfulness": "0/1", "author": "gloria rojas"}, {"rating": 2.0, "review": "Buzzing sound during audio since the first time I turned it on.  Amazon has been slow to resolve the issue, if they even do.  Should have had a replacement sent the first time I called with the issue, nope.  Second time I call they took log files and said the technical team would look into it, why wasn't this done the first time I called?  It's been nearly a week since they took the log files and I haven't heard anything back from Amazon.", "verified": true, "helpfulness": "0/1", "author": "jonathan terrazas"}, {"rating": 5.0, "review": "I wasn't interested in what this device, at least officially, was, because I already have a range of devices that run various apps. Who needs yet another one, right? I bought this to install and run XBMC, which it does perfectly. If you don't know what XBMC is, you can find information online, as well as tutorials on how to install it on Fire TV. In short, XBMC is a menu-driven program that lets you access online content with just a supplied FireTV remote, and this device is all you need, actually (you do need a PC or a Mac to install it though). And some XBMC repositories give you a, hmmm, much wider range of content than the officially-endorsed ones.Apart from XBMC, you can install other android software -- for example I was able to run Firefox on FiireTV, And a generic mouse plugged in into FireTV USB port works (I wish it had 2 USB ports, but this can be solved too).  I am not saying that this going to replace your PC/tablet, but it could in an emergency, or while traveling. In fact, you can plug it into your hotel TV and have your own entertainment, given decent internet of course.", "verified": true, "helpfulness": "1/1", "author": "PK"}, {"rating": 3.0, "review": "Pros:This is a really fast device.  I have 3 other streaming devices, and FireTV is only one that shows no lag when navigating menu which is awesome.The voice Integration Feature is really cool and works well with Amazon Video.Cons:The voice integration does not work well with other apps such as Netflix (although I understand this is coming soon).There is no \"start from beginning\" feature.The status light is super bright, and there is noway to shut it off other than to wait for 30 minute timeout.", "verified": true, "helpfulness": "2/3", "author": "Gregory Vonfange"}, {"rating": 2.0, "review": "the microphone search only seems to work for amazon prime subscription items not youtube or netflix which was sort of the whole point of buying it.", "verified": true, "helpfulness": "0/1", "author": "Furfoot"}, {"rating": 3.0, "review": "Box worked great right out of the packaging. Wishing there was a better selection of Prime content and a better way to filter just those shows.", "verified": true, "helpfulness": "2/2", "author": "Ray"}, {"rating": 3.0, "review": "As a substitute for a streaming TV box (like Roku or Apple TV) it is a great unit and provides everything you need. However, Fire TV had the chance to be the next gen replacement for basic gaming consuls but failed when they did not provide an expandable memory. Games must be on the hard drive of the Fire TV  to be able to play and the 5GB internal storage (says 8 in specs online, my device says 5GB in the settings on the device)  can only hold 2 large games so each time you want to play a new game you need to remove an existing one to free up space for the new game. This is an absolutely terrible user experience for gaming. With a very simple SD card slot on this device to expand memory it'd essentially make it a terrific gaming unit, as it is now it's a great streaming TV device and a functional gaming unit with frustrating limitations. Seems like such an easy thing for Amazon to miss on.", "verified": true, "helpfulness": "3/3", "author": "Andrew A Reinhard"}]