[{"rating": 4.0, "review": "This is the best little box for the price. You don't need to be tech savvy to use and with the prime membership makes this box even better. The only reason for not having 5 stars was because no shut off button.", "verified": true, "helpfulness": "0/0", "author": "Alex R."}, {"rating": 5.0, "review": "Just exactly what I expected so easy to use nice to have a change from regular TV.", "verified": true, "helpfulness": "0/0", "author": "Karan A. Sandholm \"Karen\""}, {"rating": 2.0, "review": "this is a very expensive streamer. thats all it basically does. you have your amazon prime account that you add to it and then netflix which you have to pay for both. I'd rather get a playstation 3 or 4 which has both amazon and netflix but atleast i can play games and watch DVD/Blueray movies. easy installation and fun voice search feature that only works with amazon prime account options. If you are in netflix it doesnt work, it will only give you amazon choices. If you don't \"sideload\" apps to this thing you won't have much options except buying everything you want to watch for 2.99 or 3.99 here and there on amazon. as far as tv goes you can get ustvnow app which is sideloaded and not simple to get on there at all but once you do it has a monthly subscription as well for the good channels and for hd quality. overall not worth the money.  ill stick with my cable and my playstation.", "verified": false, "helpfulness": "0/2", "author": "eyerisfgr"}, {"rating": 5.0, "review": "It was easy to set up. On screen tutorial was very helpful. Streaming was very smooth and clear.", "verified": true, "helpfulness": "0/0", "author": "L.. Marum"}, {"rating": 5.0, "review": "Love this. Love talking to the remote. Big time saver. Works seamlessly. Wish that Amazon prime would compete with Xm radio because I do not like them and Amazon would do a much better job and cost you less. Amazon you are awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Wild Angel"}, {"rating": 5.0, "review": "This is a great product.Now, if anyone experience the voice remote not working all of a sudden (you press the voice button on the remote and the screen shows the voice popup screen but cannot accept your voice commands), CHANGE THE BATTERIES!I learned the hard way.  I hope nobody goes through the hassle of contacting Amazon to solve this issue.  I solved this myself. :P", "verified": true, "helpfulness": "0/0", "author": "James \"The One\""}, {"rating": 2.0, "review": "Box works fine but Amazon Prime not as I expected.  Most good movies you have to pay for?", "verified": true, "helpfulness": "0/1", "author": "Jason"}, {"rating": 4.0, "review": "Came in on time and good shape. Now we're enjoying it should've done this a long time ago you as well", "verified": true, "helpfulness": "0/0", "author": "C Indy bourdeau"}, {"rating": 5.0, "review": "Bought 3 of these, I love them so much!", "verified": true, "helpfulness": "0/0", "author": "Jeanne Vogt"}, {"rating": 4.0, "review": "Thumbs-up!", "verified": true, "helpfulness": "0/0", "author": "RMW"}]