[{"rating": 5.0, "review": "It was extremely easy to set up and use.  We are very happy with it!", "verified": true, "helpfulness": "1/1", "author": "K. Cody"}, {"rating": 5.0, "review": "I really dislike watching movies on my iPad so I didn't use my Prime membership to watch the free content like I could.  But then I found Bosch the original series from Amazon and well... I got hooked.  Binged it in one weekend.  So I ordered the Fire TV and have to say I'm really happy with it. I'm hoping between Hulu, Amazon, and Netflix I can cut my cable bill down...", "verified": true, "helpfulness": "1/1", "author": "Meghan"}, {"rating": 4.0, "review": "IT'S BETTER THAN THE FIRE STICK, BUT I CAN'T TELL FOR SURE WHEN WATCHING NETFLIX.", "verified": true, "helpfulness": "1/1", "author": "BETTY D. WATSON"}, {"rating": 5.0, "review": "outstanding", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I tried the google nexus player before getting the amazon fire tv. The nexus player lags a little and app selection is limited. The amazon fire tv is so much faster. No lag, awesome app selection and some cool games to pass the time by. Amazon seems to be tweaking the layout as time goes on and it only gets better. There is a reason why amazon fire tv is one of the top sellers. I wouldn't even try the other boxes first just go for this one.", "verified": true, "helpfulness": "1/1", "author": "bryant"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "steve cushway"}, {"rating": 4.0, "review": "So Far, so good. Performance good, selection okay. Must have Amazon Prime to fully enjoy the experience.", "verified": true, "helpfulness": "0/0", "author": "Gregory F. Kubicki"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Mr. Jay"}, {"rating": 4.0, "review": "I would give it 5 stars except that I've had it for 9 months and suddenly the remote has stopped working.  Fresh batteries, reset, internet research etc etc etc and it's still not working.  Now I have to spend time requesting a replacement.  I wish a universal remote could control the Fire TV.", "verified": true, "helpfulness": "0/1", "author": "Kas"}, {"rating": 4.0, "review": "So far I'm liking fire Tv. One step closer to cutting the cordAlso, Sling TV is worth the $20 a month", "verified": true, "helpfulness": "0/0", "author": "TMcD"}]