[{"rating": 5.0, "review": "The most elegant of all the streaming boxes. I side loaded Kodi, and it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Tonto"}, {"rating": 5.0, "review": "Best Investment and best invention since sliced bread!!!! Good Job Jeff Bezos!!! Hat Off To Ya!!! We Love It!! I'm glade I stopped and looked into it!!", "verified": true, "helpfulness": "0/0", "author": "Rene A. Garza"}, {"rating": 2.0, "review": "adasddasdfasdasdfasdfasdfasdasfasdfasdas", "verified": false, "helpfulness": "0/5", "author": "Vikas Sood"}, {"rating": 5.0, "review": "works quickly  with Amazon products Netflix excetera. love the voice search all remotes should have this.", "verified": true, "helpfulness": "0/0", "author": "David Watkins"}, {"rating": 5.0, "review": "The fire tv box is awesome! I highly recommend. I have used an apple tv, roku, and chrome cast.... the fire tv box is hands down the quickest and easiest to use.", "verified": true, "helpfulness": "0/0", "author": "RyanTM"}, {"rating": 5.0, "review": "Works great and is amazingly fast, much faster than the built in apps in my TV and prior streaming box.I would recommend just for the speed increase in using amazon video.  but has tons of features beyond Amazon Video.", "verified": true, "helpfulness": "0/0", "author": "TJ D."}, {"rating": 1.0, "review": "I cannot stream Netflix with Dolby Digital. I can go into the apps on my Samsung Smart TV and stream Netflix with DD. Amazon blames it on the app provider. I don't believe it.", "verified": true, "helpfulness": "0/4", "author": "james sturm"}, {"rating": 5.0, "review": "Love this!!", "verified": true, "helpfulness": "0/0", "author": "dollie peralta"}, {"rating": 5.0, "review": "Wife loves it. She watches shows on it every night in her \"Woman Cave\". We are going to get the Fire Stick for our tv in the bedroom and one for the living room.", "verified": true, "helpfulness": "0/0", "author": "Eddie McDonnell"}, {"rating": 5.0, "review": "Much better to get this than the stick.", "verified": true, "helpfulness": "0/0", "author": "Patrick T. Quinten"}]