[{"rating": 5.0, "review": "In spite of it's missing the Amazon cloud player and an ordinary assortment of widgets, it does broadcast in Dolby Digital+, a really nice thing to do.  It integrates well with my receiver (Yamaha RX-V573).  Sure, it's a total portal to my Amazon content and Plex ix not the Amazon cloud player, which should have been released with Fire TV.It does some good things and if you have a ton of Amazon content, it's worth it.  As a prime customer, mine came set up for my account, installation time was about 2 minutes.", "verified": true, "helpfulness": "0/0", "author": "Code Monkey"}, {"rating": 4.0, "review": "Checked the comparison chart and the amazon fire Tv was the best choice for me.  Just need to figure out if I can connect to Amazon cloud so that I can access all my music files on there.", "verified": true, "helpfulness": "0/0", "author": "Larry Hill \"Larry\""}, {"rating": 5.0, "review": "Easy to use, great for finding a movie or show with just voice command. Gary Bussey would be proud of you for buying this.", "verified": true, "helpfulness": "0/1", "author": "George Allen"}, {"rating": 5.0, "review": "I was really impressed.  Being a prime member of Amazon I now have so many more options when there is not much to watch on tv.  I also subscribed to Netflix for even more options.  Very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "J. Fagundo \"dclguy\""}, {"rating": 4.0, "review": "I own two Ruku's and two Apple TVs.  I love the speed of the Fire but wish the voice recognition would work across all program services, like Netflix. I also wish there were more program options, like the PBS program on Apple.  I really like how a TV series plays the next show automatically without manual intervention.", "verified": true, "helpfulness": "0/0", "author": "Lacontessa"}, {"rating": 4.0, "review": "We only have had this for a couple weeks but so far so good. Very easy to use and easy to install.", "verified": true, "helpfulness": "0/0", "author": "Shopkeeper"}, {"rating": 4.0, "review": "Overall the box does many of the same things other media boxes do. The interface is a bit busy but I do enjoy the Amazon streaming. Something I already had with my Sony BlueRay and Sony TV. I do prefer this interface though.Plex at times has it's issues. It's not the fault of the Fire TV but the application. When that happens. I have to switch over to watch the same program from the same source on my WDLive TV. Then there's no issue.I like that I can stream TWIT from the Fire TV via the dedicated application. No RSS streaming here. I haven't tried any games yet, so I can't speak to that.My biggest frustration with the unit is the remote. The fact that it's Bluetooth and there's not another option to use my Harmony. Very frustrating now having to defeat the purpose of having a universal remote. The voice search is fine, but as to be expected and covered in other reviews. The Amazon content comes up first. This would include paid content through Amazon streaming. Not Prime necessarily, but instant video.The other hang up I have with it is there's no way to power it down or put it into sleep. You just have to let it go into a standby on its own.", "verified": true, "helpfulness": "2/3", "author": "Jason Brown"}, {"rating": 5.0, "review": "So I ordered the Amazon Fire TV on a whim. I wanted a media device that was a little bit of everything. I have a gaming pc I use for my main gaming system, an Ouya for Android indie gaming and now the Fire TV. I chose this because its great for media streaming. I have my Netflix attached plus the bonus of Prime Video. This is great because it cuts the worry about heat in my room like with my pc. But, I was also drawn to the idea of dedicated Amazon gaming. This is great and I like how the store front is set up on the Fire TV. Navigation is easy and the top picks and suggestions are great. So I downloaded Bard's Tale since I had it for my phone I wanted to play this again on my TV. This is where the issue came in. Games not large, to begin with, but requires about1.5 gigs for standard def or 3.5 gigs for HD. I obviously wanted HD. Yet, without and expandable memory option I am almost at my memory limit for the device and this stinks because I would like to keep my games locally. With game circle you can save your progress but I don't want to have to unistall to install other games. If anything, I would create an option for expandable memory through the usb, kinda like with the Ouya. This would make the device even better. For now...one game at a time I guess.", "verified": true, "helpfulness": "1/1", "author": "Archaeologist Cat"}, {"rating": 3.0, "review": "cool product just im not a prime member or kindle fire user. if i was it would have been perfect.", "verified": true, "helpfulness": "0/3", "author": "Donnie Kuster"}, {"rating": 4.0, "review": "Took five minutes to set up, voice search works great, great picture.  Amazon I am impressed. Hope you keep the prime content coming which makes Prime Membership a real value.", "verified": true, "helpfulness": "0/0", "author": "Victoria Lippmeier"}]