[{"rating": 5.0, "review": "no more large cable bills this box rocks", "verified": true, "helpfulness": "0/0", "author": "KAT"}, {"rating": 5.0, "review": "Love fire tv, buy one you will love it", "verified": true, "helpfulness": "0/0", "author": "misserma"}, {"rating": 5.0, "review": "Love the interface. Much fast and the streaming quality exceeded my expectations. The remote is simple, the device is compact and installation is simple.", "verified": true, "helpfulness": "0/0", "author": "Paul Barker"}, {"rating": 5.0, "review": "It is truly amazing and state-of-the-art! I love how the Amazon Fire TV sync's with my Smart TV and how I can add a thumb drive to increase storage capacity. Hands down the BEST investment for entertainment viewing I have made!", "verified": true, "helpfulness": "0/0", "author": "Armando Baez"}, {"rating": 1.0, "review": "I thought amazon tv was free movies . All the free movies are unheard of & not interesting", "verified": true, "helpfulness": "1/8", "author": "Tai"}, {"rating": 5.0, "review": "It's nice to get internet provided entertainment.", "verified": true, "helpfulness": "0/0", "author": "Kenneth A. Maxey"}, {"rating": 5.0, "review": "We are hooked. This is great.", "verified": true, "helpfulness": "0/0", "author": "Katherine Martellino \"Katherine Martellino\""}, {"rating": 3.0, "review": "This unit is very easy to set up.  The voice recognition works well and I love the Pandora app!  Would like to see a bigger selection of movies offered for Amazon Prime members.  All of the recent or popular movies do not seem to be included on Prime and are expensive to rent.", "verified": true, "helpfulness": "2/2", "author": "mwayne"}, {"rating": 2.0, "review": "bought it because salesman said it would mirror with my samsung tablet very clearly. It does not. Still very choppy.", "verified": true, "helpfulness": "0/2", "author": "t"}, {"rating": 1.0, "review": "This product misrepresents it features. Namely it does not support spotify. At time of this writing there is a spotify connect app that does not work. The features table can only be regarded as \"at some point the fire TV may have had this feature. It may even have it now. But there is no assurance that this product will continue to support this feature.\"", "verified": true, "helpfulness": "0/3", "author": "Steven H. Noble"}]