[{"rating": 5.0, "review": "just as good as the first one", "verified": true, "helpfulness": "1/6", "author": "David Reil"}, {"rating": 1.0, "review": "Stop buying this product! I have two of these and spend half of my time trying to get them to work. Just use your DVD if enabled! Anything works better!", "verified": true, "helpfulness": "0/5", "author": "Grumpy"}, {"rating": 4.0, "review": "This product is very good. It has mucho movies, TV shows and more. One thing I am disappointed about is YouTube. I wanted to show a video on it and did a search and there was no way to search on YouTube for what you are looking for. Other than that it is a very good device to have.", "verified": true, "helpfulness": "0/0", "author": "Anita Mobley"}, {"rating": 5.0, "review": "So great!", "verified": true, "helpfulness": "0/0", "author": "Van Burnham"}, {"rating": 5.0, "review": "I plugged it in and it went right to work.  Super easy to use.  While I have a \"smart\" TV, and can access Hulu and Netflix from the TV itself, I couldn't get Amazon Prime through it.  :(So, bought this and love it.  The voice search is great.", "verified": true, "helpfulness": "0/0", "author": "M Christian Halstead"}, {"rating": 5.0, "review": "I've become a cord cutter and although at first I was lost on what to watch, after a year I have found my favorites.  I am glad that I did it.  Setup was easy, choices have been adequate for me, and the continued upgrading and new choices keeps me entertained.  I recommend.", "verified": true, "helpfulness": "0/0", "author": "Antigone"}, {"rating": 3.0, "review": "new update kills the box. whenever i turn on the tv now, i'd have to re-plug the box to get it work. otherwise the screen just stays black and remote control completely useless (though i could see the led light flashes once sometimes). don't know why. Please fix. Otherwise great product.", "verified": true, "helpfulness": "1/1", "author": "Mr. Love"}, {"rating": 5.0, "review": "Great love it", "verified": true, "helpfulness": "0/0", "author": "Louis J. Iaquinta \"LOU\""}, {"rating": 5.0, "review": "I love using my Amazon Fire TV..... I have Hulu Plus for 8 bucks a month..... It saves me money on a cable bill..... Yay.....", "verified": true, "helpfulness": "0/0", "author": "Cherise"}, {"rating": 4.0, "review": "This is a great method of watching TV...the only drawback I had was with using the hdx kindle with the tv...the only show you canwatch from your tablet is prime movies or prime tv channels,ie, you can't watch any other content except prime while I'd like to seeany program on your tablet could be shown on fire tv!!!", "verified": true, "helpfulness": "0/0", "author": "Frank R. Wong"}]