[{"rating": 4.0, "review": "This is a blended score.. On the plus side:-remote is well designed-voice search works well-streaming and video quality are Very good to excellent-FireTV does address one thing I do NOT like about AppleTV, the ability to rewind content easily. We have used that product for some time and thats a pet peeve for the apple product.The only real negative is that scrolling through content is not a great experience. I think they could center the item in focus, and push the others to the back a little, versus the current scroll which moves all items, with current selection at left, and it just was an odd visual experience.", "verified": true, "helpfulness": "1/1", "author": "Michael K."}, {"rating": 5.0, "review": "There are a few aspects I'm still getting used to, but overall love it...makes streaming easy. If the price was a bit lower, I would buy more!", "verified": true, "helpfulness": "0/0", "author": "jackie l palmer"}, {"rating": 1.0, "review": "No HBOGo is a show stopper and the fact that Amazon does not know that means they don't belong competing in this space.  It's the most irresponsible product launch (extremely poor pre-launch analysis) in this product space.  HEY AMAZON:  HBOGO OR GO HOME!", "verified": false, "helpfulness": "4/24", "author": "Brian Wolfe"}, {"rating": 5.0, "review": "Right out of the box it was easy to install and use without having to read the instructions.  It is a little unnerving without a shut-off button, but the automatic sleep routine works well.  I do wish it could also permit viewing of the latest episodes of my favorite over-the-air shows as soon as the show airs.", "verified": true, "helpfulness": "0/0", "author": "Home James"}, {"rating": 4.0, "review": "When they improve the way you can browse through the Prime material, I would give it 5 stars. I plan on discontinuing my cable service and using this instead. It will save me a lot of money and it will allow me to watch exactly what I want. I just don't want to pay too much extra beyond the Prime membership.The voice control is spot on every time. As far as the size, I could fit about 30 of the Amazon Fire boxes inside my DVR cable box. It's very small. The Fire remote is blue tooth, so I don't need to point it. There is only 9 buttons and they are all useful, unlike my cable remote, which has 63 buttons. I use about 10 of those. And it's about 4 times the size of the Fire remote.I have never owned any other internet based systems, so I don't have much input on how the Fire compares to others like it. As far as how it compares to cable, there is no comparison. It is already better and it's only going to get better.", "verified": true, "helpfulness": "0/0", "author": "ze1999"}, {"rating": 4.0, "review": "After the excellent experience I've had with my Kindle Fire reader, I jumped on the opportunity to get the Fire TV Box.I was pleased with everything from the shipping to the set-up, I have just a couple of minor quibbles.My Fire TV arrived in two days and was well packaged. My arthritis appreciated the simple-to-open box. The power brick/plug was too large to fit into the space I had for it so I had to get a short extended to fit. I set it up in little time and hooked it into my Samsung 45\" 3D TV.It initially had to download updated operating system stuff, which took an alarming amount of time. (I almost rebooted my WI-FI system, but noticed the progress bar creeping slowly along.) Once it booted, I enjoyed the little animated intro, then set out to bring in my Netflix and Pandora accounts. I appreciated the simple layout of the user and password screens.The quality is a cut above Chromecast probably due to the better processor. I'm especially enjoying the screen saver when I'm listening to Pandora. I wish I could get them for my desktop screen saver.I don't do games, so I didn't get the gamer interface. I purchased the HDMI and optical audio cables offered by Amazon and found them to be as excellent as the box.I'm giving it a high 4 stars, actually four and a half, taking points for the long OS download and the awkward power brick.All-in-all, it is a great investment.  I'll write another review after about 6 months to see how the experience holds up in the long term.", "verified": true, "helpfulness": "0/0", "author": "Alan Batten \"promoman\""}, {"rating": 4.0, "review": "Limited use so far but like the simple and easy-to-use functionality Like the help tools and number of available apps.", "verified": true, "helpfulness": "0/0", "author": "James Herndon"}, {"rating": 4.0, "review": "Amazon has done it again, they have created a divide that even the least technological person can figure out.  It took me about as long to master it as did my IPad.  However, there are definitely still some kinks that need to be worked out, there always is at the launch of a new product, all software issues mind you.The devise itself I think is great! it virtually disappears next to my TV and the voice capability is AMAZING! Blows Apple's Siri out of the water!My hopes,They need to work on their software a bit, to figure out when it turns off, when it goes to wallpaper and when it turns on, a couple times I have had to unplug it to get it back on (this is the reason for 4 instead of 5 stars).I also see that this has the possibility of being so much bigger (not in size) then it is.  Hopefully people will begin to transition some of their apps, to this platform, like the weather channel, yelp, things like that would be awesome if that could happen, especially .  But that is merely an idea.", "verified": true, "helpfulness": "0/0", "author": "Bryan J. Franzen"}, {"rating": 4.0, "review": "It is somewhat better than other tv media device. I have had them all. Amazon fire downloads right away. The voice activate does not recognize my voice commands even if I slowly enunciate correctly. It gives mixed message signal like you have no internet connection, your battery is low which I think refers to the remote or the internet download is low. It only state this on the amazon prime app and not Netflix app which works really well.", "verified": true, "helpfulness": "0/0", "author": "Geraldine"}, {"rating": 5.0, "review": "Easy hookup works great does everything it's supposed to do. I used it to watch ESPN three on Sunday on my big screen and it was perfect", "verified": true, "helpfulness": "0/0", "author": "coraflash"}]