[{"rating": 3.0, "review": "Oddly this device deserves both a five star rating and a 1 star rating at the same time. The things they did right, they did really, really right and blow the competition out of the water but there are serious omissions that I believe an average television watcher is going to surely miss.For watching Amazon content this device is glorious; smooth, extremely fast, easy and convenient. The performance is truly impressive and definitely best in class. The voice search worked great for me although I am not pushing it to its limits with a medium range voice and no accent.  I love how it was already linked to my account since I purchased it from Amazon, classy touch.Major omissions/annoyances: The remote will not control your TV, so for turning the TV on/off and adjusting volume you will still need another remote.Other content providers (Netflix, Pandora, etc) are not integrated with voice search, so your voice search will only call up Amazon content and to access the others you have to enter into the app explicitly and use an on-screen hunt-and-peck style interface to search. I am hopeful that either the content providers will remedy this in the future or Amazon will sell a bluetooth keyboard for the thing. Perhaps just make my GoogleTV keyboard work? :)Also, it does not come with an hdmi cable. Most people probably already have a cable they can use, but I can only imagine the frustration of someone purchasing this and not having the ability to plug it in. This device in its current state will not really replace other devices you have, it would most likely just be an added item for watching Amazon content, so a cable should have been included.Obviously, this is a first impression review (The Fire TV was released yesterday). Some of my first annoyances could be remedied by a future software update, but I don't recommend you buy this product just yet. I am going to keep mine a few days to explore further and then probably send it back. I will update this review.", "verified": true, "helpfulness": "143/169", "author": "Exercise Happy"}, {"rating": 5.0, "review": "I just got my Fire TV and hooked it up about a half hour ago.  I had a Roku for Netflix & Prime, and a NetGeo thing for YouTube.  Now I just need the ONE device.The remote is excellent and high quality.  Easy to use and figure out.The voice search is only for Amazon things, but it is REALLY intuitive and works like a charm (and I have a Brooklyn accent).  We're testing. just how granular it can get, but so far it's outstanding (you can say the name of a series and the season and it takes you right there).  We've tried giving movie and TV show names, works perfect. Actor name, subject - it's really outstanding.  Very cool that in addition to being able to watch now or add/remove from your watchlist, many of the films even have trailers you can watch.  Scrolling left/right is super easy (just hold the circle down) - and YES! - the TV programmes on your WatchList are INCLUDED with the movies.Synching with YouTube is simple and fast - and searching online and just hitting \"watch on TV\" couldn't be easier. VERY fast loading!!!  Ditto with NetFlix - and the look of the NF Homepage is really nice.  FAST scrolling - hold the right/left part of the remote and it flows very quickly.So far the only drawbacks we see are that the Amazon Watchlist doesn't just keep going around when you come to the end (not a big deal at all) and the Search on the TV screen for YouTube doesn't offer a delete all or apostrophes - but since I prefer to search online then watch on the TV this is not any sort of issue.Sorry, not a gamer, so I can't comment on the games.All in all, just an hour into ownership I am THRILLED with my Amazon Fire TV", "verified": true, "helpfulness": "27/34", "author": "Chief Rocko"}, {"rating": 1.0, "review": "Won't work with my Logitech Harmony remote nor work with any other universal remote. Who wants to mess with multiple remotes, All my other devices use my Logitech remote.Staying with my ROKU", "verified": true, "helpfulness": "63/182", "author": "reefbum"}, {"rating": 3.0, "review": "If I understand correctly (maybe I missed this as I have not researched the product much) fire has no web browsing capabilities, no HBOgo etc and is not able to download new apps? If that is the case I can get a quad core android TV Stick for $50 to $100 and do 90+ percent of what fire does plus be able to freely surf the web. I don't want to bash Amazon too much (and I may want to work there someday) so having said that Amazon overall is an amazing company. Their tech capabilities are mind blowing and I like that upper management reaches out to Universities, its a honorable and smart thing to do.  Robert Eldridge came to a class I took at UW as a quest speaker I appreciate that they take the time to do that. In my opinion they somewhat dropped the ball here( if the mentioned above things are true), anyone elses thoughts on this and/or anyone looked into fire's capabilities?Gary W. Shaw Jr.", "verified": false, "helpfulness": "5/31", "author": "Gary Shaw"}, {"rating": 5.0, "review": "I just got my Fire TV today and haven't got to use it yet. The reason? Because I didn't read down far enough where it says you need an HDMI Cable. That is why I am starting with a 4 star. I know it was my fault that I didn't read everything but why would a cable that is needed to use this not be included? If nothing else they could have put that up in the beginning so that I would have known ahead of time to order one. Amazon was kind enough to have it expedited when I got in touch with them so I will be able to hook up tomorrow. And then I will come back to update (or downdate if necessary). But, I have complete faith in Amazon products and rather than giving a 1 star because they don't have an app that I wanted I will wait to see how well the Fire TV performs. If it performs good and does what it says it supposed to do my rating will stand. I don't think I will have to change my rating. If I would like to get more apps that they don't have I will bmaybe put in a suggestion in the forum. All these 1 stars are the dumbest things I have seen. All these people who haven't bought this because it doesn't have HBOGO? It tells you that up front. That only makes it bad for you who care about HBOGO. Give me reason such as bad sound, bad picture, bad customer service. HBO is not a service offered so it doesn't have to work. That is why I'm reviewing this before I even use it. Most of the 1star reviews are because of the HBOGO not because they've used this thing. I've bought thousands of dollars worth of stuff from Amazon from Kindles to books to computers to lawnmowers, bread machines, pots and pans, baby cribs and toys and there isn't one thing that Amazon has not stood behind. If I got a defective item they replaced it (even if I was rude and mean to the representative). If it came late they give make it up by giving me a credit. I have never had that happen even at a Walmart. When was the last time Walmart called you to listen to your complaints and respond with a \"Let me fix this problem for you.\"? Like I said I have such faith that I know I won't be having to change my rating, because if this doesn't perform how I thought it would I know Amazon is here to help me.Update 04/08/2014: I did get to use this and I am perfectly happy with it. I'm leaving it at 4 stars though as I still think the HDMI cable should have come with it. Got to watch a movie with it the first day and yesterday my cable was down (but not the internet) so I was able to use it again. Very fast. No waiting for buffering and no interruptions during play (unless I wanted to pause). And the picture and sound is perfect. Haven't got a chance to play games yet. My husband hogs the TV. I have an extra HDMI cable (since I had to order an extra one to get it earlier, which turned out good in this case)so I plan on hooking it up upstairs. Hopefully I can move it from one place to another (I think I read somewhere that you can). If that works I will update this to a 5 star (even though I still think the cable should have been included).UPDATE 04/15/14:I have been using this for about about 2 weeks now and I'm very impressed. It's way better than the Wii was for streaming Netflix and the games. I'm able to fling movies and books (yes books) and games and even internet from my kindle HDX to my TV. And yes I can move the box to different TVs in different rooms. But I still think the HDMI cable should have come with it.", "verified": true, "helpfulness": "4/27", "author": "Linda Hall \"A truck driver\""}, {"rating": 1.0, "review": "During Amazons CEO's presentation yesterday it was shown (Screen shot) that MLB.TV was available for the Fire TV (In fact if you Google Fire TV MLB TV you will see that every website says that it is available) In fact It is NOT available for the Fire TV. After contacting Amazon Customer Service I was told that it was \"Not Available\"Really disappointing and is going back in the box and to UPS. I wonder how many other channels/apps are also not available...", "verified": true, "helpfulness": "38/132", "author": "Rob"}, {"rating": 5.0, "review": "fast, reliable and I like that it is synced to my amazon account. so far better then my apple tv, though I do miss the mirroring option", "verified": true, "helpfulness": "5/7", "author": "frankyc."}, {"rating": 1.0, "review": "First, it forces you to watch a demo. While trying to exit the demo, my network settings were erased and I had to set it up again then  watch the video again. Roku is much easier and allot more stable, I may box this back up and return the Roku.", "verified": true, "helpfulness": "45/130", "author": "Holly Blanc Moses"}, {"rating": 4.0, "review": "This is missing a CRITICAL app, and that is HBO Go.  Without HBO Go I can't purchase this, Roku 3 it is until then.", "verified": false, "helpfulness": "6/36", "author": "Nickolus Holmgard"}, {"rating": 5.0, "review": "UE- ok, not amazing, but OK.Microphone: It really works! I love being able speak my search on Amazon Prime moviesThis bad boy streams really fast. The moment you pick play, hardly any buffering- just an almost immediate start. The PQ is gorgeous. It supports 7.1 sound- you have to manually set it via HDMI/sound- but it does support it.  Overall, I love the device. I'm probably going to rent/watch more movies on this device over my Apple Tv.BTW- the thing comes per-configured to your own account. so it's ready go, no need for log in- nothing. That in itself was a nice little add.", "verified": true, "helpfulness": "46/55", "author": "Sachin"}]