[{"rating": 5.0, "review": "I have to say I was a bit skeptical.So far it has worked fine.when I have watched it.It was easy to set up.I do not get much for TV reception where I live.So being able to watch Fire TV has been great.", "verified": true, "helpfulness": "0/0", "author": "kozykat53"}, {"rating": 4.0, "review": "Just got it. So far, it seems like a great device to have. Especially if you are a Prime member. The only negative, unless, I am missing something, is that a lot of the tv shows I try to watch, there's a fee. It doesn't say that the content is at a cost in the ads. Setup is simple and easy and the hardware seems to be of high quality. The technology and functionality is top notch.", "verified": true, "helpfulness": "2/2", "author": "Jeff L."}, {"rating": 1.0, "review": "Very disappointing. We got rid of our cable to go this way because all the reviews were great. What most reviews failed to mention and so did the description is that you have to pay for everything. So all those tv series I wanted to watch that we are missing is a minimum of 30.00 dollars. I guess I should of kept my cable because once we are done buying all the shows we want it will be more then my cable bill a month!!! So why am I paying 99.00 a year for this when it will cost me more in the long run. What a waste of money:(", "verified": true, "helpfulness": "4/16", "author": "Connie"}, {"rating": 5.0, "review": "I have a Playstation, xbox, Apple TV and Roku. I cut the cord and no longer have cable, but have Netflix and an Amazon Prime subscription.Amazon TV is like the rest in that it is small and easy to set up. I like that it was automatically set up with my Prime account and I was using it in minutes. It's fast and easy to navigate. Picture and sound quality are great. All in all it stacks up great with the other set top boxes.As for the voice search; it's ok. I wish it searched all my apps and not just Amazon - but that's ok. I'm a happier browsing anyway.For me this little treasure wins because of the games. I no longer want to spend to $60 on a game I can only play a few hours a week. I don't want to learn complex in game systems that I forget because because I couldn't get back to game. Recently I found myself playing on my Ipad more that the console or PC.Enter Fire TV. The games I play on my Ipad are now available from amazon for Android. I have a controller which makes it really easy to jump in play. If I have spare 15 minutes I can hop on and play an arcade game, or with more time, indulge in an episode of walking dead.If your like me, making the transition from regular console gamer to casual then I think you'll love this. I still love to play games - I just don't want to invest all the time and money anymore.For the first time in a long time I have purchased a device that really has impacted how I enjoy media. I am selling the apple TV and moved the Roku upstairs. Enjoy.", "verified": true, "helpfulness": "6/6", "author": "S. Farrell"}, {"rating": 3.0, "review": "Connected easily, but sound will not come out of surround sound system.  I have a cable box and a Bose surround sound system.  Can anyone help??", "verified": true, "helpfulness": "1/1", "author": "Mitchell S. Strutin"}, {"rating": 3.0, "review": "It's okay. Not worth it for me to spend $100 to only watch Netflix and listen to iHeartRadio. I can get my Netflix on another device I already have. Also, Amazon Fire TV never turns off. It's always idle. It just goes into sleep mode. This wasn't my cup of tea and I'm just not impressed by it. I'm returning the item. Too bad I have to pay for the return shipping too -- a $7 loss for me and a waste of my time.", "verified": true, "helpfulness": "1/3", "author": "Ann \"amlgarrido\""}, {"rating": 4.0, "review": "The new Amazon Fire TV is a great addition to my home. I read many of the reviews before buying it and I have to agree that there is a problem or two. First, There are many \"free\" apps. But that is just for the application to run the channel. I have a feeling that you then have to pay for the service similar to Netflix or Hulu Plus. I'm not sure as there is no indication when you open some the channels. When I first opened Netflix, for example, the screen asked me if I wanted a free trial or if I wanted to sign in. But, the Smithsonian channel only has 3-4 minute video clips. I didn't see any way to sign up for it. I realize that this is more a problem with the channel than the streamer. The other problem I had was with the voice search. I was using Flixster at the time. I know that I have the movie RED as one of my collection so it would be free to watch it. But, when I used the voice search, it took me to a screen that had the movie I was looking for but it was no longer within Flixster. If I had clicked on it, I would have paid for it.I do recommend this product...just be careful until you figure it all out.", "verified": true, "helpfulness": "1/2", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Have had my Fire TV for a week. Setup was easy peesy, BUT, and this is a BIG BUT.... There is no category for Prime FREE streaming vs pay for shows/movies.Gave it 5 stars for hookup, streaming (Netflix, Prime FREE, etc.), video quality, ease of remote control use, and voice command. Not happy that SHO is not avail in my area, and irritated about non-separation of Prime vs pay to watch. I don't appreciate having a fee imposed upon me, after becoming eager to watch a movie only to find I have to pay for it.I appreciate the capitalism, IF I was in Amazon's position, but we as users aren't in Amazon's shoes.Otherwise, bravo for creating an inventive device so compact, that does so much, and how it has allowed this disabled  individual to cancel cable movie channels which have junk on them that we have seen ad infinitum, thereby reducing my monthly expenses which I so badly needed... Hats off!", "verified": true, "helpfulness": "4/5", "author": "Tammy \"Tammy\""}, {"rating": 5.0, "review": "I have enjoyed my Amazon Fire the short time I've had it.  I'm still learning to operate its' many functions.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Willie McGee"}, {"rating": 5.0, "review": "I think the 4,000+ reviews pretty well sums it up as a great little devise although the competition's family and friends and others apparently feel it is worth buying one so they can bash it.  It is pretty hard to bash something while not having a single issue to get a replacement on. hmmm.  However I have one issue with it, I have searched the entire review database for Kindle, it is mentioned hundreds of times but I have yet to see anyone ask \"why don't the Fire TV include Kindle Fire capability for direct display on \"my\" segment of society that would delight in having it on the big screen?  Small tablets are a visual pain and tethering them to a monitor is restrictive as is tethering the Kindle to the Fire TV.  So since both are kin to Prime and both are set up for both free and billing, why does the Fire TV not include a choice to enter one's Kindle account.  Rather illogical to have the prospect of millions of Fire TV and failing to make all the Kindle content available.Otherwise, I find the Fire TV a most delightful way to get around a 60\" LG and two 32\" Samsung's that they refuse to upgrade the firmware to support Amazon, yet they have upgraded for other streamers.  Another unexpected benefit is that it is far easier to switch between HDMI inputs on any TV than to use the smart TVs slow total transformation to enter into a streaming providers mode and abort the entire process to check something back on other sources. This proves a point that having at least 4 HDMI inputs on TVs makes them a lot more user friendly than internal \"smart's\".  It earned 5 stars for what it's performance as it is designed, not for what it COULD do with a firmware update..", "verified": true, "helpfulness": "3/3", "author": "Sr Citizen"}]