[{"rating": 5.0, "review": "Easy to use  ,fast and smooth  navigation  over applications better than mX2 box", "verified": false, "helpfulness": "0/0", "author": "jovel a. maldonado"}, {"rating": 3.0, "review": "Internet connection degraded experience.", "verified": true, "helpfulness": "0/0", "author": "Joel D. Reyna"}, {"rating": 5.0, "review": "Fast", "verified": true, "helpfulness": "0/0", "author": "Hock Wee"}, {"rating": 5.0, "review": "The kids love it", "verified": true, "helpfulness": "0/0", "author": "kenneth j stuart"}, {"rating": 5.0, "review": "My elderly dad can run it.  Except he has a hard time seeing which shows are Prime video and which ones cost money. Other than that I don't have to do any tech support for it. Score!", "verified": true, "helpfulness": "0/0", "author": "John Fields \"SirSpammenot\""}, {"rating": 2.0, "review": "Waste money, if you have a smart tv you don't need this.", "verified": true, "helpfulness": "0/1", "author": "Michele"}, {"rating": 5.0, "review": "Love this Fire T. V.", "verified": true, "helpfulness": "0/0", "author": "Kish"}, {"rating": 5.0, "review": "I love it! I just sold my AppleTV to a friend. This is by far, better than AppleTV, or Roku. The gaming is pretty good, with graphics similar to my old Xbox 360. Of course, your choices are limited to the App Store. The voice search feature is nice and very accurate. WiFi connectivity is flawless, and a welcomed feature. The remote is fantastic! It sounds weird to praise a remote, but this one feels solid and responsive. The only thing that I was disappointed with was the lack of any Google services such as Play Movies. I get why Amazon promotes its own content ecosystem, but this being Android powered I thought my Google content would just be a download away. Other than that minor detail, I am very pleased and surprised by Amazon's FireTV. It's truly best in class.", "verified": true, "helpfulness": "0/0", "author": "Mr. Fiebs"}, {"rating": 5.0, "review": "LOVE IT, have recommended it to absolutely everyone. So so so glad I got it. So much faster and easier than game console or computer viewing. I thought the voice search was kind of silly and unnecessary but I'm completely obsessed with it sooooooo...touche, amazon, touche.", "verified": true, "helpfulness": "0/0", "author": "Lee11307"}, {"rating": 3.0, "review": "Great device. Better than my Roku. I'd like it better if the remote didn't run through batteries like crazy -- just got mine at the beginning of the month and have already had to switch batteries TWICE. (The Amazon ones were especially crappy -- those only lasted 4 days).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]