[{"rating": 5.0, "review": "Love it. Perfect for me. Don't watch sports, catch up on the news, weather on my phone.", "verified": true, "helpfulness": "0/0", "author": "rlt"}, {"rating": 5.0, "review": "By far the best streaming media device out there right now. This device has Roku and Apple re-thinking what features need to go into the next version of their devices.If you have Amazon prime, what are you waiting for?", "verified": true, "helpfulness": "0/0", "author": "Master_Reviewer \"master_reviewer\""}, {"rating": 5.0, "review": "Awesome so far. Very fast, no buffering hangups. The home menu isn't the easiest to navigate but it's fine.", "verified": true, "helpfulness": "0/0", "author": "WY Sawyer"}, {"rating": 5.0, "review": "Best gadget ever. Could not be happier with this purchase. It's the easiest thing in the world to use.", "verified": true, "helpfulness": "0/0", "author": "gracefulfeline"}, {"rating": 4.0, "review": "great tool to be enertained.", "verified": true, "helpfulness": "0/0", "author": "Mark Marinko"}, {"rating": 5.0, "review": "Does better than advertised.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love Amazon Fire TV. We wish it would've come out before we bought the Roku. We love that you can just talk to it to find what you want. It's very user friendly. We bought the matching TV mount to just mount it to the back of our TV which has worked perfectly. It's truly a great little device and we are very happy with it.", "verified": true, "helpfulness": "0/0", "author": "J. Burgart \"Julie B.\""}, {"rating": 5.0, "review": "Works great.  I would like to see more free programming on youtube", "verified": true, "helpfulness": "0/0", "author": "James C. Pinto"}, {"rating": 5.0, "review": "Nicest little hipower box you can get for customizing Android. Can't build one with these features this cheap. You need to look over the inputs and such, the processing power and the memory. Do not let me tell you, see for yourself and do a little reading. The box is also hackable - by YOU - easily and then you can return it to factory default if it gets screwed up by simply going to the menu and telling it to reset - wipes out all your mods and returns to the way it was delivered. Nice. Now that Amazon has added the ability to do other things like out of the box storage options [external usb hard drive for more space or usb flash card in a software update, it is obvious they are committed to improving it and not simply letting it die on your shelf the way it was the day you bought it. I bought this one for a friend, they loved my setup.", "verified": true, "helpfulness": "0/0", "author": "Clark"}, {"rating": 3.0, "review": "Pretty cool device", "verified": true, "helpfulness": "0/0", "author": "justin"}]