[{"rating": 5.0, "review": "The best  addition  to my home theater I hace ever purchased.  Fast! Rumble,  unbelievably easy to use.  I just can't not say enough good things about this unit.", "verified": true, "helpfulness": "0/0", "author": "mojave45"}, {"rating": 3.0, "review": "great for amazon prime movies which it had prime music the music on it bites.", "verified": true, "helpfulness": "0/0", "author": "Arianne T Smart"}, {"rating": 3.0, "review": "In general the Amazon Fire TV is a great alternative to ChromeCast or some of the other internet set top boxes on the market though there were two bugs that are rather annoying. Set up was generally easy till I got to the point of entering the WiFi password. For some reason if you don't enter the password in within about 60 seconds the box reverts back to the previous screen. Normally this wouldn't be a problem on a machine with a keyboard but trying to enter an alpha numeric password with upper, lower, and symbols takes more than 60 seconds. This took several attempts before I figured out a faster way to get the password entered.I opted for the gaming package and found some pretty good games I play on my Microsoft Surface are also available on the Fire. The second big problem I found was for some reason the box gets confused when you loop through the menus. I have not been able to successfully recreate the scenario but once this happens it says it has no more network access even though it sees the WiFi network. The bad thing is I don't want to tell the box to forget the network it's connected to (see comments above) because setting the WiFi password is painful. So the solution was to turn the power off of the box for about a minute and then plug it back in (Microsoft approach). I don't know why you can't reboot the box from menu options.All in all it's WAY better then trying to run Amazon across ChromeCast. My wife and I have found the picture quality to be better as well. Hopefully Amazon will issue a patch to resolve some of the issues I've mentioned.", "verified": true, "helpfulness": "0/0", "author": "Duane A."}, {"rating": 5.0, "review": "worked great and delivered as promised. Easy to use and provides great value", "verified": true, "helpfulness": "0/0", "author": "phil mendys"}, {"rating": 5.0, "review": "I love the Amazon fire tv. It's the best product I have got for my tv.", "verified": true, "helpfulness": "0/0", "author": "aaron Patton"}, {"rating": 4.0, "review": "works really well", "verified": true, "helpfulness": "0/0", "author": "J1"}, {"rating": 4.0, "review": "Have not had a chance to use it a lot--but it has been fun so far.  Can't wait to join some of the groups for various programming and movies.", "verified": true, "helpfulness": "0/0", "author": "Doris Hale"}, {"rating": 5.0, "review": "I've had Apple TV for 3 years now.  This is better in every department...searching (voice search is awesome), interface, responsiveness, etc.  What a great product...bottom line, get one it's totally worth it!", "verified": true, "helpfulness": "0/0", "author": "Chaddles"}, {"rating": 5.0, "review": "Love this little gadget! I can watch Netflix or Amazon Instant Videos with my Prime Subscription. And it allows me to add additional apps unlike Apple TV. I now have two.", "verified": true, "helpfulness": "0/0", "author": "Diane Ellis"}, {"rating": 5.0, "review": "At the time I originally wrote this review, Prime content was near impossible to find - all of that has changed. Prime content is beautifully organized now, and there's A LOT of it! I haven't turned on my Apple TV since, in part because of the great Prime content, but also because Amazon beat Apple on every other front. Any who's had to hunt and peck letters to type in a search will know what I mean. To the team working on Fire TV, THANK YOU for taking a huge bite out of Apple!Pros-Set up was easy-Loved the voice control remote and the overall user experience-Access to Hulu and Netflix-Love the integration of gaming capabilitiesCons-Prime content supposedly mixed in, but I didn't find any at all. Everything I clicked on to watch was paid content. This is a deal-breaker in my opinion. Since my Apple TV was already set up, I switched back. It was far too frustrating trying to find something to watch on this little box.-If you have Apple TV, Xbox, PS3 or 4, or similar, don't be tempted by Fire TV unless you're looking to pay for the same content everyone else has. There is zero differentiation until Amazon separates out Prime content", "verified": true, "helpfulness": "0/0", "author": "John White"}]