[{"rating": 3.0, "review": "I have only used it for two movies so far.  I would have liked more instructions when I first used it.  It took me a while to find where to access closed captions.  The TV show I wanted to watch seemed expensive but it is a top-rated show and I assume you pay more to have it on Amazon Fire.  I think I would give it another star after I have used it a bit more.", "verified": true, "helpfulness": "0/0", "author": "usa girl \"library girl\""}, {"rating": 4.0, "review": "AMAZON FIRE TV IS A GOOD PRODUCT.  WE ARE HAVING SOME TROUBLE WITH NETFIX , WHICH WAS WORKING GOOD.  I FEEL THEY SHOULD MAKE A SECTION JUST FOR FREE OFFERINGS, SO THAT EVERYONE HAS AN EASIER TIME SELECTING WHAT TO WATCH, IF YOU DON'T WISH TO PURCHASE ON ANY GIVEN DAY. HARD TO FIND FREE OFFERINGS ON THE TV.  IT IS EASIER ON LINE.", "verified": true, "helpfulness": "0/0", "author": "Lin"}, {"rating": 4.0, "review": "This is working as expected....I am able to watch amazon instant videos, Netflix, youtube, Vevo Videos,and others with much less trouble than connecting my laptop to the tv.The voice search works amazingly well.I like this product very much.", "verified": true, "helpfulness": "0/0", "author": "David Veronese"}, {"rating": 5.0, "review": "It really works!  I love that you just say it and it shows up.  It's fast and anyone can use it.  The coolest thing I ever seen.", "verified": true, "helpfulness": "0/0", "author": "Effrens"}, {"rating": 3.0, "review": "Truth be told, I really like the capabilities of this little black box. However, This product suffers from a lack of good ventilation. My son set the little product info pamphlet on top of the box for less than ten minutes while it was streaming and when we realized this and picked it up off the box we noticed that it had acted like a little blanket and it had become very warm. FYI Keep this in a very well ventilated area or it will rapidly overheat! A few well positioned ventilation slits might be a useful modification.", "verified": true, "helpfulness": "0/0", "author": "John Parker"}, {"rating": 5.0, "review": "make sure to add Amazon Prime to Fire TV.  Best value ever!", "verified": true, "helpfulness": "0/0", "author": "J. montagna"}, {"rating": 4.0, "review": "Needs hbo go!", "verified": false, "helpfulness": "0/1", "author": "Xena"}, {"rating": 5.0, "review": "Great reception.  No skipping or pausing.  Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Sandy Erickson"}, {"rating": 4.0, "review": "Simple to use and nice to hold. I like the idea of speaking to it, fast to use and very responsive. Could be better if applied to all apps as well, like netflix and youtube. I also wonder why it does not give you more suggestions of things to watch like netflix does. I don't like the option to buy all the time, you might want to have a \"All Free Section\" people can search and watch. Seems its always tying to get you to buy something..!But I like the speed of it, the style of it, and its well worth the price of it..!", "verified": true, "helpfulness": "0/0", "author": "david theis"}, {"rating": 5.0, "review": "I am very happy with the speed and convenience of Amazon Fire TV. It was easy to set up, and we haven't had any problems so far (about a month in). The only downside so far has been that some of the services are still not available in general, or with my specific provider (DirecTV), mainly the on-demand premium channels. I can get them via my computer, but not Fire TV, but I hear they are working on it, so I'm hopeful they will be available soon. I haven't explored any of the games, but show-wise, it is fast and responsive, and the voice search command is accurate. As TV viewing migrates to this type of setup, it will become even more powerful, and the Amazon Fire is a very nice option.", "verified": true, "helpfulness": "0/0", "author": "DMaxedon"}]