[{"rating": 5.0, "review": "Outstanding. Great features and selection. May get rid of Cable.", "verified": true, "helpfulness": "0/0", "author": "Jon Scott Wilson"}, {"rating": 4.0, "review": "Overall I’m happy with this however I dont like that the memory fills up and prevents you from using it until you delete your memory. Also dont like that there isn’t a shut off button. But its fast, easy to set up and use, love the voice search option, love the free movies/shows I can watch being a prime member. Support for this is amazing too!!", "verified": true, "helpfulness": "1/1", "author": "Jen"}, {"rating": 4.0, "review": "Love my Fire TV. When we first set it up it would not connect to Netflix, which we watch a lot and was the main reason for the purchase. Tech support for Netflix and Amazon were called and no one could help. We shut everything off and when we turned it on the next day it worked perfectly and has done so ever since.", "verified": true, "helpfulness": "0/0", "author": "Annette Aurelio"}, {"rating": 5.0, "review": "I have been streaming movies for years. i started on x-box, then roku 1, roku 2 , roku 3. I am a huge purchaser of movies on amazon instant. I use this more than any other feature. because of that fact, the fire tv is the best option. the default application you are in when the device boots is amazon instant. The \"learning feature\" of the box is great especially with seasons of shows you are watching. It will instantly start a video and there is little to no \"low quality\" time while the show buffers. I also think that the black level artifacting is less with this device than the roku 3. as for the \"prime\" movies not being easily found like they are on the roku, i personally like the fact that i can easily find my purchased content faster on this box. you can see easily without clicking on a icon that there is a prime sticker on the top left that will tell you that it is free for viewing.Voice features work great too. easy to search amazon instant for a movie.If you were going to use this box for netflix only, you surely could, but i think that the roku may be an easier box for just that.Bottom line, if you use amazon instant alot on the roku, this is the next box you want to buy.", "verified": true, "helpfulness": "0/0", "author": "Christopher M."}, {"rating": 1.0, "review": "It's useless if you are not living in the United States, so watch out.", "verified": true, "helpfulness": "1/8", "author": "A. Alonso"}, {"rating": 1.0, "review": "Description is deceiving. Omits telling you that the movies are not recent and you have to subscribe to Amazon prime or you have to pay a fee.  TV shows offered are the ones I am trying to avoid. There too , fees are charged for the  ones I would like to watch.  The good wholesome shows with moral content are gone. I don' need apps on TV. I have them on my phone. I was very disappointed. I am returning it.", "verified": true, "helpfulness": "1/8", "author": "LaFeather"}, {"rating": 5.0, "review": "It works. No waiting for the download signal.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It is pretty good but gets stuck and freezes from time to time. Customer Service gives a temp fix till they figure true cause.", "verified": true, "helpfulness": "1/1", "author": "Julio M"}, {"rating": 5.0, "review": "So far the best device .. super fast and simple... paired with XMBC this device is unstoppable... highly recommend it for techies!!!", "verified": true, "helpfulness": "0/0", "author": "Tung Le"}, {"rating": 4.0, "review": "Fire TV has provided a large selection of things to watch. We don't watch cable TV very often since we have it.On thing that is annoying is the interruptions for downloading.", "verified": true, "helpfulness": "0/0", "author": "BB"}]