[{"rating": 4.0, "review": "I love it. it gives me a chance to pick what I want and watch shoes and movies at my time with no comertial.  I just wish it offered more selections than it does. they do need to increase the programing.", "verified": true, "helpfulness": "0/0", "author": "Naz Phiroz \"good movie obsession\""}, {"rating": 3.0, "review": "This is a question rather than a review. Do not see a place to ask a question. If you have a Smart TV and don't care about gaming or PRIME movies Why would you want Fire TV? Must give a star rating even though I am only asking a question so I will make it a neutral 3.", "verified": false, "helpfulness": "0/0", "author": "DuMonde"}, {"rating": 5.0, "review": "Love it! This was the easiest thing I have ever connected to a TV, no instructions needed.", "verified": true, "helpfulness": "0/0", "author": "BDow"}, {"rating": 5.0, "review": ":)", "verified": true, "helpfulness": "0/0", "author": "cosmin"}, {"rating": 5.0, "review": "Amazing device.  We use this daily and it is great. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Books & Games\""}, {"rating": 5.0, "review": "Much better than Roku!", "verified": true, "helpfulness": "0/0", "author": "stephen allen"}, {"rating": 3.0, "review": "You need amazon prime to see the free movies. No free movies without it. Other than that, It is good.", "verified": true, "helpfulness": "0/3", "author": "george"}, {"rating": 5.0, "review": "Easy to set up, and works great. Very happy with the fire Tv .", "verified": false, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "Awesome alternative to other services! Dependable and diverse choices!", "verified": true, "helpfulness": "0/0", "author": "Darryl Merchant"}, {"rating": 5.0, "review": "Fire TV is great, I can watch Netflix on it.  I purchased because they were supposed to open streaming in Germany as of 25 Sept, and as of today 1 Oct, I still cannot stream anything.  I am in the military stationed here and was so looking forward to this.  When will I be able to watch anything from Amazon??  Or is there something I need to do?", "verified": true, "helpfulness": "0/1", "author": "Jim"}]