[{"rating": 3.0, "review": "Very intuitive interface as compared to others but voice search only works for Amazon. Still a ways to go before it can be one stop solution.", "verified": true, "helpfulness": "0/1", "author": "carguy123"}, {"rating": 4.0, "review": "Pros:- Fast.- Voice search is awesome- Better & easier access to Amazon content- Simple & intuitive remoteCon's:- Search is lacking. When I search for a movie or show, the Fire TV only shows me what's available from Amazon. The Roku would show me what's available from several different providers. I really miss that feature and I'm considering going back to the Roku because of it.- Paid content and Prime content aren't always marked well. I want to see if it's paid content before I ever click to read more about it. Finding out a movie I want to see costs money doesn't prompt me to buy it, it only disappoints and annoys me that I have to search elsewhere or wait longer.Overall, unless you're dedicated to only Amazon content you'll likely be happier with the Roku.", "verified": true, "helpfulness": "1/1", "author": "M. Dale"}, {"rating": 5.0, "review": "Love It", "verified": true, "helpfulness": "0/1", "author": "Michelle Spaar"}, {"rating": 4.0, "review": "Work great easy to hock up", "verified": true, "helpfulness": "0/1", "author": "Robert Bowman"}, {"rating": 4.0, "review": "Overall this is an extremely user-friendly tool for watching videos provided by Amazon. As a Prime customer, there is lots to watch for free. I love the ability to add apps to access additional channels but am disappointed that my cable provider does not support them all and that there are not more channels available. I love the voice search but am disappointed that it does not work for all apps that can be used on this device. I especially enjoy the ability to watch Youtube using this device.", "verified": true, "helpfulness": "0/0", "author": "Lou"}, {"rating": 4.0, "review": "I like this, ease of use and convenience compared to my netflex mailing me disks.  The only BIG thing I do not like is if you select a mini series or TV program with many episodes, they automatically keep playing each episode.  I fell asleep one night watching an episode and woke up 6 hours later and it had played several episodes I did not watch and the worst part is it cost me a lot of data usage from my internet provider.  The only thing I do not like is the cost by my internet provider for data streamlining video and I did not realize it would cost so much.  I don't think I'm really getting that good of a deal because of the data usage charges for internet to view anything I select.", "verified": true, "helpfulness": "0/0", "author": "plsltr"}, {"rating": 1.0, "review": "I HAVE BEEN A PRIME MEMBER FOR YEARS, BUT WHEN I RECEIVED MY AMAZON FIRE TV I COULD NOT GET ANY OF THE PRIME MOVIES,SONGS,....WHEN I WENT TO THE HOME SCREEN , PRIME WAS NOT EVEN LISTED AS AN OPTION. WHY NOT? THIS ISSUE NEED TO BE CORRECTED NOW!!! THANKS MR ELLERBEE.", "verified": true, "helpfulness": "1/3", "author": "Clarence Ellerbee"}, {"rating": 1.0, "review": "I really wanted this thing to work but we live outside the city limits and the fastest DSL we can get is 1.5 which was PAINFULLY too slow.  The programs we watched would play for a minute or so and then buffer for two to three minutes.", "verified": true, "helpfulness": "1/3", "author": "Dog Lover"}, {"rating": 5.0, "review": "easy to install,efficient minimalist packaging, better than expected", "verified": true, "helpfulness": "0/0", "author": "kbizan"}, {"rating": 1.0, "review": "Just bought this for my Dad for Christmas after reading some great reviews on it. We hooked it up fairly easily and started downloading all of the apps. However, when we got to the Netflix app and tried to download it a \"Processing Error\" occurred and that \"the netflix app has already been purchased. If the download hasn't  begun already it will shortly\" or something to that effect.  So we called the Help line and spoke with  \"Joanna Marie\" across the world who had no idea what I was saying and eventually spoke with a supervisor who advised it would be resolved within a few days.  I advised the both of them that I had came across reviews about the same issue I was having and many people have been complaining since October 2014 regarding the inability for Netflix to download. So, for any of you who are interested in watching Netflix, please know this is an issue which has been going on for quite some time.  I'm hoping that this is something that will be fixed shortly otherwise I spent my money for no reason and will perhaps need to return this item. Not very happy at all with Amazon or Netflix.", "verified": true, "helpfulness": "2/3", "author": "Michelle P."}]