[{"rating": 5.0, "review": "Amazon Fire is great.", "verified": true, "helpfulness": "0/1", "author": "Nancy G"}, {"rating": 5.0, "review": "Love it! Fast and easy to use!", "verified": true, "helpfulness": "1/1", "author": "Kerry Cole \"klc\""}, {"rating": 5.0, "review": "Works great!  Easy to set up and operate!", "verified": true, "helpfulness": "0/0", "author": "COL Rich Whitaker"}, {"rating": 4.0, "review": "works very well hope it has pirme music soon", "verified": true, "helpfulness": "0/0", "author": "Robert L. Tate"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "David valencia"}, {"rating": 5.0, "review": "I took a chance on the Amazon Fire TV, being bitterly disappointed with other Roku type devices with lag and slowness.  This device IS the real deal - from the un-boxing to the first month of use this device just all around a great product.Let me be clear though.  This product is only a STAR when you have Amazon Prime. It has other uses, but playing music, with a lyric look-up on your TV, to streaming high quality video directly to your TV is where it is at it's best.  It also will stream Redbox and other items, but really - the star is how it showcase sand lets you get the most out of your Amazon Prime.When I was opening the package, I was surprised at the sleek profile and how small the device was for the power inside it.  The device is fast and responsive.  Sometimes, a little slower only when looking up my vast collection of albums on Amazon, and loading pictures.  However, I don't have super-fast broadband, so this might be part of the problem.Overall - for use with Redbox and Amazon Prime, this is wonderful.  You can also buy streaming video directly from it.  A great device all around.", "verified": true, "helpfulness": "0/0", "author": "Brian T. Krebs"}, {"rating": 5.0, "review": "i am happy I bought the kindle fire. it is very easy to use. i set it up with no problem. i can search for movies and tv shows fast.  i can use my netflicks with it also with no problems. ii would recommend.", "verified": true, "helpfulness": "0/0", "author": "Londa L \"love my kindle\""}, {"rating": 5.0, "review": "Works great for my Amazon content.", "verified": true, "helpfulness": "0/0", "author": "jforb"}, {"rating": 5.0, "review": "I absolutely love it...", "verified": true, "helpfulness": "0/0", "author": "David Green"}, {"rating": 2.0, "review": "Originally, I purchased Fire TV for my grandparents, who aren't that tech savvy, and are still learning how to use a computer, tablet, smartphone, etc.The voice activated search feature is what initially sold me on the unit, but after working with it for a few minutes, I quickly realized this feature is for Amazon media only, and not for other FireTV apps.The Roku, on the other hand is fluid, easy to operate, and should have been studied by Amazon's R&D; team to help create an enjoyable, user friendly experience....I'm sure most would agree Amazon FireTV is second to none in the hardware department and world of streaming media players. It has enough fire power to send a rocket to the moon, with its mega processing cpu, colossal memory, and not to mention an extremely accurate, voice-activated, remote.None of this mattered, though, once I got the unit running.Here are my Top Ten Reasons NOT to buy Fire TV - YET - until an update from Amazon arrives, to resolve these issues, immediately.1) You can't skip the long winded tutorial in the beginning, in case you don't know how to turn on a computer or TV from the past 20 years.2) Every time you press the back button, it takes you to the Wi-Fi password set up screen. No problem, right?Wrong. You are actually REQUIRED to INPUT your WIFI password EVERY TIME you (mistakenly) land there.3) Amazon doesn't believe in creating their own YouTube app, and one that works, at that (see #4).4) Bye bye voice activated feature, to search for your favorite shows and videos on YouTube (see #3).5) Amazon shows your private cloud storage photos, videos, and other paraphernalia to all who are watching and get this, as a MENU option, right on TV (see #6).6) There's no easy way to switch between different Amazon accounts.7) There's no way to hide your private cloud storage stuff, in plain view of everyone. Surprise!! You're on TV!! *sigh*8) The user interface is clunky, cluttered, and non-fluid -- unlike the Roku.9) The voice activated feature doesn't search within other apps, as advertised. (update to be announced...??)10) You have to wait for an intelligent, user-friendly update, graciously to be supplied by Amazon, at some indefinite point in time in the future, to make all of these - and other - issues resolved, hopefully soon.", "verified": true, "helpfulness": "1/10", "author": "Maxamillion \"Entrepreneur in training\""}]