[{"rating": 4.0, "review": "I was a little disappointed.  One of the big reasons we chose to purchase the Fire was because it was advertised to allow for \"third party\" apps.  However, that is not totally true. You can use THEIR chosen third party apps, but you cannot download your own such as ABC, TNT, TBS, or CBS.", "verified": true, "helpfulness": "3/3", "author": "Anya Armstrong"}, {"rating": 5.0, "review": "Just received our unit yesterday.  So far has been awesome.  Extremely easy set up. Very easy to navigate the interface. Voice control works great.  The product works just as described.  I have read a lot of reviews complaining about \"amazon force feeding you amazon\"........This  is NOT the case.  If you are a prime member, the prime free selections are very easy to locate and to differentiate from the items offered at a cost.  Sure there are always things we would tweak about this or that in regards to any item, but this is a very solid and responsive device with a lot to offer.  We are very pleased with the fire as a family. Can see this taking the place of our cable in the near future.  Would definately recommend.", "verified": true, "helpfulness": "3/3", "author": "Brett Gardner"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far I have enjoyed the option of watching some tv programs that I would not have had a chance to have watched. I just wish there were more resent movies to enjoy free. The remote is so easy to use.", "verified": true, "helpfulness": "1/1", "author": "Lynn Harrison"}, {"rating": 5.0, "review": "A fantastic alternative to Chrome stick and Roku (stick and set top).As a prime member, there really is no reason not to purchase the FireTV.We were originally using our PS3 as a media center for our living room, but I was tired of feeling like I was playing a video game every time I wanted to watch TV.My first concerns with the FireTV were the fact that the USB port does not (yet) accept thumb drives or any type of external hard drive.  How was I going to play my music?  Well,  with the integration of Prime Music included in our Prime membership,  I was able to quickly upload all my music, and access it all from the FireTV.I still have one standing complaint.  I realize that I am a Prime member and I have (reluctantly) bought digital movies from Amazon.  I abhor the DRM (digital rights management) that is inherent in digitally distributed media.  My feelings on this are that if I have paid for this product, I should be able to do with it what I want. I have many DVDs that I have ripped onto my laptop so that I can watch them on anything I want.....my tablet.....my TV.... the laptop....a phone even....doesn't matter.  There is presently no way for me to store my movies locally on the FireTV, or to stream them without a 3rd party app.Other than that....FireTV is awesome!", "verified": true, "helpfulness": "2/2", "author": "Nathan Thurston"}, {"rating": 5.0, "review": "Great Christmas gift.Have really been enjoying it since it is too cold to go outside!!!.", "verified": true, "helpfulness": "0/1", "author": "Karen"}, {"rating": 5.0, "review": "I love this, works great.  I'm enjoying watching series all at once.  Very happy.  I also got the mounting device, that doesn't seem to want to stick to the tv though.", "verified": true, "helpfulness": "0/0", "author": "Kathleen B"}, {"rating": 5.0, "review": "Being very disatisfied with cable tv, and being Amazon Prime members, we thought we'd start investigating alternatives. This has worked perfectly and so far been a great experience. It came, I hooked it up, it was already tied to our Prime account. It found our wi-fi network immediately (located one floor down in our basement), and we were watching videos in ten minutes. On cable, we do not subscribe to HD. But the HD from this Fire TV box is incredible. The numbef of free titles is a lot but some titles are really good, some just OK. But still worth it. And the selection of pay titles is great. Absolutel no problems with the \"signal\", better than the cable. I think next we'll subscribe to HULU Plus. In a year or so, I can see us cutting the cable for TV and just keeping it for internet.", "verified": true, "helpfulness": "1/1", "author": "Joe"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "folks love it", "verified": true, "helpfulness": "0/0", "author": "Troy peterson"}]