[{"rating": 5.0, "review": "all went well, after i replaced the batteries in the remote.", "verified": true, "helpfulness": "0/1", "author": "jim huskins"}, {"rating": 5.0, "review": "I could not resist the 30 day free trial, so I ordered it. I hooked it up immediately and checked out the speech recognition, since this is where I had my doubts. IT WORKS GREAT. You tell it what you want, it finds it quickly, and shows the various places and formats that are available. It is a great tool to help navigate the sea of offerings from Amazon, NETFLIX, Hulu, etc.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Perfect and FAST ! love it.", "verified": true, "helpfulness": "0/1", "author": "Jefferey"}, {"rating": 5.0, "review": "This is an outstanding solution for TV content and I believe an essential start to getting away from the confines of cable TV.  The picture is the clearest I have ever seem and is far clearer than anything short of Blu-Ray disk and the sound i o crisp and clean it is like being in a movie theater.  My grandchildren are looking forward to the games!", "verified": true, "helpfulness": "0/0", "author": "Ron Reidy"}, {"rating": 2.0, "review": "It's horrible. It's constantly freezing and resetting itself.  The screen will freeze and the audio will keep going. And it rarely picks up the wifi,when everything else,inside and outside, does.I wouldn't waste your money unless you have it to waste!", "verified": true, "helpfulness": "0/0", "author": "Karen Fuller"}, {"rating": 5.0, "review": "BEST STEAMING DEVICE ON THE MARKET ... ONLY THING I WOULD LIKE IS TO HAVE THE PLAY STORE FROM GOOGLE ON IT.  THE APP STORE HAS A LIMITED AMOUNT OF TV APPS. I WISH THEY MADE A DEAL WITH COMCAST TO ALLOW THERE APP TO BE ON THERE", "verified": true, "helpfulness": "0/0", "author": "tefera"}, {"rating": 4.0, "review": "Haven't had to buffer once. I usually watch amazon prime video on my PC, but this is a much better direct experience. I enjoy using my smartphone and mirroring youtube videos to my TV with fire connected. No buffering once and the quality is remarkable.", "verified": true, "helpfulness": "0/0", "author": "Blake"}, {"rating": 5.0, "review": "You have to buy.  Is very good", "verified": true, "helpfulness": "0/0", "author": "Steven Fontanez"}, {"rating": 5.0, "review": "A fantastic alternative to the mundane offerings on cable TV. It works like a charm with easy set-up. The voice search is amazing and I like that I can have all of my music and pictures stream through my television from the cloud. Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "S CHRISTIANSEN"}, {"rating": 4.0, "review": "So far, so good.  It was easy to hook up, and seems to be easy to use.  Now, if I can only figure out how to get NetFlix hooked into it.  Amazon is a little limited in the movies I would like to watch.", "verified": true, "helpfulness": "0/0", "author": "John S. Austin \"jsaboise\""}]