[{"rating": 5.0, "review": "We recently replaced our cable with Amazon Fire TV and Hulu Plus.  Together they're saving us tons of money and we're still able to watch all the shows we like.  The only downside to this change was giving up live sports.  Amazon has a great selection, and for the $99 service a year plus free shipping, you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "Northeastern Upstart"}, {"rating": 2.0, "review": "This is a really cool device if you want to use it to stream Amazon Prime. But, I have had mine now for a day and I am probably going to return it. Here's why:This is an Amazon-centric device. Amazon made it to sell content, pure and simple. It's obvious once you play with it for a while. Its great for streaming \"free\" Prime content. Voice search is awesome. The remote works very well. The device is quick and it has a pleasant interface. If you want to only watch Amazon purchased content and Prime content this is the device for you.If (like I did) your thinking about buying it primarily to stream Netflix and Hulu Plus, this is not the device for you. Netflix and Hulu are just other things you can do with this box. The Netflix app isn't preloaded, although Hulu Plus is. When I tried to download the Netflix app the device said I already had it, but if I didn't it would download soon. It didn't. After doing some brief research I found that this is a common problem and found a workaround. (I wonder if this glitch is really a glitch or if its intentional.) Once I got the Netflix app to work there was another glitch with connecting to my account. Argh!So Netflix is finally working correctly and I try a voice search. The search came up with what I was looking for and I click it. I am then presented with videos I can purchase and watch from Amazon. Fire TV seamlessly left the Netflix app and presented me all kinds of buying opportunities! In other words, voice search only works for Amazon content and like I mentioned above this device is designed purely to get you to part with your money on an ongoing and regular basis.Summed up, this device is good for Prime but bad for everything else. Its not so much a streaming media player, but an easy and direct way to spend money with Amazon.", "verified": true, "helpfulness": "1/2", "author": "R. Daly \"Repsand\""}, {"rating": 5.0, "review": "Easy to use.  I like the voice command feature.", "verified": true, "helpfulness": "0/0", "author": "Donald J. Pollock"}, {"rating": 4.0, "review": "Ah! The problem is too much to watch.It would be nice if there were more current movie releases.The audio search feature is great, and works very well.", "verified": true, "helpfulness": "0/0", "author": "Notop747"}, {"rating": 5.0, "review": "Haven't had much time to use this yet. So far I really like it.", "verified": true, "helpfulness": "0/0", "author": "cathy"}, {"rating": 5.0, "review": "OH MY GOD!!! This thing is heaven, I hooked it up last night and it has far exceeded my expectations, watched a few movies on it and I can not believe to picture quality. I watched the old Willy Wonka and the Chocolate Factory and the color was brilliant, I mean I've seen this movie lots of times before but the color just popped when I watched on Amazon Fire. The set up process was so easy. Amazon has absolutely hit a homerun with this product.", "verified": true, "helpfulness": "0/0", "author": "J. Robinson"}, {"rating": 2.0, "review": "Pros:-Design-Speed-Voice promptCons:-Device is tailored to making you BUY more Music / TV / Videos from them-Amazon Prime 'free' content is hard to locate-Netflix is stripped down and bugging (it's competing with them) so it's as if amazon begrudgingly included the app but made it so difficult to navigate and use that you would be forced to buy videos from the them insteadNOTE: Voice search ONLY WORKS FOR AMAZON CONTENT. If you search for \"Chevy Chase\" it will never display any titles that are listed in Netflix, as an example. This is a huge fail in my opinion.In a nutshell, the device was designed for the consumer to shell out more $$$ to amazon to have a positive user experience. If you want to use this for Netflix, Hulu etc, go with a Roku", "verified": true, "helpfulness": "0/0", "author": "Steve Morty"}, {"rating": 1.0, "review": "I Really  thought it would be faster than Apple TV , but it is buffering just like Apple . and notvery friendly to add XBMC , turn off all the time and very cheap Batteries that don't last more than 2 months .now they locked it for other application. I can not use it for any other applications like Other unlocked systems .", "verified": true, "helpfulness": "1/3", "author": "Doron Abrahami"}, {"rating": 2.0, "review": "Love the UI. Love the responsiveness. Hate the fact that the USB port on the side does not work with my HDD or thumb drives like the roku 3 does. Deal breaker for me. Fire TV went back and now the roku 3 is working like a dream. I should also note that the roku 3 supports a lot more file formats for streaming and the Dolby digital works great...something I could not get the fire TV to do.", "verified": true, "helpfulness": "0/0", "author": "Randy Frey"}, {"rating": 5.0, "review": "Great product!Update: I love Fire TV so much I ended up buying a second one for my daughters room, and will likely get one for my Master. There is great content on Amazon Instant Video, and third party apps like Disney JR, and Plex bring great additional content. I also got a Netflix subscription after having Fire TV for a while since it is a nominal fee and adds even more great ,m content. I do have Cable, but can imagine easily being able to cut the cord with this gem. What separates Fire TV from the competition is really it's performance. It's snappy, and responsive with no lag and has ample storage space. It will truly transform the way you watch TV.", "verified": true, "helpfulness": "0/0", "author": "Gower Limited"}]