[{"rating": 3.0, "review": "I can't seem to find the option where you ask a question about this device so I'm asking in a review. Does this only work for one TV (I assume it does)? If it does, I'd have to have one of these connected to each TV in the house right? I'm trying to get away from a cable bill. Thanks in advance for any help.", "verified": false, "helpfulness": "0/0", "author": "JD32JD"}, {"rating": 5.0, "review": "Awesome device.", "verified": true, "helpfulness": "0/0", "author": "America Moua"}, {"rating": 4.0, "review": "Was given as a gift, but later return since the person wanted something different.", "verified": true, "helpfulness": "0/0", "author": "S. Martin"}, {"rating": 5.0, "review": "Love this! I can stream anything to my big TV and it works great! I bought this versus the fire stick because reviewers said it worked better. I just set it on top of my DVD player, as it's only about 6\" square. Speaker seems to work well, but I don't use it too much. I started out with a trial version of prime and have Netflix streaming. A lot of the prime tv/movies options said \"unavailable\" when I tried to play, so I cancelled that at the end of my trial and just have Netflix now. Tons of movies and tv shows to watch. I'm thinking of cancelling my cable tv as I hardly ever watch it anymore now that I have the fire tv. Would definitely buy again (BTW, I'm 63 and a little techy but not much, and had no trouble getting this going).", "verified": true, "helpfulness": "0/0", "author": "KittyLover"}, {"rating": 5.0, "review": "Great product, more intuitive than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Bryant Dube"}, {"rating": 5.0, "review": "Love it. Works perfect for me.", "verified": true, "helpfulness": "0/0", "author": "G. Harkness"}, {"rating": 5.0, "review": "I love how easy it was to set up and use.  There are many options on this device which is awesome.  The price is just right for all that you recieve.", "verified": true, "helpfulness": "0/0", "author": "Jene James"}, {"rating": 4.0, "review": "I bought this device June 26, 2014.  It didn't even last a year.  Customer service is sending a replacement.  Great service.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Michael Pendergraft"}, {"rating": 5.0, "review": "Great product.  No issues.", "verified": true, "helpfulness": "0/0", "author": "charlie shelden"}, {"rating": 5.0, "review": "Amazon Fire TV, where have you been all my life?  My wife loves cable TV and is always on the TV so I can't watch TV.  Along comes the Amazon Fire TV and my gaming TV is now something that lets me watch TV commercial free and whenever I want.", "verified": true, "helpfulness": "0/0", "author": "Hojo"}]