[{"rating": 5.0, "review": "The first had a problem and did not work but customer service got us a new one in three days. This works great. Use it for sling tv.", "verified": true, "helpfulness": "0/0", "author": "steve"}, {"rating": 4.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Raquel morales"}, {"rating": 5.0, "review": "This will someday replace +^%#{]{}% cable", "verified": true, "helpfulness": "0/0", "author": "ROBERT T BEEBE SR"}, {"rating": 5.0, "review": "Having been an Apple TV user for many years, I am very happy with the user interface and performance of the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Tyler J Bieniek"}, {"rating": 4.0, "review": "The only problem we have with this is that the voice search, and text search for that matter, won't allow you to search your Netflix app.  I think it would be a great improvement if you could search both Amazon Prime and Netflix/Hulu or whatever other apps you have at the same time.  I've seen a few instances were something was $4 on Amazon Prime but later found it was FREE on Netflix.  Just takes a little longer to search both apps for the cheaper way to watch it.", "verified": true, "helpfulness": "0/0", "author": "stephen s."}, {"rating": 4.0, "review": "We purchased the Amazon Fire because we were not happy with the streaming performance of our older smart TV.  We chose the Amazon Fire because we already had Amazon Prime.Overall, we are pleased with the performance.  Since we don't watch many different shows, the look ahead feature becomes very helpful.We did have a problem with videos not loading. Restarting the Fire fixed this problem.We have not yet tried any of the games. Nor do we watch many movies.We plan on taking the Fire on vacation.  It will be interesting to see how well it works on a resort network.", "verified": true, "helpfulness": "0/0", "author": "Sharon Morrison"}, {"rating": 5.0, "review": "Way better than Roku.", "verified": true, "helpfulness": "0/0", "author": "Kevin Smith"}, {"rating": 5.0, "review": "The Amazon Fire TV is really cool, it's easy to use, and I love the apps that are available. Especially PBS, Hulu, Spotify, MLB.tv, Netflix, and the Smithsonian Channel. I can't compare it to ChromeCast or AppleTV, but it's pretty awesome.", "verified": true, "helpfulness": "0/0", "author": "Meredith G."}, {"rating": 5.0, "review": "so far so good.  Set up was easy.  Clear picture.  Access to many sources of media.  Rented a movie, all worked great.", "verified": true, "helpfulness": "0/0", "author": "Anthony M. Leigh \"Pilot 53\""}, {"rating": 5.0, "review": "Great Service> Thanks", "verified": true, "helpfulness": "0/0", "author": "Stephanie Schroeter"}]