[{"rating": 4.0, "review": "good, voice did not work on the one i had so i returned it and got a fire stick.Going to need a bit more convincing to fully switch from apple tv which has a much better interface.", "verified": true, "helpfulness": "0/0", "author": "felipe Reyes"}, {"rating": 3.0, "review": "It us not compatible with some apps like nbc sports. You also cannot mirror your phone which we found out would be very nice.  There was a problem with watching espn u also. Something about charter not being an option. Therefore we are returning.", "verified": true, "helpfulness": "0/0", "author": "Kristen Wardlaw"}, {"rating": 5.0, "review": "Really enjoying this as it was SUPER easy to set up and works great!", "verified": true, "helpfulness": "0/0", "author": "Jessica Claybrook"}, {"rating": 5.0, "review": "Works as promised.  Plug and play installation. To receive full benefit should subscribe to Prime.  However, not necessary.", "verified": true, "helpfulness": "0/0", "author": "Ken C"}, {"rating": 1.0, "review": "I was rather disappointed with my FireTV. It fell short of my expectations, navigation was difficult, and the voice search was just too limited, and it wasn't very user friendly. I bought it because I thought it would be great combination for media streaming and to play games on but was sorely disappointed.Also the design of the FireTV unit is a bit unusual, the construction is very solid, but the sharp corners were a bit of a hazard. Some sort of rounded bevel should of been used.The response time from the remote seems slow, I'm not sure if its a hardware or software issue but often pressing a button would not give me instant feedback on the screen causing unexpected results.In the end I ended up returning my FireTV and bought a Roku 3 which I am very happy with.", "verified": true, "helpfulness": "3/4", "author": "Charles DeWeese"}, {"rating": 5.0, "review": "Prior to using the Fire TV I was using a suface tablet and connecting it to the plasma tv. I had issues going full screen and other stuff. Love the way this just works. Connected right out of the box ( I hard wired it since my Uverse box is righ next to it) and it knew who I was and was ready to go. The search feature is amazing, not sure how it does it but almost always right. Really love this.", "verified": true, "helpfulness": "0/0", "author": "Tim R. Casey \"TRC\""}, {"rating": 1.0, "review": "The sales pitch made it sound better than it actually is.", "verified": true, "helpfulness": "1/4", "author": "Jim Idell"}, {"rating": 5.0, "review": "I purchased this as an alternative to my Apple TV mainly for the Amazon Prime movies so that I would not have to turn on my PS3 to check what movies were available. I was very surprised at how easy this was to use and it is even faster to load a movie into it's buffer. Not sure if that is the extra memory, but it is a nice improvement over my Apple TV. I find myself using this more now instead of Apple TV for Netflix due to the faster load times. I am very pleased w/ this unit.You will have to load the apps when you first start, but that is a very simple process and once loaded, they are easy to find. It comes set up for your Amazon account, so that makes the initial install even easier as you only have to enter in your internet password and you are up and running.", "verified": true, "helpfulness": "0/0", "author": "jsey21"}, {"rating": 3.0, "review": "It's ok so far. I guess I didn't do enough research. I was hoping this would replace my cable. As I try to sign up for some apps I see you  need to have cable to get these channels.  I have watched movies and my granddaughter has watched some tv shows. I had to pay for her to watch. Not sure if I joined prime if this would get me more stuff free.  Need to do more research. It's a keeper and I hope that the more I use it, I will understand it better. I really want to cancel my cable. I have been looking at ruko and comparing the 2 the fire tv is by far the better deal.", "verified": true, "helpfulness": "0/0", "author": "Robyn Terrell"}, {"rating": 5.0, "review": "awesome! able to cut my cable bill in half.", "verified": true, "helpfulness": "0/0", "author": "sandra mikolas"}]