[{"rating": 5.0, "review": "Simple, works great.  It didn't recognize what I was saying at first but I guess it trained me how it wanted to be talked to.  My wife has a Kindle Fire HD 8.9\", we watch videos in two different rooms at different times of the day, that necessitated dis and re connectingit which probably isn't good long term on the connectors.  We have Amazon Prime, we dropped Dish after 20 years.", "verified": true, "helpfulness": "1/1", "author": "Slafty"}, {"rating": 5.0, "review": "This came the day after I ordered it and is already registered by Amazon! So I plugged it in, hooked it to TV with HDMI cord and it was ready to go! I was watching videos on Amazon prime within 5 minutes of getting it from the driver! Thinking of ordering one for bedroom too! This is an awesome purchase! Definitely reccomend it. Other apps are easy to add, like Netflix, and voice look up is great.", "verified": true, "helpfulness": "1/1", "author": "wylie cater"}, {"rating": 5.0, "review": "I purchased this to replace a latptop hooked up to my new 46\" HDTV. My daughter has the NEOTv in her room but I wanted something that could stream my Amazon Prime movies. This box does it and more. Perfect picture and easy to use, better than a cable subscription. It responds quickly and there is no lag time when a button is pressed on the remote. Perfect selection of subscriptions and channels. I use Amazon Prime, Netflix, and Hulu most. This box also has ESPN and news channels.", "verified": true, "helpfulness": "2/3", "author": "Dori Yacono"}, {"rating": 5.0, "review": "Easy to install!  Love the size (small compared to the DVD player I had there) and the voice commands rock.  I look forward to Amazon collecting more content! - MJB", "verified": true, "helpfulness": "1/1", "author": "Melia"}, {"rating": 5.0, "review": "I own Apple and Chromecast and this product is above all the best! Excellent product would and have recommended to all my friends. Most of all like the voice search function!!!", "verified": true, "helpfulness": "1/2", "author": "Wendy"}, {"rating": 2.0, "review": "Would you use Google search if Google returned mostly Google results first and made you work harder find results from any one else that google competes with?  This applies to the voice search function so it may not apply to you, but it leaves a really bad taste that they did it this way.", "verified": false, "helpfulness": "4/14", "author": "derekdrew"}, {"rating": 3.0, "review": "As on the corver, Fire TV medium sized compact palm, can transfer content from a lot of apps and other sites that offer but I can not access to Youtube (I dont know how to connect???). Fire TV features the ability to search by voice, support more games and play on TV with export standard audio Dolby Digital Plus.I also difficult to install other apps from android althought I know that it base on android. At least, I want to access google.com but can not???Other apps, it has a lot of apps that can to show file, music... but we have to pay more money, it does not free????I think that Amazon need to improve so many things, Google.com & Youtube should include inside and can use", "verified": true, "helpfulness": "2/6", "author": "Nguyen Xuan Hong Quang"}, {"rating": 5.0, "review": "At first when the Amazon Fire TV first launch, it was missing a lot of apps as well as feature that I deem was needed to make this a great product. At the time I only gave it a 3 stars because even though it was missing some feature it was very fast. At the time Netflix was on the older version while other system that had Netflix already move on to the next. The system was suppose to go to sleep automatically, but sometime it refuse to shut itself down and just stay on wasting electricity. HBO Go was one of the app missing. Prime member benefits like movies were mix in with the normal rent/buy movies. It was really a mess and a chore just to look for prime only movies. The games was also lack luster at best. The USB in the back was pretty much useless since the only reason to really want to use it was to attach hard drives to it for more space.Since than my rating has move to max star. It pretty much fix everything I had problem with. Netflix is now the current version. Sometime it force me to retype my password for whatever reason which is a hassle with that small remote, but other than that. I never had problem with the app and the movies play smooth and fast. The only thing missing is 3D movies. On the Ps3 you can stream 3D movies if you have a 3D TV, but on the Fire TV you can't. HBO GO has been added for those crying for it, I don't have HBO on cable so it useless for me. Than again streaming with prime movies and Netflix was the reason for me to cut cable. There is now a Prime only section so finding Prime movies has never been easier. Of course you only get a glimpse of the best of the best, not all Prime shows/movies are listed. You can use your computer to add movies to the watchlist and than go to the watchlist on the Fire TV to watch them so it no biggy. The games are a lot better but still lacking. Final Fantasy series are available on amazon store, and I would love to play it on the TV. Premium games like those are what missing still, while a lot of junk made it. I've been going nut lately with prime music streaming. I grew up in the 90s but to me the 80s were the best time for music. I miss a lot of the songs that came out in those time and been adding free music offer through prime to my Fire TV as well as Kindle. It a blast just reading the lyrics from these song or even singing a long to them on the Fire TV.Lastly and probably the most important feature for me is now I can put the system to sleep manually. I didn't even know they added this feature in until I was messing around with the menu one day. For those of you who didn't know if you go to Setting, than to System, there is a sleep button now so you can put it to sleep instead of waiting. Maybe there a button you can hold to do this without going to the setting, but I don't know about it. I wish they would give us note on what update when they do update the system. Even one that are hot fix.So beside the Hard Drive capability which I don't know is added or not. I still lack memory so I can't play most of the games that I have bought. I can say that the Amazon Fire TV is now a very good product. I can finally say I can recommended it to those looking for a fast streaming device.", "verified": true, "helpfulness": "2/8", "author": "Syn N."}, {"rating": 3.0, "review": "This media streamer is only OK. I bought the Fire TV at Best Buy and ended up returning it. The user interface is awful. I have had all three of the major media streamers between my 3 TV's. Amazon Fire TV lacks what Roku 3 and Apple TV have. They both have easy to use navigation but the Amazon Fire TV just is no good. I want a media streamer that my 5 year old son can use for cartoons. He is able to handle the Apple TV (which in my opinion is the easiest to learn of them all) and also the Roku 3 (which is still pretty easy). This device has no pictures until you select exactly what type of thing you are wanting to watch. I really wanted the voice command to work for my son who cannot read yet so that he could just say what he wanted to watch. The problem is A) it only works for Amazon instant video, B) it is not accurate like Siri on the iPhone at figuring out what you are saying C) If I were to say \"Spongebob\" or something, it brings up all pay and non pay items and you cannot filter it. My son ends up trying to watch pay per view shows and it doesn't work and he freaks out. I would highly recommend either the Roku 3 or Apple TV (my personal favorite). I love Amazon and use there Amazon Prime all the time but I'm kind of disappointed.", "verified": false, "helpfulness": "4/11", "author": "Bacon"}, {"rating": 5.0, "review": "Ordered this with a TV and wall mount.  Received all the same day.  I am impressed with the quality of the packaging of this Fire TV setup.  It truly is a \"frustration free\" package.Setup was extremely easy, installed it, turned it on, let it update the necessary programs while I took a break to eat dinner.  When it was done I tried a few features on the Fire TV.  It worked flawless, even the voice commands worked great, and I have a rather muffled voice (so my wife says).  It had no problem understanding what I asked it to find.I am glad I went with this unit instead of trying some other brand, but I cannot say that it is that much better as I have never used any of the other brands on the market.  I can say that I'm happy with this unit, it is very quick in finding what you're looking for, and that with just using wi-fi.  I am planning on running it off of an ethernet cable soon.The remote DOES NOT have to be in line of sight to work with this unit, as a matter of fact I mounted it on the wall behind a dresser (out of sight) because I did not want cables showing up on my wall.  Even mounted out of sight behind furniture it works flawless...............it's just a great little unit.", "verified": true, "helpfulness": "3/4", "author": "Frank Von Furstenrecht \"fmvf26\""}]