[{"rating": 5.0, "review": "Really enjoy using the Amazon Fire!  The Wi-Fi reception is excellent, a lot better than my Xbox One. Also, bought it with the SlingTV deal; purchasing it 50% off is even better.", "verified": true, "helpfulness": "1/1", "author": "Alex Heriford"}, {"rating": 5.0, "review": "Quick easy setup (took no more than 5 mins). Excellent HD quality and sound. I love it!", "verified": true, "helpfulness": "1/1", "author": "Jeff Bradley"}, {"rating": 5.0, "review": "work great!", "verified": true, "helpfulness": "0/1", "author": "Joseph Editon"}, {"rating": 5.0, "review": "Quick delivery, Great product", "verified": true, "helpfulness": "0/0", "author": "SALAH AHMED ALRAWAS"}, {"rating": 5.0, "review": "Amazon fire TV works flawlessly for me! I can't compare it with Roku or Apple - I own both. In fact I had to replace ROKU with Amazon Fire TV. This is among the best product Amazon has to offer. I like the numerous apps available, games and music. If one has prime membership, the benefits are numerous. I wish the remote had some reflective strip on it or came in different color. When its dark I can't locate the remote easily. This product deserves five star.", "verified": true, "helpfulness": "1/1", "author": "RICH K"}, {"rating": 5.0, "review": "Top notch. Quick to install, snappy performance. Very small form factor. Much better than the Google TV and Smart TV options.", "verified": true, "helpfulness": "0/0", "author": "COLLIN M."}, {"rating": 5.0, "review": "Great item and perfect compliment to my Prime membership.  Tons of free movies and for rent movies.  If I had to do it over again I would.", "verified": true, "helpfulness": "1/2", "author": "George M. Perry \"George M. Perry\""}, {"rating": 5.0, "review": "My favorite electronic purchase yet!", "verified": true, "helpfulness": "0/1", "author": "Sayre Geltzeiler \"webbabe\""}, {"rating": 5.0, "review": "Best thing I have bought in years! Worth it and et rid of cable!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Movie playback is great. Picture quality is good. Little or no pauses or buffering when viewing Amazon or Netflix movies. Sling TV can stand some improvements. Too much loading and buffering. I would like to see a larger selection of live tv channels offered by all three companies.", "verified": true, "helpfulness": "0/1", "author": "GDJR"}]