[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/2", "author": "Davon Holly"}, {"rating": 5.0, "review": "I have a Google TV, bought this one for the family TV, can't beat this accompanied with Prime for the videos and Netflix, great stuff, plenty of hours of entertainment.", "verified": true, "helpfulness": "1/1", "author": "JJL"}, {"rating": 5.0, "review": "And HBOGO has arrived the Fire tv is now perfect!!!", "verified": true, "helpfulness": "0/1", "author": "LindaFus \"lindafus\""}, {"rating": 5.0, "review": "Super, although some other options are not as good and cost extra. But still VERY happy", "verified": true, "helpfulness": "0/1", "author": "Ricka254"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/2", "author": "quest4eternity"}, {"rating": 5.0, "review": "This is worth every penny!  I would highly recommend it", "verified": true, "helpfulness": "0/2", "author": "Mario Christoforou"}, {"rating": 4.0, "review": "I have this and Apple TV and they are both good!", "verified": true, "helpfulness": "0/2", "author": "BC \"The Workout Dude\""}, {"rating": 4.0, "review": "Pro.  I bought the FireTV so that I could have all my entertainment options in one box. Plex, Netflix and Prime.  It fits all those needs.  I have been very happy with the unit so far.  It is easy to setup and so far reliable.Con.  No slingbox app, that would be nice as I do use this when I go on vacation.", "verified": true, "helpfulness": "3/3", "author": "David"}, {"rating": 5.0, "review": "This is now my go device for watching TV, music, Extreme sports, travel, and channels that I have not discovered yet!!", "verified": true, "helpfulness": "1/1", "author": "Robert L Long"}, {"rating": 1.0, "review": "For all purposes this is a pretty good option for content.  However I purchased it so that my wife and I could play some old skool games, (atari and sega type 2 person games-think indy 500, tennis, etc).The Amazon App store is not completely available for content on the Fire TV, so most of those games are not currently able to be played on this device.....bummer!  However of all the games that are available and are multiplayer only a couple are truly multiplayer/splitsceen that you are used to or would expect for a system that boasts about family gaming, the rest are online multiplayer, HUGE LET DOWN!!!!  Looks like I will be sending this little box and 2 controllers back!", "verified": true, "helpfulness": "5/8", "author": "John"}]