[{"rating": 5.0, "review": "The FireTV was super easy to set up. The voice search feature works really well. I bought it as a gift for my dad since he is not very tech savvy. It's easy to use and is great with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "I have always wanted a streaming device so that I can watch my Amazon video purchases on my big screen TV rather than my computer, so when I saw that Amazon had a Fire TV, I took a chance.  While I am somewhat tech savvy, I was concerned after reading other viewer comments, that I would have a problem installing it.  Guess I am one of the lucky ones, it installed in minutes and worked perfectly.  Just what I wanted.  I am a long time user of Amazon and am a Prime member so the Fire TV is perfect for me.I also figured a way around not knowing which are the Prime free videos.  It is not ideal, but it worked.  What you do is go to your PC and look at all the prime free lists which are numerous and are listed separately on the site.  Then you add the ones you are interested in seeing eventually to your watch list.  The Fire TV has a watch list category so when you go there all the free prime videos you added are there and you know they are free.  Then to keep up, all your need to do is click on the new prime items.  Anyway I thought I would share that idea, until Amazon realizes it need to update the Fire TV to include it.", "verified": true, "helpfulness": "1/3", "author": "Marjean \"Book Lover\""}, {"rating": 4.0, "review": "I have tried several there products and prefer Amazon Fire TV even without the voice search option.  The only negative would be no HBO GO app available....yet:)  Can't wait for my game controller to arrive so I can try out the gaming option.", "verified": true, "helpfulness": "2/4", "author": "ED LUND"}, {"rating": 3.0, "review": "As advertised the hardware is spiffy, setup and configuration straightforward and unambiguous.  The MAC address isn't on the box, and since I use MAC address filtering, this was annoying, but most products are this way.The real let down is in the user interface:1) Cannot select Prime content only, have to wade through everything Amazon has and pick out the Prime offerings.2) Fire TV is an Android 4.x (?) box, but Android is completely invisible, as is the google Play  store.  Only the Amazon apps store is visible.  And that's not even a short story, it's a synopsis, 12 items as I remember.3) The amazon store does not have VLC, or even XBMC.  ¡Hey Amazon, they're free! And Fire TV should get enough market mass to get versions tailored to it.  Anyway a box that doesn't let me play ISOs from NASes is nearly useless.4) No Acorn streaming app, instead I'm offered Hulu Plus.  If I wanted to look at ads I would still have cable or satellite, or use free over the air.5) No direct file management, not the Android 4 file manager, not ES manager, in short everything else on the network doesn't exist.In short, the venal need to control content has made this box as (nearly) useless as Apple TV, and for the same reason.  The future of television is clearly direct pay for content, not indirect pay via an advertiser.  Madison Avenue may find this tragic, but the rest of humanity is behind the BBC model.So, I applaud Amazon's entry into the market, but not allowing me to see Prime *only* content decreases the value of Prime.  And I should be able to get to android, and use its vast array of apps.  Finally, at $40/Terabyte, the box needs to support viewing ISOs from NASes.  This probably means VLC or XBMC, both are free and work well.", "verified": true, "helpfulness": "4/6", "author": "George H. Barbehenn"}, {"rating": 5.0, "review": "I have three Apple TV's and absolutely love the product, but as an avid Amazon fan and a heavy user of Amazon Prime video this device is a no brainer and in fact it trumps the Apple TV with faster speed, better features (like voice search) and the ability to download a slew of apps including games.  I just received the Amazon TV game controller which makes it even more fun. I'm not a huge fan of long reviews, so all I will say is this - Great Job Amazon!", "verified": true, "helpfulness": "1/1", "author": "Ezra Weinstein"}, {"rating": 1.0, "review": "Amazon and Google both need to stop fighting over who is the bigger kid in the sandbox.The fact that YouTube is available both on iOS and on Apple TV, and Amazon Instant Video is available on iOS tells me the only reason I can't get YouTube on my Fire HDX and why it's not available on Fire TV is because mom and dad can't stop fighting.Well mom... I choose dad this time.", "verified": false, "helpfulness": "10/59", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Ordered 2 units.  Installed one and it worked fine that evening.  1 week later it didn't respond to the remote.  Disconnected / connected power  and same results. The main menu showed but that's it.  Installed the 2nd unit to rent an amazon movie, and it worked fine that evening.  Haven't tried it again.  Am sending 1st unit back and have ordered another unit.  Amazon may have serious problems with this release, and will hopefully be able to fix w/ an online unit update (seems to be software).", "verified": true, "helpfulness": "12/23", "author": "Amzn Cust Ace"}, {"rating": 2.0, "review": "TV shows stream OK with no lag, but I hoped to use this device to browse the Internet.  As of now that is not possible because there is no browser.  It works Ok for what it is - but if you want to use it for general things then use a PC or laptop.  If it ever does get a browser, then this device could also use a combination Bluetooth keyboard and mouse.  Amazon touts their intuitive navigation, but that is not my experience.  Amazon says it has 200,000 shows, but you can't just poke around and look at all of them, you have to use its interface which is slanted toward what they want you to view or buy.  The voice search works OK - but you can't just poke around.  Also, I will probably have to enable parental controls just to keep myself from accidentally buying something when I just planned on looking at it.", "verified": true, "helpfulness": "2/16", "author": "Stephen Shuman"}, {"rating": 5.0, "review": "The Fire TV is amazing. I use the Prime instant video service, and it is amazing at how quickly videos load and skip.", "verified": true, "helpfulness": "3/4", "author": "John Chapman \"John\""}, {"rating": 3.0, "review": "I picked mine up from Best Buy because I didn't want to wait the extra days for shipping.I have been playing with it for three days now and I am impressed how fast it is. Everything opens in an instant. Voice search works really well. Picture quality from Netflix and Amazon Prime Video is very good. I can't tell a difference from my other devices.Plex app works well is a very nice feature to have for us that use it sometimes.Today I installed a custom XBMC Frodo and it's working okay. It doesn't do the HD Audio formats but the final realease of 13.0 Gotham is supposed to have hardware acceleration for Android and it should do HD Audio. It does pass thru the legacy DTS and Dolby Digital formats. You need a wired connection to play full blu-ray rips.One thing that is disappointing is the lack of apps. There is only a few of them. Amazon should have included more apps for those people that are going to keep this device in stock form.You can side load apps that are not available in the app store but is a pain in the neck process if you use a Windows based PC or device. You have to go through so many steps and downloads.If you have an Android device then it's pretty easy. I used my Samsung Galaxy S4 phone to install XBMC in the Fire TV.I give this 3.5 out of 5 stars right now but only because of the ability to sideload apps and the good hardware. Otherwise I would have given it a two star rating.I will update this review as more stuff is added in the future and the functionality of XBMC once the full stable release of 13.0 Gotham gets here.*update 4/19*I took one star off because in its current state, does not do anything more than the other boxes do (don't care about games). I also discovered that the ethernet port is not a gigabit port. This is a major disappointment for me.", "verified": true, "helpfulness": "1/2", "author": "z31fanatic"}]