[{"rating": 1.0, "review": "NO VUDU", "verified": false, "helpfulness": "3/19", "author": "AND"}, {"rating": 3.0, "review": "Hardware: 5 StarsSoftware: 1 StarAfter buying this based on it's technical merits (I own a Roku 1,2 and 3 also) I have used it for a few months and feel that once again Amazon has created a superior hardware product but crippled it by making it geared toward Amazon content. The term \"Jack of all trades, master of none\" comes to mind but what is interesting is that, due to the great hardware, this does not need to be. Fire TV should kill all the competition but because, once again, it's clearly pushing Amazon content over everything else, it leaves using non-Amazon content to be lackluster at best.All these great features are great if you live in an Amazon only world. If you use content from Netflix or an in home file server the experience is less than ideal. The entire menu system is a real mess. The non techie will find it hard to navigate and find what you are looking for... unless you are looking for Amazon content which has it's own sections while everything non-Amazon is lumped together. For video (TV) viewing the Roku 3 is superior not because of hardware (the Fire TV is better) but because the Roku does not favor any one Video source and as such treats all video content equally. The interface is far superior to the cumbersome Fire TV.The main reason I got the Fire TV was to play Android games on my TV but due to Amazon not allowing users to use the Android Store, the number of apps is so weak that playing games is limited to a few dozen good games at best instead of the thousands. But one thing cripples this great piece of hardware. 5gig of storage! Yes out of the 8gig of storage you can only use 5 and with games and apps often taking 1+ gigs each, you can have but a few apps in the device. There is a USB port but to date Amazon does not allow you to plug in extra memory so claiming that you can use Android apps while true, has been crippled.Now lets move on to watching video from a home server. Many people do not do this but for those that do there is one app that allows you to do this and while it works it's not exactly easy to use. While Roku has a dozen or so apps to choose from (some you have to pay for) you can pick what you like best.In closing I just want to mention the wife test. When I showed the wife the Roku I did not have to explain anything. She turned it on and it displayed Netflix, Amazon and File Server. Without telling her anything she was able to pick  a source and find something to watch in seconds. When I showed her the superior \"Fire TV\" she was totally lost. About 95% of the menu content (and there is alot) was all about Amazon this or Amazon that and while I understand Amazon is trying to sell their content, everything non Amazon was listed at the bottom under Apps. I had to teach her to use it. All those great features such as voice command (which work great BTW!) are useless because they only work with Amazon content.ALL OF THIS can be fixed if Amazon would get off it's high horse and design software that cared more about it's users and less about pushing Amazon products. I fear Amazon is becoming like Apple. Designing wonderful hardware and crippling it to make a buck by making design choices to keep people buying their product only.", "verified": true, "helpfulness": "51/55", "author": "Cassie"}, {"rating": 3.0, "review": "I have an Apple TV and bought the Fire TV just so I could watch Prime Movies and TV on my TV because Apples AirPlay does not work that well when Airplaying my browser and from the iPad and iPhone it just quits so I am happy now that I can watch Prime stuff with no hassle but in comparing the two, Apple's interface is way easier and the Netflix app on Apple TV is way better than the Fire's. (Next episode starting automatically, showing lists of similar movies, etc) Also, I have found games that say they are compatible with the remote but really are not.My remote does not work correctly (up arrow button does not always work) and I have been struggling with getting someone on the phone that I can understand and who can help (JUST USE A DRONE TO SEND ME A NEW REMOTE)Better support is needed...", "verified": true, "helpfulness": "3/4", "author": "mflorant"}, {"rating": 2.0, "review": "I have not purchased this item although I like the idea of on demand tv streaming and the price is great, however it has no ability to stream live sporting events like football. So with that this machine is useless how you will work on that in the future amazon.", "verified": false, "helpfulness": "1/36", "author": "ejizzle"}, {"rating": 5.0, "review": "i would highly recommend this. something for everyone in the family, easy set up and easy to use", "verified": true, "helpfulness": "1/3", "author": "REGINA ASBURY"}, {"rating": 5.0, "review": "Awesome...I love it.  I switched from the Apple TV and wow what a wonderful difference with so many choices.Was excited that closed caption was so easy to set because it was difficult to use with the Apple,SO MANY CHOICES of what to watch", "verified": true, "helpfulness": "0/0", "author": "LindaW"}, {"rating": 5.0, "review": "We own a not-so-smart smart TV. It continually drops the wifi signal, so I purchased the Amazon Fire TV in hopes of  eliminating that problem. We own a Roku 2, Roku 3, and an Apple TV as we'll. although I've only used the Amazon Fire TV for a few days now, I am quite impressed.In my opinion, it is faster than the other three set-top brands I use, and the voice search feature works as advertised.This unit brings binge-streaming to an entirely new stratosphere!", "verified": true, "helpfulness": "2/3", "author": "S Barr \"SB\""}, {"rating": 1.0, "review": "Don't waste your money. Fails to do most they present it to be. When I purchased it part of the appeal was I would get Amazon music including my prime music. Not so! Only let you listen to what you pay for? Really?! I called a month ago to complain and a lady said they were working to fix it and someone would get back with me in 48 hours. No call back and when I called back yesterday because YOU CAN'T GET SEC Network on ESPN despite getting it on my phone and computer, they said no prime music and to bad. Now guess what? beyond time to send piece of crap back! Save your money! BTW no date if you'll ever get SEC Network on this piece of junk.", "verified": true, "helpfulness": "8/21", "author": "Russell E. Harris"}, {"rating": 5.0, "review": "Very useful device. Very simple to operate. Very glad I got it!", "verified": true, "helpfulness": "1/4", "author": "william h."}, {"rating": 3.0, "review": "Has potential, still requires a few key apps so that's a wait and see, but the major let down is the lack of an IR receiver to use with Universal remotes such as the Harmony 650. This one supposedly uses Bluetooth, but Amazon could still have included it for our benefit. The Roku 3 uses WiFi for their remote but still had the good sense to include an IR receiver on the unit. Major FAIL and I hope Amazon does right with Fire TV 2.", "verified": false, "helpfulness": "4/5", "author": "Angel"}]