[{"rating": 4.0, "review": "I like it!", "verified": true, "helpfulness": "0/0", "author": "KEITH M CREP"}, {"rating": 1.0, "review": "The apps don't work in Jamaica only Netflix works", "verified": true, "helpfulness": "2/5", "author": "Michael cummings"}, {"rating": 4.0, "review": "really enjoy the Amazon TV and the amount of movies available on prime. A little disappointed that the remote does not help with gaming and you cannot access ESPN now without TV service. We are in the country and have chosen fire TV over a provider", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Nothing is free........especially the movies and TV shows....those that are were shown 20 years ago....I sent it back....", "verified": true, "helpfulness": "0/2", "author": "DP"}, {"rating": 3.0, "review": "One of the main reasons I purchased this product was to access Netflix on my television. Ironically, that app is the one that isn't working for me.", "verified": true, "helpfulness": "1/1", "author": "lindy \"Lindy\""}, {"rating": 5.0, "review": "I am a former Apple TV and Roku user. The Apple is outdated and I was not excited about the Roku updates. The Amazon player has everything I had hoped for and more. First off, it is fast and fluid. Hulu Plus and Netflix work much better than on the other ones. I also like how it works with the Amazon Music. I have iTunes Match too, but Apple TV was always finnicky with streaming their service. Amazon Music random play is perfect for background music when reading or whatever, and I love how they show the artist images on the TV.The best part was the variety of apps. My favorite has been WifiSync, which I think cost just $1 or $2 and that allows me to transfer images and videos to the TV screen from my computer. The TV has plenty of space so I was able to load a number of iTunes movies this way, and they stream so much better than the Apple TV did through Airplay (which was almost unusable).In my opinion this is the best TV set top player on the maket right now.", "verified": true, "helpfulness": "0/0", "author": "Aaron R. West"}, {"rating": 5.0, "review": "It loads fast and picture quality is excellent!", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 5.0, "review": "Voice recognition works very well. Overall a very intuitive easy to use device.", "verified": true, "helpfulness": "0/0", "author": "Paul Smith"}, {"rating": 3.0, "review": "Honestly I'm not overly pleased with it so much.Roku 3 has more channels for less (unfortunately learned this AFTER purchasing the FIRE TV) and the channels I specifically got it for (DISNEY for my kids) can't get it without a TV subscription through Infinity, and the whole purpose for getting the FIRE TV was to eliminate cable and the need for a TV cable bill.There are plenty of OLDER movies to watch and the kids are enamored with the game controller (we shall see how long that lasts). Perhaps I was simply confused but I thought that there would be more up to date movies to stream with my AMAZON PRIME subscription. The movies in my recently added to PRIME slot are all from 2003 to maybe 2010.I'll give it some more time and fiddle with it more. Thus far, seriously not overly impressed.", "verified": true, "helpfulness": "1/4", "author": "Best Authoress"}, {"rating": 4.0, "review": "First it's great for streaming Netflix & Amazon Instant Video. There are are two apps that would've given it 5 stars. First it's missing VUDU, it has Flixster but still I prefer VUDU. Second I have a Western Digital My Cloud device hooked up to my home network so an app that would let me access videos stored on that device would be nice. I don't use this to play games because I have a PS4 so I can't comment on that.", "verified": true, "helpfulness": "0/0", "author": "Bones"}]