[{"rating": 5.0, "review": "Fire TV allows us to use our Amazon Prime totally.  We love the ability to rent or veiw all the prime movies plus all the movies we have purchased on our TV.  FIRE TV is great.  Shipped within two days and we were watching on our non SMART TV.We love this", "verified": true, "helpfulness": "0/0", "author": "Evelyn"}, {"rating": 3.0, "review": "Ended up returning this. Unit performed well. The instant streaming was my favorite part. I did not like that prime instant video was not separated into its own category (hopefully updated now or soon). I returned it mainly because I already have devices with the same features (Sony blu ray media player). I simply saw no additional need for this unit. I was hoping for more from it. Perhaps if it included the controller and a headphone outlet on the remote I would have been more likely to hold on to it.Edit: I should have added that not having a standard USB port for external storage support is a major drawback to my using this.", "verified": true, "helpfulness": "0/0", "author": "Brian L."}, {"rating": 5.0, "review": "Easy to install. You can pair it with your other devices and watch what you want on tv. Love it.", "verified": true, "helpfulness": "0/0", "author": "JerseyBroad"}, {"rating": 3.0, "review": "The search based off voice function is convenient and the form factor/size of the device is nice for adding into an already bulky entertainment center but it doesn't offer enough functionality to compete with my primary media center/game hub (PS3). I would definitely consider getting one again for a 2nd TV but not for my primary entertainment device.", "verified": true, "helpfulness": "0/0", "author": "-J242-"}, {"rating": 4.0, "review": "Can Amazon Fire TV work without TV subscription, just using internet", "verified": true, "helpfulness": "0/0", "author": "Melvi"}, {"rating": 5.0, "review": "Such a wonderful little box! Thank you Amazon for FireTV and especially for having the wisdom to let folks bring over other Android-based apps, it truly puts FireTV above the competition with their built-in limitations.FireTV is now the centerpiece of my entertainment center! After buying a Sony device featuring GoogleTV, I was so disappointed that I ran back to the store and asked the salesperson if they sold anything that could actually do what GoogleTV attempts (and fails) to. Well, so the apps available for FireTV don't seem impressive, but they can be if you follow this tip. The real trick with this box is that it is Android based (ironic since my GoogleTV is too out of date for most Android apps to work!), and Android apps, or APKS, meant for other devices will frequently work with this box. Notably, Xfinity ToGo and HBOGo work, as well as scores of others. Getting those apps onto your boxes requires a bit of code-mongering, but if you're lucky you can follow some well written instructions and use the exact code allowing only for changes to your file location. Use the following instructions for installing the XBMC app, for any other APK apps you want. http://wiki.xbmc.org/index.php?title=Amazon_Fire_TV Note: you need to go into the FireTV settings and enable \"developer mode\" to be able to \"sideload\" these apps. And to access them, you'll have to go into the same settings and open that app under \"app settings\" -- it won't show up in your main screen. Additional instructions: http://www.reddit.com/r/fireTV/comments/227gki/howto_sideload_your_own_apps_onto_the_fire_tv/", "verified": true, "helpfulness": "1/1", "author": "Stupid Hamster"}, {"rating": 5.0, "review": "Works well with all of my apps. I like that I can just press the home button and it turns on my TV and my receiver as well. I don't have to worry about using 3 remotes at the same time when I am ready to watch something. Easy to use and install. Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Yolanda Dery"}, {"rating": 5.0, "review": "This thing is great made cutting the over priced cable service allot easier", "verified": true, "helpfulness": "0/0", "author": "CrabAss316"}, {"rating": 4.0, "review": "First of all, the Fire TV is a lot better than the Roku that I had.  So far, I've had no buffering problems with the Fire TV that I did with the Roku.  Of course these Roku problems were with Amazon Instant TV.  I wish Fire TV had more news apps.  However, Fire TV is very user friendly and the talk search feature works very well with Amazon.  I also subscribe to Netflix which is offered as an app with Fire TV.  I wish that Amazon could also add Spirit Clips.  My favorite thing to watch is the old tv shows like Magiver, Bonanza, etc..----with no commercials.", "verified": true, "helpfulness": "0/0", "author": "Shastastan \"Stan\""}, {"rating": 5.0, "review": "It's great. I only hope that at some point they can offer the pay movies for less money.", "verified": true, "helpfulness": "0/0", "author": "Nancy Foster"}]