[{"rating": 1.0, "review": "doesn't work right. Lose picture often. Lose sound often and the words spoken don't match the mouth movement. Out of sync.", "verified": true, "helpfulness": "0/1", "author": "Mia \"Karen L Wright\""}, {"rating": 5.0, "review": "Love the Fire TV.  We never run out of things to watch, and have been able to get rid of our cable!", "verified": true, "helpfulness": "0/1", "author": "Rebecca Marie"}, {"rating": 3.0, "review": "Don't use it as much as Net Flix", "verified": true, "helpfulness": "0/1", "author": "linda joyce"}, {"rating": 5.0, "review": "love love love this can't wait until my current ATT contract expires so it can be my only TV experience", "verified": true, "helpfulness": "0/2", "author": "Mary Cullen"}, {"rating": 5.0, "review": "Love this service! I'm rarely home or awake to watch TV. I only use basic TV service  This entertainment box fits my entertainment life style perfectly.  Rarely need to rent anything", "verified": true, "helpfulness": "0/1", "author": "Joy"}, {"rating": 5.0, "review": "Love this! I can even mirror display my Mac Air laptop to my TV!", "verified": true, "helpfulness": "0/1", "author": "Boston Market"}, {"rating": 5.0, "review": "I'm extremely happy with the Amazon Fire TV... If your TV is not a \"smart\" TV, this is the best $100 purchase you can make.  I guess you could say it makes a \"dumb\" TV a semi-SMART TV.", "verified": true, "helpfulness": "0/1", "author": "Roy M"}, {"rating": 5.0, "review": "I do love my Fire TV! And I'm glad I got the full-sized option rather than the stick.....I want all the performance I can get for the best viewing experience. 802.11 AC wireless speeds means seamless, buffering-free HD. The menus are smooth moving, the voice control works amazingly well, though I wish it were enabled for more apps, like Netflix.", "verified": true, "helpfulness": "0/1", "author": "Keith Zuehlke"}, {"rating": 5.0, "review": "So easy to set up. Streams seamlessly. Easy to use and so fast! Loving it so far!", "verified": true, "helpfulness": "0/1", "author": "Lacey"}, {"rating": 3.0, "review": "From info provided by a friend, I was expecting a much larger sampling of Older movies, 60 thru70's type.  Not much differnce from Netflix.", "verified": true, "helpfulness": "0/1", "author": "Stanley W. Garber"}]