[{"rating": 4.0, "review": "I haven't used very much because I have been busy but so far I am happy with it.", "verified": true, "helpfulness": "0/1", "author": "B L Mayo"}, {"rating": 3.0, "review": "It's okay.  I still need to read the manual to figure out how to properly use the device.", "verified": true, "helpfulness": "0/1", "author": "Becks"}, {"rating": 5.0, "review": "I love my Amazon Fire TV.  I was pleasantly surprised at how well the voice search works.  It is very easy to use.  One thing to remember... when you set it up you are asked to press the play/pause button but you may need to press the home button first.", "verified": true, "helpfulness": "0/0", "author": "Omar Eugene Thompson"}, {"rating": 5.0, "review": "I love being able to have access to do many choices when I want to watch.", "verified": true, "helpfulness": "0/0", "author": "linda schimpf"}, {"rating": 3.0, "review": "All in all I think FireTV is a pretty good product, but it does have a few flaws.Remote control:  - Blue tooth is both good and bad. Good that you do not need line of sight access to box. Bad you cannot use a universal remote. You can supposedly plug in an IR dongle and get your Universal remote to work (I have not tried yet)  - Remote is not back lit!!! Hard to find buttons in the dark  - Remote is too small...yes too small. It is very easy to loose in the couch/bed wherever:)  - Not enough buttons. This is mainly only an issue if you want to run XBMC on it. There are probably other apps that suffer.  - Someone...maybe Amazon should write a remote App for smartphones/tablet that will allow control of the device via WiFi...less interesting would be BT as it would only allow one device to be paired at a time and forces you to turn on BT on your device which drains battery, A Smart Remote App would allow for more controls (i.e. buttons) to be virtually added!! This would remove all of my problems with the remote that ships with the product.A chromecast like feature would be nice as well. So that you could browse for content on your tablet and then sling it to FireTV to be played. I really like that capability on Chromecast.Other Stuff:  - The SN is not printed anywhere on the box!!! Better save the packaging it came in. Because if you need to reset your account, you will need the SN. I suggest putting on a piece of tape and sticking it to the box.  - Second point the box should allow you to login to different accounts. A household can have multiple amazon accounts!!  - Finding Apps is not very intuitive. No way to really search for an App that you may want...you have to scroll through a bunch of different menus to find Apps.The box would be near perfect if there was a decent interface for playing local content(video files on your computer that are network accessable). You can side load XBMC, which is a decent local content viewer, but because it is sideloaded it is a PIA to access. There are some hacks to make this better. But come on Amazon let us put sideloaded apps on the main menu!!You can try Plex for local content, but personally I do not like Plex. It is very buggy and the transcoding causes issues. If your TV does not supports all the formats of your local content (this is mainly an audio statement), then your Plex server will transcode the data which usually results in jittery playback, as well as fast forward and reverse issue and audio sync issues. This has nothing to do with FireTV, but is a statement on Plex.I was hoping for single solution to watch Amazon, Netflix and local content in a single box and Amazon FireTV is almost there!! Maybe they will fix the sideload app issue and hopefully next generation FireTV will contain a better remote and IR interface for Universal remote.", "verified": true, "helpfulness": "1/1", "author": "B2"}, {"rating": 4.0, "review": "Good :)", "verified": true, "helpfulness": "0/1", "author": "C. Guzman \"amoureux de film\""}, {"rating": 4.0, "review": "Works pretty well passes the wife remote testOnly issue is it loses the wifi connection sometimes I suggest a hard wire if possibleMaybe they could add voice recognition to the password fields?", "verified": true, "helpfulness": "0/0", "author": "graberic"}, {"rating": 1.0, "review": "Did not broadcast in Dolby Digital like the box says.  Tried different services such as Netflix and Amazon Home DID and no luck.  Other than that the picture quality was OK and about as good as any streaming video can get.", "verified": false, "helpfulness": "0/3", "author": "Robert Weiner"}, {"rating": 5.0, "review": "I have had quite a few streaming boxes in the past few years, and this is the best. I will be replacing all my rokus by Christmas.", "verified": false, "helpfulness": "0/0", "author": "Mike Harris"}, {"rating": 5.0, "review": "Bettter than most--does what it says-great for the money.Forget chromecast.", "verified": true, "helpfulness": "0/0", "author": "Greg"}]