[{"rating": 3.0, "review": "I'm thinking hard about letting cable go I'm already a prime member, I use it for music and 2 day shipping, I really want to buy fire tv but hubby want ronku 3 cause he can get african channels, please tell me I can get the channels with fire tv", "verified": false, "helpfulness": "0/0", "author": "cheryl"}, {"rating": 4.0, "review": "The Good: Has enough memory and processing power to run Netflix and Amazon streaming content without issue.  Small form factor and remote with excellent voice search.  The Bad:  Malfunctioning less than six months after purchase (locks up and fails to power down automatically).  User has no ability to power down device without unplugging it.Update:  A software update seems to have resolved the issues my device was having and Amazon has also included a way to power down the device by holding down the home button on the remote.  So I'm updating my review to 4 stars.", "verified": true, "helpfulness": "0/2", "author": "Ken"}, {"rating": 5.0, "review": "LOVE it, just need more shows/movies to be Prime, because the ones that aren't prime are pretty expensive.", "verified": true, "helpfulness": "0/0", "author": "Great game!"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Scott Smythe"}, {"rating": 5.0, "review": "Love to use it to watch Netflix and XBMC. Need more memory or expansion capability.", "verified": true, "helpfulness": "0/0", "author": "Kevin Willis"}, {"rating": 2.0, "review": "Fairly lame device. It's very speed, the hardware specs are very impressive. But using the arrows on the remote sucks. It often registers multiple clicks and suddenly I scroll across 5 tiles when I just meant to go 1 tile to the right. The voice search feature does not work with anything except Amazon. If you say \"House of Cards\" into your remote, it takes you to where you can buy it on Amazon Prime, even if you already have Netflix installed, subscribed, and running in the foreground. You can't even watch YouTube or Chromecast to this thing. I was hoping it'd be intuitive enough to get one for my parents. I was not impressed.", "verified": true, "helpfulness": "0/0", "author": "Phillip"}, {"rating": 5.0, "review": "It is the greatest", "verified": true, "helpfulness": "0/0", "author": "yolanda"}, {"rating": 5.0, "review": "Love it. Love Amazon Prime!  I use it to watch movies and some TV series. It beats cable by far and allows me to watch what I want, when I want. I have cancelled my cable TV and saved hundreds of dollars a year. Easy to use, works great. Does what it claims without taking up any room, (mine is mounted to the back of my TV and works great.)  Does everything I need. Highly recommend it.!", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 1.0, "review": "Yeah there are a lot of free movies, tv programs, etc. to choose from but they are SO old. We bought this + Amazon Prime as we wanted to watch current series of our favourite tv programs but no go. Considering cancelling Prime and returning this.", "verified": true, "helpfulness": "1/5", "author": "J.NW \"J.NW\""}, {"rating": 3.0, "review": "Fire TV never powers down... It may take a nap from time to time but per Amazon's request it stays powered on all the time in order to receive continuous software upgrades... Why is it then, when I'm trying to set the mood for my beautiful wife while enjoying some delightful cocktails on the patio with some smooth jazz from Pandora on my Fire TV, the stupid box goes into some software download.Major flaw.Update while you're taking your nap Fire TV...", "verified": true, "helpfulness": "1/1", "author": "John Burns"}]