[{"rating": 4.0, "review": "Don't know if I love this item.  Without benefit of Prime, would it be as useful?  Easy to use tho and set up.  Can it be used as a web browser with internet...will it work with future updates....still on the fence with this.", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 5.0, "review": "I love this product.  A great buy for the entire family!", "verified": true, "helpfulness": "0/0", "author": "Lisa Perez"}, {"rating": 5.0, "review": "The Amazon Fire TV is all that I expected and exceeded some of my expectations. The clarity of the picture is very good on my LCD TV. I bought the Fire TV just before the holidays and became very busy doing the shopping, feasting and other things that take up time during the last quarter of the year. I have two projectors and 14 foot screens and mainly bought the Fire TV to hook up to them. I ordered the digital sound cable to hook up the sound from the Fire TV to my amp. It arrived yesterday and I plan on hooking it up this weekend. If the picture clarity is anything like I get on the LCD TV, I will be very happy with it. The Fire TV loads quickly and I have not had any problems with streaming it. I also have a Roku II and it has worked ok for streaming the video, it does require subscription services from providers and I have some problems with the movies freezing while it picks up the stream from time to time. I have shown the Fire to several of my friends and touted the benefits of owning it over other brands available, which has peeked their interest in getting one for themselves. I will add more information on my experiences with the projectors when I get the time to play with them. I'm sure there are many projector owners interested in the Fire TV that would like to hook it up. The only problem I see now is that I will have to keep unhooking the Fire from the TV which is just below my projection screen in order to hook it up to the projector which is across the room. I wish there were apps for the news shows that are on Cable TV (Fox and CNN etc.) so that I could cancel my cable company, which I guess I can steam from one of my tablets or lap tops to the TV if I get the time to mess with that.", "verified": true, "helpfulness": "0/0", "author": "Terry F"}, {"rating": 4.0, "review": "I am disappointed  with the number of prime movies.  Another bone of contention I have is that just a couple of weeks after I purchased it the price was reduced $20.00. Most retailers would refund the difference, not Amazon.", "verified": true, "helpfulness": "0/0", "author": "Francine Hunt"}, {"rating": 5.0, "review": "My new favorite device!", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 5.0, "review": "Super product! I have one of each now, Apple TV, Ruku, and Fire. If i needed another i would buy the Fire first.", "verified": true, "helpfulness": "0/0", "author": "Denton W Smith"}, {"rating": 2.0, "review": "I would have given it 5 stars if it had an option to stream in SD. I live in a rural community with limited Internet options which puts limits on my monthly data allowance. If you have a small cap on your monthly data this is definitely not for you.", "verified": true, "helpfulness": "0/1", "author": "Ray"}, {"rating": 5.0, "review": "I life love it, I recommend", "verified": true, "helpfulness": "0/0", "author": "Victor Cabrera"}, {"rating": 5.0, "review": "Would highly recommend the Amazon Fire TV.  It was so easy to install by this great-grandmother.  The speaker feature is a real plus, as it makes locating a video so convenient and fast.  Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Carol J Caporali"}, {"rating": 5.0, "review": "Loved it Amazon TV give  you so much options watching  movies TV  shows so much more a must have without the heavy cable billThis is a product every must  purchase ...", "verified": true, "helpfulness": "0/0", "author": "Bri"}]