[{"rating": 3.0, "review": "I enjoyed my trial of the Fire TV, just wish the voice search would work in all spectrums not just searching on amazon.", "verified": true, "helpfulness": "2/2", "author": "Gracy.c"}, {"rating": 5.0, "review": "I received this as a birthday gift.  It was very easy set set up.  Simply attach to the TV via HDMI and plug it in.  It was on instantly.  I registered my Amazon prime account and downloaded the apps for HuluPlus, NetFlix and Youtube.  All of them work very well and start streaming faster than my Sony Blu Ray.  While watching the World Cup game yesterday, my cable lost video for ESPN.  We were receiving audio but no video at all.  I quickly turned on the Fire TV, downloaded the WatchESPN app and had the game streaming in beautiful HD within about a minute.  Great job Amazon.", "verified": true, "helpfulness": "1/1", "author": "J. Stitt"}, {"rating": 3.0, "review": "I think this is good if you don't have cable it satellite TV. Otherwise you have to pay for everything. They say there is free stuff on Amazon Prime but there is very little available. We end up watching Netflix a lot. I wish there was more free stuff available.", "verified": true, "helpfulness": "0/0", "author": "Marie Papachatzis"}, {"rating": 5.0, "review": "This device worked seamlessly with my HDTV and wifi router right out of the box.  I'm a Prime member so it came loaded with my account information and all the shows/movies.  Streams Netflix too.  And YouTube.  All kinds of interesting channels on there, we haven't had time to go through them all yet.  We got rid of everything but barebones cable (just the local channels now!), and we don't miss it even a little bit.  If you can live without the sports channels and you're already an Amazon Prime member, this is the way to go.", "verified": true, "helpfulness": "0/0", "author": "Jennie"}, {"rating": 5.0, "review": "I'm so happy I invested in this new product.  So many more free movies now.  Also belong to Netflix, streaming is a piece of cake.  Don't have to tie up our computers.  Love It.", "verified": true, "helpfulness": "0/0", "author": "Jam \"JAM\""}, {"rating": 3.0, "review": "I returned it because my ROKU picked up the strong WiFi signal much better. The Fire was constantly stopping to load.", "verified": true, "helpfulness": "0/0", "author": "G"}, {"rating": 5.0, "review": "I was asked to participate in a trial of the fire tv so I figured 'why not'?Setup was very simple and although I didnt need it personally, the intro video is pretty good at explaining things. One of the selling points, the voice search function, works near flawlessly, and the whole device is pretty fluid. Some videos would disconnect or have to rebuffer which was annoying but honestly that happens on my smart tv as well so its most likely our connection.The device is very compact which was nice and had a very simplistic type of design. An optical, hdmi, the power connector, ethernet, and usb,...thats it. Remote is very compact and although I did not test the actual amazon game controller out, to really full experience and test the game aspect of it fire tv, some games workes fine using just the remote that the device came with...not all games though.It has all the basics, amazon instant, netflix, flixster, youtube, etc so thats nice. Im not verse enough to say what it doesnt have specifically but it should be good for most users. My only gripe is that the search function via voice inot integrated into most...or maybe any of the apps except for the main ui, and amazon itself. So no voice function for netflix and what not. If there is a way to do it, I did not take the time to figure it out. I tried it, and it just brought me back to the main ui and found the movie through there.Overall fantastic device, and would be a smart option to anyone not wanting to dish out the decent amount of extra money needed when buying a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 3.0, "review": "I would love to have YouTube, WSJ, NBC News and other offerings you can get with Chromecast or Roku.  The Amazon device does the trick, and the voice feature is convenient.  BUT the price is higher than its competitors and it only offers a limited set of channels (Netflix, Hulu, Amazon).  So not the best bang for the buck.", "verified": true, "helpfulness": "0/0", "author": "InTheCloud"}, {"rating": 5.0, "review": "This product does exactly what we need it to do--stream videos from Netflix, Amazon Prime, and Hulu.  We do not game and therefore cannot offer any opinion on that function of the device.  We have had two other streaming devices and tried through Wii,but way too many issues, reboots, re-sets, just too complicated and unreliable.  So far, my wife loves Amazon Fire TV--Happy wife, happy life!! And no damaged remotes!!", "verified": true, "helpfulness": "0/0", "author": "Carl Mincemoyer"}, {"rating": 5.0, "review": "I have had other streaming devices but this one is the best so far. Love how responsive it is, the integration of the voice search with Amazon instant video, and the ability to play games with the remote or the gaming controller.(the gaming controller is definitely worth it!!!) Very happy with what the fire tv can do!!!!", "verified": true, "helpfulness": "0/0", "author": "Elisha Sewell"}]