[{"rating": 5.0, "review": "Love the voice search; it makes it so much easier to find movies etc.Love the small box; it takes up no space at all!", "verified": true, "helpfulness": "1/1", "author": "Diane Keener"}, {"rating": 3.0, "review": "Rated thusly because it is advertised as thousands of pictures at disposal.  True, but many, and usually the ones most desired, are available at a cost from a few dollars to twenty.  Glad to have it, but disappointed as well.", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "I have never had a better user experience with a new product in my life. Truly turn-key -and I feel cool. Awesome!", "verified": true, "helpfulness": "1/1", "author": "Carla Mc Morris \"FleetingStar\""}, {"rating": 4.0, "review": "I've had a few internet interruptions just in the past few days but I don't know if it's the Fire or my internet connection.  Otherwise, I am enjoying this purchase and I was able to connect this and set it up all by myself.  I'm NOT good at that sort of thing, so yeah - this is easy to get up and working.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ToolGal462\""}, {"rating": 1.0, "review": "As a streaming viewer, this unit is on par with Internet-equipped players, Roku units, etc. -- no better and no worse. Problem is, I bought this for its advertised mirroring capability, which would allow one to project whatever one is viewing on the screen of a Kindle HDX to a TV, and it simply does not work. More than an hour spent with Amazon's tech support did not resolve the problem and the tech's conclusion was that my router and/or modem blocked this feature. No real surprise that, when I purchased a Netgear Push2TV, both of my Kindle HDXs mirrored flawlessly. So much for problems with my router or modem...The Netgear unit works great, is easy to set up, and is about half the cost of the Fire TV. If mirroring your Kindle HDX screen is important to you, go with Netgear -- you'll save money and the mirroring capability actually works. If mirroring capability is not important to you, know that the streaming capability of the Fire TV is just about the same as other streaming units I have used.", "verified": true, "helpfulness": "1/4", "author": "R. Hammond"}, {"rating": 3.0, "review": "Been playing with the system for a few weeks now and feel like I have enough time under my belt to make some comments.1. The hardware is quite capable. Truthfully, the demand from video streaming is adequately handled by less powerful devices, so Amazon really did go the extra mile in the raw power department. That should be of some benefit to the game users although I've only done some minor gaming.2. Setup using WiFi connectivity was fast and stable. That's about all I can give you on this. It's as painless as you can get.3. The UI is functional. I'd like to be able to customize (or dare I say it. pin) most used apps rather than have a recent line. Functionally, it may be the same, but recent mixes the Amazon movies and the Non-Amazon apps into a somewhat haphazard pile.4. The Remote. This is the real winner of the package. In this world of over engineered, complicated, multifunction remotes Amazon has nailed the idea of simplicity. Feel, form, and function are perfect here.  A+ to the designers. Hope they get a bonus.5. Voice Search within it's parameters works. Microsoft could learn quite a bit as the Kinect 2 is less effective than this simple function.6. Content Problems: Here's where the problems start.  A. Where's Amazon Cloud Player? That's a common sense addition that should have been part of Day 1.  B. HBO Go is also missing. They have plans to add it, but...  C. Showtime Anytime. It's here, but they don't have an agreement with my provider (DirecTV) to allow me to sign up. So it's useless beyond the free shows.  D. Netflix app is not the most recent, but it's fine.If they can fix these problems, this would be a 5 star product.", "verified": true, "helpfulness": "2/2", "author": "Al Ferreira"}, {"rating": 5.0, "review": "I've had my Amazon Fire TV for about a week now and it's been wonderful for the time period I've had it.  Setup is incredibly easy, just make sure you have an HDMI cord to go with it.  I took the one from my DVD player and its worked perfectly.  Once you turn it on, the on screen setup walks you through step by step and it only takes about 15-20 minutes from the time you open the box till the time you are watching TV.  This will be a replacement for my Comcast cable in the next month as the cost for the cable is just way out of my league anymore.I've played bowling on it with the remote that comes with it.  It's OK.  I'm not sure how many games I'm actually going to be playing on it so I'm really not the person to ask questions about the games.The selection on Prime is getting much better.  If you don't have Amazon Prime, I would get it before buying this because without it, there's really not much (if anything) to watch for free.  I'm also using Netflix on it which doubles my selection of shows and movies to watch.  While the ESPN app is cool, in order to watch anything, you must have a cable provider (which I still do).  After I get rid of the cable though, I'm not sure if that app will even be worth it.The speech recognition is just as good as they show in the commercials.  There is a little bit of a delay from what is shown on TV (they actually note that at the bottom of the screen during the commercial), but it has worked perfectly every time I've used it.Overall, I would recommend Amazon Fire TV as the new way to watch TV and movies at home.Update - June 15, 2014 - I LOVE my Amazon Fire TV.  I honestly use it now more than I use my regular cable.  It was absolutely worth the money.  I've watched a lot of Netflix programming on it and I use the Jillian Michael's workouts that are available through Prime almost every other day.  There's a ton of Prime programs available as well and I haven't even touched the surface on those.  Also, with the availability of old HBO programming, Prime just stepped up its game a lot.  I've also used Pandora through it and that was again, very easy to use.  It's still easy to use and gets easier and easier as the days go on.  The only reason I have not gotten rid of my cable yet is because I have a package deal through Comcast (triple play) and I'm trying to figure out which internet I'll need for all the devices I have in my home already.Update - June 15, 2015 - I didn't realize it has been a year to the day when I last reviewed this, but I am still extremely happy with my Amazon Fire TV.  I finally cancelled my cable after my bill went up to $160/month for Internet and Cable and I've been unable to afford it and unwilling because frankly, that's outrageous.  I've recommended the Amazon Fire TV to many people and I love being able to watch new movies instantly.  The free programming that Amazon provides to Prime Customers is also fabulous and I love that I can use both Netflix and YouTube on it to get even more programming.  The recent addition of HBO GO has been amazing as well and I'm really happy that I purchased this.  It's worth every penny; especially if you can get rid of your cable bill!", "verified": true, "helpfulness": "1/1", "author": "Smoore"}, {"rating": 1.0, "review": "I serve in the United States Air Force and live in Germany. I love streaming services and use a VPN so that I can keep current and still feel connected to American culture. When Hulu cracked down on VPNs I was looking for another service to fill the void. I ordered the Amazon Fire TV and downloaded the app to my iPad in the mean time. Today I received the unit and plugged it in. I tried to update it but none of the other streaming apps would download; only Amazon Instant Video. After I used my iPad on Amazon's site to try and get it I realized that Amazon blocked the access because I use a VPN even though multiple other devices I use in my home do not. Save your money and download the free app! Just another company that doesn't care about the troops.", "verified": true, "helpfulness": "9/15", "author": "Joseph A. Barnes"}, {"rating": 3.0, "review": "Nice device but it has a way to go if going to compete against Roku - no enough contents yet. See little value on the voice activated part, should have gone toward contents instead", "verified": true, "helpfulness": "0/1", "author": "Bob"}, {"rating": 2.0, "review": "I bought this item for my bedroom and was surprised when they didn't include VUDU (like most new Blu-Ray DVD Player offer with the internet apps) It was easy to install but I notice when playing amazon and netflick action movies seem choppy, I even used a wired Ethernet cable (will add a switch/router to see if that helps). But my main gripe is when using the voice search for movies, it only searches amazon movies (and mostly the ones you have to pay for), I have to select recently added to amazon prime for free movies. Not having VUDU is a downer, also because I use my Ultra-Violet account to upload my Blu-Ray DVD's. I would have sent it back, but my return window expired. I would purchase a Blu-Ray DVD player with internet apps (VUDU) before buying this.", "verified": true, "helpfulness": "2/3", "author": "William Goodman"}]