[{"rating": 4.0, "review": "Works really good, I like lots if the shows it has. Some of the movies are buy only and u can't just rent it yet, don't like that.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Hamilton"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Ed LeGault"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "David Cervantes"}, {"rating": 1.0, "review": "Cannot figure out why I bought this!", "verified": true, "helpfulness": "2/16", "author": "Kathleen"}, {"rating": 1.0, "review": "This the first time I rating something with one stare only. Because I purchased this 2 of this fire TV and I can't use them because I am not in USA. Why? I don't know !!!When I contact the customer service they told me that this is their system and they are sorry for that !!!!I need amazon to understand that, and try to solve this problem very soon, to give me and all the customers out the USA to enjoy the Amazon Fire TVThanks", "verified": true, "helpfulness": "1/12", "author": "Khaled268"}, {"rating": 4.0, "review": "Great audio and video quality.  Very cool voice search!  But where are the Apps?Even 5 months after launch, why is there still NO Amazon Fire TV REMOTE CONTROL APP for KINDLE, IOS or Android.If they wrote a good Remote Control app for this that allowed you to navigate all the Menus plus the top menus for each app (Netflix, tunein, Pandora, etc - this would be the best thing since sliced bread.Amazon Software Developers - Please Hurry up with the Remote Control App!", "verified": true, "helpfulness": "0/2", "author": "Melmouth \"Melmouth\""}, {"rating": 4.0, "review": "So far so good. Bought this to replace an Apple TV (old version) that was giving me fits . Love the ease of setting up and finding all the network hook-ups itself. Just a nice experience.  Still having withdrawal from all that the Apple TV could do, but haven't had time to explore this new unit enough to find where they hid all the options/functions. Would give it 5 stars if they actually made it easy to find ALL the options on a single start-up screen like Apple. Hate having to go to multiple screens to get to where what I want.", "verified": true, "helpfulness": "0/2", "author": "E. J. \"EJ\""}, {"rating": 2.0, "review": "Good: Fire TV box is good and responsive. Many apps are there.The BAD :- I purchased it and connected to TV. Worked well and within one week, remote stopped working. Just in couple of days the batteries died.Help desk Service: - Next day I was charged 55$ for digital order purchasing some coins and ad free games. I never did that.I contacted  Help center to cancel that digital order. First 2 times, help center responded that refund was already processed and asked me to follow up with bank. I verified my bank statement and it had no refund. So I asked transaction ID for the refund.  and then only help desk found that refund was not processed. They are now checking with  finance dept.", "verified": true, "helpfulness": "0/3", "author": "PG"}, {"rating": 3.0, "review": "i wasnt aware that 90% of the episodes and movies you have to pay per viewing, that part sucks alot, but the options are avalible", "verified": true, "helpfulness": "2/6", "author": "chris mero"}, {"rating": 2.0, "review": "I returned mine and went back to Roku 3. I was actually surprised that from a processing speed standpoint the Roku 3 outperformed the Fire TV. For example, I constantly experienced buffering that caused annoying streaming interruptions with the Fire TV. I don't experience any of that with my Roku 3.", "verified": true, "helpfulness": "1/3", "author": "Sukihock \"music lover\""}]