[{"rating": 3.0, "review": "I bought this to replace my Roku XS player. I was going to buy the Roku 3 but, decided to buy this instead. All in all it's a nice device.I really like the voice command feature!! My only problem is that I have all my movie on a Pass Port Ultra hard drive. I was able to use the usb port on my old Roku to play my movies. The Amazon Fire TV usb port is non functional for this. I wished they would state that in their advertising! I assumed since they advertise it as having a 2.0 usb port that it'll work for connecting drives to it. I ended up returning this and getting the Roku 3. Now I am able to watch my movies again!", "verified": true, "helpfulness": "2/2", "author": "mikeg"}, {"rating": 5.0, "review": "Video is simple incredible. Wish my Roku video was as good.", "verified": true, "helpfulness": "0/0", "author": "Todd Cochrane"}, {"rating": 5.0, "review": "To start I purchased this product for my father who would like to consider himself a \"technical expert.\" To be honest he can be clever at times but for the sake of this review he is a child. Upon leaving him with this device his much younger wife (my step-mother) walked him through the basics of what the device does. She started with Netflix, Hulu, & Prime and by the time she finished he understood the product as a cable-box replacement. I quote, \"I am cancelling my cable service and I am only using my Fire TV.\" It has now been over a month and he is happier than can be with his new Amazon Fire TV & now that I have had some time with the device myself I felt compelled to write this review.Now I don't just consider myself a \"technical expert\" it happens to be my job. I would like to give a little device history as to what I have used in comparison to this device. It all started during what I like to call the bearshare & frostwire age of technology, where I first discovered what price per Gig really meant. Of course all true technologists want large amounts of local data to impress their friends with when they come over so naturally I have used programs like XBMC, Plex, and GeexBox well before companies started developing and marketing products whose backbone stemmed from these simple software's. I then moved to plugging in and exchanging large TB HDD's into my Xbox 360 which lasted me almost 2 years until I found Playstation Media server which happened to be one of my most favorite ways to watch Movies and TV.Then came the Roku I purchased for my friend which I in turn considered for purchase but ultimately decided against it when I had to deal with their customer service. Next was the Google Chromecast which happens to be my favorite niche device that I currently deter anyone over the age of 30 from using (something about not having a remote and trying to teach elderly about the magical WiFi fairy and what their smartphone can and cannot do has exhausted me.) The Chromecast in every aspect is the ultimate device in design in functionality and I cannot wait to see what Google comes up with next. Finally we have Smart TV's, PS4, and the Xbox One all of which can access netflix... yay *fades quickly*. So basically if you are reading this review and feel like we have some technological connection then you probably are my age and want to know what is so great about this product and how is it different from any other various device out there.Simply put the device is no different from any other device out there whatsoever! Except for this little gem - this device is fool proof, elderly proof, child proof, ignorant proof, and most of all you proof. The design is simple, the remote is simple. the UI (user interface) is simple, the voice control is simple, the use of applications are simple. Quite simply put the device is so SIMPLE to use. No midnight phone calls from my dad asking me where can I get the movie Alien for free. No misspelled zero punctuation text messages sent to me early in the morning asking me to come over and \"fix this broken device\" with offerings of pastries and dairy products. No more, no more, no more. And best of all if anything goes wrong my step-mother knows how to dial Amazon's 10 digit rescue line and bother them with these never-ending questions.Currently there are a million adjectives floating around in my head and a million more praises I have for this device but if you already own another device that \"does what this device does\" then no need to spend $99. But if you are in the market and are looking for a way to turn your $400 50\" plasma TV into a truly smart TV then this is the device for you. DO A BARREL ROLL!", "verified": true, "helpfulness": "0/1", "author": "starfoxed64"}, {"rating": 1.0, "review": "Not worth the money.", "verified": true, "helpfulness": "0/9", "author": "Diana \"DA\""}, {"rating": 5.0, "review": "Up front, I have never used a Roku, Apple TV or similar box. I was doing my streaming using a \"smart\" Samsung LED television. I had poor resolution and frequent \"blackouts\" while viewing shows on Netflix, which was annoying as I have very fast internet via Verizon Fios. Also, the Amazon Prime app was unavailable from the Samsung store, at least for my model. Fire TV was not only made to maximize the Prime experience (I was already a member), but it solved all of the resolution and latency issues I was experiencing. From that standpoint I have to give Fire TV the highest rating, as it made me and mine very happy. The voice recognition search for Prime is very handy, I wish I could use it in the other apps. I haven't taken advantage of the games available for Fire TV, as I have a separate room and TV for game playing and I don't want those that love games to start competing with me for the main TV. All in all I am very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "paz_morada"}, {"rating": 3.0, "review": "It's an OK device, but if you're used to Roku or even Xbox interface, you'd be feeling really uncomfortable with the Amazon Fire TV interface.Second problem is that there is no easy way to filter out only Prime movies or shows, you can't just say I want sci-fi that is on prime - nope, you've got to browse through the whole list and squint for the small line in the upper left corner to see whether it says Prime or New or something else.Also, you can't use your phone as a remote. If you loose your remote, it's $29 + tax.Forget about the search, if you have accent.Otherwise the device has great specs, looks really nice. Remote control, is OK, it takes a while to get used to the controls.I ended up returning my device, even though I had $20 discount and had to pay for shipping back. $80 (99 - $20 + tax - shipping $6 was my refund) vs 97 + tax for a roku 3 - I chose the Roku.", "verified": true, "helpfulness": "1/1", "author": "Nick 19 \"nick_19\""}, {"rating": 5.0, "review": "For what it is, just about everything is right with the Amazon Fire TV.  The remote, which does NOT require line of sight access to the box, is by far the easiest of any I have ever used in the past, and I'm not exaggerating.  The responsiveness to commands is superb.  Only quibble is that as an Amazon Prime member, I have a couple of additional clicks to get to the point where I can watch the free videos through my Amazon Prime account.  This should be shown right on the first click, with the pay options.  Other than that -- not a single complaint.", "verified": true, "helpfulness": "0/0", "author": "JPWMoparMan"}, {"rating": 2.0, "review": "While a very responsive device, the Kindle Fire served no additional benefit to my Smart TV. Beautiful quality and clarity (or is that just my TV?). All in all a great investment for those that are super picky about picture quality but redundant for those with Smart Tvs", "verified": true, "helpfulness": "1/3", "author": "Vanessa"}, {"rating": 3.0, "review": "We are big Korean drama fans. If Amazon adds Drama Fever, K Drama and Crunchy Roll, it would be 10 stars!!", "verified": false, "helpfulness": "0/1", "author": "Ronald A. Homan"}, {"rating": 5.0, "review": "I bought this for my enjoyment and my grandchildren.  They love it as do I.", "verified": true, "helpfulness": "0/1", "author": "Julie A. Murphy \"Camera Hound\""}]