[{"rating": 5.0, "review": "The price is excellent, easy setup and easy internet interface.  With Prime I can watch many moves and television series for no additional charge.", "verified": true, "helpfulness": "0/0", "author": "Thomas R. Taylor \"Tom T\""}, {"rating": 5.0, "review": "really cool the way it works. Not sure about the amazon fire TV yet. Son is using it in the garage for his entertainment.", "verified": true, "helpfulness": "0/2", "author": "Kenny Rodgers"}, {"rating": 5.0, "review": "First it has Amazon Prime, big deal to me. The remote has voice search. If you have ever tried to search for a show my inputting letter on a scroll wheel, this will be a God send. It picked up and learned my voice almost immediately. Can't tell you what a time-saver this is. Plus the remote is study. I have an Apple TV, and that remote is worthless.I wish though we could take the best of the navigation of Netflix, Apple TV, and Amazon and combine them. All three have functionality that drives me crazy. The days of Blu Ray are coming to an end. For $99, well worth the investment.", "verified": true, "helpfulness": "0/0", "author": "Paul B. Beaulieu \"Chef Paul\""}, {"rating": 5.0, "review": "A gift to my daughter who loves it! She says it is easy to use and a great product is very happy,with it.", "verified": true, "helpfulness": "0/0", "author": "Virginia"}, {"rating": 5.0, "review": "I bought this recently and absolutely love it. It was a piece of cake to set up and the voice search works really well. I have a smart TV and could do many of the same things already, but I much prefer the easy use of the Kindle Fire TV. I highly recommend this for everyone, as I think cable is a ridiculous waste of money.The one thing I wish they would fix, is the ability to run apps in the background and toggle between them. When listening to Pandora, it would be nice to be able to browse movies, etc...This isn't a feature I have seen on any of the competitors either, but I do think it would be cool.", "verified": true, "helpfulness": "0/0", "author": "Kurtis Lind"}, {"rating": 4.0, "review": "Great little Box.I initially was hesitant to purchase this due to a variety of factors.1) My house is nearly all Mac products, from our phones, computers to my routers.2) I wanted to see what Apples’ response would be to the Fire TV.Here are the reasons why I decided to purchase the Fire TV.1) Hardware kicks butt, this thing flies.2) I truly doubt the Apple TV will ever support Amazon Prime3) I purposely bought a non Smart TV so I could buy a better TV box option and this fits the bill perfectly.I understand true Apple fanatics will say you can Airplay over the Apple TV for Amazon Prime, to them I say why the hell should I have to.I also purchased the Fire TV for the Plex app, which currently isn’t available without a massive headache on the Apple TV. I am currently using an Intel NUC as my Plex Media Server.My hands on assessment:Simple to setup, after plugging in the Fire TV it updated the software, I went through the walk through and it was pretty simple.Pros:Simple setup and easy to use.Small footprint, it is small and discrete.Bluetooth Remote allows for almost flawless input via the remote.Cons:I wish the voice search had other functions, like searching your app, or being able to launch a specific app.Non usable USB port: hopefully this will addressed in future updates, it would be nice to add an external HDD to the Fire TV.Near Deal Killer in favor of Apple TV.The FireTV does not work without an Internet Connection.I wish that I could still use it to access my Plex Media Server when my Internet is down, because my server and NAS are on my home network.I do not play games, but I imagine this is a hindrance for those who have purchased games for the FireTV.The biggest trump card the Apple TV have over the Fire TV is the ability to download your iTunes content and watch it later with or WITHOUT an internet connection. This is something the Fire TV can not do. Apple TV is still the winner in this case.", "verified": true, "helpfulness": "2/2", "author": "OliverT"}, {"rating": 5.0, "review": "I only have basic cable but have belonged to Netflix (dvds) for years and wanted the ability to stream without paying $100 a month to the cable company.  Although I did have to update my modem, the Amazon Fire works like a dream.", "verified": true, "helpfulness": "0/0", "author": "Shelby33"}, {"rating": 5.0, "review": "So far this product has been an asset to my leisure time.  It was surprisingly easy to set up, & the voice activation is amazingly smooth.  I do wish that Prime offered just a bit more in the amount of free movie selections.  Overall, I am totally pleased and glad that I bought it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "But, besides that what more do you want?This thing is fast, sleek, and all the specs speak for themselves. I have a Roku, AppleTV and FireTV and yes I like them all but I think my favorite is the Fire. I know and Amazon knows there are tweaks to be done, but this thing still has balls of fire to take over the other streamers and will most likely in the near future. Forget all the comparisons and technical blaaaaa, If you have a strong network, than this device is a performer.You want to get burned?...Get FireTV!!!", "verified": true, "helpfulness": "2/2", "author": "I 'am Post It \"Buyer\""}, {"rating": 5.0, "review": "Setting up my Fire TV was so simple! The one question I had about the Basic Tips video was quickly answered by excellent tech support and was resolved with a quick and easy software update download. I do not have super fast internet so was concerned that my modem would not transmit strongly enough through my big house from office to media room, but I'm pulling an excellent signal and have no problems with audio lag.The small footprint of this little booger allowed placement into my entertainment console and it looks pretty cute!There are so many good films and TV programs from which to choose, and speaking to the search mike on the remote brought up British detective programs of multiple seasons I'd missed (Helen Mirren).We are over-the-top happy with the Fire TV and will set up date nights for fun right here at home!**A discovery: just concluded listening to one of my favorite radio programs- \"Key Life\"- and its teacher, Steve Brown. I did this using Tune-In Radio, which streams effortlessly on my Fire. The inspiration kicked in as I viewed the glorious nature photos of the screensaver while I listened to the excellent teaching. This is a new \"wow\" factor for me!", "verified": true, "helpfulness": "0/0", "author": "K. Kurtz \"seen the light of day\""}]