[{"rating": 3.0, "review": "I prefer the Apple TV", "verified": true, "helpfulness": "0/0", "author": "Deanna M Brogan"}, {"rating": 5.0, "review": "Great product.  Easy to install, easy to use .Solved my going around and around trying to figure out how to stream Netflix.  My wife keeps thanking me for buying it.  FYI, Netflix has a ton of great series that are free.  Prime TV doesn't.", "verified": true, "helpfulness": "0/0", "author": "steve"}, {"rating": 4.0, "review": "Handy gadget to access a multitude of internet sites, but it is mainly used to sell, sell, sell. Every site has a price tag. But the Fire TV can get you to thousands of channels in a second. Just how much do you want to pay to actually view the entertainment?", "verified": true, "helpfulness": "0/0", "author": "Rocky B."}, {"rating": 5.0, "review": "Amazing best ever!!!!", "verified": true, "helpfulness": "0/0", "author": "Alan"}, {"rating": 3.0, "review": "I have joy all the free movies", "verified": true, "helpfulness": "0/0", "author": "prince"}, {"rating": 5.0, "review": "I bought Amazon Fire tv because of my Amazon Prime membership. I have watched movies, music videos and played games. Am going to be down with back surgery and looking forward to having entertainment options available.Thinking of downsizing my cable menu. Very pleased with product. It was delivered day earlier than promised. Amazon rocks!", "verified": true, "helpfulness": "0/0", "author": "Ronald Hanson"}, {"rating": 5.0, "review": "Wish the remote was less easy to lose however love it so far!", "verified": true, "helpfulness": "0/0", "author": "Ryan Teeter"}, {"rating": 5.0, "review": "Loves", "verified": true, "helpfulness": "0/0", "author": "Nyleen"}, {"rating": 5.0, "review": "Very happy with its functionality. The interface is very intuitive and easy to use. The voice search is surprisingly accurate too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I bought an Amazon Fire TV to replace a western digital tv live.  THE AFTV is much faster, much more user friendly and has many more features.I frequently use Plex.  Initially, HD playback was spotty in Plex, but it's perfect after enabling the experimental player in the Plex options.Please release an android app remote control app, so I don't need to have the remote control!  This is the only thing holding me back from giving 5 starts.", "verified": false, "helpfulness": "0/0", "author": "Ryan"}]