[{"rating": 2.0, "review": "My grandson has one and it works all for him; however, did not work on my tv's; maybe it's my tv set up.  We spent many hours trying to figure out how to make the. Connection between fire and tv, no luck, did ' want to pay for specialist.", "verified": true, "helpfulness": "1/5", "author": "Regina 617"}, {"rating": 5.0, "review": "I've used Roku for a long time, but when the current box I have needed to be replaced, I decided to try Fire TV and am very glad that I did! It is better in every way and I enjoy being able to play some of the light game APPs with a controller.", "verified": true, "helpfulness": "0/0", "author": "Lulu"}, {"rating": 5.0, "review": "I  am 81 years old and not to swift on all these new things but I found it easy to access the program. Now I need to find all the good programs that are available,I did open My account with Pandora and enjoyed the music while reading on my kindle..", "verified": true, "helpfulness": "2/2", "author": "Otto"}, {"rating": 1.0, "review": "Come on really?", "verified": false, "helpfulness": "2/15", "author": "RussellRuss"}, {"rating": 5.0, "review": "Great buy, wealth of content.  Additional perks (i.e. free shipping) made this purchase a very ease decision.", "verified": true, "helpfulness": "1/1", "author": "Anthony Woods"}, {"rating": 5.0, "review": "We purchased Chromecast for the bedroom and Amazon Fire TV for the Den (where we watch TV).  We like the Amazon Fire TV so much we plan to get another one for the bedroom and move the Chromecast to the living room. We have a home theater system with a hub, but Amazon Fire TV's interface is so much easier to use and what you get from Amazon Prime made cutting the cable cord painless.", "verified": true, "helpfulness": "0/0", "author": "Eva"}, {"rating": 5.0, "review": "I'm totally enjoying my Amazon fire", "verified": true, "helpfulness": "0/0", "author": "carla thomas"}, {"rating": 5.0, "review": "We love it.  It works great.  I first bought an Apple TV that seemed to always be buffering.  My 4 year old son learned the word buffering from owning the AppleTV.  The Amazon Fire TV works great.  Rarely does it ever buffer or anything unless I'm having internet issues (which would be expected).  My only complaint is the voice search doesn't search within apps.  Apple TV's interface is also potentially a touch more user friendly but Fire TV's interface is easy enough.", "verified": true, "helpfulness": "0/0", "author": "AMZN Shopper"}, {"rating": 5.0, "review": "I LOVE THIS!!", "verified": true, "helpfulness": "0/0", "author": "Shawn Raiford \"Shawn Raiford\""}, {"rating": 5.0, "review": "Works very well. Easy to use. Like it", "verified": true, "helpfulness": "0/0", "author": "squeek \"zebra217\""}]