[{"rating": 2.0, "review": "Okay I'm going to draw some hate fire here, but I found it just okay. The box is awesome looks sleek and cool, the remote is awesome as well.It's nice to finally be able to navigate Amazon prime like a human being and be able to find shows. As a matter of fact it allowed me to watch one or two series that have been since cancel that I found interesting that I didn't even know existed. I watched him with my grandmother when she came out to visit me and it was great.However I'm a computer guy and remote really don't interest me as a matter of fact I have a computer hooked to the TV that I used Amazon fire for. The Amazon firebox was just my grandmother's ease-of-use, and I think that my grandmother would had a easier time if I just yet let her use the computer itself that's up to the TV.So that's why it had to go back.I love Amazon. But Amazon prime still has the worst TV shows ever.I mean who wants to see Roots: The forgotten years?", "verified": true, "helpfulness": "3/5", "author": "Jayson Graves"}, {"rating": 3.0, "review": "Until, today, it worked great.  However, it came up stating it could not connect to the servers and an 'unexpected/critical error' had occurred.  Now, it will not reload and it gets stuck on the main screen.  Help desk will take 12-24 hours to get back to me, no help telephonically from reps.  Appears they're out of stock, which seems odd, all of a sudden.", "verified": true, "helpfulness": "0/0", "author": "M. Rice"}, {"rating": 1.0, "review": "The certified refurbished FireTV I received would not boot up past the white Amazon logo. After being on the phone with tech support for over an hour they are sending me a new one. I have a FireTV box that I bought new last year and a FireTV stick that both worked perfectly out of the box. Be careful with these refurbished units as Amazon clearly did not test the one they sent me before I received it.", "verified": true, "helpfulness": "1/1", "author": "David Moshe"}, {"rating": 2.0, "review": "Product seems to run out of resources within a week's time. Apps stop working properly and it requires a reboot to resume normal operations. It shouldn't be like this.", "verified": true, "helpfulness": "0/2", "author": "Brian"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "MDPCDOC"}, {"rating": 1.0, "review": "when u try to set up account with credit card, the screne comes back and says please put in month of credit card over and over going to return to store. wont let u create an account. amazon prime does not give u a way to cancel membership before thirty days up.", "verified": false, "helpfulness": "0/0", "author": "Norman"}, {"rating": 5.0, "review": "It is fast and fluid and lives up to every aspect of the description. This technology has a great future.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Taylor"}, {"rating": 4.0, "review": "Very good.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"I'm 72 and a retired Army lifer.  I learned to love reading from my brother-in-law's mother when I was 11. I thank her everyday.\""}, {"rating": 5.0, "review": "This is the best thing since cable TV.  Pay for Internet, Google AFTV, and cancel cable.", "verified": true, "helpfulness": "0/0", "author": "Richard Persek"}, {"rating": 5.0, "review": "Great product! I love the Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Octavia Shields"}]