[{"rating": 5.0, "review": "I love it. Got rid of all movie stations from my able company. Saving a ton of money!", "verified": true, "helpfulness": "0/0", "author": "Louise Fox"}, {"rating": 2.0, "review": "Worked for awhile, actually quite well,  then  suddenly remote will not communicate with the box.  Will ask about return.it is 6 weeks old and has been used 4-5 times.  May not be ready for prime time. I will stick to mygoogle chrome and Apple TV.  They continue to work for me without fail.", "verified": true, "helpfulness": "0/2", "author": "Randallje"}, {"rating": 4.0, "review": "Some times it seems be freeze otherwise okay. Used only 3 days so far.", "verified": true, "helpfulness": "0/0", "author": "Alam Jahangir"}, {"rating": 5.0, "review": "I love the Fire! I also have a Roku and have used the Apple TV but there's just something classier about the Fire TV hardware and software. Now that HBO GO is on the Fire TV there's really no reason to choose anything else in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Mark MC \"Riff Merchant\""}, {"rating": 5.0, "review": "Love it. More please.", "verified": true, "helpfulness": "0/0", "author": "jim thompson"}, {"rating": 1.0, "review": "Crap!! Dont order! did not come with remote like picture or described!!", "verified": true, "helpfulness": "1/4", "author": "Christine Champagne"}, {"rating": 5.0, "review": "I absolutely love it!  I can catch up on many TV shows like Justified and The Americans without paying anything extra.  Movie selection is pretty good.  I love accessing my Netflix as well.  I highly recommend it for anyone who is a fan of a series show or movie buff.  The music playlists are very diverse.  We enjoy them on weekends.", "verified": true, "helpfulness": "0/0", "author": "Jo P."}, {"rating": 5.0, "review": "Better than Apple!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Carollynn Bayles"}, {"rating": 5.0, "review": "Do you need internet", "verified": false, "helpfulness": "0/0", "author": "LaDonnia"}, {"rating": 5.0, "review": "The AMAZON FIRE is the fastest and easiest to set up TV programming device ever made. And, if you are a PRIME MEMBER already registered with AMAZON - it will be \"PRE-PROGRAMMED\" the first minute you connect it to your TV and turn it on with your personal information - like MAGIC!", "verified": true, "helpfulness": "0/0", "author": "Randy C. (A Fellow Countryman)"}]