[{"rating": 5.0, "review": "my experience with the Amazin Fire has been amazing. The clarity, and capabilities are awesome. I noticed the Fire has also fixed the reception concerning my general TV channels. The Fire remote app for your phone is a great touch as well.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "Everything its cracked up to be and more.  It really is a great device and I highly recommend it over the outdated and lagging apps which come with other units (e.g., dvd players, etc.).  Buy one, you won't look back again.", "verified": true, "helpfulness": "0/0", "author": "Lyle LaBonte"}, {"rating": 3.0, "review": "Fire TV is good for games (for a set top streaming box) compared to Apple TV and Roku, but its key feature (voice search) is overrated.  It works well for Amazon content, but can't be used for other content.  Also, some of the apps are still sketchy regarding Fire TV compatibility, even those with native Android support.  For gaming, and speed of searching I would give this a 4 with a chance for 5 stars in the next iteration or two.  However, for searching I would go with either Apple TV or Roku.  For agnostic support, Roku for sure, for iTunes lovers then Apple TV.", "verified": true, "helpfulness": "0/1", "author": "Moondeep"}, {"rating": 4.0, "review": "I bought these for my daughters. They do like the Amazon TV.  My one daughter had amazon prime and the other plans to get it to enhance her TV experience  I was a little disappointed that I paid $99 for it and saw it a few days later for $79.", "verified": true, "helpfulness": "0/0", "author": "Jackie S. Thomas"}, {"rating": 5.0, "review": "Love it! Still so much to learn.", "verified": true, "helpfulness": "0/0", "author": "Richard K. Enos"}, {"rating": 2.0, "review": "I am SO disappointed in this device.  I've only used it for two days but I've had audio drop-out problems and the interface is terrible.  The icons for apps take up the entire screen so you have one or two big blocks (say netflix and hulu) on your screen and you have to scroll to see the other icons.  The interface is clunky at best.  The voice control gets all messed up if you say \"play star trek...\" instead of \"star trek...\"It only allows the game controller to be added via bluetooth.  I can not add a bluetooth keyboard or headset.  This is a problem since there are lots of search fields in non-Amazon apps that you have to use the arrows to select letters.  Also entering user id's and passwords gets cumbersome and each app, of course, wants it's own login info.There's also a lack of consistency between the apps.  Different options and ways of doing things.  It really feels like it was thrown together by several departments that didn't really communicate at all.I have an existing AppleTV and it's so much more reliable, configurable, searchable than the AmazonTV.  AppleTV is not near as fast as the AmazonTV in doing anything but simply having a big processor won't compensate for not being able to do anything with it.I'm sure there are better things in this device; however, my experience in the first day of ownership was really disappointing and I am not going any further.  I'm going to return it for a refund.", "verified": true, "helpfulness": "0/2", "author": "C. Barker \"Saddle Bear\""}, {"rating": 1.0, "review": "I don't know how many stars to give this. I just plugged it in and found that although the Fire supports HBO and Showtime. It appears my cable provider Charter doesn't support Fire. In addition to listing the networks it supports Amazon should list the supported providers.I bought it specifically to get Showtime, which my older Roku doesn't support. So it has to go back.I'm bummed because the rest of it looks great.", "verified": true, "helpfulness": "1/4", "author": "Michael JP"}, {"rating": 4.0, "review": "As others have said, this needs an update to be able to use an external hard drive/ memory expansion without rooting and destroying the device. Vulkano apk sideloaded does not work with this device. :( Kodi is awesome as it lets you browse your pc's media and plays media via wifi almost flawlessly with a good quality picture.", "verified": true, "helpfulness": "0/0", "author": "Gfry"}, {"rating": 1.0, "review": "Wife signed up for prime trial to get free shipping over holidays.  Having discovery and scifi content in the catalog was enough to keep it so bought a fire tv box since can't use our perfectly fine Apple TV (yeah another box).  First fire tv purchased, the remote was so bad could barely navigate to get connected, buttons sticking and or reading multiple presses then various lag in navigation GUI as well.  Trying to sort through interface to see instant content to stream was a joke buried under a steaming pile of crud being shoved down your throat.  We don't buy movies and certainly have no intention of buying individual tv shows.  Anyhow, via ipad finally got favorites identified as interface better in the app and could add to favorites.  Now fast forward, exchanged fire tv for another, remote much better out of the box it actually worked... well for a few hours anyways before just as bad as other...  Using Amazons ipad remote app was far better but tired of the pos hardware that came with it... second one returned and guess what, didn't come home with a third!  So disappointed, we went back to using airplay because that honestly kicked fire tvs arse up one side and down the other.  We did end up hanging on prime (wife's choice, I wouldn't have) so airplay it is.  I watch most tv on my laptop anyhow so let's get the Win8 app for it... seriously, prime isn't available in the windows app store either?  You have to be flipping kidding me I have to navigate a web browser on my surface pro or download some hobbiest programmers MCE plugin and pray it works and isn't some type of trojan?  Prime is almost as immature as fire tv, the ecosystem is a joke... a joke on me, as the consumer.", "verified": false, "helpfulness": "1/5", "author": "Jason Jozwiak"}, {"rating": 5.0, "review": "It's amazing at finding any shows or movies that I want to watch. The only thing I don't know how to do is turn it off, but I laugh hysterically when it writes on my tv \"how do I turn this amazing thing off, turn off, power off, stop!!!!", "verified": true, "helpfulness": "0/0", "author": "IlahS"}]