[{"rating": 5.0, "review": "Amazing device!I bought a FireTV in Canada as my \"cable-cutting\" family TV device, and so far I am very happy.It runs Netflix, YouTube, Twitch & XBMC flawlessly, allowing easy access to all my streamed & ripped media.  I can access Netflix (Canada) without any special US proxy or VPN.My family loves that we can switch between APIs using a single easy to use remote.Picture quality is great and my customized XBMC interface is slick and easy to use.This IS the device I've been looking for.  A single interface to access streaming & ripped media, regardless of source.Only downsides are that live TV can be interlaced (assuming you record live TV somehow), and lack of a volume control on yhr remote.Oh, and start selling these in Canada!", "verified": true, "helpfulness": "0/0", "author": "Murray Gill"}, {"rating": 5.0, "review": "The Amazon Fire TV setup was flawless! It took a few short minutes to begin watching Prime movies. I love it! I purchased a Chromecast and returned it because it was impossible to setup. This was truly a great buy.", "verified": true, "helpfulness": "0/0", "author": "Loren"}, {"rating": 3.0, "review": "Does not have the variety of apps like the roku. Showtime anytime is not free like the roku even with a paid subscription. Overall it is good but not quite what I thought it should be or could be.", "verified": false, "helpfulness": "1/1", "author": "Fred Bush"}, {"rating": 5.0, "review": "Very easy to setup, use, with great access to media, games and amazon library.purchased second unit for bedroom.", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 4.0, "review": "It needs to support HBO2GO before I give it 5 stars.Also, this is a great TRAVEL item..  it is SMALL And you can hookup to HDTV w/ HDMI in hotel and watch your netflix and such!", "verified": true, "helpfulness": "1/1", "author": "taverentech"}, {"rating": 5.0, "review": "So simple to set up, no hassles. Took my non smart tv to a new level!", "verified": true, "helpfulness": "0/0", "author": "lisa fears"}, {"rating": 4.0, "review": "Update 06/2015:After a month I actually cancelled my Hulu since it couldn't get it work on my Fire TV any longer (see first review). I was just using it for Netflix and Instant Prime. Then Netflix started to go downhill about three months ago. Last month it got better but still had sporadic interference where it would stop mid-show and begin loading again. Never had HD, picture was always blurry and would skip sometimes. Get stuck at 25% loading (thats where it always does) and then sometimes fail out completely and I'd have to reload the app. I used this less and less until recent. I'm on bed rest while pregnant and need some entertainment.Last night was the worst. I spent an hour fighting to watch a single 45 minute episode of a show on Netflix. An entire hour of attempting to watch ONE episode. I was barely half way through it. I had watched MORE loading screens and program fails than I had actual show. And finally, it wouldn't load netflix at all. It just errored continuously. I had been using it wirelessly because our modem is in another room (900 sq ft home, should be no interference between these two close rooms). Well I gave up and ran a ridiculously long ethernet cord to plug the fire tv in direct. The error screen vanished, Netflix loaded flawlessly, I had HD viewing for the first time in months, and suddenly I was able to watch three episodes without a single fail before I went to bed.So I felt bad about my original review, thinking it was perhaps the horrible wireless offered with the fire tv. I put Hulu back on the fire tv to test it out (forgetting that it also fails in one of my other devices already wired). It still wouldn't work and had the same issues as prior. So for that reason and the fact the wireless is awful in my particular device, I am not giving this review back that 1 star. However I wanted to update for those who are struggling with it themselves or potential buyers who only use Hulu or a wireless connection so they can consider these things. I know its not my internet connection. I have a 123-125 Mbps that does not falter, experience setting up routing within my hardware, and I have numerous other wireless devices in my home that have no issue keeping connection (including those running the same apps). So Amazon needs a better wireless signal in this device and Hulu needs to update their app. For now I can enjoy the few apps on it that I like most, as long as I leave it wired. Though I have a feeling I'll replace it later on since I can't drill holes here and don't want a cord that long running through my house.Original 12/2014:I'm not giving this five stars for a reason.Doesn't matter if its not Amazon Fire TV's problem or not. The problem is I watch Netflix, Hulu, and Amazon Prime instead of having a cable subscription. So I had a Roku originally, but Netflix and Hulu kept messing up on it. They would time out, they would freeze, they would have to buffer 5,000 times.So I bought one of these. Its so much better than the Roku. Netflix works smooth, Prime is beautiful, and Hulu is the reason it loses 1 star. Now as I said, this might be Hulu's fault since its their app... but Amazon is the one offering that app on their device. If it doesn't work well, they need to do something. And Hulu really doesn't work well. It was WORSE on the Roku, but its still pretty bad. On the Roku when it would buffer and get stuck, or freeze it would be a lengthy process to get the episode back on. Plus sometimes it wouldn't work at all. With the Fire TV it at least starts to buffer and puts it right back on. There are times though when the video freezes but the sound continues. The only way to fix it is to go home, then go back to the program and turn the episode back on. Imagine doing this 11 times in a 2 minute span of an episode. Yeah, thanks Hulu.Amazon Fire TV would be perfect if they could get a flawlessly working Hulu app (or at least one that would let you watch ONE episode without interruption).Its a great device. The menu is easy. It has an intro to setup. It all runs smoothly. I'm really happy I bought this in the long run. But for the love of Hulu someone do something please so I can watch it on this device instead of always having to turn on my computer instead :/", "verified": true, "helpfulness": "0/0", "author": "Confessions of a Shopaholic"}, {"rating": 2.0, "review": "Satisfactory but certainly not extraordinary", "verified": true, "helpfulness": "0/3", "author": "george aronoff"}, {"rating": 3.0, "review": "The voice search is nice (although my husband struggles with it because he has an accent so it doesn't always understand him). But the biggest bummer is that almost everything we want to watch is NOT on prime- meaning it all has to be payed for, most of the shows are $3 per episode, which could get really expensive. I wish it had more content in PRIME... paying $100 for the fire tv, then $100 a yr for prime... I think I should get a little more for my money, not be asked to pay even more for every episode i want to watch. I might have been better off just sticking to watching netflix through my wii.", "verified": true, "helpfulness": "1/1", "author": "MsW"}, {"rating": 4.0, "review": "Streams flawlessly, voice search 10/10,The \"gaming\" aspect is pretty weak despite what they promise; a bunch of freemium apps from the android marketplace really, many designed for touchscreen so good luck with that :)It also grabbed all the photos from my phone which was pretty embarrassing when my mother was trying to navigate the menus, which were also apparently developed with touchscreens in mind... am I the only one w/o a touchscreen tv?? Anyway, probably my fault or just another horrible feature on my latest mistake: the fire phone.", "verified": true, "helpfulness": "0/1", "author": "Derek"}]