[{"rating": 5.0, "review": "I love it, it's way better than Chrome cast. So much easier to work with and I like how it's voice activated", "verified": true, "helpfulness": "0/0", "author": "Aricha Baker"}, {"rating": 5.0, "review": "I love my Fire TV. It was very easy to set up and enjoy.I even enjoy the screen savers. When I need to relax they are the perfect thing to watch. Thanks amazon", "verified": true, "helpfulness": "1/2", "author": "gladfox"}, {"rating": 5.0, "review": "Simply awesome !!! Fast easy to use for everyone in the family .  The voice controls are very accurate. Set up was a piece of cake .  I recommend it for every household.", "verified": true, "helpfulness": "1/2", "author": "ROBERT J PETREE"}, {"rating": 5.0, "review": "I'm a 66 yr old lady who doesn't have a smart phone to explain my 'tech level' -  but I've been watching movies ever since this came into my house.  Crazy thing happened though - right after getting the Fire TV my TV broke and I bought a new Samsung LED Smart TV and saw it was Amazon Prime ready - Dang, I thought, I didn't need Fire TV to watch Amazon Prime movies.  Wrong.  It wasn't the same experience.  Fire TV movies etc. were sharper and better than streaming thru the TV.  Also the audio feature of Fire TV to just talk to it and find movies is Great!  That's a feature of Fire TV that the TV couldn't do.  I don't have any experience with Roku or Apple TV so I can't give any comparison.  But for me Fire TV is all I need - I feel my money was well spent.", "verified": true, "helpfulness": "2/2", "author": "Marabar"}, {"rating": 5.0, "review": "Initial reaction - Upon opening the shipping box my first thought was, this can't be it. The fireTV package box is so small and I open it only to reveal an even smaller  fireTV box. The remote has a great feel to it and the fact that batteries are included is beyond awesome. I also like that when you replace the batteries you can use rechargeable batteries. (Make sure you order, if you don't have one already, an HDMI cable so you will be set upon delivery and not have to make a turn to the store.)Setup - Easy, I purchased my fireTV using my AmazonPrime account so mine came pre-registered. I plugged in the box and connected it using my Amazon HDMI cable and it was good to go.App installation - Though the app selection is limited, the apps that are available now fit my needs perfectly (that's why I decided on this set-top box for my cord cutting endeavor). The app location and selection process is quite easy and the apps download in a reasonable amount of time. Don't let the limited selection deter you from purchasing this box, I'm more than sure Amazon is actively and aggressively working to add more.Voice search - Right on and it definitely makes the search and selection process easy.App log in - So far I've only logged into Hulu, but I was giving the option to either enter my information with the remote or to enter the code given on the screen into the Hulu website on my PC. Awesome idea, definitely streamlined the process and it beats the search and enter option any day.I've only had the box for a little more than an hour and I'm not a tech guru. I will be back for a more detailed review once I have more experience with the fireTV and its apps.", "verified": true, "helpfulness": "0/0", "author": "cyn"}, {"rating": 3.0, "review": "the USB post does not function, preventing any import of data or video from occuring....this is a fail! Fix this and the Fire TV will be a perfect gift!", "verified": true, "helpfulness": "1/7", "author": "charles a leonard"}, {"rating": 5.0, "review": "I enjoy the voice commands.  I have used the Apple TV for quite a few years so this was a a welcome upgrade.  I especially liked the unit was already set up for my account which made it easier.", "verified": true, "helpfulness": "0/0", "author": "William G. Nielsen"}, {"rating": 3.0, "review": "Fire TV Is Good But Still Lacking The Compatibility As Far As Games & Apps As The Kindle Fire HD.My Purpose For Purchasing This Item Was To Be Able To Access ALL of My Apps & Games In My Cloud Directly On My TV But At This Particular Time It Is Not Capable To Do So.I Would Like To See The Fire TV Become Identically Compatible To The Kindle Fire HD Tablet Sp My Children & I Can Play Our Games On Our TV's.I'm a Prime Member So As Far As  Movies & TV Shows I Think It's EXCELLENT! Compatibility To All Apps & Games We Can Use w/Kindle Fire HD Tablets Is What Is Needed To Topple Over ANY & ALL Other Top Tablets.", "verified": true, "helpfulness": "1/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I just finished setting up my new Amazon Fire TV and it took all of 5 minutes and it was up and running.  Absolutely a no-brainer.  As a prime member I love having such easy access to my movies and tv shows.  I was able to access them previously through my dvd player but this is so much better. All the channels I like are right there on the home screen.  The only thing that would make it better is to have HBO available through the Fire TV.  I would also like to see Gaiam TV at some point.", "verified": true, "helpfulness": "1/2", "author": "L. Rogers \"ljr\""}, {"rating": 5.0, "review": "I have to say the fire TV is 10x better then apple TV!!! Got my wife to switch from her apple tv", "verified": true, "helpfulness": "2/3", "author": "alex rusher"}]