[{"rating": 5.0, "review": "Wow, installed in seconds, true HD and so easy to use. It blew my Roku out of the water. Awesome product and I highly recommend it.", "verified": true, "helpfulness": "2/2", "author": "The Collector"}, {"rating": 5.0, "review": "Awesome easy setup great selection to chose from", "verified": true, "helpfulness": "1/1", "author": "EUGENE T FOURNIER"}, {"rating": 5.0, "review": "so far 2nd day vneed to select more movies--not enough time in day.", "verified": true, "helpfulness": "1/1", "author": "WJC"}, {"rating": 2.0, "review": "Much excitement was built up hearing and watching advertisements for this product, only to be let down...  Constant problems of more loading than watching.  I thought only in football that the last two minutes of a show can last half an hour.  Even when hard lined with an Ethernet cable.  Tried resetting several times with no difference.  It never stayed on the Wi-Fi and had to keep typing in the security code for access.  There are a lot of free stuff to watch.... most of which are not popular nor even heard of before.  I plan to try to return it for a new one and if the problem persists, I will return it for a refund", "verified": true, "helpfulness": "0/2", "author": "STEPHEN D."}, {"rating": 1.0, "review": "First review I have ever written, don't buy, WILL NOT ALLOW YOU TO DOWNLOAD NETFLIX, I am a die hard Amazon person and am completely disappointed, I am going to get the Roku stick.", "verified": true, "helpfulness": "4/11", "author": "Ankit Shah"}, {"rating": 4.0, "review": "The voice seach is wonderful and works great. I'm having fun it!", "verified": false, "helpfulness": "1/1", "author": "Tammy hester"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "1/1", "author": "Harry Lambert"}, {"rating": 5.0, "review": "Great entertainment investment..  Reasonable price - FAST - High Definition - voice search works great - no complaints so far..", "verified": true, "helpfulness": "1/1", "author": "Ribbed Bumpers"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "1/1", "author": "Laurel L. Bennett"}, {"rating": 3.0, "review": "Easy to set up. Wish it had more network shows available.", "verified": true, "helpfulness": "0/2", "author": "Deborah S."}]