[{"rating": 5.0, "review": "I love this item, wish it was around sooner.  It's fast with great definition! The one feature I like the most is the images on the screen saver, I just wish it displayed a simple note where these locations are at; then I can plan my vacations to view these areas in person. \"One question; why can't I get the FOX News app on my Fire TV, it's available for my Fire HD?\"", "verified": true, "helpfulness": "1/1", "author": "R. Baill"}, {"rating": 5.0, "review": "We are enjoying the Amazon Fire TV very much.  I am watching all the old PBS detective shows I missed.  My husband is watching old military movies again.  A wonderful product.  Easy to hookup & easy to use.  We don't have Netflix or Hulu or any of the other so it does not affect us that the voice only works on Amazon.  The voice activation is an amazing thing.", "verified": true, "helpfulness": "1/1", "author": "Joanne R. Fox"}, {"rating": 5.0, "review": "Had this for about a week now.  Set up was incredibly easy. It took longer to open the box than it did to hook it up.  We love it even though there are a few shows we will be missing but I think supplementing with Netflix or hull will solve that problem and will still be cheaper than cable.", "verified": true, "helpfulness": "0/0", "author": "JENNIFER M HIX"}, {"rating": 5.0, "review": "I have owned this product for about a week now.  I was skeptical at buying it because, I heard so many negative reports.  Finally, I decided to get one. I have been a long time user of Roku3 device.  After seeing what this new Amazon Fire TV device can do, I will not be going back to Roku. The images are clear and crisp and the sound works just right through my Dolby Digital Sound Receiver. To take full advantage of this device, you need, high speed HDMI Cables and, an a decent amount of internet speed. My movies and tv shows used to be out of sync with the people while speaking on the other streaming device.  This Amazon Fire Tv device has done away with that problem. I just love how the Amazon Fire Tv device has made me want to watch more television, again.  Maybe it is just me but, every feature on the Amazon Fire Tv  device seems to work faster than my old Roku Device.  I really do not see how you could make it any better, other that improving the device processor.  Well, you wanted an honest answer, you got it from me.", "verified": true, "helpfulness": "2/2", "author": "Carl O Akers"}, {"rating": 4.0, "review": "I mistakenly already rated the weathertech product thinking I was rating the Husky. The weathertech was very good but did not provide as much coverage high near the petals so I choose the Husky . The WT was a little more substantial material and more pliable and I wished it had as much coverage .", "verified": true, "helpfulness": "0/4", "author": "MICHAEL B."}, {"rating": 4.0, "review": "Good stuff. Just what is advertised. All my programs when I want them. I like the voice feature and ease to use. The setup instructions could use a little tweaking.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 2.0, "review": "Choosing a STB comes down to what you want to do. I already have an HTPC for music and my externally downloaded files, so I can't comment to FireTV's support of that. I never found myself using the custom channels on my Roku 2 enough, or I may not have been willing to switch to this. What I wanted this for, was Netflix, Prime and Hulu. My TV and BluRay players support these as well, but they support them poorly. FireTV is very fast and responsive, and that's worth a few extra bucks to me.The Netflix app is the same on FireTV is on my other devices. Nothing special there. It's just a lot quicker to navigate and buffer. By comparison, the Roku 3 has a much nicer, more modern app. Well somewhat nicer. Not nice enough to make a huge difference to me. Unfortunately, the app is self-contained and you don't get recommendations or \"recently watched\" items through the main FireTV menu. As I understand it, that may be a Netflix stipulation, but they should really reconsider, as it's shifting the balance of my watching habits to Prime instead. How much longer before I realize I don't need to pay them anymore?And that's where this device shines, is for its support of Prime. It's the only usable interface I've seen for it thus far. The recommendations are good and they make it easy to watch the Next Episode, by navigating through their \"Recent\" toolbar. The voice search (one of the main selling points for me), works very well. But only for Prime. And that's one of the big failings of this device. It's not just because Netflix chose not to integrate either, it's the fact that to get to the Hulu search results, you have to first navigate through the Pay (ie. non-Prime) Amazon video options first. And it's not always obvious. Not cool. Make my life easier, not harder. Tricking customers is not a good long term strategy.So, if you don't have need for a lot of custom apps or you don't have/care about Prime, I'd go Roku 3. Otherwise, I think this is the best on the market right now and I've gotten a lot of good use out of it so far. I only had to reboot it once, in the two months I've used it and haven't encountered any other glitches so far (surprisingly enough). Both Amazon and Netflix need to loosen up a bit, for this device to be 5 stars. Cater to my habits, not what you would like them to be, and I'll be a loyal customer. Companies like Sony and Apple lost me years ago by trying to box me in.Side note: Received a Roku 3 a few days before this was announced, Amazon was nice enough to refund that (despite opening it and setting it up), and send me this replacement overnight.After owning for a few months: I really wanted to like this device, but I'm going back to Roku. The problem is that is doesn't consistently stream Netflix at its highest quality, despite none of my other devices have a problem with it. Since that's one of the main things I was planning on doing with it, it's now just a paper weight to me. You might not notice on a small TV, but it's unwatchable on a projector.", "verified": true, "helpfulness": "0/2", "author": "TechChris"}, {"rating": 5.0, "review": "I have a Vizio Smart TV in my living room and was using a WD Media player in my bedroom, it did not get Amazon and I needed a cable to get Wi-Fi, the Amazon Fire TV connects wirelessly with a very strong signal and works just fine with Amazon Prime, Netflix and Hula Plus and I can play the games as well, the price is good for a new unit, it runs cool, works fine and is much better than my Smart TV, so good in fact I may purchase another for the living room", "verified": true, "helpfulness": "0/0", "author": "Tommy Dee \"EnglishmanHi Tech\""}, {"rating": 3.0, "review": "I decided to try the Amazon Fire TV becasue Amazon offered a free 30 day trial.  I currently own a Roku XD and WD TV Live.  The Roku is the best device I've tried (haven't tried Apple TV so I can't speak to it) an the only reason I own a WD TV Live is it can access local Windows shares to grab content off of a PC instead of having to use PLEX or some other similar device.  Anyway on to the Amazon Fire TV:There is nothing wrong with the device it's just not as good as the Roku I have so I feel safe in assuming it will not match up with the newer Roku 3.  It will not access local network shares so it doesn't have the functionality I'm looking for to replace the WD TV Live.As far as how it differs from the Roku, the interfaces are less user friendly.  Although the content as far as TV, movies, included in prime or pay are broken out it's not as easy to deal with as it is with the Roku Amazon app (I realize I may just be resistent to change but it's far easier to stay in the Included in Prime world without accidentally leaving on the Roku then it is on the Amazon Fire TV).  This I could get over if there were other features making it better then the Roku.Amazon is trying to differentiate this from the Roku and other like devices based on the voice search.  The big problem here is it only searches Amazon Prime content.  The Roku on the other hand, although not voice activated, will search all available streaming sites it knows about for the content you are looking for and clearly identify where you can find it.  The Amazon Fire TV's search missed the mark even farther when it returned a show I searched for and reported it would cost $1.99 to watch when the show was actually included with Amazon Prime.  All in all, unless you really like talking to your appliances the voice search feature is subpar.  It hears you just fine and picks up the words you say great but the results it returns are limited and somewhat flawed.I won't comment on games because I didn't try that portion out.  There are plenty of other better devices to game on and I thought it was silly when the Roku started promoting it could play games too.I will give the device 3 stars because it does what they claim and works OK.  However if you are going to spend $99 on a streaming device I would go with the Roku 3.  It has significantly more channels (though this really doesn't matter because most would only appeal to a very small subset of users) and it's remote comes with a headphone jack instead of a microphone.  If you have kids or other house mates that go to bed before you this is much more useful then being able to talk to your tv.All in all I have to say I was disappointed not to like this device.  Hopefully in a few updates they can fix the Amazon Prime interface and add other features to allow them to compete with the Roku, or go the other way and keep it as is and drop the price in half.", "verified": true, "helpfulness": "1/2", "author": "SC"}, {"rating": 5.0, "review": "I want to thank Amazon for sanding me a Fire TV for a free 30 day trail.  I have had it for one day now and they will not be getting it  back. It is just amazing how easy it is to set up and use and it as there is so much you can do with it. Also they are going to raise the price of my Prime Membership in Oct but it still a bargainEldon", "verified": true, "helpfulness": "1/1", "author": "Eldon Callen \"Mocha1280\""}]