[{"rating": 5.0, "review": "What a great idea.  It is so simple to use and I can watch about anything including the stuff from my kindle", "verified": true, "helpfulness": "0/0", "author": "elaine garrett"}, {"rating": 5.0, "review": "I really enjoy the speed, the integration of search between Prime, On Demand, and with Hulu Plus, so that you can search for a program, and it will provide you all of the options.  Additionally, my kids LOVE the games, the game controllers, and that movies no longer buffer.This product is getting quite a bit of word of mouth positive news from me.", "verified": true, "helpfulness": "1/1", "author": "cool cops"}, {"rating": 5.0, "review": "It's great! Easy to access all content. We don't have cable tv, so this is all we use for tv watching and it's amazing. Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "I love shopping at Amazon and do a large percentage of my shopping here.  I would definitely buy this device IF it included The Blaze because I bought my Rokus (through Amazon) to watch The Blaze.  Now the older Rokus \"no longer support the updated streaming\" and I will have to replace one, maybe both.  I would rather buy Amazon's product which I note has HuffPost and other liberal selections, which should not be changed.  I would like to also see choices from a conservative viewpoint, since I believe in and support diversity.Thanks!", "verified": false, "helpfulness": "8/32", "author": "M. Payne \"Marjie\""}, {"rating": 4.0, "review": "I like the number of channels that shipped pn first open but was dissapointed with how the voice search didn't find things in most of the chanels.  For example, Twit netcasts in tunein or you tube. Channels.", "verified": true, "helpfulness": "0/0", "author": "Herbert Crosby"}, {"rating": 5.0, "review": "I actually own a Fire TV (FTV).  I've had it for about a week and it sits right next to a Roku 2 XS.  We cut our ties with Comcast five years ago and are OTA first cable cutters -- which is to say we have an antenna and most of our programming comes in via that antenna.  We have had a lot of streamers and currently use six Rokus plus this Fire TV.  None of these are Roku 3s because using WiFi for streaming audio+video+remote is a really bad idea -- especially if you have a half dozen streamers.The Fire TV streamer is the best streamer available at this time.  It combines the most popular features of Apple TV, Roku, and Ouya in a sleek package which is much faster at the same price point.  I think it is worth noting that Amazon warrants its streamer for a full year while the others only stand behind theirs for 90 days.At launch, FTV had nearly 200 apps available including Netflix, Amazon Instant, Hulu Plus, Plex, and YouTube -- the most streamed services.  Within a few days, people were running XBMC on the Fire TV hardware.The Fire TV is better hardware than Apple, Roku, or Ouya devices.  A faster processor, more memory, usb, wired and wireless ethernet, and optical out all perched on a substantial heat sink ensures cool, smooth operation.  During my week of comparison, the Fire TV has not yet hung or rebooted.  During this same period, the Roku 2 XS sitting beside it has rebooted three times.The USB port is a bit of a mystery.  I am using it for a wired Xbox controller.  Amazon claims it has no current use.The more time I spend with this streamer, the more I appreciate the user interface.  It's elegant and well thought out.  The left margin is a series of topics.  As you scroll down the topics, the right side of the screen is filled with subtopics and items.  These topics are ordered naturally and default to the logical destination.  Press the Home button on your remote and you are taken to the main menu with the Home topic selected revealing your most recent apps and a lot of recommendations.  Right click once to return to the last app used, twice to the one before that.  Once you settle in with Fire TV what you do will be just a couple clicks away.There are a lot of apps for the Fire TV.  Many are always free and quite a few were reduced for the launch.  Apps purchased for my Kindle Fires are in my Fire TV library even if a different is required for the FTV.Fire TV has apps for the most popular services.  The Netflix app supports profiles.  The Plex app is being revised.  It looks great but lacks some recent features like Play All.  The YouTube app can be linked to a PC or tablet so that items selected on that device are played on the TV if the app is running.  I like this a lot.  There are not a lot of news apps, but I like Now This News.  NTN plays news clips.  On my Roku, there is a black loading screen between clips.  On FTV, clips one after another.  I guess this is the first application of Amazon's smart buffering.Conspicuously absent at launch: A web browser, an email client, Social Media apps, PlayOn.tv (which works in a browser on my Kindle Fires), Simple.TV DVR app, Tablo DVR app, the top News apps, and Sports apps.  I expect these to make their way to FTV as most are already on the Kindle Fire.The Fire TV is a really decent casual game console.  Fire TV launched with 136 games.  Thirty of these are free.  If you have already purchased an app for your android device, you get the Fire TV version for free.There are familiar titles (Crazy Taxi, Deus Ex, Minecraft, Prince of Persia, Sonic, Rayman, and Tetris), original titles (Sev Zero), and 47 games that can be played with the included remote control.I did not purchase a controller for Fire TV.  I had hoped PS3 or Xbox controllers would work as I have these in my home.  While I was unable to pair a PS3 remote with my Fire TV, I was able to plug in an Xbox USB controller.  It was immediately recognized and it is a fine controller for the Fire TV.  I will probably get at least one Amazon controller.  At $40, it is not overprices and it includes media controls.  The $40 price includes Sev Zero and $10 in coins.  If you want Sev Zero and/or have your eye on some other paid apps, this will reduce your cost to $23 which is a very good price for a full fledged game controller.  The controller takes AA batteries.  So, $39.99 for a controller, Sev Zero, Crazy Taxi, and Air Fighters Pro seems like a pretty good deal to me.Fire TV supports Parental Controls and Amazon's Freetime will be on Fire TV next month.  For $2.99/month, Freetime includes content from Nickelodeon, Sesame Street, PBS Kids, and more.  Parents can create custom profiles for up to four kids, choosing the movies, TV shows, apps, and games they can access and limit/restrict certain types of content.Another feature I haven't really played with, but may be compelling for some, is a feature called Second Screen.  This allows you to mirror a Fire HDX tablet to the TV.  Second Screen allows a Fire HD or HDX to display additional information about media playing on the TV.  Just pointing this out.I give this streamer a big thumbs up.  Fire TV is a terrific Netflix player that supports profiles.  It supports other popular services and is totally integrated with Amazon Prime.  FTV plays games with real controllers and plays your media using third party apps like Plex.  It's fun and safe for kids with integrated parental controls.  Good job Amazon!", "verified": true, "helpfulness": "4/5", "author": "Leonard J. Mullen"}, {"rating": 4.0, "review": "The Amazon Fire TV is a great add-on for your tv if you don't have a smart tv or set top box already. It's easy to use and had great content providers already. You should be a Prime member to get the most benefit from Amazon Prime shows and movies.The games are a nice add-on, too. I don't play the games, but my kids are loving them.One missing piece is a tie-I'm to Amazon Music. If you have a Cloud library, the Fire TV should be able to access it, but music is not available.Overall, highly recommended.", "verified": true, "helpfulness": "1/1", "author": "Tom Hockman \"Big Audible fan since 2007. Love all types of books from sci-fi, mystery, thriller, bios, science, political analysis, and classics.\""}, {"rating": 4.0, "review": "I like how I can install android apps on this and over all the functionality is as described. It is noticeably faster than the ATV2 and and pretty smooth. The reason I have it 4 out of 5 stars is I can't put my installed apps on the front home screen and there is no way to sort through free prime movies like on other platforms.", "verified": true, "helpfulness": "1/1", "author": "steve wann"}, {"rating": 5.0, "review": "By golly..... Finally a device that is so easy to use and install. Love love it.  Great price and user friendly. Very happy with my purchase. The voice command is awesome , thanks for a great product.  Buy it you won't be sorry. One satisfied Amazin customer :-)", "verified": true, "helpfulness": "0/0", "author": "Margo A. Nordstrom \"bargin hunter\""}, {"rating": 5.0, "review": "We don't have any other devices, such as a Roku. When we would stream Netfilx or Prime or watch Youtube on the tv,  it seemed like it would take forever, the stream was always choppy and we could never watch anything fully without waiting for it. The Fire has been awesome for us. The voice command works really well- no problems there. It's easy to use (my 12 yr old explained it to me very quickly.)I would recommend it to anyone thinking about it. It works well- I hope that more apps and features will be added in the future, but for the roll out- I'm totally satisfied and happy. No glitches so far. We haven't tried the games, but Im sure we'll look into them.I know there are so many out there comparing tv show viewers, and each will have their pros and cons, but I think we'll just stick with the one that works well and we're happy with.", "verified": true, "helpfulness": "0/0", "author": "Monetina"}]