[{"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/1", "author": "James Neal"}, {"rating": 5.0, "review": "Easy to assemble but the only bad thing the HDMI is sold separately. Otherwise else I like it alot.", "verified": true, "helpfulness": "0/0", "author": "Juan Johnson"}, {"rating": 3.0, "review": "It's ok. Not as intuitive as they'd have you think. Paired it with a smaller, old tv since anything recent most likely has the smart tv feature making this totally redundant. Overall, I'm pleased, but again, only buy of you have no other smart access.", "verified": true, "helpfulness": "0/0", "author": "Brendan M Sheehan"}, {"rating": 4.0, "review": "Laggy when streaming sometimes.  (About 30% of the shows/movies we watch wlll have interruptions).  I'm pretty disappointed simply because its an Amazon product.My connection is fine.  I stream on my Xbox One (where I don't have any issues) when this becomes too laggy to bare.Latency issues aside, this is a great product.", "verified": true, "helpfulness": "0/0", "author": "Steve \"Stevers\""}, {"rating": 5.0, "review": "Love it, love it, love it! I've only had Fire TV for just over  a week. It was amazingly easy to set up, practically automatic. The selection of programming, games, etc. is endless and so many are free with my Prime membership. I don't know why I waited so long! I have already gotten my $99 worth. Well worth the cost!!!!!", "verified": true, "helpfulness": "0/0", "author": "N. Allen"}, {"rating": 5.0, "review": "This is one of the GREATEST tech devises I own.  I can now see some of the reruns and movies I want without all the interruptions. It is very simple to use.  It will be on my list to give as birthday gift to people that enjoy great indoor entertainment..", "verified": true, "helpfulness": "0/0", "author": "K Hip"}, {"rating": 5.0, "review": "Easy to set up. Easy to use. Delivers everything promised. Glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Sandra Larson"}, {"rating": 2.0, "review": "Better than I expected in that it's very fast and responsive.Some needed improvements: built in local media player, say one that works with windows media sharingVoice search for more than just Amazon content.I own Apple TV, PS3, Roku 3, and this Amazon Fire TV.I now use the Fire TV most often, for everything except local media and Roku's private channels.Update: I'm back to using the Roku because of constant network issues with the Fire TV, as well as a problem with sound going super \"tinny\" until I unplug the device and restart it.  I also have to hit the big button several times for any action now, used to work with one press.  This device has gone down hill FAST.", "verified": true, "helpfulness": "0/0", "author": "Matt G"}, {"rating": 5.0, "review": "LOVE IT!!!!", "verified": true, "helpfulness": "0/1", "author": "KC"}, {"rating": 5.0, "review": "Watching the Amazon-produced series of Bosch was great. I love the voice-command search feature.", "verified": true, "helpfulness": "0/0", "author": "Paul"}]