[{"rating": 5.0, "review": "Ordered a Fire TV on Apr 3 with delivery Apr 4 under Prime.  Removed from the shipping container, installed and the unit was ready to use within an hour following receipt.  Menu is easy to follow.  I have streamed several movies and TV series programs and they have all run flawlessly.  Great HD picture and no buffering problems.  Download is quite fast compared to a competitor product.  I rate the Fire TV has a major advance in streaming technology.", "verified": true, "helpfulness": "1/1", "author": "citra270"}, {"rating": 5.0, "review": "We got ours on the first day.  I downloaded a bunch of games and have been playing everyday with our 3 boys. I love the game controller.I hope they add games and make the voice control netflix searches.", "verified": true, "helpfulness": "0/0", "author": "Dr. David Ritsema \"Pastor of FBC Waxahachie\nProfessor at B. H. Carroll Theological Institute\""}, {"rating": 4.0, "review": "I ordered the Fire TV without reading any of the reviews.  Then, before it arrived, I started reading reviews and got a bit scared that I had made a mistake.  After playing with the gadget for several hours yesterday, I'm happy that I bought it.First, let me say that I bought the Fire TV to replace an older Roku that did not do HD.  I was also looking forward to the voice search feature. Netflix is my primary programming provider, so discovering that voice search only worked on Amazon content was the one negative.  It mentions this on the box, but I could find no mention of it in the web ad.  The only other thing that bothers me slightly is that the Roku has a LOT more apps for content providers.  Things like NASA, AOPA, and other special interests.  Maybe in time they will make it to fire.My positives are mostly that I did not encounter problems that many others claim to have had.  Setup was fast and easy.  The device found my remote and connected to my wifi with no problem.  I read a couple reviews complaining of poor wifi range.  I ran into evidence of the opposite.  The Fire TV device found several of my neighbors networks that were not discovered by the Roku or several other wifi devices I own.  I would call its wifi capability superior.The software update took just under ten minutes and no problems were encountered.  I watched two movies and did not have any pauses for buffering. My internet connection is a bit slow, so I thought I would run into the buffering issue that some mentioned. The remote works well. Navigation is simple.  I did not run into any problems with the Netflix app.  I read some complaints about it being \"broken\" but did not find evidence of this.", "verified": true, "helpfulness": "3/3", "author": "Robert Mason"}, {"rating": 5.0, "review": "I recently ordered and installed the Fire TV. It was easy to set up and get started. The performance is amazing. I have had apple tv and Roku and this is my favorite by a long shot. There has been no \"buffer\" lag and the voice recognition is right on target. I have recommended this product to my family and friends. This just may be the device to make be cut the cable!", "verified": true, "helpfulness": "0/0", "author": "W. Mckinney"}, {"rating": 4.0, "review": "it doesn't support Aereo yetit doesn't support Charter cable for hbo go and espn livei have a roku 3 and was hoping to have a seamless replacementbut it doesn't have all the apps in place yeti also think the navigation could be better", "verified": true, "helpfulness": "0/0", "author": "Reviewer"}, {"rating": 5.0, "review": "Hooking this up is so easy, 1-2-3, instructions are simple, theres a video in the beginning, but you don't even need that either.Amazing, works great!  Nice job Amazon", "verified": true, "helpfulness": "0/0", "author": "Karen Jones \"kjones\""}, {"rating": 5.0, "review": "I bought this for my non-smart tv in my bedroom, and I LOVE IT! I can access all my tv shows and account and its so easy to use! Well worth the price!", "verified": true, "helpfulness": "1/1", "author": "Ashley Lee"}, {"rating": 4.0, "review": "Very easy to use in fact a child can set it up, the program features are easy to use and the amount of programs available are enormous. You will never run out of something to watch and your appetite for different features will never be sated for some time to come. I would recommend this to all movie buffs.", "verified": true, "helpfulness": "0/0", "author": "George Pauline"}, {"rating": 5.0, "review": "Amazing streamer......works as promised....no problem loading and ready for immediate service.  love the microphone feature and ability to pulled up similar movies and genres.  Great price and bridges the gap between Roku and Apple TV....Highly recommend to anyone to give free look...you won't be disappointed.....", "verified": true, "helpfulness": "0/0", "author": "tonythetiger"}, {"rating": 2.0, "review": "It needs to be divided,rentals on one page, new releases on one page, amazon prime on one page, but no...it is one big file you can't find any of these categories. Waist of money!!!!", "verified": true, "helpfulness": "4/12", "author": "john k jordan"}]