[{"rating": 5.0, "review": "Love the voice activated search feature.  Will be using that more often.", "verified": true, "helpfulness": "0/0", "author": "Thomas Smith"}, {"rating": 5.0, "review": "This was easy to connect and set up, and it performs as advertised. I'm happy I made the purchase!", "verified": true, "helpfulness": "0/0", "author": "Sandy Berry"}, {"rating": 5.0, "review": "The best item I've purchased so far, and I've purchased great items from Amazon. However, this my favorite. I can watch any tv program or movie without any commercial interruptions.", "verified": true, "helpfulness": "0/0", "author": "carmen salgado"}, {"rating": 4.0, "review": "This device is simply incredible. So much power in such a small package. My only gripe is that you have to have cable to use some of the apps. This is the whole point of the box; to cut the cable, literally. Once you can use the apps and they add more, AMC, it will be 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "💥", "verified": true, "helpfulness": "0/0", "author": "Ronnie"}, {"rating": 4.0, "review": "So far, so good. I did not hace muchos time to evaluate it, but i liked TVE Amazon de vice. However i can not find how can i mirrow muy Phone por tablet; when this happens: 5 stars.", "verified": true, "helpfulness": "0/0", "author": "nsscm"}, {"rating": 5.0, "review": "Love the fireTV. It is easy to use, and the speak to search function is awesome for our daughter to use to turn her shows on!", "verified": true, "helpfulness": "0/0", "author": "Muzzy"}, {"rating": 5.0, "review": "We love the Amazon Fire TV. Super easy to use, very intuitive GUI and it's really fast. We loved it so much we bought it for my Son-in-law for Christmas and they love it too! Highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "lawestaz"}, {"rating": 3.0, "review": "everything done nicely, but major is lack of DTS for older receivers,  will have to look for something else for home theater.  Simulated surround does not cut it.  Also could use more external memory option,  activate USB.  Streaming of large mkv files results in stuttering.  Something my 4 year old sony smp n200 could do.", "verified": true, "helpfulness": "0/0", "author": "edd"}, {"rating": 3.0, "review": "missing many details, the interface does not have to Spanish , and is internationally released", "verified": true, "helpfulness": "0/0", "author": "Clementino Rios"}]