[{"rating": 5.0, "review": "I am really starting to love this.  I have had several others like the Apple and Chromecast and this out performs them hands down.  Great streaming, lots of movie, TV and music choices, simple to use and the voice recognition works fantastic.", "verified": true, "helpfulness": "0/0", "author": "G. Brouillette \"Sommelier to the stars\""}, {"rating": 5.0, "review": "I enthusiastically recommend Fire TV, especially for Amazon Prime users.  Fire TV provides the features and performance I was expecting (but didn't get) from my \"smart TV\".  For an Amazon Prime user, installation couldn't be easier.  Netflix and Hulu are both faster and less troublesome with Fire TV. YouTube is much better too. But Amazon Prime viewing is so slick and fast that it steals the show.  The power light blinked after power company maintenance interrupted power for a while. All it took to reset it was to unplug it for 10 seconds and plug it back in. When a lightning strike caused a less orderly power failure, it only took a few more minutes to re-enable Netflix, YouTube, and Hulu. It was a quick & easy process.  For me, the most impressive feature of Fire TV is the small minimalist remote. It's a masterpiece of ergonomic design, and a joy to use.", "verified": true, "helpfulness": "0/1", "author": "PS Coleman"}, {"rating": 4.0, "review": "I purchased this when it first came out, so about two months ago. We had been streaming through an old Visio blu-ray player that was really slow, so this was a vast improvement for my family. However, last week the audio started acting up. First, there was an annoying high-pitched buzzing noise that could be heard during the show we were watching, then the audio quit entirely. After a couple days of that, I decided to unplug it, wait 10 seconds and plug it back in. It did the trick - for about two days. Then we had to do it again. And again the next day. At this point, I'm not sure whether I will attempt to return it to Amazon, or what I will do, but it is pretty disappointing that it is having  problems so soon. I'd give it more stars without the audio problems, but I can't justify more now.Update: I haven't had the problem with the sound since I wrote this review. In addition, an Amazon employee called me to help me work out the problem if it recurs. That is good customer service! He told me to adjust the dolby sound settings.  I haven't yet, but will when the sound acts up again.The fire is easy to navigate and streaming is so much faster than my old blu-ray, so it's a good product other than the sound problem.", "verified": true, "helpfulness": "6/6", "author": "Mom of four"}, {"rating": 4.0, "review": "The good:Set up was easy.Picture is extremely good.Movies/shows download quickly (much faster than Netflix).Huge selection.Voice search works outstanding and is very easy. Really nice feature.The bad:They charge for too many TV shows and movies. For example, very old episodes of shows like Reba are not free. Many movies and shows that are free on Netflix are not free on Fire TV. No idea how these decisions are made, but I was surprised at how many things they charge for. They did put a \"Prime\" icon in the top left of each show or movie so that you know it's free, so that does save time.Overall I give it a solid B. It is much faster, easier to use and intuitive than Netflix. Not even close. But the advantage of Netlix is that you can watch it anywhere without a box. With this, you have to have the box. It's just too bad that they charge for movies and TV shows that are in some cases 10 years old or more.", "verified": true, "helpfulness": "5/7", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really enjoying it!", "verified": true, "helpfulness": "0/3", "author": "DebbieM"}, {"rating": 5.0, "review": "Today I will answer the simple question, what makes the Amazon box better than a video game system, the Roku3, or the Apple TV in terms of being a media player?  Speed, stability, and voice.  The Fire TV is stabler than a Roku, faster than anything else (for Hulu, Netflix, or Amazon), and being able to speak your choices is awesome (currently just for music, and Amazon).", "verified": true, "helpfulness": "2/2", "author": "J. Baldwin"}, {"rating": 1.0, "review": "Really disappointed.  Cost was the highest of all of the smart tv connections.  In regards to use, you have to pay another expense to get the movies in addition to the almost $100 you paid for this device.  Set up was very easy.  But I didn't anything more than I already had with the free TV app that came with the TV!  I use Netflix that is about $8/month for unlimited movies, video's, etc.  Amazon Prime movie selection was somewhat limited to my disappointment.  A lot of current movies you had to pay extra to watch them.  Or it came without an additional cost on Net Flix as part of their package.  I didn't find that any of the additional apps that Fire TV supplied was of any quality or that I didn't already have.I also got the ChromeCast.  Cheaper, but so far I can't get it to connect to my router, which the Amazon TV did instantly.  I looked over some forum posts, and there is a huge list of routers that Chromecast listed as \"Call your manufactor for assistance.  And this was for routers like Apple, ASUS, LinkSys, Net Gear, etc.  All of the usual ones!  So skip the ChromeCast.So in summary, for what you pay, what you get, don't get this or any of the other ones.  For what I use the TV for, the apps that came with the set, are all that I needed.  If I am missing something here, please let me know!", "verified": true, "helpfulness": "13/31", "author": "CrzyMD"}, {"rating": 3.0, "review": "Better than AppleTV but just another OK product.", "verified": true, "helpfulness": "3/6", "author": "TS"}, {"rating": 2.0, "review": "Would not work with either of my new Denon receiver's. After a lot of research it appears that the sound is not implemented correctly on the Fire TV. Oh well, maybe v2.0", "verified": true, "helpfulness": "4/5", "author": "CraigG"}, {"rating": 5.0, "review": "a great product. it meets all my streaming for watching what i want to watch. I give kt a five (5)star", "verified": true, "helpfulness": "0/0", "author": "Lavell Pruitt"}]