[{"rating": 3.0, "review": "Well for starters it's okay , the features are great ,like the voice command and the game controller (sold separately) but you don't get the real amazon app store you get some things, like apps that you would get on your DVD player.I would not recommend buying this product in tell they tweak it some more boring, boring...And actually I would give it a 2 1/2 just because the features but for the unit it self not!", "verified": true, "helpfulness": "0/2", "author": "shy elujulo"}, {"rating": 5.0, "review": "I'm a new cord cutter and recently purchased the roku streaming stick.  Had problems with it out of the box.  Difficult to hook up.  Kept dropping the internet connection.  Could not watch anything from netflix, huluplus, or amazon without prolonged load time and repetitive freezing on a good note and unable to connect to servers on a very frequent bad note.  Tried every fix I could find online (not easy to locate) and began to think maybe I should go back to my tethered lifestyle with satellite tv. After about five days, I purchased an amazon fire tv and hook up was a breeze.  Within minutes, I was able to watch content from from all three major providers with lightening fast down loads and only the occasional buffering.  The picture and sound are spectacular.  I thought I might move the streaming stick to a tv closer to my router but when it caused significant interference with my OTA antenna, I had enough.  Packed it up,  made arrangements to send back to amazon and purchased a second fire tv.  Can't wait to hook it up!", "verified": true, "helpfulness": "2/2", "author": "nikki70"}, {"rating": 4.0, "review": "We used our new Amazon Fire TV for awhile now and really like the device. It was super simple to hookup to our system and a no brainer to use. The search feature is really nice, too. The picture is exceptionally clear and the built in screen saver is a household favorite. Even our guests enjoy just looking at the amazing photos from around the world in ultra HD. The only problem we've had is that the unit emits a really strong burst of sound from its light-based video jack whenever we pause video, which usually causes our home theater to turn itself off to protect itself. Hopefully Amazon will fix this in a future firmware or software update.", "verified": true, "helpfulness": "0/0", "author": "bestbuyer \"bestbuyer\""}, {"rating": 3.0, "review": "OK, I got sold on this by watching Gary Busey talk to the box. The ad needs a printed disclaimer that the voice does not work on all searchable media. It was the first thing I tried when I powered it up and it came live after the lengthy update process. Tried a half dozen voice searches, worked flawlessly. I am excited. I popped over to YouTube, as voice search there was something I wanted badly, and it is gonna be awesome...or not. YouTube did not recognize voice and I was back to hunt and peck remote, or use my phone or tablet to type...but no voice search. Undaunted, I installed both Hulu Plus and Netflix and logged in to both. Voice search still just for Amazon content...I am officially pissed off, and I feel lied to. I was perfectly happy with my Apple TV, and your promise of the voice search made me order it. The interface and streaming performance speed and reliability are better on my Apple TV, the only thing I like is your remote being bluetooth. Also having a power brick when the smaller Apple TV did not is a clumsy step backwards.Apple TV offers me better performance, and complete integration with all Apple devices in the house. Airplay allows one button to play content from iPhone, iPad or Mac to a designated Apple TV.Bottom line Amazon, if you tell me that voice search will soon work with YouTube and Hulu and Netflix, I will wait, as it is a very slick and accurate feature on your material. If your answer is no, I am sending it back.", "verified": true, "helpfulness": "1/2", "author": "K. Doyle"}, {"rating": 5.0, "review": "This is the future of online streaming video and who better to offer it than Amazon.  They will lead the market with this bad boy.  We picked up one to test it out, along with two controllers.  We were instantly amazed at how fast it was....and I'm not exaggerating.  This device is designed to stream video and apps/games.  Toss that Blu-ray away.  Forget your Smart TV man, those may seem fast to you but once you fire this sucker up, there is absolutely no comparison.  We have six kids, four smart TVs and three Blu-rays that all are used to stream video.  We will now be getting four more Amazon Fire devices for the house once parental controls are available.  I am 100% satisfied with this product and good for Amazon for designing a proper device that is actually designed to run this type of content....and is faster than anything you've used before.", "verified": true, "helpfulness": "1/1", "author": "Scott Sarver"}, {"rating": 4.0, "review": "I just got it yesterday, I really like the sound and pictures it's really nice when I use remote to speak I love it", "verified": true, "helpfulness": "0/0", "author": "youness"}, {"rating": 5.0, "review": "I love the voice search functionality.  Right now, it only works for Amazon content.  Hopefully, though, they will open it up to 3rd party apps as well and give us the choice of where to watch a piece of content (Amazon Instant Video, Netflix, etc.)Overall, I am very impressed with Fire TV.  I think Amazon raised the bar on both Apple and Roku.", "verified": true, "helpfulness": "3/3", "author": "Mr Steve J Boom"}, {"rating": 5.0, "review": "For the past year, have accessed Amazon content via my content enabled blu-ray player.  That worked fine but navigating to/searching content was more tedious than it had to be.I picked up the Fire TV on a whim and was very impressed during my first use of it this past weekend. Setup was a snap and the voice search function cleared the bar that had been set by Amazon's advertising.  The device is tiny compared to my DVR and blu-ray player.To the upside:- the remote feels great in the hand.  don't have to use it much, but when you do...just feels right. great fit & finish- navigation (non-voice enabled) is vastly superior to what I had been dealing with using the remote for my blu-rayDownside:- none yet.", "verified": true, "helpfulness": "3/3", "author": "mjolnir7 \"mjolnir7\""}, {"rating": 3.0, "review": "Edited 04/18/14: Sending back the Fire TV - got a Roku 3 instead. For the past several years, I had a Sony media player and thought this Fire TV would be a great upgrade. Ordered my Fire TV a few hours after it went on sale and had great expectations - until I fired it up. First, the elegant and solid box comes like a high priced gem, kudos to design and marketing. Installing and connections are a snap - however, first irritation: the power plug/transformer is so big if you use a power-strip, it will use adjacent slots. Once powered on, it walks you through all the steps. Oddly enough, there is no on/off button, but it seems the unit powers off after a time of non-use (light off). Second irritation: the LED power light has laser pointer quality - it is super bright and rather distracting and cannot be turned off: it is akin of sitting in a movie theater and a person looking at a smartphone 15 rows down(I am hiding my Fire TV behind the center speaker now, good thing the remote works without direct line contact). Interface is great, if a bit clunky in my opinion, the whole thing works fast and picture and sound quality is absolutely great. Third irritation: voice search works like a charm, however, in my experience, this functionality seems to be limited to Amazon content and a few other apps. Pardon me, that is nonsense. Won't be using that one a lot then and keep key-clicking in letters through the remote like in ancient times with Netflix and Pandora and pretty much anything else. Logged into my Pandora, works great. Fourth irritation: in order to stop Pandora one has to navigate through menus to find \"quit\" instead of having a dedicated icon that stops and closes the app - if you navigate away, the music keeps playing, over instructional Amazon help videos, creating a cacophony of sounds, then you have to navigate to the app which defaults to the play button, then to the menu, then select quit, then confirm you want to quit - not an Amazon app, but if you put it on your product, then these things should be checked.Then, after having skipped trial Amazon Prime, I wanted to give it a try. After searching for the sign up on my Fire TV for 15 minutes, I had to call customer service as once skipped, there is NO way to get the free trial sign-up on your Fire TV. I was directed to go to the website. Then I went into settings and saw something called \"Quiet Time.\" I had no idea what that meant - mute? reduced volume? night time watching? There is no explanation anywhere as to what this is. Had to call customer service: this will mute notifications. Aha - notifications of what? Never mind. Regarding content, I hope there will be more in the future, such as NPR, for example, whose podcasts I dearly miss. Overall, I am underwhelmed and not really a happy camper. If you already have an Apple TV or Roku, save yourself the expense - this one needs major work and upgrades before a solid recommendation is in order.", "verified": true, "helpfulness": "8/17", "author": "Armin M. Geiger"}, {"rating": 1.0, "review": "Very limited selection of free movies if you don't have Prime. The marketing makes it sound like there are 1,000s of options but in reality, you have to pay for the overwhelming majority of them. Also, the system needed to be updated right when I plugged in the power and it wouldn't automatically connect to our wireless. Truly disappointed. Only good thing is netflix streams very clearly in it.", "verified": true, "helpfulness": "15/47", "author": "liljess0785"}]