[{"rating": 4.0, "review": "I really like it..it just needs some mainstream apps and an app for a keyboard to get on the web a web browser would be great too.", "verified": true, "helpfulness": "1/2", "author": "Mr.G"}, {"rating": 2.0, "review": "This device is weak compared to Apple TV.... No YouTube app or AirPlay and it only wants to sell HD rentals for 5.99 a pop SD is not offered on new movies through the fire TV, one would think older movies from the 60's, 70's, and 80's would be free but nope Amazon still wants 2.99... Save your money!", "verified": true, "helpfulness": "2/2", "author": "J. Weaver \"migalito\""}, {"rating": 4.0, "review": "It's cool, small, fast and easy to use. Getting better apps day by day.", "verified": true, "helpfulness": "1/1", "author": "harryhoudini \"Scott\""}, {"rating": 4.0, "review": "So far I'm happy with the Amazon Fire, I had to turn it off once and turn it back on to bring netflix back online.", "verified": true, "helpfulness": "0/0", "author": "John Goodrich"}, {"rating": 5.0, "review": "Only wish it had a browser.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "nice...very user friendly", "verified": true, "helpfulness": "0/1", "author": "Esperanza S."}, {"rating": 1.0, "review": "Netflix software unwieldy", "verified": true, "helpfulness": "1/5", "author": "David I. Covington"}, {"rating": 5.0, "review": "It works ( and I bought a stick as well -- also great) The voice search is great . I find myself asking for movies from a country and before I can blink it has them all lined up - really cool and fun . It also came all registered to me so I was in the system in minutes I KID YOU NOT !!! I like it - buy it", "verified": true, "helpfulness": "0/0", "author": "John Augustine"}, {"rating": 4.0, "review": "The apps don't support DirecTV, so if you want to watch SHOWTIME anytime or whatever other channel, this isn't the product for you.  Other than that, the fact that you can stream Amazon Prime movies is pretty freaking amazing.", "verified": false, "helpfulness": "0/0", "author": "christine c."}, {"rating": 2.0, "review": "This product could be much better if it add Google play and surfing the Internet. I think till they put does up grades it's a waste of time. I'm a prime member and I don't like this product.", "verified": true, "helpfulness": "0/0", "author": "ay california"}]