[{"rating": 5.0, "review": "Yes. This is my 3th one for me.", "verified": true, "helpfulness": "0/0", "author": "Cristian Gabriel Coapsi"}, {"rating": 5.0, "review": "Omg, I love fire tv. The only problem is my ass might grow from spending too much time on the couch!!!", "verified": true, "helpfulness": "0/0", "author": "V. Averill"}, {"rating": 1.0, "review": "Bought this because of the SlingTV promo. It bricked after its own firmware update. Got a replacement, same thing. Garbage. They claim its Slings app. Could be, but an app shouldn't brick your device. Their app works fine on the Roku 3.Also the little time I had with it, the UI is terrible. Would not recommend to anyone.", "verified": true, "helpfulness": "1/2", "author": "Z. Oulman"}, {"rating": 5.0, "review": "This little box is the Best  kept secret!!! It has everything I ever wanted in a streaming device!! Superb quality, function and ease of use !!! Kudos Amazon FireTV !!!", "verified": true, "helpfulness": "0/0", "author": "psRover"}, {"rating": 5.0, "review": "The best.", "verified": true, "helpfulness": "0/0", "author": "deb"}, {"rating": 5.0, "review": "Worked out great", "verified": true, "helpfulness": "0/0", "author": "robert cortez"}, {"rating": 4.0, "review": "Read reviews comparing to Roku, then bought the Fire.  I like it better than the Apple equivalent, very easy to use... and the voice application is amazing!  Very easy to set up as well.  Only downside is the limited menu of options.  Picture and audio great, very fast download and response time.  Would love to see Amazon add more stations and options.", "verified": true, "helpfulness": "0/0", "author": "WM \"WM\""}, {"rating": 5.0, "review": "Awesome! It turns on so quickly and buffers smoothly. We may get rid of cable it's so good!", "verified": true, "helpfulness": "0/0", "author": "Drew S. Weber"}, {"rating": 4.0, "review": "Only a week in and it's working fine. I hard wired it into my home network and also my Wi-Fi. One improvement I'd like to see is a volume control on the remote. I use a high end universal remote however it doesn't support the Amazon Fire TV. I expect my universal remote will eventually have an update and the next few Amazon Fire TV's will have a more universal remote control.", "verified": true, "helpfulness": "0/0", "author": "GLX \"BLS\""}, {"rating": 5.0, "review": "Cheaper than cable.", "verified": true, "helpfulness": "0/0", "author": "Susan RF"}]