[{"rating": 5.0, "review": "Love Amazon Fire TV!!!  I can see what I want WHEN I want!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "iliana angulo"}, {"rating": 5.0, "review": "Everything loads fast, no cpu lag time. Bought this to replace the PS3 I was using for a netflix and prime video box, I have no regrets! Worth every penny as well as prime!", "verified": true, "helpfulness": "0/0", "author": "Tim Bingham"}, {"rating": 2.0, "review": "didn't realize it but most of the xtra pps require subscriptions to view programs.  also would prefer the stick, would be easier to transfer fro one tv to another.", "verified": true, "helpfulness": "0/3", "author": "vicky taylor"}, {"rating": 1.0, "review": "The information about this product is misleading. Somehow, I had the notion that as a Prime member I had access to over 40,000 titles at no additional cost. That is not true. Prime members DO get SOME titles for free - but nothing close to 40,000... Not even 1,000.... In fact, I doubt that there are an even 100 titles that are free. The games on this thing are lame (board games like Life but not Monopoly... Card games like solitaire.... That you have to PAY to play??) It was a deeply disappointing Christmas gift.", "verified": true, "helpfulness": "2/6", "author": "Rhyleigh Blue"}, {"rating": 5.0, "review": "Love the speed of going through each option.  Color is bright and crisp.  Love the voice interaction", "verified": true, "helpfulness": "1/1", "author": "Symeka Lee"}, {"rating": 4.0, "review": "I love the unit. I love I can also reach other online content providers. I wish Prime would offer more free complete seasons of shows. Worth the price if you have Amazon Prime, Pandora and other accounts already.It works over WiFi, requires a plug and is very small unit.", "verified": true, "helpfulness": "1/1", "author": "J. Shore \"Wolverine_Fan\""}, {"rating": 1.0, "review": "This item is the worst.  It takes multiple tries to set up. Downloads new content for hours, and makes you start over from beginning every time! What a joke! No one is happy with this gift.  Interface is slow.  My cable box is better and easier to set up.Unplug and try again??? That's your solution?? You idiots.I bought this for several people, and it was the worst gift by far on Christmas morning.  You suck Amazon.  I am cancelling my Prime Membership, I am so pissed off at you!", "verified": false, "helpfulness": "1/4", "author": "Molly Patton"}, {"rating": 4.0, "review": "Works well, lots of apps, but not a lot of good TV and Mivies included in Prime. So far we do most of our viewing in Netflix and Hulu.", "verified": true, "helpfulness": "0/0", "author": "Rheiana"}, {"rating": 4.0, "review": "Pro - Ordered from Amazon, and it was registered and very easy to install.Con - A basic HDMI cable should be included.", "verified": true, "helpfulness": "1/1", "author": "DMB"}]