[{"rating": 4.0, "review": "I was actually able to set this up remotely with my 70 year old mother thru a facetime session. Nuff said for ease of set up. My mother likes the voice search and so far seems very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Tmoney \"tmoney\""}, {"rating": 1.0, "review": "Can't do much on it I don't even use it.", "verified": true, "helpfulness": "0/6", "author": "Ashley Wilkins"}, {"rating": 5.0, "review": "Bought this to replace an Oppo bdp-105 which I felt was overkill and about to be superseded by 4k anyway...Does great with streaming Netflix (though do have to reboot the unit once in a while) and Amazon. Sideloaded Kodi (formerly XBMC) for local stored content on my network, works well for videos but odd/slow audio playback for flac; don't have to have rootable unit to do this.Nice remote, works great. Overall compared to Roku/bluray it's a better choice for me.Unit itself is quite tiny, generates very little heat. I have it hardwired to my network/internet. Did try wireless and seemed fine but I prefer the stability/speed of hardwire.Best $79 you could spend in my opinion. Devices like this are gamechangers!", "verified": true, "helpfulness": "0/0", "author": "James Knox"}, {"rating": 5.0, "review": "I bought it for my grandmother and she loves it !!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Voice search only works for Amazon titles (until app vendors add the features). Confusing interface to use for non Amazon videos and for most apps.  It's a good value, but the product is just ok at this point unless you are only using it to stream Amazon prime videos.", "verified": true, "helpfulness": "0/0", "author": "FatherOf4"}, {"rating": 5.0, "review": "It works great. Does not lag or anything.", "verified": true, "helpfulness": "0/0", "author": "inkblot"}, {"rating": 5.0, "review": "This rocks. Made a smartTV out of my first generation dumbTV.", "verified": true, "helpfulness": "0/0", "author": "Keberch"}, {"rating": 2.0, "review": "It has a serious problem which software updates have not fixed. If you scroll in any direction it tends to jump 2 at a time instead of one by one. Support was unable to resolve the issue, sw is current as is remote. Otherwise, its obvious everything is prime centric where roku Doesnt have a home. I initially got it because it had optical out which I could connect my soundbar to. The speach recognition has yet to fail, it's guessed right every time. Until this latest update it also didn't \"sleep\" now I actually see it turning the led off and waking when the remote is used.", "verified": true, "helpfulness": "0/1", "author": "Brent"}, {"rating": 3.0, "review": "The video and series included with prime are pretty old and the selection isn't as broad as I originaly thought. The system is cool though. I'll probably just stick with Netflix from a movie and TV show perspective.", "verified": true, "helpfulness": "0/0", "author": "Tony Boston"}, {"rating": 5.0, "review": "We are really happy with the quality and quantity of programming/games available!", "verified": true, "helpfulness": "0/0", "author": "melissa"}]