[{"rating": 5.0, "review": "I received it today and hooked it up to my TV.  Wow, talk about quick and easy setup!  Absolutly love the talk to remote search feature!  It loads up faster than my Samsung TV and Smart DVD players and I love the next exposed auto play feature on Netflix.  As for a firmware update, it did update as soon as I hooked it up, so whatever the earlier issues were, I think they are fixed.  The small size and RF remote lets me tuck it out of sight and it still works great where I always had to open mu cabinets to use my line of sight remotes.  I'll update this review later it anything changes, but right now I feel this is the best video streamer on the market.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 4.0, "review": "This is the only streaming box I own so I can't compare it to anything. What I can say is it's extremely fast and responsive. Having Plex is a must if you want to watch movies saved on your PC's hard drive. I also have the controller and it basically feels like the Xbox 360 controller. The games are fun for a casual gamer, but don't expect anything close to a PS or Xbox game. I gave it 4 stars since the apps selection is fairly thin and obviously no HBO GO (but what do you expect, it just launched a few weeks ago). Also, the voice commands are great, but it only works so far in the Amazon environment. Say if you have Netflix and you want to watch Breaking Bad. If you use the voice command, it will only show it on Amazon's VOD service and not Netflix as well. I'm sure I will eventually give it 5 stars when they start updating the software and app selection. Another bummer is the USB port has no function as of yet. Overall, I'm happy and think it's a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Fat Cat \"Dan\""}, {"rating": 5.0, "review": "I just got this a few days ago, and I'm still learning my way around it. I can truly say at this point, though, that I do love it. My streaming is just great. The picture is better than my Dish and better than my DVDs. My movie starts right up and never is there a lag or a buffer. BTW, I have cable internet for my Fire TV. No DishNet in my area.At this time, I am watching Amazon Prime offerings, of which there are plenty. I have looked at the rentals, which range in price from about 99 cents to 6 or 7 dollars. I may buy some of those later.One of the things you get is a WatchList. You put things you would like to see at a later date on the WatchList. You can do this on the FireTV or you can look up movies and other entertainment on your computer at your leisure and send things to your WatchList, where they will be when you open your Amazon FireTV. I love this feature since I am new to this and I can take my time.This is my first adventure in streaming. I don't have a Roku or other device to compare to. On that basis, this Amazon FireTV meets my present needs nicely and I hope to be using it happily for a long time to come.", "verified": true, "helpfulness": "0/0", "author": "J. A. Eastman \"boomer\""}, {"rating": 5.0, "review": "Finally, Amazon gets it right. Rather than rushing another weak copycat to market, they've learned from the mistakes of their competitors. Fire TV is a winner -- easy to set up, easy to navigate and the clear choice for media streaming.I could spend the whole weekend playing with this great new toy!", "verified": true, "helpfulness": "0/0", "author": "Mark Allen"}, {"rating": 5.0, "review": "I got it and love it that is why got another one. I tell my friends they will love it to.", "verified": true, "helpfulness": "0/0", "author": "Rick  Lynch"}, {"rating": 5.0, "review": "I'm a casual gamer and an XBMC's test addict. Of all the 5 streamer boxes that I own (ATV2 &3,Roku3,OUYA), this is by far the best for what I'm using it for, the games and apps library seems like growing every time I look, got the Plex for $.99 and all the free games, please bring back the Galaga. The remote control seems a wee bit too sensitive or is it my trigger happy finger? The menu lacks option for customization but responses quickly to the remote commands. Over all, I'm a happy camper, considering getting a game controller. Gotta go sideload the latest XBMC nightly built for ftv now.Nov 2014, The box is still performs very well after several firmware releases, Netflix gets a new and more aesthetic yet functional interface. Prime music is another welcome addition for Prime members. Amazon also released a little brother FireTV stick and that will be the subject of another review.", "verified": true, "helpfulness": "0/3", "author": "streamer"}, {"rating": 5.0, "review": "Easy to set up and easy to use.  Voice search works great!  Excellent product with all the features we need.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Jeff Bezos....stop the packaging dept from their excessiveness!  I had to use a KNIFE to open the package.  Thick, hard cardboard packaging...looked nice and appealing but really totally unnecessary.Now-to the product!  It was very ez rto set up.  I have not tried the voice part yet and will update the review when I do.  I was able to watch a Prime TV series flawlessly.  I had been thinking of buying a second Roku for my second TV but am glad I waited for the Amazon product!Would give it 5 stars if it wasn't for the packaging.", "verified": true, "helpfulness": "1/1", "author": "sailrosie \"justa common person\""}, {"rating": 5.0, "review": "Easy to setup and use.  Love the voice search feature.  It even automatically changes my tv input as soon as I hit the home button so I don't have to select the correct tv input to use the fire tv first.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "I love this product.  It is small, easy to use and fits the lifestyle of my family.  I like that it has a variety of options (Netflix, games, etc.) other than Amazon Prime.  I normally do not buy the newest items out there until I have heard other reviews but I took a chance because I have been so satisfied with the other Amazon products/services.", "verified": true, "helpfulness": "0/0", "author": "Unknown"}]