[{"rating": 5.0, "review": "Amazingly simple!  Turn on the TV, \"speak into the remote' and your watching your favorites.  Caution, it could create \"movie\" binging around the house.", "verified": true, "helpfulness": "0/0", "author": "Julia Nix \"librarian\""}, {"rating": 5.0, "review": "Second one i own love this little box hours of viewing fun.", "verified": true, "helpfulness": "0/0", "author": "John DeAlto"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "John Cuyler III"}, {"rating": 5.0, "review": "love it my husband is always watchin tv or playing the games plus it's easy to use", "verified": true, "helpfulness": "0/0", "author": "billie"}, {"rating": 5.0, "review": "The best TV/Internet device I've ever owned!", "verified": true, "helpfulness": "0/0", "author": "Digicoma"}, {"rating": 4.0, "review": "Have had this one month, so far so good.***Pros***-Can side load xbmc/spmc-Can load Plex-Using it wireless- Have never had a buffering issue unless also streaming to another tv on Netflix or hulu (bandwidth issue not FireTV)- Video is in HD with no buffering issues-Remote control works well-Also using wireless Keyboard***Cons***-No access to external storage from USB (FireTV is 5GB)-I dont think it came with an HDMI Cable.-Remote will not control volume without other modifications-Should be able to add any app installed to the recent list without having to use Llama to \"trick\" it into doing so.With that said, this is a great device and with the few negatives I plan on buying at least 1 more for another TV. I would like to see the USB give access to an external HD without having to do more to the device. Though XBMC and PLEX allow this through their setup.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"greggonzo1\""}, {"rating": 4.0, "review": "Great device", "verified": false, "helpfulness": "0/0", "author": "Aisha White"}, {"rating": 5.0, "review": "The Amazon Fire TV Rocks!! I love it and watch it a lot. I already have my favorites shows. I do wish I was able to watch it on my other TVs without having to buy another one. But it is truly worth the buy. Thank you Amazon for a great product.", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 5.0, "review": "Super easy set up.  Great interface.", "verified": true, "helpfulness": "0/0", "author": "Michael Gordon"}, {"rating": 5.0, "review": "I haven't had the chance to really explore all of the features yet & I'm certainly not going to use all of them, but for my needs/uses it's the bomb! Just plug it in, go thru the short tutorial, & you're watching what you want.", "verified": true, "helpfulness": "0/0", "author": "Mark L"}]