[{"rating": 5.0, "review": "Very fast loading, amazing wifi signal strength, and very easy to set up. The Amazon Fire TV is sent to you already logged in to your Amazon Prime account, so after taking the 2 minutes it takes to set it up, you can jump straight on to watching your favorite movies or tv shows.The voice control ONLY searches through Amazon movies, even if you have Netflix/Hulu/etc. installed. That is the only weak point but it doesn't bother me at all.I personally do not have a gaming console at the moment, and I think I may have made a mistake in not ordering the gaming controller for this, as it offers plenty of little games you can download and play. Best in my opinion would be that it has GTA 3, Vice City, and San Andreas up to buy and play. Which were some of the best games I've ever played before.", "verified": true, "helpfulness": "1/1", "author": "Jon Graves"}, {"rating": 4.0, "review": "but new newer movies", "verified": true, "helpfulness": "0/0", "author": "Joyce I. Layton \"joyce layton\""}, {"rating": 4.0, "review": "I think this is greet", "verified": true, "helpfulness": "0/0", "author": "Louis Canoro"}, {"rating": 4.0, "review": "I like it but the homescreen is much too busy for me.  I understand they are hawking Amazon media but I would much prefer an option to have all of the Amazon stuff contained in a separate app.  I have been using Roku boxes for years and I definitely prefer them, however I bought this to run Kodi and it does that extremely well.  It does work better with a hardwired connection but the WiFi is not terrible.  I use it, but will not buy another one most likely.", "verified": true, "helpfulness": "0/0", "author": "C. Waycott"}, {"rating": 5.0, "review": "Great product. I'm able to stream everything I need and even cancelled my TV service.", "verified": true, "helpfulness": "1/1", "author": "Justin Nichols"}, {"rating": 5.0, "review": "I have had my FIRE TV well over a year. It is in use every single day. Never had a single problem. The VOICE search feature alone is worth the price. Really beats having to one-finger type like the other \"smart\" TV apps I have tried. Would repurchase immediately if anything happened to this. Use the Fire to get to my Netflix, Youtube, and Hulu videos as well as all my Amazon content.", "verified": true, "helpfulness": "1/1", "author": "RCBartlett"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "1/1", "author": "michael trimboli"}, {"rating": 5.0, "review": "fast and easy!", "verified": true, "helpfulness": "0/0", "author": "Shirley Hackert \"shirleyinroseville\""}, {"rating": 3.0, "review": "It isn't any better than my apple TV so I am not sure yet if I will keep it.", "verified": true, "helpfulness": "0/1", "author": "Dirk Tripke"}, {"rating": 5.0, "review": "This is a awesome device", "verified": false, "helpfulness": "0/1", "author": "Brian Murphy"}]