[{"rating": 5.0, "review": "We love fire TV.  Couldn't be easier to set up.  Paired with HULU and an antenna, it has freed us from the huge cable bills that continued to go up despite that fact that we had no premium channels or movie channels.  Now we watch what we want,, went we want.", "verified": true, "helpfulness": "0/1", "author": "Diana M."}, {"rating": 3.0, "review": "Having trouble hooking into a spare hdmi slot.", "verified": true, "helpfulness": "0/1", "author": "Richard Hoover"}, {"rating": 5.0, "review": "I really enjoy the Amazon Fire. I have an older  55\" plasma 1080p TV, and this adds the features I'm missing.", "verified": true, "helpfulness": "0/1", "author": "Michael S. Bshero"}, {"rating": 5.0, "review": "Exactly what I have come to expect from Amazon products. Took about fifteen minutes to be up and running with 12 of that spent updating. Very small box for what it is capable of.", "verified": true, "helpfulness": "0/1", "author": "Tatum A Combs"}, {"rating": 5.0, "review": "My husband loves it!!! Bye bye to cable bills.", "verified": true, "helpfulness": "0/1", "author": "Kameisha Armstead \"Vergo Girl\""}, {"rating": 4.0, "review": "Installed with a mount in just minutes. Really like the feature function of the system. Still working out how it all works.", "verified": true, "helpfulness": "0/1", "author": "omegaflt"}, {"rating": 5.0, "review": "Exactly what I expected.", "verified": true, "helpfulness": "0/1", "author": "Ronda K. Raifsnider"}, {"rating": 5.0, "review": "Fire TV is wonderful!  I gave up overpriced cable and now have Prime, HULU, and Netflix.  Fire TV makes it so easy to search and/or browse for movies and tv shows.  It was relatively easy to set up and learn to use.  If you subscribe to several services as I do, it is well worth the money.  And I really like the voice search feature. You won't be disappointed.", "verified": true, "helpfulness": "0/1", "author": "JaneAustenFan73"}, {"rating": 5.0, "review": "What can I say.... Amazon is the BEST!!!", "verified": true, "helpfulness": "0/1", "author": "Brenda Rylander"}, {"rating": 5.0, "review": "I love everything about the technical end of this product. The movie selection is not very friendly. I wish they would allow you to search for the free stuff", "verified": true, "helpfulness": "0/1", "author": "tim mcanally"}]