[{"rating": 5.0, "review": "I love it! I used to use my Wii for instant streaming Netflix but I would constantly have to reconnect to the internet. That has not happened since I bought my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline S. Morris"}, {"rating": 5.0, "review": "I am so enjoying my Amazon Fire TV, having so many apps together under one roof is just plain great. One can add movies or TV shows so easily to watch.", "verified": true, "helpfulness": "0/0", "author": "Tommy \"just me\""}, {"rating": 4.0, "review": "i love it but in my country is not possible see all movie and tv series", "verified": true, "helpfulness": "0/0", "author": "diazazon"}, {"rating": 3.0, "review": "I am from Istanbul/Turkey and I am a front pace tech follower so I bought the Amazon Fire TV as soon as it is available to buy. But for the region I live in, the Amazon Fire TV does not support the area that I cant use its 100% potential so I am looking to root it to take full advantage of it. I also purchased 2 Amazon Fire Controllers and now it seems my new gaming platform on my lovely Samsung UE55HU8500 curved TV. Otherwise its a new platform near my Apple TV to play games and watching stuff..", "verified": true, "helpfulness": "0/0", "author": "Sahfaruk"}, {"rating": 5.0, "review": "Nice addition to the home entertainment setup. The fire tv box packs a lot of performance in a small device. Very fast, voice search actually works. Liked the first so much purchased a second.", "verified": true, "helpfulness": "0/0", "author": "jason buchanan"}, {"rating": 1.0, "review": "The last straw was trying to charge me for a PBS Nova program!!! Screw this! I'll go back to YouTube and watch for free. A little truth in advertising would be appreciated and I WILL be sure to spread the word.", "verified": true, "helpfulness": "4/9", "author": "Dave Johnson"}, {"rating": 5.0, "review": "love this thing", "verified": true, "helpfulness": "0/0", "author": "Dave Sprole"}, {"rating": 5.0, "review": "I love it. It is easy to use and was easy to install.  Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Janet C. Murphy \"J from maine\""}, {"rating": 5.0, "review": "is the best streaming box in the world . my child is very happy.and me too", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"toledo067\""}, {"rating": 4.0, "review": "The Amazon Fire Tv, has a lot to offer, especially if your are within the Amazon umbrella of products. The video streaming was great and the ease of use of the interface was very smooth. I unfortunately have an IPhone and even though it was usable, it wasn't quite what I wanted. Airplay compatibility would be great but that's easier said then done. Other than that I would recommend the Amazon Fire tv to anyone who wants video streaming capabilities along with games and apps on their tv.", "verified": true, "helpfulness": "0/0", "author": "Johann \"Always in search of a good historic or sci-fi story. Films and books inspire me to write.\""}]