[{"rating": 4.0, "review": "It is very snappy going through the menu's. The games are really good surprisingly. The one thing I don't like is trying to sort through the movies. This is were netflix has it down. The voice search does work really well. Being a prime member I thought more movies/tv shows would be included. There are many you still have to buy/rent.", "verified": true, "helpfulness": "0/0", "author": "Paul Seaton"}, {"rating": 5.0, "review": "We are so pleased with our Amazon Fire and the Amazon Prime programs!  Loved the Bosh series, actually the reason we switched from Apple T. V.  Please feature more!!!!", "verified": true, "helpfulness": "0/0", "author": "carrie sage"}, {"rating": 5.0, "review": "I love my fire TV the only thing I wish it had was VUDU.  I love the voice activated search.  Smooth and flawless when switching between shows or apps.  Would absolutely recommend!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "All I can say is \"WOW\", the speed, the voice recognition, how easy it is to hook up and operate, I love it, best investment for the money!", "verified": true, "helpfulness": "0/0", "author": "James Gibbs"}, {"rating": 5.0, "review": "This is a great way to cut the cable and get rid of the dish", "verified": true, "helpfulness": "0/0", "author": "timothy w raines"}, {"rating": 4.0, "review": "Everything as advertised. I would have given it 5 stars if it had a browser.", "verified": true, "helpfulness": "0/0", "author": "E. Rivera"}, {"rating": 5.0, "review": "Fire is an excellent product that is easy to install and use. Very happy with it", "verified": true, "helpfulness": "0/0", "author": "Jeffrey K."}, {"rating": 5.0, "review": "My daughter gave it to me for Christmas and I love it", "verified": true, "helpfulness": "0/0", "author": "gillian   bailey"}, {"rating": 3.0, "review": "I love Fire TV, but was a little disappointed with the amount of Channels vs Roku Channel's. There seems to be more Roku channels.  The games are sufficient, as opposed to not that many games on  Roku.  I'm nearly 60 years old and do get bored and play games, if I can get them to work with the game controller. LOL!!!!  Maybe someone should video my confusion with that......HA!!!!!  I play a ton of Tower Defense games.  Strategy seems to be more my thing.......as long as they're Free and, if I can find them.  The movies are great, but I already have Netflix.  And to have to purchase Prime to get the full benefit of Fire TV, seemed a little bit redudant, and expensive to me, but hey........ What do I know?!?!?  I'm an old man that's just trying to stay tech savvy!!  (((Which sometimes is a big \"FAIL!!!!\")))  I don't have kids so games, unless they are the type that I  specifically like.....maybe someone should check into that.  (((???)))  Thanks for the opportunity to vent a little bit about this.", "verified": true, "helpfulness": "1/2", "author": "Donnie"}, {"rating": 4.0, "review": "Player works great with streaming content.  No Problems.  I like the little remote, hope I do not lose it.  -BUT-  The USB port is for a game controller or something only.  The player will not play photos or videos from the USB.  I was very disappointed.  You can upload files to amazon and play them, but only up to 20 min video files, and uploading is a real pain.", "verified": true, "helpfulness": "0/0", "author": "Kevin Champion \"Old Engineer\""}]