[{"rating": 4.0, "review": "Amazon Fire TV. is the best of all the devices out there. The only thing that is missing is the drama fever app. If that where to be there, there will be no reason for me to buy roku.... Because Amazon Fire TV. rule.", "verified": true, "helpfulness": "0/0", "author": "Opeyemi Ogunleye \"victor\""}, {"rating": 5.0, "review": "I was very surprised at the quality of the Fire TV.  The things that you can watch with it are great and such a variety.  And the set-up, well it was so simple, even I  could do it-lol.  I love the small remote so easy to handle and the voice search is great!  The only thing I don't like is my slow internet connection which is the down side for me.  But hope to change soon.  If you love movies, games, news and just looking at pictures buy fire tv, its great.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I bought a couple of these. They're pretty cool if you're coming from AppleTV which has been ignored and underdeveloped for a couple years now. What's nice about this is it can do some light gaming in addition to Netflix, YouTube, etc. The FireTV has some horsepower for a little box and switching from apps to games to TV and movies is really fast.The Fire remote is actually really outstanding. You don't have to point it at anything. Just press the buttons and it works. And the voice recognition is pretty spot-on when it's working (sometimes needs a reboot by power-cycling because there's no on/off button). But I wish you could use the voice features within apps like searching within YouTube for instance. It needs more integration throughout the experience, but it's pretty nice so far.If you've got Prime, this is a no brainer. Go and get one right now. They give you a bunch of Amazon \"points\" which is enough to buy quite a few Android apps. Playing some of these little Android games from the couch using the remote is surprisingly satisfying if you just want something fast and fun. If you've got little kids, go out and get this right now. There's just something so freakin' awesome about grabbing this very nicely proportioned remote, pressing the mic button, and saying Sesame Street and poof...there it is, ready to go. I actually really like the Amazon remote a lot. It's got a much nicer feel compared to AppleTV's annoying little silver thing that always gets lost in the couch.Where Amazon Fire TV falls down is the absence of HBO Go (even if they've got a lot of HBO content via Prime, it's not HBO Go). Also it autoupdates which is annoying. The last update had some gnarly bugs and messed up this nice feature which let the Fire TV remote turn on the correct HDMI input from our Sony TV which was so nice not to have to grab two remotes. Then half the Prime material refused to load for a week. It would play on our iOS Amazon Prime Video apps which I could Airplay to AppleTV, but I couldn't play them on the Fire TV! Also, certain titles like GTA San Andreas probably shouldn't be ported over to devices like FireTV. There's not enough room for more than a couple games when they're that big and also the gameplay isn't satisfying on FireTV, even with the game-controller which is just kind of meh. Apart from those caveats, I'd say FireTV is pretty awesome and definitely worth $100 if you don't have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "mattmattmatt \"iivi\""}, {"rating": 3.0, "review": "Very, very good hardware. Love the non line of sight remote, the optical audio out. Would like more options on things such as auto out when video screen is off (what about listening to music?). Has become my primary source for viewing entertainment at home. I don't need local storage (NAS) but some may want it and knock the HW for lack of it.Prime is what it is, and not every piece of content is on it.The user interface is poor however in that it does not make clear whether you are getting the free stuff or have to pay. I can tell, but my wife has been fooled and she was upset. I suspect deliberate intent on Amazon's part and that docks them 1 star for lack of clarity and 1 for intent.Many other aspects of the UI, options, etc could be better to get the software to the level of the hardware.", "verified": true, "helpfulness": "0/0", "author": "FD"}, {"rating": 4.0, "review": "So far it has been great, I highly recommend it. The ability to play music from my collection is an added bonus. I've only scratched the surface so I give it four stars which could change to five if it keeps exceeding my expectations.", "verified": true, "helpfulness": "0/0", "author": "Steve Heater"}, {"rating": 5.0, "review": "Works perfect, easy to operate. I have Google chromecast and it's ok. We decided to purchase one Fire to test out instead of going gungho like we did with the chromecast. My husband the electronic expert loves the Fire and wants to purchase one for each room already. I have had it \"act up\" once but I unplugged it and when I plugged it back in the Fire worked perfect again. Other than adding more apps I'm not sure it could get any better.", "verified": true, "helpfulness": "0/0", "author": "denise emerson"}, {"rating": 5.0, "review": "An amazing little box. From a sheer power perspective, nothing in it's class comes close. With XBMC, this serves not only as my streamer for Netflix, etc...this replaced my HTPC...it's that good. Quad core processor, dedicated GPU, 2GB ram...Roku 3 is it's closest competitor at 512mb! Nothing else I can say will show how impressive this unit is...just get one. I ordered a second for my daughter. Techie or not, you should love it....and for 99 bucks....come on.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "This is a great start for Amazon, with the potential for even larger choice's to come.", "verified": true, "helpfulness": "0/0", "author": "SEAJAY"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "WILLIS ARROYO"}, {"rating": 5.0, "review": "Great idea to make my HDTV a smart TV. As a senior I appreciate being able to see movies on my Amazon Fire TV. Exciting and good for me to try and keep up with the new technology. Just love it.", "verified": true, "helpfulness": "0/0", "author": "Norma Jean Richards"}]