[{"rating": 5.0, "review": "i bought this to put inmy room but moved to basement workout area - it is great for downloading workout DVD's.  I am going to buy more for the other TV's in the house!", "verified": true, "helpfulness": "1/1", "author": "BabsMK \"Babs\""}, {"rating": 5.0, "review": "I love my Fire TV! For 100 bucks you can't go wrong! I live in the country and have one of the worst internet connections. With this little box I have no buffering at all with the amazon app or any other apps I've tried. I would definitely recommend this product!", "verified": true, "helpfulness": "1/1", "author": "jill"}, {"rating": 4.0, "review": "Bought this on release date, love it for the most part. Very fast, Voice search works perfect. Great selection of shows and movies, (although some pricey) However when reading about the product one key selling point for me was WWE network was going to be available, well I still can't find it and it's a pain watching it on the tablet (whole different story we won't go into) But I was just wondering if anyone knew anything about this?", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am ready to pull the plug on cable since I can get everything I need on the Kindle Fire.  The only down side is I can't get my local baseball games or games from the Big Ten Network.", "verified": true, "helpfulness": "3/3", "author": "Kim"}, {"rating": 5.0, "review": "I got this to watch selections of the 10,000 movies/TV programs that are available free with my PRIME membership and it does a fantastic job. The remote is nice and small and so doesn't take up much room, yet does a superb job of controlling the program. When not active, it displays a screen saver with some awesome photos of landscapes throughout the world. Very nice, though I wish they had a description of where the photo was taken. This unit does a lot more than what I'm using it for but with Amazon PRIME Instant I find I don't really need Netflix, Hulu or any of the other services. I do have TIVO and have for several years but TIVO can't do the free PRIME Instant movies/TV programs, only the paid ones.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have both a Sasmsung BLu-Ray player with Internet connection and a Roku XD streaming box - the Amazon Fire TV beats them both in quality of output, ease of sue and speed of processing - the added gaming is a nice extra", "verified": true, "helpfulness": "1/1", "author": "Gizmo"}, {"rating": 5.0, "review": "The potential is astounding! I can't wait to see how it evolves! Spent all last weekend watching tv/movies/playing games.great!a great purchase!", "verified": true, "helpfulness": "1/1", "author": "Jeffrey Frieling"}, {"rating": 5.0, "review": "love it love it love it thank you for my wonderful evening with my Fire TV we be watching thks", "verified": true, "helpfulness": "0/0", "author": "RosaLinda Galvan"}, {"rating": 5.0, "review": "This is definitely the best purchase I have ever made in the entire 10+ years I have been an Amazon Prime customer. I am purchasing another for room downstairs. Would highly recommend.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Im just install my AFTV. Here are my opinions about it.Speed:  Excellent, more that my Roku 3, ATV3, and BDP 590Display: HDMI 1080p with a Sony Bravia (2103) TV, NO 24p frames.CEC: The AFTV has basic CEC. I can use the TV Remote to control play controls at it. BUT i cannot find equivalent HOME button  in the TV RemoteStorage:  8GB is to little... with basic apps I only has 4.35gb left (i didn't download any games yet)Subtitles:  On Netflix and Crackle are working...has to test on Hulu.Audio:  This is a Hot issue because before the AFTV, only Apple TV2/3 and pre 2013 Sony BluRays (so no ROKU no ChromeCast) had the options to decode and output Dolby Digital (NO PLUS). When i saw that this item was Dolby Digital certified I made the decision to buy it.  When I make the first installation earlier tonight I only receive Stereo...Checking the settings I saw a difference....the Amazon Fire TV CAN output Dolby Digital (5.1) ONLY via Toslink if you configure so in the setting>audio pane. This is important for many folks because older (but fully functioning) receivers cannot decode DD+Media Access: We know that Amazon wants that we consume their media products (films and tv shows) but I think that they make a pragmatic decision to make a box for Prime but without closing everything as Apple TV3.  We can use Plex, and the techies ones can install others media players also.For a price I can live with it, I hope that in future software updates we can have DLNA and maybe Dolby Digital on HDMI (as sony bdp/appletv)", "verified": true, "helpfulness": "2/2", "author": "Yamil Camilo"}]