[{"rating": 5.0, "review": "Great to have a second option for watching movies on those long snowy days.", "verified": true, "helpfulness": "0/0", "author": "D. Norton"}, {"rating": 5.0, "review": "I cut the ties from satellite tv using fire tv and have never been happier.  Great device. I'll never go back to paying for dish tv again.", "verified": true, "helpfulness": "0/0", "author": "Johnalee"}, {"rating": 2.0, "review": "I was very excited to get this being as our smart tv didn't always work the best for streaming and the majority of the time we had to use my computer to watch Netflix and hulu. Amazon fire tv worked amazing the first day... it was the next morning that it would not turn on for anything. Seriously had it connected for less than 24 hours and will not work, no little white light, nothing. Now this could be a defective box and I'll change my review if we end up getting a replacement but at the moment I'm not too happy.", "verified": true, "helpfulness": "0/1", "author": "AJ"}, {"rating": 5.0, "review": "I love itGood!!!", "verified": true, "helpfulness": "0/1", "author": "Baesang Jang"}, {"rating": 1.0, "review": "The is the most awesome system.  We run it nearly all day... BUT it locks up on me multiple times during the day.  This morning, I have  already reset it 5 times and it seems that I won't be watching anything because it keeps locking.  I have rebooted and unplugged. Oh well.  It isn't my connection because it was happening even when I was just looking at my settings.  I hope an update comes soon that will fix.UPDATE 5/13/15HATE IT!  Locks up so much that I just went back to using PS3.", "verified": true, "helpfulness": "0/0", "author": "livingwordteacher"}, {"rating": 5.0, "review": "Excellent device and the Amazon Prime membership is proving to be well worth the money we spend on It monthly. It works well and setup is very easy and not challenging.  I like.", "verified": true, "helpfulness": "0/0", "author": "W. LaValle \"Billy\""}, {"rating": 5.0, "review": "Love this device!", "verified": true, "helpfulness": "0/0", "author": "Sam K."}, {"rating": 2.0, "review": "I have eight devices in my system, including Fire TV.  The other seven can be controlled from a single integrated remote (Harmony), but the Fire TV can't be. Amazon apparently doesn't think that's important, but we do.  And, Amazon should have concentrated on a wider range of \"apps\" and got that right before adding the gaming and other features.  For example, there is no CNET app, but you can get that on the Roku 3.  On the other hand, the Roku 3 has firmware problems that preclude its continued use here.", "verified": true, "helpfulness": "0/1", "author": "Floyd Sense"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "misty oranday"}, {"rating": 5.0, "review": "It's so easy to use and has a lot of great shows and movies available", "verified": true, "helpfulness": "0/0", "author": "Sara Andrzejewski"}]