[{"rating": 5.0, "review": "Easy setup and easy to operate.", "verified": true, "helpfulness": "0/0", "author": "David Jennette"}, {"rating": 3.0, "review": "To Many things you steal have to pay for. i mean your paying all the money you would expect to get more", "verified": true, "helpfulness": "0/2", "author": "tammy"}, {"rating": 5.0, "review": "This is our second Fire TV. We loved the first one so much we got one for the other TV so we could watch movies, TV shows, and play games upstairs. We've downloaded all our apps including Hulu and Netflix. The one or two things you can't get immediately, you can still watch on cable but it's much cheaper to buy individual seasons than to pay for cable. All you have to do is switch the input. Just make sure you buy the HDMI cable to hook it up to the TV.", "verified": true, "helpfulness": "1/1", "author": "Suzanne Spence"}, {"rating": 4.0, "review": "Amazing speed and super easy setup and use. Faster than my Apple tv and to roku 3. Only down side is you can't stream 4k with it. Maybe the next generation will be hdmi 2.0.", "verified": true, "helpfulness": "0/0", "author": "jeff e marks"}, {"rating": 4.0, "review": "I've had Fire TV for about a week and have been happy so far.  Received it as an Xmas present and am using it to replace my Roku XS.  Some Pros and Cons of Fire TV:Pros-Voice search works pretty well and is much more convenient compared to spelling out your search-YouTube app is much faster than on the Roku.  The processing power of Fire TV shows that its a big difference- Gaming is actually pretty fun, even without the controller.  It would be great if someone made a emulator app for the Fire.- Fit and finish of the box and remote are both top notch.Cons- Still not as many channels compared to Roku- Movie search only brings up Amazon selectionsOverall, I'm really pleased with Fire TV.  If you are already heavy into Amazon eco system, definitely pick one up.", "verified": true, "helpfulness": "0/0", "author": "Ron G"}, {"rating": 4.0, "review": "Really like so far. Easy to set up. Still learning to work with fast forward and rewind on videos. A bit tricky.", "verified": true, "helpfulness": "0/0", "author": "Amanda H."}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Ywaniw"}, {"rating": 5.0, "review": "I love it best thing i ever bought for entertainment", "verified": false, "helpfulness": "0/0", "author": "Jaedin Owens"}, {"rating": 4.0, "review": "Great product.  My only complaint is that Amazon has not secured permissions for use of History and A&E; channels through DirecTV.", "verified": true, "helpfulness": "0/0", "author": "Karen S"}, {"rating": 4.0, "review": "took me awhile to figure out how to connect & all but finally got it up and running and the g.kids are just \"lovin\" it  :)  Haven't had a chance to watch any really good movies because of all the fun the kids are having with the games etc.", "verified": true, "helpfulness": "0/0", "author": "Ginger"}]