[{"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works well and helps cut down on cable cost.  I will probably give it 5 * when I'm able to upgrade to Verizon FiOS.  The better quality internet should do away with video lag and buffering.  The only I don't understand is why I have to have a cable subscription to use some apps ( Disney Jr, HBO go, etc ) I thought the whole point was to eliminate cable.", "verified": true, "helpfulness": "1/2", "author": "derek vincent"}, {"rating": 5.0, "review": "use it all the time, even with other services.", "verified": true, "helpfulness": "0/1", "author": "William McClintock"}, {"rating": 5.0, "review": "Simply love Fire TV and I have always been an Apple product user. Easy to use and love the voice activated search feature.", "verified": true, "helpfulness": "0/1", "author": "AV"}, {"rating": 5.0, "review": "Delivers as promise", "verified": true, "helpfulness": "0/1", "author": "rjo"}, {"rating": 5.0, "review": "love the photos,prime movies and tv shows", "verified": true, "helpfulness": "0/1", "author": "James Edward Tucker"}, {"rating": 5.0, "review": "I'm a big Apple fan and have been waiting for the newer version Apple TV. With the slow summer season decided to bit the bullet and go ahead and try Fire TV. When it comes to simplicity, and \"hassle free\" install, Apple can sure compliment Amazon buy duplicating the Fire TV experience. I spent more time trying to figure out how to open the battery compartment on the remote than setting up the entire system. If you're a Prime Member, your account is preloaded and ready to use. This product is so easy they don't even shrink wrap the batteries in those annoying hard to open packages. Extremely well thought out. The unit is so small, it takes up no space. The remote is very well designed and voice recognition is up and running with just 2 or  3 tries. The most difficult aspect of the entire install process is finding the HDMI connection on your exisitng TV and making sure you know the password for your wifi connection.  Nice intro video pops up and walks you through. The entire product is very intuitive and equal, if not exceeds, the simplicity of Apple products. If you read through the reviews, you'll see that Amazon is responding to customer issues that have to do with menus etc. The only real valid issues seem to be on the menu side  which has nothing to do with hardware you're purchasing.  All  of my electronics are Apple and it took awhile for me to purchase the Fire TV, I'm sure glad I did!!", "verified": true, "helpfulness": "0/1", "author": "Steve"}, {"rating": 5.0, "review": "I love my fire tv! Getting rid of cable and obtaining my fire tv was the best thing I did in a long time!!!", "verified": true, "helpfulness": "0/1", "author": "On my way 2014! \"deal maker\""}, {"rating": 5.0, "review": "Does everything I expected, except wish it had a email app and internet browser.", "verified": true, "helpfulness": "0/0", "author": "Lee Knudsen"}, {"rating": 5.0, "review": "So far, we have watched two movies that we would never have thought of watching, and thoroughly enjoyed both of them.  I look forward to checking out \"Transparent.\"", "verified": true, "helpfulness": "0/1", "author": "SueD"}]