[{"rating": 4.0, "review": "This is a very nice device for Amazon Instant Video users (though, as others have pointed out, there doesn't seem to be a good method of looking just at genres of Prime Videos, like the Roku 3 has, and this is one of two reasons why I gave it 4 stars). That being said, it is *very* easy to set-up and the voice search function is accurate and convenient. It also has some little things that make it give a very good first impression (the frustration-free packaging is really the nicest-looking packaging I've ever seen, the screen saver is lovely, and the remote has a very pleasant velvety soft surface on it). Furthermore, the wireless game controller is a great idea. No, there aren't a lot of games at present, but there's likely to be more on the way. My biggest gripe with the games is that they don't show ESRB ratings. Instead, they use a throughly unhelpful system of \"All Ages\", \"Guidance Suggested\" (which can cover anything from E to T and gives NO idication of what specific content is in each title before purchase), and \"Mature\". The terrible content rating system they've devised for their apps is the other reason I gave it 4 stars (and a much bigger reason than the first, at least for me). I like to know BEFORE I buy a game if it has obscenities in it (because I don't want to deal with rude and profane language - who would?). The ESRB system is FAR more helpful (with it's extra descriptors) than \"Guidance Suggested\". How is a parent supposed to know ahead of time if the game is something they don't mind their children playing if they aren't told exactly what kind of content to expect before purchase? (The broad range of possible content in the \"Guidance Suggested\" category is every bit as helpful as saying that a potential roommate has commited one or more of the following crimes: murder, assault, DUI, theft, a parking violation, or jaywalking.)  Are they going to give a refund for a game that a parent later finds to contain objectionable content they were not *specifically* told about? (I'd bet they won't.)So, in short, it's a nice streaming box with a very pleasant set of features, but it falls short in the ability to search through free Prime Videos (which, by the way, the Roku 3 *does* offer) and the content rating system for their games is deplorable and unhelpful (VASTLY inferior to ESRB rating system). Even with those two issues, it's a nice set-top box to buy if you like the idea of voice search and you're interested in playing cheap games with a console-like wireless controller (though I'd have some serious doubts about allowing a kid to play with it unless I had played the games first to make sure they're okay - that's not convenient for every parent to do).", "verified": true, "helpfulness": "1/2", "author": "Pamela T. \"Pamela Thistlethwaite\""}, {"rating": 3.0, "review": "While the graphics and voice search are both amazing there really isn't much you can do. I've had this product for 3 days now using basically non-stop trying to find something that makes this product worth $99. It doesn't do much more than my kindle. The only thing this does that my kindle doesn't is voice search. I basically payed $99 for a bigger projection of my kindle.Lets talk features;Amazon Prime; If you don't have Amazon Prime or are never getting it in the future DO NOT buy this device. if you don't have Prime all you can do is play games, the good games need the $40 controller, listen to music and certain apps. I use the music feature when I want to fall asleep, I could easily use my radio but I'm trying to get my money's worth.Photos/Videos; you can upload pictures and videos you've taken to show family and friends on a bigger screen. I find this feature useless, I can see why people would use it I just have no use for it.Games; Games are okay but without the controller (which is an extra $40) They're not as simple to get the hang of.My mom bought this for me as a gift so I'm not trying to complain too much but if I had payed for it myself I would have sent it back the second day!", "verified": true, "helpfulness": "2/4", "author": "Josh Mixon"}, {"rating": 3.0, "review": "Amazon Fire TV's interface is busy & redundant compared to Roku's clean interface, which is easy to use and elegant. Also the remote needs an IR blaster to make it compatible with a universal remote. Roku's remote work's through bluetooth & IR & I love it's ability to use headphones, but I hope with an update Amazon Fire TV will work with bluetooth headphones in the near future. When it comes to channel  availability there is no comparison because Roku has tons (more than a thousand) more selection.What I like about Amazon Fire TV is that it has the processing power, resources, & the room to improve greatly to a really awesome streaming media player. I believe with the extra power it could have better performing apps/channels/games than its current competition. Also it has something going for it with its ability to play android games. We are not that far off to getting a truly cheap but powerful android indie gaming box, but I do not know if this particular model is it ... doubt it seriously. I also wish this box had a browser with flash like Google Tv but I don't think that will happen. I do feel this is a potential \"Every Box,\" through more updates to add channels & a cleaner interface, but as of right now it is just a \"Meh Box\".Amazon Fire TV channels load quickly & the remote has a fast response time, but Roku 3 as of now is still the best streaming media player for entertainment.", "verified": true, "helpfulness": "2/3", "author": "Honesty"}, {"rating": 5.0, "review": "Just received the product and after just some issue caused by me with the WiFi requiring a Mac Address Authentication installed and working 100%. Only wish is that in the future they upgrade it to allow my vast library of locally stored movies on my Network Attached Storage (NAS) drive. Other than that this is a Go for it purchase.", "verified": true, "helpfulness": "1/1", "author": "Wbruff"}, {"rating": 4.0, "review": "It's small, smaller than I expected. The remote is small, light, and easy to handle. Picture quality is outstanding, as you would expect. The voice search feature works beautifully, and as of now has recognized perfectly everything I've said to it. Very nicely done, Amazon.The out-of-box presentation is elegant. You have to connect the power adaptor, and the HDMI cable to your TV. (That means, your HDTV.) You have to put the 2 batteries (included) into the remote, and then turn it on. Configure it for your WiFi Internet connection, and you're good to go. Amazon has already thoughtfully registered the device to your Amazon account, so there's absolutely no additional setup necessary.Why only 4 stars, and not 5? Well, the Roku gets 5 stars because of the many dozens of additional channel options with the Roku. However, all your favorites are here on the Amazon Fire, including Netflix, Hulu, Pandora, for example.Should you get the Roku vs. the Amazon Fire? You'll probably be happy with either, especially if you don't think you would bother with all the additional channels available with Roku. For the usual things, the two are essentially identical. If you need a wired Ethernet network connection, there is a Roku model with that, and the Amazon Fire (like many other boxes) uses only WiFi. However, the Amazon has the nifty voice search feature, which is a clear improvement over Roku. (And I've been a Roku fan since it first came out.)", "verified": true, "helpfulness": "1/1", "author": "Sonoma's Davey"}, {"rating": 5.0, "review": "This is my first...it is fast and smart and sleek.  It is so good, I'm dropping my cable TV. The picture is first rate...much better than my Comcast box. The voice control is very smart. I would love to be able to search within programs like Netflix, but I think that will come. This also pairs easily with my Kindle Fire HDX. This is not yet perfect, but it is close, and will only get better. What a bargain for $99.", "verified": true, "helpfulness": "1/1", "author": "Pierce"}, {"rating": 3.0, "review": "I ordered the Fire TV as soon as it was released.. I was very excited to get my hands on it. After using Apple TV for more than a year, there was some adjustments especially on how the apps were laid out. I find the Amazon TV a bit busy and too many redundancy, but hopefully I'll get used to it soon. I think the goal was efficiency of finding the apps that Apple TV couldn't provide. As for the speed, netflix and hulu lags, and it's not once or twice, but always unfortunately... Hopefully, an update will be able to fix this. I am also looking forward for new games to be released!", "verified": true, "helpfulness": "1/1", "author": "Kim Que \"Kim Que\""}, {"rating": 5.0, "review": "I just received my new Amazon Fire Tv and I'm just crazy about it allready!! It was so easy to hook up and I am looking forward to many years of good service and entertainment from this little device!! I am as I write this listening to the Pandora on it and love it!! Im also a Netflix member and look forward to trying it out as well!  I would say if your thinking of getting this Do It!! It is sooo cool!! Thanks Amazon for all of your service and products!!", "verified": true, "helpfulness": "0/0", "author": "Brian K. \"love electronics\""}, {"rating": 5.0, "review": "I was amazed! Right out of the box this lives up to everything expected and advertised.  We have used Roku players and they do not hold a candle to Amazon fire. We love it love it love it.  Also, I love my Amazon Prime account and watch a lot of the movies included as a member.", "verified": true, "helpfulness": "2/2", "author": "Norma J. Rahn \"Artist in continual training\""}, {"rating": 3.0, "review": "I received the Amazon Fire TV and set it up pretty easily. The small footprint is nice and I like the way that if your an Amazon Prime member that it is already set up for you. Now the thing I do not like is the lack of applications. I am sure they are coming soon but Amazon does not have all the EpixHD movies just some of them.. I do not think EpixHD will come out with an app for Amazon mainly because they already have an agreement in place.", "verified": true, "helpfulness": "1/2", "author": "Billie"}]