[{"rating": 5.0, "review": "The Amazon Fire TV took less than 5 minutes to set up. I purchased an AmazonBasics High-Speed HDMI Cable (6.5 Feet/2.0 Meters) - Supports Ethernet, 3D, and Audio Return [Newest Standard], plugged it into the Fire and then into an open HDMI port on our TV. I plugged in the power cord to an outlet. As soon as I started the Fire up there was a welcome message with a few instructions about how to use it. (Super simple). I entered the password for our Wi-Fi network and we were ready to go.Most of the streaming movies and TV shows that we watch are from Amazon Instant Video so this makes it easy to find the shows we want to watch. We do have a BlueRay player and a TV set that will each connect to streaming sources, but text lots of clicks and searching back-and-forth through different menus to finally get to the movie we want to watch. With the Fire it's so simple, just say the name of the movie, TV show or even the name of an actor or actress and it takes you right where you want to go. Most of the time we don't even have to switch the menu for the HDMI port. Just speaking into the remote changes it for us.We have Amazon Prime so there are lots of movies and past TV shows to watch. I watched 3 seasons of Suits (Very good show.) and we're now into the second season of House of Cards. (Another excellent show!) This device makes entertainment simple. I love it.", "verified": true, "helpfulness": "2/2", "author": "PT Cruiser"}, {"rating": 2.0, "review": "I wanted this to be a great product so badly! But tv freezes and skips on all platforms. I have a Roku as well and the Roku doesn't have this problem so I'm pretty sure it's not a wifi connection problem. I have been a fan of Amazon Kindle hardware and hoped this hardware would be great too. It isn't quite there yet.", "verified": true, "helpfulness": "2/2", "author": "Jane"}, {"rating": 5.0, "review": "My husband and I both love our Amazon Fire TV device. WE stll have a hard time remembering how to get back to our TV.I need to learn a little more about how to get our Pictures from our Mac to the Amazon Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Katie Collard"}, {"rating": 5.0, "review": "can i have a free 30 day trial please", "verified": false, "helpfulness": "0/6", "author": "Jon Derr"}, {"rating": 5.0, "review": "Very convenient access to entertainment!", "verified": true, "helpfulness": "0/1", "author": "Stanley Anderson"}, {"rating": 4.0, "review": "I would give 5 Stars for the ease of  installation and operation, but one concern I have is that there is no \"off position\" the instructions say to disconnect the electricity to it.", "verified": true, "helpfulness": "1/1", "author": "EWG"}, {"rating": 1.0, "review": "Problems with this device. While streaming Amazon Prime program, the device consistently dropped wifi connection.  Tried working with representative for resolution..none of the \"trouble shooting\" efforts could resolve the problem.  After 2 days, rep calls and responds that Amazon IT team deemed that my home network was at fault.  Unfortunately that information was inaccurate.  (Note: All other devices connected to home network did not experience any issue including computer, tablet and Vonage service.)  During the \"wait and see\" period to determine if troubleshooting efforts would resolve the problem, device lost wifi connection an additional 3 times within the hour.  I removed the Fire TV, and reconnected my Roku device and continued to watch my program stream via  Roku.  I had no wifi connection lost at all.", "verified": true, "helpfulness": "10/12", "author": "sdrichardson"}, {"rating": 5.0, "review": "My family loves this. Such a variety of shows... from babies, toddlers, teens, adults, to grandma and grandpa, etc.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"LauDenMac\""}, {"rating": 4.0, "review": "As an owner of Apple TV, Western Digital HD Live & Chromecast, I would have to say this product ranks higher in terms of quality, build materials, ease of use and media selection. I love everything about this product sans for two issues. 1) No way to see what kind of content is included with a PRIME membership to stream. You have to use the menu and drill down to the movie view to see if it's available as part of your free PRIME membership to stream or if it costs money. 2) Voice function search only works with Amazon Instant Video for movies and shows. DOES NOT work within Netflix app. I don't know what I expected, but I was disappointed to learn this. I would recommend this product for it's price. I would like to purchase the controller and try the games out at some point. I didn't order the game controller when I purchased mine.", "verified": true, "helpfulness": "1/1", "author": "Dave \"Amateur Photographer\""}, {"rating": 4.0, "review": "Finally figured out I had to access TVFire, like my DVD Player.  I use my TV remote and change my tv input settings to 12.  for the fire it is 13.  I did hook it up right but with very little information to work with / due to a lack of manual I had a little trouble.  Do not like the remote, it is too fast when you try to type in your email and password.  It bounces from letter to letter.  I have been trying to get into my pandora account for a week now.  When I put the email and password in I am timed out.  Added Netflix to my tv fire and was on the phone with the Net Flick guy for four hours but finally got it to recognized me.  The man was great and got my account to finally work with my fire.  I have a few suggestions to help use the tv fire.  Please exclude a full Manuel.  This is helpful for people like me who are not tech savy.  Separate Prime movies and shows from paid movies and shows.  Work with companies like Netflix to help install on the fire tv.  Please add all music especially the prime music you can download for free.  On the whole I love it and am looking forward to watching a lot of movies.  Looking forward to improvements in the near future.", "verified": true, "helpfulness": "1/1", "author": "Genevieve R. Thompson"}]