[{"rating": 5.0, "review": "Love it! Got one for my sister & one for my 70 yr old wife. At last she can find her own movies and TV shows. Easy to set up. Picture is much better than 'throwing' from Kindle. Should include game controller and especially HDMI cable, even if it had to cost a few bucks more.", "verified": true, "helpfulness": "0/0", "author": "David E. Pomper"}, {"rating": 5.0, "review": "Very happy with our new Amazon fire TV.  We have Amazon Prime and are also Netflix subscribers.  That adds up to a lot of free viewing options included with both memberships.  Those are just the two we use, there are many other options for movies as well as being able to put your music and pictures in the cloud and then let's not forget the apps and games.  Navigate smooth through the menu with the included remote.  If you like games, I do recommend the optional control pad (sold separate.)  So far so good, streaming has been flawless.  I had originally had a blu-ray player to access netflix as well but it was always lagging.  The wii has been okay for streaming and does allow for amazon instant video too but I don't need or want multiple wii consoles in my house just to be able to stream in two rooms. Of course now with this tiny little console I'm happy with the streaming and we use it for the apps and gaming too.  Helps us get all the value we can out of our prime membership.If you don't already have one the HDMI cable sold separate... I went with the amazon basics over the belkin, comparable product for half the price.  So connect the 2 cable ends, plug in the power cord and your'e good to go.  It's that easy.", "verified": true, "helpfulness": "1/1", "author": "Kim Karas \"New England mom\""}, {"rating": 5.0, "review": "I love it. Hacked it with Google play and all that. Kinda s***ty its revolves around prime and trying to sell you content but whatever. Fast", "verified": true, "helpfulness": "1/1", "author": "Zachariah Rieger"}, {"rating": 1.0, "review": "Why no BlazeTV", "verified": false, "helpfulness": "2/13", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Pros: Is fast, no lag voice search Cons: NO USB support.  This sucks since most of my dvds are on a usb drive.  Why didn't they build this feature in?  Since it has no usb support I recommend the Roku 3.", "verified": true, "helpfulness": "1/5", "author": "jbumgar"}, {"rating": 3.0, "review": "I currently have a ROKU 2 XS, and based on reading some top reviews I would like to buy the 2nd or 3d iteration of this device.I like FSTV [free speech TV] with Amy Goodman, Thom Hartman, Stephanie Miller and Bill Press. ...not offered.", "verified": false, "helpfulness": "0/7", "author": "RickMeister \"muu\""}, {"rating": 5.0, "review": "Hooked on amazon and netflix", "verified": true, "helpfulness": "0/1", "author": "Reed Chittenden"}, {"rating": 5.0, "review": "Beyond easy to set up. Lots to offer. Great investment, better than a game console if you ask me. Perfection with an added external hard drive if you have one laying around.", "verified": true, "helpfulness": "1/3", "author": "Sedusa85"}, {"rating": 5.0, "review": "I am very pleased with Amazon Fire TV.  It is easy to set up and easy to use the remote.  The voice activated search is a nice surprising feature.  They have an enormous selection of shows.  I would think everyone would find what they like to watch.  I don't use any of these but it also links to Netflix, Hulu and a bunch of other services I hear people are using.  Amazon just came out with some pilots for their own original series.  I like what I have seen so far.  I am excited to see more.  One thing I found out about this system, my local cable company (CalTel) does not support the speed needed for this system.  I could not figure out why my shows would stop and buffer all the time.  Amazon Fire TV needs more than 800 kbps to run properly.  My local cable company could not get that out to me as I live in a rural area.  No worries, DISH TV, Direct TV, Comcast and ATT all offer faster internet speeds that work in my area.  So problem solved for me.", "verified": true, "helpfulness": "2/2", "author": "Tina_Says!"}, {"rating": 5.0, "review": "Easy setup, functions flawlessly", "verified": true, "helpfulness": "0/1", "author": "gdpotter47"}]