[{"rating": 5.0, "review": "Set up was amazingly easy! Glad I purchased this product.", "verified": true, "helpfulness": "0/0", "author": "Susan A. Faneuf \"Susiefan\""}, {"rating": 1.0, "review": "If you have or planning to buy a smart tv you don't need this pos thanks", "verified": true, "helpfulness": "1/13", "author": "BORI"}, {"rating": 5.0, "review": "I love this.", "verified": true, "helpfulness": "0/1", "author": "Edith A. Hancock"}, {"rating": 5.0, "review": "This was the easiest set up item I have bought in a long time. I had a hard time with trying to access content through Wii when I set that up and I was expecting similar headaches; but this has been so much more simple to set up and operate that I had to write a review.  I am enjoying Fire TV and I am just getting started.", "verified": true, "helpfulness": "0/0", "author": "John R Proctor"}, {"rating": 5.0, "review": "It is perfect to watch Chinese TV series and movie without any delay. Because Amazon Prime, I do not see the movie from Amazon.I have recomened my neighbor and friends to buy it. The fire TV already became a part of my everyday life.", "verified": true, "helpfulness": "0/0", "author": "hao"}, {"rating": 5.0, "review": "EASY TO HOOKUP AND WORKS LIKE A CHARM", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Alot faster than I expected.", "verified": true, "helpfulness": "0/0", "author": "Ty"}, {"rating": 5.0, "review": "Admirably does what it is designed to do. The setup was a breeze, and now I am enjoying streaming content from Amazon Video, Netflix, and even the customized version of YouTube.", "verified": true, "helpfulness": "0/0", "author": "Kausik Datta"}, {"rating": 4.0, "review": "Works pretty good but although it is \"similar\" to my Kindle Fire, I wish it would work just like it.  I'd much prefer to have a listing of free movies rather than having to click on them, only to find that they are pay-per-view.  The voice search is pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Richard C. Vaughan"}, {"rating": 5.0, "review": "Super easy to use out of the box!  Searching is 100 times improved over my current Sony player.  So far it is perfect.  I am not able to download the Netflix app yet.  Several reviews reported similar issues.  Once this is resolved it will be great!", "verified": true, "helpfulness": "0/0", "author": "Mark J. Timmerman"}]