[{"rating": 5.0, "review": "Love it - especially the voice activation. So easy!", "verified": true, "helpfulness": "0/0", "author": "PamG"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! I used to have Roku 2, this box is way faster, i like the interface as well. Roku used to crash at least 2 times a week, this box just keeps working. Great remote too", "verified": true, "helpfulness": "0/0", "author": "Igor"}, {"rating": 5.0, "review": "As Good As Advertised, but I still haven't explored the voice feature, yet. I'll update the review later when I use the voice command feature. But, even without it, I would be completely satisfied. The device works wonderfully and streams flawlessly with Amazon Prime videos, NETFLIX & You Tube. I don't use any other services. I have it hooked-up to a stereo receiver, Yamaha RX-V477 - plugged into one of the HMDI ports in the back. I just select that HMDI on the remote and the display comes up. Selecting the options are user friendly. And, now I can play this on my Bose surround sound system. And, I'm doing all of this living overseas via a VPN.", "verified": true, "helpfulness": "0/0", "author": "Dougie \"lilrhodes\""}, {"rating": 5.0, "review": "Excellent product and well worth the $69 bucks that we got on sale. Loaded spmc and it works like a champ. My wife watches her shows every day on it and loves it.", "verified": true, "helpfulness": "0/0", "author": "Nina"}, {"rating": 5.0, "review": "SO HAPPY WITH THIS!", "verified": true, "helpfulness": "0/0", "author": "Marie J"}, {"rating": 5.0, "review": "Streams quickly and a very large selection", "verified": true, "helpfulness": "0/0", "author": "shannon"}, {"rating": 4.0, "review": "I purchased the gamer bundle and plugged it in and after a few basic setup steps began enjoying all amazon fire tv had to offer for a great price", "verified": true, "helpfulness": "0/0", "author": "Daniel McDowell"}, {"rating": 3.0, "review": "I was finally convinced to purchase a fire tv by the addition of hbogo, as I would no longer need to boot up my PS3 to use it. Unfortunately the app lacks functionality on the Fire TV, specifically the watch list and season pass. This and the fact that \"last played\" rarely works, meaning I have to search for the series then find the next episode. These are admitted minor inconveniences, yet ones I don't have when using hbogo on PS3.I'm rather annoyed that I was finally convinced to buy a fire tv by the addition of hbogo, and now I'm back to watching it on my PS3 so I can get full functionality.", "verified": true, "helpfulness": "0/0", "author": "RCook"}, {"rating": 5.0, "review": "Works fantastic, picture quality is excellent and it was easy to setup. Could not ask for a better product and have been recommending it to my friends.", "verified": true, "helpfulness": "0/0", "author": "Billock"}]