[{"rating": 5.0, "review": "Easy to set up and use. Needed to buy it so that we could watch Prime and have it in surround sound with our Bose.", "verified": false, "helpfulness": "0/0", "author": "Tania anderson"}, {"rating": 5.0, "review": "Best purchase I've made in years!!!  Who needs cable?  I sure don't anymore!", "verified": true, "helpfulness": "1/1", "author": "Brandon Phillips"}, {"rating": 4.0, "review": "A lot of great tv and movie selections available with Amazon Fire.  I am thrilled to have been able to drop DirecTV and go with antenna TV and streaming with Amazon Fire.  I was looking at the Roku but talked with a salesperson at Best Buy who had dropped cable and satellite for antenna tv and streaming.  He gave me all the benefits of Amazon Fire over all the other products.  I had been sold on Roku until I heard about, and saw the video specs on Fire.", "verified": true, "helpfulness": "0/0", "author": "Lisa N"}, {"rating": 3.0, "review": "good product no problems hooking up or setting up just wish they would make more movies available since i am a loyal prime member without having to buy or rent 10 year old movies.", "verified": true, "helpfulness": "0/0", "author": "Paulhillsr"}, {"rating": 1.0, "review": "Having trouble setting it up.  Really need written directions.  Not Happy at all", "verified": true, "helpfulness": "0/1", "author": "Rosalind"}, {"rating": 5.0, "review": "Prime is a great fit for our family", "verified": true, "helpfulness": "0/0", "author": "Jeanine M."}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Cassandra Rashad"}, {"rating": 5.0, "review": "This far exceeding my expectations!  Set up went a lot smoother than I thought.  I was able to set up both of them that I ordered within about 20 minutes, not counting the short tutorial video that was included.Only advice I would give to anyone setting this up is to have all your usernames, email addresses & passwords for all your apps handy when you start the set up.  I should have but didn't.  It would have been much, much quicker for me.", "verified": true, "helpfulness": "1/1", "author": "John A Waclawski"}, {"rating": 1.0, "review": "I ordered this back in February 2015. I was delayed in hooking it up, but when I finally did it worked as prescribed. Went thru all the procedures, and watched a movie. The next day I listened to music while doing house work in that room. Several days later I attempted to turn the unit on, and got nothing. Being of slightly above average intelligence I did all the techie checks, and wiring hook ups,, re-read the instructions ( remember it was already previously working fine) Got nothing. I also discovered signs of wear indicating that I had not received a brand new unit which I had ordered, and paid for. Since I was past the return date I had to burn the budget on this one. BIG DISAPPOINTMENT. Now they aren't selling any except factory refurbs, and the future sales are at the PLEASE STAND BY stage. So for the time being I will wait a bit longer throwing away cash in the Direct ion of my present overpriced financial rapist  Sat. TV provider company. PS. I live in the country far away from all the land line cable ripoff rapists", "verified": true, "helpfulness": "0/3", "author": "Michael E. Holman"}, {"rating": 1.0, "review": "I was not aware that I had to pay for every show that I watch!!!!!!", "verified": true, "helpfulness": "1/5", "author": "shawnte m."}]