[{"rating": 5.0, "review": "I love this product. I really recommend it. My brother is buying one now!! Love it!!", "verified": true, "helpfulness": "0/0", "author": "Maria Valdes"}, {"rating": 5.0, "review": "very easy to hook up,start using", "verified": true, "helpfulness": "0/0", "author": "Woody"}, {"rating": 4.0, "review": "We really like our certified refurbished Amazon Fire TV. It works great and so far no dropped programs and a really outstanding picture. We really enjoy the voice option. The only reason we gave it 4 stars is because we had to buy  a Wi-Fi enhancer (tp-link), since our router is further away than the recommended 30' feet.", "verified": true, "helpfulness": "1/1", "author": "c reynolds"}, {"rating": 5.0, "review": "I think you need a bigger remote and as far as Prime is concerned I am not sold on it. I wanted to watch Sessions but it seems I have to pay rental fees then I was looking for a particular movie with another actress and you don't have it, think once I am done with Boardwalk Empire and my 30 is up I may have to re evaluate whether to keep it or not, the unit itself is great just prime I Have an issue with", "verified": true, "helpfulness": "0/0", "author": "Larry Sprissler"}, {"rating": 5.0, "review": "I have 2 Amazon Fire TV,s and 2 Fire sticks. Love them all. No need to spend extra money on smart Tv's!", "verified": true, "helpfulness": "0/0", "author": "Hector"}, {"rating": 5.0, "review": "Fantastic!!!", "verified": true, "helpfulness": "0/0", "author": "Francesco Mattiussi"}, {"rating": 3.0, "review": "I would give it more stars but the sound goes out a lot even after setting the sound that Amazon recommends to do with hmdi setup. And have to restart it everyday when I  first turn it back on after it has been in sleep mode. another thing it goes in asleep mode randomly within 30 minutes to 2 hours when I start sling. there's no setting to adjust sleep mode or screensaver. still think Apple TV is better but it does not offer sling app which is the only reason I have an Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it! I am sad that there is no way to get more I would get one for my parents!", "verified": true, "helpfulness": "0/0", "author": "Ipockat"}, {"rating": 5.0, "review": "I love the amazon fire tv box. Great value and great price. Thanks amazon", "verified": true, "helpfulness": "0/0", "author": "jeff"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "WillysBoy1959 \"Doug\""}]