[{"rating": 5.0, "review": "It's fast - I mentioned that in the title there. I don't like to wait, so this is a big deal for me. Navigation is simple and quick. No noticeable delays. I haven't tried the voice search, it's not something I'll probably use. I also haven't tried gaming yet. My simple review is on the functionality of the video streaming services and I am very happy. If I never use it for anything else, it was well worth the price to me for the speed and simplicity.", "verified": true, "helpfulness": "2/2", "author": "Jeffrey C. Drywater \"Jeffrey C. Drywater\""}, {"rating": 2.0, "review": "So, I am looking at the login page for Netflix but have no way to enter my email and password.What gives?Also I am a Amazon Prime member the Fire seems to have no idea about this.This is not looking very easy to complete the setup.WHERE IS THE HELP?", "verified": true, "helpfulness": "3/7", "author": "Carol Barritt-Flatt"}, {"rating": 3.0, "review": "Runs great, movies and tv shows look very nice. My main problems is I think the Amazon Game Controller should've been included with it. Also not sure what Amazon.com was thinking when they said \"Gee, let's only make the Amazon Fire TV a 8GB device!!!\" You end up with maybe 5GB for apps, wouldn't be so bad but most of the games worth playing are over 1GB each. So having that little bit of storage you're lucky to get 3-4 games depending on their size.I installed Asphalt 8: Airborne, Netflix and Hulu Plus, I only had under 2GB left... installed Episode 1 of The Walking Dead Game and I was left with about 500MB. So with 2 games and two movie/tv show viewing apps, they pretty much took up ALL of my space.Hopefully Amazon.com wises up next year and gives us A LOT more storage to add games.", "verified": true, "helpfulness": "2/3", "author": "John E. Maynus"}, {"rating": 3.0, "review": "Got my Fire TV box today.  package looks good, hardware looks good.  Please never ever ever again make a power brick that is short and fat like this which takes up three spot on my power strip!  think people.  set up was easy.  I'm surprised all that curcuitry is in a tight little box with no venting. they don't even put feet on it to provide air passage under it.  we'll see if it heats up with 4 hours of HD.  set up was easy and fast.  I'm running it off a ethernet hardline from my network that is clocked at 24 Mbs downlaod speed. First impressoins are a swift and responsibe menu.Applications.  Ok here is where things get interesting.  Where are the apps.  there is a vast shortage of apps.  I don't see them.  It appears that all the apps they offer are the ones you see above in the marketing sheet.  Of course everyone has thier favorites but here are a few I was hoping to see that are not there:Amazon MP3 - missing, internet browser, facebook, fandango, pulse, slacker radio, twitter, usa today, vudu...all missing.Let me just say something about Flixster.  Since Amazon has not waken up and adobted ultraviolet licensing to allow those of us who purchased DVD's and BluRays from Amazon (or elsewhere) that come with UV digital copy licenses to then be able to watch our licensed digital copy from Amazon instant video...Flixster is our only option here.  On Flixster, one may redeem thier UV license and stream our movies from a Flixster app on many different platforms.  Sounds good right?  Stop.  Amazon has restricted the playback of content from flixster to STANDARD DEFINITION.  I have many MANY movies I am licensed to watch, in high definition, via ultraviolet.  I PAID Amazon for the product that provides me this license.  And yet they will not allow me to watch it in HD.  This is a major FAIL.  My XBox let's me do this as does other streaming devices.  Message to Amazon:  Adopt UV licensing and allow owners of media to pay thier content in the paid-for resolution OR unlock Flixster (pay them whatever it takes!) to allow streaming of our flixster libraries in HD.  I get it. BUY from Amazon.  Fine I can do that.  but do you REALLY think I am going to go back and purchase all those movies again from you to be able to stream them from your cloud service?  no.  That ship has sailed.Need a money maker?  set up a disk-to-digital service to license a UV copy and yeah I'll pay a few bucks to convert my old dvds.Ok, on to performance.  I loaded up Frozen in HD and played it.  Picture was very good.  motion was smooth.  I saw no evidence of stutter or pixelation or lagging.  The hardware on this system seems be very strong.  It's just too bad I can't really enjoy it with the very restricted channel of HD content.  Amazon do something!  For those who wish to stream your UV library in HD I must reccommend going to Roku or AppleTV.", "verified": true, "helpfulness": "2/4", "author": "Matt G"}, {"rating": 1.0, "review": "This was a huge disappointment.My family bought this for me as a birthday present. When they talked to the Amazon salesman they were led to believe that this would connect wirelessly to my Kindle HD. It won't; it will only connect to the HDX, a fact I found out when I finally called for help.In essence when you buy a FIRE TV are paying $100.00 for a (sort of) voice activated tuner that does NOT have recorder/timer and with limited access to some internet content, paid access to most content, and some access to free content. That's it. If you ever saw the ads for a dongle called \"The Rabbit\", you are buying a voice capable (kind of) version of that.With the exception of the voice command (which is NOT ready for prime time) there is nothing you can do with this that you can't do for free with Windows Media Center (WMC) which is integral to every Windows OS out there, and an HDMI cable. If you have an older CRT TV you will need a HDMI-RCA jack connector ($5.00).1. If you are a Prime member, just connect the HDMI cable to your TV the same way you would with the Fire TV; connecting to your PC/laptop instead of the Fire. Then log on to Prime via your PC, and choose either the duel screen (if you want to see it on your computer as well as your TV, or remote screen if you only want to watch it on your TV.) Windows Media doesn't care what kind of TV you have. If you have a wireless mouse/keyboard arrangement you actually have a greater wireless-remote functionality than if you only had the Kindle TV.2. If you are not a Prime member, then using just the Windows Media Center, you have the same functionality as you would on The Kindle TV box. Just Google the latest show you want to watch, select the network and just watch the TV show free via your internet connection.3. You CANNOT watch all of the shows that are in the advertisements for the Kindle Fire TV unless you have a paid-for internet connection that allows you to do so.4. If you have a Netflix, Hulu, etc. account, just log on to them using your computer and watch them via your computer-TV-HDMI connection.5. The Windows Media Center does have the advantage that it will allow you to set up a timer to record a TV show (or movie) and store it on the computer's hard drive, or a remote hard drive, for later viewing. I was rather surprised that the Kindle didn't have this very basic function.6. This device would have been at least minimally useful if there was a way to connect the mini-USB on a Kindle Fire HD and record TV shows on the timer the same way that the WMC does. It is remarkable that 10+ year old software developed by Microsoft (Microsoft Vista and all later OSs) can give better functionality than Amazon's new TV box. If you have purchased a PC in the last 10 years you have greater capabilities on your PC/laptop than the Fire TV.7. I really love my Fire HD. I would recommend anyone who wants to watch videos or TV shows on the road buy one. You can infinitely expand the storage capacity of an HD by buying a wireless hard drive, such as the San Disk wireless flash with interchangeale data cards.Most folks already have a HDMI cable, if you don't just buy one and don't waste your money on this tuner.All of that said; if you didn't even know that you could do all of this with the WMC that came with your PC, then the 4-5 mouse clicks you would have to do may be too techhie for you, and the easy hook-up for the Fire TV is OK if you can live with its limitations. If it had the same wireless connectivity as the HDX it would be a whole different ball game and I would recommend it in a moment to an HDX owner; especially one who wants to do remote Power Point presentations.Doug", "verified": false, "helpfulness": "7/28", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This thing looks like the last crap i took. Can't touch Roku in anyway what so ever. Save your money morons.", "verified": false, "helpfulness": "4/58", "author": "Murphy"}, {"rating": 1.0, "review": "the order came in on the right day I hooped it up and it works fine.However, I thought I read that it would work on my new kindle HD, but I have since found out that it doesn' work with if. That's a big disappointment to me, If I had known that I would definitely have not ordered this. Now I am stuck with it.", "verified": true, "helpfulness": "1/21", "author": "wishnwell"}, {"rating": 5.0, "review": "Love the Amazon Fire TV  Had a problem with movies loading . customer serviced called within one minute and fixed it .one of the best customer services ever", "verified": true, "helpfulness": "4/4", "author": "JH"}, {"rating": 5.0, "review": "I opened the box, plugged it in, downloaded the latest software, chose an Amazon movie to watch....then sadly was greeted with \"due to geographical issues you are not permitted to watch this video\"....COME ON AMAZON, there is a big world out there!!!I'm hoping you guys sort this out soon, and I haven't wasted $140.00 (I got the game controller too).Even though I'm extremely disappointed, this looks like a fantastic product (once I can get to use it).", "verified": true, "helpfulness": "3/4", "author": "Daniel R."}, {"rating": 1.0, "review": "I would gladly pay double the price if it had 4k and HDMI 2.0 support, also that would actually make this a step ahead of any of the competing boxes. Netflix has previously announced plans for 4k in 2014 and there has been talk of a H.265 codec to allow quality streaming of 4k.  This box supports none of these upcoming features.  The price of 4k TVs has significantly come down over the last few months, don't waste your money on a product like this if you have plans to replace your TV in the next year as you will end up having to buy something else to replace it pretty soon.", "verified": false, "helpfulness": "4/28", "author": "Doc Os"}]