[{"rating": 3.0, "review": "the control is not working i change the battery but donot work what should i can do", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 5.0, "review": "Very easy setup. Love the voice search. Makes watching Amazon Prime Movies so much better than just having to watch on your computer!", "verified": true, "helpfulness": "0/0", "author": "trcook21"}, {"rating": 5.0, "review": "Ok to start off with I purchased the Amazon Fire TV as I'm switching off cable and moving over to Hulu+ and Amazon Prime.  Since getting it, using it for a few weeks and figuring it out I must say that I love this thing.First of all it is really to install.  Just plug in the power and then plug in the HDMI cable into your tv.  Set it up with your Wifi or Network and you're good to go.  It took me no more than 10 minutes to get it up and running.  There are a few annoying things you'll need to change.  At first I was annoyed that I had put my password in for everything.  However a quick glance through the settings menu and you can set it up so a password is required only for paid and adult content so the kids won't \"accidently\" watch Game of Thrones on a few \"select scenes\" on a loop.Secondly what's available.  There is a LOT of content on this thing.  Being attached to Hulu+ (separate subscription), Amazon Prime, Flixter, Netflix etc gives you access to a ton of movies and shows.  You're not going to be missing out on a whole lot and I'd like to think of it as a smaller DVR box as you're not going to be watching any live tv but all shows (off of Hulu) are shown the day after.  You will be missing a few networks Cartoon Network and Disney for example are not a part of what Hulu or Amazon Prime has to offer.  It would be nice to see Amazon work something out with Disney (doubtful as they're partnered with Netflix).  If you're a sports fan you're going to have to sign up for MLB, ESPN, NFL etc seperately so there is that loss as well.  However Amazon does have sports apps so you can keep up with your games.The box itself is quick and amazingly the voice control is rather responsive and understands you even with a lot of background noise around you.  Searching for content is easy.  However it is also frustrating at times.  You see you can search for basically anything on Amazon Prime, Hulu+ or Netflix (not subscribed to them so I'm not sure how accurate this is) with ease.  However where Amazon does drop the ball is on the search for content they offer.  If your a Amazon Prime subscriber you're going to find it's difficult to search only for content offered on Prime's service.  In fact I'm seeing more \"TV\" or \"Movie\" where you have to pay for the content.  I understand that not everything on Prime can be free.  Yet it's frustrating where you want to search just for the Prime content and there is not an option for that.  Instead you have to wade through everything in all categories for Movies or TV Shows.As for the games I didn't buy the controller \"yet\" but I was able to download and play Asphalt 8 and use the remote as a controller.  It does take a bit to get used to using the remote as naturally I want to hold the remote as you would a controller.  After a minute or two of adjusting to the awkwardness I found that this box is in fact a really good \"casual gamer\" machine.  I wouldn't recommend it over a PS4 or an XBOX One as the two are obviously more powerful.  The games offered so far are the same ones you would find on your iPod or Android device.  I did hear that Amazon does have it's own gaming studio now so it would be interesting to see what content comes out.  As the Fire TV isn't very old and I'm sure that these games are going to need to be transferred to a new system in time their games library will grow.  The good news is that anything you bought off of Amazon Prime's app store does indeed transfer over to the Fire TV as long as the box supports that game.I'm giving this thing a 5 Star Rating as you can see above.  The search function and lack of filtering content is annoying but not as much as to make me want to box this thing up and send it back.  I found it very user friendly, quick and easy access to content (my 12 year old uses it to watch Doctor Who or Naruto).  The setup is easy enough so that even the least tech savvy person can indeed set it up without feeling as if he or she needs to be an IT person.  Personally I would recommend this box to anyone looking to shut off their cable subscription or just wants easier access to their web entertainment selections.", "verified": true, "helpfulness": "6/6", "author": "M. Triplett"}, {"rating": 1.0, "review": "I'm an owner of a kindle fire HDX tablet and would like to buy the fire tv.  But I won't do it at this time.  Not until Amazon gives me a good interface for selecting Prime movies.  Selecting a Prime movie is a big pain.  There is no nice way to sort through the Prime movies other than a random list of what Amazon calls the \"top\" movies.  The \"top\" movies are only a partial list of the Prime movies.  I want a complete list of all the Prime movies.  I want to be able to sort these by genres such as comedy, drama, adventure, etc.  I've been a Prime member for several years now and would like movie selection to be a prime experience.My kindle fire HDX tablet and the new fire tv have the same kind of poor movie selection problems.  My old Blue Ray player is better at selecting the free \"Prime\" movies.  It even sorts them into genres.  What's up with that?  I think Amazon is making a serious mistake with their video selection interface.  The Roku 3 has usable interface.  If they really want people to be \"Prime\" customers and watch free Prime movies, then they need to do something.  If the don't, the run the risk of not selling as many tablets and fire tv's.  They also run the risk of not selling as many \"Prime\" memberships and losing some of the Prime members the already have.", "verified": false, "helpfulness": "6/13", "author": "Larry Rayher"}, {"rating": 4.0, "review": "I like movies and sports. Fire has lots of movies but you cant get live sports. You can get sports talk and a few replayed games. It appears that the leagues have it locked in contract because it always asks who you TV provider is.", "verified": true, "helpfulness": "1/1", "author": "Melvin L. Thayer"}, {"rating": 5.0, "review": "Tiny unit, voice search capability and easy to operate with little prep time .  It works like a dream. Fire TV also allows me to watch Netflix and Hulu Plus.  I'm very satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "Nance"}, {"rating": 5.0, "review": "This is a fantastic product that is easy to use, easy to install and super fun to have! We totally recommended d this product for anyone!!!", "verified": true, "helpfulness": "0/0", "author": "Nancy Jogerst"}, {"rating": 4.0, "review": "I don't understand why it doesn't link to my Amazon Cloud Player for all my music.  not that many free movies on Prime that I like but I could get Netflix and have all I want.  love the link to ESPN.  wondering if they will link to SEC Network when it becomes available this fall.", "verified": true, "helpfulness": "0/0", "author": "Brother Ray"}, {"rating": 1.0, "review": "will only work on a hdmi tv fix that and it may be alright all I could find was rental movies or the ones I wanted to watch were rentals I stick with Netflix for now thanks didn't like fire tv much", "verified": true, "helpfulness": "3/16", "author": "michael ditmore"}, {"rating": 5.0, "review": "Amazon prime member , Netflix , You tube , and more like to watch what I want when I want . Very easy to set up", "verified": true, "helpfulness": "0/0", "author": "montanamary"}]