[{"rating": 2.0, "review": "The device looks good and has a snappy UI, unfortunately it hangs/crashes frequently and reports a slow internet connection despite the fact that I'm on fiber and every other device sharing the router has no similar problems. Even choked playing content we own on Amazon's streaming service. Reverted back to my old Roku 2 and everything was peachy. Will try again when the product has time to mature and the price falls. My guess is that my problems can be fixed with a firmware update sometime down the road. But no reason for me to sit on the device until then, so in the return pile it goes.My recommendation, wait a bit longer for the kinks to be worked out before you buy one.", "verified": true, "helpfulness": "6/10", "author": "Eric Knipp \"Eric Knipp, Gartner\""}, {"rating": 3.0, "review": "I was very excited when this product was announced and order it immediately. However I am not impressed with the apps available and even the ones like Netflix are bad. This probably has the worst netflix app interface of any of the multiple devices I own. And being that I got this to use my primevideo too that I appreciate. But still need to keep chromecast to have a decent netflix interface for it.", "verified": true, "helpfulness": "4/5", "author": "Nathan"}, {"rating": 4.0, "review": "I have two Apple TV's and was about to try a Google Chrome when I saw that Amazon was releasing the Fire TV. I'm heavily invested in Amazon with a Kindle Fire HDX, a Prime membership, and even an Amazon credit card. With my Amazon credits I got the unit plus controller for less than an Apple TV. It showed up yesterday and I've been very pleased with the functionality and mainly the speed. Compared to Apple TV it is the clear winner. The voice search feature works as advertised with the one exception that I've found so far is that Clint Eastwood is translated as Klint Eastwood who apparently has never done a movie, ever. I've tested the mirror option on the Kindle Fire and it works great compared to the NetGear mirror option I used previously. Overall, no regrets on this purchase.", "verified": true, "helpfulness": "2/3", "author": "David W. Chapel \"States Rights\""}, {"rating": 3.0, "review": "Due to the digital rights management requirements you need a HDMI to HDMI.  So even thought Fire Tv has an optical out for the audio channel, there is not anything you can do to hook it up to a DVI port.", "verified": true, "helpfulness": "1/4", "author": "Jeffrey Hardy"}, {"rating": 5.0, "review": "Pros…. EverythingCons …Z E R O.Good job Amazon,  Made my TV.Just ordered 4 more.  Got to have one for all the TVs.", "verified": true, "helpfulness": "2/4", "author": "JMyers"}, {"rating": 5.0, "review": "It's rare that I see a product that does exactly what it's advertised to do.The setup took less than 5 minutes out of the box.The Amazon Fire TV voice search capability works fantastically!!Well worth the money when compared to other solutions.", "verified": true, "helpfulness": "3/4", "author": "J. Sears"}, {"rating": 5.0, "review": "5 stars here, because it is really great to game on this thing.. everything is smooth, no lag anywhere, obviously the quad core is doing its job..  the voice search is awesome, it works perfect 99% of the time.  overall beats out the android tv boxes i use to own.. not bad... now to see what google is coming out with.", "verified": true, "helpfulness": "2/3", "author": "amadorl608"}, {"rating": 5.0, "review": "Love the user interface on the Fire TV. I've been using Roku devices (Original, XS, & 3) for years now and the Fire TV takes the cake. Much snappier menu response due to the better hardware specs. Easy 5 stars for me.", "verified": true, "helpfulness": "2/3", "author": "OKCubsFan"}, {"rating": 5.0, "review": "Just got it, but so far it is great.  Very easy to set up, literally plug and play.  Have already added a lot of movies and television series to my playlist, looking forward to enjoying them.", "verified": true, "helpfulness": "3/4", "author": "Mark Blood"}, {"rating": 5.0, "review": "Has been as advertised. On WiFi the quality has been great. The loop is closing between devices. Would recommend to friends.", "verified": true, "helpfulness": "1/3", "author": "Rolf E."}]