[{"rating": 5.0, "review": "awesome product", "verified": true, "helpfulness": "0/1", "author": "Stephanie"}, {"rating": 5.0, "review": "LOVE my Fire TV ! I'm not sure I could have gotten it hooked up easy but it only took my PC geek about 10 minutes! I've added Netflix and am thinking about also adding Hulu Plus!", "verified": true, "helpfulness": "0/0", "author": "Mississippi Reader \"Carol murdock\""}, {"rating": 2.0, "review": "I bought this so I could stream Amazon Prime content, but was disappointed by what was available in free content. I didn't expect to be asked to pay for series episodes which were produced by Amazon Prime. After watching it the first day, I haven't watched it since. I will say the picture and the quick response time was superb. Also the voice activated searches were very responsive.", "verified": true, "helpfulness": "1/1", "author": "T. L. Priboth \"unhappy with Suze\""}, {"rating": 4.0, "review": "I actually just took a star off.  Hulu freezes more often than on our Apple TV and it is annoying to force quit the app or sometimes even unplug it to get it to restart.We haven't noticed the pre-loading of shows feature Amazon advertises but I am not exactly what products it does that for.  We use it for Prime videos, Hulu and netflix.  Apple TV is definitely more refined but if you use Prime a lot then its nice not to have to airplay.  The remote is also nice to not have to point at the device.  The voice search actually works better than Siri in my opinion but they haven't integrated Netflix as of Nov14 with the search.  Hulu is fairly well integrated but it pushes Prime (purchase or free) first before you find the hulu option.", "verified": true, "helpfulness": "0/0", "author": "Erin C."}, {"rating": 3.0, "review": "It's okWish there was more free tv", "verified": true, "helpfulness": "0/1", "author": "Cool"}, {"rating": 5.0, "review": "I'm thinking of buying this product, but not sure what it's purpose is. Are the shows free and movies or do your purchase them?", "verified": false, "helpfulness": "0/2", "author": "Brian Ramos"}, {"rating": 5.0, "review": "Faster than my smart tv apps. I'm going to need one for every tv in the house!", "verified": true, "helpfulness": "0/0", "author": "Savviapple"}, {"rating": 5.0, "review": "The coolest thing since sliced bread!! Love watching my shows either on prime or netflix!!  Love being able to listen to music too!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great product ideas all I want but the connectivity consistency could be better", "verified": true, "helpfulness": "0/0", "author": "daniel durawa"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Brian Mcguane"}]