[{"rating": 5.0, "review": "works great,just make sure u have high speed internet connection,o and prime or there is not much to watch", "verified": true, "helpfulness": "0/0", "author": "John luco"}, {"rating": 1.0, "review": "I took a chance on this device and I wish I had not wasted my money.  I must just have very bad luck because I am experiencing a host of problems that even customer support could not solve.  I get player errors DAILY which then means I have to unplug the device and restart it.  When you have children who are in the middle of watching their favorite movie this can cause undue stress.  Not to mention the time I spent on the phone with customer support thinking that I was solving my issue only to have it recur.  Not only am I have issues playing Amazon content, it happens with Netflix, and now today my Plex Server had issues via my Fire TV device.  I NEVER experienced this with my Roku.  The only reason I replaced my Roku with Amazon was because Amazon has the ability to sideload applications and offers a lot more games and apps and channels.  Well I'm here to say it's not worth it.  My Amazon Fire Stick has not been as much of an issue.  Given the size of the stick versus the box I would have expected the opposite.  That said, the stick has not been without its own set of issues.  At least once every two or three weeks I get a blue screen with a message about the content being unauthorized.  I can hear the program but not see it.  Thank god I can return my Fire TV as it is now less than thirty days old.I AM BEYOND FRUSTRATED!!  This is the biggest waste of money.  I am so disappointed.  I am a longstanding customer of Amazon.  I think it's been ten years.  8 out of 10 times I am very pleased with what I order.  That's probably because I rely heavily on the opinions of my fellow Amazonians :-)  I genuinely don't purchase products until they have been reviewed by more than five individuals who are verified buyers and I only buy four to five star rated items.  I thought this would be another instance where I wouldn't have issues given the four stars rating.  Unfortunately this was not the case.", "verified": true, "helpfulness": "3/5", "author": "Basiliki \"bargain hunter\""}, {"rating": 5.0, "review": "This is so nice to  be able to speak into the remote and also as a prime member the selections are wonderful.", "verified": true, "helpfulness": "1/1", "author": "L. Bonner"}, {"rating": 5.0, "review": "Excellent device", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "easy to set-up great selection", "verified": true, "helpfulness": "0/0", "author": "Kay Adams"}, {"rating": 5.0, "review": "It's amazing. I wonder why I waited to buy this...", "verified": true, "helpfulness": "0/0", "author": "Joseph D. Snare \"woody\""}, {"rating": 2.0, "review": "Box is well design and perfectly functional. The problem I'm having is with pricing. I am presently living in Jamaica and so make purchases from Amazon.com frequently. The Fire Box forces me onto the UK site with no access to US based IPTV services. British services (BBC et-al) will not work outside the UK.Checking the same movie on Amazon through the Fire Box, my Playstation and on Apple TV through my US account the price for the Movie is 1 British Pound more expensive on the Fire Box than through the Amazon store on the Playstation.Then checking through Apple TV the price was around 50 US cents cheaper on Apple TV. I'm OK with the marketing aspects of this but find it odd that I can make purchases from Amazon.com and Amazon.co.uk through the web, but locked to the UK (when outside the UK) with the Fire Box.Pricing and restrictive service location make this product an issue for me to use. Others may not have the same issues but I'd recommend checking the pricing of your movies through another platform first, even if you're sticking with Amazon as the provider.", "verified": true, "helpfulness": "1/2", "author": "Chris Taylor"}, {"rating": 5.0, "review": "Best streamer of them all .", "verified": true, "helpfulness": "0/0", "author": "Margaret Porter"}, {"rating": 5.0, "review": "Great job Amazon number one in my book", "verified": true, "helpfulness": "0/0", "author": "joseph king"}, {"rating": 5.0, "review": "Darn nice product, One step forward toward shutting down cable TV.", "verified": true, "helpfulness": "0/0", "author": "Fair and Balanced \"The Awful Truth\""}]