[{"rating": 5.0, "review": "This is awesome ....get one", "verified": true, "helpfulness": "0/2", "author": "Kuka"}, {"rating": 5.0, "review": "It is so easy to set up and use and all in my family (ages 3-53) love it! My prime membership makes it a great deal.", "verified": true, "helpfulness": "1/1", "author": "Phillip Jay Lauritsen"}, {"rating": 5.0, "review": "An especially good surprise for viewing Youtube videos on the bigger TV screen -- they are adjusted for improved viewing, enabling me to catch up with a lot without tying up my computer.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "My biggest complaint I have with this is when you're using Netflix, it doesn't remember your username and password, and the microphone doesn't work for typing that in; it takes a really long time to log into Netflix unless you're still signed in.This thing will make you consider dropping your cable provider, which I would do if other members of my household didn't watch the news and such.I wish it were possible to watch live news. Maybe it is and I just don't know.", "verified": true, "helpfulness": "1/1", "author": "Justin"}, {"rating": 5.0, "review": "A definite upgrade over chromecast. Its faster and more reliable. Would recommend to anyone that uses Amazon for movies, tv, or even if you use Netflix & Hulu. I have not tried playing games as of this moment, but that wasn't the reason I bought the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Ely Young"}, {"rating": 4.0, "review": "Fire TV is awesome and fully compatible with my iphone, especially with all of the apps Amazon has been developing to work in conjunction. The built in apps and games are great with the ability to download others from the menu. It is very similar in nature to the Apple TV. One shocking thing: you can't shop via Fire TV?!", "verified": true, "helpfulness": "1/1", "author": "jamarine_73"}, {"rating": 3.0, "review": "I really do not have a review as I am yet to purchase this.  I am a senior citizen widow.  I like movies, etc. but hate to go to the movies by myself.  Do I need to purchase anything else or subscribe to a streaming service?  If so, what does that cost per year, or per month?  Any other information you can give me will be greatly appreciated.  Thank you so much.", "verified": false, "helpfulness": "0/3", "author": "Beautimus04"}, {"rating": 5.0, "review": "I love this  unit.  I never watched movies as much as I do now. I have re-ordered another  to surprise  my husband for his Christmas gift. I think he will also love it.", "verified": true, "helpfulness": "0/0", "author": "yram"}, {"rating": 5.0, "review": "Met my needs.", "verified": true, "helpfulness": "0/2", "author": "Kirk D. McLachlan"}, {"rating": 4.0, "review": "The only complaint is that the Netflix app would not download. When I went out to the Amazon Fire TV board, I found a lot of people with the same problem. Another user provided a solution. This is obviously a known problem but Amazon provides no support as far as I can tell. Definitely tarnishes there customer service reputation.", "verified": true, "helpfulness": "1/2", "author": "Matt"}]