[{"rating": 3.0, "review": "1) I found it totally annoying that I was unable to skip through the introduction tour.  I'm a tech guy.  This isn't my first streaming player.  Just let me skip the tour.  I'm not watching it anyway.2) No apparent way to limit the search to just Amazon prime videos unless I go to the Amazon web site.  With all of the available content, I have little interest in purchasing anything beyond what I can watch for free.3) No apparent way (remember I'm a tech guy!) to organize the watch list content.  I'd be happy just to be able to sort it by show title so that all of the Dr. Who would be together, and it wouldn't be so annoying to look for the first season of Fringe.4) No way to attach this to a hotel network that requires you to log in after connecting to a wireless network.  I'd thought that this would make the ultimate box to travel with, as where ever I was in the world I could still watch things that I found interesting.  All I need is an embedded web client that works without having to talk to the Amazon mothership!None of the above are game stoppers, over all I really like the device.", "verified": true, "helpfulness": "1/10", "author": "Matthew D Goldman \"Event Horizion Diver\""}, {"rating": 2.0, "review": "After installing only a few small casual games, I have only about 1GB of space available, and the devices only lists a total capacity of 5.49GB, most of which is consumed by the Fire OS system itself. I'm getting error messages when trying to install some games. It streams faster than my old second-gen Roku, but with such small storage capacity, it's extremely limited for games.", "verified": true, "helpfulness": "1/4", "author": "Vrenna"}, {"rating": 3.0, "review": "This device is technically superior to other similar devices, but really lacks in available content.  HBO GO is not available, and other available apps are slim compared to Roku.  I hope Amazon has plans to beef up the available offerings.", "verified": true, "helpfulness": "1/3", "author": "DLK"}, {"rating": 4.0, "review": "Pros:  Lighting fast, excellent for Amazon/Netflix and easy to use remoteCons:  Not easy to turn off.  Died after a couple weeks and had to return.", "verified": true, "helpfulness": "0/2", "author": "David"}, {"rating": 5.0, "review": "I got my Fire TV 2 days ago and I absolutely love it.  It is very small and sleek looking.  I use it in the spare bedroom in my apartment where there is no cable outlet and I am able to watch all of the great shows on my Amazon Prime account as well as my Netflix account.  It also has music apps so if I don't feel like watching TV.", "verified": true, "helpfulness": "3/3", "author": "Dee E,"}, {"rating": 5.0, "review": "I am very pleased with this product. My LG smart TV is not very smart when it comes to internet programming.  Its interface is confusing and much too slow. The Fire TV is incredibly fast and the picture is as good if not better than  the best HD cable programs offered by Comcast.. Many of the complaints about this product reflect reviewers not carefully reading what the Fire does and does not do. I expect Amazon will  be adding program features in the near future to make the Fire even better. This was a worthwhile purchase!", "verified": true, "helpfulness": "3/3", "author": "MiniBob"}, {"rating": 5.0, "review": "When it arrived, I tossed it aside with the intention of attempting to hook it up later, assuming it was going to be difficult.  Then I decided to give it a quick try.  I was amazed that it was so incredibly easy to set up; this coming from a 74 year old womanThe packaging looks like there might be a fine perfume enclosed, so elegant.  Everything works like a charm.  I know what I am doing for the rest of the afternoon.... bring on the popcorn and cokes", "verified": true, "helpfulness": "3/3", "author": "Rita Mizell"}, {"rating": 2.0, "review": "I am sending it back.  I thought it would let me search current regular network TV shows or On demand TV shows.  As far as I can tell it only lets me search my prime stuff.  I can get all of that with my Kindle Fire HDX and my \"Pushtotv300\"", "verified": true, "helpfulness": "1/7", "author": "Jim Eastman"}, {"rating": 5.0, "review": "Bought this for a bedroom TV, it brought life to the TV!  It is very fast, as compared to my smart blue-ray player.  Pretty sure I am going to have to buy another.  Very simple to hook-up, use and browse with.  Couldn't be happier.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "AAA++++ great product..really great recommend to all my friendsIts so easy to use, and installLove it.. great Job", "verified": true, "helpfulness": "1/1", "author": "Dmitri"}]