[{"rating": 5.0, "review": "Almost perfect! Trying to figure out how to search for more apps. Love the prime video integration", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "Extremely easy to set up. I have been looking at this for awhile so I could stream net flicks.  I also own an apple TV and the chrome . This is so much better.  Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Colleen J. Marsini"}, {"rating": 5.0, "review": "Love my FIre TV.  I have cut the cord with cable and am not looking back.", "verified": true, "helpfulness": "0/0", "author": "r"}, {"rating": 4.0, "review": "super !", "verified": true, "helpfulness": "0/1", "author": "younes"}, {"rating": 4.0, "review": "We are enjoying all of your programming very much.  This is a great product and I would recommend it to my friends.", "verified": true, "helpfulness": "0/0", "author": "Bonny Tymkin"}, {"rating": 5.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "corrlyn mcgivern"}, {"rating": 5.0, "review": "It is best choice for \"SMART\" thing of HDTV.I bought to connect with WD Mycloud and use XBMC.", "verified": true, "helpfulness": "0/0", "author": "HyungSuk Choe"}, {"rating": 5.0, "review": "We decided to do away with cable and start streaming TV and this product has made that transition very easy.  It is easy to use.  The box and remote are clean and streamlined; much better than the clunky cable boxes we were used to.  And there are so many apps to use even before you sign up for Netflix, Hulu Plus, etc.  We are contemplating ordering another so we don't need to keep bringing it back and forth at night. I would definitely recommend this product to others.", "verified": true, "helpfulness": "1/1", "author": "Samantha"}, {"rating": 5.0, "review": "Very good device, quick, best with Amazon stuff, Voice search works for me ! that's a first.  Only problem with the fire tv, is, if you lose your internet connection you lose everything, it would be nice to have some of the things on your watch list, stored on the fire tv, just in case you lose connection. also it would be good to be able to turn of the little white light no the front of the box,in the living room it is ok,But in the bed room or when the lights are turned low the light is to bright, for me any way. also there is no way to alter the sound level with the remote ! so you still need the remote that you use with your tv,as well the fire tv's remote.", "verified": false, "helpfulness": "0/0", "author": "mjb"}, {"rating": 5.0, "review": "I looked into some of the other streaming devices but none of them were as highly praised as the Amazon Fire TV. From professionals to just-plain-folks, it received a big thumbs up. I think it was PC magazine that called it the best of the lot. I had the necessary cables, so when the device arrived I had it up and running in minutes. Wow! The picture quality is outstanding. I have my own sound system, so I ran an optical digital cable from the Amazon into my AV receiver. It's only stereo, unfortunately, but it's clear and dynamic. The remote is tiny but easy to use. Depending upon which streaming service you have, it offers voice control. I don't have it so I can't comment on it. If you have a DSL service you should be able to use their wireless router. This will save you from having to buy one. Copy the numbers that are on the side of the router. During the set-up procedure you'll be asked for your system's code. Enter the numbers you copied. It's as simple as that. The only troubling thing about the Amazon Fire TV is that you can't shut it off. It's supposed to shut itself off in 30 minutes after you stop using it, but mine remained on for two hours. Not a big problem, however. Anyway, if you're in the market for a streaming device this is the one you want. Easy to set up, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Don Watson \"film lover\""}]