[{"rating": 2.0, "review": "while watching a movie it restarts way to many times and the buffering is happening an awful lot.", "verified": true, "helpfulness": "1/1", "author": "ann taylor"}, {"rating": 5.0, "review": "This device is awesome my whole family is enjoying it.....  Amazon has done a good job once again.", "verified": true, "helpfulness": "0/0", "author": "Jerry Mendez"}, {"rating": 5.0, "review": "Works great and I'm sure that I am barely scratching the surface of what it can do.  Was able drop down to a lower level plan with ATT U-verse.  The only downside the vast amount of programs you can view I sometimes catch myself looking for 10 minutes exploring all the available programs.", "verified": true, "helpfulness": "0/0", "author": "Justin R Logsdon"}, {"rating": 5.0, "review": "Totally Awesome, the movie marathon is on! We love it. Met our expectations.", "verified": true, "helpfulness": "0/0", "author": "LoveAG"}, {"rating": 4.0, "review": "I purchased this so I could use Amazon Music in my living room. My bluray player didn't offer that app. Does everything it says it will do. Easy set up. easy to navigate.The only thing that would have made it better for my situation would be a power off switch. I connected it through a HDMI switcher. The switcher automatically detects which device is on. Without a power off on the remote, the HDMI switch wont work automatically. To remedy the situation for me I connected the Fire TV to a HDMI input on the TV and connected my bluray player and cable box to the switcher. They have off switches. I would recommend this device to my friends.", "verified": true, "helpfulness": "0/0", "author": "philip smith"}, {"rating": 3.0, "review": "I am getting occasional stuttering with my unit while watching netflix.  I have a high speed Ethernet connection to it.  Netflix never stuttered when using the app that came with my bluray player so I know the problem is this unit.  Either this is defective or does not have the processing power.I will return and get a replacement.  Will update review if replacement works flawlessly.", "verified": true, "helpfulness": "1/2", "author": "John Lessnau"}, {"rating": 4.0, "review": "very cool product. We had never tried anything else like this before, but we can't really complain.", "verified": true, "helpfulness": "0/0", "author": "Kelly Whalen"}, {"rating": 5.0, "review": "This is the best thing since the advent of the television. Yow, I've not watched cable TV since I've setup this box. Luv it, love it, luv it.", "verified": true, "helpfulness": "0/0", "author": "Gary B."}, {"rating": 5.0, "review": "What an awesome little device. The ease of use is high, the transition between apps and programs is very fluid.  I also like the fact the it doesn't to be line of site thanks to the RF remote.  The screen saver mode is a great addition.  All in all I'm very please with the purchase but I only had it for a few days.", "verified": true, "helpfulness": "0/0", "author": "Seth R. Magee"}, {"rating": 4.0, "review": "Easy to use just wish with all the ultraviolet stuff out there that the Fire would have the VUDU app. Also would be nice to get to iTunes.", "verified": true, "helpfulness": "0/0", "author": "Shannon R"}]