[{"rating": 5.0, "review": "Had to buy one cable but very easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Darla Reiling"}, {"rating": 2.0, "review": "It reall isn't that I don't like it, I can't use it because of the limitations of my system. I'm in a remote area with Dish Network and this won't work. I returned it.", "verified": true, "helpfulness": "0/0", "author": "emrey"}, {"rating": 4.0, "review": "So far it has met all my expectations,  but to be honest I have only had it less than a week.", "verified": true, "helpfulness": "0/0", "author": "PS"}, {"rating": 4.0, "review": "I would give it 5 stars \"but\" the movies are in letter box when they should be 16:9 format. This is not a fault of fire tv but amazon. The remote should be better, slow motion would be nice. Great so far except for the format that will not fill my 80 inch hdtv. Amazon please work on thsis. i feel you have the resources to do so. A 5 star except for the format.", "verified": true, "helpfulness": "0/0", "author": "Bill L."}, {"rating": 5.0, "review": "So easy to setup and operate. It's great to have all those viewing and listening options available in one spot. Will come highly recommended to others if I'm asked.", "verified": true, "helpfulness": "0/0", "author": "Turkish"}, {"rating": 5.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Maria E Rippon"}, {"rating": 2.0, "review": "First off minus 1 star because when i got it, it stated I would get a free trail. Instead i was charged twice for prime, once the day after registering and another a few days later. I finally got one charge refunded but never got the trial. Another minus star is trying to find stuff is a mess. Everything is grouped together. Yes it has separate things for apps, movies, music and ect. And yes each in its own category, but what sucks is the buy stuff is mixed with the pay stuff. So if your going to browse and find something you like chances are you will need to buy it because it's not a watch now on prime. Their seems to be no way to only see what you are paying for prime for only, it like having a gym membership and going in and finding vending cash boxes on the machines.The last minus star is what is with the prices of the movies and show's. Some can be as low as $5 all the way to $20 for movies and rental fee's are all over the place also. For the most part it's cheaper to go to a store and buy it $20 and you don't even get a hard copy??? The TV shows also seem way over priced.Another thing I would take a star for is the entry of the password on it. Anyone in the room can watch you input it, so what is the point any child smart enough to hit buy will learn to remember the code as it's entered in plain view. They should change it so that it is a combination of button clicks on the remote or add numbers to the remote otherwise it is a pointless password.A plus star is that this thing is fast and well built and has the best spec's out of all I looked at.The second star and could be plus two, and is the reason I didn't minus one for the PW, is it makes Netflix dash awesome. My Samsung TV was horrible. Also Hulu is nicely set up and any other app for that fact is just awesome.", "verified": true, "helpfulness": "0/1", "author": "Berger"}, {"rating": 5.0, "review": "Love the voice search!", "verified": true, "helpfulness": "0/0", "author": "RobertsHP"}, {"rating": 4.0, "review": "son likes it", "verified": true, "helpfulness": "0/0", "author": "Harold Bakken"}, {"rating": 3.0, "review": "The remote is crap.", "verified": true, "helpfulness": "0/0", "author": "Kirby Haskins"}]