[{"rating": 5.0, "review": "OMG, I love this!  Easy to use... great styling, nice feeling remote.  Much more than what I thought it was.  Thrilled with this purchase.  Amazon is becoming my favorite site for just about everything.  Competitive pricing on movies, Prime membership is a super deal, just very happy with everything.  Highly recommend this item, especially if you're a Prime member.  Much easier than watching from computer.  Wide variety of items and oh, Sling TV is also very good.  Not crazy about commercials, but hey, everyone wants to make a buck, right?", "verified": true, "helpfulness": "0/0", "author": "Dana Bishop \"tattood ferret\""}, {"rating": 5.0, "review": "Love it.... Way to go Amazon, I use it every day. Just plug it in to a Ethernet cable streams lightning fast.", "verified": true, "helpfulness": "0/0", "author": "jonathan h shields"}, {"rating": 5.0, "review": "Love Amazon Fire TV!!!", "verified": true, "helpfulness": "0/0", "author": "plmorales"}, {"rating": 5.0, "review": "works great and is easy to setup.", "verified": true, "helpfulness": "0/1", "author": "Charles Lewis"}, {"rating": 5.0, "review": "Finally decided to cut the cord after many years with Direct TV. This box is great if you're a Prime subscriber. Would like to see more included movies, but between Prime and Netflix there are a lot of options. Plus it has a kid mode that you can set times and access for the little ones. Overall this is a great option.", "verified": true, "helpfulness": "0/0", "author": "James C. Holcomb"}, {"rating": 4.0, "review": "Have used Roku & Chromecast. Its perfectly suit my requirements. Also has cool games which I didn't find in Roku or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "sapna naveen"}, {"rating": 5.0, "review": "I didn't know what to expect with this purchase but I have grown to love it! Honestly the remote with the mic is worth spending extra for. I'm so obsessed with the remote; it feels nice, the layout just makes sense, and it's so easy to use! I don't use this for any games really but mostly just watching Prime shows and movies and the movies I have on my Flixter account! I hardly ever have any buffering issues or quality problems. The box itself is so tiny and cute and doesn't seem to heat up very much while it's running! If you've got Prime or even Netflix, I'd recommend this. If you're on the fence about buying this, the remote is so worth it. I can't oversell that enough; I love it! I have larger hands, too, and the size isn't a problem. Everyone in my family loves using it!", "verified": false, "helpfulness": "2/2", "author": "Brittany"}, {"rating": 1.0, "review": "Can't get any help on how to set my Amazon Fire TV up, and was reading and said I was set up since 3/2/15, just don't know how to make it stream like I thought it was suppose to.  Surely its me just not know what to do.  Seems to me sometimes I was born in a different century and can't pick up on all the new devices out their.", "verified": true, "helpfulness": "0/1", "author": "Tommy"}, {"rating": 5.0, "review": "The fire stick is so much fun to have. Having access to HBO is fantastic. The other things that Amazon offers on the prime is just fun. I refuse to pay for cable, we have Comcast and AT & T here and they are so overpriced, and I simply refuse to pay the overpriced charges.  Right now we are watching a lot of HBO and PBS. Hand of God was riveting, hey Amazon make more of Hand of God. The fire stick at $39.00 is a such a small price to pay to have access to all prime offers. The set up is extremely easy, but the remote is a problem. It is small but opening the battery compartment really sucks. I cannot open it, so I have my husband do it. The remote needs to be reconfigured for the battery compartment. It is poorly designed. I would recommend purchasing this.", "verified": true, "helpfulness": "0/0", "author": "Susan Crawford"}, {"rating": 5.0, "review": "Love this machine full 1080p Much higher than Rouk 3 720p.  I owned Roku 1, 2, and 3 AND HAVE WD MEDIA PLAYER.  THIS BY FAR THE BEST!  ONLY THING TO MAKE IT BETTER IF YOU COULD CONECT A HARD DRIVE TO  IT AND PLAY MP4 WMV AND DVDR.", "verified": true, "helpfulness": "0/0", "author": "Rickey A. Beamon"}]