[{"rating": 1.0, "review": "Nice unit, but hbo2go & showtime anytime apps don't work with my internet provider(charter, Comcast doesn't work either btw), wouldn't have purchased if I knew that.", "verified": true, "helpfulness": "1/3", "author": "JAMES WEAVER"}, {"rating": 5.0, "review": "I finally set this up after procrastinating for 4+ months. Set-up was a breeze! Out of the box and in use in less than 10 minutes, and that's going at a slow pace. Navigation is easy and clear, and the voice command feature works great! I've only used it for a couple of days, but so far I love it!", "verified": true, "helpfulness": "0/0", "author": "homebrew37"}, {"rating": 5.0, "review": "Amazon fire is great. Got half off for trying Sling TV. A couple more channels and bye - bye cable. Would recommend to everybody.", "verified": true, "helpfulness": "0/0", "author": "brian mccullum"}, {"rating": 5.0, "review": "A lot of power from such a tiny box.", "verified": true, "helpfulness": "0/0", "author": "Cyrus"}, {"rating": 4.0, "review": "Great little box. High quality finish and the interface is very good, but still needs work.Need a way to force HD mode. Most times a video will start in very low resolution, then after a minute or two, it will go into HD. Plus it would be great if Netflix had voice support.ThanksEric...", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Wonderful, I love it!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Jennings"}, {"rating": 2.0, "review": "Absolutely horrible. Everything must be paid for nothing is free. The pricing for all of the shows are ridiculously placed. I'd much rather buy it in blu Ray for the price given", "verified": true, "helpfulness": "0/2", "author": "Doc"}, {"rating": 5.0, "review": "I am so excited about my Amazon Fire TV!  It is so much better than Apple TV! So unbelievebaly easy to set up and I love that I can control it from the app on my phone. Purchasing this is saving me $150 a month from my cable company and gives me everything I want.  Thank you!", "verified": true, "helpfulness": "1/1", "author": "Erin Curry"}, {"rating": 5.0, "review": "I love my Amazon Fire TV. I'm saving a ton not needing cable, well worth the price of the Fire Tv. I even love the screen saver pictures. LOL The only bad thing I have found is I can't access my vudu account with it. There may be a way and I just haven't discovered it yet. I love the talk feature. I don't have to type just push the button and tell the remote what I want to watch!!", "verified": true, "helpfulness": "0/0", "author": "Betsy Wooters"}, {"rating": 2.0, "review": "I bought this item and it has been relatively seamless to use. It came preloaded with my info, which was nice. I added Netflix, Hulu, and Youtube and Pandora to the device and use them regularly.After about two months of using the Fire TV it started producing a random tinny or fishbowl sounding audio signal. I would have to reset it to get it to go away. So I switched to the optical cable and used that instead of running the sound through the HDMI to the tv. The optical cable went to my surround sound system, and the tinny sound still persisted at random times. So I tried it on my tv upstairs through the HDMI again and the same tinny sound came through randomly too.After having contacted amazon customer service, to get the processed started for a warranty replacement, they informed me that I have to contact my two manufacturers of my tvs and surround sound manufacturer to \"try to get the issue resolved through them\" and have to provide documentation that I have done so to get Amazon to \"look into the issue further.\"If on 3 separate devices (55\" Mitsubishi T CinemaVision 50\" and a Samsung 42\" LCD and a JVC Surround Sound receiver) and 2 separate sound connections (HDMI and Optical) the sound shows up as tinny randomly, it's not the devices the Fire TV is connected to. Definitely the last time I buy an Amazon product if their warranty policy is this rediculous.", "verified": true, "helpfulness": "0/1", "author": "Blake"}]