[{"rating": 5.0, "review": "Unlike a lot of other reviewers, I don't have any experience with other brands of on demand boxes. I have cable, yes from Verizon and I use TiVo which is great. But frankly I wanted to wait for Amazon to come out with something like this. I didn't want to have to sign up for another service. Amazon Prime would be it, which I can watch through my computer, but I waited. And waited. And waited. Now that the wait is over I got this today. Plugged it in, waited a little more for the updates to take place, and viola.Instant on demand from Amazon. Love it on the big screen. For me, it works perfectly. To be honest, I didn't think the voice command would work as good as Amazon claimed, but I was wrong on that point. It works really good. Moving around the menu is extremely fast. The packaging was easy to open. It really couldn't have been more easy. Thanks Amazon.Now I do have one gripe: When watching a video through Prime which is free for me (if the video is free), the Prime selection is somewhat hidden. You have to choose Other viewing options for Prime. If you don't, then your only options are to purchase or rent it. I find that somewhat sneaky. But I also understand that options to purchase something will always be given before the free version.", "verified": true, "helpfulness": "2/5", "author": "F. JOHNSON \"fredjohn1\""}, {"rating": 2.0, "review": "After waiting the 30 minutes for the box to power up, download updates, download more updates and then force watching the getting started video, I immediately went and downloaded Plex to connect to my media server.  Looking at the list of content I tried the voice search to find that it doesn't go to the content I already own (and had even purchased from Amazon) but instead it wants to sell me yet another copy of the content.", "verified": true, "helpfulness": "7/11", "author": "John Toebes"}, {"rating": 5.0, "review": "My wife bought two of these, and they arrived today.I had to change the registration of mine from her Prime account to mine, and it went flawlessly.I got to watch the Indians win their first home opener in 6 years, on my HDTV, instead of my PC or Fire HDX by using fireTV to mirror the Kindle.  It worked without a hitch.Highly recommended!", "verified": true, "helpfulness": "1/5", "author": "DW"}, {"rating": 3.0, "review": "Hopefully some of this will be fixed in future software updates, but for those looking to buy right away, please read these words of caution.1) There is a Showtime Anytime app but it does NOT work for Comcast customers.  The device/software requires you to register (which makes perfect sense) but Comcast/XFinity is NOT one of the options.  If you are a Comcast customer hoping to watch Showtime Anytime on this device you will NOT be able to do so.  This is something where I think Amazon should be making it very clear this is the case in their advertising.  It's quite misleading to advertise the service, but not make it clear it's only available via certain providers at this time, and for who knows how long.2) I've tried hooking up USB devices with multiple different formatting methods (FAT, NTFS, exFAT on both sticks and HDD), and as far as I can tell, external storage is NOT recognized by this device in any way.  It's possible they're recognized, and there is no app/browsing support at the moment, but it's hard to be sure.  The problem here, if it's a software issue, I have no way to verify that my USB hardware is working properly, and thus whether or not I should return the device.That said, the device does stream well, and Amazon Prime/purchased videos, as well as Youtube video, look fantastic.  I also played Zen Pinball using the supplied remote, and it was playable, but there is some slight button response lag.  I have no idea if this is true for the game controller as well.  I hope not.  However, there was no video lag for the game at all, which is a good sign.I gave 3 stars, because I think it's a bit unfair to slap a 1 star review on something that fundamentally works, but may not be as feature complete as we want it to be.  However, it's pretty shady to advertise features that, as yet, don't seem to work properly. I realize in the land of marketing it seems acceptable to obscure the full truth, but for me it sours my opinion of the company as a whole and I tend to distance myself from that company whenever I can from that point on.  Transparency may not fuel impulse purchases, but it does foster long term loyalty.", "verified": true, "helpfulness": "3/5", "author": "A. B. Chrystie"}, {"rating": 3.0, "review": "Ok, just a day with the unit so far. Like the access to the Amazon Prime movies and shows. Nice, but missing a few features that would at least equal the competition.  And yes I do also own an Apple TV and Roku. No HBOgo is a big mistake. Another big omission is the access to my Amazon Cloud music. Why am I paying Amazon extra dollars to load all my music to their cloud and have no access via the Fire TV.  What a huge omission. Shame on you Jeff!", "verified": true, "helpfulness": "5/8", "author": "Michael R. Jordan"}, {"rating": 5.0, "review": "The setup was very easy. I just followed the few setup steps carefully. Connected right to my Wi-Fi network.After two days usage, we've found some features that really suit our needs. First off, we're not TV people. We just have a roof mounted antenna. No cable, no satellite, no Roku, Apple box, etc. This is our first venture into streaming. We're very impressed.We like:1) Mostly we watch Prime documentaries. Out tablet is 7\". Watching them on TV is an amazing improvement. Amazon isn't making much money off us. We've never yet paid for content.  We wait until things go Prime.2) We store all our photos on the Amazon Cloud, for free. Viewing them on the TV screen was great fun.3) Our Fire HDX is the 7\" type. Quite small for some type of content. We discovered we can \"mirror\" the HDX on the TV. What an improvement for watching some type of internet content.4) The lack of a good selection of games is not an issue to us. We aren't game players. Our grandson did enjoy playing the available free games.5) We don't subscribe to Netflix, etc., but having the convenient capability is nice.All in all, we feel the $99 was money well spent.Ed", "verified": true, "helpfulness": "3/4", "author": "ed"}, {"rating": 4.0, "review": "I'm not a videophile.  I wanted a way to watch Amazon Prime Videos off of my computer.  This is it.  My Game controller is en route so I hope it's fun.Super easy setup.  I like the simple, intuitive remote.  I can search w/ or without voice, so it's not a huge deal to me either way.  I don't use Google Now either.Playing Netflix and Prime videos are my goal.  Goal achieved.It'd sure be nice if I could play my NAS hosted videos, even if I had to host a media player...  I'll give 5 stars if/when we get an update that allows that.  ONLY if it includes mkv files.", "verified": true, "helpfulness": "2/3", "author": "Rover"}, {"rating": 2.0, "review": "I have terrabytes of local content, both music and video that I want to access.  Without it, the Fire has nothing over the Roku (which also doesn't do local content).  I was hoping to have the functionality of my WD TV live with the added bonus of accessing my Amazon Prime content.  But no luck.  If it weren't for Plex this would be in a box on its way back right now.", "verified": true, "helpfulness": "7/15", "author": "R S \"Wrenchbert\""}, {"rating": 1.0, "review": "This makes a lot of sense why you can't do prime video on chromecast. Just pisses me off, I get it that you want to push your product but its something you sell but don't support.Prime video is on Samsung blu ray players, xbox, and other things why not Chromecast.", "verified": false, "helpfulness": "10/63", "author": "William Bishop"}, {"rating": 4.0, "review": "and so far so good. I won't repeat too much of what others reviewers have already written here, but aside from some difficulty setting it up the first time (not the Fire's fault) it gave me pretty much what I was expecting. As an Amazon Prime member the most important feature was to be able to stream Amazon movies and tv shows to my large screen HDTV (something Chromecast and Apple TV won't do), and it did this very well.  Netflix works as well.  I had some trouble setting up Pandora, but will try again another day. My husband and I love the voice remote: it is efficient and pretty accurate. I deducted one star because Amazon should clearly state that one needs an HDMI cable; fortunately my husband had the right one, otherwise I would have been one unhappy Amazon camper!", "verified": true, "helpfulness": "2/3", "author": "Marcy5"}]