[{"rating": 4.0, "review": "Ive had this box for a few weeks now and I can honestly say I really enjoy it.Several issues that I encountered:1. When I first started using it, I had a really hard time with the apps. I kept getting errors with downloading Netflix. After spending about 30 mins on the phone with tech support we finally figured it out. I had to unregister myself from the box and reregister.2. Trying to find apps to download seemed a bit cumbersome. I ended up just going on amazon with my laptop and downloaded it from there.3. Connection seems pretty fast and ALMOST immediate. I have had some issues with the box losing connection which is why I deducted 1 star. It is very annoying to constantly have to go back to the home screen and have the box search for signal several times during an episode.", "verified": true, "helpfulness": "0/0", "author": "K.Q"}, {"rating": 5.0, "review": "The only thing that's missing is voice search for sources of entertainment other than from Amazon.", "verified": true, "helpfulness": "0/1", "author": "HSP_1"}, {"rating": 5.0, "review": "Fast! I recommend this to all my friends since it is easy to add xbmc.", "verified": true, "helpfulness": "0/0", "author": "Edd Rodriguez"}, {"rating": 4.0, "review": "love it and all I am able to do with it", "verified": false, "helpfulness": "0/1", "author": "Bill Harman"}, {"rating": 3.0, "review": "need more free movies", "verified": true, "helpfulness": "0/1", "author": "allan austin"}, {"rating": 4.0, "review": "It was easy to install. Easy to use. The only problem I have is trying to mirror it to my Kindle.", "verified": true, "helpfulness": "0/0", "author": "D. Bowen"}, {"rating": 1.0, "review": "There is no way to see prime content only ...so you end up wasting time and being disappointed when you are constantly told \"NO, requires additional cost\"", "verified": false, "helpfulness": "3/10", "author": "ED \"Ed\""}, {"rating": 5.0, "review": "I love Amazon fire tv, it's better than I thought,a must buy to all..", "verified": true, "helpfulness": "0/0", "author": "carlos diaz"}, {"rating": 5.0, "review": "We love it. There are tons of free movies with Prime and they're new releases unlike on Netflix", "verified": true, "helpfulness": "0/1", "author": "caroline pumphrey"}, {"rating": 5.0, "review": "All our regular use TV's are smart, so this is a back-up in case there is a \"channel\" they don't get (or for an older TV, but that would require an HDMI to video or RF adapter !).  The size is amazing for what it can do !  I must buy one of the carriers to mount it on the back of a TV :-)", "verified": true, "helpfulness": "0/0", "author": "GUSR19 \"JimE\""}]