[{"rating": 1.0, "review": "Pretty cool little box, except it is as limited as Amazon is arrogant.  The GUI is quick to navigate, yet again, it is for the most part wholly geared for Amazon only. I don't mind side-loading .apk files, but through an ADB bridge is tiresome and outdated.  I would have kept it, but the hardware failure made it completely unusable.", "verified": true, "helpfulness": "2/8", "author": "Atlaswar"}, {"rating": 3.0, "review": "The amazon Fire TV is easy to use it's fast to get the movie going and has a lot of possibilities. Would love to see more apps that would make this a better product. Let's get History channel, and all of the local channel apps. They should play audio in 5.1 not 2.0", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Almost there! I had been waiting for the Mad Katz STB to go down in price as I needed to replace several old Rokus. I mainly run Apple devices but they have lagged in a STB that will run apps.Since I buy almost all of my digital content from Amazon I thought why not try this.I was amazed at the performance and great UI. Streams Amazon without the constant reboots we got on the Roku even who a Roku 2. The other apps are decent and games... Wow. Haven't turned my Xbox on since getting it.Now the cons... First it is VERY disappointing that you can't expand the storage space. I would say that might be the only thing keeping me from keeping it long term or buying a few more for my family. The price point is nice to just slap on each TV. But 4 games and poof the storage is gone.Also some apps like Amazon Cloud Player are missing. Really? Very upsetting to miss my music. Also really want Spotify. Other than that the apps are what I needed.Finally... It is so hard to find Prime content. Yes you can but there really should be a category for it in the Nav like their app on Roku does.I hope a device like this can be my one and only STB because at the price getting a few years out of it and upgrading won't be painful like a huge game console. Plus you could even hide it behind a wall hung TV!", "verified": true, "helpfulness": "2/2", "author": "Vince Arter Jr."}, {"rating": 5.0, "review": "Next best thing since sliced bread !!. The best thing about Fire TV is it just works... It can't get any easier plug it in connect to your internet and BAM you have video on demand.I would give it 10 stars if I could !!( Make sure you watch the video on the first run )", "verified": true, "helpfulness": "0/0", "author": "BusterBayVideo"}, {"rating": 5.0, "review": "Love it!!!  We haven't stopped watching cartoons since we got it. Buy this, a digital antenna and ditch cable. It's worth it. Join the movement cut the cable", "verified": true, "helpfulness": "0/1", "author": "Angela D. Fogarty \"CarDad\""}, {"rating": 4.0, "review": "I'm very happy I purchased the Amazon Fire TV, great product, the device works great.I would recommend this product to a friend.", "verified": true, "helpfulness": "0/1", "author": "Thomas Leonard"}, {"rating": 5.0, "review": "It's easy to set up and use.  I really love it. All you do is plug it in to the TV and wall and let it update for 2-3 minutes and your on your way.  And the price was good too", "verified": true, "helpfulness": "0/0", "author": "ILANA Kekst"}, {"rating": 5.0, "review": "Within minutes out of the box it was running just as advertised. We had just installed an antenna for our network stations. With FIRE I have \"cut the cord\" to my satellite programming, saving $75 a month!  So we bought a second FIRE for my grand daughter's bedroom.Just wish AMAZON had posted the news that we here in Florida were now paying tax on our buys. I took the order down and resubmitted before sending when I saw that! A warning that the warehouse built in the state opened us to new TAX charges!", "verified": true, "helpfulness": "0/0", "author": "J. A. Lynn"}, {"rating": 5.0, "review": "Amazon Fire sets up quickly and with ease.  Smooth streaming, no pauses, no audio problems.  Wish I had this long ago.  Highly recommend.  High all but most basic cable removed.", "verified": true, "helpfulness": "0/0", "author": "PATRICK R. McDERMOTT"}, {"rating": 5.0, "review": "The Kindle Fire exceeds my expectations!It is simple to install and operate.How can something so small perform so effectively?Amazon Rules!", "verified": true, "helpfulness": "1/1", "author": "Chasgom"}]