[{"rating": 4.0, "review": "So far so good. It is as expected, read the reviews for finding prime content though. one fault is i'm surprised how few older classic moves are not available with the prime account.", "verified": true, "helpfulness": "0/0", "author": "Brian Kindzierski"}, {"rating": 5.0, "review": "I just bought it and still getting familiar with it. Set up was a breeze. So far so good!", "verified": true, "helpfulness": "0/0", "author": "Tammy Penna \"TPenna\""}, {"rating": 5.0, "review": "I own Roku, Chromecast and now Amazon Fire TV and I find Fire TV to be superior.", "verified": true, "helpfulness": "1/1", "author": "James Troy Martel"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "S. Warren"}, {"rating": 4.0, "review": "Very easy to set up and immediately start using.", "verified": true, "helpfulness": "0/0", "author": "Karla Frenette"}, {"rating": 4.0, "review": "amazon tv is missing some key aps.  you cant watch the simpsons world or the fxnow ap", "verified": true, "helpfulness": "0/0", "author": "Jacob L."}, {"rating": 5.0, "review": "Very nice quality product and such a small device. Just plug it in follow the on screen directions and that is all there is to it. For WWE fans this device will connect you in a couple of clicks. I myself have no problem with the speech recognition on the tiny remote, just hold the button down and speak. The only drawback.................NO HBO.Amazon has now come out with a Fire TV stick to be released in 2015, and that will be my next addition since the Fire TV itself works so very fine I see every reason to expand it to all my TV's.Buy one and enjoy!", "verified": true, "helpfulness": "0/0", "author": "Sparkles \"Pom & Dobe Lover\""}, {"rating": 4.0, "review": "After excellent performance since April 2014, on November 15, 2014, the Amazon Fire TV started NOT showing video for movies or videos.  The audio was OK.  I tried  to problem solve this using Amazon help.  I unplugged the device and re plugged it several times, checked the HDMI cable.  All that led to \"no signal\" messages on my TV.  I like this set box, and so bought another.  I would  think it should last for at least a year.  I have used Apple TV, but the Amazon Fire TV is easier especially with the voice recognition.Two days later I had swapped out the HDMI cable, restarted Amazon TV and had given up and ordered a new one.  Today I was fiddling with the remote.  It used to air on HDMI 2 and I played around and switched to to HDMI 3, and then happily it WORKED again.  Thanks to the people who had suggestions.  I tried them and did not give up hope.", "verified": true, "helpfulness": "0/0", "author": "PAG"}, {"rating": 5.0, "review": "So far I am very happy. When coupled with the new Cloud Drive, we can view all of our digital photos on the tv. Downloaded the Plex app so we can do the same with our home videos. Netflix loads much faster and has a nicer interface than our bluray player. I am debating getting another one for the basement tv.", "verified": true, "helpfulness": "0/0", "author": "R. Hepperle"}, {"rating": 5.0, "review": "small,simple to use, i love it", "verified": true, "helpfulness": "0/0", "author": "Nancy L. Butler"}]