[{"rating": 4.0, "review": "This device is awesome.i have always wanted to watch my amazon content on the big screen...and also the more you purchase your library just grows and grows.having your library saved on amazons servers is a plus so you save a lot of space.my only gripe is the pictures folder i dont know how to manage them.it has the album art included with my pictures so they are in the slideshows as well..i highly reccomend this device.", "verified": true, "helpfulness": "0/2", "author": "walder  Ross III"}, {"rating": 1.0, "review": "Won't recognize my Wi-Fi network to authenticate, so it is never connected to the internet, which makes it a $100 paper weight. Called customer service and the gentlemen didnt know what a Fire TV was. Finally got to a someone that did and he said he needed to escalate it to the engineers. Still haven't heard back.Very disappointing amazon. Very disappointing.", "verified": true, "helpfulness": "54/61", "author": "Chuck McGee"}, {"rating": 5.0, "review": "I got this product after the WiFi antennae on my BR player started to go out. I immediately noticed that the unit connects instantly when I make a selection, rather than clocking for minutes at a time as my BR did. The picture is excellent, I have had no connection problems and it works excellently with Amazon Prime Video On Demand. Set up was as simple as they say, just plug it in, log into your network, and it's connected. I would recommend this to anybody and everybody.", "verified": true, "helpfulness": "0/1", "author": "G. Relyea \"military reader\""}, {"rating": 4.0, "review": "The Fire tv was a breeze to set up and is very easy to use. It favors Amazon content of course, but the major competitors are all there except for HBO. It would be even better if the search function worked across all subscribed services. I am very pleased with the purchase.", "verified": true, "helpfulness": "0/1", "author": "Gregory W. Allen"}, {"rating": 5.0, "review": "I was very hesitant to purchase this product. I received a Sony BLU-RAY BDV-E580 Player as a company retirement gift. The surround sound and the player is fantastic, but the TV stream feature is a challenge to operate. The on screen ICONS are very similar to Amazon Fire TV if you can even get to the point where you can see them on the screen. Without fail the Sony fails each and every time. I must try and try again while I get many error messages stating that I can not connect and do I wish to retry? Once I get connected, I can then view YOUTUBE or VUDU, but I then must try over and over again to go past this point to connect to my Amazon account. I always suspected that my connection speed of 6 MBPS might be a bit too slow for this service until I got my new Amazon Fire TV and found that I was totally wrong. The Amazon Fire TV works perfect every single time. I just click on or say with my voice and the command is responded to instantly with never a failure of any kind. It is true that an HDMI cord from my Kindle to the LED TV will put my Amazon Prime Movies on the screen, but the Amazon Fire TV does much more. This is a great product from Amazon.", "verified": true, "helpfulness": "0/1", "author": "Dennis Kafka"}, {"rating": 3.0, "review": "Fire TV is a great streaming service, if you subscribe to the networks listed. They are lacking access to networks that include the shows we watch. Even with Amazon Prime this seasons' episodes cost. If your used to watching cable or satellite and keeping up to date with network shows, don't expect that here unless you pay per episode. Also, there is no app that allows user to surf the internet. With this I was unhappy. How can you stream music and tv/movies and not be able to surf and stream online? It's tricky to navigate once you've selected a show, you would think if you're a prime member your show would automatically come up as free. But it doesn't, you have the option of paying first and you have to go through a menu to choose the free through prime option. Guess what happens when kids have the remote... The streaming was great, voice service was okay. Networks, well, they could've included a few more and the rest I wasn't too happy with. I returned it after a few days. We can stream hulu on the wii for cheaper and it's far less confusing.", "verified": true, "helpfulness": "0/2", "author": "Brandy Powell"}, {"rating": 5.0, "review": "Works as advertised and it is easy.  We have enjoyed watching the numerous movies and TV programs available with Amazon Fire TV.", "verified": true, "helpfulness": "0/1", "author": "Leslie Fryar"}, {"rating": 5.0, "review": "Simple, fast, easy to use...downloaded the netflicks app and we have our two favorite streaming services in on one convenient box.", "verified": true, "helpfulness": "0/1", "author": "Del57"}, {"rating": 5.0, "review": "One day delivery as stated. Easy to hook up. Hooked up to wireless in less than a minute after entering password. Movies are almost instant and it doesn't lose connection are have to stop and re- load. Was using a Sony  dvd  player to hook-up to amazon. it took for ever to connect. and would lode connection or stop to re-load.", "verified": true, "helpfulness": "0/1", "author": "jim burk"}, {"rating": 4.0, "review": "I really like amazon Fire TV.  The wireless performance is great.  HD is actually HD.  My only gripe is that when you watch a movie halfway through, and then stop it, when you come back, you can only resume.  If you want to watch from the beginning, you have to \"rewind\" the movie like an old VCR...", "verified": true, "helpfulness": "0/1", "author": "Das Gooch"}]