[{"rating": 5.0, "review": "awesome little box", "verified": true, "helpfulness": "0/0", "author": "River812"}, {"rating": 4.0, "review": "Sad that i Can't download YouTube", "verified": true, "helpfulness": "0/0", "author": "Abel"}, {"rating": 5.0, "review": "As Advertised!!!  Plug this amazing device up to my TV and it worked as described.  Remote is easy to use and very intuitive and works without having to point it at the box.  Downloaded movies started immediately and you can even skip ahead unlike on Dish.  Voice option works amazingly well.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "chris russell"}, {"rating": 5.0, "review": "Helps me get a ton of value from my Prime membership.  Well worth every penny I paid.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Tim Warren"}, {"rating": 5.0, "review": "We like it! Big change from cable, but pretty much has everything a person could want to watch. Love love love that personal photos and videos can be right on your TV! Also love the portability!", "verified": true, "helpfulness": "0/0", "author": "Holly E. Roe"}, {"rating": 5.0, "review": "Life changing.Totally changed the way I interface with my TV. Makes my TV really fun to use.Works great. The voice search is perfect. This is so good I wound up buying the stickan HDX 8.5, an HD7 a firestick for my sister, an Echo. And it all just makes the Fire TVeven better. Anything I buy for my tablet becomes available for my Fire TV. It was perfect timingthat the Fire TV added USB storage. I was out of space for big new apps. Now I could go on forever. I don't think any of the other set boxes could be superior.", "verified": true, "helpfulness": "0/0", "author": "Robin McDonald"}, {"rating": 5.0, "review": "Great TV from Amazon, the product surpassed all of my expectations. I would definitely recommend this to a friend.", "verified": false, "helpfulness": "0/0", "author": "Kindle Lover"}, {"rating": 1.0, "review": "Roku is so much better !!!!!  Amazon is VERY limited in apps.  Cannot watch what I really want to watch but rather what Amazon wants me to watch.  I am Chalking this up to a loss and hooking my Roku back up and throwing this away.  Sorry Amazon.  You don't get it.  Really bad apps and cant get anything close to Roku as far as apps and getting exactly what you want to watch.  PLEASE LISTEN TO YOUR AUDIENCE AMAZON !!!!!", "verified": true, "helpfulness": "1/4", "author": "Real Estate Professional"}, {"rating": 3.0, "review": "Love the interface but some apps run a lot better than others!! Apple TV has a clearer picture on most apps but I love the speed and ease of use on most apps... In particular the Showtime Anytime app is mediocre with the picture quality other than that have not found many problems", "verified": true, "helpfulness": "0/0", "author": "Aaron Mains"}, {"rating": 4.0, "review": "Liked it but for the $ I was disappointed that I couldn't run media from my flash drive through it with out having to go through jail-breaking this device and I'm just not skilled enough to do that. Plus from my understanding it voids any type of warranty. All I wanted was a device to play my flash-drive and to stream Netflix and Amazon Prime, Guess I'll stick with an old bluray player and just get the fire stick. Eh, saves me $60.", "verified": true, "helpfulness": "0/0", "author": "fifthday"}]