[{"rating": 5.0, "review": "Love his product. Kids love watching this over the Apple TV we have in another room.Great great great product!", "verified": true, "helpfulness": "0/0", "author": "Connie"}, {"rating": 5.0, "review": "One of the best purchases of all time.  Extremely easy to install and use.  The only problem is the rest of my family likes it as much as me.  Time for a second or third one.", "verified": true, "helpfulness": "1/1", "author": "Jonathan Thomas"}, {"rating": 5.0, "review": "Physically this box/remote both feel like they were constructed with quality. Very clean / small appearance blends in well with my audio/video equipment.Clean interface and flawless streaming from everything I've chosen to view.Very good App store.The only con is the lack of accessing extra storage via the USB port.", "verified": true, "helpfulness": "1/1", "author": "Mark B Pierce"}, {"rating": 5.0, "review": "I tried the Roku (which didn't work), then I tried the Roku the sent to replace it and it didn't work. Consumer Reports likes this product so I purchased this and IT IS WONDERFUL! I would recommend it to anyone. It is biased to Amazon rentals and free streamers but I use it mostly for my Netflix. This product is very easy to use and very quick. I love it!", "verified": true, "helpfulness": "5/5", "author": "Marilyn Carr"}, {"rating": 3.0, "review": "As I write this I have been round and round with tech support to discuss a no audio out issue with the unit. Works fine one day, not the next. I brought it in to work to return it and was told by tech support that I need to go through troubleshooting steps on the phone with them. Now I have to bring it home and call again. To do what I've probably done 2-3 times already.Again, nice unit - if yours works. Mine has issues and tech support/RMA process sucks. I expected better of Amazon.", "verified": true, "helpfulness": "0/0", "author": "Carl W. Samans"}, {"rating": 1.0, "review": "NetFlix runs fine on my PC and tablet but never finishes loading on Amazon Fire TV, or has to stop to load multiple times during watching.NetFlix is the primary product I use, so I have to rate this product as horrible", "verified": true, "helpfulness": "5/8", "author": "rodrigo102920"}, {"rating": 5.0, "review": "can't believe it. true to life.amazing picture quality , unbelievable options in content . am enjoying it during my extended holiday.do i need to buy fitness equipment as well  from u to beat couch potato syndrome.", "verified": true, "helpfulness": "0/1", "author": "M V Vijayshankar"}, {"rating": 4.0, "review": "I have two other streaming boxes-- a TV and a Blu-Ray player. This box is by far the fastest of the three. It quickly loads the apps and content appears quickly on the screen. I really have no complaints about the box and it's workings. But I am not planning on keeping it. I have Amazon Prime and Netflix and am totally underwhelmed by the offerings from both services. If I was made of money I would keep it for it's ease and convenience but I am not willing to spend the money just to have a better experience streaming an occasional video to my TV.And one other thing-- there is no off switch. Sure it turns off after a while but when I am done with it I'd like to turn it off or at least put it in standby.", "verified": true, "helpfulness": "0/0", "author": "A. D. Liechty"}, {"rating": 5.0, "review": "I am not a gamer so my comments have nothing to do with that experience. But for the rest I love Fire TV and using the User Manual I have syched mt Amazon Fire HDX and watch some stuff on my 42\" flat TV including something on HBO GO and some personal photos. The more I use it the better I like it.", "verified": true, "helpfulness": "1/1", "author": "bglou"}, {"rating": 5.0, "review": "I love this system and when I move to my new apartment I will be using it exclusively rather than getting cable. I never have an issue with buffering and between netflix, amazon prime, and hulu anything I want to watch it available. The voice search option is great and very accurate. Highly recommend!", "verified": true, "helpfulness": "1/1", "author": "Kelley Drosehn"}]