[{"rating": 3.0, "review": "The Fire TV itself works well.  I checked first to see if some of the stations I like were accessible, like HGTV & DIY & Spike.  They were.  The problem is that many of the programs are not.  So, I had to go in and buy these programs. Then realized that the programs were old shows.  I wound up giving the Fire TV to someone else.  So, it was a total waste of money for me.", "verified": true, "helpfulness": "0/1", "author": "Cecelia Teague \"ma's stuff\""}, {"rating": 5.0, "review": "I've used this now for a month and a half with my Onkyo receiver.  It's worked flawlessly since I installed it.  I love it and highly recommend it.", "verified": true, "helpfulness": "0/1", "author": "William B"}, {"rating": 5.0, "review": "I absolutely love it!  It was remarkably easy to install and is also remarkably easy to use especially with the voice remote.  You can just say an actor's name and it pulls up all of their movies.  So easy.  What has really amazed me is the picture quality.  Way better than cable HD.  I like it so much I am thinking of dropping the cable altogether (except for the internet service).  Great product!", "verified": true, "helpfulness": "0/1", "author": "AZlaru"}, {"rating": 5.0, "review": "Easy to use and set up, plenty of choices, easy to navigate. Makes searching for what we really want to watch intuitive.", "verified": true, "helpfulness": "0/1", "author": "Brendan M McGinty"}, {"rating": 5.0, "review": "Love Amazon Fire TV. It works great!!! I can watch all my favorite shows and movies.", "verified": true, "helpfulness": "0/1", "author": "Liloma"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/1", "author": "Bobby Hamilton"}, {"rating": 2.0, "review": "First started with the fire stick but it was constantly buffering and freezing...so I bought the fire tv to go wireless.  Same problem. I called tech support and gave them all my network informarion and they said they would work on it and get back to me. Tech support called twice saying they were working on it. That was 3 weeks ago. Going to return both units...the two stars are for when the unit does work..we love it...most of the time its frustraring.", "verified": true, "helpfulness": "0/1", "author": "eileen needham"}, {"rating": 5.0, "review": "This is a fantastic piece of technology. it works wonderfully for my son and I. We really enjoy the Fire TV and all that it has to offer!", "verified": true, "helpfulness": "0/1", "author": "Michael Fetter"}, {"rating": 4.0, "review": "Paired with prime it is good prime needs better movies", "verified": true, "helpfulness": "0/1", "author": "Ronald Pell"}, {"rating": 5.0, "review": "Awesome even with slower internet speeds", "verified": true, "helpfulness": "0/1", "author": "John North"}]