[{"rating": 5.0, "review": "My daughter gave me the Fire TV as as early Mother's Day present. I'm addicted <3", "verified": true, "helpfulness": "0/0", "author": "Suzanne Braband"}, {"rating": 5.0, "review": "All inclusive and so much easier to use than our Apple TV remote.  Can't wait to put one for every room. Did have issues with getting Netflix to work/connect, but it was a quick fix.", "verified": true, "helpfulness": "0/0", "author": "Molson"}, {"rating": 1.0, "review": "the controller will not sync with the tv.  it is completely unusable.  there is a lot of slow time in  getting the programs.  it doesn not function well", "verified": true, "helpfulness": "1/2", "author": "martha ann buffington"}, {"rating": 5.0, "review": "I am amazed at how such a small box can give so much entertainment. We are totally happy with it.", "verified": true, "helpfulness": "0/0", "author": "Bob Faunce"}, {"rating": 4.0, "review": "I really enjoy our FireTV, when it works. Our first one had issues, which Amazon promptly tried to diagnose. (Shipped me a free power adapter, then sent a return for exchange unit.) I think some simple design changes to the hardware would make those problems easier to diagnose. The unit should provide a power light. (From what I can tell, the LED turns on, on the fire TV when a link is established with the remote.) It would be fine if it were a 2-color led, that went from \"white\" on to \"blue\" when connected to the remote. It would have saved Amazon $$ in my exchange case, because they would have realized the power adapter was not the issue immediately. Would have saved them the cost of shipping me a new one and would have gotten me a working unit faster. However, I definitely don't fault their customer service, which is probably second-to-none. It also makes searching Prime content a breeze and we also use it with SlingTV. I love that it has digital audio-out. Nice box.", "verified": true, "helpfulness": "2/2", "author": "E \"epchristi\""}, {"rating": 3.0, "review": "Item was not available at Amazon.com so I found it for the same discounted ($90) price at another online retailer.  Received the item the next day.  Not particularly thrilled with the user interface - found it confusing.  It's faster searching YouTube than my Oppo blu-ray player.  Picture and sound is very good.  Since I don't watch cable/fiber optics TV or many movies except on Blu-ray,  I don't think I would purchase this if I had to do it over again.  Easy hook-up and I can watch using either the TV's speakers or my AV receiver's surround sound without any other cable other than the HDMI.  Was not sure about this from the instructions until I actually tried it.  All in all I'm satisfied with my purchase including price and features.  I'm sure I will use it more in the future.", "verified": true, "helpfulness": "1/1", "author": "NeverReady"}, {"rating": 5.0, "review": "amazon fire is the best thing since sliced bread.", "verified": true, "helpfulness": "0/0", "author": "mike walker"}, {"rating": 5.0, "review": "I really like the Fire TV.  I bought a cheap but fairly nice previous-generation dumb Sony tv for our bedroom, and wasn't interested in putting a cable box in there.  Instead, we use over-the-air digital tv for news and such and the Fire TV for other stuff.  I found it much better than a Chrome stick which I also tried.  It was incredibly easy to set up.  Of course it works best with Amazon Instant Video but it works just fine with Netflix, HBO GO, and Showtime Anytime.  Really a good buy.  I have not tried any games yet but I'm considering it.", "verified": true, "helpfulness": "0/0", "author": "Carper"}, {"rating": 5.0, "review": "I received this as a Amazon Fire from my husband as a gift and I love it.  I am also a member of Prime with Amazon so I get Prime Movies streamed for free.  My husband set it up, so I can't vouch for easy or hard to install.  Not to difficult to figure out how to use it....highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Debora Basini-Herman"}, {"rating": 5.0, "review": "awesome, I wish the voice command worked for all options, not just amazon. other than that I LOVE IT. I got rid of 3 cable boxes and dropped my bill by $70.I binge watch TV shows, its fun! games are okay. some of them are silly but I'm 50.so I like old school, arcade games most.I have one in each bedroom and plan to get on for the living room too.easy set up, easy to use. voice command works great!", "verified": true, "helpfulness": "0/0", "author": "CHEF DEANNA"}]