[{"rating": 5.0, "review": "Hands down the best streaming device for the money.", "verified": true, "helpfulness": "0/0", "author": "MG"}, {"rating": 5.0, "review": "Bought the fire tv exclusively for the sling app. I am also running this app on the Roku 3. On the Roku there is an option to zoom standard digital content but on fire TV the only option for zoom, enlarges all the content, please fix this. Thanks, other than that I like how snappy fire TV is compared to the Roku.", "verified": true, "helpfulness": "0/0", "author": "Rahul Dutta"}, {"rating": 5.0, "review": "Excellent aND simple to use.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Ratliff"}, {"rating": 5.0, "review": "Simple and flawless", "verified": true, "helpfulness": "0/0", "author": "L. Armstrong \"robsonarmstrong\""}, {"rating": 5.0, "review": "Super easy to set up.  Even the husband can find and play what he wants.", "verified": true, "helpfulness": "0/0", "author": "Joyce Riedesel"}, {"rating": 5.0, "review": "Love my Amazon Fire TV. I have since canceled my cable and use this instead. Great product.", "verified": true, "helpfulness": "0/0", "author": "Kat's mom"}, {"rating": 5.0, "review": "Fastest OS out there. Has Never crashed, easily navigable menu. Voice search feature is clutch. Seamlessly integrates with wifi & bluetooth. One thing to improve is using the voice search within apps such as HBO-GO or Netflix.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Fedrizzi"}, {"rating": 5.0, "review": "The firebox TV box it optimize the video for fast video Loading with little lag buffering time.  I would recommend this box to anybody who likes to stream their  content.", "verified": true, "helpfulness": "0/0", "author": "Yan Heang"}, {"rating": 5.0, "review": "Easy to use and very versatile and satisfying technology!", "verified": true, "helpfulness": "0/0", "author": "Rae Ann Engdahl"}, {"rating": 5.0, "review": "I purchased this because the Roku 3 that I tried to install in the living room could not receive the wireless signal from the room directly above it. After getting sick of using a streaming Blu Ray for a year, I took a chance on this product being able to outperform Roku's wireless receiving capability, which it did with no problem. It will be heavily linked to your Amazon account, but I did not find this to be a problem. All the apps I needed are there (good library), and they work quite well so far. The voice prompt also works well, particularly once you figure out the nuances of using it and getting the right search result every time.", "verified": true, "helpfulness": "0/0", "author": "JCW"}]