[{"rating": 5.0, "review": "Loving the AFTV so far!  Dropped our cable subscription down to internet and basic cable channels only and honestly have not missed all the extra cable channels we had now that we have this little box in the living room!  Not to mention I'm saving $100+ now because of it!My only gripe is as others have mentioned...Hulu Plus does not want to run all that well on AFTV.  Video will often freeze while the audio continues to play.  We are lucky to have our smart tv hardwired to our modem so we just stream Hulu through the smart tv and everything else through the AFTV.  Still a 5 star product for us as the Hulu issue appears to be with the app on the Android platform as users of Roku and other boxes have the same problems with it.  Hopefully, a fix will be put out by Hulu soon!", "verified": true, "helpfulness": "0/0", "author": "T. Miller"}, {"rating": 2.0, "review": "No Voice Search on Netflix.  Very disappointing.  I would happily change my rating if this is added in the future.", "verified": true, "helpfulness": "0/2", "author": "Luke"}, {"rating": 1.0, "review": "I am on my second Fire TV. First one had to be returned for sound issues and shuttering while watching sports. The second unit does not have sound issues but still shutters during sporting events. It is very annoying. I have compared the unit to my Apple TV, which is a couple yrs old. Plugged both units into CAT 5 cable and compared over WiFi. The Apple TV has very limited to no shuttering, while the Amazon Fire TV shutters like crazy. I have watched sporting events on SlingTV and Watch ESPN.Second issue is with having to sign into Watch ESPN every day. This is diffenently  not the way to watch sports.If you subscribe to Sling TV. You only have two options for media players, Amazon Fire TV or Roku 3. If I had to do it over again, I would have gone with the Roku 3. If Apple gets Sling TV, I will diffenently go with Apple TV.I am considering replacing the Amazon TV for a 3rd time.Note: I have an Internet speed of 30 Mbps.", "verified": true, "helpfulness": "0/2", "author": "Ralph M."}, {"rating": 4.0, "review": "So far so good.  Working fine.  Good viewing options.", "verified": true, "helpfulness": "0/0", "author": "John Bouman"}, {"rating": 3.0, "review": "This is no fault of the product just a little complicated for the older person to figure out and get use to. I think in time this will work just fine.", "verified": true, "helpfulness": "1/1", "author": "Emmaly Little"}, {"rating": 4.0, "review": "We enjoy our Amazon fire tv. We started watching old shows we couldn't see when they first came out. We binge on them.", "verified": true, "helpfulness": "0/0", "author": "Charene ledbetter"}, {"rating": 5.0, "review": "Fire TV works great so far.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "Setup was easy. I am very pleased with the performance.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Overall I love it", "verified": true, "helpfulness": "0/0", "author": "sherri"}, {"rating": 5.0, "review": "This far exceeds the Roku stick. I tried the Roku and it kept freezing up on me. I was very frustrated. Then read the excellent review on the Fire Box VS Fire stick. Sure glad I went with Fire Box! Love the voice search feature. Best of all, it was uber simple to install and never freezes up. One satisfied customer!", "verified": true, "helpfulness": "1/1", "author": "Julie Schneeberger"}]