[{"rating": 5.0, "review": "Better than ouya. Love the controller", "verified": true, "helpfulness": "1/1", "author": "Georgios Koumantari"}, {"rating": 5.0, "review": "Having lots of fun with Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Michael Colosimo"}, {"rating": 5.0, "review": "Excellent product. In use every day at this household!!!", "verified": true, "helpfulness": "0/0", "author": "sierra-444"}, {"rating": 5.0, "review": "It's great love it", "verified": true, "helpfulness": "0/0", "author": "JOE CORREA"}, {"rating": 5.0, "review": "First tried the Fire Stick but was underwhelmed with lost network issues.  So I bit the bullet and got the Fire box, which is wired directly to the Comcast modem.  Now we are experiencing what we expected, with seem less streaming of Netflix, Prime Video, Sling TV, Watch ESPN and Pandora.It can also do apps, and unlike Apple TV, you can choose which ones you have.  If you have a Kindle Fire, many of those apps will also work on the Fire TV, although some require a separate game controller.  But it might be worth it to see the Game Of Thrones app on a 42- to  65-inch screen instead of a 7- to 9-inch tablet!But overall, the Fire TV does what it's supposed to do, and so far it does it well.  If you have one or Kindle Fires and Amazon's Prime Membership, the Fire TV completes the entertainment trifecta.", "verified": true, "helpfulness": "0/0", "author": "Ron Shearer \"Sports from A to Zito\""}, {"rating": 4.0, "review": "I enjoy the box very much. The only negative I have is that the voice recognition only searches Amazon items. Not all items. Like titles in Netflix or hbo go. It should be able to search everything. Why would I want to search for a prime movie to rent when it is on Netflix", "verified": true, "helpfulness": "0/0", "author": "Tia W."}, {"rating": 4.0, "review": "So far it is better than my old Roku 2 box. It is faster and I don't notice any slow downs. Still to earlier to tell. My Roku got to where it would lose single in the middle of a movie.  That problem started year after I bought it. So far my fire tv it living up to it hype.", "verified": true, "helpfulness": "0/0", "author": "John Mitchell"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "D Kline"}, {"rating": 5.0, "review": "love it...each to set up and if you have an amazon prime membership you get access to all sorts of amazing content for FREE", "verified": true, "helpfulness": "0/0", "author": "cpimsner"}, {"rating": 5.0, "review": "Its cool.", "verified": true, "helpfulness": "0/0", "author": "sjbentle"}]