[{"rating": 5.0, "review": "I love this! The voice search is so great! Manually typing in each letter gets tiresome really quick! I love that some of my favorite shows and movies are Prime; you aren't a Prime member you need to become one!It is very easy to set up and start using, and it is already pre-registered to you (if you ordered it from your Amazon account).It may be a new comer but it will stay around. Apple TV is nothing compared to this!PSI ordered the bundle. The controller for the games is good quality. Also, if you didn't order the bundle, but want to buy the controller, don't be turned off because of the price. People will spend that for video games or more for a game system controller. It's a fair price.*Update August 2, 2015:I am buying my sister and husband's Apple TV, only for the podcast. But Apple TV fails compares to Fire TV. It got so annoying to type in every single letter to search for something, when on the Fire TV you can use the voice recognition. Also, with Amazon Prime you have thousands of free movies and tv shows, which Apple TV doesn't have. On a scale of one to 10, Fire TV receives a 10. It is far superior than Apple TV. You will not go wrong.", "verified": true, "helpfulness": "0/0", "author": "Deanna"}, {"rating": 5.0, "review": "This is awesome, especially with high speed internet. Makes my life easier, and easy for my kids to use.I only wished that the USB port was more functional, like being able to read movie files.", "verified": true, "helpfulness": "0/0", "author": "Jorge Reyes-Ortiz"}, {"rating": 2.0, "review": "The product is ok.  It's easy to use and offers a lot of options.  HOWEVER..........I don't like selecting a program option and then either having to pay additional $ to view it OR having to go to the computer to insert a code in order to watch it.  Entering the code was really frustrating..... I tried entering the assigned code for NFL live on Sunday and it said the code was accepted and successful, but then the program would not show on my TV......very frustrating.  Also, if you don't buy Prime with Fire TV, you don't have a lot of free options.  I also don't like not having local channels or current news.", "verified": true, "helpfulness": "1/5", "author": "michelle hartman"}, {"rating": 5.0, "review": "Wonderful device .Easy to use. Works really well as described. Very happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "Linh Nguyen"}, {"rating": 1.0, "review": "I just want to watch movies and television shows on Amazon and Netflix. While Amazon works fine, I cannot Netflix any Netflix content without an annoying pause every 5 minutes. Before you blame my network setup, my Roku 1 can display Netflix HD without any pauses. For me, this was the deal-breaker. The Fire went into the closet and I keep using the Roku. It's shame.The Fire TV has many great features. Voice search (only works on Amazon). RF-based remote (no line of sight needed). And a ton of other features I don't use.If it worked for Netflix, I would give it 5 stars, but that's a key feature for me.", "verified": true, "helpfulness": "3/7", "author": "ESannon"}, {"rating": 4.0, "review": "I needed this long time ago , just got to figure out how to watch movies from my smartphone on it", "verified": true, "helpfulness": "0/0", "author": "DayDay"}, {"rating": 5.0, "review": "this was awesome until I purchased a SMART TV. Now I use it for travel.", "verified": true, "helpfulness": "0/0", "author": "R. LOFTON"}, {"rating": 4.0, "review": "Very responsive, although some of the apps were slow at times. I ended up returning mine for a smart TV, only because I believe the Amazon Fire TV shorted out the HDMI ports on the back of my previous TV. All and all though, very good and would definitely recommend to anyone with Amazon Prime", "verified": true, "helpfulness": "0/1", "author": "J. Hanlon"}, {"rating": 5.0, "review": "Spoiled rotten!  Not particularly tech-savvy -- so-oo-o easy!", "verified": true, "helpfulness": "0/0", "author": "Slic"}, {"rating": 5.0, "review": "I don't have cable or satellite so I'm living this", "verified": true, "helpfulness": "0/0", "author": "Robin Doronn"}]