[{"rating": 5.0, "review": "Great wish I had ordered it sooner", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing works flawlessly.  So easy to connect and program.  What I have watched on my TV is some of the best picture quality I have ever seen on such a small device.  I have never experienced drop or delay signals.  Its one of the best buys I have ha in many a year.  Thank You Amazon for one of the best built product I Have ever owned..Rick Sons", "verified": true, "helpfulness": "1/1", "author": "Rick"}, {"rating": 5.0, "review": "Love the fire tv! The only things bad I can say is that the instant streaming on the Prime membership doesn't work on my tablet and my cable service provider isn't listed on all the apps so I can take full advantage of all that the Fire tv has to offer.", "verified": true, "helpfulness": "1/1", "author": "Celita"}, {"rating": 5.0, "review": "This was a Christmas gift for my 25 year old son.  He does not have cable, but he says this is much better  than cable.  He can watch whatever he wants, whenever he wants.", "verified": true, "helpfulness": "1/1", "author": "Victoria G. Nunnally \"Lover of African American Novels\""}, {"rating": 5.0, "review": "Very good and easy to use product.  I am able to watch movies and listen to music easily.", "verified": true, "helpfulness": "1/1", "author": "Steve Russell"}, {"rating": 4.0, "review": "Like Netflix. Nothing special but it does have the Prime Membership which comes in handy.", "verified": true, "helpfulness": "1/1", "author": "Tony Polidori \"TPS\""}, {"rating": 5.0, "review": "Prime video streaming became relevant to me when they got the HBO series. Being able to stream 2 different shows at once (on different devices) is nice. Now the FireTV is training me to choose standard delivery to get $1 video credit. I still need to let the nephews try the FreeTime preview. Being able to access unlimited personal photos on cloud drive is also key, and making the most recent images a screen saver has been really nice. Access to AmazonMusic and Prime playlists is ok, just not a selling point to me. The games (and ridiculously backordered game controller) are a selling point. But the ~5gb of usable storage is not adequate for a game machine. I think my image cache alone chews up over 500mb. They really need to allow expanding the storage with USB; that's my biggest complaint ... not enough storage space. I'd also like the UI to let me remove apps from display, but not the cloud. I'd rather enter some sort of Library view to see everything on the device and in the cloud. I also love that it has a USB port, so I can add a Flirc for infrared and use it with my Harmony remote. Miracast support is an extra bonus. It ended up kicking out an Apple TV, Ouya, and Nexus Player from my TV stand. I'm also really liking the potential of Amazon Echo. I'm assuming they'll integrate the 2, so I can use an Echo in my living room to voice control the FireTV. Also, I'd like to cast Echo music to play through my TV surround sound.", "verified": true, "helpfulness": "1/1", "author": "brains-N-brawn"}, {"rating": 4.0, "review": "The fire tv is a very powerful device however it does not have the cable and network apps that almost every other streaming device on the market does. The customer service has been great though. I can say from experience with the roku, Apple TV, and chomecast that the fire TV has the best customer service. However it has the most limited app availability even though it's processor is very powerful. It's dissappointing that from my cable subscription I can only watch HBO and shotime. On fire TV The only option to watch new TV that I can access on demand through my network is to buy it at 2.99 an episode or unplug The fire TV and stream from my computer.", "verified": true, "helpfulness": "1/1", "author": "Eugene Moye"}, {"rating": 5.0, "review": "Works great.better than I expected.Easy to set up. Navagation is better than online for movie search", "verified": true, "helpfulness": "1/1", "author": "Dennis Dietrich"}, {"rating": 5.0, "review": "Great product at a wonderful price.", "verified": true, "helpfulness": "0/0", "author": "Ed P."}]