[{"rating": 5.0, "review": "Perfect for our family. Easy install and tons of choices. Great for prime members", "verified": true, "helpfulness": "0/0", "author": "Brant H."}, {"rating": 2.0, "review": "I am disappointed I cannot connect many  of the channels I wanted to my cable company Xfinity. Also the CBS channel, where I can watch full episodes, is not currently active on the Amazon fire network.", "verified": true, "helpfulness": "0/0", "author": "Odaly Victorio \"Local Tourist\""}, {"rating": 4.0, "review": "Would get five stars,  I don't like how you turn the system off.  Should be something on the remote.  Instead you have to go to Settings then to Systems then click on Sleep.  Also it has frozen once since i have set it up on Christmas. Disconnect the power input to reset.  Also for some reason the remote wouldn't work. Tried new batteries still didn't work. Then after a bit it just started working.  Like I said needs some improvements Its a lot better than going through my PS3 to watch Netflix and Hulu.", "verified": true, "helpfulness": "0/0", "author": "Steve R Holden"}, {"rating": 4.0, "review": "Easy installation.  I'm still getting used to having to switch between HDM1 and 2.  I watched a few series that I had not heard of before but they only have Season 1 Episode 1 - so that was disappointing.  Any clue when they will be available>  (Bosch & The Awakened).  But all in all, I think we're going to get a lot of enjoyment out of it.", "verified": true, "helpfulness": "0/0", "author": "Cherita37"}, {"rating": 2.0, "review": "It cost me to watch movies and music.  I have not been able to enjoy because I pay for cable already and this fire TV isn't any better.", "verified": true, "helpfulness": "0/2", "author": "Twanda R Taylor"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Christopher Hill"}, {"rating": 5.0, "review": "Really great system. Easy to navigate. App's are great as well.", "verified": true, "helpfulness": "0/0", "author": "peter marino"}, {"rating": 4.0, "review": "It would be a 5 if it had more free content. Butit is great.", "verified": true, "helpfulness": "0/0", "author": "Tim samczuk"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "trina"}, {"rating": 2.0, "review": "We were disappointed to find out that we had to pay for a lot of the programming we wanted to watch.  We expected more of the programming to be free.  We decided to take the Amazon Fire TV back and not go with any of these type of products.", "verified": true, "helpfulness": "0/1", "author": "Deb Shipman"}]