[{"rating": 2.0, "review": "Love using my amazon fire tv but it is missing a few things one it is missing ultra vilote digital copy locker to allow us to link our ultra vilote movies into amazon instant video and it is missing disney movies anywhere service and it is also and it is missing a vudu player application wich it needs badly you guys have to get a vudu player app for amazon so we are not just stuck with flixster and we have another way of vexing our ultra vilote and disney movies in one app on the fire tv box and stick I hope you guys will get these features soon and please hurry and update the fire tv box with the next software update", "verified": true, "helpfulness": "0/2", "author": "Jack"}, {"rating": 4.0, "review": "Very fast processor, very good video and can side load many apps including xbmc (Kodi) which works great. I'm disappointed that VUDU app is not available and that it doesn't HD audio or deinterlacing video . That being said I understand it was never intended to be a replacement for a media center extender, but it does it extremely well. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "theblur20"}, {"rating": 5.0, "review": "Finally a great reason to get rid of cable tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Janetnaz\""}, {"rating": 4.0, "review": "We have only had it for a month or so. The first time we used it, it was slow. I suspect it was downloading some initial information. Since then it's been super fast. Movies literally start as soon as you press the play button (we have a high speed wired connection). We got it in conjunction with Amazon Prime. It's a great combination. We watch the free movies included in the Prime account. With all the money we're saving by not paying for rentals, Fire TV will pay for itself in a few months. Recommended!", "verified": true, "helpfulness": "0/0", "author": "Roger J."}, {"rating": 3.0, "review": "I like but feel I was lied to. Why are there no wires in the marketing photos? I mean it works great but disappointed that it's not wireless", "verified": false, "helpfulness": "0/0", "author": "Anne Martello"}, {"rating": 5.0, "review": "This product is awesome.", "verified": true, "helpfulness": "0/0", "author": "Emmanuel Ramirez"}, {"rating": 4.0, "review": "Great if you have Amazon Prime. Wish they would get an NHL product.", "verified": true, "helpfulness": "0/0", "author": "James S. Tibbetts"}, {"rating": 5.0, "review": "Love the size", "verified": true, "helpfulness": "0/0", "author": "jonnie pearce"}, {"rating": 5.0, "review": "This is a great product that you can get tons of enjoyment out of. There are only 2 real downsides to this item. First it only plays 2.0 audio in my bedroom where I use the Fire TV it's perfect my family room with sound system not so much. The second is an off button. My main reason for getting the fire TV was to side load XBMC. The streaming quality is great (keeping in mind audio is only playing on 2 channels). That said after being left running the video becomes very choppy. The only solution I've found is unplugging the device to let it cool down. Sounding like big problems these are only very small areas where the device itself can improve. I haven't had the ability to use some of the apps such as showanytime because my service provider (Comcast) isn't listed yet. But this is not a flaw in the fire TV. I would definitely recommend this product to anyone and everyone who needs a media device in a bedroom or room with no sound system.", "verified": true, "helpfulness": "0/0", "author": "Michael Reese"}, {"rating": 5.0, "review": "Much, much more than I expected.  I love the feature where you give a movie or an actors name and it brings it right up.", "verified": true, "helpfulness": "0/0", "author": "toughskin"}]