[{"rating": 5.0, "review": "Purchased this to replace the way we previously accessed Amazon Video, Netflix, etc via our PS3.  While the PS3 worked ok, it was difficult to navigate, took time to find shows we were interested and long times to load.  With the Fire TV, single button brings up the Fire TV menu, press of the voice button and stating the show you want to watch gets you there super quick.  And if it's a show or series that Amazon thinks you're interested in, the show is already buffered and ready to go.  It's almost as convenient as changing the channel on your TV. Great addition to our media setup.  Super value for what you get.  Our whole family loves it.", "verified": true, "helpfulness": "0/1", "author": "Chad \"chadg\""}, {"rating": 5.0, "review": "Simple to install, small and compact.  Love the voice search!!  However I did get addicted to Downton Abbey before I realized I had to buy the whole season. It does not ask you to confirm purchase so you may not realize something is costing you so be careful about that.", "verified": true, "helpfulness": "0/1", "author": "Stacy Picou"}, {"rating": 3.0, "review": "for what it does it does great. but still needs work. lot of shows are free on roku that I have to pay for on fire. also needs vudu so i can watch shows that i own. at this time i would not buy another.", "verified": true, "helpfulness": "1/1", "author": "kennon patterson"}, {"rating": 3.0, "review": "I was excited to setup the Amazon Fire TV service when it arrived last week.  As with any new technology there is potential for issues and this device certainly had some.Positives1.  Clean user interface.2.  Decent for gaming3.  Easy to unbox and setupNegatives1.  Very slow to load.  This occurred not only with initial setup, but also with a software update.  I'd expect this device to power up with similar load time to a Roku or Apple TV2.  No clear definition of what is free vs. paid.  This has been an issue with Amazon Prime for a while and continues to be an issue with Amazon Fire TV.OverallWith what I know now, I would wait to purchase the Amazon Fire TV until they have more time to add applications.  HBO GO is a must have going forward.  At the price point I was expecting more than my Roku, but from the start I wasn't wowed.  Keep working on features and functionality Amazon.", "verified": true, "helpfulness": "2/2", "author": "RYAN P"}, {"rating": 5.0, "review": "I had to buy the Amazon Fire TV to try out, and I can tell you that my 8 year old loves it for the Movie options along with the the games, as she is having friends come over and they all link the Mine Craft game together between all the different systems they have.I have also reduced my cable bill down by $50.00 a month, as between Amazon Prime and Netflix the only need is the local channels through the cable company.Again my family loves it and looking at purchasing a second one for another TV", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 2.0, "review": "Yes a lot of boxes have Hulu and Netflix, etc. But this thing is, crazy fast. I can fast forward and back through streaming video with no delays. I always thought it was my network when Netflix and others buffered all the time on my TiVo, but never seems to happen on this.  And having all my Prime Instant content on TV rocks.  And the voice search is SUPER neat. Makes Apple TV look downright clunky and old fashioned. Don't have the game controller yet, so haven't tried the games, but so far very impressed.AMENDED:  While the video is great, I'm amending my review down to 2 stars.  I'm HORRIFIED to find out this device can't play Amazon's own MP3s!  Do NOT buy this YET!  This is an alpha/beta release.  I can play my Amazon cloud product on my partners freaking iPad and iPhone...but not on Amazon's own hardware!  I have the Amazon cloud player on EVERYTHING (iPad, Galaxy S5, Samsung TV)...everything...EXCEPT Amazon's own hardware. Inexcusable", "verified": true, "helpfulness": "2/3", "author": "David Schneider"}, {"rating": 5.0, "review": "So far, so good.  If you have Amazon Prime, this is a good deal.  I’m still learning my way around on it.  It takes Audio commands, folks!", "verified": true, "helpfulness": "0/0", "author": "JEANNIE GOLDWIRE"}, {"rating": 5.0, "review": "As a single lady and not too tech savy, I was able to instantly install and watch all the great movies and TV programs I had been missing.  Amazon Fire is awesome.", "verified": true, "helpfulness": "0/0", "author": "Gma GiGi"}, {"rating": 2.0, "review": "Pros: small, quick response with the remote and decent graphicsCons: upon searching, this unit directs you to content you must pay for (example below), less intuitive then other such devices to operate (unless you simply want Amazon content), MAC addresses should be printed on the outside label for those who use such things for setup.I've owned and operated many of the other streaming appliances, this one was purchaed expressly to know more about the voice commands, I have an aging family member that would benefit from this.  The voice command is pretty cool, I notice that most everything I searched for needed to be paid if I wanted it.  That seems a bit odd as I have Prime, Netflix and Hulu plus so I played further.  I loaded Netflix and found House of Cards.  While at the point where I could simply press select and a show would begin streaming, I decided to ask the Fire TV for Kevin Spacey.  It quickly came back with several movies and House of Cards...if I selected House of Cards now I would be charged 2.99 to view content I already have the rights to.  I did the same with a movie on Netflix and had the same result.I then engaged the parental controls, simple enough that would prevent my loved one from paying for content that is already paid for; the issue now is most everything needs a password to use.  It also didn't say if it was paid content or the price, once you type in your password away it goes and the charge happily goes on your Amazon BillThis product needs lots of work, it also needs a gut check from the suits at Amazon.  I'm going to keep the unit to monitor the progress of a very negative shift in program delivery.", "verified": true, "helpfulness": "12/14", "author": "Bud O."}, {"rating": 5.0, "review": "I have used the Apple TV and Chromecast and I prefer this device. It was a spontaneous purchase and did not expect much but I am amazed with quality of the product and the simplicity of use. Definitely worth the price.", "verified": true, "helpfulness": "0/0", "author": "Mike M \"Mike M\""}]