[{"rating": 5.0, "review": "Perfect for me.  Viewing is so very good.  No Staggering or Reloading of movies.  Very easy to install.", "verified": true, "helpfulness": "0/0", "author": "TX&#62; Gramma"}, {"rating": 5.0, "review": "Very pleased with Amazon Fire TV - taking advantage of all the Prime movies and TV shows.  Delighted with the fact that i can get subtitles (captions) so easily and can customize their appearance.", "verified": true, "helpfulness": "0/0", "author": "Crafter \"Crafter\""}, {"rating": 3.0, "review": "Too much buffering", "verified": true, "helpfulness": "1/2", "author": "Kutty"}, {"rating": 5.0, "review": "This tiny little box is easily the cleanest implementation of set-top-box experiences I've tried, and it's crazy fast. It's easy to hop around between apps and services, and the start for Amazon-based services is nearly instant every time. It's as if the media is local. The verbal search is surprisingly good and accurate, and makes navigating thousands of songs a lot easier. I thought it was a little weird that it shipped with my Amazon account enabled but not the update that works with Amazon Music, but that was a minor, one-time inconvenience. I really enjoy the Vimeo app because we upload a lot of home movies there.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Putz"}, {"rating": 2.0, "review": "although prime is free  to members the cost of obtaining non prime products is so high as  to prohibitive  in most cases. the prime product seems to be only for TV series and not motion pictures. I could not get closed captioning and the instructions given  in help do not work", "verified": true, "helpfulness": "0/4", "author": "murray spotnitz"}, {"rating": 5.0, "review": "this is the best! I have been a long time roku user but I love the amazon interface a lot more and the ability to speak to the remote and tell it what to search is awesome.", "verified": true, "helpfulness": "0/0", "author": "Steffie583"}, {"rating": 2.0, "review": "At first, I loved the fire tv, was very nice in providing easy access to all of our Amazon content.  Then, our internet started going out.  It would go down, and wouldn't come back up for over an hour.  It was a painful mystery:  the telephone technician said it was because of a function on the network card located in their cross-box, he said there is a denial of service detection function in there that will shut off the circuit if it detects a DOS attack (whether it is coming from the residence or to the residence).  This had us shaking our heads, as we preformed all kinds of virus scans on our computers, and never found anything.  Finally, one day when this was occurring, I was able to see in our router log a TON of stuff coming from/to amazon.aws.  I traced it to the amazon fires we had hooked up (we have two of these beasts).  I immediately unplugged both of these devices, and we have never seen this happen again.  That's when I saw other people posting about the fire tv using up tons of bandwidth when you are not even using the devices.  So, several months of having internet that would go out at random times caused by this device (doubled due to having TWO of these hooked up) is NOT worth the value it provides.  I'd say this is not ready for prime time, and people should be very hesitant using this device until Amazon fixes these issues.  Just to clarify:  Fire TV does NOT do DOS attacks that I know of.  I think in my situation it was just generating so much network traffic that it triggered the telephone company's protection circuit to shut down the connection.  Also, I cannot be absolutely certain that this was the cause, as I don't have hard evidence, however I can say the problem stopped occurring once I disconnected the fire tv devices, so I will leave it to you to make your own judgements. I also want to add I am aware of the bug with the mosaic screensaver mode.  I turned off the screensaver completely as soon as I connected the fire tv, and have never had it running.", "verified": true, "helpfulness": "3/6", "author": "Danno \"FreeFall\""}, {"rating": 2.0, "review": "I really wanted to like this device, but it fell short of my needs. I live in the country and have slow internet speeds. Trying to watch a streaming show on this device was painful! It buffered more than it played! Long story short, this device got returned in favor of a Roku LT. Now I can stream shows with very little buffering.", "verified": true, "helpfulness": "2/4", "author": "Darryl Cook \"crim\""}, {"rating": 3.0, "review": "Both Amazon Fire TV and Roku do not address the problem I had for the set up. My set up problem was my router. Headache. Blood pressure. Needless arguments with the wife. Had my son in law come down, who is a wiz, and he had somewhat of a pain with it. Just add the feature.", "verified": true, "helpfulness": "0/2", "author": "John Stroud`"}, {"rating": 3.0, "review": "I'm new to all this, so let me get this kind if straight. to use this box, I need a cable set up a subcription to amazon prime and the box.  What can you watch for free if you have to pay for all that?  cable in itself is expensive as it is then  more cost for prime?  Tell me straight,  what do I need to operate this box?  What is the cost to me the user?Serge", "verified": false, "helpfulness": "0/4", "author": "S. A. MUNOZ \"TEXAS \"F\"STOP\""}]