[{"rating": 2.0, "review": "Not enough free content.  Hardly use it. The device itself is easy to use though.  Often when I select a program to watch, I find there is a charge involved, so I skip it.", "verified": true, "helpfulness": "0/2", "author": "Warren Routerbusch \"Average Joe\""}, {"rating": 2.0, "review": "Its a roku even more commercialized and a even worse interface...", "verified": true, "helpfulness": "2/2", "author": "Danial E Bennett"}, {"rating": 5.0, "review": "I am a cinephile and I am quite sure this is the best thing I have ever purchased. It connects to IMDB so you can see the movie rates and watch the trailer immediately. Instant video provides many movies and the price is reasonable. Another thing I like is the game section on fire TV. Games they provides are usually fun to play and you have varieties of choices.The only complain I have is the subtitle of movies.Sometimes it is not parallel with the movie. Rarely happens so far but when it happens it is really annoying. if you don't need subtitles this is not a problem at all.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 2.0, "review": "Doesn't wo outside the usa", "verified": true, "helpfulness": "0/7", "author": "capt f d layton"}, {"rating": 5.0, "review": "also product better them apple", "verified": true, "helpfulness": "0/2", "author": "Eduardo"}, {"rating": 5.0, "review": "Great with Prime.  Streams over WiFi with very few delays.", "verified": true, "helpfulness": "0/1", "author": "Timothy C Summers Jr"}, {"rating": 4.0, "review": "love  that all I can say  work just as amazon said  it would!!!!!!!!!!", "verified": true, "helpfulness": "0/1", "author": "william kitchen"}, {"rating": 1.0, "review": "Do not waste your money on this!!!  The box is constantly shutting off in the middle of shows.  When it's workings, it's awesome but it is not consistent.  I'm very disappointed in this product. I'm going to try Roku.  Hopefully that works better.", "verified": true, "helpfulness": "3/12", "author": "Heather"}, {"rating": 3.0, "review": "Anyone else having issues with Netflix? It takes multiple attempts before a movie actually comes on. It does not happen with the same netflix accounts on different devices.", "verified": true, "helpfulness": "2/3", "author": "TNash"}, {"rating": 4.0, "review": "The produc works great.  Very fast response time, little or no lag.  The supply of apps needs to be expanded with a browser, the ability to setup individual profiles in Amazon Prime, etc.  But the box is a very impressive streaming device beyond that of my Apple TVs.", "verified": true, "helpfulness": "0/0", "author": "Shane Premeaux"}]