[{"rating": 5.0, "review": "Awesome!  With this and Netflix I may just get rid of the cable TV.", "verified": true, "helpfulness": "0/0", "author": "Melissa R. Burch"}, {"rating": 5.0, "review": "I am in awe.  Picture quality is very good, and I am still exploring the range of content. I should have ordered the whole package at one time.Actually, I'm ordering another one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have been using this since a few months. I use it for watching Youtube videos and Amazon Prime videos. The product is very good, never experienced any lag.I have been told that the number of channels are very less, compared to Roku3 but like I said, I only use it for Youtube/Prime Videos and those work pretty well.", "verified": true, "helpfulness": "0/0", "author": "Hashim Kappil"}, {"rating": 5.0, "review": "Awesome product! Works very well very easy to navigate!", "verified": true, "helpfulness": "0/0", "author": "Julie Bandt"}, {"rating": 5.0, "review": "Voice search is great, but wish the product could perform a search across all available services - not just Amazon.", "verified": true, "helpfulness": "0/0", "author": "Ron Meyers"}, {"rating": 5.0, "review": "I love being able to watch movies, tv shows and other things whenever I want and its so small I can move it to different tvs.", "verified": true, "helpfulness": "0/0", "author": "jafke boyd"}, {"rating": 5.0, "review": "I got the Amazon Fire TV last month and I must say I love it! I'm still playing around with the features and I'm even considering to buy the game controller too so I can utilize all the sweet games they have available for prime members. The voice search is a nice touch and the set up was quick and easy. Really, all you do is plug it into your TV and wall, follow the on screen prompts and then boom you are done. I am not really tech savy so the easy set was very nice. All in all I am happy with my purchase :)", "verified": true, "helpfulness": "0/0", "author": "LeslieP"}, {"rating": 5.0, "review": "I already had an Apple TV unit. It worked OK but I was having a really tough time watching Amazon Prime Video through my iPhone to the Apple device. My beautiful wife purchased the Fire for Christmas. It hooked up and connected to all my services without flaw. The first thing I noticed, after the initial new interface adjustments, was the HD clarity. I no longer had trouble with Amazon Prime Video (duh) and other than a few quirks I found it quite nice.I am an Apple homer but I am also equally invested in Amazon. I figure I have the best of both worlds. I'm sure you'll enjoy the Fire as well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I haven't had the opportunity to use the full force of amazon fire and in short time already had one full day where it was out - couldn't view a single movie or play any games. So the jury is still out. The movie/tv part is alot like net flics but with a different variety so far.....at least I'm not down to view B movies and sub-title foreign films. I was a little disappointed at the number of movies/tv shows/games you still have to pay for.....hope the ratio will improve in the future. Shipping, etc....the jury is still out...will see as time goes by. I've given it 4 stars because hopefully it will allow me to watch Game of Thrones once the new season starts. Expect another review to come.", "verified": true, "helpfulness": "0/0", "author": "L. wigmore \"wizardsky\""}, {"rating": 5.0, "review": "I really like it better yet I love it.", "verified": true, "helpfulness": "0/0", "author": "Robert Ford"}]