[{"rating": 4.0, "review": "Love the new Amazon Fire TV and bought the game controller at the same time.  The game controller seems a bit heavy for me to use for long.  But it works amazingly.  Would I recommend it?  If you are a game player, you will want one.", "verified": true, "helpfulness": "0/0", "author": "Judith Gorham"}, {"rating": 4.0, "review": "Great access to wide variety of movies especially as a prime member. Wish you could see network tv shows and sports.", "verified": true, "helpfulness": "0/0", "author": "cc"}, {"rating": 5.0, "review": "I was tinkering with the idea of Red Box or Netflix as I couldn't stand the idea of a Comcast box, then I read an article about Apple TV and I was hooked.  It is so simple to install, I get movies galore and I already had a Prime membership.  The price of renting a movie Prime or Netflix is probably near the same if not better.  I rented a movie from Red Box and couldn't view it because it was defective so even though the movie cost me $1.59 in the long run it was a waste of money.  I would recommend Apple TV to anyone.  Easy installation, no lines, and movies are reasonably priced.  It's easier than popping popcorn!", "verified": true, "helpfulness": "1/1", "author": "Donna Appelquist"}, {"rating": 2.0, "review": "I was very excited to get the Amazon TV. Already have a Apple TV and a Roku. I was looking to potentially ditch the Roku and replace it with the Amazon TV. However, when i got the TV and tried it, it didn't work. I had numerous interactions with Amazon customer service and it was a horrible experience. First time I was disappointed with Amazon. The Apple TV worked out of the box, Roku worked out of the box but Amazon TV won't. If you have a older HDTV, beware of this...Call up custmer service and ask them if your TV is compatible.", "verified": true, "helpfulness": "5/5", "author": "Ujnip"}, {"rating": 5.0, "review": "I love my Amazon Fire TV I watch all my favorite shows and movies because most of them are Prime anyway. The games are fun and exciting to play also. I also got the game controller to play all the games with. I love being able to search for movies by title with voice commands and being able to search for movies with specific actors. I have found movies with actors in them I did not previously know of and plan on watching. The fast start up of the videos I chose is awesome. I just click it and it starts right away. No stuttering or waiting for videos to load or pausing of the video during play. sharp clear picture and great graphics rendering for games. the only thing it is lacking is a keyboard and mouse usb connection and ability to surf the web. I forsee a wireless keyboard and mouse funtion and internet app in the future to make it the perfect device for entertainment. It does have one slot for a usb keyboard which is handy but a wireless keyboard and mouse interface would be ideal.", "verified": true, "helpfulness": "0/0", "author": "T.A. Williams"}, {"rating": 5.0, "review": "It's the best xbmc player for the money. You can also install any android app through your PC. Well worth the money.", "verified": true, "helpfulness": "2/2", "author": "Hakan"}, {"rating": 5.0, "review": "I love that it is quad core. It is super fast. I am solo impressed. :) Thinking about buying another one to put in my bedroom. I have an Apple TV and I have almost all Apple in my house and I could tell a big difference between the Amazon Fire and Apple TV. They are both easy to install and easy to use, the difference is in the speed and performance.", "verified": true, "helpfulness": "0/0", "author": "AV Randolph"}, {"rating": 5.0, "review": "Fantastic picture quality on HD. Less buffering/pausing on certain Hulu programs than my Roku 3. The voice search makes finding shows/actors a snap. Remote control is easier to grip & feels more comfortable than the Roku 3 remote control.", "verified": true, "helpfulness": "0/0", "author": "Serafin Y. Anderson"}, {"rating": 3.0, "review": "I had to go online and open an Amazon account just to get any of the the channels you offer and some have charges that I did not know about. Also with Hulu Plus ,there are certain stations that Amazon does not have the rights to show through there system, and that was very disappointing to find out. Plus I can't get Showtime because I don't have the right Enternet provider, Charter is not on your list. One more thing ,when I go to Amazon Fire TV for shows there are charges for everything which is going to make me have to pay for Amazon Prime.", "verified": true, "helpfulness": "1/1", "author": "Stefano Palazzo"}, {"rating": 5.0, "review": "My 12 year old nephew installed and programmed the Fire TV unit. It is easy to operate and fun for the entire family. Being able to use things like YouTube from the TV is awesome. I also love being able to stream movies from Amazon and Netflix. It was well worth the cost.", "verified": true, "helpfulness": "1/1", "author": "Connie Greenwell"}]