[{"rating": 5.0, "review": "Wonderful product.  Excelled all expectations.  Immediate communication and rapid delivery.  AAA+++", "verified": true, "helpfulness": "0/0", "author": "oscar"}, {"rating": 5.0, "review": "This works great and as described. I wish would had seen the ad for the thumb drive before purchasing this. But all in all it works good and made my regular flat screen turn into a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Martin Vazquez"}, {"rating": 5.0, "review": "This item 5 very good  the best thank you", "verified": true, "helpfulness": "0/0", "author": "luis zuniga"}, {"rating": 4.0, "review": "So far, the Fire has been a pleasure to use and painless to set up. Can't wait to find out all it can do!", "verified": true, "helpfulness": "0/0", "author": "JANIE L. HASAN"}, {"rating": 4.0, "review": "I am really satisfied with this product. I have used another streaming device before but since I am an avid Amazon customer and prime member this was a no brainer. I love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great pictures. Login on easy.", "verified": true, "helpfulness": "0/0", "author": "bill gilmore"}, {"rating": 5.0, "review": "Great product.  Needs more contoller accessable games though and storage capacity to install more games and apps.", "verified": true, "helpfulness": "0/0", "author": "gamer231232"}, {"rating": 5.0, "review": "It gives you a lot of options! And Amazon is great to deal with!", "verified": true, "helpfulness": "0/0", "author": "James M. King Jr."}, {"rating": 4.0, "review": "I wish I could access the internet like I did with chrome-cast.", "verified": true, "helpfulness": "0/0", "author": "Thomas Hartman"}, {"rating": 5.0, "review": "I must admit, the streaming quality exceeded my expectations (HD with Dolby Digital sound) and the interface is quite snappy. The voice search actually works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Kevin Talbot"}]