[{"rating": 5.0, "review": "Great addition to my TV viewing.", "verified": true, "helpfulness": "0/0", "author": "Joe Etten"}, {"rating": 5.0, "review": "I love this so far.  Everything as promised.  Only glitch was connectivity at start as the light was blinking yellow.  Everything was plugged in correctly - the solution was place the box on * top * of cabinet or stand and not in tv cabinet or on shelf underneath.  The troubleshooting instructions needs to address this and they do not.  Also you need to buy the hd cable as it does not come in the box.  Once connectivity issue was solved I was up and watching in a snap.  The box is small sleek and compact. The voice search works very well - I love it!!  Was easy to find prime membership free content with the menu. The remote is simple and very functional.  I have not tried games yet as i did not buy the remote.  The quality is great.  I hope they add hbo now as soon as its available.  Bottom line - this thing is great.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "Works flawlessly. Way faster than Amazon Fire Stick, Roku, and Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Kirsten"}, {"rating": 5.0, "review": "My mother loves it the voice recognition is OK and it is easy for her to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "UI is nice, navigation is fast. Apps load fast.The lack of voice search working across apps is a big drawback. Making this feature useless to me.", "verified": true, "helpfulness": "0/1", "author": "NM"}, {"rating": 5.0, "review": "Getting another one", "verified": true, "helpfulness": "0/0", "author": "solegee1"}, {"rating": 4.0, "review": "Great device, has great apps available and great processing speed. The voice remote is spot on, nails my request every time. Only wish it had a browsr capability. Looking forward to updates.", "verified": true, "helpfulness": "0/0", "author": "Dale"}, {"rating": 5.0, "review": "great device. I used to blame my slow internet service for my apple tv problems, but this items has shown me that my internet was not the problem. so much faster. instant streaming! love it.", "verified": true, "helpfulness": "0/0", "author": "JoAnn Cooper"}, {"rating": 5.0, "review": "I pulled this out of the box, set up, and started going through movies in less than 15 minutes.  This was the easiest set up of anything electronic that I've ever gotten.  Wish I'd done this a long time ago.", "verified": true, "helpfulness": "0/0", "author": "Shawnette Self"}, {"rating": 5.0, "review": "I really like the Fire TV. It was very easy to set up, my toddler liked the games and the picture quality and east of use are great. I did purchase the HDMI cable and the game remote at the same time so that was a plus. I highly recommend this to anyone looking for a great way to access prime movies or Netflix.", "verified": true, "helpfulness": "0/0", "author": "E. Byrne \"No one can make you feel inferior without your consent.- E. Roosevelt\""}]