[{"rating": 5.0, "review": "Works like a champ! Excellent with voice or remote. Great product.", "verified": true, "helpfulness": "1/1", "author": "Mike J."}, {"rating": 2.0, "review": "So far I still haven't been able to set up my Fire TV. It's not as simple as \"plug and play\" if you have an older computer with \"hardwired\" internet. And I found that you need to be a bit of a techie to differentiate an Ethernet hub from a splitter from a router, etc., etc. And Fire TV doesn't seem to have any telephone customer service which would be a BIG HELP to us non-techies! I'm looking forward to EVENTUALLY getting this thing set up(if I don't take a sledge hammer to it first). I'm trying an ethernet cable from another company,....and of course with Prime by the name in case it too, needs to be returned. If there are any techies out there who have helpful suggestions re: what the heck I need to get this up and running, I'd appreciate it!!", "verified": true, "helpfulness": "0/1", "author": "CLB in Syracuse"}, {"rating": 5.0, "review": "Love it! This is so easy to use! What a pleasure.", "verified": true, "helpfulness": "0/1", "author": "Barbara"}, {"rating": 5.0, "review": "easy to install and operate, even for non-techy folks", "verified": true, "helpfulness": "0/1", "author": "huskymom"}, {"rating": 3.0, "review": "I'm sure it's great for what it does, it just doesn't do what I was hoping to do and the descriptions during the buying process really don't explain. I was hoping to be able to get live network channels. It's not designed to do that, so that's no fault of it's. However in what it does do, the quality is great, pretty easy to understand etc. If you're looking to watch movies like Netflix etc. then this is great. Just not what I was looking for.", "verified": true, "helpfulness": "1/2", "author": "Robert L Hartline"}, {"rating": 4.0, "review": "Still learning available possibilities but great so far.", "verified": true, "helpfulness": "0/1", "author": "Donald L. Parris"}, {"rating": 5.0, "review": "it's great", "verified": true, "helpfulness": "0/1", "author": "Jrreed"}, {"rating": 5.0, "review": "Love it. Especially after I unlocked it", "verified": true, "helpfulness": "1/2", "author": "Crystal Renee"}, {"rating": 5.0, "review": "One of the BEST investment I have made this New Year. I chose to stay home and watch it than gone to the movies even though I had FREE tickets. I love it when friends and family visit and I can entertain them with Pandora, YouTube, etc.", "verified": true, "helpfulness": "1/1", "author": "Edward"}, {"rating": 5.0, "review": "Love it. We got rid of satellite service and have all we need and more right here. If you have an Amazon Prime account this is the entertainment option for you. Excellent video and sound quality. Super easy set up. Purchased from Amazon most of that is already done for you also.", "verified": true, "helpfulness": "1/1", "author": "Jeff and Melissa"}]