[{"rating": 5.0, "review": "I am very satisfied with this productIt is easy to set up and program.", "verified": true, "helpfulness": "0/0", "author": "Joseph Thielien"}, {"rating": 4.0, "review": "Overall I like the product. A little disappointed that you can't stream from an iPhone to the fire tv as easily as to Appletv.  Also the lack of some of the apps for some of the big networks was surprising.", "verified": true, "helpfulness": "0/0", "author": "Andrew W Glacken"}, {"rating": 3.0, "review": "The item is ok it seem to work some what ok i had problems signing into my wifi which i had  to wonder if its because it was used item/ refurbish. Umm this product to me need some more work i don't like the interface either amazon needs to work on this item i give it a 3 star.", "verified": true, "helpfulness": "0/0", "author": "Phill Sharpe \"T.O.P.S\""}, {"rating": 5.0, "review": "love it just what I expected and wanted", "verified": true, "helpfulness": "0/0", "author": "Ted Barrry"}, {"rating": 2.0, "review": "i just shut down Netflix, i am not sure if i took the right decision. Every movie so far does not fit my SAMSUNG TV, either is not a HD or even being a member of the prime club it try to charge me for new movies.", "verified": true, "helpfulness": "0/1", "author": "Interbiz"}, {"rating": 5.0, "review": "This is soooooo easy to use.  Love the way you just talk into the remote and up pops your choices.  I haven't checked into the phone app yet but I am so glad we purchased this.", "verified": true, "helpfulness": "0/0", "author": "Survivor2008"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "Not enough free current movies", "verified": true, "helpfulness": "0/0", "author": "Connie R. Clinton"}, {"rating": 1.0, "review": "After reading so many great reviews, I ordered this to use my Amazon prime, Hulu, and Netflix account. I was so excited about the easy setup but I have not been able to get Hulu or Netflix to ever actually play something! This is very frustrating as it was the main reason I got it. My smart tv plays them just fine, but the Amazon prime app on it is weak. Thought this was the solution. I am willing to try another one due to the great reviews, and I hope I just got s lemon. Otherwise it's definitely not work the money for me if it's only good to use their own service.", "verified": true, "helpfulness": "1/2", "author": "Valerie A. Mcauliffe \"Valerie\""}, {"rating": 5.0, "review": "Excellent interface. Elegant design. Seems to be significant improvement over DVD blu ray player for streaming video.", "verified": true, "helpfulness": "0/0", "author": "Frank J. Wassermann"}]