[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Meghan Meyers"}, {"rating": 1.0, "review": "Fire tv is nice but I had trouble running Netflix and voice search on the remote only searches through amazon prime", "verified": true, "helpfulness": "1/3", "author": "jc"}, {"rating": 5.0, "review": "I am still learning how to get around and view in it.", "verified": true, "helpfulness": "0/0", "author": "Amy J. Castillo \"Doxie Lover\""}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Anibal Ybarra"}, {"rating": 5.0, "review": "Like how easy it is to use.", "verified": true, "helpfulness": "0/0", "author": "William Peterson \"Billpete\""}, {"rating": 4.0, "review": "Love  it", "verified": true, "helpfulness": "0/0", "author": "Andre P Nasser MD"}, {"rating": 5.0, "review": "Nice to have more options for viewing programs when you just have antenna TV.  Bought it with a 3-month subscription that made it a better deal.", "verified": true, "helpfulness": "0/0", "author": "Mrs Ripley \"Mrs. Ripley\""}, {"rating": 4.0, "review": "It sometimes wont play netflix but every other device in my house plays netflix just fine. Otherwise not too shabby for something i got for free as a prize on the stacker game.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "I love this! Some of the best money I have spent has been on my two daughter's Kindles, my Amazon Prime account...and now the Amazon Fire TV. I enjoy how they all interact. Our satellite tv went out last weekend, but we were still able to enjoy some family tv time (with family shows) because of this product. I'm very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It is a nice piece of hardware to stream video that can also do video games. I own an Apple TV and an XBOX. As I am not a big gamer, I did not appreciate the added value from the Amazon Fire. If you don't care about the Apple ecosystem and you don't have any other streaming device the Amazon fire is a very decent piece of hardware.", "verified": true, "helpfulness": "0/0", "author": "smikel"}]