[{"rating": 5.0, "review": "Easy to set up and it works great!!!Love the Netflix part. Just wish the movies on prime were free like Netflix.Prime charges for the good movies", "verified": true, "helpfulness": "0/1", "author": "Allen G Sainsbury"}, {"rating": 5.0, "review": "Love it! Love it! Love it! I've a TV in a room that is now the 'exercise room' I wanted to be able to watch movies, etc. without moving the Wii over to the TV. Well, this was the answer. It was very easy to put together and I'm using it wireless with my TV. The hardest part was connecting the Amazon Fire TV to my HDMI TV connection. TV is on the wall and I'm vertically challenged so had to call in the spouse for backup.  I actually yelled 'Gary Busey!' when I connected all together! Hee! Hee!", "verified": true, "helpfulness": "1/1", "author": "chela1260"}, {"rating": 5.0, "review": "Before i bought this product i thought for sure the reason my movies kept freezing was that the Amazon servers were overloaded. Turns out that i was wrong! I use two Sony blue ray players to stream video.It turns out those blue ray players didn't have enough processing power and ram and that's the reason the movies kept buffering (freezing). The Amazon fire TV is lighting fast and does not have an issue with buffering (freezing)! This is a great product! I guess its time to buy two more for the other rooms. The only thing that would make this better is a small software issue when you use the voice search to search for a movie i wish it would bring up what is in your video library first. for example if i know that Iron man is in your Library and you search for it the movie that is in your library should be one be on of the results.Great product Amazon!!", "verified": true, "helpfulness": "1/1", "author": "Anthony Blackmer"}, {"rating": 3.0, "review": "I really wish it supported dlna... If it did, I'd give it 4 stars.I also wish the voice search worked with Netflix.", "verified": true, "helpfulness": "1/7", "author": "Carlos Capiro"}, {"rating": 5.0, "review": "I truly like this product.  Good Job Amazon!!So far it has done everything i have been wanting.  Next item is the controller, need for minecraft, sad.", "verified": true, "helpfulness": "0/0", "author": "M. Masters"}, {"rating": 3.0, "review": "It's pretty obvious that this thing is geared toward people who have high speed cable internet.  I live in a rural area that does knot have kable available.  I have a lot of movies and music on hard drives, but I do knot see anywhere in the description if one could play these via the USB port on this device, or for what else the USB port might be useful.  Sure wish they woul have put that in the description.", "verified": false, "helpfulness": "0/0", "author": "Songdog"}, {"rating": 5.0, "review": "I really love it. It really expands the streaming horizon,the selections seem endless and the vocal search is so Avant-garde. I love it.", "verified": true, "helpfulness": "0/0", "author": "Franklin A. Moses"}, {"rating": 3.0, "review": "This is awesome spec wise but I really felt they should have included the HDMI pass through. Amazon could have used that to match what your watching to video recommendations and the avg person could have used it so they wouldnt have to swap sources on the tv all the time. Since the logitech box is not made anymore I was really hoping they would have done that,", "verified": false, "helpfulness": "0/5", "author": "David"}, {"rating": 3.0, "review": "Agree with the reviews of it being a nice box, but no HBO Go is a deal killer for me.", "verified": false, "helpfulness": "0/5", "author": "AZ Goat"}, {"rating": 5.0, "review": "This product performed as described in the product data sheets. The packaging was outstanding--better than any I have seen in a long time. The form and function of the products (box & controller) was well designed and performed as advertised. Very powerful compared to my two plus year old Sony box/Blue Ray player.", "verified": true, "helpfulness": "0/0", "author": "Jerry Nunley"}]