[{"rating": 4.0, "review": "Hopelessly addicted.  Normally I would say that I am not a television person, but since I purchased the Amazon Fire my eyes have been hopelessly glued to the television.  I love the variety.  My only complaint is that some of the good movies that have played on local television there is a charge to watch them, even with Prime membership. I admit that it is a convenience to be able to watch movies any time you want, but after they have shown on local television I would think they would be free for Prime members. There are just a many that you have to pay for as there are free.", "verified": true, "helpfulness": "0/0", "author": "Julie Perry"}, {"rating": 5.0, "review": "Five star device. Other reviewers have hit all the key features for streaming TV and movies. It also makes Amazon music almost usable. If you have a huge library and buy lots of music from Amazon you know how cumbersome the interface is (show new music by album not song please!) on the Roku or the computer. This is a half step up from that.", "verified": true, "helpfulness": "0/0", "author": "worldgonewrong \"worldgonewrong\""}, {"rating": 5.0, "review": "The Prime member content may be a greater value than Prime's free two day shipping.", "verified": true, "helpfulness": "0/0", "author": "MikeZ \"zandermw\""}, {"rating": 5.0, "review": "Great buy!  Can't live without it.", "verified": true, "helpfulness": "0/0", "author": "Andi"}, {"rating": 5.0, "review": "the ireviewgear team love this thing. much much faster than a smart tv, smart dvd, or chrome device. great menu, fast", "verified": true, "helpfulness": "0/0", "author": "ireviewgear"}, {"rating": 4.0, "review": "Good device. Better sound and visual quality than Roku 3. My only complaint is the Prime Stations app is not available.", "verified": true, "helpfulness": "0/0", "author": "Mark Bertrand"}, {"rating": 5.0, "review": "Bought this as a gift for my girlfriend.  She was able to reduce her Cable TV down to just internet and saved $100 per month.  She hasn't lost any of the shows she likes to watch.", "verified": true, "helpfulness": "1/1", "author": "Jason Crismore"}, {"rating": 5.0, "review": "I have a Roku, an AppleTV and a Chromecast. I'm a near-cord-cutter (just have local channels and HBO) and the lack of HBO GO at first was what held me back from getting this on a TV that had no streaming option. Finally did and I regret not getting it sooner. The interface is very quick and responsive and I use the voice search all the time (I thought it was going to be a gimmick). Would be great if voice search worked on more stuff (mostly just Netflix) but it works on far more than just Amazon content (for instance, it works with Hulu and HBO GO content). Put this on the main TV and downgraded the Roku to the basement set.", "verified": true, "helpfulness": "1/1", "author": "J. Evans"}, {"rating": 5.0, "review": "I love it. Haven't had a single problem, I like it better than my Apple TV", "verified": true, "helpfulness": "0/0", "author": "James M Horst"}, {"rating": 5.0, "review": "What an ingenious way to get to see the movies you have always wanted to see.  With just the sound of your voice it pops right up on the tv screen.  I am on Prime so most of these movies are free to see.  Wow, just love the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Nan"}]