[{"rating": 1.0, "review": "Same problem that hundreds of other people had - would not complete the required update. (Update! Really? On a brand new product?)  Tried dozens of times with both wireless and wired connections.  No joy.  The fact that some people had success is troubling.  Is there no quality control.  Am ordering ROKU3.", "verified": true, "helpfulness": "6/19", "author": "Dee \"Dee likes...\""}, {"rating": 5.0, "review": "Love being able to watch TV shows and movies and playing games.  Waiting for the controller to come but have now ordered a second box for a game room.", "verified": true, "helpfulness": "1/1", "author": "dantz"}, {"rating": 5.0, "review": "I love it.Amazon is in right in the money.It is better than the Apple Tv and Roku Tv,simply the best.", "verified": true, "helpfulness": "1/1", "author": "STAN"}, {"rating": 4.0, "review": "Well I now own the latest version of Apple TV, the ROKU 3 and Amazon Fire TV!This is a tough comparison, CNET gives a comprehensive comparsion of features that you can compare them by side with Chromecast as well.To summarize ROKU has the most video apps available and Amazon Prime is a close second,  Apple does not have Prime and about the same number of video apps as Amazon Fire. The other thing ROKU has is if you are a Time Warner Cable subscriber you can watch your basic channels through the device, why I can't tell you because if you have TWC you have a box and don't need ROKU to do it for you.The advantage of ROKU ends here, the Amazon storage capability is greater than ROKU and Apple, however the sound quality and video quality of the Amazon and Apple are about equal and far superior to ROKU.Without getting technical very simply even using a direct internet connection on the ROKU the quality isn't there and the difference with Amazon and Apple is vividly clear.That said, and CNET says the same thing, it comes down to are you an Apple person or a Kindle person. That's because each device really caters to their customer base, depending on what you own you can basically sync all your devices with your TV.I am an Apple person, all my music is on iTunes, but I have a Prime membership and that is why I have the Fire. The Fire is  overkill for me because I don't use any of the features like book sharing you get if you have a Kindle. I have both hooked up to my receiver, the Apple to the bedroom TV and the Fire in the living room, I can play all my music through the whole house with the Apple but I want Prime on the big screen for Prime movies.So it really is about how you use your device, as I said if Apple had Prime I would not have Fire.If you are a gamer, I'm not, the Fire has a lot more games than Apple and a cool game control you can buy from Amazon, looks like it can be fun, but my feeling is gamer purists might find it all awkward  and a compromise with the experience and prefer Xbox or Play Station.So if you have one device to buy and you have a Prime membership you will not be dissapointed with the Fire, it's great! If you don't have Prime it comes down to are you an Apple person or. Kindle person, the Apple is wonderful it just doesn't have the app library Amazon or ROKU has, but it does have Netflix and Hulu plus and some others and I'm sure it will get ether in time now that Fire is competition.", "verified": true, "helpfulness": "0/0", "author": "ACRA"}, {"rating": 3.0, "review": "Before I start writing about it, let me tell you that i also own Roku, Chromecast and apple TV. I received it as gift.The Best thing I liked about it the speed and response, it's the fastest one among all the streaming device and have a good design and remote which can do a voice search, got almost all the popular apps. But compare to Roku 3 it lacks lots content. Though I am not a game freak where it has an edge over all other devices. overall, I am liking it but I am missing the feature of mirroring which chromecast and apple tv provide me. Roku remote headphone feature is a killer feature which makes the Voice search of fire tv just a nice to have feature which hardly works on my indian accent. I am still exploring it but till now i am just ok with it and giving 3 rating.", "verified": false, "helpfulness": "1/5", "author": "Sarik"}, {"rating": 3.0, "review": "I like this little box, but much improvement is needed.  As others have stated, when it comes to Amazon content, this little box shines!  The response is immediate and it works beautifully.  I love the voice command option, saves a LOT of typing with the remote. Streaming of Amazon content is quick to start, which is also very nice.Where Amazon Fire TV seems inadequate, is with the apps for other streaming options.  So far, I've only used Netflix and when it works, it's great.  The problem is, it so often doesn't work.  Several times now, I've had an issue where I click on Netflix to start the app and the box freezes on a bright white screen. Nothing happens!  This always happens after I turn the box on.  I end up returning to the home page and uninstalling Netflix then re-installing it. Then, of course, I have to re-enter my email and password in order to start watching.  This is really inconvenient - especially when I want to just sit back and watch something. I'll admit, I mostly bought the box to watch Amazon Prime content in my bedroom, but Amazon Prime doesn't offer a lot of things that Netflix does.  I understand that Amazon wouldn't put as much effort into other companies' product, but at the very least, I shouldn't have to uninstall and re-install the Netflix app to get it to work.If this is fixed, my rating will definitely improve.", "verified": true, "helpfulness": "3/4", "author": "Seattle guy"}, {"rating": 5.0, "review": "This is easy to set up and very easy to use. The remote is far superior to the Apple TV. Works great. I am so happy I chose the Kindle T V.", "verified": true, "helpfulness": "2/2", "author": "Susanne M. Costigan \"SMC\""}, {"rating": 2.0, "review": "Have Amazon MP3 as my cloud music library, and this cannot access it.  It can access Pandora.  This is not ready, so I should return it.  Voice is cool, but only if you want to search Amazon, Netflix and Sho.  No HBO, Starz, FX, AMC, NBC, so missing the hot channels.  I won't recommend it now, but can see the engine is in place to be the standard - so to speak.", "verified": true, "helpfulness": "3/4", "author": "Michael Duke \"thedukes\""}, {"rating": 5.0, "review": "Fast, fast, fast. Easy to use and set up, especially if you have a Prime account when you purchase it. I am getting another to replace a Roku.", "verified": true, "helpfulness": "1/1", "author": "J T Quanbeck"}, {"rating": 5.0, "review": "better than Netflix,  more movies too choose from.  easy too operate. fun for the whole family. have told my family an friends, you got too get one of these.", "verified": true, "helpfulness": "1/1", "author": "jennifer"}]