[{"rating": 5.0, "review": "The remote is very easy to use. The picture quality is very good. I have the Fire TV fiber optic cable hooked up to my Yamaha resever, the soud is great. Since I got Fire TV I have down graded my Dish TV package . There is so much to watch on Netflex and Amazon video I don't watch Dish TV as much.", "verified": true, "helpfulness": "1/1", "author": "Karl H."}, {"rating": 5.0, "review": "Hello i just want to let everyone know i have been a member of Amazon for a long time. Amazon Fire Tv is one of the most beautiful streaming devices ever, and more important it may out beat Roku (and i have that also) but my two boxes work together due to the applications that i have. so for anyone that want a fantastic streaming device check out Amazon fire tv. i can sit back and look at my grandkids and family photo's its just amazing and it works with my roku. Thank you Amazon.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So simple and easy to use.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Debra Briggs"}, {"rating": 4.0, "review": "Nice upgrade from the Roku we have, only thing i would complain about so far, would be some of the menus are a little confusing to use sometimes, including things that you have for free on Prime, still showing with a price to watch, but on the same screen, it also allows you to watch for free.Second point would be the way it handles slow speeds from netflix at peek times, rather than buffering, it stutters very slightly every so often, i'd rather they detected this and gave it a larger buffer, downgraded the quality a little, or allowed you to configure this.", "verified": true, "helpfulness": "0/0", "author": "David \"MaDMaXX\""}, {"rating": 5.0, "review": "Excellent and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lwerth"}, {"rating": 3.0, "review": "It is a good media device, however it is kind of overwhelming, and the navigation is not that obvious.Hardware-wise, I have no complains, it delivers and it is really to setup.Software-wise, it is not that user friendly, I know that it hurts to compare but it needs to learn a little of the simplicity of AppleTV.I actually considered it as a replacement for my AppleTV... but not yet, not just yet, maybe one day.It's good but it didn't blew my mind.", "verified": true, "helpfulness": "2/2", "author": "Charlie"}, {"rating": 5.0, "review": "Before buying this product I extensively tested both the Roku 3 and the Apple TV (family members own both of these). First of all, don't even consider buying an Apple TV, they suck. Limited channels with limited functionality. The Roku 3 is a great machine, currently the King of content. I have owned the original Roku box (years ago) and the Roku 2. I have nothing bad to say about Roku. They are great. So why did I decide to switch allegiances to the Amazon Fire after 7 years with Roku? Quite simply, I bought the Amazon Fire TV for it's future potential, not for it's current content availability. The gaming aspect was appealing to me. I have never owned a real game console, however; I like the idea of having the option of playing some simple games on a lazy Sunday afternoon. Additionally, the interface is very attractive. I already purchase most of my goods from Amazon (tangibles, ebooks, etc.) so the idea of being able to do this in the future from the comfort of my sofa is appealing. All in all, a great product.", "verified": true, "helpfulness": "1/2", "author": "CharlieOakes \"CharlieOakes\""}, {"rating": 5.0, "review": "I've had Fire TV for a few days now and I love it!  Took very little time before it was set up and we started exploring the diverse programming options available.  It looks as if the free programming as an amazon prime member offers a lot of options but it might be because it's all new...I'll know better after a few months.Now...amazon needs to come up with an equally effective OTA DVR!", "verified": true, "helpfulness": "0/0", "author": "Annie Abbott"}, {"rating": 5.0, "review": "Fantastic machine! I've used a few streaming boxes, but Amazon has blown the field away with Fire TV. Sideloaded XBMX and this is a dream machine. LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. I read every review I could find.  There were a few on this site that actually explained the benefits and differences so that I could understand.", "verified": true, "helpfulness": "0/0", "author": "heide bailey"}]