[{"rating": 3.0, "review": "Pros and consOK -  I have no experience with other streaming media boxes out there, take that into consideration.I got the box on sale which didn't make me feel too bad about it but you still have to pay $99 per year for a Prime membership - buyer beware, it's not included with the box, so you might as well double the $99 price you're looking at on the screen if you're not already a Prime member (I already was a Prime member and have been for the past few years even though they keep raising the price on me).There is a lot of free content on Prime.  For example, if you're a scifi geek like me you can watch the entire Star Trek The Original Series without paying extra.  But if you want to watch some of the other old TV shows like the original Outer Limits or Mr. Ed, you're gonna pay to pony up some extra $$ :-)If you pick an actor like Jeff Bridges, you might get a few movies to watch for free, but since he's popular, most of them are gonna cost you extra.Amazon needs to add an OFF button to this device.  I'm just not comfortable having a player and a remote with a microphone on it sitting next to me bed connected to the internet - even though I'm not watching it and hypothetically it is in \"sleep\" mode.Amazon should give the buyer some kind of video training guide about how to search for content.  There's a world of content out there but going about finding it is really tough sometimes.  Plus, just thinking about some of the things you might want to view is tough too.  Maybe they should add a Google search page for obscure TV shows and movies.Prime offers you a lot of free music.  But don't go asking for \"Bonnie Raitt CD\", \"Bonnie Raitt music\", \"Bonnie Raitt songs\" or any such other phrase.  You'll find several references to videos or mentions of her in TV shows, etc. but no music.  If you know the name of a specific release (album, CD, etc., you might find that, but good luck).  Maybe this will be improved in a future software release while I'm asleep and the little LED on the device is staring at me.Now if I could just find a weekend to binge-watch Star Trek TNG...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"doojinsi\""}, {"rating": 4.0, "review": "Amazon did an excellent job making the installation very easy, the product is small and non-intrusive, voice search works really well, and the unit seems to be of good quality.  However, we had expected a much larger selection of free videos, or at least lower priced videos to be available.", "verified": true, "helpfulness": "0/0", "author": "LC"}, {"rating": 5.0, "review": "Better than cable.", "verified": false, "helpfulness": "0/0", "author": "Terry Gray"}, {"rating": 5.0, "review": "Finally getting into all it has too offer.  I'm glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Debra G."}, {"rating": 5.0, "review": "The best streaming device I've used.", "verified": true, "helpfulness": "0/0", "author": "David B."}, {"rating": 5.0, "review": "We have enjoyed Amazon Fire since it was a Christmas gift for my wife.", "verified": true, "helpfulness": "0/0", "author": "Curt's"}, {"rating": 5.0, "review": "My son loved it. So easy to set up and works perfectly. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Kelvain \"Jim C\""}, {"rating": 4.0, "review": "I enjoy the \"fire\" more than netflix;however, it continues to stop and start, or stop and not start during the programming.  Don't know why, but it isn't any worse than other units.  Somewhat disappointed  in movie selection available to us.  Movies are dated and some are very grainy in display.", "verified": true, "helpfulness": "0/0", "author": "frank greer"}, {"rating": 5.0, "review": "Easy set up was easy,plug in and I was ready to go. The streaming is awesome, with my roku it was always rebooting ... I don't have that problem/frustration with the Amazon Fire TV . Voice search works great. The thing that I love best is that I can be watching something on my tablet and fling it to my big screen ... AWESOME feature !!! I would buy this again.", "verified": true, "helpfulness": "0/0", "author": "Helen Mcclain"}, {"rating": 5.0, "review": "Easy to set up and easy to use. So much nicer then having to deal with a cable company and a satellite dish. We have a subscription to Amazon, Hulu and Netflix. This is the only thing we watch on our T.V. Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Carolyn N"}]