[{"rating": 4.0, "review": "I really like this streaming box.  The interface is fast, and minimal.  No clutter to get in the way.  Content is streamed without any buffering.  My only complaints, and the reason I can't give it 5 stars is the lack of ability to filter a search by what is available for free on Prime, and the lack of global search.  If amazon would add this functionality then this would be the best streaming box out there.", "verified": true, "helpfulness": "1/1", "author": "AcidSpun"}, {"rating": 5.0, "review": "My husband loves this. Setup is so easy and the list of shows available is amazing.", "verified": true, "helpfulness": "0/0", "author": "Sheryll D Barraco"}, {"rating": 4.0, "review": "Love my Amazon Fire TV. Great to watch old movies and the new ones too. Only wish is that the rentals be more affordable. Maybe a monthly special for several movies.", "verified": true, "helpfulness": "0/0", "author": "Marty J. Andre Jr."}, {"rating": 5.0, "review": "Excellent! But why do I still have to pay for so many Amazon movies when I am a Prime member?", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Nice alternative to regular tv programming. The verbal search function is helpful, but what's really needed is a categorical search function that covers all apps and channels at one time, perhaps organized by type (i.e. drama, comedy, sports, adventure, etc.). It is very time-consuming to manually skim through everything looking for a program or movie to watch that appears interesting.", "verified": true, "helpfulness": "0/0", "author": "David Grisham"}, {"rating": 5.0, "review": "Love this.  Highly recommended.", "verified": true, "helpfulness": "0/1", "author": "C. Wheeler \"KC Book Lover\""}, {"rating": 5.0, "review": "Works great and meets my needs perfectly, As a prime member I have had no issue with the availability of the prime content, My only complaint is with the video library, it would be nice if there was a way to organize it differently to make it easier to find the movie or show instead of by purchase date Alphabetical would be good like the UBox player on the computer.", "verified": true, "helpfulness": "0/0", "author": "R. Bradley Martin"}, {"rating": 5.0, "review": "Great device for XBMC. Amazon really needs to keep the software OPEN like a google nexus device. Also, this product page still says VC1 is supported, which seems to be wrong as per https://developer.amazon.com/public/solutions/devices/fire-tv/docs/media-specifications. The sooner amazon fixes this the better, as this is misleading.", "verified": true, "helpfulness": "0/2", "author": "Sadish Sadasivam"}, {"rating": 3.0, "review": "I bought amazon fire tv so I could watch amazon prime and netflix on it, but I feel like the amazon prime services were misleading. Most of the tv series I wanted to watch (that were amazon prime exclusives) I would've had to pay for ontop of the $99 per year. I canceled. I can watch netflix shows for free after the initial fee!", "verified": true, "helpfulness": "2/7", "author": "Jessica Ozburn"}, {"rating": 4.0, "review": "Amazon Fire TV is another great content consumption device from Amazon.Music streaming works well. I have tested it with my Amazon Music and with iHeart radio and both are good.Video streaming works well too, at least for Amazon Instant Video, Prime, and Netflix. The HuluPlus app works well with content that doesn't contain adverts, like movies and the PBS kids shows, but there appears to be a bug in the app that causes the video to freeze whilst the audio continues to play just after an ad-break. Whilst this isn't an Amazon fault, potential buyers may be considering purchasing the device with a view to streaming HuluPlus content.The operating system is quick and responsive, easy to navigate through, and appears similar to the Kindle Fire tablet OS with its carrousel-style 'walled garden' interface.It was not love at first mumble for the voice search and I, but after a few days the device has either started learning my voice, or I have learned to mumble more like Gary Busey and I am having much greater success with my voice searches.Games designed for the $40 Fire TV Game controller work really well, and there are some impressive games for the device. (incl. The Bridge, Sev Zero, Mine Craft, and Asphalt 8) - the one big negative is the lack of a decent amount of storage on the device. Whilst it is fine have Amazon Cloud Storage for all of your Amazon purchased content, any game you want to play needs to be downloaded. This means that if you do buy the device with gaming in mind be aware that you can't keep more than a few games on the device. (The ironic thing is that when you see the Fire TV adverts, Asphalt 8 is always on when they are demo'ing games, and this game at 1.6GB when fully downloaded from GameLoft is by far the biggest space hog.) When they are selling an optional game controller at roughly half the price of the Amazon Fire TV unit, Amazon can't claim that the device is a media streaming device only.Limited storage also affects FreeTime as it keeps separate copies of the software for each user profile that a particular app is installed for in FreeTime. (Particularly painfull when you have two kids that you want FreeTime profiles set up for and you were going to give them both access to Asphalt 8...)App availability is decent, and I would expect this to get even better as more units are sold. - I really like some of the DLNA apps which allow me to send content from my Apple iOS devices to the FireTV so I can see the content on my big screen television without needing to purchase an AppleTV device.I really love 80% of the Amazin Fire TV's capabilities, I just wish Amazon would add more storage, or make the non-functional USB port on the back functional and capable of extending the device's storage capacity by means of external USB storage media. And my other wishlist item for the device is headphone jacks in the included remote (like some of the Roku media players have), and the optional $40 Amazon Fire TV Game Controller.", "verified": true, "helpfulness": "2/2", "author": "LAWRENCE COLDICOTT"}]