[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Luiz Gustavo M Candido"}, {"rating": 5.0, "review": "I am currently very happy with my purchase. It worked right out of the box and was already authenticated with our Prime account. Its easy to use and navigate and the remote is nice. Im hoping to get the game controller for chirstmas and try out the games on it as well!", "verified": true, "helpfulness": "0/0", "author": "TheHappnenChicken"}, {"rating": 5.0, "review": "I really enjoy the Amazon fire tv. It was easy to install and setup.", "verified": true, "helpfulness": "0/0", "author": "Bev Reinecker"}, {"rating": 3.0, "review": "Works well, pretty easy to set up but far too easy to click the wrong button and buy something unwanted from Amazon. For that reason, I won't be using it. Pretty much a device to sell stuff to you.", "verified": false, "helpfulness": "0/0", "author": "EngineerGuy"}, {"rating": 5.0, "review": "Loads fast.  Better than my Apple T.V.", "verified": true, "helpfulness": "0/0", "author": "Babybok"}, {"rating": 5.0, "review": "Easy to use & set up", "verified": true, "helpfulness": "0/0", "author": "Amalia L Silguero"}, {"rating": 5.0, "review": "Worked well and is easy to use. Not sure on the gaming aspects because we bought it for video streaming", "verified": true, "helpfulness": "0/0", "author": "Steve C. Miceli \"Steve from WI\""}, {"rating": 5.0, "review": "I previously had a WD TV which worked well for my needs but was exceedingly slow. The Fire TV however is in a whole different league. This is blazing fast compared to any other product I've used and Plex is extraordinarily easy to set up. I can't wait to see what the HDMI stick version of this product will be like.", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 5.0, "review": "It's something I should have done a very long time ago instead of making  the cable company richer.", "verified": true, "helpfulness": "0/0", "author": "Tina"}, {"rating": 5.0, "review": "Its Awesome.  I love it. Especially like the voice command.", "verified": true, "helpfulness": "0/0", "author": "jason lee hall"}]