[{"rating": 5.0, "review": "This is a great device, the video is smooth and in HD!!!", "verified": true, "helpfulness": "0/0", "author": "William M. Bruce"}, {"rating": 5.0, "review": "I am very excited about my new  Amazon Fire TV and doubt that I can wait till Christmas to open it !!!", "verified": true, "helpfulness": "0/0", "author": "Beverly Louise Warren-Lynch"}, {"rating": 5.0, "review": "Love this product and the speed, much better compared to my ROKU.", "verified": true, "helpfulness": "0/0", "author": "VLP007"}, {"rating": 5.0, "review": "Awesome new toy!  Works great and easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a great product.  Really easy to set up and use (even on my computer monitor!) and is super fast!  Spoke to a few friends about their uses with these types of products (Google's Chromecast, AppleTV) and I decided on this one as the specs and offerings seemed to be the best match for me.  I wasn't sure if I wanted to get it because I didn't want to buy a tv so I thought i'd just try it out on my computer monitor (it's a newer one with HDMI connections) and didn't have many expectations.  I love it so much (for both movies/shows and music/radio options) that I ended up getting a TV.  LOL!  We'll see how much more I love it with the new set up!", "verified": true, "helpfulness": "0/0", "author": "km8524"}, {"rating": 5.0, "review": "Good Product, easy to install and easy to use", "verified": true, "helpfulness": "0/0", "author": "Rudolph Martinez"}, {"rating": 5.0, "review": "I wasn't for sure at first whether I wanted to keep this or not, but we love it so much that we got rid of all our cable channels and only kept basic.", "verified": true, "helpfulness": "0/0", "author": "darnell"}, {"rating": 3.0, "review": "IT WAS PRE REGISTERED AS SAID IT WOULD BE, WOULD NOT HOOK UP THROUGH CABLE BOX AS I WAS HOPING, IT DID WORK WELL ON OUR SMALLER TV, IT WILL ONLY LET YOU WATCH FREE THE MOVIES MARKED PRIME", "verified": true, "helpfulness": "0/3", "author": "Toz"}, {"rating": 5.0, "review": "When can I use this with my Echo?", "verified": true, "helpfulness": "0/2", "author": "Ladybug \"Ladybug\""}, {"rating": 2.0, "review": "WARNING: The Amazon fire will not play Ultraviolet copies of TV shows through flixster. Apparently Amazon TV has a contract with Flixster so that they only allow you to watch ultraviolet movies, but not the ultraviolet tv shows you own when on amazon fire (It's odd that they made this distinction). So, if you want to access your ultraviolet TV shows through flixster, as I do, don't get the Amazon fire. You also cannot get VUDU with the fire, as that would be one's only recourse.  Also, the voice search only searches amazon, which isn't very helpful when you want something on netflix, or one of the other apps you are on in amazon fire. The one we bought will be going back. Too bad the other one we have was given to us as a gift.", "verified": true, "helpfulness": "1/3", "author": "Melissa Pol"}]