[{"rating": 2.0, "review": "Does the Fire stream local content, e.g. acting as a DLNA client, mount nfs and smb shares and play back from NAS? No. Split-screen? No. Emulators? No. XBMC? No. Yes it does Plex, but if you ever tried Plex - it's quite messy. The Fire TV box doesn't seem to be able to play direct from network folders, but relies on other media server software.However you can sideload apps:1.First go into settings>developer and enable dev mode so you can sideload.2.Install ADB. It's in the Android SDK, but that's 500MB, so get it from here: forum.xda-developers.com/showthread.php?t=25889793.If you used the download I linked, you can use adb from anywhere (otherwise you'll need to find where adb is and open the command line from there).4.Connect your FireTV and PC to the same network, and get the IP of the FireTV. To do this go to settings>about>network and write down the IP.5.On your PC, open up command prompt and type these three commandsadb kill-serveradb start-serveradb connect <firetv ip>6.If all goes well, it should say something likeconnected to <firetv ip>:55557.Now you can do adb stuff. To install an app, just typeadb install C:\\path\\to\\app.apk8.Depending on the size of the apk it may be just a second that it takes to copy and install, or it may take a few minutes. But it should say success if it worked. If not, it'll tell you why.9.To access the apps, go into settings>applications and scroll through the list to find what you sideloaded.Then things get better, you can play all media types, emulators, and XBMC. The emulators run well and it also supports many by sideloading. This is gonna do gangbusters. My reasoning is because it is hard to get an Android device specifically for all aspects of HTPC.However, with Amazon's apparent war against the android community, not only can you not access google content (apps, movies, music, etc) from Kindles or Fire TV but Amazon also seems to be trying to block their own prime movies from being viewed on android devices.Here's the thing, The Amazon Fire TV Is actually Kind Of A Mess. Search is still a major issue, and so is the general availability of shows, music and movies. I'm not just talking about HBO Go here; I'm talking about how Fire connects to non-mobile devices. And Split-screen isn't an option for multiplayer-supported Fire TV games. If Google releases a Chromecast Pro that is like the Fire Box and supports Google Play, then would there be any reason to buy this? No....  readwrite.com/2014/04/04/amazon-fire-tv-review-hands-on-impressions", "verified": false, "helpfulness": "23/27", "author": "V"}, {"rating": 2.0, "review": "Why would i buy this when i already have a device that i can steam netflix and amazon prime from sorry peeps.", "verified": false, "helpfulness": "5/54", "author": "Richard"}, {"rating": 2.0, "review": "Sony BDP-S5100 3D Blu-ray Disc Player with Wi-FiBefore i would purchase this., With the Sony BluRay you can Surf the net and land on websites, you can access Youtube and all its content, and you can also play BR discs. along with all the other Channels that AmazonFire TV offers.. for about 15 bucks less !!", "verified": false, "helpfulness": "8/79", "author": "akonapet"}, {"rating": 1.0, "review": "Best deal on streaming TV. $2.99 a month for all the British and Antipodean shows you can stand. Worth it just for Jack Irish.", "verified": false, "helpfulness": "15/225", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I really love my Chromecast, but it couldn't play Amazon Prime material. My Roku is older and is annoyingly slow and buggy. I hoped this would be a great replacement with some cool features like voice recognition and ASAP. After a few hours with it, it's not all that great. I either hadn't read or didn't realize that the voice search is limited entirely to Amazon Instant material. I tried \"30 Rock\" after installing the Netflix and Hulu+ apps. It still would only show 30 Rock *for purchase* on Amazon. I did know from the start that the ASAP feature only worked with Amazon material, but it was still only about 50/50 when I pulled up a handful of shows. It's a pretty closed feeling ecosystem for touting how open it supposedly is.There's no argument that it's fast. It whizzes through menus and responds to the bluetooth remote instantly. But I hear the Roku 3 does that as well. I'm not even a casual gamers, so I won't comment on that ability. I'm also not crazy about an external power supply and HDMI cable after not having one for several months.Overall, it's just okay.  It does almost exactly what a Roku does, but with a different interface (which I'm not sure is any better). I'm not nearly as impressed as I was at the Chromecast for $35. I think I'll supplement my Chromecast with the new Roku stick. Same effect, less clutter. I hoped there would be something about the Fire TV that made it feel like 'the next big thing'. There really isn't.", "verified": true, "helpfulness": "17/38", "author": "greyspace"}, {"rating": 4.0, "review": "FireTV is basically just what it sounds like: it turns your TV into a giant Kindle Fire.  If you are familiar with other streaming media players, you’ll have an idea of what to expect. FireTV streams video and audio content to your TV from the same providers: Hulu, Netflix, and (of course) Amazon.So let’s go through my first experience:Part One: Opening the box (Queue Thus Sprach Zarathustra.)Ok, I have to say it: Nothing impressive here, sorry Amazon. I have to say that the FireTV is about the most boring looking black box I’ve ever seen. The good news: It completely disappears on your entertainment center.The remote is pretty bare bones looking.  The microphone button grabbed my attention, but otherwise, there are very few buttons.  Can I complain that it is both very black and very small? Yes, I know that “Black is the new Black”, but I’ve already lost it once and I’ve had it for about 2 hours.Ok, enough looky-looky, time to um….hooky-uppy.Part Two: Setup (Where is my “That was Easy!” button?)Power: Check!HDMI Cable: Check!Turn on TV: Check!Wait for it to boot…wait…It’s done: Check! (That was fast!)And done? Check! I’m an Amazon Prime member and my account was already setup on the box and ready to go.Part Three: Interface (“What does this button do?)Actually, it’s not rocket science:The “Home” button takes you back to the home screen.Click the wheel to scroll through options.Hit the button to make your selection.Voice Search: Ok, I will tell you: I am not a big user of voice tech. Really, I hate to use the telephone. I guess I’m afraid the pizza guy is going to tell me “No!” But I can see that with a little getting over my own fears, voice search is going to be awesome! My FireTV correctly heard all three of my queries. One caveat here: Voice Search only pulls up Amazon content. No a huge deal for my family, but maybe for yours. You can always search the old fashioned way like other streaming boxes.Part Four: Video and AudioAs I said, it was easy to hook up. Just plug it in. Video looked great on my 40” TV. Audio was good over our home stereo. The quality did not seem any better or worse than my other HD set top box.The services available to stream from are also pretty standard fare both on the video and audio front.Part Five: Games (“Thousands of games coming…”)This reminds me a bit of the days when I got the original Kindle Fire. Of course, Amazon made good on their promise there, so I have faith that they’ll do the same here. Just a quick view through the list of already available games tells me that there is already a good mix of “approved” titles for the Fire TV, and more are on the horizon.Please do not mistake this for a “NextGen” gaming console. It looks like a good choice to be able to play tons of Android games on your big screen.Overall: 4 stars. Fire TV is a very nice mix of old and new. There are a few puzzle pieces missing, but knowing Amazon, they’ll be filled in quickly!", "verified": true, "helpfulness": "308/354", "author": "CandysRaves (and Rants) \"CandysRaves\""}, {"rating": 1.0, "review": "I do purchase BluRay and I am a user of Digital Copy.  Vudu is an essential channel.  Also, HBO is the best premiere channel on cable.  Best original programming - I could on forever. I love being able to watch what I want, when I want on HBOGo.  Just another reason HBO is the best.  Don't get me wrong - others are making strides to catch up and should be commended.  But HBO is still the standard as long as it is HBOGo is a reuirement for media streaming.", "verified": false, "helpfulness": "15/236", "author": "mcglom1"}, {"rating": 1.0, "review": "Until its got HBO Go, I'm not interested.  As soon as it does though, I'm getting one.  Hopefully they fix this major missing piece soon.", "verified": false, "helpfulness": "13/235", "author": "FitForLife"}, {"rating": 4.0, "review": "I ordered this as soon as it was available and it arrived this morning.  For background, I also have an Apple TV, which I hate but my kids love.  I also have various WDTV models, Which I love.  The reason the kids love the Apple TV is that the interface is so slick and quick, which the WDTV certainly lacks in.  This Fire TV is even better IMO than the Apple TV and the WDTV doesn't even come close.  Unfortunately, the Fire TV misses in a huge way for me by not allowing the play of external content through the USB port from attached storage or memory stick.  If it had that capability, and hopefully it will in the future This would be the perfect device.  This is why I am still hanging on to my WDTV as my go to player.  It will play virtually any file format you throw at it which is a priority to me.  I have been reading about the Plex app and that may satisfy my needs as well, but I haven't dug deeper or tested it out.  If that is not the case for you, than the Fire TV would be a great option.  I am not familiar with Roku, because I could never justify the purchase due to the inability to play content from local storage.  Unfortunately I jumped the gun with the Fire TV because I saw that it did have a USB port and made the assumption it would support external content.  Hopefully this will come in a future firmware release otherwise maybe Plex will be able to fill that gap for me.  Bottom line, if external content is not important, I would recommend this Fire TV due to the availability of Prime content and the fact the interface is beautiful and very quick.  The Apple TV should only be a consideration over this if you are a fanatic Apple loyalist, or you have a tremendous amount of itunes content you want to be able to utilize.", "verified": true, "helpfulness": "33/40", "author": "JDB"}, {"rating": 1.0, "review": "Remote wasn't working.  Tried the included batteries, my own batteries, and every possible configuration for this thing and none worked.  Spent 30 minutes on the phone (most of that on hold) and they will send me a replacement.  Had to complain so that they would pick it up rather than trekking out to the UPS store for a drop off.  Hope the replacement works.", "verified": true, "helpfulness": "52/172", "author": "Brad Silver \"Smotcol\""}]