[{"rating": 4.0, "review": "I absolutely hate the UI/UX. Other than that, I love it.", "verified": true, "helpfulness": "0/0", "author": "J. Armitage"}, {"rating": 5.0, "review": "Love it. Won't go back to traditional TV again.", "verified": true, "helpfulness": "0/0", "author": "M. Ames \"citipearl\""}, {"rating": 3.0, "review": "The only reason I bought this is because I am a prime member and this appeared to be a good way to bring this to my big screen.You know how websites try to scam you into clicking on content? Fire TV Menus are poor, the emphasis seems to trick you into buying something and steering you away from the \"free\" content, this is extremely annoying and a time waster, seriously it could not be more obvious.Overall Amazon has done a good job technically with the Fire TV.  The remote is nice in your hand the unit is compact.  Mirroring is limited to HDX tablets and Fire Phone,  I have the original Fire and the new Fire Phone.  The mirroring from the Fire phone to the Fire TV was better than the Iphone to Apple TV I have. The voice search works very good but theI used Netflix with the Fire TV and it worked very well no hiccups or buffering.  The screen saver is good.I have had it a few weeks now and will update in a month.", "verified": true, "helpfulness": "0/2", "author": "Alfa"}, {"rating": 5.0, "review": "Exciting new product from Amazon. Easy to set up and easy to operate.", "verified": true, "helpfulness": "0/0", "author": "Richard D. Turner \"rjrmpk\""}, {"rating": 5.0, "review": "This is an awesome addition to the TV.  It is easy enough that I can use it and there is a wide variety of things to watch.", "verified": true, "helpfulness": "0/0", "author": "Pastor Barb"}, {"rating": 4.0, "review": "Fire tv is a good product.  It is however not as user friendly as apple tv for example.  Its fast, its got most apps for streaming you would want, and a ton of nonesense you will never have time to care about.  For me i like apple tv and its itunes radio app.  I like apple tv for its podcast access.  I am disappounted by fire tv for its pointed direction to watch everythibg thru prime.  I dont see an option to rent movies or maybe its there and im too new to have explored enough.  Anyway, a few plusses and minuses. Overall 4 stars, leaves me wishing for a less insulting interface, and search options. Of course everyone knows the voice search gimmick works but only for prime content.", "verified": true, "helpfulness": "0/1", "author": "shannon dealing"}, {"rating": 5.0, "review": "Love it. We have Apple TV also now we get prime movies in our family room.", "verified": true, "helpfulness": "0/0", "author": "Marcia"}, {"rating": 5.0, "review": "Better than Apple", "verified": true, "helpfulness": "0/0", "author": "Lance Dunning"}, {"rating": 5.0, "review": "This thing is awesome!  It loads everything very fast and has yet to stumble with HD content like other streaming devices.  Love that it shows lyrics for songs (when available) when music is playing.  The voice search is very capable, and only fails when I'm not speaking directly at the remote.  Big thumbs up!!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey"}, {"rating": 5.0, "review": "Sweet Box ,makes the headache for the wife is now gone & she can use Amazon Prime Videos with new easeShe loves the user interfacewent with the hard wire / box as the access was there , save the wireless dongle for others I like to have a hard wire on a main viewing device .the house's  wireless bandwidth is then maxed for the mobile devices ,phone,tabletsSet-Up is Super Easy assigned a HDMI input on my HT receiver , was up & running in seconds", "verified": true, "helpfulness": "0/0", "author": "BigSlappy \"BigSlappy\""}]