[{"rating": 5.0, "review": "i bought a Roku box and gave it to my sister. i bought the amazon fire TV and overall its just amazing. sometimes i get bored and want to play a little game like black jack or racing and Roku has none but jacks or better and other games you have to pay witch it isn't even worth to buy. it streams the movies faster than the Roku. Absolutely what i been looking for, I cant complain", "verified": true, "helpfulness": "1/1", "author": "Hector Serrano"}, {"rating": 5.0, "review": "Going to disconnect the DirecTV from one room and save a few bucks. Just got this yesterday and we love it. Making the most out of our prime account too.", "verified": true, "helpfulness": "2/3", "author": "TJ"}, {"rating": 5.0, "review": "Overall I am happy with the purchase of this device. It is very easy to use, has a great intro video and seems very powerful. It is aesthetically pleasing and is very compact including the remote.As far as drawbacks there were a few things I didn't like. It requires a update out of the box and I bought it with next day shipping on the day it released. Why does it not come with up to date software? The remote is extremely loud when you are clicking through everything, especially if someone is sleeping next to you. It is also to small for my tastes but other than the clicking a good remote. The third thing is I have not found a way to make it force sleep. It will do it automatically after 15 or so minutes but I don't want a bright led shining when I turn off my tv. The sleep light on it is barely noticeable I just wish I could make it sleep from the remote.", "verified": true, "helpfulness": "1/1", "author": "matt schaub"}, {"rating": 5.0, "review": "I am very pleased with this purchase.  It does everything I wanted it to do, well.  I wanted to stream netflix and prime on a separate device than my ps3 and ps4.  This works as well, if not better.  The ps4 loads a little faster but not enough to make that much of a difference.  The graphics and sound are also very good.  Looks great on my 55\" Samsung smart tv.  Also easy to use.  Great piece of equipment and recommend highly.  I haven't tried the voice commands and probably won't because it's not something I care about using.", "verified": true, "helpfulness": "1/1", "author": "snrgamer \"Shirl\""}, {"rating": 2.0, "review": "The hardware spec are good, but the search is horrible and overall experience for streaming video is not as good as Chromecast which costs just one third of this device. It is able to get and hold a good wi-fi connection and is fast indicating good hardware. However, when searching for a movie or a program it searches it only for its Prime collection even when the program is available in Netflix. Too much shameless cross promotion of Amazon video content makes it lot less useful. Besides, it tries to be everything but I find a chromecast which is 1/3rd of the price of this box and much smaller a better value for money. One less remote to haggle around and I can cast my Chrome browser to my TV with any program and Chromecast has a lot larger selection of compatible streaming options even without the Chrome browser casting feature. May be Fire TV can catch up with Chromecast after two more iterations if Amazon can get out of its habit of intrusive self promotion in the device.", "verified": false, "helpfulness": "2/9", "author": "A reader"}, {"rating": 3.0, "review": "But they fell short. No fox news no CBS news. No weather. I want a box to cut the cord. Now I use both roku and amazon fire. The fire is great for amazon interests Roku is assume for everything else. But roku is slow and sluggish. My hope is amazon actually reads this and adds better apps. Also the way u view apps sucks. They should have taken a look at the roku.", "verified": true, "helpfulness": "1/4", "author": "nike shoe"}, {"rating": 5.0, "review": "When I want to stream videos from Netflix I've been struggling with a Samsung Blu-Ray player that came with my Smart TV.  When it works it's OK but often it doesn't and can't even hook up with my network or wants me to re-enter the password, which is a clunky, cumbersome process.  I tried Google Chromecast and it's easier to work with but is very limited, and won't let me access Netflix.  I got the Amazon Fire TV yesterday, had it hooked up and updated in about 15 minutes, and was watching a Prime movie in no time.  It didn't take long at all to enter my Netflix account info and start binge watching Season 2 of House of Cards.  The stream was never interrupted like it used to be frequently with the Samsung device. The remote is very easy to use and seems intuitive, especially compared to the Samsung remotes.  Even the voice activation seems to work well.  I am really impressed with this device!", "verified": true, "helpfulness": "2/2", "author": "Slow Hand Dave \"slow hand\""}, {"rating": 5.0, "review": "Received my FireTV yesterday. Setup was easy even though it immediately needed an update that took a few minutes. The reason I said nearly perfect is that it doesn't (yet I hope) support SpiritClips by Hallmark. I'm hopeful since I can add the SC app to my KindleFire that maybe I can get it onto the TV that way. I am a long time Amazon Prime member and of course the thing works great with Prime. I love the voice search and it works very well. I'm not too upset that it only works with Prime since it is the main service I use. When I do use something else I find the search entry to be much easier on the remote than it was on the Roku I'm replacing. I've read with interest the negative reviews, though not until I had already set mine up. One thing I've learned with Amazon is that if something doesn't work it is always easy, and best, to return it and get another. I've only had to do that one time but when the new product came it worked perfectly. I never do a review until I have at least tried that. I'm not above giving a poor review but I've been around long enough to know that an inferior product can get through. As I've said in the past, those of us who are early adopters are usually more lenient when it comes to glitches. The FireTV will get better as it goes along, but for now I do find it to be a very nice upgrade to what I was using.", "verified": true, "helpfulness": "2/2", "author": "Karen"}, {"rating": 1.0, "review": "Google Chromecast does this exact same thing for $40.  But I can't watch Amazon Prime video on Chromecast so Amazon expects me to spend $100 on this.  Except they just raised the price of Prime by $30.  Really? How about offering it free (or for the same price as Chromecast) for those of us who've had Prime for years and only used the shipping part of it because we hate watching movies on a tiny screen--those of us who are now subsidizing Prime video users?", "verified": false, "helpfulness": "8/54", "author": "just4now"}, {"rating": 3.0, "review": "I have owned every flavor of Roku, AppleTV and a Chromecast.  For me, the Roku 3 is still the best streamer currently available, content trumps the performance of the Fire TV.If you only have content with Amazon, and subscribe to Hulu Plus, Amazon Prime or Netflix only, then the Fire TV will work excellently for you.  If you have an extensive PLEX library, it will handle that equally as well with the purchase of the PLEX for Fire TV app.  However, if you have an extensive movie collection on any UV service, here is a painful observation:  Your only choice currently is the Flixster, so if you have your collection in VUDU, any non UV movies will be missing, and more importantly, you will be tied to the limitations of Android, meaning most titles will not stream in HD.If they add HBOGo and VUDU and can get around the limitations of UV streaming in Android, I'd give this 4 maybe 5 stars.  The voice search works well, but I can do the same thing with my ROKU 3 Remote App (though not as seamlessly).It is a good effort, definitely the performance king, and I will continue to use it in my game room, but it will not replace my Roku just yet.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}]