[{"rating": 5.0, "review": "I LOVE THE FIRE TV.  IT IS JUST FANTASTIC.  I AM NOW NOW WATCHING MY ULTRAVIOLET COLLECTION WITH FLIXSTER APP FROM FIRE TV AND PLAYS ABSOLUTLELY FANTASTIC.", "verified": true, "helpfulness": "2/3", "author": "Jason Young J. Tak \"Filmproducer\""}, {"rating": 5.0, "review": "All is as advertised and am enjoying Amazon Prime on the large screen TV instead of my computer monitor. Installation and  operation a snap.", "verified": true, "helpfulness": "1/1", "author": "b52john"}, {"rating": 3.0, "review": "Many shows that are available on Hulu Plus website are not available on Amazon Fire TV Hulu Plus app.  A message says that this show can only be viewed at hulu.com.  Very disappointing.  Example:  Days of Our Lives.", "verified": true, "helpfulness": "1/4", "author": "Gregory V Fawley"}, {"rating": 5.0, "review": "I've been planning on getting a \"set top box\" for the past 2 years but just never found something that had everything I was looking for.  Briefly browsing amazon a couple of weeks ago, I noticed they had their own recently release online media streaming device.  After looking over the specs and capabilities, I thought it was about time to take the plunge - especially since we've been using Amazon Prime streaming services more and more now that our daughter watches kid shows (i.e. Dora, Umi Zumi, Blues Clues, etc.)Though we've only had it around a week, we're very happy with the purchase.  We cut our cable over a year ago so plugging in the computer to the TV every time we wanted to watch something was beginning to get tiresome.  Connection was straightforward and simple. On boot, it was automatically logged into our Prime account (not sure how it did this.)The interface is slick and really easy to find what you're looking for.  It's very quick (not clunky) when browsing through video options and for some reason I think it looks better (could be mental, I know.)  Another neat thing is that the remote doesn't have to have line-of-sight to the front of the box since it utilizes bluetooth.  It's all about the simple things. Anyways, we're very happy with this little box.UPDATE: We love this thing! It's so zippy and responsive. The voice search is excellent and really speeds up the searching process. Previously, outside of my daughter streaming kid shows on her iPad, we rarely used the Prime streaming feature. Now, we're watching all types of shows we've never heard of - it's becoming a nightly thing after the kids are in bed. We love it!", "verified": true, "helpfulness": "2/2", "author": "Jenny Bean"}, {"rating": 5.0, "review": "Easy to set up; literally plug it in, download the apps wanted, and go. No software installation. No issues-so far. Incredibly user friendly interface. The only thing I am slightly pissed about is the fact that my signature/someone answering the door wasn't required when the package was delivered, a $100 piece of equipment was just left on my doorstep. Other than that, I'm quite happy with it!", "verified": true, "helpfulness": "0/0", "author": "B.Hyde"}, {"rating": 3.0, "review": "I like the voice search and speed of this unit.  The things i don't like is that i have to keep uninstalling apps to be able to keep on using this thing.  The fire TV does not even come close to the app selection for watching TV compared to the Roku.  So if you are looking at a TV watching device buy a Roku.", "verified": true, "helpfulness": "1/5", "author": "spartyfan"}, {"rating": 3.0, "review": "I bought this to supplement my OTHER streaming devices. I already have a Sony \"Google TV\", which supports the Amazon Prime Streaming and YouTube etc. It connects to my TV using the HDMI.  AND I have an Android tablet that lets me connect through the HDMI to my TV.The reason I bought the FIRE TV was I was under the impression I could use it to download Apps, (which is \"sort of true\"), and the App I wanted to use was the Xfinity TV GO.  I have it on my Android Tablet, but since it's wi-fi only, it suffers a lot from stutters and stops etc. So I figured since the FIRE TV connects to my CAT-5/LAN, I would have a faster connection.FIRST GRIPE - When I get the FIRE, first thing I tried to find was the Xfinity App. It wasn't on the FIRE's Menu at all.  Then I got on Amazon's site, and found it on Amazon's App Store, but there's a great big RED X next to the app, saying It's not compatible!  - D R A TSECOND GRIPE. No matter what I've tried to do, I cannot figure out how to limit my browsing of movies and TV Shows to ONLY show Prime eligible content.  On my SONY Goggle TV, the app that came with it lets me filter out the content so that only my Prime Membership Free Streaming shows up in my search results. IMHO, this a less than subtle method of forcing you to make a \"buying decision\" every time you look for content. I don't know which is worse, no filters or embedded advertising.THIRD GRIPE - The APP store is extremely limited. There's just a little over 100 apps available. Considering this is an \"Android\" device, and the Android Play Store probably has well over 10,000 apps.... that's very poor APP support.OH YES, Either I couldn't find it,  or THERE IS NO WEB BROWSER.It seems that everyone that makes one of these \"devices\", has their own little world that they support, and they try to block out every one else that could be competition. The end result is the Consumer ends up \"paying the penalty\".  AMAZON needs to wake up - Not everyone is in \"love\" with Amazon.Yes, for a first timer, The Fire is a reasonably slick device to own, but I simply can't see the point in keeping the FIRE. It's so extremely limited as compared to a REAL Android device, and everything it does is already duplicated on one of my OTHER devices.I am sending it back for a refund.", "verified": true, "helpfulness": "1/1", "author": "Auldtimer"}, {"rating": 5.0, "review": "I have never been happier, or more excited about a purchase anywhere, anytime ever!  Amazon really does blow all other competition out of the water with this creation!  It is very user friendly, fast, and fun!  I am so glad I got it and would highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Barb P"}, {"rating": 5.0, "review": "I recently received my Amazon Fire TV after months of researching which streaming device would be the best.  Basically what you are paying for is the internal specs, which Amazon has every other device beat by far.  The software limitations I am confident will be resolved soon, like HBOGo and Amazon MP3 apps being added.  We got this device to replace cable/dish.  With subscriptions to Netflix DVDs, Amazon Prime and Hulu Plus, there is very little we are missing by streaming and much we are saving!  The folks complaining about Hulu stopping in the middle of programming, I have had this happen here and there, but it has been at peak Internet use times only.  During the day, when folks are at work, I have had 0 problems streaming.  Just make sure you have good, high speed internet and a cable modem & router that can fully support the number of devices being used at one time.  I am totally happy with our purchase of the Amazon FireTV!", "verified": true, "helpfulness": "3/3", "author": "Vera H.L. \"vjh10679\""}, {"rating": 2.0, "review": "Might be a victim of hype, but Fire TV didn't meet my expectation.  Honestly, don't see evidence it's \"game changing\".", "verified": true, "helpfulness": "2/7", "author": "@explore360 \"Jon\""}]