[{"rating": 3.0, "review": "I do not have this product, however, why would i? all the other devices I have all do this. Amazon, I would say spend the money elsewhere, but good luck on the investment!", "verified": false, "helpfulness": "1/27", "author": "Zachary Guttenberg"}, {"rating": 4.0, "review": "People have different wants for an internet tv device and this review is simply based on what I like about the Fire TV and what I would like to see on Fire TV.  Amazon,please add a web browser and optional qwerty keyboard for this device.Most internet tv devices are either missing a web browser or have a horrible web browsing experience.Is it too much to ask for an internet connected tv device to have a fully functional internet browser???This is the reason why I find myself always having to go back to my Logitech Revue,as flawed as it is.Once I got used to browsing the web on my TV with a qwerty keyboard,I have found that I don't want to give that up as both capabilities come in  very handy. I like that the Fire TV is very fast and streams video smoothly.Yes,this device works great with Amazon Video.For me,the most important apps are YouTube,Pandora and Netflix and the Fire TV has these apps.While there are not that many different apps  currently available for Fire TV,I suspect many more will be coming out in the near future.I use Amazon for all my music downloads and I would hope they soon add capability to play your Amazon music with an icon on the Fire TV homepage. I like that Amazon has incorporated gaming with video streaming.People who don't want to spend more on Xbox one or PS4 may find the Fire TV a good alternative.I think the Fire TV will certainly be competing for sales with Xbox and Playstation as well as Apple TV and Roku. The voice search works very well,but only for Amazon content.This brings me back to the point of why a qwerty keyboard is needed.I doubt that I am the only one who finds it very tedious,time wasting and regressive to use the slow input of using several clicks to enter each letter or number when entering a search or user name and password for other apps.Some might say that you can use a smartphone or tablet to control your internet tv device but smartphones and tablets lose their charge fairly quickly and I find this wasteful and inconvenient and prefer a dedicated remote with qwerty keyboard. I am still undecided on whether to keep my Fire TV.It has quality hardware and streaming capability.If it had both a web browser and optional qwerty keyboard I would certainly keep it.", "verified": true, "helpfulness": "4/9", "author": "modalsystem"}, {"rating": 5.0, "review": "It works, it is fast, and the interface gets me what I need very quickly.  I have multiple versions of Apple TV and a Roku and I like this more.  Amazon gets my vote for the better implementation.", "verified": true, "helpfulness": "2/2", "author": "Jamie"}, {"rating": 4.0, "review": "I am an Amazon fan and have a lot of content locked up in their system including dozens movies, hundreds of TV shows, and thousands of MP3s. I have even been a Prime Member from the early days. So when I first heard the rumors that they were working on their own streaming box I got really excited. I already had other ways to watch and hear my content, including an XBOX360, a Roku, and a KindleFire HD, but I knew a product right from Amazon would have to be fantastic.I ordered my Amazon Fire TV, even before the presentation introducing it was even over, had it shipped overnight, and spent the morning watch for my UPS Driver. My first impression of the Fire TV, even before hooking it up, was that it was a very well designed device. While the unit is small, it is still very well built and appears to even be intentionally weighted down to keep it from sliding off your entertainment center. The size is also not a problem when it comes to hooking up cables, there is plenty of room for me to even move my large fingers around. The remote is also another impressive design having a real nice non-slip feel to it.After hooking up the Fire TV to my TV I was even more impressed. It was very easy to setup, taking only a few seconds to hookup to the Internet. Its Dual-band WiFi was another great feature, because I could hook it up to the lot less crowded 5 Ghz band and not have to worry with interference on the very over crowded 2.4 Ghz band that most WiFi hardware uses today. Another nice feature is that like when you order a Kindle, it comes all setup for your account so there was no additional setup needed to access my Amazon content.The interface look great and the speed of the quad-core processor makes sure it is fast and smooth, it is much faster than any other of the dedicated, streaming boxes on the market, the picture and audio are amazing and even the voice search works as they advertise. I did try a few games and they are okay, but it is no dedicated game console. I think the games will improve as more developers develop games targeted directly for the Fire TV.For most users I think the Amazon Fire TV is a fantastic product and really should be considered if you are looking for a streaming box, especially if you are a Prime Member and/or have a lot of Amazon Content. I also expect the parents are going to really love the fact that Amazon FreeTime is coming to the Fire TV next month. None of the other streaming boxes have anything like FreeTime, which not only lets you setup profiles for your kids, but includes unlimited access to content from Nickelodeon, Sesame Street, PBS Kids, and more.So if I think the Amazon Fire TV is such an incredible product, why did I give it only 3 stars. There are two reasons. The first is that while I can use the Fire TV to access most of my favorite sites and services there are a few I can't, including TWiT.TV and Aereo both of which I can access on my Roku. However, being that both TWiT and Aereo have Android Apps, I expect that they will be available on the Fire Tv in the near future.The other reasons is that Amazon has giving the Fire TV a non-standards compliant HDMI port and no way to turn off the unit. This is a problem for me and many others, because the HDMI port is always active preventing users from using the Fire TV with many TVs and HDMI Switches that have an auto select mode. To be fair, the Roku, ChromeCast, Apple TV, and some cable boxes also do this so if you have more than one non-standards compliant device it becomes a little battle between the devices for control of your TV.I am really hoping that Amazon will fix this problem with the HDMI by simply giving users the option to turn off the unit, or put it in a stand by mode that disables the HDMI port. If they do so, I will gladly change my rating to 5 stars. For now I am going to keep the unit, but most likely will use my Roku for most content.UPDATE: The Fire TV now has a TWiT.TV App so I have upgraded my review.", "verified": true, "helpfulness": "3/7", "author": "K. Torbeck"}, {"rating": 5.0, "review": "I'm really enjoying my Fire TV and having been tinkering with it for the last two days. I love being able to watch Youtube, AIV (Amazon Instant Video), Netflix, and Hulu all in one place. I find the interface very fast and intuitive. I definitely think it was worth the money and I'm very happy with my purchase. My significant other is already stealing the remote from me! :)Pros:+++ Ability to sideload apps with Android Debug Bridge (ADB) from another computer on the network. This is a huge feature, you don't have to wait for it to be available in the Amazon app store. I've already installed and tested Firefox, MX Player, Dropbox, emulators, Bittorrent, ES File Explorer, and even HBO GO.++ Supports external hardware through USB like mouse, keyboard, or XBox 360 controller. Keep in mind there is only one USB 2.0 port so you may need a USB hub if you plan on connecting many things.+ App store is growing very quickly. I noticed the games already doubled in size the very next day I used it. Since this runs Android, it won't be hard for developers to start officially offering their apps on it.+ Instant On (no on/off switch, sleeps after 30 minutes)+ Low power usage+ Free Sev Zero promotion and $10 credit with controller. Actually a really addicting game!+ Games are fun for a quick break and I found the graphics for some surprisingly good+ Sideloaded Android emulators SNesoid and Gensoid work very well to play classic consoles like SNES, Sega Genesis, and Playstation One. In settings, you need to bind the controller buttons and turn off the button overlay on the screen (meant for touch input).+ Plays MKV/AVI/MP4 videos without any problems using free MX Player + ARMv7+NEON Codec plugin+ Streams videos from my NAS with ES File Explorer+ Voice recognition is very accurate and fast. We ran a few ad-hock tests against Google Now and Fire TV was the hands down winner.+ TV overscan issues can be fixed in settings (if you find some of the screen cut-off)Cons:-- Can't attach external hard drive directly (at least without rooting)- Only 8GB flash memory- Sideloaded apps appear only in manage application settings- Controller costs extra (but you can use your own!)- Can't filter AIV by Prime (free) only- Search doesn't seem to work in other apps like Netflix, only AIV.Probably my only real annoyance is that it doesn't have very much memory and I can't add more to it, but then again this is meant as a pure streaming device. I don't think the average user will even realize how much space they are using. This combined with a Synology NAS is a pretty unbeatable combination for sharing, streaming, torrenting, and backing up all your data.", "verified": true, "helpfulness": "5/6", "author": "Kevin N."}, {"rating": 5.0, "review": "As a man that is visually impaired I like things straight forward and simple.  The set up was fast and even with the update I was up and going in less than 5 minutes.  The menu layout is good and the voice search worked fine for me.  The games availible without the remote are on the limited side...but I expexted that.  All in all not a bad start.  Looking forward to more Apps being Availible.  If you want simple setup a simple menu and don't feel the need for a bunch of features channels or apps s you will likely  never use like the Roku 3...buy a Fire TV!UpdateI was asked if there isany way to filter non Prim.e Content from regular movies/Tv.  As far as I can tell there is not.  This may bother some people that want to use the Fire TV just for Amazon Prime content.  As for Mr?  It did not bother me at all.", "verified": true, "helpfulness": "6/6", "author": "Jaydee"}, {"rating": 2.0, "review": "I was really hoping to love this device.  I'm deeply integrated into the Amazon ecosystem and use it as my primary source for music movies and games.  I have both a Fire and a Paperwhite and am typically an fanatic of all things Amazon.As a result, I have been using Amazon apps for my android phones, tablets, and gaming devices sometime.  For someone that already had access to Amazon movies on a Wii U and a PS4, this is extremely disappointing.  For people who have these tools, Amazon has given us little reason to spend the extra $100.  There were so many features that could have been included to enhance the experience and make me feel good about the spend, but weren't included like:-Where is my x-ray without using a Kindle?This is one of the things I was most looking forward to... to be able to press a single button and, without a second screen, be able to see actors and dive deeper into the film.  This is already offered on Kindles, why not Fire tv.  If someone asks about an actor, I have to go into the other room, grab a fire, boot it up, then I get the answer.  It should only take one button press.-So the voice search only works for finding amazon movies?For all the talk in the release presentation about how frustrating it is to type using a remote, I sure have to do that a lot when typing in account emails and passwords.  Also, it doesn't work in searching in netflix etc.  Again, how am I supposed to feel good about spending $100 when I get a similar experience on my consoles?-Why can't I filter out prime only in search results?I'm feeling cheap today.  I feel cheap most days.  Let me filter out the free movies in my search results.If you currently do not have a streaming box, this may be a good option if you are invested in the amazon ecosystem.  If you have a console or streaming box, pretty much all your getting is voice search for Amazon content and apps.I'm going to keep mine in hopes the above get addressed (I'd be willing to have a dedicated box that does the above and pay $100 for it).  I'll also modify the review if these are addressed in an update.Come on, you can do better...", "verified": true, "helpfulness": "12/16", "author": "DB"}, {"rating": 1.0, "review": "It would be nice if Amazon could just release their Prime Video app for Android instead of thinking that withholding it is somehow going to sway me to their limited factor devices. My Android TV sits on top of my TV instead of being yet another thing I have to figure out how to mount to the wall out of sight. I can control it from my phone instead of having yet another remote. My tablet is a fully functional tablet instead of a glorified e-reader. I'm not going to buy a Kindle Fire or Fire TV. I have an original Kindle, because it's *great* for reading books. Amazon should stick to what they're good at and stop trying to force me into a device I don't want just so I can use a service I'm already paying for.", "verified": false, "helpfulness": "8/61", "author": "DancingInTheRain"}, {"rating": 4.0, "review": "Reading other reviews you already know overall why this device is great.  Therefore, I am going to tell you how it stacks up to the roku 3.The same:Yes, it does Netflix, Amazon VOD, and Hulu out of the box almost. The interface is just as fast as Roku's, but feels a bit cleaner and more refined.Where FireTV is better:-Voice search is amazing and works very well, even better than Apple's Siri for iPhone.-While you have to purchase Plex it is well worth it and the Plex app for FireTV is light years ahead of the Roku version.-Hardware hands down is better and should mean this device will last much longer with software updates-Installing new apps is easy-Games are cool, can't wait to see more old school games in the game store.What is not so great:-Voice search is limited to Amazon content only, even when inside an app like Plex, voice search takes you out to the main menu and shows you results from Amazon.-Purchasing content does not seem to require a PIN number like on the roku. This makes it easy to buy stuff on accident.-Game controller not included ($39), roku remote acts as the controller.", "verified": true, "helpfulness": "8/9", "author": "PJH1987 \"PJacob\""}, {"rating": 5.0, "review": "Just i want to know if i can use outside United Stated, i want to send a gift to my cousin in Dominican Republic.", "verified": false, "helpfulness": "0/12", "author": "Eli Fung Cheung \"MasterPro\""}]