[{"rating": 5.0, "review": "Cut my cable bill in half. The voice control is really nice.", "verified": true, "helpfulness": "1/1", "author": "Barry L. Monaco"}, {"rating": 5.0, "review": "Excellent piece of equipment.  Intuitive set up and use.  A great addition to any video set up.  I highly recommend this to everyone.", "verified": false, "helpfulness": "1/1", "author": "Jiml"}, {"rating": 1.0, "review": "I took a Fire TV home last night to compare it to the Apple TV, and here are my impressions.Pros: Nice hardware from the outside, giving the possibilities to download a lot of music, video and gaming contents, with the open architecture.Cons: the apps are not as easy to navigate as on Apple TV, and they often require a monthly subscription.  Video quality is poor, far less than SD quality, and the sound is even poorer.  It seems that the content is delivered at a much much lower bandwidth, unless you pay for upgrades.  For instance, streaming music from Pandora is inaudible when compared to iTunes Radio.  It makes my clock radio easier on my ears.  Streaming from free channels like History, pbs, bloomberg really demonstrates how bad the video and audio quality is.I have read a few high-tech articles that made the point that the apple hardware is dated in comparison, but it is hard to believe now.  The Apple TV is more limited in content, but the quality is there, and the interface is nicer, easier to use.. Apple TV features also the easiest podcatcher.  The Fire tv box is built to sell apps and monthly subscriptions through Amazon.  A big disappointment.", "verified": false, "helpfulness": "5/7", "author": "ChrisR"}, {"rating": 5.0, "review": "I love my fire box.  The only hangup is free movies and movies for sale are categorized together.  I think they should be separated.", "verified": true, "helpfulness": "0/0", "author": "Kamysha"}, {"rating": 3.0, "review": "It doesn't hurt to own one.", "verified": true, "helpfulness": "1/2", "author": "C. AN"}, {"rating": 3.0, "review": "Its okbut thought we wouldbeable to access more free channels", "verified": true, "helpfulness": "1/1", "author": "Maria Harris"}, {"rating": 4.0, "review": "I am pleased with it. It would be better if the voice search worked on Apps other than Amazon, for example You-Tube.", "verified": true, "helpfulness": "2/2", "author": "T. French"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "John C. Ebersohl"}, {"rating": 5.0, "review": "This works great.  Easy to install and use.  Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "S13 \"SCole\""}, {"rating": 3.0, "review": "I was a little disappointed with the selection of choices for Prime TV and Movies.  There is not really a lot to choose from for children.  The Fire TV was very easy to install and is very easy to navigate.  I hope that Amazon adds more choices for Prime TV.", "verified": true, "helpfulness": "1/1", "author": "Deanna Pace"}]