[{"rating": 5.0, "review": "This is the best way to go for watching tv. Add on Amazon Prime, Netflix and Hulu+ and there is no other way to watch tv!", "verified": true, "helpfulness": "0/0", "author": "Vicki Noth \"Star Wars Fan!\""}, {"rating": 5.0, "review": "I used to have trouble downloading Amazon content as well as other services like Netflix and Hulu Plus with the smart apps installed in my TV. I learned from my cable technician that the installed smart apps have a slower processor. Since I have bought and installed the Amazon Fire box to my TV I haven't had those problems and it works pretty smoothly with little or no trouble. I highly recommend one of these, especially if you are like me and have a lot of instant streaming content to download with a Prime Account.", "verified": true, "helpfulness": "1/1", "author": "Keri Teach \"Seaviewkat\""}, {"rating": 5.0, "review": "got it as  gift...love it.", "verified": true, "helpfulness": "1/1", "author": "Francis J. Grana"}, {"rating": 5.0, "review": "Love the ease of use and the voice control search never lets us down..highly recommended!", "verified": true, "helpfulness": "0/0", "author": "kathy"}, {"rating": 5.0, "review": "Very easy to start using.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Brown"}, {"rating": 2.0, "review": "99.9% of the movies I have considered downloading are \"B\" movies or ones that I have already seen. Ones that are current, out in the last year can't be watched without renting or buying them. It's probably me but I cannot get my tv on the Internet. Went through the prompts online and it shows me being connected but I can't go any further. This $99 investment was a poor choice and so is Amazon Prime. Won't be renewing that either, after my 30 day trial expires. Would not recommend this product to anyone, even if it's free.", "verified": true, "helpfulness": "0/3", "author": "Leon E. Titler"}, {"rating": 4.0, "review": "Yes", "verified": true, "helpfulness": "0/1", "author": "Milayne Rodriguez"}, {"rating": 3.0, "review": "It works great but the instructions are quite limited.Vincent Ziiz", "verified": true, "helpfulness": "0/0", "author": "vincent"}, {"rating": 5.0, "review": "I love how this works.  So easy and quick.", "verified": true, "helpfulness": "0/0", "author": "Linda Gerber"}, {"rating": 5.0, "review": "One of my best purchases in years.  I am using the Fire TV to supplement and reduce my cable service and its so much nicer.  Its only been a week, and I have been able to find a ton of accessible content within my prime membership.  Lightning fast compare to video game connections.  The only bad news is that my 4 year old daughter seems to take it over with her shows...at least until 9 before i get control.", "verified": true, "helpfulness": "1/1", "author": "Matthew C Short"}]