[{"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "howard hiett"}, {"rating": 5.0, "review": "I at first was really regretting this purchase but after using it and exploring I really really like it. You are trained by the cable and dish companies to watch TV a certain way and this changes it a lot, I will probably get rid of my cable all together.", "verified": true, "helpfulness": "0/0", "author": "Debra"}, {"rating": 3.0, "review": "I was disappointed that there are so many movies/TV shows that we have to pay for and are not included with our Amazon prime!!", "verified": true, "helpfulness": "0/2", "author": "Babycheetah"}, {"rating": 5.0, "review": "this amazon fire tv is just absolutely marvelous.  i know that i effusive but it i true.  i have yet to discover the thousands of tv and movies but have found some of what i want...so i will keep on searching.  despite other reviews i have seen on here--i found the options on lefthand side of screen where i could choose what is available on prime tv.  i thought all rentals on prime tv were free and included but have discovered they are not....that was a disappointment for sure but my fault for not reading \"small\" print.  I did not catch that i could only access and display photos if using amazon fire tablets.  is this accurate?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I wish amazon prime was a bit more affordable, I think 75.00 a year is a better rate for the service.", "verified": true, "helpfulness": "0/1", "author": "Fiona Harris"}, {"rating": 4.0, "review": "One HUGE drawback as far as I'm concerned:  When you do a search and you choose \"All viewing options,\" it doesn't give you items that are free to watch on Netflix.  I guess because of the competition, but it is a little annoying.  I have to go to Netflix​ and then search for it that way.  Otherwise, it is pretty cool to just speak in what you're looking for.  Especially if the room is darker or you aren't wearing your glasses. :)", "verified": true, "helpfulness": "0/0", "author": "Pamela"}, {"rating": 5.0, "review": "Thumbs up", "verified": true, "helpfulness": "0/0", "author": "tonya"}, {"rating": 5.0, "review": "Excellent - easy to use and lots of content", "verified": true, "helpfulness": "0/0", "author": "D. Billings"}, {"rating": 5.0, "review": "Love this better than a Roku up until now Roku was the best but the Fire TV is the ultimate!!", "verified": true, "helpfulness": "0/0", "author": "Joshua Gould"}, {"rating": 4.0, "review": "Overall it's a good product. Thought it was a bit weird to have an intro video about how to use the product at first launch, but wasn't annoying. Only complaint is the iOS app doesn't allow pasting of passwords. And when you have 30 char long passwords that are random, it gets tiring.", "verified": true, "helpfulness": "0/0", "author": "Richard J Hancock"}]