[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "1/1", "author": "Katie Roberts"}, {"rating": 5.0, "review": "I have been looking for something that could replace cable and I think that I have found just what I was looking for. I have enjoyed the Amazon fire tv box so far and it was very easy to install and download apps on it. Thank you!", "verified": true, "helpfulness": "1/1", "author": "leah"}, {"rating": 5.0, "review": "Works great and far better than the 300 a month I was paying for cable.", "verified": true, "helpfulness": "1/1", "author": "lena81380"}, {"rating": 5.0, "review": "Very pleased with the fire tv easy to use and connect", "verified": true, "helpfulness": "1/1", "author": "fernando sanchez"}, {"rating": 5.0, "review": "Awesome system and it's very easy to use", "verified": true, "helpfulness": "1/1", "author": "ALBERTO PANTOJA"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "1/1", "author": "Tyler Yungmann"}, {"rating": 5.0, "review": "Great box. Exceeded my expectations.", "verified": true, "helpfulness": "1/1", "author": "Rajesh Bablani"}, {"rating": 5.0, "review": "I own an Apple TV that I got for Christmas in 2013, which I like, but was only able to stream my Amazon Prime shows through Air Play. I like Amaxon Fire TV because I can stream all my shows without using other devices...but the games are fun too.", "verified": true, "helpfulness": "1/1", "author": "jennifer Goldsbury"}, {"rating": 5.0, "review": "This was a great purchase at a fantastic price (on cyber Monday). I am pleased with the speed and variety of programming that Amazon has put on the box. The voice search capability is great and works well... far superior to spelling out a program or movie letter by letter. In an update, I'd like to see a grid of programs and not a line of click through options. The only programming I could recommend would be VuDu.  Overall, I am very pleased with this purchase and would recommend it.", "verified": true, "helpfulness": "1/1", "author": "Former Casio user"}, {"rating": 4.0, "review": "It does what it was meant to do and was very easy to attach. I did it myself and (I am an old lady)!", "verified": true, "helpfulness": "1/1", "author": "Donna L. Sumares \"LOST PANEL\""}]