[{"rating": 4.0, "review": "I really enjoy Amazon fire! We get to watch a lot of awesome TV without al the cost.However... I don't think much of the remote! The remote is nice with all its options but the sleek design makes it way to hard to hold on to! We've dropping it more often than I care to say. I now use the remote app on my phone so I can watch tv.", "verified": true, "helpfulness": "1/1", "author": "Howard"}, {"rating": 4.0, "review": "It's great. The remote is responsive and the box is very fast. There are a few down sides. There aren't very many games. Also I wish there was an option to search on the apps using the remote instead of typing everything in. But overall its definitely worth buying to leave in the living room.", "verified": true, "helpfulness": "0/0", "author": "LinhLam0502"}, {"rating": 5.0, "review": "Great product! I'm using it to replace the current cable tv subscription I have at a fraction of the price! Love it!", "verified": true, "helpfulness": "0/0", "author": "Jean Paul Mancillas"}, {"rating": 2.0, "review": "Need to go long way, user interface is not as simple as apple tv. Noticeable audio lag in bluetooth speakers. Very hard to navigate, and reach installed applications.", "verified": true, "helpfulness": "0/0", "author": "Shakul"}, {"rating": 5.0, "review": "Very cool and I'm very satisfied so far.", "verified": true, "helpfulness": "0/0", "author": "SIDNEY MARTINEZ"}, {"rating": 5.0, "review": "Amazing so easy to install and ise", "verified": true, "helpfulness": "0/0", "author": "Cavvy0326"}, {"rating": 4.0, "review": "Need to offer more TV programming, i.e. more stations. Otherwise, great service.", "verified": true, "helpfulness": "0/0", "author": "Deborah Richardson"}, {"rating": 4.0, "review": "Great product. Good value. Good quality. Not a fan of stick though", "verified": true, "helpfulness": "0/0", "author": "Paresh Gala"}, {"rating": 5.0, "review": "I have an Apple-TV I use primarily for Netflix. When I became an Amazon Prime Member, streaming Amazon from my I-Phone to the Apple-TV just didn’t make since. Every time we would get in the middle of a show, my phone would ring, the show would dump and my wife would have to sit and listen to me chat before we resumed the show. The Amazon Fire TV is the be all to end all in my house. It’s the best of both worlds, Netflix and Amazon uninterrupted. We Love it !", "verified": true, "helpfulness": "0/0", "author": "R. Tennant"}, {"rating": 5.0, "review": "Wow!!!!!. Amazon Prime and Netflix never worked fast or had a good User Interface on my smart TV or Blu-Ray players. This thing ROCKS, very fast and slick! Pluto TV is a must have! And buy the Game controller to play Fire android games on your big screen!", "verified": true, "helpfulness": "0/0", "author": "anonymous"}]