[{"rating": 5.0, "review": "great cord cutting enabler!", "verified": true, "helpfulness": "0/1", "author": "Pete"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "teresa tippett"}, {"rating": 5.0, "review": "Words cannot express my satisfaction with Amazon Prime TV. It's just amazing with all you can watch and not to forget the games you can play for free or purchase. For under $10.00 a month you have endless entertainment with movies, TV episodes, radio, and gaming. I love all the free apps and the screen savors. I was just so impressed. You cannot go wrong purchasing Amazon Prime TV. Now watching TV has completely changed. Thank you Amazon!!!", "verified": true, "helpfulness": "1/1", "author": "Rick L. Sims"}, {"rating": 5.0, "review": "I absolutely love my Fire TV. It is the easiest electronic device that I own. I wish that I would have purchased this sooner😀", "verified": true, "helpfulness": "0/0", "author": "Sally Francis"}, {"rating": 5.0, "review": "I own a number of streaming devices From Roku, Apple TV, Chromestick and now the Fire TV. I have to say, the Fire TV is super fast, and the interface is top notch.  Will definitely buy another.", "verified": true, "helpfulness": "0/0", "author": "John N."}, {"rating": 5.0, "review": "Love! So user-friendly & fast. Great interface....I use it even though I have a smart tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love fire tv", "verified": true, "helpfulness": "0/0", "author": "Ekjot dhillon"}, {"rating": 5.0, "review": "WORKS GREAT", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 5.0, "review": "AWESOME box. I bought this for my non-cable guest room flat screen. WOW!!!I agree with most of what [\"This box is a GAME CHANGER...April 3, 2014\" AND \"a REVIEW FROM A NON-TECHIE...April 7, 2014\"] posted except his \"Cons\". I do not have any Cons myself. I am completely satisfied. I'm even considering removing cable and just keeping internet connection with the introduction of \"Sling.\" I looked at a movie and was awed by the seamless streaming without interruption. After reading most of the 4 & 5 star reviews, there is nothing new to add other than another completely satisfied consumer.", "verified": true, "helpfulness": "0/0", "author": "C. H. \"careful consumer\""}, {"rating": 5.0, "review": "Being a big fan (user) of Amazon Prime, this is a must have for our non-smart TV's. I'd recommend this for anyone who enjoys movies, or the idea of playing catch up (on those cold, or other stay at home day) of any number of TV shows, series...and all without commercials.  You'll never hear the words -in your house again- that there's nothing to watch on TV.  We in fact reduced our cable bill by having Amazon Fire & Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "~L~ Par-Mer"}]