[{"rating": 2.0, "review": "I won't touch on a lot of things that have already been discussed... however, there's a couple of things that are driving me a little stir crazy.  First, what are coins?  And, what are there use?  Given that this should be an intuitive device, the fact that I'm asking shows that either I'm out of touch, or now where on the product description does it mentioned that you will constantly harassed about coin use, or buying more coins.  These coins feed into the \"GAMES\" -- which I didn't purchase it for this, my two sons picked up on it quickly -- and heck, the games were advertised as \"FREE\" -- so, I'd try.  Well, now I have to use these mythical coins and purchase more -- after the kids are sucked into the game.  Not cool  -- charge me a fair price, and give me access to the entire game -- don't misrepresent a game as free -- ESPECIALLY AS A KIDS GAME -- and then 20 seconds into the game, suck the parents into what could only be described as a ransom.  The \"despicable me\" game is especially despicable for these practice -- shame on the designer, and especially shame on Amazon allowing or profiting from this.While the bluetooth remote is okay -- why not add a receiver for those of us with system remotes such as the harmony.  Now the fire is the only product which needs its own remote, which gives me a reason to grind my teeth every time i see it.i do enjoy watching prime content -- but, honestly the things above really detract from the experience and at the margin make my other systems using Apple TV and Roku so much more transparent and honest when I know what i'm paying for the content that I'm consuming.", "verified": true, "helpfulness": "2/7", "author": "JF"}, {"rating": 5.0, "review": "Already have several other straining devices and love the Amazon content but most of all really like the speed of the system and media offerings. Expect that some of the user interface will change (improve), however, compared to Samsung and Wii this device is great!", "verified": true, "helpfulness": "1/1", "author": "Dpalais"}, {"rating": 5.0, "review": "Have it for 2 days now! Absolutely loving it. The prime videos/shows are great to watch, and without any buffering issues at all. Video quality is awesome. The best thing about this is the speed with which you can access the interface. This is a quad-core processor with very good RAM. Its very snappy and fast, that its unbelievable. Also have sideloaded XBMC onto this, and thats doing magnificiently well too. Can stream all my movies off my LAN to this one at 1080p (including ISO's too). This is a killer device. And they are adding voice search soon for other apps too (including Netflix). Not that I really need it, but it'd be cool.", "verified": true, "helpfulness": "2/2", "author": "S2Srini"}, {"rating": 3.0, "review": "This is a glorified rabbitTV. I thought I would be able to watch some shows without having to pay extra, then I had to buy Prime and Netflix to get anything. I could just connect my computer up to the TV and do the same thing, with a little less convenience. I would like to see Fire TV offer on-demand TV without my having to buy cable. For example, I would like to see ESPN, or the PAC12 network and just pay a small subscription fee, instead of buying cable. If I had cable I wouldn't have purchased Fire TV.", "verified": true, "helpfulness": "2/5", "author": "William Fairbanks"}, {"rating": 5.0, "review": "The Amazon Fire TV was extremely easy to set up.  Even with a software upgrade it took less than 15 minutes.  The voice search works really well and it has a lot of content.One feature that was a surprise is the screen saver.  The photographs are stunning - we're planning to leave the screen saver running on the TV when we have company!", "verified": true, "helpfulness": "0/0", "author": "Golf Chick"}, {"rating": 3.0, "review": "UPDATE TO THIS REVIEW:After the review below, I contacted Amazon. Apparently, they are releasing an update this spring that will allow you to search Prime content by genre and a couple of other ways to search Prime. So, I'm still on the fence.Original review below:I bought the Fire TV in order to watch content that I already pay for as an Amazon Prime member. It SUCKS for that purpose. There is no way to separate Prime searches from searches of on demand paid content. So you have to sort through about 25 pay option for every little nugget of Prime. I'll quote one of the other reviews:\"I only have one gripe. As far as I can tell, there's no way to limit the list of movies and tv shows to what is available for Amazon Prime members. This makes it very inconvenient to find things that are free to watch. There are some categories that are limited to Prime (Most Popular on Prime, For Kids on Prime) I want to be able to just see what's available for Prime or at least be able to see by category what's available for Prime. I'm sure this isn't an oversight. I suspect Amazon wants to force us to look at everything and be tempted to buy/rent things but if they really want to compete with Netflix, they'll understand that we pay for our Prime membership to be able to watch free movies conveniently. A workaround is to do your searching on the web and then search specifically on the device.\"", "verified": true, "helpfulness": "11/18", "author": "Adam Saunders \"adam2112\""}, {"rating": 3.0, "review": "Was not impressed with the picture quality of both movies and TV selections.  Was disappointed in the fact that there was a separate subscription price attached for the movies and TV shows even though I am a Prime member (and that Amazon does not disclose these prices prior to purchasing) ... thought Prime would have given me a bigger bang for my buck.  Decided to return it ... for me, not all that it's cracked up to be.  Also, the install took a half hour!  When I plugged it in, a screen informed me that it needed to download the newest software ... wouldn't you think it would come that way?  My HD cable signal also was screwed up and didn't come back until I disconnected the HD Fire.", "verified": true, "helpfulness": "1/3", "author": "Andrea J. Quinn"}, {"rating": 1.0, "review": "I'm a LONG TIME Amazon customer and I buy thousands of dollars from Amazon each year AND I'm very tech \"savvy\" - but I refuse to spend much time tweaking a \"plug and play\" item and that is what I would have had to do with Fire TV.  My intent was to have Fire TV replace a ROKU3 that I've had since the \"3s\" came out (I'm a many-year user of ROKU).  The thought was to integrate all my Amazon electronics and the Fire TV would have been a part of that.What's wrong?  Well, the Fire TV was not recognized by my Sammy HDTV either direct (via HDMI) or through my Yamaha receiver to the Sammy (via HDMI).  I tried several connections and after one-half hour I put the Fire TV back in its box and it will be on its way back to Amazon on Monday morning.Sad, really, because I did want this to work.  I'll probably re-order in a couple of years after the kinks are worked out.  :-(", "verified": true, "helpfulness": "6/13", "author": "OGauge"}, {"rating": 5.0, "review": "I am not high tech... the Fire Tv is so easy to use and works better than the folks at Amazon have advertised.  I am a Prime user and right out of the box, which is very nice, it had my Prime membership loaded ... nothing to do but hook it up and watch a movie.  The only gadgets I have ever had that were easier to use was a Kodak Brownie camera and a rotary dial phone. As I said, I am not high tech.", "verified": true, "helpfulness": "1/1", "author": "PaulAre2"}, {"rating": 4.0, "review": "It is really good! Hardware specs are great! Software... It has a limitation, I realized that you will be able to use it and download apps only if you belong to USA or Canada (for example, in America), but if your AMAZON Account said that you live in a different country, it simply doesn't let you to download apps... So I had to change my account settings and it's working now... This is kind of frustrating, but I think at least it works.I tried to use the NYKO PlayPad PRO for Android (not the one that said it is special for the Fire TV)  and it works good. The D-day and the Left Trigger (the big one, not the small one) does not work... I played Dead Trigger 2 (I love that game), and I found that.I also connect the Logitech Keyboard K400 and it simply works excellent without problems.So far with the Country change I did in my AMAZON Account, it is working good. Hope there is an Update that can remove this \"Regional Lock\".Thank you!", "verified": true, "helpfulness": "1/1", "author": "Simelemon Tolomeo"}]