[{"rating": 5.0, "review": "Excellent!!! Will be ordering additional boxes.", "verified": true, "helpfulness": "0/0", "author": "Shawn Gray"}, {"rating": 5.0, "review": "I have had about twenty four hours with this and I love it. I also have the Roku 3. Here are some quick thoughts. Hardware wise this thing walks all over the Roku. The Roku for now isn't even a close second. You can debate the interface if you want but you can't say the Fire has a bad one.  If your an Amazon person which my family is (multiple kindles) it's a no brainer. My eleven year old is rocking out to prime music she downloaded to her kindle with a friend in the next room. Huge smile on my face and hers when we hooked up the fire tv and everything was already synched. The one caveat is time will tell how the software really performs. I'll get back on that one. I will say though, as many other Roku owners will second, If your not unplugging and plugging back in once a day your not using it. Hopefully I will not have to reset the Fire all the time as well.", "verified": true, "helpfulness": "0/0", "author": "Dmac"}, {"rating": 4.0, "review": "The technology is great and I use it to stream Netflix. However, the claims about how many movies you have access to are a little dubious, unless you think being able to buy it for $34.95 is \"access.\"", "verified": true, "helpfulness": "0/0", "author": "Rick Durrett"}, {"rating": 5.0, "review": "Offers more than HBO and the service is free to Prime Amazon users.  Great apps, works sweal with 5G wireless networks.  The voice search only works for Fire offerings and not on other apps live Pilot TV, but it really works great, has not misunderstood me once.", "verified": true, "helpfulness": "0/0", "author": "Samuel Langhorne"}, {"rating": 5.0, "review": "Amazon has always been a big favorite for me. I trust them. so when they released the Amazon Fire TV, it was a no brainer to give it a go. having Prime and Netflix, I now find myself wondering why other than for sports I even have DTV.This device is perfect. it is easy to start up, even someone with zero knowledge of new technology could figure it out. its fast, it has never skipped for me. my only complaint is that if you are to input and do something else and leave it on a specific screen, it can start to overheat a bit where you feel the heat coming off the device. but the key there is just to not leave your netflix open and to make sure to go to the home screen. it turns itself off, you can put it to sleep, but I have found it best to let it make that choice itself.you have the option of a direct plug in, or WiFi, which is great. you even have easy access to amazon's well priced movie library, I purchased a movie, and now have that movie(was 4.99) forever linked to my account and can pull it up on my Amazon Fire or any Amazon device immediately. that isn't even getting into the quality of the games that I have yet to really play very much. they also just got HBO GO as an APP, and so I now have ALL of HBO's library on my Fire TV...that is just awesome, and I hope they can get showtime and starz soon enough.I not only recommend this device, I think if you lack one of these type of devices, you are really missing out. they did this right.", "verified": true, "helpfulness": "0/0", "author": "sosotwain"}, {"rating": 5.0, "review": "Easy to set up, lots of cool things that you can do with it, the picture is outstanding", "verified": true, "helpfulness": "0/0", "author": "Toby"}, {"rating": 5.0, "review": "Appears to be working as advertised. No complaints so far...THUS 5 POINTS.", "verified": true, "helpfulness": "0/0", "author": "Madro Bandaries"}, {"rating": 5.0, "review": "Very happy so far with this purchase. Easy set up, almost self explanatory , quick delivery. Was able to disconnect one cable box in the house. Hubby is very happy with price and streaming, this is our first. Picture is clear, sound is great and all my registration was done because I have been a Prime member for a year on my kindle. All my things on kindle now I can watch on my TV. I luv Amazon Prime. Shopping was a true pleasure this year.", "verified": true, "helpfulness": "0/0", "author": "racheth57"}, {"rating": 1.0, "review": "Streaming youtube videos from the Kindle Fire Hdx to Fire TV is no longer supported according to Amazon technical support.  I bought the Fire TV a year ago and at that time could stream youtube apps to Fire TV with no problem.  Now when I try to pair the Fire HDX tablet with Fire TV I get a \"webpage unavailable\" error.  I spent 45 minutes with customer support before I was told that Fire TV now only supports streaming from Amazon Instant Video.  Very disappointed with this product now.  I used to recommend this to others but no more.", "verified": true, "helpfulness": "2/6", "author": "Hugh Wilson"}, {"rating": 1.0, "review": "I got this as a gift cause I stay in hotels 5 or 6 nights a week, if their internet requires you to sign in as a guest thru a browser you can't so its basically useless since that's how most hotels are.", "verified": false, "helpfulness": "2/8", "author": "Sean Mcintyre"}]