[{"rating": 4.0, "review": "No auxilliary inputs or outputs keeps it from being 5 Star.  It does, however, have a digital audio output, but only ONE HDMI output.  I am still trying to figure out if I can watch Youtube videos directly on it.  I have almost entirely quit using my cable HD box in favor of this device.", "verified": true, "helpfulness": "0/0", "author": "Roel Cantu"}, {"rating": 4.0, "review": "Great little device!  Intuitive interface and flawless performance except I still hate the point and click for search entries.  The voice search helps and is a great improvement over others I have used, but it still is far short of perfect.  My wife's native language is Mandarin Chinese and she speaks with an accent.  Some of her results for voice searches have been hilarious!", "verified": true, "helpfulness": "0/0", "author": "J. Goins"}, {"rating": 5.0, "review": "Worked right out to the box within 5 minutes of starting the hook up process.  so far we are very satisfied!", "verified": true, "helpfulness": "0/0", "author": "BPM"}, {"rating": 4.0, "review": "Did I use it? No I liked all the features and my kids did use it more than I did but because you had to buy an Amazon Prime membership for 99.00 A year it was just one more bill so no I think its a waste of money.", "verified": true, "helpfulness": "0/0", "author": "DIANA LEONE"}, {"rating": 4.0, "review": "I love this but it needs to come WITH the HDMI cord. That should not be something you have to go out and buy especially at this cost", "verified": true, "helpfulness": "0/0", "author": "Patience Wilks"}, {"rating": 5.0, "review": "The voice recognition is excellent - it saves a lot of time trying to navigate with arrows on a remote. the instant streaming works great as well. I have Prime membership which means there is a LOT of stuff to watch for free. look for the Prime logo - even when there is a 'rental' and 'buy' price, if you go to 'watch now' it shouldn't charge you, it's only the 2-day rentals or full-on purchase (so you can watch offline) that costs you. the box is SUPER TINY - like maybe a CD jewel box or two stacked? possibly smaller. who has jewel boxes anymore? the remote is also maybe 4-5\" long and tiny. if you have a lot of components you know how valuable this is.", "verified": true, "helpfulness": "0/0", "author": "AJ in DC \"aj\""}, {"rating": 4.0, "review": "I have been thinking about getting a device like this for about 3 months and when amazon came out with this product I was very excited but worried that if I cancelled cable I would regret it.  I got the offer to try it for free for 30 days and after a week I cancelled cable and wouldn't look back.  I love the games, apps and movies I have total access to.The only down fall that I have experienced is that the batteries in the remote die quickly.  I only get about 3 weeks out of a set of batteries.", "verified": true, "helpfulness": "1/1", "author": "Bobbi-Jo Wathen"}, {"rating": 4.0, "review": "Overall it's a great product however what made me decide on the Roku 3 over this box is the fact that you must be part of the Amazon eco-system to fully appreciate it.Also, it did not have the ability to search across all channels (like the Roku and was missing some other channels that I personally am interested in like RedBox Instant, etc.Other than that I have no other pressing issue with the box.", "verified": true, "helpfulness": "0/0", "author": "ABTEK"}, {"rating": 1.0, "review": "To be honest, The ROKU player is much easier to use than the Amazon Fire TV.  It is easier to set-up channels.", "verified": true, "helpfulness": "5/6", "author": "Byrd"}, {"rating": 5.0, "review": "I wanted to get away from cable -- so I bought the Fire TV.  Everything it promises is true--it could not be easier to set up, you can access anything you are subscribed to with the push of a button or two, and it has voice control for Prime.I am happy with my purchase and glad I have this.  There is a bit of clumsiness when trying to choose something to watch as I do not want to pay for episodes--but it is nice to have the library if I purchase movies.Looking forward to improvements in free selection viewing, and I am sure as time goes by Fire TV will offer even more great options!  HIghly recommended if you want to stream instead of using Cable.", "verified": true, "helpfulness": "0/0", "author": "Lexxuz"}]