[{"rating": 5.0, "review": "For starters: the Fire TV puts my Roku to shame.", "verified": true, "helpfulness": "1/2", "author": "Talky Tina \"Talky Tina\""}, {"rating": 5.0, "review": "I used to use my laptop to stream Amazon Prime and Netflix on my TV  using an hdmi cord.  I switched to the firebox and the steaming quality is much better and less buffering time than using my laptop.I have only had it for a few weeks but so far it works great. Can easily listen to Prime Music, watch Prime tv and movies, and use the Netflix app. The remote also works well and the voice commands work well in Amazon, I have not had a chance to try them in the Netflix app yet.", "verified": true, "helpfulness": "0/1", "author": "Sean Sweeney"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/1", "author": "Maren Bigelow"}, {"rating": 5.0, "review": "exactly as I needed and expected it to be", "verified": true, "helpfulness": "0/1", "author": "jeanette utley"}, {"rating": 1.0, "review": "It doesn't properly connect to the TV Input. I've called numerous times with very little help from Cuatomer Service who seem clueless how to correct this issue.", "verified": true, "helpfulness": "0/3", "author": "John R."}, {"rating": 3.0, "review": "Amazon need Spanish language option in the menu and more prime Spanish and Latin movie, TV and music.", "verified": true, "helpfulness": "0/1", "author": "Kenya Hardrick"}, {"rating": 4.0, "review": "Only thing that I do not like about Fire Tv are the following1 can not download amazon prime rented or owned video content to view offline if your internet high speed is not fast enough come on amazon you allow fire phone and fire tablet!2 no hd audio passthrough for dtsma or dolby truehd3 no built in ir for use of possible home theater univeral remote have to have at least 2 remotes", "verified": true, "helpfulness": "0/1", "author": "Jeffery W Peters"}, {"rating": 5.0, "review": "Very fast compared to other streaming boxes I've used.  Really like the non-line of sight remote as my dog likes to block me which I'm using most remotes.", "verified": true, "helpfulness": "0/1", "author": "sbga"}, {"rating": 5.0, "review": "Amazon, you've done it again !!! I continue to be impressed and pleased with the company and products. From the packaging, and the great price that I purchased this at, I couldn't be happier. I feel confident in knowing \"if\" I were to have an issue, Amazon would be right there to help me out every step of the way. I know over time, updates and add-ons of channels & features will be added, so the Fire TV will just continue to grow with me. I mean, look how many years the Apple TV has had updates and improvements ! Amazon, you rock ! I'm very happy to consider myself a loyal customer with the company !", "verified": true, "helpfulness": "0/1", "author": "MJ"}, {"rating": 5.0, "review": "This is really the perfect way for my family to watch tv. It was already synced to out account so set up was super easy. Well worth the money.", "verified": true, "helpfulness": "0/1", "author": "Just Me"}]