[{"rating": 5.0, "review": "My cable is HISTORY!!! This little gadget is completely worth every penny!  TV, movies, music and games! I'll never be bored again! And it was sooooo easy to set up. Very user friendly. You can even put it to sleep when you're not using it - that will save on energy too! I just can't say enough good things about Amazon Fire TV!!! I LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Constance"}, {"rating": 1.0, "review": "This product has not worked correctly yet.  Now I cannot seem to start the box without unplugging and replugging each time I attempt to use.  When I do this the only thing that happens is that the white button comes on.  The remote does not work!  Total ripoff.  I am sending back.  Very disappointed.", "verified": true, "helpfulness": "1/2", "author": "Rosemarie Hughes-Smith"}, {"rating": 3.0, "review": "There are too many movies for rent (especially older movies).", "verified": true, "helpfulness": "0/0", "author": "Vicki"}, {"rating": 5.0, "review": "Love my Amazon Fire.  We've watched multiple movies and only had issue with one movie that froze about 3 times while it loaded, only lasted 5-10 seconds so no big deal, most likely my internet connection.  Love the voice search!!!  I do wish there was a way to restrict the voice search to Amazon Prime movies only.  Right now when I speak an actor's name, it pulls all available formats of that movie, including those that cost money.", "verified": true, "helpfulness": "0/0", "author": "crystal lynn purser"}, {"rating": 5.0, "review": "Great product. Wish I had faster internet", "verified": true, "helpfulness": "0/0", "author": "Warren"}, {"rating": 5.0, "review": "I got this for my husband for Christmas and so far we really like it a lot! We have most of our music and movies through Amazon so it's been great to have everything in one place. The only thing I don't like about it is that we can't get GooglePlay and the Disney Movie App, so we can't watch the digital copies of our Disney movies. But that really just means we have to get up and put a DVD in the player!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this product, would recommend to anyone :)", "verified": true, "helpfulness": "0/0", "author": "RSC"}, {"rating": 1.0, "review": "the way that the Amazon for wyg is advertised is completely bull. you cannot access nearly anything even being an Amazon prime member. these thousand of tv shows and movies cannot be accessed. bottom line... I was not happy.. returning it", "verified": false, "helpfulness": "0/2", "author": "Angelica"}, {"rating": 1.0, "review": "To be fair, I might've received a dud, but I had some serious issues when simply scrolling through the various categories/movies/shows/anything. It would lock up for ten seconds, start scrolling again, lock up, scroll again, etc. I unplugged/plugged it back in, updated the remote firmware -- nothing improved the performance. So I returned it and went back to Apple TV.", "verified": true, "helpfulness": "0/2", "author": "Aaronneous21"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]