[{"rating": 5.0, "review": "I'm an avid Apple fan and have had two generations of Apple TV for some time now.  Last night was my first experience with my new Amazon Fire TV.  I was skeptical when I first received and turned it on, but pleasantly surprised.  It's so much faster than my Apple TV.  I use Netflix and Hulu Plus on Apple TV and they run so much quicker and smoother on the Fire TV.  Plus with Prime Instant Video, I get so much more content (and yeah, there are some duplicates between it and Netflix but all the other benefits of Prime make it worth it even without the video).  I hesitated at first in buying the device because of some of the reviews about browsing Prime Instant Videos, but I noticed that Amazon posted a firmware update to resolve that and it won me over.  So far, no complaints from me.  This is a solid piece of equipment, it's fast, it's loaded with good stuff and if you want to zone out and play some games - it has that too.", "verified": true, "helpfulness": "3/3", "author": "Adrien Montpellier"}, {"rating": 5.0, "review": "This is a great product.  I am a Prime customer and Prime really lets this unit shine>  Thanks Amazon!!", "verified": true, "helpfulness": "0/1", "author": "James F. DeWulf"}, {"rating": 3.0, "review": "I am still not to sure how I feel about this. I will say that I am starting to warm-up to it.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 1.0, "review": "If I could give Fire TV a less than 1 star I would.  BUYER BEWARE!!!  Here's the nightmare Fire TV has caused:The Fire TV box was delivered on August 6, 2014.  I set it up and less than a week later it destroyed all three HDMI ports on my 42\" Magnavox 1080p HDTV.  Now my PC will not connect on any of the HDMI ports - PC was on HDMI 2 for nearly 2-years, and it worked perfectly.  Now Fire TV will not connect on any of the HDMI ports.  I have tried 6-different HDMI cables from PC and Fire TV to TV, but no luck.  I have set TV back to factory default; no luck, the HDMI ports no longer work.  During the less-than-a-week Fire TV worked, I watched a bunch of B-movies from Prime TV with my 30-day free Prime membership.  Decided Prime Membership was not worth it - shipping is usually free with a $35 purchase and I buy a lot of stuff from amazon.com.  Besides, I am a very busy person so 2-day shipping isn't worth the $99-Prime Membership.  Amazon's Asian Indian Customer Service / Technical Support had no resolution to Fire TV destroying the HDMI ports on my 42\" 1080p HDTV.  Their lame answer was they can send me a return authorization for the Fire TV box, and cancel the automatic renewal of the free Prime Membership.  Bottom Line - Fire TV is a killer - it killed the HDMI ports on my TV.  I am an IT Professional with 35-years experience with mainframes, mini-computers, micro-computers, cellular devices, and every major network protocol, network hardware, and network software.  I am the IT Manager for a major city's Police Department.  I know computers!  Fire TV is a piece of @#$% and my opinion of Amazon.com has gone from \"Good\" to, \"they are a piece of @#$%\"Here's part of the chat I had with the Asian Indians that Jeff Bezos has hired as Amazon's Customer Support / Technical Support Team:You are now connected to Sireesha from Amazon.comMe:Fire TV has destoyed my TV's HDMI capabilities. Fire TV box set on HDMI port 1, PC set on HDMI port 2. PC on HDMI port 2 worked fine for nearly 2-years. Fire TV on HDMI port worked fine for a couple of days, but I noticed after installed Fire TV on HDMI port 1 that whenever I would select HDMI port 2 to go to my PC, the TV would go to HDMI 2 but then jump to HDMI 1; I had to select HDMI 2 a second time. Didn't watch Fire TV for a few days because I was busy watching DVDs I purchased from Amazon, but last night (August 13, 2014), I could not get my PC to come up on HDMI 2 (tried a different HDMI cable with no luck), then I tried accessing Fire TV on HDMI port 1 and it came on after a long while but then would not stay on but jumped back and forth between Home screen and a white screen filled with static. I unplugged the power supply from Fire TV (there is no on/off button), and waited 20-seconds and plugged the power back in, but still it jumped from Home screen to white static screen. I unplugged everything, shut TV down, tried again and again - no luck!Sireesha:A member of our Instant Video team will be the perfect person to help you with this. Let me connect you to a member of our Instant Video team. It will only take a moment.A Customer Service Associate will be with you in a moment.You are now connected to Manish from Amazon.comManish:Hello Patricia , my name is Manish. I'll be happy to help you.Let me connect you to a member of our fire tv team. It will only take a moment.A Customer Service Associate will be with you in a moment.You are now connected to Jeevitha from Amazon.comMe:I see not all of my message got to you. I am an IT Professional, I have 35-years of mainframe, mini, micro-computer experience. None of the HDMI ports now work on my 42\" Magnavox flat panel 1080p LCD TV - I have tried everything humanly possible but all of the HDMI ports no longer work - a few days after installing Fire TV.Jeevitha:Hello, my name is Jeevitha. I'll be happy to help you today.Me:Fix the problem or send me a new 42\" TV that will work with this trashy Fire TV.Jeevitha:I'm sorry to hear about the trouble with Fire TV. Could you hold for a minute or two while I look in to this for you?Me:No on/off button on the stupid Fire TV box so one has to unplug the @#$%^ piece of @#$%! Now none of my TV's HDMI ports work. I have 4-HDTV flat panel 1080p TVs but will not plug Fire TV into any other TV because I don't want the HDMI ports to be destroyed like Fire TV did to my 42\" Magnavox.Jeevitha:I'm really sorry to hear about the trouble you have faced on your TV.Jeevitha:I would request you to contact manufacturer regarding TV and let us with further details so that we can investigate about the issue that has caused. Meanwhile you can return FireTV device to us for the refund.Me:No, I am not going to contact the TV manufacturer. Fire TV destroyed the HDMI ports on the TV. Send me a new TV, NOW.Jeevitha:I'm sorry; we're unable to send TV, however, I can help you with the return of Fire TV for refund.", "verified": true, "helpfulness": "7/28", "author": "Patricia E. MacKenzie"}, {"rating": 5.0, "review": "This is the kind of device I've been waiting for my outdoor TV. I play Amazon inside the house through my PS3 and PS4...but I needed a compact WIFI device to go behind my outdoor TV. One of the cool features I love is that if the TV is on a different output and I hit the home button on the Fire remote, the TV automatically changes to the input carrying the Fire TV. I did not have to program anything.", "verified": true, "helpfulness": "0/0", "author": "J. Cossio"}, {"rating": 3.0, "review": "I bought this to use on the TV in my home office, we already have a Roku 3 and I wanted to see how the Amazon Fire TV compared. On the positive side, the Fire TV remote control is much sturdier and better designed than the remote that comes with the Roku 3. The Fire TV itself is a nice solid piece of hardware, and since I have Prime it also came configured to access my amazon account. On the negative side, unless you primarily stream from amazon, the Fire TV interface is difficult to navigate and doesn't allow the user to organize installed streaming apps to suit individual taste. I will probably sell the Fire TV and buy another Roku 3.", "verified": true, "helpfulness": "1/1", "author": "J. Wilson"}, {"rating": 5.0, "review": "Why did we wait so long. Easy to set up & easy to use.", "verified": true, "helpfulness": "0/0", "author": "Robert Fullmer"}, {"rating": 5.0, "review": "With the exception of app selection, this device is far and away the best on the market. It is fast, so easy to use, and seamlessly integrates will all other Amazon products (Fire Tablets and Fire Phone). And with the addition of so much free content with Prime (including HBO 2+ years old, which no other product offers), this device is hard to beat.", "verified": true, "helpfulness": "0/0", "author": "Jared"}, {"rating": 3.0, "review": "I may edit this later if their app store gets updated, but right now it is only so-and-so. I can pretty much use it for an Amazon Prime and Netflix streaming device, which is what I could already do with my PS4. I bought this device for two reasons. Showtime Anytime and HBO Go. Well Showtime Anytime doesn't support my cable provider, and HBO Go is not available yet, despite being available on the Kindle Fire HDX.It's great if you have children as the Watch Disney apps have some great entertainment. Hopefully more apps become available in the future.", "verified": true, "helpfulness": "0/0", "author": "mabwriter"}, {"rating": 5.0, "review": "This device exceeded my expectations.  I have recommended it to several friends.", "verified": true, "helpfulness": "0/0", "author": "Robert Havens"}]