[{"rating": 5.0, "review": "The Amazon Fire TV along with our Prime membership works great for us.  Sling TV LLC runs goods, but the Watch ESPN app works even better!", "verified": true, "helpfulness": "0/0", "author": "Chad Bonczkowski"}, {"rating": 5.0, "review": "It was easy to set up, after I made a quick trip to buy a needed HDMI cable.  I did not notice that it was not included when I ordered the Fire TV.  Netflix works well with much better picture quality than my old TV and Wii box.  We watched two episodes of House of Cards last night with great picture, sound plus captions.", "verified": true, "helpfulness": "0/0", "author": "Sarah K.Kelley"}, {"rating": 5.0, "review": "I wasn't going to buy the Fire TV as I already have a Roku 3 and am happy with it, but then I saw the deal with SlingTV and handed over the money. I'm surprised at how much I like this device. Boot time is fast, the UI is clean, simple, and easy to use, and the voice search is fabulous. The remote control works great.What I don't like is that sometimes a second or so after a video starts the screen goes blank but I can still hear the audio. I am using an HDMI monitor I normally use with my PC (no TV in the house), and I don't know if it's the cable or the Fire TV device that causes the blank screen. I know I never have the problem when the monitor is connected to the pc, so I don't think it's the monitor.  The only way I've found to fix it is to reboot the Fire TV.  Usually this happens no more than once per active session.Overall I'm happy with the device and am finding I watch more Prime content with the Fire TV than I was via web browser.", "verified": true, "helpfulness": "1/1", "author": "Horror movie buff"}, {"rating": 5.0, "review": "I have 2 at home and yes it went beyond its expectations.  (Wink, wink).  I replaced my Apple TV with it...", "verified": true, "helpfulness": "0/0", "author": "Biotchy"}, {"rating": 2.0, "review": "It is an amazing device, however even with Amazon Prime you get nickled and dime to to death have to always purchase a product to view.", "verified": true, "helpfulness": "0/1", "author": "Douglas M Pratt"}, {"rating": 5.0, "review": "I love this.  I keep discovering new features.", "verified": true, "helpfulness": "0/0", "author": "Linda Sturgill"}, {"rating": 4.0, "review": "Love the device - fast and sleek. Would like a means to restart the device from remote somewhere in the system settings or an app to do so. Searched the help/support to submit feature requests but could not find it, hence in the 'review'.Update:Tip from Amazon.com: You can also restart your Amazon Fire TV with your Amazon Fire TV Voice Remote or Amazon Fire TV Remote. Press and hold the Select button and the Play button at the same time until the Amazon Fire TV restarts (about five seconds).", "verified": true, "helpfulness": "0/0", "author": "SM in IL"}, {"rating": 4.0, "review": "I have no complaints overall, except one thing. This one thing only appears with the Amazon produced shows, \"Bosch\", \"Transparent\", etc...... there are certain black levels that Fire TV doesn't seem to handle very well, the result is a blue sparkle around edges of blacks. I watched some Netflix programming through Fire TV and didn't this, neither have I seen it watching movies through the Fire TV portal. Can any techies at Amazon explain why????", "verified": true, "helpfulness": "0/0", "author": "John Griffin"}, {"rating": 5.0, "review": "Love it. Love it, love it, love it. Love it. Love it. Love it, love it, love it. Love it.  Love it. Love it, love it, love it. Love it.  Love it. Love it, love it, love it. Love it.  Love it. Love it, love it, love it. Love it.", "verified": true, "helpfulness": "0/0", "author": "drdoug3"}, {"rating": 4.0, "review": "It works as advertised. Easy to hook up & use. Voice search is nice. Only reason it is not 5 star rating is because most the movies we would like to watch are not \"amazon prime\" movies...", "verified": true, "helpfulness": "0/0", "author": "Roy G"}]