[{"rating": 5.0, "review": "Can't live without it I use it everyday so many streaming apps Amazon video of course but also Netflix, Redbull tv, Revisions, Crackle, Hulu+ ect and with 2 gigs of ram and and a wifi connection which is amazingly working 2 floors up without buffering. Plus games for the kids and even a kid/parent friendly section you just can't beat this streamer and I've used Roku, Apple tv and Google tv and even had a pc hooked to my tv. If you decide to sideload xbmc app (walkthru on YouTube) this thing is unstoppable and definitely a cable killer", "verified": true, "helpfulness": "0/0", "author": "Jerry T."}, {"rating": 4.0, "review": "The Fire TV was my second try after first purchasing the Apple TV which is the worst device I have ever owned.For the apps available on the Fire TV they work flawlessly. This is important to note because the same cannot be said of its primary competitor devices.Watching movies and TV shows works great on the Fire TV especially if your watching on amazon because you can use your Fire Tablet to see information about the movie your watching.Amazon has cloud storage where you can save pictures. You can use a slideshow of those pictures as your screen saver. It's pretty cool and better when combined with music.I didn't give it a 5 star rating for two reasons. Amazon's app store is fairly limited this is probably due to it being a new device. Secondly because it doesn't pair with the fire tablet other than during amazon instant video. I really expected to see more compatibility.", "verified": true, "helpfulness": "0/1", "author": "Duffy"}, {"rating": 5.0, "review": "I absolutely love th. Now, I do have all the other streaming devices out there. This one and the roku 3 are by fart the best.", "verified": true, "helpfulness": "0/0", "author": "Randall Warren"}, {"rating": 4.0, "review": "Thanks.", "verified": true, "helpfulness": "0/1", "author": "Bao Nguyen"}, {"rating": 5.0, "review": "Tried this on a whim and boy am I glad I did! It's super user friendly and do easy to use! I'm discovering new perks and surprises with it every time I use it! The voice search is awesome!", "verified": true, "helpfulness": "0/0", "author": "BettyBoop"}, {"rating": 2.0, "review": "This is just an initial review, let's see if Amazon will publish it. If not, I will put it elsewhere and condemn them for censorship of criticism.If, like me, you researched getting Fire TV from your Kindle Fire HDX, you will be disappointed in the apps that you can use. I wanted to replace my cable with  Fire TV but I ran into some stumbling blocks. I found apps for many networks that offered full free content on my Kindle Fire HDX but when I tried to find them for my FireTV they were not available. Funny thing is, Amazon was only too happy to offer to sell me last season's episode for 2 to 3 dollars a piece or nine dollars for a whole season.I couldn't even find current episodes of the shows I like. For example, I am a fan of NCIS. On the Fire HDX, there is an app available for CBS which offers full free episodes of all their current shows but on the FireTV, this app is not available. It's the same for many other networks.  FireTV doesn't support a lot of the apps the Kindle fire HDX does and it doesn't even support casting from your Kindle to your FireTVPrime for TV sucks so bad. The interface is god awful and there are no current episodes of anything good IMHO. I subscribed to Netflix and Hulu Plus, but they're almost as bad interface wise. Hulu has current episodes, but you're paying for ads you can't skip or fast forward through. Comcast lets me fast forward through my DVR stuff.Since these are not available, my plan to eliminate my cable bill is ruined and instead I spent money that I should have used on my cable bill on something that lets me do less than my tablet. Money for FireTV, Netflix and Hulu Plus, So about $100 investment and $20 per month on top of my current bills.Sure, I can now view some stuff on my TV now, but from what I've heard, I could have bought a Roku or Chromecast for almost half and done the same thing... Then I could have cancelled my cable.I will order the Chromecast and update this. I am also contacting Amazon and will let you know what happens.  But you might want to start with Chromecast first, I hear it runs the apps on your device and unlike FireTV, that includes many networks.", "verified": true, "helpfulness": "3/6", "author": "Wil Maxwell"}, {"rating": 4.0, "review": "Great and smooth interface, but no HBO.", "verified": true, "helpfulness": "0/1", "author": "Joshua"}, {"rating": 5.0, "review": "supper fast great picture easy to use", "verified": true, "helpfulness": "0/1", "author": "gerald thompson"}, {"rating": 3.0, "review": "I was a bit disappointed in the available movies with Prime. The functionality is great! Voice command works very well.", "verified": true, "helpfulness": "0/0", "author": "ron mancuso"}, {"rating": 2.0, "review": "Coming from an Apple TV guy, so far I'm not impressed with the Fire TV.  I basically use Netflix for movies etc.. and have found that although accessibility might be better on the Fire than Apple TV, as others have mentioned, for the most part, you gotta \"pay\" to play.  And, this from an Amazon Prime member. Where many titles come with the monthly $8.00 fee on Netflix, with Fire TV, cough up ~$2.99 or more per title viewing.  Oh yeah, there is some free stuff but finding it is cumbersome.  Seems like when the Fire TV was first installed a few months back, there was some free legacy Star Trek material but even now, pay $1.99.  I found some \"old\" B and C movies from the 70's, if that's your genre, OK, but to me, not worth watching - rest assured, any new value material is gonna cost.  I do hear the gaming feature on Fire TV is ok, but I don't play games.  Overall, this purchase was a $100 bust which, by the way, and after the limited time period, you're stuck with it.Good luck with your decision but until Amazon frees-up better quality and more recent Prime programming, my Fire TV sits idle for the most part.", "verified": true, "helpfulness": "1/1", "author": "Dave M \"TAG Guy\""}]