[{"rating": 3.0, "review": "I was a little disappointed that you could not stream internet channels from the fire and also that everything costs money.", "verified": true, "helpfulness": "1/1", "author": "Rella Redick"}, {"rating": 5.0, "review": "Looks like we dont need Dish", "verified": true, "helpfulness": "0/0", "author": "Gary Schoepf"}, {"rating": 5.0, "review": "Very powerful tool when paired with downloadable apps that significantly expand its capability.", "verified": true, "helpfulness": "0/0", "author": "Kevin R Dibelius"}, {"rating": 5.0, "review": "Works great, packaged like a brand new unit.  Love it.", "verified": true, "helpfulness": "1/1", "author": "Gus \"Gus\""}, {"rating": 2.0, "review": "This did NOT meet my expectations", "verified": true, "helpfulness": "0/2", "author": "C. Mitchell Beeson"}, {"rating": 1.0, "review": "I'm having a problem with this product and can find no where to get tech support without being charged.  I am only wanting to know how to turn off the caption that is showing on the bottom of my screen.  If you can't offer some sort of support for this thing you should not be selling it.", "verified": true, "helpfulness": "3/4", "author": "Charlotte J. Gray \"chuckie's kindle\""}, {"rating": 5.0, "review": "I love all of the options it has.  It's easy to set up and easy to navigate.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It looks and performs like new. I like it.", "verified": true, "helpfulness": "0/0", "author": "Doug Roberson"}, {"rating": 5.0, "review": "Yep, Finally have it set up (My non-techie husband insisted, so it took some time to make himself do it - grrrr for me. But hey, I gave it to him for a gift so I had to let HIM do it.) For those of you non-techie people - don't dawdle! Just do it. It's super easy to set up. We LOVE IT! The VOICE SEARCH is the BEST! I was able to download Netflix, my local PBS programs, other much used Apps, and there are lots of cool documentaries options. I probably haven't figured out all the great benefits it has yet - but the Amazon Fire TV is totally worth it! OH, and I have the new Kindle - and yep - it is so easy to search around on my Kindle, then flip it up to watch it on the big TV. As easy as they say in the advertisements. I'm happy to answer any ones Q's on this one.", "verified": true, "helpfulness": "2/2", "author": "Me"}, {"rating": 5.0, "review": "Awesome... the mic. is great .  worth every penny.  Like it better than apple tv", "verified": true, "helpfulness": "2/2", "author": "ddwoolf"}]