[{"rating": 5.0, "review": "Own a Roku as well and to me there's not much of a difference, my kids use it more than I but when I do use it it works just fine for me. I've read some of the bad reviews and none of the complaints I've read apply to my Fire TV. My sister owns one as well and I know she likes her's too.", "verified": true, "helpfulness": "2/2", "author": "J. Grindstaff"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "Mr. Vick"}, {"rating": 5.0, "review": "I love my fire it does everything I need it to. Unlike Apple TV I can watch and listen to all my amazon prime stuff.", "verified": true, "helpfulness": "1/1", "author": "Ethan JD Hughes"}, {"rating": 5.0, "review": "I have had my Amazon fire TV for at least a week now and I really like it. The picture is very clear HD, but there was one time where it did go out of HD mode but it came back up shortly. I've only ever used it for Amazon Prime and Netflix with seamless quality. I hope to start my Hulu subscription soon so I can test that out as well. Also the microphone feature only works with prime and I'm okay with that. Overall, I am very satisfied with my purchase.", "verified": true, "helpfulness": "1/1", "author": "lovlee"}, {"rating": 1.0, "review": "Need to return It. It's just more pay TV and I already have that.", "verified": true, "helpfulness": "0/7", "author": "Tracy Stoner"}, {"rating": 5.0, "review": "Awesome loved it!!", "verified": true, "helpfulness": "0/0", "author": "Tinaante"}, {"rating": 5.0, "review": "Fast, easy to use. Love it!", "verified": true, "helpfulness": "0/0", "author": "Jo Russo"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "frank m tan"}, {"rating": 4.0, "review": "I think it's a great product. The remote is flawed. It will randomly skip selections and skip over apps. Kind of stinks. I would give it five stars if it worked perfectly.", "verified": true, "helpfulness": "0/1", "author": "Tony Bravo \"Bravo\""}, {"rating": 4.0, "review": "it took a few attempts to get it working. Had to unplug and reinstall. After that, it seems to work fine.", "verified": true, "helpfulness": "0/1", "author": "Harry G Brugger"}]