[{"rating": 5.0, "review": "Works great, Kind of a bummer that HBO Now does not work with it yet. Only HBO Go works and you have to be a Tv subscriber to activate. The main reason to get this was to get rid of $$$Cable Tv$$$ and it has done that well with no buffering on slow phone line Wi-Fi. Many free movies and shows with high quality audio and video. Well worth the $$$ and very easy to set up.", "verified": true, "helpfulness": "0/1", "author": "Igore"}, {"rating": 5.0, "review": "Hands down my preferred TV. I love apple products for their ease but I've always disliked apple tvs. SO when Amazon finally came out with the Fire TV I researched then purchased. I love it! I highly recommend it.", "verified": true, "helpfulness": "0/1", "author": "roberta"}, {"rating": 5.0, "review": "Really enjoying our Fire TV!", "verified": true, "helpfulness": "0/1", "author": "Mama2ladybugs \"DJ\""}, {"rating": 5.0, "review": "Super quick reaction to your voice commands. The choice of App's that are available are great. We had our Amazon Fire TV hooked up and programed with our WIFI within 10 minutes. Started watching our Netflix programs without any delay. We have apps on our Tivo and the response time is much slower than the Amazon Fire TV. We are very pleased with our purchase and will be buying another unit for our family room.", "verified": true, "helpfulness": "0/1", "author": "UnclePunky48"}, {"rating": 5.0, "review": "I have not missed Dish at all.  My boys are happy with the selection of channels as well and love the video games.  Our family sits down together to watch a selected movie from Amazon prime at a time that is convenient for us. We added a digital antenna and get all the local channels too.  Paying high satellite and/or cable bills are a thing of the past. My husband has been talking about dropping those for quite some time.  I'm so glad we did!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Susan Hand"}, {"rating": 5.0, "review": "Works great but the Prime movies seem to stay the same month after month and my suggested movies hasn't changed ever, The same bald dude is still looking up to the stars lol :D When I use the search/Talk feature I can find new movies that I did and didn't know existed. Scrolling through the movies can cause burnout and end up watching nothing. They need to setup something where you can choose year released,Classic,Western ect..  The other thing is when you scroll to the end of your selection it should automatically start over from the beginning by looping around. They are a lot of things to love and hate but it is a good set top box with plenty to enjoy.", "verified": true, "helpfulness": "0/1", "author": "Jerry T \"Jerry\""}, {"rating": 1.0, "review": "Thing stopped working after two months. Now just shows startup screen, then nothing. Contacted Amazon and they've just been giving me the run-around.", "verified": true, "helpfulness": "0/1", "author": "freqshopper"}, {"rating": 5.0, "review": "Great streaming device! It's SMALL, and the remote has a pleasing matte finish. Wish I'd bought this sooner. Interface is good, and features a nice \"click\" sound when you scroll through things (you can turn that sound off as well). Fire TV has screensaver images that are just beautiful; pix of forests, mountains, cities at night, etc.", "verified": true, "helpfulness": "0/1", "author": "Free-range Texan"}, {"rating": 5.0, "review": "AWESOME!!! So much faster than my Wii!!!!", "verified": true, "helpfulness": "0/1", "author": "Anna F."}]