[{"rating": 5.0, "review": "Love it!  It is very easy to use. So nice not to need a play station or some other gaming equipment.", "verified": true, "helpfulness": "0/0", "author": "lilgc24"}, {"rating": 4.0, "review": "hi if I buy this how much is will it cost me too keep the service after my 1year free triel? or is it just 99$ or there is more to it", "verified": false, "helpfulness": "0/0", "author": "monica khawaja"}, {"rating": 4.0, "review": "works great. i just wish it would have the new prime music on it. and i wish i could shop and check social media networks on it.", "verified": true, "helpfulness": "0/0", "author": "Travis T"}, {"rating": 4.0, "review": "As a former Roku (2 year) user, switched to Fire to reduce buffering/re-buffering and image mottling issues.  For the most part, both issues resolved but still have some buffering issues even though  a solid 8 meg download at the Fire unit.  Roku had great customer service but could never resolve the problem.  With the Fire 30 day free trial, why not try it?", "verified": true, "helpfulness": "0/0", "author": "Alexis"}, {"rating": 4.0, "review": "Color adds so much to everything but does take longer to download e.g. periodicals. Price is about right and movies are so easy.", "verified": true, "helpfulness": "0/0", "author": "E. J. WatsonWilliams"}, {"rating": 3.0, "review": "On the Fire TV web page, Amazon states: \"You can also access your entire Amazon Music library, so you can enjoy any albums and songs you’ve previously purchased from Amazon.\"This is false.  You cannot access your music library with the Fire TV device", "verified": true, "helpfulness": "1/1", "author": "RollTide"}, {"rating": 4.0, "review": "One small flaw; can't filter out all of the non-Prime content.  I have zero interest in seeing any content that I'd have to pay for.You can do it on the website but not on the menus on the Fire.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon tv is a great addition to your entertainment at home. Streaming is excellent and the screen quality is also good.  We put this in our room and love it.", "verified": true, "helpfulness": "0/0", "author": "lauraf"}, {"rating": 3.0, "review": "its like having the netflix or any other online video streaming service but its one time other you pay monthly subscription", "verified": true, "helpfulness": "1/2", "author": "joy81"}, {"rating": 1.0, "review": "No DLNA support, and the only way to turn it off is to unplug it. Regardless of anything else it can do, as far as I'm concerned these are fatal flaws.", "verified": true, "helpfulness": "4/6", "author": "Jason M. Schmitz"}]