[{"rating": 4.0, "review": "Speed of loading and playing of selected titles is nearly instantaneous when compared to the Roku.  It's not even close!Voice Search works great.  Picture and audio quality are excellent.  Don't care about gaming, so no comment on that.Only reason I did not give it 5 stars is that \"the USB port is not presently enabled\", according to several techpersons Iasked about this problem.", "verified": true, "helpfulness": "1/1", "author": "James"}, {"rating": 4.0, "review": "Easy to set up and use, but voice search could be improved, and the addition of a lighted remote would be helpful.", "verified": true, "helpfulness": "0/1", "author": "vman"}, {"rating": 5.0, "review": "This is the best quick decision I have ever made. Money well spent in my case because not only do I have Amazon Prime, but I also have Netflix and Hulu Plus.", "verified": true, "helpfulness": "0/0", "author": "Maggie"}, {"rating": 5.0, "review": "I can now watch my favorite TV shows on my 45\" flat screen tv instead of my 17\" laptop screen!  It is so easy to set up that I was watching within 5 minutes.  It only took that long because it needed to update the software which was okay.  I highly recommend getting one of these if you use Amazon Instant Video with your Prime account.", "verified": true, "helpfulness": "0/0", "author": "R. Short"}, {"rating": 4.0, "review": "Amazon Fire is easy to use and the voice command is great.  Issues - a tad expensive and the scroll down lists of available titles gets redundant and a bit bulky to search.", "verified": true, "helpfulness": "0/0", "author": "MsMystery \"BP\""}, {"rating": 5.0, "review": "I love it! And my four year old twin boys obiously cant read yet, so the microphone feature is very convienent. They just speak.", "verified": true, "helpfulness": "0/0", "author": "Christine Walker"}, {"rating": 5.0, "review": "Just received this device two days ago, but already I love it!  Installation a breeze, and within 10 minutes I was watching a cool movie from Netflix.  Also size is prefect, and the features it offers is so worth the price, I look forward to many evenings of full enjoyment with this device.Any body that has suffered with some of the early concepts, like the sony will really want to think about changing over, there is no comparison.", "verified": true, "helpfulness": "0/0", "author": "bogeyman"}, {"rating": 4.0, "review": "We had another Streaming TV product but the Fire has so many different options, I hope more sites are added!!", "verified": true, "helpfulness": "0/0", "author": "Michael Ewing"}, {"rating": 5.0, "review": "Very happy with the Fire TV so far. Simple setup out of the box, clean user interface and the voice search fairly well (although it could not recognize Schwarzenegger no matter how many times I said it). ;)Also, have not had any buffering issues, so that's a huge plus for the experience.", "verified": true, "helpfulness": "0/0", "author": "TDoyle"}, {"rating": 4.0, "review": "I am very pleased with the increased speed of this device - it is fantastic.I took off one star, though, because it isn't easy to see which material is Prime and which is not.  I would have only taken off 1/2 star if that was an option!", "verified": true, "helpfulness": "0/0", "author": "Resipsa99"}]