[{"rating": 2.0, "review": "A very good first attempt but sorely lacking for true home theater users.  The inability to stream from my local media server is a show stopper. Lack of bit streaming means no DTS MA and no DD True HD.  This is a good competitor to the Apple TV and good for the person that wants to stream from internet sources.The specs are impressive and the unit will be well supported by Amazon so there's a lot of potential that could make this an amazing product.", "verified": false, "helpfulness": "17/67", "author": "Deke Keyes"}, {"rating": 3.0, "review": "I'm not one to normally post about an item I don't use. But another Box to attach to you TV - Please.OK, so besides the games, what's the game changer ?If you have Prime you should get this free or 50% off the price.There is too many box's doing similar or the same out there.", "verified": false, "helpfulness": "11/62", "author": "Andrew"}, {"rating": 5.0, "review": "Great device but it's tough breaking into a crowded marketplace. This is definitely a beta, but a VERY strong one since they are the newest guy on the block. Experience was generally overall positive with only a few minor hiccups.I have a friend who purchases Amazon products and he usually allows me the opportunity to review his purchases so that I can post my thoughts on here. I'll run through the following categories and give my conclusion at the end.DESIGNSOFTWAREAPPSHARDWAREGAMINGPERFORMANCEWARRANTYIN THE BOXCONSCONCLUSIONDESIGN -It's square, small and stylish. That's not a surprise as it reminds me of the Apple TV. You can hold it in the palm of your hand. The cover is black matte plastic so has a nice matte sheen to it. But it feels like a solid weight. Does not feel cheap. The sides are glossy so it's a contrast. It's .7 inches thick and 4.5\" square. Remote shares a similar design - matte black with glossy buttons (unlike Apple TV with the matte remote throughout). It's pretty sleek and stylish as well. It has search button, playback buttons, back button, home button, menu buttons, and click wheel.SOFTWARE - Amazon uses the closed-ecosystem method unless you are uploading content from your home network. Apple TV works in a closed ecosystem as well, only allowing what they put on there. Roku doesn't provide services so they are open source, as is the chormecast, generally speaking. Voice search is a new feature here but is nothing new (think of Roku and Chromecast). Some small errors with voice-search but that is par for the course. If you want to search with text, you'll have to either use the remote with the onscreen keyboard, which is time consuming. A keyboard would be nice. I did notice a lag when loading particular apps until the app actually loaded, but I see that same issue across the board on my Apple TV and my Roku box, so it must be something with the apps themselves. Cloud storage is included with Amazon membership.APPS - You'll find Amazon Prime Video on here - any surprise there? Also, the most popular apps include Netflix, Hulu Plus, as well as WatchESPN, Showtime, Crackle, VeVo, PBS, NBA, AOL, Huffpost, Pandora, and Nickelodeon. You won't find iTunes (again, no surprise there) as that is an Apple product, or one of the most popular - HBO Go, but reports indicate that it is coming. Winter is coming. :) There will also be a music channel coming as well. There's a photo channel that can upload Amazon Cloud Drive pics.You can also utilize Amazon Freetime which lets you limit usage time for kids and control their viewing experience.HARDWARE - It has power cable, HDMI, optical audio, Ethernet and USB slots. Optical is a nice feature that doesn't run on the Roku or Chromecast. It runs a quad core processor, 2GB of ram, and is faster than the Apple TV, chromecast, and Roku 3, but that is no surprise -when you're new (late) to the game, you can afford to add the most recent technology. It uses 1080p which is the standard, plus Dolby Digital Plus sound which is nice - most of the competitors don't have that feature.Remote uses Bluetooth. No need for line of sight (IR) connectivity. Has a microphone for voice input. This is a growing feature - think Siri and Cortana. According to comments from Amazon, it will learn how you speak and what you want over time, and will adapt accordingly. You have to wait until the item beeps before you can talk or it will generate an error - and it prefers a quiet background noise so it can hear what you are saying.Gaming remote is wireless. It has the standard YXAB as well as a few other buttons such as home and video playback, as well as 3 pads for controlling movement. It also has GameCircle button which lets you share your user scores - it brings up a screen that you can see information such as achievements and leadership boards. There's also the standard back trigger buttons. Reminds me of the Xbox 360 remote. This is Amazon's attempt to enter the gaming industry and looks like a beta version to me. I am guessing they will improve it as time goes on. The remote is not expensive at $40. It's not bad to hold but is a bit bulky - but I am used to the Xbox 360 remote so it's a similar design/layout. Negative is that you have to use AA batteries. You can use a second screen here. There are number indicators on the back that give you player indicators.GAMING - Games were pretty fast. There was occasional lag but that did not slow me down. SevZero is available from Amazon as a third person shooter. There;s also minecraft, asphalt 8, Life, and the Walking Dead advertised on their site.PERFORMANCE - The software is snappy because the hardware is topnotch. It generally runs well. The voice search, when it worked which was most of the time, recognized what I wanted almost instantaneously. Amazon has a new feature called \"ASAP\" which pre-loads the video when you click on the information page. It will also pre-load when you mouse over a selection. It further pre-loads the next episode of a show while you're watching the previous one, anticipating that you will want to watch that one next.WARRANTY - The gaming stick comes with the standard 90 day warranty. The Fire TV comes with Amazon's 1 year limited warranty but you can buy additional warranties as well from other sources.IN THE BOX - It has the power cord, 2 AAA batteries, and the quick start guide, as well as the device and remote itself. You'll need an HDMI cable, an HDTV, and high speed internet to run efficiently.CONS - Marketplace is crowded. Lots of other options out there. The interface is The gaming remote is not ready for prime-time. I'd love accelerometer or other nice features that it could easily have. There's no headphone jack function like the remote. No HBO go (yet) or Vudu, or other features. Guess they wanted to get it out quickly. They don't have wifi on the remote and Bluetooth will probably drain the battery faster. Could be nice to be able to use the remote as a simple gaming device. The wireless is 5GHz N but no AC... strange. What am I getting on this device with regard to Prime that I don't get on others that offer the Amazon App? There's no 3D features but that has not caught on as much so it's not a huge loss.CONCLUSION - Device and setup are simple. Plug and play. Connect to the internet and you're ready to go. $99 for a box is sufficient. It's super-fast and smooth. Amazon is entering the market at the same price as the Apple TV. There are other cheaper options such as the Roku and the Chromecast, but they are mixed bags. I would buy this if you have nothing else, or if you have older versions of the aforementioned devices and are looking to upgrade, but it's not much new other than the hardware specs.EDIT * 4/4/14 *iFixit has reviewed the product, and found it's easily repairable. They confirmed the following specs:*Quad-core, 1.7 GHz Qualcomm Krait 300 processor*Qualcomm Adreno 320 dedicated GPU*2 GB LPDDR2 RAM at 533 MHz*8 GB internal storage*MIMO Wi-Fi supporting 802.11a/b/g/n*Bluetooth 4.0*5.5 mm DC Jack*Type A HDMI 1.4b output, w/HDCP*Optical Audio (TOSLINK)*10/100 Ethernet*USB 2.0 Type AThey note that there's a large heat sink to dispel the significant heat generated from the Fire TV. See here for the full commentary: [...]", "verified": false, "helpfulness": "30/46", "author": "J. Friedman \"JF\""}, {"rating": 3.0, "review": "Some context - I'm coming from a roku device that I use primarily for netflix and plex. I'd like to replace the roku for two reaons - I'm sick of ads appearing on the roku home screen and it chokes decoding high quality 1080p content.The fire tv arrived first thing this morning so I spent 30 min setting it up and evaluating it on the dimensions I care about - netflix and plex.The fire's plex app is significantly better than roku. Has no trouble decoding very busy high frame rate 1080p videos, and the UI is snappy and fairly modern (and a huge step up from the primitive plex roku ui).Netflix frankly sucks on the fire tv. Don't get me wrong, it works, but the UI is very reminiscent of the very first netflix ps3 app, kinda clunky (IMHO).I don't really use amazon for video content, so I can't really comment on that aspect of the fire other than to say that I always get a hearty chuckle from the amazon video \"recommendations\".", "verified": true, "helpfulness": "31/42", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This looked like a great product at first glance, but I will not purchase this product until HBOGO becomes available.", "verified": false, "helpfulness": "12/176", "author": "Desticle"}, {"rating": 5.0, "review": "I bought this since I watch Amazon videos almost the entire day I work from home. This device is incredibly easy to setup, very simple to navigate, and does exactly what it says it does. It also delivers streaming content with almost no delay. The only annoyance I had with the device was not being able to skip the initial video explaining everything.", "verified": true, "helpfulness": "11/17", "author": "Scott Steves"}, {"rating": 2.0, "review": "I've been eagerly awaiting the introduction of this product since the rumors began, but now must say that I am sadly disappointed. Not only does it offer less content than either the chromecast or roku devices I already own, but it also costs more than both of them COMBINED ($50 for new roku \"stick\", $35 for chromecast). It also has the old-fashioned set-top box form factor which adds to the clutter in my living room. Granted it has a nice remote with advanced voice recognition, but I would trade that in an instant for chromecast's ability to search for content on a phone, tablet or PC and then send it to the big screen with a tap.My biggest gripe, however, is with Amazon's apparent war against the android community. Not only can you not access google content (apps, movies, music, etc) from Kindles or Fire TV but Amazon also seems to be trying to block their own prime movies from being viewed on android devices. I've been a Prime member since day one and Amazon has been my go-to source for nearly everything, but I'm also a heavy user of google applications, cloud services, email and android devices. Amazon seems determined to force me to choose between them instead of helping me smoothly integrate the two. For that reason alone I'm finding myself leaning more toward google content and less toward Amazon lately. Hopefully Amazon will get over whatever their problem with android is and restore my faith.In the meantime, a combination of chromecast and roku sticks meets my needs better at a lower cost. And I only use the roku for Amazon Prime movies since there is no supported Prime app for android.", "verified": false, "helpfulness": "25/77", "author": "Mark F."}, {"rating": 5.0, "review": "I don't have it yet but I am giving it 5 Stars because I have been wishing to watch Prime Video on my HD TV. I don't care about the other services. I am sure it will work because I have never been disappointed by Amazon I have 2 Kindles.", "verified": true, "helpfulness": "5/44", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Amazon FireTV leaves out the ENTIRE world population of blind people, with 6,636,900 (yes, 6 million) legally blind in the US alone!For some reason Amazon decided they didn't want the business of blind people(?!), and thus did not include any type of accessibility features for the blind. (I have confirmed this during TWO phone calls to the Amazon customer and technical support.)Buy an APPLE TV instead!APPLE is the ONLY company to provide an awesome accessibility feature for the blind. Really, it's amazing: Every menu, every item, every word, is spoken out-load to you.100% usable by every blind person.Support blind people and buy an APPLE TV. APPLE TV offers all the same (and more!!) features and programs of this Amazon FireTV. By buying an APPLE TV, you are telling Amazon to get their act together. Do you know someone who is blind!?? Support them by not buying this Amazon FireTV until Amazon makes this FireTV fully accessible to the blind.Don't get me wrong, I love Amazon.com and will continue to shop with them. But releasing a product like this while leaving out the entire world population of blind people, is completely irresponsible of Amazon.Buy an Apple TV instead.", "verified": false, "helpfulness": "55/321", "author": "J. Johnson"}, {"rating": 4.0, "review": "Why do people write negative reviews when they are too lazy or stupid to read the product specifications before they buy anything? Nothing in the literature states this product comes with mlb or hbogo and closed captioning is generally a feature of the service that you are subscribed to. Read before you buy!", "verified": false, "helpfulness": "17/34", "author": "Joe"}]