[{"rating": 5.0, "review": "It is wonderful, the only we would change is the software sometimes stops playing and goes back to the main screen, but this a great product.", "verified": true, "helpfulness": "1/1", "author": "AprilRay"}, {"rating": 5.0, "review": "The question I ask is why didn't I get this sooner. This is an absolute wonderful device capable of exploring so much free Entertainment that I don't understand why I waited until now to purchase the Amazon fire TV.", "verified": true, "helpfulness": "0/0", "author": "Matphoto"}, {"rating": 2.0, "review": "The device works perfectly.  The advertising claimed free for Prime members, not some things are free.  If I had known I was just purchasing an easier way to connect to Netflix I would not have purchased the Amazon Fire.", "verified": true, "helpfulness": "0/1", "author": "Dan"}, {"rating": 5.0, "review": "So far so good. It is fast and have not had any problems with the wifi.", "verified": true, "helpfulness": "0/0", "author": "Kristopher K."}, {"rating": 5.0, "review": "Perfect ...", "verified": true, "helpfulness": "0/0", "author": "Richard L. Berryman"}, {"rating": 4.0, "review": "I bought the firestick first and like it so much i bought the box.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "This was amazing. Literaly plug in and go. I got a Visio 48\" and the box and within 15 mins was watching great tv on amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "This item worked fine but we had to return it because we have satelite internet and this ate up our data to fast", "verified": true, "helpfulness": "0/0", "author": "Dave in Kentucky"}, {"rating": 5.0, "review": "Cut the cable.  Use this now with amazon prime, Netflix, & sling tv.Much happier than paying for 500+ channels of crap that I never watch.", "verified": true, "helpfulness": "1/1", "author": "J. Kennedy"}, {"rating": 5.0, "review": "Very speedy device.  However, I am surprised that more entertainment apps and updated entertainment apps are not available for it.", "verified": true, "helpfulness": "0/0", "author": "Chris Ford"}]