[{"rating": 2.0, "review": "I can't give this item a 5 star review because I haven't been able to use it yet.  The problem is that it is not compatible with my tv. I would not have purchased this item if I knew that it did not work with all flat screens and I feel that this information should have been made avaliable. I am not one who likes to return so i will keep it and purchase a newer model tv but before any of you decide to spend your money make sure your tv is a newer model.", "verified": true, "helpfulness": "0/4", "author": "Lil Angels"}, {"rating": 5.0, "review": "Amazon Fire TV met all my expectations. It arrived quickly and well packaged. I have watched TV shows, movies, and Stand up Comedy. I think I will enjoy this.", "verified": true, "helpfulness": "0/0", "author": "Sylvia Kennedy \"Sylvia Kennedy\""}, {"rating": 5.0, "review": "I am very pleased with my Fire TV purchase.  I was planning to purchase after the holidays, but saw it for $69 on sale.  Even after reading about it online, I was amazed at the small size and simple remote.  I like how it doesn't stick out like a sore thumb sitting by the tv.  It was very easy to install and to get it up and running.  Navigation is also very easy.  The speed is also very nice.  The Fire TV is much faster than our Sharp \"smart\" tv.  Netflix comes up really fast and never hangs up on the Fire TV like it does on our Sharp tv.  I highly recommend the Amazon Fire TV.  In fact, I'm probably going to purchase another to install on the previously mentioned \"smart\" tv.", "verified": true, "helpfulness": "1/1", "author": "LandK"}, {"rating": 5.0, "review": "worked right out of the box!", "verified": true, "helpfulness": "0/1", "author": "JMKenney \"Coastal Reader\""}, {"rating": 5.0, "review": "This is SO EASY to set up and use! The voice command feature is very convenient and it always finds what I'm asking for! I have our travel photos on the Amazon Cloud, so we can view them as a lovely slideshow while listening to either Prime music or my playlists. I have watched several movies....Miss Potter...Little Women....Belle...The 100 Yard Journey...Little Women....Miss Potter....Belle...you get the idea, and I love that the movies I've recently selected are right there, in case I want to see them again. No searching around. I do wish the selection was more generous in my preferred genres, but that may come. This is a great, great product! I think that Amazon should have put another object in the graphic, so that viewers would have a point of reference as to size, because, alone, it looks much larger than it actually is. I was very surprised at how small both the box and the remote are. Try it! You'll love it!", "verified": true, "helpfulness": "1/1", "author": "I. M. Coen"}, {"rating": 5.0, "review": "I like this little box. We bought it for a TV that does not have a blue ray connected for the Netflix capabilities. It's perfect. We haven't explored any of the extra stuff like the games but I would definitely recommend this for anyone that wants something simple to expand their TV watching abilities.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 3.0, "review": "First the good, is is very fast has a sexy design compared to the others. Has little to no hesitation push a button and it does want you want it to do. Now the bad, IT is made for you to spend another 100 dollars year to pay for Amazon prime and even more than that if you do not pay attention to see if it is free with prime or if your paying big money for movies or paying per episode television,  that is not fair to force people that have less technical knowledge to spend that hundred dollars a year plus not being clear that every thing you CAN watch is not free.Explaining that to my 70 year old father made him so confused and then angry at me for being the messenger and spending so much on his Christmas gift that he can't use easily. My fault for trusting that Amazon Would make all providers equal. And not shoving them into a separate secondary file that has to be opened to see the other choices that one pays for as well as prime.  Yes you can download apps for Netflix which has a low monthly fee for every thing to be watched.  Hulu plus also has a monthly fee for all the programs on their site and every show and movie is included in that monthly fee, but to get to theses apps one must first known that you have to download them, then they are kept off the main screen and put to the side separate from the easily found Amazon viewing area. NOW the big FOUL FLY in the ointment, if you have DIRECT tv this box will NOT allow you to watch HBOGO or SHOWTIME ANYTIME You can download the app and if you have any other providers they work but for the millions who have Direct tv they just block you and there is nothing more you can do about it.My father ended up giving me this back and going back to R o k u because it actually works with all providers, no sense paying for HBO and ShowTime if you can not watch it on demand. SHAME on you Amazon. Now I have a very expensive box that in many hardware ways is better than anything out there, but software applications are wanting to say the least. I still find I use C h r o m e C a s t much more than this box that cost 3/4 more. I give it five stars for the hardware and  three stars for the system design, which is more important to me. oh yeah the remote control is awesome as well as give a much better 1080p than any of throther.", "verified": true, "helpfulness": "1/4", "author": "tony moretz"}, {"rating": 2.0, "review": "Admittedly I have a slow wi-fi connection and have had it moved, by my phone company, so it would be closer to the fire tv box. This has not helped. I'm trying to understand why I can download things from Netflix, through my Wii but nothing from the fire tv. I also hate that every screen I go to requires my pin number.", "verified": true, "helpfulness": "0/3", "author": "Beverly Jones"}, {"rating": 5.0, "review": "Love it! I have been a prime member before Fire TV came out and I waited and read up on it.  I now have purchased a second Fire TV on sale, with my prime membership I am catching up on TV show series as well as enjoying the vast library Amazon has for its prime members.Going to cut my cable next and use my digital TV antenna along with my Fire TV, will cut my bill over a $100.00 a month!", "verified": true, "helpfulness": "1/1", "author": "Paul"}, {"rating": 5.0, "review": "Simple to set up. Have been watching it everyday!", "verified": true, "helpfulness": "0/1", "author": "Liz M"}]