[{"rating": 4.0, "review": "I bought this to replace a firestick because of the option of Freetime to lock down the TV for kids shows only. However, I found out after it arrived that you have to pay a monthly subscription fee to use the service. These are a lot faster than the firestick and there hasn't been a single buffer since we got them. Occasionally the firestick would lock up mid-show. It's a great product that they could improve with a free kids profile like Netflix. The child chooses their own name and doesn't even see what parents are watching. I'd rather not pay a subscription just to filter down like that. It would also be awesome if they added suggestions based on what you're watching.I don't have Chromecast or AppleTV but I do have a Roku and I definitely would choose Fire TV over Roku - it functions much better.", "verified": true, "helpfulness": "0/0", "author": "Normal Person"}, {"rating": 4.0, "review": "I love my Amazon Fire TV.... except for ... I'd like to stream Audible purchases, couldn't you guys build an app? And hey what about being able to search Amazon for stuff other than movies? It would be great if I could order books, audiobook, and shoes, or any of the other stuff I buy from Amazon on a regular basis.This is what I want. 1. to listen to audio purchases  2. Surf the web  3. buy stuff from Amazon, other than, and as well as Movies/MusicShould I give you guys 1 star so you will notice what I want?", "verified": true, "helpfulness": "0/1", "author": "Judith E. Prueitt \"Enjoying life, taking time to be myself, trust me it's a hoot!\""}, {"rating": 5.0, "review": "I absolutely love my Amazon Fire TV!!", "verified": true, "helpfulness": "0/0", "author": "country granny \"country granny\""}, {"rating": 2.0, "review": "Getting the hardware set up was was easy, using the voice control fantastic, setup youtube and my contract with Hulu. even with a contract, it keeps displaying the option to pay for each tv show and movie, so we don't let anyone else use it just to keep from getting accidentally charged for shows we have already paid for. I would go for their Prime, but if letting anybody else use it means we might get charged, we just watch the smart TV instead. A shame they have many more shows we would want to watch on the Fire box, MUCH easier to find the programing. But even I have gotten in a hurry and been charged for shows we have a contract for.", "verified": true, "helpfulness": "0/2", "author": "Bruce A. Meisinger"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/1", "author": "Sherri L Hayes"}, {"rating": 4.0, "review": "Only 4 stars because there is no Comcast support yet. Easily 5 stars when they board ship", "verified": true, "helpfulness": "0/0", "author": "Klif Roe"}, {"rating": 5.0, "review": "The packaging is wonderful first off.  It was easy to hook up, and worked right away.  The voice search feature works great.  I am happy with this purchase. I have never owned a similar product, other than my smart TV...but this made my dumb TV get smart really quickly!", "verified": true, "helpfulness": "0/0", "author": "beepbeep"}, {"rating": 5.0, "review": "Yeah, it does video on demand and all the stuff you'd expect.  Yeah, it's even better if you're a Prime member.But if you're connecting it to a big screen HD display, be prepared to have your jaw dropped repeatedly by the surrealistic landscapes that make up the huge collection of screen saver images.  Some of them are so incredible that I do a double-take to make sure I'm seeing what I think I'm seeing.  Are these things Photoshopped?!  No.. they're just fantastic images of some of the most amazing natural features on planet Earth.Someone should organize a tour of these places, and I sure wish there were available credits so I could learn more about each place.", "verified": true, "helpfulness": "0/0", "author": "nathanso"}, {"rating": 5.0, "review": "Love it.And I was able to get rid of my expensive satellite TV.", "verified": true, "helpfulness": "0/0", "author": "Fred Hammes \"GratefulFred\""}, {"rating": 5.0, "review": "Really well polished device.  I bought it for my parents who are in their 50's and 60's so they could watch Netflix / Amazon prime.  They are not tech savy at all.  They seemed to figure it out right away.I also own an OUYA myself but the software is a bit clunky and not suited for my parents.  The games are the main reason i bought it and netflix / amazon prime was the second.  They are comparable in function but not user freindlyness.", "verified": true, "helpfulness": "0/0", "author": "Ryan Reichelt \"Slidrr\""}]