[{"rating": 4.0, "review": "Haven't used it to much yet, but from what I've done I love it. I had a Roku, and decided to the amazon fire because I have amazon prime. I like it a lot more than the roku, it is more user friendly. Its small has a remote and easy to manuver around. I would definitely recommend getting one.", "verified": true, "helpfulness": "0/0", "author": "Rosalyn Wood"}, {"rating": 5.0, "review": "We love it! It was worth the purchase and we have absolutely no complaints so far!", "verified": true, "helpfulness": "0/0", "author": "Laci Eaton \"Lacilou\""}, {"rating": 5.0, "review": "It's was easy to use.", "verified": true, "helpfulness": "0/0", "author": "elibear"}, {"rating": 4.0, "review": "I enjoy the Amazon Fire TV as it is pretty simple to set up and use. As other people have mentioned, the voice search only leads to Amazon Prime. So you have to be careful if you're trying not to spend money on a movie. Other than that if you have netflix and such, this is a way to cut the cable cord.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 4.0, "review": "Great product, but it is always on. Wish there was an on/off button.", "verified": true, "helpfulness": "0/0", "author": "Nick T."}, {"rating": 3.0, "review": "Sleek product, voice search works well. Navigation/management for all video content is super easy. I want to use it more but it lacks content outside of the Amazonsphere, like no TED app. Maybe that's more of a indication of the lack of 3rd party vendor support to create FireTV apps. Sure there's 910 apps, but 467 are games and I'm not a gamer.AmazonMusic is tough to navigate and new music can not be added through FireTV. You have to do it through a device that can surf the internet. There are no visual effects when playing music but sometimes the lyrics are displayed like karaoke.Can not pull content (videos or pictures) from your own NAS, unless you purchase an app like PLEX. For pictures you can use AmazonCloudDrive that comes with free 5GBs of cloud storage.Default video and music volumes are different. The music volume is louder, so get ready for the initial shock when switching from viewing a video to listening to music.Like I said, would like to use it more.......but really can't", "verified": true, "helpfulness": "0/1", "author": "yobuck"}, {"rating": 5.0, "review": "Loved it but it needs an off switch and an easier way to find shows.", "verified": true, "helpfulness": "0/0", "author": "CM"}, {"rating": 5.0, "review": "Great product!!!!", "verified": true, "helpfulness": "0/0", "author": "Kendra Spann"}, {"rating": 5.0, "review": "I really love it, so much to see and do.", "verified": true, "helpfulness": "0/0", "author": "Marta Kelly"}, {"rating": 4.0, "review": "I thought there would be more of the shows from the 1960's and 70's available on Prime.", "verified": true, "helpfulness": "0/0", "author": "Paula A."}]