[{"rating": 5.0, "review": "I am really satisfied with the fire t.v. I love it I could use enter wrote on the big center button", "verified": true, "helpfulness": "0/1", "author": "Earnest Dale Jones"}, {"rating": 2.0, "review": "The Amazon Fire TV sounds really great on paper but performance frustrations ruin the experience. We thought we would be very happy with this product considering the specs and the fact that we were switching over from a slightly older Apple TV. Here is the problem, Amazon Streaming works perfectly but Netflix and Hulu constantly freeze, glitch, and crash. It often takes 10 to 15 attempts to get a show to play on Netflix and Hulu. Other times the picture will freeze while the audio keeps going. It simple does not work smoothly for two of the three services that we use the most. After several months of trying to get this to work smoothly (and hoping that Amazon would fix these bugs with updates) 90% of the time we end up watching shows on our old Apple TV. At least the Apple TV works and it is much more reliable when you just want to watch some TV without the stress of fighting with a technology that looks and sounds great on paper but simply doesn't deliver in the real world.", "verified": true, "helpfulness": "6/7", "author": "P. Simpson"}, {"rating": 5.0, "review": "Amazon Fire TV is incredible!! Super fast, all the shows and movies that I want to watch, plus downloadable app like HuluPlus, YouTube and I Heart Radio! I haven't watched normal TV since I got it. A must have.", "verified": true, "helpfulness": "1/1", "author": "EzraAriel"}, {"rating": 4.0, "review": "I just got this and really like it. Only issue I have and it's a big deal to me. It does not shut off. The only way to shut it off is to unplug it. I didn't notice anything saying that it did not shut off. After I saw that it didn't I read more about it from other reviews. I guess it's suppose to go in to some kind of sleep mode. Mine does not. I switch over to the tv and later when I switch back it's on crackle for some reason. Even though I left it on the home page when I switched over and no one has touched the remote. Guess there's still some glitches in it. But it does seem to play netflix good and that's the main reason I got it. Have not tried games yet, since that's not why really why I bought it. I really hope they add some way to shut it off in the future.  This is my first actual stream device, beside using game systems, computers.", "verified": true, "helpfulness": "0/1", "author": "pinkyshot"}, {"rating": 1.0, "review": "It might have 3x the processing power as roku and apple tv but it has very limited programming. I have been using this for 2 weeks - it temporarily replaced my roku 3 but i was forced to change back tonight in frustration. Amazon Prime is fine but Netflix is useless as it fails to launch 99% of the time - apparently Amazon is using an old version of the software which has yet to be updated. Showtime and HBO Go are not supported because Comcast Xfinity is not one of their providers - this would have been nice to know before i purchased. Overall, very disappointed. I will shelve it until the the software/providers catch up.", "verified": true, "helpfulness": "9/11", "author": "Nuala Ronan \"nsr45\""}, {"rating": 4.0, "review": "This is a great gizmo that I gave my mom so she could cut the cord with her pay tv provider. I talked her into signing up with prime and she is very happy with the content. Ninety nine dollars a year is so much better than one hundred a month. The remote is probably the simplest and best designed remote I have ever seen. Only reason I'm not giving it five stars is it can be confusing what content comes with prime and what content will cost you more money. Also there is sometimes a small stutter that seems to be a problem with the buffering. That's the kind of thing that I expect to be resolved in an update so I'm not too worried.", "verified": true, "helpfulness": "1/1", "author": "Robert Scott"}, {"rating": 3.0, "review": "If you have an amazon prime account for the free access to the prime movies its worth having but mostly its just a glorified on demand system. The voice search is awesome but I really wish it could connect to my home machine to access movies I already own in digital format.", "verified": true, "helpfulness": "1/2", "author": "Avery Z Chipka"}, {"rating": 2.0, "review": "No HBO GO, no way", "verified": false, "helpfulness": "1/9", "author": "Donovan Holden"}, {"rating": 5.0, "review": "Thanks to the great reviews that people have already posted, I am now a proud owner of Amazon Fire TV!  I can't believe how easy it was to set up.  It took far less than ten minutes to go from boxed-up product to watching my favorite TV shows and movies in HD.  The on-screen menus are very well organized and easy to navigate.  Thanks, Amazon, for automatically syncing my Watch-List and recently viewed items!  It's also nice to see menus of Prime-only content, so I know what comes free with my membership and what doesn't.It was so simple to link to other accounts and apps (YouTube, Pandora, I-Heart Radio, etc.) and I look forward to more apps becoming available like Watch ABC and other major networks' apps.  A nice surprise was to find all of my Amazon music nicely organized and displayed on one of the menu screens as well.  All my playlists were there and ready to use.The remote control is very easy to use, and the voice search is awesome!  Some people mentioned having trouble with this, but I have used the voice search quite a bit and have never had any problems.  Whether I'm searching for a show or an app to download, it has worked like a charm every time!I am very pleased with all of the features of this product that I have used so far, and I would highly recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "P. Piquette \"Pablo\""}, {"rating": 2.0, "review": "Not real happy with this item. The voice search feature does not work very well. Trying to find other apps (besides Netflix) to download to view other videos is either impossible or I just haven't figured it out. I lose Internet connection often also. I even moved it to a TV only 5 feet away from my modem & it still happens.", "verified": true, "helpfulness": "1/4", "author": "Heather Hearn"}]