[{"rating": 4.0, "review": "Feels nice and runs fast.", "verified": true, "helpfulness": "0/1", "author": "n.oneya"}, {"rating": 5.0, "review": "i am sad that my husband and i have wasted so much money paying for local cable TV. Fire TV is amazing and so affordable. we were already paying for amazon prime, so this is like the icing on the cake. our whole family is enjoying the benefits!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to navigate and the voice recognition system works great", "verified": true, "helpfulness": "0/0", "author": "Robert S Rosa"}, {"rating": 5.0, "review": "Amazon Fire TV is even better than I thought it would be. I have watched several movies as well as a few exercise routines. I am very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Betsy"}, {"rating": 5.0, "review": "love it!!", "verified": true, "helpfulness": "0/0", "author": "Kendra Todd"}, {"rating": 5.0, "review": "this is as advertised, a very nice devise for watching channels such as amazon video and also Netflix among others.", "verified": true, "helpfulness": "0/0", "author": "D. Frick \"gwen, love of technology\""}, {"rating": 4.0, "review": "FIRE TV IS GREAT, BUT SOME OF THE AVAILABLE MOVIE CONTENT IS TERRIBLE.", "verified": true, "helpfulness": "0/0", "author": "robert walsh"}, {"rating": 5.0, "review": "arrived on schedule. No buffer issues with comcast and HD stream. Hopefully acorn tv will be added through an update as it is a great site for british shows. Hooked it up to ethernet, hdmi to tv and running it through by denon receiver for better sound.", "verified": true, "helpfulness": "0/0", "author": "Russ"}, {"rating": 4.0, "review": "I like the voice activation feature on this Fire device, responds very quickly and is extremely easy to use. The way I get the most programming options is to search on Amazon.com and add to your watch list. My disappointment is that even as a Prime member  there are many movies  available to you at a fee, although they have been out for sometime on network TV, cable, internet etc. Be aware of the advertising before you join.", "verified": true, "helpfulness": "0/1", "author": "The Dap"}, {"rating": 5.0, "review": "Don't need DVD player with wifi to get streaming video. Works great. Highly recommended.", "verified": true, "helpfulness": "0/1", "author": "DEV S."}]