[{"rating": 5.0, "review": "It is awesome", "verified": true, "helpfulness": "0/0", "author": "prudence sugg"}, {"rating": 5.0, "review": "Just unbelievable. A state of the art electronic that actually works. So simple. Two connections. Connect to your Wifi. Done. I really did not expect the voice search to work, but it does! I show this feature to all of my guests. Nice job Amazon. Appreciate the preprogrammed Prime account. Buy this!", "verified": true, "helpfulness": "1/1", "author": "Electronics \"Sparty\""}, {"rating": 3.0, "review": "Fire is good but u have to pay to watch anything", "verified": true, "helpfulness": "0/2", "author": "todd ercolani"}, {"rating": 3.0, "review": "Not wildly enthusiastic.  Does what it says, but I purchased as a Kindle connection as well.  Does everything the Fire TV should do fine, but not so wild about the Kindle connection and display.The Kindle display \"lags\" because of the WiFi interface connection.  It has to go from the Kindle, to your WiFi, then to the Fire device.  If the WiFi is busy everything stutters.  Suggest one of the available Miracast connection devices if you want to connect to your Kindle.", "verified": true, "helpfulness": "0/1", "author": "Bill Kostic"}, {"rating": 5.0, "review": "I'm not gonna get technical...I'll just say I found it very convenient to enjoy some services that I already pay for without having to hook my smartphone or tablet device to my tv.  I do recommend  it.", "verified": true, "helpfulness": "1/1", "author": "Sharon C Wilkins"}, {"rating": 5.0, "review": "Awesome and totally with it!", "verified": true, "helpfulness": "0/0", "author": "Garrett Hickey"}, {"rating": 2.0, "review": "I like Netflix 10 times better!!!", "verified": true, "helpfulness": "0/4", "author": "AlanB"}, {"rating": 1.0, "review": "Either the box or netflix suck.  Who knows but I get an error repeatedly.  Maybe it's the internet access speed.  Maybe they all suck.  Who knows.  But none work seamlessly.", "verified": true, "helpfulness": "1/9", "author": "MHWsussex"}, {"rating": 5.0, "review": "Nice small thin box. Remote is very easy to use. Love the microphone feature for finding a movie.  This is one easy system!", "verified": true, "helpfulness": "1/1", "author": "Donkey"}, {"rating": 5.0, "review": "Saving a bundle since getting rid of cable T.V. Wish I had made this purchase sooner.", "verified": true, "helpfulness": "0/0", "author": "DAN"}]