[{"rating": 5.0, "review": "Best interface to streaming movies I have seen so far.", "verified": true, "helpfulness": "0/0", "author": "Jane"}, {"rating": 5.0, "review": "We love it.  Get it!", "verified": true, "helpfulness": "0/0", "author": "Patrick Webb"}, {"rating": 3.0, "review": "Have to keep unplugging the power to get the internet to connect to it, and every time I play a Netflix movie it stops in the middle and I have to turn the power off and start over. Annoying!  But I like that I can get everything it has to offer.", "verified": true, "helpfulness": "0/0", "author": "Petrina C. Schnabel"}, {"rating": 5.0, "review": "Very pleased.I havebit connected via WIFI and there are virtually no buffering issues, Great content.I am so glad I joined Prime in March of 2014, In just in shipping charges alone I have paid for my membership, not to mention all the free media I can now stream, I would like to see the USB port in the rear of the unit  be activated to be able to stream additional media from my external hard drives, and it would rock if they would add a Dropbox app so I can stream media from my Dropbox Cloud Storage.", "verified": true, "helpfulness": "0/0", "author": "SVEN THE ROAD GOD \"svensworld\""}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "Stacey Hering"}, {"rating": 5.0, "review": "Money well spent. I plan on getting one for every room.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Grace Minor"}, {"rating": 5.0, "review": "No problems setting it up.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Pammie"}, {"rating": 5.0, "review": "I originally bought the Roku device and had a lot of problems with the streaming. After reading many reviews on the Amazon Fire TV, I decided to return the Roku and buy the Amazon device. I'm very glad I did. We have been enjoying Amazon for over 2 weeks now and love it! The quality and selection of movies, TV shows, and apps is incredible. The voice control button is a welcome feature. We have had no problems streaming movies or TV shows. The Amazon device allows you to download you tube and connect your cell phone so you can choose a movie on your phone and watch it on the TV. This comes in handy when having to search for teh right show or movie to watch.", "verified": true, "helpfulness": "0/0", "author": "Karen L. Holloway"}, {"rating": 5.0, "review": "GR8", "verified": true, "helpfulness": "0/0", "author": "PAUL ZEBROWSKI"}]