[{"rating": 5.0, "review": "Love it..", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "Exceeded my expectations.  Great product.", "verified": true, "helpfulness": "0/1", "author": "vanjar andry"}, {"rating": 1.0, "review": "I thought it was more like apple TVish. The main attraction for me was the voice command capability.  If apple TV has voice com, then thats it for me. No use of fire tv for me right now.", "verified": true, "helpfulness": "1/9", "author": "P. Urbina"}, {"rating": 5.0, "review": "I love it...", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome! Nothing else to say.", "verified": true, "helpfulness": "0/1", "author": "Bigmoneyindabank"}, {"rating": 5.0, "review": "Great little machine. We use it often.", "verified": true, "helpfulness": "0/2", "author": "M. Maples \"Stringer\""}, {"rating": 5.0, "review": "Just plain amazing", "verified": true, "helpfulness": "0/2", "author": "Nick Portello"}, {"rating": 4.0, "review": "it takes a great deal of getting used to. no more turning on tv and channel surfing. if you like your local channel its best to get an amazon recommended HD antenna. I did. it helps with the transition.", "verified": true, "helpfulness": "0/1", "author": "Mary"}, {"rating": 5.0, "review": "I purchased this to have something hard wired into our network after having signal issues due to distance from our router with the streaming stick. We love the speed and responsiveness of the user interface and voice searching is pretty reliable. After trying roku and several smart TVs I think this is the best thing out there right now by far. All the apps I've loaded so far have been great.PS. The screen saver is one of the best features! Super gorgeous ultra high def landscape pictures in slide show will show you some of the most beautiful places on earth. I confess to sitting mesmerized by it, wanting to visit all the places on the slide show.", "verified": true, "helpfulness": "0/1", "author": "Patrick Harris Schulz"}, {"rating": 5.0, "review": "Great little box and along with prime even better.I watch Amazon more then my cable.I added 128 gb of storage so I have plenty of room for my Grandson's games.", "verified": true, "helpfulness": "0/1", "author": "al holmberg"}]