[{"rating": 5.0, "review": "Amazon Fire TV- Haven't been able to use it yet", "verified": true, "helpfulness": "0/0", "author": "lynndy"}, {"rating": 5.0, "review": "Was contemplating purchasing this for quite some time (as we've been \"cord-cutters\" for several years and had been streaming Netflix, Hulu, Prime, etc through a Wii) and was surprised with it as a gift! It was simple to set up and is easy to use (my 4 year old has it down). The difference in picture quality (from streaming through the Wii) is amazing. With all the apps available to download, it feels like we have \"regular\" television again (at a fraction of the cost). The voice search works well. Being able to use our Kindles as an extra \"remote\" is a cool feature too (when you register your Fire TV to your account, it syncs the devices). We haven't played many games on it yet, so I can't speak to that feature. I would definitely recommend a Prime membership if you're going to use this device. I would recommend this purchase to anyone that's thinking of ditching cable and has an Amazon account.", "verified": true, "helpfulness": "0/0", "author": "Mastellerj \"Jessica Masteller\""}, {"rating": 5.0, "review": "Been using Fire TV since end of July after dropping cable/satellite completely.  Absolutely love it and have no regrets about dropping cable.  Extremely simple setup, very fast processing, very organized menus, and voice search is very handy.  So simple to use that my 4 year old navigates thru with no problems at all.  A minor request - hope they add voice search to other apps (Netflix, Hulu, etc.)", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "Nice product, install was very easy.  The remote is excellent and the voice recognition is awesome.  Picture quality is great.Video browsing could be better, not as good as NetflixTwo nits.1) One is that it didn't auto update the latest software.  I was trying to configure Amazon music (which wasn't installed on the version I got).  Had to manually figure out how to do this.2) Box needs a hard reboot every couple of days.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "slightly better than netlfix", "verified": true, "helpfulness": "0/0", "author": "niki"}, {"rating": 5.0, "review": "awesome product, using it almost daily.", "verified": true, "helpfulness": "0/0", "author": "edo"}, {"rating": 4.0, "review": "Easy to setup and navigate.", "verified": true, "helpfulness": "0/0", "author": "Rick Odea"}, {"rating": 5.0, "review": "This was a gift for my son... he loves it... super fast and very simple install works great.", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 4.0, "review": "Love it. Would have given it 5 stars, but for the fact that the device needs to reboot by having to unplug the power. This has happened often at least once a day. Otherwise it's great and the high definition is beautiful.", "verified": true, "helpfulness": "0/0", "author": "Mousehouse"}, {"rating": 1.0, "review": "Is ok but not worth the money. Wouldn't buy it again might return it", "verified": true, "helpfulness": "1/5", "author": "michael quirk"}]