[{"rating": 5.0, "review": "I NEVER EXPECTED TO FIND SO MUCH JOY IN A LITTLE BOX. iT WAS REALLY EASY TO HOOK UP AND WHEN i HAD A PROBLEM WITH NETFLIX i CALLED THE AMAZON HELP LINE AND THEY HELPED ME FIX IT IN LESS THAN A MINUTE. thank YOU.", "verified": true, "helpfulness": "0/0", "author": "angelaR"}, {"rating": 5.0, "review": "I've used the Fire TV for a week now and it has performed as advertised.", "verified": true, "helpfulness": "0/0", "author": "D Randall"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "akfcl"}, {"rating": 1.0, "review": "Every movie you haven't already seen is going to cost you money. Amazon Prime is a joke.", "verified": true, "helpfulness": "1/4", "author": "Arthur G. Cote \"Travel Crazy\""}, {"rating": 3.0, "review": "Easy to set up and use but was disappointed  Comcast services unavailable. Unable to access HBOgo or other regular Comcast channels", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good product could use sound in the remote for private listening", "verified": true, "helpfulness": "0/0", "author": "C THOMAS HIGGGINS"}, {"rating": 5.0, "review": "Just set it up with my new wireless router - have played around with it and so far seems like it will be the answer for what I want (an option for most of the garbage on cable).", "verified": true, "helpfulness": "0/0", "author": "D. Chapman \"go fish\""}, {"rating": 4.0, "review": "Had been using Roku2 that went belly up so decided to try this. Like it a lot, works very well and is fast. Only knock is that its interface is not as simple or clean as Roku, however that is a minor nitpick.Would like to see Vudu added to the product offerings too.Otherwise I am very pleased with this product.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Minogue"}, {"rating": 3.0, "review": "The jury is still out on this.  what I see now is the movies are expensive 4.99 Its nice you don't have to run out to get a movie.  Haven't had a lot of time to play with it, I just got it Dec 29.  I do like the voice part say a name of a actor and most of there movies come up.", "verified": true, "helpfulness": "0/0", "author": "mark s. rost"}, {"rating": 5.0, "review": "Great product. Easy service up and use.", "verified": true, "helpfulness": "0/0", "author": "Harleyfrank"}]