[{"rating": 5.0, "review": "The Fire TV itself is a sweet way to watch your prime videos and digital movies that do not come out in hard media (blu-ray/dvd) sometimes months before they get released. I don't know how Amazon is getting the movies (sometimes not even a month or two out of the theater, but keep em' coming!The OS is fast booting and quick to download/scroll through content. I have never had a loading que as I have had on the completions product, contents loads fast and is for immediate viewing after purchase. I have an 8 year old so one of the first things we bought was the controller and Minecraft pocket edition… so the fire gets used not just by the adults. He even said this is faster and easier than my tablet his only gripe is that it didn't have \"survival mode\" (whatever that is).I have a few comments/concerns:1. The content of Prime media. First, I hope it continues to compete with the competition (N3tflix, Hvlu, etc.). Amazon needs to make it easier to watch/view prime. I have since cancelled my other account since I am already paying for Prime. I have mine setup so to purchase you have to enter a PIN (again I have an 8 year old who will buy anything that looks cool). If it’s free and your device knows it don’t make your user go through to rigmarole like you are buying it (entering the PIN). Please make the PIN only for true purchasing of media.2. Prime music library? Where is it? I get it on my mobile only? Please make it available on the Fire TV So I can rock it on my surround.3. Account linking. My wife has digital media she has purchased and paid for (movies and music). It would be great if there was a way to link (marry) our two accounts so the content shows in the Fire TV. Since it came already linked to mine and the setup and login of her account seems to be a hassle to do over and over this feature would be a great option.4. Add Silk browser! Amazon is missing out. Add your browser you already have (those who don’t know, Silk is the browser on Kindle) to not just shop your site but to add to the use of your product. Have the R&D; make a branded keyboard with a touchpad and voila (there are others out there already), you have a potential way to make your Fire TV product knock out a PC/laptop for easy quick use.5. Is there any way you can add a gaming emulator setup? You have a USB on the back, make it able to take games loaded on a USB (almost like bringing back the old cartridge). Android has emulators for playing of old NES, Sega, and Arcade games this option would be another selling point. I still play my old NES/SNES games, another media to play them on would just spotlight your company’s coolness factor.Ok besides my comments above I have ZERO regrets on buying this product. I still give it 5 stars. My family uses it a lot and I have been able to cancel a few other monthly fee media services due to having it.", "verified": true, "helpfulness": "3/3", "author": "AFWxman"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Santiago Esteban Sojo"}, {"rating": 1.0, "review": "I'm very disappointed.....I still have to pay for (buy or rent) most of the movies or tv shows I've watched as friends tell me the digi stream devices they have cost nothing for movies or tv shows", "verified": true, "helpfulness": "0/15", "author": "susan gayhart"}, {"rating": 5.0, "review": "awesome!!!!!", "verified": true, "helpfulness": "0/0", "author": "Fred Atler"}, {"rating": 5.0, "review": "Awesome except why do I have to unplug and plug in the Ethernet with every use?", "verified": true, "helpfulness": "0/1", "author": "scooter"}, {"rating": 1.0, "review": "Just like the Fire Phone, this allows Amazon to spy on your every move that you do. They gather this information as \"Marketing Data\" and use that to try and sell you other things.Keep in mind that they are using the very same spy techniques that the NSA is using to track Americans digitally.Big Brother is watching you...", "verified": false, "helpfulness": "4/36", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little thing is so amazing I HAD to write a review.  I opened the package, plugged it into the wall, connected it to an HDMI port on my tv and turned it on.  It found my wireless network right away, I input my password and bingo, I was up and running.  The picture and sound are amazing and even though I am streaming wirelessly, it is super fast with no buffering.  I purchased it to use with a non-smart TV with no hardwired access to the internet.  I have a smart tv in another location but this little box is loads faster than my Amazon app on my smart tv.  Well done, Amazon!", "verified": true, "helpfulness": "2/2", "author": "doxiemom"}, {"rating": 4.0, "review": "Thought all movies were available and was disappointed that only the prime ones were on our amazon fire TV, but there seems to be a lot available on prime, just not a lot in the genre i preferred. Most are geared to the very young viewer.", "verified": true, "helpfulness": "0/2", "author": "Verona"}, {"rating": 5.0, "review": "Easy install, easier setup and much faster than Roku. What else need be said?", "verified": true, "helpfulness": "2/2", "author": "E. Smith"}, {"rating": 5.0, "review": "THIS IS THE EASIEST ELECTRONICS I HAVE EVER ASSEMBLED. A GOOD EXPERIENCE AND A WONDERFUL PRODUCT.", "verified": true, "helpfulness": "1/1", "author": "BKD"}]