[{"rating": 5.0, "review": "We have a Samsung SmartTV and 2 x Roku 2's and added the FireTV as an early purchase for a soon-to-be-renovated garage (I couldn't ignore the promotional payment plan plus $15 credit in Amazon videos).The Fire addresses every complaint I've ever launched at Roku and especially Samsung. If you have a SmartTV, you'll be familiar with the absurd home screen (populated with all manner of junk app's, which cannot be moved or removed). The wait-for-Roku experience and the need to point the remote at the box for it to work are intensely frustrating.PROS:+ Voice search is solid. We don't use it much, but when we need it, it works great.+ Low-delay streaming is wonderful - favorite feature. Click and play almost instantly.+ Wireless (not IR) remote - close 2nd favorite feature. No more pointing at a spot on the TV/Roku to find the IR sensor.+ HBO content. I know it's mostly older stuff, but I haven't had HBO for long enough to have watched Sopranos, The Wire, Treme so I am seeing them for the first time+ ESPN - I know this is just the app, but it works almost flawlessly on the Fire.CONS:- Menus are very clean, but all about Amazon. This is expected, but it takes a couple of hops to launch Netflix or Hulu.- HBO-GO... I know this is coming, but hurry up, please! This interface with HBO content is great.", "verified": true, "helpfulness": "0/0", "author": "David P"}, {"rating": 4.0, "review": "I was using a wii for all my netflix adventures but never played the damn thing.  Once I bought this it cleared up space and it's aesthetically pleasing.  I love the design but the one thing I hate is that you can't turn this thing off!  It just automatically sleeps after 30 minutes or so.  What I like about my tv remote is that it gives me power.  It gives me power to turn it on and turn it off, and nobody questions that decision to turn on or off.  The amazon tv doesn't give you that power of authority and control.  The amazon tv is like your friend who says he's 15 minutes away but actually 30.  Aint nobody got time for that!  Aside from that I love it.", "verified": true, "helpfulness": "0/0", "author": "Ed Arlington"}, {"rating": 4.0, "review": "I feel like this review will be slightly biased as I am definitely a fan of Amazon!  I love the Fire TV, it works great, I have had it since Mother's Day or so.  A little over a month.  It's amazing.  There are parent controls so my son can only watch what is on Prime and what is for his level.  Made the mistake of not having parent controls on the Kindle and ended up with $70 worth of games and movies.  LOL.  Although I completely enjoy the Fire TV; there are a couple of things that I would do differently when they release the next version.  I would love the option to start a movie at the beginning or resume where I left off and I have not been able to figure that one out.  The other thing is that the unit takes a long time to power down and sometimes it just stays on after I shut off the television.  I own an Apple TV (although I prefer my Amazon Fire TV for many reasons), and this unit powers down very quickly.  For the cost of the unit, definitely worth it to have all your free Prime stuff in there, along with Netflix and all the other TV options.  Love it!", "verified": true, "helpfulness": "0/0", "author": "jen"}, {"rating": 1.0, "review": "The Netflix app keeps going out and I had to call amazon for help to get it to work again wish I had never got it", "verified": true, "helpfulness": "2/4", "author": "jon rains"}, {"rating": 3.0, "review": "Bought Fire in April. Love it when it works. When watching Netflix though it reloads multiple in one show. It's like it's constantly rebuffering.  So frustrating. Right now trying to watch \"Orange...\" and it has reloaded about every 3-5 min. Holy Cow Amazon...work the bugs out before you roll it out to the public!", "verified": true, "helpfulness": "0/1", "author": "dianne"}, {"rating": 1.0, "review": "Well everything I wanted to see on Amazon fire TV  either cost me for rental or for buying it all I found one movie Jewel of the Nile which did not cost me anything but other than that even TV programs wanted to charge me for and I have a prime membership was very disappointed", "verified": true, "helpfulness": "2/6", "author": "Carol A. Moneymaker"}, {"rating": 3.0, "review": "I was super excited when this box was announced, i love amazon prime video and lamented the lack of access to it on the other boxes i've owned.  (i've owned a lot of them and generally settle back on the appletv).The good: this thing is fast, it's open to an extent, it's got an app store, it's got access to netflix and prime video..  AND you can install xbmc on it. did i mention it's fast?the bad: it's totally unfinished, the netflix interface sucks, the plex interface sucks, there are tonnes of slowdowns, searching amazon media is lame.  it's just using old googletv apps and they're obviously old. amazon didn't do enough to get involved with the companies making the apps that they touted as great on the firetv.  the remote is neat but annoying, don't leave it on the couch next to you because your cat, your kid, your spouse, your book or anything else anywhere near your remote with press fast forward.the UGLY UGLY ANNOYING AWFUL:  5 MINUTE UNSKIPPABLE VIDEO TO USE THE PRODUCT.  wtf.  i had to factory rest and apparently it's the norm because all of my friends who own the firetv have had to do it at least once. also,  it really is obviously not finished.so, while this a fantastic streaming box. it's got a lot of problems and probably shouldn't have been released for a few months.  if apple comes out with an app store for the appletv, we'll be going back to that.", "verified": true, "helpfulness": "1/3", "author": "morgan"}, {"rating": 5.0, "review": "It is great for watching Amazon Prime TV and Netflix! I use this to watch my favorite shows, and they are easy to install and watch. It has a great microphone feature, where you can speak to the remote and it will search movies and TV shows without typing on the screen. Definitely recommend!", "verified": true, "helpfulness": "1/1", "author": "JMac"}, {"rating": 5.0, "review": "I have 2  other products similar to this. I find this to be a better quality product. If you have to replace any of the 2 other  products. Buy this one.", "verified": true, "helpfulness": "0/0", "author": "Larry D Franklin"}, {"rating": 3.0, "review": "I have had my Amazon Fire for 5 days now and here is my **Pro** and **Con** List:**Pros**: + + Very slick / Nice Packing / Voice Recognition works well with Amazon (not other apps) / VERY Fast / Does not reset over and over like Roku Products / Some good apps like Hulu and Weather 4 Us I had on Roku**Cons**: - - Shockingly !! - No App for me to get to my Amazon Music (Yet ??) :-(  / Some TV Speakers are nortoriously bad - like my Samsung HD / **No way**  to simply plug in my old quality Marantz Amplifier and Speakers ... all they support is \"Optical Audio\" what only Optical Audio .. no adapters etc... ? All I can do now is stream Pandora via my aweful speakers... so it's back and forth from my Roku (music quality Audio) to my Slick Amazon Fire TV (lousy audio). I am shocked in their rush to get this out Amazon Amazon in their wisdom did not think of these two important key areas of Multi Media / TV enjoyment !!OK for me the jury is still out - OK Amazon - Let's see if you correct these two product BIG shortcomings (# 1 No access to MY music and no external connectivity to my Amplifier (via an adapter)) One Minor Issue - No Acorn App for us who love Brittish TV.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Marathon Man\""}]