[{"rating": 5.0, "review": "The fire tv was easy to install and very easy to pick what features you want.  Movies, TV, I was up and running within 5 minutes of opening the Box.", "verified": true, "helpfulness": "0/0", "author": "Henry J. Isler"}, {"rating": 5.0, "review": "Enjoying new Fire TV. I've been using it non stop since I bought it.It much easier now to reach my Netflix and other entertainment accounts.", "verified": true, "helpfulness": "0/0", "author": "prjag86"}, {"rating": 4.0, "review": "Works great, with occasional streaming delays. Now we'll see what happens with the new FFC's ruling withe", "verified": true, "helpfulness": "0/0", "author": "Attzje Deubach"}, {"rating": 4.0, "review": "I've been very happy with my Amazon fire TV with one exception . I am having occasional problems with the mirroring function on my Samsung ES 8000 60 inch TV which is routed through my Denon receiver as part of my home theater system. Other than that the fire TV video quality and sound quality is fantastic and the user interface is very easy to use . Once you login to all your accounts the first time , you need not do it again, as your accounts can be accessed through the fire TV box without having to sign in again each time . One other thing is that the resolution and quality of the screensaver photos is astounding . The FireTV has the highest quality screensaver photos I have seen anywhere and it is the best pictures I have ever seen on my television set . Apple TV screensaver can't hold a candle to the fire TV screensaver . My only complaint is that you can't run the screensaver indefinitely . It shuts off after about half an hour", "verified": true, "helpfulness": "0/0", "author": "Bill Denton \"willyiam\""}, {"rating": 1.0, "review": "Over advertized - half of the movies you have to rent or pay for.  I already have a netflix account and that seems to have more options that the amazon fire.Very disappointed.  No kids movies to stream off prime which is primarily why i bout the fire.", "verified": true, "helpfulness": "1/1", "author": "Cory T."}, {"rating": 3.0, "review": "It does everything a smart TV does. Onto other hand, if you already have a smart TV (as I do) it's not much use.", "verified": true, "helpfulness": "0/0", "author": "Cinema Cornucopia"}, {"rating": 5.0, "review": "EASY SETUP WRKS GREAT", "verified": true, "helpfulness": "0/0", "author": "Kent E. Rice \"Rx\""}, {"rating": 4.0, "review": "I think the hardware is snappy and fast. However my main gripe is that the search command only works on the \"home screen\" that highlights amazon prime content. Although that makes sense since this is an amazon product, I wish to have the capability to use the search command while inside other apps such as Netflix, Youtube etc. Not enabling this really defeats the purpose of Amazon \"fixing\" the search command other streaming devices have. Otherwise I'm pretty happy with FireTV.", "verified": true, "helpfulness": "0/0", "author": "Hubert Asuncion"}, {"rating": 5.0, "review": "Works great easy set-up.", "verified": true, "helpfulness": "0/0", "author": "Laker"}, {"rating": 5.0, "review": "I am enjoying my Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Hayden Bowers Jr"}]