[{"rating": 4.0, "review": "Good product, we like it so far. As a Prime member I would like Amazon to add the search by genre for Prime videos. We've had to restart the device twice since we started to use it.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "Out of the two weeks I've been using (or trying to use) the Stick it's worked about one-half of the time.  One day it works fine, the next day, for no apparent reason, either very slow or no loading with the message \"check your connection\".  The only way to remedy the problem, I found, is to disconnect the power cord from the stick for a few seconds, reconnect it and hope for the best.  Sometimes that works, sometimes not.  Not what I'd call user friendly.  My TV is only 6 - 8 feet from my router so no distance excuse there.  Yes, it is only a wireless USB adapter and maybe just not capable of effectively transferring the data.  I'll give it another week and if no improvement return it and go back to the HDMI cable.  Not as convenient but much more reliable,  and better for your health.", "verified": false, "helpfulness": "0/0", "author": "John P. Burgess"}, {"rating": 5.0, "review": "This thing is amazing.  We were using a Wit to get Netflix on our TV  that was very cumbersome to say their least.  Hooked up a HDMI cable that I had (no included) and setup my router then watched some instructions included.  I then gave the remote a voice command \"Netflix\" and it was up and running and more from Prime Amazon.  This is some nice new technology making user friendly hardware and software.  I hid the small box behind the TV and  there was no problem finding my router whicheck is located on other side of home  Nice job Amazon.  Completely satisfied with this buy.", "verified": true, "helpfulness": "0/0", "author": "golden"}, {"rating": 3.0, "review": "Easy setup.does what it say it will .prime has to update there movies more often then it would be a better buy", "verified": true, "helpfulness": "0/0", "author": "laura shannon"}, {"rating": 3.0, "review": "I liked this product's interface but decided to return it for two reasons. I discovered that the voice search only works within the Amazon prime content. I also discovered it didn't offer Funimation. Funimation wasn't a huge deal, but the voice search restriction was. The other apps like Netflix and YouTube cannot utilize the voice search feature at all. Voice search was the primary reason I bought it, so I was disappointed. The interface, in my opinion, is better than that of my Roku 3, but without system wide voice search and missing channels, I didn't see the point in switching. I will definitely keep an eye on it to see if future versions add in more channels and offer some way to use voice for all apps within which you can search.", "verified": true, "helpfulness": "1/1", "author": "mish \"mish\""}, {"rating": 5.0, "review": "For now I am a happy camper.  My son got the Fire TV as a Christmas present for my wife....Saved me the trouble of getting it.  I hooked it up and we both love it.  Took a little working with Amazon to get Netflix working, but after I disconnected the Fire TV and the Router and then reconnected them, things went smoothly.  The wife has watched a movie or two from Amazon Prime and Netflix.  The Voice Search function seemed to work in Netflix just like it does in Amazon Prime videos.  Will play this lots more I am sure.One question I had prior to actually using the Fire TV was about VUDU.  While I have not found VUDU yet, Amazon does have Flixster and thru them I have access to all my VUDU moves as well.  What a good deal.......As I have all this capability in the living room thanks to my PS3, but now we will have access to lots of streaming videos via our Fire TV.I did notice there is no \"Off\" button.  I guess we are suppose to leave it on all the time, like our router.  Picture looks great and the videos loaded really fast.  A very fine Christmas present, thanks son!Updated: The other day I discovered that I can access my Amazon Prime Music.  I have hundreds of songs on my HTC-One that I downloaded via the Prime Music program.  I listen to music while I walk.  But now I can access those same songs and playlists via the Fire TV.  Wow!  The sound was very good.  I see a soundbar in the future for my wife's tv (using the optical sound link).  Still loving this device.", "verified": true, "helpfulness": "1/1", "author": "Coach D \"Coach D\""}, {"rating": 2.0, "review": "Seriously. Bluetooth. You'll have to root the thing to get it to see a Bluetooth headset. come on amazon get with it, you advertise Bluetooth capability and it only recognizes your game controller. Games suck.If you insist save the money and buy the stick, can't see the value in this. Oh I forgot you can talk to the remote and tell it to do what.......as usual another product released to earn revenue before it is ready. Much needed improvement to earn this price point. They brag about added memory and processor speed, to be used for what! Two stars are a gift....", "verified": true, "helpfulness": "1/4", "author": "Michael"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "jessica"}, {"rating": 5.0, "review": "We made the decision to cut the cable this past month. We looked at various options to give us the most viewing options at a reasonable cost and came to the decision to purchase the Fire TV box since we are already Prime members and felt we could use the options included with the unit to their full advantage. We are very happy with the decision. It was extremely easy to set up with the enclosed instructions and have purchased an internal antennae to give us access to our local broadcast stations. This move will ultimately save us a substantial amount of money over the next year since our annual Prime membership, Netflix subscription, and the one time cost of the box give us all of the choices we are looking for. We have been experimenting with adding the different Apps available and using our tablets and phones to also stream content through the device.This is an excellent option if you are looking to cut the cable and still give a broad choice in viewing programming.", "verified": true, "helpfulness": "2/2", "author": "Tom Van Norton"}, {"rating": 4.0, "review": "works great. still figuring out programming", "verified": true, "helpfulness": "0/1", "author": "erin hanlin"}]