[{"rating": 5.0, "review": "This product makes the transition from cable every so easy! Set-up literally took minutes. We chose to use Sling TV which provides a very good representation of some of our favorite  programs. Our antenna, purchased from Amazon, allows us to watch CBS, NBC, ABC, etc.  The only things we are missing  are the high cable bills.", "verified": true, "helpfulness": "1/1", "author": "Casey"}, {"rating": 5.0, "review": "love love love", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I use it all the time. You can watch YouTube videos if you download the app. The only bad thing is that the signal from the Kindle Fire is not too good. It will drop several times if you try to watch long videos.", "verified": true, "helpfulness": "0/0", "author": "angelica"}, {"rating": 5.0, "review": "It's amazing, This box is the greatest!", "verified": true, "helpfulness": "0/0", "author": "archerycook"}, {"rating": 3.0, "review": "Actually, my 5-year old Roku offers more.", "verified": true, "helpfulness": "0/1", "author": "D'King \"legible\""}, {"rating": 1.0, "review": "The Fire TV doesn't buffer enough to stream anything wireless when you are on a 3 Mbps CenturyLink DSL line without any other devices taking up bandwidth.  It's useless if other devices (wired or wireless connection) are using any bandwidth and all it does is buffer (spin) and present a message to retry, connect to wireless, or cancel.  It takes all the fun out of using it - maybe I'll try the Xbox and see where we go.It was easy to install - playing with the remote to figure out how it really worked (the on-screen intro wasn't helpful) was challenging. The voice -activated search is cool but you have to know what to say, such as the TV channel you want first and not the program you want until you have the channel up in front of you.", "verified": true, "helpfulness": "0/2", "author": "J. Elmer \"jelmarie\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Ralph Green"}, {"rating": 4.0, "review": "The remote could use some work, I found it can't link with the box at times, when it happens I use the android remote app on my phone to restart the box and force a re synch... also I would like the remote to have a sleep/power button instead of holding the home button.", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 5.0, "review": "We seriously considered the Chromecast, but I wasn't thrilled having to use my cell phone or tablet.  So far, the Fire TV has been fantastic.  Literally less than 5 min to connect to my home wireless.  I love that content is delivered in 1080p.  Love that the remote is voice-enabled.  Watching the second season of, Justified, now.  We've barely scratched the surface on the different apps.  Definitely a winner.  If it wasn't for NFL Sunday Ticket, I'd drop my satellite in a heartbeat.", "verified": true, "helpfulness": "0/0", "author": "Crutch"}, {"rating": 5.0, "review": "MUCH BETTER THAN THE APPLE TV THUS FAR. WE SHALL SEE HOW THE BATTLE PLAYES OUT OVER THE NEXT FEW YEARS.", "verified": true, "helpfulness": "0/0", "author": "Shannon Faulk"}]