[{"rating": 5.0, "review": "I like it a lot and very pleased with the amazon fire the best great job. Very excellent products great job.", "verified": true, "helpfulness": "0/0", "author": "Mostafa K.  Hafez"}, {"rating": 5.0, "review": "We went from Google TV to Amazon Fire, Wow what a difference. While we lost the ability to surf the internet the fire box is three times, if not more, faster in every respect. I read many posts about how clunky the remote is and I just have one word, \"Simple\". From the voice command, which does only work for Amazon Prime currently, to navigating it's just simple! Anyone who has seen the Sony remote for Google TV knows what I mean. Customer service is superior. We have two Fire boxes in our home and one gave us a msg. to call customer support. I clicked on the number, on the screen, and within 20 seconds my phone rang! Within 2 min. the concern was corrected. Now that's Quality! Highly recommend!!", "verified": true, "helpfulness": "1/1", "author": "Cory Bome"}, {"rating": 4.0, "review": "The Amazon Fire TV is a nice kit. It does what it is designed to do, stream content to your television (Amazon Prime, Netflix etc.). It also allows one to play some casual games, although I wasn't able to try this out because I did not have the game controller.The hardware is nice, both the box itself, a small thin black square, and the remote. The height of the box is shorter than an Apple TV/Roku and there is a small white light in front that indicates when it is in use. The remote is a good size, very light and has a grippy, smooth rubber exterior. The real advance of this remote, compared to other streamers, is the voice search which is activated by a button on the remote. This worked as advertised and was actually useful in that it helps gets around the now common issue of using a remote to peck out your search via an on screen keyboard. It never had a problem finding what content I verbally requested, regardless of whether it was actually available. Admittedly, it is a little strange to speak into the remote at first, but over time one grows accustomed to it. This is a positive advance for the content search process on a streaming box and would be a great feature to have for any content search performed on the television screen.The amount of content available is good if you have Amazon Prime and/or Netflix, with the exception that no iTunes content is available (if you partake in that ecosystem). The amount of stuff available seems to be increasing regularly (Amazon Prime+Amazon), so it seems there is real commitment to make the Amazon Fire TV competitive with other services. And it seems there will be exclusive content available for Amazon Prime users in the near future, further indicating a commitment to content by Amazon.Overall, Amazon has created  a nice streamer. The software/interface is pretty straightforward and easy to navigate. Only occasionally are there interface stutters, but only the most devout of the technounion would be concerned with this. The content available is good and the possibility of playing casual games is a nice extra that would have been fun to try out.If you are not heavily engaged in the Apple ecosystem and are looking for a solid streaming box, you would be happy with the Amazon Fire TV. And for those with tons of their own content, the availability of Plex for Amazon Fire TV is a helpful feature.The only issue is that it is still early in the game with these streamers (Apple TV, Roku, Chromecast etc.) and it's hard to say how it will all work out. But if you want something now, at this point, the Amazon Fire TV coupled with Amazon Prime, is as good a bet as the others.", "verified": true, "helpfulness": "1/1", "author": "Lando"}, {"rating": 5.0, "review": "Fire TV is so easy to use.  Set it up quickly.  It is especially nice to use when there is nothing on regular TV.  Hope to be able to travel with it.  It is very small and compact.", "verified": true, "helpfulness": "0/0", "author": "LisaC"}, {"rating": 5.0, "review": "So easy to set up...also has built-in how-to video.  Love the remote control and so simple to operate.  Makes selecting a movie or TV show to watch so easy.  Since my TV was not originally set-up to get Amazon Prime & Netflix, Amazon Fire TV now makes it possible to access  them on this older TV.  Also, very pleased with the price of Amazon Fire TV.  Also love the compact size.", "verified": true, "helpfulness": "0/0", "author": "janb"}, {"rating": 5.0, "review": "works with xbmc which is why I wanted it. Works well with Amazon prime video too. Kids love the voice command feature", "verified": true, "helpfulness": "0/0", "author": "Jan Squirrel"}, {"rating": 5.0, "review": "I love this! I have told all my friends about it and urged them to get one. I love being able to watch things on the big screen and having so many things to watch. It's great.", "verified": true, "helpfulness": "0/0", "author": "Penelope Drummond \"Penny\""}, {"rating": 5.0, "review": "I've looked at several of the these type of systems since I got rid of my cable TV and Xbox. This is the one I picked and my kids got it for me for Father's Day! I really like it; however, there is one problem. It came with no HDMI cable! It might as well be a boat anchor without an HDMI cable. I happened to have an extra, but it didn't work (too long at 13' or too old at about 4 years). So, during a very busy schedule I finally managed to get to the store about three days later, purchase the cable for $16 and hook it up. It's great. But why is that cable not in the box with the rest of the Fire TV components? Who wouldn't pay a few more dollars to have the complete hardware for hook up? I imagine that the same cable from Amazon is a fraction of the $16 I spent for the cheapest one at the store. I'm an Amazon fan; we get Prime every year. So why no HDMI cable so one may easily complete the installation?", "verified": true, "helpfulness": "0/0", "author": "Larry Vincent"}, {"rating": 5.0, "review": "We love our Amazon Fire!  It is amazing!  We have been watching movies and tv series everyday!  Great! Thinking about ordering another one for another residence!", "verified": true, "helpfulness": "0/0", "author": "Melanie s mote"}, {"rating": 5.0, "review": "So a little back story, I had a PS3 (one of the originals) it finally died. Instead of getting a new gaming system or some crazy expensive Blu Ray player, I got a cheap Blu Ray player (in case it breaks again) and the Amazon Fire TV.One of the things I couldn't stand about my PS3 is that on every movie or show I watched, it either took forever to load, or kept freezing. Drove me nuts. So far (and I have only seen two movies and 5 shows on it) the Fire TV hasn't even come close to freezing and loads right away. Grant it, I am sure it will at some point down the road, but so far, and overall, sooooo much faster.I have never had a Roku or Apple TV or anything like that, but I couldn't imagine them being any better than this, but that's just me.It's easy to install, easy to set up, controls are easy, interface is mostly good (get to the bad in a second) and the search function is pretty cool (as long as you know what you want).Things that are not so great: You can't search all the Prime movies or shows. You can search Prime new releases and top shows or top movies, but all the other ones you would have to find and see if they are free. Now for me, it's not a big deal, since most of the ones outside of those two topics, I probably won't bother with. But I could understand how it annoys people. It's a simple fix that I don't know why Amazon hasn't fixed yet, and they probably should soon.The only thing that is weird (and not bad) is that you don't turn it off. According to the packaging and reading online, it goes inactive after 30 minutes and you just always leave it on. As a person who has always turned things off after he was done with it, it's just strange to get used to. Plus that tiny light is always on and just catches my eye a lot. It's not a bad thing, just weird to get used to.Other than that, the product is amazing and if you are shopping between this, Roku and Apple TV, I would pick the Fire TV, especially if you have a Prime account. If you have one of the others and it works, you probably don't need to switch to this, unless of course, you just got Prime and want a product integrated with it.", "verified": true, "helpfulness": "0/0", "author": "jay"}]