[{"rating": 3.0, "review": "I've been using this since April and while initially I loved it.  We had been using a Roku for the past 2 years and since the majority of our streaming is through Amazon, I felt this would be the perfect device for us.  It was super easy to set up and the user interface is slick.  The caching is fantastic (no more waiting for frequently watched shows to load - Yay!).  The voice search is cool and flashy, but not a seller for me.  The remote is neat, small, and has a nice weight to it; however, I have almost thrown it several times due to the shape (it just slides out of your hand).For the first 3 months it has worked seamlessly and we had no complaints.  However, starting mid July it has become rather 'flaky'.  I had rented a movie to watch but it wouldn't play it.  I then tried a new series that I had bought as well, still got an error stating that it could not play it.  Rebooted the device but still it would not play the new shows.  Unplugged it and plugged back in the Roku and had no problems watching either the movie or the TV show.  Now, it's a 50/50 chance that I can watch anything through this device, and as such, we've switched back to the Roku and have had no issues viewing any of the programs through Amazon.  If I had reviewed this when we first received it, it would have had 5 stars, unfortunately, it now receives a 3 star review.I thought it might need an update, so I attempted to find a screen where I could see the version of software/firmware and check for an update.  I've been unsuccessful to date.  Has anyone else found this?Review Breakdown:1 star for performance (after using it)3 stars for ease of set up3 stars for user interface3 stars for the cachingI love Amazon's products, so I am very sad that I can't say that I love this one.  Hopefully there will be an update soon that will fix my issues.", "verified": true, "helpfulness": "1/1", "author": "Jennabean"}, {"rating": 3.0, "review": "This is good for all the movie apps thats why I gave it 3 stars. If you want Crunchyroll or funimation look else were the amazon fire dose not support any anime but Viz app.", "verified": true, "helpfulness": "1/2", "author": "Arron Mc Neill"}, {"rating": 1.0, "review": "It was not what I expected, what it is shown is not what you get", "verified": true, "helpfulness": "3/22", "author": "Mario Barahona"}, {"rating": 5.0, "review": "In a market filled with the apple tv, the Roku box and other various imitators, we find the Fire TV. I already own several devices that do mostly the same thing as this unit. I am a technology junkie so I had to try the lasted and greatest. To be honest, I was not expecting much. I was looking forward to games.When I got the unit, I knew that I would be using it all the time at first as I have to play with the new gadget. The real test was going to come after the \"honeymoon\" was over.I still find myself using this device more than the other devices I have. It is nice to have my prime, netflix, and music on one device. Also, I am addicted to the hill climber game.", "verified": true, "helpfulness": "0/0", "author": "Danbert"}, {"rating": 4.0, "review": "So far it is excellent.  All the problems I'd had with my Roku and Blu Ray apps are addressed here.  Excellent performance.  Nice GUI.  Easy setup.  Very pain free all around.  A few requests.Extend voice tool to all apps.  Having it tied to Amazon only is a bit of a nuisance.A Vudu app would be nice.  I have all my Ultra Violet titles set up with them.  And since I bought the discs off of Amazon.....A Kindle app would be nice for picture books and comics.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Alan\""}, {"rating": 2.0, "review": "I realize the Fire TV is new but currently there is not enough app support.  Things like support  for NFL Sunday Ticket for Tablets would be a game changer with the season coming up.  This is available for the kindle fire so I hope it is coming soon.  The Fire TV also could use an updated remote with mouse support.  The reason for many apps not being compatible is they require a mouse to use.", "verified": true, "helpfulness": "1/2", "author": "J. Blizzard"}, {"rating": 3.0, "review": "Works well, easy to set up , needs more free programing. No power button to turn it on and off.", "verified": true, "helpfulness": "0/0", "author": "Trikerjon"}, {"rating": 5.0, "review": "It's good!👍👍", "verified": false, "helpfulness": "0/0", "author": "meriyanti wattimena"}, {"rating": 4.0, "review": "Amazon makes a quality product.  Extremely easy to set up and use.  Does a very good job with voice recognition.  Both the remote and the box are very good quality.  I would have given this 5 stars but an HDMI cable should come with it because it is required to use the device.  It DOES tell you this is not included but it is required so it should be part of the package.  The optical audio cable is what should be an optional puchase.", "verified": true, "helpfulness": "0/0", "author": "Traveler"}, {"rating": 4.0, "review": "Voice search only finds programs for sale on amazon.  It does not find things on Hulu or Netflix.", "verified": true, "helpfulness": "0/0", "author": "Marshal Giggleman"}]