[{"rating": 5.0, "review": "This is the most awesome device ever created, well....except for my Kindle Fire.", "verified": true, "helpfulness": "1/1", "author": "Deborah Bighouse"}, {"rating": 5.0, "review": "This is hands down the best streaming device (at least for my needs)This little box is pretty powerful and its a great Plex client, if you have prime its even better!!", "verified": true, "helpfulness": "0/0", "author": "Patrick F."}, {"rating": 1.0, "review": "Setup was obnoxious.  Noway to skip the stupid tutorial... bad first impression.Seems to lose connectivity and have wifi connectivity issues in general.  We have two Rokus that we have never had to reset or reconnect to wireless.  Already have rebooted the Fire Stick 3 times and had numerous headaches getting it onto wireless.The stock remote is awful.  It jumps multiple spaces constantly making entering data impossible.  I spent 5 minutes typing credentials for each service... awful.There's no app in the apple store.  Thanks.We are prime users and like a lot of what Amazon offers.  This is a dud... was not worth the 20 bucks paid.", "verified": false, "helpfulness": "1/8", "author": "Lisa Jackman"}, {"rating": 5.0, "review": "This device is excellent.  I couldn't be happier.  Thanks AMAZON....", "verified": true, "helpfulness": "0/0", "author": "Stephen K. Miller"}, {"rating": 3.0, "review": "This is one of those items I wasn't sure of.  My husband told me he ordered it and at first I was like, seriously, its going back.  But with 2 young kids, this does allow them to watch the items from our Kindle on a tv in a different room that doesn't have cable hook up.  So it didn't go back, and its the only reason I kept it.  I do wish he would have done a little more research.  This little box was $30 cheaper on black Friday and now they sell a stick for a quarter of the price that does pretty much the same thing.  Sometimes you have to pay for stupidity, and this time we did.  Bright spot is it gives us 20 mins away from the kids to yell at each other rather than yelling at them all the time, so there you go!", "verified": true, "helpfulness": "0/5", "author": "Georgean78"}, {"rating": 5.0, "review": "I love this!  Easily installed and even easier to use.  LOVE IT!!!  We have been enjoying watching what we want, when we want.", "verified": true, "helpfulness": "0/0", "author": "Janice Moland"}, {"rating": 5.0, "review": "Its amazing i love it you can watch amazon movies prime and you can rent movies from amazon and you can watch netflix & hulu & showtime and more amazing appAnd if you have kids you can turn on kids mode and you can play game with fire controller but the fire tv Does not work in many countriesIf you have any questions and if you want to help you about how to work  in your country tell me last think if you want enjoy buy amazon fire tv its a best", "verified": true, "helpfulness": "0/0", "author": "Abdulrahman A."}, {"rating": 4.0, "review": "We chose Amazon Fire TV because I already am an Amazon Prime member so I get Amazon Fire TV included. I like it better than \"Comcast on demand\" because Amazon formats /movie information at your fingertips, with a picture without searching titles & having to click & read the info then go back etc. If I am \"binge watching\" show, Amazon automatically loads the next episode without having to go through so many steps that Comcast requires.  My only complaint that it shows my recent purchases. I don't want these on my TV for all to see, especially when it is a gift; which was seen by my family member. I would also like to be able to upload my own music to the Amazon Music section, but it only loads music bought through Amazon. Not being a computer whiz, I could be mistaken.", "verified": true, "helpfulness": "0/0", "author": "V. Sayles"}, {"rating": 3.0, "review": "Why can't I take advantage of the $40 discount Special (Fire TV and 1 Yr Prime)?  The Cart won't accept the offer as I already have Prime membership.", "verified": true, "helpfulness": "0/2", "author": "G. Puent"}, {"rating": 5.0, "review": "I love my Amazon Fire TV.  Great array of apps, gives me access to all my PBS favorites, is fast, provides great value to my home theater.  Oh, I never thought I would use the voice search, but I do.  It is the best voice interface I have ever used.  I would recommend this item.", "verified": true, "helpfulness": "0/0", "author": "P. Stiefvater"}]