[{"rating": 5.0, "review": "I had an old LG Blu-ray player that was also my streaming player, but it started having issues sync'ing the audio and video, so Santa stepped in and gave us the new Amazon Fire.First impression is how small the box is. It's tiny (about 2 packs of cards side by side), so it is possible for the cables to twist the box during install. But once its installed, it worked first time, I was able to access all my Amazon content and Netflix too. Has several apps available and can easily download more. There's also a handheld video game console you can get for gaming.Picture quality and sound is true HD and the device is very responsive.BUt, and for me this is HUGE, I work in IT/Telecoms, and even did some under-grad time working on voice recognition software, and I also have quite a strong regional accent, and Amazon Frire can understand me. The first device to do so consistently ever. I'm well impressed. Just press the button and say something about the film, title, actor etc. and fire immediately gives a list of options.If you want a streaming device, I strongly reccommend Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "wattsie"}, {"rating": 4.0, "review": "I got this just to watch Prime video and honestly that's about all it's good for.  If you already have a way to watch Prime Video you don't need this thing.  If you already have Prime and you need to have a way to watch Prime Video then this is certainly a decent option.  I hear the fire stick works well and it's a bit cheaper but this one isn't much more.  I got it refurbished for $79 so the price was reasonable.  I looked and looked but couldn't find any evidence this thing had ever been opened much less refurbished.  All in all I'm happy with Prime Video and the Fire TV.", "verified": true, "helpfulness": "0/1", "author": "Robert B. Hamilton"}, {"rating": 2.0, "review": "Very disappointed; should have heeded some of the negative reviews before buying this. Good luck \"disconnecting\" from cable/satellite services. Aside from my Amazon Prime benefits and my purchased music, there isn't much here. Basically, just turns your TV into an Android device. Have found very little that you don't have to purchase. BBC News (free) is about the best thing, so far, along with the free TuneIn app for radio streaming, which I use constantly on my tablet. Nice to have it on the TV so I don't have to bring the tablet with me.", "verified": true, "helpfulness": "0/3", "author": "Ziggy"}, {"rating": 5.0, "review": "Fire TV is sweet.", "verified": true, "helpfulness": "0/0", "author": "bk"}, {"rating": 1.0, "review": "Constantly buffers.", "verified": true, "helpfulness": "1/3", "author": "Joshua Moore"}, {"rating": 5.0, "review": "After 5 frustrating days of trying to cope with a Chromecast, I gave in and spent a few more dollars for the Fire TV...and I'm damn glad I did.  It has worked so well...and got me thru several days of the holiday season while I waited for Comcast to open again to replace a set top box so I could begin to enjoy services not yet delivered.I haven't had the opportunity to explore all the services available thru the Fire, but of those I have, I'm quite satisfied.", "verified": true, "helpfulness": "0/0", "author": "Crosbo"}, {"rating": 3.0, "review": "I was really shocked at how few free movies are available, even with my amazon prime membership.  I tried about ten non-recent movies in a row (godfather 2, chicago, etc) and they were all 3.99 (!?!?!?) Rental.", "verified": true, "helpfulness": "0/0", "author": "Sedmai \"Sedmai\""}, {"rating": 5.0, "review": "Good.", "verified": true, "helpfulness": "0/0", "author": "Sahak G."}, {"rating": 5.0, "review": "100% Satisfied", "verified": true, "helpfulness": "0/0", "author": "Alex Blankenship"}, {"rating": 1.0, "review": "The ad does not disclose that all Netflix movies involve a payment for the same movie and multiple others that can be seen on Netflix through a Smart TV for free except for the Netflix monthly fee.", "verified": true, "helpfulness": "1/3", "author": "Shirley H. Isbill"}]