[{"rating": 5.0, "review": "It  is a Great device, The voice search works Great!", "verified": true, "helpfulness": "0/1", "author": "Don Alba"}, {"rating": 3.0, "review": "Didn't really see any I would want h.  We'lol have to get Netflix to get better movies.", "verified": true, "helpfulness": "0/3", "author": "Hartlady"}, {"rating": 3.0, "review": "I have several Amazon Fire TVs and this one appears to have video stuttering.  I will reset the device and start the setup process again.  There was no indication that this was a refurbished unit at point of sale.  If this is a refurbished unit, then the quality in not good.", "verified": true, "helpfulness": "0/1", "author": "Lee M Lannert \"Lee\""}, {"rating": 4.0, "review": "the easiest installation of an electronic device ever!!! One day nation broadcast tv will be available then it will be perfect.", "verified": true, "helpfulness": "0/1", "author": "William Mason"}, {"rating": 5.0, "review": "Love it so far - finally getting caught up on my binge Amazon Prime viewing!", "verified": true, "helpfulness": "0/1", "author": "Elizabeth"}, {"rating": 4.0, "review": "I works great, voice command and actor search are great features. Downside is that Netflix loose it's signal occasionally. This does not happen with Apple TV or Blu-ray.", "verified": true, "helpfulness": "0/1", "author": "C. Cox"}, {"rating": 5.0, "review": "Very good!!! :D", "verified": true, "helpfulness": "0/1", "author": "Jose S."}, {"rating": 4.0, "review": "Love the voice search mode.  Easy enough for my 6 year old to use.  Great product and beneficial  to those of us who have ditched cable.  With this I can access Amazon Prime, Netflix, and Sling TV.  Can't beat the price either!", "verified": true, "helpfulness": "0/1", "author": "TXMOMOF2"}, {"rating": 4.0, "review": "needs to be restarted too frequently", "verified": true, "helpfulness": "1/2", "author": "Nicole"}, {"rating": 5.0, "review": "Who needs cable when you have Fire TV", "verified": true, "helpfulness": "1/2", "author": "MM"}]