[{"rating": 5.0, "review": "I love my Fire TV units. I have 3 boxes and they play Netflix, Amazon and Hulu programs much better than my wifi ready blu-ray players. Programs do not pause for \"loading\" as often as they do through the blu-ray DVD players.", "verified": true, "helpfulness": "0/0", "author": "Eric Anderson \"Gage Man\""}, {"rating": 5.0, "review": "This works excelllent and i'm very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Alison"}, {"rating": 4.0, "review": "It works very well most of the time. It has required a couple of \"power down reboots\" to get it to function normally again. Once you cycle the power it is back to normal. If not for that I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Steven Leese"}, {"rating": 1.0, "review": "does not work in my area", "verified": true, "helpfulness": "0/1", "author": "RYAN VICTOR"}, {"rating": 3.0, "review": "I like the visual display of the amazon fire more than Roku 3. Downside is that the movies are not separated from the one's included for free per amazon prime and the rentals. You will not know until you click on the movie. The movies and tv shows included with prime are mostly really old ones.", "verified": true, "helpfulness": "2/2", "author": "Cassandra Barnard"}, {"rating": 3.0, "review": "The software is too limiting. It locks you into an experience that just isn't ideal for any but the most basic functions. The firmware, software, app store, etc. are all tightly controlled to ensure you remain within someone else's idea of a good experience. If you don't mind paying for a powerful computing device that has been intentionally crippled then it's not all that bad. I just prefer to create and customize my entertainment experience with complete access to the computing power I pay for.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Salvador hernandez"}, {"rating": 1.0, "review": "Complete garbage, I'm on my second box and have had nothing but problems with both of them. Constantly says it has no internet connection even though it's hard wired directly to my uverse router/modem. Internet tech has been out and says my internet is just fine and has no problems. I also have no issues at all with any other device I use with my internet service. $99 I wish I never spent. Would not recomend this product to anyone.", "verified": true, "helpfulness": "3/4", "author": "douglas ducharme"}, {"rating": 1.0, "review": "Had to return unit to Best Buy, very slow processor. Changed places with my original unit and problem followed the new part.  My ordinal box works great, but second one had an obvious issue.", "verified": true, "helpfulness": "1/2", "author": "Mark F. Henderson"}, {"rating": 5.0, "review": "Awesome with tv add ons", "verified": true, "helpfulness": "0/0", "author": "josh britt"}]