[{"rating": 3.0, "review": "Amazingly simple to set up box. Impossible to know what movies are free with \"prime\" membership except for a few show on the content listing.", "verified": true, "helpfulness": "3/4", "author": "Richard J. Towell"}, {"rating": 5.0, "review": "This product has been exceptional – very easy to install and simple to use.  The interface and menu, including the voice commands work very well - very intuitive. I have not encountered anything that is a negative on the product. I highly recommend it!!", "verified": true, "helpfulness": "0/0", "author": "Daniel Ray"}, {"rating": 5.0, "review": "Very satisfied with my Amazon Fire TV and it was such a cinch to set up that my 10yr old did it with no issues or questions what so ever.", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 4.0, "review": "People may think I am stupid, but to each his own... I don't watch t.v. , however I am a video game tester and electronics junkie ! I own almost every cool piece of gaming tech out there from a to z .... The fire t.v. plays most games very well , the GPU which is in the fire TV is the adreno 320, it runs most modern apps and games fluently but struggles on higher demanding titles like dead trigger 2. The fire TV does not have allot of games as of now, but the list grows every week or so. The amazon controller is okay but not worth the money , i use the moga power pro. The bottom line is ,  It's all about what you like. TV junkies will like this device and all the content it has to offer, I like playing Modern Combat 4 on my 40 inch Samsung and like that I can stick the fire TV in my pocket if i travel .... what do you like ?", "verified": true, "helpfulness": "0/0", "author": "jason"}, {"rating": 4.0, "review": "I would have given this item a 5 star rating had the documentation been better.  Unlike most devices, there is apparently, no 'on' and 'off' switch.  Selecting sources of enterntainment and selecting something to watch, again some documentation would be nice.  It works pretty darn good, though.  I had it plugged in and working within 5 minutes.  Very happy with the resolution.", "verified": true, "helpfulness": "0/0", "author": "Pat Deebel \"pdeebel\""}, {"rating": 2.0, "review": "Audio is very tinny and I use closed captioned to understand some things. I never use closed captioned on anything else. I am hoping maybe an update will fix this someday.", "verified": true, "helpfulness": "1/1", "author": "Midge Arquette"}, {"rating": 5.0, "review": "Beats Apple TV in any aspect... Too bad no DLNA support.  Could have a mini keyboard, voice recognition is very accurate.", "verified": true, "helpfulness": "0/1", "author": "Kevin Tseng"}, {"rating": 1.0, "review": "The unit worked fine after it was hooked up.  Watched two movies.  Tried the next week and no dice.  We were unable to get any response from the handset.  I changed the batteries and it worked.  Next use was fruitless.  Same as the previous week.  I suspect the unit is faulty.", "verified": true, "helpfulness": "9/12", "author": "Bob Colvin"}, {"rating": 4.0, "review": "The Fire is great. It does everything the ad says. Easy set up. Thanks Amazon for  another great product. Great price too!!", "verified": true, "helpfulness": "0/0", "author": "Joseph Ryan"}, {"rating": 5.0, "review": "We aren't up North often so the Amazon Fire TV is an excellent option for when we are there and want to watch TV or play games, etc.  Very easy to use and economical.  Don't know what took us so long to get it.", "verified": true, "helpfulness": "0/0", "author": "kellym"}]