[{"rating": 1.0, "review": "Apps work fine and I updated software.  When I try to play a movie through Amazon Prime screen is blank.  If I push the forward button the images appears. Also through Netflix I'm getting unable to load program try again later.  I used the same Amazon and Netflix through the built in Apps on my TV and it works fine and also my computer works fine.", "verified": true, "helpfulness": "4/6", "author": "B Gayon"}, {"rating": 5.0, "review": "great voice command to take you to the move you want also easy set up and right on to you accountand move", "verified": true, "helpfulness": "0/0", "author": "Gary Hansen"}, {"rating": 3.0, "review": "I'm semi impressed with the device but my biggest issue is the prime content. Unfortunately shows that I have watched for free on my Prime account are now offered only at a cost. Super disappointing Amazon!", "verified": true, "helpfulness": "0/2", "author": "Livia Liburdi"}, {"rating": 4.0, "review": "I really love having the Amazon Fire TV. I am planning to buy a unit for each TV in our home. I hope they will add more movies to the free Prime category and do better than Netflix. Not dropping Netflix til they beef up that offering some more and add more NEW RELEASES to the options. And thumbs UP for having Pandora too!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Not only do I get access to my Amazon Prime account I can download other apps like Netflix. The voice control works very good, giving you movie choices you didn't think about before. If you haven't got into Internet streaming yet, this appliance will amaze you.", "verified": true, "helpfulness": "0/0", "author": "Randy \"Auto Repair shop owner. I love Yoga, and playing my Fender Stratocaster. I Walk my dogs twice a day.\""}, {"rating": 4.0, "review": "It installed very easily, and it works exactly as promised.  We love it!However, I have to give it just 4 stars because three days after installing it, it simply stopped working.  It turned out that the Amazon AAA batteries went dead.  Two new Energizers, and it works like a charm.  Do yourself a favor and toss the Amazon batteries and install your own name-brands.  But the unit itself earns 5+ stars.", "verified": true, "helpfulness": "0/1", "author": "Ralph - Kirkland \"Fisherman\""}, {"rating": 5.0, "review": "My only complaint is when we back out of netflix to change users, we get an error we cant connect to netflix.  I think this is a netflix issue tho?", "verified": true, "helpfulness": "0/0", "author": "Nicole Krajnovich"}, {"rating": 1.0, "review": "The lending library and free shipping is great, but I get more movies from my Netflix and I don't have to pay extra. I returned the \" Fire\" till the selects gets better and the price includes more.", "verified": false, "helpfulness": "2/7", "author": "Mike Lauer"}, {"rating": 5.0, "review": "Very easy to setup, voice commands are great.I would love to see more great updates soon.Launcher updates and more.", "verified": true, "helpfulness": "0/0", "author": "gerardo r acosta"}, {"rating": 5.0, "review": "Love it. Really like the voice command. It makes it easy to find what you are looking for. Would definitely recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Creel"}]