[{"rating": 5.0, "review": "Best thing ever! Everything works great. I use it every day. It's the best purchase I ever made. I have the Fire TV Stick as well, but this works way better and is way more responsive. Great stuff!!", "verified": true, "helpfulness": "0/0", "author": "Mary \"sleepless777\""}, {"rating": 4.0, "review": "Love the Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Laurie Morales"}, {"rating": 5.0, "review": "I am loving my Fire TV. Way better then using my PS3 as my media center.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 2.0, "review": "Extremely unreliable. Need to reset it several times a week (or per day by unplugging it and plugging it back in. It will freeze or just stop working. It also spazzes out quite often. The voice search option only works for Amazon Instant Video. It's basically junk. I'm getting to Roku.", "verified": true, "helpfulness": "0/1", "author": "Hwy34Customs"}, {"rating": 5.0, "review": "I really like Amazon Fire TV.  I use it almost everyday to play music and watch Netflix, prime movies, and youtube videos.  The interface is really simple and very responsive.  The remote works awesome, especially the voice search.  Can't go wrong with this.", "verified": true, "helpfulness": "0/0", "author": "Sean Snyder"}, {"rating": 5.0, "review": "Lovely...:-)", "verified": true, "helpfulness": "0/0", "author": "Angel T. Maniego"}, {"rating": 5.0, "review": "The Amazon Fire TV is great for streaming Prime Material, Netflix, Pandora, YouTube, etc. I was able to get a discount by signing up for Sling TV, which runs well on the Fire TV. The remote is compact and simple which I like and the voice-response is a great feature. This is a nice product to have if you need to make your TV \"smart\".", "verified": true, "helpfulness": "0/0", "author": "A. fifield"}, {"rating": 5.0, "review": "Works and sets up easilyHappy to drop the cable bill", "verified": true, "helpfulness": "0/0", "author": "PAUL THOMAS LAURIE"}, {"rating": 5.0, "review": "I Love It!", "verified": true, "helpfulness": "0/0", "author": "dlp"}, {"rating": 5.0, "review": "I use it everyday,  The only way it could be better would be if it could work with my Amazon Echo", "verified": true, "helpfulness": "0/0", "author": "Lube"}]