[{"rating": 5.0, "review": "Simple setup, great features, replaced my fire tv stick (wifi signal interference from other equipment.  I use it in a less RF intensive part of the house now.).  Daughter loves the voice control (what girl wouldn't?).  Price / feature ratio beat all other video streaming devices I looked at.  I connected  via ethernet  cable it to my home network.  Flawless video and high def sound with my HDTV (via HDMI) and Home theater receiver (via toslink optical cable).  Also streams content from Flash drive via USB.  Money well spent.", "verified": true, "helpfulness": "0/0", "author": "K.  Bassett"}, {"rating": 4.0, "review": "Works well with Netflix and Hulu, I was disappointed that the free prime isn't easy to find.", "verified": true, "helpfulness": "0/0", "author": "R. Liese"}, {"rating": 5.0, "review": "Hours of fun... Fast, sleek design, and great packaging", "verified": true, "helpfulness": "0/0", "author": "wally"}, {"rating": 1.0, "review": "Not really all that. Seems you have to rent or buy any truly good movies.  I should never have bought two of them....", "verified": true, "helpfulness": "0/4", "author": "Christina Grimshaw"}, {"rating": 4.0, "review": "So far it's great", "verified": true, "helpfulness": "0/0", "author": "Barbara Mitchell"}, {"rating": 5.0, "review": "We ordered this a few months ago and signed up for the service. We don't watch a lot of TV but it is really nice to be able to watch only the channels we want and not have to deal with a lot of shopping channels and other channels that do not interest us. Wish we could get the Braves games - my guy's favorite team but overall very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Sharmp \"Shar P\""}, {"rating": 5.0, "review": "The device is excellent! There are numerous options for entertainment.  The options with your Prime account are amazing and you can add apps, games, and music.", "verified": true, "helpfulness": "0/0", "author": "Matthew Schwartz"}, {"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Jason Palmer"}, {"rating": 5.0, "review": "Works as advertised - I love it (especially love side-loading apps into it).", "verified": true, "helpfulness": "0/0", "author": "Shiv.-"}, {"rating": 4.0, "review": "Fire tv worked well, however found it a little difficult to add external programs.", "verified": true, "helpfulness": "0/0", "author": "James H. Coston"}]