[{"rating": 5.0, "review": "Works well!", "verified": true, "helpfulness": "0/0", "author": "Trent Ralston"}, {"rating": 4.0, "review": "still learning to use it, but it's fun", "verified": true, "helpfulness": "1/1", "author": "Eileen Smith"}, {"rating": 5.0, "review": "Easy to setup, easy to use and we like the voice search. Great picture quality also like the \"anticipated\" buffering feature. Overall a great product.", "verified": true, "helpfulness": "1/1", "author": "Woof Y'all"}, {"rating": 5.0, "review": "Loving it. Great device.", "verified": true, "helpfulness": "0/0", "author": "Arun K"}, {"rating": 1.0, "review": "I thought the voice option would have work on the whole thing but it did not work on the Netflix app just on the Amazon prime home screen. So for that reason it did not work for me", "verified": true, "helpfulness": "1/2", "author": "Cassidy Shankel"}, {"rating": 2.0, "review": "Requried more speed then my service could provide!", "verified": true, "helpfulness": "0/1", "author": "Leon Berard"}, {"rating": 5.0, "review": "Easy to set up.  Definitely need prime to max out the potential of the fire tv.", "verified": true, "helpfulness": "1/1", "author": "Craig Fitzherbert"}, {"rating": 5.0, "review": "I bought a refurbished Fire TV Box with voice remote.  I would swear this is brand new.  Works great and really fast to download and start your movie.  I would recommend this over the other guys boxes or plug/dongle types.  It has the processor and memory you want and need for hassle free viewing.", "verified": true, "helpfulness": "1/1", "author": "Danny D"}, {"rating": 5.0, "review": "This is a really good product. I have an Apple 2 tv that is JB but I still prefer the amazon fire tv. I use plex and it just works perfectly with system. The user interface for netflix needs an overhaul,other than that if your debating between an Apple TV or amazon fire tv, get the amazon fire tv.", "verified": true, "helpfulness": "1/1", "author": "Leo Toussaint"}, {"rating": 5.0, "review": "Easy to set upGreat formatMany add on apps", "verified": true, "helpfulness": "1/1", "author": "Ernie Burger"}]