[{"rating": 5.0, "review": "Love it.  It is great!", "verified": true, "helpfulness": "0/0", "author": "Aimee \"silveybelle\""}, {"rating": 5.0, "review": "We love it!  Offerings are rather good - very few movies/shows we cannot find!", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 4.0, "review": "This is a really good streaming device. It is very user friendly and you have a lot to chose from if you are a prime member. I do wish that it was easier to tell what was free and what you have to pay for.", "verified": true, "helpfulness": "0/0", "author": "Kenya Boone"}, {"rating": 3.0, "review": "Needs more apps. like google chrome and games for kids ages 6 and up", "verified": true, "helpfulness": "0/2", "author": "chris"}, {"rating": 1.0, "review": "Welcome to the ranks of Chinese & Korean me-tos... Amazon - like Burger King - lacks imagination & creativity... Do we really need this? Maybe for Gameboys and Coach Potatoes...", "verified": false, "helpfulness": "0/16", "author": "Manfred Siebler \"ms\""}, {"rating": 5.0, "review": "Works as its sold it will. Super easy setup, voice search is great, and I can watch my MLB.tv subscription on it! The only thing I want it HBO-GO. Also, if a search item is delivered through an app like VIVO, and you choose it, it doesn't take you directly to that item. That may be a limitation with the app and not Fire TV, but it is annoying either way.", "verified": true, "helpfulness": "0/0", "author": "Gary L Lehman Jr"}, {"rating": 5.0, "review": "voice search makes this superior to all others", "verified": true, "helpfulness": "0/0", "author": "engineer.jeff"}, {"rating": 5.0, "review": "I am very happy with the Amazon TV box. Not a second of disappointment. Very quality, sturdy and nice looking. I think it took about 3 hours for the update to run so be patient. There was nothing to hooking it up. I would recommed buying the HDMI cord that they recommend. I had a brand new one that didnt work so borrowed one and waited for the replacement to come from Amazon. The HDMI is 6 feet and well worth it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to use but really nothing different than any other streamer.  It does automatically pull in any music or tv that you've purchased through Amazon.", "verified": true, "helpfulness": "0/0", "author": "0997"}, {"rating": 5.0, "review": "I think that the best thing about review is to know who the reviewer is. I am not an American and I have 4 kids (ages 2-14). three of them are not English speakers.My needs are basic: Netflix (with UnotTelly) and Movies being located on my PC. The device is fulfilling those needs perfectly. The interface is so simple, that even my little baby can use it. Using Plex app and Netflix it is very easy for the children to view whatever they want to without any help.", "verified": true, "helpfulness": "0/1", "author": "Ran Bar Zik"}]