[{"rating": 5.0, "review": "Easily connected it to my TV. Seems like a good easy product to use.", "verified": true, "helpfulness": "0/0", "author": "VC"}, {"rating": 5.0, "review": "Having owned several streaming media boxes now, the FireTV is our favorite, the remote doesn't require line of sight which can be important if your TV is wall mounted and you want to tuck the device and HDMI cable away.  The interface is responsive and fluid and the selection and quality of games is good.  Of course the device really shines for Prime members with the Amazon Music, video, and photos/cloud drive integration (think photo slideshow screensaver).  The only disappointment for us is the voice search (which does hear and recognize well) on the remote does not search all channels, just the Amazon services.  As owners of a Roku and AppleTV this device is the go to for 90% of our streaming needs.", "verified": true, "helpfulness": "0/0", "author": "Brian Cook"}, {"rating": 1.0, "review": "I couldn't get this to work on my system...don't know why..?", "verified": true, "helpfulness": "1/6", "author": "Art Dal"}, {"rating": 4.0, "review": "I love the picture storage! Great games and movies, too! A worthwhile purchase.", "verified": true, "helpfulness": "0/0", "author": "Suzanne Mejia"}, {"rating": 5.0, "review": "I love that I can stream the Prime movies easily and have access to movies I have bought.  Easy to install, was already set up when it arrived.", "verified": true, "helpfulness": "0/0", "author": "KerrieZ"}, {"rating": 2.0, "review": "Wasn't what I was expecting. I wanted to be able to multi-cast from my Fire HDX to my HDTV. Google  Chromecast allows me to do that with my smartphone.", "verified": true, "helpfulness": "1/1", "author": "mark ferguson"}, {"rating": 5.0, "review": "However my Vizio TV apparently does not have the correct input to allow  the Fire TV to connect.  Disappointed as it all seemed so easy yet I got  a \"no signal\" sign and could not find any trouble shooting tips to  correct the problem. I am  best guessing that  it must have been the fault of my Vizio TV.  I had to return it. i know I would love it if i could get the signal.", "verified": true, "helpfulness": "0/0", "author": "Sabrina  Stevens"}, {"rating": 5.0, "review": "Perfect for 3rd party apps. Pretty dang quick.", "verified": true, "helpfulness": "1/1", "author": "Cliff H."}, {"rating": 5.0, "review": "Super duper", "verified": true, "helpfulness": "0/1", "author": "Navid Syed"}, {"rating": 2.0, "review": "Still not able to connect with my wifi.....probably need to upgrade my router.  In my case it is not out of the box easy setup.  I had such high hopes.", "verified": true, "helpfulness": "1/1", "author": "Debra Ruth Cochran"}]