[{"rating": 5.0, "review": "I'm a guy, and an engineer, so I seldom read instructions. Just kidding because sometimes I do read instructions, but I was so eager to try out my Fire TV that I never looked for them, I just hooked it up and started watching a Prime movie  The most difficult part of setting up and using the Amazon Fire TV was installing the included batteries in the remote.Amazon's Fire TV is a revolutionary development, and I feel the need to address the issue that kept me from buying the other competing devices; streaming picture quality. I've seen the Apple and Roku products in action, and purchased the Chrome plug in, and while they're a nice way to throw some content you might otherwise watch on your laptop or computer to the bigger TV screen, the experience is frustrating. Even with a service like FIOS, sometimes their streaming lags or jerks, and the picture quality is only okay. And I've never been a fan of Netflix on a computer or a laptop when I've got a 55\" plasma in my living room. But as soon as I plugged in my Fire TV - into a 5 year old Samsung (not a modern 'Smart' TV) and using an unimpressive Charter internet connection - I was blown away. It is like watching broadcast TV from a monitor in the TV station's control room; no lag at all and a picture that is perfect!If, like me, the actual VIEWING experience when watching TV is a key issue, the Amazon Fire TV is a simple choice. Simple is also the best way to describe the setup and use of the Fire TV as well.  NOTE: Your TV must be located fairly close to your internet modem/router in order to connect the Fire TV because it must be connected via an ethernet cable. If you want to use Fire TV with Television located in another room or across the room from your router, you'll need to use the Fire TV Stick instead.My router is on the same 2 shelf media stand as my television, so I simply mounted the Fire TV on the back of my flat screen using Velcro, plugged it into AC Power, connected the Fire TV to the Plasma with an HDMI cable and to the router with an Ethernet cable, and I was done. I pushed the center button on the remote, my TV switched to the proper input, and I was on my way.As others have pointed out, when searching for a movie or series to watch, you can't specify that you only want to see free items, which is irritating, especially when you learn that a recent movie like 'The Hunger Games: Catching Fire' is free but the first 'Hunger Games' in HD costs $3.99 to rent, and a 50 year old movie like 'Marnie' costs $2.99 to rent. But that's not a real issue, just an irritant, at least in my opinion. So it's impossible for me to complain about a system that's this easy to set up and provides such a beautiful viewing (and listening) experience.", "verified": true, "helpfulness": "1/1", "author": "P. Hentges \"Guido\""}, {"rating": 1.0, "review": "This item does not have a power button, either on the box or the remote control. I the past month, I have to unplug the power cord and plug in again and unplug and plug in again (kind of dirty, isn't it)", "verified": true, "helpfulness": "2/3", "author": "Hao Wang"}, {"rating": 5.0, "review": "Love this product", "verified": true, "helpfulness": "0/0", "author": "Stephen Powers"}, {"rating": 4.0, "review": "Better than a seashell", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "i havent even begun to explore the whole thing. But what I have seen, Love it! Thinking about it for my kids.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Callaway"}, {"rating": 5.0, "review": "I love my Amazon Fire TV. It performs as advertised. The only concern is the lack of a YouTube app.", "verified": true, "helpfulness": "0/0", "author": "Orinzal Williams"}, {"rating": 2.0, "review": "I purchased this item about a month ago and altho it serves my needs well , my latest data allotment from my cable company is OFF THE CHARTS !My data allotment doubled in one month ! The only work around is to unplug the thing when I'm not using it - PLEASE amazon - fix this problem !!!", "verified": true, "helpfulness": "0/2", "author": "Hal"}, {"rating": 5.0, "review": "Great item. Be sure to connect to an unused HDMI port on your amplifier if you have a home theater system, not directly to your TV. That way you will hear all your movies in surround sound, not just through your TV speakers. If you have trouble connecting to the internet, it could be that your WiFi signal is weak. If you are far away from your router, or have walls that block the signal, like mine did, you may want to invest in a WiFi extender. There is a free app on your smart phone called WiFi analyzer to test your signal strength. Another sure-fire way to go is to use an Ethernet cable hardwired into Amazon Fire. It took me three days and a lot of bum advice from my cable provider to figure this out.(they told me my cable had to many splitters) This is baloney. Your cable has nothing to do with your WiFi signal.... I hope this info will save you a lot of time and frustration!... A little update... This product is very user friendly. The remote control that comes with the Amazon Fire is great. It even has a voice actuation button to find what you are looking for fast. The video is sharp and the sound is excellent. Of course, this depends on your TV and home theater/speaker capability. Excellent product.", "verified": true, "helpfulness": "1/1", "author": "Kip P. Downen"}, {"rating": 5.0, "review": "My favorite media streamer to date. Has no problem running XBMC to access my huge movie collection and streams Amazon Prime, Netflix etc with ease.", "verified": true, "helpfulness": "0/0", "author": "Kyle Morris"}, {"rating": 1.0, "review": "All the good movies have to be paid for....", "verified": true, "helpfulness": "1/4", "author": "Syracuse-NY"}]