[{"rating": 1.0, "review": "Just bought this and connected so I could use Netflix. The problem is the Netflix App doesn't work!. I am not sure why Amazon would sell and ship a product with such a critical issue! I am very disappointed", "verified": true, "helpfulness": "2/5", "author": "Carlos fernandez"}, {"rating": 3.0, "review": "Great product for VOD content. Search & recommendation engine is lacking and Nuance's NLP technology for voice search isn't great. The ASR engine however is solid.", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 5.0, "review": "Used to have an Apple TV this is much better :). It is faster and doesn't have any glitchy feel to it. I do wish they had stream hbo, however amazon prime has a lot of hbo shows available to watch anyways.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Lemieux"}, {"rating": 1.0, "review": "LET ME SAY THAT AMAZON CUSTOMER SERVICE WAS GREAT BUT THE FIRE TV IS TROUBLE. WORKED FINE FOR A LITTLE OVER A MONTH AND THEN STARTED TO GET AN LICENSE ERROR WHEN TRYING TO PLAY A PRIME MOVIE AND NOTHING WORKED. NETFLIX HAD NO SOUND AFTER THE LATEST UPDATE.AMAZON REPLACED THE PLAYER WITH THE SAME PROBLEM WITH THE NEW PLAYER.", "verified": true, "helpfulness": "3/6", "author": "Sascha"}, {"rating": 5.0, "review": "Amazon Fire TV is a very powerful box. I love watching sports and videos on this since it rarely lags. It really does well when playing games too and offers a very fast interface. The voice button on the remote works excellent and can actually under what I say unlike Siri and others who never understand my accent. Overall this is the best unit for streaming.", "verified": true, "helpfulness": "0/0", "author": "LED Maniac"}, {"rating": 4.0, "review": "The Fire TV works great. Its easy to navigate and the voice search is very accurate. It's a powerful enough device to be very responsive, with smooth playback. Overall I'm very impressed, so why only 4 stars? Simple, Amazon is missing a golden opportunity. Amazon, I hope you are reading this. If the USB port could be utilized for an external hard drive, to which we had the option of downloading purchased movies for local playback on the device, I'd start buying most of my movies from Amazon in digital format. As it is, I'll rarely ever purchase a digital movie, if I don't have the option of local storage. Amazon, I'm sure a software update is all that would be required to make this happen, and you' d make a lot more money from me (and probably many other people, as well). Overall, I'd still highly recommend the device.", "verified": true, "helpfulness": "0/0", "author": "Pastor David"}, {"rating": 5.0, "review": "Get your money for nothing and your chicks for free.I love my, I love my, I love my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Wade Noxon"}, {"rating": 5.0, "review": "So I'm a bit behind on the technology learning curve, but I ordered an Amazon Fire TV and within 5 min., I was up and running.  EVERYONE NEEDS ONE OF THESE!  Only $99 to buy (don't get mad, Amazon--customers should check around because it's sometimes on sale elsewhere), no monthly cost; and if you have Amazon Prime, you can watch thousands of movies and shows on your TV instead of your tablet.  I recently signed up for Netflix; and for $8.99 a month, we can watch thousands of movies, premium TV shows, kids' cartoons, etc., on two TVs ($7.99 for one TV).  Best of all, it's the easiest thing in the world to install and use.  I ordered this one for downstairs and a Fire Stick for our bedroom TV.  This one has a voice feature--just say the name of a movie, actor, director, genre, etc., and it'll take you to it (hubby has issues with remotes, so I thought that feature was worth the extra money).  If you have Amazon Prime, Netflix, Hulu, etc., you have to get at least the inexpensive stick so you don't need to watch through a gaming box or--in my case--try to figure out how to watch on a TV instead of your tablet.  Either would make a great Christmas gift.", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Heise"}, {"rating": 5.0, "review": "I can't say enough positive comments about my purchase of Amazon Fire TV! It is wonderful and I am having so much fun with the tv shows, movies, music and everything that it offers. And it even keeps me entertained with apps. This is a great product and since I got Amazon Prime, I am not getting much else done!!! Love this product! Thank you Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Sewbasket"}, {"rating": 5.0, "review": "So small - only a half inch high and 5\" x 5\" square and so simple to use.  A simple remote with voice control find that works.  Easy to watch Amazon Prime, Netflix, YouTube, and more.  Great streaming.  No interruptions or waiting.  And I get to listen to Pandora too!  Best big little thing I ever bought for watching what I like on TV.", "verified": true, "helpfulness": "0/0", "author": "John P."}]