[{"rating": 5.0, "review": "Does exactly what I needed from a media streaming box- simple as that! Twitch app allows me to watch my favorite game streamers and league of legends LCS games.  High quality movies through prime is also fantastic! Snappy menus, great remote, and simple setup. Couldn't ask for a better streaming machine", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "Excellent Product-This is the 2nd ome we purchased for another TV in our house", "verified": true, "helpfulness": "0/0", "author": "David S. Krause"}, {"rating": 1.0, "review": "Not as good as netflix. You don't get all movies you have to also pay more to watch oter items Should be pay one price like netflix. Then it would be great. I do like how the unit works especially the voice activation. I just though as a prime customer all movies were included. The key problem is I only used it once. I use netflix almost every night. I would like to see this product grow so im being honest. The item and delivery were 5 stars the movies I give one star", "verified": true, "helpfulness": "2/6", "author": "bruce"}, {"rating": 5.0, "review": "Love this! So simple to use! My husband and I love the voice feature!", "verified": true, "helpfulness": "0/0", "author": "sarah Nichols"}, {"rating": 4.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Gonzalo"}, {"rating": 5.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "Mark R Chapman"}, {"rating": 3.0, "review": "The Amazon Fire TV is a nice piece of technology, but I found that the interface needs work so I ultimately returned it.As background, I recently just downgraded my Comcast TV subscription to a basic level that did not include TCM -- our favorite channel for movies -- it just wasn't worth the $40 additional Comcast was charging.  My plan was to set up one of the TV input with an internet-connected device like the Amazon Fire or Roku to get Movies and other programs through a combination of Amazon Prime and Netflix.I purchased both an Amazon Fire TV and a Roku 3 at the same time since I have two TVs and I wanted to compare them.  I found that both the Amazon Fire TV and the Roku have serious interface drawbacks and almost returned both.  Ultimately, I kept the Roku 3 and returned the Amazon Fire TV for the reasons below.First, the good -- both devices are extremely easy to set up.  And, once set up, they are extremely responsive (fast).  The Amazon easily connects to your Prime and off-you-go.  The Roku annoyingly requires a Credit Card to set-up -- a harbinger of the incessant marketing and cost-channels they are going to expose you to -- but it only took me a couple of minutes to set up ShopSafe single use number with a very low cap to make sure I didn't get surprised.However, I did not like the Amazon Fire interface. - It has a list of category options on the left but you can't control the order so you have to scroll through options that you probably don't want. - Other than Recently Viewed and your Watchlist, there is no way to have a menu of favorite non-Amazon applications. - When you are hovering over a category option it becomes magnified on the screen, drowning out the other options.Here, the Roku 3 is better as you get to choose your applications to display and can have 9 (3 columns with 3 rows) displaying without scrolling.  And, ironically, I FOUND THE INTERFACE OF THE ROKU AMAZON VIDEO APP IS ACTUALLY BETTER THAN THE AMAZON FIRE TV's VERISON.  It has a category shortcut that get's you to your content faster and overall it is more intuitive and easier to navigate.However, the Roku 3 interface is marred by a recent redesign that reserves the entire right 1/3+ of the screen with a Roku Featured Channel that is essentially running advertisement.  I wouldn't mind it if it was just one column-wide -- but there is no way to miss the huge constantly changing panel and it has greatly reduced the utility of the device.  Fortunately, there are ways to block the ads online so all you have is a static Roku picture, but it still is using up a huge amount of prime real-estate.  And, Roku keeps changing their ad streaming technique so periodically I have to locate and block additional IP addresses and domains.  I hope/wish Roku would take a different approach, but when I contacted their Customer Service advocate I got a non-answer so I'm not optimistic.From a channels perspective, the Channels on the Amazon Fire are surprisingly limited.  And, those the Amazon fire has are hard to get to because of the above-described inability within the Fire interface to have a Favorites row for non-Amazon apps.  However, while Roku is famous for advertising thousands of channels, I find myself not using most of them because they often are just come-ons for a paid service, or they have very limited selections of what the channel normally offers.  Frankly, I'm surprised that every commercial network and PBS isn't just routinely streaming their content, but they don't.Based on the above, I ended up keeping the Roku but just configuring a few Roku stations -- Amazon Prime, Netflix, History, PBS, and a couple of others that easily display in the available 9 option grid without scrolling.  That plus the basic TV subscription we kept (for about the same price as the high-speed Internet connection) has very adequately replaced the $40 more expensive Comcast Digital Preferred with TCM (hopefully TCM will soon recognize all the viewers they are losing and start to offer their internet streaming as a separate paid service without the Cable subscription).One other feature of the Amazon Fire TV needs to be mentioned -- it's cool voice search capability.  It works amazingly well -- better than any voice recognition device I've used before (and I have significant voice problems).  However, the voice search only accesses Amazon content, and as often as not, the content it finds will require you to pay to watch.  I would have liked a configuration checkbox to limit your search to free Prime content only but they haven't implemented that.  (You can limit your search to only free Prime content by saying \"Prime Only\" at the end of the topic, but that get's pretty tiresome).  So after a few uses, I ended up not using the feature and just scrolling.And a really great feature that every device needs is a screen aspect ratio sizer.  I've found that each TV is just a little bit different in cutting off vertical or horizontal aspects of the picture.  The Fire has this unique adjustment with which you can custom tailor the aspect ratio exactly to your screen.  Every device should have this.My final comment is actually a shout-out to Netflicks.  Their interface far exceeds the amazon prime interface, and they have implemented an amazing preference engine that you can configure.  And, although it doesn't have all the content you might want, all the content that is there is both free and commercial free (unlike Hulu plus).  My one gripe with Netflicks is that at the end of a movie as the credits and ending music beings they immediately shrink the movie down and present you with the next movie ruining the end.  (Thankfully, Amazon Prime doesn't do that.)Amazon is a quick learner, so hopefully they will add a configurable Favorites landing page that accesses both Amazon and non-amazon apps, add more channel apps, allow user configuration of the left menu, and add a Prime Video only configurable default checkbox for the Voice Search.  With those features, I would probably switch back.Ultimately I kept the Roku 3 and returned the Amazon Fire.  because despite even with only 9 favorite channels", "verified": true, "helpfulness": "4/4", "author": "Andy S"}, {"rating": 5.0, "review": "After using DirecTV and Dish for a long time, I'm finally switching to streaming over the internet.  The Fire TV box seems to work great.  It was easy to install, even with my less than capable knowledge of internet hookups.  I partcularly like the small remote control unit, simple to use.  And, in contrast to other reviewers, the voice commands exceed my expections for searching.  Further, I really like the Amazon Prime programming.  I like to watch history and documentary programming and there are some really old obscure videos that are available.We are testing this system for a while and will likely disconnect our DirecTV service.  So far, the Fire TV system gets a thumbs up, easy to install, and exceeds my expections.", "verified": true, "helpfulness": "2/2", "author": "Curly"}, {"rating": 4.0, "review": "Awesome device so far and enjoying it's applications and abilities... not much to offer that isn't already on the PS3 but this is on faster and gets to your content faster. I wish it had native support for DLNA media servers instead of using an app; home movies can be jittery even though it is on a Gigabit Network using Cat6 right next to the PS3 that displays the videos natively without issue. Other than that though, it is truly awesome!!  Also quiet and takes next to know space.  Love the voice feature (though I wish I didn't have to hold done the mic button) and the fact that the remote is BT. Love being able to send videos over from phone or tablet to the device too.", "verified": true, "helpfulness": "0/0", "author": "Bassem Elias \"awesomebase\""}, {"rating": 2.0, "review": "A lot of buffering.  At times when watching a basketball game the sound lags the play. Note impressed.", "verified": true, "helpfulness": "0/2", "author": "Al Giese"}]