[{"rating": 4.0, "review": "great device , very fast.lacks the ability to organise the home screen. apps games and shows are all mixed in recents and make it really messy and inconsistent .more games would be good including two player racing games.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wonderful. Voice recognition is great. Lots of great shows to watch. Can save lots of money by downgrading cable subscription and just watching what you actually want.", "verified": true, "helpfulness": "0/0", "author": "L. Kimminau \"Mr. Mom\""}, {"rating": 5.0, "review": "I really love our Amazon Fire TV. I have this one in the bedroom and will get another for the basement workroom as soon as I can upgrade the TV as it is 15 years old and doesn't have the outlets for the cable. Even my husband ( who wanted to send it back ) has started to migrate to the bedroom to watch the Fire TV as apposed to the regular cable. Cable has a gazillion stations and nothing on that I want to watch. The Amazon always has something to look at. Love it!!", "verified": true, "helpfulness": "0/0", "author": "cjp"}, {"rating": 5.0, "review": "Better than Apple TV, voice finder is great.  The whole thing works seamlessly and is incredibly easy to use.", "verified": true, "helpfulness": "0/0", "author": "Dominic Federico \"Health maven\""}, {"rating": 3.0, "review": "Well. . it has a little use. You can't however project your laptop or Ipad through it like Apple TV. Your computer based photos and videos have to be uploaded into an Amazon cloud first, a practice I find most annoying so I don't bother. I'm left having to connect the laptop which was one of the things I was trying to avoid by buying it. . Why in the world they didn't allow your laptop to use it as an interface is beyond me. It won't even make use of a USB drive though it has a USB port. The organization of its menu system is about a 3 of 5 as it isn't all that navigable. If there's an issue, whatever you do don't reload the OS to try to solve it. It forces you to listen to its entire orientation all over again without any way to escape.  The voice receives a five star as it is dead on almost 100% of the time. The suggestions of comparable offerings is well done and is a 4 of 5 but that option was available online.  It was a nice try but needs to be seriously reworked in my opinion to fix the obvious shortcomings. It was only slightly more expensive than a wireless adapter for my DVD player which would have me to do basically the same thing. This seemed to hold promise of a little more. Since I can skip the wireless adapter now,  I didn't waste that much money. Given a chance I would probably pass on it and get the wireless adapter.", "verified": true, "helpfulness": "2/2", "author": "jring2"}, {"rating": 1.0, "review": "Amazon Fire TV only wants to download the expensive HD versions of movies for $7 instead of the $2 or $3 standard definition versions.  My internet connection isn't fast enough to stream the HD versions so I have pretty much no use for Amazon TV.  They sell the manual separately (and electronic version for $10).  The Netflix capability is very limited.  It doesn't use a very recent app and stops, stalls, and studders a whole bunch.  I was going to send it back but don't have the energy.Buy a Roku.", "verified": true, "helpfulness": "6/10", "author": "cross"}, {"rating": 5.0, "review": "it looks great.And after i use it ,runs well.Amazing little box.Better than expected.", "verified": false, "helpfulness": "0/0", "author": "Justin D Bennett"}, {"rating": 5.0, "review": "I've been playing with mine for a day now and I love it! I've loved using Amazon Prime for the past three years with my Kindle Fire, and now I have all the music, movies, TV, and games I could ever want on the big screen. This is my favorite purchase for this entire year. I'm so glad I took the time to order it this summer. I look forward to spending many more fun-filled days getting to know all the features of Amazon Fire TV. Thanks so much for a great product.", "verified": true, "helpfulness": "0/1", "author": "Bill Crum"}, {"rating": 4.0, "review": "Works well, and really like the ability to watch movies we own on the FireTV.  ... as well as the Plex app.  It took a while figure out why the HDMI sound did not come through - be aware that there is a selection for dolby digital plus or standard dolby digital.  If your AV system is a few years older then you more than likely will not be able to hear any audio if you select the plus version.  Other than that, works great.  We are currently swapping out HDMI ports between Blu Ray and the Fire TV so expect to purchase an auto switch. .  I do have one update request.  Please add an Audible app to the FireTV box / apps.  Since Amazon owns Audible it just makes sense... and would be nice to listen to books/ etc. over the AV system.", "verified": true, "helpfulness": "0/0", "author": "cosmo w"}, {"rating": 3.0, "review": "The Fire TV is the girl in high school you consider dating just because she is nice... I wanted to love this device. I love the potential of Amazon. The Fire TV was left at just potential. Glaring problems such as lack of Prime search and big name apps that competitors already have. The website was says that the Fire TV has Amazon Music. I had yet to receive that update before returning the device. I called customer support about the update and they seemed pretty clueless what it was. These are basic things Amazon! All you had to do was make your own services available on your own product. Why can't I search the full Amazon store from my Fire TV? Do you not like having people's money? Honestly, the Fire TV could be a great device with some software updates. Until then, I ordered an Apple TV to play nice with my Apple devices. Amazon can succeed in the streaming box market but it needs to step up it's game to battle against a soon to be updated Apple TV and Android TV. Until then, I recommend people stay away from this device.", "verified": true, "helpfulness": "1/1", "author": "Jason85"}]