[{"rating": 1.0, "review": "This is a piece of junk. I bought it and then a month after it was no longer returnable it stopped working. I have a ROKU on another TV that has been working flawlessly for 7 years. I will replace Fire TV with a new ROKU box for half the price, which will hopefully be as reliable as the earlier model that is still in use.", "verified": true, "helpfulness": "0/2", "author": "David B. Center"}, {"rating": 5.0, "review": "Awesome product. Really enjoying it all including Pandora.", "verified": true, "helpfulness": "0/0", "author": "mrbh"}, {"rating": 1.0, "review": "The device works very well and I would give it 5 stars, but I was not aware that everything we would like to watch there is a charge. I thought that amazon Prime got everything free.  From the advertisement for Fire TV that is what we were to get. Instead there is a charge for TV shows that we missed when they first aired. The device works fine it is just not what we expected for programming.", "verified": true, "helpfulness": "1/4", "author": "William McNeely"}, {"rating": 5.0, "review": "I have a Roku 3 and Amazon fire and the Amazon fire is by far a much better choice.", "verified": true, "helpfulness": "0/0", "author": "Philip Stidham"}, {"rating": 5.0, "review": "Works much faster when compared to the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Bobby"}, {"rating": 5.0, "review": "This was the easiest thing to hook up. I absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Katherine Mulholland"}, {"rating": 4.0, "review": "This product works just like they say, except for the voice search. They need to make the voice search work as well as the ROKU soon or I will be selling this to replace it with the ROKU.", "verified": true, "helpfulness": "0/0", "author": "Michael L Willis"}, {"rating": 5.0, "review": "This is a great gadget!!  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kathleen D. Kutch"}, {"rating": 4.0, "review": "Needs more varity.", "verified": true, "helpfulness": "0/0", "author": "Stephen A. Kaydus"}, {"rating": 5.0, "review": "As advertised the system was very easy to hook up and has been really easy to use . I am very pleased so far.", "verified": true, "helpfulness": "0/0", "author": "Terri Burns"}]