[{"rating": 3.0, "review": "Amazon Fire TV", "verified": true, "helpfulness": "0/4", "author": "Mama 43"}, {"rating": 2.0, "review": "I DONT HAVE HIGH SPEED INTERNET, SO IT DIDNT WORK FOR ME. SMART TV WITH BETTER WITH MY INTERNET, I DONT NEED HIGH SPEED INTERNET", "verified": true, "helpfulness": "1/12", "author": "MARCELLA LANCASTER"}, {"rating": 5.0, "review": "my son uses this quite often to watch Amazon Prime.  it works, no problems !", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "This little thing is amazing! In a household full of Roku streaming devices, I wanted something different for my Man-Cave. This came out at just the right time and price (not that it's much different in price to Apple or Roku). When it arrived I pulled it out of the box like a hyper kid at Christmas with no Adderall. I already had an Ethernet port and hdmi cable waiting for this bad boy right here. I had it hooked up in about 30 seconds. When it first booted I expected to need to hunt down all of my favorite streaming apps but the were there already and my amazon account was attached so no need to sign into amazon instant video which is nice because the first this I tried was voice searching. As long as you're not whispering, this thing seems to be pretty accurate. :-) Knowing full well that you have to pay for Netflix and Hulu+ this wasn't a surprise to me like it seems yo be for so many people who get streaming devices and get pissed because nothing is free. Amazon instant video has a great selection of free content through Prime membership and the rest is rent or buy, but again, I knew that before I purchased this device. Now the only thing I was concerned about was the ability to use Plex. I've been using Plex for years. Almost since it's release date. Anyhow, I was quite delighted to find they had an AFTV compatible app. I purchased it right away! I know what most are thinking, why buy it again if I already have it? Well it's simple really, I was sung it on a new platform. This may be built off of android but it's not an android device, no play store. I knew this when I purchased the app as I've done so for every device with a unique account in my home.The only thing I'd change after using this device for a few weeks is the scrub rate. It's too fast and there doesn't seem to be a jump back or forward option? Unless my ADHD has me missing that bit of info, I can't seem to find it. I just hold rewind or fast forward and hope I get to where I wanted.Five stars when tapping the fast forward or rewind button once gives you jumps and the scrub rate is slowed.", "verified": true, "helpfulness": "3/4", "author": "Clint C."}, {"rating": 2.0, "review": "Please note if you are looking forward to using the watchESPN app, 'live' sports events are shown with a 1-2 minute delay.  Hugely annoying to say the least.", "verified": true, "helpfulness": "2/2", "author": "TheseNuts \"FC\""}, {"rating": 5.0, "review": "A little expensive when compared to the Google chromeast, but then my Google Chrome cast proved not great after a couple of days. So over all, it is worth the money as it is still working even after months of using it.", "verified": true, "helpfulness": "0/0", "author": "Teresa F. Amara"}, {"rating": 1.0, "review": "Keeps saying my internet is slow but have one of the fastest . Goes off in middle of movies even Wasted my money buying Would not recomend", "verified": true, "helpfulness": "0/3", "author": "Judy michael"}, {"rating": 4.0, "review": "I don't have Amazon Fire yet because I can't get an answer to one simple question: In the listing of all the icons of the channels you get, it has an icon that says \"WatchESPN.\"  Now what does that mean? Does that mean I get real ESPN so I can watch all the college football games I want to watch? Or is that a show that talks about watching ESPN?I have had it with my current cable provider. my bill goes up every month and every time I call to ask why I get a different story. what I want is basic cable, not expanded cable, and ESPN. well guess what. they have a sports package for $18 a month, but it doesn't include the plain old channel ESPN, where the college football games are.I don't watch movies, I don't -play any games, I just want to see my college football & baseball, and I really don't want anything that doesn't include ESPN.also, how much does Amazon Fire cost you per month for its basic services?I am aware that this is a dumb question, but I am all out of teenagers and I need help. thank you.", "verified": false, "helpfulness": "2/3", "author": "Freds Mom \"Freds Mom\""}, {"rating": 5.0, "review": "love it so happy i order this and one want to know it well buying", "verified": true, "helpfulness": "0/1", "author": "Sonya"}, {"rating": 5.0, "review": "I love this so much and my grandkids do too!!!!", "verified": true, "helpfulness": "0/0", "author": "Bette Hatman-Best"}]