[{"rating": 5.0, "review": "Bought this with an LG LED LCD 42\" and made it into a smart TV. Fire TV has it all, Amazon Prime TV shows, movies, games, apps. Crackle is a really good free network, Pandora, etc... Voice command remote is awesome! Just say what you want to watch and it finds it. A lot of free games to download. If you don't have a smart TV, now you will. Doesn't come with an HDMI cable, so order Amazon's cable. It's the best and only $6. I'm ordering the Fire game controller too.", "verified": true, "helpfulness": "0/1", "author": "D. Swan"}, {"rating": 4.0, "review": "This is an amazing set top box with a lot of potential. I chose this box because I wanted an easy way to access plex and youtube on my tv. Well the plex app is great and also for a nice price, but I could not purchase the youtube app even though it's free. That goes for other apps as well, especially the free games like asphault 8 etc. I think it's because of the geological location. I live outside the U.S.If the free apps are not accessible to international customers amazon should charge something for it. I would surely buy them (food for thought Amazon).", "verified": true, "helpfulness": "0/0", "author": "Claudius Boasman"}, {"rating": 3.0, "review": "First opened the product, the unit looks very nice and feels very solid.  Remote looks very simple and easy to use (although that clicking sound annoys me a bit).  The power cord seems a little frail but I'm sure it'll be ok.  I connected the the Fire TV via HDMI and decided I would connect it wirelessly.  Big mistake.  I must have spent a couple of hours trying to get this thing to update multiple times only to tell me that internet connection is slow and that the update has stopped.  It instructed me to unplug and plug the power, but that didn't seem to resolve the issue.  Weirdest part is that the Fire TV is only 25-30 feet away from my wireless router and I have tons of devices at home that are using wireless and they don't have issues with connectivity performance.  After getting frustrated with the update process, I decided to just hook it up wired instead.  Voila!  The Fire TV looks great once it is up and running.  Menus are clear, voice recognition is great, navigation through the applications/movies/etc. are a breeze.  It seems laid out beautifully.  My only concern with the Fire TV is that it automatically recognized who I was.  It seems the device when connected to Amazon must be linked to my Amazon account.  I don't recall entering my Amazon credentials to the unit.  Luckily for me, the package was delivered to my address but if the product was delivered to someone else's address and it was opened, they can easily hook this up and use my account.  I'm a bit concerned about that.Other than the wireless issue, I think I am pretty happy with the Fire TV.  My only hope is that Amazon fix the wireless issue as I am not the only one reporting this.", "verified": true, "helpfulness": "0/0", "author": "Buhbarian"}, {"rating": 4.0, "review": "I really like my Fire TV. Voice Search works great, but that's the problem. I'm disappointed that the search doesn't extend to the other apps like Netflix, Plex, etc. Would also love the ability to have the Fire able to play files that are either on my local network or stored in the Amazon Cloud. Solve these two issues and Amazon has the perfect set-top box solution.", "verified": true, "helpfulness": "1/1", "author": "Mike M"}, {"rating": 5.0, "review": "This is great! I loved how easy it was to set up (the hardest part was getting the batteries in the remote!) and how easy it is to use. If you're an Amazon Prime member, you're set for life with movies, TV shows, games and documentaries. Very impressed.", "verified": true, "helpfulness": "2/3", "author": "MishMish3000"}, {"rating": 4.0, "review": "I am so happy with our new Kindle Fire TV. It is exactly what I had been wishing for. Now I can share my Prime videos and TV shows with my family in our living room. The voice search command is superb. Along with access to Netflix and the other options, out TV choices went WAY up. 👍👍👍", "verified": true, "helpfulness": "1/2", "author": "Theresa in Colorado"}, {"rating": 4.0, "review": "does amazon fire tv works in Iraqbefore i buy amazon fire tv i need to know that its working in my country", "verified": false, "helpfulness": "0/3", "author": "eka"}, {"rating": 5.0, "review": "Had trouble streaming Amazon movies through Wii and then got the Amazon Fire TV and all my troubles went the way of the Dodo bird! It does what they said it would do and it is user friendly. Very easy to set up. Takes very little room and I am very pleased!", "verified": true, "helpfulness": "0/0", "author": "Sally"}, {"rating": 5.0, "review": "i have verizon fios, and apple tv.  and well, i do have amazon prime.  between prime and fire tv, amazon knocks the others out of play.  it's faster loading than my apple tv.  it's easier to use.  the controls are smoother.  it's less expensive and it has much more free stuff.way to go amazon", "verified": true, "helpfulness": "0/0", "author": "tireiron"}, {"rating": 4.0, "review": "This is a great way to receive programing.  I love the voice control.  But it still needs to get use to my voice.  Sometimes you have to say it 3 times for it to bring up correct programming.  I do however wish there was a paper pamphlet to list all free movies and all free T.V. programs.  It would be perfect if you could get local programing and local news.  ABC, NBC and CBS.  They you could do away with Time Warner COMPLETELY.  Glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Paul Barrett"}]