[{"rating": 4.0, "review": "Much has already been said in reviews. The Device is a powerhouse in the tech department, but ultimately pales in comparison to the content available on other devices. Granted for the people with more time on their hands than others, you \"could\" technically sideload any android features and apps not present, but that defeats the purpose of \"ready to go \" out of package streaming device.. I bought this to replace my roku1...but ended up getting a roku3 anyway because the choices at the moment are barren.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"MindChamber\""}, {"rating": 3.0, "review": "I purchased Fire TV because I really enjoy Amazon Instant Video and would prefer not to mirror from my iPad via Apple TV because then I can't use my iPad at the same time. Fire TV allows me watch and play. HOWEVER I cannot see HBO GO because it is not available.  Nor can I see Showtime because, while my cable provider allows me to watch content on my iPad, yet it does not allow me to see it on Fire TV.  WHY NOT???  Apple TV allows me to stream Amazon, watch HBO GO from an onscreen app AND stream Showtime from my iPad.  Voice  search is nice, gaming would be nice if I did that, but I don't.  It is easy to access without having to use an Input button to switch to fire from cable or DVD, but you cannot switch back without using the input button.Maybe the planned update will address all of this, but why release when the product is not quite ready?  If not, I'll give it  to my mom for Mother's Day and get another Apple TV for me.", "verified": true, "helpfulness": "0/0", "author": "M. Calhoun \"bleumel\""}, {"rating": 5.0, "review": "I was thankful I didn't purchase another service. This integrates into all of my players and things I watch. No more hooking up my Kindle to the TV, just sit back and ask for what I want to watch. I have had no problems and would recommend it to anyone.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"windrider\""}, {"rating": 5.0, "review": "Love that Amazon made this gadget. I believe most major companies can't afford to fall too far behind Apple and its devices. I needed this like I need my Apple TV. To complement my Amazon Tablets' features and exchange information from tablet to TV. I love that they made it quad core, more memory and voice control, which although limited to Prime, none the less, it's like adding new features to my 50\" Panasonic. And there-in lies the main reason for purchasing this device. It upgrades my flatscreen and adds more usefulness  to my Amazon devices. I'm still waiting for the gamepad, so can't say much about that, but I've already purchased games in anticipation for its' use. My granddaughters should be delighted in its' use. I've got all the major game systems my sons could want and they probably won't be playing with this anytime soon, or ever, but that shouldn't be a problem for occasional game players who only need simple games for temporary entertainment. Still, I think it's a great product for Amazon users and a great device to use for streaming movies and other media at a low cost, electric wise. Plus any other upgrades that improve its' usability will be greatly appreciated.", "verified": true, "helpfulness": "3/3", "author": "William Gonzalez"}, {"rating": 4.0, "review": "It works well and gives us access to more movies and tv shows that we had not seen before or would like to see once again.", "verified": true, "helpfulness": "1/1", "author": "TeeDee"}, {"rating": 5.0, "review": "Lots of great streaming content and really lets me access my Prime content so much more!  Love the content and love the games.", "verified": true, "helpfulness": "1/1", "author": "Donald G Thompson"}, {"rating": 1.0, "review": "Do not buy this product unless you have the capability of connecting it to an Ethernet (not wireless). Apparently software updates, (which is required immediately upon set up) are not possible without having the box connected via an Ethernet wire. Totally a waste of time, money and effort.", "verified": true, "helpfulness": "5/21", "author": "Mary Sickles RN"}, {"rating": 5.0, "review": "Great video, easy hookup and a good selection of movies. Just wish the remote was RD instead of blue tooth so I could use my universal remote.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device but not ss much content as roku. Hopefully amazon will get their actually in gear a.nd it wll be succeszful", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Why can't I access my Amazon cloud drive and listen to the music I have stored there?  It was available on my ROKU 2, but not on Amazon's own box?  This is very disappointing and will hopefully be something they fix quickly.  It would also be nice to have Amazon Prime content get it's own menu rather than just being a sub category in Movies and TV.  Those are my only complaints and they would not stop me from recommending it to anyone looking to upgrade from a ROKU or get rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Jason"}]