[{"rating": 5.0, "review": "Went together seamlessly and within 20 minutes I was able to access Prime movies - much easier than using the PC that I had been using  connected to my home theater setup.  Would recommend it to anyone from a single TV to Home Theater.", "verified": true, "helpfulness": "0/1", "author": "RPM"}, {"rating": 5.0, "review": "So far, I am very happy with Amazon Fire TV. I happened to be a Prime member from an earlier purchase that I agreed to try it and never cancelled. So glad I have it though since they offer quite a bit of good programs included w prime. If I didn't have that, I would not appreciate all of the charges for each program. The voice activation seems intermittent, sometimes it works others times not responsive. I love the responsiveness and high def picture. I've step closer to losing cable for good!!", "verified": true, "helpfulness": "0/1", "author": "David W Tauer"}, {"rating": 4.0, "review": "I think it is great for catching my favorite sports teams and also catching up on shows I missed.  I did have some  trouble changing from \"Upstairs Downstairs\" to catching the football game on ESPN.  I kept getting movies or television football shows but not the game that was being played at that time.  Fortunately I had a grandson nearby and he told me to unplug and replug after 10 seconds and it worked.  I was able to watch the game. I'm sorry, at 85 and having worked for years on computers as a transcriptionist I still am not a computer whiz and need the younger generation  to guide me.", "verified": true, "helpfulness": "0/1", "author": "Deborah Stitt"}, {"rating": 3.0, "review": "TV works great for prime content and Netflix.  The disappointing thing is that this does NOT work with HBO Go if you subscribe to internet/cable through Xfinity/Comcast.  This caught me off guard because the specs said it would use HBO Go, but I didn't do enough research beforehand to see that the app wasn't set for use with the biggest US cable provider.  Hope this gets resolved soon.", "verified": true, "helpfulness": "0/0", "author": "Ben F"}, {"rating": 5.0, "review": "Love it. Disconnected our directtv and switched to Amazon Fire. No complaints", "verified": true, "helpfulness": "0/1", "author": "Anda Marie Shiarla"}, {"rating": 5.0, "review": "Great option for viewing TV.", "verified": true, "helpfulness": "0/1", "author": "Jennifer"}, {"rating": 5.0, "review": "I love it much better than cable TV", "verified": true, "helpfulness": "0/0", "author": "johny lyons"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "emilio"}, {"rating": 5.0, "review": "Great entertainment simple hook up good deal.", "verified": true, "helpfulness": "0/1", "author": "Jimmie Chambers"}, {"rating": 3.0, "review": "I had purchased the device primarily to be able to access HBO GO on my Panasonic TV.  My service provider is Charter Cable.  After the easy set up, I found out that HBO GO is not accessible because Charter does not provide a link.  A call to Charter cable - we were told there was no plan to establish an HBO GO link in the future.  Very disappointed, but not the fault of the device.", "verified": true, "helpfulness": "0/0", "author": "Beach boy"}]