[{"rating": 4.0, "review": "Great product. Only issue is they don't currently have a cable TV alternative like Apple is about to unviel. I bought it to use the sling TV and it works great for that as the processor is fast enough to avoid slow download speeds", "verified": true, "helpfulness": "0/0", "author": "Bruce F. Lester Jr. \"War expert\""}, {"rating": 5.0, "review": "Very satisfied with how user friendly the Fire is . All that one might need .", "verified": true, "helpfulness": "0/0", "author": "Mary A. Gore"}, {"rating": 5.0, "review": "Best purchase I've made in a long time!", "verified": true, "helpfulness": "0/0", "author": "Hannah Hambrock"}, {"rating": 5.0, "review": "I tried both this and the stick version, beyond a doubt the ability to hard wire the device is with the extra money. Hard wiring the device also allows for a better streaming experience (less buffering).The one thing that I am less pleased with is the fact that I can not use both devices with in the same house; when I attempted to do so I found that either remote can operate the other device. Even though they were two floors away from each other the devices would not operate independently and thus would not work correctly either..", "verified": true, "helpfulness": "0/0", "author": "Darrin Hickey"}, {"rating": 5.0, "review": "Better than expected!", "verified": true, "helpfulness": "0/0", "author": "brian flesher"}, {"rating": 5.0, "review": "I had amazon send me a replacement to my original because it kept turning off randomly (apparently this was a known bug that was corrected in this newer model). Haven't had any issues with this one. The functionality of this is great.I had a flat-screen LCD that was sitting in a closet because it was replaced with our Smart TV. But, it felt like such a waste to let it sit there when there was nothing wrong with it. This Amazon Fire TV coupled with a new TV mount and my TV is now mounted in the study and you would never know it wasn't a Smart TV.  Has all the functionality of our Smart TV plus I feel like I have easier access to games now...and it's way cheaper than a new TV.When I checked on 8-27-15, it looks like amazon has stopped selling this version. I would try the stick version though, considering my success.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Very pleased,no problems with our fire TV", "verified": true, "helpfulness": "0/0", "author": "Karen M. Seger"}, {"rating": 5.0, "review": "This was my first streaming device, exceeded my expectations and the quality is awesome. I can't wait to try the game controller! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Dan Webb"}, {"rating": 5.0, "review": "Best electronics decision I've ever made for this kind of device. The fastest movie load time ever seen, plays games seemlessly, very easy to understand and operate. Did I mention fast movie load time? Any movie loads and plays in HD less than a second, that's seconds faster than my smart TV and my computer.", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 5.0, "review": "I was about to order another Fire TV and it's unavailable and don't know when it's available again???  That makes me sad...", "verified": true, "helpfulness": "1/1", "author": "Crazyanimegyrl"}]