[{"rating": 4.0, "review": "I'd give it 5 stars if the voice search worked with Netflix. So far no complaints other than not having a way to shorten auto off time.", "verified": true, "helpfulness": "1/1", "author": "Thomas G. Birt \"Tom Birt\""}, {"rating": 3.0, "review": "Hi I bought One but it is dont work in my Country  Saudi Arabia Is ther Anysolution .  Thanks", "verified": true, "helpfulness": "1/6", "author": "Sami H."}, {"rating": 5.0, "review": "I am very happy with the ease of set up and the voice control is fantastic!  It makes selecting a movie so much easier than the other pay for movie services.", "verified": true, "helpfulness": "1/1", "author": "DHA"}, {"rating": 5.0, "review": "This is a device that works as advertised.  It is simple and quick to set up but requires a call to the internet provider in order to obtain the necessary password.  Since I never watch any netword TV except 'Fox' having movies available at all times is very satisfying.", "verified": true, "helpfulness": "0/1", "author": "Olde Uncle Mark \"Mark Williamson\""}, {"rating": 5.0, "review": "I bought it to run XBMC, and it works great. I had no experience loading custom apps on Android boxes, but had XBMC running in about 5 minutes.  It runs all my videos well.  All the other Amazon functionality is a nice bonus.  All in all very happy.", "verified": true, "helpfulness": "4/5", "author": "KG"}, {"rating": 5.0, "review": "This is an awesome product.  I had received a Kindle Paperwhite as a Christmas gift, and it has since become an indispensable part of my daily life.  The fit and finish of that product is top notch, and so I was eager to see if this one matches the quality I have come to expect from Amazon.Short answer: it does.  Everything works perfectly, and I still have trouble believing that they packed this much awesomeness into such a small box.  Having had bad experiences with streaming video in the past, I was a little wary about trying this, but I needn't have worried.  Browsing menus is fast, the voice search works great, and watching movies is flawless.  A nice touch is all of the detailed help videos which are included as the first thing you see after you set up the device.Even setup is easy, fast and fun.  Hook it up to the TV, plug it in, enter network password, wait for a short update, and that's it, ready to go.Nice job, big A.  Keep this up, and you will force me to buy all of your products.", "verified": true, "helpfulness": "2/2", "author": "Michael Nys"}, {"rating": 5.0, "review": "This is without a doubt one of the best purchases that I have made on Amazon. below is a breakdown.Pros:Setup up is easyBluetooth Remote works all over the house so I can voice search upstairs and have the video ready to play when I get to itVoice search REALLY DOES WORKRemote and Box are SUPER fastCons:Setup takes a while (even though it is easy)I did not know my voice searches were recorded until I was looking around in my device area on amazon.com/manageyourkindleRemote seems to use a lot of power, I replaced batteries after first month due to slower response time", "verified": true, "helpfulness": "3/3", "author": "Amazonianator"}, {"rating": 1.0, "review": "I assumed, based on the product description, that access to \"40,000 Songs\" meant that I could play my own 2800 songs on the cloud that I also pay Amazon a couple hundred dollars a year for.  Why not a cloud player app for crying out loud.  If I'm mistaken and I CAN access my cloud music, I sure appreciate it if somebody could tell me how.  That's why I bought it.  I might return it because I can already get everything by Amazon's own content through other means.  Kind of a drag that I can't play my AMAZON PURCHASED music through my expensive home theater. I couldn't care less about viewing my Amazon cloud photos on my home theater.", "verified": true, "helpfulness": "3/13", "author": "Robert Earl Weiss \"bobearlw\""}, {"rating": 2.0, "review": "I am in south America and heare docen't  work like Apple TVApple TV is very easy, you see everything in one page.The Amazon fire Tv  control is very nice.", "verified": true, "helpfulness": "2/6", "author": "Eduardo Mc Allister \"Eduardo Mc Allister\""}, {"rating": 5.0, "review": "Being an amazon prime member for a few years now, I was hoping they would come up with a product like this. Simple to set up. Easy to use.", "verified": true, "helpfulness": "1/1", "author": "Lauren"}]