[{"rating": 1.0, "review": "Bought for HBOGO which won't even deliver to the device... waste of money.", "verified": true, "helpfulness": "1/13", "author": "Weasel Words"}, {"rating": 5.0, "review": "The Best Tool to have for my shipping and Movie streaming needs....The best feature being the \"Voice\" command.....LOVE THIS!!!!", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Really enjoying Fire TV.  Hope to see more and more shows come available.  The product is built pretty solid - not cheaply made.", "verified": true, "helpfulness": "0/0", "author": "Robert J Spencer"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "keisha griffin"}, {"rating": 5.0, "review": "Well worth it to me and my wife. I already have prime so this has allowed me to watch my shows on my wide screen. Very small, works great", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 1.0, "review": "WE have had all kinds of problem with this unit...some of it too technical but the biggest issue is not recognizing my WI Fi network and I have a commercial system.It screams I have gotten very little assistance on this issue. Bad so far....", "verified": true, "helpfulness": "4/8", "author": "Hossman"}, {"rating": 4.0, "review": "Responsive UI, great remote, perfect audio and display.  Primary UI / menu system is too Amazon-focused.  Netflix etc. are totally second class citizens -- no voice search etc.  Would be 5 stars with more user-centric navigation / features.", "verified": true, "helpfulness": "0/1", "author": "Rick Hull"}, {"rating": 5.0, "review": "Works great and love watching tv show on Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer101"}, {"rating": 5.0, "review": "We've owned the Fire TV for going on 2 weeks now.  I love it so far.• It is tiny, what a delight!• Easy to set up, and it connected easily with our wireless internet.• Voice command on the remote works well.• It turns itself off after it hasn't been used after period of time.• Clear perfect picture and auto transmission.We already have Amazon Prime, kindle readers and a kindle fire HDX.  I have used the fire HDX to watch movies and tv shows for a year.• Many reviewers have commented on the difficulties with knowing which programming is flagged as \"Prime\", and there for free, when scrolling on the fire tv.  What I found works for us, is to research what we want to watch, (movie or tv show), on the kindle fire HDX then use the voice search to pull up the show you want directly on the fire tv.  It is much easier to tell what is free prime programing on the kindle fire versus the way the prime labelling is on the fire tv.We haven't tried the gaming features yet.We're very very happy with the purchase of the fire tv.Can't wait for a Amazon automatic cooker and dishwasher to be developed.  ;)", "verified": true, "helpfulness": "1/1", "author": "Forrest & Lynn"}, {"rating": 5.0, "review": "If there were a sixth star I would add it.Somehow in a world where all the technology leaves me looking for the instruction manual (no longer provided) this item seems to think the way I do. I have never had anything as surprisingly user-friendly (at least for me) since my first iPod. I have not felt this much control over TV, cable, premium services, movies, outside services since they put the first box on top of my TV in New York City circa 1977, Thank you.", "verified": true, "helpfulness": "1/1", "author": "Seattle Guy"}]