[{"rating": 4.0, "review": "Like the Amzon TV a lot. The response time is much better than Roku. They can improve the layout of app placements. There is a lot to look and I loose my way easily due to such placement. Reaching the \"settings\" section needs a lot of scrolling and clicks. The device connected to my Wifi without issues. However, when it disconnects (which is rare ), it is not reconnecting to the network automatically.  Amazon can and should improve the interface in that respect.", "verified": true, "helpfulness": "1/1", "author": "MJay"}, {"rating": 5.0, "review": "Was very easy to hook up and works great", "verified": true, "helpfulness": "0/0", "author": "awiggy"}, {"rating": 5.0, "review": "i will never go back to cable again.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Siever"}, {"rating": 4.0, "review": "Make it turn off and will be great", "verified": true, "helpfulness": "0/0", "author": "aliegm"}, {"rating": 4.0, "review": "It would be a 5 star product but a couple things annoy me. Like many others the fact that the voice feature really only works on Amazon Video detracts from what could be a great feature instead of so-so.. I will give due that the voice is pretty darn accurate. But also it's a feature I don't use often for I'm a scanner. I like to scan through movies and show to pick out something, rarely do I have a title in mind, i.e. not a searcher. (Also I find it much more accurate and convenient to use the computer on the internet to manage my streaming list - both Amazon and Netflix)  But it's nice when I want it. My second annoyance is the clicker's (AKA the remote) curved bottom - looks fantastic but it turns in my old semi-arthritic hand and I end up pressing up or down instead of L/R. Other that those relative minor things it's a great step up from my 2 Blu-ray built in streaming devices or the Ruku stick (don't ask) that was discarded. A bit more tinkering and it might be perfect - for me.", "verified": true, "helpfulness": "1/1", "author": "Alfie \"Silverbird controller\""}, {"rating": 5.0, "review": "Absolutely LOVE this!  It's small so it doesn't take up a lot of room.  In fact, you hardly notice it all.  It's extremely easy to connect, very easy to use and gives me so many options for programs to watch.  I haven't even finished discovering all the things it can do!!  I would highly suggest you purchase this item.  You won't be disappointed!", "verified": true, "helpfulness": "0/0", "author": "Valerie Young"}, {"rating": 5.0, "review": "I love my fire tv", "verified": true, "helpfulness": "0/0", "author": "pix1102"}, {"rating": 5.0, "review": "nice powerful unit no problems", "verified": true, "helpfulness": "0/0", "author": "catherine lee"}, {"rating": 4.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "lowell"}, {"rating": 5.0, "review": "Love this item, remote is a little small", "verified": true, "helpfulness": "0/0", "author": "Rodney Bennett"}]