[{"rating": 5.0, "review": "Best purchase I've made this year. Works like a charm . Sets up quickly and delivers a lot of bang for the buck.  Amazon will add content and additional apps like they do with all of their other devices. At some point we will all be saying goodbye to cable tv. Try out the prime fireplace videos. My living room now has what appears to be a 40 in fireplace in addition to all the normal content. Liked the Amazon fire TV so much I immediately bought another.", "verified": true, "helpfulness": "1/1", "author": "Ablebodiedseaman"}, {"rating": 5.0, "review": "Fire TV is lightening fast compared to Apple TV....please get HBO Go soon (I hear it will be soon enough).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"hmilleriv\""}, {"rating": 3.0, "review": "I really wanted to love this product because I'm an Amazon fan girl. However, I was left a little disappointed.The good:It's a great streaming machine to watch your Netflix, Hulu, and other subscriptions.The Bad:I have been using my PS3, so I already had that capability. Nothing new here, so if you are streaming from something already, I don't recommend wasting your money just yet.the good:Prime members get free movies and TV showsThe bad:The content available is low-quality and not even worth watching most of the time. They also try to hook you by giving you 1 season for free and then have to pay for the second.", "verified": true, "helpfulness": "0/0", "author": "Andrea Weilbacher"}, {"rating": 4.0, "review": "It would get five stars if the voice search worked with other apps. If you ever have to type anything it takes a minute But the gaming is great. Could spend hours on the thing.", "verified": true, "helpfulness": "1/1", "author": "mayter"}, {"rating": 5.0, "review": "The streaming on the Amazon Fire is absolutely flawless. No more waiting for the videos to buffer or the sudden freeze in the middle of my program that really drove me nuts. I was also surprised by the accuracy of the voice recognition. Although I have other ways to stream my movies, this has quickly replaced all my other products. Great job, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Claudia Ponte"}, {"rating": 4.0, "review": "I like the box. It is very small and streams movies very well. Oddly enough, you would expect Amazon's product to have access to Amazon's MP3 Cloud player and store. I love streaming music and it would have been nice to be able to access my own stuff from the cloud. I am hopeful that an app will appear very soon for this.", "verified": true, "helpfulness": "3/3", "author": "Mark E Daucher"}, {"rating": 5.0, "review": "OUTSTANDING -- say bye-bye to cable - great interface - easy set up and minimal learning curve - Voice Command is great feature (only shortcoming would be lack of headphone jacks within remote (ala ruku)!", "verified": true, "helpfulness": "0/0", "author": "M"}, {"rating": 3.0, "review": "is better.  I bought it based on the product review.  I have a Roku 3 and it's better for apps and programs.", "verified": true, "helpfulness": "1/1", "author": "GPK"}, {"rating": 5.0, "review": "Will help me save on cable bill i can now pay in a year what i used to in a month", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 4.0, "review": "Summary:The Roku 3 provides more channels and has a more pleasant interface. The Fire TV is faster and has some nice features - voice control and games, primarily - but isn't yet, in my opinion, superior.The picture quality is great on the Fire, but parental controls are very limited, and there is only a single account for everything - including apps, games, photos, etc. - which is less than ideal. Finally, there is no easy way to find Prime Video content, which means, from a a TV/movie point of view, there is very little the Fire TV has that the Roku doesn't, and it's lacking the smartphone remote app, the headphone jack, and the more welcoming interface and vastly larger channel library of the Roku 3.If Amazon makes Prime content easier to find, adds multiple accounts (at least for games), and makes parental controls more fine-grained, they could very easily have a winner here. But they don't... yet. If the game selection appeals to you, get this and hope for software updates. Otherwise, the Roku 3 is still the better option for viewing.-----------Longer format:I've got - and use - the gamut of TV streamers; on the main home TV, there's an Apple TV, a Chromecast, a Roku 3, this Fire TV, and a few other things that can stream. Of all of them, my favorites are the Roku 3 and the Fire TV. Here's why:The Chromecast is very nice in that it just hides away and is so easy to set up, but unless you have a lot of Google Play content (I do have a fair amount), there isn't a hugely compelling reason for most to use it. It's also the only one of the big 4 that won't allow a wired Ethernet connection. I use it almost solely for Play content (movies and music).The Apple TV is essential if you have iTunes content you want to watch, but otherwise it's aging and doesn't provide anything meaningful you can't find elsewhere. I use it for the occasional iTunes movie and to watch movie trailers, but nothing else anymore.The Roku 3 is a wonderbox. Yes, it won't play iTunes or Google Play content, but it'll play everything else, and it'll play more channels with more content than any other device out there. It's very easy to use, it's fast, the included remote with headphone jack is very handy, and the Roku smartphone app is fantastic. I use it for almost everything I watch, including Netflix, Plex and HBO GO.This Fire TV is the newcomer and is handily the fastest of all of them. I love the voice control, which works as well as everyone says, and I really like the included remote, which is quite comfortable. I also have the game controller, and, while it's OK, it's not outstanding - but serviceable, though. The channel selection is, honestly, lacking compared to the Roku 3's options, and, as others have said, there's just no soul to the interface. It's fast, it's effective, but... I don't really feel at all compelled to surf around and find things. I see absolutely no compelling reason to watch anything on this as opposed to the Roku 3, especially given the very nice smartphone app it has, and I don't see myself using it for TV viewing unless I'm on a Prime binge, and even then, probably not.I have a Kindle HDX, and I've had other Kindles, so I'm well aware that Amazon sells these devices to get you to buy more things from them, and for the most part it doesn't bother me, but it is extremely irksome - as others have noted - to not be able to find Prime video content without essentially going to everything and seeing if there's a charge for watching. Without that ability, I might as well just stick to the Roku 3. The one exception to this is the ability to use a Kindle Fire HDX (maybe the HD as well) to view secondary content (actor info, trivia, etc) on the Kindle while watching the movie or show. That's cool, and I do like that, but it's only for Prime content. Still, it's a nice plus.So... if I'm not going to use this much for TV, then what will I use it for? The games, perhaps. Let me preface this by saying that I'm not a gamer in any real sense. I've got an Xbox 360, a Playstation 3 (both old), a Wii U (can you tell I have kids?) and this, but I don't use the game consoles; my daughters use the Wii U and the others sit unused.However... I do play games on the Fire (sometimes). I like that it's very quick and easy (and inexpensive) to download them. The selection is, at best, limited, but there is some fun content. That said... it's a great game console when you consider that it's a $99 streamer *and* a console, and it does pretty well with the graphics thrown at it, but it's not a great standalone game console. Fun, usable, and OK, but not exceptional. Also, there is only one user account.Actually, it's worth noting that again: there's only one user account for games, which means that everyone who uses it plays on the same account. That's not great.Likewise, the parental controls are very, very, *very* limited. Pretty much all or nothing for very broad categories. No ratings-specific content limits... nothing. That's not good.Also, the one-user-per-box policy means you either have all of your photos visible (or none). If there are photos on your account, they'll be on here. That isn't an issue for me, but I can see it being a problem for some, or that people would want multiple accounts connected.The Fire TV, to me, as it stands now, is a nice device for a secondary TV where someone will play some games on it, but it needs work to be truly useful. The Roku 3 is still a better bet for most users today.", "verified": true, "helpfulness": "4/4", "author": "Joe Wood"}]