[{"rating": 1.0, "review": "I would like to get the Amazon TV box, my question is, can I get shows like evening television, Dancing with the Stars, the voice, all those shows when they are aired? Also can I get shows like awards shows when the air? Or is this just for episodes already aired?", "verified": false, "helpfulness": "1/17", "author": "Raina Edwards"}, {"rating": 5.0, "review": "HIGHLY RECOMMEND! Amazon Fire TV rocks! Goodbyeeeeeeee cable!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Nice format. Many bugs.", "verified": true, "helpfulness": "0/7", "author": "Mark S."}, {"rating": 5.0, "review": "A great way to watch great television when cable is not offered in the area and internet is too slow to make use of downloading movies from the various other offerings.  I am very pleased with the purchase.", "verified": true, "helpfulness": "0/0", "author": "lcarp"}, {"rating": 4.0, "review": "I am really looking forward to purchasing this unit, as soon as you make the feature of being able to plug in a local HD with your own content (music or videos) via the USB port.  I have been told repeatedly it is coming soon, but still nothing.  Once this happens, this unit will be untouchable.  I wish I knew if this will simply be a software upgrade to the existing unit (if which I would buy now), or if a newer model will be replacing it.  I have a lot of content I would love to watch via this unit!", "verified": false, "helpfulness": "0/4", "author": "S. Wheeler"}, {"rating": 5.0, "review": "I've purchased two units so far:  I loved mine so much after a year that I bought a second one for my sister.  The best quality is the simplicity of the system.  Just press the microphone button and speak what you want to see and \"presto\" it quickly appears.  The navigation buttons are well placed and easy to get used to.  The remote as a smooth, rubbery, high quality texture that's easy to grip.Video content selections are relatively good compared to my Netflix and Xfinity On Demand services, but there is room for improvement by increasing the number of free titles and decreasing the pay-per-view lot.It's also great to access photos, music from my Amazon cloud and other cloud and Droid smartphone files on the home theater system.My only complaint is about the mysterious power on/off phenomenon.  The unit will power down only if it hasn't been used for a couple of days.  I would expect it to power off after an hour or two of non-use.  It powers up very quickly when any button is pressed when it is in the dormant state.For the price, superb voice recognition, and Amazon Prime viewing and photo storage perks, Fire TV is one helluva deal.", "verified": true, "helpfulness": "0/0", "author": "watch collector"}, {"rating": 4.0, "review": "I've only had this device for a few days, but I'm getting some real mileage out of it!Now picture this; You want to cut the cable TV bill from your life, but you don't want to be limited to where you can view your Over The Air TV channels. Plus, you have a large collection of local content that begs to seen on the big TV.What's a person to do?  Well I found my answer in the Amazon Fire TV (plus some apps)!Now, I won't go into details over installing XBMC on a Fire TV, as that's better answered by Google. But with XBMC side-loaded, I can see my shared Synology NAS content as well as my workgroup PC shares. Plus lots, lots more, but that goes beyond the scope of this review.When I discovered SiliconDust (Makers of the HDHomeRun HDTC-2US tuner) was selling a native viewing app for the Fire TV in the app store, that was it, I was hooked!  With this set up, I can get all my entertainment through one set top box. No having to juggle inputs anymore! It's brilliant!Now, the four stars rating is for having to resort to loading an app like XBMC on to the Fire TV just to make streaming of local content even possible. A native Fire TV app for streaming local content would be more desirable.Conclusion: This purchase was a very good fit for me and my cord-cutting lifestyle.  The versatility this device has shown me so far has made it worth the purchase.  Highly recommend picking one up!", "verified": true, "helpfulness": "3/3", "author": "Doug B."}, {"rating": 5.0, "review": "I bought this to try it out, ready for a disappointment. Amazon did the opposite I was stunned and still months later me and my family continued to be amazed. It's not a cheap made box like the other \"leading\" brand out there. It's so nice to type or use voice control to search what you are looking for. The apps that are on this device are phenomenal and the quality of viewing is so great. On the other brand we have in the home we were constantly dropping connection and rebooting the box and was told it was a wifi issue. Amazon proved that company wrong I have not once since purchasing the device had to reboot this.I love how small the box is and blends it no one notices it's there but us. You may be concerned with buying another box for streaming but you should rethink that this is a device to invest in. We love it so much we moved into a larger home and bought a few additional for other tvs we have added instead of renting cable boxes.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Glad I got it.", "verified": true, "helpfulness": "0/3", "author": "Connie stump"}, {"rating": 1.0, "review": "I am extremely disappointed with this device.  Even though I am Amazon Prime member, all the TV shows and movies I have tried to watch on Amazon will charge me to see them.And Netflix will not work at all.I love Amazon, I am on my 4th Kindle, and I buy and read audio books all the time on it.  All Internet purchases I make, I go to Amazon first.But this Amazon Fire TV is extremely disappointing.  My Rocu2 box is so easy to use and watch Amazon, Netflix and Hulu....don't know about the Fire TV....so far, not so good.Also, I bought it on Nov 28th for $99 and now (Dec 1st) it is for sale for $69  :-(", "verified": true, "helpfulness": "3/11", "author": "C. Chase \"BajaMike\""}]