[{"rating": 4.0, "review": "Just needs more free or near free programming.", "verified": true, "helpfulness": "1/1", "author": "Stephen H. Cain"}, {"rating": 3.0, "review": "I am not exactly happy with the fire tv. I think it still needs some work from Amazon. What I like:- It looks good, a litle bigger than Rokus and others, but that is not a problem.- The interface is very nice, it looks clean and it is very very fast, applications starts inmediatly- The games are very nice for a streaming box and in this short time there is a good selection.What I don't like:- Games have lags, sometimes it feels like they are going to freeze, but they don't.- Youtube and netflix take too much time to show video in HD, I don't know if that is a problem of buffering, this is comparing with my Roku 3, videos start in HD inmediatly, netflix never failed in Roku 3.What I have to mention is an issue that I had yesterday: I turn on the parental control and create a PIN, but I don't know what happen, the fire tv disconected from the internet and it starts to ask for the PIN, but when I enter the PIN it says that there was no internet, I couldn't do anything, I restarted, tried to factory reset, anything. I had to take the FTV and connect it to internet wired  and takes like 5 minutos to let me put the PIN, and inmediatly turn off the parental control.Other thing that happens two times is that for no reason it has no sound and later sounds is on again, this is not happen any more, but I have to be aware of this.I am still testing it because I am not satisfied with it. Will update in a while.", "verified": true, "helpfulness": "0/0", "author": "JH"}, {"rating": 5.0, "review": "LOVE IT!  We live out in the country and have slow internet and it has not ever once buffered.  I wish it was slightly easier to sort the free movies.  The voice search is almost always right.  I can link my other sites through it such as netflicks.  It's a win for us.", "verified": true, "helpfulness": "0/0", "author": "SRS"}, {"rating": 1.0, "review": "BUY APPLE TV", "verified": true, "helpfulness": "3/21", "author": "copija"}, {"rating": 5.0, "review": "The voice search program is Great!", "verified": true, "helpfulness": "0/0", "author": "Mike M"}, {"rating": 4.0, "review": "I would have given this a 5 star rating, but IMO I think they should develop an app to use your Android phone as the remote. Other than that this thing is awesome. Besides satilite providers there is only ONE cable provider where I live, that is unacceptable to me and they charge outrageous rates. Living in an apartment makes makes it difficult to get satilite services too. With Fire Tv I get to pay for what I WANT to watch, not for a bunch of channels and shows I couldn't care less about. Plus tons of free movies and shows already on prime video and netflix and other services you'd have to be a dummy to not think this was a great little box to have!", "verified": true, "helpfulness": "0/0", "author": "Chad Dewar"}, {"rating": 3.0, "review": "The Fire TV offers a fantastic way to search for and find movies or shows you want to watch, but browsing is tedious.", "verified": true, "helpfulness": "0/0", "author": "Brian Haley"}, {"rating": 4.0, "review": "The Fire TV is great. It shipped immediately, and it arrived two days after I bought it. You really need in Amazon prime membership in order to use it, but that is okay. I'm knew that before I bought it. Some people have complained about that, but they should've done their research.", "verified": true, "helpfulness": "0/0", "author": "Jacob \"Jacob\""}, {"rating": 3.0, "review": "Amazon prime membership is very limited when you are accessing movies, those included with the membership are very old, in fact those you need to pay for are already included in channels like HBO, STARZ and Cinemax.", "verified": true, "helpfulness": "4/5", "author": "jmanuel"}, {"rating": 3.0, "review": "Doesn't work so well outside the US (although I know it's not meant to offcia", "verified": true, "helpfulness": "0/0", "author": "Safdar Mustafa"}]