[{"rating": 3.0, "review": "Works very well and well worth the added cost over the lower priced models because of added speed when it comes to loading and navigating the apps and the enhanced wifi remote and voice search. I would give it 5 stars but it doesn't include the Vudu app and I am pretty sure amazon doesn't want to for the self serving reason that they want you to use their movie services.", "verified": true, "helpfulness": "0/2", "author": "Kent Ames"}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "april witt"}, {"rating": 5.0, "review": "Outstanding product.  It was everything I expected.  Also the customer support feature is amazing.  I got a call within 5 seconds after I clicked on the phone number to have them call.  Then I waited less than 20 seconds for someone to come on the line.  My only complaint is when switching over to Fire, you have to click on Home button to activate it.  That is not a problem for me, but we share this with multiple owners in a beach house and they may not figure that out.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Theology Grad\""}, {"rating": 5.0, "review": "This, like all Amazon products, met my highest expectations. I am the furthest thing from being a geek, and this device was extremely easy for me to set up. Truly, plug n' play.", "verified": true, "helpfulness": "0/0", "author": "Neil"}, {"rating": 5.0, "review": "Easy to install. Works like a charm. Good by cable", "verified": true, "helpfulness": "0/0", "author": "Donna Teeple"}, {"rating": 5.0, "review": "We changed cable companies, so I could no longer use my Tivo, which I dearly loved.  One of the features of the Tivo was using Amazon Prime and Netflix easily.I'd gotten the Fire Stick for my mother and she loves it.  I decided to get the Fire TV because I have the ability to directly hook via ethernet to the router.  Glad I did.  This is super fast and has all the features I like.  The voice search is quite handy and works much better than I expected.I debated between the Fire Stick and the Fire TV, and as stated above, I ended up with the Fire TV.  A really good decision on my part.It was easy to set up out of the box and since I'm a Prime customer it came already configured to my account.I don't have any complaints or negatives about it at all.", "verified": true, "helpfulness": "1/1", "author": "Holly C. Sumner \"phantomsgirlfriend\""}, {"rating": 4.0, "review": "Had problems with some apps at beginning, but customer service helped and now apps are running smooth. Does not have as many apps as some competitors, but very fast and seamless interface.", "verified": true, "helpfulness": "0/0", "author": "L. E. Parker"}, {"rating": 5.0, "review": "Highly recommend this product!  I can't even begin to put into words how great this product is; so I won't, except to say, PURCHASE IT!  Music, movies, TV Shows...it's all there.  Love, love, love it!", "verified": true, "helpfulness": "1/1", "author": "JCB95608"}, {"rating": 4.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 2.0, "review": "your product fell way short from what i expectedyour tv shows are NOT what we are interested ini would not recommend Amazon fire tv to any one.one of your competitor is with out a doubt more comprehensive", "verified": true, "helpfulness": "0/7", "author": "david conroy"}]