[{"rating": 3.0, "review": "Plenty of show's for men & teens. No show's for wife and daughter. Short on family show's and music. Need Fox & CNN BBC News too! More new run movie and tv show's. Fire has potential to wipe our competition with a little tweeting! Go for it!", "verified": true, "helpfulness": "0/2", "author": "Steven Sutherland"}, {"rating": 5.0, "review": "I love my Fire TV and the many things that it does. It allows me to stream music, movies and play games. The box is amazingly small and takes such a small amount of space. The remote is just as small, but so functional. The voice search is my favorite feature. Speak a command into the remote and accurately does what you ask. I have a Roku Box and Chromecast and enjoy this over them. Good job Amazon! ,", "verified": true, "helpfulness": "1/1", "author": "Phyllis D. Bass \"pbass1\""}, {"rating": 2.0, "review": "It worked ok for the first month or so. However, I was disappointed to learn that you can only do voice search for programing available on amazon, not on the additional apps like Netflix or Hulu, AND, there is no clear way to search for the FREE prime programing. Most everything I come accross is still for purchase. The only prime categories I see are the \"Recently added to Prime\" or \"Top movies on Prime\" but the two categories combined only contain about 250 movies. In the TV section, the majority of the programing in the Prime sections say \"add to watch list\" so you can't even view them. Where are the over 200,000 TV episodes and movies etc? OR, is it aprox 250 that you get for free with your prime membership and the rest you still have to buy (or add to your watchlist and wait to buy) after you pay $99 for the membership?  In addition, the netflix app just quit working. I get an error message on every program I try to play that says \"we're having trouble playing this title right now. Please try again later or select a different title.\" It has been saying that for about a month now. I have tried unistalling and reinstalling the app, clearing the cache, and the data and nothing works yet Netflix still works just fine on my computer and other streaming video players in the house. So frustrating. I am wishing I went with the Roku.", "verified": true, "helpfulness": "4/5", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This device turned out to have very high quality video, and a voice search feature which is great for Amazon. The fun ends there, overall quality is good but the software is definitely designed to push you into Amazon prime and/or Amazon purchases. It's not a good platform for watching netlfix, the searching on the netflix app is useless, there is no \"movies like\" or any real way to search. If you are in the Amazon eco-system this is probably an amazing device for you. If you are more a netflix'ster like myself that doesn't search on tablet and send to t.v. this device will not do. The apps on Roku, and AppleTV are far more advanced and their searches are more useful.Pros: Build quality, Amazon content delivery, voice searchCons: NetFlix integration is poor at best, hard to search for things anywhere but Amazon apps, no genre filter in NF, and more.It is a first release, but if you are used to AppleTV/Roku and think you want to change don't bother.", "verified": true, "helpfulness": "3/4", "author": "S. DAY \"Water Buffalo\""}, {"rating": 5.0, "review": "If you are an Amazon Prime member this has to become your choice in streaming entertainment boxes. If not and Amazon Prime member (why in the hell not) the Roku 3 is probably your best bet. This thing is fast to navigate and easy to set up and the picture quality is fantastic. No buffering here. Search is voice activated and works great.", "verified": true, "helpfulness": "2/2", "author": "Johnnyhixson"}, {"rating": 5.0, "review": "Turned my plasm TV into a Smart TV!", "verified": true, "helpfulness": "0/0", "author": "bsafe"}, {"rating": 5.0, "review": "Great choices for viewing.  Wonderful video and sound.  Compact and easy to use.  Would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "KATHLEEN A OBANNION"}, {"rating": 5.0, "review": "Easy to use, super convenient, lots of choices.  It's a knock out to me!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"qovesh\""}, {"rating": 3.0, "review": "Need more Indian latest movies", "verified": true, "helpfulness": "0/1", "author": "Rina Budhai"}, {"rating": 3.0, "review": "Very functional and enjoyable to use. Well done, Amazon, on the first of this type of device!Update: I am removing two stars, because Fire TV does not work with Hulu. I have tried many things to resolve this problem, but nothing helps. I think the problem is also with Hulu itself. My Roku does just fine with Hulu. This is extremely frustrating and disappointing, since I prefer the Fire TV in every other way.", "verified": true, "helpfulness": "0/0", "author": "A. Lindsey"}]