[{"rating": 3.0, "review": "Hopefully the updates will make it better.  After a couple weeks of use, I am not as impressed as I thought I would be.  I have had an Apple TV for a couple years and have no issues wit it.  We decided to set up part of our house as a guest area with its own entertainment area and needed another device to stream TV.  After reading all the reviews and doing comparisons, I decided to go with the Amazon Fire TV.  A lot of this has to do with being an Amazon Prime subscriber and being able to get the full benefits.Some issues I have noticed.  The streaming stops and reloads frequently.  At first I thought it was just because I am watching NETFLIX through it and not Prime TV (I have both because content is different).  That wasn't the issue because it also reloads on Prime TV.  I am running both the Apple TV and Fire TV side by side and the Apple TV performs better.  Once this is fixed, I am sure I will be much happier.  Also, the Apple TV has features like looking up what current local movie theaters are playing and times.  This is a nice feature to have.The plus is that when it is streaming uninterrupted, it is great.", "verified": true, "helpfulness": "2/5", "author": "Amazon Customer"}, {"rating": 3.0, "review": "IT HAS A PROBLEM THAT EVERY 3 TO 4 WEEKS IT NEEDS TO BE RESET TO FACTORY DEFAULT. IF YOU DO NOT LIP SYN WILL GET OFF AND LOADING SLOWS DOWN. OTHERWISE IT DOES EVERY OTHER FUNCTION GREAT AND MY WIFE LOVES IT", "verified": true, "helpfulness": "0/4", "author": "CHARLES F."}, {"rating": 4.0, "review": "The voice command system does not work with Netflix and other providers.  If downloading movies to the USB port was possible this would be great.", "verified": true, "helpfulness": "2/2", "author": "John S."}, {"rating": 5.0, "review": "I have the roku and apple TV and each has good and bad points the fire TV is very nice and very fast etc I canceled Cable TV saving me $750 a year, now we watch shows we want to watch when WE want to watch them", "verified": true, "helpfulness": "1/1", "author": "cme4tv"}, {"rating": 4.0, "review": "It should have external jack for sound system. I have to run volume through tv which is not quality sounds as it reverberate", "verified": true, "helpfulness": "0/0", "author": "baylito99"}, {"rating": 5.0, "review": "Best media streamer I have had to date. Playback is smooth and sound quality great. The movies catalogue does not have the latest movie but decent enough.", "verified": true, "helpfulness": "0/0", "author": "Daune Dominique"}, {"rating": 5.0, "review": "It is a good addition to my Hisense smart TV. It allows me to access content from Hulu and Amazon video and the voice search works flawlessly. 5 stars.", "verified": true, "helpfulness": "0/0", "author": "James R. Pierson"}, {"rating": 4.0, "review": "Like it a lot..need to get Amazon prime and settle in....find out all about it. Easy to install,compact and pretty user friendly.", "verified": true, "helpfulness": "0/0", "author": "thomas shiell"}, {"rating": 5.0, "review": "Love it. Set up in less than five minutes. Lots of content. The device and remote are elegantly designed.", "verified": true, "helpfulness": "0/0", "author": "Robb R"}, {"rating": 4.0, "review": "Yeah, just like what I expected.", "verified": true, "helpfulness": "0/0", "author": "Tiend  tran"}]