[{"rating": 2.0, "review": "First, the good news: The \"FireTV Stick\" works perfectly and does not have the problems I mention below!Unfortunately, the FireTV is completely unusable with my setup.  The FireTV works perfectly if powered on with everything turned on.  However, once anything is turned off, the FireTV will no longer output audio or support HDCP.A bit about my setup: I have an older Sony Receiver that only has two HDMI inputs.  For this reason, I have a MonoPrice HDMI switch that is used to switch between a PS3, DishNetwork Hopper, AppleTV, and the FireTV (replacing a Chromecast).  The switch feeds into my Sony Receiver, which then is sent to my Panasonic TV.I have tried every combination of powering on, powering off, unplugging HDMI cables, etc.  The only thing that gets audio and HDCP working again is completely cold booting the FireTV by unplugging it from the wall.  Clearly the device is capable of supporting my setup, since it works after a cold boot.My rating for this product would be a 4-5 without this problem, as I really enjoy the features and UI of the product.  If you are planning on using this in combination with a Receiver or HDMI switch, I would recommend trying the \"FireTV Stick\" as it seems to work much better.", "verified": true, "helpfulness": "0/1", "author": "Marcus Kellerman"}, {"rating": 5.0, "review": "I have this and a smart TV.  this thing is much faster, the smart tv seems to lag when loading and just doesnt run through the programs as fast as I would like.  The fire is easy to use, easy to setup, and if you get a deal on it its overall pretty cheap.  I add this to a tv before investing in another smart tv.", "verified": true, "helpfulness": "1/1", "author": "Justsulliv"}, {"rating": 4.0, "review": "I am really enjoying this device at the moment.  I have a chromecast and this thing is of course more robust and has better features. As a prime user, I watch prime videos all the time and have been looking for a great device that I can stream to my TV.  Prior to this, I have been wiring my laptop to my TV to cast Prime.  Then I got a Samsung smart TV that can stream Amazon Prime as well.  Unfortunately it does not help me with my TV in my bedroom.  I was in line to get a Fire Stick, but a fiasco with Amazon that they corrected allowed me to get this Fire TV and I am more than happy with it.With what I have used on it, I am happy, which is just the Prime Videos.  I have not used Netflix or Youtube yet on this device.  But just the ability to use Prime Video is great for me.", "verified": true, "helpfulness": "0/0", "author": "ELStiko"}, {"rating": 4.0, "review": "I really love the Amazon Fire TV! And so does the rest of the family. Amazon Prime has many benefits, great movies and shows, and awesome games. Also, Hulu Plus works great and adds so much variety!  But, if you are thinking about buying the Amazon Fire TV mostly to watch Netflix, then you should read the user reviews for the app. The Netflix app wouldn't download or work with me. Here's a link to the reviews: http://www.amazon.com/Netflix-Inc/product-reviews/B00OGRMULA/ref=dp_top_cm_cr_acr_txt?ie=UTF8&showViewpoints;=1", "verified": true, "helpfulness": "0/0", "author": "arp0007"}, {"rating": 5.0, "review": "Pretty cool voice feature.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is an amazing and simple to use tool for as much content as you can imagine.", "verified": true, "helpfulness": "0/0", "author": "Hard Working"}, {"rating": 1.0, "review": "Im just wondering if anyone can tell me if this works with satellite internet????? I have had issues with Netflix because it rebuffers all of the time....", "verified": false, "helpfulness": "0/6", "author": "Michele Lindsey"}, {"rating": 5.0, "review": "Easy to set up. Easy to use. I'm really enjoying this product.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth G."}, {"rating": 5.0, "review": "Omg the best streaming device on the market hands down", "verified": false, "helpfulness": "0/0", "author": "Rowan"}, {"rating": 4.0, "review": "I do like it, I just am kind of annoyed that I can't get some apps on here especially the hbo go app.", "verified": true, "helpfulness": "0/0", "author": "E. Dwyer"}]