[{"rating": 5.0, "review": "A must have.  The quad processors buffer movies perfectly.  The movies play with no skips or interruption like I had going through the smart DVD play and getting on Netflix.  Compliments Netflixs very well as far as movies available.", "verified": true, "helpfulness": "0/0", "author": "Michael J Magiera"}, {"rating": 5.0, "review": "Better than ruku3 (which I also have), voice search is slick and all the apps work well and are fast.  I wish they would embed this right in the tv but it works great, output sound and video quality are also great.", "verified": true, "helpfulness": "0/0", "author": "J. Fraser"}, {"rating": 4.0, "review": "It works well.  Frustrated sometimes that it buffers quite a bit while watching a movie.  Other than that - it's good.  Wish I didn't have to purchase Sling TV to watch the extra channels I want.", "verified": true, "helpfulness": "0/0", "author": "jrrecker"}, {"rating": 5.0, "review": "I really like the Amazon Fire TV. I would suggest hard wiring it to your router, as the wifi does have issues from time to time. It is a great tool for getting tv content in your home. Definitely worth the purchase.", "verified": true, "helpfulness": "0/0", "author": "Prayer Warrior"}, {"rating": 5.0, "review": "Prime movies may not be the best, but the tv shows keep us entertained.  Setup is a breeze and the menu is intuitive.", "verified": true, "helpfulness": "0/0", "author": "K. Delaney"}, {"rating": 5.0, "review": "Fantastic.", "verified": true, "helpfulness": "0/0", "author": "Julia A. Pierce"}, {"rating": 5.0, "review": "Love the Fire TV!  Watch it often and the Set Up was super easy for an older lady.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "We absolutely love this.  It is so easy to use, even your 4 yo, mother in law or grandma can use it. hahaha  I love how we can stream netflix, hulu plus and others using this, as well as anything from amazon prime.  Its awesome. That is the only streaming device we use now.", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Kate Hollar"}, {"rating": 5.0, "review": "Exceeded my expectations.  Surprisingly good graphics on games.  Glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}]