[{"rating": 3.0, "review": "Be cautious if you have Prime you have to click other viewing options to view stuff free.It is super fast compared to the Roku.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Thompson"}, {"rating": 5.0, "review": "Love it. Clear menus to navigate and I like how easy it is to browse. Also works really quickly, I've had no buffering issues like I did with my apple tv.", "verified": true, "helpfulness": "0/0", "author": "Ashley Moore \"Ash\""}, {"rating": 5.0, "review": "👌👌👌", "verified": true, "helpfulness": "0/0", "author": "VANESSA BOUHOT"}, {"rating": 1.0, "review": "Refuses to stay connected to the network. Each time I want to use it I have to reconnect it to the router. Very disappointed in this.", "verified": true, "helpfulness": "2/5", "author": "Jon Wilcox"}, {"rating": 4.0, "review": "Great for watching YouTube and netflix", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 5.0, "review": "Love this item. Very easy to use", "verified": true, "helpfulness": "0/0", "author": "CHRISTINE P BOWMAN"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Roberto"}, {"rating": 1.0, "review": "Before purchasing this item, I checked the specifications to ensure it would work with my current DSL service.  No required minimum speed was specified, only \"high speed internet service\".  Since I am able to stream movies to my Kindle Fire device, I assumed the Amazon Fire TV (with quad-core processor) would have no problems.  Wrong!  Instead of buffering based on data speed, this device simply freezes every 30 seconds.  Unacceptable.Amazon - If there is a minimum internet data speed requirement for Amazon Fire TV, please *clearly* list the exact threshold required.  Don't just say \"high speed internet service\", since DSL technically falls into this *vague* category.", "verified": true, "helpfulness": "3/5", "author": "JSP"}, {"rating": 5.0, "review": "easy to set up and we are enjoying the programs.", "verified": true, "helpfulness": "0/0", "author": "Lorraine"}, {"rating": 5.0, "review": "Love this for watching netflex an hulu plus and amazon prime", "verified": true, "helpfulness": "0/0", "author": "nancy Davis"}]