[{"rating": 5.0, "review": "Simple to hook up, Opened a whole new world of viewing!", "verified": true, "helpfulness": "0/0", "author": "shari johnson"}, {"rating": 3.0, "review": "The advertisements tell you what is included, not that most things have a giant price tag if you watch them.  The games are a joke, I had hoped for multi player online games.  Most of the games you have to buy and should never had been made in the first place.  Whenever I do a search for movies, they come up as all pay for view, with an occasional free viewing.  Ten and twenty bucks to watch something you can get at a Red Box for a buck.", "verified": true, "helpfulness": "0/0", "author": "Randy Auxier"}, {"rating": 5.0, "review": "I have three other streaming devices(Roku, Apple TV, NetGear) and the Fire TV is the best by far.  Setup very simple - interface very intuitive.", "verified": true, "helpfulness": "0/0", "author": "Michael Jason Manning"}, {"rating": 5.0, "review": "Love it , we got rid of cable got an an antenna get 32 stations and use Amazon Fire TV for movies and some tv shows. Thanks saves us $100.00 a month.", "verified": true, "helpfulness": "0/0", "author": "RA48H"}, {"rating": 5.0, "review": "Wow this did everything they said it would and Amazon sent it already attached to my account so all we had to do was connect the netflix account and off we went.", "verified": true, "helpfulness": "0/0", "author": "ktaber"}, {"rating": 5.0, "review": "Craig likey", "verified": true, "helpfulness": "0/0", "author": "CRAIG HUNDLEY"}, {"rating": 1.0, "review": "Unable to access Netflix", "verified": true, "helpfulness": "1/4", "author": "Jenn"}, {"rating": 4.0, "review": "Bought as xmas gift for my Mom so she can wallow in movies on her TV vs. iPad.  Giving this 4 because setting up Netflix was not automatic.  Had to read other reviews to figure out how to do this with error message \"Purchase Failure you have previously purchased netflix. If your download hasn't started, it will begin shortly\".  Have to do following steps:Step by step instructions:Go to Settings on the home screen.Then arrow to the right until you get to System.Go to about (2nd one down)Go to Check for System Update (last option)Then it works.  If this is known issue for brand new out of the box, not good IMO.  Otherwise, after 30 min. all good and Mom is happy.", "verified": true, "helpfulness": "0/0", "author": "Jacqui M. Yoke"}, {"rating": 5.0, "review": "It is great! Easy to set up and go!", "verified": true, "helpfulness": "0/0", "author": "Rick L. Vogel"}, {"rating": 5.0, "review": "Works well for us.  We have never used cable TV only broadcast televison with added Netflick DVDs.  So this has provided us with a huge variety of interesting choices for a great price.", "verified": true, "helpfulness": "0/0", "author": "P. Voulkos \"cheers\""}]