[{"rating": 2.0, "review": "No wonder Busey is the spokesman. This device cannot touch the Roku3 experience. It pissed me off from the moment I turned it on and the UNSTOPPABLE \"Welcome\" video started. With NO OPTION to SKIP... I was FORCED to watch this STUPID video until it was done. Uh... BIG FAIL Amazon.On to usability... I found no easy way to start a video from the beginning or resume. Roku makes this a very easy choice. The Fire interface feels cluttered and doesn't make the most of the viewable area.All in all.. I didn't hate the device but it seems like the designers decided to build it without any real customer input.", "verified": true, "helpfulness": "0/2", "author": "Jason Nobody"}, {"rating": 5.0, "review": "The easiest set up I think I've ever done. Because the account is \"Prime\", the Fire TV was truly \"plug and play\" a term I almost never use. This is sweet. I've got Apple TV and had a Roku before. I like this unit very much. The remote is a very smooth design. I only wish I could access my Apple TV content with the Fire TV, like I can get my Netflix or Hulu . Other than that it is perfect(for me). Thanks for a solid,easy to use product!", "verified": true, "helpfulness": "0/0", "author": "bobby shovel"}, {"rating": 1.0, "review": "In just 4 days we downloaded 7-8 games and the memory got full. Then we learned that you cant extend the memory by adding an USB drive, even that it has a USB port. Not good for gaming at all.Also, the voice search is for search withing the unit memory. You can't search content by voice in any of the apps.Wasn't expecting this from Amazon.Thinking of returning the unit.", "verified": true, "helpfulness": "3/8", "author": "Besnik"}, {"rating": 5.0, "review": "Now that I have 1 of these for one of my tv's, I want more for the rest of my tvs so I can get rid of my cable and xbox since I primarily only use it for netflix and hulu. Now it's all in one including so much more! I love it!", "verified": true, "helpfulness": "1/1", "author": "M. Hamilton \"Megan M. Hamilton\""}, {"rating": 3.0, "review": "I want to get my money back,as I did not feel it was worth it.There were too many shows I wanted to watch but they cost addtional money.", "verified": true, "helpfulness": "0/4", "author": "mary white"}, {"rating": 3.0, "review": "The reason I chose this box over Apple TV and Roku:-  (a) I am a Prime member and wanted to fully utilize this service, (b) I wanted to load 3rd party software on the device and (c) I wanted to utilize a bluetooth keyboard for surfing etc.(a) as others have pointed out, searching for Prime member content is terrible.  I want to see what I've 'pre-paid' for annually.  This should be an easy fix if they want to guide members to their paid content (perhaps they don't?)(b) 3rd party apps can be loaded on, but they are only available buried in the Settings menu.  They should be available under Apps, or the Main Menu should allow for customization.(c) The most aggravating issue....I own an AmazonBasics Bluetooth keyboard, and yet their own brand won't pair with the Fire TV (it's bluetooth!)  This is a glaring oversight and needs to be fixed asap.  The voice search is very good, however it's not perfect and having a bluetooth keyboard is the next best thing (keying in words manually with the remote reminds me of my first Samsung TV...)With these updates (and I consider all 3 critical) I might give the product 5 stars as its very fast, picture quality is very good, remote is simple yet fully functional.", "verified": true, "helpfulness": "2/5", "author": "J. Legere \"Colt.45\""}, {"rating": 5.0, "review": "My Fire TV was easy to setup and use.  I liked the cartoony guy, he helped explain the system and how to use it.  I liked it so much that I recommended it to another Amazon Prime user.  He bought one but has not had time to set it up as yet.Great machine.", "verified": true, "helpfulness": "1/1", "author": "Jack McCalman"}, {"rating": 5.0, "review": "if you have a kindle fire, you are missing out if you don't utilize this. Why go to the redbox etc when you can get stuff off here free?", "verified": true, "helpfulness": "1/1", "author": "dawn"}, {"rating": 5.0, "review": "I love streaming Media boxes because I hate paying the big bucks for cable TV. So far I have owned about 4 Roku players and 2 Apple TV's and while each has served its purpose I have not been 100% satisfied with the experience of either. The Apple TV worked flawlessly and was beautifully designed as all Apple products are. However, I was upset I couldn't access amazon prime instant video, and I also find that iTunes is often more expensive to buy video content than Amazon and they offer almost no freebies. If your totally invested in Apple products than Apple TV might be the way to go, simply because you wont be able to access and watch your iTunes content via the Amazon Fire TV.The Roku players were a joke. I got two Roku players, one for our living room and another for our bedroom and after a few months use they started not turning on and required hard resets. I was so fed up I decided to suck it up and pay for cable since my husband and I had just had a baby and I found myself spending lots of time watching TV while breast feeding and rocking the baby. When our son started walked and being more capable of going out and doing things we got rid of the cable again and decided that maybe we should get some new Roku players since the Roku 3 had just come out. It came with some neat upgrades, including a headphone jack which I thought would be good for when our son was napping or my husband needed to do work and I wanted to watch TV yet we wanted to hang out in the same room. When we got the Roku 3's we loved them and thought we would be spending a few years cable free happily. Well less than two and a half months later they were both not turning on and requiring constant reboots. Then they quit altogether. At this point I was upset, this made 4 dead Roku's all with a total usage of not even half a year... I called and emailed the company and they informed me they only warrantied Roku players for 30 days... I was shocked. I am used to dealing with Apple, and Amazon two companies who go above and beyond to ensure customer satisfaction. The best option Roku recommended was I pay to mail them the Roku's and I could pay them to attempt to fix them. I declined, the shipping alone along with the cost of possible repairs on a product I no longer trusted seemed like a bad idea.Fast forward to Amazon fire TV. Because I have had so much good luck with Amazon products when this was released I wanted to give it a try. My hubby and I wanted to get rid of the cable now that winter was over but we wanted to still be able to rent a movie or watch a TV show here or there without searching out a movie store or a redbox. My hubby wanted to return to Apple TV because of the good luck we had with them, but I remember feeling bored of Netflix and Hulu and I also wanted to access our Prime instant video since we paid for it anyway why not use it.So far The amazon TV has been amazing, I thought the voice search would be a gimmick but its spot on every time. Movies and TV shows are often cheaper than on iTunes and the Prime instant has a surprising collection of decent free TV shows and Movies. The Player interface is fluid and smooth, some complain that its very focused on the Amazon interface, but what company wont promote their content first and foremost? Other content such as Netflix is very easy to access and the quality and speed isn't sacrificed once your out of the Amazon ecosystem.The box itself is really well made and very svelte and inconspicuous. The remote is of great quality and very easy to use, miles better in quality and durability than Roku remote, and on par if not better than the Apple Remote. It also has absolutely beautiful screen saver pictures that pop up when your inactive for awhile.My biggest complaint if you can call it a complaint is the fact that it has no capability to easily play videos from my computer collection. I know there is PLEX or the cloud account but I don't want that much hassle. I want to be able to just plug in a USB drive or external hard drive and have access to my own content.Overall the Fire TV is as close to perfect as it gets for a streaming Media box. If you pay for Amazon prime and your not invested heavily in iTunes this box is your best blend of quality and provides the most accessibility to different streaming media options you might want to utilize if your cutting the cable cord.If I encounter any problems of course I will update my review. Though I am sure Amazon will stand behind there product as they usually do and give me a hassle free replacement and help.", "verified": true, "helpfulness": "6/8", "author": "L. Breda \"L.\""}, {"rating": 5.0, "review": "Amazon did it again. I was dubious I must admit. I thought this might be another piece of electronics I could not figure out how to use. Or that I would have to wait for someone with XY genes to install for me. But no, just like the Kindle, this device is just that easy to set up and use! I finally got to find out what all the hulaballo was about the show \"Downton Abbey\" (all 3 seasons) and it cost me nothing!!! Yep! Just getting the device and being a Prime Member is all it takes to grant you access to a world of TV shows and Movies that are free and excellent. And they keep adding and changing what is available. I am so glad I jumped on this!  Oh, and be sure to buy some HDMI cables when you buy this or at least check into the possible need for them. I bought them and was glad of it.", "verified": true, "helpfulness": "2/2", "author": "Anne L. McQuade \"Anne L. McQuade\""}]