[{"rating": 5.0, "review": "I love this product, looking to cut off cable as soon as my contract is over", "verified": true, "helpfulness": "0/0", "author": "Melissa Echevarria"}, {"rating": 5.0, "review": "my only regret is I didn't buy it earlier.", "verified": true, "helpfulness": "0/0", "author": "Happy mommy"}, {"rating": 4.0, "review": "Took a while to figure out how to negotiate through it. no instructions", "verified": true, "helpfulness": "0/0", "author": "Lyn Drylie"}, {"rating": 5.0, "review": "I cut off my cable to save some money and I went with the Amazon Fire TV and I love it! The voice search feature is awesome. My only problem is how the software is set up. A few more options would be great in how/what it searched through as far as separating Prime movies and those you may have to rent. But is very fast and easy to use. I love it! Wish I would have been able to get the discount with the 3 month subscription of SlingTv, but i've recommended this to several people and the ones that got it, have loved it too!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Nuckles \"Brassnucks\""}, {"rating": 3.0, "review": "We like it but it keeps freezing up when I watch old TV series like Twilight Zone, One Step Beyond and Alfred Hitchcock. You can still hear the sound but the picture is frozen up. What's up with that? It's very annoying.Thanks", "verified": true, "helpfulness": "0/1", "author": "Linda Duttweiler"}, {"rating": 3.0, "review": "Works ok, sort of slow...  Ethernet connected internet speed running 55/65 . Netflix hangs up at 99% have to unplug and restart unit does this quite a lot uninstalled Netflix reinstalled still the same issue .  I'm currently on the hunt for something more reliable did not buy it from Amazon been over a month don't think Staples will take it back or swap it out ..  Remote works fine voice part is better than I expected ..Bluetooth keyboard sync fine no problems..", "verified": true, "helpfulness": "1/2", "author": "Don P."}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "SHARSUKI"}, {"rating": 4.0, "review": "I got this as a gift from a friend.I couldn't log in. I've used the exact same login and password as my amazon and it just refuses my login information.There's nothing online that addresses this issue. I've triple checked my email and password. It works to log into amazon.com but amazon TV reject it.------------------------------------------------------------------I contacted customer support via https://www.amazon.com/gp/help/contact-us/general-questions.html?skip=true#band after having them tell me to reset my password and it (obviously) not working, they transferred me to the tech department.From there they had me cycle the power and after the second time through, they reset the software.The software updated and they had me all registered. It was beautiful, but it did take me about 35 minutes on the tech line (that included having to wait for the software to update though)So, since the problem was resolved I'm giving 5 stars minus one for all the trouble.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "I like fire TV, it's ease of installation, ease of use, but the free apps associated with Fire TV leaves something to be desired, most have no useful qualities to them, whether they be game or Movie/TV apps, and selection is minimal", "verified": true, "helpfulness": "0/0", "author": "Louis Hicks Sr"}, {"rating": 4.0, "review": "Shouldnt you people inform foreign buyers that this thing wont work outside of america?", "verified": false, "helpfulness": "0/0", "author": "rani baldeo"}]