[{"rating": 5.0, "review": "I have been using the other type which requires typing from a remote. This voice activation is fast and accurate as heck. not only that its very easy to install..20 seconds and your done....And since I am a prime time member I do have access to many free movies and amazon is battling Netfilix it seems. I can rent very recent movie releases for the same price as direct TV......its a bargain for the 99.95 and I get 6 months to pay off", "verified": true, "helpfulness": "3/3", "author": "Arthur d \"tell it like it is\""}, {"rating": 3.0, "review": "The misrepresentation is that the \"voice command\" ONLY works to search for Amazon product. So, if you're in the Netflix channel, and hit the voice search button, it brings up voice search, then shows you the results in Amazon, not Netflix. So, on any other channels, you're back to \"hunting and pecking\" to do a search -- at that point, it really offers no advantage over the Roku Streaming Stick or Google Chromecast.Another review points out that it's difficult to do a search that's limited to content included with Amazon Prime, so will probably lead to inadvertent purchases, especially if you have kids.", "verified": true, "helpfulness": "3/3", "author": "GM_Volume"}, {"rating": 5.0, "review": "Super fast delivery, super fast loading of content. This was a \"take a chance\" purchase, and we are glad we did. So far, we are extremely happy with the way it interacts with all the content it provides for the small footprint it uses.", "verified": true, "helpfulness": "0/0", "author": "Gene Chastain"}, {"rating": 5.0, "review": "Amazon Fire TV is a great addition to any entertainment system, but a definite must if you already have Amazon Prime. It is like a smart phone where you can have apps, including games. It also syncs with games you have on a Kindle. Other apps for movies make the choices almost unlimited.One comment I'd make is I wish Amazon Prime would have more free movies. Hopefully they'll start adding more as Amazon Fire TV becomes more popular.Also, the optional game controller is very high priced. I've read you can buy cheaper versions that work with this system, so I will be investigating that. I imagine if the demand for their controller decreases, so will the price.All in all, Amazon Fire TV is a great value, excellent product, works as advertised and so much more! Plus you gotta love the Gary Busey commercial!!", "verified": true, "helpfulness": "1/2", "author": "D. Johnson"}, {"rating": 5.0, "review": "Setup was unbelievably simple! The device is sleek, compact, and unintrusive. Excellent price in comparison to other units. Amazon continues to exceed my expectations. This is definately a winner!", "verified": true, "helpfulness": "1/1", "author": "JESSIE M. HICKS"}, {"rating": 1.0, "review": "A piece of junk.  Cannot watch anything without it freezing continually (little circle in middle of screen goes round and round)Prblesompt comes up that says \"internet speed too slow\"  Have 4 other kindle devices and 3 laptops on which the internet works very fine. Replaced the router, cable modem and all cables with no result.", "verified": true, "helpfulness": "3/7", "author": "Kindle Customer"}, {"rating": 5.0, "review": "my son bought me one and i instantly fell in love with it. then i ended up buying one for my room. the only thing i didn't like about it is that when it says PRIME on some shows it should be free to watch since i'm a prime member. but it charges me anyway. so yeah. other than that it's very easy and simple to use and it actually works. very entertaining and i just love it.", "verified": true, "helpfulness": "0/0", "author": "Patsy Wood"}, {"rating": 5.0, "review": "Before I bought the Amazon Live TV streaming box, I went on line and reviewed many comments comparing it to other streaming devices like chromecast, apple, roku 3 etc. After much researching, it finally came down to choosing between Amazon vs. Roku 3. It was  obvious to me that the one you prefer will be for very personal reasons and what you are particularly looking for in a streaming box. You will need to research this yourself to see which one is more compatible with what your needs are. No one else can do this for you. You will need to invest some time in understanding the products that are out there. Both Roku 3 and Live TV are capable of streaming 1080p and 5.1 audio if you have a fast enough connection. Most statements on line indicate you need at least 5-7 mbps to achieve this. I am fortunate that my Brighhouse in the TampaBay area streams consistently with standard setup  at 10 mbps. I have had my Amazon Fire Live TV for 3 days now and have put it through its paces. I can only say that I am extremely pleased with the product, and am not sure why there are so many complaints about the search setup. I do find that it is a pain that they don't yet let you search just for Amazon prime movies in one category all by themselves. There is, however, a section where they show the newest added  prime all together and in that area, they also show other prime moves categorized together under each movie's specific genre.  I had no trouble finding the Netflix app and looking for movies within Netflix as some people claimed.  It is true that the voice search only works for Amazon (and works very well I might add), but clicking  in a search for a movie in Netflix was also no hassle. It starts looking for movies immediately as you begin clicking on letters. I usually found my movie after  clicking in only 3 to 4 letters. Setup for the unit and software was easy and fast (it immediately did an upgrade).There is no manual how to set up,  but you don't need one. If you can't figure out how to plug in the wires by yourself, it has a small pamphlet that tells you how and that is all you really need...so simple.  You can play some of the games with the remote. Some games still cost extra, of course,  or costs more as you go deeper into the game. Some games only work with a controller and it tells you that before you purchase it. You CAN use ANY bluetooth controller from what I have read. I am not a gamer, so I went on to experiment with everything else that the Amazon box  does. You cannot project personal pictures and video except from their cloud which will eventually cost you monthly (it starts out free). Plex app can do this, but it will cost you a monthly fee and I am trying hard not to have monthly fees any higher than is necessary and they begin to add up after awhile. I don't have much need for this, but if I want to do so, I found that I could project photos with the  flickfolio app  for free, and could project videos with the real player cloud for free. So presently I am using Netflix for my main streaming and the limited 2 disc per month plan for those movies that I may never be able to get streaming or renting from any other source (Netflix has almost everything on disc). I also use Amazon prime for streaming, since it does appear to pay for itself in many ways. (we buy lots of stuff from Amazon). If I can't find the movie that  I want with either streaming or discs, I also have the option of renting any one movie by itself from Amazon. As the competition heats up in the future, I will change this combo as is needed to my advantage. As far as amazon is concerned, I have dealt with them  for many years now and own 2 kindles. They have been responsive to any problems that I have had with their products and when improvements were made with the software, you would get an immediate upgrade without even asking for it. Since Amazon is known to be constantly making  improvements, I felt that this product was a good one to purchase. I am sure new software will come through as needed and many more channels (apps) and games  will be added very soon. This company does not sit on its hind legs after you have bought a product. They know there is a lot of competition out there and they must work hard to stay ahead of the game. BTW, I do not work nor am I affiliated with Amazon in any way.", "verified": true, "helpfulness": "8/8", "author": "Gordon R. Thomas"}, {"rating": 4.0, "review": "The Amazon Fire TV has some obvious flaws. You can't access your music yet (soon though I've heard), you can't search through more than a small percentage of the Prime Movie selections so far (My PC is 5 feet from my TV so I search on that. No biggie), you can't shop on Amazon (Outside of your digital purchases. See previous 'no biggie'), the memory is insufficient (For some. I'm not a gamer or app guy so not an issue for me), and voice search only works with Amazon content so far (I don't use Netflix or Hulu so again, no biggie). Outside of all that, it has worked beautifully and has me able to watch my video library on command in HD on my new 46 \" LED TV. I had a streaming issue early on when I rented the movie \"Rush\" but was pleasantly surprised to get an apology email from Amazon and a refund for my rental the next day. Streaming has been perfect since then though. Many people are outraged that it doesn't have all the bells and whistles yet, but I'm not one of those people. I read the product description and knew what I was buying and what it could do. For my needs, it's been great and I give it 4 stars.", "verified": true, "helpfulness": "1/1", "author": "William Brennan \"wreckingball34\""}, {"rating": 5.0, "review": "Simple to install (less than 5 minutes), works with sound system, voice search works well without confusion. Search function for aps like YOUTUBE is cumbersome as you have to spell stuff out. Shows load quickly and run smoothly. Would recommend.", "verified": true, "helpfulness": "1/1", "author": "Terry Lowder"}]