[{"rating": 2.0, "review": "I bought this product and unfortunately had to return it. I currently live outside of the United States and as a result I am unable to access the content on the Amazon Fire TV. I think it should be specified in the product details that this product is not for use outside of the United States due to licensing limitations. Other than that it looks like a great device but, unfortunately, it is not fit for use outside of the jurisdiction of the United States.", "verified": true, "helpfulness": "0/2", "author": "Deborah Jacob \"I am an author and a librarian, and I happily now live in the realm of audio books.\""}, {"rating": 4.0, "review": "did meet my expetations", "verified": true, "helpfulness": "0/0", "author": "David L Friske"}, {"rating": 5.0, "review": "Its very good. I enjoy watching Sling TV. Options to watch Netflix and prime video's is good. Definitely worth it if you know how to use it. They can improve on providing some default free content.", "verified": true, "helpfulness": "0/0", "author": "Manan Shah"}, {"rating": 4.0, "review": "Great product. I ditched my cable TV service and use this to watch Hulu, Amazon Prime, and Netflix. Only issue I have had thus far is my remote died after 5 months. Amazon sent me a replacement remote at no charge in a couple days.", "verified": true, "helpfulness": "0/0", "author": "Bnut2000"}, {"rating": 5.0, "review": "Very easy to use and and a whole boatload of programs, movies, documentaries etc to watch on every conceivable topic.", "verified": true, "helpfulness": "0/0", "author": "G. Calderone"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Byrdman \"Ron Byrd\""}, {"rating": 5.0, "review": "Fantastic. Very smart device.", "verified": true, "helpfulness": "0/0", "author": "Robert Young"}, {"rating": 5.0, "review": "Amazing this fire tv is.I got it for my tv in bedroom My wife has a Apple tv box. So I know the deference. Fire tv way better WiFi.", "verified": true, "helpfulness": "0/0", "author": "Thomas Valenzuela"}, {"rating": 5.0, "review": "This device has everything you need.  Beautiful sound and excellent streaming.", "verified": true, "helpfulness": "0/0", "author": "William Rosselli"}, {"rating": 4.0, "review": "It is good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]