[{"rating": 4.0, "review": "Mostly the Fire TV device is superior to Roku streaming.box, it is faster and has a bigger memory to speed up buffering issues to basically make them disappear on all Amazon content, which we spend most of our watching and music listening. However, there is a smaller channel selection which for example cuts me off from my BYU football ,Volleyball and Rugby. Although most customers could care less about BYU, I'm sure that other people will find comparable issues.Also, some of the \"App\" channels like HULU plus don't load right. Fortunately, I still have my old Roku, and recently we got a Vizio 50\" smart TV, and between the three I get everything I want in the best quality. But, although I am a loyal Amazon customer, I am slightly disappointed that it isn't my all the time device, instead of most of the time device. At least the price has dropped.", "verified": true, "helpfulness": "3/3", "author": "G. E. Williams \"Nunah\""}, {"rating": 5.0, "review": "OMG....this is great.  I love watching my Prime movies and TV shows on my flat screen.  I also got Hulu Plus and it is fantastic to be able to connect so easily.", "verified": true, "helpfulness": "0/0", "author": "Cathy Buel"}, {"rating": 5.0, "review": "So far only one instance when my internet connection kept me from watching Netflix- but that's not the fault of Amazon Fire TV. VERY happy with this, to date.", "verified": true, "helpfulness": "1/1", "author": "bexbunny"}, {"rating": 3.0, "review": "I am somewhat disappointed in the lack of content available on the Fire TV.  There are hundreds of internet TV applications available out there that are included in the competitions streaming devices.  I also do not like being forced to use voice for search with the Amazon application.I do like the small form factor of the box and the comfortable remote control.", "verified": true, "helpfulness": "2/2", "author": "M. Snyder"}, {"rating": 5.0, "review": "Cable was costing us $2268 a year in monthly fees! We cancelled it in favor of this one time $84 box and I'm extremely happy! We already had a Netflix account we've had for years as well as  Prime account we couldn't live without and the box comes with numerous apps for free shows. Goodbye 2K a year to Comcast and hello to our savior Amazon!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Author of A Frugal Life: Learning How to Spend Less and Enjoy Life More\""}, {"rating": 4.0, "review": "Just recently purchased for my family as we wade gently into the streaming video pool.  Already had a prime membership so this was the logical option for us.  However I am having an issue with the gaming portion and cannot seem to find game apps for multiple players.  I purchased two controllers so my sons can play games against each other but I cannot connect the second controller for some reason.  I think I may need to set up another amazon account in order to register the second controller for my other son to use. Please if this isnt true someone let me know, I cannot find any technical help on the site about it.  Also where these multiplayer game apps are, I have yet to spot one.  But overall, we have already watched a few movies, tv shows, and played some single payer games. All without any major issues.  I recommend.", "verified": true, "helpfulness": "2/2", "author": "MommaP"}, {"rating": 3.0, "review": "Longtime Amazon customer, and I recently purchased my Amazon Fire streaming box. Installed this little gem and was playing videos in under 5 minutes. Great. Firstly the box is nice and fast, graphics are crisp and no buffering or lag in it's playback. There are tons of shows to watch, and I know there are thousands of Prime shows to see too. Therein lies the rub. Whoever designed the shell the Fire TV works inside of, must have done it hurredly. There is no rhyme or reason as to how it's sorted. It is difficult to find the included \"free\" Prime videos without wading through all the pay ones as well. Also there are \"Pay\" versions mixed in with the \"Free\" versions of the same Television series?!? very confusing.It would be a delight to have the box filter Prime videos from pay ones, and even be able to search through other generes withough having love movies mixed in with horror films...humm thinking of that. maybe those are the same type of movie. LOL. Anyhow, hopefully a software update will fix this, if not I might have to return the box, and hope this project will survive to a version 2.0 updated version.-Graphixman-", "verified": true, "helpfulness": "2/3", "author": "Graphixman"}, {"rating": 5.0, "review": "Nice variety to chose from.", "verified": true, "helpfulness": "0/0", "author": "Jan"}, {"rating": 5.0, "review": "What a great product.  I have been a fan but this is the best ever.  Would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Judith L. Grant \"judy,too\""}, {"rating": 4.0, "review": "I have figured out how to use it all the way but the mirror feature with my Fire is really cool", "verified": true, "helpfulness": "0/0", "author": "brian a paciorkowski"}]