[{"rating": 5.0, "review": "The Amazon Fire TV is a nice addition to our TV viewing. The menu is simple and straight forward. The voice search works well.", "verified": true, "helpfulness": "0/0", "author": "Jack W Mason"}, {"rating": 5.0, "review": "Just received our Amazon Fire TV, today.  This has made it so much easier to navigate through all of our different TV options.  The voice part of the controller works as advertised.  We couldn't be happier that we decided to get this product.  The 30 day Free Trial, didn't hurt.  I threw all of the packaging materials away, because we won't be sending this back!  This is a MUST have.", "verified": true, "helpfulness": "0/0", "author": "Gene Kennedy"}, {"rating": 4.0, "review": "I've been using the Fire TV for a few weeks now; previously, I've used my Sony Blu-ray player to stream Netflix or Amazon Prime material. The Fire TV works excellently for this purpose, easily 1/5 th the time to start Netflix and begin streaming, even quicker with Prime. The picture is outstanding, never any buffer issues, and the sound is without flaw. My only complaint, at first, was that it did not natively support DLNA; however, that was addressed within a couple days of receipt in the form of an app that will access my network server with my music library. Problem solved!That said, there are a couple of minor issues that could be worked out, and most likely will; it looks like Amazon has a good team focusing on this product.One thing I noticed, of course, is that you can not manually shut it off; it will turn off by itself in 30m of no activity, which is great. However, if you leave a show PAUSED, it will not shut off. I'm sure it doesn't use much power, but I like to make sure TV/receiver/etc are all shut down at end of day. Just something to keep in mind if you don't like to leave things on when you're not using them, don't leave a show paused. Perhaps they will set a 30m timer on pause as well, easy fix. Pretty sure you can resume watching just about anything from where you left off, so having the pause keep the player on doesn't make too much sense.The other issue I've encountered is using the Fire TV in tandem with the Fire HDX. Using Prime video service back and forth from tablet to Fire TV is flawless, and Second Screen works well on the tablet when you have your movie/show up on the TV. However, display mirroring is inconsistent at best from tablet to TV. Most of the time, it will try to connect, but not succeed. I've found by restarting the tablet, you will get it to work for a while, or for that session. Almost guaranteed, you will have to restart next time you try it again. Not sure if that is an issue with the HDX or the Fire TV, but irritating nonetheless.One thing I would like to see for the HDX is full remote function of the Fire TV. I would love to take my tablet and browse through the Fire TV menu of apps/show on the tablet without interrupting the show in progress on TV. It would also be a great feature to allow the tablet to browse through the menu on TV, just like the remote control, or even be used as a game controller. With all items in the same ecosystem, it would seem to be a win-win for all, I would think.Overall, the device streams cleanly, quickly, and without issues. Set up is simple, less than 5 minutes. Perfect for Prime members, also solid for Netflix and DLNA networked servers. Wouldn't hesitate to buy it again.", "verified": true, "helpfulness": "0/0", "author": "mostlyharmlessx"}, {"rating": 5.0, "review": "I love my Amazon Fire!  Easy to use straight out of the box.  Plug and play.  Voice recognition is awesome.  I find it much easier and more intuitive than Roku to use.  Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Rob Sunny CA"}, {"rating": 5.0, "review": "I, like a lot of other individuals who spend WAY too much on cable, was tired of paying $100 a month for hundreds of HD channels that I never watched, when a friend recommended this device to me. So I gave it a try, and fell in love with it immediately. I now spend less than $30 a month for Netflix, Hulu Plus, and Amazon prime and find myself watching more movies and TV shows than ever and am able to put that extra $70+ to better use.At the same time I purchased a Roku 3 with the thought that I would keep the better of the two, but I ended up keeping them both. The Roku 3 has many more channels and I had a lot of fun looking through them and adding them, but besides Vevo and Plex, which are also available on Fire TV, I don't find myself watching them very often.If your looking for more free content the Roku 3 would definitely be the better choice, although a lot of the free content like Crackle is only available in Standard Definition. What I don't like about the Roku is that the warranty is limited to 90 days, which is a bit ridiculous when most gadgets that I buy come with a minimum 1 year warranty including the Fire Tv.If your looking mainly to stream Netflix, Hulu Plus, or Amazon Prime then I'd go with Fire TV. It's a more powerful device and has great potential for future improvement. I can't comment on the gaming aspect of Fire TV as I use it solely for movies and shows.Here are some things I didn't like about Fire TV.....The Fire TV has a voice search which is very cool but needs to be expanded to its other channels like Netflix. Right now its mainly to show off amazon content. I'll do a voice search and find content from Hulu Plus, but when I click something available on Hulu Plus, it takes me to Hulu but not to what I just searched for. The Roku 3 on the other hand allows you to do text searches for movies and shows and will then show you all the channels that those movies and shows are available on, which is great, although typing a search out with the controller is a bit of a pain.Another thing I don't like about the Fire Tv is the inability to filter out paid amazon content from free prime content. It mixes the two which is very annoying. Leading me to have to search on Amazon's web site to access prime only tv shows & movies. I really wish there was a section on Fire TV that showed ALL of their free prime content only.(: Hopefully someone at the top will read this and make it happen :)I had an issue with the Fire TV not being able to stream correctly after a few weeks of use and had to contact Amazon....waited less than a minute to speak to customer service on chat, about 15 minutes later my problem was solved. Great customer service as always.I would highly recommend this device as a better, cheaper alternative to cable tv.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Love the amazon fire tv, works great, love the voice feature for searching, easy to set up and very compact!!", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "I had a Wii to feed Netflix however that's all. I didn't realize the Amazon Fire TV was so compact. It was nice to trade the compact Fire from the Wii with cables and wires everywhere.  When I hooked it up it was simple. I share WIFi with a couple of people so the internet was slow to load. I left it for a couple of days and let it sync and it has worked perfect every since...Once again, I am a happy, satisfied Amazon customer.Thank You Amazon!", "verified": true, "helpfulness": "1/1", "author": "Elaine Bohman"}, {"rating": 5.0, "review": "It goes to Amazon Pay selections a lot, for things you can get for free, so you have to click around to see other viewing options. It's easy enough. Entering search by hand at Hulu or Netflix is much easier than our previous Sony machine, and our Wii. All in all it is the best streaming device we have had out of many machines over the last 4 years, and for a lesser price.", "verified": true, "helpfulness": "0/0", "author": "Robert Pierce"}, {"rating": 5.0, "review": "I didn't think this device would be as easy as it was said to be. Wow!! Was I ever wrong??!! It was sooooo easy to install. Had it up & running in no time at all. The movies I can get on it are endless. We've watched several. The quality is great. The audio is great. I would highly reccomend this to everyone. This is so much easier than going to fight  our way through a movie store, then being disapointed not finding it.I say: if you haven't tried the amazon fire tv, try it noe. Y ou wun't be sorry that you did.", "verified": true, "helpfulness": "1/1", "author": "Aunt Sandy"}, {"rating": 3.0, "review": "Fast hardware and smooth controls. However I am deducting 2 stars for transforming into a paper weight if the device does not have an internet connection.", "verified": true, "helpfulness": "0/4", "author": "Omgenius"}]