[{"rating": 5.0, "review": "Works great, Simple to use.", "verified": true, "helpfulness": "0/0", "author": "dwr"}, {"rating": 5.0, "review": "nice device fast and reliable when watching movies", "verified": true, "helpfulness": "0/0", "author": "Jesus Velazquez"}, {"rating": 5.0, "review": "Intuitive. Easy to use. Great for taking advantage of Amazon prime music and video services.", "verified": true, "helpfulness": "0/0", "author": "David Myers"}, {"rating": 4.0, "review": "Have been using the Fire TV since January and can say my grandsons love the game options. Now with the expanded memory capability, I can reinstall deleted games that caused the unit to run out of space very quickly.My only complaint is that I cannot access my VUDU movies with it. Since the majority of older movies, pre-Amazon Fire TV came on Ultra Violet and and are accessed through VUDU, this \"channel is a necessity. I have 90 movies there currently which means I have to have the ROKU  unit as well as the Fire TV to get all my movies.They also offer the DVD conversion to Digital for a small fee which Amazon lacks. I couldn't afford to switch all my movies to digital if this service wasn't available.", "verified": true, "helpfulness": "1/1", "author": "Vincent Meyers \"vince865\""}, {"rating": 5.0, "review": "I've been a roku fanatic for ages.  Never thought I would switch, but gave this a try with the latest Amazon promotion to give this a try for 30 days.  The interface is very snappy compared to the roku.  And most of the apps have much more up to date interfaces than the Roku counterparts.  (Roku apps are starting to catch up)I also realized how much amazing free content I'd not been using as part of my Prime account as this is very well integrated to Prime Video (no surprise there).", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "does this have closed caption and how do u  get it too work", "verified": false, "helpfulness": "0/1", "author": "Alan"}, {"rating": 5.0, "review": "Glad we switched (most days)", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 5.0, "review": "Works amazing. My home does not have the fastest wifi signal, but the shows come in cystal clear. Games are very responsive, and there are a ton of apps to fit anything that I need.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love love love it. Wish I had bought sooner", "verified": true, "helpfulness": "0/0", "author": "T. James"}, {"rating": 5.0, "review": "Easy to use and great for kids!  Love!", "verified": true, "helpfulness": "0/0", "author": "Patricia Lee"}]