[{"rating": 5.0, "review": "Great deal to watch any show. I can watch Japanese News and other. I guess I don't need Satelite TV for $40 per month anymore.", "verified": true, "helpfulness": "1/1", "author": "Cozcous"}, {"rating": 4.0, "review": "If you are an Amazon Prime Member, Amazon Fire TV is a must buy.Easy to setup and connect to you're Amazon Prime account for all your available content. Voice search works well but is limited to only Amazon Prime content. You won't get any content from Netflix or Hulu to show up. Hopefully, this feature will be added later.Streaming video content is great and the quality is hi-res. Rewind and fast-forward is quicker than on other comparable systems.If you like digital games, Amazon Fire TV has that too. With many of the games free with excellent graphics for an android based system. However, to really enjoy the games you need to purchase a compatible game controller.Happy that HBO content will be available soon", "verified": false, "helpfulness": "1/1", "author": "Korey"}, {"rating": 4.0, "review": "I will change this review when I'm able to use Fire tv without having to reset  it constantly. I went with Fire Tv expecting it to have issues because its a new set up. I did this because Amazon is top notch in CUSTOMER SERVICE, RETURNS, GREAT PRICES , EASY RETURNS ,ETC. I can go on and on .  Roccu tv has the better ratings of all these systems but I have Amazon prime and I trust That Amazon willl easily catch up and iron out any bugs. I figured prime will go nicely with the Fire Tv and it does.  I've been on and off with customer service since I received the system (over 2 weeks) They eventually send me a completely new system . The issue still continues.  Last I left off with the very pleasant tech support was that it may  be my router that keeps disconnecting my signal . I have no issues with my router and internet connection and all my other devices . I keep having to disconnect the power so the system resets itself . Eventually it's disconnects again  and again. I offered to purchase another router at my expense . With the understanding that I will return the router if it turns out that this is not the problem . Returns are painless and easy  with Amazon anyway .  At this point I asked the tech support to request a specific router suggestion from their fire Tv experts. It's been 2 days and so far I haven't been given a suggestion as to which is the best router to use with this system . I'm still holding out  to see what happens. The system hasn't worked properly since day one. I've been way more than patient. I actually like the system when I'm not resetting it . I'll probably give it 4 stars if I ever get a chance to review it again.I'm waiting Fire Tv experts. Update ... I bought a new router and it worked. The longer I have Fire tv the more I like it . I have changed my rating because the issue is now resolved. My next step is to get rid of cable and only keep my internet service. No not everyone can do this  but for the amount of time I watch TV and the cost of cable . I'm going to do it . I recommend getting Netflix and Hulu to supplement  fire TV . I also have Amazon Prime . it's still not gonna have everything you want but it will be enough .", "verified": true, "helpfulness": "3/7", "author": "Dom"}, {"rating": 4.0, "review": "I like the variety of things available.  I found that using my features as a Prime Member difficult to do.  I also cannot read the print explaining the item I've chosen from across the room.", "verified": true, "helpfulness": "1/1", "author": "M. Krohn \"number cruncher\""}, {"rating": 5.0, "review": "Netflix was always crashing. (Amazon some times.) I called Netflix- they blamed Comcast (my ISP). I called Comcast- they blamed Netflix.  Turns out it was neither; it was my elderly Roku (who knew?).This Fire TV is fast and doesn't drop anything. Picture and sound are better too. YouTube isn't preloaded but it's easy to add. Tying the YouTube on TV to my Kindle Fire HDX was easy and it's fun to watch Carson, Paar, and Steve Allen at 11:00pm rather than the current group.  (Yes, I am a geezer.)", "verified": true, "helpfulness": "3/3", "author": "Chinook pilot"}, {"rating": 4.0, "review": "why doesn't Netflix just make a streaming box?PROS) Super Fast Menu Navigation. I really like how fast the menus work, and how fast it starts a movie up. Amazon Prime movies in HD are really nice. Netflix works with well the Amazon Fire TV.CONS) Prime content TV shows is not easy to locate or is lacking (i counted 20 tv shows or so), Prime Movies are a bit better because of HD Content but i still only counted about 200-ish movies.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I tried a few boxes...the sony...roku..and g box..none compare to this..its fast..easy to set up..runs xbmc great...picture is great also..just one nice piece of electronics...just wish they made the remotes in bright colors since its small and gets misplaced alot and hard to find cause of size...i just put a couple of flouresent dots on it..lol....so it shows up...I just ordered another one for downstairs..this one has proven to work and very user friendly", "verified": true, "helpfulness": "2/3", "author": "Alan Smith"}, {"rating": 4.0, "review": "I was the proud and happy owner of a Chromecast for several months until it mysteriously stopped working.  To be fair, the issue was probably with either my TV, sound system, or the connection between the two.Google couldn't give me an answer or find a solution to my problem. An optical line from the television to the sound system didn't work, either.  After spending days researching online, I was about to throw them all away, including the Chromecast.Then I found that the Amazon Fire TV has something that isn't supported by the Chromecast:  Fire TV has an optical out port!  I did my homework and ordered one a few days ago.  Lo and behold, I have a streaming box that produces both video and sound, and it does both very well!  I haven't tried the gaming side of the Fire TV because games don't interest me.The only thing lacking is integration with Amazon Cloud Player, but I think that will be coming soon. Overall, Amazon Fire TV is a very well-made and capable device, and I'm happy with my purchase.", "verified": true, "helpfulness": "1/1", "author": "Joanne"}, {"rating": 5.0, "review": "For several years now, streaming video has been my entertainment of choice. I stream on tablets, smart TVs, several gaming consoles, as well as dedicated streaming video boxes like Roku. Until I plugged in my Fire TV yesterday, Roku has been my favorite for ease of use, variety of offerings and features. Although I was only hoping the Fire would be as good as a Roku, it blew me away with how much more I like it.The Fire is blazing fast due to the quad core processor so search results are instantaneous and there is almost no delay when starting a video. (My Rokus are second gen so I cannot compare to the 3rd gen Roku devices.) The Voice Search is so accurate, it has picked up exactly what I said every single time. The remote is similar to the much-loved Roku remote in that it is small and has only a few, well-placed buttons. The box itself is small, square and unobtrusive. The video output is absolutely gorgeous. And the gaming aspect of Fire TV is far and away superior to Roku's gaming capabilities. In every common aspect, it meets or beats my Roku boxes.***For people new to the whole concept, here is a brief Streaming Video 101. Streaming video is a way to watch video content like movies, news, concerts, TV series, etc. sent via the internet to your television. (You can also listen to internet radio through a streaming video device.) You don't need cable TV service or external antennas to get beautiful, HD programming delivered to your TV. All you need is internet access in your home, a device which streams video to your HDTV (like this Fire TV) and an HDMI cable (not included). If you have a wireless network, you can do this wirelessly. If you don't, you can use an ethernet cable (not included) to connect your modem to your streaming video device.***Amazon makes Fire TV even more attractive to their customers by offering a huge selection of free-to-watch videos to Amazon Prime members. You can, of course, still rent or buy movies and TV shows from the Amazon video store, but the Prime offerings are extensive and rival Netflix, in my opinion. Also, if you own a Kindle Fire tablet, any games you may have purchased are instantly available to play on the Fire TV. And Amazon makes it even easier by sending your Fire TV pre-registered to your account so you will be ready to watch a movie or play a game within minutes of hooking it up! (If you have received it as a gift, it won't arrive pre-registered.)The user interface is clear and easy to use. If you've ever used a Roku or a video game console, it will be very easy for you to navigate instantly. Although your home screen is Amazon itself, Netflix, Hulu and a host of other apps are right there the minute you boot up your Fire. (The free Netflix app and several others require a Netflix account at an additional charge.) Even those who haven't will have no problem because Amazon has created a delightful little video tutorial which launches the minute you set up your Fire on your home network. All you need to know is your network name (SSID) and password to stream movies over your wireless network (or an ethernet cable the necessary length for a wired connection.)In the box is the Fire box and a/c adapter along with the remote and batteries. What isn't there is an HDMI cable, so be sure and order one if you don't have an extra one at home. (I say order because you can get one from Amazon for less than $7 and it will cost you $20+ even at Walmart.)I did purchase two optional game controllers and if gaming is something your household will do much of, I recommend them. The controllers are very similar in feel, appearance and function to XBox controllers. These really are quality controllers and will enhance game play hugely. My only complaint about them is that at this point there is no rechargeable battery pack available, although you can use rechargeable AA batteries, and no direct wire to let you play even when your controller batteries are depleted.My kids and their friends love to play Minecraft so it was great to find that the Pocket Edition which I had purchased for use on their Kindle Fire tablets was right there, ready to play on the television. There are a lot of old favorites like Sonic the Hedgehog which gamers will readily recognize, but there are many new games promised by Amazon.One complaint I see is that it is difficult for Amazon Prime members to search for ONLY Prime video offerings. On Roku and XBox and PS3, there is a tab which allows you to perform refined searches of only Prime movies and TV. That isn't the case on the Fire menu. It does have some tabs like \"Recently added Prime Movies\" but that doesn't include much of the thousands of Prime offerings.Using Voice Search and saying \"Amazon Prime\", I got results that were all Prime, although I wasn't able to refine my search much more without getting a few non-Prime results. I do hope that Amazon will update to add this capability to the menu. Until then, remember that all Prime offerings will have a banner across the top left corner of the movie icon that says Prime. If it doesn't say Prime, it's not free to watch.So is Fire TV right for your household? If you have limited cable TV services without premium channel packages (or only internet and no cable TV), you are an Amazon Prime member, you own a Kindle Fire tablet and you have people in the house who enjoy casual gaming, it's a no-brainer. You will love Fire TV! However, if gaming isn't something you will engage in and you don't have a Kindle Fire or a Prime membership, you may be happy with most any streaming video device and a Google Chromecast or the Roku stick is less expensive. (Fire TV does come with a month of free Prime membership so you can see if you like the free Prime video offerings.)Great job, Amazon!", "verified": true, "helpfulness": "8/8", "author": "Terry \"tcinsatx@yahoodotcom\""}, {"rating": 5.0, "review": "This device is super easy to use.  I had it up and running in about a minute.  So far there have been no glitches.  For an Amazon Prime member this is a must.  There are so many ways to use it. It is worth the money.  I seldom turn my smart Blu ray on now.", "verified": true, "helpfulness": "1/1", "author": "Kenyon"}]