[{"rating": 5.0, "review": "Awesome Christmas gifts.", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 4.0, "review": "Better than roku", "verified": true, "helpfulness": "0/0", "author": "Amy Patterson"}, {"rating": 4.0, "review": "This thing is amazing, all the shows, available all the time!", "verified": true, "helpfulness": "0/0", "author": "Bear"}, {"rating": 5.0, "review": "Love this product.  Use it almost every day.", "verified": true, "helpfulness": "0/0", "author": "Renee"}, {"rating": 4.0, "review": "still learning how to use it", "verified": true, "helpfulness": "0/0", "author": "Barbara Pawlenko"}, {"rating": 5.0, "review": "About 6 months ago I bought a Fire T.V. and was quite displeased with it. However much has changed since then. The biggest downside was the games, They were such a small part of Fire TV it felt as if they were \"tacked on\" just so Amazon could claim their machine could play games. It seemed as if Amazonwasn't even concerned with pursuing gaming. Also a big letdown was the amount of memory, 5 G.B. is not enough. Thankfully both of these issues have been addressed to a certain degree, they have addedgames(more are needed)also they started adding tablet games that are controlled with the gameplay.Still there is room for improvement, like more games for the controller, more licensed games would be nice,and there is a desperate need for fighting games(there aren't any). The problem of memory has finally been solved, as now you can expand your memory with an external flash drive. Which I have done and seems to be working fine. So there you have it, thanks to Amazon for listening to it's customers.", "verified": true, "helpfulness": "2/4", "author": "voltron"}, {"rating": 3.0, "review": "The voice search function only works with the Amazon video and music offerings.  It will not work within an application.  If you are within Youtube or another app, you need to use the remote to type in each letter of your search criteria.  Cumbersome at best.  If they enable the voice search in other programs I'd give 5 stars.", "verified": true, "helpfulness": "0/0", "author": "D. Bither"}, {"rating": 5.0, "review": "All it's cracked up to be.  Like the feel of the remote, love the voice search ... works fantastic, and of course, love the variety of available programming!", "verified": true, "helpfulness": "1/1", "author": "Linda Brumbaugh"}, {"rating": 3.0, "review": "I prefer my Apple TV or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "notMyRealName"}, {"rating": 5.0, "review": "I had purchase a Chromecast device and had not yet installed it when I learned of the Kindle Fire TV. It was apparent this was a far superior device. Much easier to set up and having the simple and easy to use remote was what I really found appealing. I did not like the need to use my tablet or smart phone to operate as is required by the Chromecast device. I also purchased the Kindle e-book version of the Amazon Fire TV User Guide which is handy, but I would have preferred that a hard copy had been included in the box with the device.", "verified": true, "helpfulness": "1/1", "author": "William E. Sargent"}]