[{"rating": 5.0, "review": "Love, love, love this fire TV. This has got to be one of the best purchases that I have ever made. Amazon Fire TV is far above the competition in ease of use, and number of apps. With Fire TV I now have no need for cable or satellite in my home, I have now cut the cord and have started saving money while having even more channels to watch. Recommend this to everyone. Great job Amazon.", "verified": true, "helpfulness": "0/0", "author": "Patricia M."}, {"rating": 5.0, "review": "Great! Really enhances watching prime videos and renting / purchasing videos! We love it.", "verified": true, "helpfulness": "0/0", "author": "Lisa Walkup"}, {"rating": 4.0, "review": "Great for cutting the cord, the only downside is that voice search only searches amazon video and not all of the streaming media apps. I thought it would have been cool if it searched all of your installed apps for the movie or tv show you want.", "verified": true, "helpfulness": "0/0", "author": "Steven Cucuzza"}, {"rating": 5.0, "review": "Very easy to use and love it!!!", "verified": true, "helpfulness": "0/0", "author": "Kim Lagasse"}, {"rating": 5.0, "review": "Does a great job.  Much easier than going off a blue ray player", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 3.0, "review": "Disappointed that unit stopped working several times.", "verified": true, "helpfulness": "0/0", "author": "Leroy N. Salerno"}, {"rating": 5.0, "review": "easy set up.  out of the box to functional in minutes.  better quality video & smoother stream than I anticipated.", "verified": true, "helpfulness": "0/0", "author": "Brian Kanterman"}, {"rating": 5.0, "review": "As usual Amazon has given me a great product. The voice control is amazing. The choice of movies and tv shows is excellent. I would recommend that you join Amazon Prime in order to get the most value from this product.  But then I can't imagine not having Prime. I have a kindle and a Kindle Fire and also order many items from Amazon so the Prime pays for itself. This is a great product. Just wish I had gotten it at the sale price:)", "verified": true, "helpfulness": "0/0", "author": "lynda bower"}, {"rating": 3.0, "review": "It's ok not great", "verified": true, "helpfulness": "0/0", "author": "youssef bihi"}, {"rating": 1.0, "review": "My Fire TV only worked properly for a few days. After that, the voice search would stop working. When I would contact support they would have me reset the machine to factory defaults. This would cure the problem for another few days. Finally, I returned it, but instead of sending me one that works, they \"refunded\" my account $67.20, deducting shipping and restocking fees; although why a broken Fire TV would be restocked is beyond me. I find this pretty odd because other items by 3rd parties get a full refund from Amazon. NOTE: I did order a Fire Stick since then and it has worked fine, it's just missing the voice feature unless you use your iPhone.", "verified": true, "helpfulness": "1/3", "author": "ChazMarlboro"}]