[{"rating": 4.0, "review": "great speed great please connect but it needs more channels", "verified": true, "helpfulness": "0/1", "author": "LORI HUGHES"}, {"rating": 4.0, "review": "I am pleased with this unit and am looking forward to many hours of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Timothy Handel"}, {"rating": 4.0, "review": "easy to install and operate. voice activated is nice. the free prime movies are not HD - disappointing.  You have to pay a fee to watch your \"free\" movies in HD.", "verified": true, "helpfulness": "0/1", "author": "John B."}, {"rating": 3.0, "review": "I purchased the Amazon Fire TV in January 2015.  It is now 4 months later and the remote control has stopped working.  I have replaced the batteries twice just is case and I have reset the Amazon Fire TV and nothing has restored the remote control to working condition.  I also cannot see a means to contact Amazon to address this situation and get a replacement remote.I do like Fire TV, but the remote control failure has me concerned about the quality of the remote.", "verified": true, "helpfulness": "0/0", "author": "Keith Davis"}, {"rating": 5.0, "review": "Love using the Amazon Fire TV for movies, TV shows, games and exercise apps - Most for free.  Easy to use", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 5.0, "review": "I am very happy with this purchase and would definitely do it again.", "verified": true, "helpfulness": "0/0", "author": "Divabvrtn"}, {"rating": 5.0, "review": "Great streaming device. Nice quality and design. The Sling TV deal is great, the channel bundle offer the right mix. As cable or Satellite, there is hundred of useless channel forced down your throat by the provider. Fire TV allow the installation of Kodi which is the main reason for my decision to purchase the unit. It allowed user to stream video on their own private network. I believe this is the reason why Apple TV is a bust. So if you are looking for an alternative to costly cable/satellite, then Fire TV with Sling TV App is the way to go for your TV viewing needs.", "verified": true, "helpfulness": "0/0", "author": "G. Lai"}, {"rating": 4.0, "review": "It gets snow and sometimes doesn't work well with other machines (blueray, xbox, antennae, playstation, etc...) kinda buggy.", "verified": true, "helpfulness": "0/0", "author": "Thrilled2haveboys"}, {"rating": 3.0, "review": "Well I just got the this a few days ago and I was very excited to get it. everything that is amazon based works amazing. but so far everything that isn't for amazon works sort of less than great. I bought this because i had experienced some minor issues with chromecast and I thought maybe if I spent the money it would fix this. Well Netflix has had some issues so far with loading and rebooting. which has made me use the prime tv more so than netflix because for some reason a minor network problem prevents me from using netflix but not prime tv. also I was very disappointed with the USB2.0 I was wondering of course after I had gotten it why the usb doesn't work for storage or gamepads and found out its using a fairly old USB type for this device. Which i was sort of disappointed with as more storage on a usb is cheaper and I wouldn't have to buy cloud storage and pay for it monthly. Also USB gamepads are cheaper and don't require batteries which was a turn off since now I'm sort of obligated to buy a Fire TV gamepad now which is even more money I will have to shell out. The money i'll have to spend and have already spent, I should have just bought an xbox 360. Same streaming features AND far more powerful gaming hardware along with free games and everything. The reviews i read appeared positive but I guess i should have done a little more research before making the purchase. The fire tv has alot of power in a tiny box and some hidden potential but it just needs to be unlocked somehow. I hope future firmware updates and so on help improve this box.. Im still a big fan of this thing and I would like to see more of it.bottom line is the Amazon exclusive features work amazing. anything third party or otherwise works just ok or not at all.", "verified": true, "helpfulness": "0/0", "author": "Kyle Alfonso"}, {"rating": 3.0, "review": "You won't get good enough bandwidth to stream unless plugged into your router", "verified": true, "helpfulness": "0/1", "author": "Dex"}]