[{"rating": 5.0, "review": "I love fire-tv.I have only had it a short time but im just cratching the surface of what is available to me I know.All in good time but so far I am enjoying it immensely.I am a movie and good tv show junkie so just exploringthat right now.", "verified": true, "helpfulness": "0/0", "author": "Leo L. Burns \"blood red\""}, {"rating": 5.0, "review": "I love it so I bought one for my husband for his TV in the front room. He uses it more than I do. The voice control a big plus. Sherry:)", "verified": true, "helpfulness": "0/0", "author": "Sherry \"Sherry\""}, {"rating": 5.0, "review": "I just unpacked my Amazon Fire TV. Everything went smoothly on setting it up. I watched a movie. It's great!i especially liked the HD picture and the Dolby sound. Keep up the good work.", "verified": true, "helpfulness": "0/0", "author": "Irv Goodman \"All around maven\""}, {"rating": 3.0, "review": "needs more memory it has to stop to many times to catch up.it seems to take to much time to reload", "verified": true, "helpfulness": "0/2", "author": "Wayne Haefele \"shows\""}, {"rating": 4.0, "review": "The Amazon fire TV replaced a Roku 2 XS. I got tired of the slow response and random reboots from my Roku.  The Amazon Fire is much faster and much more responsive.  However, I am a little irritated that it doesn't have the newest Netflix app.  This is fairly common however.  I also wish Amazon would add a \"continue to next episode\" feature like Netflix.", "verified": true, "helpfulness": "0/0", "author": "S. Barrett"}, {"rating": 5.0, "review": "this thing is great, no complaints so far. Fast, easy to use, and the voice command option works extremely well. In fact, my wife and I tried to mumble titles as we searched, and it the fire is yet to misunderstand our commands. I will recommend this to my family and friends.", "verified": true, "helpfulness": "0/0", "author": "Matthew C."}, {"rating": 5.0, "review": "This is a jack of all trades device, which solves allot of the issues that you experience with other streaming devices.  The remote is Bluetooth which means you do not need to have a line of sight, and can move the box to a location that is not a visible eye sore on your entertainment system.  You can easily side-lode non Amazon applications such as XBMC, which allows you to stream all of your media content from local network shares.  The simply user interface is great for non technical people as well.", "verified": true, "helpfulness": "0/0", "author": "RWKeenan \"Rich Keenan\""}, {"rating": 5.0, "review": "Although I admit I am not a big tv/movie watcher, this is a great deal. One time purchase and then tons of free movies and tv shows. My daughter told me that if you couple this with a Hulu Plus account, you can say GOODBYE cable. (I have not been brave enough to do this yet though) :)", "verified": true, "helpfulness": "0/0", "author": "Sheri Lekan"}, {"rating": 5.0, "review": "I recommence this Amazon fire TV box it's awesome and the price is good My family and I loves it we especially love enjoying it on the weekends", "verified": true, "helpfulness": "0/0", "author": "Jasmine"}, {"rating": 5.0, "review": "I LOVE this! I will be honest and say I did not know what I was buying when I got this. I just thought it was a box to view my Amazon prime movies on…but it is so much more. Apps for games, live TV from all over the world and movies, movies and more movies. Three weeks after I got this we canceled our cable subscription. So much fun! Best $99.00 I have ever spent.", "verified": true, "helpfulness": "0/0", "author": "Shan"}]