[{"rating": 4.0, "review": "Bought for my wife. Used mostly as a reader. She has no complaints with the unit except for the location of the on/off switch and Ad that pops up everytime you turn it on.Need more apps.", "verified": true, "helpfulness": "0/0", "author": "Rooster"}, {"rating": 5.0, "review": "I think I will let cable go .This is wonderful and so many children program's .I wish I would have gotten it sooner the picture is great in full HD this is a wonderful thing .I can cut my budget buy 300.00 a month because of Fire TV", "verified": true, "helpfulness": "0/0", "author": "Pictuure Perfect Boxers"}, {"rating": 4.0, "review": "Does the things I expected it to I'm not unhappy with it I've used it a little bit maybe I'll be happier after more use.", "verified": true, "helpfulness": "0/0", "author": "scott"}, {"rating": 5.0, "review": "love it will never read another paper back!!", "verified": true, "helpfulness": "0/0", "author": "Jane Carr"}, {"rating": 5.0, "review": "Works great....", "verified": true, "helpfulness": "0/0", "author": "Gary Mc"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Holly K. Taylor"}, {"rating": 5.0, "review": "it is great5 but I am not able to  use ri8ght now", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "sometimes we like - sometimes we don't. we enjoy it when it works, but find that it will just \"decide\" not to work once in awhile for no apparent reason. it has not worked for 2 weeks now. have tried all the tricks to get it back. no luck. we've had this since December, but are very frustrated with the system's quality.", "verified": true, "helpfulness": "0/0", "author": "arteest \"jart\""}, {"rating": 5.0, "review": "so far so good!  I am happy with my product.  Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "HORTENCIA CABRAL"}, {"rating": 3.0, "review": "Works amazingly well for Amazon content. Seriously, the video quality for Amazon content is VERY good. Unfortunately, the same cannot be said when viewing Netflix content on the Fire TV. This is close to becoming a deal breaker for me. Netflix looks horrible on the Fire TV. I've read on various websites that this is a problem with the Netflix app which was developed for the Fire TV. However, this app has not been updated since October 2014. My internet speed is stellar, so that's not the issue. Everything other than Netflix comes through clean, fast, and in high quality. But Netflix continues to have buffering issues and poor video quality. These issues don't seem to come up a lot on the Fire TV reviews here, but if you search the internet you'll see that this is something that people have been complaining about for quite some time. It seems that an updated Netflix app that was optimized for the Fire TV would take care of these issues once and for all, but apparently this has not been a priority for either Amazon or Netflix. That's a shame, because that's a serious blemish on an otherwise outstanding device. Because let's face it, Netflix is by far the leader when it comes to online video content. If that content cannot be accessed in an acceptable manner through this device than I have to wonder how useful it really is.If Amazon (or Netflix) can update the Netflix app so that the video quality at least matches that of Amazon Instant Video, I'd be happy to revise my rating and review, but until that time I have a hard time recommending this device to anyone...", "verified": true, "helpfulness": "3/5", "author": "monkyspunk"}]