[{"rating": 3.0, "review": "Fire TV is very user friendly! However, the apps you can download are limited, and I've yet to find any app that will allow you to web browse. I have personally purchased a Roku, but I have not received it yet. I have read reviews that say it has a much greater variety of apps available then any other streaming media device.  If the Roku is as good as the reviews I've read, I will be replacing both of my Fire TV boxes with Rokus.", "verified": true, "helpfulness": "1/5", "author": "A. Haynes"}, {"rating": 4.0, "review": "I like the system pretty much.  The forward and back buttons could work more smoothly.  It's a whole new experience; one I'll have to get used too.  I sure like the money saved by viewing tv this way.  I'm a little disappointed in how much network tv I would have to pay extra to watch.", "verified": true, "helpfulness": "0/1", "author": "Alison Pringle"}, {"rating": 5.0, "review": "Not much on television now so when I want to watch something  I switch to my amazon fire tv.  I can watch old tv shows, PBS series or movies when I want.  Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Minna Good"}, {"rating": 5.0, "review": "Great connection between the TV and the internet. Amazon Prime membership adds yet another dimension to using your TV.", "verified": true, "helpfulness": "0/0", "author": "Florida User"}, {"rating": 5.0, "review": "It does everything that anticipated it would.  The instructions are clear and simple (except opening the battery case),  It is easy  to operate and my husband is really enjoying the challenge of navigating it through selecting songs and movies.", "verified": true, "helpfulness": "0/0", "author": "wiseone"}, {"rating": 5.0, "review": "Very fast, we really enjoy being able to quickly dial up game apps and movies on Netflix.  The gaming remote is very worth it if you are going to game on it.  Super for my 11 year old!  Look for the bundle pricing which Amazon offers in a nice price.", "verified": true, "helpfulness": "0/0", "author": "J. Jones"}, {"rating": 5.0, "review": "Works great.  Simple, easy-to-follow onscreen directions.", "verified": true, "helpfulness": "0/1", "author": "B Marshall"}, {"rating": 3.0, "review": "Voice Search idea is great, no problems thereIn order to get some of the features working, be sure to update the firmware first.  Go into Settings-->System -->scroll down to update and then let it update.  After that then you can use certain things like Netflix.If you want a good idea how well this product is, look for recent reviews and not older ones.In order to streamline games from PC to Amazon Fire TV you need to have a Nvidia based video card only.  There is no Support for ATI.The latest version of the Fire TV will Brick your system if you try to mod/HomeBrew so keep that in mind when purchasing it.To my knowledge there is no way to turn off the Amazon Fire TV.  If you are one of those that like to conserve energy, you won't find it here.(P.S. Sleep mode still draws power.)", "verified": true, "helpfulness": "0/1", "author": "Stacey Johnson"}, {"rating": 3.0, "review": "Works fine. Just not much content of interest to us.", "verified": true, "helpfulness": "0/0", "author": "CRWinsmore"}, {"rating": 5.0, "review": "So far great, still exploring.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}]