[{"rating": 5.0, "review": "I am completely new to this and it's great!!!", "verified": true, "helpfulness": "0/1", "author": "DENISE DOLLY"}, {"rating": 3.0, "review": "I've had this for a week and so far I love it.Pros:-Plex App-BYU TV App-Parental controls. You can have separate accounts for each kid (FreeTime) with time limits and no in-app purchasing.-It seems that a lot of the Amazon Prime music songs have lyrics automatically show up which my kids love since they like to sing along.-Really cool HD landscapes for screen saver. This might seem silly but I like the variety of scree saver images that it shows.Cons:-No volume control-FreeTime Unlimited subscription provides a lot of content but I don't see why I have to pay extra since I already have access on Prime to the same content. I would like a way to be able to Mark Prime Shows that the kids could then access. Also, the FeeTime content is not well organized. For example, different seasons of Wild Kratts show up on different pages (you have to scroll a lot) instead of being able to select the season you want from on location like you can in a web browser.After trying FreeTime Unlimited for like a day or so I just unsubscribed since it was useless for me.", "verified": true, "helpfulness": "0/1", "author": "J"}, {"rating": 5.0, "review": "Great Item  Had to return as it would not work on our TV  Got the Fire  Stick instead", "verified": true, "helpfulness": "0/1", "author": "clockman53"}, {"rating": 5.0, "review": "Very enjoyable products easy to use, like it better than Roko", "verified": true, "helpfulness": "0/1", "author": "C.M. Wilson Sr."}, {"rating": 5.0, "review": "It works very well. Easy to set up and navigate the menus. Lots of free stuff if you have Amazon Prime. Works great with Netflix and Youtube. I am pleased.", "verified": true, "helpfulness": "0/1", "author": "D. S. People"}, {"rating": 4.0, "review": "It was OK for what you get.", "verified": true, "helpfulness": "0/1", "author": "PEGGY"}, {"rating": 1.0, "review": "A utter and complete disappointment", "verified": true, "helpfulness": "0/4", "author": "zachary nephew"}, {"rating": 5.0, "review": "I love it!!!!!", "verified": true, "helpfulness": "0/1", "author": "Florence Butler"}, {"rating": 3.0, "review": "Works really good with Amazon prime but not so much with third party app though. Despite beefy hardware, I don't really see that it gains that much speed than other streaming devices.. I have Roku3 and Netflix loads much faster than Fire TV. But with Prime it does come on in instant though. It's excellent if you wan this exclusively for Amazon only. I prefer Cleaner interface on Roku3 though.", "verified": true, "helpfulness": "1/2", "author": "Amazon buyer"}, {"rating": 5.0, "review": "Well worth it. Things are changed and added almost everyday to fix the problems people mention in their reviews.", "verified": true, "helpfulness": "0/1", "author": "Michael Merrill"}]