[{"rating": 2.0, "review": "I GOT THIS SO THAT I COULD WATCH TENNIS, NOWHERE WAS IT EXPLAINED THAT YOU HAD TO SUBSCRIBE TO ESPN THROUGH EITHER DISH OR CABLE. IF I HAD SUBSCRIBED TO THESE SERVICES THEN I COULD HAVE WATCHED THESE PROGRAMS ON MY TV WITHOUT THE TV FIRE, SO WHY WOULD I HAVE NEEDED IT? I COMPLETE A WASTE AS FAR AS I COULD SEE IT.", "verified": true, "helpfulness": "3/15", "author": "DOLORES  HAWKINS"}, {"rating": 5.0, "review": "Ecxelent, lo ve it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Unable to work with older model television.", "verified": true, "helpfulness": "2/8", "author": "amlove \"AM Love\""}, {"rating": 1.0, "review": "Freezes. Customer service is terrible. It's a paperweight.", "verified": true, "helpfulness": "4/7", "author": "J. Scott"}, {"rating": 5.0, "review": "very nice piece of equipment", "verified": true, "helpfulness": "0/1", "author": "MC \"Conservative\""}, {"rating": 4.0, "review": "Some what misleading on what shows are included in Prime and what shows you have to pay extra for. New movies are cheaper at Red Box.", "verified": true, "helpfulness": "1/2", "author": "D.U."}, {"rating": 4.0, "review": "The screen from time to time reloads the movie or whatever you are watching. I called the phone company to check my internet speed and everything seems to be fine. Needless to say I am not using the device wireless. I might call Amazon to see what they would suggest. I only subscribed to Netflix but the device comes with some free fitness channels, games and some other stuff. I love the voice search from the control remote. The unit is small so is perfect to settle in a small space next to your TV. I had not checked the other features like Pictures, Video games, Amazon Prime and so on. Since I installed this unit I had not watched my crappy basic cable. Major Cable TV is way too expensive for me and Netflix provides the entertainment I need for my short free time. I'll keep you posted.  As of Aug 2 2014.", "verified": true, "helpfulness": "1/2", "author": "Vivian"}, {"rating": 5.0, "review": "First I bought the Apple TV for the main living area TV.  Loved it.  Then I bought the Roku 3 for the bedroom because it had Amazon Prime integrated into the box, not like having to use my iPad or iPhone to send Amazon Prime to the Apple TV.  Both were good, but I favored the Apple TV for the craftsmanship, the fact that I could view my iPad or iPhone on the screen, and the better graphics.  Then, I was told about the Amazon Fire.  I had seen the Gary Busey commericals, thought they were hilarious, but really didn't pay attention to see what he was selling.  When a friend told me all about the Amazon Fire, showed me the video commercials on-line, I ordered it that day.ABSOLUTELY LOVE IT!!!!  After receiving the Amazon Fire, I put it in the main living area were we watch TV the most, moved the Apple TV to the bedroom, and returned the Roku 3.So, I have experienced the Amazon Fire, Roku 3, and Apple TV.  I prefer the Amazon Fire over the Apple TV and Roku 3.", "verified": true, "helpfulness": "6/7", "author": "Kenneth D. Peake"}, {"rating": 4.0, "review": "The Fire TV compares favorably with Roku 3 which we also have.The Fire TV seems a bit faster and like the Roku 3 it also has a small white indicator light on the front.The included remote has a good hand feel.I found the Roku 3's UI slightly easier to navigate and use. Fire TV's uses different size icons that can be a little confusing.Both Roku and Fire TV seem to offer about the same video services.Fire TV does currently offer deferred payment plan with no finance charge, which we took advantage of.Don't lose the Fire TV remote, the replacement will cost $28.", "verified": true, "helpfulness": "2/3", "author": "D. Garber"}, {"rating": 5.0, "review": "This streamer is quite good.The voice commands works really great.I found everything to work fast, and the control is responsive", "verified": true, "helpfulness": "2/3", "author": "Buffy \"ARM\""}]