[{"rating": 1.0, "review": "Not good at all! No external HD support! what the hell was Amazon thinking, got it today had everything ready to go to get XMBC sideloaded only to find out that nothing i could do would enable a feature that many many other boxes offer.The only redeeming feature is the Amazon Instant Video works, but if it wasn't for Amazon not allowing Instant Video on Android OS this wouldn't be a redeeming feature.", "verified": true, "helpfulness": "3/13", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This allows so much from our TV and we use it daily!", "verified": true, "helpfulness": "1/3", "author": "Ralph_Celento"}, {"rating": 5.0, "review": "So easy to install!!", "verified": true, "helpfulness": "1/3", "author": "SharonMn"}, {"rating": 5.0, "review": "If you know your stuff ...enough said.  Good product with surprisingly great support .  Very happy", "verified": true, "helpfulness": "0/0", "author": "10kster"}, {"rating": 5.0, "review": "Better then apple tv", "verified": false, "helpfulness": "0/1", "author": "Boston-789"}, {"rating": 4.0, "review": "Ordered it on 11-26-14 & paid $99. I received it on 11-29-14 & on 12-1-14 it went on sale for $30 less.  Seems there should be some way to get a price adjustment but after searching the site, there is no instructions.  Will try to call & see what happens.  I have been an Amazon Prime member for many years.  Disappointed in this but happy with the product overall.", "verified": true, "helpfulness": "0/6", "author": "Sue M. Zablocki"}, {"rating": 1.0, "review": "Not for Netflix,,I am a long term Prime member and do watch it, but also want to watch Netflix more often,Netflix is impossible to consistently watch on this. At first it worked for a few days, then I had to keep reentering log in info, then it kept buffering and I do not have this problem with my Roku, don't know why I even bought it, won't stay connected to internet, now won't open any Netflix movie,RETURNING", "verified": true, "helpfulness": "27/32", "author": "S. puddy"}, {"rating": 5.0, "review": "Okay, I do not write reviews normally but this needed to be said. Amazon Fire Tv is amazing. I was admittedly skeptical about purchasing it as I had little faith in its streaming capabilities given that my wifi can be a little tempermental and I mean, come on, how impressive could it really be? I was pleasantly surprised. It streams amazingly well. The apps are easy to purchase and easy to use. I've seen some complaints about adjustments to the Netflix app but it has been running perfect. I am also very impressed by Amazon's attention to their customers inquiries and complaints. It is very much appreciated by the way!Now that I've got my praise out of the way I do have one, not complaint just some constructive criticism, I am so freaking paranoid about Fire Tv not having an OFF switch. Don't get me wrong, it does go to \"sleep,\" but I am just so incredibly paranoid about shutting down my hardware that I can't stop myself from worrying about it. That's probably my problem though so I can deal with it.Also, for those who are still skeptical having read other reviews, Prime movies and tv shows can be easily sifted through now as soon as you download one little update.Wow. Super glad I did this. I give credit where credit is due!!! Love you, Amazon!!", "verified": true, "helpfulness": "8/8", "author": "LLN"}, {"rating": 3.0, "review": "It works ok, but it keeps booting me out from Netflix or saying that it can't load the movie I want on netflix. When in my laptop Netflix works fine.", "verified": true, "helpfulness": "6/7", "author": "Brenda M Porta B"}, {"rating": 5.0, "review": "We decided to cancel cable and started researching our options.  Getting the Amazon Fire TV was the best choice we could have made!  Not only are we saving tons of money without that cable bill, but the available free channels and games are awesome!  We have a family of 8 and there's truly something for everyone.  It's got great speed, doesn't appear to slow my connectivity for other devices and again, it has something for everyone.", "verified": true, "helpfulness": "4/4", "author": "Sabrina Gibson"}]