[{"rating": 4.0, "review": "I was a little confused at the onboard preference for Amazon content. Not that I didn't expect it, but that it works strangely. For instance, when I do the voice search accidentally while watching Netflix, it doesn't stop or warn you or something that you'll be exiting the app. Also I wish you could sleep the thing more easily like if the sleep function came up when you voice searched \"sleep\".", "verified": true, "helpfulness": "0/0", "author": "Ilya Schwartzburg"}, {"rating": 3.0, "review": "The processor is slow, it crashes a lot.  It doesn't come with a browser.", "verified": true, "helpfulness": "0/2", "author": "GURMEET MEHROK"}, {"rating": 5.0, "review": "Got as a Christmas gift. LOVE IT! The box is much smaller than I expected, about the size of a CD disk case, which was a pleasant surprise. It was super easy to set up, basically plug it in and follow the on-screen instructions. I was up and running in a few minutes.  I already had an Amazon Prime membership so am very happy to now access so many Prime movies for free! Works great, would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Julie Ann"}, {"rating": 5.0, "review": "LOVE IT, IT IS WONDERFUL. WE DUMPED CABLE AND SAVING LOTS OF MONEY.", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "I love it. Fast, easy to use and I can use Plex.", "verified": true, "helpfulness": "0/0", "author": "Kevin S"}, {"rating": 4.0, "review": "So far so good. Runs smoothly, and does just about everything I'm looking for. The UI isn't amazing, but it works well for the most part.", "verified": true, "helpfulness": "0/0", "author": "charlie wildey"}, {"rating": 5.0, "review": "I love this!!", "verified": true, "helpfulness": "0/0", "author": "reesumm25"}, {"rating": 4.0, "review": "works as advertised", "verified": true, "helpfulness": "0/0", "author": "Matt Burt \"Happy Health    MATT\""}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "jose li"}, {"rating": 5.0, "review": "Awesome! The extra memory, compared to the stick, is totally worth it!!!", "verified": true, "helpfulness": "0/0", "author": "Jason Smith"}]