[{"rating": 5.0, "review": "Very easy to set up and start using. The voice search is excellent.", "verified": true, "helpfulness": "0/0", "author": "Rita Locke"}, {"rating": 5.0, "review": "AWESOME", "verified": true, "helpfulness": "0/0", "author": "Kelly Ross"}, {"rating": 5.0, "review": "Works awesome", "verified": true, "helpfulness": "0/0", "author": "B.Jackson"}, {"rating": 4.0, "review": "I figured since I've owned this for about 6 months, I'd give my opinion.It is a great streaming device when it is streaming. Not as many apps available as compared to roku but the apps I've installed so far has been of good picture and sound quality. I'm a bit of an audiophile so the fact that it supports 7.1 channel Dolby digital plus is a big advantage over the others. I've played a few games on it although I haven't invested in an actual controller. I have two gaming consoles so I don't really need more game controllers laying around.I have one gripe. This gripe applies to more than just this particular unit however. I understand that apps get buggy. Devices get buggy. And certain apps make devices buggy. This is the reason why I restart my phone so often. I digress... I regularly have to unplug this device. That's not really a big deal to me because I have to do it with my roku as well. The manufactures of these devices have to know that they need to be unplugged to be restarted often. Why don't they put an on/off button on the remote and a reset button on the unit? It gets annoying having to reach behind the electronics to unplug and plug the unit in often simply because I can't just turn it off myself. Anyways, enough of my white people problems.In a nutshell, this device does it's job and does it well. But like any modern electronic device, it gets confused from time to time and just needs to be reset. Overall, I've been happy with it and I've saved 70 dollars per month not paying a tv provider.", "verified": true, "helpfulness": "0/1", "author": "Some Guy"}, {"rating": 5.0, "review": "Has all the major providers plus Amazon! Good deal!", "verified": false, "helpfulness": "0/0", "author": "Kyle Hernandez"}, {"rating": 5.0, "review": "It is perfect and easy to use", "verified": true, "helpfulness": "0/0", "author": "Cano"}, {"rating": 5.0, "review": "It's intuitive, quick and easy to set up.  Great product.", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 4.0, "review": "So far, so good. Very pleased & glad I bought it rather than a smart tv. I considered buying a smart tv to stream Amazon prime movies & purchasing the Fire tv saved me $1500. Thanks Amazon.  Pro's: Plug & play (I didn't have to do any setup)  Very fast streaming, zero delay starting movies(main reason I purchased)  Prime(free with Amazon Prime) videos are easy to find  Remote control simple & easy to use  Voice search has not made any mistakes Con: It would be nice if it streamed videos directly from my pc instead of having to upload them to the internet.", "verified": true, "helpfulness": "0/2", "author": "William M. Nichols \"Uncle Bill\""}, {"rating": 5.0, "review": "Awesome new toy!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Jones"}, {"rating": 2.0, "review": "These are my initial thoughts as I have just gotten it and been playing with it for a day so far. I'll update this review as I discover more about it.It was easy to setup and I really like the remote control. The remote is simple, small, and light. The set-top-box itself is small. The remote control isn't just IR, it's RF (probably Bluetooth), which means the box can be easily hidden.My biggest gripe with this is that the USB port is useless. I can't play media from USB. I have several different devices like this (Roku, WD Live TV, etc). All of the other devices out there allow you to connect a storage device via USB. Granted, there are ways to do this by rooting the device, but this isn't a possibility on new devices since they come with updated software to block the user from rooting. What this means is that any media files I have can't just be thrown on a flash drive or portable hard drive and hooked up. If a friend comes over with some family videos on a flash drive, or some new music s\\he's recorded, I have to put it in my computer and share it over the network.THE USB PORT NEEDS TO BE ENABLED.The device only comes with 8GB of storage, which by the time everything is put on there, you're left with between 4-5 GB left. Most decent games will take up 1-3GB of that storage, so you're left with the ability of only having a few games on there at a time.Sideloading of applications is possible without rooting, which is a good thing. The pain though is that none of the sideloaded apps show up on the main menu, and in order to launch any of them you have to go through the settings, then applications, then down to the application, then select launch. Or there's another process of using Llama to basically use another application as a \"shortcut\" for one of the sideloaded applications.It seems like Amazon focused way too much on making something family friendly, and in the process has created something that isolates those looking for something more. They are not mutually exclusive. You can lock the thing down with parental controls when enabled, or give the user more access when parental controls are disabled. You could setup a profile system. The adult profile could require a password or PIN, have access to any sideloaded apps, utilize the USB port, etc.Again, I'll update/edit this as continue to use it. But quite honestly, this would probably go up to a four star review if USB was enabled, and probably hit a five star review if there were shortcuts for the sideloaded applications too (and an easier process for those unfamiliar with using a terminal).", "verified": true, "helpfulness": "0/2", "author": "Nickolas B."}]