[{"rating": 5.0, "review": "Used to swear by my Roku's/Chromecasts and couldn't conceive how Amazon could do it better, but they did.  I don't have any issues so far.  The only reason I gave it a try was because I was having too much buffering issues on my Plex and Roku.  I don't have any buffering issues anymore.  Thanks Amazon fire.  The games are way cool too.", "verified": true, "helpfulness": "1/1", "author": "Chasstan Prichard"}, {"rating": 5.0, "review": "👍", "verified": true, "helpfulness": "0/0", "author": "edwin mendez"}, {"rating": 1.0, "review": "Need more sports!", "verified": false, "helpfulness": "1/8", "author": "Colby Walton"}, {"rating": 5.0, "review": "Amazon Prime doesn't drop like on a Roku. I kinda guessed that would be true when ordering. Fast to boot. Fast processing.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 5.0, "review": "So long XBOX live - HELLO Fire TV! This thing is great, friendly user interface and very cool. Sleek looking and comes on quick! Just wish it had an \"off\" button.", "verified": true, "helpfulness": "0/1", "author": "Andy Yarbrough"}, {"rating": 1.0, "review": "I was ready to hook it up tonight, but was very disappointed that I neededa HDMI cable to hook it up to the TV.  I had no idea I needed to order thatas well.  Is there any other hidden things I must order before I can watchmovies?", "verified": true, "helpfulness": "0/11", "author": "Argo"}, {"rating": 5.0, "review": "Much,Much,Much better than the google tv box I was using. did I say it was better?", "verified": true, "helpfulness": "0/1", "author": "William Flowers"}, {"rating": 3.0, "review": "Good variety and reception.  I don't like the fees to view many of the selections.  I was let to believe there would not be fees since I have Amazon Prime.", "verified": true, "helpfulness": "0/1", "author": "CW"}, {"rating": 5.0, "review": "Great product. The UI is seamless. The only real con about it is no HBO GO.", "verified": true, "helpfulness": "1/1", "author": "Akiel Rhoden"}, {"rating": 5.0, "review": "Bought one for the bedroom, a storm had taken out the Ethernet on the smart DVD player. Fooled around a little with it after a few weeks and started seeing all the stuff it could do! Ordered a 2nd unit for the living room because it's faster than the smarts in our pretty new TV! No more Netflick crashes. Rarely a lag time... MANY more shows with Amazon Prime which by the way at $99 a year is cheaper than Netflicks. Not to mention it makes a great addition especially with free expedited shipping, music, other channels and tons of free or near free apps! Did I mention we do not have cable or satellite TV? ....and if I could get rid of this monopoly phone service who makes you have phone to get internet, I'd drop it for a Magic Jack phone (I use one for fax line they're great too) it was my primary home phone for years until I moved into Windstream's monopoly. At least AT&T; and local cable company will let you have internet with out phone or TV!", "verified": true, "helpfulness": "1/1", "author": "Michael Zukas"}]