[{"rating": 1.0, "review": "Wow, I've been a prime member since it started, and I purchased books from amazon before it was \"anything\"!!! Anyway, I was offered a free trial and accepted it.  When I went to check it again after clicking to redeem it, the screen told me that I had already redeemed the offer.  Then, the next day, apparently I did not qualify for it anymore because I did not actually purchase it in my inbox.  Instead, a fire HD tablet was in my inbox!  Why the hell would the system confirm to me that the offer (the fire TV) is redeemed already for confirmation, when it hasn't been redeemed?  I was looking really looking forward to purchasing this product without the free trial, but now I'm quite pissed off at the failure of amazon to remedy such a ridiculous situation~!!!", "verified": false, "helpfulness": "3/21", "author": "swt caroline"}, {"rating": 1.0, "review": "I am not a fan of this device at all. Menu system is a pain to navigate. Definitely not as polished as other streaming devices. I have a Roku 3 and an Apple TV. Bought this since I am a prime member, and can't get amazon on my Apple TV. Should have just bought another Roku. I'm returning this asap.", "verified": true, "helpfulness": "2/8", "author": "sneakbox"}, {"rating": 4.0, "review": "Good option when nothing good is on TV, you have a wide variety of movies and games.", "verified": true, "helpfulness": "0/0", "author": "RAFAEL ESPINOSA"}, {"rating": 4.0, "review": "We have had the unit in use for about three weeks now.  The picture is crystal clear, the sound is top-notch and it's extremely easy to hook up and use.  It works just as well with Netflix as it does with Amazon Prime video.  It downloads very fast and does not drop the signal from our less-than efficient router.So far, so good.", "verified": true, "helpfulness": "2/2", "author": "Bart C."}, {"rating": 5.0, "review": "I love it BUT the price went down just after I bought it. ; -(", "verified": true, "helpfulness": "0/0", "author": "ASW"}, {"rating": 5.0, "review": "Love my Amazon Fire!  Can watch a variety shows without commercials and no cable bill:)", "verified": true, "helpfulness": "0/0", "author": "Ruthie"}, {"rating": 4.0, "review": "I love it!", "verified": true, "helpfulness": "0/1", "author": "James M. Ray"}, {"rating": 5.0, "review": "Easy to use, love the voice navigation! It works great with my Amazon Prime account too.", "verified": true, "helpfulness": "0/1", "author": "Steven J. Steinberg"}, {"rating": 5.0, "review": "So, I currently own:2x Apple TV3x Smart TV's1x ChromeTV2x Amazon Fire TV.I have disconnected Chrome and Apple from all the tv's.  I just recently ordered my third FireTv.  The streaming experience is so far above the other units, it's difficult to understand how those other brands haven't figured out a way to catch up.  I almost never have a buffering of any sort streaming movies from Amazon on this.  The Netflix experience is just as good.  I have not dug into much beyond that, but in terms of a streaming media experience, this annihilates the competition in my opinion.I also find myself using the voice function of the unit, which surprised me.  It is extremely user friendly and makes searching a snap.  This was completely unexpected.The one con for me, and this has nothing to do with Amazon or this unit, is the Bluetooth remote.  I have universal remotes for every TV (hate multiple remotes) and none of them are currently set up to handle Bluetooth only remotes.  Wish Amazon made it an option to not be Bluetooth.  Again, nothing against the unit.", "verified": true, "helpfulness": "2/2", "author": "Nicholas Gustafson"}, {"rating": 2.0, "review": "IT IS TOO COMPLICATED TO USE WITH A 7 CHANNEL RECEIVER", "verified": true, "helpfulness": "0/4", "author": "Robert F. Middelton"}]