[{"rating": 4.0, "review": "Comparing to AppleTV, Google TV, RokuThis thing is great, picture, speed, gaming, it's all been said.What I want is:HDMI thru- it would be very nice to leave the source/input where it is. The Anynet thing doesn't always work.Voice Search- it works, picks up what I say, but it takes you to Prime results of course, would love to see Netflix results too, along with everything else.Browsing- unless you already know what you want to watch (Prime) or play, it's hard to find something. More search criteria would help.", "verified": true, "helpfulness": "1/1", "author": "Amberic \"Amber and Eric\""}, {"rating": 5.0, "review": "Most EXCELLENT one of the best products I have purchasd in many years. Simple to use and has to be as there are absolute minimal directions or any information included, but over all none is necessary. Anyone of elementary school age to high school will have absolutely no problem setting up and using the FIRE TV to them it is an extension of life.  Those of us over that age bracket may stumble and be uncomfortable without our thousand page operating books. Be active try it, you can't break it by pushong buttons or making incorrect on screen selections.  Any error or mistalke can be correct by the 8 year old next door in a matter of seconds.  Buy and enjoy, don't sweat the small stuff - with a little time and being bold you will soom master it and begin to enjoy the rich massive amount of entertainment the FIRE TV will bring to you.", "verified": true, "helpfulness": "1/1", "author": "C. Price \"GatorCat\""}, {"rating": 5.0, "review": "Love It!! Love It! Love It!!!!", "verified": true, "helpfulness": "0/0", "author": "Ericson S. Weah"}, {"rating": 4.0, "review": "Love it, but still learning.  Voice repsponse is very acurate and unbelievably handy.", "verified": true, "helpfulness": "0/0", "author": "Ads6287"}, {"rating": 4.0, "review": "Easy set up great picture", "verified": true, "helpfulness": "0/0", "author": "larry schotz"}, {"rating": 5.0, "review": "Much \"Free\" programming  with Amazon prime, which is a no brainer if you buy much from Amazon.It was painfully slow at 1.5 mbps, but acceptable at 7 mbps. At 20mbps shows flow seamlessly onto my tv, giving a real choice of programming, since over the air tv is usually crap. It is a real low cost alternative to cable tv.", "verified": true, "helpfulness": "1/1", "author": "Cline"}, {"rating": 5.0, "review": "a", "verified": true, "helpfulness": "0/2", "author": "Jerry Allen"}, {"rating": 2.0, "review": "I bought it on Sept. 2nd 2014. It was great because I have a prime account and there is enough free content to satisfy me and the availability of a variety of movies for rent is very nice. HOWEVER!!!! It is now Nov. 8, 2014 and THE REMOTE BROKE!I have replaced the batteries with 2 different sets of new batteries because I wanted to be sure I didn't somehow get some bad batteries from a new package. I have looked up other reviews and found that this is a common problem. You can purchase a new remote for $30 but having only had the unit for 2 months and knowing how I treat my Amazon Fire remote like the delicate piece of electronics that it is, I am VERY displeased. If the remote would continue to work I would give a much higher review.I will also NOT be buying a new remote. If I have to spend $30 every 2-5 months for a new remote I will just live without the Amazon Fire.", "verified": true, "helpfulness": "2/3", "author": "mddow1s"}, {"rating": 4.0, "review": "Works well price was good", "verified": true, "helpfulness": "0/1", "author": "Ashley"}, {"rating": 4.0, "review": "I have both a ROKU and a Fire TV (bought the ROKU 1st) as I have dropped cable and am piecing together my alternative solutions. The Fire TV seems slightly more responsive and the overall user interface seems cleaner and more intuitive. Searching on both is a pain so I've gotten in the habit of using my computer to periodically add everything I might want to watch to my queue (or favorites or whatever the specific service calls it) on Netflix, Amazon and HULU. I'm trying to decide which to buy for the 3rd TV and still can't decide. Since I make my primary selections on the computer both devices are good choices. I don't see how searching can be made much better when all you have is a remote control.", "verified": true, "helpfulness": "2/2", "author": "PaulB"}]