[{"rating": 4.0, "review": "I got this as a gift for Christmas. Waited to rate it until I had a decent chance to try it out. It was very easy to hook up and set up w/ my WiFi. I was interested in using Hulu Plus with this but was a little hesitant based on the reviews for that particular app, but I thought I'd try it anyway and if there were problems I'd just cancel my subscription w/ Hulu Plus. But so far I'm not having problems with Hulu Plus on it, I do get the occasional freeze ups but nothing too lengthy or annoying to make me want to cancel. I love how easy it is to just pick a movie or TV show through Amazon Instant Video and it starts playing. The only thing I don't like and why I didn't give it 5 stars is because you are forced to watch everything in HD. Before when I'd use Amazon Instant Video with my Playstation 3, I could choose Standard or High Def, I'd always choose Standard because it was cheaper and the picture/sound quality was just fine, but now with Fire TV because it's a High Def device, you don't have a choice and everything is streamed in HD plus the cost of what you watch is quite a bit more sometimes, as high as $5.99 to rent a movie. But otherwise a nice, reliable product.", "verified": true, "helpfulness": "1/1", "author": "Anngalee Becker"}, {"rating": 4.0, "review": "I am disappointed that there is not a browser.", "verified": true, "helpfulness": "0/0", "author": "Robert J DeLeeuw"}, {"rating": 5.0, "review": "Works well..exactly as expected", "verified": true, "helpfulness": "0/0", "author": "Stephen Harrison"}, {"rating": 5.0, "review": "Wow, this is amazing , so simple to setup and relieve me of this cable bill.", "verified": true, "helpfulness": "0/0", "author": "Kevin Flegler"}, {"rating": 4.0, "review": "I bought 1 these to try it out, then bought 3 more for other TV's in the house.(This is not a review of everything it can do, like games etc . . just the things we use)STRENGTHSThe Voice Search is fantasticSupports Amazon Prime Music (can play my playlists setup from computer)  (Roku doesn't do this)Generally Works as well as Roku 3 except it doesn't have an earpiece jack on the remoteNOT A STRENGTHThe menu structure for programming is a bit more jumbled than needed.  The same program icon will be in view in 3 different parts of screen sometimes.No earpiece on the remote (Like Roku 3)It forces you to sit through an introductory video when you first set it up.  I didn't want to sit through this 4 times, since I bought 4 of them.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Paired with Amazon Prime, this is an awesome way to bring hundreds (possibly thousands) of movies to your fingertips.  Installation is a snap - took less than five minutes.  Love it!", "verified": true, "helpfulness": "0/0", "author": "pcme"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Michelle Vitiello"}, {"rating": 5.0, "review": "I have been an amazon customer for years but this is my first review. I purchased fire tv not really even knowing what it was, but love my kindles and was willing to be onboard. I'm a 59 year old Grandma and I couldn't love it more. My music from the cloud is easy to play through my tv, and my favorite is the BEAUTIFUL SCREENSAVER OF STUNNING CRYSTAL CLEAR PHOTOGRAPHY! It's easy to use and beautiful. My only suggestion is to separate what is free and what you pay for, get more pre school programming like Tumble leaf and last the box itself seems to really get hot. But none of that would keep me from giving it five stars!", "verified": true, "helpfulness": "0/0", "author": "Pam Picek"}, {"rating": 5.0, "review": "Love it simple to.use", "verified": true, "helpfulness": "0/0", "author": "David p Fitting"}, {"rating": 4.0, "review": "I also have the appletv 2. This blows it out the box. Very good product.", "verified": true, "helpfulness": "0/0", "author": "Denholm Wong"}]