[{"rating": 5.0, "review": "We had thought of getting Apple TV because one of our friends had it and liked it.  Then we saw a special for Amazon Fire Tv and decided to try it.  It is just great.  We enjoy it several times a week.  I would recommend it over all others.", "verified": true, "helpfulness": "0/0", "author": "Beverly Pratt"}, {"rating": 3.0, "review": "The comparison is meaningless.  Amazon Fire TV does NOT support the following:Apple Airplay streaming videoApple Airplay gamingiTunesPointless comparison, if you leave out the most important Apple features...", "verified": false, "helpfulness": "0/5", "author": "Fred K"}, {"rating": 5.0, "review": "Fire TV was very easy to set up.  It took about 5 minutes to be up and running. The only problem was getting the hang of what is free and what you must pay for. I accidentally purchased a video that I could have gotten for free.  Now we are very careful when choosing what we are going to watch.  Other than that we love it.", "verified": true, "helpfulness": "0/0", "author": "Gale M"}, {"rating": 1.0, "review": "I thought this was going to be a great buy, however they never have any new movies that they add. The recently added section has been the same for weeks. So disappointed, and I never use it it just sits there. Don't buy if you're expecting lots of options!", "verified": true, "helpfulness": "0/3", "author": "kris"}, {"rating": 5.0, "review": "This new item is a good fit for me, easy to set up, easy to use", "verified": true, "helpfulness": "0/0", "author": "mae benson"}, {"rating": 5.0, "review": "Much better than Apple TV.  Faster,  easier menu,  more content...", "verified": true, "helpfulness": "0/0", "author": "Mark Odell"}, {"rating": 4.0, "review": "I like the fact that its a smart device that has more than the others without the smart TV. However, the main reason for the purchase was to watch WWE Pay Per Views, It did failed with live streaming. I know it wasn't my connection, I had my computer running at the same time and the show came through without a problem. Everything else is perfection on the device and love it so far. As a tech nerd, you will get your moneys worth in no time.", "verified": true, "helpfulness": "0/0", "author": "J. Settle"}, {"rating": 4.0, "review": "Love it - have been catching up on Sopranos !!!! - my only complain is no HBO Go - hopefully it will be coming soon.", "verified": true, "helpfulness": "0/0", "author": "Marie"}, {"rating": 5.0, "review": "So far so great! Was very easy to connect; voice search command is fantastic; steady connection and outstanding picture. I like the ROKU3 but I like this better as the implementation of the controls and the operation of the actual OS is smoother and more user friendly. And this is the first addition - I look forward to future versions...a winner for sure!", "verified": true, "helpfulness": "0/0", "author": "JAZZY62"}, {"rating": 5.0, "review": "This is a great product. I have a home media server that I have only used with my living room TV to watch downloaded content. Now that I have Fire TV, I can watch all of my content in the Master Bedroom with the Plex app as well. Since I already had Plex setup on the server, it was a breeze to setup on Fire TV. The only thing I would like to see as an update is to be able to use the voice search to search my server via Plex. All in all, I say this is a great product and I will purchase another one for my media room once I get the components together for it.", "verified": true, "helpfulness": "0/0", "author": "Ryan W."}]