[{"rating": 3.0, "review": "Hockey season is two weeks away and you don't support NHL Gamecenter?!I have tried out amazon fire tv a few times at friends' places before deciding to buy it and absolutely loved it. The UI is great, it's fast, easy to use. I was ready to make my purchase, I had it in my cart, but then I double checked to make sure that it had access to NHL Gamecenter. Hockey season is coming up and I'm subscribing to NHL Gamecenter because I cut the cord and still want to watch games. So it's pretty important that I have access to it on my TV. I was very surprised to find out that Amazon Fire TV doesn't support NHL Gamecenter. They have NBA, MLB, and NFL coverage, but not NHL. So I removed amazon fire tv from my cart and am now looking at apple tv or roku3.When amazon fire tv finally gets it together and adds NHL Gamecenter support I may decide to switch over, but for now amazon fire is not an option.", "verified": false, "helpfulness": "2/3", "author": "HCarleton"}, {"rating": 5.0, "review": "I was hesitant to buy another box, but it easily out-performs my AppleTV and my WDTVlive. Quicker and more convenient. If had to come up with a complaint, it would be that the voice commands don't work for everything yet- but it sounds like it is in the works.It is the first device I've had that has the Prime video option, which works great. To have Amazon video and Netflix in one box is great. I'm going to give it a few more weeks, but I am almost certainly selling my old boxes.", "verified": true, "helpfulness": "0/0", "author": "Sam Lowry"}, {"rating": 5.0, "review": "Works very well, lots of choices. I HOPE they will get ACORN as I enjoy a lot of the British shows, which Roku does have, so disappointed Fire doesn't have, at least not yet. Also, they keep promising that Prime Music will be soon available by the end of this year.....I guess they better hurry!!!!", "verified": true, "helpfulness": "3/3", "author": "Bruce F."}, {"rating": 4.0, "review": "I love my Fire TV.  It is easy to search and I have had no issues with the device.  The UI is a little clunky (I wish it were more like the Xbox one interface for Amazon Instant Video but it is OK) but it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "If it were not for football and The Big Bang Theory, I would have cancelled Directv by now.", "verified": true, "helpfulness": "0/3", "author": "ChilenotChili"}, {"rating": 4.0, "review": "edit: Subsequent to posting my original review, I received a call from Amazon customer support offering to help me sort the problems I mentioned. With the latest Amazon software update, the issue of being able to easily see Amazon Prime content (and search for Amazon prime only content) has been fixed. In addition, the new update allows users to restrict the PIN challenge to purchases only. On this basis I'm adding an additional start to my original rating.Unfortunately they  were not able to solve the issue with the Plex app -- files still appearunderscanned when played back (think letter boxes on every side of the picture). As a courtesy Amazon given that I am a PlexPass subscriber amazon offered me a credit for the cost of the app. Overall I want to say that the customer service experience while always good (fast delivery, good prices) has been outstanding in this case. Very impressive and it makes me optimistic that the problem with Plex can be resolved soon.I bought this as an alternate device to my existing Roku implementation due to being somewhat unhappy with the Plex app on the Roku.The Amazon Fire while a fast and easy to use device, does not work well (currently) with Plex. The first problem is that as a PlexPass subscriber, the Plex  app for all clients is supposed to be free; on the Fire, it is not. The second and more crucial issue is that many videos do not playback on the screen in a correct size.On the Roku for example, a 4:3 format or 16:9 format video will play perfectly with letter boxing in the 16:9 appearing as appropriate, and overscan of the 4:3 videos filling the screen nicely. On the fire, the same file is often played within a center frame leaving much of the screen space unused. eg. on a 60\" tv, a 4:3 video might be displayed in the center of the screen using 37\".Some amount of tweaking (rebooting the device), resetting the setup of the Plex app..helps..but nothing fixes the problem entirely. I'd say that the current Plex app on the fire is a waste of money..and as a PlexPass subscriber, I'm doubly disappointed.{NOTE the below is no longer valid}For non-Plex uses, my major problems with the device is that I can't seem to restrict PIN usage functions to purchases only. This makes it unduly difficult to allow kids to use the device since a variety of functions (including PIN usage) are restricted to knowledge of the PIN.Finally -- I wish there was an option to allow the box to display \"Prime Video\" only. Yes there might be occassions where I really want to purchase/rent a show, but for the most part I wanted this device as a convenient portal to access Prime Videos, Netflix and Plex. The desire of Amazon to sell/rent me video content makes using the interface very arduous since purchases choices I'm rarely interested in consistently tend to appear.", "verified": true, "helpfulness": "0/0", "author": "knightfall"}, {"rating": 5.0, "review": "My TV does not have internet capability but does have HDMI, the Amazon Fire TV works wonderfully for watching NetFlix streaming.  I have not ventured into the Amazon side of things but I can tell you that this works far better than my expectations.  I am now thinking of discontinuing my HBO and Showtime subscriptions.", "verified": true, "helpfulness": "0/0", "author": "fmcelroy"}, {"rating": 5.0, "review": "I bought this for my husband for his birthday.  He wasn't too impressed until I showed him how it works.  We don't use it as much as we should but it does come in handy for viewing old movies.", "verified": true, "helpfulness": "0/0", "author": "J. Sullivan"}, {"rating": 5.0, "review": "I hardly ever write reviews, but had to review the Amazon Fire TV.I am a huge Apple fan, but opted to buy the Amazon Fire TV because I use Amazon Prime already and this seemed like a value added proposition.I was truly amazed at how easy it was to set up the Amazon Fire - it took me (a non-techie) literally about 15 min from the time I opened the box to have it running and 10 min of that was spent moving the TV around to get the cords in place!  The instructions were incredibly easy and the remote is a joy to use compared to most of my remotes for other devices.I watched two episodes of Dowton Abbey (for free with Amazon Prime) and The Life of Pi (paid for it and it was completely painless to order) the first day all in HD.  I used the voice activated search for both and it worked perfectly (unlike the issues with Siri on iDevices).  There was zero stuttering in the streaming of the content and load time was so fast it was as if I have the content on my own hard drive.  It loaded literally instantly (unlike Netflix which can be slow or my BluRay player which is even slower) - I have never seen anything like it.I also spent some time exploring the other content and found the menu system very easy to navigate and viewing content was very easy and no lag at all when moving around in the menus.  As a fun bonus, the screen saver scenery pictures that come pre-loaded are absolutely awesome.  I left the TV on when I wasn't watching it just to see the pics.Overall, the Amazon Fire TV has exceeded my expectations right out of the box.", "verified": true, "helpfulness": "0/0", "author": "M. D. Todd \"tabascocat1\""}, {"rating": 5.0, "review": "very happy my friend told me about  amazoin fire tv,", "verified": true, "helpfulness": "0/0", "author": "Herlinde Anderson"}]