[{"rating": 5.0, "review": "I decided to purchase this after I realized that the similar features found on a Smart TV are really not that great.  My Visio Smart TV functions were slow and would often stop working.  Note I had a wired ethernet connection!  I already have a WD Live TV that I got because it is very friendly to all video formats.  The Fire unit is great.  Setup was super simple.  My favorite part is how fast it is.  The WD takes its time to perform functions and also to start up.  The Fire is instant.  The voice feature works great!!!  I would highly recommend.  It was either the Fire or Apple TV.  I am very happy with my decision.  I purchased a \"reconditioned\" unit and it arrived looking basically brand new.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fire TV Outperforms my smart TV. Another great product from Amazon. Fire TV has more APPS and a quicker response time . A great place to buy with great products too. I am an Amazon fan and supporter.", "verified": true, "helpfulness": "0/0", "author": "John R \"Mountain Fan 1953\""}, {"rating": 5.0, "review": "I talked our daughter into getting the Amazon Fire TV for her Dad for Christmas.  He totally loves it, and seldom watches anything else these days.  It was difficult to tear him away to get a little sleep over the holidays, and things haven't changed two months later.  Best bargain I ever found!!!  I don't know what we would do without Amazon.com.  Whenever we think of something we need, we just go directly to Amazon where we generally find what we need at a fair price and get it to where it needs to be in just a few days.  Go Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Terry L. Dorkins \"Angel Artist\""}, {"rating": 5.0, "review": "Great device especially for vacation homes that you don't want to pay the cable company for months you are not there! Setup could not have been easier, and using the system is so easy love the voice recognition has not failed yet except when the user failed to operate it correctly! Plan on purchasing the accompanying sling tv next and we will be all set.", "verified": true, "helpfulness": "0/0", "author": "Jk amazon user"}, {"rating": 5.0, "review": "love this...makes it so easy to watch movies & tv off prime", "verified": true, "helpfulness": "0/0", "author": "Debbie Dearing-Yoakem"}, {"rating": 5.0, "review": "Very fast, blue-tooth remote works very well, and the voice search is excellent.  Picture is beautiful.  No complaints at all.", "verified": true, "helpfulness": "0/0", "author": "Robinhood"}, {"rating": 5.0, "review": "We love this media streaming system. It works better than Roku, apple TV and the Vizio, Sony and the Samsung Smart TV's. Well the Samsung is pretty darn good. Once Amazon cathes up with the rest of the streaming world for apps I will have no complaints.", "verified": true, "helpfulness": "0/0", "author": "DanaJoy Florio-May"}, {"rating": 3.0, "review": "When it went on sale I got a new unit for $5 more and didn't unpack this one. I was considering roku-3 in addition but after reading the reviews I decided against it because of poor quality and support. Amazon support particularly chat access is the tie breaker when considering any product.", "verified": true, "helpfulness": "0/1", "author": "Richard Semock \"semockr\""}, {"rating": 5.0, "review": "Love watching movies and tv programs on Fire. Best decision ever.", "verified": true, "helpfulness": "0/0", "author": "Lori Dukes"}, {"rating": 5.0, "review": "Great device. No issues. Love the compact design and that they have an iPhone app for a remote.", "verified": true, "helpfulness": "0/1", "author": "Shannon F. Holer"}]