[{"rating": 5.0, "review": "Love it. Works perfectly!!!", "verified": true, "helpfulness": "0/0", "author": "peter guerriera"}, {"rating": 5.0, "review": "use daily", "verified": true, "helpfulness": "0/0", "author": "nothin'butthefacts"}, {"rating": 5.0, "review": "Outstanding! gift ,", "verified": true, "helpfulness": "0/0", "author": "ramona sayles"}, {"rating": 4.0, "review": "Love what is on it so far, still having some trouble with our ISP performance, occasional outage.  Hoping for more content, but very easy to use and small footprint is nice.", "verified": true, "helpfulness": "0/0", "author": "J. White \"just sayin\""}, {"rating": 5.0, "review": "This is one terrific product.  I bought it for my wife and grand kids,  I think I use it more than she does.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Best one out there!  We love our Amazon Fire TV.  Much better than Roku and Ouya!It is very user friendly!", "verified": true, "helpfulness": "0/0", "author": "Tim F."}, {"rating": 4.0, "review": "Fast, easy to use.  Wish that it was more sensitive to the remote however, which seems to really need to be pointed in line of sight to receiving end in order to work.", "verified": true, "helpfulness": "0/0", "author": "DK"}, {"rating": 4.0, "review": "When we watch the Fire TV it buffers a lot, we don't get that when I watch on the iPad or any other device we have.  It makes watching shows frustrating.  I thought it was my internet but I'm not so sure.  The quality of the pictures is wonderful and when you've waited too long I love the scenery that scrolls across the screen.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "The only reason I'm keeping this is because my parents need access to closed-captioning.I think Amazon is purposefully relying on the confusion this unit's menu causes to get people to pay for movies.  Not user friendly at all, especially for older people.  Roku is much easier to understand and know what it is you're choosing to watch.", "verified": true, "helpfulness": "1/3", "author": "courtwriter"}, {"rating": 5.0, "review": "Probably the best media streaming device on the market. Superb packaging. Excellent selection of movies and programs.Can't beat the selection of movies and programs. And it being voice activatated is a nice toy to have.", "verified": true, "helpfulness": "0/0", "author": "James F. Blake, Jr."}]