[{"rating": 1.0, "review": "I've had my fire TV for about a day.  I only bought it for Sling TV.  With the bundle deal.  Sling worked great for 24 hours total. Now I can't watch anything for more than 15 seconds. I flushed caches and rebooted and all that. No matter what I do the sling app exits after 15 seconds back to the prior screen (home ish). This is terrible. I know it's not my connection since sling works GREAT on my iPad and my mac.And my FireTV didn't come with batteries for the remote.  Not a big deal, fortunately I had 2 AAA in the fridge, but STILL.  Pretty poor.Amazon may want to choose their partners a tad better.Here's my correspondence to / from sling tv.Hi,We are sorry to hear that you have encountered these issues.  Please try the following steps and proceed to the next one, if the problem is still persisting.1) If you are using other devices for the Sling TV app, ensure that you have signed out of the app for those devices or power them off.2) Go to Sling app Settings > Connection > High quality (rather than best quality)2) Sign out and sign back into the Sling TV app.  Settings > Sign out.3) Remove the app on your device and install it again.4) Ensure the time zone in the device settings is set correctly.  Afterwards, please unplug your device for 30 seconds and power it back on.5) Update your device firmware by going to Home screen then Settings > System > About > Update firmware/Check for updates.6) Unplug your internet modem for about 30 seconds. Then power it back on.If the issue is still occurring, please contact our phone support at 1-888-893-9069 from 8:00 AM to 1:00 AM EST, and indicate that you have already tried the above steps.Best regards,Sling TV Support--------------- Original Message ---------------From: Geff [boing@boing.com]Sent: 4/13/2015 3:41 PMTo: support@sling.comSubject: slingtv on the fire tv :: nothing but failures :(Howdy all,Great service.  Love sling tv and the concept.  However runs GREAT on the ipad.  Ran great on my fire tv for about a day and now i can only stream for a bout 15 seconds or so without it exiting the application.  I've done everything (clear caches, clear data).  I have not UNinstalled the app nor reset the fire tv to defaults.  Fire tv claims ot have 4.5 ish GB available.  And my fire tv is BRAND NEW. This and VLC are my only apps.  What gives?  Specifically I'm trying to watch boobberg, but it seems to do it with everything.Thanks so much,Geff", "verified": true, "helpfulness": "1/2", "author": "Paleo Bike Nerd"}, {"rating": 3.0, "review": "When it's working, it's great!  The trouble is that we have to keep re-setting it due to \"glitches\".  We thought the problem was our internet service but it turned out to be the Fire TV.  We were getting intermittent issues with the signal.  Every time it happens, we have to turn the Fire TV off and start it again.  It's been irritating and we have wasted many hours trying to isolate the problem.", "verified": true, "helpfulness": "0/0", "author": "CJH"}, {"rating": 5.0, "review": "The Amazon Fire TV works fine and gives me the access to streaming that I want.  I use it with my Amazon Prime and Sling TV.", "verified": true, "helpfulness": "0/0", "author": "Connie Royse"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Danny Leath"}, {"rating": 1.0, "review": "I would probably like it if it would connect to my wifi, but I keep getting some sort of \"authentication problem\" which keeps it from connecting.  All of my other devices connect with a strong signal so it appears that the problems lies with this device rendering it useless waste of money.", "verified": false, "helpfulness": "2/3", "author": "Jubal H. Turner"}, {"rating": 5.0, "review": "Works Great. I wish you could speech search on FREE Amazon Prime Movies\" and get a list on the screen. And I wish the speech search worked in all the venues -- Hulu, Netflix, etc.", "verified": true, "helpfulness": "1/1", "author": "GFV"}, {"rating": 5.0, "review": "Excellent, met my expectations.", "verified": true, "helpfulness": "0/0", "author": "Hector  L.  Rosario."}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "richi3182002"}, {"rating": 3.0, "review": "I got this to use with an older HD toshiba tv but it didn't seem to want to work. For some reason the tv didn't have a resolution setting and this box was not able to recognize it automatically either. My other tv it did work on had an xbox hooked up to it, so it didn't need this.", "verified": true, "helpfulness": "0/0", "author": "ROb"}, {"rating": 4.0, "review": "Bought item by mistake to be used with a \"smart tv\". For my use, as much as I know, the smart tv does the all that the Fire TV does. So, it was returned", "verified": true, "helpfulness": "0/0", "author": "Garth F"}]