[{"rating": 5.0, "review": "Love love love Amazon TV. Have all my family's favorite shows right at my fingertips.  The voice control works perfectly,  even with my southern accent!", "verified": true, "helpfulness": "0/0", "author": "Amanda Anderson"}, {"rating": 3.0, "review": "we have a smart tv and already have the features that the fire tv offers", "verified": true, "helpfulness": "0/1", "author": "Jacquelyn Schexnayder"}, {"rating": 5.0, "review": "I bought this as a gift for my girlfriend. She's not really tech savy but she knew how to pick up on this new system surprisingly fast. Only thing that i would say is missing is a way to be able to control the volume on your own tv as well and if that were the case it would be perfect!", "verified": true, "helpfulness": "0/0", "author": "Jay E"}, {"rating": 5.0, "review": "I bought this as a Christmas gift.  He loved it...only downfall was that the 30-day trial had already passed because it was a gift.  Suggestion is that the 30-day trial be from the actual activation so that the person could enjoy it.", "verified": true, "helpfulness": "0/1", "author": "Jill Thomas"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/1", "author": "Jeffery Scott Williams"}, {"rating": 2.0, "review": "Great I don't have to use laptop anymore & radio is perfect!", "verified": true, "helpfulness": "0/1", "author": "frances bono"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Jarrod"}, {"rating": 5.0, "review": "Excellent product.  A real value", "verified": true, "helpfulness": "0/0", "author": "Michael R. Juilfs"}, {"rating": 5.0, "review": "Easy to set-up (with HDMI cable purschased separately) and easy to use (love the voice activated remote feature).  We're catching up on TV series we've always wanted to watch and playing addictive video games (using the Amazon game controller also purchased separately) via our Amazon Prime account.  I'd recommend Amazon Fire TV to anyone wishing to expand their media entertainment options!", "verified": true, "helpfulness": "1/1", "author": "Daddyo"}, {"rating": 5.0, "review": "very pleased and plan to have one on every television", "verified": true, "helpfulness": "0/0", "author": "Mona"}]