[{"rating": 5.0, "review": "Just amazing so not wanna be high tech.", "verified": false, "helpfulness": "0/0", "author": "Andrew Moorhouse"}, {"rating": 5.0, "review": "We love this thing!  I got rid of the Wii after using it for Amazon and Netflix the past year - and so glad I did.  The set up was literally a matter of plugging in the HDMI cable and connecting the unit.  I was skeptical - as we had been through the Roku box and 2 other similar media boxes- all crap.  The remote for the Fire is super sensitive to touch (which compared to even the Wii controls and other media box controls) makes it super AWESOME...including the speech feature (I was really skeptical that it would work as expected) and again...AWESOME feature.Amazon has done an incredible job with the technology and user experience of the Fire TV.  The box itself is tiny, low profile and have had no problems with Wifi signal due to location (its 3 rooms away from the router).  Excellent product- Excellent programming availability to choose from compared to any of the other media boxes.  I just cancelled my premium cable channels- downgraded to basic cable..If not for local channels and news I would probably cancel TWC all together. Tons of programming apps to choose from- including Prime- and probably end up being less than half the cost of what we paid for cable packages.", "verified": true, "helpfulness": "0/0", "author": "Honey"}, {"rating": 5.0, "review": "Love it!! I had a roku before that was starting to die and decided to go amazon this time and I love the set up! It's awesome!!", "verified": true, "helpfulness": "0/0", "author": "Leanne E."}, {"rating": 5.0, "review": "Love it. Just wish they had a couple more apps such as crunchyroll for the husband.", "verified": true, "helpfulness": "0/0", "author": "Laura Snyder"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "richard halpern"}, {"rating": 5.0, "review": "Great surround sound and easy to use.  The speed is faster than apple TV or google chrome cast.  I'm very please with it so far.", "verified": true, "helpfulness": "1/1", "author": "Rebecca Carr"}, {"rating": 1.0, "review": "did not work", "verified": true, "helpfulness": "1/5", "author": "frroggie2"}, {"rating": 5.0, "review": "Absolutely love it! Easy to figure out and couldn't be easier to use, (and that's from a 74 year old, non-techie). Due to escalating costs and a fixed income, I made the decision to cancel my Cable and replace it with this. What a smart move. Don't miss the cable at all. Public broadcasting channels and my Amazon Fire TV are more than enough and as a side benefit, I've finally rid myself of that universal Cable TV frustration..........\"Why am I paying for all these channels when I only use a few of them?\". All in all, what more could I ask for. Don't hesitate to join me in enjoying this lovely little asset, your only regret will be the same as mine......why didn't It do this sooner.", "verified": true, "helpfulness": "1/1", "author": "1972 yellow VW Bug"}, {"rating": 5.0, "review": "I haven't begun to use it to its full capability but I already love it. It will probably be the reason to let go of everything except basic cable for our household. And the voice control is really impressive!", "verified": true, "helpfulness": "0/0", "author": "Cat"}, {"rating": 4.0, "review": "Not bad", "verified": true, "helpfulness": "0/0", "author": "Greg Tobias"}]