[{"rating": 5.0, "review": "Learning a lot as to access and entertainment", "verified": true, "helpfulness": "0/0", "author": "gilbertm"}, {"rating": 4.0, "review": "My 2009 Samsung Large TV used \"widgets\" to connect to the net and allowed me to link to Amazon for movies and TV shows. Suddenly, a few weeks ago I could not connect to the net. Ultimately, I traced this fault back to Samsung and was told that because of the prevalence of apps vis-a-vis widgets, Samsumg no longer supported widgets and there was no \"fix\" at that time (and probably is none now). I checked the alternatives.and, based on reviews, the choice narrowed down to Amazon Fire TV or the latest generation Roku. The Fire has the ability to use voice for selections, etc and that is worth its weight in gold. So we opted for the Fire and have not been disappointed. It connects to the net easily and there is no apparent buffering time which makes watching movies or episodes a dream. It appears to lack some apps and, hence, I opted for 4 stars and not five. Just as a note, while we have WiFi in our home, we have long used internet over the powerline (house wiring) and connect by ethernet and ethernet speeds.  We have used the Western Digital Powerline Adapters (available at Amazon) but there are many other brands out in the market place.", "verified": true, "helpfulness": "0/0", "author": "glasslaw-texas"}, {"rating": 1.0, "review": "Purchased Fire TV hooked up and worked fine for 3 days then no sound from optical cable to amplifier. Amplifier showed it had a signal but no sound, called to technical service spent over 3 calls over 3 hrs. changing every setting possible with no results. Amazon sent out a new Fire TV hooked it up and it did not work right out of the box still no sound to amplifier. Checked Amplifier and optical cable all worked with Blue-ray & over the air TV programs. I got a reply from tec. that my amplifier is too old to work with Fire TV Dolby Digital Plus, but it did work for the first 3 days would like to know if it worked for 3 days, how did it all of a sudden become too old to work. I am disappointed that Amazon touts the fact that they are the only ones with the Dolby Digital sound and they blame my system that worked for 3 days with the Fire TV for being at fault.", "verified": true, "helpfulness": "0/1", "author": "L. Holmer \"lgh\""}, {"rating": 5.0, "review": "We had another system before Amazon Fire TV, but this one far exceeds it and any other that we are aware of.  User friendly and intuitive!  Everyone should have Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Bonnie's Mom"}, {"rating": 5.0, "review": "I was somewhat anxious about going cable-free. Fire TV & an antenna made the transition very easy. Fire TV was easy to set up & simple to use... Completely intuitive. Love my Prime & Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Annemarie D'Andrea"}, {"rating": 5.0, "review": "Exactly as advertised...Still getting to know all of the functions and programming choices. GREAT!!!", "verified": true, "helpfulness": "0/0", "author": "Michael R. Rasmussen II"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Joey, Utah"}, {"rating": 5.0, "review": "Runs very smoothly. Does everything you could want.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Okie"}, {"rating": 5.0, "review": "Easy set-up. Great user interface that's easy to navigate and the remote is laid out well.", "verified": true, "helpfulness": "0/0", "author": "CBFox92"}, {"rating": 5.0, "review": "I LOVE everything about the Amazon Fire TV! It was a breeze to set up and get it started. I love that it is linked to my Amazon Account and how convenient it is to use with Amazon features as well as other apps like Netflix and such. In my opinion, it is better than any other device that I could have purchased to use for streaming and things. Shipping was great and timely. Definitely recommend it to any and everyone!", "verified": true, "helpfulness": "0/0", "author": "Kirsten"}]