[{"rating": 5.0, "review": "This is very cool.  We had to install it on the TV in the bedroom, because our main one in the family room is a Sony projection that won't work with the new stuff.  I keep hoping for it to die, but it works great, unfortunately.I am getting used to using the Fire TV; and will use it more after summer, since we are gone most of the summer.  I will update my review later.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Went from dish network to fire tv....best thing ever!!!!", "verified": true, "helpfulness": "0/0", "author": "Dylan Cokely"}, {"rating": 4.0, "review": "While browsing Meijer for Set top Boxes I was tossed between the Roku 3 and the Amazon Fire TV. While the Roku 3 looks nice, it doesn't nearly do half the features the Fire TV does for me. It can play games, specially if you have a gamefly streaming account, its a really nice feature! And Netflix works beautifully on it. Amazon Instant Video runs very smoothly and have had little to no issues with it! I love it! I bought a controller on amazon and plan on using it as a gaming device as well! I'll update my review once I try the game's!", "verified": true, "helpfulness": "0/0", "author": "Lorri"}, {"rating": 5.0, "review": "This is great, I should have gotten this a long time ago it would have saved me a lot of money that I wasted on cable. Love it.", "verified": true, "helpfulness": "0/0", "author": "Martha"}, {"rating": 3.0, "review": "I do like the quality of the Fire TV content from Amazon.  However, we cannot get the Netflix app to work.  Have tried all of the solutions listed online and no results.  May have to return the Fire TV since one of my main reasons for purchasing it was to stream Netflix.  Can anyone help with this? I have uninstalled and reinstalled the app, rebooted my modem, Fire TV, and router, updated the Fire TV and nothing seems to work.  HELP.", "verified": true, "helpfulness": "0/0", "author": "Jane P. Goodness"}, {"rating": 4.0, "review": "Freezes at times and the remote batteries die very quickly. Either that or  my remote is defective.  Also, would be awesome if you could browse the internet on it. Other than that I love it.", "verified": false, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 1.0, "review": "I'm very disappointed to see that I would have to purchase all the channels in order to see them. I have cable in my house and I had purchased the Apple Tv previously I'm much happy with the Apple tv. Not what I expected", "verified": true, "helpfulness": "1/4", "author": "Betty"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "jason"}, {"rating": 3.0, "review": "is ..ok..still hard to operate for p2p streams", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "LOVE it ...works great", "verified": true, "helpfulness": "0/0", "author": "Lucky Rock APBT"}]