[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "andrew taylor"}, {"rating": 3.0, "review": "If your reading this I will dive straight into the fixes that are needed to obtain streaming supremacy.1- A Vudu app. Disney digital copies can only be played on iTunes, Google play, or Vudu. Obviously iTunes and Google play are out leaving only vudu As an option. You can purchase Disney digital movies on Amazon, but then you are locked to an Amazon player and it is not a 1080P copy. Amazon HD is 720P.2- Amazon needs to through in with ultraviolet. While they do have a supported Flixster app. Imagine purchasing your Blu Ray or DVD and having a digital copy show up in your video library, sounds awesome right. I literally think Amazon is leaving money on the table by not jumping into UV. They sell their fire devices to push content, and yet make that content less desirable at the same time.3- The voice search is incredible but it needs to be implemented for other apps as well (Netflix, Hulu plus, etc.). This one has to be done, I'm betting the next Roku will have it and the nexus tv already does.4- The OS needs more refinement, side loaded apps and the sleep function are buried when they could be their own menus.5-miracast is a joke. It doesn't work with android running lollipop or iOS, and your screening device doesn't sleep thus draining it's battery while you mirror.Now if your still with me I will tell you what I really like.1- The hardware is superb, only the nexus tv comes close and it is so far behind in the app game it's not really a contender.2- The remote is outstanding, there was clearly a lot of work put into it and as soon as you pick it up you'll see what I mean.3- Sideloading apps is easy (it really is just google it) and can provide some great functionality that other players can't do like Kodi/xbmc. I did side load vudu, and it works but it requires a keyboard to navigate (I had a compact Logitech laying about) but content is limited to standard definition (an effect due to DRM and not Amazon or Vudu). Im even testing out a new skin that changes the layout of the OS that is side loaded. Almost any android app can be loaded and tried.4- Gaming is actually fun, it will never replace a console, but it's not designed to. And you are not limited to Amazon's game pad. I connected an Xbox remote with a usb dongle and it works great.So in summary the hardware and aesthetics are there, the side load ability expands the capability of this unit to drive more development and expand it's usability (Hence why I purchased it over a Roku or Apple tv). The OS needs some more tweaks, more supported apps and support for existing apps and functions are needed. And Amazon needs to get on board with ultraviolet or they risk letting Apple dictate and dominate how the transition from physical media will play out like they did with music.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "no movie selection", "verified": true, "helpfulness": "0/0", "author": "Charles White"}, {"rating": 3.0, "review": "kinda annoyed the the cord isnt included for the box to the tv. it only comes with a power cord. i wouldve rather have paid more than to deal with the inconvenience of getting the box and finding out there isnt a cord and having to go back to amazon and order a cord. i think it would be a bit more efficient.", "verified": true, "helpfulness": "0/0", "author": "Joanna Arborio"}, {"rating": 4.0, "review": "I just wish it came with its own hdmi cord", "verified": true, "helpfulness": "0/0", "author": "Kassie"}, {"rating": 5.0, "review": "Change my way to watch TV!", "verified": true, "helpfulness": "0/0", "author": "Walter Fernando Busconi Lage"}, {"rating": 1.0, "review": "Video still freezing, choppy or will  not play at all. Can clean out the cache in the Netflix app to clear the problem up for a short time. This has been a continuous problem since purchased.My experience with customer service was first rate, but the product is substandard.", "verified": true, "helpfulness": "4/6", "author": "Roy D"}, {"rating": 5.0, "review": "Like an Apple TV only better! Especially if you have a prime membership!", "verified": true, "helpfulness": "0/0", "author": "arsonone"}, {"rating": 1.0, "review": "After three weeks, several trips to Best Buy for more parts and nearly $300.00 in purchases of equipment to get it hooked up, I finally got it working (kind of).  Even though I have TWC High Speed Internet, every few minutes the programs and movies stop to buffer.  Also, many T.V. programs and movies that are offered  have a charge of $2.99 up when I can get them free included in my Netflix monthly membership.  I am not including this as one of my smarter purchases.", "verified": true, "helpfulness": "6/8", "author": "Willard E. Story"}, {"rating": 5.0, "review": "I am a total newbie as far as Smart TV's, Set top boxes & TV Apps. For me, The Amazon Fire TV Box, works better than expected. I love that you can hard line a Ethernet cable to your Router, to connect to the Apps, like Netflix. I don't know why, but for me, everything WiFi, seems to die, within a year of use. As far as speed goes, this little box ROCKS! I have not ever had any movie or TV show, pause or stop to buffer data.", "verified": true, "helpfulness": "1/1", "author": "Tilepusher"}]