[{"rating": 5.0, "review": "LOVE, LOVE, LOVE my Fire TV!!!  I had a smart TV, a Wii and an XBox and always had issues streaming movies; they would suddenly stop, buffer for a while and sometimes just completely stop.  I had to get out of everything, fire everything back up and start again.  It was extremely frustrating.  I heard about the Fire TV and to make sure I would have any issues with the Internet, I got the box because I could plug an ethernet cable directly into it.  Voila!  No more streaming issues!  The picture and content are awesome.  LOVE it!", "verified": true, "helpfulness": "1/1", "author": "J. Crosbie \"JoCPPines\""}, {"rating": 4.0, "review": "all the content from Amazon works perfectly, love what they have to offer. HBOGO works about 50% of the time, i'm assuming that's more of the service providers problem.", "verified": true, "helpfulness": "0/0", "author": "choochoo"}, {"rating": 4.0, "review": "Harder to navigate than expected.  also voice search so far not very responsive.", "verified": true, "helpfulness": "0/0", "author": "cactus"}, {"rating": 4.0, "review": "Buffers a lot better than the Amazon Firestick, still loads slowly sometimes.", "verified": true, "helpfulness": "0/0", "author": "Elisabeth B Starnes"}, {"rating": 2.0, "review": "Not like my apple TV..watch ESPN is always crashing and you have to download \"apps\" like Hulu etc to watch your shows.", "verified": true, "helpfulness": "0/1", "author": "Brandon Garner"}, {"rating": 4.0, "review": "Once I got it working, I really like it", "verified": true, "helpfulness": "0/0", "author": "Herman Dreksler"}, {"rating": 1.0, "review": "Can not use as I thought from the ads.", "verified": true, "helpfulness": "1/5", "author": "R. Dean Jones"}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Paul F. Fischer"}, {"rating": 4.0, "review": "I got this mainly for my bedroom. I'm still getting use to it, loaded a few apps of my liking and still plenty of room with out the addition of a thumb drive. I also have a Kindle Fire HDX & the Fire Game Controller. I wasn't sure how to get them connected to the Fire TV but after finding the \"How To\" section it was a breeze. Once you plug in the Fire TV a little video pops up with a animated guy walking you thru the setup. Which was a nice touch and if you need to review or re-watch the video it's always there you can't accidently erase it. With my Kindle Fire HDX I can watch a movie on the tablet & TV with the fling or mirror image setup. App wise wish there was a few more available for it like my Vudu/UltraViolet but like all apps in due time they usually mod & make them capable for the popular devices. The TV Fire unit itself gets warm so if you plan on having it on for long hours you may want to make sure you have a fan going towards it. Personal opinion I wouldn't recommended getting the Fire TV TV mount due to this. But I have a smaller TV in bedroom & move it to front room sometimes. All in All I haven't had it for very long but am pleased with it, works a lot better then my Roku HD!", "verified": true, "helpfulness": "1/1", "author": "Jessy"}, {"rating": 5.0, "review": "Love the voice feature.  Easy to use.  The tech support is great when you have questions.  I purchased it in preparation for doing away with cable.  It will enable me to save a bunch of monies.", "verified": true, "helpfulness": "0/1", "author": "Rayleen Myers \"portlandrain\""}]