[{"rating": 5.0, "review": "Streams perfectly even with my less than stellar internet service.", "verified": true, "helpfulness": "0/0", "author": "Brian Post"}, {"rating": 3.0, "review": "For the price it should have included an HDMI cable.  Drove me crazy that I had to go to the store to buy one!", "verified": true, "helpfulness": "0/5", "author": "Melanie O'Neill"}, {"rating": 2.0, "review": "Nothing special. I just use it for Netflix because Amazon Prime has very few titles that are free. Remote dies every two days, even when not in use. Already tried four sets of batteries, all brand new. Obviously, my remote is bad so your mileage may very; however, Amazon wants me to send the whole thing back instead of just replacing the remote. Sucks because I bought the $40 game controller for it. Am I supposed to send that back too? Not sure I would buy again. Games are Android based, which is okay I suppose if you don't have a game box or are a very light gamer. I'm sure this product will improve in time, but like their phone, it's not quite there yet. That being said, I love Amazon as a company and they have never steered me wrong with their customer support.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I would like to know if you still need cable or dish tv in order to use  Amazon fire tv. I can usually pick up on things fast but this had me confused so I had to ask.", "verified": false, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 4.0, "review": "We've enjoyed watching movies, but the only free ones are so old and the newer ones we can rent cheaper from Red Box.  I thought there would be more free recent movies.", "verified": true, "helpfulness": "0/0", "author": "Colleen Chapman"}, {"rating": 5.0, "review": "Simply the BEST digital media player out right now PERIOD", "verified": false, "helpfulness": "0/0", "author": "Laurence"}, {"rating": 3.0, "review": "I am fairly happy with the functionality of the FireTV but am pretty astonished at two of the shortcomings.  One, there is no power switch.  The box stays on all of the time. I wish there was a way to save power by at least putting it in sleep mode.  Two, there is no volume control.  We will be buying a separate speaker with a remote because the FireTV remote lacks the capability to control the sound.  We have little kids and are currently constantly getting up to turn our speaker sound down and up.It makes no sense to me that these features are missing.  If they were there, then the FireTV would be a great product for me.", "verified": true, "helpfulness": "0/1", "author": "S. Griesemer \"austin mama\""}, {"rating": 3.0, "review": "I have had this for a few weeks now and have yet to watch one complete movie. I get kicked off, the system locks up when I try to rewind ...I would like to give this five stars and despite my current frustrations give it high marks because the picture quality is amazing, the connection process was super, super easy (this from someone who still owns dinosaur technology -- not a smart phone). What I need to try is move the receiver box to another location -- perhaps the wireless connection in the box is being blocked?A bit frustrating for now, but I think it will prove worthwhile and a way to glean benefit from my prime account", "verified": true, "helpfulness": "0/0", "author": "Judy Beaston"}, {"rating": 3.0, "review": "The fire tv itself is nifty, I felt upsaled by buying the prime memebershio for the fire tv, it works without it. Its fun to have tablet apps played on the tv, but the \"free shows\" are ok. Nothing ive fallen inmlove with.", "verified": true, "helpfulness": "0/0", "author": "Valerie Owens"}, {"rating": 5.0, "review": "Super easy to set up and start watching all your faves right away. Only request would be to let me synch with a Bluetooth keyboard.", "verified": true, "helpfulness": "0/0", "author": "MelJoh \"Bob's Chef\""}]