[{"rating": 4.0, "review": "would have given it 5 stars but voice does not seem to work with netflix.  I purchased it with my dylsexic daughter in mind.  She was excited to use womething with voice as she cannot spell.  (age 49)  acessibility is always a challenge with dyslexia.  i would buy one for her bedroom if it worked with nextflix and hulu.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "In one word, \"awesome\".. but thats not enough, because you get so much more than just a box. I particularly like the voice command on the remote. makes finding things super easy.if you have not gotten it, get it. I am ready to say good by to my cable tv.. seriously..", "verified": true, "helpfulness": "0/0", "author": "JAC_Physics_Jedi"}, {"rating": 5.0, "review": "Perfect for watching TV!", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 4.0, "review": "Fire TV is faster and has much better picture quality than my Roku 3 box. I bought the game controller and it is very similar to the  Xbox. I really love the performance, I wish you could expand the storage capacity. It only comes with 8 gigs and some of the games take over a gig. I also would like to be able to change the order of the games and apps. I waited until HBO GO became available before I purchased this, I look forward to new additional content.", "verified": true, "helpfulness": "0/0", "author": "P. M. Hobbs"}, {"rating": 5.0, "review": "Extremely easy to set up (a couple clicks and 5 minutes if preregistered with Prime). Build your Prime list on computer and then choose what you want to view easily on Fire TV. Everything is easy to find. I experienced no buffering like on pay TV and may cancel all my extras on pay TV. May buy one for each TV or explore Fire Stick. At the sale price, I got this instead of the Fire Stick and found it well worth it.", "verified": true, "helpfulness": "0/0", "author": "David L Horpedahl"}, {"rating": 5.0, "review": "great product and easy to use", "verified": true, "helpfulness": "0/0", "author": "jerry gifford"}, {"rating": 4.0, "review": "I replaced my Apple TV with Amazon fire tv and am very pleased I did. Set up was quick and easy. Voice search is accurate for Amazon content but lacks search for other applications. Not being able to voice search for Netflix content is a big minus!  I also had problems downloading my Netflix application. I called Amazon customer support and they walked me through the set up. 5 stars for their customer support.The process was to go to Apps then select Categories , select Entertainment, then scroll to Netflix and download App from here. I hope Amazon will give us voice search across all content.", "verified": true, "helpfulness": "0/0", "author": "Gary B"}, {"rating": 5.0, "review": "Love Fire TV, and I have Roku and Apple TV to compare it to. The only thing that bothers me is that as a Prime member, it seems that I start to get into a show like Boardwalk Empire as a Prime member, and then the next season costs me money. Just make it free or make me pay for the whole thing. All of the shows that do this, I've stopped watching due to this. Not paying for Prime membership and free/unfree content.", "verified": true, "helpfulness": "1/1", "author": "D. Martinek \"Book Reviewer\""}, {"rating": 5.0, "review": "I absolutely Love Love Love my Fire TV box! I purchased two boxes, both of which stream from an Internet router/modem centrally located in the home. I am technically disabled, I swear! It's a serious handicap! I can not express how simple & user friendly the Fire TV box is to install & use. Literally, you connect the HDMI cable from your TV to the box. It will prompt you to connect to your internet, a very easy process with just a click. You can go make a snack while this is going on. My boxes were already linked to my Amazon Prime account when I received them. The remote control has only 7 buttons!! It has a voice command option as well! You use the remote to search tons of movies, TV shows & apps & just click select. Purchasing apps that have a monthly cost such as Netflix or Hulu Plus is easy because it is linked to your Amazon account so payment is already set up. However, there are many options with no additional cost. We went from spending $240 a month for cable to $7.99 a month for Netflix & $7.99 a month for Hulu Plus! There is no monthly charge for Amazon Fire TV. We have two teenagers who I thought would die when we ditched our cable TV for Amazon Fire TV,  but they love it! We honestly dont need cable. Everything we want to access is on Fire TV. I would like to see ABC news & HLN headline news on Fire TV eventually but for right now, we can access CBS news live as it happens. My husband enjoys sports and you can stream ESPN channels for free! I really enjoy being able to watch entire TV series in order of the seasons without DVR. There are so many TV series that I missed when we had cable but now I am able to go back and watch these series from the very beginning and at my leisure. I highly recommend this product as well as Amazon Prime to go along with it. Although you do not need Prime to use Amazon Fire TV. Amazon Prime offers thousands of free movies, rebtals, & movies to purchase at your fingertips, and it pays for itself at $99 for the year if you buy from Amazon alot which I do, because it gives you free 2 day shipping on all your purchases. Again, it is completely optional.", "verified": true, "helpfulness": "3/4", "author": "Audrey Ramos"}, {"rating": 5.0, "review": "Gift", "verified": true, "helpfulness": "0/1", "author": "Darlene"}]