[{"rating": 4.0, "review": "Overall, I'm happy with this device. Organization is okay, but could still stand improvement. Amazon should also work to ensure all apps function properly. For instance, I was pleased to see a BloombergTV app with a Live feature, but the Live feature crashes every time it is launched. User feedback indicates this has been a problem for some time, with no apparent response or fix from Bloomberg. Amazon should work with Bloomberg to ensure this valuable app is working properly.I would also like to see an option to surf the web. My GoogleTV device has such a function.", "verified": true, "helpfulness": "0/0", "author": "L Keith Jordan"}, {"rating": 2.0, "review": "Didn't seem to be particularly compatible with my wired ethernet (more difficult to setup than any similar device I've used), plus it didn't seem to work as well through my receiver as the Roku 3 does.  Had hoped for an improved experience, but once I finally got it all set up and tried to stream recent Jack Ryan movie via Amazon Prime, I just got a jerky picture (and when I tried streaming the very same video with the Roku 3, just nice and smooth).  So has potential, but still a few kinks to work out before I'd be able to use it in my system (and no I'm not about to replace my receiver to make that happen; plus also I do have pretty significant bandwidth nowadays, haven't had much of any issues with it using Roku).", "verified": true, "helpfulness": "0/1", "author": "frankdog"}, {"rating": 5.0, "review": "I love this Amazon fire tv, it saves all my shows and has a lot more for Me to choose from.", "verified": true, "helpfulness": "0/0", "author": "emerald white"}, {"rating": 5.0, "review": "More than meets what I wanted--Love Harry Bosch!!", "verified": false, "helpfulness": "0/0", "author": "Linda Wilson"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "James Hunnicutt"}, {"rating": 5.0, "review": "Bottom line: You will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "BC HAND"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "asad"}, {"rating": 5.0, "review": "I love it.  I find new features everyday.", "verified": true, "helpfulness": "0/0", "author": "S. Siciliano \"pet lover\""}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Daniel J. Cain"}, {"rating": 4.0, "review": "I like the Fire for all of the options that it has.  It is teeny and almost disappears in the entertainment center which is nice.  The apps are a nice feature but when streaming Netflix it is definitely slower and more prone to freezes than when i use my XBox to stream.  Picture quality is slightly lower than on the XBox as well.  The remote is great though.  Good sensitivity and nice and intuitive controls.  I also signed up for the sling 3 month trial to get the discount and it is a pretty nice service.  I am not sure that I use it enough to justify the $20 a month, but if you are huge fans of the channels it has you will likely use it a lot.  Overall I am happy with the purchase, I just hope it stops lagging on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]