[{"rating": 1.0, "review": "Even after several long sessions with Amazon Fire techs the Fire continued to have a double screen that could not be cleared. Frustrating.", "verified": true, "helpfulness": "1/3", "author": "Patrick J. O'Leary"}, {"rating": 5.0, "review": "HELLO PANTS! No It is Amazon Fire TV - I LOVE IT!!!! Gary Busey Commercial- Just a Bonus!!!! Easy Set up too!", "verified": true, "helpfulness": "0/1", "author": "Rhonda"}, {"rating": 1.0, "review": "The advertizing would make the buyer believe that you could just plug this device into your tv and computer and off you would go into the land of happy times.  In reality you need addtional equiptment for wireless hook-up which I didn't have.  My ISP was consulted and gave me the bad news that it wouldn't work with my existing modum.", "verified": true, "helpfulness": "4/9", "author": "Darrell K. Phillips"}, {"rating": 5.0, "review": "It's plug and play, easy navigation, the voice control is fabulous with no \"training\" of the control.Love it.Buy it.Now.", "verified": true, "helpfulness": "0/2", "author": "Alaskan at Heart"}, {"rating": 5.0, "review": "Love it! Love the talking feature. The only thing is it has to be out in the open or the signal gets blocked.  So I had to put it on top of my TV Stand which is kind of annoying.  And I'd like it if the remote lit up.", "verified": true, "helpfulness": "1/1", "author": "LP \"Misc. Buyer\""}, {"rating": 5.0, "review": "True, you can stream-line Amazon instant video on certain devices and consoles; however, the quality of the picture beaming from Fire TV, the voice control and the gaming is an absolute must have to truly experience Prime.  I'm hooked!", "verified": true, "helpfulness": "0/0", "author": "Twharr"}, {"rating": 5.0, "review": "I bought this for my kids and they love it. Really easy to set up and use. Had it up and running in about 15 mins. Just wish it had an off switch because it seems to freeze occasionally and we have to unplug it and plug it back in. It always starts right back up and works fine for a few days after. We started just unplugging it now to save energy anyway.Prime has a ton of movies to pick from. We also have netflix which was easy to set up. Haven't loaded any games yet. Movies I had purchased previously were automatically in my account and purchasing new movies is a snap. Almost too easy for the girls.", "verified": true, "helpfulness": "0/0", "author": "M&A;"}, {"rating": 2.0, "review": "This Fire TV has great potential.  I don't understand why more testing was not done to be sure it actually works.  They sent me one and it did everything but stream video.  It took me to the movie page and let me click to start but nothing ever happened.  I could fast forward and see the fast forward moving in a box on the bottom left but that was it.  Pandora worked great!  The Helpdesk couldn't figure out how to make Streaming Video work.  Spent an hour on the phone with an Amazon Tech who by the way was very nice and as helpful as she could have been.  I believe there are many TV sets that this contraption is not compatible with and I also believe Amazon is using the market place to test them.  Don't waste you time, I believe it is a crap shoot on whether or not it will actually work when you get it.", "verified": true, "helpfulness": "2/4", "author": "Buckeyeinflorida \"Tom\""}, {"rating": 5.0, "review": "Replaced The Netgear version.  Have bought three so far.  Works well with our wireless.  They also have the voice recognition...", "verified": true, "helpfulness": "0/0", "author": "C. Bates"}, {"rating": 5.0, "review": "I like it. Easy to set up, easy to use. I have seen complaints about the voice feature, but i am fair near to certain that it beats tbe one you didnt have before. Its a great little streamer. i have no problem giving it 5 stars", "verified": true, "helpfulness": "0/0", "author": "Bill Brookover and Luanne Brookover"}]