[{"rating": 1.0, "review": "didn't like it", "verified": false, "helpfulness": "1/4", "author": "Frank Soriano"}, {"rating": 4.0, "review": "I'm enjoying it, great picture, sound, and easy controls. If it had a browser it would be perfect", "verified": true, "helpfulness": "0/0", "author": "Walt Flannigan's dog"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Lisa Patterson \"Chocolate Maven\""}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Anthony J. Ferreira III"}, {"rating": 5.0, "review": "Hands down - Great!This device may not be perfect but for it's price and performance you can't beat it.  It's a game changer for the market.I use it personally to watch a very large media collection on Plex.  My family uses it for gaming and on demand content from Amazon Prime, all day every day.This thing really is a great device with an unlimited potential thanks to it's extreme hardware advantage.", "verified": true, "helpfulness": "0/0", "author": "IPPhoneGuy"}, {"rating": 5.0, "review": "Is Amazon on its way of one upping Apple>>>> I think YES", "verified": true, "helpfulness": "0/0", "author": "KaiKai"}, {"rating": 5.0, "review": "I give the Fire TV 5 stars for many reasons. The first and most important reason for a 5 star rating is the support and product guarantee included with the purchase from Amazon.com. Additional reasons for giving 5 stars include above competitor average: Processing Power, RAM , Stability,  Functionality, and Ease of Use. Even though I rarely use the Fire TV due to living an active lifestyle, I do enjoy the extra functionality of gaming and screen mirroring all packaged up with a video streaming device. My favorite feature is probably screen mirroring the Kindle Fire HDX tablet to the Fire TV. The final and also very important reason for giving the Amazon Fire Tv a 5 star review is due to Amazons well known prime shipping process. (Free, Fast and almost Flawless).", "verified": true, "helpfulness": "0/0", "author": "ALL IN FMX_Justin Ivie"}, {"rating": 5.0, "review": "This box rocks!  Linked right to my Prime account and I can watch all my shows on the TV.  I wish they would add an auto play feature to continue playing episodes in seasons, or allow you to make a playlist.  I like leaving the TV on while sleeping, and now I wake up and the box has shut itself down.  But other than that LOVE LOVE LOVE it.  It's fast, I haven't had any issues streaming video to it, I plan on buying the game controller as soon as possible and trying out a few of the games.  If your thinking about this, don't waste time thinking just get it, it's worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Glock232"}, {"rating": 5.0, "review": "Love it wished, they would allow side loaded apps to show on the main screen.", "verified": true, "helpfulness": "0/0", "author": "Cristian Gitej"}, {"rating": 2.0, "review": "Received as a gift, I had recently bought a different brand, unknown to the person giving me the gift. I really like the remote on the other brand because of the headphone jack in the remote. Amazon get a headphone output on your remote ,, it will help,, alot.", "verified": true, "helpfulness": "1/3", "author": "sightsandsounds"}]