[{"rating": 5.0, "review": "I LOVE this system!  I had an Apple TV on this TV but bought this one so that my grandson could play games in this room without having to add another bulky gaming system.  I thought it would be equal to or less thanApple...I was wrong.  This is SO MUCH BETTER!  It's easier to use; I have had no dropped service; & it has voice recognition!  Buy this, it's a winner.  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Mary Ellen DeBold"}, {"rating": 5.0, "review": "Very good hardware with tons of option. If you want to get the most out of it (and cancel cable) you have to install XBMC on it. It is fairly simple (if you are somewhat techy). XBMC just adds SO MANY more options.Personally, the only thing that bothers me is the fact you can't add memory to it (USB port does not allow to add memory, yet) so I am always afraid I will eventually run out of memory (XBMC with ALL upgrades is around 1.5Gb).If you want to play games and you don't currently own a gaming system, this box actually has some very good options (impressive). You can use an Xbox controller with it as well. (I heard you can use PS3/4 as well but I haven't tested it myself).I bought 2 of these and I couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Daniel Nefi"}, {"rating": 5.0, "review": "Easy to set up and use.  Streams excellent picture.", "verified": true, "helpfulness": "0/0", "author": "Jan Nordell"}, {"rating": 5.0, "review": "Works better that I hoped! Let me start by saying I don't usually read all reviews, if I had I probably wouldn't have bought it, with the problems I read with Netfix. I'm glad I didn't read them till after I bought it and had problems with Netflix. Let me start I'm one of those people who don't read all of the instructions I usually go to the quick set up guides. First it set up real easily, till I got to Netflix App that wouldn't load. I replace my old Roku with this new Amazon Fire TV, but had problems loading the Apps. After going to the site and read the reviews then the instructions it worked! Those of you who have problems with Netflix you need to update system software! Goto to \"Settings/System/About/Check for System Update. Once it updated, which I thought it did when I installed it. It worked! This is very impressive system so far. Amazon needs to get to update system easier, other than that it is great! I have two other TVs with Roku when I'm ready to upgrade them it will be FireTV. Thanks", "verified": true, "helpfulness": "0/0", "author": "Joseph R."}, {"rating": 4.0, "review": "Performance is great.  The response time is great, much better than any smart TV's native app.  I only use it for Nexflix and one feedback that I have is that they should enhance Netflix menus to mimic Netflix website - mean better search capability.  I'm guess that since Netflix is Amazon Primes competition, it may not be in their best interest.", "verified": true, "helpfulness": "0/0", "author": "N. Son"}, {"rating": 1.0, "review": "Remote didn't work, 2nd remote didn't work and box never worked with NetFlix..back to the Roku..", "verified": true, "helpfulness": "3/7", "author": "AtomicPunk"}, {"rating": 5.0, "review": "This is a good product, I use it more than wife she just got to have her live shows per say, so I guess we will stick with both, I just got a HDX 7 Amazon tablet so now I can watch my prime movies on this while she is watch the big TV and her shows. Don’t expect to get anything current on these streaming devices like Amazon,Roku and Apple TV's. The content that’s on there suits me, I am happy especially with the Prime account I have with Amazon.Update the software once you get this up and working, for awhile i couold not figure why when i try to cut the device on with the remote it would not come on had to each time unplugg the device and do a reset. Since i updated the device in the settings I have no more trouble with the remote.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Works very well, could be a little more intuitive for streaming live TV, haven't figured out how to do that yet.", "verified": true, "helpfulness": "0/0", "author": "Kelly Goldberg"}, {"rating": 5.0, "review": "This device works exactly as I expected.  I particularly like the size of it and the remote - smaller and not clunky looking, while not too small that you have difficulty using it.  It is very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Bonnie L. Schafer \"Yankee Southern Girl\""}, {"rating": 4.0, "review": "Thumbs up...!  Took all of 5 minutes to install and setup and I was watching my favorite shows.", "verified": true, "helpfulness": "0/0", "author": "Mike Urban"}]