[{"rating": 5.0, "review": "easy to set up and use", "verified": true, "helpfulness": "1/2", "author": "G. Doyle"}, {"rating": 1.0, "review": "Having been a longtime Amazon customer, I was excited to see the Fire TV available as I was in the market for another WiFi streamer for our second tv (the first tv using the Roku LT).  Setup started off pretty easy...it seemed to have picked up my WiFi point, a reasonably strong three bars considering how far the tv was from the router, but that's when the wheels fell off the cart.  After supposedly finding and connecting to the WiFi access point, it proceeded to do a system update but it never got started.  The progress bar sat at one or two clicks before freezing.  A message popped up saying that the update could not be completed and the only solution was to unplug the Fire and plug it back in and start over.  Well, every time you do that, you had to go through the connection process all over again (including inputting our interminably long WPA password).  After three tries, I decided to move it to the tv closer to the router, thinking it may have been the distance but got the same result.  All told, I must've had to re-enter the WPA password ten times because the Fire would never hold the connection during installation.I don't know whether or not the update server on Amazon's end wasn't accessible for whatever reason, but it's ridiculous to have the user get kicked out and have to unplug the device AND re-enter the connection information.  Why couldn't have let me access the Fire's older system and update at a later time perhaps?  Very disappointing.  I returned it and am just getting another Roku, which I've never had a problem with.", "verified": true, "helpfulness": "3/5", "author": "R. Perry"}, {"rating": 5.0, "review": "So amazing have to try it. Love it. Easy to use. Fun and simple. Glad I purchased it. Wouldn't want to do without it.", "verified": true, "helpfulness": "0/0", "author": "Melinnee Mastel"}, {"rating": 5.0, "review": "Wow. Leaves Roku in the dust.", "verified": true, "helpfulness": "0/0", "author": "coffeenow"}, {"rating": 5.0, "review": "We were drawn by reviews and the fact that it included Netflix, which we love. There are many more broadcast offerings than we anticipated. Unfortunately many of then require paid subscriptions or per-broadcast fees so we've only used Netflix and the free stuff. We also have a Vizio TV with direct internet capability on-board. The Fire was to provide connectivity for a non-internet TV.Installation was very easy. We have standard internet service from Time Warner with a wireless router, and it isn't enough if we are also connected to the internet with a laptop and/or the Vizio in another room at the same time. The Fire can't get enough bandwidth/speed and one or more of the devices stalls. That's a signal issue - not a Fire issue. We'll have to upgrade our service with Time Warner, or go to ethernet connection, and/or disconnect devices during peak hours. If you have just one device running you should be fine.", "verified": true, "helpfulness": "0/0", "author": "Silky Sam"}, {"rating": 5.0, "review": "It met all my expectations and I love it.  It was extremely easy to install.  The voice search feature is great .  It's amazing to me how I can start a movie on my Kindle Fire and just switch it to my Amazon TV function so easily.  And a side note - it has screen saver photographs that are mesmerizing.  I find myself just staring at them trying to figure out if they're real and where they're taken.So I replaced the router that I never got to function with the Amazon TV and couldn't be happier.  I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "camartha \"avid reader\""}, {"rating": 1.0, "review": "I bought Fire TV for my second TV after having a very satisfying experience with Apple TV. Thought Fire TV would be better with my Prime membership but I was wrong! It's been only two months but I'm already having a big trouble with it. All of a sudden it doesn't play any videos of Hulu, Netflix and Amazon Prime while YouTube and Pandora apps seem to work fine. (Internet is connected; account is registered; and all data of apps were cleared and reinstalled several times!) When I played any video, it kept showing a message telling me to contact the customer service so I've requested a call through FireTV twice since last week but hasn't received any. Do I really have to reset it to factory settings? And how? What a big pain!", "verified": true, "helpfulness": "1/3", "author": "appletree"}, {"rating": 5.0, "review": "Easy to set up; easy to use. The voice feature is a nice add-on but what's best is being able to search various providers from one place. We used it at a beach house and it worked great with an average wifi. Would like to be able to cast from an iPad, but otherwise, an excellent product for the family.", "verified": true, "helpfulness": "0/0", "author": "Hank from Houston \"Hank from Houston\""}, {"rating": 4.0, "review": "the remote is bluetooth, hooking to multifunction remote needs additional hardware.setup was easy.do not set it up with plain monitor ( like computer monitors which have hdmi input, as it would not work, or to dvi to hdmi convertor connection)there is a whole section of help forum as the screen goes blank after initial spalsh screen.", "verified": true, "helpfulness": "0/0", "author": "KRS"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "Brodie Gerrard-Gough"}]