[{"rating": 5.0, "review": "Everyone should have one.!!  They really give us a lot of entertainment. So glad we got it.", "verified": true, "helpfulness": "0/0", "author": "Peggy Okeeffe"}, {"rating": 3.0, "review": "We debated between the Amazon Fire TV and the Roku 3. We've had it now for a couple of weeks. I have to say I wish we would have gone Roku 3 route. We had the Roku 1 before this. It was so easy to navigate through that my five year old son used it without any difficulties. He was always able to find what he wanted to watch without having to have help from an adult. The Amazon Fire TV is a little more difficult to navigate though. The icons are smaller making it hard to find what you want. I thought the voice control would be a nice feature and it is helpful as far as all the Amazon Prime stuff goes, but when we want to watch Netflix it's hard to find the icon and then again when you get into Netflix to navigate through the movies about two thirds of the screen is taken up and you are left with only about 1/3 of the screen that actually show the movie selections. They are, again, really small so it's hard to see what it is you are watching without getting closer to the tv. Also, and this may be a connection issue, when watching a show during the middle of it it sometimes freezes up. It doesn't take that long to fix itself and start playing the movie again, but it is enough to be annoying. Like I said that may be a connection issue, but we never had that issue with the Roku. Hindsight we should have just went with the Roku 3. It's easier to navigate and we didn't have freeze up issues. That being said we still have a few days to return our Amazon Fire TV, but we most likely will stick with it. In time I am hoping it becomes a little easier to use for both the adults and the kids.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "save your money product I have owned over a year. gets old. Product does work and simplifies some of the process.", "verified": true, "helpfulness": "0/2", "author": "Barney"}, {"rating": 5.0, "review": "I love it.  Watch all of my favs without commercials whenever I want.  I am so glad that I joined prime and got Amazon fire tv.", "verified": true, "helpfulness": "0/0", "author": "Gyotarosan"}, {"rating": 5.0, "review": "It is all that is advertised.  Very pleased!", "verified": true, "helpfulness": "0/0", "author": "kerry fridley"}, {"rating": 5.0, "review": "Love this device it is seamless, limitless possibility's will buy more in the future. Ive owned my Fire TV since Christmas 2014 and as of this moment there is nothing out there that can compare to this device, I own 4 other TV boxes and hands down this is the best one I have, that is why i have it hooked up to my main big screen TV in the living room. Thanks to the updates I have a USB storage hooked up for more space which was one of my complaints but Amazon Fixed it and they continue to improve on the firmware. If you are considering buying one of theses android TV boxes you will not be disappointing amazon nailed it the first go out!", "verified": true, "helpfulness": "0/0", "author": "MJacob"}, {"rating": 5.0, "review": "This came in a timely matter. So far the Amazon fite TV is living up to our expectations. We hope to eliminate cable soon.", "verified": true, "helpfulness": "0/0", "author": "Colleen V."}, {"rating": 5.0, "review": "Terrific!", "verified": true, "helpfulness": "0/0", "author": "J.D. Holmes"}, {"rating": 2.0, "review": "not yo many movies that are free.", "verified": true, "helpfulness": "0/4", "author": "Elaine Garcia"}, {"rating": 5.0, "review": "I love  Fire TV... Easy to use....", "verified": true, "helpfulness": "0/0", "author": "Sharon R Patrick"}]