[{"rating": 5.0, "review": "Sorry that it's a review but I don't know how to ask questions.A) what's the difference between this and the stick?B) does this have nickelodeon and cartoon network?", "verified": false, "helpfulness": "0/1", "author": "Michael Perkins"}, {"rating": 1.0, "review": "I hate the ads for this junk on Youtube.....", "verified": false, "helpfulness": "1/7", "author": "Rawr"}, {"rating": 5.0, "review": "Easy setup.  Just plug in and start watching.", "verified": true, "helpfulness": "0/0", "author": "Stacy Walters"}, {"rating": 5.0, "review": "Like this way better than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Daryl Thietje"}, {"rating": 5.0, "review": "I've only had it one week but so far it is great. I like that it works well with my kindle. I haven't done much gaming so I cannot comment. One grip so far is that I wish you could \"pin\" certain apps to favorites or something so they are easier to access. The voice search is nice but only will work for Amazon content (doesn't work with Netflix).", "verified": true, "helpfulness": "0/0", "author": "frank"}, {"rating": 5.0, "review": "Love Fire TV, it's better than we ever expected, fun, fast and very easy to use, will be replacing Direct TV after football season!!!", "verified": true, "helpfulness": "0/0", "author": "Brian Bradley"}, {"rating": 5.0, "review": "This is the best thing to happen to our TV.", "verified": true, "helpfulness": "1/2", "author": "Leslie Koorhan"}, {"rating": 1.0, "review": "I am disappointed with Amazon and expecting some kind of answer. I purchased Amazon Fire TV because I've come to do almost everything through Amazon. But, come to realize Amazon Fire TV has no content or Close Caption in SPANISH- 16% of the U.S population is Hispanic and many more speak a second language- having no option/ content in Spanish (and many other languages) to me is a blunt racist move. I called twice customer service, and while the customer care representatives were very helpful, they couldn't say more than \"I'm sorry.\" I am disgusted and considering not only returning my product but closing my Prime and Audiobook membership. Our president acknowledges us and you don't Amazon? come on.", "verified": true, "helpfulness": "1/9", "author": "marisela"}, {"rating": 2.0, "review": "Nice to have free movies.  Not enough games.", "verified": true, "helpfulness": "0/2", "author": "AIMastermind"}, {"rating": 3.0, "review": "its ok but you still have to make a lot of purchaces to see series,movies,etc,games as well,,tokens", "verified": true, "helpfulness": "0/2", "author": "theodore lindner"}]