[{"rating": 5.0, "review": "I have streamed content using XBox 360, Samsung Blu-ray players, Roku, Apple TV, Chromecast, and OnDemand from providers like Cox, Verizon FiOS, and DirecTV. I'm a software engineer and a tech enthusiast who enjoys playing with the latest gadgets. I've also used Netflix and Hulu Plus, but I've used them sparingly.I realize that the devices/services listed often have different primary purposes and each has their own pros and cons, but the FireTV has provided, by far, the best experience for streaming video content. Here are my reasons:* Fast/smooth when navigating menus and watching video.* Voice search actually works, and works quickly.* Video quality is great (1080p).* Content library is extensive and free prime content is great for my family's viewing.* Content terms are better than the competition. We just rented an HD movie for $3.99, and that gives us 72 hours to watch. Apple TV is more expensive and limits to 24 hours. FiOS on Demand is typically at the same price as Amazon, but only gives 48 hours.My wife's father, a novice tech user, was able to find and watch his westerns. I helped with the first one and he was able to take it from there.Here is my short wishlist of enhancements:- Filtering search results by prime.- Better integration with rating services (e.g. rotten tomatoes), to allow me to better understand the ratings on content- Trailers to preview content before renting/buying.These wishlist items are minor and don't keep me from recommending this device over all of the others mentioned. 5 stars from me and my family!!!", "verified": true, "helpfulness": "1/1", "author": "Todd"}, {"rating": 2.0, "review": "I was seriously disappointed by the lack of surround sound support. I wanted to use this for streaming from plex and other sources, but the box only supports 5.1 from mp4 containers and one particular encoding. When I looked through my library I didn't even have any of those. No DTS, mkv, 7.1, etc etc. Might be fine for games, but this is really poor. The hardware is probably not at fault. The problem is android not supporting 7.1, Amazon not paying royalties for dts, etc. Installing xbmc got a working environment for all encodings except 7.1 (android problem), but using xbmc on this thing is pretty ugly user experience wise so back to roku 3. Every playback just works on the roku 3, although it has some encoding limitations they are extreme cases (DTS-HD MA).To make matters worse all the audio transcoding caused the plex experience to be poor. FF/Rewind rarely worked and the thing would get confused about where we were in the video. Overall, not good for watching your own content and I cannot recommend this at all.", "verified": false, "helpfulness": "0/1", "author": "Steve"}, {"rating": 5.0, "review": "!5 minutes or less from opening the box to watching Amazon Instant Videos. About another 20 minutes to get Netflex and Hulu Plus going. Great picture, superb audio and simple enough to use that my technology challenged wife can prowl the available programming. Ten thumbs up is my rating.", "verified": true, "helpfulness": "0/0", "author": "Oldman"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Tom Gunn"}, {"rating": 5.0, "review": "this device functions the same as the Apple TV..I have one of those too.....this was plug and play just make sure you have an HDMI plug. I bought my HDMI plug from Amazon for $5.99. I love it......the pictures are crystal clear and I can access everything I have online in my prime account including music, videos, games, and more!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Cassandra Smith"}, {"rating": 3.0, "review": "The fire tv is great for people with or without a smart tv. But the app's side of things is made almost pointless by the lack of storage and unable to increase storage. two high profile games like grand theft auto and your device is full. AMAZON please allow usb storage", "verified": true, "helpfulness": "0/1", "author": "Gareth Parkman"}, {"rating": 5.0, "review": "Runs kodi like a champ", "verified": true, "helpfulness": "0/0", "author": "Beri"}, {"rating": 1.0, "review": "Well first of all it would have received a 4 star review if the voice function worked in other apps like Netflix! BEWARE!! It kicks you out of the Netflix app every time and brings you back to Amazon which seems to charge for movies that are 11 years old. What good is having Prime other than 2 day shipping!! I checked/Voice command multiple movies from 2 years old and one 11 years and there was a price tag of $4 to rent. Really... Gladiator is 11 years old and it should be free with Prime.If you have a slew of money to spend on movies then it is for you.. THE VOICE COMMAND is AWESOME IF YOU ONLY CARE ABOUT THE Amazon part of the device. Really considering returning it and would have never bought it if I new ahead of time about the voice feature that only works in Amazon..", "verified": true, "helpfulness": "0/1", "author": "Mike M"}, {"rating": 5.0, "review": "Works greatfantastic audio.", "verified": true, "helpfulness": "0/0", "author": "Traveler H G \"H G\""}, {"rating": 5.0, "review": "It is a little difficult to setup Netflix but once that is completed everything works great and has a wonderful processing speed.", "verified": true, "helpfulness": "0/0", "author": "Amber L. Duffin \"amrunner27\""}]