[{"rating": 5.0, "review": "For Christmas I picked up the Amazon Fire TV Stick and figured I'd give it a try. I enjoyed it so much, I decided to upgrade to the Amazon Fire TV. Setup is wicked easy - you plug it in, setup your WiFi and you're good to go (if you purchased it for yourself, it's already linked to your Amazon account). I've used Amazon Prime for years, so this just makes it even easier to access Prime and videos I've purchased through Amazon - not to mention my music! So here's a layout of pros and cons to Amazon Fire TV (and Fire Stick):Pros:1. Easy access to Amazon streaming2. Both Fire TV and Fire Stick save where you were in each video you've started so you can easily resume viewing (even from device to device).2. Prime music and videos - Yes, you can do this from your website, but I like freeing up my PC for gaming/writing.3. Apps - gaming is better on Fire TV vs. Fire Stick. Fire TV handles bigger games more smoothly, plus it has more storage for Apps4. Both Fire TV and Fire Stick are easy to transport when travelling.Cons:1. \"Internet Connection - Signal Strength Strong - Unable to Connect to Internet\"  I've run into this a few times with both Fire TV and Fire Stick - for no apparent reason. One minute it's fine, next, boom, \"Unable to Connect to Internet.\" The first time it happened with my Fire Stick, I did tons of searching (because my Internet was still up and running...) and found that rebooting the Fire Stick often fixes the issue. Although I found that to be true in my case, a few times it took several reboots (search for the proper reboot method using remote or simply unplug for 10-30 seconds).This is really my only frustration with both products, but luckily, it doesn't happen too frequently - although more with the Stick than Fire TV. With both, I had this happen within the first 24 hours of use.", "verified": true, "helpfulness": "3/3", "author": "TMB"}, {"rating": 4.0, "review": "Amazon Fire TV nicely does what it advertises.  I like the options available and to view videos and TV at my convenience.  It is very easy to set up and up and running in only a few short minutes.  I just need to upgrade to a faster high-speed modem so that I don't endure the buffering from time to time.  Still, a great little system that offers a wide array of online entertainment right on your big-screen TV.", "verified": true, "helpfulness": "1/1", "author": "GenieP \"Genie in SF\""}, {"rating": 4.0, "review": "A lot of good movies come through prime. Love this.", "verified": true, "helpfulness": "0/0", "author": "C. SINN"}, {"rating": 3.0, "review": "I found after using this for about a month that I preferred the Roku2 which I was using before. I watch either Netflix or Amazon Prime shows. In both cases the tv screen is filled with image/clips from the shows on my watchlists, suggested shows, recently watched shows (including shows that I had deleted from the lists because I had watched or had rejected them).  I found these multiple choices confusing and not helpful. The back and forward control, supposed to move 10 seconds per push, only worked in Amazon. In Netflix it created a difficult to control fast forward or fast back. There were moments in watching a show where there would be slippages--the video would seem to slip or the audio and video would disconnect briefly. These never lasted very long, but were noticeable and slightly annoying. Many of the special features, like voice search worked only within Amazon, as far as I could tell.  I prefer the simpler interface available in my old Roku2 box.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer \"Richard Woodworth\""}, {"rating": 5.0, "review": "Awesome little box, smokes AppleTV", "verified": true, "helpfulness": "0/0", "author": "Jeremy Jackson"}, {"rating": 4.0, "review": "The fire TV stick is wonderful and has allowed me to cut cable (or in my case Directv) out of my life completely.Pros: (1) Its fast and responsive.  (2) What apps are available are nice and have well designed interfaces. Netflix is particularly nice.  (3) The remote is rudimentary but serviceable. It has the voice search feature, but I haven't found the desire to use it beyond the intial testing.  (4) Streaming your local content works amazingly well.  (5) Amazon Prime Music is a really nice feature but its UI is horrible.Cons: (1) The UI is horrible. There is no way to search for Amazon Prime Videos, forcing you to go to the website, find the movie, add it to your watchlist, and then return to the Fire Stick and watch the film. This is incredibly frustrating and grounds for dismissal for whoever had this idea.  (2) The confused nature of the UI is carried on throughout the Amazon portions of the box. The Music feature is nice but incoherently organized. You can't simply select Artist from your available purchases. Again, fireable offense.  (3) There are a wide variety of TV apps that are not available for the Amazon ecosystem but are available on the Play Store. Undoubtably this has something to do with Amazon's deal with Sling TV but it hurts the vast majority of users.Note: The Fire Stick is open to sideloading apps for those in the know and this allows many of the TV apps that be installed. The only problem with this solution is that they will not appear in the recently used bar and the remote will not function properly. The remote problem can be fixed with a third party remote app.", "verified": true, "helpfulness": "0/0", "author": "STL \"Sid Littlefield\""}, {"rating": 5.0, "review": "LOVE Fire TV! may ditch my cable  now", "verified": true, "helpfulness": "0/0", "author": "L. M. Duncan"}, {"rating": 4.0, "review": "PROs1. Box came pre set-up for my amazon account. Very cool- but do they do that if you send as a gift?2. Device itself is thin and small. I placed it on top of a Bluray player and from the couch can barely see it.3. It's fast. Maybe it seems so fast because the Panasonic Bluray I have been using to stream is SO SLOW. But this starts fast, loads/buffers almost instantly, and scrolling through movies as fast as I can push the button.4. All the apps I need- Amazon Prime Video, Netflix, Youtube [Watched Willow free on Youtube]. Hulu and others are on there but, I don't use them.5. Picture quality is  fantastic6. The remote is easy to use, and is about 1/3 the size of my other remotes. Very light weight,  but does not feel cheap.CONs1. If you are in an app like Netflix and use voice search, the result is for Amazon Prime. On Netflix you have to manually enter the search into the Netflix search box. Not a deal breaker but inconvenient.2. As others have reported, Sound quality can be spotty from time to time. I have only had the issue once so far- I put the box to sleep and then unplugged the power for a few seconds. That seemed to fix it. I had already tried a different HDMI cable and HDMI ports and different movie to make sure it was the device.3. I have been looking for a single device for a while for streaming.  This is as close as I have been able to get - and although it will stream youtube, Google play has been left off. I don't have many movies on Google Play- but they do give titles away several times a year. I am also using all 3 HDMI PORTS already so Chromecast is in the endtable for now.Overall-Very satisfied with the performance and abilities of this cool little box. We have been considering \"cutting the cable\" for some time, but did not have a way to stream quickly and easily before now. Bye Bye cable company. ...", "verified": true, "helpfulness": "1/1", "author": "Mark D"}, {"rating": 5.0, "review": "My review is for the Amazon Fire TV box and not the content.The Amazon Fire TV box is very easy to hook up.  In my case, I only had to attach the power cord and an HDMI cable and then connect it wirelessly to my home network.  It doesn't have secure easy setup so you have to type in the network password.Once it was connected to my local network, I accessed my Amazon Prime, Netflix and Sling TV subscriptions with ease.  I have a dedicated media PC for accessing web-based and disk-based media so I won't be using this box for that.The remote works without line-of-sight so it's probably Bluetooth which is okay unless you're using a universal remote like the Logitech Harmony One that I have.  I'm back to two remote controls.", "verified": true, "helpfulness": "0/0", "author": "MICHAEL G LUSTIG"}, {"rating": 5.0, "review": "Of all the android powered TV boxes out there the FIre TV is most powerful with the most apps at best price.There is no subscription to use the Fire TV but it is best used with a Amazon Prime account for the movies and TV that is included at no cost with Prime membership.  I have Prime, Netflix and Sling TV all with monthly subscriptions but this allows me to get almost all the content I had with cable.  The addition of HBO app ($15) would give me more than cable at about same price.  I would rather pay the streaming providers than the cable company for TV because I want the streaming services to succeed so they get even better.You still need home internet to use the Fire TV, I pay for cable company internet only but not cable TV.  The FireTV connects to your internet via LAN network cable or Wifi.  You need a HDMI cable and open port on your TV to connect the FIre TV up.  Most if not all wide screen LCD or Plasma TVs have this.  Older HD projection TVs often to not have HDMI.The Fire TV works with both USB and wireless keyboards.  The most popular keyboard is the Logitech K400 ($30) that has a small USB sender that plugs into the USB port of the FireTV.  A keyboard allows the user to type in search boxes better than the on screen keyboard and remote.The Amazon App Store has many free and paid apps and games but there are many powerful apps not there. The FireTV runs android and can have apps from other sources \"side loaded\".  These apps add a ton of features and content to the FireTV making it even better.  A search for Fire TV sideload will bring up many sites with many howto's on adding apps and content to the FireTV.Refurbished units are tested and have full warranty, they come in same box and look exactly like new ones.The newest firmware allows content to be played from USB devices like a flash drive and also save apps to the flash drive so the storage is expandable.  Add a media player like Kodi (sideload) and you can play video from camcorders or GoPros or almost any source.  AVI, h264, MKV, XVID, DIVX and almost everything else.Great product I could not live without, new apps, features and content expanding all the time !", "verified": true, "helpfulness": "0/0", "author": "Steven Hailer \"SteveoA3D\""}]