[{"rating": 1.0, "review": "Interesting concept, but useless product for anyone outside the USA. I bought this through the base exchange on a military base in Okinawa Japan. I had to lodge a complaint that Amazon is selling to military personnel products that will not work while they are serving on foreign shores. I tried to make Fire TV work with the VPN service that I use to watch USA TV and streaming services on my computer. However, Fire TV does not have a feature that accommodates VPN services. Some enterprising hackers have provided online instructions on how to jail break Fire TV and code it to accommodate VPN. Quite an involved process; but, I shouldn't have to hack a product to make it work in the market in which I bought it. Another option would be to buy a VPN router for another $150 to $200. But, as I look at what Fire TV provides, I realize it's no more value than I get with an old laptop and a VPN service that costs me $50 a year. Best option yet, return Fire TV with a \"shame on you\" to Amazon. Stop selling stuff to overseas markets that won't work overseas.", "verified": true, "helpfulness": "2/4", "author": "Brent A Duncan"}, {"rating": 5.0, "review": "MIL loves it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just the trick for watching Amazon movies and tv shows.", "verified": true, "helpfulness": "1/1", "author": "Robert Baskett"}, {"rating": 5.0, "review": "Glad we got it so far we have not used it because we needed the book to figure things out.", "verified": true, "helpfulness": "0/0", "author": "Sandra K. Overton"}, {"rating": 4.0, "review": "I like it but we have internet through our phones so it often stops to continue downloading.", "verified": true, "helpfulness": "1/1", "author": "Evc \"Happy Gramma\""}, {"rating": 4.0, "review": "I've give this only Four stars as this is my second Fire TV.  The first unit would never go to sleep and the remote was literally devouring batteries at the rate of one set every three days.  Contacted Amazon Customer Service and within two minutes the lady said my unit is defective and she was sending another, new unit.  I've had this new one about a week and so far, so good.  In my opinion the Fire TV is an outstanding streaming device, more so if you're an Amazon Prime Member as it allows you to watch thousands of movies and TV shows at no cost, save for your annual subscription to Prime.  This thing is blisteringly fast for anything on the Amazon site, movies and shows load almost instantly, and it's pretty darned fast loading content from Netflix and HuluPlus, much faster than my Roku boxes.  In fairness to Roku I haven't tried the newer Roku 3.  The new \"voice search\" works very well, but right now is limited to just the Amazon content, but it still works.  The screen format is \"different\" from the way we see it on the other devices, but it just takes a few viewings to get used to it.  I don't consider it a deal breaker.  I really like being able to view my personal photos and videos from the Amazon Cloud, as well as being able to play music via Amazon Prime Music, and since I pump everything through my audio system it's even better.  I'm also learning how to \"cast\" my tablet onto the TV and just recently learned how to use my table as the remote control for the Fire TV, which I also discovered I could do to my nephew's Fire TV and I was driving him nuts by changing channels, pausing his video, fast forwarding, etc. without his knowledge.  \"Is your Fire TV working?  Mine has gone nuts\", were a few of his comments until I explained what I was doing from the other room.Overall I think Amazon has a great product with this Fire TV and I'm sure Amazon will continue to feed it additional apps and games, and updates as time progresses.  No, it doesn't have as much content as Roku..........yet.  But it's got most of the heavy hitters, the more popular streaming sites/apps.  I'm really not much of a gamer, but I did play one game on my nephew's device and I will say I was impressed with both the game and the Fire TV Game Controller.  For me it worked very well.If you're wanting to get away from the high prices of cable or satellite then I would suggest at least trying one of these streaming devices.  The combined costs of Amazon Prime at $99 per year, or $8.25 per month, $8 for Netflix, and $8 for HuluPlus becomes a no brainer for TV entertainment.  I'm hoping that \"one of these days\" that these devices will be able to provide what's already free in over the air local TV programming.  I think it's just a matter of time.", "verified": true, "helpfulness": "0/0", "author": "J. Conway \"jackmusic\""}, {"rating": 3.0, "review": "I purchased this primarily to use with PlexTV. It falls short on PlexTV for so many reasons. I run my private library via a Plex Server and have been using ROKU as a client on all my TV's. ROKU works very well for this. FireTV says it has voice control and I thought that would be a very nice feature. Well it may be if all you want to watch is on Amazon. It works very well and appears very accurate if you do all your viewing on Amazon but it does not work at all with PlexTV. The second issue for me was the UI it is not user friendly. It is very difficult to navigate compared to Roku or Chromcast.  I removed 2 stars for its inability to only use voice control for Amazon Media and its difficult UI. If you primarily watch media via  Amazon it works very well for that purpose.", "verified": true, "helpfulness": "2/2", "author": "F. H. Leinbach"}, {"rating": 5.0, "review": "Happy with this in every way. The voice command feature is the best I've seen. The ability to quickly find anything I'm looking for guarantees that I won't waste any more time with On Demand or Redbox.", "verified": true, "helpfulness": "1/1", "author": "Steven E. Hruska"}, {"rating": 5.0, "review": "Interesting Device ! Nice Performance !", "verified": true, "helpfulness": "1/1", "author": "ian"}, {"rating": 5.0, "review": "Received this as a gift and its worth it 100%  especially if you have Amazon Prime!  Amazon you have outdone  yourselves once more!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]