[{"rating": 2.0, "review": "Still early in units development so I will reserve the right to change my mind.  Selection is still to limited of sold available.  Was hoping that the unit would eliminate need to tie up my computer to access internet to watch baseball, hockey, network sites, etc.  Maybe it will allow this in future", "verified": true, "helpfulness": "2/5", "author": "Wesley S Cotner Jr"}, {"rating": 4.0, "review": "The Fire TV dies what I want it to do, but the fact that there is no power button drives me a little batty. Also the mirror screen function with my Kindle Fire HDX can be hit or miss. I may upgrade it to five stars once there are more apps available for download.", "verified": true, "helpfulness": "0/1", "author": "S. Price \"Fan of Horror and Four Color Fiction\""}, {"rating": 3.0, "review": "It's overall very impressive, but the photo feature collapses my folders so that I no longer have the hierarchical structure of my directories and it also is not sorted.  It makes it hard to find my photos.  I have over 13,000 in 390 directories and sub-directories.  Also, it currently does not allow you to stream Amazon Cloud Player.  While Pandora is nice, I want to listen to *my* music.I decided to keep my Prime trial because its now easy to select and organize movies into watchlists.  Before with my smart tv, trying to find movies was really painful.", "verified": true, "helpfulness": "0/0", "author": "Warlock"}, {"rating": 5.0, "review": "The Fire TV is awesome! We bought this mainly because it had an app available for Plex and it works incredibly well with Plex. It will play our 1:1 BluRay rips without any trouble and no need for the server to transcode anything. The other apps work well too but some aren't quite as nicely animated as on other platforms, for example, the Netflix app works well but doesn't have any of the smooth animations that happen on the Xbox or Playstation  Netflix apps.The other particularly awesome feature of this box are the dual wifi antennas. Our bedroom tv is a wifi dead spot in our house and no other box is able to get a signal, Fire TV connected without trouble and has had a strong signal ever since.We also love the remote, but the voice search is really only useful for Prime subscribers.", "verified": true, "helpfulness": "0/0", "author": "BassManMike"}, {"rating": 4.0, "review": "Yet another tiny box who wants to take over your TV room entertainment. Thank goodness these boxes are small or it would be a crowded media closet.Setup for FireTV was very easy, I was flipping through the interface in minutes. It has it's fair share of content compared to its competitors but with the addition of gaming. I purchased the game pad as well and that connected flawlessly. The game content is nothing to boast about and I hope over time it will improve, otherwise XBOX and PS4 will still own that world and opens the door for the other boxes to improve. At least get a 4 star game like an Angry Birds!The UI could use some work, it seems they didn't focus much on style, already feels antiquated (hence the 4 stars) although it is functional.Overall I'm happy with FireTV and would recommend to friends, but I wouldn't crown it King of the Streaming Media boxes just yet.", "verified": true, "helpfulness": "0/0", "author": "A. C. Eberhardt \"Aceface3\""}, {"rating": 5.0, "review": "It is super easy to use and even the kids love it. The one thing that I wish Amazon would change is to extend the voice activated search feature to the apps, such as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Michael P Williams"}, {"rating": 4.0, "review": "This box offers more than any other box available at this time. I expect it to be upgraded soon.The voice control is great and works very well.", "verified": true, "helpfulness": "0/0", "author": "Leo Lamb \"Retiree\""}, {"rating": 5.0, "review": "It is great. Easy to use, voice search is great.  Much faster t Han Apple TV.  What took you so long in getting it to us?", "verified": false, "helpfulness": "0/0", "author": "Ralph Neely"}, {"rating": 5.0, "review": "I really loved the product, its very easy to use. But they only issue i faced with this product is that it doesn't work outside US.They should have created an VPN app.", "verified": true, "helpfulness": "1/1", "author": "Nelson"}, {"rating": 4.0, "review": "ProsSmall form factorEasy set upOptical line outUSB portLooks goodVideo is sharpNavigation is simpleConsNeeds more apps - they will come, I just hate waiting.Roku remote with in line head phone jack has spoiled me.It would be nice to have a web browser to work with their voice search function - fingers crossed!", "verified": true, "helpfulness": "0/0", "author": "William Jones"}]