[{"rating": 5.0, "review": "I own a Roku as well and like the Roku, setup of this system is straightforward. I do like the menu setup and ease of purchase via Amazon. Roku does not provide vast app / product options. Photos stored on the Amazon cloud via Kindle Fire automatically loaded to the Fire TV. Disappointed that I would need to own a Kindle Fire HDX for compatible sync options to function with the Fire Tv. I own the prior Kindle Fire HD model. I tried out the voice command and was surprised at the accuracy of voice searches. This unit has game options which my granddaughter already tried out. The controller is similar to other high game systems but it would have been great if I did not have to purchase the controller (39.99) separately and if Amazon could have included it with the Fire Tv....might improve Game sales! Overall, pleased with Fire Tv purchase. Rating is based on setup and access to apps.", "verified": true, "helpfulness": "1/1", "author": "glory"}, {"rating": 5.0, "review": "We had been steaming videos for nearly 4 years off of Netflix and more recently with Amazon Prime using our WII.  Amazon TV was an huge upgrade in picture quality and speed.  Our children also enjoy the games -- we were always getting the sales pitch from them for an Xbox or PS4 -- that has subsided.  I would strongly recommend the Amazon TV appliance in any media or family room.  Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "Ronald S Johnson"}, {"rating": 1.0, "review": "I was so disappointed in the Amazon Fire.  VERY little is available free of charge even though we have been Amazon Prime users for years.  The prices are too high and trying to find something for free is too difficult so alas $99 wasted.  It's just going to collect dust.", "verified": true, "helpfulness": "5/8", "author": "Penny J. Weaver"}, {"rating": 1.0, "review": "I bought this to use with Plex which was advertised as a launch app.  But apparently something changed between the pre-production and the production version, because the device doesn't pass Dolby Digital 5.1 or DTS sound as it apparently did correctly in pre-production testing.  So that kills it for me.Second, the much-vaunted Search-by-Voice feature only works with Amazon TV shows, not with any non-Amazon content.  To me, that's false advertising by omission.Fix those two problems and you've got a 5-star device.  As it is, it's useless to me.", "verified": true, "helpfulness": "79/86", "author": "I. Dean"}, {"rating": 4.0, "review": "I bought this to run xbmc mainly. It runs xbmc very nicely. You do have to sideload it though. Sideloading apps is a little bit annoying but not too difficult. There are a ton of tutorials ont the interwebs on how to do this. The amazon UI is good not great. The Amazon movies on demand function works well. In my case though i wont use it very much. I am not a Prime member full time, after the trial period I wont be using Amazons streaming services anymore. XBMC works really well anyway so i wont need the prime services. Overall, really impressed with the product. I would recommend it to anyone wanting a nice lil streaming box.", "verified": true, "helpfulness": "1/1", "author": "John"}, {"rating": 1.0, "review": "NOT HAVING HBO GO IS THE ONLY REASON I WONT PURCHASE :( OTHERWISE I LOVE AMAZON AND I WOULD TOTALLY BE ON THIS!!!!", "verified": false, "helpfulness": "1/11", "author": "lauryn neff"}, {"rating": 5.0, "review": "great product, my family love it. great customer service it works great....enjoying every minute of it, having fun and watching great tv and games", "verified": true, "helpfulness": "1/1", "author": "rsouza36"}, {"rating": 5.0, "review": "After years of use my Roku finally stopped working on me. I had used it constantly, I'm a huge movie buff and definitely got my use from it. I had tried a chromecast as a replacement at first. While I did like it, it tended to lag and had connectivity issues which drove me nuts. There's nothing worse than being in the most exciting moment of a movie and it begins to stutter then buffer.. Having loved Amazon's products in the past and tried everything from AmazonBasics AA NiMH Precharged Rechargeable Batteries (16 Pack, 2000 mAh) batteries to their various Kindle models; Kindle Fire HD 7\", HD Display, Wi-Fi, 8 GB - Includes Special Offers Kindle Fire HDX 7\", HDX Display, Wi-Fi, 16 GB - Includes Special Offers ,I figured I'd give it a shot. Since I'm a Amazon Prime Member I had it on my porch and ready to go within 2 days. Like other Amazon products, it was already linked with my account so the only thing I really needed to do during setup was choose my apps. The packaging, like all Amazon products, is \"frustration free\". Not needing a large knife, and a first aid kit is always a plus when opening a package. After I opened the package everything was included aside a cat5 ethernet cable and a hdmi. Since the loss of my poor roku, I had the cables laying around still and hooked them up. Basically I plugged it and and relatively quickly it booted up and a short intro cartoon came on with basic instructions for it's use.  After the short introduction I was promptly taken to the main page. Having a wired connection is definitely much snappier and quick VS a standard wifi connection. The unit itself is thinner than my roku but slightly longer. The only thing that makes it stand out from the other stuff on my Tv stand is the annoyingly bright white led light on the front of the unit. Thankfully I had some LightDims Original Strength® Minimal Packaging leftover to cover it as it would definitely annoy me while trying to sleep. The Fire Tv unit truly is quick, much faster than my roku was. The added benefit of being able to play various games with an actual game controller is definitely a plus. Being able to have Youtube is nice as well, it was always frustrating not having it on my Roku. While the Roku did have a lot more \"channels\", they were mostly ones you had to pay for or were so mind numbingly boring that you'd delete it immediately. I have all the main choices on my Fire TV that I always used on Roku, namely: Amazon (of course), Netflix, Hulu, Pandora and Flixster. Plenty of selection between those, not much need for the others. As time goes on I'll post an update with my thought on various apps. One thing I really enjoyed was the screensaver option on the Fire Tv. On the Roku it would just say ROKU and the text would bounce around on the screen. On the Fire Tv however, it was pre-synced with Facebook and I could choose what folders for it to stream while the screensaver played.  All in all, if you want a snappy net streamer that both looks and plays good, just get the Fire TV and look no further. You won't regret it.", "verified": true, "helpfulness": "3/4", "author": "Cat_Pack"}, {"rating": 4.0, "review": "Very quick and the picture looks great.  The simple, clean interface makes it easy.  As a Prime customer I wish the paid content more clearly denoted on the search screen.", "verified": true, "helpfulness": "1/1", "author": "S. Evans"}, {"rating": 1.0, "review": "This was not what i was expecting after researching and reading the reviews. Save your money and get a SmartTV. I was highly disappointed. Shows they claimed were free really weren't and most movies you had to pay for......i already pay for Netflix. Even with Amazon Prime, it doesn't add much. The adds and claims are very deceiving. If you like specific channels, this contraption is Not what you want. I like CBS, NBC, AMC, TNT, ect.. If you believe from other reviews you would get rid of cable, think again. All the device is, is an app loader.The only true comment is it is easy to connect.", "verified": true, "helpfulness": "5/11", "author": "mcph2005"}]