[{"rating": 4.0, "review": "Good Product!", "verified": true, "helpfulness": "0/0", "author": "Yoon"}, {"rating": 3.0, "review": "How I had my hopes up for this device! I wanted to try it because of issues with Netflix access via our Verizon Fios connection, and there it was -  a system to view both Amazon Prime offerings and Netflix, and then reality set in.First the good stuff:- it was super easy to set up, which was a huge plus- access to Amazon Prime is immediate and linked to your account- the voice recognition remote is a cool featureNow the downsides:- I thought there would be more available for free on Amazon Prime - at the very least kids movies that were direct to video - nope, not the case.- Well, those same movies are \"free\" on Netflix, let's try the included Netflix app. Sorry, no dice. It won't connect and then looking at the comments the consensus is the app sucks! And it does.So one of my reasons for getting this device is shot, I still have to resort to Verizon if I want to use Netflix. I haven't tried any of the other available apps yet, but I hope they work better.I really wanted to be able to rave about this thing, but one week in and I'm not impressed yet. I give it three stars simply due to the ease of installation and access to Amazon, but only 1 star for utility with Netflix.", "verified": true, "helpfulness": "0/2", "author": "Nigel \"nw-tk\""}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Michael Starck"}, {"rating": 5.0, "review": "Love it! Works great!", "verified": true, "helpfulness": "0/0", "author": "Jessica H."}, {"rating": 3.0, "review": "Not exactly as advertised. Voice search doesn't check Hulu/Netflix. It only gives you Amazon prime selections and some cost money. When it can search other services I'll give it 5 stars.", "verified": true, "helpfulness": "0/2", "author": "Matt"}, {"rating": 5.0, "review": "Excellent, love it!", "verified": true, "helpfulness": "0/0", "author": "John A. Acton \"jonycek\""}, {"rating": 3.0, "review": "Meet expectations", "verified": true, "helpfulness": "0/0", "author": "Mark Greathouse"}, {"rating": 5.0, "review": "Super easy! Worked great. Movies and TV at your finger tips whenever you want it and if you have Prime, IT'S FREE. NO MONTHLY FEE.It also had access to the others like Netflex and Hulu. I set it up myself and I'm an old lady and not tech savvy.", "verified": true, "helpfulness": "0/0", "author": "M. Dokka"}, {"rating": 1.0, "review": "When NOT in use, batteries in the remote go dead in three days. That's new alkaline batteries. Only way to avoid this is to remove the batteries immediately after use.", "verified": true, "helpfulness": "0/2", "author": "Hop Boyd Sr"}, {"rating": 5.0, "review": "this is a great little box  I belong to prime, there are so many movies and shows to pick from", "verified": true, "helpfulness": "0/0", "author": "Richard Hafner Sr."}]