[{"rating": 2.0, "review": "I really liked the concept of the device. I wanted to use and enjoy the device. I did everything I could, including reading the formal manual and calling for assistance but for one glitch or another I was frustrated and unable to enjoy the device. The Amazon help line was very professional and courteous. The company was prompt in replacing the device. The second Fire TV worked fine for a few days then began having trouble with the HDMI circuits, at least that is the dialog box that came up.Long story short, I am not a tech and do not want to be a tech I just want something that works. One other item which I found annoying was the fact that I had no sooner gotten the Fire TV  than the company released a thumb drive Fire TV Stick for less than half the price, go figure. I had no trouble returning the second device. Will continue using the Sony wi-fi blue ray player to access Prime until I decide on another option.I wish Amazon luck and hope they get the bugs out and other Fire device customers do not have the problems and frustration I experienced.I am a loyal Amazon customer and think their service is first rate.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "This device is the \"BOMB\"! Thanks Amazon.  I delayed hooking it up because I thought it was going to be a challenge. I'm not  tech savvy.  This was so easy to set up.  There's so many preprogrammed channels that I will definitely use. If you have Amazon prime, Netflix or Hulu you can cut your cable bill down and save some money.  I say purchase Amazon fire.", "verified": true, "helpfulness": "0/0", "author": "Ropes"}, {"rating": 5.0, "review": "I love this product. All my televisions are Smart TVs because I live in the country and do not have cable access. I hate the search function on most of the Smart TVs. Amazon Fire has an awesome voice function for searching through Amazon instant view streaming. However, the voice search only works with the Amazon streaming versus the other apps. Also, no VUDU app that I can see. It is very easy to use and way better than Smart TV function. I will say the youtube app is pretty nice and easy to search, it also has auto play to go to the next video which I like to put on if I am cleaning house or studying.", "verified": true, "helpfulness": "0/0", "author": "wickedpple42"}, {"rating": 5.0, "review": "This is a nice product. I have used the Apple TV in the past and this is definitely comparable. I bought this with the intention of canceling cable. However, The Amazon Fire TV is not a replacement for watching live sports, news, or other programming such as VH1, MTV, and more. At the same time, Netflix, YouTube, my Amazon playlist and more are available. I recommend this product and be aware that this is not a replacement for all live programming.", "verified": true, "helpfulness": "1/1", "author": "Ade"}, {"rating": 5.0, "review": "Surprisingly impressed.  Like it more than both the Apple TV and the Roku.  Still a bit new to me, but set up went faster and cleaner than on the Apple TV.  Has more native apps as well.  Similar to Roku with more updated interface and all the benefits of Android platform.My parents live in an Apple ecosystem, so got this for my home and an Apple TV for theirs.  After setting both systems up, i wish i would have purchased the Fire TV for them too.....  The apps, the ease and Apple just does not play nice with others, yet others play nice with everyone....", "verified": true, "helpfulness": "0/0", "author": "JCB \"dependanSEA\""}, {"rating": 4.0, "review": "Haven't used it a whole lot since I bought it a month ago. Took some time to navigate but I look forward to using it more. It was very simple to assemble and plug in. Will be a good companion to my Netflix subscription.", "verified": true, "helpfulness": "0/0", "author": "Emel Milavetz"}, {"rating": 4.0, "review": "Set up was pretty easy.", "verified": true, "helpfulness": "0/0", "author": "KimCox"}, {"rating": 5.0, "review": "The unit is fast and easy to use. Much more stable than using my PS3 to watch amazon prime videos and access netflix.", "verified": true, "helpfulness": "0/0", "author": "Red"}, {"rating": 5.0, "review": "The device is great but the speed of our internet is a problem.  Not sure it is going to work for us... but it is great if we happen to catch the internet when the speed is ok.", "verified": true, "helpfulness": "0/0", "author": "Barb Dalenberg"}, {"rating": 3.0, "review": "First, I wanna say that the Fire TV is a great system.  It works well and is fast.  I got the Fire TV in hopes of discontinuing my cable service.  Set up was easy and fast.  The voice recognition worked great. But when I searched my 10 favorite TV shows, NONE were available on Amazon Prime with out paying more.  I do not see it as a good value to pay $79 for the box, $99 for the subscription and then anywhere $14 to $30 for each season of the 10 shows we watch.  I'm taking my Fire TV back.", "verified": false, "helpfulness": "0/0", "author": "M. Anders"}]