[{"rating": 4.0, "review": "Works as advertised. Easy to set up", "verified": true, "helpfulness": "0/0", "author": "Scott Davis"}, {"rating": 1.0, "review": "I purchased this when they first shipped. I was very happy with it till last October. Thats when it started to have serious issues. I was on wireless at the tim and it was fine till than. Nothing changed on the network. Other devices I have used are apple tv, roku, samsung tv apps. All those work fine and never have issues. Switched to wired on the firetv. Saw some improvement and have left it on wired. Still get times where it stops and says loading again, and mostly with Netflix. I did contact their support. What a joke that is. I gave them a lot of info and they said they would get mack to me. Hahah they never contacted me again. Don't think I will purchase another amazon manufactured product again with that kind of support.", "verified": true, "helpfulness": "3/4", "author": "Rick B."}, {"rating": 5.0, "review": "Merry Christmas to me!!! I had read do many great reviews about this and was already on the fence, so on Cyber Monday when it went on sale for $69., I had to buy it! I am so happy I did!!! I absolutely love my FireTV!!!! So much of an upgrade from my Roku!! I have already been a Prime member for several years, so this is just another way to enjoy my membership even more. If you have a Prime Membership and don't have FireTV, you are missing out on s lot of extra channels, games, and other exclusive and free entertainment!", "verified": true, "helpfulness": "0/0", "author": "K. Chandler \"bluefawn\""}, {"rating": 5.0, "review": "Easy set up, have paired with my Hulu plus account. much better than watching it through my computer!", "verified": true, "helpfulness": "0/0", "author": "Matthew Williams"}, {"rating": 5.0, "review": "Works great! Very easy to navigate and install. Highly recommended and a must have if you are a amazon prime member!", "verified": true, "helpfulness": "0/0", "author": "Zack K"}, {"rating": 5.0, "review": "We love binge watching old TV series...", "verified": true, "helpfulness": "0/0", "author": "Deborah L. Tipps \"TRIXIELU\""}, {"rating": 5.0, "review": "I love this device. It is so easy to use.", "verified": true, "helpfulness": "0/0", "author": "B. Lingle \"loves2read\""}, {"rating": 5.0, "review": "So far I love it, still learning all the nuances of it.", "verified": true, "helpfulness": "0/0", "author": "Beverly A. Casselman"}, {"rating": 1.0, "review": "This s*** sucks!!!!", "verified": false, "helpfulness": "1/5", "author": "Jesus Sanchez"}, {"rating": 5.0, "review": "I've tryed them all. Apple Tv, Roku, WDTV live and other wise, and lots more have hung off of my TV, but none of them can match the preformance and versility of this little box. I have never giving a review or rates anything a 5 but yes I am that impresses, 5 STARS", "verified": true, "helpfulness": "0/0", "author": "James L. Jones"}]