[{"rating": 2.0, "review": "So far WiFi connection is hit & miss. MySmart TV had no WiFi issues. So a little disappointed. Hopefully it will improve.", "verified": true, "helpfulness": "0/1", "author": "HJE"}, {"rating": 5.0, "review": "I just started using amazon fire and enjoy it", "verified": true, "helpfulness": "0/0", "author": "Jerry Jewell"}, {"rating": 5.0, "review": "Love the Amazon Fire TV.  Works well with our high speed wireless internet.", "verified": true, "helpfulness": "0/0", "author": "MJ"}, {"rating": 4.0, "review": "Works great, I love it.  I love Amazon, so it was a relatively easy decision to invest in this product.  I get Netflix DVDs but not streaming - Amazon's Prime is a better deal.  With my electronic gear, I had to use a set of Monster Powernet adaptors to get my DVD player & TV hooked to the Internet.  One day they stopped working, and that's when I bought the Amazon Fire TV.  A lot less fuss than the adaptors, which are now gathering dust.  If you like Amazon, becoming a Prime member and buying this gadget will put a lot more entertainment on your TV.", "verified": true, "helpfulness": "0/0", "author": "Stonehedger"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "James \"Grandma\""}, {"rating": 5.0, "review": "We love Amazon TV! As an amazon prime member, we can watch tons of movies and shows for free! If u are a big time movie buff amazon Tv is totally worth it! The streaming is super fast! We r even thinking of ditching cable!", "verified": true, "helpfulness": "0/0", "author": "Tracey Sanchez"}, {"rating": 3.0, "review": "This could get a 5 star rating except for the fact that I can be watching a show and it freezes or blacks out.  I get a message stating that it can't play this show right now and check back later.  I then have to go into settings, clear data, unplug that unit for 20 seconds then turn it back on to get it to work properly again.  I learned that trick from other user's who experience the same thing.  I would not recommend you purchase this unit until Amazon addresses this issue.", "verified": true, "helpfulness": "0/0", "author": "Robin D. stephens"}, {"rating": 5.0, "review": "easy to use, very intuitive", "verified": true, "helpfulness": "0/0", "author": "mel"}, {"rating": 5.0, "review": "Easy to use connected directly to router fast streaming", "verified": true, "helpfulness": "0/0", "author": "David Reber"}, {"rating": 2.0, "review": "The Hulu app sucks, it does not work... it keeps freezing up, leaving screen in black while sound goes on or just does nothing. Fix it", "verified": true, "helpfulness": "0/1", "author": "shannon"}]