[{"rating": 5.0, "review": "I am extremely happy with this purchase and I highly recommended! Thanks Amazon and great job!!!", "verified": true, "helpfulness": "0/0", "author": "Angelo Lopez"}, {"rating": 5.0, "review": "Love my Fire TV!!!", "verified": true, "helpfulness": "0/0", "author": "Champ"}, {"rating": 5.0, "review": "Great platform, fast simple to use, you can add other android apps.", "verified": true, "helpfulness": "0/0", "author": "J. Lewis"}, {"rating": 5.0, "review": "We  love this! It was easy to set up, and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Valerie Peterson"}, {"rating": 5.0, "review": "Been having fun watching movies that we missed and playing some of the games.A cool adition to our tv.", "verified": true, "helpfulness": "0/0", "author": "JOHN Ackermann"}, {"rating": 3.0, "review": "I really love the video quality and the setup and everything.HOWEVER I am so disappointed that the Netherlands Antilles is not able to watch movies for free or purchase movies with Amazon Prime; neither could we purchase songs due to license restrictions.Amazon Prime should offer their services globally.....not only for the US residents.It is not fair!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Gothika"}, {"rating": 2.0, "review": "It works well if you have amazon prime, however be prepared to buy stock in energizer...I have had it for a week and am on my third set of AAA Batteries for the remote.  Plus it is not very portable.  Would have gone with the fire stick if I had to do it over so I could take it into the other room with me if my wife wanted to watch regular tv.", "verified": true, "helpfulness": "1/3", "author": "Jeremy A Bowen"}, {"rating": 5.0, "review": "Very pleased with the Fire TV!  Also bought one as a gift for my dad for Christmas, and he too loves it!", "verified": true, "helpfulness": "0/0", "author": "Lory L. Lyles"}, {"rating": 1.0, "review": "None of the apps ever work on the fire.  Something is always going wrong with netflix or hbogo or all of the apps. Prefer Google tv or roku. Upsetting because we were very excited about this purchase.", "verified": true, "helpfulness": "1/3", "author": "PJ"}, {"rating": 5.0, "review": "I love this little box. I had my cable box removed and have never looked back. There does seem to be a small hic-cup, some of the apps such as History Channel (H2) requires you to \"register\" to see several of the videos, but, when I try to register it shows \"Amazon Fire TV\" but then it asks for my provider and Amazon is not listed. I no longer use a cable tv provider only for internet.", "verified": true, "helpfulness": "1/1", "author": "George Holland"}]