[{"rating": 4.0, "review": "We bought this to use on a new tv. We have been using a ROKU for a few years. I didn't give it 5 stars because it will pause occassionally when we are watching a movie. We have never had that problem using the Roku.Overall it is excellent and ties into my amazon prime account which is awesome and the reason we bought this device.", "verified": true, "helpfulness": "1/1", "author": "Jennifer Ogden"}, {"rating": 5.0, "review": "Great device, user friendly. I recommendThis product.", "verified": true, "helpfulness": "0/0", "author": "larry maldonado"}, {"rating": 2.0, "review": "I would of given it 5 stars but the main reason I got it was for mirroring videos from an iOS system and it doesn't, not even with the app I paid and added to the fire box. It just buffers every 5 seconds. Other than that it is great!", "verified": true, "helpfulness": "0/2", "author": "Damien"}, {"rating": 4.0, "review": "It is easy to set up and use.  I wish it came with an \"off\"  button.  It seems awkward to have to unplug it to turn it off.", "verified": true, "helpfulness": "0/0", "author": "Dolly H"}, {"rating": 5.0, "review": "I just received this so I haven't used it long but set up was super easy and the voice activated remote is very cool. I always hated all the typing on the little remotes..Seems like it took forever but with this you just say what you are looking for and up it pops.I am looking forward to streaming all my Amazon Prime and Netflix shows.", "verified": true, "helpfulness": "0/0", "author": "Karcher1953"}, {"rating": 5.0, "review": "love this!", "verified": true, "helpfulness": "0/0", "author": "Girlism76 \"girlism76\""}, {"rating": 3.0, "review": "I am giving the product 3 stars in that I was lead to believe it did more than it actually does.  It also does not ship right away.  It took almost 2 weeks for mine to arrive, but it did come preloaded with my Amazon Prime information.  What I am most upset about is that my cable provider (Charter Communications) does not support HBOGo, History Channel, and a few other channels that are touted in the description.  Apparently there are several cable providers that don't support channels being played on the Fire TV.  Amazon's response is for me to contact Charter and let them know that I want that option.  How exactly do I do that?  I do like being able to watch YouTube & Netflix, but I can also do this with most BluRay players on the market.  The HBOGo was what set this apart. With out that it isn't worth it.", "verified": true, "helpfulness": "0/1", "author": "T. Schulte"}, {"rating": 5.0, "review": "I am absolutely in love with this!! I have 2 year old twin boys and they love the shows that they offer!! Saving $130 a month by getting rid of cable is an awesome feeling. Works well with my existing surround sound! I can transfer my music from my i tunes account to my TV. So much to offer!!!! Well worth the cost!!!", "verified": true, "helpfulness": "0/0", "author": "Kathryn E Smith"}, {"rating": 2.0, "review": "It freezes alot when we are watching HBO GO.", "verified": true, "helpfulness": "0/1", "author": "Brigitte"}, {"rating": 4.0, "review": "only took me a few minutes to find my way around and then all I can say is the movie selection in prime was fairly good", "verified": true, "helpfulness": "1/1", "author": "George W. Petersen"}]