[{"rating": 3.0, "review": "More often than not,  programs stop and then start, playing 5 seconds of the program followed by 1 1/2 - 2 minutes of stop time.  It happens consistently and makes watching programs insufferable. My husband won't sit through it.  Also, you have to pay additional for most of what I would consider the better programs.  That's pretty costly when you consider you pay $99 for Amazon Prime just to see a few good Amazon originals along with subtitled and older B rate movies.", "verified": true, "helpfulness": "1/2", "author": "Debbie Leach"}, {"rating": 5.0, "review": "I was so tired of paying for TV service I rarely watched. I ordered the Fire TV stick for my brother that travels internationally for work & it worked so well I turned off my cable and ordered the Fire TV box for myself. I am enjoying it. There are so many movies, games, apps, & music choices. A few of the apps do not work correctly, BBC for example, but overall it is a wonderful system.", "verified": true, "helpfulness": "0/0", "author": "Deanna Snyder Johnson"}, {"rating": 5.0, "review": "This baby is styling. I would almost venture to say that this classy embossed high tech packaging cost near as much as the FireTV itself. Absolutely among the top 5 in packaging that this ole' boy ever saw! Buy it for the box if for no other reason. No joke the FireTV is a magic box and works like a charm as well as being very user friendly.", "verified": true, "helpfulness": "0/1", "author": "CatsMeow \"chuck132\""}, {"rating": 5.0, "review": "Love, love, love my Fire TV! I actually bought 3 Fire Sticks as well, one for my extra TV and 2 for Christmas gifts. I have had no issues with the Fire box or my television since the hook up.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I did a lot of reading,  changed  the format of my files (what a pain),  played with all the settings and I can get 5.1 sound now.The average person wouldn't and shouldn't have to do everything I did to make this thing work for me.That being said,  I really like it.  It pulls everything together in my AV setup. Slingplayer is a great addition.I will rate 5 stars when the device supports a wide range of file formats.", "verified": true, "helpfulness": "0/2", "author": "MCV74"}, {"rating": 5.0, "review": "Love Amazon Fire TV!  I have ROKU on one TV and Fire TV on the other.  I love the Fire TV better than ROKU.  My only regret is that Fire TV does not have as many apps as ROKU.  For example, I love ACORN TV and Warner Archive.  Neither are available on Fire TV (that I could find).  Fire TV is much, much better than ROKU for playing Amazon Music.ROKU will not play any of the free Prime music.  For example, I make a playlist for called Long Time.  In it I put 10 free Prime Playlist songs and 20 songs I uploaded from my PC.  Fire TV will show me all the 30 songs in the playlist.  ROKU will only show me the 20 songs I uploaded from my PC..I like the screen savers better in Fire TV and it is easier of find Prime (free) Movies...", "verified": true, "helpfulness": "0/0", "author": "Joe Stafford"}, {"rating": 3.0, "review": "Cant mirror link android, works well for people that do not care to link thier tabs and phones directly. You can easily play content that is downloaded to your phone, but cannot do mirror image like with the competitors. I bought this device because of the processing power, and it works very well. Also would be nice if i was able to use text to speach buton in apps, not just to find them.", "verified": true, "helpfulness": "0/0", "author": "Justin Stas"}, {"rating": 5.0, "review": "Awesome device!  Love the ease of use, and fact that you can load other apps onto it to view even more free shows and movies - such as the History Channel app, etc.", "verified": true, "helpfulness": "0/0", "author": "daalisia"}, {"rating": 3.0, "review": "Easy to install.  Disappointed that I cannot get some of the TV channels I was expecting.  Also disappointed that this cannot be used to access the movies and shows on other devices........at least not that I can figure out.", "verified": true, "helpfulness": "0/1", "author": "Debbi Haacke"}, {"rating": 3.0, "review": "I received this unit today.  Set it up and was able to use it a few minutes.  Selected the option to install the latest system update and it has not powered on since.  After looking though the reviews, this appears to be a very common problem that is getting worse.  I would avoid buying this product againUpdated:  The replacement to my original failed unit has done well.  There is still no excuse for sending out bad product, but once you get a working unit it seems to perform correction (updating to 3 stars)", "verified": true, "helpfulness": "3/4", "author": "kj"}]