[{"rating": 5.0, "review": "great purchase on both items purchased. the prive was the best price I found", "verified": true, "helpfulness": "1/1", "author": "Edward Firmstone"}, {"rating": 5.0, "review": "Easy to setup and easy to access my programs", "verified": true, "helpfulness": "1/1", "author": "Karen Hall"}, {"rating": 4.0, "review": "We love FireTV. A little disappointed in the challenges of setting up parental features to block purchases. Wish I could figure out how to let them do prime without entering a password each time they want to watch a show. It's probably user error 😁. Overall we love it!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"cc_in_ca\""}, {"rating": 5.0, "review": "I'm in love!!  So many options and so much cheaper than cable.  My only regret is that I didn't get this sooner.", "verified": true, "helpfulness": "1/2", "author": "C. Figueroa"}, {"rating": 5.0, "review": "Fabulous!!", "verified": false, "helpfulness": "1/1", "author": "LWJ"}, {"rating": 1.0, "review": "Search only looks at Amazon sources; fails to identify titles in Netflix, if you have that as one of your subscriptions.", "verified": true, "helpfulness": "1/4", "author": "e h green"}, {"rating": 1.0, "review": "Sadly this is going back. In all the hype and hoopla of the info about this device, what is not shared that one must have at least 5.5 mbps of internet speed. Sadly where we live is rural and what I thought was fast speed (2 mbps) is waaaaay tooo slow.So my happy hopes for streamed movies were destroyed by Amazon not giving pertinent system info where one could see it.Now I'm looking for a different system that works with 2 mbps. Any Ideas?", "verified": true, "helpfulness": "1/4", "author": "CM Fox"}, {"rating": 4.0, "review": "I wish it sinked with my Amazon instant video purchases from my Bluray player,", "verified": true, "helpfulness": "1/1", "author": "Joseph Kulesza"}, {"rating": 3.0, "review": "not to happy with this", "verified": true, "helpfulness": "0/1", "author": "Paula Siller"}, {"rating": 5.0, "review": "Works great!  Easy to Use", "verified": true, "helpfulness": "1/1", "author": "PSE"}]