[{"rating": 5.0, "review": "Love it!  Easy to set up.  Have particularly enjoyed Amazon Prime and Netflix.  Both work beautifully as I'm sure the rest of the apps will too when I get around to them.", "verified": true, "helpfulness": "0/0", "author": "TexasTradition"}, {"rating": 3.0, "review": "NOT COMPATABLE WITH COMCAST CABLE", "verified": true, "helpfulness": "0/4", "author": "Roe"}, {"rating": 1.0, "review": "This is the worst streaming device you can possibly buy. Amazon aims to sell you this useless product that will force you to spend more money trying to compensate for Amazon Fire's short comings. The Roku stick is a much more affordable and useful device. Apple products do not stream to the Amazon Fire at all, which makes it completely useless to the majority of tech savvy users who adore their apple products. Skip this product, buy an apple TV, Roku Stick, or Chromecast, this product will only disappoint you.", "verified": false, "helpfulness": "1/8", "author": "austin vial"}, {"rating": 4.0, "review": "I like it very easy to hook up. I like being able to see my photos on the TV and watch my prime movies on a bigger screen.", "verified": true, "helpfulness": "0/0", "author": "Ladycop 415"}, {"rating": 4.0, "review": "Just as good, maybe better than competitors. Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "ag"}, {"rating": 5.0, "review": "I love my Smart TV .now I have Access to Amazon prime ,Netflix and You tube.Thank you Amazon...", "verified": true, "helpfulness": "0/2", "author": "Efrain Diaz \"wonder\""}, {"rating": 5.0, "review": "Excellent quality, love it so far!!!", "verified": true, "helpfulness": "0/1", "author": "Tami A Kelley"}, {"rating": 4.0, "review": "easy to set up and use. works great with my hd tv. amazon prime and Netflix working great.", "verified": true, "helpfulness": "0/1", "author": "Jesse C. Spriggs"}, {"rating": 4.0, "review": "Very nice product. I already have Chromecast and this is a LOT better. However, it would be nice to have more updated movies and more free television movies under the Prime umbrella. Overall, a good entertainment piece.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"cc\""}, {"rating": 3.0, "review": "Voice search is very good.  Have lost connection several times but at same time still have connection with all other devices", "verified": true, "helpfulness": "0/0", "author": "Clifford Moore"}]