[{"rating": 5.0, "review": "It works great for watching Netflix and Amazon Prime.  Super easy to set up!  I only wish you could easily switch back and forth between Prime accounts, but its really nice.", "verified": true, "helpfulness": "0/0", "author": "Brian Curtis"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Samedi Kay Barnes"}, {"rating": 3.0, "review": "Great accept the remote's batteries seem to run down being in it for 24hrs. Have had to take a battery out when not in use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Set up was easy. Even though there are a lot of shows and movies available for free as an Amazon Prime member, I was disappointed that there weren't more of my favorites and at the price of those which aren't free.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Carlton"}, {"rating": 5.0, "review": "I love Amazon Fire TV.  It is very fast.  My favorite is the voice search.  Better than what I expected.", "verified": true, "helpfulness": "0/0", "author": "RJ"}, {"rating": 5.0, "review": "This works great. Lots of movies and TV shows for the low price of $99.00/year. Sure beats having the monthly Cable bill. We also purchased the Fire TV Stick for use on the second family TV. There are some additional fees for apps like Hulu TV and Netflix but they are minor compared to Cable.", "verified": true, "helpfulness": "0/0", "author": "William E. Krell"}, {"rating": 5.0, "review": "Great platform excellent support", "verified": true, "helpfulness": "0/0", "author": "sete12"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "sid story"}, {"rating": 4.0, "review": "Works great, more convenient to setup and use across multiple apps than our Roku 3.  Love the mic feature, helps finding things but doesn't always pickup everything you say to it accurately.", "verified": true, "helpfulness": "0/0", "author": "John Grey \"AV98\""}, {"rating": 5.0, "review": "It is all that was expected. Only issue is determining what to watch, and which Amazon Prime movies are 'free' to watch.", "verified": true, "helpfulness": "0/0", "author": "DFuhr2010"}]