[{"rating": 5.0, "review": "Easy to use and works great. Easy to set up and takes only a little time to understand how to use it. I'm considering buying a second unit.", "verified": true, "helpfulness": "1/1", "author": "William S Morgan"}, {"rating": 3.0, "review": "This device looks great and feels high-end.  The games are really good and it streams content quickly and flawlessly. LOVE the second screen features with my Fire HDX.Here are the negatives:Voice search works really well but only displays Amazon content (not content from Hulu or Netflix)Flixter (the app you have to use to play your Ultraviolet content) will not play in 5.1 surround!  That NEEDS fixing!Those of us who subscribe to streaming music services (Spotify, Rdio, etc.) are left out in the cold.", "verified": true, "helpfulness": "3/3", "author": "Tim A. Lucas"}, {"rating": 5.0, "review": "I used to stream Netflix through my Wii console, and I love my Wii, but the picture quality was just awful, so I cancelled that, and have really only streamed video to my laptop since.Until I caught the Fire TV bug.  I'm not usually one to jump on the bandwagon early, but I knew I wanted it the day it was announced.The box and remote are small and lightweight.  The box has HDMI, Ethernet, and USB ports.  My 2005 Panasonic television is HD, but has only one HDMI port, so I bought a switcher and a couple of HDMI cables.  Installation was swift, easy, and painless.  I think I could even have guided my husband through it.  This is the man who used to say he married me because I knew how to operate the VCR :)I fired it up; it knew who I was.  I watched a brief video that outlined the features, then I started perusing movies and TV - so many choices!  I happened to have a DVD of Downton Abbey, so I watched part from my Bluray player, then switched over to Fire TV and watched the same episode.  Careful scrutiny revealed some minor degradation of picture quality, but it is not noticeable.  If I had not looked so carefully at certain objects I knew would be on the screen, I'd never have known the difference between the DVD and Fire TV.The remote has a few necessary buttons.  It isn't complicated.  The voice search blows me away.  I have a soft, quiet voice, and I speak quickly.  Voice recognition software does not work for me.  I hate it, and wasn't even going to use it.  But the voice search works, for me and my husband!  Even when I get a \"not found,\" the screen displays what I said.  I cannot tell you how much this amazes me.I hate to gush, but I haven't been this excited about a purchase in ages.  Two wings up!  Please do try it.  You can send it back within 30 days if you don't like it, but you won't.Now I can cancel my one-DVD-at-a-time subscription.  The Fire TV will pay for itself in a year, with Prime.  Yes, I have Prime, and I recommend getting a Prime membership if you're planning to purchase Fire TV.  They go together like peas and carrots.", "verified": true, "helpfulness": "7/8", "author": "Hummingbirder \"Don't ask for a man's soul when he's given you his heart.\""}, {"rating": 5.0, "review": "I am an Amazon Prime member and I love so many of the PBS shows so this is great.  My grand kids also love watching unlimited Thomas the train.  Easy to hook up.  I love the pandora radio.", "verified": true, "helpfulness": "1/1", "author": "Jane a teacher"}, {"rating": 3.0, "review": "There is not enough content, not even Amazon Music.  The search function is faulty, it will list movies for an actor that he never appeared in and leave out ones that he were in.  Also it will list a TV show an actor was on, but not the episodes.  Also there is little cross content search.", "verified": true, "helpfulness": "0/2", "author": "Gary Ellsi"}, {"rating": 5.0, "review": "The Fire TV is very comparable to Apple's iTV and Ruko's streaming hardware. I own all three and they all have their pros and cons, which in my opinion are minuscule . I do have to give the edge to the Amazon Fire TV for several reasons. Firstly it has the easiest setup, especially if you are a Prime subscriber. It's menu display is easy to navigate and easy on the eyes. The best feature I feel is the game menu and the large selection of video games that are offered. That was the main reason I purchased the Fire TV. Now the grandchildren and myself have a ball together playing.", "verified": true, "helpfulness": "0/0", "author": "Frank J. Laviano"}, {"rating": 2.0, "review": "Have 2 Roku Streaming Sticks (<$50 each) and bought the Amazon Fire TV. It works well with Amazon Marketplace and games from Amazon, but find that it is not very user-friendly. The home screen is cumbersome for non-Amazon channels. Netflix has crashed on it several times. The selection in other channels to watch is lacking in comparison. Would gladly pay half the price and just get another Roku.", "verified": true, "helpfulness": "3/3", "author": "Janine K. Zampini \"jz\""}, {"rating": 5.0, "review": "I was hesitant to purchase the Amazon Fire TV because I own an Apple TV and other Apple products. Apple TV comes with Netflix (with subscription) and other apps. In addition, all of my movies were bought under Apple system. Thus, these will not be compatible with Amazon TV.After reading some pros and cons from others, I decided to give it a try since I am a prime member with Amazon.I think Amazon Fire TV is a great purchase, and is more superior than Apple TV because:1. Voice control - absent in Apple TV.2. Renting a movie at Amazon sometimes is less expensive than at Apple TV.3. Unlike Apple, you can rent a movie from your computer (via Amazon website) then watch it later at your TV. I find this very useful because I can find movies faster on my computer.4. Very user friendly interface. You can search movies easily (via voice or \"longer\" keyboard display).5. Fast refresh/download rate.6. With Prime membership, I can rent old movies for free. There's a caveat though. Amazon TV does not have many good movies. As a consequence, I have to check with my Netflix.I rarely use my Apple TV nowadays. When I want to rent movies, I usually use my Amazon Fire TV. But when I want to buy/own the movie, I use my Apple TV because it will be compatible with my other Apple devices.", "verified": true, "helpfulness": "0/0", "author": "Hendry"}, {"rating": 4.0, "review": "In my the Voice search still needs improving as I currently see it not working very well in some circumstances.Also I have another issue when sideloading apps, that they do not appea in the apps tab, but rather I have to go into Settings -> Applications and launch it from there. I would love to be able to add some of my apps into the apps tab.Excepting the issues above I really enjoy the device and it's ease of use.", "verified": true, "helpfulness": "0/0", "author": "Boeru Marius"}, {"rating": 5.0, "review": "So far I am pretty jazzed about this unit.  I feel like I have been chasing the \"holy grail\" for years as far as this type of media player goes.  I have been looking for something tiny, with hdmi out and something that could give me a super smooth XBMC experience.  I have a massive collection of DVD ISO's stored on a NAS drive, so having access to these with an easy to use (wife-ready) interface has been critical.  The fact that I was able to load XBMC without a hitch and find/play all of our DVD ISO's blew me away.Now, I have a handful of criticisms/suggestions but they are pretty minor.1.  I would love to have wall-mount for this unit.  It is made to be mounted behind a flat-panel TV2.  I wish the XBMC short-cut could be planted on the homepage instead of being buried like it is3.  The remote is decent, but I would rather have something with more mouse-like control and a back-lit keyboard combined in one unit.4.  I really hope that this unit becomes controllable over IP for use with apps like Roomie RemoteSo far, these are my only gripes with this unit.  If anyone has any comments, or suggestions regarding my review, please feel free.  I would appreciate any input.  I think this unit will be my \"go to\" unit for years to come.", "verified": true, "helpfulness": "1/1", "author": "K. Murphy"}]