[{"rating": 5.0, "review": "it is amazing.", "verified": true, "helpfulness": "0/0", "author": "Gerald B. Johnson"}, {"rating": 5.0, "review": "Love it, so snappy and responsive compared to the stick.  I wish Amazon would realize that they're good enough to not have to lock out competitors.  Needs Vudu support.", "verified": true, "helpfulness": "0/0", "author": "E"}, {"rating": 1.0, "review": "Got the unit hooked up and the AMAZON logo is displayed and that's it, it does nothing else", "verified": true, "helpfulness": "0/2", "author": "Joe Scerbo"}, {"rating": 4.0, "review": "We like it very well sofar, haven't had a chance to use it much yet.", "verified": true, "helpfulness": "0/0", "author": "Parthenia Tarver"}, {"rating": 4.0, "review": "Well I love this Amazon Fire TV. I do a couple complaints though. I've tried the Sony brand, the Toshiba brand and the Roku first, so I could have a Blu-Ray player with all the same features. BUT NOOOOO! The quality of the HD was horrible on the Sony. The Toshiba had all the bells and whistles BUT NO Amazon Prime. So what good are they? Now for the Amazon Fire TV.....The picture is beautiful, the print is easy to read, but, but, here it comes...... sometimes, just some times the remote would stop working. Yes I put 3 sets of batteries in it and no change. I had to reset by unpluging the main unit, wait a few minutes to reset it. I haven't talk to anyone about this problem yet, cause my Dad has the same one and he has the same problem once in a while. Other than that minor inconvenience once or twice a month, I LOVE IT. Now remember this is the Fire TV box not the stick. I'll be trying that next.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far so good works well video is sharp and clear. I only have one gripe the remote should have a backlight. I watch TV in the dark and it is really hard to see the buttons and since they are really small it hard to find them in the dark.", "verified": true, "helpfulness": "0/0", "author": "Karen Lordi"}, {"rating": 5.0, "review": "Works better than I was expecting, very pleased.", "verified": true, "helpfulness": "0/0", "author": "William B. Devlin"}, {"rating": 5.0, "review": "Have been using it for a few days now.......I can say it has been great so far.", "verified": true, "helpfulness": "0/0", "author": "Marty"}, {"rating": 1.0, "review": "Bought this specifically to get the Sling TV ap. We were already using apple tv and smart tvs with a very fast internet connection without issues. I like Amazon and this product had everything we were looking for. I have 2 complaints about Fire tv, 1 was not a big deal and 1 was a deal breaker. First issue is its a very messy, cluttered non user friendly software interface. If amazon Prime is the only thing you use, not a big deal, but its a pain trying to find other apps like Netflix, Hbo go or Sling tv. That issue is just annoying and it seams the design could have been better, ultimately being more simple like apple or Roku.The deal breaker was the picture quality. Had it hooked up for one day. hard wired, internet speeds of 80mbps. There was lag in every action scene and jerky movements when someone on screen was simply walking or moving. This was constant and not a once in a while occurrence. I Returned it and went with the Roku 2 for half the price and it works awesome. Unfortunately I had to choose either Roku or the fire as apple does not have the Sling tv ap I was looking for as those other two do. So in the end, apple tv and the Roku both played movies night and day better than the Amazon Fire on the same day at the same time, so this was not an internet issue. Maybe I got a bad one. I hope that is the case because I bought a Fire and a Fire stick for someone as a Christmas gift last year and I hope they have not been subject to the picture quality I witnessed.", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Disappointing. I thought it would be comparable to a friend's Roku but it's not. I really would like to be able to listen to the free music that I have on my phone or computer but that's not happening. I'd like to watch PBS news the same day, ain't happening either. It works great with Netflix though.", "verified": true, "helpfulness": "0/1", "author": "Robyn Johnson"}]