[{"rating": 5.0, "review": "It works great and I would recommend it to my friends. It is easy & simple to use for everybody.", "verified": true, "helpfulness": "0/0", "author": "Barak Raviv"}, {"rating": 1.0, "review": "To purchase this for just streaming content, xbox and media players already do this. Amazon you dropped the ball on this one. To make the purchase worthwhile you need to add the ability to play other content. My WD tv already offers me all this.", "verified": false, "helpfulness": "5/10", "author": "Groove \"Ray\""}, {"rating": 5.0, "review": "We have a smart tv but for whatever reason it does not want to hold a connection to the internet and we were havng problems watching Hulu and Netflicks.  The Amazon fire resolved this issue", "verified": true, "helpfulness": "0/0", "author": "Deanna"}, {"rating": 5.0, "review": "Love it. Great interface that is very easy to use.Pros: Voice recognition is brilliant. We can look up shows in a fraction of the time it used to take typing it in. There is no going back from here - the microphone has reclaimed its role and now become the input device of the year.Cons: Memory is only 8GB and at least for gaming, that is not very much. I wish that they had had the foresight to put an SD slot in this.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"KindleParent\""}, {"rating": 4.0, "review": "The difference between this and the Roku 3 in its basic operation is not discernible. There are some differences that you will want to consider however, before making a purchase. While Fire TV has a voice activated search function, it does not have a couple of functions that the Roku 3 has, and these are two functions that I find highly desirable. For one, the sound output on the remote with its own volume control is not just something I like, its something my wife loves. There is no sound coming from the TV that would disturb her and what she is doing, and I can hear comfortably through the earphones. The other is the non-directional remote hand unit that avoids the need to stretch your wrist into a position many find uncomfortable. I bought one Fire TV, but I'm waiting for the second generation for improvements.", "verified": true, "helpfulness": "1/1", "author": "MAGstar"}, {"rating": 5.0, "review": "Love my new Fire TV!  Don't use it for games so can't comment.  The sound and picture quality is the best in class!!", "verified": true, "helpfulness": "0/0", "author": "Bob C. \"bobcan22\""}, {"rating": 2.0, "review": "I am happy to have this but it gets frustrating that every single time I watch using the Fire TV, the screen goes black and I have to shut it off and turn it back on.  It gets very frustrating....", "verified": true, "helpfulness": "0/3", "author": "Dianna Blasingim"}, {"rating": 5.0, "review": "very easy to use. the voice search is fantasticand to combine this with amazon prime, it is the best", "verified": true, "helpfulness": "0/0", "author": "James Flickner"}, {"rating": 3.0, "review": "device is easy to use and has some good features.  I would like to see more channels available.  HBO go would be great!", "verified": true, "helpfulness": "0/0", "author": "chris knight"}, {"rating": 5.0, "review": "This is a new product recommended by a friend and I love it! It's the little black box with endless possibilities...really surprised me! I can't wait to add Netflix and Hulu.", "verified": true, "helpfulness": "0/0", "author": "Gina"}]