[{"rating": 4.0, "review": "Great,  but I wish you could get on websites through it.", "verified": true, "helpfulness": "1/2", "author": "Daniel Paul"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "Michael OToole Vogler"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I'm only giving it 4 stars because the first unit I had, had to be returned because of a defect.", "verified": true, "helpfulness": "0/3", "author": "jeff wallace"}, {"rating": 5.0, "review": "GREAT DEVICE, LOVE IT", "verified": true, "helpfulness": "0/1", "author": "Mary M."}, {"rating": 5.0, "review": "This Fire TV is so easy to use.  I can watch movies, listen to music, & entertain my granddaughter with Curious George.  When I'm listening to music, the pictures on the TV screen are beautiful.  Fire TV has loads of scenic pictures that are absolutely beautiful.  This would be a good Christmas gift for grown children.", "verified": true, "helpfulness": "1/1", "author": "Delores A. Gardner \"Dee\""}, {"rating": 5.0, "review": "The voice search is very god, even if it is only Amazon content.  Most searches completed in about one second.  The unit as a whole is fast and very responsive.  As more streaming sources become available, this unit will get better and better.  Live sports are about the only thing keeping me tethered to Satellite.", "verified": true, "helpfulness": "1/1", "author": "Jimmy"}, {"rating": 2.0, "review": "Not enough options.  Amazon Prime's pricing is WAY too expensive with mostly old non popular titles to choose from.  We have also had to restart if about once a wk....big disappointment!Would not buy this product again.", "verified": true, "helpfulness": "6/8", "author": "doreen"}, {"rating": 4.0, "review": "Small, stylish and the best Android based media player available. For Amazon Prime members this box offers the slickest access to the Amazon library of movies and TV shows. It does most of the other online services as well including Netflix, Hulu, etc. Remote is compact and easy to use. Recommended.", "verified": true, "helpfulness": "2/3", "author": "Cyrus Brown"}, {"rating": 4.0, "review": "Include the HBO GO app and it would be perfect!", "verified": true, "helpfulness": "0/2", "author": "Kendra Anne Adams"}]