[{"rating": 3.0, "review": "I don't know if it is my Internet provider or this unit but some games play choppy and sometimes not at all. Or have to delete the game completely and reload.", "verified": true, "helpfulness": "0/0", "author": "Robert Theibert"}, {"rating": 5.0, "review": "Everything works as advertised. Glad i cut the cable. I dont know why anybody would waste there time and money with cable. Why did i wait so long?", "verified": true, "helpfulness": "0/0", "author": "Jerry Wypcha"}, {"rating": 5.0, "review": "Libre it!", "verified": true, "helpfulness": "0/0", "author": "Mariana Rivero"}, {"rating": 4.0, "review": "Works as advertised but unlike my Amazon Fire and Blu Ray player it has trouble maintaining a signal from my router. This is something Amazon has to address to compete with ROKU and other sticks. I do like the ability to move the stick to other TV's in my house and using it when I travel.", "verified": true, "helpfulness": "1/2", "author": "SOKOL47"}, {"rating": 5.0, "review": "So easy to use.  Set up in minutes.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 4.0, "review": "Happy with my purchase", "verified": true, "helpfulness": "0/0", "author": "TGonzalez"}, {"rating": 5.0, "review": "Lots of Movies and TV programs.  The small remote works very easily and is extremely fast.  When watching a movie if you have to pause it responds very quickly and there is no lag.  When scrolling through the movies or TV programs it is very easy to do so.  Great unit!  Will save you big bucks on your cable bill.  We got rid of our premium movie channels and we do not miss them at all.", "verified": true, "helpfulness": "0/0", "author": "dolamiti \"dolamiti\""}, {"rating": 5.0, "review": "Amazon Fire TV blows Roku out of the water.  The user interface and the talk to search feature make using the Amazon Fire TV so much easier to navigate and use the system itself. If you do end up purchasing this, i would like to strongly suggest purchasing the game remotes as well.  It makes playing the games much easier.", "verified": true, "helpfulness": "0/0", "author": "Sean A. Mcintyre \"simplysandym\""}, {"rating": 3.0, "review": "I am still learning more about Amazon Fire, Prime Movies and other program work just fine, I am still finding more abgout amazon fire as I use it.", "verified": true, "helpfulness": "0/1", "author": "jerel ploium"}, {"rating": 1.0, "review": "Very disappoint in old, old, old movies.  We thought new releases would be available without charges from 2.99 to 14.99.  I think it was a scam, and we both could see new movies, but that did not happen.  Guess the fine print did not appear on this for me.  Once, again, we are senior citizens on very limited budget and Amazon Fire far to expensive.  Very disappointed in the movies without charges.", "verified": true, "helpfulness": "1/4", "author": "Shirley L. White"}]