[{"rating": 5.0, "review": "Got this for husband to use, he cannot get hang of using playstation to run netflix... This was perfect, he can talk to find what he wants or just find what he is after. Works perfect,takes up a very, very small space area. Love it, thinking of getting some for christmas gifts.", "verified": true, "helpfulness": "1/1", "author": "linda carson"}, {"rating": 5.0, "review": "I am totally ecstatic about this streaming gadget.  NOW I can get captioning.  NOW I can find a movie or series without doing anything but speaking a name.  No more tedious searches and typing for me.  If I could give it more than five stars, I certainly would.  Thank you, Amazon!  Well done!", "verified": true, "helpfulness": "1/1", "author": "CaddoGal"}, {"rating": 2.0, "review": "Although small in size and easy to set up it is not nearly as good as my Roku XD/S. It seems to load quickly but has issues with the video and constantly re-buffering during the prime time Hours of 8:00 PM and 11:00 Pm, the video will freeze quite often which has never happened with the Roku.Another annoying aspect is the screen menu is much smaller than the Roku making it difficult to read what each episode relates to in a series and the fact that each time the unit is turned on I have to log back into my Netflix account where the Roku held my settings. Hopefully these issues will be corrected with future updates.", "verified": true, "helpfulness": "3/4", "author": "H. J. Paradis"}, {"rating": 4.0, "review": "Not real happy with the redundant steps to watch Prime content. If it's included in Prime, there should be the need for only ONE CLICK; PLAY. I shouldn't have to enter a password every time I watch a Prime included show. Not only that, but I must dig into \"more\" ways to watch to get to the password screen. SIMPLIFY FOR PRIME CONTENT WATCHING!", "verified": true, "helpfulness": "2/2", "author": "Mark Wilson"}, {"rating": 4.0, "review": "Only gripe is that it doesn't support HBO go,  yet? Hopefully? Please Amazon,  make this happen. Gaming is okay for the casual gamer.  Not alot of storage,  so you'll have to store in the cloud.  Hopefully the USB functionality will extend to thumb drives.", "verified": true, "helpfulness": "0/0", "author": "some random guy"}, {"rating": 5.0, "review": "It only took a few minutes to set it up and I love the selection of items to view when I have time to watch.", "verified": true, "helpfulness": "0/1", "author": "Carolyn Thompson"}, {"rating": 5.0, "review": "This has more options, easier to use, and the price for movies and TV is less than Apple TV.Took it out of box, plugged it in and it downloaded the information without fail.It was up and running within minutes. Plus the voice command button is a nice feature. I would also highly recommend Amazon Prime. It is worth it!", "verified": true, "helpfulness": "1/1", "author": "ddsracefans"}, {"rating": 5.0, "review": "best thing I have tried ...give me more movies as soon as possible..new releases or more tv showes  as soon as possible", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I do like the Amazon Fire TV, hence the 4 star rating.  I only experienced one hiccup when the screen froze during the tutorial video.  The reason why I cannot give 5 stars is simply because there are many apps missing that other streaming devices already have.  I noticed that this device connects to the Amazon Appstore, so I hope it does not take too long for apps to be released, mainly Crunchyroll & WWE Network.  My main gripe with the device is that the only way to shut it down is by unplugging the device.  Perhaps a future update will address this issue since I do not like to keep any device on, even on \"sleep\" mode.", "verified": true, "helpfulness": "3/3", "author": "Hongster"}, {"rating": 5.0, "review": "The Fire TV was easy to hook up and works really well.  I am a Prime customer so I have free access to many movies and tv shows.  I also use it for Netflix and It has none of those annoying pauses while loading content.  I am particularly impressed by the speed with which you can scroll through available options without pause for the images to come up.  I recommend this device for anyone who has need for video entertainment.", "verified": true, "helpfulness": "1/1", "author": "es"}]