[{"rating": 5.0, "review": "Amazing the best Amazon purchases EVER!!!! If you don't have one get one, really right now go do it you won't be sorry!!", "verified": true, "helpfulness": "1/1", "author": "Lynne Matlack \"Kindle Junkie\""}, {"rating": 1.0, "review": "I would have rated this higher (4 stars) but I am taking off 2 stars for not having an 'off' or a 'sleep mode' button. It is supposed to go to sleep after 30 minutes but mine has not gone to sleep much since plugging it in a few days ago. So far it is only a slight improvement over my LG blu-ray players which allows me to watch amazon videos. I only see a few Interesting games so I will continue using  my Xbox and my Kindle tablets until more games are available. For the price, I could have waited.I just took another star off because the device is still on 1 day later.", "verified": true, "helpfulness": "3/5", "author": "TKE"}, {"rating": 5.0, "review": "In addition to the Fire TV, I have an Apple TV as well as a ChromeCast. By far and large, the best product is the Fire TV. I use it more than both the other ones combined. Having integration between my Prime list and the device is clutch, as I consume media across several different devices.I do wish I could search by Prime Instant, so I hope they will fix that. I also wish I could cast a Prime Instant streaming video from a device to the Fire TV, but I don't see that as an option (although I can cast YouTube to my Fire TV, which is really cool!).There is no doubt that it is faster than both Apple TV and ChromeCast, and the voice recognition is SO convenient. I also have the game controller, and the games are pretty good. I don't game much, but I wanted to check it out. I was surprised at the speed of the games and the level of engagement.I'd also like to be able to see a future improvement where screens can be mirrored from devices to this (both ChromeCast and Apple TV have this). From an educator's standpoint, this could be the $100 solution to wireless projection for classroom teachers (Apple TV doesn't play well with enterprise level security, and ChromeCast doesn't do well with some software that is essential for instruction).All in all, it's my favorite media device. It's faster, has a great and snappy UI, and is easy to setup.", "verified": true, "helpfulness": "1/1", "author": "corydave"}, {"rating": 4.0, "review": "Amazon billed my credit card prematurely on payment date for monthly installment andhave no way to contact amazon  to request due date on account, not happy at all amazondeducted my payment earlier than agreed terms.", "verified": true, "helpfulness": "0/8", "author": "Donald J. Obrien \"computer gadgets\""}, {"rating": 5.0, "review": "got as a gift and we love it", "verified": true, "helpfulness": "0/1", "author": "Pat"}, {"rating": 4.0, "review": "First I would like to say that I am coming from using Google TV. Fire TV is a great device. The voice search is accurate at picking up what I say. My biggest problem with this device is also with the voice search. Coming from Google TV if you used the search feature if would look for it in more places. Let’s say I am searching for the movie Gremlins. On Google TV it would look for it in Netflix, Amazon Instant, instant prime, Google play store, HBO Go, and you get the idea. This device for example will not check Netflix. So I must do a voice search to see if it is on Amazon, if not I must open let’s say Netflix and use the up, down, left, right buttons and manually enter the letter to find out if it is on Netflix. That was the big issue for me. A small issue is the amount of apps. No HBO Go, Google play store, and others. I am not blaming amazon for this. It is an open system so HBO and others just need to make the apps for it. This devise is quick, and amazon items start up instantly, but not Netflix. Netflix must load first, but that is not a big deal. If you are wondering why I am switching from Google TV, it is because Google neglected it and it hasn't received updates in a long time. I think Google gave up on it.", "verified": true, "helpfulness": "0/0", "author": "CV"}, {"rating": 1.0, "review": "I like it but the most used app is Netflix.  This Netflix app version is older and a pain to use.  Why they have this outdated one, doesn't make any sense.", "verified": true, "helpfulness": "11/14", "author": "txtech1997"}, {"rating": 4.0, "review": "Here goes, I'm the 9 thousandth reviewer for this product LOL.  short preface: I love Amazon, so when comparing all streaming devices in the end I went with the Fire TV because of the outstanding customer service, and it will improve with time.  That being said, I share the frustrations that all my fellow buyers have: I hate not being able to sort out the \"non Prime\" videos, I truly dislike paying for an episode (I didn't see that one coming, even though I did a ton of research).  But overall I love my new cable bill, which only includes internet and basic, and I mean basic, service (15.00) because I'm reserving the right to order HBO and Showtime at some point. Was massively disappointed in Hulu Plus, because they don't offer the entire series in a show anymore (did they run out of server space or what?)  Netflix was a pleasant surprise.  In case you are wondering, Netflix, Hulu Plus, and Prime are your alternatives to paying your cable bill.  And streaming is quite alright...after you get over the initial shock of not having live TV, although, ABC does do live TV! hope the other stations follow suit soon.  Overall, as a non tech person, it was ridiculously easy to hook this up, really anyone can do it.  And like I said, if you're comparing other products, in the end Amazon cannot be beat for customer service or support.", "verified": true, "helpfulness": "1/1", "author": "Maria"}, {"rating": 5.0, "review": "Wasn't sure how this would work with my rural DSL but it is WONDERFUL.  I haven't had any problems with it at all.  It is easy to use and the voice command works just as they said it would.  So very, very glad I bought it.  Loads of stuff to watch.  I have been able to catch up with some series I have missed, especially the BBC ones that I dearly love.  I recommend it to anyone who likes variety in what they can watch.  Along with my Amazon Prime most everything is FREE..that is an added bonus.  Try it, you'll like it.", "verified": true, "helpfulness": "1/2", "author": "Spiral42 \"Trivia Fanatic\""}, {"rating": 5.0, "review": "My only complaint is that you have to wade through to find 'Prime' movies and programs...they are not conveniently grouped together.Otherwise there are lots of choices and lots of TV to catch up on.", "verified": true, "helpfulness": "0/1", "author": "J. Nelson \"J. Nelson Consumer\""}]