[{"rating": 5.0, "review": "It's the greatest device since the remote!  Quick, accurate, small and so easy to install.  Everyone needs this.", "verified": true, "helpfulness": "0/0", "author": "Susan Musselman"}, {"rating": 5.0, "review": "everything I need is in one box kinda wish it had web pages but other then that I love it", "verified": true, "helpfulness": "0/0", "author": "Shane Borrego"}, {"rating": 5.0, "review": "this is fun!!!!  I am a prime member and I suspect that helps the experience a lot ... comes all set up  ... knew me and my status right away.  Have watch a many things already and so far I think all were free based on prime.  EASY to install.  and believe me I was concerned .... not so technical.", "verified": true, "helpfulness": "0/0", "author": "Jerry L. Taylor"}, {"rating": 5.0, "review": "It works really good", "verified": true, "helpfulness": "0/0", "author": "william"}, {"rating": 5.0, "review": "It is fantastic!  There are great movies to watch that are free with prime too.", "verified": false, "helpfulness": "0/0", "author": "mary marsh coyle"}, {"rating": 5.0, "review": "Awesome product! I'm so glad I can watch my favorite programs on my television now and not just on my computer or phone", "verified": true, "helpfulness": "0/0", "author": "Helen Gaoteote"}, {"rating": 5.0, "review": "Awesome, sleek.  It's perfect!", "verified": true, "helpfulness": "0/0", "author": "D Woods"}, {"rating": 4.0, "review": "Very simple to \"install\", if you can even call it that.  Just plug it in to an electrical outlet, plug one end of an HDMI cable into the TV and the other side into the Amazon Fire TV box.  It was a gift, so I didn't know much about it.  It works off your Wi-Fi, and immediately installed itself, checked for updates, and appeared on the TV Input list!  There are lots of choices.  My only \"complaint\" would be that you don't know which movies/games, etc. are \"FREE\" and which ones you have to pay for.  The only way to find out, is to choose that item.  Then you have to decide. One fun thing I wasn't expecting is that it automatically synced the pictures from my Kindle Fire and Amazon Fire phone to the TV.  You get to see the pictures or videos on \"the big screen\".  Only have it since Christmas.  Still learning, but so far, so good!", "verified": true, "helpfulness": "0/0", "author": "Donna  M. Green"}, {"rating": 5.0, "review": "I just love it and it is amazing how easy it was to hook up and use, I can easily move it between TVs in the house.  We love it, not sure how easy it would have been for someone who doesn't use Amazon all that much (although seems like everyone uses Amazon) and doesn't have the prime, but we love it.  It was a gift, something I probably wouldn't have purchased because it sounding too confusing.  I have been watching Downton Abbey and love catching up on other shows as well.  It was a wonderful gift.", "verified": true, "helpfulness": "0/0", "author": "Marley"}, {"rating": 5.0, "review": "I have 2 of these and one stick I love them going to buy a few for family and friends for bday gifts", "verified": true, "helpfulness": "1/1", "author": "jamie moore"}]