[{"rating": 1.0, "review": "Constantly freezing up. Audio is uninterrupted, but the video will act like it's fast forwarding until it catches up. I've restarted and done several factory resets. This thing is junk. Old beat up PS3 has zero problems with playback.", "verified": true, "helpfulness": "1/4", "author": "arnobp"}, {"rating": 1.0, "review": "I would really enjoy this a lot more if I could actually use it. Right after purchase, I noticed it would occasionally freeze, the television or monitor I was connected to losing signal for about 3 - 5 seconds. I tried rebooting, etc, but it would still occur, and I couldn't find help in the Amazon \"Help\" pages. Around 4 months after purchase, any video content played started to freeze with a snowy screen about 10 - 15 minutes after starting to watch something. It will unfreeze itself after 10 - 15 seconds, but by the 3rd time it does it (usually about 20 minutes after starting), I'll have to unplug the device. There are no power or reset buttons, which are vastly needed on any electronic device). This would happen about every 3rd episode of a series, or 2 - 3 times during a movie. Now after 6 months, this is occurring about 5 minutes after I start any video content, and continually no matter what settings/etc. I have it on. To make things worse, if I do get it working, when playing back the video again with resume, it will say \"This video cannot be played,\" no matter if it is local stream, on a USB drive, or Netflix/Hulu/Prime. The network connection speeds this device was capable of left me using very little of it's \"online\" features anyway. (See below)I have checked into all the \"Help\" resources Amazon offers on Fire TV, but the problem is not listed in their troubleshooting page. I even tried other televisions/hookups to ensure it was the device and nothing else. In my searches on other websites, I've seen my issue is common and has to do with the HDMI connector on the device not transmitting HDCP data (Hi-Bandwidth Digital Content Protection), and there is no fix other than replacing the unit. So, I paid $100 and at best I'll get a refurbished unit, if I could even figure out how to get a replacement.I have since switched back to Roku. A little less memory and processor speed, but it actually streams my local content better, doesn't buffer over WiFi like Fire TV did, and no reboots needed. Wish they had a swap out program for after 4 months, but I've not found anything yet, and now have a $100 plastic box sitting in my closet 6 months after purchase.Pros:Processor & Ram are great for gaming.Connectivity of devices such as controls.Many controllers, even a PS3 will connect to it with a bit of retrying and settings changes.USB connection (I am even using my own AC wifi dongle via it's USB to increase network speeds, see below)Cons:TV connectivity limited. Would love to see a display port, and even Mini-to-RCA breakouts. Even a DVI. (would resolve a lot of the issues I had)No physical buttons on the device, especially power and reset. (would also make my issues easier to address)Voice features not up to par with even my 3 year old LG phone. It has never recognized what I've said.Buffering occurs even when connected directly to a modem to the net. This is a stark contrast to every other video player that I have, when connecting 5 other types at once via WiFi (I use Wireless AC, and two Tri-band access points in my house) I have no buffering waits. The three routers I tried report that the Fire TV has a 100mb/s connection. This is unacceptable for a streaming device. Should be a 1gb/s connection physical connection at the least. I use 10gb/s for most of the hard lines in my home. The WiFi was only reported at connecting at around 150mb/s on my AC router directly, with no access points involved.All in all, combining an Android gaming device with a media streamer was a great idea. I just feel Roku, Nvidia, and a few others delivered much better products for the price. Would give 0 stars if I could. The Stick at $39 is a much better value, if you take a lot of this stuff into consideration, is still worth it in that price range.", "verified": true, "helpfulness": "0/3", "author": "Bryan Reeves"}, {"rating": 5.0, "review": "I think it's a great product and I have freed myself from being overcharged by my cable company.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Thompson"}, {"rating": 5.0, "review": "Keeps up with streamed feeds well. Easy set up. Lots of add on apps available. Can connect wirelessly at both 2.4 GHz and 5.0 GHz as well as a gigabit Cat6/5e connection (I've connected at 5 GHz and the wired connection - both are easy-peasy setup). USB port for add on mouse or keyboard (or both with a hub) or for external storage. Also has Bluetooth (I haven't tried that yet). App to use your phone as a controller (haven't tried that yet either). Everything works as advertised that I've tried. Works well with Sling TV. Tiny box has a lot going on and everything I've used so far is top notch. The menus are oriented toward Amazon content but I side loaded a different menu system and some non-Amazon apps (without rooting).", "verified": true, "helpfulness": "1/1", "author": "Patrick L."}, {"rating": 5.0, "review": "works great, but you have to have an up to date modem.  we were having a lot of buffering, found out modem, MUST be fast speed.", "verified": true, "helpfulness": "1/1", "author": "Sharon M. Prinz \"Applesauce\""}, {"rating": 5.0, "review": "We've had this a few months now and do not miss conventional paid TV. There is more free content available than we could watch in our lifetimes, times 10.You can watch a lot of popular shows as they air for a reasonable fee; some  less than a dollar. Some around $2-3 an episode. You can buy whole seasons for $20-30. A great many are free after the season ends.There are tons of a la carte shows. Pick and choose. Jump around. Go back and forth. Very free form.There are also games and other apps.Pandora is free and rocks!We do recommend pairing this with some rabbit ears for your local nighlty news and weather, if you like that.", "verified": true, "helpfulness": "1/1", "author": "Paul Hopkins"}, {"rating": 4.0, "review": "For the most part I like it.  It has a wide range of apps, games and video.  The Netflix app is more advanced than on the device which I have been using to access it (a blue-ray player).One problem is that I have to reboot the Fire TV after it has gone to sleep.  If I don't reboot it the apps all seem to be sluggish, with frequent  pauses and rebuffers.I would like to see ES File Explorer ported to it.  At some point I will probably need to clean off some junk (old app data, etc) and the only available file manager I have found is not free, and I hesitate to buy it if I am not sure how well it works.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I find the interface a bit cluttered compared to other streaming boxes, but I'm still impressed by Amazon's Fire TV. It's very fast and offers most of the apps I need. I understand why this is the case, but I do wish you could search across all apps, not just Amazon's content.", "verified": true, "helpfulness": "2/2", "author": "ShoMel"}, {"rating": 5.0, "review": "Delivered yesterday and as \"touted\",  EZ set up... well, sort of.  Easy to connect the cables and plug in.  Actually following the guide directions to connect to Wireless was also EZ. Then I wanted to try it out... suddenly everything said \"Lost connection to internet\"... but when I checked settings it said  \"CONNECTYED\"  and VERY GOOD SIGNAL.... so I was confused.  Could not get any of the options to work as they all gave the same message of Lost connection.  I noticed that on the bottom left of my screen I could see small letters that constantly said \"loading:....\"  Then after a time, the screen showed a panorama photo(s) (no sound) that was not familiar to me.. (which I now know was Amazon's screensaver feature). Anyway, I  was too upset and decided to leave it alone and try again in the morning... This morning I turned it on and got the welcome screen again and also saw all the additional Videos giving help with all the features, so I watched them all.  First thing I did after watching the help videos,  was to go to the Home Menu and tab down to Photos where I began to watch several of the albums of photos stored on my Cloud account.  SO>>>> for those who already have a Cloud account, be aware that when you first set up your Fire TV it will automatically download all of your Cloud info (sync) to your Fire TV which for me made it impossible for sometime to actually use any of the Movie, Video, Game, or other features of the Fire TV until  the  download had completed. BUT it was worth it!  Just to be able to view my photos on the TV was worth the wait and frustration of  yesterday.  I have been enjoying old movies all day since.  Initially there was a message on screen that said due to slow band width, I would experience stop and go of  my viewing of videos/movies.  I have seen this warning in the past when watching videos on my Kindle and still, I have not had this be a problem while watching any movies on my Kindle nor here today.  It sure is GREAT to watch my old movies (and new ones ) on the TV instead of on my Kindle...though the Kindle still shows a great movie but the sound is not as good on the Kindle as on my TV. I expect this to be something that Kindle will be able to enhance in the future. Having the movies and my photos, etc, on my TV makes it much more enjoyable for others who are in the room to enjoy instead of crowding around the small Kindle screen to see the same thing. I still think that my photos look better on the Kindle!!!  My Photo on Fire TV, Bobbi-Cat.  To clarify:  this is a photo of my tv screen showing the photo of my cat being displayed via the Fire TV feature.  Whew", "verified": true, "helpfulness": "2/2", "author": "maggie borrecco"}, {"rating": 5.0, "review": "with this product I have no need for cable tv.", "verified": true, "helpfulness": "1/1", "author": "kay"}]