[{"rating": 2.0, "review": "My fiancé and I have no reason to use cable anymore. Install netflix, hulu plus, games, get amazon prime, and there is no reason you shouldn't be entertained for long periods of time.One issue: Can't use external hard drive. This may not be that big of a deal, but it would be nice to have. Yes, amazon, you lost a whole star for this reason.UPDATE: Well, i found a way to mount my external HDD. This was great for retro gaming. To do so, i rooted my Fire TV. Amazon blew an eFuse to all rooted Fire TVs on their last update, rendering my Fire TV a nice looking paper weight. I used to shop on Amazon for everything, but those days are now over. This has infuriated me. I purchased this perfectly good Android device for performing Android tasks. If I wanted to be restricted to not having the ability to install anything, I would have purchased a chromecast. I am going to either get a Nexus Player (because this is a an android device supported by google) or the Razer Forge, which is going to have many more features and better specs.Please let me know if you have any input on whether to choose the Forge or the Nexus. Both look like great devices. Leaning toward the Nexus due to the lack of bloatware and another layer of UI, despite the lower specs.", "verified": true, "helpfulness": "1/2", "author": "Kyle"}, {"rating": 5.0, "review": "I chose it because I go rid of my cable and wanted access to what I wanted to see on my tv. Amazon fire tv does just that; allows me to watch movies and tv shows instantly without interruptions, that I get with cable tv.  I also get to watch past TV shows that we're not available to me when I had cable.I would recommend Amazon Fire TV to all my friends and family if they are looking for instant gratification of watching what they want without interrupting commercials from regular and cable TV.", "verified": true, "helpfulness": "2/2", "author": "Donna B."}, {"rating": 2.0, "review": "The biggest fail for fire TV is that you can't play your Amazon music but I can play Amazon music on my roku??  I am confused and disappointed.", "verified": true, "helpfulness": "1/3", "author": "Monique"}, {"rating": 5.0, "review": "I love this item I don't have to use my computer to watch programs it is small an not notice able by the tv", "verified": true, "helpfulness": "0/1", "author": "Cheryl Spicer"}, {"rating": 5.0, "review": "This is great for amazon I had a Visio box and that thing was junk I have chrome cast has well that thing is cool too but I could only do YouTube and Netflix with it. But  with fire tv you can do soooo much more.", "verified": true, "helpfulness": "0/0", "author": "H"}, {"rating": 2.0, "review": "Let me start off by saying it does work like it is supposed to.  It looks good, easy to set up, and the voice recognition actually works.  It does seem the voice search only searches amazon though.  I have movies in my flixter account and when i use voice search it only shows me where I can buy it in Amazon.  The reason I was not happy with this is due to the fact I ordered a Roku at the same time.  It has many more channels/apps to use.  Also many of the apps on Roku are free that the Fire TV wants to charge money for.  Ie. Plex.  I use Plex are a media server in my house.  On roku, Plex is free and works instantly with my in home media server.  I can watch anything I have saved on my pc, in almost any format, on my TV.  When I hooked up my Fire TV, I have to buy the Plex app for $5.  Also, there are many kids channels on the Roku that I did not see offered on Fire.  Honestly It seems the Fire was based around getting you to use Amazon Prime (which I am already a member) but I want to use other things too.  The Roku has all the same apps Fire had (Amazon, Amazon Prime, Netflix, Hulu, ESPN, Plex) and seems to have many, many more.  A big one for me is Vudu.  Vudu plays ultraviolet movies from you UV/Digital HD locker.  Fire only has Flixter (which is also on Roku).  While they both play you UV movies, Vudu shows movies that Flixter does not.  Disney movies do not show up in Flixter.  So all the Ironman, Captian America, Frozen, Little Mermaid, etc. only show up and play on Vudu.  So I can stream them from Roku but not the Fire TV.  The only thing the Roku does not do is games.  But they are the same games the kids have on their kindle fire.  So that is not a big deal.  Since the Roku is about $10 - $20 cheaper and it does so much more, I am returning my Fire TV and getting another Roku 3.  Again I am not saying the Fire TV does not do what it is supposed to, and it does the things it does very well.  Just make sure you research what it can and cannot do very well before ordering.", "verified": false, "helpfulness": "7/8", "author": "Bill Konecy"}, {"rating": 5.0, "review": "It was more than I expected. I have told my friends to check it out. Movie selection is unbelievable, and I love the voice command. Pick an actor or subject and see what happens! I will be purchasing another unit for another TV of mine. Good job Amazon!", "verified": true, "helpfulness": "0/0", "author": "kathiMcG"}, {"rating": 5.0, "review": "it is the best, and I like all their functions and easy to understand, they are recommend it to all the world", "verified": true, "helpfulness": "0/0", "author": "german pimentel"}, {"rating": 4.0, "review": "We love the ability to watch movies and pictures thru the cloud and to listen to music.  Very good for streaming movies also.", "verified": true, "helpfulness": "0/0", "author": "Paul Rachetto"}, {"rating": 1.0, "review": "Parental Control is worthless. You either block all content or don't block anything and see it all, having kids at home this is a terrible downside,  I did extensive research before buying 2 for home and it never talks about how parental control works,  it just says that it has parental control.  Since this is so important for me, I tried to see how it works in the computer,  well, unfortunately the way it works in the computer is different from the fire TV box. In the computer, you can block by movie/tv rating, letting you see only the movies with ratings you allow.  On the fire TV box is block all or see all, the adult content is very wide and I just cant let my kids exposed to that.", "verified": true, "helpfulness": "24/25", "author": "Amazon Customer"}]