[{"rating": 5.0, "review": "I have three Apple TVs.  Although I have enjoyed them, I purchased this Unit for the home office.It really is amazing!  Purchased the additional game controller and that was a definite plus.  What is really amazing are two things in my mind:1 - Voice search!  Gone are the days of using a remote to try to type in movie, song, or TV Show Titles.  Hold the button, say what you are looking for, and BAM.2 - The load time of the content.  I honestly am not sure how it is accomplished, but when you select something to watch, the content loads almost immediately.  Really well built, solid remote, easy set up.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 4.0, "review": "Great little device!Pros: I love the slim, sleek design so it can be 'hidden' easily. The remote is a nice touch and is also sleek in its design and has voice activation on it. You can install apps like HBOGo, Disney, Netflix, YouTube and more! It has games also and you can purchase a game controller separately or simply use the included remote. You can opt to have a password if you have children which comes in handy so they don't make accidental purchases. Interface is user friendly and it's easy to find shows, movies, and apps... especially since it has voice activation. & lastly, I save so much money not having a cable bill, super plus!Cons: It doesn't have as many shows and movies as Netflix, so if you don't have a subscription to Netflix, then that could be a downside. I had trouble downloading the Netflix app when I first got the fire tv hooked up (note: go to settings, run an update for the fire tv, delete the Netflix app and then reinstall - that worked for me) so far, that's the only cons that I have come across.I haven't had any issues with the wifi, lagging, or anything to that sort. Overall, this product beats Roku by a long haul and I recommend it.", "verified": false, "helpfulness": "0/0", "author": "Trish"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "IBC2004"}, {"rating": 5.0, "review": "Update 6/23/2015: I'm delinquent on updating this review. The Netflix app was fixed a month or so after I initially wrote this review. With that fixed, I give the Fire TV an enthusiastic 5 stars! One of the fun surprise capabilities I stumbled upon is the ability to set the screensaver to show pictures from my Amazon Cloud Drive. After 5 minutes idle, the pics start coming up and that's been a lot of fun.I'm pretty bummed by my Fire TV purchase. I had high hopes given the various reviews, but a key driver for purchasing was to get my Amazon Prime & Netflix choices on one device for ease of use. Unfortunately, Netflix doesn't work on it at all. I saw some people say a recent version of Netflix broke it, but my Fire TV won't even download the application.I have had the Chromecast device for a year and primarily use it for casting various things from my phone. I really like it for that. Adding FTV was a no-brainer based on the reviews to consolidate movie/tv series watching.Things I like about FTV:1. Quick. Navigation doesn't lag. Very smooth. (The more powerful CPU was a motivation to purchase and that was met.)2. Gorgeous pictures on the screen saver. Really impressed!3. Ease of access to Amazon Prime movie/TV content.What I don't like about FTV:1. Netflix not working.Hopefully, the Netflix issue will get straightened out. This is certainly a 4 or 5 star device when this gets corrected.", "verified": true, "helpfulness": "1/1", "author": "Dave Kennedy \"Dave\""}, {"rating": 4.0, "review": "My son bought the Apple tv last year and showed it to me. It was neat. This year I have Amazon Fire tv and I can say more than ever...Amazon Fire blows that apple thing away!!!! His always gets stuck and buffers constantly. NOT MY Amazon! Ha Ha Son!!!! :) Love Amazon!", "verified": true, "helpfulness": "0/0", "author": "Mary Hoke"}, {"rating": 5.0, "review": "Getting the movies I want by just naming them is ideal. No more laborious hunt and peck labors on the keyboard. If you have Amazon prime you get instant access to 40,000 movies and most of the service providers like Netfix, Hulu, etc. You'll love it.", "verified": true, "helpfulness": "0/0", "author": "Arnold Asrelsky"}, {"rating": 5.0, "review": "This thing is great.  very snappy menus .  no lag at all .", "verified": true, "helpfulness": "0/0", "author": "Pete s"}, {"rating": 4.0, "review": "Even at 89 with no cell phone or computer experience, with a little training and after 3 inadvertent purchases, I can consistently use the Watch ESPN app.  Couldn't be happier.", "verified": true, "helpfulness": "1/1", "author": "GEORGIA BUCHTA"}, {"rating": 3.0, "review": "I purchased two Fire TV Sticks In addition to the Fire TV.  I also use the Roku 2, Roku 3 and Google Chromecast.  Fire TV is superior in some important aspects, for example, the YouTube interface on Fire TV responds better than Roku's.  But there are problems, the biggest of which is that Netflix causes Fire TV to crash once in a while on all three of my Fire TV devices.  Maddening.  Amazon's video services eclipse Netflix on the main interface - which would be fine if they had anything worth watching.  In my demographic (age 60+) it is a poor selection.  Also, more apps are needed.  Fire TV is in its infancy but Amazon is off to a solid start.  A little more work on Amazon's part and I will be giving the Fire TV five stars.", "verified": true, "helpfulness": "2/2", "author": "D. Barnes"}, {"rating": 3.0, "review": "Disappointed with the free movies. My 12 yo doesn't quite like movies that are three times her age, nor does her mother. Lots of kiddie shows though for young ones. Just nothing for this age group. Unless you fork over a payment every time you watch it. And is this supposed to stay powered on all the time? Or is there a way to shut it off when not in use?Maybe I'm just in the know of utilizing this to its capacity. Suggestions??? I'm not a gamer.", "verified": true, "helpfulness": "1/1", "author": "V. Berrios"}]