[{"rating": 5.0, "review": "great product! links up to fire phone", "verified": true, "helpfulness": "0/0", "author": "Elliot B Graham"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/1", "author": "mamadou"}, {"rating": 5.0, "review": "Love, love, love it.  So much eaiser to use than our ps3. One of those things I didn't know I needed till I had it!", "verified": true, "helpfulness": "0/0", "author": "Nichole Horner"}, {"rating": 5.0, "review": "Can't stop watching. The best!!!", "verified": true, "helpfulness": "0/0", "author": "Phyllis"}, {"rating": 5.0, "review": "very happy so far", "verified": true, "helpfulness": "0/0", "author": "brent beacker"}, {"rating": 3.0, "review": "Hard to find free amazon prime movies.", "verified": true, "helpfulness": "0/0", "author": "Ronald"}, {"rating": 5.0, "review": "Best thing since slice bread! I can not believe how awesome Fire TV is. Love Amazon's original content, Alpha House and White Queen. We were skeptical at first that we would have streaming problems. So far we have had very few streaming problems. We are in a very rural area so our internet isn't the greatest. The only problem will be that we won't be able to watch our favorite baseball team's games when we cut our ties to Dish. But then, we will be saving a ton of money so we will deal with it. We also subscribed to Prime and the perks are awesome. Thank you Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Pamela A Demko"}, {"rating": 5.0, "review": "Best investment I made this year, because  I save a lot of money!  Not only can I control what I watch, when I want to (advertisement free), I can stop and watch it later, or not watch it at all. I can also pause the show, rewind or fast forward it.  I'm in control and I love that!  I love the Amazon Voice search, my grandkids cant read or search, and they get a kick out of using it. I'd recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "Donna Ferrari"}, {"rating": 5.0, "review": "Love!!!", "verified": true, "helpfulness": "0/0", "author": "Jeleigh21 \"Jeleigh21\""}, {"rating": 5.0, "review": "Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Hammeister"}]