[{"rating": 5.0, "review": "Bought them used. Work just like new. Lots of apps available (the almost-teenager LOVES that). Easiest remote on the planet. The voice-recognition is out of this world. Even if she's half-asleep or has a mouthful of food (I DID mention she's a heathen/almost-teenager, right?) it STILL understands her perfectly. Even when I can't. Plus the convenience of the Netflix app right there, and there's so much available on Prime...", "verified": true, "helpfulness": "0/0", "author": "veja_1"}, {"rating": 4.0, "review": "I'm saving money not using cable anymore. I bought a Mohu antenna for eachTV so we can pickup the local channels and Amazon Fire TV does a great job of getting meto Netflix, Hulu, Amazon and so many additional options, some of which have a costbut many of which are FREE.  I love it. NO MORE FEES GOING FORWARD. Thatmeans I can invest it, save it, spend it or give it away!The point is, I get to choose what I pay for. With cable or satellite, I have to pay fora package, maybe get locked into a contract AND I don't get to choose what is inthe package so I am paying for things I don't want and the cost is simply, way too much!Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "gsw2243"}, {"rating": 5.0, "review": "It's really good I am glad I bought this streaming video box I have 2 roku and a wd live box also a Logitech Google tv box but the fire tv is better in my opinion.so I recommend this item to friends and family", "verified": true, "helpfulness": "0/0", "author": "Jose R Rodriguez"}, {"rating": 5.0, "review": "Waaay past my expectations, great piece of equipment. I will always refer to others. :)", "verified": true, "helpfulness": "0/0", "author": "Don Orosco"}, {"rating": 3.0, "review": "It's ok nothing greatI need greatness from Amazon", "verified": true, "helpfulness": "0/0", "author": "watch lover"}, {"rating": 5.0, "review": "I'm actually really impressed with this unit. We had a chrome cast, and I honestly didn't think it would be that much different, but we got this with the Sling box special. Turned out to run much smoother than the cromecast. The benefit of it running through the box instead of casting from the phone speeds up the process a great deal. I think it was well worth the money we spent on it.", "verified": true, "helpfulness": "0/0", "author": "D.R. Johnson"}, {"rating": 5.0, "review": "My wife loves Fire TV.  It is quick and easy to use.  I would recommend to anyone interested.", "verified": true, "helpfulness": "0/0", "author": "JohnB"}, {"rating": 4.0, "review": "Shipping was off stated date, but everything was as advertised. Thanks.", "verified": true, "helpfulness": "0/0", "author": "R S Hutson"}, {"rating": 5.0, "review": "I really like my fire tv, it allows me to watch a lot of different thing, I wouldn't be able too without it.", "verified": true, "helpfulness": "0/0", "author": "Gale Cherrie"}, {"rating": 4.0, "review": "I received this as a present from my boyfriend and I love it! I would have never thought to buy this for myself but it makes watching all my TV shows so easy and convenient. Highly recommended. One downside is the Comcast is not currently supporting HBO Go through Amazon Fire TV which is annoying.", "verified": true, "helpfulness": "0/0", "author": "Sabrina"}]