[{"rating": 5.0, "review": "What a great deal for me.  I've enjoyed many Prime offerings, and although it doesn't offer some of the shows I'd like to see for free, overall the purchase was a positive one.", "verified": true, "helpfulness": "0/0", "author": "Tucsonian \"Kittymom\""}, {"rating": 4.0, "review": "Does not always sync with your other devices and show where you were at when last viewed.", "verified": true, "helpfulness": "0/0", "author": "Thomas R. Woods"}, {"rating": 5.0, "review": "So i purchased both a Fire TV and a Roku 3 streaming media player. The Roku 3 was good but nothing compared to the Amazon Fire TV. The biggest thing is the Speed. Roku 3 was just to slow for our internet connection. It did have added channels and features that the Fire TV didn't but in my opinion this is all about the speed. The speed of the Fire TV is unmatched! For us the Fire TV will start and load in 10 to 15 seconds the Roku was 45 to 50 seconds to load. Have heard people love the Roku 3 and I could see that if you have a really good internet connection. For us the speed and functionality of the Fire TV were hands down better. Thanks Amazon another great product.", "verified": true, "helpfulness": "0/0", "author": "MT Admin"}, {"rating": 1.0, "review": "the slowest downloading of any system I've used. Easy set up,  but not worth the money. You need to subscribe to Amazon Prime just to get any worthwhile programming, and even then, need to pay for any movies or tv not streaming over Prime. I get around 30 to 45 seconds of program, then about 5 to 10 minutes of buffering.", "verified": true, "helpfulness": "2/9", "author": "lynn geffe"}, {"rating": 5.0, "review": "My family and I are very pleased!", "verified": true, "helpfulness": "0/0", "author": "Mrs. C"}, {"rating": 5.0, "review": "I absolutely love my Fire TV.  This turns any TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Denise Mcfarland \"amebrisee\""}, {"rating": 5.0, "review": "love it still learning but like the idea", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A little hard to get the hang of but overall great.", "verified": true, "helpfulness": "0/0", "author": "Robert madden"}, {"rating": 5.0, "review": "I love my fire TV.  It is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "I didn't use it and returned", "verified": true, "helpfulness": "0/2", "author": "Sunny Cherian \"beefman\""}]