[{"rating": 5.0, "review": "Boy do we enjoy this, and so easy to use.  We are not techies either, so that's saying a lot.", "verified": true, "helpfulness": "1/1", "author": "Susan Benson \"postal lady\""}, {"rating": 4.0, "review": "Only reason I gave 4 star because it is pain full to find free movies as a Prime member.", "verified": true, "helpfulness": "0/0", "author": "DBA"}, {"rating": 5.0, "review": "I bought the Fire TV to replace my Apple TVs. It is much faster and has much better wifi reception than the Apple TV. Having access to the Prime Instant Video library makes it even better. The only negative I have on it is the remote is pretty small, so it is easy to misplace.", "verified": true, "helpfulness": "1/1", "author": "go bucs"}, {"rating": 5.0, "review": "The Amazon Fire TV is a juggernaut. First and foremost, you can easily install XBMC on it. But more importantly, after installing XBMC - I never use it. Prime has everything you need! If not, open up Hulu and find it there.On a hardware level, this thing blows the Apple TV away. On top of that, it preloads relevant programming when you turn it on. You breeze through menus and then the content plays instantly. Brilliant.The voice search is very useful. I wasn't sure it would be. It doesn't recognize the word Zack (Tirsack Braff), but I haven't been able to trick it with anything else.I can't recommend this enough.", "verified": true, "helpfulness": "1/1", "author": "Kevin E. Scampoli"}, {"rating": 5.0, "review": "I love it.I saw some of the 1 star reviews and couldnt believe the problems.I havent had any problems with this except when i first turned it on.But that was due to it needing an update. I do feel they should mention that somewhere or when it first started up it should have updated. You need to leave it alone for 5 hours for it to update by itself or you can manualy do it, thats hwo you get your music library.Besides that its awesome. When you have everything off and you hit a button on the fire controller it turns on the fire tv , turns on your tv and changes your tv's input to the fire tv from whatever it was on before.if you are watching cable and decide to switch to fire tv just push the fire tv button and it switches the tv's input for you.I think thats cool.I havent had any problems streaming i tried a few games, do think there should be a way to search just the free games though.plays all my music ive ever bought, not ready for prime music yet but since they just came out with that anyway i would expect it wasnt set up for it.Additional INFOMake sure you have a great internet planYou dont realize when you are watching movie after movie after tv show etc that you suck up alot of broadbandI hope you are like me and dont have a limit but if you do then keep an eye on itI went thru 225gigs in one month lol", "verified": true, "helpfulness": "0/0", "author": "RR"}, {"rating": 5.0, "review": "Does amazing things if you know how to use it.", "verified": true, "helpfulness": "0/1", "author": "R. Sipe"}, {"rating": 5.0, "review": "I really didn't think that I would like any streaming product on the market but to my surprise & delight I love Amazon Fire TV. I watch programs using Amazon Fire TV more than what is available on cable or Direct TV. I was hooked on my 1st Amazon Fire TV that I set up in my family room that I bought my 2nd Amazon Fire TV for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. I also have a Chromecast and have almost stop using it. The one thing that it doesn't do as well as the Chromecast is play YouTube video. Using the VCR controls hangs the video for me. No big deal. Netflix and the Amazon Prime work great.I really appreciate the bluetooth connectivity. I was able to velcro the Fire TV to the back of my TV. So, no visible wires.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm thinking of dumping all my cable movie channels. With Fire and Netflix I can watch an enormous amount of programming while (for a small fee) using Netflix to augment the Fire service. The interface is a little juvenile and the controls are a bit wonky but this is at the early stage and Amazon always has a tendency to improve with time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Local 26\""}, {"rating": 5.0, "review": "The Amazon Fire TV works very well and is easy to operate.  The programming content was good but I'd love to see HGTV programs.  Overall I'm very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Robert N"}]