[{"rating": 3.0, "review": "If you have family using it and you lock out purchases from your account with a pin code, then they can't add any free apps, free music, or free movies either. It's an all or nothing deal.So basically your grandma can buy anything by accident and charge your account. Or get frustrated with pin code input boxes popping up on every little thing she does, and not use it at all.Bit of a disappointment there.﻿", "verified": true, "helpfulness": "1/1", "author": "Sean"}, {"rating": 5.0, "review": "nice stuff", "verified": true, "helpfulness": "0/1", "author": "Tron"}, {"rating": 5.0, "review": "no more cable", "verified": true, "helpfulness": "0/1", "author": "O's Ma \"Lisa\""}, {"rating": 5.0, "review": "Best streaming device, I absolutely love it. Hope to see HBOGo on it", "verified": true, "helpfulness": "0/1", "author": "Kamran Mohajer"}, {"rating": 5.0, "review": "A \"techy\" person I am not so if you are looking for a very technical review I am not the writer. I am just an ordinary woman out here who wanted a Fire TV. I am simply amazed at this technology. To able to speak into a remote and have it bring up the movie on my screen is awesome. I love this item. It has beautiful screen savers and other features that are remarkable as well. The set up is so simple even I could do it. I am really enjoying this item so much I can't recommend it enough. I know this is a very plain and simple review but some of this really technological information is just too much for me. But if you want just a simple review this is it. I say buy it for the price, if you have Prime Membership, it is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "redsilk46"}, {"rating": 5.0, "review": "Day one, there was some hiccups trying to figure out how to get my music on the device. But once that was figured out I couldn't be anything but happier. I am so happy with this device and service. Amazon does it again!!! The one huge selling point is that I can hardwired the device directly to my router. No searching for wifi or long buffering time, like with my previous Roku device.", "verified": true, "helpfulness": "0/0", "author": "N. Ball \"Naxia\""}, {"rating": 5.0, "review": "this so so much better than the netgear I had been using.  it must be 100 times better.  I had been blaming my internet provider.  it is not also faster but now netflix has the movies divided up into more categories. no constant rebuffering.  I can pause without worrying about losing it completely.  it cost twice as much but well worth it.  Thank you Kim Komando, your review was right on.", "verified": true, "helpfulness": "0/0", "author": "carolyn \"Carolyn Gibson\""}, {"rating": 5.0, "review": "Where in the world can you find something similar to Prime.At a costs $99 for a full year ( $8.25 monthly) (27 cents a day) touch every aspect of your electronic life.Internet buying: Almost all the products you buy through Amazon will reach you in two days at no cost.The Amazon Cloud allows you to storage  music that you have downloaded free or at a cost from hundred of thousands of tunes.The Amazon Library,with thousands of books to download free or at a price and start reading them in your computer and continue in your smart phone and finish them in your IPad or Kindle tablet, all this starting in the page you had left previously.And Fire TV came and a complete new world started at a one time $99 investment. With access to thousands of free Prime Movies and TV programs. Games, Netflix, PBS...,  a connection to the Amazon Cloud where now you can with a simple download of your photos to the cloud, see them in your TV.Hear your downloaded music , thru the magic of Fire TV in your  TV, computer,..........Where in the world will you receive so much for so little. Yesterday I connected to PLUTO TV, more than 120 channels ,all through the Fire TV.  Waiting for the release of the new house robot.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I didn't know what to expect, but now we are ready to cut cable and stick with Amazon TV!We purchased this because we didn't have cable wired in several bedrooms in our new home, and cable service with wireless receivers are not available in this area.Within minutes of opening the box, we we're logged on, and ready to go!  We also bought the Amazon game controller, and my son really enjoys playing the games.I love my Amazon TV!  So much so we ordered another one, and the new Fire Stick that is coming out.", "verified": true, "helpfulness": "0/0", "author": "Cuddle Mom MI \"Cuddle Mom MI\""}, {"rating": 5.0, "review": "So far so good.", "verified": true, "helpfulness": "0/1", "author": "scennimo"}]