[{"rating": 4.0, "review": "Excellent product! Great picture quality and ease if use. Would recommend to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Dennis Butler"}, {"rating": 3.0, "review": "You pay all that money for it and then you can't do anything without a subscription. A lot of the subscriptions (if I had them) I can watch on my daughter's xbox. So, if you don't pay for netflix or have amazon prime then you are very limited on what you can do.", "verified": true, "helpfulness": "0/0", "author": "Stacey A. Spears"}, {"rating": 5.0, "review": "Absoluetly love it, i bought it and got rid of cable. I love sitting in bed and watch what i want, when i want. I have hulu plus, amazon prime, and netflixs. I finally bought one for living room and my parents house. I was tempted to take it on vacation. I love the games too. Serv zero is fun to play with husband while i \"help\" on kindle tablet. I can not imagine life without in now, not sure why I was paying for cable for the pleasure of thousands of shows that I would not watch.", "verified": true, "helpfulness": "0/0", "author": "Sarah Mains"}, {"rating": 5.0, "review": "The best, simply the best. Go absolutely basic cable or satellite or none at all and go with Amazon Fire TV for your viewing entertainment. There is none better. This ia it. Stop looking. Make a decision and take action. Choose Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "The Counselor \"Tom\""}, {"rating": 5.0, "review": "MUCH better than my Apple TV.  Easy to use and very versatile for any Internet viewing need.  Intuitive controls.  The best remote I've used.", "verified": true, "helpfulness": "0/0", "author": "Tom Fox"}, {"rating": 5.0, "review": "Very useful product.", "verified": true, "helpfulness": "0/0", "author": "Arun Ballari"}, {"rating": 3.0, "review": "I'm still finding out what all there is.  First it's confusing when trying to select a movie and  then find it costs until you click on it.  Some of the rentals are way out of line.  What's free with amazon prime and what's not is mixed together and this is frustrating. Separate totaty what is free, instead of goading someone on and wasting time.  I also didn't find just Hulu (not Hulu plus) in the app store.  When watching thru amazon fire I get a lot of freeze ups waiting for loading and also during playing I get picture lagging the sound.  I have high speed internet,  this doesn't happen when watching directing from a computer to my tv.for instance on Hulu.", "verified": true, "helpfulness": "0/0", "author": "Marley Bruns"}, {"rating": 5.0, "review": "very cool", "verified": true, "helpfulness": "0/0", "author": "M.T."}, {"rating": 5.0, "review": "After using a variety of streaming devices (Roku, Wii, etc.) I am amazed how fast and responsive the Fire TV unit is.  (Think of a wired mouse click, that's how fast.)  The voice search feature has been flawless and the video/audio quality is superb - I'm using a MediaBridge HDMI cable, Pioneer SC-1223-K 7.2 receiver, Pioneer plasma TV, Verizon FiOS Broadband.  The set-up was smooth and from start-to-finish took about 5 minutes.  I'm glad there weren't any hiccups.I purchased this during a holiday $79 special and from what I've experienced so far, that's quite a bargain.", "verified": true, "helpfulness": "0/0", "author": "Jack Sonnet \"Dee\""}, {"rating": 3.0, "review": "Disappointed on how many OLD movies are rentals only, even with Prime membership.  I have better access to free movies on cable but I guess this is how Amazon makes its money.  Voice activation does work well.", "verified": true, "helpfulness": "0/1", "author": "Christine Laydon"}]