[{"rating": 4.0, "review": "Works great, love the Bluetooth remote.  Only complaint and it is not a deal breaker is a very light background to picture. Black background as in starry night is not, sorta White/foggy ???  Have not used other devices to know if normal.", "verified": true, "helpfulness": "0/0", "author": "MARK"}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/2", "author": "John David Vasquez"}, {"rating": 1.0, "review": "I purchased this product as I was convinced it would provide superior picture quality and processing speed than my current Roku.  What I found was this product is basically a device dedicated to interact with and promote the Amazon's prime TV streaming site.  The anime and other sites I subscribe to are incompatible with Amazon fire TV.  IF YOU SUBSCRIBE TO OR WATCH CRUNCHROLL OR FUNIMATION or other such sites, THEY WILL NOT WORK WITH THIS PRODUCT! It is rare that I am disappointed in Amazon but this is one of those times.", "verified": true, "helpfulness": "3/9", "author": "Amazon Customer \"Bob C\""}, {"rating": 1.0, "review": "Cost 2 dollars more to order any movie from Amazon Fire TV. So like Comcast better.", "verified": true, "helpfulness": "2/10", "author": "sergio araujo"}, {"rating": 3.0, "review": "Easy to set up but was surprised that so many selections had additional charges.", "verified": true, "helpfulness": "1/3", "author": "Georgia Martin"}, {"rating": 1.0, "review": "Just no good", "verified": true, "helpfulness": "1/13", "author": "Yo"}, {"rating": 5.0, "review": "Everything I expected. Movie look high quality with no interruption. Plenty pf movie to choose from since I'm a prime member.  Easy set up. I recommend this product.", "verified": true, "helpfulness": "1/1", "author": "SamChez"}, {"rating": 3.0, "review": "This product has so much potential, however Amazon is more keen on selling online content, that it does not quit meet the expectations I had for it. When doing a search for say, South Park. The results prompted the available video packages Amazon is selling, however did not show that Hulu Plus was offering the entire series. You can either sell online content or hardware for viewing online content, but you cannot easily do both. If they can correct this flaw, Amazon Fire TV has infinite potential, however the avarice always wins out, and this streaming device will loose out to Roku every time.", "verified": true, "helpfulness": "2/5", "author": "Josh1776"}, {"rating": 4.0, "review": "Need more classic movies on prime, otherwise a great device.", "verified": true, "helpfulness": "2/2", "author": "Robin Warniment"}, {"rating": 5.0, "review": "Love it. The only thing that would make it any better would be to include the HDMI cable, since you cannot use the box without it. But I'm repeating myself - we love it! My husband connected it to our AV receiver using a digital optical cable and it is better than going to a movie theatre. Now I have my own movie theatre at home. And love the voice recognition on the remote. Thank you Amazon!", "verified": true, "helpfulness": "1/1", "author": "vcbstar \"vcb\""}]