[{"rating": 1.0, "review": "no said if you have a smart tv you don't this fire tv  have spend money I didn't need too", "verified": true, "helpfulness": "2/23", "author": "w.kay chapman"}, {"rating": 5.0, "review": "I think it's great.  Going to send back the DVd player that I am paying for monthly and some other charges.  Should save me quite a bit.  Easy to operate, and I like the  voice activation feature.", "verified": true, "helpfulness": "1/1", "author": "terry"}, {"rating": 1.0, "review": "Product works well, but Amazon has totally snubbed their \"Prime\" ary users. We pay a premium for the service, but can't access \"Prime\" easily. Makes me think Roku is the way to go.", "verified": true, "helpfulness": "3/19", "author": "Jeffrey Ward"}, {"rating": 5.0, "review": "I have Prime and found some things I wanted to watch that were on Prime, not on Netflix and for purchase on Apple TV. So, decided to purchase the Fire TV. It is great. Just plugged it in and it worked. No problems! I use an ethernet cable but the service is even more reliable and loads more quickly then Apple tv.  It does not have all the cable tv channel options of Apple TV, but has Showtime with HBO to come soom. All in all, this is a great device.", "verified": true, "helpfulness": "1/2", "author": "NEgranny \"Reader1\""}, {"rating": 5.0, "review": "Easy to install, other than plugging it in it was hands off.  Found my wireless network immediately and was able to log on simply.  Voice search works well, as does the screen search off the easy to use remote.  Very satisfied with the video performance as well, no lag, sound is good.  I also like the screen saver.  Great product over all.", "verified": true, "helpfulness": "5/5", "author": "Jim Richardson"}, {"rating": 5.0, "review": "Amazon fire tv is the ultimate tv too box I would say it is on fire get one today while you still can", "verified": false, "helpfulness": "1/4", "author": "Jason Beddingfield"}, {"rating": 3.0, "review": "It's ok but I cannot get certain apps that I just to get with my roku.  ,,,like the pbs app that I really enjoy", "verified": true, "helpfulness": "0/5", "author": "Texas"}, {"rating": 2.0, "review": "With Roku being able to filter out the paid content Amazon Prime actually is worth using.  Since Fire TV is UNABLE to filter these out it is no good for people who subscribe to Amazon Prime.This is no surprise though.  Since Amazon controls this device and I am sure they feel that forcing people to see all these paid programs is beneficial to them and will cause people to buy the programs.I have no access to what percent of people make impulse purchases while using Amazon Prime but I do have access to friends and family who all have the same response. Almost EVERY person I know has Amazon Prime by default (for the free shipping) yet almost all of them still buy Netflix because they find Amazon Prime is too difficult to use for free only content.  The people I know that have ONLY Amazon Prime for their video services all use Roku which makes it easier to navigate.So if they fix that issue and add HBO GO then problem will be solved.HBO GO is important to DirectTV subscribers that don't have on demand set top boxes or don't have Ethernet cables run to the set top boxes (since at least some or maybe many don't have Wi-Fi).  DirectTV has NO on demand unless you have one of those updated boxes and have it connected to Ethernet (at least for mine)So I use a Roku to watch my HBO on demand shows.----------The biggest disconnect though is simply the inability to filter out the paid video content.", "verified": false, "helpfulness": "6/15", "author": "William D. Mruphy \"simrace\""}, {"rating": 5.0, "review": "I have Apple TV and Roku and so far I prefer the Amazon Fire over both.  The Fire is fast and easy to use and so far it has been great to use.", "verified": true, "helpfulness": "0/1", "author": "Tyson S \"T2Stull\""}, {"rating": 3.0, "review": "First of all, lets get to a BIG issue. This by NO means is 1080 resolution. I compare direct TV and my Hi-Def DVD player and positively the resolution is not there. What they give you is color saturation that isn't anything like reality, but young kids will love the circus reds and greens etc.Most of us want realism, and what looks like our real world, not so much color that it clearly looks \"Phony.\"Everything looks like the colorized old movies no one likes.All peoples faces are just muted like they have tons of make-up on and no hair on face, everyone looks alike ,blemished or any detail is NOT seen. To see pores or hair stubble or tiny acne scars won't happen with this set-up, and I'm so very disappointed because I LOVE DETAIL and hi-resolution. Instead they use the bandwidth to shove glaring oranges and greens at us as if were in kindergarten.ALSO: I see I now must find a film, one by one and not page by page. I have 415 in my watch-list and MUST scroll through the whole list one at a time to find something. JUST AWFUL!!!The screen print is so small I find it hard to read even on a 50 inch Sony screen at only 15 feet away.It's very fast for sure ,and fairly intuitive. It's as small as two decks of cards and remote can get lost in one hand.If it weren't for added speed I would send this back and am still thinking about it. It does make some older films, especially in b/w look better for sure I see. It has fixed the stop and go problems with even Netflix as well so that's a big plus.It would be so much better to allow us to put films in folders to cut down traffic and time but no such luck. If I didn't own this...that would be fine, and wouldn't miss much at all I'm sorry to say because I used to LOVE Amazon, but lately they are getting like everyone else...forgetting who pays the bills and creates their jobs. A lot of mistakes in customer service in last three months I've noticed and that was never like that before.Bring back the old Amazon please.", "verified": true, "helpfulness": "3/9", "author": "dennis \"Florida\""}]