[{"rating": 5.0, "review": "works great. There is one thing I don't like about it. Its hard to make it 4 stars over it but when you voice search within Netflix it doesn't search within netfix. It searches all for the movie or show I voice search for it should search within Netflix if I am already in Netflix. I could see it searching for all if I am at the main menu but it should search within what ever app I am currently in.", "verified": true, "helpfulness": "0/0", "author": "jd"}, {"rating": 5.0, "review": "Awesome machine...Streams movies and shows very nicely.  Games are very entertaining and fun.  The just updated USB Storage feature so additional storage is nice.  Only thing I do not like is that the Music section is still unavailable, but sure that will be opened up sometime in the near future.  Both remote and Gamepad work great and are very responsive.  Voice search is nice for Amazon, too bad it doesn't work for other services like Netflix.  Goes great with Prime membership and finally able to use Amazon Coins for purchasing apps.  Picture and sound are great on our Sony 60\" TV..very happy with this addition to our home entertainment...Planning on buying 2 more for living room and daughters room.", "verified": true, "helpfulness": "0/0", "author": "ultra55371"}, {"rating": 4.0, "review": "works as described.", "verified": true, "helpfulness": "0/0", "author": "bjbmilwaukie"}, {"rating": 5.0, "review": "We love this device so far. It has killed our cabin fever. I do wish that when you search that it brought up the watch list items first if they are there. Now this may be inexperience. The tutorial could be much better and they should have free video helpful hints you could watch to get the most out of your device.", "verified": true, "helpfulness": "0/0", "author": "carol gerling"}, {"rating": 5.0, "review": "So far so good. Really can't complain. The price was good and many options to choose from movies, shows and games.", "verified": true, "helpfulness": "0/0", "author": "Elisa B"}, {"rating": 2.0, "review": "No Hdmi cord and I have to re plug my new cord every time to get the sound to work", "verified": true, "helpfulness": "0/2", "author": "Steven Jones"}, {"rating": 5.0, "review": "Simply awesome! M glad I bought it!", "verified": true, "helpfulness": "0/0", "author": "reema baweja"}, {"rating": 1.0, "review": "it basically sucks.  snap crackle and pops, times out and will not play a show or move all the way through without timing out. and aperarntly Amazon wont let me return it or get a new one", "verified": true, "helpfulness": "1/6", "author": "pttrailerman"}, {"rating": 3.0, "review": "Used to love it. For some reason it will work perfectly for a few hours and then lose connection ever minute or less! It's very hit or miss and I'm starting to get very disappointed and embarrassed that I recommended this to friends and family. I'm about ready to throw this out the window!", "verified": true, "helpfulness": "0/0", "author": "Maggie"}, {"rating": 3.0, "review": "I bought this for Amazon movies and MLB TV. Amazon works brilliantly. MLB is pretty much awful. Would have got the Roku instead next time and probably still will because the MLB App is so poor. It's crashed and even has bugs that makes it impossible to watch a game. I've called MLB but it's really not their fault. My old Roku still plays those games fine but the video quality is poor due to the age of the Roku.", "verified": true, "helpfulness": "2/2", "author": "Shelly"}]