[{"rating": 3.0, "review": "I little disappointed in the fact there isn't more content but some of the content that is available is very good. The unit was very easy to use and setup no complaints in that department. The movie selection was mostly you have to buy it and these aren't even movies that are within 5 years from release dates.", "verified": true, "helpfulness": "0/1", "author": "LOVE IT OR LEAVE IT"}, {"rating": 5.0, "review": "I love my fire TV. I \"unplugged\" 2 months ago and was using Apple TV for Ethernet and my vizio TV's amazon app wirelessly. But that app and others on that TV has issues so I switched to fire TV for Ethernet access. Much better than apply TV. The voice activation is pretty accurate as far as understanding me (that part is very good) and finding what I'm asking (I sometimes give actors or actresses to get at shows ir movies and does a decent job). Get it!!", "verified": true, "helpfulness": "0/0", "author": "Irishmeg"}, {"rating": 4.0, "review": "Better than expected, I have only had it for a  week still getting used to it,think it be ok.", "verified": true, "helpfulness": "1/1", "author": "gary manor"}, {"rating": 5.0, "review": "If you are an Amazon Prime member you will find this very useful and handy to have.", "verified": true, "helpfulness": "0/1", "author": "Richard Skelton"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Song Seungho"}, {"rating": 1.0, "review": "This 1-star review is very similar to every other 1-star review for Amazon fire TV in that it just does not work.  I would consider myself more technologically advanced than most and after trying all user fixes and working with Amazon customer service I have decided the units they are shipping out are just not quality units.  I ordered 1 fire TV unit last week and it did not work so after customer service ran me through the trouble shooting steps (which I completed before speaking with them but decided to humor them anyways) they recommended I send the unit back and receive a replacement unit.  This yielded no change in that Netflix and Amazon videos simply just will not load.  I am sending unit #2 back shortly and have already ordered a Roku 3 in hopes it will at least function as advertised.**Update for 11/20/14:  I called Amazon back to get a refund on this item and I was first directed to a random customer service rep who then directed me to another customer service rep specifically for Fire TV.  I explained to this rep that I had completed all of the troubleshooting possibilities explained to me by the last (very knowledgeable and from the USA) rep.  I humored her and completed factory resets, application data and cache clearing, etc etc etc...still to no avail.  She then still tried to get me to get another replacement unit after I explained to her three times I did not want a replacement just a refund.  I finally had to spell out in a louder than normal voice that I just wanted to return the item.  Worst experience ever with Amazon and cannot say I will ever consider buying a piece of technology from the company based on this experience.", "verified": true, "helpfulness": "5/11", "author": "l02431j"}, {"rating": 5.0, "review": "Exelente product", "verified": true, "helpfulness": "0/1", "author": "Javy"}, {"rating": 5.0, "review": "Love my Amazon Fire!", "verified": true, "helpfulness": "0/1", "author": "Diane C. Ryan"}, {"rating": 3.0, "review": "The user interface is not quite as easy as i would expect. I wish the voice navigation would allow you to open apps etc.", "verified": true, "helpfulness": "1/2", "author": "JJ"}, {"rating": 5.0, "review": "I have had this product for about two months and really love it. It took just a bit of getting used to because it doesn't function exactly like I'm used to with other electronics, but I got the hang easily and now it's a breeze. I'm a prime member so there is lots of content for myself and my 4-year old to enjoy!", "verified": true, "helpfulness": "1/1", "author": "S. E. Hendricks"}]