[{"rating": 5.0, "review": "Comparisons with other similar devices ? This  does much the same things but with one big difference and that I believe is the faster  data transfer rate which means you can watch a movie without the breaks that happen when the device cant provide the images fast enough. Who needs long thick WiFi cables snaking across the carpet? Wish they would incorporate the ability to WiFi films from my PBS across, sound and images .", "verified": true, "helpfulness": "1/1", "author": "Lincsbairn \"shoppertoo\""}, {"rating": 4.0, "review": "The Fire TV is great, the hardware is awesome and the ability to stream games is something that for a person like myself makes it the only viable option when it comes to Internet TV boxes.The only reason I'm giving it a 4 is the lack of apps, more specifically HBO Go. Amazon should have waited to lunch this with HBO on board.Otherwise the device is great, super fast, voice search is awesome, gaming is fun. Great product overall.", "verified": true, "helpfulness": "0/1", "author": "Dava"}, {"rating": 5.0, "review": "Our main TV and DVD didn't get Amazon Prime Movies, so when I got the notice of the Amazon Fire, I thought it would fit the bill.  I set it up in minutes, and it works beautifully.  I did have to make one adjustment (Zone 2 on our Oknyo receiver can only handle analog sound, and the Fire only puts out digital sound).  Very easily, I got from Amazon a digital-to-analog converter (OREI DA9) for about $25, and that solved the problem.  The HDMI-out goes to the receiver for TV sound, and the optical audio-out goes to the little Orei converter box, then I connected the analog-out from the Orei to the analog-in for the channel in the receiver I use for Zone 2.  This would also work if you have an analog-only sound bar for your TV.  Anyway, the interface for the Fire is very clean and easy to use, and the voice recognition is stunningly accurate (and I'm from East Tennessee with what might euphemistically be called an accent).  The Fire found my Wi-Fi quickly, updated its firmware immediately, then led me through a brief tutorial.  We watched our first movie the night the Fire was delivered.  I would follow the recommendation to put the Fire out in the open to pick up your Wi-Fi signal more easily.  It is so small that it won't mess up your decor.  It has a sleep function and thus consumes very little power when not in use and will update itself as necessary.  Watching free Amazon Prime movies, say, once a week will repay the cost of this setup in just a few months.", "verified": true, "helpfulness": "2/2", "author": "A. Matheny"}, {"rating": 5.0, "review": "So simple to install and so easy to use.  Amazon Fire TV is everything i hoped it would be and more.", "verified": true, "helpfulness": "0/0", "author": "henry d hale"}, {"rating": 1.0, "review": "I'm ready for the backlash. This box has the worst, most convoluted, annoying user interface I have experienced. Unbelievably limited options for customization. Extremely limited support for \"open\" uses. The hardware is great, and it is completely ruined by the ridiculous choices made by the Software Dev team. Even with prime...which you are basically bullied into if you want even some kind of limited useful and friendly usage the box still sucks. VERY disappointed here. Do not look to replace a Roku 3 with this crap, that is all hype or fanboy rhetoric. I don't even love my roku 3 but it is miles beyond this thing when it comes to usability, and a well thought out UI. I listened to all the crap posted about how great this box is and bought into it, huge mistake. I even used fast shipping because that is the only way I could get it on an available day due to Amazons new and much worse shipping policies. So, I'll chalk that loss up to my own stupidity for pulling the trigger.Want details....Ok. Here is the main important one, the box does a lot of things and it does them all badly. It doesn't really have any strengths other than build quality and specs for me to point out. What good are specs if they limit your ability to make use of them? Put in another $50 or so and get one of these barebones media pc configs with an APU, you will be infinitely more satisfied.Sour grapes? I admit, I've got them...They aren't turning to wine either.", "verified": true, "helpfulness": "18/36", "author": "Joshua Pfister"}, {"rating": 1.0, "review": "I bought this for watching my movies that I have. It lost points when I tried to get Ebru tv on it and had to pay to order it. They lied to me about my Roku that DishWorld is on. I got Bloomberg TV. I quickly sold it so that I can get DishWorld for $14.95 a month and be able to watch Netflix, WWE Network, Hulu Plus, EbruTV, TBN, Watch ESPN, English Sports, Manga, and many more. Will I recomend this to people the answer is NO. I would tell them to order DishWorld because they get a Roku LT and can order the channels they want.", "verified": false, "helpfulness": "3/22", "author": "Carey Terkelson"}, {"rating": 5.0, "review": "Easy to love.  I have a Roku 3 so I naturally compared the Fire TV to it.*Easiest TV 'device' setup I have ever experienced.  I really appreciated the animated explanation that runs when it starts up (after updates have been downloaded and installed).*Intuitive, relatively clean interface.  Not hard to figure out and get around using remote.  I am not a fan of cluttered interfaces and this has a nice balance of info and graphics combined with navigation.*Excellent picture quality (this is affected by your bandwidth and speed provided by your ISP).  It is connected to an affordable 32 in LED TV that is not located in the living room.*Good app selection, very good.  For the 'TV' aspect aka video there are good choices as I like the mainstream offerings.  On my Roku there are unique options that have no appeal for me personally speaking but this is a subjective area.*Good gaming selection.  This is what sets it apart.  I can play fun, casual games and it should handle games that I would describe as casual+ meaning they can be more than casual but will not rise to the level of gaming consoles which is a given for these types of devices.  There is enough of an offering right now to entertain and I am really looking forward to seeing this develop over time.  I love Zen Pinball from when I played it on another device.*The thing I most look forward to is the ability to use the USB port to attach extra storage.  Based on my history, I won't take long to fill up the available on-board storage.  On a Mashable write up they did ask Larsen about it and he said that was nothing to announce now but its a pretty good idea referring to the possibility of adding a USB stick.*Only other item is an app from my cable provider which is not on Amazon at all.  I still have cable and, at present, don't intend to cancel it.  I am waiting for streaming and IPTV to move to the next level which is getting closer every day.*I will probably get another one for the living room for those times where I would like to do some casual and casual+ gaming there.*I haven't tested the voice search yet as it wasn't the highest on my list of features but I hope it will provide a means to get to my movies faster without scrolling everywhere.", "verified": true, "helpfulness": "1/1", "author": "ILoveGadgets \"Gadgets always fit\""}, {"rating": 4.0, "review": "It's quick and fast to load, the only problem I have with the device that some movies on prime has an audio output error and you can see the movie but no sound, how can I correct that?", "verified": true, "helpfulness": "0/0", "author": "ken hatch"}, {"rating": 3.0, "review": "If you integrate spotify, this will make a huge inroad into Apple TV, and Apple's plans to eventually build out their iTunes radio.", "verified": false, "helpfulness": "1/6", "author": "Anonymous 202020"}, {"rating": 5.0, "review": "Our Roku was acting up and we went online, just happened to be day one for Fire tv.  So we oredered it instead and are very happy with it.", "verified": true, "helpfulness": "0/0", "author": "duerdie"}]