[{"rating": 4.0, "review": "Easy to use. We like Amazon Fire", "verified": true, "helpfulness": "0/1", "author": "lduncan65"}, {"rating": 5.0, "review": "Excellent selection of movies and television.  When used with the Kindle Fire the selections multiply exponentially.  A great value for the money!", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "Great little device!  Arrived on time, easy to plug in.  Love the fact that it is already registered.  Super easy to use.  I only wish, like every one else, that it grouped the free items into an easier format.", "verified": true, "helpfulness": "0/0", "author": "cathy felice"}, {"rating": 3.0, "review": "getting it figured out.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"J. Rasco\""}, {"rating": 5.0, "review": "Very easy to navigate. Lots of channels. You really need amazon prime to get the most from it but it's worth it.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was waiting for something like this. Works smoothly and instantly, the only draw back is that with the voice command it will only pull up amazons video content.", "verified": true, "helpfulness": "0/0", "author": "khiladi"}, {"rating": 5.0, "review": "Amazing how much you can do with this little device.", "verified": true, "helpfulness": "0/0", "author": "Bobby Hill"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "Daniel Hallett, Jr."}, {"rating": 5.0, "review": "Like it very much. Had wonderful support with installing of joy stick for games.  I'm unfamiliar with using the joystick so would have liked to have instructions for it  included. I know I can get them on line, but I would prefer a paper instruction. Otherwise super product.", "verified": true, "helpfulness": "0/0", "author": "Edward MacDonald"}, {"rating": 5.0, "review": "This device is small and easy to use, plus a lot more practical and efficient than the video games without the high cost.", "verified": true, "helpfulness": "0/0", "author": "Kim"}]