[{"rating": 2.0, "review": "Does NOT live up to expectations, particularly the voice control element.  When I am in Netlfix, I search for a title or actor & I get movies that are not in my Netflix, all which are asking me to pay a fee. (ie  vudu, amazon, etc)  In other words, if I am in Netflix doing a search, it should only search in Netflix.  So, this voice command is worthless to me. Needs some engineering tweeking  !!!!!", "verified": true, "helpfulness": "1/1", "author": "Alfonso S. Romero"}, {"rating": 5.0, "review": "Wonderful amazing had it for a full week and the speed and HD performance is jus beautiful i must say i love my fire tv and my kids love the games did not get a controller should come with one a con and the games cost money another con said comes with free games but the good ones cost money i do own aRoku3 but if you're a prime member amazon fire is a step up cause u can get music to and it sounds way better then Roku pandora ...............etc like to up date this review 4/14/15 had it for about 2 months now it turns to fuzzy screen and it freezes re upload I'm highly disappointed in this cause when it works it's great", "verified": true, "helpfulness": "0/0", "author": "patricia foster"}, {"rating": 5.0, "review": "A little pricey but I enoy it", "verified": true, "helpfulness": "0/0", "author": "Karrie L Hubbard"}, {"rating": 5.0, "review": "Satisfied.", "verified": true, "helpfulness": "0/1", "author": "Laurence"}, {"rating": 5.0, "review": "I absolutely love this thing. I should have bought it sooner!!!", "verified": true, "helpfulness": "0/1", "author": "Eduardo Gonzalez"}, {"rating": 4.0, "review": "Great love the easy access to all prime and apps like Netflix, Hulu, etc. My only complaint is how touchy the remote is.  We've had to restart programs a lot because someone tried to move the remote and grazed the home button.", "verified": true, "helpfulness": "0/0", "author": "MonkeysMom"}, {"rating": 3.0, "review": "There is too much pausing time watching a movie.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I would NOT call it a \"game changer\" like others have but it's a good device hands down. What I can say is that it's much better than the Apple TV, I say that since most non tech savvy people always compare things to Apple devices even though Apple has become a boring mundane device when it comes to Apple TV and iPhone IMO.I've been in the IT field for 16 ½ years, always customizing and trying hacks. I don't always use things as intended for out of the box. I don't get crazy and code myself but do try other's hacks.Whats good:  Form factor is excellent! Small, sleek looking, enough wait so that cables can't make it tilt.  Has HDMI out  Has TOSLINK (wish there was a TOSLINK v2 w/7.1 support but no such today)  Has Ethernet or WiFi  Decent UI, better than expected but... Well see it on the \"Not so good\".  We can side-load apps easily.  Does play MKV files, most of my library is 1080P w/5.1 & 7.1 (waiting for a router replacement as it currently gets laggy).  Great hardware specs (could use better graphics chip IMO).  Remote feels great and is clean and simple, yet lacking a power button IMO.  Yes it starts steaming almost immediately, but not consistent (could be my router though?)  Some good TV and movies for Prime customers (good luck finding them, the UI gets busy).  Decent price point, won't break the piggy bank.Not so good:  WiFi is NOT AC capable   PLEASE DON'T FORCE US TO WATCH THAT HELP VIDEO AGAIN IF I HAVE TO MOVE IT!!!  Voice search seems more of a gimmick IMO, haven't used it successfully.  Price point IMO should include gaming remote but I think it's a stretch for the specs u get alone.  Remote is lacking a power button IMO as mentioned but also could use backlit key's.  Antennae seems flimsy and I question it's integrity but not having run real tests it's just opinion based.  UI is locked down a bit for my taste.  (for non tech people this is not an issue at all as most of my complaints won't be either)  The UI looks good but the repeat of what you have is annoying, I see Netflix on more than one menu and it's just overkill that is a  problem easily fixed w/the layout. I guess I want to be able to throw a better skin, theme, on there w/o too much effort.  Haven't really had updates, expected more from Amazon but I'll be patient.  Settings and options are limited: Ex: I can't power off the thing, I can only put it too sleep, why? What's it doing when I'm not watching it? (I'm expecting to find out w/a new router in route). Why can't I clear memory like w/phones. I had an app lock up and only that app, everything else was ok but that 1 app was locked. After a hard boot it worked again but I had to disconnect the power for that, shouldn't have too. Granted it was side-loaded.  Speaking of side-loading apps, why can't I easily create short cuts to the UI for the installed app? (heard there is a way, I just don't want to have to dig for every little customization or change, yes I can pay for the same app again on Amazon App store but I already paid for it on Google Play and personally prefer Google Play over Amazon Apps.)  I'm comparing/rating this device to other devices I've used or use as HTPC devices @ home as follows:  AppleTV (3.5 out of 10)  Minix Neo X7 (6.5 out of 10)  XIOS DS (4 out of 10)  Surface Pro 1 (8 out of 10)  Galaxy Tab 12.2 (8.5 out of 10)  Chromecast v1 (5 out of 10)  iPad Mini (6 out of 10)  MSI A88XM MicroATX self built HTPC (9 out of 10)  Amazon Fire TV (6.5 out of 10)  Amazon Fire Stick (5 out of 10)  So, for the normal every day Johnny Bravo I firmly believe this is a GREAT device despite my 6.5 out of 10. If I were just a normal user I would say it's more like 8 on the edge dangerously tipping back a half point. For the movie enthusiast running a NAS w/a solid HD collection of movies I say it's a 6.5 tipping back a half point as well. Why? Well there is no AC WiFi support which would allow for 4K streaming, it's a slow movement but everything is going in that direction and before you know it but before you know it, it's here. On that note, there is no 4K support. Unfortunately my old house has firewall barriers blocking me from running cat5 so I have to stream! Ugh!  All in all I think it's a step in the right direction but I think Amazon should loosen up a little and allow it's users to customize things a little more on this particular UI. Even their tablets are very limited to the customizations you can make (my wife has one) and that's why I don't like it myself. This consistency is one of the reasons I haven't even bothered to purchase one of their phones either.  THE FINE PRINTThese are just my thoughts and how I feel, it's not meant to discourage any one from buying this or any of the items I give a review on unless I put on there, don't buy this. LOL. It's more of a reference to help people make a decision based on research from the experience of a group of consumers.Cheers and good luck!", "verified": true, "helpfulness": "3/3", "author": "1m2"}, {"rating": 2.0, "review": "No Acorn TV which Roku has. They don't show you on the chart was Roku offers and Fire TV does not. Very easy to use but since I cannot get an answer about Acorn from Amazon, I have already bought my Roku. Also, they billed me for a Prime Item. How does that happen? And how often?", "verified": true, "helpfulness": "0/0", "author": "Moviegoer"}, {"rating": 1.0, "review": "I know I would love this if it worked because I'm able to watch it at two of my friends homes. I ordered mine on sale for $84.00 and it worked great...for 3 hours. It went dead, lights out....completely dead. Tried all the troubleshooting tips...rebooting, tried every live electrical socket in the room, etc. Nope, it's just not getting power. Refurbished box maybe? Is that why they're on sale? So frustrated. Contacted Amazon and told the rep it was defective and that I wanted to have it replaced ASAP. Wow, talk about complicated call. She was so hard to understand, choppy, all over the place, overboard apologetic sentences, but I finally understood she said to keep my box because there was an upgrade that would fix it, just keep trying it every few hours for 24 hours? I'm confused. An upgrade will cause my box to get power? Ok, I'm waiting but that light just isn't coming on. Meanwhile bye-bye free 30 day Prime trial and wasted holiday weekend hoping to watch some great movies and shows. Anyone else have this problem? I'd love some real help.", "verified": true, "helpfulness": "3/3", "author": "Patiojo"}]