[{"rating": 5.0, "review": "Love, love, love this device...it is has all the apps (Amazon video, Plex, Netflix, HBOgo, and Sling) I need in one spot and the remote is so much easier to use than the Apple TV one!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Loved this item so well that this was my second purchase.", "verified": true, "helpfulness": "0/0", "author": "LeFloren"}, {"rating": 5.0, "review": "awsome product. i recommend", "verified": true, "helpfulness": "0/0", "author": "Alexandre Sobral"}, {"rating": 5.0, "review": "Was up and running in about thirty minutes after unpacking, great product hope it has a good durability.", "verified": true, "helpfulness": "0/0", "author": "Jerry G."}, {"rating": 5.0, "review": "Best device ever. I highly reccomend it.", "verified": true, "helpfulness": "0/0", "author": "GabbysView \"GabbysView\""}, {"rating": 1.0, "review": "Not as good as I expected, voice search only works for amazon products and user interface is not easy to configure.", "verified": true, "helpfulness": "0/2", "author": "Sigurdur Palsson"}, {"rating": 5.0, "review": "Fantastic!! It is so nice to eliminate the overpriced cable subscription of hundreds of channels that I never watched. Amazon Prime, Sling TV, Netflix, and the over the air local channels, is all I need and more than enough.......at less than half the price!!!!!! I hope it stays affordable and an option for consumers.", "verified": true, "helpfulness": "0/0", "author": "moonlight_bench"}, {"rating": 5.0, "review": "I really like this device as it adds several dimensions to your TV viewing.  It is user friendly with a intuitive controls.  The voice search works flawlessly it is very nice that the remote doesn't have to be pointed at the TV or box.  Bought this as reconditioned item and got 10 bucks off,  Never would have known it was pre-owned until I chose to listen to Prime Music.  I was prompted with a message asking if I wanted to switch over to my account which I did.  Then I got a message saying it would stay connected to my account for 6 months.  Not sure what that was all about.  As I was showing my wife how to use it, we selected several prime instant movies to watch only to receive an error message stating that particular movie could not be played at that time.  After trying multiple titles, we finally found something that would play.  So I believe the issue with the other titles was on Amazon's end and had nothing to do with our unit.  Since that first day, my Great Dane has eaten my TV remote control (not the Fire TV remote) and rendered my TV useless as I cannot access the TV input menu from the limited buttons on the TV itself.  Just ordered a new remote for the TV today on Amazon.  Not to worry, my Great Dane is fine.  He didn't ingest anything - just crushed the remote with his teeth.", "verified": true, "helpfulness": "0/1", "author": "Sean Bresna"}, {"rating": 5.0, "review": "Worth every penny", "verified": true, "helpfulness": "0/0", "author": "anthony bonnor"}, {"rating": 5.0, "review": "I got fire box about a week ago I must say I was blind sided by all of the things it can do. You can watch a never ending stream of movies for free.Also the iHeart app (that is free to prime members)it is just like sieris or xm satellite radio but for free!!! or you can custom build up your own sportchannels or what ever you want to watch LIVE. I have tried it at a motel that has wifi and it worked flawless providing the tv has an hdmi port.With the box version you can install a usb3 thumb drive and install games on it ( I am going to see if I can load movies on the thumb as well)One small thing came up the remote quit responding to my voice commands so I contacted Amazon the tec called me with in secondsand told me to remove the batteries and reinstall them that did a reboot on the remote and it came back to live.If you have a house full of kids this can shave hundreds of dollars off your entertainment bill and cancel your satellite service for good.What's to loose if you don't like it you can send it back!!!!Trust me try one", "verified": true, "helpfulness": "0/0", "author": "Montey Davis"}]