[{"rating": 5.0, "review": "Love the very quick access to the movies. Almost instantaneous.", "verified": true, "helpfulness": "0/0", "author": "EE \"Versini\""}, {"rating": 4.0, "review": "Like all the other reviews have said this is a fast device, and the Bluetooth remote is great.  Have you ever pressed a button, on your cable box remote, and wasn't sure if it got the signal, or was just being slow?  Well that doesn't happen here with the nice positive click each button gives, and the really quick response from the fire TV, you are never left wondering.  One complaint I have is with the interface, it seems difficult to navigate all the free amazon prime content, and it gives you \"recommended\" content, instead of all the content.  Which brings me to my second complaint.  When there is a big list of content, there is a lot of clicking through the lists to see everything.  Which kind of creates a paradox, I want tons of content available to me, but I also want it to be simple and easy to navigate.  I think the real trick is to use the voice search for everything, which I don't really have any complaints with, and maybe use the computer to put content into my watch list.  I have always toyed with the idea of cutting the cable noose, and this device has finally made that an actual possibility.  If you combine this with Hulu and Netflix, it is very possible you could easily get 90% of the stuff you get on cable for 1/3 of the price.", "verified": true, "helpfulness": "0/0", "author": "TheGuy"}, {"rating": 4.0, "review": "We want an earphone jack like RUKO, and voice searching for all channels", "verified": true, "helpfulness": "0/0", "author": "Besendorfer Books LLC"}, {"rating": 3.0, "review": "I only use the FireTV for Plex.  The interface is great, however, some odd things happen when playing movies.  The Plex app has to rely on the internal player for FireTV as Plex does not have its own native media player. This leads to issues with subtitles not showing and Dolby surround not being supported.  Hopefully these items will be fixed soon.  Otherwise, it works great.", "verified": true, "helpfulness": "1/1", "author": "a. Lee"}, {"rating": 5.0, "review": "Easy 1,2,3 hookup. Wanted this for the Casting features, but will probably use it for all the movies we can't get on Cable or from the DVD collection.Once I figured out the terminology for casting from my Kindle 8.9 HDX, I slung up some streaming video casts from the Kindle and was very pleased with the picture and voice quality.  No issues with buffering anymore or miss-matched speech with picture.  Primary use is with .tv.jw.org .  Excellent production on a new web tv station.", "verified": true, "helpfulness": "0/0", "author": "Michael \"mikamu1\""}, {"rating": 5.0, "review": "Excellent product. The system streams movies perfectly through wifi. HD video and sound are too notch. I am very picky with electronics and would recommend this to anyone. The speed while searching, loading and viewing movies is very fast.", "verified": true, "helpfulness": "0/0", "author": "Steven Miller"}, {"rating": 3.0, "review": "NEED IMPROVEMENT ON THE MENU AND THE REMOTE CONTROL ( ON/OFF BOUTON , VOLUME BOUTON....", "verified": true, "helpfulness": "1/1", "author": "SAMI"}, {"rating": 5.0, "review": "It's worth the money", "verified": true, "helpfulness": "0/0", "author": "Juan Gonzalez"}, {"rating": 5.0, "review": "awasome experience", "verified": true, "helpfulness": "0/0", "author": "ram"}, {"rating": 5.0, "review": "Exceeded our expectations", "verified": true, "helpfulness": "0/0", "author": "Robert Weiller"}]