[{"rating": 4.0, "review": "Great device, it's the first of its kind that I own, but so far nothing to complaint about.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as advertised. Voice search is amazing. Wonderful technology.", "verified": true, "helpfulness": "0/0", "author": "Stuart R. Carlin"}, {"rating": 5.0, "review": "When i want to watch fire its there for me..", "verified": true, "helpfulness": "0/0", "author": "Mamerto C."}, {"rating": 5.0, "review": "So much better since updated for expandable memory. My kids love it and it makes for a low priced gaming system. Considering the system is not much more than the games on some other systems it is great. My kids tire of games quickly, it is nice to know most games are free to $5.00 in price. Kids love playing Minecraft together one on their Kindle tablet and one on the Fire TV. Buy the controllers.", "verified": true, "helpfulness": "0/0", "author": "Markus"}, {"rating": 5.0, "review": "excellent have this and fire stick - this is for main TV and is very snappy.  --", "verified": true, "helpfulness": "0/0", "author": "Patrick Moss"}, {"rating": 5.0, "review": "Easy peasy lemon squeezy for a non techie👍👏", "verified": true, "helpfulness": "0/0", "author": "Jana Guskin"}, {"rating": 5.0, "review": "Very easy to set up and use. Love the voice activation.  Can't thank my son enough for the gift.", "verified": true, "helpfulness": "0/0", "author": "William Simpson"}, {"rating": 1.0, "review": "I signed up for prime. Tried it for a few days. I did not find very many movies or TV shows that were free. I was all set to see TV and Movies . Got a big surprise. Its not what you call free. Most movies cost as much as the old videos stories charged. Now I am looking at the Amazon fire and wonder what I might get into. Your TV shows are First one free and anywhere from $10.00 to $40.00. Maby l got all this wrong. All l know was l did not like paying for a lot of stuff and pay a yearly fee and cost of what l want to watch. Netflix is $8.00a month and that is all and watching movie they have. Am I wrong, get me straight so I want be so confused. If I buy the Amazon fire for $99.00. What can I expect to pay extra. Will this work on other satellite television networks?", "verified": false, "helpfulness": "0/4", "author": "Ray Poteat"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Rachel Waite"}, {"rating": 5.0, "review": "Best choice in streaming TV devices. Has Amazon Prime and Netflix(AppleTV does not) on the same device along with several other apps for entertainment viewing. By far the most useful device for streaming.", "verified": true, "helpfulness": "0/0", "author": "Michael Phillips"}]