[{"rating": 4.0, "review": "Love it!! Only drawback is that the voice search activation only works with Amazon Prime Video-- need to use the remote and manually enter letters when searching for items in Netflix or Showtime to Go which is kind of a bummer...", "verified": true, "helpfulness": "0/0", "author": "By lead pony"}, {"rating": 2.0, "review": "So I guess I was under the impression that by 1. Becoming a Prime member at $100/year, and 2. Purchasing Fire TV at $100, we would be able to watch whatever Channels/Networks were setup through Fire TV, at no cost. I was wrong. All our favorite channels; Disney, National Geographic, Discovery, History, A&E;, and many more, asked us to pay $1.99-$2.99 per episode. So if we were to watch, say, 2 episodes each night, at the lower rate of $1.99, that would come out to be about $112/mo. That's a little less than what we pay for cable, without having had to purchase a $100 streaming box, AND a $100/year membership! I'm just really disappointed, because I expected more, I guess. I spoke to a rep tonight who said, \"Unfortunately, Amazon only has contracts with certain TV channels, and the ones we don't, you have to pay for the episodes.\" No thanks, I'm not spending $100 for the box, $1,200+ a year for shows, along with a $100 Prime membership, to watch all my favorite TV shows, when I can do it for less with cable. Unless you want to settle for mediocre shows from PlutoTV.com, and other free streaming options, this is not for you. I read rave reviews, and I am really disappointed. Maybe I didn't read the fine print.", "verified": true, "helpfulness": "4/6", "author": "Julie Clouse"}, {"rating": 5.0, "review": "Amazon Fire TV is the best streaming device out there, Prime members get so much with this streaming device.. i absolutely luv the Fire TV.... i have 3 Roku's and they don't get much usage after using the Fire TV... can't go wrong with this device....", "verified": true, "helpfulness": "1/1", "author": "D. Collins \"Timeboat\""}, {"rating": 5.0, "review": "Loved it enough that we went and bought a second one for the bedroom. Movie's, tv, news... fire tv has it all and I'm finding something new all the time. Great for Netflix, Hulu, Crackle, CBSN... not just for Amazon movies.", "verified": true, "helpfulness": "0/0", "author": "Salvo"}, {"rating": 5.0, "review": "Bought this for my downstairs television, mainly for Netflix. I like it so much I want to buy one for my 60 inch Smart TV. It works so smooth and fast.", "verified": true, "helpfulness": "0/0", "author": "Curtis Hess"}, {"rating": 5.0, "review": "Simple set up, easy to use. Whats not to like. I almost bought an Apple TV, was very very very close to purchasing it, but what stopped me was being an Amazon Prime customer. The whole experience is great and very intuitive. You won't regret this purchase especially if you are a Prime customer", "verified": true, "helpfulness": "0/0", "author": "Wayne A. Trznadel"}, {"rating": 5.0, "review": "Love this little device now that I'm getting the hang of it. Voice search is neat and works extremely well. Download Speed is outstanding.", "verified": true, "helpfulness": "0/0", "author": "Roy R. Giddens"}, {"rating": 5.0, "review": "I am very happy with this purchase.  I bought it when Amazon was running a special and I really enjoy using it.  I like the fact that I can stream music from IHeart to my TV through the app.", "verified": true, "helpfulness": "0/0", "author": "N. Howe"}, {"rating": 5.0, "review": "I went into this purchase not having high expectations because of the reviews but rolled the dice in the chance i could lower my dish network bill seeing they seem to be negotiating with our channels and am so glad I did.First off I bought two boxes one took a while to update and the other I simply plugged in and was ready to go so I would think if you get a box that needs updated it is the luck of the draw. I had to call customer service about the first box because it wouldn't update and after I called in the box started its update.I have had the two firetv boxes for about a week now and think I can safely say they work wonderfully. I have had no issues that some have had. Now one thing I did notice if my FireTV is not set to Home when I am done watching it will not turn off so that may be why some are having issues. No problem with either one of the FireTV remotes or game controllers running through batteries.I have never used ROKU so can't compare the aps to one another but really haven't found any that interest me other than Hulu, Netflix and others similar to them. I do wish that VUDU was there but seeing how it is a competitor well that may just be the reason why.The streaming quality is good. I live out in the country and have high speed internet but am the last customer at the end of their coverage area to be able to get it and have had no real issues with loading and do not have the fastest internet. it sure loads a lot better than my sons game systems which I used to stream things on when I want to watch on the TV versus my laptop screen.I was able to turn off all the movie channels on Dish and don't miss them and could really cut down on some more channels but will ween myself off of them slowly and save even more money. I am very happy with this purchase and am glad I took the chance. If you do give this a chance and have any problems if I were you I would try to bare through it and get it worked out because it was definitely worth it to me and what I wanted it for. Honestly it can't be that hard I set it up on my own with minimal frustration and I am one of those who is very easily frustrated a simple difficult package can set me off on a tantrum.****************************************UPDATE******************************************it has been a month now having the FireTV and am more thrilled than I was when I first received it. Have cut off a majority of my dishnetwork channels and could really get by without it. Figure I have watched maybe 10 hours if even that of the Dish in 6 weeks time.We actually all sit down as a family and find things for all of us to watch together more often and that is great fun. Really amazes me how this little box has changed our entertainment viewing and has really saved us money we are loving it. One of the better purchases I have have ever made.", "verified": true, "helpfulness": "1/1", "author": "J. Uner"}, {"rating": 5.0, "review": "I got this to replace the Xbox in the living room for streaming Amazon Instant Video, Netflix and similar.  Works great, the voice search works better then expected.", "verified": true, "helpfulness": "0/0", "author": "Christine Lavonne"}]