[{"rating": 1.0, "review": "Totally got ripped off on this one. The shows I watch are free on my Kindle Fire HDX and PC, but you have to pay to watch them on the Fire TV. Not what I was expecting.Editing this one: This is not about PRIME shows. I should have clarified. I bought the FIRE TV under the impression (From the Kindle sales person)that everything I watched on my Kindle Fire HDX for FREE would also be able to be watched on the FIRE TV for free as well. This is not the case. The Fire TV does not allow all of the same apps that the HDX does. That was my source of disappointment in the FIRE TV. Free viewing on my PC and HDX of certain shows were pay to view only on the FIRE TV. I hope that explains my issue better.As far as the unit itself - it is an excellent device, no issues with streaming glitches or anything of that nature. Very easy to use, and Amazon adds new content all of the time.", "verified": true, "helpfulness": "2/9", "author": "James"}, {"rating": 5.0, "review": "this works just as it should. easy to use. i thought not having numbers on the remote was strange, but it works great.", "verified": true, "helpfulness": "2/2", "author": "a.crane"}, {"rating": 5.0, "review": "this device is awesome, i am a prime member so i can now watch movies and various programming on my tv , instead of computer, moreover can use the app for my Netflix account and i can watch you tube also, set up for all is super simple, the voice recog. feature is great, i don't play games so cant comment there... but for my purpose this thing rocks.... highly recommend", "verified": true, "helpfulness": "1/1", "author": "A. HUBBARD \"THE CHEFF\""}, {"rating": 5.0, "review": "This was easy to hook up and I got started watching tv episodes and movies I've missed.  Easy to use and understand!", "verified": true, "helpfulness": "1/1", "author": "Anne Perry"}, {"rating": 3.0, "review": "The only issue I have is the lack of vudu support. While flixster will play all of my UV movies it constantly lags out, restarting the movie.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Would recommend this is anyone and everyone. This little box is so cool!! Remote is incredibly sensitive but no other issues!", "verified": true, "helpfulness": "2/2", "author": "veronica"}, {"rating": 2.0, "review": "It works great for a family that's in a city with great internet and just wants to watch things online.I don't even know why they attached a USB port.  If you hook your EXTERNAL USB drive into it (which for me has 400 of my own movies on it)  the Fire will not play them.Making this NOT a MEDIA PLAYER but more of a just a Internet Only..netflix...amazon..hulu player.If the fire was able to play external movies Via the USB port this would be hands down the best device ever created.shame.", "verified": false, "helpfulness": "3/9", "author": "SGMusician"}, {"rating": 5.0, "review": "It was easy to hook up, works great and does exactly what it claims to do! I would recommend and am recommending it to all my friends!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love this MECHINE just had it for a little while and love it. It just needs more app's.I'm going to let Dish have their bill and I'm trying to find something to replace DISH.I think Fire TV is it.", "verified": true, "helpfulness": "1/1", "author": "connie bilbo"}, {"rating": 5.0, "review": "I am a Baby-Boomer, enough said, and this new fangled machine, Amazon Fire TV is the Boss!  I've had mine about 3 weeks now and absolutely love it!  Very easy to use. Love the voice search. The bowling app is great. At this point I would recommend  Fire TV  to everyone. Love the benefits of Prime membership, well worth the cost.", "verified": true, "helpfulness": "1/2", "author": "High Information Voter"}]