[{"rating": 5.0, "review": "Phenomenal - replaces my Apole TV 2.  Easy to side load programs without breaking.", "verified": true, "helpfulness": "0/0", "author": "Christopher S."}, {"rating": 5.0, "review": "Godly", "verified": true, "helpfulness": "0/0", "author": "Eric Mitchell"}, {"rating": 5.0, "review": "Been great so far.", "verified": true, "helpfulness": "0/0", "author": "hdsingle"}, {"rating": 4.0, "review": "I love the voice search feature on this, and it processes video very quickly. It streams all of the videos available through Amazon Prime quickly and without delay, and has not had to reload a video since I've had it.  I can't say the same for my Roku box. I love both the Roku and this, so if you're trying to decide between the 2, I don't think you can make a bad choice with either--they are both great streamers.", "verified": true, "helpfulness": "0/0", "author": "L. Baker"}, {"rating": 4.0, "review": "I like it, but I can't seem to find the free prime programming yet.", "verified": true, "helpfulness": "0/0", "author": "Victoria Adams"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Melanie Morris"}, {"rating": 5.0, "review": "Easy to setup, great interface, great voice control, and fun to use", "verified": true, "helpfulness": "0/0", "author": "David N. Bourland"}, {"rating": 3.0, "review": "I have mixed feelings about the Fire TV.  First, my biggest issue is that every time I go to use the remote, the batteries are dead.  I've only had it a month and I am on my 4th set of batteries.  I finally figured out that I can save my batteries if I remove them after using the remote.  Completely ridiculous. It does work pretty well.  Netflix keeps freezing and you have to wait while it buffers.  Sometimes it will do this every 2-3 minutes making you decide to quit watching all together.  Sometimes when it goes into the screensaver, the remote won't work and you have to unplug the unit and plug it back in to get it to work again.  Since we have no other way to watch television on this particular TV, we will keep it.  We previously used a ROKU player that worked really well for the past 7 years.  When we bought 2 different versions of the newer ROKU players, neither one would connect to the internet, so we are stuck with the Amazon Fire for now.", "verified": true, "helpfulness": "0/0", "author": "A. Zuber \"4_aj\""}, {"rating": 3.0, "review": "just learning.  But I want to understand if I have netflix.  Or do I pay extra for this?  Also so many people have complained about netflix with the Fire TV.  Does it work with  it or is it a waste of money???", "verified": true, "helpfulness": "0/0", "author": "Nancy A Hershner"}]