[{"rating": 5.0, "review": "it seems like it'll meet our needs. We've only accessed it twice since we got it 3 days ago", "verified": true, "helpfulness": "0/0", "author": "Scout"}, {"rating": 5.0, "review": "The cats meow..Better than sliced bread...Great product..voice recognition works every time..", "verified": true, "helpfulness": "0/0", "author": "eccentr1c1 \"tool junky\""}, {"rating": 5.0, "review": "I enjoy using the Amazon Fire TV. It has been a great surprise.", "verified": true, "helpfulness": "0/0", "author": "Traci"}, {"rating": 5.0, "review": "Great product from Amazon! I have 2 Apple TV boxes in the house and the system is superior in nearly every way possible, the only reason I haven't listed the Apple TVs on eBay is because they have MLB TV. If Fire had that then I would be all set.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "They are not kidding when they say voice commands really work… This was extremely easy to set up and I have an HDMI splitter to go between my fire TV and DVD.The kids love the video games and the remote control is easy to use.I have my fire TV behind a wood door and the remote works great through that door.I have prime so I can stream movies. I wish there was a search option that only searched prime videos. However, when you voice search, it searches everything.All in all, I am extremely happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Shawn Fitness"}, {"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Love my Amazon Fire TV! It has completely exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "kate guillot"}, {"rating": 5.0, "review": "so far, very good - clear picture and audio.", "verified": true, "helpfulness": "0/0", "author": "Mary T"}, {"rating": 4.0, "review": "I have Amazon Fire TV installed on my Living Room and Recreation Room TV.  I enjoy the ease of use and fine programming.", "verified": true, "helpfulness": "0/0", "author": "The Chief \"The Chief\""}, {"rating": 4.0, "review": "Pretty freaking sweet! Best media player I have used.", "verified": true, "helpfulness": "0/0", "author": "James Lineback"}]