[{"rating": 4.0, "review": "Thus far we have watched only movies and are very pleased.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 5.0, "review": "Great tv movie  box", "verified": true, "helpfulness": "0/1", "author": "Souda"}, {"rating": 5.0, "review": "Getting rid of cable because of this box... Box is refurb but works and has the same warranty as new... NET NEUTRALITY...", "verified": true, "helpfulness": "0/0", "author": "Cisco M."}, {"rating": 5.0, "review": "It is really nice to have my Amazon Prime and Netflix and Pandora all in one spot. I just wish the voice search would cover more than just what is on Amazon.", "verified": true, "helpfulness": "0/0", "author": "dtfamily5"}, {"rating": 2.0, "review": "All the good movies you have to pay for..Being. a prime member is the same as being a Netflix member. The photo and music. app need to be more. user-friendly. I'm. not happy.", "verified": true, "helpfulness": "0/1", "author": "James L Gentry"}, {"rating": 5.0, "review": "Such a wonderful Amazon item! (Wish I had bought when on sale though lol) And so, so very easy to set up and use! My 87 year old grandmother has no problems working the remote. I plan on buying another for my daughter and her husband who live 3 hours away. She is added to my list of family on my Prime and they have WiFi, which I tested using mine at their house and works great (when it's on, still connects to my account). What a wonderful item!!!", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "Love this device. It's fast, affordable and reliable. If you want a device that works well with online content streams (Hulu, YouTube, Netflix, Amazon Videos) and your own local library of media (PlexTv). For the money I can't recommend a better device.", "verified": true, "helpfulness": "0/0", "author": "JonnyDangerous"}, {"rating": 5.0, "review": "I prefer the Fire TV to Roku and every other set top box that I've tried. The gaming will surprise you. The remote and controller are very high quality. Voice recognition is super helpful and works everytime.", "verified": true, "helpfulness": "0/1", "author": "Tonto"}, {"rating": 4.0, "review": "This is new technology for me, just starting to use it, was easy to install and set up now it's time to learn how to use all the features.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "It was easy to install and I love watching television without commercials every ten minutes.", "verified": true, "helpfulness": "0/1", "author": "Nancy Tatum"}]