[{"rating": 1.0, "review": "I LOVED this thing from the start, and bought a couple of apps the first day, then I ordered another one for my family and a couple more remotes, I thought it was THAT great (my kid loved it).But on day 2 I saw a message I had not seen on a computer since the late 90's, \"out of memory\" (I had 5 apps on it total). At this point I was like, \"hmmmmm, that's interesting,\" and figuring there must be a way to plug in a USB and make it work as added memory (it has a USB Port) I called support; turns out you can't.Is not the point of this device for me to consume Amazon content? Why, Amazon, are you making me choose between what games I can keep active? Why not offer a higher memory model, or, much, much better: let me store my stuff on a USB without having to root my Fire TV?It just makes no sense, no sense at all to stop me from buying content the way you just did, no sense at all!", "verified": true, "helpfulness": "76/84", "author": "Kindle Customer \"iThink\""}, {"rating": 5.0, "review": "Love my fire TV!  We use it for movie and TV series and to listen to music via amazon or Pandora.  Its a compact box, easy to use and it has taken the place of our movie subscriptions.  Amazon customer service is seriously excellent.  I am a big fan.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "was not so sure about this product at first but now its all i use for entertainment its great", "verified": true, "helpfulness": "0/0", "author": "jason tastaca"}, {"rating": 5.0, "review": "Comes from Amazon already set up with all your account information so all you need to do is plug it in.  My wife and I love the ability to have Prime video, Netflix and others so easily accessible.  I never use the voice search, mostly because I feel weird talking to a remote control.  I have absolutely no complaints with this unit.  It is as good as advertised, is problem free and requires zero tech skills to set up.", "verified": true, "helpfulness": "0/0", "author": "QMG"}, {"rating": 4.0, "review": "Seems to work fine, the game console is nice. The biggest drawback is that the AAA batteries that came with the remote lasted only 5 days.", "verified": true, "helpfulness": "0/0", "author": "Gudmundur Arni Arnason"}, {"rating": 4.0, "review": "There are maybe show that required you to pay in order to view, these shows maybe free with membership for Netflix; so check with Netflix before purchase a movie or shows with prime. I like that it changes a regular t.v to a smart t.v.", "verified": true, "helpfulness": "0/0", "author": "NICOLE"}, {"rating": 5.0, "review": "We use this all the time.", "verified": true, "helpfulness": "0/0", "author": "Kay"}, {"rating": 3.0, "review": "If it was easier to launch and control XBMC, it would be perfect... Or just natively support LAN-based media.", "verified": true, "helpfulness": "0/2", "author": "Aaron M."}, {"rating": 4.0, "review": "The Fire is a nice streamer for people with Amazon accounts. The device is easy to setup and hook up.The most difficult part is putting in your wifi password which is usually on your router and necessary for almost any device you buy anymore.We had ours up and running in 15 minutes . The voice recognition search feature works pretty well most of the time,mostly for simple title searches.I find it more convenient to type in category searches to make the searches more specific such as different holiday movies.  The device understands me alot better than my Garmin does. What I like about this is that it has less clutter than my Roku does with less unusable channels.The Amazon content is easy to get to. The games are pretty nice too,especially the kids love the Disney game.My roku didnt really have any games that I was aware of", "verified": false, "helpfulness": "0/0", "author": "paulmark"}, {"rating": 5.0, "review": "Works great, no lag. Is up to date on all apps. Great if you want a cheap option instead of getting a game console or cable.", "verified": true, "helpfulness": "1/1", "author": "Richard Moore"}]