[{"rating": 5.0, "review": "Excellent media streaming device. Much faster than the old WD TV live plus it replaced. My only concern was that it comes with no native app for streaming my media from my NAS to my TV. I needed to sideload Kodi. I had no idea how good Kodi was compared to the native app on the WD TV Live plus. The Fire TV is extremely fast and everything looks great in 1080.I would like to be able to place shortcuts to my apps on the home screen, but Amazon reserves its homescreen for specific apps only.All in all great device. I have three now (given two away)....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Greg B\""}, {"rating": 1.0, "review": "Purchased 2 of these for our televisions as an alternative to a $250 per month cable bill.  I am happy that I can access our Hulu, Netflix and Prime account from one place.  However, there are significant buffering/delay issues with this product.  We can stream multiple netflix applications from tablets using our home WiFi, which is ~50MB per Second, no problem.  However, when only having 1 Amazon Fire TV unit going in the house, the screen freezes (audio continues) and the program stops all together sometimes too.  I am hoping for a software patch soon that fixes this issue but until then I would not recommend.", "verified": true, "helpfulness": "2/2", "author": "Erika Lamb"}, {"rating": 5.0, "review": "This is the best way to watch internet movies.  Its fast, easy to use and I no longer rent DVDs.  I wish I had purchased one when they first came out.", "verified": true, "helpfulness": "0/0", "author": "Kplus8 \"KPLUS8\""}, {"rating": 5.0, "review": "Loves watching YouTube on our large screen tv instead of her laptop.", "verified": true, "helpfulness": "0/0", "author": "ROBERT TAKACS"}, {"rating": 5.0, "review": "I decided to buy a smart tv. I am sure it would have been fine.", "verified": true, "helpfulness": "0/0", "author": "Bunny123"}, {"rating": 5.0, "review": "I love it! We have both an Amazon Fire TV and an Apple TV, and have been using this much more since we purchased it. We aren't huge game fanatics, but enjoy playing video games from time to time - so this is perfect for us.", "verified": true, "helpfulness": "0/0", "author": "Cassie"}, {"rating": 5.0, "review": "Awesome...awesome...awesome!", "verified": true, "helpfulness": "0/0", "author": "ATrunzo"}, {"rating": 5.0, "review": "Easy set-up love the feel and size of remote", "verified": true, "helpfulness": "0/0", "author": "nancy salander"}, {"rating": 2.0, "review": "O.k after lots of research I bought the Amazon fire tv . Prior I emailed and asked questions wether it would wok with my Sony Bravia T'V's etc.3 areas of the house are wired as theater's with surround sound , built in wall speakers etc.I tried to plug and play etc. would not work . After much frustration I contacted Sony. After being passed through various Techs, I got to the top to be advised that it will not work with Sony's HDMI prior to 2013. They have there own particular HDMI and is not universal.", "verified": true, "helpfulness": "0/0", "author": "Martin \"Martin\""}, {"rating": 4.0, "review": "Great for movies..easy to use/ navigate. Remote works great with voice command. Install is simple-plug into power , hook up cord, put in amazon account info & your good to go. There are a lot of options I have yet to explore. SO FAR SO GOOD", "verified": true, "helpfulness": "0/0", "author": "BONES"}]