[{"rating": 4.0, "review": "Only worth it with 3rd party apps", "verified": true, "helpfulness": "0/0", "author": "Matt Leach"}, {"rating": 5.0, "review": "I absolutely love Amazon Fire TV.  I can easily find whatever I want to watch.  The voice activated remote is incredible.  I would definitely recommend buying one or two", "verified": true, "helpfulness": "0/0", "author": "Shirley Luscinski"}, {"rating": 5.0, "review": "Amazon fire tv is a perfect replacement for cable!", "verified": true, "helpfulness": "0/0", "author": "CB"}, {"rating": 5.0, "review": "Easy to install.  Movies download instantly, unlike Netflix.", "verified": true, "helpfulness": "0/0", "author": "Bootsy"}, {"rating": 5.0, "review": "I am obsessed with this device.", "verified": true, "helpfulness": "0/0", "author": "Sara Jayne"}, {"rating": 5.0, "review": "Absolutely love my amazn fire TV. Just make sure you have a really good internet connection and you are set. I havent even had a need for my standard cable, this has everything I need from TV shows to movies to music! It's fantastic and easy to navigate. Great job AMAZON, as always.", "verified": true, "helpfulness": "0/0", "author": "Jhayes789"}, {"rating": 5.0, "review": "I love Amazon fire TV, lot's of choices.", "verified": true, "helpfulness": "0/0", "author": "Valarie Stevenson"}, {"rating": 5.0, "review": "I love my Amazon Fire TV.  The installation was so easy and connecting to the Internet happened with almost no effort on my part.  However, there is a caveat:  even though I am a Prime member, many of the videos that I tried to watch cost additional fees.  It would be helpful if prime members had an even greater library of free movies and TV shows.  I want to binge watch Rizzoli and Isles yet I would have to pay.  That is not good.Other than that, I'm happy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Seeker of Music\""}, {"rating": 1.0, "review": "There are better choices! Most apps out there are designed for iOS or android.  Very limited choices.  I'd invest on apple TV or google chrome instead", "verified": true, "helpfulness": "0/3", "author": "Prerak Pradhan"}, {"rating": 3.0, "review": "Text Search should be real text search..not a search of titles that aren't all there.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]