[{"rating": 4.0, "review": "Very impressed with the variety of options. I had cable or dish for many years and was a little leary of Fire tv. I have recommend this product to family and friends whom of which are in process of purchasing. I purchased the prime and  i am very pleased with the utube feature.", "verified": true, "helpfulness": "0/0", "author": "kimberly"}, {"rating": 5.0, "review": "I JUST LOVE MY FIRE TV!!!!!!!!! I  JUST RECEIVED IT THERE IS SO MUCH  I HAVE TO EXPLORE!!!!!!!!!IT WAS EASY EASY TO HOOK UP WHICH FOR ME WAS A GREAT BIG PLUS!!!!!!ITS WONDERFUL!!!!!!!", "verified": true, "helpfulness": "0/1", "author": "evahn c. taylor"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "skinny"}, {"rating": 3.0, "review": "as a non techie the fire has been a good buy. Yes, it only suggests Prime videos when you voice search but that was expected based on the reviews I had read. What disappoints me is when it starts to lag. I looked up the problem and found the following: http://www.digitaltrends.com/home-theater/surprise-amazon-fire-tv-gobbling-gigabytes-like-internet-gremlin/#!baCWxCHopefully this will fix this lag issue because if it doesn't I would suggest going with the roku 3 or the apple tv. I will update if it fixes the issue. If it does then I would highly recommend the fire above the other two but if it doesn't then what is point of streaming videos if there is a constant lag.", "verified": true, "helpfulness": "1/1", "author": "johnny lee"}, {"rating": 3.0, "review": "I'm loving my Amazon FireTV. It's very user friendly and fast. The only reason I gave it 3 starts is because I'm not happy with the selection of movies and tv shows that are included when you purchase Amazon Prime. If there were more options to choose from, I would probably use it more often.", "verified": true, "helpfulness": "0/0", "author": "Sarah G"}, {"rating": 4.0, "review": "I like the Amazon Fire TV, its fast, easy to configure and use and works great. Only reason I held back a star is because I would love it the voice search worked in some of the apps, and not just with Amazon content. For example, if I search for a movie or actress it can only search in Amazon content, not in Netflix or other apps I use. I can search for Netflix, which will show me the Netflix app, then do the search from there. I know they don't develop the Netflix app, but they could include that in the API and make it a requirement for app developers to include that feature. All in all a great product. Replaced my Roku 3 with this and I do like it better than the Roku.", "verified": true, "helpfulness": "0/0", "author": "M. MacDonald"}, {"rating": 5.0, "review": "Very easy to set up and use.  Amazingly small.  Great performance for the price.  Coupled with Amazon Prime, you can't go wrong.I'm not happy that HBO GO is not yet available for this unit, but it's new, so I'll give them time to catch up.", "verified": true, "helpfulness": "0/0", "author": "Paul R."}, {"rating": 5.0, "review": "This is a great way to stream movies it is fast no buffering.and it also has games that the kids will enjoy and you can use remote without having to buy a controller.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Already have a smart tv with most of the same apps but I like the way everything flows with the amazon fire tv. I especially love that I can stream the pictures on my phone as a screen saver for my tv. The microphone on the remote worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}, {"rating": 5.0, "review": "Easy to set up! Voice search is nice feature to have when searching for movies, games, tv shows or app's. A Great Value for Prime Members!", "verified": true, "helpfulness": "0/0", "author": "John"}]