[{"rating": 3.0, "review": "Not exactly what I was expecting ....  I travel a lot and wanted to keep up on news and sports live ....  I'm not really into re-runs of TV episodes ...  I love concerts on TV and Quello kinda sucks and usually doesn't fit my screen ...  Pink concert on Amazon Fire is awesome , but , that's about the only one offered ....  Not to impressed ...", "verified": true, "helpfulness": "1/1", "author": "Glen DeTienne"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "tornado615 \"tornado\""}, {"rating": 5.0, "review": "Great resource to more options for the tv", "verified": true, "helpfulness": "0/0", "author": "Bob H."}, {"rating": 1.0, "review": "Below is my original review, essentially Fire TV works great for Amazon Prime. However I also bought it for Mirroring my Phone/Laptop to my HDTV.This is what Amazon says;------ Mirror your tablet or phone on your HDTVShare whatever is on your screen, including movies, TV shows, music, and photos from your compatible tablet or phone with everyone in your living room using display mirroring. What you see on your Fire OS or Android device is exactly what you’ll see on your big screen, including support for devices from Motorola, Samsung, LG, and Google without any additional apps or software.-----------That is NOT TRUE. You cannot \"share whatever is on your screen\" and to even remotely make it work will require a Miracast app on your smartphone. The only app that would even find the Fire TV device was \"PlayTo\" but it would not stream/mirror to it. The \"PlayTo\" app did work with my Roku though. I have tried dozens of apps and none would actually mirror using the FireTV. My smartphone is Android 4.4 and according to Amazon, it should work, it does not. In fact, contradictory to all the hype, there are no devices that will actually 100% mirror whatever is on your smartphone except wireless HDMI units (expensive). What you can do is mirror some things but not everything. I have searched and searched for a device/app/software (other than expensive HDMI transmitter/receivers) that would allow me to stream active video (from a non-compliant website) to my HDTV. It cannot be done. If the website does not allow streaming, it will not work. If you know how, let me know.My Original Review;I would honestly give Fire TV 10 stars if I could. I have rarely encountered a product that worked so perfectly right out of the box. Voice recognition works great, the system is amazingly fast. I was also able to easily and quickly access all the songs/albums that I had bought from Amazon. Fire TV makes everything else seem ancient tech. We watched two movies in HD and perfect picture with no delays or breakups at all. I am so glad I bought the Fire TV, it is definitely the new standard in streaming, at least for Amazon content.However, there are some limitations. If your phone or tablet is not Android 4.2 or greater, most of the special features will not work. Also some of the other advanced features are only available with Amazon Fire products (phone,etc). Because of that, we will have to keep our ROKU also. It is a shame that Amazon has such a great product buy has place serious limitation on it.", "verified": true, "helpfulness": "0/0", "author": "S. A. ROBBINS \"shirley_rw\""}, {"rating": 4.0, "review": "I love it and so worth the price. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "works very good but if I had known I could have bought the chip I would have?", "verified": true, "helpfulness": "0/0", "author": "William Bragg"}, {"rating": 5.0, "review": "I bought this for my daughter for Christmas and my husband couldn't stop using it so I bought him one for his birthday.", "verified": true, "helpfulness": "0/0", "author": "Terry R. Weber \"web\""}, {"rating": 4.0, "review": "I would have given it 5 stars the only annoying thing that I've found it will shut off by have trouble viewing sign pop up but mostly you can go right back to watching the program it shut off of.", "verified": true, "helpfulness": "0/2", "author": "Erin"}, {"rating": 5.0, "review": "Amazon Fire TV is great! My teenagers love it!", "verified": true, "helpfulness": "0/0", "author": "tonya presley"}, {"rating": 5.0, "review": "I got this for Christmas and love it. I love the remote. It has a voice activated search option that works well. I was worried when I saw it because of my past experience in talking to machines via phones. The voice recognition never works for me and I always end up repeating or hanging up in frustration. If a machine calls my house I hang up.  But when I use the Amazon Fire voice search I rarely ever have to repeat. I can search by actor and it will pull up all their movies or shows. I do wish it had more search criteria options though. Like searching for all movie dramas  that have to do with a family vacation or a movie about disease or something. To be able to look specifically for certain things. I can do this via the Amazon website and rent the movie from the site on my pc.  Then when I go to use my Amazon fire the movie I rented from the website will be there. But that is inconvenient at times.", "verified": true, "helpfulness": "0/0", "author": "Bat \"Bat\""}]