[{"rating": 5.0, "review": "When I first opened the box, I was surprised at how small it was. I am able to put it right next to my cable box without having to worry about space.Right out of the box, the Amazon Fire was already pre-programmed with my Prime account so I do not have to bother with syncing it. It did an update and I was able to watch a movie really quick.Also, unlike netflix, Prim Instant Video went straight to the movie without buffering. Excellent product with excellent video quality.Havilng both Wi-Fi and Ethernet is a definite plus.", "verified": true, "helpfulness": "0/0", "author": "Vinson kho"}, {"rating": 5.0, "review": "I absolutely love the voice search feature.  I can't wait for it to be incorporated with more apps though, and for HBO Go to be available.", "verified": true, "helpfulness": "0/0", "author": "Jeff W."}, {"rating": 5.0, "review": "The Fire TV was very easy to connect to both my HDTV and my WiFi. I had the box up and running in about 5 minutes. The only thing that would have been a nice feature when setting up the apps for example NetFlix would have been nice to speak into the remove instead of tapping out the email and passwords.I loved the fire TV so much I ordered a 2nd one for the upstairs bedroom TV as well.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Wright \"fistandalitus\""}, {"rating": 1.0, "review": "did not like it", "verified": true, "helpfulness": "0/0", "author": "Lorraine Drew"}, {"rating": 5.0, "review": "I almost never watch regular TV anymore, I hate the commercials, so the Amazon Fire TV has been great to add to what I already have.", "verified": true, "helpfulness": "0/1", "author": "kindergarten cop"}, {"rating": 5.0, "review": "I purchased one, then my daughter wanted one for her room.  They work great and take up no room at all by your TV.", "verified": true, "helpfulness": "0/0", "author": "Eric Verstraete"}, {"rating": 5.0, "review": "I've had my Fire TV for 1 week. Set up was a breeze.  I have countless free movies thru Prime and Netflix streaming.  The voice search on the remote is the icing on the cake!  Thank you Amazon for a great product!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "These boxes work great and the voice recognition is phenomenal.  It has understood everything I've said so far, even with my mid-western with a southern flare accent-LOL!.  I like just being able to say the name of a movie or TV show without having to give specific commands first. They are really easy to install also-my teenager hooked up the one in the game room without even reading the instructions,  I've only been using it for a few days but so far no complaints.", "verified": true, "helpfulness": "0/0", "author": "Texas wife, mother and student"}, {"rating": 2.0, "review": "Was excited about the prospect of not having to type out search words to find movies on Amazon Instant Video, but this isn't the answer. The voice search feature was slow to react and took several tries to get the correct name or phrase. Movies and TV are lumped together and you have no choice but to scroll through the whole catalog. When you click on a choice, you don't see right away whether it's a Prime choice or a rental; you have to select the movie to see those options.Light gray type on a black background is almost impossible to read.Great idea, but doesn't work for us.", "verified": true, "helpfulness": "3/5", "author": "Toni Leland"}, {"rating": 3.0, "review": "I'm enthralled by the ease of use of this product.  I love that it easily tracks what I've watched so that I can switch from one show/movie to the next without losing my place.  However, there is definite room for improvement.  For one thing, the system can't be turned off!  You have to actually unplug it in order to turn it off.  This is extremely inconvenient to me- the last thing I want to do is get out of bed to unplug the device.  Also, the pause doesn't stay paused for very long before going to a screensaver.  It makes it difficult to read credits or anything else that may require pause.  There's also no fast forward or rewind.  There are buttons with those functions, but they only move in perhaps 10-second bursts (just guessing here).  I can understand fast forward because it's streaming (but you rewind to see something, you should be able to fast forward to where you were before you started to rewind).", "verified": true, "helpfulness": "3/4", "author": "Maria A. Cloos"}]