[{"rating": 4.0, "review": "The Fire TV has been great. The wireless works really well and we have experienced no problems watching videos using the wireless. The only improvement I would suggest is improving the search. Sometimes it is easier to search on a computer and add things to your watchlist then to find new things from the Fire TV especially when you don't know what you want to watch and are looking for ideas. Other than that, the Fire TV has worked really well.", "verified": true, "helpfulness": "0/0", "author": "M. Beaman"}, {"rating": 5.0, "review": "Great device. One stop shopping for all our entertainment venues.", "verified": true, "helpfulness": "0/0", "author": "D. Proko"}, {"rating": 1.0, "review": "got to units in a row that were DOA. The hardware is clearly low quality.", "verified": true, "helpfulness": "3/8", "author": "Julien A. Sebag"}, {"rating": 1.0, "review": "I never leave feedback but this time.I.feel.I have to This thing.is.useless. Its ridicoulous having. A usb port that cant be used. I wanted to.stream videos from myy external hard drive but.I just found out that the usb port is just a decoration. whoever designed this s*** must have a serious damaged brain. I was going.to.return it but I gonna keep it because I dont want.to waste more time on this thing. I just ordered a blu Ray player instead which is about the same price do everything this s*** does plus play any disc and stream movies from external drice and support 4k video display. I dont.why this crap.has many postitive reviews this people.must be so naive.", "verified": true, "helpfulness": "2/12", "author": "roberto velez"}, {"rating": 4.0, "review": "The device is everything I expected and then some.While the Roku may have more content available, the graphics and menus are very easy to navigate. Although, if you have a large music collection (400+) on amazon mp3 you will find it difficult to locate titles due to only being able to scroll through one title at a time on album view (really need to fix this).That brings me to the most significant downside i have seen thus far and it doesn't even pertain to the device itself.Amazon has a terrible delay on shipping this device. And especially the game controllers.Took nearly two weeks for this to ship and the controllers still haven't.  According to my cart there not expected to ship until the 2nd week of February putting them at nearly six weeks from the day they were ordered.With that said, its still worth the wait. I find this much more useful than the Roku 3 which we also own.", "verified": true, "helpfulness": "1/1", "author": "Walter B Keen"}, {"rating": 5.0, "review": "Happy with my new toy.  Easy to operate and love the voice activated feature.", "verified": true, "helpfulness": "0/0", "author": "Loron"}, {"rating": 5.0, "review": "We have only had the Amazon Fire a short time, but we really do love it.  I love that we can watch movies, listen to music, watch videos on Youtube, etc.  It took only a few minutes to install and connect and we were able to watch within minutes.", "verified": true, "helpfulness": "0/0", "author": "William D. Staggs"}, {"rating": 1.0, "review": "The first week it worked fine and then soon I kept getting a message that my device could not hold enough space to stream a tv show for more than a minute or two - it isn't my internet provider because it is streaming Netflix, Hulu, etc on my apple with no problems.  I have the bigger one, not the stick - it's crap.", "verified": true, "helpfulness": "3/8", "author": "Terry Plumlee"}, {"rating": 3.0, "review": "I would have given this a better review if you didn't have to PAY for most of the new content, even if your a prime member. All of the new release movies are very expensive! Its less money just to rent them on pay-per-view. Also, if you want to watch certain t.v. shows, you have to pay $2.99 per episode!!! It would be great if it weren't for the amount of money it costs to watch programs on it. I feel like if your paying for Prime, then you should get the t.v. episodes free, and rent the new releases cheap. You can watch new episodes of your favorite t.v. shows that you missed for free on the Directv Genie.", "verified": true, "helpfulness": "1/4", "author": "jc"}, {"rating": 1.0, "review": "I tried to set up my fire TV and was unable to do it.  I called Amazon for assistance and spent 10 minutes with phone support  with no success.  Will call again tomorrow and try again.", "verified": true, "helpfulness": "2/6", "author": "Amazon Customer"}]