[{"rating": 5.0, "review": "My hubby says getting Amazon Fire TV is the best $100 we ever spent. We actually spent more than that because we also ordered the HDMI cable and Amazon Fire Game Controller.  Well worthwhile IMHO.I don't speak \"tech\" well enough to get into specs but I can tell you that Fire TV streams Amazon and Netfilx much faster than any other device we've used. I purchased a Panasonic BluRay DVD player from Amazon because it supported Amazon streaming video ( along with the other \"typical\" services ) and for the last couple years it's been good. Admittedly we used it for Netflix more because the Amazon content took longer to load, etc. I also couldn't access my Amazon Watchlist on the thing...don't know why but was part of the reason we used Netflix more. I hated having to search Amazon Video every time for what I wanted.We're still keeping it as our DVD/BluRay player cuz it rocks for that but for streaming, Amazon Fire TV has it beat hands down!Hubby has tried a couple games with the Amazon Fire Game Controller and so far he's happy, well other than he can't get past a level on one game...lol.I also have to say I love the voice search! Even when my voice was \"froggy\" due to a nasty cold, it understood me!So far voice search has worked perfectly every time.I do want to say that having an Amazon Prime account is a bonus. If you buy Fire TV and don't already have a Prime account, get one...it's SO worth it!For one thing I can finally catch up on HBO shows like the Sopranos and others. Can't get those on Netflix and we don't subscribe to any premium cable channels. The cable company gets us for enough already.I love Amazon Fire TV and recommend it to anyone who wants a great, fast device to stream vids and play games.", "verified": true, "helpfulness": "0/0", "author": "CatRox"}, {"rating": 5.0, "review": "If you got this through a free 30 day trial like I did, then you are already aware of this great device and what it's capable of.Pros: Amazon Prime and Netflix both work great, I have had no buffering issues whatsoever with either service on the Fire TV unlike the Roku where the Amazon app doesn't work most of the time and the Netflix app went from working great at first to now constantly crashing the Roku whenever I try to use it longer than 20 minutes.Cons: YouTube doesn't work that well but I would blame that on the app developer rather than Amazon itself because the YouTube app on the Roku is also below par. The only good streaming YouTube app I can find at this point is on the Matricom G-Box Mx2 and as a major plus, the app on the Mx2 (through XBMC) also lets you download content to an SD card, so if you're only looking for a good YouTube app on your TV and you don't really care for either Amazon or Netflix, just buy the Mx2.If you're willing to put up with an okay YouTube app with nearly flawless Netflix and Amazon Prime streaming with a nice selection of games mixed in, then you really can't go any better than the Amazon Fire TV.$99 is a great price for something that will give you many hours of enjoyment and thousands upon thousands of choices all for the price of one month of cable that has mostly the same programming repeated endlessly, constant commercials and maybe five good channels out of 495 lousy channels.If you have an Amazon Prime membership and are looking for an alternative to the same old stuff and the same old overpriced and subpar cable service then you should definitely look into getting an Amazon Fire TV and make the best use out of your Prime membership and make the best use out of your budget.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer Redsox4life"}, {"rating": 5.0, "review": "I was all set for a complicated set up process. i think it took a total of 10 minutes before i was watching a movie on Amazon. Setting it up for my Netflix account was equally painless. I had a Chromecast device hooked up to my TV and loved it. This gives me a little more bang for the buck. Glad to have made the purchase.", "verified": true, "helpfulness": "0/0", "author": "wilkerdad"}, {"rating": 4.0, "review": "With Amazon Prime Membership, the Fire TV is great: streaming movies to TV, and tons of great titles.  The voice recognition software is FANTASTIC! (though I don't have much of an accent; not sure how it would be for someone with a thick accent)  Very intuitive use, and very sleek-looking (I much prefer it to the look of the Apple TV which I had some time ago).  Very fast.  Games are entertaining, and the other apps and channels are fun and nice to have all in one place.If you don't have an Amazon Prime, and don't plan on getting it, it seems that it adds little (voice recognition) to the function of my Blu-Ray player, X-Box, or most smart TVs, with many free apps with entertaining apps with less than A-list titles.  That said, it really is just great with the Prime membership.  Highly recommend it.", "verified": true, "helpfulness": "1/1", "author": "Phillip Tenzel"}, {"rating": 5.0, "review": "Today's update is a major improvement, and just what I was hoping for at this point 😋Prime Music✅Prime video✅Snappier interface😄✅Missing is the ability to turn off the sleep function, or, alternatively, single button wake and control.Screen-less play of music is sorely missing. This is a fault for every device in this category though.  The remote needs a music button!", "verified": true, "helpfulness": "0/0", "author": "C. Stauduhar"}, {"rating": 3.0, "review": "I was fortunate to receive this Amazon Fire TV through a special 30 day trial offered by Amazon.  The box and remote look and feel great.  I was very excited to try it in our home.  We are heavy Roku and Plex users.  First thing I did was to purchase the Plex app through the Amazon Fire TV's app store.  I will not review the Plex app here, since its not a product developed by Amazon, but I can say that it worked fairly well, most of the time.  The Plex app seemed to cause the Fire TV to lock up at least 2-3 per week, and the only way to resolve the issue was to unplug power from the Fire TV and plug it back in.  The voice control on the remote was cool, but it was not something I used at all.  Voice control did not work within the Plex app.  In my household we are also Harmony remote users.  I was disappointed that I was unable to get my Harmony 650 to be able to control the Fire TV.  Overall, I think the Fire TV is ok, but it just did not fit my household needs.  Thank you Amazon for allowing me to test your box, maybe future updates will resolve the issues I had.", "verified": true, "helpfulness": "1/2", "author": "Jorge C."}, {"rating": 5.0, "review": "Kindle is fantastic. Unexpected pleasures. Travel videos I had no idea were there. The voice command is very accurate and you can find things that are not easily identified. That means obscure items. I lived in Germany years ago and traveled often to Switzerland. I wondered what it was like today. I told fire tv Grindewald, Switzerland. Up popped a video. The TV shows available to watch seem unlimited if you are a Prime member.  They say buy or watch now. At first I thought I had to buy them to watch. Not the case. Volumes of recent as well as oldies TV shows.  It is worth the cost. I may cancel cable.", "verified": true, "helpfulness": "0/0", "author": "craig e leonard"}, {"rating": 3.0, "review": "I have had a lot of rokus, the latest being roku3 but they don't last long. My last 2 roku3s died on me within a year of one another. They operate very warm and I suspect that is the problem. I have been using a chromecast device which I control with my samsung galaxy 3 phone of late and I like it as I can turn on the TV and connect with Netflix with a Netflix app. and scroll through the content. The Amazon Fire is fine for watching Amazon content but I prefer Netflix.The much touted voice search does not work on Netflix. I did not like the idea that you have to use your tv remote to turn on the TV and then set it to the right hdmi input first, in order to watch content. If you want more content then go for Roku or Fire but if you are like me and only watch Netflix then get a chromecast at a 1/3 or the price. I have not really explored apps that can be used for chromecast so cannot  comment on more content. The Rokus were good while they lasted and cannot comment on how the Fire will hold up. I tried the Fire before sending it back. I prefered the simpler to use Chromecast using my cell phone. The Fire is reviewed much more in depth in other reviews on the subject.", "verified": true, "helpfulness": "0/1", "author": "phil"}, {"rating": 3.0, "review": "A couple things.  Get more apps guys, Roku is killing you and it isn't close.  the voice activation doesn't work very well, i don't ever use it.  the operating system looks dated, but it is fast.  I gave it an honest go, but Roku is better hands down.  I will try the fire TV again when they get more apps.", "verified": true, "helpfulness": "0/2", "author": "imrightyourewrong"}, {"rating": 5.0, "review": "I cannot say enough about this product. Since we purchased it, we've watched stuff on it so much, it's getting addictive. If you have Netflix streaming and/or Amazon Prime, this is the best thing possible. Playback has been perfect. The \"remote\" is extremely easy to use. The user interface is very intuitive and simple. We've watched YouTube videos, Netflix streaming and Amazon Prime streaming on it. We also love the auto screen saver that has a gorgeous selection of landscape pictures that are extremely pleasant to look at. We are thrilled with this product and highly recommend it!!", "verified": true, "helpfulness": "0/0", "author": "Kae"}]