[{"rating": 4.0, "review": "I have been a roku user for years and currently own a Roku3.  Firetv i found to expensive at first but came across a sale so decided to try it.  I also own a WDlive player as well but that i feel is in different category.  I personally find the roku 3 better.  I know on paper the Fire has better stats and is more powerful but while using it i really cannot tell the difference in terms of speed using both.  Roku beats out firetv on content, way more to choose from.  Also I like the Roku UI better as far main menu when you select a channel, Roku gives you a large view so you can see more on screen, where firetv gives you a row and have to scroll left to right.  Amazon prime is even better on Roku, you would think Firetv would have a great prime UI.  Same thing Roku organizes it based on channel,tv, movie  Fire tv again gives you a list that you scroll through left to right.  I also thought firetv remote had a scroll feature similar to like a ipod but its just basic button not sure why its a circle like that.  Voice search is nice but i wish there was way to limit what it searches.  I couldn't get it to play sound while streaming off my NAS but Roku cannot do that either. Thats where WDLive player is the best.  For those considering WDLive player, it can only do one thing well thats stream local content, other than its awful, horrible UI, sluggish navigation, clunky IR remote with to many buttons.  Its a chore to use, but it plays every format i throw at it off my NAS.I give Fire 3.5 Stars.  Roku3 5Stars WDplayer 2starsNow i have hope for firetv that they will add things and I will try rooting it this weekend and see what I am able to gain by modding it and will report back later.UpdateSo i was able to sideload some apps, nice feature.  I sideloaded plex - doesn't seem to work as well as it does on Roku.  I also discovered that to access the apps you have to go into settings everytime what a pain.  You dont get a Icon on your main screen like i thought i would.I also installed XBMC - i fail to see why this is so hyped?  Its basically like 1000 channel of internet streams none i would every want to watch.  I suppose if you have no cable than maybe this is better than nothing.  but i didnt find one channel i would want to watch, most i can already get through Roku or Plex.Only thing about FireTv that keeps me hanging on is HOPE.  If there is way i can eliminate Reg amazon and just see prime when i search or just search free content.  In the end I paid 50 bucks for this on sale, i would feel very upset if i spent 100.  I will keep tinkering but i find myself just using the roku.", "verified": false, "helpfulness": "0/0", "author": "RafMan"}, {"rating": 4.0, "review": "Great little device. Love the response, but wish the voice command was more integrated with Netflix, etc.", "verified": true, "helpfulness": "0/1", "author": "TS \"~TS\""}, {"rating": 5.0, "review": "This is really a great device.", "verified": true, "helpfulness": "0/1", "author": "Frank Wright II"}, {"rating": 5.0, "review": "So, 4.5 stars is really what I would like to give the Amazon Fire TV.  I have been super happy with it.  It is fast, let's me access a large variety of apps and choose what I would like to have running.  (This is the first truly open TV device that I've seen.)  I've been enjoying it enough that I have purchased a second one and will probably get more.The interface is pretty self explanatory.  The remote is Bluetooth, which means you don't have to point at the device.  I have not heard what else you can use to control the Fire TV, but an app on an iOS or Android device would be nice.  Since the remote doesn't require IR, I would like to use the other devices I have to control so I can keep from losing another remote.  Plus, the Bluetooth aspect doesn't work well if you have a Harmony or other super remote.  (I do not know if the Fire TV accepts IR from a universal remote.)I would not purchase this device if I didn't have Amazon Prime.  I do not think that it is very usable without access to their selection of Movies and TV Shows, especially since they are starting to create their own shows.  They still don't have HBO GO on the device, so don't expect access to all of HBO's line up, but they have their old stuff with Prime.  So, I would suggest it to anyone wanting a smart TV in the house if they have a Prime account.Pros:Plex and XBMC (Rebranded to be Kodi) can be installedOpen platform so you can make it what you wantRelatively fastSome gaming optionsCons:Voice only works with Amazon's Video/AudioNo Good Airplay option (Yes, I have an Apple device.  I like to push audio/video to the TV.)Game remote is expensive (No idea if you can connect other gamepads like PS3 or Xbox360.)  No idea if the gaming options are going to run well on the Fire TV.  (I did not test as I don't have the gamepad.)No HBO GO", "verified": true, "helpfulness": "0/0", "author": "J. Keefe \"Techie that expects more\""}, {"rating": 5.0, "review": "One of Amazon's best products IMO! Easy install and user friendly.", "verified": true, "helpfulness": "0/1", "author": "David Sloas"}, {"rating": 4.0, "review": "Pretty much all the content anyone could want at decent prices.", "verified": true, "helpfulness": "0/1", "author": "Ben C Fields"}, {"rating": 4.0, "review": "The only way this would be better would be if it had a web browser to make it even more versatile.", "verified": true, "helpfulness": "1/2", "author": "Gerald Bergeron"}, {"rating": 5.0, "review": "So impressed with this product, and way I can now view all my Amazon movies on my HD TV!!", "verified": true, "helpfulness": "0/2", "author": "charlotte"}, {"rating": 4.0, "review": "When I looked at streaming boxes, I had two uses.  One was on the bedroom TV, and the other was the big TV in the family room.  When I compared features of the various boxes, I noted that the Roku 3 has a headphone jack on the remote control that automatically mutes the TV.  Perfect for the bedroom so I can watch TV while the ol' ball and chain sleeps one off.  On the other hand, the Roku 3 box lacks any kind of audio output on the streaming unit itself, so I can't easily tie audio into my A/V receiver for surround sound when watching movies but not having to run the A/V receiver to watch regular TV shows.  Fire solves that problem with an optical audio output.  I did buy Roku 3 for the bedroom, but I'm considering the Fire for the TV room.  Fire has the video services that I use, so that's not an issue.  On the subject of video services, the Roku's huge base of services really isn't a big incentive since the vast majority of them are churches and junk channels with content of little interest to most users.", "verified": false, "helpfulness": "0/2", "author": "arjayess"}, {"rating": 5.0, "review": "I like it. Great picture. Need to work on some additional functionality.", "verified": true, "helpfulness": "0/1", "author": "Myles"}]