[{"rating": 4.0, "review": "I like the device itself, especially the voice command feature. There are lots of movies to choose from but I am disappointed with howmany of them are not free,being that I am a prime member.", "verified": true, "helpfulness": "0/0", "author": "Willy K."}, {"rating": 5.0, "review": "I needed to replace my current streamer.  It was starting to have more issues and never worked well with Netflix in prime time.  I won't mention the brand but it rhymes with bologna.  I mainly stream Amazon Prime and Netflix so I needed a device that would do both.  So basically it came down to the Fire or Roku.  The choice was easy as the Fire has a lot better hardware specs.  And the Fire also has digital optical out which allows me to connect direct to my surround system and get awesome dolby digital sound.  The Roku does not.  What does the Roku have that the Fire doesn't?  An earphone jack in the remote I would never use and 1200 channels I never watch.  I won't use the voice search on the Fire for reasons I won't go into here.  Even removing that feature from the equation the Fire is a far superior unit to Roku's finest(?) for the same price.Update 6/19/2014:  The more I use Fire TV the more impressed I am.  There are a lot of complaints about the search function limitations.  To me that is a non-issue.  I find everything I want to watch online and add it to my watch list both for Amazon Prime and Netflix.  What I love, love, love is the recently watched list.  I just go there and scroll through my shows and watch the oldest.  Amazon Prime is very slick at pulling up the next show to watch, even if I have earlier watched the entire series.  On Roku it is just a mess finding the next show if I have already watched the series once.  I also really like that you can remove items from the recently watched list (wish Netflix would get on board with that).  I did have a some stuttering streaming Netflix, but Amazon was very helpful and replied quickly with an relatively easy fix.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Techno Nerd\""}, {"rating": 5.0, "review": "Just got it Thursday and just got it set up this morning.Set up was so easy it made me laugh.  The volume of programming available is mind-numbing.  I was thrilled with the ease of use and how, even though it's streaming video, you would have thought you were watching a DVD.I have an LG Blue Ray player that has Netflix, Hulu, Pandora and a few other services integrated to it.  We watched a few movies on it through Netflix streaming and it was slow; slow to get to the movie you wanted to watch, slow to download, and the buffering/streaming process was slow.  Then the quality just didn't seem very good either.  It plays DVDs and Blue Ray discs just fine, but the streaming, not so much.  We would listen to Pandora on it sometimes too while playing games and that interface was also slow and cumbersomeI watched an exercise video first thing after getting it all set up.  It was like I was watching a DVD and not streaming.  Amazing!  I am so excited to have Amazon Fire TV.  I know my husband is going to love it too.  They have the Smithsonian channel on there.  He loves Aerial America.  Of course, you have to scan the menu for when it's coming on next.  With Fire TV, just turn it on and start watching, no commercials!  Doesn't get much better than this!I'm already hooked.  Can't wait to start watching movies on a regular basis.  I've reinitiated my streaming service with Netflix and may do away with getting the DVDs - what a concept.  It's about time!Oh, and the voice command feature really works.  I was a bit skeptical about that advertised feature, but so far, all the little things I've tried, it's gotten each one of them, no problem.I'm so excited to be using this on a regular basis.  Maybe I can kick my over-priced ATT Uverse TV package to the curb one day soon........", "verified": true, "helpfulness": "2/2", "author": "Amy CC"}, {"rating": 3.0, "review": "First, I love Amazon and it's products.  I purchased an Apple TV for the sole reason that it was one of the few devices that would provide HBO GO.  When I saw this Fire TV, I thought \"Amazon has done it again\"...I thought it was funny that in the list of comparable devices, Fire TV was the ONLY one that didn't have HBO GO, which is what I primarily use the Apple TV for.  I'm sure it has to do with licensing or something of the sort, but I thought it even funnier when you notice that the Fire tablets do have the app.  The puzzle isn't fitting.  I may invest when they fix this issue.", "verified": false, "helpfulness": "0/2", "author": "Joe"}, {"rating": 5.0, "review": "Love the Fire TV. Easy to install. Less than 30 min. I am a Prim member & this makes it even better. LOVE THE REMOTE. THE VOICE LOOK UP IS SO FAST.", "verified": true, "helpfulness": "2/2", "author": "Happy Shopper \"Love AMAZON.COM\""}, {"rating": 5.0, "review": "Got my Fire TV yesterday and couldn't be more pleased! It's small but it's awesome.....by being a Prime member I get tons of shows and movies to choose from....the picture quality is perfect and the voice search really works well. I hesitated about the purchase because I wasn't familiar with any of the streaming boxes but the set up was so simple and it's very user friendly even for non-techies.I was a little disappointed that so many of the TV shows cost extra but there are plenty that are free. Would I buy it again? Absolutely....in fact I may get another one for the bedroom for rainy days when there's nothing on regular TV. You done good Amazon....Fire TV is a keeper!", "verified": true, "helpfulness": "2/2", "author": "C. McCreary"}, {"rating": 4.0, "review": "Picture quality is amazing. Like all the different aspects of where the Fire TV can send me. If I wasn't a Prime member I would be paying for alot more things Iike moves and other things I would like to see. Kinda of miss leading about all the free stuff I would accessed to. Would be access for a price.  Which is a little bummer. I already have a TV with all the Netflix, Pandora and such. I like the Fire TV just a little disappointed.", "verified": true, "helpfulness": "0/0", "author": "Valerie Barron"}, {"rating": 1.0, "review": "the prime membership for the movies is terrible. there are very few movies that one doesn't have to pay for. Even 50 year old movies I have seen 10 times amazon wants money to watch these movies. the fire tv itself is great but the prime membership is no good and I do not plan on getting it once the trial is over.", "verified": true, "helpfulness": "7/21", "author": "Amazon Customer \"creg\""}, {"rating": 4.0, "review": "I am a long time user of a second-generation Roku device, which I am fairly pleased with overall. Since buying a new Samsung HD TV last fall, I have been using their native Smart TV application and do not care for it very much. The Fire TV box is an advance on the Roku I was using, and if I could give it 4.5 stars I would. The Fire TV device is not perfect, but it is better in several important areas. The choice of Bluetooth over IR for linking the remote is great. I hate having to fiddle about finding the sweat-spot in order to command the box. I like the way the box manages to buffer the show well ahead of what is being played, this very much increases my viewing pleasure. I have only played around with the Voice Input for search mode a little so far, but I think they are on something here. I need to refine my ability to make useful search requests, but the feature never once failed to accurately decode the words I said. It is optimized for Amazon streaming out of the box. I have only loaded the Netflix app so far, but it was painless to do so and is working just fine.", "verified": true, "helpfulness": "1/1", "author": "William R. Kirk"}, {"rating": 5.0, "review": "Perfect for our bedroom TV needs. There are a few wish to haves, like a bigger buffer for streaming HD content and the ability to play my own AVI movies,  but they could be addressed by software upgrades; there's certainly enough hardware power to do that.Began using the hard wire and I didn't have any trouble setting it up onto my network, but then, I never do. WiFi has no trouble @ 20 feet through a wall.Would be really cool if we could use our own apps...", "verified": true, "helpfulness": "1/1", "author": "Anthony H."}]