[{"rating": 5.0, "review": "I just hooked mine up yesterday and first off setting this up is very easy.  Power it up, select wireless network, enter password and done.  I've used Netflix, Amazon Prime video and Pandora so far and all are easy to use.  Picture and sound quality is awesome.  Easy of use is worth five stars alone.  If you have a kindle you will be familiar with navigation.  So far I love my Fire TV.  The one improvement I would make would be to include a HDMI cable in the box and maybe a bundle that includes the game controller.  I did scroll through the available games and there are quite a few I am interested in.", "verified": true, "helpfulness": "0/1", "author": "Gamer \"Family Gamer\""}, {"rating": 5.0, "review": "The Kindle Fire TV is a small package packed with tons and tons of features.  It was easy to set up.  The voice activation is correct 100% of the time.  This is a cable TV killer.  Keep adding channels and features!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We like everything about it.  It was easy to install and the whole family is enjoying the Prime movies and TV shows.  I had been looking for something like this for a long time.The fact that it responds to voice makes it so much easier to use.  I have trouble with small keyboards and this is the ultimate solution .", "verified": true, "helpfulness": "0/1", "author": "dobber"}, {"rating": 4.0, "review": "I likes it but I'm still learning :) there's a lot too be discovered still . Looking forward too hours of fun .", "verified": true, "helpfulness": "0/1", "author": "verner  Henry"}, {"rating": 3.0, "review": "Netflix has thousands of titles to choose from and Amazon only has hundreds though they just started up.I'm gunna give them a 1 year trial and then decide if I want to pay the 100 dollars a year or not.", "verified": true, "helpfulness": "1/2", "author": "Kevin Keene"}, {"rating": 5.0, "review": "I love this item.  I have prime because I do a lot of online Christmas and birthday shopping since I live in a very rural area that you basically have one store to shop in unless you want to drive 2 hours.  I would watch the prime instant video's on lunch breaks or my kids would watch them on their kindles but other wise it seemed useless.  Now the whole family can enjoy it and we are finding new series to fall in love with.  I would highly recommend this especially for someone with kids.", "verified": true, "helpfulness": "0/1", "author": "Kelly J Ferrell"}, {"rating": 5.0, "review": "Firetv works great. Attached and up and running in a very short time. Most impressed with the voice control.Finds correct request and low voice is all that is needed.", "verified": true, "helpfulness": "0/1", "author": "rgf42 \"rfreeland\""}, {"rating": 5.0, "review": "It runs XBMC really well! Not out of the box, but once its installed via Android Developer Tools. XBMC even plays 1080p video well on this device too. Very happy. Just wish you could add side-loaded apps to the home-screen apps list.Side Note: If you must reboot this (rare), don't unplug and replug-in the power to reboot this. Just hold the [Select] and [Play/Pause] buttons for a few seconds. (Select is the center of the nav-circle.) Rebooted! Done.", "verified": true, "helpfulness": "4/5", "author": "Brak"}, {"rating": 4.0, "review": "Amazon Fire TV lives up to its expectations.  Very easy to useBetter than Apple TV (which I've tried) Get one today", "verified": true, "helpfulness": "0/1", "author": "Rkbuster"}, {"rating": 4.0, "review": "Its good, can be cheaper then cable if you only use netflix. Prime seems to pricy at $99 a year for less flicks then netflicks", "verified": true, "helpfulness": "0/1", "author": "t. delgadillo"}]