[{"rating": 3.0, "review": "The product works as advertised but the set up was confusing for an old non tech person. The instructions should have said to go to a different or correct source.", "verified": true, "helpfulness": "0/0", "author": "Greg Hedlund"}, {"rating": 5.0, "review": "My favorite so far, keep it up Amazon", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome device. Can't recommend enough.", "verified": true, "helpfulness": "0/0", "author": "Robert F"}, {"rating": 5.0, "review": "It installs easily and picture quality is amazing.  With Amazon Prime and Netflix I really don't miss cable tv and I am commercial free. It's well worth the money and I would recommend it to anyone that wants to get away from cable.", "verified": true, "helpfulness": "0/0", "author": "American Patriot"}, {"rating": 5.0, "review": "This product is amazing!  It's easy to use (even my 3 year old understands how to use it! ) and I've never had any technical issues with the system itself or any programs we've watched. The best part is how many shows and movies are available. Amazing.", "verified": true, "helpfulness": "0/0", "author": "cryst837"}, {"rating": 4.0, "review": "Could perfect with more app options for clean TV watching.", "verified": true, "helpfulness": "0/0", "author": "UT Mom"}, {"rating": 5.0, "review": "We have an Apple TV as well, but we love this so much more!", "verified": true, "helpfulness": "0/0", "author": "Jen B."}, {"rating": 4.0, "review": "Getting the verification code from our cable provider was a nightmare for some of the apps. This probably isn't on Amazon, but it was still a hassle. For streaming, sometimes the quality dips in and out, moreso than on other devices we have in the home, again, this could be an internet/throttling issue. Set up was easy, my parents have been able to figure it out and use it.", "verified": true, "helpfulness": "0/0", "author": "Jake Chak"}, {"rating": 5.0, "review": "Our new favorite gadget! Bought this to make it easier to view Netflix and Hulu, and to also gain access to our Amazon Prime video benefits. We've had this for 3 months now and use it religiously. It's so easy to navigate and there's never an issue with buffering or anything. With the Amazon Fire TV, I can actually see us comfortably getting rid of our cable altogether. We'll just have to go a nearby bar to watch live sports, which doesn't really sound like a downfall.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Good hardware but awful software. The user interface is a mess. Apps installed always have some problems. I can't believe Amazon rolled out a product like this. I have to reboot the device couple of times a week. I have Roku for many years and it is very user friendly and stable. fire TV has usb but you can't connect a external hard drive for it. You can connect a mouse but amazon interface doesn't support it. voice search is very limited. The only good side is I can enable the develop mode to install 3rd party apps which are much useful than the original one.", "verified": true, "helpfulness": "0/1", "author": "D. Lu"}]