[{"rating": 5.0, "review": "I love this.  It works flawlessly which is why I wanted it.  Hubby's Chrome stick-thingy was a pain in the butt.  Fire never stalls out or skips. Also it doesn't tie up the computer, which is what I am usually occupied with while my guys watch Star Trek ad nauseum.  Now I am not a big TV person and have never had cable, so I have plenty here to entertain me.  Maybe others would not, but looks like I could subscribe to it all. We've ordered a game controller and i'm looking forward to being able to play with my kid instead of him being off in a corner somewhere with a mobile device.  As multiple kindle device household who shops at Amazon a lot and now has Fire TV, Prime is the best deal in town.  It's pays for itself over and over again.  Worth every penny.", "verified": true, "helpfulness": "2/2", "author": "A. Frank"}, {"rating": 5.0, "review": "Set-up was a breeze, the voice recognition is amazing, speed - wow!  So much faster loading and starting videos than our Blu Ray player is. Our Sony Blue Ray software doesn't support subtitles while streaming, nor could I contact them easily for information re: which player might be able to help me. Totally satisfied with this product. Now I'll order a second one for our other TV.", "verified": true, "helpfulness": "2/2", "author": "E. Schleinz"}, {"rating": 1.0, "review": "Was dead on arrival. Had to call an have it replaced. Plugged it in, set it all up. Went straight to the Amazon logo. Called tech support, they said they must have seen the power light on and sent it out without actually quality checking the product. Pretty sad expecally when said \"guarantee to work\"", "verified": true, "helpfulness": "1/5", "author": "james"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "1/1", "author": "Jrose1022"}, {"rating": 1.0, "review": "Since it doesn't work outside of America, what good is it?  I travel a lot outside of America and I want one that works world wide.  Why is that so difficult?", "verified": false, "helpfulness": "2/12", "author": "InDenver"}, {"rating": 4.0, "review": "remote drained batteries within hours.  replacement rremote works great.  easy navigation.  easier to use than other devices for movies", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 4.0, "review": "This is my new favorite thing.  There are so many movies and shows that you can watch on Prime.  I do wish there was more Prime content and not so many that you have to purchase but there is still so much to choose from.  My kids absolutely love it.  I have 2 boys 13 and 17 and they can always find something to watch.  I also like the fact that I can have my music downloaded to prime and listen to it from my tv.  I definitely think it is better than Netflix.", "verified": true, "helpfulness": "0/0", "author": "Rhonda McPherson"}, {"rating": 1.0, "review": "With hundreds of WIDE OPEN Android Set-Top boxes available ON AMAZON (Matricom and Melee just to name a couple) I see no reason why you would buy this.  The others play HD, 4k, of your own media off your network or external device, Have FULL access to GOOGLE play store (not just the skimpy Amazon store Apps)  and XBMC SUPPORT!!! That alone is a deal breaker... RESEARCH THIS!!! This box is for people that have VERY limited knowledge/skill with electronics (Apple already makes electronics for children) and who love to pay money over and over for media they already have access to. I have purchased at least 4 different models of Android boxes that cost the same as this and outperform it in every feature and function. PLEASE take the time to learn more about the available products out there and buy something else. IF ANYTHING to force Amazon to make a more user friendly box that let's us use it the way we want to.", "verified": false, "helpfulness": "1/4", "author": "Cms3717"}, {"rating": 5.0, "review": "I am enjoying this far more than I expected.", "verified": true, "helpfulness": "0/0", "author": "Peg Schaeffer"}, {"rating": 5.0, "review": "Great system and the features are far superior to Apple tv", "verified": true, "helpfulness": "0/0", "author": "Angela Weldon"}]