[{"rating": 4.0, "review": "Great streaming box..... I own several different STB and this one is by far my favorite.....the storage on this box needs to be extended..... If you download one or two games its full!!  This would be a five star box if the USB slot on the back could somehow be activated to be used with an external USB storage device", "verified": true, "helpfulness": "1/1", "author": "Brian"}, {"rating": 5.0, "review": "This is the only set top box I have, leaving aside the HTPC's I have. But it is just amazing, I have a wireless keyboard/trackball connected through the USB port and side loaded many other apps that don't come with the Fire TV like: BSPlayer, Chrome, XBMC Gotham, Snes, etc.Additional to the above, the gaming is just lovely.... the best. And of course the videos and movies just stream brilliantly... I can also see my home video collection on it (MKVs, AVI's, etc)I guess the only thing I wished it had was more \"made for\" Fire TV apps and more memory (definitely)", "verified": true, "helpfulness": "0/0", "author": "Felipe Amigo"}, {"rating": 1.0, "review": "Was sooo excited. Now sooo disappointed. Expected my FireTV box with my Amazon Prime membership would access Showtime without a cable TV subscription, no luck. I would be happy to pay for Showtime over IP without the rest of the cable crap.Also cannot get sound with Prime movies or TV over HDMI from the FireTV box although it plays Netflix content and Showtime teasers audio  sound without problems over HDMI. I Have Chromecast and an. Internet-enabled BlueRay player and both deliver Netflix and Amazon Prime -- with sound. Fire TV has better video quality than either, but without sound FireTV is worthless.Finally,  much of the content supposedly included in my Prime membership demands payment when using Fire TV.", "verified": true, "helpfulness": "8/12", "author": "C. Farnsworth"}, {"rating": 1.0, "review": "I am beyond frustrated. I have constant freezing issues! Watching Hulu Plus. Freezes. Watch a movie. Freezes. Tried backing it up. No. Have to stop and restart to get the puicture to unfreeze. What is the patch?", "verified": false, "helpfulness": "7/11", "author": "Kris Vanica"}, {"rating": 5.0, "review": "Judging by some of these bad reviews I think some people didn’t have a clue what this thing would actually do before they bought it.  I've only used it a few times but so far I love it.  I used to have a huge movie collected that I taped off of cable channels back in the 90’s.  Of course all those tapes are gone now but hey some of the movies are available on Fire TV and they’re free.  Awesome!  Old TV shows for free. Awesome!I had a few small problems in the beginning trying to set it up which were NOT the fault of the Fire TV but I'll tell you about them in case someone else has the same problems.  It started by trying to do it's update before I could get to the good stuff. Well I knew it was going to do that so I was ready.  Unfortunately it was trying to pick up our WIFI and our neighbors and it was confused.  The screen would only flash for a second (this went on for about 10 minutes) but it was long enough for me to figure out what it was trying to do.  I had to push a few buttons blindly on the remote but once it connected to our WIFI it was smooth sailing.My next issue involved my HDMI cable but I didn't figure that out until I tried a bunch of other stuff.  I bought a brand new cable, similar to the ones I have for my DVR and my DVD Player.  My TV is only 19 months old so I knew it probably wasn’t the TV.  I could fast forward stuff that I had already bought on Amazon Prime but it wouldn’t let me watch it. Finally got an HDMI cable from my sister, switch it out.  Works like a charm now.Then lastly, in trying to figure out my last issue I created one more.  I had audio on some items but not on others.  Posted a question to the lovely folks online.  Got a few answers that weren’t gonna work for me but in reading someone else’s post I saw a suggestion which I tried for myself and it worked.  Apparently I had changed my audio to “Dolby Digital Plus On” when it should have been “Dolby Digital Plus OFF”  Problem Solved!!My one and only issue with the Fire TV is there is no off switch.  Sure it goes to sleep a few minutes after I shut my TV down but I just have a phobia about these things and I always unplug it when I’m done.  So far it's always come back to life when I want it to, lol.  I understand Roku has this issue as well.  Not a big deal really.", "verified": true, "helpfulness": "4/4", "author": "C. M. Hill"}, {"rating": 1.0, "review": "I am a certified Amazon fangirl, and I was really hyped when this was announced, but we waited a bit, and were pleased when Amazon offered us a free 30-day trial of the Fire TV. Cool, I figured I would end up keeping it. It's Amazon, yo!Uhh, it worked alright for about two hours... the boyfriend got to watch some old Batman cartoons on Prime. But when we went to watch Boardwalk Empire together... we ended up staring at a blank screen. Reset the damn thing 3 times, nothing. Maybe it's the video? So I picked something else on Prime. Nope, blank screen. Not even Batman would play anymore.Really, Amazon? REALLY? Why didn't you test this thing before sending it out. Isn't the point of a trial to get me to keep it and pay for it? Even for the short time it did work, it didn't do anything my PS3 doesn't already do.Add to that, the search function for Prime is ridiculous. You can't search for the Prime-enabled content, because of course they want you to end up buying the other junk.Voice search was cool, but it only works for Prime, so what's the point, if it doesn't work for all the other apps?Come on, Amazon. I expect way more from you. Utterly disappointed. The Fire TV has been out of the box for less than a day, and it's going back into the box immediately. My trial is over. :(", "verified": true, "helpfulness": "39/44", "author": "Darkbard"}, {"rating": 3.0, "review": "I like a lot about this device.  Fast processor.  More memory than I'm used to having.  Easy navigation.  Everyone in my family really likes using the voice search to find movies.  The search is limited to finding Amazon movies, but it is still pretty slick.Then I changed my Amazon password.  From that moment on, I could no longer access Amazon movies from the Fire TV without first renting them on my laptop, putting them in my video library, then retrieving them from my library on the Fire TV.  A minor hassle for me.  A disappointment for everyone else in my household who had grown to like to search using voice commands and, with a single click, watch the movies they like.  Finding me and asking me to rent a movie on my laptop, when they just want to sit down, turn on the television and watch a movie, is not working for them.Amazon has been trying to fix this for over a week, without success.  It has been passed to their Development team to resolve.  I'm sure that, eventually, they will identify the cause and make the fix.  However, in the meantime, you should either wait to change your password or wait to purchase the Fire TV.", "verified": true, "helpfulness": "3/5", "author": "Jim Britt"}, {"rating": 4.0, "review": "Very nice quick set up was able to login to my apps with ease Amazon was already preconfigured just needed to sync with my account which was very easy. Netflix and HulaPlus  worked like a charm and Pandora as well. The first thing I noticed was the audio quality was significantly better then my ROKU which I have been a ROKU user for 3 years and the speed of the OS and loading of steaming content superior also picture quality is very good. I have been stalling on purchasing a ROKU 3 due to the fact that they chose not to put a optical out.My current roku has an optical out. I have an older high end 7.1 surround system with no HDMI and did not want to up grade my audio component do to the lack of an optical out on the ROKU product so Fire TV was a strong contender for choosing  this streaming device and I am so far very satisfied. The voice search works and pulls up the app as spoken. I have not had time to sufficiently use the voice search to post an honest opinion but it seams okay. I just hope they add a RedBox app soon.", "verified": true, "helpfulness": "3/3", "author": "Big D"}, {"rating": 3.0, "review": "Trying to figure out how to get it to work.  No directions included to make it work with my t.v.  Frustrated.", "verified": true, "helpfulness": "0/3", "author": "Carol Kope"}, {"rating": 5.0, "review": "I Love my Amazon and my Amazon Fire TV.  I have not tried any other streaming electronic gadgetry before but I am a thorough comparison shopper, product researcher, consumer report reader and customer reviews reviewer  before I ever place an order like this.  From all other the info I gathered and now my very own experience with Amazon Fire TV,  You will not be disappounted when you spend your dollar on it.  Exceeds all expectations! The only complaint I have is... Its hard to get any work done now that I own it!! Great Job Amazon!", "verified": true, "helpfulness": "2/2", "author": "CCinAZ"}]