[{"rating": 5.0, "review": "Came just like new. Works very nicely.I am pleased to have and enjoy my Fire TV. It does ALL I expected.  Thank you for continuing to have excellent products,  associates and excellent service", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "This is the best item I have ever purchased easy set up and I love the ease of use I am using it constantly.  I would recommend this to everyone for all services.", "verified": true, "helpfulness": "0/0", "author": "Norma J. Roberts"}, {"rating": 4.0, "review": "The unit was a breeze to set up. The voice search on the remote makes browsing for programs quick and effortless. I am disappointed there is no religious or spiritual channels to choose from such as TBN or Daystar.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Only had a short time, but love it so far.", "verified": true, "helpfulness": "0/0", "author": "WILLIAM E MCDONALD"}, {"rating": 2.0, "review": "The Amazon Fire TV works great and is quite user friendly! I am also a Amazon Prime member, which is almost a requirement. Imagine my disappointment when I tried to watch a movie that was over 2 decades old and they expected me to pay for it! The more I looked into what I could watch for my membership, it was more than a little disheartening. Netflex gives you more for $7.99 a month. Poorly done, Amazon. I can only hope you come to your senses and give your paying members a little more.", "verified": true, "helpfulness": "2/5", "author": "Cynthia Kaiser Mullen"}, {"rating": 5.0, "review": "Fabulous product Dolby sound is over the top. Instant on and fast scrolling is way better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Frank T."}, {"rating": 5.0, "review": "Awesome Machine", "verified": true, "helpfulness": "0/0", "author": "James McDaniel"}, {"rating": 4.0, "review": "Good speed and resolution with quad core processor. Need more applications from Android platform.", "verified": true, "helpfulness": "0/0", "author": "NCP"}, {"rating": 4.0, "review": "I am having trouble keeping my internet connected which I don't know if that is the fire or my cable wifi box that is at the other end of my house but otherwise I am satisfied with the fire when it is connected.", "verified": true, "helpfulness": "0/0", "author": "Patty Atkinson"}, {"rating": 2.0, "review": "No Prime video available outside US.  Kind of useless without prime", "verified": true, "helpfulness": "0/1", "author": "Daniel Mata"}]