[{"rating": 5.0, "review": "We use this all the time.  It is nice for a someone who cant justify having a dedicated game system.  It does kind of shove Amazon content in your face, but the Plex interface is nice.  Or you can easily sideload other free DLNA clients for free.The newest update has placed a big ad for an amazon show on the home screen which is annoying, given the same show is also listed on the \"featured\" amazon section.  I would like to see that removed.  BTW the cover for \"transparent\" freaks us out.", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 5.0, "review": "We took a while to plug it in, but once we did we were amazed at how much easier it was to use than our old SONY streaming box. The picture is wonderful and the choice of apps is awesome!", "verified": true, "helpfulness": "0/0", "author": "Janna Rosenkranz"}, {"rating": 4.0, "review": "Needs a sleep timer, current sleep mode just doesn't work if you're watching a series. Otherwise, Love it.", "verified": true, "helpfulness": "0/0", "author": "Malena D Jones"}, {"rating": 5.0, "review": "Easy to set up!  Easy to use!  Quality product in quality packaging.", "verified": true, "helpfulness": "0/0", "author": "5qtcats"}, {"rating": 5.0, "review": "Great product. Love the convenience.", "verified": true, "helpfulness": "0/0", "author": "Krystal"}, {"rating": 5.0, "review": "Love itd", "verified": true, "helpfulness": "0/0", "author": "Kat Cook"}, {"rating": 5.0, "review": "Actually I love it! Just haven't had the time to really use it as much as I would like lately.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Nowlan"}, {"rating": 5.0, "review": "Awesome. Cutting edge stuff. Lots of fun.  Excellent quality. It's like the coolest new toy.  I am very happy with this purchase. Thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "Christopher Davis \"chrismd\""}, {"rating": 4.0, "review": "It works well. Watching netflix is great. But tome of the other apps I wanted to use (the A&E; stations) don't have comcast yet even though the app description said it did. I guess this not Fire TV failing to work properly because it does. But I did want to sue those other apps. If you are not a cable subscriber then there is limited content available thru A&E;, history, etc. I have not tried any tv station apps not affiliated with A&E; yet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"rickitick\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kelli007"}]