[{"rating": 5.0, "review": "This is amazing... I cancelled cable, got Hulu, Netflix, and of course Amazon prime. How many times do you search cable and find nothing on? With the combo I mentioned you will never have that issue again and get this its cheaper... The one thing I wish they could change is the ability to use the voice search in what ever app you are in or ask you to pick which to search... If they did that I would ask for them to let me give them 6 stars.", "verified": true, "helpfulness": "1/1", "author": "Mr. K"}, {"rating": 5.0, "review": "Great product for streaming!", "verified": true, "helpfulness": "0/1", "author": "ALISON"}, {"rating": 5.0, "review": "Amazing device.  The packaging of the product is reminiscent of Apple.  The design is superior and simplistic.  The software interface is outstanding.  Other companies could take a cue from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The remote batterys went dead in three days ! Is this a new or refurbished one ? Paid for new !", "verified": true, "helpfulness": "0/4", "author": "Jerry Miller"}, {"rating": 5.0, "review": "WOW!! Everything about this product is awesome. From the moment it came, I was blown away.  The packaging was great; easy to open, all very uniform and organized in a very logical manner.  Out of the box, The set up was easy peasy too. The remote, I love the voice search , but I really like how Amazon even thought of the batteries.  A) it came with batteries and B) The battery compartment holds the batteries in place even without the battery compartment door on.  I have had to tape other remotes shut as the compartment door would pop off and the batteries go flying.  We have has it hooked up for about a week now, and use the Fire TV more than our gaming systems and cable combined.  The variety available of channels, games, apps, and movies is great.  There is no buffering issues, and we DO have buffering issues on our computers way too often! We have a Roku, but with us being Amazon Prime members, we felt we would get more with the Fire TV, and we were right.  I think some of our other subscription services may be cancelled soon! I would recommend this item for every family!", "verified": true, "helpfulness": "2/2", "author": "sherilynn then"}, {"rating": 1.0, "review": "I called customer service to lodge a complaint regarding the absence of information on the HDMI  cable required for using this product.  I have an HDMI, but it is used for my Direct TV service.  I would need to plug in and out of my TV in order to use the Amazon Fire TV.  My friend, who I encouraged to purchase this on sale, doesn't have an HDMI at all, so will need to purchase before use.I'm disappointed that this wasn't clear at the point of purchase.  Usually Amazon recommends these additional items.For example, I purchased a charger for my MP 3 player when I purchased a MP3 player for my daughter.  The charger doesn't even fit the MP3 player!!  Now I'm stuck with that unless I want to pay to return it!I'm a big fan of Amazon, but I do expect due diligence when you recommend or fail to recommend the appropriate technology.", "verified": true, "helpfulness": "1/13", "author": "Jeri Frederick"}, {"rating": 5.0, "review": "LOVE Amazon Fire TV; I'm planning on buying another one for my sons room. A Must Have!!", "verified": true, "helpfulness": "0/3", "author": "rgaule"}, {"rating": 5.0, "review": "Got this as Christmas gift from my son.  Amazingly quick with voice.  Love watching all old shows I've been thinking of watching. (Like Downton Abbey).  Watched a bunch of \"Twilight Zone\" shows.  Actually ordered the \"stick\" for my bedroom T.V.  Easy to use for us Senior Citizens.  I thought it would be difficult, but it was easy.  We are enjoying it a lot.  Never even knew about it before!", "verified": false, "helpfulness": "2/2", "author": "Bernadette Sikorski \"Crafter, Book & Music Lover\""}, {"rating": 3.0, "review": "Somewhat dissatisfied, purchase and pull you in with extra's that will add up.", "verified": true, "helpfulness": "0/3", "author": "Jim F."}, {"rating": 3.0, "review": "I like that I can now access my Amazon prime on my television but some of the applications such as Netflix do not work as advertised. This is a great disappointment because that was one major reason I choose to get this device. Hopefully Amazon will get there applications operational and it will make for a much better product.", "verified": true, "helpfulness": "1/2", "author": "Tiffany Prowell"}]