[{"rating": 3.0, "review": "Amazon Fire TV:  This item shipped with a major sales tax .. . WHY ? I have never had a sales tax prior to this order.Also this item was to have been available at a $15,99 discount .. . never was offered ?Should have bought it locally . ..", "verified": true, "helpfulness": "0/8", "author": "CamBuyIt"}, {"rating": 5.0, "review": "Fire Tv is great! It gives a great HD streamed pictures.  Very easy locating prime movies that are not easliy found on your pc or tablet.", "verified": true, "helpfulness": "0/1", "author": "S. Scott \"That guy\""}, {"rating": 5.0, "review": "Excellent, Could you tellme, how many amazon fire tv, can i have in a house with only one amazon account?", "verified": true, "helpfulness": "0/0", "author": "andy"}, {"rating": 5.0, "review": "The Best!!", "verified": true, "helpfulness": "0/1", "author": "Bad hair day!"}, {"rating": 5.0, "review": "I love my Amazon Fire TV. I can watch any Amazon a prime movie on my HDTV. I also can watch movies on Netflix and Hulu Plus.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Would get 5 stars if able to get Starz appUpdate...  downgraded to 3 stars.  This will not mirror to my Kindle fire HDX... :(  My kindle fire sees my Amazon tv but won't connect and both are connected to same high speed home network.  There does not appear to be any troubleshooting options in user guide/Amazon.com or internet so no mirror for me, I miss my old kindle, connect to tv via hdmi and walla video on both devices...  Otherwise I am happy with Amazon tv but this was the main reason I bought it.", "verified": true, "helpfulness": "0/0", "author": "DFinn"}, {"rating": 5.0, "review": "Easy to hook up and so intuitive and easy to use! Also easy to stream via Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "WriteHere"}, {"rating": 5.0, "review": "Easy to set up and easier to use. Well worth it", "verified": true, "helpfulness": "0/0", "author": "Joseph Hernandez \"Joe Hernandez\""}, {"rating": 5.0, "review": "cool....so many choices", "verified": true, "helpfulness": "0/0", "author": "J & J"}, {"rating": 1.0, "review": "Could have been great- if it worked. SO many users have said it goes blank and quits. Well, mine did too. Not happy. If amazon replaces I will upgrade my rating. For now, if you're looking at options- go with the roku. Had it for 3 years with NO problems. Had this for 3 weeks and it broke.", "verified": true, "helpfulness": "3/7", "author": "Eva Reed"}]