[{"rating": 5.0, "review": "I have purchased the fire stick for each of my grandkids and I have the fire tv and fire stick at my house. This is a total of 8 and we all love it. We have better control over What The Kids Watch. My 7 year old grandson set his up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This makes watch movies, shows, etc..., so much easier and the selection of Prime Shows is amazing.  Considering the breadth of programming available, this is a Great Value at any price.", "verified": true, "helpfulness": "0/0", "author": "Travel Dude"}, {"rating": 5.0, "review": "works great. amazon products are top notch great working products", "verified": true, "helpfulness": "0/0", "author": "Timothy A Leach"}, {"rating": 4.0, "review": "Love this product. Works great. Sometimes it's hard to use the voice search though. Great selection of movies with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Jackie"}, {"rating": 5.0, "review": "We really are enjoying this. The remote is so easy to use and the selections on what to watch are amazing . The only problem we have had was when the weather messed up our internet connection,", "verified": true, "helpfulness": "0/0", "author": "leeanne bramer"}, {"rating": 1.0, "review": "Great little device, but let down by greed and half-finished software.When I first got the FireTV I was ready to give it 5 stars... then the reality sank in... this isn't about Amazons \"Customer Obsession\", it's about selling me stuff. First it was just an emphasis on Amazon video and music over the other providers (Voice Search doesn't work with Netflix or HBO, iHeartRadio or Pandora) but then they decided to take away a row of my content and replace it with an advert for their crappy shows (and now they've started pushing adverts for apps into the space as well... I guess developers were complaining they weren't getting enough installs)Then we come to the apps themselves...* Netflix: pretty good, but no integration in voice search limits user friendliness. Quality is great.* HBO Go: turns out I can't authenticate with Comcast (but I can on other devices in our house, including the Fire tablet)* Hulu: if you read the reviews for that you'll see it has a problem playing content after it's shown you an advert... wonder if they will ever fix that* lots of missing apps - no VLC for instance, and a bunch of other things I can get with Chromecast, AndroidTV, Roku or AppleTV (or on the XboxOne/360)If it wasn't for Plex I'd probably have put this on eBay or stuck it in a drawer by now :(", "verified": true, "helpfulness": "3/5", "author": "Offbeatmammal"}, {"rating": 5.0, "review": "Menu is more difficult to navigate than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Robert McGowan"}, {"rating": 5.0, "review": "was everything that I expected", "verified": true, "helpfulness": "0/0", "author": "Allen Massie"}, {"rating": 5.0, "review": "Actually Pretty Cool..", "verified": true, "helpfulness": "0/0", "author": "Wayne Littlefield"}, {"rating": 5.0, "review": "Awesome unit.  Very fast!!!", "verified": true, "helpfulness": "0/0", "author": "Kevin P. Regira"}]