[{"rating": 5.0, "review": "Great advance in products.Fast, functional and compact.Does all as advertised and better than expected.Really liked the Voice command search!Well worth the price and more!", "verified": true, "helpfulness": "0/0", "author": "John H. Russell"}, {"rating": 5.0, "review": "I love the Fire.  It was all set up in a minute, and it's completely easy to use.  I especially like the voice search function.  My only caution would be that if you have Hulu or Netflix, be sure you don't already have a program for free there, before you buy it on Amazon.  Other than that, this is the best enhancement to TV viewing since I bought a DVD player a decade ago!", "verified": true, "helpfulness": "1/1", "author": "Glenn Ellmers"}, {"rating": 5.0, "review": "Fantastic.  First time we have been able to view movies without buffering.  We just gave up for a while and used DVD's.  To watch movies was frustrating but now we can sit and enjoy the whole movie.  Great Idea Amazon.  Thanks.", "verified": true, "helpfulness": "1/1", "author": "D. Dyer \"book beaver\""}, {"rating": 5.0, "review": "I love this!!!  As soon as I received the email advertising it, I immediately purchased it and am very glad I did.  While I can automatically access Netlfix, Youtube and some other devices on my TV in the living room but not on the TV in the bedroom, all that has changed. I hooked up the \"Fire TV\" box in the bedroom and now I have the best of both worlds.  Programs are very sharp and clear.  Sound is awesome!  I always have to turn it down from where I regularly keep it.  The sound feature is fantastic!  Works every time.  Now I see Amazon is going to add our music library!  Can't wait for that!  Amazon has started out great with this - give them time - I'm sure we'll see a lot more features in the near future.", "verified": true, "helpfulness": "1/1", "author": "Theresa \"Terry\""}, {"rating": 2.0, "review": "Vidio and sound performs well . The voice search is limited to just a few services . Amazon prime movies are mixed amoung  newer pay movies and are not an easy search ,this is very disappointing .", "verified": true, "helpfulness": "4/7", "author": "Jerry"}, {"rating": 5.0, "review": "Perfect companion for my Amazon Prime membership. Small, portable and easy to install unit. The voice command button on the remote is a fun feature. It is easy to use and the picture quality is high. I'm thinking about getting another.", "verified": true, "helpfulness": "1/1", "author": "mccartym311"}, {"rating": 5.0, "review": "Very easy to hook up. Love the ease of being able to \"page\" through the movies, the voice search is awesome. Now if I see something that reminds me of something else I can immediately do a voice search and I am off an running. Love the \"if you like this movie we think you will like these ones\" section. I have found old movies that I wouldn't of realized were there if it wasn't for that. Very very happy.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really love my Amazon Fire TV!  I've been streaming all the TV and music for a year now, and this device has it all.  Very easy to use, with lots of apps to choose from.", "verified": true, "helpfulness": "1/2", "author": "gypsyrose"}, {"rating": 1.0, "review": "No gigabit Ethernet. No USB 3.0. No MKV support. What's the point of that nice quad-core chip if you can't do anything with it? I think what Amazon is trying to sell is an overpriced locked-down Chromecast that you can talk to. No offense Chromecast. I guess it was rushed because it can't even mirror Android devices correctly (only Youtube works). I'd either get a Roku, wait for Apple's next TV box upgrade, or get a box that plays mostly everything (like KDLINKS HD720 or WD TV Live).With new electronics coming out now, you do not expect to see 5-12 year old technology in them (unless accompanied by newer standards). You want newer tech for future-proofing. Of course, Amazon just wants you to buy the updated box next year (planned obsolescence). The Fire TV's only benefit is a fast UI because of that quad-core processor. Anyway, the bottom line is that this device does not offer much functionality. Amazon is just hoping to sell more digital videos with it (proof is that you can't search free prime videos). I can already watch those with an app on my LG smart TV, my Sony Blu-Ray player, or my Xbox One (and of course my computer).", "verified": false, "helpfulness": "13/31", "author": "WARRZONE"}, {"rating": 5.0, "review": "Great powerful and clean crisp color.  THe best on the market for this type of product.  Sign up for PRIME and you have it all at your finger tips. The remote is fantastic and it really understands your voice.  Buy one !", "verified": true, "helpfulness": "2/5", "author": "KDLAFRANCE"}]