[{"rating": 2.0, "review": "I received it yesterday at 4pm, hooked it up and plugged it in only to have it do nothing. I rebooted it then it automatically updated the software, 30 minutes later it automatically restarted and tried to install the updates. I say tried because after that the TV screen went blank and the unit will not do anything but display a blank screen. I called tech support and they had me reboot it without any luck. It is still unuasable and tech support said they will email me when they figure something out. I left they box powered up all night and when i tried it this morning it is still not working. I will wait for tech support to email me but it is looking like I will probably return it for a full refund until I have better faith in the product. I also cancelled the game controller I had on order for it since it had not shipped yet, and if I return the box I will not be needing a $40 accessory. I will update this when the problem is resolved, but for now I have not even made it to the menu or setup screen so I don't even know how good it might be.Update: I hooked it up to another TV and now i get the menu and i can see things so i put it back onto my big tv and i can see the menu and navigate but it will not stream video's yet. I am using wifi and not the ethernet connection but i will try the ethernet connection later today. My download speed is 2.5Mbps per internet speed tests. Video's start to load then a popup display says cannot play video right now.Update: I hooked up the box to yet another tv with the same hdmi cable and it did work ok, so i hooked it back up to my big screen in the living room and it would try to stream but the video was in super slow motion without sound. NO GOOD. This was with wifi and ethernet. I unhooked it and hooked up my old box that i have been using for 2 years and the old box streamed great. NOTE, i am using a hdmi to dvi cable on my living room tv since this tv is old and does not have HDMI inputs, but everything else i hook up to it works great with this adapter cable, including my old streaming box bluray player and PC. Plus the video from the fire tv works initially it just streams in slow mo only now, the menu works ok. I have requested through the email process for a full refund. P.S. When the box was hooked up  to my tv's with an hdmi cable to a hdmi input on my smaller tv's it did work and stream ok. It just does not work on the tv i bought it for with the DVI inputs only.", "verified": true, "helpfulness": "14/27", "author": "Ray"}, {"rating": 4.0, "review": "I do not yet own the device but after reading the reviews, I am convinced that it is a product that I will enjoy.  The main reason I want this is for the amazon prime video navigation which on my current TV (Vizio Razr M series) is absolutely horrible.  However, knowing how Amazon does business it seems pretty clear that the price will drop in a few months and many of the initial bugs will be worked out.  I will wait until that time to purchase", "verified": false, "helpfulness": "0/13", "author": "Skipper McFearson \"quickcuda6\""}, {"rating": 5.0, "review": "I cut the cable over 2 years ago and have used all manner of streaming devices to deliver content.  While I would agree that Amazon has a ways to go in terms of the interface and channel options, the picture and sound output from the Fire TV beats all of the competition I have used in the past (Roku 2&3, PS3, Xbox, Apple TV, and Chromecast) hands down, and the thing is fast.  I'm using it in my theater room with a 65\" Samsung, and a 7.1 Onkyo receiver (all channels connected) and I am impressed.  I would still prefer a Blu-Ray for certain movies I purchase, but I will now be perfectly happy with Amazon Instant HD videos for most movie/TV show rentals/purchases.  The picture has far more accurate colors and doesn't have that low bit rate washed-out look I was getting with my other streaming solutions.  The sound is also brighter and wider with better separation and cleaner details.  I was actually shocked when I did a side by side comparison with my Roku 3, as it wasn't even close.  I don't need 1000 channels that I'll never watch, and novelty features don't impress me (voice command, headphone output in the remote).  When it comes down to it, I want the best picture and sound along with fast load times and no drops, and the Fire TV delivers.", "verified": true, "helpfulness": "3/4", "author": "BKarno"}, {"rating": 4.0, "review": "Everything is great except one very MAJOR missing content.i went video library and expected to see the 100s of dvds i have bought from amazon.and i mean several 100 dvds. Up came -- are u ready ---- 4 dvds.yes 4. I called amazon and was told there were issues with the studios.i frankly dont agree with this answer.this catalogue of dvds sold by amazon is a UNIQUE AMAZON ADVANTAGE.NOONE ELSE HAS THIS.u can watch some prime dvds( of which i am a member) for free but why would i pay to watch something i have already purchased.this should be fixed and fixed soon------then noone can touch amazon in this market.should be a priority addition.", "verified": true, "helpfulness": "2/5", "author": "Ron Toronto \"ron\""}, {"rating": 5.0, "review": "Awesome, just awesome! Just a few minutes to set up ... and less than that for the device to find my Amazon Prime account! I'm all set ... thanks for a great product!Update: After reading other reviews about its lack of \"pretty\" or lack of \"soul\" (seriously?) in the design of this little black box, I for one am so pleased it's not full of flashing lights and weird logos. It disappears on the shelf and just *IS* ... LOVE IT", "verified": true, "helpfulness": "1/2", "author": "Ann Varley"}, {"rating": 5.0, "review": "My first review of this product was negative, as the Fire TV couldn't see my network. Got a replacement, now I couldn't be happier, and have added two Fire TV Sticks to other TVs in the house. Love the talk to search feature and there's some great content for Orime members. If you haven't watched Bosch yet, check it out!", "verified": true, "helpfulness": "15/31", "author": "Westreacher"}, {"rating": 5.0, "review": "We recently bought a roku for our bedroom and were pretty impressed.  I had been considering getting a 2nd one for the living room when I heard rumors that Amazon was going to announce something comparable this week so I waited.  The day it came out I missed the official announcement but went online and started reading about it.  I didn't even finish the description before I 1-clicked it.  It just sounded that impressive.  I got it next day and have spent the last few days using it and personally I am even more impressed.I will say something about the price...$99 can seem like a lot (you can get a cheap Roku 1 for quite a bit less) but I know from the experience of owning a Roku 1 this is really worth the extra money spent.  You are getting way more in terms of components and developer potential than anything Roku can put out in their current line of players.Setup is a dream, with the preloading of my Amazon Prime account it was about 2 minutes from start to watching a Prime movie.  I love in setup that you have sliders to set up your tv screen viewing area.  I am pretty techie but I kinda liked the cartoon video at the beginning.  Nice touch!  The setup is quick and basic and I feel like anyone from a kid to my 75 yrs old mom could do it pretty easily.The setup finished I started look through the menu, its well laid out and easy to access.  I of course love the Prime selection but also very nice to see Netflix (a very nice look to Netflix, better than Roku in my opinion) and Plex (even if it says Plex for Android so must be just a port or something) onboard at the start.  Other selections are pretty light but I feel like this will grow pretty quickly.I'm not going to go into tons of details but I wanted to point out that this thing is FAST, just like advertised.  Like I said before we have a Roku 1 and this thing just blows it away on how fast a movie begins once in you hit play, even online Prime selections.  Netflix can be as slow as ever but I've come to live with it, Handy Manny slow or fast is pretty much the same.  Plex works very well for playing our home movie selection that I have on a remote computer.I cant think of much in the way of negatives.  There are many areas that I wonder about and haven't explored yet, like the USB port or Bluetooth.  I have a feeling we will get more functionality with those in the future.  I personally love the remote and how well it works.  I can tell you we have a Roku 1 and the remote range SUCKS.  With the Fire TV remote I have no such issues.I gave this 5 stars and its well worth it, heck me personally I would give it 6 if allowed.  Not only is it great now but I see TONS of future potential in this little box, potential Amazon is always willing and able to tap into in any product they produce.  My opinion is get it, you wont regret it!", "verified": true, "helpfulness": "4/5", "author": "P. W. Achleman \"Phil\""}, {"rating": 2.0, "review": "I bought this really wanting to like it, and I have so say so far I'm less than impressed.Pro: Video looks goodquick interface (its got the specs and feels like it)voice search works well for amazon content (more on that later)Games - especially for the kids (I would not expect this to replace a core game system)Con: Bluetooth connectivity means I can not integrate this into my existing universal remote:Voice search only works with Amazon content (not Netflix as an example).So you have a Roku 3? do you buy this? probably not - the voice serach only showing amazon content does not gain you much.  The videos start faster yes, but honestly I never thought that was an issue to be frank.If they fix this product to offer universal search with the ability to prioritize content I've already paid for (ie shoe me Netflix and amazon prime streaming before content I'd need to buy) the search alone would probably make this compelling.UPDATE: spoke to customer support - they could not comment on if or when they might expand the capability of voice search.  Quite frailly I'm pretty disappointed with Amazon in the way this was advertised... They don't make it clear that this only finds amazon content...  If you are going to pitch something as the killer feature, it needs to be.For all of the power that's in this box it is being held back by its current software.  I may not be able to search by voice, but at least on the ROKU 3 I have universal search and can search across services. I also find it easier to review the prime content for amazon (there is an entire menu dedicated to Prime Video).  Yes you can find the content inside of the menus for each (TV,movies, etc) It's better to have it broken out. Its rare I send anything back, but this in one purchase I'm leveraging the 30 day satisfaction guarantee and shipping this fire TV back.", "verified": true, "helpfulness": "3/8", "author": "S. Abbott"}, {"rating": 3.0, "review": "I don't own one but was wondering if it has the ability to stream live TV? I think in the quest for digital media boxes, that is the most important thing to me.Just wondering, is it better than XBMC free download? On my mac I watch any program, live sports, movies, hulu, youtube, thousands of channels from around the globe, you name it, for free in HD. No subscriptions no hidden fees, easy to run.", "verified": false, "helpfulness": "0/16", "author": "Howard Sprengeler"}, {"rating": 1.0, "review": "Does not carry The BlazeRoku does.If you want The Blaze you need to look at the Roku, too bad.", "verified": false, "helpfulness": "12/51", "author": "THE Reviewer"}]