[{"rating": 3.0, "review": "I am angry to see that amazon is already discounting this unit as an early adopter, I am screwed.  On the other hand the unit works quite well.", "verified": true, "helpfulness": "2/6", "author": "Glenn Barcellos"}, {"rating": 5.0, "review": "Great quality, not buggy like cheaper units. I prefer this to Apple TV. The talk remote turns out to be useful.", "verified": true, "helpfulness": "1/1", "author": "honest reviews"}, {"rating": 4.0, "review": "5 days after I purchase this for $99 Amazon offers it for $84. Don't you think I deserve the same discount. So sad", "verified": true, "helpfulness": "1/8", "author": "J. Donafrio"}, {"rating": 5.0, "review": "This product was so easy to install and use, right out of the box. The video quality seems so much better than the previous way we viewed movies and TV shows, using Wii. The controller was elegant and straightforward. The voice command was flawless. My 12-year old loves the games! I highly recommend this product.", "verified": true, "helpfulness": "4/4", "author": "Matthew James Dodson \"wasabinoir\""}, {"rating": 5.0, "review": "Easy to set up and it works great with my wireless internet signal.  It provide a wealth of access to movies, music, games and program alternatives to enhance your TV set.", "verified": true, "helpfulness": "0/0", "author": "David R. Templeton \"temple62\""}, {"rating": 5.0, "review": "We have had the Fire TV for about a month now. It is wonderful. I love the voice command option. We have an older Roku that we still use with an older TV but the Fire is so much better. I love that it cues up the next episode in a series. (maybe the newer Rokus do that, I don't know). Since I am a prime member the fire is a perfect fit. We mostly use Amazon Instant video and Netflix so we don't miss any of the stations the Roku offers. So glad I got this instead of another Roku.", "verified": true, "helpfulness": "2/2", "author": "Jan E. Elkins \"libraryhag\""}, {"rating": 5.0, "review": "Simple to use and use voice to choose a movie.", "verified": true, "helpfulness": "0/1", "author": "Edward Hetherington"}, {"rating": 4.0, "review": "Easy to use.  Would recommend AC router to make sure signal is consistent.", "verified": true, "helpfulness": "0/0", "author": "JJH"}, {"rating": 5.0, "review": "Works very well.  I've had no problems and it seems to stream HD without frequent re-buffering like my Blueray DVD player.", "verified": true, "helpfulness": "0/0", "author": "Island Tim"}, {"rating": 5.0, "review": "Love the voice option and the layout is so clean / easy to navigate!", "verified": true, "helpfulness": "0/0", "author": "Emonte"}]