[{"rating": 4.0, "review": "Coming from a Panasonic Blu-ray player, the Fire TV is a huge upgrade for me. I waited on the Fire TV because it didn't initially support MLB.tv (between that and Amazon, it's all I used my streaming device for), but now that it has MLB.tv, I decided to try it out and I'm very happy I did. (And I can finally use the Watchlist feature, which my Blu-ray player did not support!)The device itself is very tiny and the software runs very smoothly and quickly. It's a big change from the clunky and slow menus of my Blu-ray player. Even MLB.tv seems to stream better. I used to get a lot of buffering and freezing and errors, but now it seems it might have just been the specific app that my Blu-ray player used, rather than the service itself. So far at least, it streams much better on Fire TV. It is also now easy to access Prime-only content, which apparently was an issue at launch. You can easily find the free movies/TV separated from the pay ones.My only complaint so far is that Fire TV has a weird way of displaying the episodes within a TV show season. Even after choosing a specific season, you will still see episodes from prior seasons listed on the display. For example, I have purchased season 4 of a TV show and it appears in the \"Video Library\" section, and yet when I go there, I see episodes listed from past seasons (which I didn't even buy) rather than just episodes from season 4. I think this needs to be cleaned up and hopefully a future update will do this, so that you only see what you choose to see.Update: After using Fire TV for a couple of weeks, I want to add that despite my complaint about all episodes of every season being listed even if you choose a specific season, this doesn't seem to affect anything too much since it will always display the newest episode first (when you choose the TV show from \"Video Library\") or start with the chosen season if you choose a specific season. Only after scrolling backward and forward will you see the other seasons in the list.Update 2: A problem has just appeared. Out of nowhere the sound on everything I watched on Fire TV (but not on normal OTA TV) sounded scratchy and tinny. I unplugged Fire TV and let it reboot, and this fixed this issue, but I'm not happy that it even happened or that it might happen again (and require another reboot).Update 3: I've changed my star rating from five to four stars because the above sound issue has happened to me a couple more times. It's very frustrating and seems to come out of nowhere. One time I had been watching a TV show on my Fire TV and it was fine. Then an hour or two later when I started again, it did the scratchy/tinny noise when I turned it back on. Rebooting the device will fix this, but it seems to be a consistent problem. I don't know if it's just my device, or a problem with all of them.", "verified": true, "helpfulness": "1/1", "author": "John Salerno"}, {"rating": 4.0, "review": "I received this as a gift. Setting it up was a little difficult because I'm not used to using this type of device. The included instructions are sparse. I had no trouble hooking to the TV, but didn't immediately understand the instruction to \"Set the appropriate input.\" Finally I figured out that you do this in your TV's menu (look for something like Input > HDMI1).After I set everything up, nothing happened. I got it working by unplugging the Fire TV and plugging it back in again. This suggestion should have been in the manual.After that, it was easy to set this up with my Amazon account and with Hulu Plus. Navigation is easy enough, picture and sound are good, shows play perfectly with no hiccups. The only problem I noticed is a slight delay before commercials (in Hulu Plus), and that's not a big deal.I had trouble getting closed captions turned on. After searching the reviews here on the site, I found the answer. You have to press UP on the remote TWICE while watching something. Not every show has captions available, however. This information definitely should have been in the manual!The voice search seems to work well. It does not seem to recognize Spanish titles. I didn't really think it would, but that would have been nice.I've only had this a short time, but so far I am happy with it and would recommend it, though I think Amazon needs to improve the instructions that come with the device.", "verified": true, "helpfulness": "1/1", "author": "anonymousreader26"}, {"rating": 2.0, "review": "just got it today. does not hook up to Ethernet, keep asking for ip address and DNS and other stuff. Was suppose to be simple and it is not.  was able to hook to WIFI and that seem to work OK.  the MIc to talk and get movies does not work at all.  hard as hell to type in move you want to watch as  there is no keyboard but a ribbon of letters. bad design. I still don't know how to look for movies . but will keep playing for another week before I decide to give it a big fat F.  but so for I am not happy. be nice to be able to talk to a support person, but unable to find out how to do that.  this device is not ready for prime time.", "verified": true, "helpfulness": "1/5", "author": "Frank HAwkins"}, {"rating": 5.0, "review": "This is an excellent value. Really happy with the video performance. The speech search actually works.", "verified": true, "helpfulness": "0/0", "author": "Earl"}, {"rating": 5.0, "review": "I love this.  We were watching Netflix with the Wii, and it was such a pain.  With the Amazon Fire, everything is seamless.  Netflix?  A simple button click.  Separate Prime shows from the rest?  Another simple button click.  Voice search?  LOVE LOVE LOVE IT!  Oh...did I mention I love the Voice search?  Hasn't been wrong yet.  OMG so simple.Easy set up, easy synch to your TV - minutes.  The remote is simple to use, everything is user friendly.Already I'm watching more Prime shows and more Netflix than I ever had with the Wii.  Best $99 I've ever spent.  If you have hulu plus, or Pandora, you can also connect - to Amazon as well.  Get it.  Just get it.  Especially if you are using a Wii to access your media.Now...if only you would offer your Amazon fire phone unlocked for other carriers than AT&T; :( (hint hint)", "verified": true, "helpfulness": "1/1", "author": "C. Tucker \"mdmom\""}, {"rating": 5.0, "review": "exceeded expectations", "verified": true, "helpfulness": "1/1", "author": "frederick meyer"}, {"rating": 5.0, "review": "LOVE IT!! HAve the chromecast also but it just sits now that I have the fire tv", "verified": true, "helpfulness": "1/1", "author": "J. Cooper"}, {"rating": 5.0, "review": "Great for Prime TV and Netflix", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "Every home should have this.  Easy to use and set up with no issues after having it for two months.", "verified": true, "helpfulness": "0/0", "author": "Ray Sanford"}, {"rating": 5.0, "review": "love this little box.  really easy to use, set up.  Remote is simple and robust", "verified": true, "helpfulness": "0/0", "author": "Dan Charles Zimmerman"}]