[{"rating": 3.0, "review": "Without getting into too much slagging on this slick little box, there is definitely a to-do list for the devs:1.  Release date ETA sheet for forthcoming apps, especially high profile ones (e.g., MLB.TV);2.  Ability to return all results -- even if only is a submenu -- when using voice search;3.  Must be able to automatically start next video in Amazon app (Netflix app has this functionality) [applies to Plex as well];These are must haves -- without these items, three stars, with them, five stars; navigation is clunky, but fast; voice search is fantastic (but limited to Amazon only); playback is quick even in a limited wireless network range; ability to add apps is clear and intuitive; plug and play functionality -- and auto-assignment to Amazon Prime account -- are nice bonuses.This is a very good version 0.9 build; can't wait for 1.0.", "verified": true, "helpfulness": "3/4", "author": "Tomorrow's Man \"Tomorrow's Man\""}, {"rating": 5.0, "review": "simple to set upsimple to usethey should have made this years agoI recommend it for all Amazonians", "verified": true, "helpfulness": "2/3", "author": "Pen Name"}, {"rating": 3.0, "review": "But it is slower the the Roku 3 and sometimes leaves the movie I am watching and the reloads it for no good reason at all.  It is not my router connection, either.  It has something to do with the Amazon Fire TV unit.  As I have a Roku 3, and it loads very fast and never stops to reload the streaming video I am watching.And the selection of apps you can have with this unit are very limited:  Amazon Instant Video, Netflix, Hulu, Vudu and Crackle which shows commercials (I hate commercials).  I can not even listen to the music that I purchased from Amazon, that is loaded on my Amazon MP3 Cloud Player, as that is not an option!I am really wondering and thinking about sending this unit back and the remote I bought with it and just getting another Roku 3 or another Smart TV, in the future.  I have had the unit for a week, now, and I am not impressed with it, at all.", "verified": true, "helpfulness": "2/8", "author": "Feline Lover \"feline lover\""}, {"rating": 5.0, "review": "Voice works great, easy to hook up, easy to use.Only flaw is I could not figure out how to see only the free stuff.", "verified": true, "helpfulness": "1/1", "author": "Jim H."}, {"rating": 4.0, "review": "This product was easy to install and worked well from the beginning.  However, we had to delay installation when we found that you must already have an HDMI cable - it does not come with the product.I think every Amazon Prime member should consider getting one of these, for the convenience of getting content on your TV.", "verified": true, "helpfulness": "1/3", "author": "loveallanimals"}, {"rating": 2.0, "review": "There web site lacks some inportant information:What is the difinition of high speed internet? Does mine meet the requirements?  If it doesn't work with mine, what are the return policies?It would be nice to see some typical prices on movies and songs etc.  Like; is Bloomburg TV free ot do I pay for it?  Is it the same as I see now on Direct TV or just short excerpts?Information was very poorly presented, I thought.  But I'm and engineer and like details.", "verified": false, "helpfulness": "2/23", "author": "Charlotte Tantius"}, {"rating": 1.0, "review": "I'll keep it short and concentrate on the reason I gave it the single star. There are many reviews that go in depth on the features that work.It has a USB port, the USB port is disabled. It wasn't until I downloaded the Amazon Fire TV User Guide PDF that I was told \"The USB port currently does not support any accessories.\" I was hoping to use it as a classy video playback device for videos on a thumb drive.  There are many media players on the market that provide this basic feature, I had hoped to find similar functionality in the Amazon Fire TV but it has not been implemented. The Amazon Fire is useless without the internet, do not purchase this device if you wish to play videos connected to the unit itself, it will not.", "verified": true, "helpfulness": "7/34", "author": "Wallace A Karraker"}, {"rating": 5.0, "review": "I plugged it up and it worked, Nothing hard about it. My wife loves this thing and the voice control is so good. Worth more than they charge lol. Get it and enjoy it.", "verified": true, "helpfulness": "3/5", "author": "w cross"}, {"rating": 5.0, "review": "This unit is as advertised ! Very easy to set up and operate ! I tell everyone about it and would always trust Amazon !", "verified": true, "helpfulness": "3/4", "author": "Franklin keels"}, {"rating": 5.0, "review": "Thanks Jeff Bezos (and minions!)This is just the toy that reaffirms our decision to cut the (cable) cord! Right out of the box it is ready to use... and darn this thing boots quickly.I've seen a lot of reviews picking on the stark packaging and design, but personally I like it. I find the user interface very clean, very simple to use.", "verified": true, "helpfulness": "2/2", "author": "C. Bergh"}]