[{"rating": 5.0, "review": "Easy to use right out of the box! Super simple setup.", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 5.0, "review": "Awesome  to watch shows anytime!", "verified": true, "helpfulness": "0/0", "author": "Candace Swayze"}, {"rating": 3.0, "review": "Like the Roku better!In the end, the deciding factor for me switching back to Roku after my Roku 3 died and I tried replacing it with the Amazon Fire TV -- was the system is still too closed.  With Roku, I had many, many more apps developed and an open platform for other apps --- it could easily browse media on my network, or via USB connection.Now the fire TV is certainly faster and more horsepower... but in the end that wasn't enough to sway me.If all you primarily do is watch Amazon Prime movies... the Fire TV is a perfect fit for you (and consider just getting the HDMI stick to save even more money).  But if you want to hook into more content sources... tread carefully and really compare the apps / services available to both platforms to help you decide.", "verified": true, "helpfulness": "1/1", "author": "D. McIver"}, {"rating": 4.0, "review": "It's sleek, easy to install and quickly helps you find what you're looking for. A great substitute for the cable I paid too much for and rarely used. I love this product, thank you, Amazon!", "verified": true, "helpfulness": "0/0", "author": "L.A. douglas"}, {"rating": 4.0, "review": "We got this in the gaming bundle for my 6 year old. He was upgrading from his outdated Google box. So far, he loves it. He really enjoys being able to play Classic sega games and the voice search. We will be ordering another box for ourselves since we've finally cut the cord.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "I love Amazon Fire TV. It's made all of the Prime movies accessible along with other movie sources. The games are great too!", "verified": true, "helpfulness": "0/0", "author": "Alyson Stewart"}, {"rating": 4.0, "review": "Truly a \"plug and play\" device, as advertised.  Took about 6 minutes to install and begin watching. I am loving it.  I wish there were more seasons offered for some of the older series but it has an awful lot on Prime that is free to select from. Plus, I like that the box is so small that it can fit anywhere.  The voice command function seems to work well also.  All in all, I am glad I got this unit.", "verified": true, "helpfulness": "0/0", "author": "Melissa Kinne"}, {"rating": 5.0, "review": "I've not used my new Fire TV a lot since I just recently received it, but it's exceeded my expectations. The entire family loves the many features available.", "verified": true, "helpfulness": "0/0", "author": "Michael PaleRider \"The Fourth Horseman\""}, {"rating": 5.0, "review": "Great for Netflix and Plex!", "verified": true, "helpfulness": "0/0", "author": "Ben Bayle"}, {"rating": 5.0, "review": "very easy to operate, and the voice operation works fantastic!!  great offerings especially if you have Amazon Prime.  Even better than my Smart TV that is less than a year old.", "verified": true, "helpfulness": "0/0", "author": "Detroit gal \"SKM\""}]