[{"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought as a Christmas gift for my wife who LOVED it. This thing rocks. You can even install Xfinity TV on it (although it is a bit complicated for the novice user) and watch all your favorite cable TV shows. This is just perfect and is exactly what we wanted. Oh, it  plays some pretty sweet games too..", "verified": true, "helpfulness": "0/0", "author": "John August"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Ann Matics"}, {"rating": 5.0, "review": "I bought this to see if it would help with the problem I was having with my Vizio tv apps. It works way beyond anything I could have hoped for. Before I would sit there and wait and wait until a movie would start playing if it started at all. Now it loads as close to instantly as you can get. It is really unbelievable how well it works. When Amazon runs it on sale again I will be getting another one for my other TV.", "verified": true, "helpfulness": "0/0", "author": "W. Barnett \"B Barnett\""}, {"rating": 4.0, "review": "Does what it says on the box.Plug it in and go no problem", "verified": true, "helpfulness": "0/0", "author": "L.K.Gorton"}, {"rating": 4.0, "review": "I love it and it's easy to use and set up.  The only reason why it didn't get 5 stars is because it doesn't have VUDU!", "verified": true, "helpfulness": "0/0", "author": "cassie perrin"}, {"rating": 5.0, "review": "I have only used Netflix with fire tv but so far I enjoy my decision to switch to Amazon product.", "verified": true, "helpfulness": "0/0", "author": "melissa"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "pipe smoker40"}, {"rating": 1.0, "review": "I hate my amazon fire tv.  We bought for christmas and have had it for two months.  When the device actually works, it works fine.  However, it frequently get frozen or something where the tv is on, the amazon fire is on, all settings are correct but no picture.  It takes a random combination of pulling out the power cord, puling out the hdmi cord to device, pulling out any other hdmi cord from my tv, etc...  While this isn't ideal, it wouldn't be so bad if I didn't have to go through these steps multiple times.  Sometimes it takes 3 tries, sometimes 10.  Sometimes we give up and then try again the next day and it works on the first time.  I've owned an apple tv for 1 1/2 years which is in another room and it works everytime no problem at all.  I wish I could return my amazon tv, the two controllers that we purchased and trade it in for an apple tv.", "verified": true, "helpfulness": "1/2", "author": "Barb C"}, {"rating": 5.0, "review": "Love it but the remote for gaming take months to get so order it with Fire.", "verified": true, "helpfulness": "0/0", "author": "Coconuttann"}]