[{"rating": 1.0, "review": "it was a waist of time", "verified": false, "helpfulness": "2/8", "author": "Anton Wink"}, {"rating": 5.0, "review": "Good..", "verified": true, "helpfulness": "0/0", "author": "Magdalena"}, {"rating": 5.0, "review": "Great investment.", "verified": true, "helpfulness": "0/0", "author": "Dan M."}, {"rating": 5.0, "review": "Loved it", "verified": true, "helpfulness": "0/0", "author": "Paul skowgard"}, {"rating": 4.0, "review": "Works great for everything it offers.  Will give five stars when a web browser is added to the store as well as bluetooth keyboard/mouse functionality.", "verified": true, "helpfulness": "0/0", "author": "Louie"}, {"rating": 5.0, "review": "Still love my Chromecast, but this is slowly becoming my #1. Way better than the Nexus Player!", "verified": true, "helpfulness": "0/0", "author": "Scott Graves"}, {"rating": 4.0, "review": "Voice search is both an awesome feature and an Achilles heel.  It works great if you have Prime, but it isn't integrated with common streaming apps.  It would be great if I could search for a movie from within the Netflix App, even better if the search results were from prime and other apps.", "verified": true, "helpfulness": "0/0", "author": "systole"}, {"rating": 5.0, "review": "Amazing! Turned my laggy smart TV into a super TV", "verified": true, "helpfulness": "0/0", "author": "john getchell"}, {"rating": 5.0, "review": "CUT THE CABLE OFF!!! If you are looking for a way to replace your monthly expensive cable bill; then this is the way to go!  You will truly get to watch what you want to watch, whenever you want to watch; it is TRULY your choice.  Amazon Fire TV was the 1st device I have ever bought that was honestly \"out-of-the-box-ready-to-use\".  Followed a very short, simple setup; the remote has a few self-explanatory buttons (again, extremely simple) and the \"voice search\" actually does understand what you are asking it to search and presents it immediately!  Absolutely no problems or complaints!  Hubby has not stopped telling everyone about how pleased we are and that they too should \"CUT THE CABLE OFF!!", "verified": true, "helpfulness": "0/0", "author": "JudithMarie"}, {"rating": 5.0, "review": "Awesome.  Just let us root it already!", "verified": true, "helpfulness": "1/1", "author": "phuoc tran"}]