[{"rating": 4.0, "review": "O.k.,I have re-written my review.We had fast shipping with great package protection.The device was easy to install with ONE exception.FOR THOSE WHO HAVE SPECIAL TV's...you will most likely need additional plugs or chords.We have a\"SHARP\" Auquo's Quatron HD TV & with the Amazon Fire TV && the Apple streaming device,we needed to buy an additional audible chord  in order to get audio from our particular TV.We were able to get the screen images but no sound so the HDMI cable wasn't enough alone to get the full quality of either of these devices.We(so far)are loving our Amazon Fire TV streaming device.It's great that you can load some(SOME)of your games from your app store to play & get all your movies & personal photo's.Pairing your Fire Phone & or kindle is simple.When I first got my Fire T.V. I didn't see any where there was music but NOW Amazon has added this feature too.Adding personal photo's & video(from your kindle or Fire Phone/other devices you might have to do some research)is as simple as sending yourself the FREE photo cloud app by emailing this to your phone, etc.By syncing your devices aswell,you can also keep everything working together.I love the ease of using my Fire T.V.,I love that it is so simple to get to any of your video's,MP3's,photo's & certain apps.Very entertaining to have,the Screen Saver while in a long pause are beautiful to watch,it's like having an ever changing piece of Art in your home with beautiful scenes from what looks like all over the World.Handy & innovative little device to have in your home.Worth the money,Was no effort at all to install.Any issues we've had were quick & easy fixes & quickly identified.Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "EnVee"}, {"rating": 4.0, "review": "This is a great set top box. I am happy apple person but this is a great device good buy", "verified": true, "helpfulness": "0/0", "author": "Coffy"}, {"rating": 1.0, "review": "Wanna watch NYPD Blue? Law and Order? Game of thrones? Your out of luck. Nothing in Amazons library is less than 2 years old.", "verified": false, "helpfulness": "4/15", "author": "Benjamin"}, {"rating": 4.0, "review": "My dad owns one and it is amazing, but for some reason right now when we try to watch shows on huluplus it sends us to the home screen and netflix just won't let us on.", "verified": false, "helpfulness": "0/1", "author": "Alaera"}, {"rating": 5.0, "review": "I liked it because it worked right out of the boix and was so easy to use even I had no problems.", "verified": true, "helpfulness": "0/0", "author": "Lawrence L Reece"}, {"rating": 5.0, "review": "I had been using a brand new Samsung Blue Ray player to access Amazon Prime and that was like watching paint dry. Fire TV is very quick,responsive and simplifies the whole process. I recommend it to anyone even slightly interested in trying it- you wan't be disappointed. Integrating Fire TV and my Kindle Fire HDX via Second Screen is a snap. Amazon has nailed it this time. Any device which eliminates needless headaches and aggravation is a welcome addition for me.Additionally the gaming feature is a plus and I am sure the grand kids will enjoy playing with it.Have only used Fire TV for about a month but I have no regrets in purchasing it.", "verified": true, "helpfulness": "2/2", "author": "Mark S Patterson"}, {"rating": 3.0, "review": "I love the HBO documentaries. How come no HBO????? This must be some kind of financial issue for Amazon but I am not 100% happy for that reason.", "verified": false, "helpfulness": "0/2", "author": "C. GIbson"}, {"rating": 4.0, "review": "Here is my review for those trying to decide:I own an Apple TV as well and this is a step up in my opinion...Much faster browsing and performance. Apple TV was my favored device until it started having issues updating and then it began to have loading issues and became more of a problem than I have time to deal with as a working professional. If you want to turn on your TV and instantly blaze through your videos and watch or preview things instantly then this is the machine for you. The extra money you will spend for this vs a Google stick or Roku will be forgotten very quickly. However, this machine will give you the performance you want for a very long time.I decided to try Amazon Fire TV paired with Amazon Prime service and was pleasantly surprised with it's speed and performance.**IMPORTANT** be sure to update the unit immediately, let it completely update and restart. I thought I received a defective unit as it was browsing very slowly and loading everything slowly, then I completed the update and it opened up the units real power and performance. After the update it browses and transitions between searches and apps super fast. It also plays videos very smoothly with almost no load time. This was a huge advantage over my Apple TV. Yes, the voice search does not currently work on all apps...and well...SO WHAT, that is feature that can (and most likely will) be corrected on on a future update. Don't lose focus on why you are buying the machine, to browse and watch movies and apps...and it does that better than anything else going right now. I think it is worth the (one time) extra money over a Roku, Google or Apple TV for the speed and performance vs all the others. Reality check, you get what you pay for and you can tell when comparing this unit with any of the leading streaming devices.Have not tried the gaming aspect t of it, I bought it for streaming movies and it does that better than any so far. My only complaint is that it does not have HBO GO, one of  my favorite Apps. They really need to get with the program and pick up that app. If they do, then they will have no real weaknesses.**FOR AMAZON** Whatever you have to pay, you need to pay it and get over it. Showtime is good, but its no HBO, be smart and add the app. Game of Thrones has been picked up for two more seasons and HBO continues to rule the roost as the best premium cable channel. Be smart and add it to you line up. It is Fire TVs only weakness and adding it will solidify you in the number one position.", "verified": true, "helpfulness": "1/2", "author": "Hitman 5000"}, {"rating": 5.0, "review": "I am a prime member and i love being able to view some of my favorite tv shows whenever i like, plus getting he advantages for my Kindle Fire notepad.", "verified": true, "helpfulness": "0/0", "author": "Rose"}, {"rating": 5.0, "review": "I love the new Amazon Fire TV! This little box is awesome!!!!!!! I love the voice search and the results come up instantly for your movie choices or tv shows. Fire TV is well worth the money and more. I love the fact that I can use my Kindle Fire HDX with it too. Netflix is on the Fire TV so that's what I watch the most. Being a prime member helps out as well. You can still watch all of the Prime Instant Videos,movies, and new releases. Fire TV lets me play games that I've already purchased from Amazon. The games work great and it looks awesome on TV playing the games that you can play on your Kindle Fire. Amazon has knocked this one outta the box!!!!!! Job well done Amazon!!!!!!!!!!! I'm one happy customer!! :)", "verified": true, "helpfulness": "1/1", "author": "Quietstorm"}]