[{"rating": 3.0, "review": "Sound sometimes isn't synced to video.", "verified": true, "helpfulness": "0/1", "author": "Valerie Bloom"}, {"rating": 5.0, "review": "I love my Fire TV! It was so easy to set up to my tv and connect to my Amazon and Hulu accounts. Streams great picture and it's very small and compact! Would recommend to anyone!", "verified": false, "helpfulness": "0/0", "author": "Hailz97267"}, {"rating": 5.0, "review": "Thank you, Amazon for your elegantly designed and simple to use Fire TV.  I cut my Comcast cable cord at the end of December and simultaneously connected your device to my flat screen television.  The box has a smaller footprint than an CD case.  The software and remote are elegant, with quick response time and the content selection is awesome.  The voice recognition using the remote has worked flawless.  I'm also a prime member and love all the benefits beyond the free two day shipping, including free access to so many movies, television shows, games and music.  You hit it out of the ball park, Amazon with your Fire TV.", "verified": true, "helpfulness": "0/0", "author": "JSL"}, {"rating": 4.0, "review": "Like everything about it!", "verified": true, "helpfulness": "0/0", "author": "David W."}, {"rating": 5.0, "review": "I replaced a Roku that died after three years.  I liked the4 kRoku, but, The Fire is obviously several generations  removed and has delighted me with responding to spoken words.  It is very accurate and has proved to be the streaming device I wanted.", "verified": true, "helpfulness": "0/0", "author": "Ira David Holland \"Dave\""}, {"rating": 5.0, "review": "It works really great not only that I can watch live TV i can even download my favorite channel in it. But I hope we update the remote because it kind of bigger then the iOS remote control.", "verified": false, "helpfulness": "0/0", "author": "Stevenson Pierre"}, {"rating": 5.0, "review": "We love the fire tv. My boys love it and it makes it super easy to find what you want with the voice recognition. I will say I wish that they would get vudu as an app. However it is great either way. My kids and my husband and I also really like the games too.", "verified": true, "helpfulness": "1/1", "author": "boone"}, {"rating": 5.0, "review": "I'll Make this short, I love it . Amazon Fire TV far surpasses any other similar product on the market.", "verified": true, "helpfulness": "0/0", "author": "Mark Drennen"}, {"rating": 5.0, "review": "Absolutely the best product l have ever bought on Amazon. Extremely easy to set up took me just a few minutes.  Easy to use l can not do without my Amazon Fire TV. I would highly recommend buying this product.", "verified": true, "helpfulness": "0/0", "author": "Cheri"}, {"rating": 2.0, "review": "This is a very lackluster device.  Having owned an AppleTV and a Roku 2, I can honestly say that Amazon has a LONG way to go.Pros --Small form factor-Handy RemoteCons -- Slow and unintuitive interface- Voice search only works for Amazon content.  No app based or global search.- Crashes frequently with \"Unknown_Error and Licensing_error\" on Amazon and Netflix videos, requiring manual hard resets. (this is happening at least biweekly after first two weeks of use and on latest firmware.- Non-customizable interface.  Non-amazon apps (Netflix, Hulu, Plex) are hard to get to.- App casting available from Amazon fire devices only.  Does not even show up in the casting list on my android phone or Galaxy Tab.  You can use the Miracast for PC but it requires setting it in a mode to receive content and I still can't get my Surface Pro 3 to actually connect to it.- Cable subscription apps that require cable carrier list is limited.  Time Warner and Directv for example do not have contracts to stream content on this device like with Apple TV or Roku.  So the Disney apps, for example, won't let you play if you have those carrier.Overall, I am regretting my purchase.  This seems to be another device to force you to the Amazon brand.  I am a Prime subscriber but the shipping is the only feature to pay for itself as of yet.  I realize this is a new device to the market but it needs a ton of work.  Just not ready for primetime.  My advice, buy the Roku 3.  It has more content, more features, and a larger cable provider support for apps.  Maybe they will get there but at the moment, they are far from the top....", "verified": true, "helpfulness": "2/4", "author": "Kennedad"}]