[{"rating": 2.0, "review": "Not nearly as many free movies as I thought there'd be!!  The ones you can watch for free are fairly old. And to watch a newer movie you have to pay $6 for something new when I can rent one on redbox for $1.50", "verified": true, "helpfulness": "0/1", "author": "Andrew Simon"}, {"rating": 3.0, "review": "It's a good streaming box but not as great as it says it is. I have a sony box that also has voice search so that is about equal. The fire box does not always stream the highest quality images and sometimes, on the Hulu app, the program plays sound but no picture for a minute or so. Could be Hulu's issue but really, at this point in a merging tech world, it is everyone's problem if they collaborate on delivering a service. I have seen no significant increase toward better performance in the 4x advertised processing power... But I also have 2.5 Mbps Internet service, which is the lowest acceptable speed to stream. But our computers and the sony box manage it without going blank screen on us. All devices give us the infamouse \"loading video\" percentage circle that you have to wait 30 seconds or so till the stream plays. I don't see this product as a 'game changer' as advertised but it gets the job done 90% of the time on par with our computers and sony box. (Don't have a Roku or Apple to compare.)It obviously has more app support than the discontinued sony box... But the reality for watching TV on a streaming box is still not here because of the legal mess that networks and cable companies are in. Cable won't allow all network shows to be available on streaming boxes. They are still upset they allowed them on computers and they are not giving up their turf to media boxes...of course that is nothing against the boxes, just a heads up for those trying to cut the cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I used the Roku 3 for about a year before I bought my Amazon Fire TV in November. I've also used X-Box Live, ChromeCast, stock streaming in Blue-Ray players & the Roku 2, so I'm somewhat familiar with streaming devices. I can easily say the Fire TV has really grown on me quickly & there wasn't much of a learning curve to understand it. Unfortunately, there is one LARGE flaw that makes it hard for me to NOT give it 5 stars (because I REALLY want to give it 5 stars).The voice search only searches within the Amazon Prime library & ignores all other apps (including Netflix & Hulu).Before you start with the \"Amazon is protecting its eco-system, they are entitled to do that, so stop whining!\" Yes. I know they can do whatever they want, but if they want users to continue using this & other streaming devices made by them they need to put down their corporate \"Money Now\" shield & think long-term. Sooner or later, Roku, Google, or someone else is going to make a streaming device with voice search, with a fast processor, better RAM, & most importantly an open-source eco-system that rivals their Fire TV and when that happens they're toast.", "verified": true, "helpfulness": "0/0", "author": "DynamicTim \"Advertising | UX | Branding\""}, {"rating": 4.0, "review": "More offerings needed but it appears Amazon is working on that... The hardware is excellent as well as interface.", "verified": true, "helpfulness": "0/0", "author": "Ron Kollman"}, {"rating": 5.0, "review": "So easy to use....  Love the voice search", "verified": true, "helpfulness": "0/0", "author": "Stephen A Konewko II"}, {"rating": 5.0, "review": "Great unit! Works really good! Could not be more satisfied!", "verified": true, "helpfulness": "0/0", "author": "lejlah88"}, {"rating": 3.0, "review": "Good does what I wanted", "verified": true, "helpfulness": "0/0", "author": "Daniel M."}, {"rating": 5.0, "review": "It had more features than I expected and even allows you to link to your iTunes library. No need for Apple TV any longer. You can view Amazon Prime videos as well as Netflix plus play a bunch of games. Great device and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Stefan"}, {"rating": 5.0, "review": "I had trouble streaming with my smart tv no problem with fire tv hooked to it and what an affordable price if your prime you have to get this", "verified": true, "helpfulness": "0/0", "author": "RBJ"}, {"rating": 5.0, "review": "Easy setup... my wife loves watching movies. I just wish that there are more choices of \"prime movies.\" I have not explore some of the features such as games however, yesterday I uploaded some pictures to amazon cloud with ease and like the outcome watching on wide screen TV. I'll upload more pix for friends to view.", "verified": true, "helpfulness": "0/0", "author": "dakota"}]