[{"rating": 1.0, "review": "This product was defective. There were red lines across the screen and it flickered on and off. I just put in a request to return it. I would have just requested a replacement, but that option was NOT lit up when I clicked on return. So I may or may not give it one more try. I pre-ordered the HDMI cable and was excited that I had all the items I needed to make this product function correctly. Until, I noticed that this product does not come with an Optical Audio cable. I did not know this and it was not listed any where in the product instructions. Even if it would have worked, I still would have not been able to use it because I did not have the proper cables.  I love Amazon, but this was poor quality control and poor communication.", "verified": true, "helpfulness": "1/5", "author": "Dara Carrillo"}, {"rating": 4.0, "review": "I can't say much as I was not able to use the full features. I am able to use a Roku without too many issues at slow speeds 2.8 MBS but with the Amazon Fire it buffers WAY too much.. This is really not a knock on Amazon but a caution to those that have slower speeds like mine. Amazon even says it requires a high speed connection.", "verified": true, "helpfulness": "0/0", "author": "kewlhiker"}, {"rating": 5.0, "review": "Up until recently we had been using the Xbox for streaming. Unfortunately we no longer have the Xbox, and I was at a loss and here comes Amazon Fire TV. It has everything that I need. The only thing that confuses me...is how do I turn it off? it seems to power off on its own, but I can't figure out if there is a way to turn it off on my own. But love the seamless streaming and great quality.", "verified": true, "helpfulness": "0/0", "author": "L. Asano \"Sweet_lil_azn_girl\""}, {"rating": 4.0, "review": "I like just about everything on the Fire TV, but until Vudu or an HD Ultraviolet app is included, the box is just decent.  Also updating the voice search to search all apps instead of just Amazon would be helpful as well.", "verified": true, "helpfulness": "0/0", "author": "Larry Strickland"}, {"rating": 5.0, "review": "The Amazon Ftre is well worth the money. It makes your tv a complete entertament center. I would highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Steven Black"}, {"rating": 5.0, "review": "I am so happy I purchased the Amazon Fire TV.  We are looking to eliminate as many of our VHS movies as we can and are hoping that all of them are available through Amazon.", "verified": true, "helpfulness": "0/0", "author": "Cynthia J. Malnic \"cindym\""}, {"rating": 5.0, "review": "I only had one TV that was not a \"smart TV\"--the Amazon Fire TV has taken care for that for me.", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "When we bought our new house we swore to pay Comcast as little money monthly as humanly possible. So we had to find an alternate option for watching TV and movies.....This Amazon TV is THE BEST! We had an Apple TV before, and wasn't really pleased w/ it's interface.This system is SIMPLE to use, EASY to navigate and offers everything we need.Love it.", "verified": true, "helpfulness": "0/0", "author": "Haley"}, {"rating": 2.0, "review": "(updated 2 weeks in)  This is interesting, and I expect Amazon will bring rate limiting to the system before long:  I rented and watched a Prime paid movie the other night.  I didn't think playback was too terrible, though it did need to buffer a few times.  They just refunded my payment for the rental.  Those refunds are going to cost them over the long run as customers with broadband at the lower end of the speed metrics buy the boxes and then buy content.Received the Fire on Thursday, unboxed it and set it up Friday night.A lot of what it does, it does really well.  I wanted a single device that would let me view local content, Netflix and Amazon video.  All of this is possible to do, which is great.  Being able to sideload apps is very nice as well, since it means I can have the box read my files off the NAS for itself..  By enabling a PIN to block accidental purchases I get a filter of sorts to assist with sorting Prime benefits from stuff I must pay for.Sound output's pretty good even before I have a DAC to run the signal through.  It's rather frustrating, though, to be so unsure what format audio is coming off the box.  So far I've only once had a few mismatches between the audio format and the television, but not knowing for sure whether it's trying to output a digital or an analog stream is too bad.  A couple of LEDs on the front would be nice, one illuminated for analog, the other for digital, and taking their cue not from the OS itself but from the HDMI and toslink chips directly.Amazon needs to have a way to get customer-loaded apps to display in the carousel.  Until they do, installing Lama along with the apps you prefer lets you bind your app to the launch of another app you're not interested in - but which you downloaded from Amazon, and thus has a place in the carousel.But then, the bandwidth issue.  Left to its own devices, Amazon video will cheerfully take 100% of your broadband connection.  If you're on a DSL line, as I am, it's a headache.My Netflix account is locked to the lowest possible bitrate setting.  But Netflix via the Fire grabs all available bandwidth, which Netflix via my tablet or my Western Digital box does not.Fine, I looked on the device settings page via the Amazon website for a way to set a system preference there.No such luck.My DSL terminates through a router that supports an untrust-trust policing bandwidth on a per-internal-IP-address basis.  Enabling that and limiting bandwidth to the box at 1.2 mbps lets me use the Fire TV and also lets others in the house get work done.But until Amazon sets something up that permits people to do this with the device itself, I suspect a lot of folks are going to be fairly unhappy.If you know what you're getting and why  and Amazon video is one of the sources you want access to, this is an excellent system.I wouldn't dream of recommending it for most people, though.", "verified": true, "helpfulness": "6/7", "author": "roustabout"}, {"rating": 3.0, "review": "Just a week so far into the 30 trial. Feelings so far are mixed. Installation was simple. Have it go through my Receiver , so sound is pretty Good. The speed it streams at is excellent.(I have Comcast Cable). Movies come up instantly and have not had any blips in anything I have watched so far.I agree with other posts that the separation of Prime and Pay for , needs to be addressed. When there are a series of movies or shows, and some are Prime and others not, its a little frustrating and also confusing. Why are some James Bond Movies for example, Prime and others not. I do not subscribe to Netflix or Hulu.I confess to being a little disappointed in the selection on Prime. There are numerous movies on TV(Non Subscription stations without Adverts)  that have to be paid($2.99 -$6.99) for on Amazon.I like the Pandora App(at least my Daughter does), but cant see the need for the Radio Apps, I Heart, TuneIn. There not for sitting in front of your TV to listen to.The HBO Series is a plus. Have never seen any of there shows.The Games I'm out on at the moment. Have a Playstation , so not sure how that will go.Overall so far, I'm really not convinced. I will probably take a chance and keep it, and hope for much more in th efuture.", "verified": true, "helpfulness": "1/1", "author": "Camdids"}]