[{"rating": 3.0, "review": "Movie selection not up to par", "verified": true, "helpfulness": "0/2", "author": "EJJ"}, {"rating": 4.0, "review": "Add internet search capacity to this and it would be a 5-star product.", "verified": true, "helpfulness": "0/1", "author": "Julie A. Eckert"}, {"rating": 5.0, "review": "super", "verified": true, "helpfulness": "0/0", "author": "Jorge"}, {"rating": 5.0, "review": "Enjoying movies and TV episodes that I did not have access to before acquiring Amazon fire.", "verified": true, "helpfulness": "0/0", "author": "Harry Kimes"}, {"rating": 4.0, "review": "The Kindle Fire TV streamer is built into a very fine package indeed, nice and solid, and is probably the best there is in it class. There are lots of fine TV and movie programming to pick from plus Amazon Prime Time videos, but it dose require a fast Internet connect in-order to not get stalls.It is a closed system and you can only get the channels that Amazon provides. One category of missing channels is that of religion, and I don't see any way of getting them, voice search dose not return anything except some videos on the subject.I like to watch John Haggie Ministries from time to time and others too. The Roku 2 streamer do provide some religion channels. The Fire TV is a fine quality steamer with optical audio output but I would’ve preferred an open system that would allowed me to watch anything available on the Internet and with down-loadable apps to do so.For the money you can buy a blue-ray player with streaming capabilities built-in and much the same programming.I may fill compelled to invest in an open system steamer that I can tinker with.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Well, I have used all three and Fire TV is better than Roku and TiVo for streaming. There is little in the way of buffering pauses etc. The fast forward is actually fast. The voice activated search is pretty good.But there is no way to rate films like you can on Netflix. This will always keep Fire TV from climbing above 3 stars. Its how I keep track of what I watch, what I like and don't like.On Netflix, I have rated over 6000 movies, documentaries and TV shows. Without this rating feature, FIre TV is hamstrung for me.Also, we do not get Prime music. Sad.Amazon's offerings are pretty good. Check out Mind of a Chef if you like shows about food. However, some of the cooking shows like Jacques Pipin simply have no way to keep track of which you have seen. They are all jumbled up, in no order.If/when these things are fixed, Fire TV will get another star. Till then, its still beats Roku and TiVo for streaming media.Months more of use...I downgraded my rating. LOTS of trouble with box having to sign in to Netflix often. This is a half hour project. The fix? Tech said factory reset. An hour replacing ALL apps, their email and password info etc. Still no fix. I am returning to Roku.", "verified": true, "helpfulness": "1/2", "author": "DukeofURL"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/1", "author": "YI"}, {"rating": 5.0, "review": "A must have to watch Hulu Netflix and YouTube on your tv", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I LOVE AMAZON FIRE TV SMALL AND DOES EVERYTHING IT ADVERTISES IT CAN DO", "verified": true, "helpfulness": "0/1", "author": "SAVON ANDRE"}, {"rating": 5.0, "review": "I'm lost so there's no way you can connect it to your tv with the HDMI cord because I'm using an old tv that doesn't use an HDMI core......Need help please because I bought it personally for my tv downstairs instead of me going upstairs all the time to use. ....Need help with it please", "verified": true, "helpfulness": "0/3", "author": "Famson Musa"}]