[{"rating": 5.0, "review": "Great device. Works well. Super easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "this machine is really  really  fast  and very good  reaally like voice controlno more searching for movies  anymore", "verified": true, "helpfulness": "0/0", "author": "thomas"}, {"rating": 1.0, "review": "I did not do my homework, and was therefore unaware that Fire TV does not work in Mexico.  I live full time in San Miguel de Allende, and as a Prime member thought I would take advantage of the content provided by Amazon.  Having full access to all of Apples content through my Apple TV it never dawned on me that I wouldn't have the same access to Amazon's content.  Not sure what the licensing issues are, but the Fire TV is back in it's box and my Apple TV is reconnected and fully functional.", "verified": true, "helpfulness": "1/1", "author": "Electric49"}, {"rating": 5.0, "review": "Amazing love it canceled my satilite this all I need for tv/movies", "verified": true, "helpfulness": "0/0", "author": "blessed"}, {"rating": 5.0, "review": "So far I love it.  Haven't watched a lot of it.  Like the music but can't figure out how to move my iTunes to the Amazon system.  Just have not had time to research it.  The only problem I have found is when my Internet is intermittant.  Stops movies from playing :(", "verified": true, "helpfulness": "0/0", "author": "Chrisanne Cubby"}, {"rating": 5.0, "review": "We have been extremely happy with our Amazon Fire TV.  The voice search on the remote is handy, though it doesn't work with Netflix, only Amazon videos.  We do not find it difficult to switch between Netflix and Amazon Video, though I saw some people had complained about that.  I think my only complaint has been that it is difficult to search for shows/movies using the remote when you can't use the voice search, because clicking through the keyboard letters on the screen is time-consuming... but no different than something like entering your name using a wii remote on a video game.  Since I wouldn't really want a full keyboard on the remote, I think it's just fine.  The remote is really very nice.  I do wish that for the cost of the box and the Prime Membership, there were more free shows.  But the TV box is great, we've been very, very satisfied customers.", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Nancy Zuffoletti"}, {"rating": 5.0, "review": "So far so good waiting on the game controller", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Hawt.", "verified": true, "helpfulness": "0/0", "author": "christian smyth"}, {"rating": 5.0, "review": "Worked great for a week then unit went dead as a doornail hope to get  a replacement unit soon!", "verified": true, "helpfulness": "0/0", "author": "Bob Jensen"}]