[{"rating": 5.0, "review": "I love Amazon TV! Its better than having to pay for cable and I use it everyday. I can even play music if I am working out or cleaning through the TV.", "verified": true, "helpfulness": "0/0", "author": "brownsugar21"}, {"rating": 5.0, "review": "Totally worth every penny and love the voice activation!  I did quite a bit of research before purchasing this as I am cutting the cable cord for the first time.  If you have Amazon Prime, this is a no-brainer!  There is so much available to you through Prime and other apps, too!  I really don't miss cable, but I do need to go get an antenna for local channels for local news.", "verified": true, "helpfulness": "0/0", "author": "Sarah C"}, {"rating": 5.0, "review": "Love it! Had no idea how much I'd enjoy it. Only thing I would do better is make the remote a little bigger, have the buttons glow. Got Netflix through the medium and they make it easy. For me, I can't say Netflix is better. I think Amazon total package Definitely worth it.Also I bought 3 additional fire sticks for my other Tv's & they work great!!", "verified": true, "helpfulness": "0/0", "author": "david mercado"}, {"rating": 4.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "George Berry"}, {"rating": 5.0, "review": "Amazing product, worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Joseph scalchi"}, {"rating": 5.0, "review": "Nice unit, easy set up", "verified": true, "helpfulness": "0/0", "author": "Ralph Furton"}, {"rating": 5.0, "review": "I am glad I bought this.", "verified": true, "helpfulness": "0/0", "author": "Cliff Perrenod"}, {"rating": 5.0, "review": "We are really happy with it. So nice to be able to enjoy old shows like NYPD Blues without commercials.  All I expected and more..voice commands are great.", "verified": true, "helpfulness": "0/0", "author": "Bonnie"}, {"rating": 5.0, "review": "love this box better then apple TV.", "verified": true, "helpfulness": "0/0", "author": "overstockAV.com"}, {"rating": 4.0, "review": "I really like the Fire TV app. I limited the rating to four stars because you limited the audio search to Amazon Prime only! That audio search is very nice. Thank you.", "verified": true, "helpfulness": "0/0", "author": "dickdham"}]