[{"rating": 5.0, "review": "Love that you can just speak into the remote and it finds whatever you are looking for!A must have if you are cutting the cord with cable.", "verified": true, "helpfulness": "0/0", "author": "N. Peter"}, {"rating": 1.0, "review": "It's a product which is basically an ad for Amazon stuff.  Every menu item is an ad with stuff I can buy or rent.  It feels like a hard sell every single time you do anything with this box.  Even the voice results are pushing content buying. This box is based on android so it had some promise; however, this is useless for me. Bought a Roku instead. I will also be getting the new Apple TV if it comes out in the fall.  The difference there is that IF YOU WANT to rent a movie, then you can launch an app in both Roku and Apple TV to browse the selections; however, Amazon doesn't give you that option...it's just ALWAYS showing you an ad unless you're in the Settings menu.", "verified": false, "helpfulness": "2/7", "author": "AS"}, {"rating": 4.0, "review": "I'm really happy with Amazon Fire TV.  Easy to navigate and has almost every app I want available.  I would really like it if Amazon Music was available on it though.  Pandora is so why not Amazon's own music app??", "verified": true, "helpfulness": "2/2", "author": "Kate Dowden"}, {"rating": 4.0, "review": "I don't like that we have to pay for the prime tv shows - they are prime shouldn't they be free tooother than that we like it", "verified": true, "helpfulness": "0/4", "author": "Debbiek"}, {"rating": 5.0, "review": "So far so good.  Haven't had it that long but really liked the easy set up and the voice search.  No more going from letter to letter when entering a search.  The screen savers are incredibly beautiful.", "verified": true, "helpfulness": "0/0", "author": "Heidi Lahti"}, {"rating": 5.0, "review": "We had to purchase Amazon Fire in order to use our prime TV purchased in 2013.  Even though our TV is smart, it was not the type of \"Smart\" required to operate Prime.  The Amazon Fire solved the problem and it is sooo easy to use!  Very pleased with this easy solution.", "verified": true, "helpfulness": "0/0", "author": "Candee S."}, {"rating": 4.0, "review": "I have 3 boxes like this one at home, pivos xios and pivos aios, theu both do the job. But this little box puts them to shame with the pure speed. it is so responsive and precise its seems like a supercomputer.The only minus I wish it worked in Canada. I have side loaded xbmc to use as my media stream and it works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 3.0, "review": "I would have purchased this today as the Amazon Fire TV has .. on its connection panel ... a USB port. In addition to viewing and purchasing Amazon content .. would like to use the Fire TV with my own movies on my own USB drive. I had to download the User Guide to find this one line statement: The USB port currently does not support any accessories.", "verified": false, "helpfulness": "2/2", "author": "j r paull"}, {"rating": 5.0, "review": "I have trouble with my eyes a bit and reading fine print is difficult.  My Grandson helped me out on getting this set up (took him a matter of about 15 minutes - mostly for typing in passwords) and I couldn't be more pleased.  It is so easy to find a movie, unlike it is on the computer, with the voice procedure.  I called up musicals and more showed up that I realized were available.  This is so simple to navigate it's night and day over the Apple TV I replaced and seldom used.  I haven't even tried all the other stuff it's capable of doing so I couldn't be happier.  Thanks Amazon for a FANTASTIC PRODUCT", "verified": true, "helpfulness": "0/0", "author": "Retired but still kicking"}, {"rating": 5.0, "review": "It works great and is more than I expected. It is much faster than Apple TV which I only use now if I want to stream from my phone. Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Gary DuCharme"}]