[{"rating": 5.0, "review": "Finally, one remote to rule them all.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Excellent.  Interface with YouTube is good, although make sure activation is done on official YouTube site. There are fake sites out there.", "verified": true, "helpfulness": "0/0", "author": "Carl F. Orgren"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Finn-Erik"}, {"rating": 5.0, "review": "I need your feedback please regarding the below 2 points :1) If there are any new channels , how the fire TV box will be updated ?2) Can I find & watch all the middle east Arabic channels ?3) What about the news channels , is it live ?Waiting for your kind reply .", "verified": false, "helpfulness": "0/0", "author": "Hagop"}, {"rating": 5.0, "review": "The reception via my WiFi is very fast and clear.  The voice search works quite well and speeds the process of finding various movies.  Highly recommend this Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Peter B. Stebbins"}, {"rating": 3.0, "review": "Worked fine for about 6 months, but it suddenly stopped working. Get error message: \"Invalid Format.\" I have an Olevia TV. Apparently, even though it worked for about 6 months, the FireTV box is not compatible with Olevia TVs (according to tech support I talked to and discussion boards I read). Weird that it worked for 6 months and then just stopped. I'm not going to invest in a new TV, so now I need to find another brand that works with my Olevia and allows me to watch both Amazon Prime movies and TV and NETFLIX.", "verified": true, "helpfulness": "0/0", "author": "DCT"}, {"rating": 5.0, "review": "A power packed , concise unit providing a colorful and useful interface. That established, Fire TV provides a great array of programming but sometimes misleading as to what is available to view. If this concept was better designed it would make this almost perfect to use. I still feel that this is a great value ..Easily installed, I had it running in about six minutes and believe me I am no professional. A handy,brightly intuitive  offering from the always progressive Amazon Marketplace!", "verified": true, "helpfulness": "1/1", "author": "AUDREY FODOR \"As an English Lit major many moons ago, I have always had a hunger and interest in the written word. This new-to-me medium,if you will, has offered another delightful facet to my Listening opening up another dimensional side of my sensory perception by utilizing the spoken word to draw me into exciting worlds.\""}, {"rating": 3.0, "review": "This product gives you the ability to watch movies at HD quality, but only if you have good internet. I does not give you the ability to download movies to it like you can with other fire products nor does it give you the ability to use it without internet. You cannot start a movie and then walk away to watch the whole thing because it only lets you do up to a certain point.", "verified": true, "helpfulness": "0/0", "author": "Harlan Christensen \"hotrod2000jeep\""}, {"rating": 1.0, "review": "I have a Roku2 and Fire TV. I use my players to play video though my plex server. On Roku2 plex is the latest version and play without any problems on Fire TV it has the older version of plex, it freeze, half the time its transcoding the video, it will cause the server to crash. On Roku2 it will list my movies by watch and unwatched but on Fire TV it will not because it uses the older version of Plex. The Roku plex skin is more intuitive and can sort by venue, actor, year, ect but on Fire TV this is not available.  So if you use  a play to stream your media file though plex stay will Roku until Amazon update to the newest version of plex. Until amazon updates my fire TV will just sit.", "verified": true, "helpfulness": "0/1", "author": "loren vallier"}, {"rating": 5.0, "review": "PERFECT divice... the #1 in it's category!!", "verified": true, "helpfulness": "0/0", "author": "Fernando Medrano"}]