[{"rating": 5.0, "review": "ONE OF THE BEST PURCHASES I HAVE EVER MADE", "verified": true, "helpfulness": "0/0", "author": "GLORIA M. BOLINGER"}, {"rating": 5.0, "review": "I loveeeee it.  I wish I knew how to use all the features,  but I am learning everyday.", "verified": true, "helpfulness": "0/0", "author": "mrs. burton"}, {"rating": 5.0, "review": "This product already has more than 27000 reviews so it doesn't need another one but I have to say that I LOVE LOVE LOVE the Amazon Fire TV.  I have a \"Smart TV\" and it's a good TV but sometimes bring up some of the programs was slow and prime didn't work well with it... So I got the Amazon Fire when it was on sale for $79.00.  It is so easy to use and it works so smoothly.  They keep adding new programs and I can't even keep up with all of them but for Netflix, HBOGO, Amazon Prime, Hutu Plus, Facebook, games, apps, it's just amazing.  I hardly watch regular TV anymore... and, oh yes, I bought one for the bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Becky \"Still Standing\""}, {"rating": 3.0, "review": "Wasn't as compatible with my iPad as I would have liked.", "verified": true, "helpfulness": "0/1", "author": "Kristen Bunker"}, {"rating": 5.0, "review": "Now that I have this I'm really getting my money's worth with our prime membership. So many videos to choose from! Turn your TV into a huge digital photo frame :^)", "verified": false, "helpfulness": "0/0", "author": "Werner Weckerly"}, {"rating": 3.0, "review": "to much stuff to buy i thought that most of the things are free. thats just not right .  bb", "verified": true, "helpfulness": "0/2", "author": "bobbie behrens"}, {"rating": 4.0, "review": "Disclosure: been an Apple person for years, and have been slowly lured to Amazon without realizing it. Can't hide it now though. Also, I have Amazon Prime which in my opinion is a must to get full use out this. Likes: super fast, great HD picture.  Dislikes, moving around the system, but this may be due to years of Apple TV time.If I had to choose between this without Prime and Apple TV I'd pick this and have been since I hooked it up.", "verified": true, "helpfulness": "0/1", "author": "MDM"}, {"rating": 4.0, "review": "It's a very good device.I'm really enjoying it. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Cari S Austin"}, {"rating": 4.0, "review": "Was a gift for my Dad worked out well.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 3.0, "review": "I want to love it, but don't yet...", "verified": true, "helpfulness": "0/0", "author": "Paul Gardner \"Conductor of Magical Publishing\""}]