[{"rating": 2.0, "review": "Unit worked out of the box, so that was a good start.  The amazon app for movies etc works well.  The Netflix app or the Fire TV does not work.  It locks up after first use.  If you get rid of the app and reload the app again it will work until you shut it down and then back to the same situation, you automatically log on to the Netflix site, select a movie a report comes back saying it can't download the movie try later.  So the Fire tv is really only good for Amazon TV.  The Netflix app on Amazon is much better than on the Apple tv but unfortunately it doesn't work right now, hopefully we will see a fix soon.  I also had lots of trouble with music sharing so gave it up and still using ATV which seems to be better for music and pictures.", "verified": false, "helpfulness": "0/0", "author": "Howard"}, {"rating": 5.0, "review": "I am not a techy, but this device is easy to use and I love it!", "verified": true, "helpfulness": "0/0", "author": "Lucy Rodriguez"}, {"rating": 5.0, "review": "I normally used a powerful PC hooked up to my projector for streaming TV and movies.  I did not think a tiny little box like this could provide a good playback experience compared to a PC.  The Fire TV exceeded expectations in all regards.The first thing I noticed was that everything on the Fire TV runs buttery smooth.  I thought it would be tedious to scroll through TV shows and movies on the Fire TV, but it runs very well and there are practically no loading times when scrolling through Amazon's content.Amazon's Instant Video service dominates the user interface.  I really would have liked to see more complete integration with services like Netflix, but instead these streaming services are hidden away inside their own apps.  I fully understand why this is.  Obviously, Amazon wants their own content to take center stage.  But more than that, it is extremely difficult to integrate with 3rd party content providers at all, especially if you are going to dictate to them exactly how everything is going to work.  After trying a Roku TV stick, I appreciate this even more.  Speed issues with the Roku stick aside, Roku integrates all the services together better, but the interface feels relatively unpolished.  It is as though Roku had to design for the lowest common denominator.I should also note that I immediately wired the Fire TV with ethernet, and never tried it on WiFi.  WiFi is the cause of so many network problems that I don't think I would have bought Fire TV if it had not posessed an ethernet port.", "verified": true, "helpfulness": "0/1", "author": "B. Pearce"}, {"rating": 1.0, "review": "I am super disappointed. We can never get it to work, we have had it for less than a month and have had to replace the batteries 4 times (the remote).I have emailed Amazon twice asking for assistance or a replacement and have never received a response. We will be returning it.", "verified": true, "helpfulness": "1/4", "author": "Stephanie Z. Walters"}, {"rating": 5.0, "review": "Love it, easy to use. Endless selection.", "verified": true, "helpfulness": "0/0", "author": "Lauren Grenier"}, {"rating": 3.0, "review": "I love everything except that there is no recent movies free for prime members.", "verified": true, "helpfulness": "0/0", "author": "Romulo Contreras"}, {"rating": 4.0, "review": "So far, beats the performance of my Apple TV 2. Kids like the games especially. Great product  and considering to purchase a couple as Christmas gifts.", "verified": true, "helpfulness": "0/0", "author": "Kojo Inkumsah"}, {"rating": 1.0, "review": "Most of the show I would like to view I have to pay for.", "verified": true, "helpfulness": "2/7", "author": "James W Noell"}, {"rating": 5.0, "review": "Yes I am now happier with streaming", "verified": true, "helpfulness": "0/0", "author": "Ty Leatherman"}, {"rating": 3.0, "review": "A good product that needs further development and improvements to be a great product.", "verified": true, "helpfulness": "0/0", "author": "Auntie M"}]