[{"rating": 4.0, "review": "I was disappointed that Showtime Anytime could not be used since Comcast/Xfinity was not listed as a provider!!!!", "verified": true, "helpfulness": "0/0", "author": "Sammy K."}, {"rating": 5.0, "review": "Really great piece.  I have Apple, Roku, and now this.  It is VERY fast and I really enjoy it.  Great product!!!", "verified": true, "helpfulness": "0/0", "author": "Bruce Cox"}, {"rating": 3.0, "review": "The first unit I purchased \"worked\" for less than 30 minutes. It would connect to my WiFi, and it would download apps, but it wouldn't stream content, giving me an unknown error. I tried rebooting the box, and it didn't power back on. I called tech support and had to spend over 40 minutes explaining the problem to a very rude tech support person who kept asking me what error I was seeing on my screen. When I finally got him to understand that the power was dead and I wasn't seeing ANY error, he told me to calm down. This was a horrible experience, customer service-wise, but doesn't figure into my review of the product itself. Everyone gets the short end of the stick at times, and something is bound to not work. The CS was inexcusable. The associate's insistence I fill out a survey when he was finished \"solving my problem\" ensured I did just that. I only mention this to advise people that dealing with CS at Amazon can be a daunting, unpleasant and even hostile task.The second unit seems to work save that it suddenly pauses every other show or so for no reason. The screen goes completely blank, and then the picture returns, but I have to hit the play button to resume playback. No idea why this is occurring, but it is annoying. Similarly, I often get errors saying there is a problem playing back the title at this time, and I should try again later. \"Later\" is 3 seconds later, apparently. I just go to the title again and hit play. My WiFi signal is strong, and my router is less than 10 feet - with a clear line of sight, so no obstructing material - from the Fire TV.Now, as to the good points. The picture is great. The sound is great. The content is great, though I share the sentiment of other users wishing for the ability to filter content so I can see only what is included with my Prime membership. The voice search is overrated. It often can't handle words it doesn't recognize from its own libraries. For instance, when trying to demonstrate the voice search for friends, I said \"Guns of Navarone.\" It didn't even come close to getting Navarone right. And all the voice search does is pull up matches for words. It works fairly well, once you realize it isn't the astounding breakthrough Amazon has advertised.This is a good box that allows me to consolidate much of my online viewing into one convenient location. I don't like the Roku's interface all that much, and Amazon has improved on it greatly. Also, Fire performs quickly. Much quicker than competitors I have tried. But it's not a GREAT box. It has the potential to be great, but right now, I can only give it three stars for the whole user experience.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer \"media junkie\""}, {"rating": 5.0, "review": "better then cable an dirtect tv hands down", "verified": true, "helpfulness": "1/1", "author": "dave spelich"}, {"rating": 1.0, "review": "UPDATE - 4/28/2015Well, as to be expected, Amazon customer service contacted me, wanting to \"make everything right.\"  Yeah right.  My TV is ruined...permanently.  I paid $1,700 for this TV back in 2007, and now, I have \"PANDORA\" permanently emblazoned on my TV screen because Amazon didn't listen to my initial complaints.  So, after several email exchanges and an online chat, I'm pretty much left with \"oh well pal, sucks for you.\"  Pathetic.  So, as I stated before, if you own a plasma TV, DO NOT RUN PANDORA IF YOU BUY THIS!  I guess buying a new TV will be in my near future.UPDATE - 4/27/2015Unfortunately, as I feared, the Pandora logo and icons have burned into my plasma TV.  If anyone out there who owns a plasma TV uses this device, BEWARE!  I would strongly suggest NOT using the Amazon Fire TV for Pandora.  It looks like a new TV is in my near future.  I truly hope that Amazon works this problem out, so that others don't suffer the same result I did.ORIGINAL REVIEWThis appears to be a device that isn't quite ready to live up to the hype.  As others have noted, the UI is fairly spartan and cold feeling.  Also, the fact that the voice search only works in the Amazon environment is a serious drawback.  I have a membership with Netflix along with my Amazon Prime membership.  If I am searching for a movie/TV show, I would expect this device to inform me of ALL my options, not just what I can rent/buy from Amazon. Oh, or watch for free from the VERY limited Prime library. For some, I suppose the following would be a minor issue, but; the screensaver while listening to Pandora defies all logic!  It does not come on after a specific period of time, nor a specific number of songs.  But, on occasion....THERE IT IS!!!  But, it's not the built in screensaver with all the lovely pictures.  Instead, it's an app specific screensaver that puts your song info into a bubble and floats it around the screen.  Well, that's fine, except for the fact that there have been times when twenty minutes or more have gone by, and no screensaver comes up.  I own a 50\" inch plasma TV, and so it is critical that static elements don't stay on my screen for any length of time.  Otherwise, hello burn in!  A similar problem exists if you're trying to listen to digital music that you've purchased from Amazon.  In that situation, NO screensaver comes on....ever!  The only way to get a screensaver in that setting is to back out to the Amazon Fire TV home screen.  Then, the collection of nature pictures comes on after the set time you've designated.I contacted Amazon's Customer Service about this issue via online chat, and ended up going round and round with some novice in India.  Is this really what Amazon has been reduced to?  Needless to say, he was completely unable to help me resolve the screensaver issue and wasted an hour of my very limited time.  Also, for any of you who own Samsung tablets and have any hopes of screen mirroring with this device?  Forget it, it doesn't work.  My Samsung Galaxy Tab Pro 12.2 could see the Amazon Fire TV box easily enough, but the Fire TV refused to connect.  Also, for those of you with Android Tablets, if you're considering Amazon Prime so you can watch movie/TV content on them...don't bother, it doesn't work either.  Amazon is apparently trying to strong arm everyone to purchase their hardware (unless you're an Apple drone, in which case I believe everything works fine).I have recently cut the cable with Dish Network and thought that this device would be a very useful replacement.  So far, I've been rather disappointed.  The selection of movies and TV shows is very limited for Prime members, and Amazon seems to go out of it's way to part you from your money to watch things you really want to see.  On a positive note, the sound and picture quality are very good.  I have the Fire TV hooked up to a 7.1 surround sound system, and it does sound great (using the optical out connection).I sincerely hope that with upcoming software upgrades, this device will be all that it potentially can be. I'm torn as to whether I should just return it, or keep it and hope that things improve in the near future.  To add insult to injury, after paying $99 for the Amazon Fire TV, I see that they now have it on sale for $84.  With the thousands of dollars I've spent at Amazon over the years, I'd think they'd be able to hook me up with a much better box for our home entertainment purposes.  Time will tell.", "verified": true, "helpfulness": "2/3", "author": "M. MacGowan"}, {"rating": 5.0, "review": "I'm really thinking about getting this for my home. How much does this one time TV charge cost?", "verified": false, "helpfulness": "0/1", "author": "Angela"}, {"rating": 5.0, "review": "Love this thang!!!", "verified": true, "helpfulness": "0/0", "author": "Jason Stiles"}, {"rating": 4.0, "review": "Overall, this is awesome product. I enjoyed using it far more than I did my Roku 3. It is very fast and the voice search capabilities are handy. I like that it pre-buffers your shows and saves a local cache, so there is virtually zero downtime while you are streaming a movie. The only reason I am giving it a 4 Star is because the remote is a battery killer. However, the user interface is attractive and adaptive enough that it outweighs having to get rechargeable batteries. I wouldn't rush to replace your current streaming device if you already have one though. However, if you do not already have a streaming device or are looking to replace your Comcast, this may be a great option for you.", "verified": true, "helpfulness": "0/0", "author": "Misty Dawn :D"}, {"rating": 5.0, "review": "love it, love it and love it.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Bailey \"book maven\""}, {"rating": 1.0, "review": "I am interested in the Amazon Fire TV.", "verified": false, "helpfulness": "2/16", "author": "JULIE BORSH"}]