[{"rating": 4.0, "review": "Amazon just launched their entry into the set top box wars. And they've done a nice job with this box. The Android-based hardware has plenty of room to grow, and the interface is gorgeous.But is it better than the Roku 3?  Not yet, unless you're primarily an Amazon video user. Amazon has really done a nice job presenting their content, with videos that load so fast they feel like they're on my local network.The apps for other services like Netflix feel a little more generic and not much better than other devices. So if you are not primarily an Amazon user there won't be much gained here over the more mature Roku offering.One of the launch apps is Plex which is a great way to get your own content on the device. But I found it doesn't play well with MKV files, especially ones that have embedded Dolby Digital or DTS audio. You won't be able to stream smartphone content to the Fire TV without first uploading the files to Amazon's cloud service. Both the Roku and AppleTV offer that capability.Games look pretty nice on the device and its quad core processor should help it keep up with even the most demanding Android titles that will become available for it. It also supports standard bluetooth controllers so it may not be necessary to purchase the Amazon controller.Amazon has a confusing business model with this device --  movies and shows are paid for with dollars or your local currency, but apps and games require a pre-purchase of \"coins.\"  I don't like having to park my money with Amazon for future purchases but that's unfortunately the way it's going to be.  CORRECTION -- It turns out you can buy with coins or cash in the app store.So is it worth buying?  No if you are already a Roku user. Maybe if you have an AppleTV and want to watch Amazon content. Definitely if you don't own a set top box and most of your content purchases are from Amazon.", "verified": true, "helpfulness": "60/72", "author": "Lon J. Seidman \"lon@ lon.tv\""}, {"rating": 5.0, "review": "I am blown away by the attention to detail and ease of use of the Fire TV! I have 3 Apple TVs and the Fire TV is clearly better!The touch and feel of the product is Apple like... even the packaging looks like it came from Apple. The Fire comes pre-initialized with the purchasers account name. The voice search works beautifully.Nice work Amazon!", "verified": true, "helpfulness": "13/17", "author": "Larry Lohrman"}, {"rating": 5.0, "review": "I really don't understand some people, criticizing a product that literally came out a day ago (Apr. 2nd). What is wrong with you??----------------------------------------------------------------------------------------------------------------------------------------------------------------------Real review:I am an early adopter for most tech products. Including 4K TVs and monitors. Therefore I own most of the TV boxes. Roku 3, Apple TV, Chromecast, and also PS4 and Xbox One.To be honest I love the most is Apple TV because I have an iPad and the AirPlay works well. But the Amazon fire TV works really well for what I need besides AirPlay. People criticize for it not having many apps, for it having some UI issues. Damn people it literally came out yesterday. What are you thinking?It has all the video apps I need, Netflix, Hulu, and Amazon Prime video.It is really fast and it works well. Screw the people who ask for too much and you get well over the value.", "verified": true, "helpfulness": "25/31", "author": "SuperDuperAsian"}, {"rating": 5.0, "review": "To start, I have 2 apple Tv's, a Roku 3, an HTPC and now a FireTv.  The winner is the FireTv.My primary uses: Plex, Netflix and Amazon Instant Video (ranked in order of usage).  Used daily.  I use some of the internet channels as well.  And now will probably use it for family game night too.Why is this my favorite and why it stands out from the rest?-  This thing is fast fast fast.  Moving through the UI is instant, effortless, fluid, intuitive and pretty.  To compare, AppleTV is simple but dated (get a home button!).  Roku is fine but doesn't feel as quick or as pretty, maybe even a bit clunky and is definitely no where as fast compared to the FireTv.-  Voice Search - it works and works very well, just as they advertised. (a very pleasant surprise).  This isn't Siri taking her sweet time or not understanding you.  It works.-  Downloads are fast (even the buffering is faster).  Faster processor and graphics mean faster everything.-  I like the feel of the remote best.  This is personal preference of course, but apple's is too slim and slippery (comparatively).  Roku's is again, fine, but putting the ok button below the cursor pad is silly and makes it just less fluid with your thumb movements.  I also really like how big the center/ok button is on the FireTv remote, no miss hitting it (or accidentally hitting the left/right/up/down like on other remotes)-  Another thing I like is the parental controls.  I only played with and noticed the simple addition of adding a pin before buying anything (no just based on rating).What I didn't like or would like to see....-  HBO GO.- Voice search to be integrated into other channels / apps.  This isn't necessarily Amazon as the app maker's will need to implement it into their apps (like Plex or Netflix).- No amazon cloud music player app yet, but I'm sure it is coming soon.Please note I use wired connections and didn't test (nor care about) the WiFi.  Wired connections are simply reliable especially for those large 40GB movies I play through Plex.I hope this helps you on your decision and will update my review as I use it more.", "verified": true, "helpfulness": "152/173", "author": "Chris Trailer"}, {"rating": 3.0, "review": "Until you add hbo go, you won't be able to compete.  Too bad....I like the idea.  You are almost there!", "verified": false, "helpfulness": "4/36", "author": "999let999"}, {"rating": 4.0, "review": "PROs:  Extremely elegant and fast  15 minute quick setup  Powerful wifi (couple it with the latest AC dual band routers)  Gorgeous, sleek interface  Tons of games, apps, music, photo, and video optionsCONs:  Limited video apps (will increase over time), such as the game-changing HBOGo  No ability to watch anything in quiet since there is no headphone jack on the remote (would love to  purchase one in the near future that has a capability like that)  Voice search only limited to Amazon Prime at the moment (I am sure this will be changed)Overall,  the FTV is an excellent product with a clear future ahead due to its hardware and openness android platform. I would recommend this to anyone!4/3/3/14 : 4/5 rating given (expect that to go up as more features are evolved in the coming weeks/months)", "verified": true, "helpfulness": "13/15", "author": "Jonathan McShane"}, {"rating": 3.0, "review": "I am a current Roku 3 owner.  I ordered the Fire TV with 1 day shipping, received it 4/4/14, installed it, and tested it side by side with my Roku 3 (connected via ethernet and HDMI). I stream my local content from a dedicated Plex Media Server and use various internet streaming apps like Netflix, Amazon Prime, You Tube, ESPN, Pandora, and Fox NOW.I was initially excited about the more powerful processor, voice search, and Plex integration, but as an existing Roku 3 user I wondered if spending $5 more on the Fire TV would be worth it.  In short, it was not worth it, and I'd recommend the Roku 3 over the Fire TV if you're interested in local content and web content streaming.To be clear, I have no interest in gaming on my streaming device, nor do I need Kindle Fire integration.  If these things are important to you, the FireTV might beat out the Roku 3.The factors that caused me to return the Fire TV and retain my Roku 3 are:- Roku 3 supports mkv local content streaming (Fire TV does not unless you use Plex with transcoding which requires a box acting as a media server)- Roku 3 works with my universal remote (Logitech Harmony One)- Roku 3 has more apps including Fox and HBO Go- Fire TV remote voice search was a disappointment as it did not include local content in the search results- Roku 3 is cheaper- Roku 3 did not require me to purchase Plex since I already have Plex Pass (Amazon charged $.99, not a big deal but still a nice consideration for Roku to recognize the Plex Pass)In many regards the two devices are similar:- Both have the same ethernet speed- Both support Plex- Both have many of the same core apps (including bringing up You Tube content on your phone and \"casting\" it on the You Tube Roku app - cool feature so you don't have to use the horrible search via tv remote that everyone hates)To be fair, the Fire TV seemed a little snappier and it does integrate with the Kindle Fire as well as support voice search for Amazon content.  However that extra processing power seems to be geared more towards the available gaming as opposed to benefiting local content streaming. Moreover, I liked the Fire TV remote (bluetooth is more responsive than my Harmony One) but not enough to juggle 2 remotes.Conclusion: The Fire TV seems like a decent device, but as of roll out it doesn't have enough to distinguish itself over the Roku 3.  Perhaps once the device matures, more apps are available, Amazon adds MKV support, figures out how to integrate the remote with universal remotes, and provides some innovative/game changing features, I'll drop my Roku 3.  But until then, I'll stick with the cheaper and more mature Roku 3.", "verified": true, "helpfulness": "20/30", "author": "Matt \"Matt\""}, {"rating": 1.0, "review": "To be fair, I haven't received the product yet. But that commercial with Gary Busey, what are you thinking? I don't get it, I've learned absolutely nothing about your product.", "verified": false, "helpfulness": "11/270", "author": "Noodlum \"Noodlum\""}, {"rating": 3.0, "review": "First, ridiculous reviews from people who've never touched the device.  Get a life.I've recently cut the cord from DirecTV and I'm using a Mac Mini, browsing to Aereo, Netflix, NHL Game Center and other media sources.  This cost about as much as one month of DirecTV so it was worth a shot.Easy setup, nice presentation.  Everything is fast and fluid as promised.As a source of movie / tv media the unit itself is ok.  Not great, just ok.  It suffers from a lack of apps (Aereo, NHL were the ones I would want to see, personally) and a lack of content, however the latter is more of an indictment on the free content available on Amazon Prime.  Fortunately, most of those who would be interested in this device already have Netflix.  The voice search works, but when you find a program available for $2 or $3 on Amazon, I was under the impression it would show you other options (like, from Netflix) where the program is free.  That feature is not working for me yet.The gaming experience is fine.  However, there are only a handful of games available - I know they promise about a 1000 within a month or two.  Of course, 1000 good games would be preferable to just any 1000 they could round up, but getting the premiere developers to take notice of your new platform is the real trick nowadays.  Amazon Studio's premier tower defense / FPS is similar to Sanctum on Steam, but not as compelling.  There's a few arcade style games, etc.  No \"must haves\" that motivated me to spend those free 1000 coins that come for free with the game controller.With more apps and games available and more free content FROM AMAZON or a working \"other viewing options\" feature that included Netflix would bump it up a star.I don't hate the device at all.  It's just not that ... exciting.  I'm going to play around with it, but I suspect I'll be giving it away to the next friend who expresses interest.  I'll stick with the Mac Mini which I still think is one of your best options as a cord cutter (IMHO).", "verified": true, "helpfulness": "13/16", "author": "Robert T. Tabor \"Bob Tabor, LearnVisualStudio.NET\""}, {"rating": 1.0, "review": "Outside of Amazon product onlyh voice search and a quicker processor, Roku 3 still out performs FireTV in many other areas. Besides HBO GO and VUDU Roku3 has one huge advantage, you can access you iPhone via the Roku app. It functions allow you to instantly search the Roku store for all available channels or my channels.You can quickly control all functions of the Roku 3 by turning your iPhone into a Roku remote control.Now listen to this, or now do not listen to this. Amazon declares you can listen to your Amazon purchased music via FireTV. Key words\"Amazon Purchased\"My Roku3 / iPhone app combination lets me play my entire 2,000 song iPhone music collection via my Roku3/TV Theater Sound System. It can play my Amazon purchases, my iTunes purchases, and any old CD's I downloaded to iTunes. FireTV will not.It seems Amazon rushed out this product to the market. With their resources, too bad they didn't put out a complete package.Voice search only works on Amazon videos, and now you can only listen to music on Amazon purchased music.Oh, I also forgot, did I mention you can also access the ever popular Facebook via Roku3.", "verified": false, "helpfulness": "18/118", "author": "PIRATE40"}]