[{"rating": 5.0, "review": "Love that i could get all the Nick shows for ny daughter. ....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like the unit just fine, it's the service that concerns me, i expected more free included viewing. For example I clicked on this Sam Axe movie I thought it was included,it charged me $12. The movie was not that good, I could have seen it at the theater at. Matinee for $6. I'll have  to become more careful.", "verified": true, "helpfulness": "0/0", "author": "Rich M"}, {"rating": 3.0, "review": "I like the fire tv but disappointed with the selection most of the newer movies are not available to the viewers .Movies like the long walk to freedom had to be purchase I don't know about any others yet and hopping that movies like American sniper will be available for free", "verified": true, "helpfulness": "0/1", "author": "Zippy"}, {"rating": 4.0, "review": "Using for a few days now. SO easy to set-up! Very pleased with streaming quality and we have average speed wireless internet at home. Hoping for more apps in the future. We appreciate the free apps and games thus far and LOVE the prime content.", "verified": true, "helpfulness": "0/0", "author": "TRadio30"}, {"rating": 1.0, "review": "Great, you can go ahead and Watch Chris Carter's \"The After\" on Amazon Prime! With this box you will be able to actually see it on your TV... Oh wait. Amazon dropped the series. So now there is NOTHING on Amazon Prima WHATSOEVER to watch. So why the hell would you buy this stupid box?Don't buy this stupid box, buy something open like a Minix Neo X8", "verified": false, "helpfulness": "2/14", "author": "Menno"}, {"rating": 5.0, "review": "We cut the cord on our cable.  I purchased 1 to try and went back and bought another. There are so many apps to watch so many programs.  Get rid of your DVR.  You dont need it with this.  Yes some shows you have to wait on. But I find me self watching shows I have not seen from season 1 thru season 5 back to back.  I just dont have enought time to  watch them.  Runs great off of wifi.", "verified": true, "helpfulness": "1/1", "author": "Girly66"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Bradley McBroome"}, {"rating": 5.0, "review": "Absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Jim Z."}, {"rating": 5.0, "review": "Love that it shows what I watch all in  one place Hulu, Amazon instant video, and Netflix. Games are great but I don't play much. I use mostly for movies and missed TV shows.  I have a smart TV and my daughters prime account is loaded on the TV and my prime is on the Fire TV so we don't have to log out when switching between accounts. Hulu loads a lot faster on the Fire than on my TV (it gets caught up a lot on TV even after clearing my que).  The Auto play option is great when watching an entire season and easy to turn off when not wanted.", "verified": true, "helpfulness": "0/0", "author": "Leslie Jordan"}, {"rating": 5.0, "review": "I love this TV box. It is used daily and we haven't had any issues with it.", "verified": true, "helpfulness": "0/0", "author": "Abi F"}]