[{"rating": 5.0, "review": "Love this device!!!!", "verified": true, "helpfulness": "0/0", "author": "R.J. Perodin"}, {"rating": 4.0, "review": "Relatively easy to hook up. So far I have only tied it to Netflix, Pandora and of course Amazon Prime. My WIFI signal is not the greatest so some pauses in reception occasionally. But overall very happy with the system.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"GEOMILO\""}, {"rating": 5.0, "review": "Excellent!!! Love the voice search function - incredibly accurate! No buffering issues, great Apps, & we haven't even gotten to the Games and other functions yet. No issues whatsoever.", "verified": true, "helpfulness": "0/0", "author": "S. Cox"}, {"rating": 3.0, "review": "One of the best purchace for the house next to a television.", "verified": true, "helpfulness": "0/0", "author": "Terry Coneal"}, {"rating": 5.0, "review": "Love it! Very easy to use we have the Apple TV which fits a different purpose the Roku is great but I love the Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Chrissy Norrander"}, {"rating": 5.0, "review": "Great!!! Looked and works just like brand new!!", "verified": true, "helpfulness": "0/0", "author": "stephanie"}, {"rating": 5.0, "review": "Best streaming system out there and that's based on my hands on experience owning Roku, Apple TV, Google little Stick and several Samsung Blu-Ray players with streaming capability. Have disabled my Smart TV's wifi because it can't compare to the Fire TV.The only downside is Flixter will not handle episode collections on your account with Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Hawk-eye"}, {"rating": 5.0, "review": "I received this as a gift and found it very easy to set up. Prior to receiving it, I used my SurfacePro attached to my TV to run online content, and prior to that, a VCR that was a bit clumsy. The Amazon Fire TV provides easy access to shows I've \"saved\" through my computer on the Amazon Prime and Netflix sites.I have not yet figured out how to run HBO and its several related channels even though I subscribe to it through Verizon. That said, I usually save HBO specials through my DVR, so this is not an issue.In terms of streaming movies, I wish that Amazon and Netflix would run more up-to-date content. Amazon allows us to buy movies that are more recent (like going to a show and paying for a ticket). At this point, I've noticed a difference in price for one-time-viewing and \"buying\" the movie and I think that buying it means that the movie can be replayed anytime after \"on demand.\" If that is a feature you'd like, check it out.", "verified": true, "helpfulness": "0/0", "author": "Karen K. Little \"Littleviews\""}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Dave Adams"}, {"rating": 5.0, "review": "I have a chrome cast, roku and sony android player and this tops all of them", "verified": true, "helpfulness": "0/0", "author": "Jamie87"}]