[{"rating": 5.0, "review": "I bought this more out of curiosity than necessity as I have ROKU 3, but quickly found it to be more user friendly, faster loading and with many featires not available with ROKU.  I am using the Amazon Fire Tv exclusively now.", "verified": true, "helpfulness": "0/0", "author": "SEM \"gadget freek\""}, {"rating": 5.0, "review": "This thing is awesome!  It's so easy to setup, and automatically recognizes your Prime account.  It's so easy to use and the voice search capability is great.  This along with an $8/month Netflix subscription is all I need, and it is a huge savings over cable or satellite: I will never need cable again!!!", "verified": true, "helpfulness": "0/0", "author": "Kylie Holly"}, {"rating": 5.0, "review": "I just set it up this morning so I can not comment on the ease of using it but the set up was so very easy.  Thank You Amazon!  I had it set up and ready to go in 5 minutes.  Well, 10 counting the time to take it out of the package and out of the wrappers.  So far so good!", "verified": true, "helpfulness": "0/0", "author": "Paula Sidlowski"}, {"rating": 4.0, "review": "This little box is really nice because it's small, fast, and quick to start up. However, I do have problems with some of the apps (mainly netflix) which doesn't seem to load. I hear app updates haven't hit some things, but maybe that will improve. Overall, this is a good product.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "I just cancelled my premium channels with Time Warner Cable - saving $40 per month.  The cost of the Fire TV and Netflix and Hulu come no where near the cost of cable.Having marathon watching of Orange is the New Black!", "verified": true, "helpfulness": "0/0", "author": "Dawn E. Kimball \"poker & horses\""}, {"rating": 5.0, "review": "I just bought another one for the other tv in my home.  Everyone should own one of these! I can now cancel some of my cable channels!", "verified": true, "helpfulness": "0/0", "author": "Pamela Robinson Fair"}, {"rating": 5.0, "review": "I received this as a gift, and I could not be happier.The voice search works when you want it to and gets out of the way when you don't.  With some other devices, where the microphone is on constantly, you'll be watching tv and someone will say some utterly unrelated phrase like \"potato chip\" and the system (XBox, Playstation, whatever) will jump in and wait for you to finish the command.  With this, you press the button and it listens.  You don't press the button and it doesn't try to jump in to your tv show.The video clarity is perfect.  The audio is fantastic, and it autoconfigered for surround sound.  Didn't have to do a thing. Really, setup can't be any easier.  Plug it in, turn it on, you are done.  I thought I had to unplug to reboot a few times, but it turns out my HDMI cable wasn't in tightly enough.  After I fixed that the problems stopped.If you have the Kindle Fire, you can get xRay on that while watching TV, which is a feature I love.  The games definitely do better with the controller.  Overall, I think we need to see a few more apps for this, such as Crunchyroll, which are undoubtedly on the way.  For performance, for power, for ease of configuration and use, and for overall design, I'd give it five stars easily.  This is a fantastic device.", "verified": true, "helpfulness": "0/0", "author": "Ivy"}, {"rating": 5.0, "review": "Amazon hit a home run with this little box.  I no longer will need to have my boxee + roku connected to my TV.", "verified": true, "helpfulness": "0/0", "author": "Brian K."}, {"rating": 5.0, "review": "I can make better use of this than the chrome..It has much more uses and of course it is compatible with my other Fire items", "verified": true, "helpfulness": "0/0", "author": "Darlene M. Formanek \"I am really not in to romance.. I like historic writing the are fiction but follow closely to historic time lines.\""}, {"rating": 5.0, "review": "It came next day, and when i connected it to the network cable, and hooked it up to the TV, It was ready to go. First time there's a video explaining the features, about 3 minutes long, once the video is over the unit has connected your Amazon account to the unit and your ready to watch videos. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Billy Bob"}]