[{"rating": 4.0, "review": "I purchased the FireTV and Game Controller Remote to replace an ailing Roku box.  I liked the Roku, but at only 18 months old, I felt like I should have gotten more use out of it before it died, so looked for a different replacement.PROS:  The ability to play games is pretty cool.  It adds another platform where I can play Minecraft with my kids, which is nice.  The Fire TV is quick and the interface is elegant.  The remote is a good size, and voice search works well.CONS:  The lack of a Vudu app was a disappointment.  The Prime TV content is loaded into the main screen, with no separation between paid and free-with-prime content by default - this is a noticeable deficit from the PrimeTV app on Roku, where you could browse the free library without having to check if you're getting the paid or free version of a show.In short, for a new platform, it is very good and has few of the bugs I'd expect with a new release.  I'm cautiously optimistic that with a few updates, this will be a great platform.", "verified": true, "helpfulness": "1/2", "author": "JRT"}, {"rating": 3.0, "review": "Seems to be a great product, but Charter isn't listed as a provider. If you have Charter you won't be able to use any of the apps like Watchespn or the Showtime on demand.", "verified": true, "helpfulness": "2/3", "author": "Barry Johnson"}, {"rating": 5.0, "review": "I have a few Roku boxes and really like them.  I have read that the Fire TV has the best interface for Plex so I wanted to give it a try as I do not like the interface on the Roku.  As a heavy Plex user, this device nails it....it is perfect!  I can't wait for the app content to catch up.", "verified": true, "helpfulness": "0/0", "author": "-DG"}, {"rating": 5.0, "review": "What caused me to seek-out Fire TV is that I got sick and tired of being subjected to so many commercials while trying to enjoy a TV show.It's bad enough that we have to pay to watch TV these days, but having to pay to watch up to 18 commercials during a commercial break a countless number of times per hour is beyond absurd!The selection of FREE TV shows and movies is absolutely incredible!  Yes...depending on which movies you want to watch, you may have to pay a few $ for and the same applies to episodes of certain programs, but it's a small trade-off for not having to deal with a bazillion commercials anymore.You also don't need to subscribe to Netflix or Hulu as that is kind of an over-kill, but you have the option to do so if you wish!Also...I'm one of the least-techy people on the planet, and this is THE EASIEST system to set-up - far easier than hooking up a VCR! I was literally up and running within a few short minutes!!Do I STILL watch \"regular\" TV?  Yes!  I use it to watch the nightly news as well as a couple of programs I like, but at least I now have a choice!", "verified": true, "helpfulness": "2/2", "author": "bob3660 \"Bob McDowell\""}, {"rating": 5.0, "review": "Just having moved to a much smaller town in a different state, we no longer have any good options for Dish or cable TV. So, my husband and I decided to get Netflix, Amazon Prime, and Hulu Plus (instead of getting cable or Dish TV). Just prior to moving here (about October or November 2013), my husband purchased an Apple TV so that we could easily access our shows, and we were very excited to use it.Apple TV: Right away, I noticed there was Netflix and Hulu Plus.... What about Amazon Prime? There was no Amazon Prime on the Apple TV. Right away, I was a little disappointed. We had to continue to play Amazon Prime from our iPhones and stream it to the TV. The Apple TV was VERY slow as well. Any time we would press just about any button or do any action (search, fast forward, rewind, play, go into an app, go back to the home screen, etc.), it would take a long time for the Apple TV to do anything. Also, while watching a TV show on it, most of the time when I would fast forward, the Apple TV would freeze up and completely restart. This was all very frustrating for me. About a month ago, (May of 2014), I went online and bought the Amazon Fire TV.Amazon Fire TV: Hurray! Not only can I watch Netflix and Hulu Plus, but I can now easily watch my Amazon Prime shows! Then, I noticed how incredibly fast it was. It loads shows and apps on your TV so quickly and I no longer have to wait patiently for anything to happen! Last but not least, The Amazon Prime has not restarted or froze up on me while I am watching a TV show. We put the Apple TV upstairs and it is now plugged into our TV in our bedroom. We now use the Amazon Fire TV in the main TV room (living room). I have not tried any of the games and have not yet bought the remote control to play the games. However, I'm sure I will some day and I like all of the options it has. I do like the voice search as well and LOVE how quick it is!People often complain that you can't use the voice search on any other apps. This may be true (and it is a shame), but at least you can use it for the Amazon Prime!My conclusion? If you pay for Amazon Prime, then the Amazon Fire TV is so worth the 99 dollars it cost! It is so incredibly fast. I have used it, every day, for over a month now and have had no problems at all! :)", "verified": true, "helpfulness": "5/5", "author": "Megan L. Piddington \"Megan1982\""}, {"rating": 4.0, "review": "I purchased the Fire TV because it had everything I needed to replace my Samsung Blue Ray player, what a surprise I got when I went to use the USB port to watch movies I have on my memory stick, the USB does not work, so again I have to keep my Samsung Blue ray player to have access to my memory stick, come on Amazon dont advertise a USB when it does not work, that I believe is false advertising.  Otherwise the Fire TV is great, I have had no problems with streaming, I purchased the game controller and my grandson plays on it all the time, very easy to use.USB is needed and needed now to make it the complete player.", "verified": true, "helpfulness": "0/1", "author": "Stephen J. Mann \"Deal Seeker\""}, {"rating": 5.0, "review": "I got this to watch my amazon shows/movies on my tv rather than my computer.  I was streaming netflix to my tv through the blue ray player and I thought that was fine.  Fire TV is so much better.  Weather your watching Netflix or Amazon, the show doesn't take forever to load.  This sucker is almost instant and really god quality too.  Super simple to use and set up.  Remote works great and is so simple, my 8 yr old son uses the Fire TV all the time.  I would definitely recommend this to anyone who watches any TV", "verified": true, "helpfulness": "1/1", "author": "Egully"}, {"rating": 4.0, "review": "Prior to purchasing the Amazon Fire TV, we were not using the benefits of our Prime Membership very much.  Since receiving the device we have watched a movie nearly every evening.  We now have access to many more apps and movie resources and subscriptions than we have ever had and access to nearly all if not all movies that you can find at a big box rental outlet.  Very convenient.  We have now been using the Amazon Fire TV for about two weeks.The device works well and the voice command feature works very well also.  The remote is small and has few buttons but still allows you to access and manage all of the features of the device very easily. Overall, we are happy with the Amazon Fire TV and we will continue to explore its content and features.As a general comment, We are older and not particularly well versed in the world of movies available so one feature that I would like to see improved or made available is a total directory of movies by category that is alphabetical.  The voice command is great if you know what you want to find but otherwise, it is hard for us to locate movies, TV shows or videos that are available and that we might want to see.  Amazon Prime boasts that it has over 40,000 movies and TV shows to select from but I have been unable to locate all of these selections.  All of that may be available under some broad category listing with the Amazon Fire TV device but those category listings have up to 150 individual items listed, not in an alpha sort but some other sorting and if you multiply the small number of categories by 150 items available in each it comes far short of 40,000.  Actually, the directory or master listing of movies, videos and TV shows available doesn't need to be on the Amazon Fire TV.  It would help if a \"TV Guide\" type of list were available to be downloaded.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I own a Chromecast, a smart TV and Vizio Co-Star (Google TV).....everytime I used one of these products to stream a movie from say Netflix or Amazon it always 'buffered\"...many times during the movie.  It was very frustrating to say the least.  I always figured it was my cable company....Verizon FIOS......I would call they would come out and tell me the signal was fine...then I would still have the \"buffering\" issues.  When I first saw Fire TV,it hit me that the cause might not be my connection but the power of the actual device I was using.  For this reason I decided to give Fire TV a shot.....very glad I did....I now get crystal clear reception and movies with almost zero 'Buffer\" time.  This thing is dynamite.  Highly Recommend...only reason for 4 stars instead of 5 is I am waiting on more content and speech search throughout all content not just Amazon.", "verified": true, "helpfulness": "1/1", "author": "PCasp \"Daddy\""}, {"rating": 5.0, "review": "Good day to youPlease can you tell me if this product will work in the United Arab Emirates as i will be in the USA and want to purchase one t bring backThanking youAshfaque", "verified": false, "helpfulness": "0/1", "author": "Ashfaque Ahmed"}]