[{"rating": 5.0, "review": "I thought that this was probably an okay purchase when I made it. I figured my TV had Amazon built into the tv and this might be an improvement. WOW. I was blown away the second I plugged this in. The browsing is very easy and fluid and super quick. I can listen to music, browse more efficiently and more effectively, and use the voice controls to find stuff instantly. I also love the ability to see what others watch based upon what I watch. It's just awesome. You will fall in love with it. If you are on the fence buy it and be blown away. AWESOME. Having met Jeff Bezos I can tell you he truly loves his customers and it shows in this product. I had him sign a few things for me in the past and he always wrote \"Customers Rock.\" They listened to everything and now have this perfect product to show for it.", "verified": true, "helpfulness": "2/2", "author": "Lac \"lac\""}, {"rating": 5.0, "review": "Waiting. To c ,but looking good so far", "verified": true, "helpfulness": "0/1", "author": "randy perry"}, {"rating": 5.0, "review": "I LOVE this!! I just ordered my 3rd Amazon Fire TV.  Now I have my movies, music, photos in my three major viewing rooms (family room, bedroom and sewing room).  How cool is that.  I tried using my Amazon Prime with my smart Blue-Ray player, but, it wasn't that smart.  I could see my prime movies, but not my music.  I did have a Apple TV for a short time, (like two weeks) but i could not get the content that Amazon Prime has.  So Apple TV is now residing at my daughters house.  Her family is total \"Apple Heads\".  They visit my house and see how easy the Amazon Fire TV is, especially the voice search. My 3 year old granddaughter (who is tech savvy) can ask for Mickey Mouse and pick her own movies. Can't do that with Apple.  I see a conversion in their future.  Thank You Amazon!!", "verified": true, "helpfulness": "0/0", "author": "SSaltmeris"}, {"rating": 3.0, "review": "Quality is not that great on some of streaming movies.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent device for very little money.  Super easy to install and set up, even for someone that is not tech savvy.  Added my Netflix streaming account to it in no time.  I would like to see a better type of search system for Amazon Prime shows and movies, but overall I am very very pleased with this purchase.", "verified": true, "helpfulness": "1/1", "author": "Desert Gal"}, {"rating": 5.0, "review": "what a  great product", "verified": true, "helpfulness": "0/0", "author": "jon"}, {"rating": 5.0, "review": "Its quick and they keep adding apps that make it better and better.", "verified": true, "helpfulness": "1/1", "author": "K. Hove \"ZenTaoist\""}, {"rating": 5.0, "review": "Outstanding video quality and content. No buffering at all. Worth every penny! In my humble opinion.", "verified": true, "helpfulness": "2/2", "author": "Gerald Garcia"}, {"rating": 5.0, "review": "Good s***", "verified": true, "helpfulness": "0/0", "author": "Fabian Lopez"}, {"rating": 4.0, "review": "Mostly satisfied, but surprised that many things are still charged for and just like cable tv expensive to watch.", "verified": true, "helpfulness": "0/0", "author": "Frederic Winter"}]