[{"rating": 4.0, "review": "Fire TV is extremely fast with a great interface. The only thing missing from my standpoint is it does not see local content. It only streams content from sources through the Internet.Streaming of Amazon Prime is flawless, and right now it is only connected through WiFi. I had experienced delays streaming Amazon Prime through my Smart TV, before. Now those issues are resolved.Fire TV also uses Bluetooth for communication with the remote. Extremely responsive and no \"line of sight\" is required.", "verified": true, "helpfulness": "1/2", "author": "David C"}, {"rating": 4.0, "review": "I've been reading the current 1,000+ reviews for the FireTV and I have to say, a lot of the negative reviews seem to be from people who don't even own this device.  All because it doesn't support HBO Go (which is a paid service and a lot of people don't pay for it!).  Okay, that's great.  Get a Roku and shut up already.I never thought about getting a device like this, but a week ago I realised I needed something for my older HDTV in the living room (not a SmartTV) so kids could watch things via my Amazon Prime account.  I started thinking about investigating my options and ended up on Amazon for another item altogether when the home screen showed Amazon FireTV...it was like the answer to my prayers.  I immediately ordered it.  As a Prime member, I obviously chose 2-day shipping but it didn't ship until the next day (yet Amazon shipped it overnight so it would still arrive in the 2-day shipping window!  Thanks, Amazon!).Once I got it out of the box, set up was a breeze!  Yes, it needed to download a substantial (900 MB) update but that took no more than about 6 minutes with my current Internet speed.  Amazon took the time to set up the device with my Prime membership information so I was good to go in about 10 minutes - box to TV.The box itself has no buttons, just a small white light that glows when it's on.  The remote is smaller than others with minimal buttons, but doesn't feel cheap (neither does the box - it's heavy for its size!).  My one complaint about it is the length of the power cord and the size of the plug.  The cord is short, so it's stretched pretty tight right now from where my TV is to where it's plugged in.  I chose not to buy another HDMI cable, instead using a 3 foot cord I already owned.  I may need to get a longer HDMI cord just so I can move the box closer to the electrical source.  While it's not too insurmountable a problem, it's sure not convenient.  Also, the plug is large and takes up two spots on my power cord.  Again, not a giant issue but it's bothersome to me because I like everything to look neat and orderly and this takes up a lot of space.The interface of the device is great, intuitive and easily navigated.  Searching for movies/shows/whatever is made even easier by voice commands through the remote.  I find it's like any other voice recognition device - speaking slowly and concisely yields results, but even doing that sometimes vowels at the end of words are lost, so it doesn't necessarily bring back what you asked for.  Good thing there is also a way to type a text search - which is clunky but effective.I do wish that it was easier to search strictly Amazon Prime options - but that's just a personal preference.I haven't perused the gaming options yet (mostly because I don't want to shell out another $40 for one controller and you almost always need two!), but hopefully once more games are available it will become worth it.As an early adopter, I realise the next generations will only get better and I'll be sad I didn't wait...but I love it so far and am glad I jumped the gun and purchased it.  It's definitely made watching movies outside a computer easier.", "verified": true, "helpfulness": "4/6", "author": "kickinitoldskool"}, {"rating": 4.0, "review": "The Fire is wonderful however I have one significant concern.  Unlike blu rays and dvds there are no product descriptions that include the aspect ratio for the way movies are presented.  By this I mean 1.85, 2.35, 1.33 etc.  Not having this information makes me cautious about buying.", "verified": true, "helpfulness": "1/3", "author": "James D. Carey \"jimmymack\""}, {"rating": 5.0, "review": "We just got this yesterday and it is taking a little time to get used to it but I think it is going to be great", "verified": true, "helpfulness": "0/0", "author": "Ydhillbilly \"febsnow47\""}, {"rating": 5.0, "review": "I own an Apple TV and the Fire TV and purchased the Sony Google TV this last Christmas for my parents.Let me start off by saying that I have been responsible for setting up and teaching just about my entire family how to use each new device they buy. In my experience, there are 3 types of people when it comes to figuring out how to use devices/operating systems:(1) those that it comes naturally to(2) those that it doesn't come naturally to and don't have the patience and/or personality to figure it out(3) those that it doesn't come naturally to and do have the patience and/or personality to figure it out.There is nothing the matter with being in category 2 because everyone has their own strengths, but if someone falls in category 2, the device(s) selected makes a difference.Purchase History:If I had an opportunity to test drive the Sony Google TV before purchasing it for my parents and the Fire TV was available at the time, I would have purchased the Fire TV for them as one of my parents generally falls into category 2 and the other into category 3. However, the sole reason I would have selected the Fire TV over the Apple TV for them is because they use Amazon Prime to rent and stream movies. It has been my experience with smartphones that the iOS operating system is far superior to any Android based operating system for the slightly technologically-challenged, as I will explain my reasoning later. There is absolutely nothing wrong with the Sony Google TV, in fact it even allows you to do picture-in-picture with your TV which is a great feature along with an internet browser, but it is the least intuitive of the 3 to operate -- mainly because it allows you to do so many things. I have been very happy with the Apple TV, but was interested in the Fire TV because I use Amazon Prime for streaming a lot and have a Showtime account.Fire TV specs:The Fire TV is a more capable device than the Apple TV, and in some respects, more capable than the Sony Google TV. The hardware is better than both of the others: boasting more RAM (2 GB, the base amount you will find on most lower end to mid-range computers), more local storage (8 GB), and a quad-core processor -- that is, if 4 instructions are sent to the processor at the same time, it can process all of them at the same time instead of one at a time such as would occur on a single-core processor. While this is generally not needed for streaming movies, it allows the Fire TV to be very capable as a gaming unit, if that interests you (the box also includes a USB port which would allow the connection of an external hard drive if you are very into gaming and 8 GB of memory does not suffice for storage).Operating System:The operating systems of the Sony Google TV and Fire TV are Android-based. This, in my personal opinion, is the primary reason they are less intuitive. Android, as an operating system, allows much more freedom than the iOS operating system, which has advantages and disadvantages. Many programmers prefer the Android operating system because of this, as every programmer has their own style and preferences, but this is a disadvantage to the general population falling into category 2 and 3 because customization is the enemy of intuition in the overall picture. For example, if using the Fire TV and viewing an Amazon Prime movie, you can customize the size and text format of the subtitles while watching your movie; if using the Fire TV and a Showtime movie, you can turn on subtitles but in order to change the display of the subtitles you have to go to the app settings. This may seem trivial but it takes away from unity of the interface between apps that iOS (e.g. Apple TV) focuses on. In this respect, this is why the iOS operating system is such a better choice for people falling in category 2 -- no matter which app is in use, the interface is the same and there is no need to learn intricacies for each app. Many people hate on iOS, and Apple in general, for being so controlling but honestly, there is some wisdom to that approach because I have never gotten a call from one of my parents about how to do something on the iPhone once they both got one when previously, I routinely got phone calls about using their Blackberrys. Even as a person who falls into category 1 and is a programmer (albeit, a computational one), I prefer the uniformity between interfaces because it leads to your brain interpreting the displays as less \"busy\".Overall Capability:I'd go with (1) Sony Google TV for Google Play and Amazon Prime, Picture-in-Picture, and the Chrome browser with allows access to content there isn't an app for. For (2), I'd go with the Fire TV mainly because of the great hardware specs and the the gaming capability. Then lastly, I'd go with Apple TV as (3).Ease of use:The Apple TV is an easy #1 as the main menu is simple, clean, and intuitive. The main display is just the apps, there is no need for any tutorial on how to use this. The Fire TV is a fairly close #2 but the main menu is more cluttered. It has a side display for selecting between apps, movies, gaming, etc. and then when you select one it moves to the an up-down menu on the same screen that displays sub-categories and previews of what is in that category (e.g. in Movies -> New to Amazon Prime). The Sony Google TV is a more distant #3 as it has two main menus sort of similar to a machine running Windows (pre-Windows 8) with the start menu and shortcuts. Selecting the \"Apps\" choice on the main menu it brings you to a screen similar to the Apple TV main menu but I haven't hadn't had good experience teaching my parents how to use it.Streaming:When it comes to selecting a Fire TV vs. an Apple TV for streaming purposes, I think what it boils down to the devices you own and partially what services you use. If you own an iPhone and/or iPad, go with the Apple TV -- even if you use Amazon Prime you can always AirPlay from your phone/tablet. If you have a Kindle Fire HDX, go with the Fire TV. Not owning an Android smartphone, I am not sure you can play media from your phone/tablet on the Fire TV but if it doesn't exist, it won't be long before that capability is available. If you have a HBOGo account, the Apple TV might be a better choice. If you have a Showtime Anytime account, the Fire TV might be a better choice. If you rent/buy movies and TV shows through iTunes, probably Apple TV. If you rent/buy movies and TV shows through Amazon, probably Fire TV. Additionally, the Fire TV allows you to purchase standard definition movies/TV shows. This is an advantage over Apple TV which only allows HD. When it comes to a movie, this is only a couple dollars but if you are purchasing a TV series, the extra cost for HD is about $10-$15 per season. If you (or your kids) purchase a lot of TV shows and don't particularly care if it is in HD, this might be something to consider.In conclusion, the one thing I can say beyond a shadow of a doubt is that if Microsoft ever comes out with a similar device, I will not be purchasing it, unless of course Microsoft gets some brains and switches to a UNIX-based operating system.", "verified": true, "helpfulness": "10/11", "author": "J. Madsen"}, {"rating": 3.0, "review": "The interface is VERY snappy and easy to follow, but the roku does it better because you can play local files. This (as of release) does not allow playing local MKV files. It has a usb port so why not?  I have a roku 3 and I tried this out and I cannot recommend it over the roku 3.", "verified": true, "helpfulness": "0/6", "author": "Timmy McTimersons"}, {"rating": 5.0, "review": "I tried other streaming devices, this works so much better. Navigation is very easy, I love the voice search. Extremely happy!!!", "verified": true, "helpfulness": "2/3", "author": "J. Henderson \"Rob\""}, {"rating": 5.0, "review": "First off I'm a tech junkie and own a Roku, Chromecast, Boxee and Apple TV. I gave up cable 3 years ago and haven't looked back. Instead I have put my trust into streaming devices. At heart I'm a hardcore gamer and when I heard about the Amazon Fire TV I got extremely excited. I've read various reviews from various popular blogs that really didn't seem to answer any questions that I had about the device before purchasing it. So, I felt compelled to write a small review about what YOU need to know about the Amazon Fire TV.The Fire TV is a sexy little device that looks good in the living room. It's small and will fit in any entertainment center. After hooking up the device your greeted with a short tutorial. What I really disliked about Roku, Boxee, and Apple TV is when you navigate through Apps such as Hulu or Netflix it gets very sluggish. You don't have that issue with the Fire TV. With the speedy hardware it makes navigating through Hulu or Netflix is a breeze. Talking about apps, Amazon really hit a home-run with it's app library. I was delighted to see some of the apps that I use on my phone in the starting line-up. Also, if your a mobile gamer you won't be disappointed as Amazon actually some awesome hit's ready to go. Now, one of the main selling points of the Boxee was it's ability to play a lot of the popular video formats. After finding out that Plex was available for the Fire TV I jump aboard. Now I have the best of both worlds, a fast device and also a device that is capable of streaming popular video formats. Now, what's special about the Fire TV is Amazon's Prime membership. Should you opt in? Well, it's up to you. I'm a Prime member and enjoy the line-up that Amazon currently has, also Amazon is working hard to bring more movies to their line-up as well. It's certainly a lot better than Netflix, and I'm a Netflix customer. And last, the Voice Search is totally awesome. At first I thought it was gimmick but after using it I can't go to any other streaming device. This thing makes typing a thing of the past. The Voice Search is very powerful I would say it's on par with Siri. Yes, I said it.So is it worth the purchase? YES!Pros:1.) Great App lineup2.) Device looks great in the living room ;-)3.) Netflix & Hulu aren't sluggish.4.) ASAP Technology is AWESOME.5.) Voice Search is AWESOME once you try it your hooked.6.) Listening to Pandora while playing games.Cons:1.) Interface is cluttered. Need to be able to configure the inteface.2.) The game controller isn't comfortable. A pro controller needs to be offered.3.) Controller support needs to be offered.4.) Needs more network options, proxy, ports etc;5.) Needs more memory for apps. This is the type of device that will turn you into an app junkie.", "verified": true, "helpfulness": "23/25", "author": "Karim Harvey"}, {"rating": 2.0, "review": "Was OK.  Highly disappointed in universal search options.  Its as if it hides the prepaid subscription options, and only initially displays paid options.  This was a show stopper for me. I don't want to fight to find the cheapest viewing options, in a desktop TV unit.  I have a much better experience with TiVo universal search, and Simply loading Netflix and Chromecasting.", "verified": true, "helpfulness": "9/15", "author": "Brian Flores"}, {"rating": 3.0, "review": "How did Amazon leave out there cloud player app. I can not play my music that i have on  Amazon's cloud player on Amazon Fire TV this is crazy", "verified": true, "helpfulness": "4/9", "author": "gerald  r  finley"}]