[{"rating": 5.0, "review": "No complaints here, this was an easy setup and I was streaming movies within 30 minutes.", "verified": true, "helpfulness": "0/0", "author": "ABF"}, {"rating": 5.0, "review": "The best and fastest streaming device yet I've used!No wait time like Roku devices...", "verified": true, "helpfulness": "0/0", "author": "Karl"}, {"rating": 5.0, "review": "great product- be careful about ordering if you have netflicks already", "verified": true, "helpfulness": "0/0", "author": "John Gefaell"}, {"rating": 1.0, "review": "heed help . it reads  connected with problems. picture appears for just a second then screen says,go to settings", "verified": true, "helpfulness": "0/0", "author": "seymour teicher"}, {"rating": 5.0, "review": "Love the ability to have more viewing options. I have had no problems with my purchase at all.", "verified": true, "helpfulness": "0/0", "author": "Happy Amazon Customer"}, {"rating": 5.0, "review": "We love this. Being bored with HBO, a whole new line up of shows & movies. Wonderful", "verified": true, "helpfulness": "0/0", "author": "alexcreates"}, {"rating": 5.0, "review": "I am a self-proclaimed geek. I love this product. Everything is easy, quality is superb. I had zero issues.On a different note, I took it with me on vacation. The condos I'm in has free wireless and entering a passcode is required. However, the Fire TV is connecting to the wireless \"with error\" and it won't let me go anywhere to add the passcode. Is it possible that they've put some sort of block to prohibit streaming? Disappointing but not the end of the world. Any thoughts?", "verified": true, "helpfulness": "0/0", "author": "Kim Agee \"kimagee\""}, {"rating": 5.0, "review": "I have purchased 2 of these Fire TV setups and my family loves them.  I have recently decided to get rid of satellite TV due to the rising costs and the less than desirable programming included in their high prices.  I am so glad we cut the cord and decided to use Amazon Fire TV along with an indoor antenna (also purchased through Amazon) to watch everything we used to watch for a ridiculous price per month.  The kids like to play the games that are also available through Amazon and the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "J. Parthun"}, {"rating": 3.0, "review": "You can only watch their choice of free movies, The rest you pay for dearly.", "verified": true, "helpfulness": "0/0", "author": "EELJAY"}, {"rating": 5.0, "review": "Everything I want in an item like this.  Fast interface, good selection of apps, voice control, small form factor, etc.  I have an Apple TV and I prefer the Fire TV by far.  I would have connection issues with the Apple TV, they do not exist with the Fire TV.  I have had zero issues with my Fire TV and I couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "S. Dague"}]