[{"rating": 5.0, "review": "I use a TiVo roamio for my main box but got the fire tv so I could side load kodi and watch sling tv to boot. It's slick and fast!", "verified": true, "helpfulness": "0/0", "author": "Stephen B."}, {"rating": 1.0, "review": "Like Roku better", "verified": true, "helpfulness": "0/1", "author": "Her Name is Bert"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "eric siegel"}, {"rating": 2.0, "review": "Set up was a breeze, saw a couple of programs, turned TV off for the night. In the morning it would not turn on or come out of its slumber, nothing. Completed troubleshooting, again nothing. Replacement was the same scenario. went with Roku no issues.", "verified": true, "helpfulness": "0/1", "author": "Robert"}, {"rating": 5.0, "review": "Transitions between videos very quickly!  Love it!  Flinging my Kindle screen works great as well.", "verified": true, "helpfulness": "0/0", "author": "shiba"}, {"rating": 5.0, "review": "Dang, totally impressed.  Have ruko (many versions) and apple tv...", "verified": true, "helpfulness": "0/0", "author": "Buyer001"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Carl R. Jones"}, {"rating": 2.0, "review": "We were disappointed with the selection of movies offered with Prime membership. Redbox has far more new releases at a fraction of the cost. Okay if you like watching TV shows.", "verified": true, "helpfulness": "0/2", "author": "Barbara G. DeStefano"}, {"rating": 5.0, "review": "I had used both Roku and  Chromecast but did one is at another level altogether. Better interface, full 1080p HD, better content. Highly recommended. I purchase another to gift to someone and one more for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "techwiz809"}, {"rating": 5.0, "review": "I am very happy with my Amazon Fire TV.  I own both the Amazon Fire TV and the TV stick.  I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]