[{"rating": 2.0, "review": "The two most frequent networks I watch the most is not available on Amazon Fire: PBS and HBO GO.  Until they are available, I cannot use Amazon Fire.", "verified": false, "helpfulness": "5/19", "author": "Melvyn A. Sacks"}, {"rating": 4.0, "review": "I'm not a high tech person but for me I really like it because it is easy to use and has everything on it I want to see (and then some).  It's easy to set up and easy to use, having very few buttons.  On that note, the reason I only gave it four stars is because you can't turn it off.  You either have to unplug it from the power or you have to wait 30 minutes for it to go into sleep mode.  For me that seems silly and inconvenient but everything else about it has been delightful so far.", "verified": true, "helpfulness": "3/3", "author": "Mary Stephenson \"escape (into books) artist\""}, {"rating": 3.0, "review": "It is a very nice system and yes the voice search works great! But not half as many apps as the Roku and the parental controls stink! On the fire you either lock out everything or nothing. Really the only think that is good about the Apple TV to me is being able to stream iTunes from an external hard drive, and you can show your iPhone/iPad which is huge and that why our main on is the Apple TV still but I like the Roku usability better and we have that one upstairs.ProsFastVoice searchConsLack of AppsParental controls stinkNo headphones jackNo universal search like Roku", "verified": true, "helpfulness": "2/4", "author": "W. Hamilton"}, {"rating": 3.0, "review": "In both Plex and Showtime app the audio is only in 2.0 across HDMI. For that reason this thing is pretty useless to me right now since that is pretty lame compared to 5.1 native audio. Be warned that if you are thinking about this device for Plex or any other 3rd Party apps the developers will probably need to update their programs to support it.Netflix does support 5.1 audio. And native amazon video works well and is fast thanks to the ASAP tech. But be warned that Prime video takes a back seat to paid content. Seeing that Prime is already paid for and guaranteed amount per year for Amazon they really should make it a priority for the accounts that have it.  Also they have not cleaned the UI when it comes to Multi Season shows as they still show up as separate seasons to give the illusion that there is more on Amazon then there actually is. While you can access all seasons from within any other they need to stop this practice.", "verified": true, "helpfulness": "4/6", "author": "Tim Tringle \"Home Theater Junkie\""}, {"rating": 3.0, "review": "I have a Ps4, and Xbox One, a current gen Apple TV, an ipad air, and an iphone 5sWhat does this give me that I don't already have? My Apple TV can stream anything I want. I can open amazon video on my ipad and airplay to my tv via my apple TV... EVERYTHING this box does, I can already doI guess it'd be useful for:people who don't have an xbox or a playstation (cuz if you do, you can play all the games this thing can and watch all the video stuff this thing can)The only reason I have an apple TV is that an apple TV required to play back apple protected content... however, you can get around this issue with amazon with airplay. So you don't need anything amazon to watch amazon video on your TV using pure apple devices.... and since an Xbox or PS can play amazon video... I come back to.. what's the point of this device?... only answer: unless you don't have a gaming console, and don't have apple content to play", "verified": true, "helpfulness": "1/10", "author": "David Dutton"}, {"rating": 3.0, "review": "After spending one evening with Fire TV, I have the following opinions:What I like:  1) very quick and responsive device and 2) voice searching is quick and works wellWhat I don't like:  1) no subtitle/closed caption for movies 2) Amazon Prime videos are not in a category by themselves 3) voice searching seems to be usable only for Amazon's videos 3) Netflix app has very unfriendly user feel (e.g., hard to find where to search for movies and voice searching does NOT work with Netflix videos 4) TuneIn Radio app's searching interface is not intuitive and is confusing.I have the first gen. Apple TV and Roku streaming device.  I also have Sony PS3 game console and a Panasonic Blu-ray DVD play that also can play Netflix videos, etc.  Fire TV is a lot faster than the other older streaming devices.I'll update my review when we receive gamer controllers.", "verified": true, "helpfulness": "1/2", "author": "Luan C. Do"}, {"rating": 4.0, "review": "I sometimes find overall ratings difficult to give and this is one of those times.  Later in this review I will explain the 4 instead of a 5 rating. These features rate a 5.  I have a Roku and it took me about five seconds to add a FireTV to my cart on the day it was first offered.  The Roku  works fine but Roku customer service is about the worse that I have ever encountered.  For me, Amazon Customer Service is the  gold standard that I compare the Customer Service of all other companies to. What was in the box was a FireTV streaming tv device and Amazon Customer Service. I am a 73 year old tech dimwit and even I had no trouble hooking this up.  My tv is a four year old Samsung which has two HDMI ports. I use one port for my dvd player and one port for my streaming device. It was; put the batteries in the remote, remove the Roku, plug, plug, plug, plug and I was done.  The tv picture clarity is incredible.  I have never had this beautiful a picture on my tv.  The remote is easy to use.  And, wonder of wonders, the voice feature works.  I speak slowly and distinctly and up comes the content I have requested (if it is available) on the screen. I did think to myself, \"You do know that you are talking to your tv.\"  I figure that is only a problem if the tv starts talking back. Now the reason for the 4. This may be particular to me but I suspect that it is not.  On my Roku I had two Amazon channels; Amazon Prime and Amazon Cloudplayer.  On the FireTV I only need three channels.  The other channels are nice to have but from my point of view not absolutely necessary.  The three channels I need are: Amazon Prime (no problem), Netflix (no problem) and Amazon Cloudplayer (problem).  For me to access my Amazon music library in my cloud (as I did on my Roku) I have to have Amazon's competitor's device.  I am hoping that Amazon has given correcting this oversight top priority. As for me, I won't be buying any Amazon music until I can play my purchases on my tv via my FireTv,  I hope that this is very soon. When this happens this 4 rating becomes a 5.  Since you have read this far in my review you are seriously  trying to decide to buy or not buy a FireTv.  My recommendation is buy.  Respectfully, John W Miller Jr.", "verified": true, "helpfulness": "6/6", "author": "John Miller"}, {"rating": 4.0, "review": "This is one well package item excuse the punIt's does everything it says  the remote Fitz nice and comfortable into your hands.Only draw back mine did not come pre program that's the only reason it gets 4 stars", "verified": true, "helpfulness": "0/0", "author": "Flyingkiwi"}, {"rating": 5.0, "review": "AMAZON Never ceases to amaze me :)I only stumbled across this yesterday and I've been reading as much as my brain could absorb!With that being said, I guess I just have one question....if you've already purchased a game (ie, Minecraft pe) and its in your kindle content, do you need to repurchase or can you just access it from Amazon Fire TV??Any help is greatly appreciated :)", "verified": true, "helpfulness": "1/10", "author": "Cathy Alfiche \"Birdiegirl\""}, {"rating": 1.0, "review": "Amazon want us to pay $99 for a device that jams their content down our throats? Fat chance. There are many devices that are better, provide more content variety and are cheaper. The only thing  that Amazon Fire TV does is diminish the Amazon brand in this buyer's eyes. I may consider converting to a different platform for my purchasing and reading needs. Boo Amazon.", "verified": false, "helpfulness": "12/79", "author": "Bill Horton \"Spacey Bill\""}]