[{"rating": 5.0, "review": "LOVE.  Can't write anything negative about this product.  My favorite part are the Gary Busey commercials!", "verified": true, "helpfulness": "0/1", "author": "Margaret A. Weber \"beartrap1\""}, {"rating": 5.0, "review": "It is an awesome piece of electronics that was no problem at all to install and begin using.  We are mid-fifties and NOT electronically-savvy.  While we love using it as a movie library of sorts, we can't quite wrap our heads around ditching the cable/satellite.  It requires a different way of thinking about TV watching which is taking some learning for these old dogs!", "verified": true, "helpfulness": "0/1", "author": "My Two Cents \"Sue\""}, {"rating": 5.0, "review": "i love it !!!", "verified": true, "helpfulness": "0/1", "author": "german"}, {"rating": 5.0, "review": "Easy to use,nice selections clear picture", "verified": true, "helpfulness": "0/1", "author": "RM Carver"}, {"rating": 1.0, "review": "My remote quit working after 2 weeks.How can I get it fixed?Linda Edvenson-Klauer650-743-5177", "verified": true, "helpfulness": "0/2", "author": "Linda Edvenson"}, {"rating": 5.0, "review": "Love Amazon fire don't know how we lived without it!", "verified": true, "helpfulness": "0/1", "author": "Erin P."}, {"rating": 4.0, "review": "Its Good.", "verified": true, "helpfulness": "0/1", "author": "Deepak Sahoo"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/1", "author": "Melvin"}, {"rating": 1.0, "review": "This is my third Amazon Fire product (I tried two Amazon Fire Sticks first). Let me preface this review by saying I have a Bachelor's degree in Computer Science, and am currently working on my Master's degree, so I am no stranger to technology. I have the fastest Internet in my area, with download speeds consistently over 50Mbps. I primarily use Hulu Plus on the Fire TV. But I've ran into the exact same problems with both Fire Sticks and now the Fire TV. It will work fine for awhile, and then freeze in the middle of a program. Sometimes the audio will continue to play, while the picture is frozen. Sometimes, when returning from an ad, the audio on my show will play, and the picture will be black. There is no reason for this. I even took the drastic step of moving my router and modem next to the Fire TV, so I could give it a wired ethernet connection. It didn't help one bit. I love the idea of the Fire Stick and Fire TV, but there are some serious problems with both. With the frustration that they have caused me, I regret ever buying one.", "verified": true, "helpfulness": "1/3", "author": "Heather Catlett"}, {"rating": 5.0, "review": "Cheap and great for us poor folks who can't spend a mint on entertainment.", "verified": true, "helpfulness": "0/1", "author": "rosslyn lyons"}]