[{"rating": 5.0, "review": "We love it We're able to get all kinds of films.  Ones we never thought to be available", "verified": true, "helpfulness": "0/0", "author": "joyce h murphy"}, {"rating": 5.0, "review": "This was one of the best purchases I've made in a while.  I've only had it for a couple weeks but so far I'm enjoying some of the TV programs you can't get on regular TV, even with DISH's top viewing package (but without all the expensive add-on channels). It is clear, high quality picture and sound in a small unobtrusive gadget which takes very little room at your TV set.  Absolutely well worth the price from Amazon, with features that can't be found on other similar products.  I haven't tried the Voice Search yet because there is so much programming to choose from with my Amazon Prime that I haven't had to search for something else yet.  I highly recommend Amazon Fire TV for your TV entertainment.", "verified": true, "helpfulness": "0/0", "author": "Ladyored"}, {"rating": 5.0, "review": "Cut the wire! this is good stuff and the speed of the system is way better than anything else we've tried.", "verified": true, "helpfulness": "0/0", "author": "BRAD MAYO"}, {"rating": 5.0, "review": "Easy and convenient and great picture quality", "verified": true, "helpfulness": "0/0", "author": "Rod Martinez"}, {"rating": 5.0, "review": "Product works great. I use this many for Apps and Prime Instant. got this device so we could watch sling from the TV. Very happy with the speed of the Fire TV flipping through apps and loading of the Apps once you have selected it", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "One step closer to cutting cable", "verified": true, "helpfulness": "0/0", "author": "yvonne johnson"}, {"rating": 5.0, "review": "Amazing. Easy to use, easy to install. I may buy one for each TV. The remote is great!", "verified": true, "helpfulness": "0/0", "author": "Patricia Rivero"}, {"rating": 5.0, "review": "Everything in one place", "verified": true, "helpfulness": "0/0", "author": "Rick Grimes"}, {"rating": 5.0, "review": "Works great out of the box.  Hooked up to Wi-Fi without any issues. Offers a lot of app choices. The voice search is also g really convenient. Very happy with the amazon fire tv. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer larryeo"}, {"rating": 5.0, "review": "wish I had gotten 2 I really enjoy it", "verified": true, "helpfulness": "0/0", "author": "Anna Carr"}]