[{"rating": 5.0, "review": "this unit is easy to set up and easy to use. it works great. I recommend this unit to anyone who streams entertainment.", "verified": true, "helpfulness": "0/0", "author": "gary b."}, {"rating": 5.0, "review": "Easy to setup, voice search really works, love it. I prefer this to Apple Tv or Roku. Very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "plumonthego"}, {"rating": 2.0, "review": "The selections are limited.  I hope that Amazon Fire TV becomes a disruptive product to NetFlix and Google offerings.  Further growth  in offerings perhaps in \"how to\" or \"learning areas\", film festival movies, classic movies, and more stock market-info on the economy would be potential growth areas", "verified": true, "helpfulness": "1/5", "author": "Ronald J Zybura"}, {"rating": 4.0, "review": "Overall it is a great device. Very easy to use.Only mild dislike is that you have to use two remotes to operate it; you need your TV remote to adjust the volume and to select your HDMI input, A \"universal\" Amazon Fire TV remote would make  this device ideal!", "verified": true, "helpfulness": "2/2", "author": "William T. Bailey"}, {"rating": 3.0, "review": "Easy to navigateGood with HD streamingNeed to add more Channels.No News Channels; Very Important!Overall Score 65%", "verified": true, "helpfulness": "2/4", "author": "Nkiru"}, {"rating": 5.0, "review": "Just the voice search alone is reason enough to ditch my Apple TV, we'll see what they come up with to compete. IMO, this is the best streaming box so far. Very fast, love the voice search, easy navigation, plenty of apps and streaming options, and an easier remote to use than Apple's minimalist version, IMO. Selling my Roku, also.", "verified": true, "helpfulness": "0/0", "author": "John Bowman"}, {"rating": 4.0, "review": "these are initial impressions and i will share some more thoughts as i use it more.when i opened the box it felt exactly like apple tv.the packaging even the way the remote was kept in the the box , the black finish and the look of ports behind everything felt  exactly like apple tv.speed and performance is phenomenal.i selected a 24 redemption from amazon prime it played instantly even faster than a local dvd.so the hardware is very zippy and fast.one complaint is the audio output was not 5.1 and it was stereo.so need to check that.not sure whether it was this video . i also tried valkyire movie from prime and audio output still showed stereo.thats the complaint.with roku never had this problem.", "verified": true, "helpfulness": "2/2", "author": "Hari"}, {"rating": 1.0, "review": "My friends just purchased this. So before I was going to purchase it I asked them if I could play with it for a while. After a glass of wine I kicked back and I played with it. I have invested so much money in Push2TV, Google's Chromecast, etc. I am not willing to put another dime into one of these so-called remote viewing products.  This is a Kindle fire on your TV using a remote control. That's it.  This is something that will be easily replaced in a couple months by Another gadget. It is not perfected by any means. I for one cannot be throwing around $99. So, after playing with this for awhile, I have come up with a most sincere conclusion that it is not worth $99 and I'd rather keep my money. I absolutely love technology and new fangled items on the market but this is a waste of money. There are other options out there that are just as good if not better And cost a lot less. I would wait until Kindle comes out with something else. This is not worth the money.", "verified": false, "helpfulness": "6/35", "author": "Gizmo"}, {"rating": 3.0, "review": "This is a very preliminary review as I just started using it.As a Prime member and not a heavy TV watcher seriously considering cutting the TV part of my cable bill I decided to give it a try. I have one Smart TV which already have access to Amazon, Netflix and many other apps but I also have a non-smart HD TV in my bedroom and given my light TV viewing habits I refuse to pay Comcast for another box when I already feel cheated paying for the service which I only keep because of bad over the air reception of local channels. I figure Fire TV will put that TV to use.The Good: The user interface, including voice search is a huge improvement over the typical smart TV and better than similar devices (Apple TV, Chromecast, Roku) which I don't have but I have seen in use many times at friends houses). Voice search seems to have some trouble understanding me but I have a heavy Cuban accent so I don't hold it against it, on the bright side it might help me improve my pronunciation, anyway be mindful of it if you are not a native English speaker.As of the hardware the box is really light and small, almost invisible and the addition of a optical audio (toslink) to connect to older AV receivers is welcome.The \"improvement expected\": Apps are very limited, even in comparison with a typical smart TV and even Amazon Fire tablets. I fully expect this issue to change over time. What it is most amazing and unforgivable is that the Amazon Cloud player is not available yet. I have the paid version of this great service and I have most of my music uploaded to it. I hope Amazon will soon make it available on Fire TV as it is in any other Android, Windows and Apple device.The Bad: No way to turn off the box except by unplugging the power. Yes, it goes to sleep after 30 minutes and the power consumption is probably very low but my concern is more with broadband consumption and security. Every piece of equipment connected to the Internet have security vulnerabilities, add a microphone (in the remote) and I could get uncomfortable. I hope a firmware update add a turn off option soon which I bet will be less harsh on the hardware that constant physical powering off.", "verified": true, "helpfulness": "2/3", "author": "rafter94"}, {"rating": 3.0, "review": "It runs so much faster then the other two. The only thing I notice well you are watching a show it freezes a lot. So amazon if you can work on that. And also when you voice search it should search Netflix and Hulu to not just your stuff. Because I still buy a lot of movies from you. So don't be so greedy.", "verified": true, "helpfulness": "1/2", "author": "Jamie Ferguson"}]