[{"rating": 5.0, "review": "Works great! Looks great! Connected via Ethernet , no issues so far. Will cancell add on STB with Verizon. Still on the learning curve on how to's and on what's available on menu.", "verified": true, "helpfulness": "0/0", "author": "Poljb016"}, {"rating": 5.0, "review": "Get one.  You will love the power", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "Voice search is impressive.", "verified": true, "helpfulness": "0/0", "author": "AA1234"}, {"rating": 5.0, "review": "I got it for my husband as a Christmas gift...& we ALL enjoy watching movies & shows together!!!", "verified": true, "helpfulness": "0/0", "author": "samantha"}, {"rating": 5.0, "review": "Fire TV was delivered on schedule and took about 10 minutes to set up. Very simple procedure. Batteries included. First screen was a basic intro about how to use the remote and move around the screen. That was helpful. The voice search works great - so far it is correct 20 out of 20 tries. Building a watch list (from the Kindle) and there it is on Fire TV. No issues with streaming videos at all. Everything plays immediately, without delays or buffering. It is very intuitive yet simple to use. I can recommend Fire TV, especially to those who are not tech savvy at all, as a simple, straightforward way to enjoy movies or TV episodes.", "verified": true, "helpfulness": "0/0", "author": "Kenneth E."}, {"rating": 5.0, "review": "Works Great and easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I hooked up my amazon fire tv tonight and was impressed by the library of movies and tv shows available, with very simple navigation.  I activated my 30 day trial of amazon prime and realize I only have access to a portion of videos and tv shows.  Im really disappointed!  I was planning on cancelling my Netflix and using only this video service.  How does Amazon really expect someone to pay $2.99 to watch a single episode of a tv show that is over 5 years old?  It would cost my wife $19.99-$29.99 to watch 1 old season of Grays Anatomy.  Netflix has 10 seasons available for FREE with its $7.99/month service, but to watch 10 seasons through this service it would cost $250!!!! + the $99 annual fee! Its absurd.  I had already told several family members about the large database of video content available but now I will be telling them all it is a SCAM.  From here forward I will only be using this device to access my Netflix account which is not riddled with hidden fees.", "verified": false, "helpfulness": "3/5", "author": "Tim Wildrick"}, {"rating": 4.0, "review": "works well, with amazon prime, not as much free stuff on prime as I'd like, hardly any Free Christmas movies.  I  just don't like that I can't use my phone to stream my netflix, you Can  log onto netflix, but you are only allowed three devices on one netflix account, so I use chromecast to stream netflix from my phone, which counts as one device onto all different tvs in my house, you can do on chromecast, can't do that on amazon fire, so not thrilled with amazon fire. But it works well with anything you log on to, or prime.", "verified": true, "helpfulness": "0/0", "author": "Barbie doll 7"}, {"rating": 2.0, "review": "Ok so the Fire TV is great but the remote is horrible. It drains your batteries in less than 24 hours. In 4 days I've had to replace the batteries 4 times. So I called up customer service to get this remote replaced. And for some reason all of their customer service reps are foreigners that speak terrible English. Do you know how painful it is to be on the phone for 30 minutes with someone that can't speak English? I had these reps repeat everything they said at least 10 times. It is THAT bad.Long story short, I refuse to deal with bad customer service. Amazon has worse customer service than Comcast and that's REALLY hard to beat. So what I'm doing now is keeping the remote and just removing the batteries whenever I'm done with it. It's a hassle but Amazon Customer Service is MUCH more of a hassle.Amazon - get rid of your foreign customer service reps. They can't speak ANY english worth understanding. It's a shame.", "verified": true, "helpfulness": "1/3", "author": "J. terry \"oscarkool\""}, {"rating": 5.0, "review": "Amazon, in my opinion, has always put out a fantastic product. The Amazon Fire TV is the best device I have encountered! The voice search and recognition is unbelievably clear and wonderful, kudos to the computational linguistics department on this one, this is one reason why I purchased one for myself. This product is extremely easy to set up and operate. I was very confused by the \"constructive\" criticism/reviews this got. So far my experience with it has been nothing but pleasent, as well as my other amazon purchases, it is easy to use and even my 4 year old nephew can use it with ease (well, as well as a 4 year old can use something like this) It is true, you cannot search by just Prime movie/shows - atleast not that I have figured out yet - but that is the only thing I think they could add and to me that feature isn't that important. I'm very impressed and I still cannot get over how well the voice recognition is. I would definitely recomend this to a family member/friend, in fact I already have. As much as I love this device I will say if you already have a Roku, Chromecast, or Apple TV and it is not in your budget or the speech to text isn't important to you then other devices will certainly do the trick but if it is in your budget and speech to text is important this is most definitely the device for you!", "verified": true, "helpfulness": "0/0", "author": "Amanda.m.t"}]