[{"rating": 1.0, "review": "There's already a ton of ways to access Amazon prime. Most TVs have Amazon prime by default, as do Blu-Ray players, Roku, game consoles, computers, tablets, etc... And if their presentation on voice search includes a reference to Alpha House they've really lost me. That show is terribad. Complete and utter waste of time, talent and resources. Xbox One voice search is way more comprehensive, searching all possible media sources.", "verified": false, "helpfulness": "8/69", "author": "Ralph T Sacco"}, {"rating": 5.0, "review": "This device has made my life easier! Whats not to like?  I was so tired of having to go through countless steps, devices (PC, Wii,) and remotes in order to watch or switch from Netflix, Amazon Prime, and Direct TV.  This has made it seamless and simple. It has turned my TV into a giant Kindle Fire, and being a huge fan of Kindle Fires I couldn't be happier.", "verified": true, "helpfulness": "4/5", "author": "wandr"}, {"rating": 3.0, "review": "Update to review below:After several reboots and finally a factory reset of the box, I'm able to stream Amazon video now.  I've upgraded my review from 2 to 3 stars.  I'll likely hang onto the box because I think it has potential.Pluses: Fast loading of videos, voice search (for Amazon content), Game controllerNegatives:  Remote that doesn't play nice with universal remotes (yes, I know it's bluetooth, and I knew that going in.  But it would be nice since it has to coexist with all of the other gear), Voice search limited provider usability, limited storage (I expect that with a few games, I'll have to start \"managing\" the space), limited service providers (I expect more to be added)============================================================================I ordered this on Wednesday, received it on Friday, and have spent about 10 hours with it thus far.  I already own a Roku3, Xbox1, Chromecast, web-connected blu-ray, etc (I'm a gadget junkie).Hook-up was pretty straight-forward, about what I expected.  I'm using a wired network connection.Straight-away the box needed a software update that took about 20 minutes, even over a wired gigabit network.  After that I proceeded to play around with the Fire TV.The interface isn't anything special...how many ways can you display tiles?  The remote is responsive, but I wish I could utilize my Harmony Ultimate with the Fire TV.  I know that the voice search would not be possible with the Harmony.  I'm not basing my review on that...I knew I couldn't when I ordered the Fire TV.I downloaded the car racing game and was a bit surprised to see that it will require a good chunk of the unit's storage capability.  You won't be downloading a lot of game onto this without having to start \"managing\" the space.The deal-breaker for me is that most of the videos I select (Amazon Prime) are freezing.  I don't mean stuttering, I mean stopped.  Won't play, I often get the studio splash screen and then it will skip a few seconds/minutes into the movie.  Then it stops again.  It will freeze for so long that the screensaver comes on.As I said earlier, I have a Roku3 and Xbox1.  To check that it isn't my network, I attempted to watch a couple of them using those boxes.  I encountered NO problems streaming Amazon Prime content.I wanted to like the Fire TV, but unless this streaming issue is resolved, it's just a paperweight.", "verified": true, "helpfulness": "4/8", "author": "C. Morgan"}, {"rating": 5.0, "review": "This is like going from dial up internet to broadband. It doesn't seem like that big of a deal until you start using it and realize what you have been missing. This device is all about speed and quality.", "verified": true, "helpfulness": "6/6", "author": "P. Meyers"}, {"rating": 1.0, "review": "Its a little misleading when a company does a comparison to other products but doesn't give the whole story. They skew the chart to read that they do EVERYTHING and the others do some. when in fact they don't mention what the others do that they don't. It's a bit shady (and by a bit I mean a lot) I expected more from amazon. This is just another  google tv incident waiting to happen.It only does streaming there is no way for you to play your own files and music though it.So it does voice command well (so they claim) It's a gimmick at best.I can get amazon streaming on any of my other devices.But If I cant stream my own content then this is useless.With the average user only having so many inputs on their TV/receiver, why do you need a box that is limited to only a few things that others can do and more.Yes you could hack this box to add functionality but its underpowered to handle the other content.Streaming HD video will choke while my apple tv handles it flawlessly.Everyone is trying to knock apple of the king of the hill and the Roku comes close. But no one touches the ecosystem integration like apple does.And the Apple tv is only a hobby to apple and they still sold over 20 million boxes.Amazon if you are going to come late to the game you should be crushing all of your competition in all areas not just some.If you want me to pay the same price for your box as an appletv then you should offer all the same features not just a small subset of them.If this box was 49 bucks maybe but at 100 when I can get the same thing from other sources? Not likely.The only thing this box has over the apple tv is amazon instant video and to be honest Netflix has a better service as far as video goes. The fact that amazon prime members get instant video thrown in is a great business model in this day and age but the front end is horrible. searching and saving content is a little discombobulated.Sorry amazon I had high hopes for you your box will be relegated to a niche market.But for a lot of people who already have another way to watch amazon video this box doesn't add any value.Recap-No streaming of your own video/music/picsLimited music stream (ie  NO Spotify -which is the hottest music streaming service) pandora? meh who caresother devices that support amazon streaming? Roku,ps3/4, xbox, a meriad of internet enabled tv's, Tivo, some bluray players etc the list goes on. all of these devices offer multiple uses. The fire tv is a one trick pony. and maybe it does that trick really well but with the economy the way it is and consumers making smart purchases I think they would want to spend their money on something they can get multiple uses out of.Back to the drawing board amazon.", "verified": false, "helpfulness": "12/62", "author": "Stephen Greco"}, {"rating": 3.0, "review": "I was really hoping this would search across Amazon, Netflix, and Hulu. Unfortunately, it doesn't.As mentioned in other reviews, the rest is great. It's fast, voice search actually works, and it's very simple to set up. For me, however, search not working across the three major providers is a deal breaker. I don't want to open three different apps to see if the show I want to watch is in any of them.Once this gets sorted, I plan on getting rid of cable TV. Sadly, it seems I need to stick with cable for a bit longer. Amazon Fire TV is not yet intuitive enough for my whole family to use it.", "verified": true, "helpfulness": "3/7", "author": "inbruCHes"}, {"rating": 5.0, "review": "The Fire is not the first in the market, that's for sure. Roku has defined the category and others have come along.  Smart TVs and Blu-Ray players join in with similar offerings as do the XBox and Playstation models.I have a Blu-Ray and XBox that has such features, but I've been looking at other options for a while. When the Fire TV was announced I jumped at it.  I'm not an early adopter for most products. I like to let other people test items and I only buy when I need something, not to get the newest shiny thing.  So, I took a risk here. I'm glad I did.Fairly small, low profile, with a single light blue light showing it's on.  Blends right into my television (46\" Samsung) stand.  The new Roku HDMI stick obviously is even smaller and less obtrusive. Still, I'm glad I got the Fire.A big reason is the remote. It really works. Simple in overall design and somewhat sparse in buttons, the latter might otherwise be a frustration except for the fact the voice command really works.  I have the Kinect and it was always frustrating, ending up being easier to just navigate with the controller. The Fire TV software picks up every word without a mistake so far.  Really impressive.I'm an Amazon Prime member going back to the earliest days of the program, and we buy almost all of our non-grocery items through Amazon.  So, I'm already in the Amazon orbit and love how nicely this integrates with that.  Just as important, it has the Plex app which very nicely integrates with my desktop and media server, so I have very easy access to all my music, movies, pictures, etc.  Works absolutely perfect for me, which leads towards my future cutting off of cable in our house.Another nice feature is the instant-on.  I don't remember reading about this feature, but when I touch a button on my remote, the Fire TV is instantly ready to go and switches the TV to the right input. That's a huge step from the other tools I've had which always take time to load each step.Games? I've not a lot of experience here (my controller is coming Monday) with the Fire. It plays Android based games, though only a small number are compatible with the Fire so far. I expect that will change.  Obviously a HDTV has different demands for graphics than a small phone or tablet.  Some games I have one my Tab 2 are compatible and I am able to play them on both the Fire and my tablet.In a way, this is a bit like the mirror image of the XBox or Playstation. It's a media player primarily with game features secondarily.  With that in mind, this isn't just competing with the Roku or others, but is after something more: the casual gamers who might want gaming access but aren't so serious about it to shell out the cost of a new system or expensive games.For me, this is perfect. I'm a casual gamer with a deep connection to the Amazon system already.  The remote makes for a simplified user experience.  I couldn't be more pleased and I look forward to the expanding library of apps and games that will help this be a valuable media tool for a long while.", "verified": true, "helpfulness": "6/6", "author": "Patrick O \"A lover of truth, beauty, and occasionally silliness\""}, {"rating": 2.0, "review": "New Edit:I must say how utterly rubbish the parental control feature is.  Once enabled with a PIN, the PIN is validated ONLINE!I lost network connectivity on the unit, and in order to get into Network Settings panel, you guessed it, I must provide valid PIN.PIN cannot be validated because there is no network connectivity -> Pls try again later.Really?  I hope someone gets shot in the kneecap.--I use Plex at home.  The Fire TV native \"home screen\" is heavily borrowed from Plex, so the familiarity is there.The Plex App is the Google Android version.  FireTV reports its DLNA version as Android 4.2.2.When using Plex for high bitrate MKV playback (Bluray backups) over  wired ethernet, forcing Direct Play in the Plex profile and making Plex Server use DLNA to transfer the MKV file makes the FireTV not work at all.When using the Android profile, but using \"Maximum Quality\" setting (making Plex transcoder use the -vcodec copy  flag) makes the FireTV bog on a frame and unable to playback reliably.When using the highest bitrate available (20Mbps 1080p) , the Plex transcoder uses the flags:-vcodec libx264 -crf 18 -maxrate 20000k  and playback is flawless.Despite enabling DD+ in both Fire TV and  Plex audio profile, I am unable to get anything like AC3, DTS, DD+ to work on my setup.By comparison, I also use the Plex app for Samsung SmartTV, and I am able to playback MKV natively with full audio and codec support.As long as FireTV is unable to do native MKV playback, it'll be a 2 star product.", "verified": true, "helpfulness": "18/22", "author": "NicolasS"}, {"rating": 4.0, "review": "I am the prime target for this product. I live in Amazon's ecosystem, own a Fire HDX, and I'm a cord cutter. I have 2 rokus at home right now, a 3 and a 2. The main reason for my purchase? Speed and games.Games look great and play well. Unfortunately the controller I ordered won't ship for a few weeks so I can't comment on that yet. This brings up the theme of this product. It's good! Now if it would just do.... than it would be great. The games are good, when it gets some higher tier stuff it'll be great.Search using the voice control on the remote is good. It doesn't do universal search. Meaning search doesn't pull up results from netflix or many other apps. Make no mistake, it will someday, but not yet. Again, good not great.Speed. Here's a winner! Super fast, much faster than even the high end roku 3. Also apps (hulu, netflix) remain loaded. Meaning an accidental home button press doesn't reset the app, you just clock on the app and pickup where you left off.Apps are more than games and videos. There's some great food apps for example. Not as many apps as roku obviously but the quality is better. Good not great.Missing some important things. Hbo go, pbs, spotify, and more, but these will certainly come. Good not great.Remote and second screen stuff is a disappointment. I have a Fire HDX and mirroring doesn't work. Period. There are some second screen options but truthfully it's not very good. Hope it improves.This thing has the chance to be the best steamer out there. Fire now it's still just good not great.", "verified": true, "helpfulness": "2/2", "author": "Scott Hicok"}, {"rating": 4.0, "review": "I've enjoyed playing around with the unit for the last 24 hours and installing a myriad of apps. It's a very responsive unit, much quicker and my Apple TV.-The hit feature is definitely the voice search capability.-I've noticed that the volume output varies greatly from one app to another, and would like to see that fixed.-The screensaver is nice but I would like the option of going to a black screen mode after a selected period of time.I understand that it's an Amazon based unit, but it seems as though almost everything that you select has a price attached to it.... Even if that particular selection has a free offering. That's more than a bit annoying.", "verified": true, "helpfulness": "2/2", "author": "Gottafly"}]