[{"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Angela Grunwald"}, {"rating": 4.0, "review": "Works well good sound and picture quality. Voice search works very well. Not as much content as Roku as a down side.  But hopefully Amazon will add more. Competitive pricing. Can't go to far wrong.", "verified": true, "helpfulness": "0/0", "author": "Cool T"}, {"rating": 5.0, "review": "Product is exactly (maybe even more so) than described/expected.  I'm completely satisfied and will recommend to future potential buyers.", "verified": true, "helpfulness": "0/0", "author": "Victoria A. Amador \"Ms Math Teacher\""}, {"rating": 5.0, "review": "I bought this so I could easily have all my shows and digital content while on the road. Its a lot easier to travel with than my PS3. I found it very easy to get used to and a great price.", "verified": true, "helpfulness": "0/0", "author": "Dustin Easton"}, {"rating": 5.0, "review": "Working just great. Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Robert M. Caya"}, {"rating": 5.0, "review": "If you have kids this is for you.  My son loves this thing. He is two and I get all of his shows on prime!!!  I want one for my other TV's now. Do yourself a favor a get the mount and a hdmi cable.  You can set it up instantly!!", "verified": true, "helpfulness": "0/0", "author": "Gunit69"}, {"rating": 4.0, "review": "The Fire TV is what I expected it's and what I wanted", "verified": true, "helpfulness": "0/0", "author": "Francis Kaneko"}, {"rating": 5.0, "review": "Awesome love it. Would recommend it to my friends. Love that you can also watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "Arne Skatrud"}, {"rating": 5.0, "review": "Love love love it!!", "verified": true, "helpfulness": "0/0", "author": "amanda tarbuck"}, {"rating": 5.0, "review": "Works very well, and it has the added bonus of the integration with Amazon prime movies. The only negative I can come up with is that if you have an accent it sometimes does not recognize what you say and you have to repeat it a few times. Apart from this small thing, I love it!!", "verified": true, "helpfulness": "0/0", "author": "Alex \"Ariezona\""}]