[{"rating": 5.0, "review": "Easy to use..", "verified": true, "helpfulness": "0/0", "author": "tanya foster"}, {"rating": 4.0, "review": "I bought one of the fire tcs when they first came out. I was pretty excited about it but I have so many streaming players it doesnt get used much. I do like the remote a lot. I have been trying to inquire if there was a trade in program to sell it back to amazon for amazon credit on my account or not but could not find where to inquire about this. Does anyone know?", "verified": true, "helpfulness": "0/0", "author": "Carol Price"}, {"rating": 4.0, "review": "Good product. Easy to use", "verified": true, "helpfulness": "0/0", "author": "Beatriz V. Noriega"}, {"rating": 5.0, "review": "I'm really happy with this product. I was very skeptical when we ditched cable for online only. This made that transition a breeze.Amazon can do a better job with organizing their prime (that you pay for) and prime (thats included) better. Otherwise, great product.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Marin"}, {"rating": 4.0, "review": "meets expectations - good product and easy to use.", "verified": true, "helpfulness": "0/0", "author": "djh-tx"}, {"rating": 5.0, "review": "Excellent addition to my entertainment center!", "verified": true, "helpfulness": "0/0", "author": "Nutkinz"}, {"rating": 4.0, "review": "Not as many apps that are usable for me as I had hoped, but it greatly improved my experience of watching tv on my smart tv. Worth the price and I'm glad I went with an amazon produce because interacting with amazon prime is easy and fast. Very little \"buffering\" time (almost never). fast and easy to use interface.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "When I first got my Amazon Fire TV box, I gave it a Five Star review.  After spending some time with it and much consideration, I have decided to downgrade it to Four Stars.  I have retained a lot of the original review here and made a few changes.  Read On:I never thought I would be giving up my Roku so soon.  I got the Roku just over a year ago and I've enjoyed that, but was frustrated by some of its limitations. Amazon fire TV has addressed those limitations with this device.  One such limitation was the digital output to my receiver.  It is an older receiver that uses the first generation HDMI connection that does not include audio.  I was able to find an HDMI to SPDIF converter to correct that.  With the Amazon box, this is covered.Another minor issue with the Roku was with the Amazon Music feature.  The app for that allows for music that I have purchased through Amazon that is \"played from the cloud\", but not from the Amazon Prime service.  Everything now plays from the Fire TV box and it sounds great.  Videos and games look great too!  Not that the Roku was a slouch.  The Fire TV box just fits my system better.Customer service/tech support, at the time of this writing, is excellent.  I had a problem with streaming music (songs abruptly stopping mid-song).  I used the \"Contact Us\" feature and was guided to a chat program with someone at customer service where I was allowed to describe my problem and try to find a fix.  Now, I'm not sure if the representative on the other end of the chat actually understood the specifics, but he made a respectable attempt and assured me that he would \"escalate\" the problem up the ladder to his department head.  As far as I can tell, the problem is fixed.  I'm still monitoring it, but at least I know I can bring the problem back up to Service/tech support should the need arise.One more little nuisance that happens:  When I am listening to music, I turn the TV off and my music pauses.  It is connected via HDMI to the Amazon Fire box.  Unlike other AV connections, HDMI is a two-way street.  When I turn the TV off, it sends a signal to pause the music.  I don't listen to music through the TV!  This is all a matter of coding, so I think this could be fixed with an update, and I hope that will happen, as it is frustrating, especially when I have to turn the TV back on and then off, due to the problem previously mentioned in the paragraph before this one.A WORD ABOUT AMAZON PRIME AND AMAZON INSTANT VIDEO:Since there really isn't a place to review Amazon Prime here, I will say a few things about that.  First, the Amazon Fire TV box is perfect if you are a Prime member, or are thinking of getting a membership.  Improvements that have been mentioned on other reviews were taken into consideration and Amazon acted upon those recommendations and addressed those concerns.  That is good customer service.  The result is that the offerings  for Prime videos are in separate categories from the purchase/pay-per-view items.  Not for recommendations though, so you still have to look out for that.  Use the PIN option and you won't accidentally purchase a movie that you just wanted to preview.Now as far as availability of titles, Amazon could do a little better job.  There is a LOT available though, and not just a bunch of crappy old B movies from the 1950s.  Where they could improve is by letting all the old TV shows from the 90s and earlier go to the Prime service.  I can't imagine anyone wanting to pay $1.99 an episode for some of these old TV series.  I am also reluctant to pay $5.99 for newer releases and would only do so on the rare occasion that \"I must see this now!\" happens.  I would gladly pay $1.99 to rent some new titles because that is competitive with the rental store that is still in operation down the street.  I'm not sure how all this stuff is negotiated, but there is room for improvement in this regard.One such improvement and something of an annoyance:  Have you ever looked for a movie, you find the sequel, available on Prime (Yay!), but not the original?  Try it.  Hunger games sequel? Yes. Original? No There are more examples, even old movies like Kiss the Girls.  Along Came A Spider is on Prime, but not the moldy old first one?  It gets worse, but I'll let you discover how.I have been enjoying the Amazon Prime Music service.  Once again there is a lot of music available, but some glaring omissions from the catalog of available artists and tunes.  No Beatles, Led Zeppelin, David Bowie, and the list goes on.  And of course, all of this is due to music licensing agreements that have to be made and a bunch of other corporate gobbly-de-goop.  Whatever...  I think anyone will still be able to find 5000 songs to put in your library and really, that is more than you will probably listen to in a year.  Just find what you like and enjoy.  I think if this were the primary reason to get Amazon Prime though, you would likely be disappointed and would find a better music streaming service elsewhere.One last thing about Amazon Prime Music that I do find quite disturbing, is the preponderance of re-recorded songs done by the original artists or some other stand-in vocalist.  Some of these tunes are from artists that had their \"heyday\" in the 80s and are still around some 30 years later.  There is a reason for doing this and I get that, but when I listen to these sub par versions of these songs, I just don't.  WHY?  A great example of this is Bang the Drum all Day by Todd Rundgren.  See my review here: The Very Best Of for a more detailed critique of this practice.  Another song that is ubiquitous here is Bette Davis Eyes by Kim Carnes.  What happens with these remakes is that the singer usually is just \"phoning in\" the vocal over a severely compromised music bed and they resemble the kind of music you might hear over a shopping mall loudspeaker system.  I haven't found one remake that I can say truly captures the sound of the original.That aside, I must recommend the Amazon Fire TV and Amazon Prime.  There is a lot to be enjoyed and much more to be discovered.  I haven't tried the photo option yet, but I will be soon.", "verified": true, "helpfulness": "0/0", "author": "E.Z. \"Reader\""}, {"rating": 3.0, "review": "what I do not like is finding out that Comcast and Amazon have some sort of licensing agreement which restricts us from viewing shows that are most recently aired on A& E and History channel.", "verified": true, "helpfulness": "0/2", "author": "opals"}, {"rating": 3.0, "review": "Pandora isn't good on this.  Constantly buffering, can't keep playing without me exiting and restarting.  Worked fine on my blue ray player that this replaced, and every other item in my house plays it fine, so it can't be my internet.  Pretty disappointed.  Would love some tech support, but don't see any available?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]