[{"rating": 5.0, "review": "Everything the discription said it would be!  The picture quality is better than the cable's HD, much clearer.  I will be getting rid of cable because of this , why spend all that money on cable when you STILL get commercials!", "verified": true, "helpfulness": "1/1", "author": "Sheila"}, {"rating": 1.0, "review": "I had it for 6 months and it stop working.. It  also does not have an on/off button...", "verified": true, "helpfulness": "1/4", "author": "ricky"}, {"rating": 5.0, "review": "Love the voice control! Very fast in pulling up whatever you're looking for. Great HD experience! Very impressive device that I will be using quite a bit for many years to come.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm learning my way around this.  It's pretty user friendly.  No regrets with my purchase.  I wish there was a was to separate programs that are free with Prime from programs you have to purchase.", "verified": true, "helpfulness": "0/0", "author": "jb"}, {"rating": 3.0, "review": "The picture is great but it does not work with my audio system.  I have to switch to the TV speakers in order to any sound when using it.  I returned the first one after calling for help and instructed to do so because we couldn't figure out why I was getting no sound. After the second one didn't work either, I just tried it with the TV speakers and it worked.  I guess my audio system is too old for this system.  Other than that, its fine.", "verified": true, "helpfulness": "1/2", "author": "Fred D. Heatherly Jr. \"Don Heatherly\""}, {"rating": 1.0, "review": "your products. sucks! it's not compatible with the TWC APP or XBMC. I took that s*** back to Bestbuy.If you can't make Compatible s***, then stay out of the game.", "verified": true, "helpfulness": "1/6", "author": "Mike Fisher"}, {"rating": 4.0, "review": "I cannot acivate the a&e; app or the history app because my tv provider is an antenna and I get the streaming over at&t;  wifi.At&t; is not offered as tv provider. I do like the fire tv except for activating these apps", "verified": true, "helpfulness": "0/0", "author": "mat"}, {"rating": 5.0, "review": "So easy to use and set up. I plugged it straight in with an Ethernet cable and works amazingly better than my wii. I love the voice feature can't believe technology 5 stars BooYah!!!", "verified": true, "helpfulness": "0/0", "author": "Patrick Hyde \"BooYah!!!\""}, {"rating": 5.0, "review": "Device really works great.  Have watched some movies without any problems.  Very satisfied with Fire TV product and especially with tech support from Amazon.  5 Stars", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works fine.", "verified": true, "helpfulness": "0/0", "author": "Mediatec \"MRL\""}]