[{"rating": 3.0, "review": "I prefer the Apple TV", "verified": true, "helpfulness": "0/8", "author": "Tom Anderson"}, {"rating": 5.0, "review": "Ok, this thing has changed my life.  We recently moved into a house that has a HDTV box and TV set up, but we didn't want to pay to connect the cable. We really only use Prime for all our viewing needs anyway (though my husband occasionally watches football).  This works out great for the kids to watch their shows, rent movies, and my husband can watch ESPN on the app.  And we sent pictures from our phone to the cloud and now when the TV is on we can watch pictures scroll as a screensaver.  It took less than 5 minutes to set up. WELL worth the small expense.", "verified": true, "helpfulness": "1/1", "author": "Beccaboney \"beccaboney\""}, {"rating": 1.0, "review": "No HBOGO, no USB or media player play back.  Lack of 3rd party apps.  This device seems like a great platform to sell Amazon instant video, but really lacks functionality.  The interface is fast and smooth of Amazon Prime videos, but the Netflix and Hulu interfaces are very poorly designed and look very similar to 2009 Roku box versions.I will probably ask for a refund.  Given this is a device dedicate to renting and selling videos from Amazon, they should give this away for free.", "verified": true, "helpfulness": "8/11", "author": "Thomas Burke"}, {"rating": 3.0, "review": "I didn't buy this product yet but I am intrigued, except for this question: Why isn't HBO Go available? That would make it perfect for me as an HBO subscriber. Otherwise I don't even need this extra device, I can just run an HDMI cable from my Mac Mini to the TV.", "verified": false, "helpfulness": "0/6", "author": "DKR5 \"dr1000\""}, {"rating": 5.0, "review": "We are not big TV watchers.  I have not purchased cable or other type of TV service for over 15 years.  I find it has cleared our minds and allowed us to be free thinkers and we are not  brainwashed by all the lies and distortions found in mainstream television. Plus the number of commercials during a basic show is simply asinine.We do like movies and certain cooking shows found on Amazon.  I don't mind paying for a commercial free show.I purchased the amazon fire because I am a prime member and watch movies found on Amazon.  The Fire TV is fast and is very easy to use.  The voice command on the remote is the best.  This box is so small its hard to find on the table when tucked behind the TV.There is no on and off button but it turns itself off after 30 mins.  I don't really like this but I have read that may be fixed somehow.  Beware!!!  If you have the screen saver turned on it streams photos from the internet and It causes the Fire to Stay on even after 30 minutes.  This means you are using a lot of internet and could cost you in a very short time.But other than that, this is a great unit. I don't watch HBO or other stations that have been mentioned here so I can't comment on them.  For Amazon content this thing is a very nice piece of equipment.  Worth the price.", "verified": true, "helpfulness": "1/4", "author": "captainron"}, {"rating": 5.0, "review": "So easy to use and I love all of the shows that I can now watch!", "verified": true, "helpfulness": "0/2", "author": "Janet Lei"}, {"rating": 3.0, "review": "I really wanted to like the fire tv, as I'm disappointed with the roku 2xs and roku 2, but it needs the hbo go app (which is supposed to be here by the end of the year) and they interface needs a lot of work. I ended up returning it and buying a roku 3.The pros: the processing power lives up to the claim, it is fast. no faster than the apple tv 3 though. It has the updated netflix app which is a huge plus for me. The reason i dislike my rokus is that they have the old netflix app which does not support multiple profiles. The voice search from the remote works great, it was 100% successful for the time i had it.The negs: The interface is terrible. i never knew where i was and how to get where i wanted to go. It needs hbo go. The price is too high, the price needs to come down to $80 for new. I ended up using the apple tv for most things and the fire tv for amazon instant only.", "verified": true, "helpfulness": "2/3", "author": "MJ"}, {"rating": 3.0, "review": "Other streamers out there do the same thing at a cheaper price.", "verified": true, "helpfulness": "0/3", "author": "Bona Robinson"}, {"rating": 1.0, "review": "I'm giving this 1 star not because it just doesn't work, but in relation to other devices of this type I think Amazon Fire tv deserves 1 star. The main interface is fine, and the voice search is nice, but the reason I purchased this was because Amazon just purchased Twitch and other tv devices don't have Twitch as an option. So, I decided to pay quite a bit extra and give this thing a go - after having it for a week or so, I'm unhappy with this decision of mine. The Twitch app is basically unusable. Any stream blacks out after about 2 minutes so you have to leave the stream and then click on it again, which requires you to reload the stream and potentially watch another ad. Other times I've had to actually force close the app and relaunch it. We were watching a game on Twitch last night and missed nearly every fight due to this problem, which to me is completely unacceptable. I should have paid less and just gotten a Roku or something, at least they don't advertise having a Twitch app that doesn't work. Especially given that Amazon just purchased Twitch, it's insane that this app is pretty much unusable on one of their products.Basically, if you care at all about Twitch (which I think is one of the things that sets this box apart from others) don't even think about this one. It's completely useless to that end.", "verified": true, "helpfulness": "3/7", "author": "Elise T. Haas \"E. Haas\""}, {"rating": 5.0, "review": "I really like the Fire. Easy to set up and use. I may get another one for another room.", "verified": true, "helpfulness": "0/1", "author": "Mike Wright"}]