[{"rating": 5.0, "review": "I am not a tech guy, but I have been on the forefront of the various internet on demand boxes available over the last few years and the Fire TV is hands down, the absolute best! Finally, a product and company that takes the download, buffering and display of Internet content seriously. Way to go Amazon!  If you don't have your own Fire TV yet then you are missing out on what your HD TV can really do.", "verified": true, "helpfulness": "1/1", "author": "John Galt"}, {"rating": 5.0, "review": "My wife took it away from me. She loves it. Maybe, someday, she'll let me play with it.", "verified": true, "helpfulness": "1/1", "author": "Griff Evans \"Griff Evans\""}, {"rating": 5.0, "review": "We love Fire TV.  It has been a great investment!!!!", "verified": true, "helpfulness": "0/0", "author": "Renjo"}, {"rating": 5.0, "review": "Easy to install, great picture quality, and easy to setup password protection on both free Prime selections & cost selections.", "verified": true, "helpfulness": "1/1", "author": "Retired@58 \"SBGL\""}, {"rating": 5.0, "review": "Unless you have to have all things apple, this is by far the best option for a media box or whatever you want to call it.", "verified": true, "helpfulness": "0/0", "author": "PDD \"PDD\""}, {"rating": 5.0, "review": "This is a great player. It has many apps for most of your needs. Simple to set up and stream your content.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Don't have to watch movies on the computer or tablet anymore, would be a lot better if there were more prime movies to watch without having to pay the extra fee. Netflix can be accessed thru the Fire TV which makes this a little better.", "verified": true, "helpfulness": "0/0", "author": "GrandPa in the Panhandle"}, {"rating": 5.0, "review": "Great product and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Maineac"}, {"rating": 5.0, "review": "Best thing since Tivo.", "verified": true, "helpfulness": "0/0", "author": "Jackie Eldridge"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Janice Jewers"}]