[{"rating": 5.0, "review": "If it weren't for the terms refurbished in the description of this product you would swear it was brand new!  Excellent device, plenty of RAM and processing speed for the function it serves, very fast to load videos and has ability to run XBMC.", "verified": true, "helpfulness": "0/0", "author": "Joshua Sheaffer"}, {"rating": 5.0, "review": "Quality good. Very easy to set up. Unfortunately my Internet speed is slow and no faster service available. Therefore have not got a chance to look at movies j. It's entirety.", "verified": true, "helpfulness": "0/0", "author": "Lady Heard \"LadyHeard\""}, {"rating": 5.0, "review": "Absolutely love it.  I have netflix, amazon prime and huluplus so the possibilities are endless.  Very easy setup.  Getting closer and closer to getting rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Donna Keating"}, {"rating": 4.0, "review": "Have enjoyed it very much.  Still trying to find all the different features.", "verified": true, "helpfulness": "0/0", "author": "Patricia Elsner"}, {"rating": 5.0, "review": "Love it. Can't tell its not brand new.", "verified": true, "helpfulness": "0/0", "author": "Montana Canterbury"}, {"rating": 3.0, "review": "Am very satisfied", "verified": true, "helpfulness": "0/1", "author": "Sharon R."}, {"rating": 5.0, "review": "Great item since I turned off cable. If watching a TV series it automatically starts the next episode.  Just wish it gave you an episode description.  Easy to find shows and movies and the voice search actually works.  Quick and easy setup and easy everyday use.  Netflix and Hulu are under the apps selection.", "verified": true, "helpfulness": "0/0", "author": "L. Mitchell \"Reader\""}, {"rating": 3.0, "review": "This is a good way to see a lot more shows at home. What is bothersome is that it is slow.  I have to wait for downloads, like minutes at a time.  I think this is due to my remote location and the availability of the internet.  We have not yet gotten fiber optics hooked up here so thats not good. At the same time the Fire TV is good.", "verified": true, "helpfulness": "0/0", "author": "Margey Azure"}, {"rating": 5.0, "review": "Awesome device! Easy set up and installation", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use. Functions so well. Love this product and am so glad I purchased it", "verified": true, "helpfulness": "0/0", "author": "Hannah Rachel Stucky"}]