[{"rating": 5.0, "review": "I rarely write reviews but am giving Amazon's Fire TV 5 stars. As with everything \"Amazon\", it not only met, but exceeded my expectations. It works like a charm, was very easy to set up, and I truly appreciate being able to talk to a real person when I have a question. Another great job well done Amazon!", "verified": true, "helpfulness": "0/1", "author": "P G Pauly"}, {"rating": 5.0, "review": "Awesome !!", "verified": true, "helpfulness": "0/0", "author": "Tony Pashia"}, {"rating": 1.0, "review": "Received as a gift, too complicated to use, no instructions came with the device, not even a simple guide.  You are supposed to read the internet and install at the same time which is annoying and time-consuming for something that does not have much worth viewing.  The offerings and games may be fine if you have children and want them to spend all their time playing  on these services, but I don't see much offered that would interest a mature adult.  You don't really get any quality movies or programs, only bad movies that appeal to teenagers with lots of violence or games with same said violence.  You can use your WII or Playstation to play games.  I have a Kindle tablet that I use all the time and enjoy, but think this is just a waste of money.", "verified": true, "helpfulness": "1/5", "author": "chloe46774"}, {"rating": 4.0, "review": "Unfortunately not much time to watch as we have been extremely busy with work. However with what we have seen of the Five TV we are quite happy with the results.", "verified": true, "helpfulness": "0/0", "author": "The Reader"}, {"rating": 5.0, "review": "Best purchase I've made recently!", "verified": true, "helpfulness": "0/1", "author": "Linda J. Greth"}, {"rating": 5.0, "review": "Works as stated. Love it.", "verified": true, "helpfulness": "0/1", "author": "Wowwee"}, {"rating": 5.0, "review": "Absolutely exceeded my expectations. I have an HTPC and ROKU and didn't see the need. When I saw all the capabilities (Kodi!) I gave it try and happy ever since. Extremely fast!", "verified": true, "helpfulness": "0/1", "author": "Shawn M. Collins"}, {"rating": 5.0, "review": "Easy to set up and use.  Wide variety of entertainment", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I really enjoy my Fire TV.  VERY simple to set up and use...EXCEPT...I am plagued with Netflix issues.  Netflix has not worked in at least a week, but I can get to it (via my same home wireless network) using my phone (Droid Turbo) and my 3 year old Kindle Fire.  What gives?I have logged out and back into Netflix to no avail.  I have also re-installed the app and that has not worked either.Any advice or assistance would be appreciated...", "verified": true, "helpfulness": "0/1", "author": "S. C. Alfsen"}, {"rating": 5.0, "review": "Works great with Netflix", "verified": true, "helpfulness": "0/1", "author": "Edward O."}]