[{"rating": 5.0, "review": "An excellent device. I was an Apple TV user for several years; Fire is better in nearly every way.", "verified": true, "helpfulness": "0/0", "author": "Rob  Marcroft"}, {"rating": 5.0, "review": "A pleasant & intuitive OS & compatibility with all of the major streaming services along with a lot of your favorite apps plus the ability to \"cast\" your photos from your phone to your t.v. through an app makes this a much better choice than Chromecast. $99 is a steal for this device.", "verified": true, "helpfulness": "0/0", "author": "echo_lima_kilo"}, {"rating": 5.0, "review": "Love it , so easy to hook up and get working . Easy to navigate and good selection of programs and movies to enjoy. Had a small problem getting Hulu and Netflix set up (still need to contact  Anazon). Tired paying for expensive satellite programming with nothing really fit to watch.", "verified": true, "helpfulness": "0/0", "author": "Charles Crane"}, {"rating": 5.0, "review": "I have used a Roku for several years now and I enjoy it tremendously.  I purchased the Amazon Fire TV with a gift card and tested it over the weekend and I just thick it is incredible.  It's faster, the picture quality is excellent and the audio is just as good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it!  Very convenient.  Only minor problem with streaming video. Many times it's non-responsive or takes very long to load to the Kindle for viewing.  Sometimes I have to leave it alone and try to launch several times.", "verified": true, "helpfulness": "0/0", "author": "Martha Zavala"}, {"rating": 5.0, "review": "Awesome picture, remote is so simple and easy to use. My family loves it, the included TV and movies gives us hours of enjoyment. This investment has already paid for itself as Prime members we were offered Fire TV for $85, a real value.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 3.0, "review": "Still under review.", "verified": true, "helpfulness": "0/1", "author": "NWGreener \"Mary\""}, {"rating": 5.0, "review": "I bought 2 of these and 1 Apple TV (we have prime and netflix). Our family prefers the TVs with the Amazon Fire! Amazon Fire lets you download tons more apps, which means an endless amount of content. The Apple TV may have the same apps (like History Channel, A&E;, etc.), but their content contracts do not allow as much \"unlocked\" content and you get more clips instead of full episodes. There is a HUGE difference in the amount and the quality of content between the Fire and Apple TV. I have an iPhone, so I can get content on my iPhone and then use the AirPlay to have the content displayed on our TV, but that means instead of being able to use my iPhone for a phone, my iPhone has to be used as a content provider just so we can view full episodes of content on the TV. It's not perfect and I hate the idea of not being able to see current content on my TV without having to use my iPhone, it's stupid, but it does work. Amazon Fire is just better. With Amazon Fire you get so many more apps, including all the apps that Apple TV has (less than 100), PLUS the 100's that Amazon Fire can download. It's just better.", "verified": true, "helpfulness": "0/0", "author": "Laverne \"casa con mi jitos\""}, {"rating": 4.0, "review": "I purchased the Amazon Fire in December as in winter I spend way too much time indoors. I really like it.The best thing is the price (I also got it with a rebate) and I have the Amazon Prime membership (About $80.00) for the whole year so right there it is a really good price. Besides I'm subscribed to Netflix, PBS and other TV channels and see them using Amazon Fire.Also it is very easy to connect and use.Having the remote control helps a lot (C'mon we get a bit lazy in winter) however I thing the whole remote control could be improved. The feature of voice recognition is very useful to search in Amazon, but it doesn't work with the other apps. Also when English is not your first language and if you have an accent it is a bit frustrating. Also the typing the name running though all the letters could be improved. Maybe using the old fashion texting way  (1 is abc, 2 is def, etc) will be an improvement.In general I think it is a really good product", "verified": true, "helpfulness": "0/0", "author": "C. Vivas \"Cleo\""}, {"rating": 3.0, "review": "We liked our fire tv until the remote quit working and now we can do nothing with it. You can't even find out how to fix or replace the remote. Nothing works without the remote.", "verified": true, "helpfulness": "0/0", "author": "booba93"}]