[{"rating": 5.0, "review": "It is amazing and it does what they say!", "verified": true, "helpfulness": "0/0", "author": "John T. Craig"}, {"rating": 5.0, "review": "Pretty cool device. I can see why so many are dropping cable TV.", "verified": true, "helpfulness": "0/0", "author": "U2"}, {"rating": 5.0, "review": "This is an amazing device. I am real happy with it & love how easy it is to hook up.", "verified": true, "helpfulness": "1/1", "author": "Cindi"}, {"rating": 5.0, "review": "Great ìt is tops", "verified": true, "helpfulness": "1/1", "author": "Tuneman101 \"Harold Belcher\""}, {"rating": 5.0, "review": "Was exactly as described.  I am well satisfied.", "verified": true, "helpfulness": "1/1", "author": "Charles Lacy"}, {"rating": 3.0, "review": "haven't gotten into it  much. I thought I'd give it a try after cancelling my cable which was only used to view shows I missed during the week.", "verified": true, "helpfulness": "0/2", "author": "KarD"}, {"rating": 5.0, "review": "I've Chromecast for quite some time, but the Amazon Fire TV is faster and more reliable. It's FANTASTIC!! I'm glad I made the switch and bought this product", "verified": true, "helpfulness": "1/1", "author": "Pen Name"}, {"rating": 5.0, "review": "This is one of the best products I have ever bought from Amazon. I own almost all of the products that amazon puts out and this one is by far the best. The remote is very sleek and sexy. It is expandable with the usb insert in the back. And for you tech people out there it is the best way to sync KODI (formally XBMC). It is very easy to use just buy this and an hdmi cable plug it all in and that's about all. I have only had a couple of times where I have had to restart the Fire because Prime was stalled out. But this by no means mean a dock in stars. To anyone looking to buy a product of this look no further this is it.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "Love Fire TV!!!!!", "verified": true, "helpfulness": "0/0", "author": "Rebecca Meador"}, {"rating": 5.0, "review": "Its more then expected. I thought you could watch some movies or videos,  but this does so much more. I'm a member of Prime, so my music and pictures loaded too. And all the apps that you can add is amazing. I'm loving it. I really want one for each tv now.", "verified": true, "helpfulness": "0/0", "author": "MamaRuby"}]