[{"rating": 4.0, "review": "I've gone through about every set top box like this there is. Roku, OUYA, AppleTV, etc. So far this has been my favorite. Most of the others were lacking in A/V format support, buggy, or underpowered. It's been smooth sailing so far with FireTV. I mainly use it as my media center with the Plex app. The image quality and speed is very nice. I wish they had more surround sound audio options, but I hear that's coming in the future. No complaints. I would like to see the search feature to be integrated into more apps as well.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "I am a big fan of Apple and we even have Apple TV.  However, I much prefer Amazon Fire TV. I find it exceptional in every way! We had an issue with a charge for a movie and I called and was helped by one of your wonderful customer service employees. Thank You for your excellent service!", "verified": true, "helpfulness": "0/0", "author": "MRS.M \"WASILLACHIC\""}, {"rating": 5.0, "review": "Every thing I expected. the voice control is great. Easy to hook up and operate.", "verified": true, "helpfulness": "0/0", "author": "KYGuy \"Mason\""}, {"rating": 5.0, "review": "If you have Amazon Prime and Netflix I highly recommend this purchase. Amazing little device. Easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Eleven Bravo"}, {"rating": 5.0, "review": "Best purchase yet this year!!", "verified": true, "helpfulness": "0/0", "author": "Dawn I. Reprogel"}, {"rating": 3.0, "review": "Would be nice if it had online capabilities also would be nice if voice control searched the entire app collection for specific titles  not just what's available through the amazon prime membership", "verified": true, "helpfulness": "0/1", "author": "Alex"}, {"rating": 4.0, "review": "Loved this!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Allison Reese"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "breeze"}, {"rating": 5.0, "review": "Could not be more pleased. Works as advertised, is very quick and menu is well organized. The remote with voice works very well, and I have trouble with voice control on cell phones. If you can afford this over the USB FireTV Stick, get it - the remote and ability to use it on your LAN make it much more flexible. While menu does make it easy to  get to  Amazon materials, I disagree with review comments that said it favored Amazon sources at the expense of other sources - my searches of the visible menu and by voice search seemed neutral to me -  I would get selections from Netfix, etc. as much as from Amazon. This is one fine box. Incidentally, I have it hooked up through a DVDO signal processor/enhancer vice running the output straight to my TV, and it worked on HDMI right out of the box. I also like the addional digital audio OUT port - it works at the same time as the sound on the HDMI port, so I run sound to both my speakers and to my wireless headset for flexibility in the evening. I only use it to watch content on a good TV - I have never been a fan of watching video on these small portable platforms that have so much of the advertising directed to them, so cannot comment on that aspect of the device.", "verified": true, "helpfulness": "1/1", "author": "William D. McCabe Jr."}, {"rating": 5.0, "review": "Really nice product.  Should include a couple adhesive backed Velcro strips to anchor it.", "verified": true, "helpfulness": "0/0", "author": "avianlk"}]