[{"rating": 5.0, "review": "Easy to connect and set up. I was watching  Fire TV within minutes of connecting. Great streaming, sound and picture. Love it!!", "verified": true, "helpfulness": "0/0", "author": "Debra L Vallas"}, {"rating": 3.0, "review": "The unit works fine. The downside is Amazon gives the impression that there are 1000's of movies available at no charge for those paying for Prime which is not true. Most movies still have to be paid for.", "verified": true, "helpfulness": "1/4", "author": "EG"}, {"rating": 5.0, "review": "Love my fire tv.... so easy to use and works great with amazon prime programming. Just what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "Cristy"}, {"rating": 4.0, "review": "Overall I think the product is fantastic and, for the hardware you're getting, the price is fantastic.  I do wish the UI was a bit more neutral in how it presents content to you. Amazon definitely wishes to steer users towards content from Amazon services, but getting to Netflix, Hulu, or whatever, is by no means a chore.Build quality is great.  Both the Fire TV itself and the remote feel extremely solid.That said,  while I understand the business case for not actively supporting or encouraging users who wish to gain root access, it's unfortunate that Amazon actively works to block it.", "verified": true, "helpfulness": "1/1", "author": "Ryan Cook"}, {"rating": 5.0, "review": "MUCH BETTER THAN WE EXPECTED---WORKS WELL AND VERY EASY TO USE--GREAT DEVICE", "verified": true, "helpfulness": "0/1", "author": "Donald N. Petito"}, {"rating": 5.0, "review": "LOVE THE WAY IS WORKS WITH OTHER APPLICATION LIKE NETFLIX....", "verified": true, "helpfulness": "0/0", "author": "FREDLMAY"}, {"rating": 5.0, "review": "Works great. Perfect gift.", "verified": true, "helpfulness": "0/0", "author": "Carey"}, {"rating": 4.0, "review": "still exploring it ,but love it so far", "verified": true, "helpfulness": "0/2", "author": "BigM \"Mike\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/1", "author": "christopher bowman"}, {"rating": 3.0, "review": "The device works well. I would like it to have YouTube, and a site that offers different types of movies foreign films and historical or cultural series.", "verified": true, "helpfulness": "1/3", "author": "Kronos1"}]