[{"rating": 5.0, "review": "I got rid of cable and got the Fire TV. It is fabulous!  I immediately joined NetFlex because I can watch movies & TV shows for free with them that Amazon charges for.  I am SOOOO happy with it and I don't have the Kindle Fire. (Can't afford it).", "verified": true, "helpfulness": "0/0", "author": "GinalolaQQ \"Gina\""}, {"rating": 5.0, "review": "I am new to the streaming vidieo / movie world and this is my first product to use. However I do not think I will be leaving Amazon Prime anytime soon. The selection and quality of movies for me are great. Movies come across with great audio and picture quality , they start right now and so far no buffering . Would highly recommend and you can not beat the price for the product and Prime to go along with it.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 3.0, "review": "I bought fire TV to replace my Roku 3. Had several technical problems with the Roku, one of them being the short life(I owned 3 different ones in 3 yrs, they all overheated until it stopped working completely). Product longevity is a important to me, as well as quality. It's too soon to say if Fire TV will last long, ask me in a couple years, but as of right now I like it. It's fast and has a vast selection of movies. I wish, however that they had a better selection of \"free\" movies, giving that we are already Prime subscribers. The \"free\" movies are often the ones everyone has seen already or are dated movies and movies so bad that even Rotten Tomatoes ran out of bad things to say about it. \"Buying\" a movie for $18.99 when said movie didn't even shake the box office enough to break even? Thanks, but no. As a member of the entertainment industry, I understand that this is partly due to Studios and distributors contracts but c'mon, you're pushing your luck here buddy.When it comes to Apps, Fire TV has a long way to go in comparison to Roku and Apple TV. Some of our beloved channels like PBS didn't even make the initial cut. So my only real complaint here is that there aren't enough good quality app channels, except for maybe a hand full of them. We gave up cable a few years ago so we really look forward to having a variety of good programing apps to choose from.Other than the above issues, fire tv works well, those screensaver pictures are gorgeous (I wish they'd caption the images with the location where they were taken), the design is simple enough that even a non-tech savvy person can comprehend, and it was super easy to install.I've always trusted Amazon products and that's why I took a leap faith with Fire TV. I hope it pays off! :)UPDATE 08/13/14: The past 2 months we've had connectivity issues with Amazon Fire TV. The problem is that you select a show, click on it and it says it's not available or the video will load half way and then display an error message saying something like \"video unavailable\". First we tested our internet connection and since all other wi-fi devices in the house were working fine, and our connection was strong we ruled that possibility out. Next, we called customer service after trying to troubleshoot on our own. Customer svc told us to do all the steps we had already tried, so the last step and IMO the most annoying and impractical one was to reset the device to factory default settings. This would mean that all of the apps we had downloaded, all saved passwords and personal setting would be wiped out. We'd have to start from one and re-download app again, and re-enter passwords. So we did just that and Fire Tv worked fine, until a week ago when the same problem resurfaced. I haven't called them yet for lack of time, but I am annoyed by his. I am tempted to ask for my money back and return the device. Apple TV seems to be a better option at this point.", "verified": true, "helpfulness": "2/2", "author": "EC \"EC\""}, {"rating": 1.0, "review": "my fire tv worked great for a month then stopped playing movies and tv shows . I had to restore it to factory specs twice then I couldn't get my game controller paired back to the amazon tv . amazon doesn't want to back up thier products without a head ache . they gave me a $28.00 promotional credit which I couldn't use to get the kindle books I wanted . my roku 2 has lasted 4 yrs without any trouble .they replaced my fire tv and game controller and I have the same problem the first ones had . game controller won't pair with the fire tv .", "verified": true, "helpfulness": "6/10", "author": "Gary Simpson"}, {"rating": 4.0, "review": "This is my first time at internet TV, and the Fire has proved easy to set up and to use.  I hope that in the future that they would expand to channels like \"The Blaze\", VUDU, and ultraviolet.", "verified": true, "helpfulness": "0/0", "author": "B. Sarrazin"}, {"rating": 5.0, "review": "I have been very happy with Amazon Fire TV. It delivers a beautiful HD picture, it works very fast, and the voice search works perfectly. I will agree with other reviewers, if you don't have Amazon Prime you might be happier with something like Roku cause it definitely is geared toward Amazon Prime users. With that being said I also recommend getting Amazon Prime. I use their service more often than Netflix or Hulu.", "verified": true, "helpfulness": "0/0", "author": "Jacob Lennard"}, {"rating": 5.0, "review": "This has become almost an other appendage for me since I got it.  I liked my other kindle, but it crashed in less than a year.  This Kindle Fire has been all over the country with me and never have I had a problem with it.", "verified": true, "helpfulness": "0/1", "author": "Nancy Bowen \"Ken Bowen\""}, {"rating": 5.0, "review": "What can I say the device is good and easy to use and works perfectly.  The voice activation is an added plus to find movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am impressed with fire tv. After using it for a few weeks I have watched  more movies than I have seen in years. The only problem I have encountered was low bandwidth which caused a delay in starting a movie.  One thing I would like is more search options to help refine results. Another is having a movie or show appear only once. As I have scrolled through the pages the same show is on multiple pages.  Quick to setup. Voice search has worked well.  I would buy this again.", "verified": true, "helpfulness": "0/0", "author": "Jones"}, {"rating": 5.0, "review": "Easy to operate and to install.  Provides programs not otherwise available on cable.  I am very happy with the Amazon Fire TV.", "verified": true, "helpfulness": "1/1", "author": "don"}]