[{"rating": 5.0, "review": "We absolutely love our new Fire TV.  Even my preschooler can operate it.  The fact that we can watch Prime, Netflix, YouTube, PBS, etc... makes us not miss cable tv at all.  This is better, and you can play games to boot!", "verified": true, "helpfulness": "0/0", "author": "dorseyM \"DM\""}, {"rating": 1.0, "review": "To be honest, with the prime membership and the unit, its not worth it, so not worth it.  If you need to do a streaming service, I would recommend hulu or another service.  The shows are not current, and a waster of money.", "verified": true, "helpfulness": "1/2", "author": "Benjamin Petkiewicz"}, {"rating": 5.0, "review": "This was a gift but the recipient loves it a lot and says is better than the Apple TV. Movies and TV shows load faster than in the Apple TV and the voice feature is quiet neat, however, the only down thing about it is that you can only use the voice search for things you want to search on Amazon. If you were to open youtube or any other app and try to search by voice it won't work.", "verified": true, "helpfulness": "0/0", "author": "Dario Idrovo"}, {"rating": 5.0, "review": "I got rid of my directv after receiving my fire tv box and have not regretted it at all absolutely love it", "verified": true, "helpfulness": "0/0", "author": "Ronnie Worth"}, {"rating": 4.0, "review": "Most of the available free movies are old/low rated movies.  New and even older popular movies are only available if you pay for each.", "verified": true, "helpfulness": "0/0", "author": "Theniter"}, {"rating": 5.0, "review": "Super easy hook up and a wonderful item my whole family enjoys!", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 4.0, "review": "Plugged in and it works always available.  Like to see more OTA apps.  No cable service. Love the product", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "This device is worth every penny. It was easy to set up and I like that it recognizes my amazon prime right out of the box. I use You tube a lot  and it has not been difficult to access. I think it has learned what I want which is a bit scary ! The remote is very sensitive and works very well. I like being able to choose what I want to watch instead of the garbage that is regular television. Amazon prime is very good and user friendly. Thank you Amazon !", "verified": true, "helpfulness": "0/0", "author": "J. Martin"}, {"rating": 2.0, "review": "The Fire TV box seems to have a software glitch where the app Crackle keeps coming on and interrupts shows that I am watching on either Netflix, Sling TV, or Amazon Prime.  It has happened repeatedly since I purchased and installed the Fire TV box.  Its hard to watch a movie without this interruption.  I called customer service and talked to the Fire TV technicians.  Nothing has worked thus far. I am not having a good experience with this system.", "verified": true, "helpfulness": "0/1", "author": "Tina"}, {"rating": 2.0, "review": "Pros:- Very fast and fluid interface- Easy set up- Premium build quality- Remote feels good in handsCons:- Disappointed with device as I have Dishworld / Sling international subscription and been using on Roku 3 since two yrs without any issue. On Fire TV, there is no option of pan and zoom for Standard defnition channels. High defintion channels works full screen but SD channels stay small on TV and there is no option to zoom them automatically on changing channels. Till this option is there, its useless device for my personal use. Returning on first day.- Other disappointment is putting Amazon content everywhere and leaving others in Apps.", "verified": true, "helpfulness": "0/1", "author": "SID"}]