[{"rating": 4.0, "review": "Have to reboot almost daily even though there is a direct connection to a functioning internet.", "verified": true, "helpfulness": "0/0", "author": "Amber M. Lake"}, {"rating": 5.0, "review": "The best review I can give a product is to say it does what it promised and was worth what I paid for. That definitely describes the Amazon Fire TV. The set up was fast and easy; and, yes, unless I mumble or mispronounce a word, the voice remote works well.", "verified": true, "helpfulness": "0/0", "author": "James R. Lowell"}, {"rating": 5.0, "review": "Voice option, works like a charm. It has been the best experience, with any Streaming device I have had. Excellent product, recommended to others in the family.", "verified": true, "helpfulness": "0/0", "author": "Frank Berrios"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/1", "author": "oneida bruno"}, {"rating": 3.0, "review": "Need more information on how to use and what you can do with the USB port", "verified": true, "helpfulness": "0/0", "author": "mario"}, {"rating": 5.0, "review": "Love it! Small and compact and just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "D. J. Starr"}, {"rating": 1.0, "review": "I could not install this on my new Samsung Smart TV that I bought at the same time. I will try to install on a non smart TV. Unfortunately these TVs are at our beach condo and we won't be back over there for about 10 days.", "verified": true, "helpfulness": "0/10", "author": "Carole Simmons"}, {"rating": 4.0, "review": "I am very happy with my Amazon  Fire TV. It was easy to hook up just like they 123. And in few minutes I was watching movies. So happy with it that I purchased one for a Christmas gift for a friend.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "Great little unit, uses very little power the Plex app is pretty good. No complaints, just hoping they keep with regular firmware updates. Far better than the Stick", "verified": true, "helpfulness": "0/0", "author": "xmichael"}, {"rating": 3.0, "review": "Good product.  Lot's of content selection.  Easy hookup and convenient user interface.The only downsides are both image quality and sound seems noticeably inferior to my AppleTV", "verified": true, "helpfulness": "0/0", "author": "jmac"}]