[{"rating": 4.0, "review": "Very well designed system and love the voice activated search", "verified": true, "helpfulness": "1/1", "author": "Rebecca \"science reader\""}, {"rating": 1.0, "review": "I have a Roku, but was considering buying the Amazon Fire TV. But after reading all the negative reviews and my own experience with using Amazon Prime with my Roku, I decided against purchasing the Fire TV.When I go into Amazon Prime from my Roku, I look for a movie or TV show that has a \"CC\" on the bottom because I watch many British shows and need the closed captions to understand much of the dialog. However, I have gone into many shows that indicate \"CC\"; I turn CC ON, but I get no closed captions--this happens most of the time. And as one reviewer noted, there's no way to see Amazon Prime  shows only.So I'll stick  to my Roku until such time as Amazon surpasses them.", "verified": false, "helpfulness": "5/19", "author": "Eddie@204"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "1/1", "author": "William Brown"}, {"rating": 4.0, "review": "Had some connection issues with internet.  All other devices worked properly that were connected to the net.  Love it however, I have apple tv too and love Fire as much as apple.", "verified": true, "helpfulness": "0/1", "author": "jerseysouix"}, {"rating": 5.0, "review": "The Fire is replacing an older Roku box I've been using for 5+ years. The Fire looks good and feels very solid. Had it connected and running in 5 minutes. Everything has worked perfectly so far (30 minutes of use - lol). Hopefully it will continue to work this well for years to come.Just ordered a second unit for the bedroom. Been using the Fire for a two days now. The Fire is faster than the old Roku boxes. I do have to say that I'm only accessing Amz Prime and Pandora. Tried a couple of apps and they connected fine, just won't use them much.", "verified": true, "helpfulness": "1/1", "author": "JAL"}, {"rating": 5.0, "review": "Lots  of options.  Very fast loading.  Easy operation.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"enlightened one\""}, {"rating": 2.0, "review": "could not get on with it,", "verified": true, "helpfulness": "3/7", "author": "Tino"}, {"rating": 3.0, "review": "Voice connector did not work,at least on my remote.Prefer Apple TV but Apple also has problems with streaming content,that is why I made the switch to Amazon fire TV but that was also a disappointment.", "verified": true, "helpfulness": "0/1", "author": "Harold Silver \"Doc Silver\""}, {"rating": 4.0, "review": "Love the Amazon FIre TV, the only reason I did not give it 5 stars is that you can't plug a USB drive directly into the device and watch a movie from it. Wish it had mayday like the Amazon Fire tablet.", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very fast and good layout on screen. Enjoyable to watch. When I first plugged it in there was no sound but I fixed it by changing the audio settings to optical audio out. I'm not sure why this worked as I didn't have an optical audio cable plugged into the device, but it works now and that is all I care about.", "verified": true, "helpfulness": "1/1", "author": "vy"}]