[{"rating": 5.0, "review": "Great product! Moved from Apple tv to Fire Tv and I'm very glad I did!!", "verified": true, "helpfulness": "0/0", "author": "john l."}, {"rating": 5.0, "review": "It did everything we wanted to and more! We were even able to sync it up to our home network to stream our DVDs.  It is a must have if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "Yellow Jacket Girl"}, {"rating": 5.0, "review": "Able to view The Blaze network all day now...reason I purchased the Fire TV ...works great....", "verified": true, "helpfulness": "1/1", "author": "Jan Leonardi"}, {"rating": 4.0, "review": "I was not disappointed.", "verified": true, "helpfulness": "0/0", "author": "Leslie Shearn"}, {"rating": 2.0, "review": "Despite that I have a very Good internet speed the Amazon videos looks like on frames or buffering on this Amazon fire I check on  my ps4 and Amazon looks really well real clear.I tried connecting the fire straight to the router with a Cat5 and still doing the same thing.Very disappointed!!!!", "verified": true, "helpfulness": "0/1", "author": "CARLOS ESCAMILLA"}, {"rating": 5.0, "review": "Bought this to replace Apple TV because I wanted easy access to my Amazon Prime Videos. Set up was amazing...maybe the best of any tech product I've ever owned. Didn't even have to enter my Amazon information...it knew. Works amazing. My only regret? Not buying it earlier!", "verified": true, "helpfulness": "0/0", "author": "Les R. Diveley"}, {"rating": 5.0, "review": "Beats my roku any day. Actual Pluto TV is worth it alone.", "verified": true, "helpfulness": "0/0", "author": "Larry Berry"}, {"rating": 4.0, "review": "A solid built unit with excellent processing times, and the pages refresh very fast. High quality images and audio output. I took one star out because the remote don't have a stop button (only play, pause, and fast forward/re-wind). Occasionally I noticed loss of audio from some channels because an earlier app is still running in the background, so I had to refresh/reboot the unit, then it worked. A stop function on the remote might help stop the app from continue to run in the background. A few times the voice function on the remote froze, but removing and putting the battery back on fixed the issue. Would like to see more useful apps added to Fire TV, and a search function similar to Roku 3 that search across other apps, not just amazon prime.", "verified": true, "helpfulness": "0/0", "author": "kpdocmail"}, {"rating": 3.0, "review": "Just wasn't for me.  I got it mostly for SlingTV which actually didn't work all that well.  I returned it.", "verified": true, "helpfulness": "0/0", "author": "ana"}, {"rating": 5.0, "review": "this thing is awesome. I love love love it.", "verified": true, "helpfulness": "0/0", "author": "ivy hogsed"}]