[{"rating": 5.0, "review": "Love it! Fire tv is easy to use, tons of free content, tons of new movies to  'rent' (and you don't have to remember to return! ) I wish search could be made easier but I think I could use keyboard on fire?", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "These are crazy awesome! Love them! Well-made for such a low price!", "verified": true, "helpfulness": "0/0", "author": "Satseama"}, {"rating": 5.0, "review": "I fell in love with Fire TV, user friendly, ease of set up, and so far works much better than Roku 3. Roku lasted 6 months set up was difficult, customer service not good, and Roku 3 no longer stays connected to wi-fi had to keep signing in every time we wanted to use and trying solve the problem was even worse, Roku in the trash and Fire TV is being used every night and the family loves it!", "verified": true, "helpfulness": "0/0", "author": "customer"}, {"rating": 4.0, "review": "Having a bit of a time figuring out the music component, but we are loving it so far.", "verified": true, "helpfulness": "0/0", "author": "Ndelible \"Ndel\""}, {"rating": 5.0, "review": "I truly love my Amazon Fire TV!  It is so small like a slice of bread and adorable!  The remote is tiny also but so intuitive you do not even need to look at it to use the remote.  I know actually use my prime video membership as I can now watch them on the big screen.  Another wonderful feature is using one the apps called Plex I can play my movies on my PC through the fire tv with no problem, not to mention music and pictures from my pc.  There is so much great content I can not give it enough praise, not just movies, games, fun apps it is a little entertainment box of wonder.  I got it when it was on sale one day for $79 but I would really not hesitate to  pay full price.  I highly recommend this!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Tabbycatz\""}, {"rating": 4.0, "review": "pleased with it, but seams limited as to movies , etc to watch.", "verified": true, "helpfulness": "0/0", "author": "steffen centlivre"}, {"rating": 5.0, "review": "Love it. easy to operate.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "now there is always something to watch", "verified": true, "helpfulness": "0/0", "author": "Deborah Catalano"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Gary Williams"}, {"rating": 5.0, "review": "watch it all the time", "verified": true, "helpfulness": "0/0", "author": "troy toler"}]