[{"rating": 5.0, "review": "Must have if you need streaming service.", "verified": true, "helpfulness": "0/0", "author": "Richard D"}, {"rating": 5.0, "review": "Big digital Library,, love it", "verified": true, "helpfulness": "0/0", "author": "Emad"}, {"rating": 1.0, "review": "Every other Android and iOS device are capable of doing this, why not the Fire TV? It seems fast and I bought this device on the road since I'm spending a lot of time in hotels but since nearly all hotels use web login for internet access I'm not able to use it. I can tether it to my phone but I'm not willing to use up my data. Amazon really needs to make an update, this is a deal breaker. BTW, I've tried a lot of the hack suggestions which none of them worked for me. Please fix it.", "verified": true, "helpfulness": "1/3", "author": "Michael C. Martin Jr."}, {"rating": 5.0, "review": "What a nice device!  I have discovered new shows and have enjoyed not watching cable.  I love the voice remote and the ability to use my phone as a remote.  Great purchase!", "verified": true, "helpfulness": "0/0", "author": "jz"}, {"rating": 5.0, "review": "Setup was very easy. Works very smoothly and quicker than my Apple TV. Truly a no brainer since I have an Amazon Prime account already. I wanted to get the Fire Stick HD but it was backordered on Amazon and not available at BestBuy where I bought the Fire TV. May still get the Fire Stick for traveling!", "verified": true, "helpfulness": "0/1", "author": "Brain King \"BK\""}, {"rating": 2.0, "review": "There is not sufficient space to install games. I was hoping that the Fire TV would allow installing games and apps to a USB stick via the USB port.", "verified": true, "helpfulness": "0/2", "author": "Christopher"}, {"rating": 1.0, "review": "Man the worst consumer electronic ever. Compare to apple TV  this sucks", "verified": true, "helpfulness": "1/7", "author": "bhavneet kaveeshar"}, {"rating": 4.0, "review": "The only thing I don't like is not being able to turn it off directly from the remote. Needs an on/off switch.  Otherwise, excellent way to watch series and movies without commercials.", "verified": true, "helpfulness": "0/0", "author": "Pam H"}, {"rating": 5.0, "review": "I love this device.  there's a lot of free ahows, etc included with my prime membership and the things do have a charge are reasonable.  definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Tom Faught"}, {"rating": 4.0, "review": "It's great!!! works very nice.", "verified": true, "helpfulness": "0/0", "author": "wilkin mendez"}]