[{"rating": 5.0, "review": "Went back and forth as to whether to buy this and boy am I glad I did!  So convenient and easy to use!  Looking forward to buying the game controllers to go with it so we can play even more free games.", "verified": true, "helpfulness": "0/0", "author": "Channy Kay Kay"}, {"rating": 3.0, "review": "I love this concept.  The ability to catalog (digitally) all of your movie/entertainment needs in one cloud-based application.  My challenge thus far is in getting the Fire TV box to match the potential.  It can occasionally \"lag\" or force the viewer to wait for buffering.  I boosted my internet signal into my home at over 33Mbps and my Wifi Router can easily accommodate 300+Mgps so my hardware or data-speed is not to blame.I performed some of the App Settings recommendations recently and that appears to have helped so I encourage others to do the same.  The specifics can be found in the Help section of Amazon.I will wait for definitive grade once I've had time to evaluate for a few months.  For now, the potential is great but the function \"may\" be a bit behind as yet.More to come....Good Luck!", "verified": true, "helpfulness": "1/1", "author": "Electronics Fan"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "RAK \"muskegon\""}, {"rating": 5.0, "review": "i was supposed to receive free book with the purchase of Amazon Fire tv in the box it was not there according to email i received from Amazon ,i received my fire tv on 2/3/2015  GUY Carrubba", "verified": true, "helpfulness": "1/2", "author": "gaetano a carrubba"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "rick neti"}, {"rating": 5.0, "review": "This is the best electronic device I have purchased in years. It was easy to install and extremely easy to use. I love the voice search feature.", "verified": true, "helpfulness": "0/0", "author": "Yoli"}, {"rating": 5.0, "review": "I am quite pleased with this. The device is small. But it performs well. There is a decent selection of content. Within a couple of days I was using this more than any other source for TV and movie viewing.", "verified": true, "helpfulness": "0/0", "author": "Leslie Addison"}, {"rating": 4.0, "review": "I have been very pleased with my fire TV. The shows and movies have been great. I like how it allows me to access my Netflix account", "verified": true, "helpfulness": "0/0", "author": "Charles B."}, {"rating": 4.0, "review": "I am so far satisfied with the Amazon Fire TV.  I have been a Prime member for several years and have most of my music through Amazon's music service.  I have a Roku 3 which I replaced with the Fire TV and do not feel like I have lost any functionality.  Video quality is good and I like the fact there is a digital out for running sound to my surround.  One hiccup I did have was the inability to rent Big Hero 6 on the day it became available.  This was an issue with Amazon, not the Fire player itself.", "verified": true, "helpfulness": "1/1", "author": "Tim"}, {"rating": 4.0, "review": "I love the ease of use and the access to my Amazon Prime benefits and programming. The only reason I didn't give it 5 stars was the remote. It drains batteries on a weekly basis because it is constantly searching and connecting to other blue tooth devices in our home, of which there are several. The only way we can preserve batteries is to pop one out any time we aren't using the TV. Very annoying. But overall I love the product and will continue to use it.", "verified": true, "helpfulness": "0/0", "author": "D. Walters"}]