[{"rating": 4.0, "review": "Being that I am a prime member I was surprised at how many movies I still have to pay additional monies if I want to see.", "verified": true, "helpfulness": "1/2", "author": "Sharon"}, {"rating": 5.0, "review": "Great picture quality and easy to use. So far so good I can't get my son off of it. I like that it has everything for every member of our family. We can watch our favorite shows together or we can watch solo. Great option for those who don't have cable or want to cancel cable. I love the fact that am a Prime Member and I subscribe to HULU because my options our endless....", "verified": true, "helpfulness": "1/1", "author": "Miranda Franco"}, {"rating": 3.0, "review": "Amazon put all their strategy into creating a truly sweet interface that obviously favors their own media.  Expected that. For example, the Fire comes loaded with Netflix's very old interface that uses small thumbnail images, yet their own shows nice large images.  Eh, like I said, expected.  That said, it really is a nice interface, especially if you are happy with Amazon content. The hardware is small, sleek and easy to set up.  The remote control feels nice to handle and is easy to navigate around with.  I'm an Amazon junkie, being in their world almost everyday.  However, this failed to measure up to my expectations.  Wireless was way too choppy to be usable.  I have high speed Comcast with my router not more than 10' away.  Could not get a single program to stream without multiple hesitations. Works fine with ethernet connection. The biggest disappointment is no USB support.  Seriously, no USB, what were they thinking? It has a USB port but only for future expansion or service.  None of my personal files could be used through this. No way!  In my opinion this is a BIG miscalculation by Amazon of the potential for the Fire as a personal media player. I sent it back and chose the Roku 3.  When the Fire lives up to it's potential I'll definitely reconsider.", "verified": true, "helpfulness": "1/2", "author": "Todd Putnam"}, {"rating": 2.0, "review": "Purchased 2 Amazon fire TV boxes today at BestBuy. I thought the voice feature would make it easier for my mother to use youtube and netflix. Unfortunately the voice search does not yet work in ANY of the apps like youtube or netflix. The only thing the voice search will bring is results from amazon's movie and tv catalog. I would have loved them to add something to their box like; Can I Stream.It?: Search Netflix, Hulu, Google Play, iTunes ...(www.canistream.it/) to let me know where I can purchase, rent, stream, etc instead of limiting me to only amazon's catalog. I think they made a critical error by not allowing you to use your voice within apps out of the gate. I ended up teaching my mother how to use an iphone with voice search and a $35 chromecast. As far as an andoid box it's not good because the selection of games and apps is very limited. You could buy a cheap HDMI andoid stick for your tv and do better. On selection it fails too.... Roku has a TON more channels. You can only stream to the device using a fire the introductory video said. My apple tv and chromecast will stream just about anything from my phone. Sadly I had great hopes for this device and was looking for any excuse to buy one. Unfortunately, I have to recommend roku or apple tv to my customers and friends. :(", "verified": false, "helpfulness": "0/2", "author": "David C."}, {"rating": 5.0, "review": "So far Amazon fire tv works great! The product is perfect and a great alternative to expensive cable. I do wish there were more shows and movies on prime. But what I don't get from amazon prime I can watch on netflix or Hulu plus.", "verified": true, "helpfulness": "1/1", "author": "Sknik"}, {"rating": 3.0, "review": "As internet-only set top boxes go it's pretty good. But there are a few serious flaws. Not all problems are unique to the Fire TV, but, nonetheless it could be better.What's great:- Doesn't crash as often as Roku.- Everything is fast and responsive: menus, the beginning of movies is pre-loaded, and other nice UI enhancements that make it snappy.What isn't great:- No bluetooth audio. Perhaps the only android device on the market that blocks users from using bluetooth.  Why Amazon?- Obviously Amazon-centric. The Roku was nice because when I searched for a video it would show results from Amazon, Netflix, Redbox, and on and on. Not on Fire TV, you get results *only* for Amazon--which often will show me a 14.99 video that's available for free on Netflix. Come on Amazon, don't be greedy: it's really the main thing that makes me consider switching back to Roku.- The Freetime features for kids is immature, and the ratings for shows is inconsistent. Meaning a lot of age-appropriate shows are blocked because they aren't rated. AND it only works with Amazon's videos. I cancelled my subscription.", "verified": true, "helpfulness": "0/1", "author": "T. Garrison \"TG\""}, {"rating": 5.0, "review": "Easy installation & easy to use. Love it.", "verified": true, "helpfulness": "1/1", "author": "S Huntington"}, {"rating": 5.0, "review": "The fire tv is amazing! I absolutely love it. Probably going to get rid of my cable.", "verified": true, "helpfulness": "2/2", "author": "Jen"}, {"rating": 5.0, "review": "Love it.  The voice recognition is very good.  Allows access to all the music and video available on Amazon Prime.  I hope the channel selection increases.  Roku still has more channels available.  Very quick and easy setup.  From opening the box to watching a movie was less than 5 minutes.", "verified": true, "helpfulness": "2/2", "author": "H. Hess"}, {"rating": 5.0, "review": "Awesome.  I bought this for my granddaughter.  She loves it.  Now she does not need to use my Kindle to watch her shows.  😁😁😁😁😁", "verified": true, "helpfulness": "1/1", "author": "Doreen L. Allen"}]