[{"rating": 4.0, "review": "Lots of entertainment- very enjoyable", "verified": true, "helpfulness": "0/0", "author": "LaVerne Bistline"}, {"rating": 5.0, "review": "I have only been using this for a couple of hours now, I received the Fire TV as a gift and so far I LOVE it. We do not have cable and until now only had Netflix on our gaming device. We will be using this for more than just streaming movies and TV. All of the apps that I have already checked out for games, recipes, kids educational games, fitness, etc. that are free are awesome to have, especially when you are a family of 6 on a budget. I think we will get a ton of use out of this device, especially with the blizzard we are suppose to be getting here in Maine tomorrow, I got this set up just in time!", "verified": true, "helpfulness": "1/1", "author": "MrsSerfes"}, {"rating": 5.0, "review": "LOVE IT. EASY TO USEI am going to cancel my premium cable and just get basic because this hat plenty of content for me and I use Netflix with it also.", "verified": true, "helpfulness": "0/0", "author": "JMW"}, {"rating": 5.0, "review": "Very easy set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Peggy Teman"}, {"rating": 3.0, "review": "I purchased this product to stop running my Xbox One all the time to watch Netflix and Hulu.  I performed lots of research, and overall this product seemed to be the best one for my needs.When I first got this product, I was very impressed.  I like the interface and the fact that it is so easy to use and manage all of my favorite apps.  Plus, the free 30 day trial of Prime was an added bonus.  There were some issues, such as the fact that it is impossible to turn this device off; you can only put it in Sleep mode.  Also, a lot of the content available for free on the Prime subscription is only the first season or first episode of a season; everything else you have to pay for.  While this was disappointing, it was not a huge deal-breaker, because I was accustomed to Xbox Live's interface of purchasing and renting movies, and the prices on Amazon are comparable to these.My biggest issue came when I received my internet bill for the month:  this thing eats the bandwidth, which is something I was blissfully unaware of.  After doing some digging, I discovered that it is not the streaming of the device itself that tends to use bandwidth, it is instead the screen saver that plays after you have paused a movie.  I went a whopping 22 gigs over my monthly bandwidth usage, which is a costly price to pay for pretty pictures streaming on my tv!  Further research says that Amazon is aware of this issue and is planning on issuing a software update to correct it; obviously, this has not been completed at this time.If you have the bandwidth to handle this device (if not, you can disable the mosaic screenshot feature, which is rumored to fix it) and are looking for a device to stream your subscriptions, I highly recommend this.  I truly enjoy the other features, I simply wish there had been some sort of indication of the amount of bandwidth this device would use.", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 5.0, "review": "I bought this for my Husband and the whole family loves it.  The voice command gets it right every time.  Its amazing.  Very useful when trying to keep your toddler entertained.", "verified": true, "helpfulness": "0/0", "author": "ahaynes"}, {"rating": 2.0, "review": "Purchased refurbished. The unit arrived in what seemed like new packaging. Item was in perfect condition, really this could have went out as a new device and I wouldn't have been able to tell the difference ( except for the fact that Netflix said it was already registered). So if your thinking refurbished, go for it.The reason I do not like this item, is really more about what I have found out about Amazons service ( Prime Instant Video) and how terribly difficult it is to find non Amazon movies to watch. I somehow had the apparently misguided notion that if you paid for prime, you would be able to stream movies for \"free\" i.e. not paying the annual, plus and additional fee for each movie. Granted there are some free shows, but very little. The final straw for me was finding an older movie, that was $0.00 on Prime instant video, that once started was not in HD, even though the movie itself was available in HD. I stopped the movie and checked the info and wow, for $.99 I could see it in HD. It may be that I had an unrealistic expectation of what I was getting with Fire TV and a Prime membership. I will stay with NetFlix, and Vudu for my viewing.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Great device, easy to connect, but beware - this device could be costly to use and you may find yourself with a access to the internet for a few days each month, or hit with fines or overage charges.. Got this for xmas and initially had a lot of fun with it. Easy to connect, was able to load my prime music library and photos from my cell quite easily.  Eventually had to but a new receiver as it only accepts HDMI ports, no RCA connections. I was able to upload all of my photos from my phone with a few clicks, and having amazon prime music library connected was great.What's not so great:1. Remote although easy to use with on screen navigation , very basic, lacks features such as slo mo, could not figure out how to bookmark a movie if it had to be paused for a long period.2. Syncing feature is a breeze but no options to determine what must be synced. If you have a big library you will find out this can be costly3. No options to block content so had my wife's annoying workout CDs included when I shuffled the library (did not see where one can create unique playlists..but perhaps I just didn't see this option)3. Although prime brags about the thousands of moves available it was not always apparent, and not easy to locate these movies.Std lists are restricted to only a few.4. No options to customize movie searches based on preferences5. Software could benefit from improvements. Eventually switched to using Netflix via Prime as Netflix has better search capabilities and movies were easier to locate.I normally watch 1-2 movies every other night, I have two kids who also watch Netflix. I had also set the sync option on my music library. Half way through the month I received an email from my ISP Comcast that I had reached 90% of my available GBs for the month. I did not even know I had a cap, this has never happened before. There are also very limited options available for tracking and measuring how this data is being used.On Sunday morning after watching 2 movies the day before my limit had jumped to 95%. Immediately disconnected the device.When I called Amazon support on Monday , they could not help, referred me to my ISP. All they could tell me is that the movies via Prime are of higher standard than Netflix and GB consumption rate is high ( between 2-4 GB per move). Amazon could not provide details of how much data usage my syncing/movies download vs movie usage.My Data consumption has dropped significantly ,over the last 10 days have consumed only 2% more.Looks like if I use this device in future I will have to be very picky about what movies  I want to stream, and look for ways to regulate/remove sync processes. and music streaming.", "verified": true, "helpfulness": "0/0", "author": "Anthony C Grey"}, {"rating": 4.0, "review": "it is more labor intensive than just punching in channel numbers, but like every new thing I will get use to it.", "verified": true, "helpfulness": "0/0", "author": "James L. Byrd Jr."}, {"rating": 5.0, "review": "I haven't bought the Amazon Fire TV yet, but after reading all of the reviews I am definitely going to buy one in the next few minutes.  I have to say that I've been an Amazon customer since the first Kindle was released & have purchased many things from Amazon & I have never had an incident that has not met my satisfaction.  I actually had a Kindle for almost exactly a year & it went haywire right as the warranty was up but they sent me a new replacement free of charge.  I've had some other issues but they were minor but so far Amazon has always done right by me.  Thanks Amazon!!", "verified": false, "helpfulness": "1/5", "author": "Shelia Lund"}]