[{"rating": 2.0, "review": "Lost connection every 10 min. Using Netflix through this is like dial up. Pretty bummed", "verified": false, "helpfulness": "0/0", "author": "Lmon"}, {"rating": 4.0, "review": "I have only had for a few days but so far I love it.  Was easy to install and easy to understand.", "verified": true, "helpfulness": "0/0", "author": "Victoria K Johnson"}, {"rating": 4.0, "review": "what little I have had the opportunity to use it I have been very satisfied with its capabilities.  I still have not had a chance to try the games portion of the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "bublehead"}, {"rating": 1.0, "review": "Wow, what a piece of garbage.  We received the package today and set everything up and when we went to stream ANYTHING on Netflix we got an error message that the title we were trying to play is not working right now.  During my attempt to troubleshoot this I was instructed to unplug the box from the wall and wait ten seconds then plug it back in and start over.......IT NOW WILL NOT TURN ON?????  I tried multiple outlets and nothing......", "verified": true, "helpfulness": "4/6", "author": "jeff morton"}, {"rating": 5.0, "review": "I spent some time researching what would be the best for my mom. I am a techy so my first idea was to build one myself, maybe use a rasberry pi or the likes. After some serious reading I decided against this. Ease of use for mom was critical for this project. I decided on the Amazon Fire TV for this reason. The simple install and use of this device is great!. I love the included remote and voice search. Amazon and Netflix buffers up fast and streams seamlessly, with great quality. I have not tried other services yet. I got stuck on the first four seasons of Walking Dead. Got through them all in three and a half days :) . I think i will get a Fire TV myself and then do another solution to grab my content from the NAS and play it on the TV also. That's how much I like this thing. Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "cb40"}, {"rating": 5.0, "review": "Best money spent in a long time.  The fire tv works great, we haven't had any problems at all yet.  And the voice recognition really works!", "verified": true, "helpfulness": "0/0", "author": "Jill A Hutchinson"}, {"rating": 5.0, "review": "This is sooo sick.  It's WAY better than the fire stick if you want to sideload kodi/xbmc.  The stick will have some skipping the TV will not.  TV is WELL worth the money over the stick.", "verified": true, "helpfulness": "0/0", "author": "DayLateDollarShort"}, {"rating": 5.0, "review": "I haven't had much of a chance to use it yet, I have the local telephone company for my internet and telephone and when I plugged it in it shorted out my telephone and when I had a service call they indicated my internet \"office\" wasn't strong enough to support this state of the art equipment.  So I must rethink my internet situation but when I did have it hooked up it was wonderful of what I was able to see and loved the tutorial for a not so computer saavy person. Am anxious to try it again when I have new internet service that is capable of supporting this type of equipment.", "verified": true, "helpfulness": "0/0", "author": "A Customer"}, {"rating": 5.0, "review": "I feel badly for those who are disappointed with Amazon Fire.  I'm 68 years old, read the directions, set it up and began watching Prime shows immediately.  I use my phone for a wireless connection and the entire set up was flawless.  The reception was excellent.  I don't have cable and got rid of it five or more years ago.  I do still have Chromecast and have been pleased with it.  I'll just move it to another tv in my home.", "verified": true, "helpfulness": "1/1", "author": "Camilla Rose \"Camilla Rose\""}, {"rating": 5.0, "review": "Loved it! Easy to use!", "verified": true, "helpfulness": "0/0", "author": "JR Salvacion"}]