[{"rating": 5.0, "review": "4.5 STARS as there is some room for improvement.  Gave it 5 stars to offset some of the low reviews from people who don't own this device.  I received this in the mail yesterday and decided to compare it to Xbox One, so watch my great speed comparison video!(links get removed, so just search for \"xbox one vs amazon fire tv\" at you tube dot com)WOW, the FireTV is over a minute faster following the same script between both devices.  I'm really impressed with how easy and fast the FireTV is.Strengths:- Fast, FAST, FAAAST moving from app to app (did not launch any games though)- Caching speed - seemed to get to HD quality faster than other devices (non-Amazon content)- Amazon's ASAP is very impressive so far (quick to load videos)- Simple, intuitive interface with remote you don't have to point at the device- Great voice search built into the remote (minus .5 stars for not searching Netflix content as well)- Wireless-N 5 Ghz is fast- SPDIF/Optical Audio Output!  Roku, why did you get rid of this?  Don't have to update all my audio equipment to get surround sound!Cons- Limited voice search for most non-native content (i.e., Netflix library is not voice searchable); might improve in time- Game controller is sold separately as a pricey add-on- Would have been cool to include the headphone jack in the remote, ala Xbox One, PS4, and Roku (new father)I love the speed switching through apps.  The WAF is high (wife acceptance factor); she was impressed how quickly I could move from Netflix to Amazon Video, to Plex, to other apps with limited to NO loading and each app essentially is right where you left it.  Quite an opening salvo into the streaming market for Amazon, and there is a great foundation that with some simple software improvement is going to become the device to beat.", "verified": true, "helpfulness": "3/3", "author": "Eric in Florida \"WyattERP\""}, {"rating": 5.0, "review": "I don't know if this is the best $100 I've ever spent, but, if not, it sure comes close.  Setup took five minutes.  Picture quality is stunning.  NO interruptions in streaming.  This is not only a great product -- it's a true accomplishment of Amazon's technical R&D; folks.  A+++++", "verified": true, "helpfulness": "10/11", "author": "Dennis G. \"GPS User\""}, {"rating": 5.0, "review": "As just a normal video consumer, I love watching movies. The Fire is faster than my TIVO for watching Netflix. Huge difference in response and menu selections. And as a Prime member, there's even more movies to watch! My initial impressions are:1. Extremely easy to set up. Just plug it in and it automatically connected to my Prime account2. Very fast interface. Faster than what I'm used toThis was well worth the money spent and I'm suprised by how much I like this little box!", "verified": true, "helpfulness": "8/9", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I own a Roku 3 and the Apple TV.  The Fire TV, along with the Roku 3 and the Apple TV are all now connected through separate HDMI ports on the same HD television which is located a floor above and approximately 40 feet away from AT&T; wireless router.  Speed tests show a consistent signal strength of 14-16 Mbps at this location.  The Apple TV streams Netflix far better than either the Roku 3 or the Fire TV.  The Fire TV streams Netflix the worst of the three.  The Fire TV streams Amazon Prime better than the Roku 3 (Apple TV does not support Amazon Prime).  Although not directly related, as the Fire TV does not yet support HBO Go, the Roku 3 streams HBO Go better than the Apple TV.  As for Showtime Anytime, the Fire TV streams it better than the Roku 3 and has a better user interface (fast forward and rewind, especially)...and Apple TV does not support Showtime Anytime.  Hulu Plus streams best on the Roku 3, followed by the Apple TV, and lastly the Fire TV.  Youtube streams equally well on the Roku 3 and the Apple TV, but f a r worse on the Fire TV.On the Fire TV, Amazon Prime videos load no quicker (the so called ASAP feature) than on the Roku 3 (it still requires buffering).  The voice search on the Fire TV only works with Amazon Prime, but to my surprise, can also be used for searching for apps and games.  The Fire TV Game Controller works great, and the game selection and graphics are a pleasant surprise (and it also makes me happy that many of Amazon's free apps of the day that I have been collecting for well over a year now can be put to use).I also have a Kindle Fire 7\" HDX and a Kindle Fire 8.9\" HDX.  The screen mirroring function on either tablet I have only been able to get to work two or three times out of about a dozen attempts.  Also, the Fire HDX feature of being able to fling Prime Instant Videos back and forth between the tablets and the Fire TV has only worked on a few occasions over about a dozen attempts.My Verizon HTC One M8 pulls in between 40-55 Mbps when on Verizon's network (I have a tower behind my yard).  When I connect the Fire TV to the the phones mobile hotspot, Netflix streams much better than when over my 14-16 Mbps Wi-Fi network (if you recall, the Fire TV came in last for streaming Netflix of the three devices over Wi-Fi).In summary, I will use the Fire TV for Amazon Prime, Showtime Anytime, and gaming...the Apple TV for Netflix and YouTube, and the Roku 3 for HBO Go, Hulu Plus, and YouTube.", "verified": true, "helpfulness": "4/6", "author": "James N Tresler Jr"}, {"rating": 4.0, "review": "First of all, set up was a breeze without complications.  Picture quality was fantastic.  I am a Amazon Prime member.  This is a very fast video streaming device compared to ATV.  The interface is good with Amazon Prime options.  What I am really disappointed in Amazon is the amount of money they are charging for many of their streaming movies.  A lot of these movies are greater than 10 years old, but you are still paying $3.99 per video.  Many of the selections should be free as you are paying $99 for Prime in the first place.  Yes, they can get you your purchased \"prime\" items in two days, but there is also a price premium tagged onto that \"Prime\" item.  I don't feel like Amazon Prime is such a deal any more.  I would like to see more free options on Fire TV for those who are Prime members.  So the player is great, but not such a great deal.  I sure hope they ramp things up in the future.April 22 Update:This really is a great streaming device.  I'm real enjoying it.  Although the games are limited, and not very technical, they are fun for me and my 8 year old daughter.  The picture quality is excellent.  The voice recognition can be operated by my 8 year old flawlessly.  Very impressive.  I think I will grow to like Fire TV more and more.  Almost to the point where I might invest in the Kindle Fire HDX.  I'm normally and Apple guy, but I'm enjoying all of the features here as well.  Gotta tell you, DIRECTV has really upset me the way they are renting new movies two to three nights at a time for $7.99  or more.  Feels like a scam and I think it is.  At least with Amazon and even Apple, you can rent movies for one night at a much lower price.", "verified": true, "helpfulness": "1/2", "author": "P. J.uii \"justanovice\""}, {"rating": 4.0, "review": "I have a Roku 2 and Roku 3 and I loved them.  I have Chromecast and tested Apple TV. eh. The Fire TV is hands down the fastest and most powerful. It also has the dolby digital optical out which connects right into my amp.  The Fire TV is the best at combining all the various features (movies, channels, apps, music, pics) into 1 experience. The UX needs a bit of work as its easy to get lost with all the features (ex took me a while to figure out where to see what music app was currently active).  I also need a section for my most used stuff across features. I love how it uses standard Android Apps like Roku and others. (Big flaw of the fire is the Kindle Fire specific android versions of apps). All of the various services that amazon has are more neatly blended into this device than any other to date. It gives a good glimpse into the ecosystem that is coming together (albeit slowly).  Very cool.Short story is I can see how Amazon will be releasing software updates to this very powerful box incrementally improving the experience from good to great.", "verified": true, "helpfulness": "1/2", "author": "Steve \"SDA\""}, {"rating": 5.0, "review": "Very fast, improvements over the Roku interface. I'm a little disappointed that there isn't an Amazon music app on the device, but I assume it's coming soon. Voice search is great, it's gotten just about everything I've spoken to it so far. Overall great purchase.I'm not sure it's a game changer, but if you don't have a Chromecast or a Roku, and you use Amazon for Prime and movie and tv library, this is your best bet.", "verified": true, "helpfulness": "3/4", "author": "Jason C. Hawthorne"}, {"rating": 5.0, "review": "Since I don't own 3 rokus, 2 apple tvs and a chrome cast in a pear tree, I can't compare this with any of them. This is my first box. I used to run my laptop to my tv through HDMI until a storm surge took care of that port. This gives me the opportunity to watch movies on tv again.In case you use the parental control and did what I did .... I don't have kids, but wanted to prevent company from accidentally (?) renting a movie, so I activated it. Unfortunately, I had to enter the PIN every time I wanted to watch a prime movie or one from my cloud. In settings, you can turn off PIN protection for amazon movies, but still have it active for renting or purchasing. Nice idea.Why a 4 star? Inability to search prime only movies, and it would be nice to have a qwerty keyboard for typing searches instead of a line keyboard. While it would take up a little more room on the screen, the extra speed of entering search data would be most appreciated.Other than that, this is definitely a good buy.UPDATED 4/6/14After another day of use, I have bumped this up to a 5 star. Most of my searching for prime movies happens when I'm online, so I really don't need that feature in the box. And as far as the keyboard, I only use it for youtube, and it saves my searches.", "verified": true, "helpfulness": "1/3", "author": "SeventhSon"}, {"rating": 5.0, "review": "This blows every streaming device in market. I dont usually spend time on reviews. But this device made me do it.", "verified": true, "helpfulness": "5/7", "author": "sam1434"}, {"rating": 5.0, "review": "I just received my Amazon Fire Tv box. The unit is small in size so it will not take much room. I had to buy an hmi cable to connect to the led television. It was easy to set-up and Amazon per install my account but, if you buy for a gift then they must set-up an account. I moved it around to the two stores I worked and everyone was star struck how the voice command work . Also how fast it works. I will up date as I use it.", "verified": true, "helpfulness": "3/3", "author": "FAST FRED \"FAST FRED\""}]