[{"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "James W."}, {"rating": 2.0, "review": "Perhaps it was just me not researching properly but I assumed that with the Amazon Prime membership there would be a much larger selection of more recent content available for streaming. Several TV shows I follow are only available for streaming via Prime for season 1 and they are currently going on seasons 3 to 6. Movies available for Prime streaming seem to be a number of years old in many cases. Again it was my mistake for not researching properly.I really like the idea of having everything available to me through one provider (ie: Amazon, kindle). Their products and shopping services in my opinion are fantastic. The implementation of accessibility to features and content seems to be extremely lacking. I hope that some consideration will be made to make Amazon Fire TV worth it when maintaining an Amazon prime membership.", "verified": true, "helpfulness": "0/0", "author": "Robert Vogel"}, {"rating": 5.0, "review": "I love this thing! I finally watch tv again and enjoy myself doing so! It's perfection", "verified": true, "helpfulness": "0/0", "author": "MPH"}, {"rating": 5.0, "review": "Works as expected; especially great for Prime Members.", "verified": true, "helpfulness": "0/0", "author": "NicaSuave"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "liliana padilla"}, {"rating": 4.0, "review": "Love it! Only problem I have with it is that  it can take a while to load. Other than that it's awesomd.", "verified": true, "helpfulness": "0/0", "author": "luz m villasenor"}, {"rating": 3.0, "review": "I've only had Amazon Fire TV 3 weeks so the jury is still out.  Some initial observations: 1. The selection of free Amazon Prime movies/TV shows (videos) is fairly limited, maybe 150 - 200 total.  Since this covers all genres, not a whole lot I am interested in.  2.  The rest you pay to watch and add to your library.  3.  The total AF library is huge.  I found an obscure Italian film from 1963, but it still costs around $4 to watch.  4.  The AF box won't turn off.  It's supposed to be automatic,  but stayed on all night.  The box gets very hot.  5. Watching is a joy.  Seamless movement thru spaces where commercial s would have been.  High quality HD.  We watched 4 seasons of Falling Skies in about a week, watching 3 - 5 episodes a night.  6. I am not a gamer, but if you are, get the game controller.  7.  AF TV may have more utility in the future.  For now, it's a nice expansion of viewable programs.  Works great  with my 2003 Sony Bravia TV and home wifi. With the HDMI cable sold separately.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Allows you to watch movies and TV shows Amazon. You can also mirror games.", "verified": true, "helpfulness": "0/0", "author": "Jeannine Iles \"Jeannine\""}, {"rating": 5.0, "review": "Wow this is amazing...its the best Christmas present ever & I bought it for myself. Works great with my Kindle Fire HDX 7. The mirroring feature is Incredible; it's like having your own projector at home.", "verified": true, "helpfulness": "0/0", "author": "mrDave"}, {"rating": 4.0, "review": "Only use it for tvmc. Works great though!", "verified": true, "helpfulness": "0/0", "author": "austin ulrey"}]