[{"rating": 5.0, "review": "Setup is simple. Came pre configured to my account so I didn't even have to sign in. Small and sleek. Quad core processor makes it super fast. Video quality is awesome. Gamin g graphics are amazing. Multi player function with me on the console and my some on the Kindle Fire is flawless.Voice recognition works great. Whats not to love.", "verified": true, "helpfulness": "1/2", "author": "Tim McGuire"}, {"rating": 4.0, "review": "I was following the live blog of the Amazon event because I was very excited about this product.  I own 2 Roku boxes, an Apple TV and a Chromecast.  Each of these boxes serve a purpose and I was excited about the horsepower and having a box that would be user friendly for my wife and kids.  My kids use the streaming boxes a lot for watching kids shows and the Roku allows us to search for a program and the results will show across all apps and it allows us to find who is serving up that content for free at the time (Barney was removed from Netfilx for a few weeks last year but was on Amazon Prime).  As soon as I heard the search did not function like that I had to cancel my order.  I would rather cursor over a grid of letters than have to search within 3 or more apps.  I like Amazon and they have great content like Downtown Abbey exclusive but guess how I found that they streamed Downtown Abby for free, yep Roku universal search.  Amazon, please add this feature and I will have one of these on each TV in my house.  Sorry for the long winded \"review\" that is actually a feature request but you have a great box that is missing a key feature for those of us that have Amazon, Netflix, Hulu Plus, Vudu and other accounts, all paid.", "verified": false, "helpfulness": "5/14", "author": "M. Green \"MDG\""}, {"rating": 2.0, "review": "I love Amazon and have been a Prime Member for years. I've been putting pleas by my girlfriend off to purchase a Roku, waiting for this Amazon product. What a disappointment.I bought this product last week with access to Netflix streaming as a prime reason. I've been a Netflix DVD user since the beginning of Netflix. I was excited to finally watch House of Cards.Several disappointments:1. Bluetooth interface is incredibly slow. Using the screen keyboard was painful because it was so slow. It took forever to get things setup.2. No option to set up DHCP for a hardwired Ethernet connection. I was forced to do a wireless connection given my internal IP addresses are assigned dynamically by the DHCP and not fixed. The only way the FireTV can be set up is with a direct Ethernet connect to an ISP, inputting all of the necessary ISP IP addresses.3. I changed my Netflix subscription to include streaming and the only option I was given to watch the first season of House of Cards was to purchase individual episodes at $2.99. What a rip!!! This issue was also brought up in the New York Times review. Maybe my anger should be directed at Netflix and not Amazon for the kind of marketing deal Netflix cut with Amazon, but this was a huge disappointment.4. The Help and Support on the Amazon web site is woeful, and that is being kind. It is one of the most incomplete support sites for a hardware product I have ever had experience with. It's shameful.I am seriously thinking of returning this product.", "verified": true, "helpfulness": "9/18", "author": "Bruce Ryon"}, {"rating": 4.0, "review": "Firstly, I do own an Apple TV box, and formerly a Google TV, but not Roku, so my expectations were based on those experiences.  I have Prime, and have purchased many Amazon MP3 store content, as well as uploaded a little of my own music to their cloud.  As most people will have this hooked thru their AV system, I find it amazing that Amazon could not at launch have provided their own MP3 cloud player app to allow access to ones content through the Fire TV.  I'm sure they'll get around to it, but it still sorta spoiled the otherwise great initial experience, since Apple allows full access to ones iTunes library, a great no-ad Radio feature (listening, Amazon?), as well as to personally uploaded content to iCloud.  The voice search is nice, but needs to get much smarter.  Maybe I'm spoiled with Siri.  Yes I can say \"Pandora\", but why not \"Pandora..Beatles channel\", for example.  I'm sure Amazon is refining, but again it would have been nice to have a more polished product out of the gate.  The interface is quite serviceable, if not elegant.  I just wish ones app could be more prominent on the home screen, rather than several clicks away.  Overall I really love this purchase, and for a first effort, it's as good as I had hoped for (except for the Amazon music cloud support)  I have much faith that Amazon will soon make it really shine.", "verified": true, "helpfulness": "4/4", "author": "JohnMac"}, {"rating": 5.0, "review": "The shipment was very fast and the installation was easy!!! I absolutely love it!!!! This is a great way to watch Netflix and Hulu Plus. I am a satisfied customer!!!", "verified": true, "helpfulness": "2/3", "author": "Tammi"}, {"rating": 5.0, "review": "I have only been using it for 2 days but my experience thus far has been FANTASTIC! The packaging smacked of Bose, quality, simple instructions and \"everything just works\". I love  the \"Voice\" feature and I could not be more please!", "verified": true, "helpfulness": "2/2", "author": "bbeale"}, {"rating": 2.0, "review": "The Fire TV is a tough sell to someone like me in the first place. I have an Apple TV, various game consoles and a Mac Mini that all make it quite superfluous for my streaming needs. I bought this as a bedroom streaming box (the only way I could justify it). Part of my issues with it is with the Fire TV itself, part is a third party app that doesn't work and is an absolute necessity.My main problem with the Fire TV is its user interface. I own a Kindle Fire HD, so I understand that this is a means for Amazon to sell you their content, and I'm fine with that. The problem is that, while the content peddling is off in the periphery on the Fire HD, it is cluttered all over the interface of the Fire TV. Your own content, whether apps or shows already purchased from Amazon, are given a backseat to all the new stuff Amazon hopes you'll buy. I understand the strategy, but they should have found a way to push their marketing without degrading the user experience. The best analog I could provide is the latest Xbox 360 dashboard: 90% ads and 10% tiny boxes of your current content. It leaves the whole thing feeling more like a paid beta than a finished product as I can rarely find what I'm looking for quickly.Second, the Netflix app is clearly broken. I realize this is not Amazon's fault per se, but by not establishing some design guidelines (or, apparently, having any quality control over apps released on their platform), they've neutered what is my (and I imagine most people's) primary streaming service. I know Netflix is ultimately to blame here, but I can't help but wonder if Amazon could have pushed for a more reliable app if they weren't trying to peddle their own wares.I'm currently torn between sticking it out for a while with the Fire TV or returning it and buying another Apple TV. The Apple TV has its flaws as well, but the UI is dead simple and it is one of the most reliable pieces of tech I've ever owned.My recommendation: if all you use for streaming is Prime Video and you have a lot of digital purchases through Amazon, this is probably a good fit. If you're hoping to use other services as well, you may want to look elsewhere.", "verified": true, "helpfulness": "7/11", "author": "Anthony Arakelian"}, {"rating": 5.0, "review": "I LIKE THAT BECAUSE SEEMS FASTER QUADCORE,BUT I WOULD LIKE TO USE IN  MY TV TO NAVIGATE INTO INTERNET,,PLS LET ME KNOW,TKS", "verified": false, "helpfulness": "2/15", "author": "DORIVAL MOURA"}, {"rating": 3.0, "review": "I will not be making a purchase of this product until Spotify is available.  How can you launch a product like this without one of the largest music services? Blows my mind", "verified": false, "helpfulness": "1/10", "author": "C. Smith"}, {"rating": 5.0, "review": "I'm your typical middle-aged woman - I don't game, and I'm not super tech-savvy by any means....so take this review for what it is. The Fire TV was easy to install and I'm loving all the features, free movies, music and simple interface - this thing even has a screen saver that comes on when you're listening to music! We've always just had our Comcast cable service without DVR and occasionally used Comcast OnDemand to watch/rent movies - but I'll never watch from Comcast again. The voice recognition software is amazing and brought me to exactly what I was looking for every single time I searched. It's just so easy to find what you're looking for (unlike Comcast), and since I'm an Amazon Prime member most of what I want to view is free - oh and for the new release movies the cost to \"rent\" from Amazon is on average cheaper than Comcast OnDemand by a ~$1 or more. So happy with this purchase!", "verified": true, "helpfulness": "10/918", "author": "Mandy"}]