[{"rating": 5.0, "review": "Outstanding.......", "verified": true, "helpfulness": "0/0", "author": "Paul Arroyo"}, {"rating": 4.0, "review": "Great product. Packaging or the device is very sleek and fitting. Simple to set up. Love the screen saver feature. Only issue I had with this is that it shows the \"paid\" versions of shows first and the option to view said show for free as a prime member is somewhat hidden", "verified": true, "helpfulness": "0/0", "author": "g.Garcia"}, {"rating": 5.0, "review": "I really love the Fire TV. The user interface makes it easy to browse. The voice input for search is excellent and hands down better than having to key in what you are looking for. The two things I like best are the remote control, which smartly has only seven buttons making it easy to operate by touch in low light and the superior customer service. I had one question about setup and when I used the help feature got an immediate call back from customer service. I wish all devices were engineered as smartly.", "verified": true, "helpfulness": "0/0", "author": "Raymond J Sysko"}, {"rating": 5.0, "review": "Probably the best streaming media out there right now, price is very reasonable, fast and have most of what you really need anyway. The talk feature is probably the best selling feature of the unit and that is not a problem, because it works pretty good for me. I love it....", "verified": true, "helpfulness": "0/0", "author": "Techguy1908"}, {"rating": 5.0, "review": "Definitely plug and play. Couldn't have been easier to set up or to use.", "verified": true, "helpfulness": "0/0", "author": "C S Willson"}, {"rating": 5.0, "review": "It does both Netflix and my Amazon instant video.", "verified": true, "helpfulness": "0/0", "author": "matt newman"}, {"rating": 5.0, "review": "Much faster than ATV2. Much easier to install XBMC. I wish XBMC was a native app. As usual, with a little patients XBMC work perfectly!!  Would like to see HBO Go as a native app as well.", "verified": true, "helpfulness": "0/0", "author": "Joe C."}, {"rating": 3.0, "review": "If you are already an Amazon Prime member, it would be helpful. There are a LOT of movies there! It is easy to install and operate!", "verified": true, "helpfulness": "0/0", "author": "Mariellen B. \"Mariellen\""}, {"rating": 5.0, "review": "Wow! GOt it as a gift and I am totally impressed by it.  Stream movies off Netflix or just rent them from Amazon.  It's a winner!", "verified": false, "helpfulness": "0/0", "author": "Debbie Orona"}, {"rating": 5.0, "review": "Easy to setup, easy to use.", "verified": true, "helpfulness": "0/0", "author": "osk"}]