[{"rating": 4.0, "review": "I've been a fan of Roku for the longest time. I have tried Apple TV and Chrome cast and have always gone back to Roku. It was time to get a new Roku 3 until I heard the announcement of this product. Pro's and Con's below based on this and the Roku 2.Pro's for Fire TV:MUCH faster.  It's pretty damn fast. Within a second or second and a half transitions.Buffering is almost non existent. It takes a couple seconds to load a show.Interface is pretty easy to learn. Very well balanced.Speak to find option is fantastic. I got so tired of typing in what i was looking for. The voice search is AMAZING!Small sleek box. It's very simple, semi heavy, but pretty good looking. And not PURPLE. :)Cons for Fire TV:Very limited apps currently. I'm basically limited to Hulu Plus, Amazon Prime and Netflix out of my preferred selections. It could use more like HBO Go and similar. Not very many to choose from right off the bat. But I am sure this will grow in time.Once in a while the video will freeze black, but the audio will still play. I am not sure if its a glitch or a buffering problem. If it persists I will have it replaced.The one big con I have is the Amazon Prime accessibility. It's very easy to confuse a selection with an actual purchase. The pricing needs to be more clear, and they need more steps involved when you purchase a show. It's too easy to accidentally purchase a show, or for someone who doesn't own the account to purchase something. It needs a better verification procedure for Amazon Prime videos.All in all 4/5 stars easy.  I would definitely recommend this to anyone. It's easy to use and extremely fast. Enjoy! I hope this helped!", "verified": true, "helpfulness": "1/2", "author": "Gabe"}, {"rating": 2.0, "review": "Let me start my review by stating that I am just a plain old tv watcher. I am not a techie by any means nor am I a gamer. I do not know what hulu, verve, plex or any of the others are. I have never owned a Roku, Apple TV, chromcast or any other device.I chose to buy Amazon's Fire TV as I love all things Amazon. I am a proud Prime user, on my 3rd Kindle etc.After an easy set up of the Fire TV I am now returning it and let me tell you why.First- after hooking it up I could not find it on my TV- oops- turns out I have to manually switch between video inputs on the side of my TV to find it - big hassle as my remote from Time Warner Cable does not have a video input switching mode on it.then when I searched for Prime movies and TV shows each one wanted me to pay to watch it per episode, per movie,  or $24.99 for the season- either I was getting ripped off or I had no idea how to find the free versions because on my iPad and iPhone they are free.I decided that it was too difficult to do this with my novice knowledge and that Cable TV and On Demand would have to suffice until I trade my old TV in for a new Smart TV.", "verified": true, "helpfulness": "9/18", "author": "Redondonan"}, {"rating": 4.0, "review": "I got Amazon Fire TV for my bedroom, because the cable box was too noisy.  The setup was nearly instantaneous even with the update.  The unit is small.  The menu is easy to navigate. And as an added bonus, the screensaver has absolutely gorgeous scenes that are worth watching in their own right.  I plan to get a second Amazon Fire TV next month for my family room.  Once HBO Go is on Amazon Fire, it will be worthy of five stars.", "verified": true, "helpfulness": "1/1", "author": "CaliGirlPNW \"Cynthia\""}, {"rating": 3.0, "review": "The product so far performs as expected. Except for one problem:It would not connect to our wifi, or rather it would connect to the router, then say it could not connect to amazon.com, then ask to try again promptly forgetting the network key you just entered, and after the 10th time you know for a fact is correct.The only way I could get it to work initially was via a wired connection and setting that up was not intuitive. Once that was done it downloaded an update and was able to connect the wifi, but having connected to the 5Mhz band it was blank screens. I switched to the 2.4Mhz band, and it was ok, although this is not optimal. If anyone has any advice it would be great. I'll adjust my rating if I can connect to 5Mhz band.Anyway there IS a bug with the setup right now, so unless you have a wired connection you could use, you might run into trouble until they iron out the bugs.My other concern however is HOW did it have my account information without me entering anything? Are they really programming each one before shipment? (that would be very impressive) I have a dynamically assigned IP address so I don't think they could map it that way, although that could conceivably work since I had longed in during this IP lease. Anyway I find this a little disturbing not knowing how they did it. Not as disturbing as the NSA, but disturbing.", "verified": true, "helpfulness": "1/4", "author": "J. Patterson"}, {"rating": 5.0, "review": "Wow!  That pretty much sums up our reaction after installing our new Amazon Fire.  A little background: we have been using Amazon Prime for about a year via my trusty PS3.  No problems with it.  Decided to take a chance with the Amazon Fire.I have to say that the installation process was very smooth.  One of the best I've experienced in the years I've been configuring PC's and other digital devices.  After walking me through a brief video about how to use the remote, the setup routine even knew to whom it was connecting without even entering a user ID. (Note: there are parental controls to restrict access)  Once installed, we very easily called up a movie to test it out (Saving Mr. Banks).  Our Amazon Fire is connected to a 37in 720p TV so I expected the picture to be OK.  I have to say that it was much better than I expected.  It should be noted, however,  that our house has a hardwired network running at 1gigabit.I have no ties to Amazon nor am receiving any compensation for this review.  Of the technical devices that I have installed over the years, this one was by far the easiest to install,  I believe that the Amazon Fire has raised the bar for successful implementations.", "verified": true, "helpfulness": "1/2", "author": "David Nickell"}, {"rating": 4.0, "review": "I rated the Amazon Fire 4 Stars simply because they didn't have a half star. The Amazon Fire TV has met all of my expectations. It is fast, and easy to set up and use. We are able to surf through programs much faster and find what we want. The voice search is an excellent feature and I will use it every time I search. The videos stream seamlessly and the high definition images are wonderful.That said, there are only two things I would like to see in the future.One - I would like the home page search feature to be able to search not just Amazon Prime, but Netflix, Hulu and others as well.Two - I would love to see Amazon offer a greater selection of movies for customers who buy the Amazon Fire as a thank you for purchasing their product. This in my opinion would provide even more incentive for people to exchange the devices they are currently using for Amazon Fire.", "verified": true, "helpfulness": "1/1", "author": "Janette I. Bryant \"mj34jc\""}, {"rating": 4.0, "review": "Took me no time at all to unpack and set this up. Whip!, zip! and snap! as they say on the box (They don't say that but it does sound better than what they do say)I had it all unpacked and ready to go in less time than you could imagine. Nevertheless it refused to communicate with my router no matter how hard I tried or how many different passwords I added that my router provided me with. I could connect no problem with the internet and my computer but not my router though my own home network. Problem was NOT with the Amazon Fire TV part it was my stinking hateful spiteful router. It torments me every time I add a new computer or device to the network. The guest connection sets right up no problem but the trouble with that is there is no way to enter an alpha numeric password from the home screen of the Fire TV. (There is but you have to think to locate it)I finally gave it up and went about my normal moronic ways of watching odds and bits of TV and in so doing discovered how to connect to You Tube through my computer using my guest wifi. Yay! Small victory and then off to bed.Maybe I was visited by the cyber fairies during the night or something but I finally discovered a way to defeat my router and connect directly to my home network on a more or less permanent basis.This was entirely the fault of the router and nothing to do with Amazon's product. That router has vexed me for years now and every time I buy another new router I always somehow end up with the same set of problems so it's the brand of router.. It shall remain nameless.But now that all is well and it only took a few minutes and the Amazon Fire TV works as advertised and I'd say a little Better on my wide screen TV.I'm not new to this crab boil as I've been setting these up since 1993 and I knew it wasn't a problem with the device.Amazon does have a winner here but my one small itsy, bitsy complaint it's the bleeding remote. It's a piece of rubbish! (IMHO) and that needs some work. I haven't tried the voice part yet so that might just tip the scale a little in it's favor. I talk to my phone not to my computer accessories. I've tried 'texting' and it just seems wrong somehow. I can see the need but just cannot bring myself to pay that much money to use a device normally used for speech. I swear at my computer but I don't talk to it.Buy the Amazon Fire, You will not be disappointed and it is a great value. I'll try talking to it this evening. Maybe one of us will feel better. I might come back and give this another star.", "verified": true, "helpfulness": "0/0", "author": "Richard G. Redfern"}, {"rating": 4.0, "review": "light the keys!put a hole in the remote so we can hang it somewhere!I like the voice control but it does not work on Netflix! or Hulu", "verified": true, "helpfulness": "0/2", "author": "sidney meyer"}, {"rating": 1.0, "review": "Is there a trouble line?  We have it hooked up but it won't move to the WIFI.  We need help and can't find any help line.", "verified": true, "helpfulness": "7/21", "author": "Kathey Coonce"}, {"rating": 4.0, "review": "This is my first experience with a streaming product. I found the setup was not too difficult because computers and internet are heavily in my background. I found that I wanted more written documentation to explain how the box works, what the memory limitations really amount to, and what Amazon coins are and how they relate to my Amazon Prime. I have a 12mb DSL link and was concerned that it would not be fast enough. Some of the streaming delays are probably related more to internet delays rather than due to my download speed. It's too bad that I can't use my xbox controller since the Amazon one is almost a direct copy of the xbox but not as comfortable to use.It is yet to be seen if they can come up with fps games like Halo, Modern Warfare, and that genre. Sevone certainly doesn't. I have watched two Prime eligible movies and have had no streaming delays. I guess I won't give it a full five rating based on the lack of what I consider good documentation.", "verified": true, "helpfulness": "1/2", "author": "Charles B. Gossett \"deslhog\""}]