[{"rating": 4.0, "review": "I am a big fan of the fire tv. With 2 gigs of ram streaming most video is not a problem at all. I have owned this almost since day one and I highly recommend it. The only flaw that I see is the storage is so limited. One or two games fills it up and then it's bogged down so much it's useless. I truly wish they would open up the USB slot so that you could expand the storage. Or at least sell devices with that  capability. Now the only option is to root the device.", "verified": true, "helpfulness": "0/0", "author": "Mr Coffee"}, {"rating": 2.0, "review": "I'm so disappointed.  I bought this so I could mirror from my Surface device.  I replaced my Roku just for this purpose.  Either it doesn't work or its so complicated I can't figure it out.  I'm returning it but I can't get my three hours of trying back.", "verified": true, "helpfulness": "0/1", "author": "Red Dolan"}, {"rating": 5.0, "review": "Fantastic customer service.", "verified": true, "helpfulness": "0/0", "author": "Proletariat"}, {"rating": 5.0, "review": "Love it, always watching something now.", "verified": true, "helpfulness": "0/0", "author": "Matthew Marquez"}, {"rating": 5.0, "review": "Works great and we are cable free", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "Definitely makes entertainment easier!  We used to run a couple of devices for Amazon Prime, as well as Netflix, and the Fire TV has made it very convenient by having it all in one location.  I applaud Amazon that although Netflix could be seen as a competitor, they make it convenient for us as the customer by having the Netflix app available to us.", "verified": true, "helpfulness": "0/0", "author": "GSC"}, {"rating": 4.0, "review": "Very nice!", "verified": true, "helpfulness": "0/0", "author": "mike myrick"}, {"rating": 4.0, "review": "I have generally enjoyed the Amazon Fire TV, but it does seem to lack a number of apps that other manufacturers provide such as access to the major networks for next day viewing.I think they also could stand to improve the menu screen to permit the user more control over it's appearance and to allow for the creation of user Favorites.Finally, give us Apple iPhone and iPad users a break, and start permitting Apps that interface well with this device.", "verified": true, "helpfulness": "0/0", "author": "Kevin K. Gipson"}, {"rating": 2.0, "review": "Device will not work with Hulu Plus. Tech support was of no help. I would not recommend this device for anyone who enjoys Hulu Plus.I'm stuck with a $100 boat anchor.", "verified": true, "helpfulness": "0/1", "author": "Thomas Phillips"}, {"rating": 5.0, "review": "Quick setup and does exactly as advertised.", "verified": true, "helpfulness": "0/0", "author": "Walter McPhearson"}]