[{"rating": 3.0, "review": "I've only had Amazon Fire TV for one day so far, and while there are a lot of things I like about it (voice activated search, compatibility with prime, bigger remote than Apple TV), there are a few things that are aggravating. First of all, the HBOGO app has limited providers that you can sign in with (Dish and DirectTV are listed, but not Charter or Comcast). Secondly, Walking Dead available, but you have to pay for the episodes, and there doesn't seem to be an option to log in with your cable provider like with Apple TV (also meaning I can't seem to watch Better Call Saul, bummer). Lastly, and not surprisingly, there is no similar function to AirPlay if you have an iPhone....so overall I feel like I'm missing a lot compared to AppleTV. Hopefully they will fix some of these quirks in the future without me having to switch out my iPhone for an Android (I keep hearing HBOGO is going to be available without a cable subscription, we'll see!).", "verified": true, "helpfulness": "0/0", "author": "A. Johnson"}, {"rating": 5.0, "review": "everthing worked as advertised, easy setup and now I can go back to basic cable", "verified": true, "helpfulness": "0/0", "author": "tom scarrow"}, {"rating": 5.0, "review": "Excellent product. Plays Sling TV and other apps very well. I Would like a way to reboot my Fire TV with my Harmony One Smart Remote and/or have the Fire TV reset every night after waking from sleep.Seamless integration with an Amazon Prime account. Would like better seperation between my prime and non-prime content.Love that I can side load applications. Main reason I purchased this Fire TV and didn't purchase an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "GadgetGuy"}, {"rating": 3.0, "review": "I have use a PS3 to watch Netflix and Amazon Prime videos for some time now. I must say, the Fire TV is superior in almost every way. It is faster, much easier to switch between apps, and there are a far greater number of streaming services available. I have to complain about one thing, however, why on earth do I have to manually reconnect when I lose wifi signal. My internet service goes out from time to time and I will briefly lose signal, why do I have to tell it to reconnect? This is the only device, out of several, with which I have ever had to do this.Someone completely dropped the ball on this one. If wifi reception was better I wouldn't be near the problem it is, but reception is terrible with this thing..The more I use this thing the less I like it. I lose wifi reception sometimes 20 times during an hour. This is in the same place my Playstaion used  to be and it seldom lost reception. I may have to quit using it altogether.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"That's Me\""}, {"rating": 4.0, "review": "The fire tv has been a great addition to my living room as the interface for amazon prime is as good on the ps4 and I did not want to power on the ps4 just to use prime.Since this offers a lot of the same services as I had with the PS4 I use it for netflix, hulu plus and amazon. I like that it is linked to my amazon music as well so it can be a great media player too. The addition of the lyrics on screen for most songs is good too as it makes you want to sing along.If you dont need the speed of the higher cpu and ram on it, you can get away with just getting a fire stick since the voice search feature only shows things you can watch through amazon or buy and you can use it with the fire tv app on your mobile phone.", "verified": true, "helpfulness": "1/1", "author": "Amazon.Buyer \"Never argue with an 1d10t...they will drag you to their level and beat you with experience!\""}, {"rating": 5.0, "review": "Refurb was great.  I love the Fire TV and I have purchased a new model, but I wanted a second one so I tried the refurb.  Just get the refurb and save yourself some money.  It was absolutely 100% new looking and in perfect working order.", "verified": true, "helpfulness": "0/0", "author": "Cha O'Connor"}, {"rating": 5.0, "review": "Highly recommended - no commercials, gotta love that", "verified": true, "helpfulness": "0/0", "author": "Evelyn"}, {"rating": 5.0, "review": "I am happy...thats easy to navegate and right now ...after the firts one had problem.", "verified": true, "helpfulness": "0/0", "author": "GERMAN ARAQUE"}, {"rating": 4.0, "review": "I've had this almost a month now, having purchased it to replace a Roku 3 that I was having problems with after a year.  I originally bought the Roku 3 so I could get English subtitles or SDH with Netflix streaming for movies in English, since I have a hearing problem.  Both my HDTV and Blu-Ray player can get movies streamed directly from the Internet, but not Netflix subtitles.  After a year I was having problems getting the Roku 3 to acknowledge it's remote after switching back to it after having switched the TV for a while to the Blu-Ray player or the cable box.  I do not have this problem with the Amazon Fire. In fact it comes up instantly when I switch back to it and hit the \"home\" button.  The Amazon Fire also can display subtitles from either Netflix or Amazon Prime.  I haven't watched anything else yet.  An additional advantage of the Amazon Fire is that it has an optical audio output.  I can connect this to my surround sound system while using the HDMI to send video to my HDTV.  Roku 3 does not have this capability, so with it I could only use the TV audio.  (My surround sound system only has one HDMI port with pass through to the HDTV.  My Blu-Ray player is connected to this port.)  I would have given the Amazon Fire a 5 (or higher) except for one software problem.  It does not have anti-repeat sub-routine for the \"pause/play\" button.  If you hit it too fast, there is no response.  If you hold down too long, it cycles.  The software need to look for a transition from 0 to 1 instead of looking at the level.  I haven't seen this problem in an operator interface for a while.  (The same is true for the \"select\" button for some functions.)Correction:  The above problem only occurs when using the Fire with Netflix.  It works properly with Amazon Prime.  I don't have this problem when streaming movies to my computer from Netflix.", "verified": true, "helpfulness": "0/0", "author": "Donald E. Dozer"}, {"rating": 5.0, "review": "best money ive ever spent!!", "verified": true, "helpfulness": "0/0", "author": "Timothy Overton"}]