[{"rating": 4.0, "review": "Unit is fast, powerful, and easy to setup.  Definitely a deal for the costCould be improved by- Allowing you to set different passwords for amazon prime content and amazon's purchased content- Making it easier to search/sort between prime content and amazons purchased content- Allow searching of content on apps (netflix, hulu, plex, etc) from the main search function (similar to googletv)- Implementing content from apps (netflix, hulu) into main screen/menu- Implementing voice commands into apps", "verified": true, "helpfulness": "0/0", "author": "Ryan Dauw"}, {"rating": 5.0, "review": "Coupled with my Amazon Prime account, added Netflix, this thing is awsome!  Super easy to install.  I did have to add a HDMI hub as my TV only has 2 HDMI ports.  The voice search function works surprisingly well and is also very easy to use.  I can't wait to see what they start adding for functionality.  Right now the games are a little sparse, but I'm not a big gamer anyway.", "verified": true, "helpfulness": "0/0", "author": "ddk789 \"ddk\""}, {"rating": 5.0, "review": "I truly love this.  I can sit down and watch a movie anytime, listen to music, play a game.  The kids just think its truly wonderful.", "verified": true, "helpfulness": "0/0", "author": "KAREN"}, {"rating": 5.0, "review": "I always thought of buying a game console but never wanted to spend 50$ a game. Then I got this device and to my surprise it's an awesome gaming machine. I now have a collection of 40 games and the most I have spent on a game is 6.99. That was for a 3 Grand Theft Auto games a series. The box is great I used to use a Sony blue ray player for streaming but this is so much faster . This is by far one of the best home entertainment devices . Also when I take photos with my phone or kindle HDX the photos are instantly downloaded on to the fire tv so you can see your photos on tv. Amazon sent me an app for my phone. I still am surprised the box was only 100 dollars I love it.", "verified": true, "helpfulness": "0/0", "author": "michael cruson"}, {"rating": 4.0, "review": "I really like the way the menu is organized. The remote works very well. I'm getting good HD signal consistently with no buffering. This is what I was waiting for!", "verified": true, "helpfulness": "0/0", "author": "SoccerCoach"}, {"rating": 4.0, "review": "Way better then the Roku. I don't like the fact that you can't play videos over the USB port and that an iOS or Android based remote is not available. Other then that it's great and I love that it supports Youtube.", "verified": true, "helpfulness": "0/0", "author": "Martin Uribe \"mohh\""}, {"rating": 5.0, "review": "I'm very satisfied with my Amazon Fire TV; voice command works perfectly. No complaints.  Voice commands appear to be limited to Amazon App; would be nice to see this product advance to voice command movies on Netflix. I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "M. General \"Big MG\""}, {"rating": 1.0, "review": "Most of the viewing  choices  are not free. I turned off . It is overpriced. Voice command should be not limited.", "verified": true, "helpfulness": "1/5", "author": "oldwitty \"I am interested in blessing everyone i meet. I want people  to be better off for knowing me financially,spiritually,emotionally.\""}, {"rating": 5.0, "review": "The Fire device is really good to have. Better if used with wireless internet. Saves the mess of cables. The voice apparatus works perfectly.", "verified": true, "helpfulness": "0/0", "author": "ToNe OaKs"}, {"rating": 5.0, "review": "I've only used it once, but it preformed better than any cable box I was forced to rent. No more cable for me.", "verified": true, "helpfulness": "0/0", "author": "Jerryaamc"}]