[{"rating": 4.0, "review": "This device has great hardware and software but, amazon has locked you from doing anything more than viewing only their content.Here are few things which I did not like but not necessary you would dislike too:1.You can not attach an external device like a hdd.2. Prime videos does not have that great content like netflix in most cases. Many of the new movies on netflix are not on prime.Its like if I have to use netflix on amazon then it defeats the purpose of having prime membership.3. You can't root the device. This is somewhat understandable but totalling blocking it is not good.4. Plex app which is paid, is the only most viable way to stream your media right now. XBMC is not supported.5. Many of the apps from.google playstore are not on amazon app store.These issues might not be a big issue for a an average joe out there, but if you technical person who likes to mod or wants more connectivity etc then this device is not for you. You are better off getting the chinese android boxes which have almost same hardware and fully unlocked to use the device to its full potential. To name one ,the newer minix neo x8-h has identical specs ,more connectivity options and non blocking android 4.4 OS with which you can do a lot of things with.", "verified": true, "helpfulness": "2/4", "author": "audiophile"}, {"rating": 4.0, "review": "Four stars for now. I may upgrade to five stars after I have used it longer. Easy setup and works quicker than my smart tv. So far so good.  I may give up cable to go to commercial free tv.", "verified": true, "helpfulness": "0/0", "author": "MAC \"MAChinery\""}, {"rating": 5.0, "review": "Fast and accurate.  The voice search works perfectly.  Much faster to load movies selected as compared to my old Roku.  Plenty of apps available.  Perfectly paired with my Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Steve Barber \"Steve Barber\""}, {"rating": 5.0, "review": "should have bought this earlier", "verified": true, "helpfulness": "0/0", "author": "Denny George"}, {"rating": 5.0, "review": "Truly an amazing device! I like it a bit more than the Roku 3, and it is massively better than WDs media device. Its voice search option is what really separates it from the Roku 3. I would recommend it to anyone.", "verified": true, "helpfulness": "1/2", "author": "Joshua Greene"}, {"rating": 5.0, "review": "After over a month of pretty regular (daily) use, I have to say that I'm very impressed with the Amazon Fire TV.  I used to stream to our old xbox 360, and this little device is tiny, fast and responsive, and I have yet to have ANY drop in resolution or quality while watching.  For reference, I stream via an 802.11ac wifi router one floor directly above the Amazon Fire device.  The menu is good and fairly intuitive, though Amazon does make it tough to tell when something is free (we have Amazon Prime) and when something needs to be purchased.  Maybe there's a way to search one or the other, but I haven't found it.  The voice command works well, but only searches downloaded and/or Amazon products, it doesn't link you to Netflix or other services, so your search for \"Sci-Fi Horror\" will be limited, for example.  All in all though, a solid, elegant and reliable streaming option.  I like being able to stream music I've purchased on Amazon straight to my TV set, and I hope that Amazon Prime music gets added soon.", "verified": true, "helpfulness": "1/1", "author": "Matthieu P. Raillard"}, {"rating": 4.0, "review": "Overall this device is pretty slick.  There are a few things that would push it to 5 stars.Amazon needs to add a speed test AP for the fire tv.  I have rarely seen issues with stream buffering and I think it was on my side, but it would be nice if I could run a speed test to verify my download speeds with my router.  Amazon has an AP for the fire tablet.  They just need to add one for the fire tv.I also wish the usb port on the back would recognize a flash drive.  It would be nice to have extra storage capability since it only comes with 8 gig.  Some of the games available are quite big.", "verified": true, "helpfulness": "0/0", "author": "Ginger"}, {"rating": 4.0, "review": "I loved it but then Amazon shut it off and wanted me to return it so they could send me another.  That was all canceled except this one still doesn't work.  If they get  it to work I'll raise my rating.I said I would re rate it if my problem was corrected.  Amazon jumped on my problem and reactivated my Fire TV.  It's very easy to set up and use.  Has a lot more to offer than others out there.  I'm very pleased with it and do recommend it.  I got the mount too so it hangs on the back of my TV out of view.I had Apple TV but like most Apple product it converts everything (photos, videos etc) thru iTunes.  It took for ever to get my pictures out of iTunes and back the way I wanted them.  Everything doesn't have to be iSomething.", "verified": true, "helpfulness": "1/11", "author": "CWTEX"}, {"rating": 1.0, "review": "Really disappointing little box. The UI is just really really awful. The navigation is horrific, and all said this was a complete waste of money.You can sideload apps.... but you have to dig through like 6 menus to launch them. Again, Craptastic UI. Just horrendous.And apparently you can no longer root or hack the newest firmware, which would have been nice to know before I plopped down 100 bucks on this stinker. (And hey they discounted it the DAY AFTER I BOUGHT IT.)All said and done, I really wish I hadn't of bought this crappy excuse for an apple tv. I've tested every set top box out there (apple tv, chromecast, roku, smart tvs, etc), and this is by far the most crappy, crappy, crappy one Ive seen. Buy an apple tv, you'll enjoy it more.", "verified": true, "helpfulness": "4/14", "author": "Colin Paddock"}, {"rating": 5.0, "review": "I use my FireTV daily. It's not perfect, but no set top box is. I find the FireTV to be far superior to the Roku 2 and older. I've not tried a Roku 3, but I'd prefer an Amazon box anyway. I really like the added gaming options and the speed of the box. I also think Amazon has only begun to add content and develop their platform. I find that I can use my FireTV and my Chromcast to do anything I need. I actually gave away my Roku after I started using my FireTV. I do still keep a Roku 2 for the bedroom, but mainly for the headphone jack on the remote.Overall, in comparison to the other set top boxes I've used Amazon is by far the winner in my book. Purely for it's speed and integration into the Amazon ecosystem. I trust Amazon's track record and they tend to give customers what they want. I see a bright future for the FireTV.", "verified": true, "helpfulness": "0/0", "author": "Rm1985"}]