[{"rating": 5.0, "review": "Worked flawlessly and is very fast. Very satisfied", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 3.0, "review": "Much harder to navigate than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Eva Mitchell"}, {"rating": 5.0, "review": "Received this as a gift and I love it.  Not being a real TV watcher, this Amazon Fire TV has opened up a whole new world of entertainment for me.  I've been able to access so many venues and am really enjoying watching TV again with worthwhile, educational, and interesting shows.  Wish I knew about this sooner!!", "verified": true, "helpfulness": "1/1", "author": "Janina A Mele"}, {"rating": 4.0, "review": "I love my fire TV! The voice search is surprisingly accurate. It's really an amazing device. The only things keeping it from a 5 star rating are that it should allow more storage through the USB port and it would be great if Amazon could work with some other content vendors to expand the voice search to work within their apps as well. (Netflix, Flixster etc.)", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "Works Better than advertised.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Just received the Fire last week and after a week of using it, I love it.  It works as advertise.  I've been a prime member for years and its great to get all the video's for free.My only disappointment is, a few days after i Paid $99 for mine, Amazon announced the fire stick for $39.", "verified": true, "helpfulness": "0/1", "author": "Mr Pepper \"GEP\""}, {"rating": 4.0, "review": "Very easy setup and use, wish I could join prime with gift card.", "verified": true, "helpfulness": "0/0", "author": "Fred Housman"}, {"rating": 4.0, "review": "I enjoy the flexibility this unit give you. The instructions are very easy to follow", "verified": true, "helpfulness": "0/0", "author": "Oscar Davis"}, {"rating": 2.0, "review": "Doesn't have full access to the Amazon App Store. It has more apps than the AppleTV but far more limited than GoogleTV or the new Android TV.  I returned it and will be getting AndroidTV", "verified": false, "helpfulness": "0/0", "author": "Nick Vidrine"}, {"rating": 5.0, "review": "Performs as advertised. Really Cool. Plugged into my receiver in a closet and functions really well. Voice command is flawless in my use. Pretty picture and no lag/latency. If you are a Prime member, it's a perfect tool.", "verified": true, "helpfulness": "0/0", "author": "karmasoda"}]