[{"rating": 5.0, "review": "Works great.  Exactly what I expected. Love linking all my devices together.", "verified": true, "helpfulness": "0/0", "author": "kyle"}, {"rating": 5.0, "review": "Product is great!  Runs excellent!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Hard to use and I hate it.....history", "verified": false, "helpfulness": "0/1", "author": "Diana"}, {"rating": 3.0, "review": "The actual Fire TV is great and deserves 5 stars. I think the reception is better than I got with the Roku…but….it is almost impossible to navigate with the remote. The voice feature is great, except when you realize that you only get Amazon results and not Hulu, (sometimes I want to watch yesterday’s episode not last years). For the most part that is all I watch – Amazon or Hulu and the remote won’t take me back to the home Hulu screen but will stay on the show I decided I don’t want to watch, or go into a show that I am not interested in watching. It is frustrating spending so much time looking for a show on Hulu and then being scared you have seen all the episodes, as you know you won’t be able to get out of it once you arrive!Maybe there is a simple answer to this problem – if there is I would be happy to hear it because this really is a five star product.", "verified": true, "helpfulness": "0/1", "author": "JA"}, {"rating": 5.0, "review": "Love my fire TV!  So glad to get rid of time warner cable.", "verified": true, "helpfulness": "0/0", "author": "Tricia Deeter"}, {"rating": 5.0, "review": "Great system especially for the kids we love it", "verified": true, "helpfulness": "0/0", "author": "mario lopez"}, {"rating": 5.0, "review": "Works just fine!", "verified": true, "helpfulness": "0/0", "author": "Robie Dill"}, {"rating": 5.0, "review": "Fantastic gadget to have! I've had both apple tv and netflix...this Amazon Fire TV combines the best of what those two have to offer.  And the voice feature is super fun!", "verified": true, "helpfulness": "0/0", "author": "Tanya Rainey"}, {"rating": 4.0, "review": "I got this for my husband for Christmas and I love it! I use it more then he does and it is very easy to use considering I don't do well with too many remotes.  Would recommend just wish price was lower so my kids could afford one. Four stars for price being to high.", "verified": true, "helpfulness": "0/0", "author": "JEANETTA MCDUFFIE \"CraftyLady\""}, {"rating": 4.0, "review": "Great device! Better than Apple TV.  However, Amazon needs to add the capability to attach an external hard drive. The internal storage (5 GB) fills up fast.", "verified": true, "helpfulness": "0/0", "author": "Shannon R."}]