[{"rating": 4.0, "review": "so far I like it...  still learning it so time will tell more....", "verified": true, "helpfulness": "0/0", "author": "Melanie McNeely"}, {"rating": 5.0, "review": "I have read a lot of reviews, comparing the Roku 3 to the Fire TV. I have used a Roku 3 before and I liked the experience. I wanted a media player for my home that would still be capable a few years from now, so I decided to try the Fire TV because of improved hardware specs compared to Roku. I don't own a Prime membership, so the 30-day trial was a welcome, however you don't need a prime membership to enjoy your Fire TV.Must-have apps that I recommend are:--------------------------------------------------- Netflix- YouTube- Plex (turn your PC into a media server)- Pluto TV  I don't plan on using my FireTV for gaming (I already have a Wii for that), so I can't comment on gaming, plus you need to buy a separate controller for that.PROS: Great overall experience- Has the most popular apps available.- Very smooth performance.- Small, you can place it anywhere.- Remote is very ergonomic.- Amazon added a Sleep shortcut.CONS:Still don't see the voice function working with other apps other than Amazon's own content.Overall I recommend this player over the Roku one.", "verified": true, "helpfulness": "1/1", "author": "Raoolio"}, {"rating": 4.0, "review": "Bought as a gift for a friend, they really enjoy the product better than Roku device they had been using prior", "verified": true, "helpfulness": "0/0", "author": "Bill Bryant"}, {"rating": 5.0, "review": "I used to use an x box to stream movies, it got the red ring of death and I didn't feel like buying a new one since I barely played games in it. Bought this instead and am very happy with it. My only complaint and I realize there's probably technical limitations here, is that you can't use the voice search in things like music and non Amazon apps. Great picture quality / sound and an easy to use interface.", "verified": true, "helpfulness": "0/0", "author": "Guy who bought this thing"}, {"rating": 4.0, "review": "Awesome product. streams super fluidly, and I love how easy it is to link up my Bluetooth controller. The only things that I see as a flaw are the lack of expandable storage, and the fact that I can't play the games on my google account instead of the Amazon game circle.", "verified": true, "helpfulness": "0/0", "author": "mitch"}, {"rating": 4.0, "review": "I was used to a Roku so it takes a bit to get used to it. One of the advantages is being able to do a general search using all my apps.", "verified": true, "helpfulness": "0/0", "author": "E.Lisette Palmer"}, {"rating": 5.0, "review": "Great product-so easy to use and so much content -really amazing. Easily the best product of it's kind on theMarket currently!David Kelley", "verified": true, "helpfulness": "0/0", "author": "david kelley"}, {"rating": 5.0, "review": "AMAZING!!! Just as expected.  Nothing bad to say.  Everything it claims to be.  The one thing i wish you could do is voice search within apps.  For instance if I am in Netflix and voice search \"Tom Hardy,\" it will pull me back out to main screen and show me amazon movies.  Maybe this is possible and I am doing something wrong, but that is my only dart.  Great Price, Great Item - my parents love it.", "verified": true, "helpfulness": "0/0", "author": "Zandini the Magician"}, {"rating": 4.0, "review": "Great little gadget to enable entertainment on a tv with internet connection.  Access to all prime video as well as some channels.  The game selection is a bit weak but besides prime just about everything would need $$ to access.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely love!  Bought 1 to try & now bought 2 more - ready to cut that cable!", "verified": true, "helpfulness": "0/0", "author": "Tabithaaw"}]