[{"rating": 2.0, "review": "I returned the FireTV because the remote control failed to stay paired with the device. I couldn't wake up the device and had to unplug it to get the remote control to work again. Once the the Fire TV entered sleep mode the remote would once again fail to pair and I was unable to use the Fire TV unless I unplugged it again.The remote control also feels cheap compared to remote controls for other devices out their.Netflix had trouble installing. There was no notification of an update being available, but it allowed Netflix to finally download properly.Overall using this device over a 2 day period was annoying and frustrating.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Disappointing. ...", "verified": true, "helpfulness": "0/1", "author": "sean solomon"}, {"rating": 4.0, "review": "Love Fire TV.  Only problem am having is freezing.  Why does this happen?", "verified": true, "helpfulness": "0/0", "author": "Brenda Poehler"}, {"rating": 1.0, "review": "I spent hours today trying to get the Fire TV to work. At first it was Netflix that wouldn't load. Turned out I needed to do an update. Then Netflix worked. But the videos I tried on Amazon and Netflix displayed in a square box on my screen and did not look like HD. It scrunched up the picture, making people narrow. There were wide bands of black on the left and right sides of my screen. I was on the phone a long time, first with Netflix, then with two people at Amazon. Nobody could figure out what was wrong with the display (and yes, I tried several different display settings and I did a factory reset and did the plugging unplugging routine). Finally gave up and went back to my trusty Sony streaming device which got me back to HD quality and a full screen. I have renewed affection for that Sony tonight.Even if I could have gotten the full screen to display, I still wouldn't have cared much for the FIre TV. The menu system is not nearly as convenient as the one on my Sony streamer.Edited to add: One other thing I didn't care for was that, with Fire TV, it was necessary to use two remotes: one for the TV, and one for the Fire TV.", "verified": true, "helpfulness": "5/7", "author": "Nobody"}, {"rating": 4.0, "review": "Lovin' it.", "verified": true, "helpfulness": "0/0", "author": "Wzaske"}, {"rating": 2.0, "review": "Setup is easy, voice search works well, but even though we're Prime members, it amazed me how many TV shows and movies Amazon charges to watch...must have been 80% or more.  Even movies from the 60's, etc., they still charge $3-10 to buy.  I can get the movies cheaper from Redbox, and even Hulu offers more TV shows for free (and more current shows as well).  Amazon even charges $10 to watch the original \"The Grinch Stole Christmas\" from the 1960's.  Talk about a Grinch!!!  While it works well, we're thinking of returning it because we just can't afford to watch much...no matter how easy it is to set up!!!  :(", "verified": true, "helpfulness": "2/2", "author": "W. Sweger \"Bill S\""}, {"rating": 3.0, "review": "I only wish that netfix and hulu worked by voice command, searching for shows can be daunting. I prefer this method of watching programing to spending monthly money on cable, but improving the search function across apps would made my star rating much higher. I have been watching hulu, netfix and amazon on my computer in dual screen mode linked to my tv via hdmi for a couple years so having the remote is great, just not the experience I thought it would be. Also, when downloading photos to the \"Unlimited\" Amazon cloud storage for viewing through fire, the cloud reorganized the folders that downloaded so I cannot find what I want to display. Furthermore, unlimited does NOT mean unlimited. A fraction of my photos exausted the free offer so I need to remove all and start over, folder by folder. But oit is nice not to have to link the computer to the tv, and using a remote is nice. Worth the money, but just barley.", "verified": true, "helpfulness": "0/0", "author": "janene bouck"}, {"rating": 1.0, "review": "Made a mistake 1 click purchase and greedy Amazon charged me $40 restock fee, taxes and ship, I should have just kept it.", "verified": true, "helpfulness": "3/4", "author": "Myghty"}, {"rating": 5.0, "review": "I absolutely love this. But once I had it for about 2 weeks then I saw the  commercial for the streaming stick. Now I want that also. I'm a tech junkie. But I love ❤ the remote aspect of the kindle fire tv so much that I will probably buy another on for my nieces room. All hale to AMAZON. I am already a amazon prime member for the past 8 years so I already have the benefit of watching free movies. Anyway, I love ❤ you amazon.com.", "verified": true, "helpfulness": "0/0", "author": "deborah smith"}, {"rating": 5.0, "review": "I bought this thinking I would be able to screen mirror from my galaxy note 10.1 2014.  After setting up and getting the newest software download  ......disappointment!  The fire tv and my tablet was able to see each other, but when attempting to connect, it just timed out with a message, \"error unable to connect\".  Contacted Amazon support, suggested a power cycle which did not help.  I was referred to the next level support and was told could be because not all Samsung devices are fully supported.As far as everything else.... works great!  speedy, voice search, etc.  Just really wished mirroring worked for me!!!Although I bought it on cyber Monday at a good discount price at $69.00......  Thinking about Sending it back!!Update ....... Well, I didn't send it back, I was hoping that a software update would eventually fix my screen mirroring problem.....(hardware conflict message)  Received the new 1.5 software update in April, gave it another shot, and what do you know! it worked!  Ive tried it a couple of times and it works great so far!  We'll see if it continues..... but for now, I can give it a 5 star rating!", "verified": true, "helpfulness": "0/0", "author": "Bky"}]