[{"rating": 5.0, "review": "This makes watching movies so much easier. We were watching a cartoon version of Anastasia and someone said \"lets watch the Yule Brenner version\"... In under two minutes we were watching the movie.  This totally trumps the \"smart tv\" functions on my tv- at least the tv is still a great high resolution monitor.My only beef is the voice search does not work on other platforms. When I search Netflix I still have to toggle through the keyboard. I understand this will probably help Amazon generate additional revenue due to the lazy factor but it is annoying when the title is not available on Amazon and needs to be searched in Netflix or another source.  Please fix that Amazon.", "verified": true, "helpfulness": "0/0", "author": "Scott Rudd \"LSRL\""}, {"rating": 4.0, "review": "So far so good. Haven't begun using everything it's capable of doing though.", "verified": true, "helpfulness": "0/0", "author": "usa1980"}, {"rating": 5.0, "review": "I  just hooked up my fire it was very EZ to install and use . Looks like most movies are rentals But there is lots and I mean lots of free content as long as you are a prime member", "verified": true, "helpfulness": "0/0", "author": "Pat Kay"}, {"rating": 4.0, "review": "Love this, binging on Dr Who", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent! Very fast!! Easy to setup! Very pleased!", "verified": true, "helpfulness": "0/0", "author": "Javier Villafañe"}, {"rating": 5.0, "review": "The whole family loves the fire tv. Endless options to choose from.", "verified": true, "helpfulness": "0/0", "author": "Luis M. Fernandez"}, {"rating": 5.0, "review": "It's better than expected, wish I signed up sooner", "verified": true, "helpfulness": "0/0", "author": "Curtis L. Morton"}, {"rating": 1.0, "review": "We sent it back for a refund. Was inconsistent in performance especially with rival Netflix.", "verified": true, "helpfulness": "0/1", "author": "McDeb"}, {"rating": 5.0, "review": "Chromecast on steroids.  Interesting trick, once you display preferences, the next time they appear, there is an episode charge.  Great Marketing.", "verified": true, "helpfulness": "0/0", "author": "Wayne M. Hyrkas \"newages\""}, {"rating": 4.0, "review": "I enjoy the variety of movies you have", "verified": true, "helpfulness": "0/0", "author": "Rosario Bustamante"}]