[{"rating": 4.0, "review": "I like it  meets my needs now I can play games  get my net flix  and movies on my TV  only had one problem tried to get the 30 day trial on Amazon prime  but it went into regular billing twice  called to correct  problem you tried to fix the problem but i finally gave up.", "verified": true, "helpfulness": "0/0", "author": "JUJU"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "David J. Sultzer"}, {"rating": 4.0, "review": "Movie streaming is excellent. No glitching so far. Some of the prices for the newer movies are a bit obscene but it's overall pretty decent. I do wish more fell under Prime inclusion.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Molly O\""}, {"rating": 2.0, "review": "Having trouble conntecting to the WIFI. It keeps trying to download updates and keeps giving us the error can not install updates.It is also very fuzzy on the TV screen. We have purchased two new HDMI cables to get the same results. So We are sure to due.If we can get it to work I will review again. Still have not got the Amazon fire to work! bought as a gift for my husband at Christmas. Everytime we try to turn it on all it says is searching & loading. It is located less than 10 feet from my router. NOT HAPPY WITH PURCHASE.I used to love Amazon, but things have changed around so much I cant locate things, customer service has got very poor. Makes me sad I used to use Amazon everyday, but not anymore.Very unfortunate!", "verified": true, "helpfulness": "0/1", "author": "bookwormmovielover"}, {"rating": 5.0, "review": "very happy with it", "verified": true, "helpfulness": "0/0", "author": "serendipity2529"}, {"rating": 5.0, "review": "beat all expectations!!!", "verified": true, "helpfulness": "0/0", "author": "Carole A. Rowlands"}, {"rating": 5.0, "review": "Exceeded my expectations,  easily worth the $80 sale price", "verified": true, "helpfulness": "0/0", "author": "Marc Alan McCall"}, {"rating": 5.0, "review": "Customer support was very helpful in setting this up.. The consultant was clear, called back several times to make sure we were doing what needed to be done, and was extremely patient!", "verified": true, "helpfulness": "1/1", "author": "deb whis"}, {"rating": 5.0, "review": "Wonderful piece of Technology.  Far to superior to the Roku it replaced.  Love the shows on Prime.  Binge watched Alpha House.", "verified": true, "helpfulness": "1/1", "author": "JV59"}, {"rating": 5.0, "review": "Great box , Super fast! Amazon Prime content is great and will replace my Netflix subscription for now. Love the Jackbox.tv game bundle (additional purchase).", "verified": true, "helpfulness": "0/0", "author": "Vinman"}]