[{"rating": 5.0, "review": "works awesome", "verified": true, "helpfulness": "0/2", "author": "joel"}, {"rating": 4.0, "review": "Once I had problems ironed out between Sling T.V. and Amazon Fire T.V., all is okay. I do not miss high cable bills.", "verified": true, "helpfulness": "0/2", "author": "Julane"}, {"rating": 3.0, "review": "Was hoping for a bigger movie collection.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Jason J."}, {"rating": 3.0, "review": "Nice looking unit.  Works ok, but don't put it very far from your router.  Mine shows full signal strength in the settings, but it has to buffer every 5 to 10 minutes while watching netflix.  My Roku 3 never buffered on anything.  Remote is nice and simple.  Overall ok.", "verified": true, "helpfulness": "0/1", "author": "Paul Scott Price"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "MICHAEL"}, {"rating": 3.0, "review": "He obviously had the 1st Apple TV and slow wi-fi nothing that he said about the Apple TV was absolutely true unless he had a very early  Apple version & slow internet speeds. I'll use the Fire Box on my Amazon prime account. And my Apple TV on my iTunes accounts it's easier that way. When you try and cross them over between the two there is problems from both versions like double billings etc I think they do it on purpose they are after all competitors. The Fire Box will get better as it's learns probably in about a year I'll be changing my ratings hopefully to a 5 star from a 3star I rated at.", "verified": false, "helpfulness": "0/1", "author": "Steven"}, {"rating": 3.0, "review": "The movies I want to see are cost $$, they are old action movies, it sort of disappointed me having to pay for old movies.", "verified": true, "helpfulness": "0/1", "author": "andy"}, {"rating": 5.0, "review": "WORKS GREAT", "verified": true, "helpfulness": "0/1", "author": "Jan Barnett \"Jan\""}, {"rating": 5.0, "review": "Super-convenient and great. Setup was ridiculously easy (and short)! I got the box instead of the stick because I wanted voice searching; it really works and is so much cooler, easier and faster than laboriously typing in letters on an onscreen letter board.", "verified": true, "helpfulness": "0/1", "author": "gala"}]