[{"rating": 4.0, "review": "Overall, I think the Fire TV is great. It has everything I need on it, Hulu, YouTube, Netflix, Amazon Instant Movies, etc. The only complaint I have is that if I haven't used it for a while it seems to forget that I have installed the Netflix app on it. I have had to redownload the app several times and sign into my account all over again as if it was never installed. It's kind of a pain when you just want to sit and watch a movie. Besides that, it works great and I love it.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I don't have cable and many of the apps want you to enter your cable provider in order to use the app.  Not as many channels as I had hoped for.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this devise!. I also have a Roku and the differences are undeniable. Fire TV is so much more interactive, the speed is amazing and the offerings are vast. I'm planning on buying another to replace the Roku.", "verified": true, "helpfulness": "0/0", "author": "Carmella C. Jackson \"Mel\""}, {"rating": 4.0, "review": "Thought there would be more access to current tv.", "verified": true, "helpfulness": "0/1", "author": "Pstros \"blavaaira\""}, {"rating": 5.0, "review": "Love it awesome", "verified": true, "helpfulness": "0/2", "author": "manson.314"}, {"rating": 5.0, "review": "The Amazon Fire TV worked as advertised.  In fact, the content is better than expected prompting us not to purchase Netflix.  You can get the same content (newer versions also) with the Fire TV.  Installation is a breeze, voice search is fast and gets results.  Only caveat, the info returned is the first one found not necessarily what you desired.  For example say Game of Thrones and you may get the app for the \"game\" Game of Thrones not the HBO series.One negative is it is virtually impossible to just browse.  You can browse on cable by simply viewing the cable guide.  On Fire TV there are almost (slight exaggeration)  as many venues as channel selections on cable.Bottom line, good job.  We hope to cut the cord soon.", "verified": true, "helpfulness": "0/0", "author": "David Graft"}, {"rating": 4.0, "review": "Just starting to figure the system out but so far I really like it.", "verified": true, "helpfulness": "0/1", "author": "Patricia Tuttle"}, {"rating": 1.0, "review": "Didn't need it even though AMAZON said I did need it to go with the 4D 70 inch TV I bought from them", "verified": true, "helpfulness": "2/13", "author": "myxviii"}, {"rating": 5.0, "review": "Excellent! Now I have what always I want from a TV. I have enjoyed to much!", "verified": true, "helpfulness": "0/0", "author": "Joao F. Colella"}, {"rating": 5.0, "review": "ONCE UP AND RUNNING FIRE TV IS GREAT", "verified": true, "helpfulness": "0/2", "author": "LINDA"}]