[{"rating": 5.0, "review": "Very easy to use and set up.", "verified": true, "helpfulness": "1/1", "author": "Sara E. Astorquia"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "1/1", "author": "James C."}, {"rating": 4.0, "review": "There is good and bad. But let me say I'm new at this. I love the size. Anyone can hook this up. The remote is great so simple. Love the voice search. What I dont like is hard to find prime movies. What I hate is I have a kindle fire hdx8.9 that I play the walking dead on. Could not wait to play on my box. So I found I had to have a game controller to play. So I got the game controller. Went to play. Then I found I had to start all over again. It will not pick up were I left off on my kindle. Thats is odd ( I THINK) I called amazon they had no clue why. So I have to have two different games going one on my box one on my kindle. Not to happy about that. The other thing is my mirroring only works if I do a total restart with my kindle. Every time to get it to my tv. I find it to be more trouble than its worth. I have used mayday over this also. But still have to do the hold botton for 40 sec restart the. Mirror.", "verified": true, "helpfulness": "0/1", "author": "Tammy"}, {"rating": 5.0, "review": "Works fine, although had some trouble getting it set up on my TV and then more trouble going from Fire back to cable but finally mastered it.  Downside is 3 remotes now, TV, cable and Fire; didn't have to use the TV remote before Fire.  I recommend this as I will be dropping the premium cable channels and saving lots of money.", "verified": true, "helpfulness": "1/1", "author": "susan"}, {"rating": 5.0, "review": "Great product.... Very satisfied..", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "You should better differentiate between what you have to pay for and what's covered by prime and I get the reason they do it which so more people will buy their movies and shows but still it's kind of annoying other than that it's pretty great and I would still suggest buying it", "verified": true, "helpfulness": "2/2", "author": "Pauli Smith"}, {"rating": 4.0, "review": "Very easy to install and has lots of functions and applications.  Expands your video library quickly !!!", "verified": true, "helpfulness": "1/1", "author": "Joseph Hester"}, {"rating": 5.0, "review": "Awesome ...", "verified": true, "helpfulness": "1/1", "author": "TB"}, {"rating": 5.0, "review": "Was having trouble at first, but called support and updated software....everything went great!", "verified": false, "helpfulness": "1/1", "author": "F. Fraction"}, {"rating": 3.0, "review": "We are full time RVers, and this little box permits us to watch movies on Netflix.  It works, but setup and operation with that minimalist remote control can be frustrating.", "verified": true, "helpfulness": "1/1", "author": "Raymond Waugh \"Grumpa\""}]