[{"rating": 5.0, "review": "This thing kicks butt. With this and Prime, our watching needs are covered. Getting ready to mover to a much smaller package with our satellite provider. Fire TV will pay for itself in the first two months.", "verified": true, "helpfulness": "2/2", "author": "Brian Van Winkle"}, {"rating": 4.0, "review": "Pretty good. Great picture and sound. Amazon prime could use more free movies though. Overall, this is an excellent product. I would buy another.", "verified": true, "helpfulness": "0/0", "author": "davel"}, {"rating": 1.0, "review": "I have a samsung un55d8000 smart tv top of the line.I also have amazon prime. On my tv a have over one hundred video streaming sites,probably all that is available except one. Amazon prime videos on demand. So instead of amazon writing a stupid app for my tv they instead come out with a new product for you to buy from them to get their video services. I will not renew my prime contract because of this type of practice from amazon.There are thousands of people out there with the same problem writing or calling amazon on this problem and instead of listening they decide instead of screwing us more. To the people ordering this box when amazon has enough sold they will probably double the rate or make you buy a new box for better services. After I first called amazon about this problem with my tv they said they are writing an app as we speak, that was over two years ago. Thanks for nothing amazon keep it up and you will be out of business soon. Unhappy customer", "verified": false, "helpfulness": "2/23", "author": "tom giotta"}, {"rating": 5.0, "review": "Best choice I made. This thing works as promised; voice commands rule!  Streaming is consistent and without interruption on 20 MB DSL line. I really like the resume feature. Purchases for on line content effortless; being Amazon Prime member is a great value allowing access to tons of videos at no additional cost. Interface simple and intuitive and search function using voice commands delivers. A winner for Amazon!", "verified": true, "helpfulness": "1/1", "author": "cotp74"}, {"rating": 4.0, "review": "I love my amazon fire tv. It's fast, simple and just amazing. The only downside I see is not having the hdmi cable, and social media apps. I previously had a rokui, and that came with all the above. But Amazon loads faster, and such a gorgeous display.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I've had two Rokus, an Apple TV, and a Panasonic streaming Blu-ray player. This thing beats them all. The UI is fast and responsive, the voice search really works well, and the streaming startup times are much shorter on the same connection. Highly recommended if you're a cord-cutter like myself or you just want a box to stream your media from most of the big services in streaming.", "verified": true, "helpfulness": "1/1", "author": "Louis Gardner"}, {"rating": 5.0, "review": "I'm not a big writer and don't really care about giving reviews!! First of all I purchase from Amazon as much as I can. Think about it, if your not satisfied send it back. You will have your money in your account before they have thier  merchandize back.. Save all of your comments because here's your money back , move on find what you like, they don't want to hold you hostage, life to short!!Aazon Fire Tv rocks the house!! I stepped up from a blueray with WiFi,no comparison!  I love listening to Pandora while Amozon has preloaded pictures from around the world as a  Slide showing for me. I tell all my guest there my Vacation Photos!! LOL.. Once I got Fire TV I ordered Prime for the movies.. Love it! I can watch old school movies I can't find on Net Flixs. I also love how Primes Movies are Linked with I MOB and show the movie ratings..  Amazon Fire Tv Rocks.. Apple Tv may have started it but Amazon Fire Tv Perfected it!! Enjoy,, the little box rocks!!", "verified": true, "helpfulness": "2/2", "author": "curt mansfield"}, {"rating": 3.0, "review": "Most of the movies that I want to watch are not available. Sound and picture quality are good for the most part. I would love it if more movies and TV shows are added. I know that this is a new concept and more time is needed for improvement. So far better than some of the competitors.", "verified": true, "helpfulness": "0/0", "author": "M. Gonzalez \"D Gonz\""}, {"rating": 4.0, "review": "Great unit, easy set up for the tech challenged. Defaults to Amazon channel to often. I have already recommended it to my friends.", "verified": true, "helpfulness": "1/2", "author": "Wayne Bliss"}, {"rating": 1.0, "review": "UPDATE: After 16 months my Fire TV gave out. If the first rep I talked to would have been honest and told me the Fire unit was out of warranty I would have simply bought a new one and been done with it.It took three weeks of non-committal answers in emails and phone calls to get a \"refurbished\" replacement that was broken and not \"refurbished.\"I talked to almost a dozen people and after a mountain of emails and phone calls (one rep left me on hold for 30+ minutes) I was given a refund (though not what I wanted) and sent on my way. I was so disappointed in my treatment by Amazon - first by not telling me the truth up front and by the shabby treatment and defective replacement unit. I was angry enough to cancel my Prime membership and delete all my subscriptions. If you are going to buy a Fire TV - get the extended warranty because these units won't last more than a year.I found a better alternative - I purchased a Sony Blu-Ray/streaming player with a 4-year warranty from Best Buy for just a little more than what a Fire TV would cost. Almost 10 days ago I cancelled my Prime membership and have yet to receive a refund for either that or the defective unit. There's so much about Amazon that's good but when it's bad, it's spectacularly bad.For many reasons I decided to get rid of DirecTV but I still wanted to be able to use my Amazon Prime, Netflix and Hulu Plus. This device plugs in easily and work incredibly well. Switching between the different programs is easy, easy and I really like the voice activated feature. The one unexpected bonus are the lovely screen savers available when no program is playing. I love them! They are a soothing improvement to a blank TV screen when you would rather not have a program on. This product along with Amazon Prime (worth it even at $99 a year) is the perfect answer when getting rid of cable/dish networks. I'm very, very happy with this product.", "verified": true, "helpfulness": "2/2", "author": "nina ford"}]