[{"rating": 1.0, "review": "Great idea but just not good enough in my opinion. First off, the HDMI audio works intermittently. Wiggling the wire fixed audio but then it would go out. Yes, I made sure it was all the way in, at first it wasn't which was my first initial frustration since it actually was a pain just to get the HDMI to seat properly, not sure why but it takes effort to get it to seat. So, first advice, make sure it seats all the way or you won't get audio.After that, I was unable to play a single show even though my ROKU works in the same location. I am returning this because it just isn't going to work in our house.", "verified": true, "helpfulness": "3/19", "author": "San Diego Malcolm"}, {"rating": 3.0, "review": "Amazon Instant Video is not Enough. What Else Can Amazon Fire TV do?A Video Streamer should access video content from every source available – including over-the-air broadcasting. The user interface should allow for easy searching and navigation. And the player should put your hard earned dollar first, by prioritizing content options based on price. Most importantly a set top box allow you to enjoy free broadcast TV, with a DVR, and should always route users towards the most cost effective way to enjoy their favorite shows and movies. In short a video streaming device should be a Cable TV Alternative. After my thorough review I found that this box is best used for consuming Amazon content, does not support OTA, and makes zero attempt at providing cost effective options for video consumption. Read my extensive Amazon Fire review here: [...]", "verified": false, "helpfulness": "2/15", "author": "Dave"}, {"rating": 5.0, "review": "I give it a weak 5 stars probably closer to a 4.2 stars. Lots of good stuff a few minor glitches and could use more better wuality things to view on Prime.", "verified": true, "helpfulness": "1/2", "author": "California"}, {"rating": 5.0, "review": "I've used it during  a week and if you have wi-fi you shall not have ANY Problems. I have Pandora, Netflix, Watch ESPN, Movies and TV series.My tv is not a smart TV, but I have internet connection from FireTV. I STRONGLY recommend it.", "verified": true, "helpfulness": "3/3", "author": "edwin cotto"}, {"rating": 5.0, "review": "Before I got this I had the google chromecast, and I definitely like this over the chromecast since you can stream what you want without having to connect a kindle to it (but if you do the experience is even better), I would definitely recommend this to anyone who want to start streaming media to their tv, and is looking for a great option", "verified": true, "helpfulness": "0/0", "author": "Mark Jacobs"}, {"rating": 5.0, "review": "We've had Apple TV.  We've had Roku.  We now have Amazon Fire TV and it is absolutely superior to the other two products.Most notably1.  the \"speak and receive\" searching feature of the Amazon Fire TV ... I works splendidly and quickly.2.  the much improved sound level and quality we are getting from our newer model LED TV.3.  the organization capabilities for easy access and viewing of the Wishlist and other features.Stream on with Amazon Prime membership ... and your TV viewing life is golden.", "verified": true, "helpfulness": "6/6", "author": "Tj Reilley \"PhilosopherGal\""}, {"rating": 3.0, "review": "I love this thing and it has so much potential. WHOEVER the heck decided to make the internal memory on this thing be only 8GB to begin with, then a 900 MB update and then once you install the normal apps, plus a few games, you are left with no space in order to actually install(expand) games like Asphalt 8 or Bard's Tale, SHOULD BE FIRED!. You have little to no \"disk space\" left and as there is no micro-SD slot or any other expansion available as yet. The USB port doesn't support anything as yet and hopefully will be updated in a future with a firmware update to enable support (and allow installation and running of apps/games to and from these devices) for usb flash drives and external hard drives will be forth coming very soon, but as of now I am quite frankly, very, very disappointed. Ramble on!Again whoever's idea it was to make this thing 8GB is an IDIOT and I guess this goes all the way up the line. I better shut up for now.", "verified": true, "helpfulness": "3/7", "author": "Mojojeff"}, {"rating": 1.0, "review": "The device is fast and works well but you have no way to watch recently released movies. There is no VUDU ,no MGO or any other service with recently released movies. Amazon screwed up big time this time around because they do not offer any way to buy recent movies. Also search function is not nearly as nice as ROKU. ROKU is a much better option in this marketplace. It is a little slower but not enough to really notice. What counts is content and Amazon just does not have it. We wanted to watch Nebraska (which is an excellent movie) but we could not on this device. I switched over to Roku and it was available form 5 different places when I searched and it showed prices from all 5 and I got to choose which I wanted to watch. Roku is the one to get. It is also much better than Apple TV. I put Apple TV at the bottom of the list of the three. Has poor content choices and does not have the speed or ease of use of Amazon fire TV", "verified": true, "helpfulness": "7/18", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I have been using Apple iPhone, iPad, Samsung Galaxy Note 3, Google Chromecast, Nintendo Wii, Apple TV and Boxee in my home for many years.I joined Amazon Prime in March. I really liked all the benefits of two day shipping, Amazon Prime Instant Video and Kindle Owner's Lending Library.I do not have cable in my home. I was a Netflix user for more than a year. But I could find more movies and TV shows I really enjoy from amazon prime instant video. I cancelled Netflix shortly after I joined Amazon Prime.As soon as I heard that Amazon Fire TV was released, I sold my Apple TV immediately and I purchased Amazon TV and a game controller. Now that I have used Amazon TV for over a week, I am highly satisfied and I do not regret my decision to sell Apple TV.I like Amazon Fire TV far better than Apple TV. Amazon Fire TV is as tiny as Apple TV. It is easy to set up. Its screen quality is amazing. Voice-Search on Amazon Prime Instant Videos works great. I now use Amazon Fire TV more than Nintendo Will to play game with my daughter. Thank you Amazon!!", "verified": true, "helpfulness": "1/1", "author": "MOON"}, {"rating": 1.0, "review": "Doesn't really offer anything we don't already have with our ROKU box, therefore we found it to be redunant and returned it.", "verified": false, "helpfulness": "4/24", "author": "A book lover in Azle Texas \"BookLoverAzleTexas\""}]