[{"rating": 5.0, "review": "We hesitated purchasing the Fire TV since our three TVs are \"smart\" models with numerous apps and Wi-Fi built in but we're glad we did get it. The \"microphone\" feature works like a charm and eliminates searching for movies and documentaries and other content. Icing on the cake is this little box is much faster loading apps and movies and just navigating around, plus the \"Home\" screen is nicely organized so you can quickly access the Prime movies (freebie content for us subscribers), and the other topics. The remote is intuitive to use and just feels right in the hand to flip among the various screens. It has no on-off switch, it shuts off automatically after being idle for 30 minutes--nice feature. A bright LED lets you know it is on. No negatives to report so far.", "verified": true, "helpfulness": "0/0", "author": "Howard Woodward \"Howwoodie\""}, {"rating": 4.0, "review": "The remote is small and I lose it quite often. The voice recognition is pretty dead on. Love it! Disappointed with the price for most of the movies. I will use Redbox or Netflix. Even old movies cost $$. Oh well....", "verified": true, "helpfulness": "0/0", "author": "Kelly F."}, {"rating": 4.0, "review": "I'm still new to Fire TV. It's working very smoothly for the main reason I purchased it, which was to access my Netflix account. It paired instantly, allowed me an easy login, and is working flawlessly. I don't like that I need to upload my photos to the Amazon cloud to watch them. I was hoping I could access the photos on some of the computers, phones, or tablets on our wifi network. Perhaps I can do that and just haven't yet learned how. I'll be digging a little deeper and will update if I find a way. I lost my Google Chromecast and thought I'd use Fire instead, but maybe I need to replace Chromecast.Netflix continues to amaze me with how smoothly HD is delivered to my phones, tablets, computers, and TV. Extraordinary service with so much free programming to offer. If it were not that I want to watch supports, I wouldn't need my satellite dish or any other TV service.", "verified": true, "helpfulness": "0/0", "author": "Pepere A \"Reggie A\""}, {"rating": 5.0, "review": "Two days ago I would've given a 4 star review but with the last update they added Amazon Music and I am beyond happy! My phone, Kindle and TV now link seamlessly and I'm a technical diva..", "verified": true, "helpfulness": "0/0", "author": "wilkes"}, {"rating": 5.0, "review": "Small, fast, easy to use and silent.  This is just about perfect and will only get better with time.I've tried many android and apple TVs and this beats them all.The apple TV is pretty and easy to use but unless you're using an old jail broken 2nd generation, it is extremely limited as to what it can do.  Compared to modern devices, the 2nd generation is slow and outdated, especially if you're running XBMC.Generic Android TVs may be powerful but the interface leaves MUCH to be desired.  Most run a rooted generic version of Android and a terrible Netflix app that hardly plays SD content, all while being unstable and needing to be reset daily.The Amazon Fire TV finally fixes what the Apple TV should have been - a stable, easy-to-use interface with the ability to side load Android apps (and most importantly XBMC) for endless hours of entertainment.  It has a nice selection of available games and applications, including a Netflix and Hulu plus app that rivals that on the Apple TV. The optional game controller is nice, but with a little tinkering you can use your PlayStation or Xbox controller.The one gripe I do have is the LED on the front of the box is bright enough for airplanes to see, and since I don't want a jetliner landing in my living room a small piece of electrical tape solved that issue.  You also cannot add sideloaded apps to the home screen, which can be a pain but not the end of the world.You cannot best this for the price.  I replaced my Apple TV with the Fire and never looked back.", "verified": true, "helpfulness": "1/1", "author": "TDawg"}, {"rating": 1.0, "review": "We will not consider Fire TV until programming is greatly expanded.Cannot live without BYUTV and The Mormon Channel.", "verified": false, "helpfulness": "4/28", "author": "The Producer"}, {"rating": 5.0, "review": "I love the Amazon Fire TV!  Love the voice search also. Very easy setup. Also like the $84.00 price with 5 easy payments. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Hello2u"}, {"rating": 4.0, "review": "Amazon Fire TV needs to have the \"watchlist\" in two separate categories, {1.Movies  2.TV }  like Roku does. I prefer tv series and have to scroll through such my whole list to find them. I wrote them down and will need to use \"voice search\" when I want to watch a series.", "verified": true, "helpfulness": "1/1", "author": "C. Schneider"}, {"rating": 5.0, "review": "Small box, high quality and fancy design..... very powerful !!", "verified": true, "helpfulness": "1/2", "author": "Roy"}, {"rating": 1.0, "review": "Either I have a defective system or Fire TV has significant wifi issues. I was replacing my Roku with Fire tv and have the box placed in the same spot.  The Amazon one is horribly slow and often will not load applications (app cannot be found error). A system reset didn't help either. Plugging the Roku back in showed it was not my network as it worked perfectly. Amazon's online help for their system is also very limited. They have no information about the error messages that appear. I'll be returning this and purchasing the upgraded Roku instead.", "verified": true, "helpfulness": "10/12", "author": "Dan"}]