[{"rating": 5.0, "review": "Easy to use, great product!  Thanks you amazon for bring some movies to our living room!", "verified": true, "helpfulness": "0/0", "author": "E. Rose"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Julie Smith"}, {"rating": 5.0, "review": "Getting PBS wasn't intuitive and I still can't stream John Oliver.  Mostly everything works well.  I can stream Amazon Prime video using my iPhone but the Fire TV is so much easier.", "verified": true, "helpfulness": "0/0", "author": "Coral Lee Mack"}, {"rating": 5.0, "review": "i love it; easy to operate.  Thanks", "verified": true, "helpfulness": "0/1", "author": "Johnnie Riley"}, {"rating": 5.0, "review": "love it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "BEAUTIFUL LITTLE MAGIC BOX (LITTLE WONDER). Not a thecky, but the quality sound this little box gives to my Tv when I use its content is Amassing!!!, love the mirrorowing any feature from my kindle fire table onto the Tv feature although. Some times disconnects by itself!!!★★★.it seems that navigating through the Amazon content it. Is more efficient, practical and easier with. My tablet, love movies.  Good film and I am a Prime member so I am more than happy to be able. To watch my movies from the infinite Amzon selection!***...s very happy costumer here....Go Jeff BEZOS", "verified": true, "helpfulness": "1/1", "author": "DIABLOCACHUDO58"}, {"rating": 5.0, "review": "Clear and smooth video streaming, no ifs ans or buts.", "verified": true, "helpfulness": "0/0", "author": "george schofield"}, {"rating": 5.0, "review": "I really like the voice command feature. very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am not a tech person and I can do this! I cancelled gym membership as I can put up YouTube exercise videos, plus the free shows and movies! I wish I had more time to watch more. Great gift.", "verified": true, "helpfulness": "1/1", "author": "PD"}, {"rating": 5.0, "review": "I shouldn't say I cannot live without it, air, food and water are things I can't live without. With that being said this is definitely one of my favorite gadgets. Hook up was extremely simple, I just plugged it in. Navigation is simple as well. The remote isn't complicated and the home page is simple and functional. The voice option is really good too. It picked up what my 3 year old was requesting.The Amazon Fire TV is so easy to use that my 3 year old was able to find a purchase a movie that he wanted while unsupervised for a few minutes. We are enjoying more freedom in watching TV and actually cut down on satellite.", "verified": true, "helpfulness": "0/0", "author": "Miranda N"}]