[{"rating": 5.0, "review": "I'm am writing this review for anyone who want to use this to stream games from their pc to their television using s program called limelight and an nvidia graphics card.  Limelight is an open source version of the streaming software used in the Nvidia shield.  Bottom line: it works amazingly well with a power line networking adaptor.  Just plugged in an Xbox controller, ran limelight and I was playing. Dragon Age Inquisition on my TV.  To play Steam games you need to make a short cut to steam big picture mode and add it to GeForce experience. When you select the shortcut, it opens steam and you can play all your steam games.  I have not tried wifi yet,  but I don't have a great wifi signal.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"duke94\""}, {"rating": 5.0, "review": "I love it. Easy set up. Stream straight to the tv. The only bad thing is waiting so long for ordering the second one.", "verified": true, "helpfulness": "0/0", "author": "Leslie Arvin"}, {"rating": 5.0, "review": "Great little device.", "verified": true, "helpfulness": "0/0", "author": "Shod Williams"}, {"rating": 5.0, "review": "Love it!!! The voice search is awesome too!!", "verified": true, "helpfulness": "0/0", "author": "lw"}, {"rating": 5.0, "review": "Love it great set up!!  So many options and controller is great too!", "verified": true, "helpfulness": "0/0", "author": "Katherine A. Hall"}, {"rating": 5.0, "review": "I love it!  I wish the old war movies were free.", "verified": true, "helpfulness": "0/0", "author": "Gerald Nakashima Sr"}, {"rating": 3.0, "review": "Constantly needs to be restarted. Every time I try to watch something, I get an error. These instructions are absolutely critical:\"You can also restart your Amazon Fire TV with your Amazon Fire TV Voice Remote or Amazon Fire TV Remote. Press and hold the Select button and the Play button at the same time until the Amazon Fire TV restarts (about five seconds).\"Still, it's better than a Roku. Appletv is way more stable.", "verified": true, "helpfulness": "0/0", "author": "Nilay Patel"}, {"rating": 4.0, "review": "I luv this. I hated paying for cable. The only thing that I wish I could get on it is CNN which I dont have. Would give it 5 stars if it could get that.", "verified": true, "helpfulness": "0/0", "author": "Wendy McDonald"}, {"rating": 5.0, "review": "Absolutely amazing. Quick and easy to set up, only two cables, and comes with batteries for the included remote. Have been wanting to cut the cable cord for awhile now and with Amazon Fire TV I was finally able to do so!", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "works good with amazon, but sucks with all others.  With HULU works ok, but often freezes and the video lags.  And.. The Worst...  With Netflix.. Horrible...  Many times per show locks up and has to re-buffer.  My OLD blue-ray player never had this problem.  This device has issues.  FYI  60 meg internet.  may work with Amazon, but NOT with apps", "verified": true, "helpfulness": "0/0", "author": "Kerry J. Barna \"seker\""}]