[{"rating": 5.0, "review": "Simple setup and definitely the best streaming device I have ever used. We are using it to watch TV episodes, movies other content daily. This will likely lead to cancellation of my cable TV service by the end of the year. This is simply a great product.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Lynn Pearce"}, {"rating": 5.0, "review": "This is great.  We bought a smart tv that isn't so smart since it didn't really offer any apps (Vizio).  I like the Roku on screen appearance better (cleaner looking), but voice search is nice, with the remote and the phone app.  Now, I just wish Super Why was free with Prime, but I guess that is what PBS Kids and YouTube is for.", "verified": true, "helpfulness": "0/0", "author": "Western Girl \"bookgirl\""}, {"rating": 5.0, "review": "If your tv isn't a smart tv then it will be with the amazon fire tv, just wish you can get better apps", "verified": true, "helpfulness": "0/0", "author": "Phyllis Hansell \"ER-NP\""}, {"rating": 2.0, "review": "My review would have been much higher if the remote it came with worked properly. I replaced the batteries 3x's, It still only worked good one day only, then it needed new ones again", "verified": true, "helpfulness": "0/1", "author": "maha"}, {"rating": 5.0, "review": "When we received the Amazon Fire TV I thought it would probably be hard to install and use.  We read the directions and had it up  and going in a very short time.  The introduction video is very informative and explains how to use the device.  We did exactly that and found a movie on Prime to watch.  We have since watched other movies.  I love the ease of use and the selections to watch.  Great device!", "verified": true, "helpfulness": "0/0", "author": "Gail Gray"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "is there any way you can get local channels on the Amazon Fire TV", "verified": false, "helpfulness": "1/7", "author": "Donna L."}, {"rating": 5.0, "review": "this is an easy hookup to the world of streaming video.everything was clear in the instructions.We are grandparents so not particularly tech efficient,but we could do it.Choices are abundant.", "verified": true, "helpfulness": "0/1", "author": "MaiMaibookie"}, {"rating": 4.0, "review": "Its okay", "verified": true, "helpfulness": "0/1", "author": "Carl Bonecutter"}, {"rating": 5.0, "review": "So far so good. Picture is clear & the selections are abundant. Enjoying so far.", "verified": true, "helpfulness": "0/1", "author": "Christina Wiersgalla"}]