[{"rating": 1.0, "review": "Why do I care about \"3 times the processing power\"?  I'm going to watch movies and television shows.  Sounds kinda \"OP\" to me.  It would mean more to me if I were buying a computer for something that would *actually* benefit from the extra power.The feature chart doesn't make a convincing argument as to why I should choose Amazon Fire TV.  \"Voice search\" and \"Optical audio out\" aren't that important to me or my friends with similar devices.Show me how your product distinguishes itself in a more meaningful way and I will buy one.  I'm on your site just about every day.(1-star rating given b/c there is no option not to rate it.  - I really don't think it's fair to Amazon though)", "verified": false, "helpfulness": "6/31", "author": "Trey Childs"}, {"rating": 4.0, "review": "fun fun fun so far.some apps are a pain but all In all very good experience.", "verified": true, "helpfulness": "0/1", "author": "Paris Gentzler"}, {"rating": 4.0, "review": "Streams well, navigates good", "verified": true, "helpfulness": "0/2", "author": "chris patterson"}, {"rating": 5.0, "review": "I had a small issue with wifi connection when I first got it, ATT Broadband user. \"Connected with Problem\" which meant it would see the router but not connect fully. Reset the router and the issue went away.NavigationNot as simple as I had hoped but still not hard. Searching for movies is little difficult only because the Prime movies are mixed in with the rentals. To avoid this issue, go to website and select Prime tab. Add movies to the watch list, much easier and all the Prime movies (free) are together and much simpler to navigate.SelectionYes there are thousands, but some are not really anything you would want to see. However there are good quality movies, new and old. You will find plenty to watch and enjoy so don't worry. What I didn't like, it is only season 1 of the series, King of the Hill, Sopranos, etc all should be full series IMO. Just want to hook you into buying the series on DVD.GamesI don't know, had no intention of playing any.Overall, I am very happy with FireTV, recommend it for those who don't want to add another Cable or Satellite box to a room.", "verified": true, "helpfulness": "2/2", "author": "Michael"}, {"rating": 2.0, "review": "I was excited for my Fire TV to arrive, but after nearly a month of ownership, I'm sadly overall disappointed in the product.The aesthetics of the packaging and product are appealing. Fire TV arrives in Amazon's simple, user-friendly packaging. The product itself is compact, sleek and clean looking. Due to it's small size, if can fit almost anywhere. I was able to place mine right on top of my cable box, and it's hardly noticeable.Set-up is simple, and only takes a few minutes. Only two wires are needed: the power cord and an HDMI cable. However, beware, the HDMI cable id NOT included- you must purchase it seperately. Something that I was suprised to find out only after I went to set-up the product.However, where my real disappointment set in is with the pricing and product availability. I thought that as an Amazon Prime member, series and movies would be affordable. Boy, was I wrong. Having a Prime membership appears to give you little to no benefit. The selection of free streaming movies is limited. Movies available for purchase typically range from $4-6. Series are mostly available for purchase by individual episode, a few by season. However, the average episode tends to fall in the $4-6 range, the same as a movie price. I find this outrageous because a majority of the population will only watch an episode of a show only one time and be done with it.One bonus is that you can access apps such as Netflix and Showtime. However, those require paid memberships in order to access any of their material. But, once paid the material available on those apps is much more extensive than Amazon's Library, and in the long run, cheaper. This is because you're only paying one set membership due for access and not paying per show/movie download.All in all, I would've preferred to just keep renting from Redbox. This will probably end up being another gadget collecting dust in my house. My advice is to save your money. I'm awarding it two stars just for aesthetics alone.", "verified": true, "helpfulness": "5/10", "author": "Shauna"}, {"rating": 5.0, "review": "Loving my fire tv !", "verified": true, "helpfulness": "1/3", "author": "Shar T"}, {"rating": 5.0, "review": "Great unit and much faster than the appleTV we have setup.Adding the games gives it the edge and very please with the video quality.Thanks Amazon and keep the great items coming.", "verified": true, "helpfulness": "2/2", "author": "JKB"}, {"rating": 5.0, "review": "This is the best streaming device I have encountered thus far..  It does CRASH  periodically but so far is still the best device I have seen.  The  number of apps and services is impressive.  Sorely  missing a web browser.  Seems most of these devices would rather deny you direct web access.", "verified": true, "helpfulness": "1/1", "author": "George Shaffer"}, {"rating": 1.0, "review": "Crazy expensive. Not worthy even to try.", "verified": true, "helpfulness": "4/24", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Far too many costly  programs must be purchased for this nice item too be of much use.", "verified": true, "helpfulness": "3/12", "author": "TopCopUSA"}]