[{"rating": 5.0, "review": "great device easy to set up navigation easy also would buy again tell others about it it is really cool", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 3.0, "review": "Quality does not appear to be 1080P1080i or 720P quality maxUnit does not give an indication of the  speed", "verified": true, "helpfulness": "1/1", "author": "William D."}, {"rating": 4.0, "review": "Much faster than Apple TV and I LOVE the voice control. The only reason I give it a 5 is bc a few times I was playing games the controller stopped working. So much better than cable through IMO.", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 5.0, "review": "The Amazon Fire TV is great.  I love that the voice command actually works.  I had so much fun the other night listening to Pandora and playing games (Minion Rush) on my tv with my 2 little girls.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "First off, Fire TV is basically a fire tablet that plugs into your tv. All channels are just Apps and thee are not even 10% of what Roku offers. The search feature is dreadful, it basically ignores what you are searching for and points you to Amazon pay service regardless of what you are actually looking for OR if it does manage to find the program it tries to get you to pay for it even if it is available for free on Netflix or Hulu.The hardware is not ready for release. Mine has to be rebooted several times each day. It freezes and just stops working. About 80% of the time the Hulu Plus App returns \"could not start this service\" When Hulu does work whatever show I watch it freezes for 10-60 seconds, though strangely the ADs NEVER freeze. I checked my network and then ran a PC with Hulu plus and Hulu Plus on Fire and the PC worked fine, Fire kept freezing.I replaced an older Roku and I have since plugged it back in, this thing is terrible. The voice search is a gimmick as no matter what you search it takes you to Amazon to purchase. It's just one giant marketing device.I will be sending this back and getting another Roku.If you are coming from a Roku, stick with Roku it's light years ahead of this slug.", "verified": false, "helpfulness": "7/14", "author": "Mark F"}, {"rating": 5.0, "review": "I am so pleased to have my Amazon Fire TV? I can now watch my Prime selections on the big screen. The design of the whole system is sleek and sexy. It is very easy to use and the speak feature is amazing, it really works ! I love this machine.I also need to comment on the packaging. Opening my Amazon Fire TV was part of the wonderful experience. The packaging is vibrant and sort of like opening Pandora's box. The colors and the compartments made my experience a plus from the very beginning. Stunning !Thank you to the development team for creating the amazing magical box. I love it !", "verified": true, "helpfulness": "0/0", "author": "Maryelen in Vermont"}, {"rating": 5.0, "review": "Fire TV was delivered before I got home, one of the kids had it set up in a few minutes and we love it.", "verified": true, "helpfulness": "0/0", "author": "Creature"}, {"rating": 3.0, "review": "not too impressed with your device. you dont keep up with your prime members watchlist and try to charge for free videos. gonna keep it one more day and if i cant rectify this its coming back.", "verified": true, "helpfulness": "1/2", "author": "Kindle Customer \"oldfart\""}, {"rating": 5.0, "review": "Used my smart TV before, but the Fire TV is so much easier to use.  I really like the voice recognition.", "verified": true, "helpfulness": "0/0", "author": "Terry DeSande"}, {"rating": 4.0, "review": "Pros:1. Small, compact and sleek.2. UI is very fast and easy to traverse.3. Are you a Casual Gamer? Well, good news, the gaming aspect is very well implemented. (Some more titles would be greatly appreciated, though)Cons:The Voice Search feature doesn't work across all apps (e.g Netflix, Hulu, etc) At the moment, it's only compatible with Amazon Prime, which is a major drawback.", "verified": true, "helpfulness": "1/1", "author": "Gerrel"}]