[{"rating": 5.0, "review": "I got Amazon Fire TV for my wife as a Christmas gift. She loves it! So easy to use and so much content is included!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "LOVE LOVE!  Only complaint is the free movies should be in a seperate place from all the pay movies.  Be careful because something may say you have to rent it but if you look in Netflix you can get it for free.  They should somehow fix this bug as well but I really love it!!", "verified": true, "helpfulness": "0/0", "author": "Karen Stewart"}, {"rating": 5.0, "review": "It awesome item. From Colombia, Amazon Fire TV is ok.", "verified": true, "helpfulness": "0/0", "author": "Juan Camilo Díaz Ortega"}, {"rating": 5.0, "review": "Love it! Took it out of the box, plugged it in and my account was recognized immediately. Now my Apple TV box sits collecting dust.", "verified": true, "helpfulness": "0/0", "author": "Gina Star"}, {"rating": 5.0, "review": "I love it!!!  It is so simple to use for someone who is as technologically challenged as I am.  Just plugged it in and started using it right away.  Good job Amazon.", "verified": true, "helpfulness": "0/0", "author": "Sandra I. Bradum"}, {"rating": 1.0, "review": "Boo! Terrible. Don't buy it", "verified": true, "helpfulness": "1/8", "author": "Brian Bird"}, {"rating": 5.0, "review": "Excellent device!  I own a Roku 2 and Roku 3 and the Fire TV has become my main device.  It is much faster than either of the Roku's that I own.  I especially like how the Photo's and Videos are integrated into the menu system if you are a Prime member and load the Amazon cloud drive app.  It is nice to be able to view all the photos and videos on the big screen.  The voice search is helpful but does only work with Amazon apps etc...  Love this device.", "verified": true, "helpfulness": "0/0", "author": "Xair"}, {"rating": 5.0, "review": "Love it and it works great.", "verified": true, "helpfulness": "0/0", "author": "bnlusa \"bnlusa\""}, {"rating": 5.0, "review": "Love the Fire TV Me and are family can not get enough of it. We even down graded are cable package.", "verified": true, "helpfulness": "0/0", "author": "Keith Glover"}, {"rating": 3.0, "review": "Sometimes it has issues with the video portion of the TV show but never with the advertising", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]