[{"rating": 5.0, "review": "My Amazon Fire TV was a gift and I love it.  It is such fun to \"binge\" watch shows that I have wanted to see but have been missing.", "verified": true, "helpfulness": "0/0", "author": "Louise Dow"}, {"rating": 5.0, "review": "Having an already extensive instant video library as well as apps and games thru my Kindle Fire HDX enabled me to get right to business with my new Fire TV my girlfriend got me for an early Christmas present! The only problem I had was due to the fact she bought it for me, they told me I didn't qualify for the two free games that were supposed to come with it, the game of life and Sev Zero. They told my girlfriend they were for her but she's in Australia and can't even get them. But I do have lots of games, so that's not a big deal. Ill get them eventually. Right now I'm just enjoying watching my instant videos on the big screen and playing Riptide GP 2, which looks phenomenal on my HD tv!", "verified": true, "helpfulness": "0/0", "author": "Yotesfan71 \"Geoff Oliver\""}, {"rating": 5.0, "review": "This is well made.........and a must buy", "verified": true, "helpfulness": "0/2", "author": "Christopher L. Allen"}, {"rating": 4.0, "review": "Easy to use with much less buffer time than routing through my DVD player.  However, having to pay extra for rentals on top of the Prime membership is misleading.", "verified": true, "helpfulness": "0/0", "author": "Karen Olson"}, {"rating": 5.0, "review": "Great product, great design.", "verified": true, "helpfulness": "0/0", "author": "Peter V."}, {"rating": 5.0, "review": "Awesome little box. Turns on and on the next episode of my show in 9 seconds -- basically the same time it takes the TV to turn on! Coupled with your Amazon Prime Video, it's excellent. Faster/smoother wireless video streaming than the laptop I was previously using, and far superior video quality.", "verified": true, "helpfulness": "0/0", "author": "Matthew S."}, {"rating": 5.0, "review": "I love Fire TV.  It was easy to set up, I have lots of viewing options and the picture is beautiful.", "verified": true, "helpfulness": "0/0", "author": "Teresa Toner"}, {"rating": 5.0, "review": "Amazing fire TV is very good, easy to set up and operation is outstanding!Lester Davis", "verified": true, "helpfulness": "0/0", "author": "Lester L Davis"}, {"rating": 5.0, "review": "Smarter than smart tv!  We love it.  Fire arrived at our new home before we did.  Our cable installer hung out to watch as we tried to learn about the device.  For that matter, he was trying to show me how complicated it would be to use.  But he ended up purchasing a movie and matching how easily I returned it.", "verified": true, "helpfulness": "2/2", "author": "Suzanne Kramer"}, {"rating": 5.0, "review": "A Hell of a lot better than Netflix !!!", "verified": true, "helpfulness": "0/0", "author": "Bruce Matulonis"}]