[{"rating": 5.0, "review": "Fantastic box. XBMC/KODI works great with this box. It runs it the best out of any Andriod box that I have used incl the Gmidnight box. much smoother, just like my computer does.", "verified": true, "helpfulness": "0/0", "author": "Shubie22"}, {"rating": 4.0, "review": "Works as expected with my system; however, does not work on Harmony controller.", "verified": true, "helpfulness": "0/0", "author": "Robert G Vogel"}, {"rating": 5.0, "review": "This is the best possible addition to complete my home theater set up! Voice search is amazing.", "verified": true, "helpfulness": "0/0", "author": "Lw"}, {"rating": 5.0, "review": "Awesome shows", "verified": true, "helpfulness": "0/0", "author": "Danelle Fitzpatrick"}, {"rating": 5.0, "review": "Amazing system, very easy to use. All that amazon TV has to offer at your finger tips, with the Netflix app just a click away it is perfect.", "verified": true, "helpfulness": "0/0", "author": "Ty \"Tyler23\""}, {"rating": 4.0, "review": "So far so good. Have been using it for approximately a week and will probably give it more stars after having more experience with it. It's features that is better than that of the AppleTV that it is replacing.Although it is a refurb everything about it looks new, from the packaging to the various components of the product itself. So far, well worth the price", "verified": true, "helpfulness": "0/0", "author": "Stephen R."}, {"rating": 3.0, "review": "Can't turn box off when I want. The box has no vent holes and gets hot quickly. Not enough free tv shows. Box need more storage capacity. Changing channels to new show is difficult process. Hard to set my  personal viewing habits.", "verified": true, "helpfulness": "0/0", "author": "jerry hardy"}, {"rating": 3.0, "review": "The system is great but, too many selections you have to pay for. Movies from tge 80s to rent for 4 bucks only for 24 hrs??? And i think if you are a prime member, you shouldn't have to purchase current tv shows that come on basic cable (CBS, NBC, etc)", "verified": true, "helpfulness": "0/1", "author": "Abbyegail Spears"}, {"rating": 2.0, "review": "Did not meet my expectations.  Some replays were of weak volume.", "verified": true, "helpfulness": "0/1", "author": "George W. Ferenzi, M.D."}, {"rating": 5.0, "review": "Fantastic product.", "verified": true, "helpfulness": "0/0", "author": "engine"}]