[{"rating": 2.0, "review": "Controller is cheapest feeling piece of s*** I have ever touched shy of a disposable water bottle, but the voice search is cool. Where is my Google Play? Oh wait its not available, but the game Shark Attack is.", "verified": true, "helpfulness": "0/1", "author": "Sam Weight"}, {"rating": 1.0, "review": "Don't like it at all, Don't recommendCan't watch any of the showsIt is a hazzle to operateI get more use out of an antenna than this product.I'm rating it no Stars", "verified": true, "helpfulness": "2/9", "author": "Michelle Fender"}, {"rating": 5.0, "review": "I live in the mountains and this works great and is a awesome alternative to dish network. I am officially getting my Prime memberships fullest benefits with more great choices. I got the Sling TV app and amazon fire tv allows for great streaming. I would buy it again!", "verified": true, "helpfulness": "1/1", "author": "Crystal Sears \"C Sears\""}, {"rating": 5.0, "review": "Love love love it!", "verified": true, "helpfulness": "0/1", "author": "Ruby Sawhney"}, {"rating": 2.0, "review": "It not what I expected not enough free movies", "verified": true, "helpfulness": "1/2", "author": "Kent Hardiman"}, {"rating": 5.0, "review": "Not a hiccup yet. Watched a couple movies from amazon and netflix. It's a lot better than my google TV, but does not have google play movies that I have seen yet. Wife really likes the amazon photo integration. One step closer to cutting the cable cord.", "verified": true, "helpfulness": "0/0", "author": "EE_NMSU"}, {"rating": 5.0, "review": "Nice format and for a Prime member it is a pretty good deal.", "verified": true, "helpfulness": "0/0", "author": "Chief Pace"}, {"rating": 5.0, "review": "Very easy to operate.  Nice to have but just about everything you want to watch has a price tag attached.  Does not save any money.  Don't be fooled and do not give up your cable, dish, direct tv,", "verified": true, "helpfulness": "2/2", "author": "Andrew W. Proch"}, {"rating": 3.0, "review": "This device works well for movies but not for weekly series downloads, specifically on Hulu TV. It constantly freezes and you only hear audio. I called Amazon techs & they forwarded my request to Hulu. But I was told that the Hulu team has to get the request & address it on their end. So far I haven't heard a word back from either Hulu or Amazon on a resolution to this problem.", "verified": true, "helpfulness": "0/0", "author": "Pauline Gibson-Tobin"}, {"rating": 5.0, "review": "It is small and quick. I hadn't planned on buying it but we were having trouble with our SONY Blu-ray player's Wi-Fi so I decided to purchase the \"Fire.\" Again, its extremely fast and has a great deal of Apps and features.The only regret I have is that I should have bought it on sale a few months ago. I'll be surprised if cable TV will last 4 more years. This device, and others like it, will drive cable into complete obsolescence. The king is dead, long live the Fire.", "verified": true, "helpfulness": "0/0", "author": "Kevin J. Shields \"Kevin J. Shields\""}]