[{"rating": 5.0, "review": "Completely blown away. Much better than I thought. The voice control actually works!", "verified": true, "helpfulness": "0/0", "author": "mamali"}, {"rating": 5.0, "review": "I enjoy the Amazom interface and content library with Prime more than any other device. Easy as pie to set up and AC wireless compatible. I haven't had once hiccup in streaming yet. Color me impressed.", "verified": true, "helpfulness": "0/0", "author": "J. Quest \"JQfromMA\""}, {"rating": 4.0, "review": "Setup is easy once my TV set recognized the HDMI signal.  Playback is smooth and sharp compared to Verizon FIOS.  The channel choice is great including Showtime Anywhere compared to ROKU. Prime does not include enough new releases and you turn in your MP3 music selections if you cancel your account.  Music downloads to your own device are not allowed (for CD burning?).  Music playback is only on the Amazon Music App.  With this list of negatives why did I give it 4 stars,?  Ease of use, image quality, selection of programs, movie rental pricing is slightly lower than FIOS with free Prime movies (older selections), digital audio output (Roku does not offer this on latest boxes) and no password is needed to play movies as with ROKU.", "verified": true, "helpfulness": "1/1", "author": "Paul L  Pedrick"}, {"rating": 5.0, "review": "Very responsive. Plays instantly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my Fire TV! So easy to install and set up - great to have streaming video so much to choose from and great quality.", "verified": true, "helpfulness": "0/0", "author": "KW"}, {"rating": 5.0, "review": "Love everything about Amazon! More impressed with every experience on fire tv. Thanks for providing an remote app too!", "verified": true, "helpfulness": "0/0", "author": "sean"}, {"rating": 5.0, "review": "Quick load and never a buffer time with the circle spinning that drives me crazy. Wish I would have ordered it months sooner. Great product and a must have if you already have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "2kidsscreaming"}, {"rating": 5.0, "review": "Brings great internet connectivity to a TV away from a cable outlet.", "verified": true, "helpfulness": "0/0", "author": "Eric L. Peters"}, {"rating": 5.0, "review": "Faster than one built into tv", "verified": true, "helpfulness": "0/0", "author": "Dr. J"}, {"rating": 5.0, "review": "Great product, small and convenient. Well packaged. Easy to understand instructions. Runs well, fast response.The only con - needs a power button so it can be shut off when not needed or in your bedroom. The power light is quite bright in a dark room.", "verified": true, "helpfulness": "0/0", "author": "James E Smithhisler"}]