[{"rating": 5.0, "review": "I am no expert on this, but it has been great.  It was easy to hook up. There has been no problems.  I am a amazon prime member, so the free movies and TV content has been great.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Great quality of video, ergonomically set up easy to use and search", "verified": true, "helpfulness": "0/0", "author": "Frank Barbagallo"}, {"rating": 5.0, "review": "so far a great buy, have had it a week and is every thing we wanted.", "verified": true, "helpfulness": "0/0", "author": "Steven Wolley"}, {"rating": 5.0, "review": "This is great. The only thing is that you need to make sure the controls are locked because if you have little ones they can order movies.", "verified": true, "helpfulness": "0/0", "author": "Robert Calhoun \"Robert Calhoun\""}, {"rating": 5.0, "review": "We watched the Amazon Prime \"Bosch\" series and highly recommend this series. It's fantastic. We hope Amazon Prime will do a series 2 and more. Love the Bosch character!!!! Watching the series with Amazon Fire TV was effortless. Recommend both the Amazon TV and especially the Bosch series. Please do more seasons!", "verified": true, "helpfulness": "1/2", "author": "Michigan fan"}, {"rating": 4.0, "review": "This is FAST, I love the remote being controlled by blue  tooth. It works under covers, when people stand in your way, even from the other room. This is a quality remote that should last for years. I have had remotes in the past that buttons quite working rendering the device useless. Also the remote uses standard AAA batteries and amazon threw in the first set. The only complaint I can think of is that like almost all remotes it is black and almost impossible to find when laying on my couch, bet, etc. A Yellow Glo in the dark remote would be great.I never thought I would talk to a remote but this actually works to find movies, etc. In addition to amazon video I also use hulu and netflix apps. The voice search will find these apps but will not allow you to search with your voice while using the app. One must go back to old school navigation to move around to letters to search. The voice search would be great while using the apps. The absence of voice control using apps is my reason for giving 4 stars.I hope in the future to see this blend with my laptop so I can surf the net PIP style while watching TV.", "verified": true, "helpfulness": "0/0", "author": "ASMEQC"}, {"rating": 5.0, "review": "Can't beat it! In fact I'm having my cable turned off be I get my shows and more. The only thing I would like to see more 1030-1950 movies, and please one day add \"The Man From U.N.C.L.E\"", "verified": true, "helpfulness": "0/0", "author": "corey"}, {"rating": 4.0, "review": "Once I figured out how to run my router through the VPN it pulls the wireless VPN which allows American content overseas.  Now it works great, but it could be improved by building in the VPN feature.", "verified": true, "helpfulness": "0/0", "author": "Daniela Robbins"}, {"rating": 5.0, "review": "Skip the Fire Stick and go with the Fire TV. Having owned both the stick is very buggy, the Fire TV is a more fine tuned unit.", "verified": true, "helpfulness": "0/0", "author": "MPRIME \"RealD3al\""}, {"rating": 5.0, "review": "First unit had some software issues -- second worked like a charm. Great concept. Go Amazon!", "verified": true, "helpfulness": "0/0", "author": "A. Z."}]