[{"rating": 1.0, "review": "Did not like it, would not allow access to other item very slow. My computer works better hooked up to tv way more options.", "verified": true, "helpfulness": "1/4", "author": "Jeanne Holt"}, {"rating": 4.0, "review": "Love the product and the capabilities that it offers. WiFi setup relatively easy once you figure out on your own that passwords greater than a certain amount of characters will not connect. It would have been nice to know this little tidbit up front before I wasted 2 hours troubleshooting the problem. Amazon, please update your documentation to include this info.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "This is a very nice unit and love the smoothness of the operation.", "verified": true, "helpfulness": "0/0", "author": "Chvyjoe"}, {"rating": 5.0, "review": "I love the Fire TV. I am working on getting rid of my TV provider  (ATT U Verse) because of the cost. I have found a lot of good TV on the Fire that I did not even know about all free since I have Prime ( have had it for years and LOVE it) . When the grands come over we can always find something for them to watch. My daughter bought one and I just ordered one for my other daughter. Highly reccomend! I am not tech savy but with this you don't have to be. I do go to the Amazon website and load up on \"watchlist\" So I have some things to watch without having to search. Now if I can just find a DVR to record my favorite local TV shows the U verse is out of here!", "verified": true, "helpfulness": "0/0", "author": "Barbara Johannes"}, {"rating": 4.0, "review": "Amazon fire TV is definitely an awesome addition to your living room. Its high-def, responsive and rich in content. Combine it with a prime subscription, which is really the icing on the cake. I also love the digital audio out, which works well with my AV receiver. I also own a Roku, and Apple TV, and I can confidently say that Amazon scores over Apple TV on content front, especially with Prime subscription. Also, Roku lacks a digital audio out, which seriously impacts the overall experience when I watch movies/tv. Haven't tried the games yet, but its definitely a value add.One feature that would make it perfect is the headphone option on the remote as offered by Roku. Roku also gives you the option to add some private channels that are unavailable on their store, which widens the variety of content. The only reason why I would still keep my Roku is the ability to still watch movies/tv shows at night when the kids are asleep in the bedroom using the headphone on the remote.", "verified": true, "helpfulness": "0/0", "author": "Sanjith"}, {"rating": 2.0, "review": "After owning this streaming device for quite some time,. I can still say; disappointed.  I have DSL for internet; a wifi network.I moved the DSL modem next to the Fire, hardwired the connections, and Fire still chokes.  Trying to watch a Hulu show last night, last four minutes, and the Fire choked .  I ended up watching the rest on my iPad.This unit can't take any pressures from the broadband - or the shows will stutter.  I need to go back to my Roku 3, but alas, I gave that to my daughter.Will the wee Fire work better?  I wonder how much money I can spend to try to get one machine that will use the apps I need; Netflix, Hulu and Amazon Prime.", "verified": true, "helpfulness": "0/2", "author": "Cathy B \"Cathy B.\""}, {"rating": 5.0, "review": "It is wonderful! Easy as pie to use and hookup. I love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"S.K.\""}, {"rating": 5.0, "review": "The Amazon Fire TV is one of the most amazing products I have purchased.  It's ease of use and speed in streaming videos and movies is more than I ever imagined.  Previously we streamed through a BluRay player which was difficult at best.  It's compact size enabled me to tuck it up on the wall bracket behind the tv.  I would definitely recommend purchasing this.", "verified": true, "helpfulness": "0/0", "author": "Sandy M."}, {"rating": 5.0, "review": "Setup was fast and easy.  LOVE watching Amazon Prime Instant. Video on the HDTV!  Got the iPad sync'ed as well so can control the Fire TV from the iPad, and show the iPad screen on the TV too.", "verified": true, "helpfulness": "0/0", "author": "David M Finch"}, {"rating": 4.0, "review": "A very good streaming device sound and picture super, need to add more channels for example Play ON would be nice.", "verified": true, "helpfulness": "0/0", "author": "George A Holodak"}]