[{"rating": 5.0, "review": "I am an Amazon Video Library user - and have all of my movies purchased and stored on their (my) cloud. I have tried using my TIVO box, a PS3, a Google TV and a computer hooked to my TV to retrieve and show movies - but nothing worked 100% until I found this. It is TERRIFIC.I could ask that they allow additional apps to be installed - but I am a satisfied customer!!!", "verified": true, "helpfulness": "1/1", "author": "Geoff Hicks"}, {"rating": 2.0, "review": "I bought this product because I am a truck driver and I needed a device that would stream my movies,tv fav or music on to itself and then I would be able to watch it on my tv and not use up my internet data but I was disappointed to find that this device is just another box like direct tv or cox cable. I already have netflix,amazon,hulu at home on my vizio tv so I don't need this device there. So this is a waste of money cause it is costing more money on my internet data connection.Don't by it unless you have umlimited data.", "verified": true, "helpfulness": "2/12", "author": "Char M"}, {"rating": 3.0, "review": "It's okay the only thing I didn't like is that the USB flash drive doesn't work , ya should work on that", "verified": true, "helpfulness": "1/3", "author": "miguel mendez"}, {"rating": 2.0, "review": "I have used Dish Net broadband service with no issues for many months, using the midrange service, up to 10Mbps.  No problems.Within a day or two of installing the Fire TV, I had consumed half of my months allotment, without to my knowledge downloading more than short segments of a couple of Movies, which, by the way had downloaded erratically.I did not find evidence from Amazon prior to making the purchase that Satellite broadband is not suited to more than occasional short segments of movies, tv, etc.This is the first time I have been dissatisfied with a large number of purchases from Amazon.", "verified": true, "helpfulness": "1/9", "author": "Robert G. Horn"}, {"rating": 5.0, "review": "We love itAlready have Roku and wanted to try something different and I love everything from Amazon,Love their products and prices", "verified": true, "helpfulness": "0/0", "author": "Arlene Villasenor"}, {"rating": 5.0, "review": "It is such a pleasure to get a new product that actually DELIVERS and BEHAVES like it does on the advertisements!  We are loving our new Fire TV, and it's incredibly cool to just press and talk to the device .... it literally could not be easier!!  Thanks, Amazon. :)", "verified": true, "helpfulness": "1/1", "author": "Kim Penny"}, {"rating": 4.0, "review": "We had a rough time starting to use the Fire TV box because (after much trial and error we figured it out!) our HDMI cord was apparently bad.  After getting a new one we were good to go.  Have really enjoyed using it so far to play games and stream stuff free since we have Prime", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This product is excellent. And I really like the shipping method and speed that as my expected.Amazon provides us a lot of free movies to prime members, I hope Amazon keep doing this that will keep you more successful.", "verified": true, "helpfulness": "1/1", "author": "gao yifan"}, {"rating": 2.0, "review": "Nothing new in fact have old player that does the same thing thru samsung and that was installed two years ago!", "verified": true, "helpfulness": "1/9", "author": "moxie"}, {"rating": 5.0, "review": "I have used it everyday for about 2.5 weeks now, and I have to say I am completely sold.  I do find it strange that there is no power button (it turns itself off) and it is really nice that when hitting the home button the device turns my TV to the correct input selection automatically.  I wish it had HBOGo now (its supposed to be added in the next few months) and sometimes searching is a little wonky.Although I have not used the amazon instant too much, the voice command option is great.  Easily recognizes words and names quickly.  I would recommend anyone thinking of getting a box like this to purchase this one.  I was set to get the Apple TV, but this device is so much more powerful that my decision was made for me.", "verified": true, "helpfulness": "1/1", "author": "Gregory"}]