[{"rating": 3.0, "review": "No vudu app. Five stars if you give the consumer a choice. Otherwise it is worth the purchase.", "verified": true, "helpfulness": "1/3", "author": "Chad harner"}, {"rating": 3.0, "review": "It's a very nice tool. The only reason why I did not give 5 stars is because I wished they would have given more freedom in terms of which apps to install (since the system is based on android). Instead, you need to sideload apps using a PC or tablet and carry out cumbersome steps in order to have the installed apps show up in the app list. Why not to leave the buyers a bit more freedom?", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "this one has voice search  the stick doesn't.  I have both.  You can't which controls for voice search.", "verified": true, "helpfulness": "0/1", "author": "Empress AL \"A\""}, {"rating": 5.0, "review": "I love this device! Everything from the super simple set-up to the voice search...it's all incredibly well designed, and a real pleasure to use!! A far less expensive alternative to buying a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Deena S."}, {"rating": 4.0, "review": "Good device.  It does seem to freeze every so often (hence the four stars).  A small unobtrusive package.  The remote is nice and the voice recognition is great (I have an accent and the system has yet to mess up my requests)!", "verified": true, "helpfulness": "0/0", "author": "Vivek Sen"}, {"rating": 4.0, "review": "I got excited for this, but wish I got the game controller, not just for games, but for ease of username/password/address/composure entry. A lot of ways to spend your money if you set up an account so beware. The kid uses it in their room mostly now.Also realize if you get this as a Cable alternative like SlingTV, you will have a very limited channel selection with scarce DVR/playback capabilities. I wish they allowed picking a set number of desired channel from a list rather than set packages with a bunch of sports and news channels.", "verified": true, "helpfulness": "1/1", "author": "Maiku"}, {"rating": 5.0, "review": "Fabulous! Astonished at how easy it is to access previous seasons and episodes of shows. Just wonderful!! Thank you, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Karen P."}, {"rating": 2.0, "review": "I like so much I order 2 more formy other tvs I have", "verified": true, "helpfulness": "0/2", "author": "rebond"}, {"rating": 5.0, "review": "I love this thing!  Easy to set up, easy to use and as an Amazon Prime member, there is enough free content to keep me happy for a long, long time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Had for over a month now. You can download many other apps. Wondering why I still have Direct TV...", "verified": true, "helpfulness": "0/0", "author": "Sean"}]