[{"rating": 5.0, "review": "So far we like it. Learning how to use it!", "verified": true, "helpfulness": "0/0", "author": "Yvette Riggs"}, {"rating": 5.0, "review": "Great item. Lot better than apple tv.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 4.0, "review": "Worked quite well. Looking forward to future Amazon content offerings.", "verified": true, "helpfulness": "0/0", "author": "R. Utne"}, {"rating": 5.0, "review": "Don't hesitate. . . this is the best thing. Easy-peasy to set up and use.  Lots of terrific shows to watch - just not enough couch time to do it justice.", "verified": true, "helpfulness": "0/0", "author": "WillaCake"}, {"rating": 4.0, "review": "I used this device to replace my WD Live TV, which, had issues losing connection to my wireless router. It is a long haul to this particular spot, and the extra antenna make all the difference. I never lose connection with this device.It doesn't quite have the depth of video apps I'd like to see and it doesn't stream from my PC, which is a bummer. But overall it is a great device, easy to use, with a good eye twords quality and simplicity", "verified": true, "helpfulness": "0/0", "author": "Ben Granholm"}, {"rating": 5.0, "review": "SO EASY TO USE AND FAST", "verified": true, "helpfulness": "0/0", "author": "r. welker"}, {"rating": 4.0, "review": "Works great!!!", "verified": true, "helpfulness": "0/0", "author": "James Love Sr."}, {"rating": 5.0, "review": "Easy to use just plug it in and watch", "verified": true, "helpfulness": "0/0", "author": "William akridge"}, {"rating": 5.0, "review": "Before my Amazon Fire TV, I used to have a Roku 2, the amazon fire tv is the best media player I have bought ever, the configuration is so easy, I don't have to spend a lot of time and researching to install netflix (I'm located in Colombia), with the Roku I have to set-up a VPN for the installation of Netflix in my device, and tha was a pain in my a$$ (excuse my french), the set-up of the VPN was not difficult, but is annoying.With my amazon fire TV, the set-up of netflix was smooth, and it works perfectly.I used a lot Plex, to stream my media from a NAS to my media player, and have to pay: $4.99 for the Plex app on Amazon, (on roku it is free), if you are paying almost hundred bucks for a device, you should receive something like plex app free-of-charge.But I love my Amazon Fire TV, the control is great, the voice search works, even for my latinized english accent, but it only works for amazon and amazon prime content, I hope that in future updates it works for Netflix (at least).", "verified": true, "helpfulness": "1/1", "author": "Juan D. Henao M."}, {"rating": 5.0, "review": "Really glad I purchased it!! Can't wait for more of the apps to come out for it.", "verified": true, "helpfulness": "0/0", "author": "PATRICK KILLEN"}]