[{"rating": 5.0, "review": "Very easy to set up and use. I love the voice search feature. Its the only way I use it. Super fastThe only feature I would like is a web browsing mode so I can watch videos on sites like HBO and AMC.", "verified": true, "helpfulness": "0/0", "author": "Andrew H. Berks \"AndyB\""}, {"rating": 5.0, "review": "We dropped cable TV and are using OTA with a Mohu antenna.  This is a great addition to watch shows and movies on Amazon, Netflix, Hulu. Absolutely Love it!!", "verified": true, "helpfulness": "0/0", "author": "Wendy C"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "VALARIE JEFFERSON"}, {"rating": 5.0, "review": "AWESOME!!  The jump in performance is amazing.  The voice recognition is perfect out of the box.  Set up in 5 minutes.  Best designed remote of any I own (other than it's so small I lose it occasionally).  Can't be happier.", "verified": true, "helpfulness": "0/0", "author": "Kurt Brewster \"dockb\""}, {"rating": 5.0, "review": "Super easy to install.", "verified": true, "helpfulness": "0/0", "author": "Marisa"}, {"rating": 5.0, "review": "AWESOME", "verified": true, "helpfulness": "0/0", "author": "LEW JOHNSON"}, {"rating": 3.0, "review": "Works great but storage needs to be greatly expand.  Interface is good and voice command works good as well.", "verified": true, "helpfulness": "0/1", "author": "gtorres"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "James Hishon"}, {"rating": 4.0, "review": "By far the best digital streaming device I have used, however there are a few flaws that are very aggravating for me. The biggest is the lack of voice search within an app. When I am in Netflix I want to be able to do a search without having to run through the terrible point at the letter interface. The super simplified remote is great except in this case. Otherwise the device is super fast with great picture quality.", "verified": true, "helpfulness": "0/0", "author": "nh \"tarte24\""}, {"rating": 5.0, "review": "I liked the Fire TV Stick, though didn't like how competitive it was with the other hardware running on my WiFi network.  The Fire TV was the better option for me, as its hardwired Ethernet frees up my WiFi network while also serving better quality video content on a consistent basis.", "verified": true, "helpfulness": "1/1", "author": "Rob Morton"}]