[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "amanda gaona"}, {"rating": 1.0, "review": "This thing is ALWAYS losing my internet connection. It's right next to the router so I don't know what the problem is. It's to the point where I don't even use it anymore.", "verified": true, "helpfulness": "1/2", "author": "K. D. Robinson"}, {"rating": 5.0, "review": "Great product. Runs smoothly and streams instantly. Can't ask for better!", "verified": true, "helpfulness": "0/0", "author": "Daph"}, {"rating": 5.0, "review": "just right", "verified": true, "helpfulness": "0/0", "author": "Yvonne Apostolic"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Braulio C. \"BJC\""}, {"rating": 5.0, "review": "I have used the other online video streamers and they just don't add up, crisper picture, better sound, faster response, Bluetooth ability, able to put to sleep, All your prime contents on the big screen, mirroring with your devices. I am very picky with what I choose to buy but for me a no brainer. One last thing and most important you get quality service imagine that. You get to speak to real people who know what they are talking about and are nice to you.", "verified": true, "helpfulness": "1/1", "author": "Ernest Baehr"}, {"rating": 5.0, "review": "great price great product fast shipping", "verified": true, "helpfulness": "1/1", "author": "d2"}, {"rating": 4.0, "review": "Amazon Fire TV is a very good product. The specs exceed those of similar products on the market, it is easy to install and set up and though Amazon Prime presents in a slightly different format, it is easy to learn. My one disappointment with Amazon Fire TV is that two of the apps that I used most are not available; Acorn TV and RightNow Media. Both are available via one of your chief competitors. That is the only drawback, however, an important one for me.", "verified": true, "helpfulness": "0/0", "author": "Rob-Julie Miller"}, {"rating": 5.0, "review": "The best streaming player on the market", "verified": true, "helpfulness": "0/0", "author": "Gregory Lesmeister"}, {"rating": 5.0, "review": "I just luv it. Voice search works great. I have no connectivity issues even though my wireless router is 2 rooms away. I got Amazon Prime and Netflix. Plenty to c n do. Not to mention all the free apps available. Not gonna miss my high $$$ cable at all.", "verified": true, "helpfulness": "1/1", "author": "Jeffrey G. Clark"}]