[{"rating": 5.0, "review": "Excellent product and very easy to use", "verified": true, "helpfulness": "0/0", "author": "Mary M Sondel"}, {"rating": 3.0, "review": "Amazon TV Fire is very easy to operate and provides access to a wide variety of movies, programs and apps.  It downloads quickly as advertised.  On the downside, the picture quality of supposedly \"HD\" videos has been below that of the quality we receive on satellite for non-HD broadcasts.  Considering that the charge for HD videos is higher than SD, this was very disappointing.  Nevertheless, it does provide the services it advertises.", "verified": true, "helpfulness": "0/1", "author": "Philip Burda"}, {"rating": 5.0, "review": "So far I love it !!!", "verified": true, "helpfulness": "0/0", "author": "Jodie  L Hart"}, {"rating": 4.0, "review": "I purchased the Amazon Fire TV because I was having trouble streaming programs from Amazon Prime with my iPad through my AppleTV box.  The Fire TV solved the problem and works very well.  I find the navigation a bit challenging compared to the AppleTV menu.  Other than that it has worked fine.", "verified": true, "helpfulness": "0/0", "author": "K. Weeks"}, {"rating": 4.0, "review": "I LOVE THE VOICE SEARCH, I love the way it's EASY to use (no flashbacks to programming the VCR days here! Yea!) And I love the apps I can access, including games ($34 for a controller tho, that's a bit steep) What I wish more of is Prime content - seems like I see the same old same old available. and categories... they could use some further tweaking.  I'd also like to see my books on screen... my vision isnt what it used to be, and holding my kindle difficult, but to read my book on screen? that would be heaven. All in All - I love my Fire.", "verified": true, "helpfulness": "0/0", "author": "SheilaC"}, {"rating": 5.0, "review": "Great product and disappointed I bought this rather than the fire stick.", "verified": true, "helpfulness": "0/0", "author": "MM \"Maxwell T. Malloy\""}, {"rating": 5.0, "review": "I Love this thing, it works great - Wired and Wireless and is perfect with the Side Loaded Application I Use.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Love this!  Set up was so easy and the available programs are almost overwhelming.  I am a Prime member so I am not sure what the program availability is without Prime. The voice search is a big plus!  As others mentioned, wish you could voice search other programs. This is definitely worth the price.  I have recommended Fire TV to my family and friends.", "verified": true, "helpfulness": "0/0", "author": "K. Tenbusch"}, {"rating": 5.0, "review": "Very easy to set up... Love it, but it has no off button", "verified": true, "helpfulness": "0/0", "author": "Shawn Crete"}, {"rating": 4.0, "review": "I love this thing, and I wanted to give it five stars.  The five star product would make one simple but important change: the voice search feature would include content from the apps, like Netflix and HBOGo.  Instead, whenever voice search is used, the results are only from Amazon's content, even if I try to use it within the Netflix app.  I get that Amazon is trying to sell me things, but let's try to keep it from obstructing the user experience, which is simply demeaning to whomever is using the device.  Otherwise, it's fantastic.  Smooth, fast, easy to use, and rich with content through Amazon and its wide range of apps -- the big difference between Fire TV and Chromecast, which has less available.", "verified": true, "helpfulness": "0/0", "author": "xataro"}]