[{"rating": 2.0, "review": "Every device needs to have a \"unique\" feature that warrants a purchase.Apple TV allows access to streaming iOS and mac devices and iTunes on iCloud and on local computers (great for not using data bandwidth if video stored on Harddrive, or if internet goes out, you can still watch movies)Roku 3 has arguably better line up replacing Twitch with HBO GO (but that is personal preference) and still gives access to amazon internet video. Also has a headphone output on the remote, if your afraid of disturbing others.Google Chromecast gives you access to Google Play content and streaming from pc, mac, iOS, and android devices (for $65 cheaper than Fire TV).Fire TV ... gives you DD+ (only beneficial if you have more than 5 channels of audio and used with an audio receiver that supports it), voice diction which is never as accurate or simple as text (apple tv can use iOS keyboard input) and many people would not even benefit (i have many deaf friends). It also gives you access to basic stripped down mobile games on your tv (if you don't already have a console to play, or an apple tv with an iOS device displaying on your tv, and maybe a bluetooth controller also.)The specs while on paper are impressive, need features that warrant the difference. I can't see this replacing any console which was its defining feature, and anything else that would require those specs.Apple TV has saved my hundred of dollars due to not requiring internet (can use Wi-Fi connection even without internet service to connect to my iTunes library). I can play full HD movies and not worry about going over my data caps.I am a person that lives by data caps, you don't realize how much data is used (3GB, 7GB or 9GB per hour for HD, Full HD, or UHD) until its limited. This is a huge problem with this device. It buffers videos even before you hit play, which will charge your account even if you don't want to watch the show. Also has anyone heard about the \"mosaic\" feature? Amazon released this product with a screensaver that would download the file over again every time it displayed, making users use more than 3 times their data cap. If you don't have data caps, then this is slowing down your speed as its adding competition on your network. (source https://gigaom.com/2014/06/30/amazon-fire-tv-bug-provides-another-reason-why-data-caps-are-anti-consumer/).", "verified": false, "helpfulness": "2/3", "author": "GarrettCox95 \"Garrett\""}, {"rating": 5.0, "review": "Great product to use if you like watching programs off amazon prime! The voice recognition works very well and makes it easy to find movies and TV series.", "verified": true, "helpfulness": "0/0", "author": "TOOLHOUND"}, {"rating": 5.0, "review": "How EASY! Love being able to stream from computer to TV. Thought I would have to hook something up from my pc to my television, but nope. My sister, already having had the experience with this sort of thing, unpackaged the box when it arrived, went straight to the TV, plugged in the usb cord and the power cord and that was it. I can watch Amazon, Netflix, You Tube...a plethora of videos on my television now. Can't beat it, especially considering the price.", "verified": true, "helpfulness": "0/0", "author": "Robin"}, {"rating": 3.0, "review": "Not really what I was expecting it to be.  Everything is much better in the advertising than it is in real life. This does not seem to be any different than my WII for watching Netflix or other programs.  Maybe that will change in time. So far, I'm not that impressed.", "verified": true, "helpfulness": "1/1", "author": "Silverado1"}, {"rating": 5.0, "review": "Quick, easy set-up. Beautiful picture. Awesome.", "verified": true, "helpfulness": "0/0", "author": "J. L. Jones"}, {"rating": 4.0, "review": "Best streaming media and console gaming device out there. The specs blow away the competition for its $99 price tag…can't really say anything bad about the box. With that said, the only reason I didn't give it 5 stars is because of its lack of expandable storage (USB PORT NOT ENABLED FOR EXTERNAL USE). But even with that slite drawback it's still the best media box I've ever used!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We are really enjoying this little guy. We could already stream Netflix through our BluRay player, but it was slow and cantankerous. And, it didn't have the Amazon app to play the Prime content. This gadget has a very fast processor and just flies through the menus. I'm also using it to stream music and plan to view my photos on it as well. Very easy and user friendly. Also a breeze to set up.Great product! Recommended!", "verified": true, "helpfulness": "0/0", "author": "Audio Nut"}, {"rating": 5.0, "review": "After software updates. This device works very well. Early on I had to reboot it at times. It's been updated and works great.", "verified": true, "helpfulness": "1/1", "author": "Chris S"}, {"rating": 1.0, "review": "I thought it would be good, not...  If you do not have a connect to your current router it won't work.  I have a subscription to spotify I pay for no way to access it. This is not as simple as they say.  I am disappointed with the Amazon fire tv for real it is not what they say.  If you do not have the right hookup, forget it.  Also you do not have the option to log into a subscription you already have, ie subscription to Spotify you do not have the option to log in to what you pay for once a month.", "verified": true, "helpfulness": "2/7", "author": "K. Bailey"}, {"rating": 1.0, "review": "Compare it to a $35.00 Chromecast from a Galaxy S5 or Note 4 and see how it performs. Comparing it to an Apple TV and a Roku 3 is a joke", "verified": false, "helpfulness": "0/6", "author": "Matt Cleaver"}]