[{"rating": 5.0, "review": "5 star review. Everything works great, Amazon and I have worked out our differences with this. Nothing wrong with it at all, fast, sleek, and ready for action.", "verified": true, "helpfulness": "23/132", "author": "Tommy"}, {"rating": 1.0, "review": "I got it today.Unpacked it, connect it.... And nothing...After few seconds the amazon boot screen disappear and than NOTHING!Only a red/amber flashing LED.Reboot does not fix it....", "verified": true, "helpfulness": "30/112", "author": "Peter Praum"}, {"rating": 1.0, "review": "No HBO Go, No MLB At Bat, no headphone jack on the remote.  NO DEAL.  This is far from \"groundbreaking.\"", "verified": false, "helpfulness": "22/140", "author": "Ken"}, {"rating": 1.0, "review": "why on earth would you pay $99 to do virtually the same thing, and more (aside from voice search) your computer can do when hooked to the computer? amazon should offer this product free with every paid subscription.", "verified": false, "helpfulness": "24/166", "author": "Ed Casella"}, {"rating": 3.0, "review": "The UI is fast for sure. It is sort of a cross between Xbox and Roku, and comes out looking better than both.Voice search, its main differentiating feature, works ONLY with Amazon content, which is a huge limitation. Amazon must know how few people they actually have using amazon video vs. Netflix.Setup is clumsy -- requires typing passwords for Netflix and Amazon, which is annoying on a remote.The lack of an iPhone app to control it also puts it at a disadvantage compared to Roku, AppleTV, TiVo and basically every other TV box.It is decent, but not quite a $99 box on par with Apple and Roku yet.", "verified": false, "helpfulness": "9/20", "author": "John Brosnan"}, {"rating": 3.0, "review": "I was really excited about this device and really wanted to buy it but it lacks the headphone jack in the remote like the Roku has! For those of us that are late night owls and don't want to wake  the rest of the family is pretty important. I'm really surprised that the developers overlooked one simple feature that would've had me abandoning my Roku for the fire. Anyway just writing this review hoping that amazon will see it and will put The headphone jack in the next version, and also just to warn my fellow comrades that really love the headphone feature.", "verified": false, "helpfulness": "6/19", "author": "Hereby Grace"}, {"rating": 1.0, "review": "So a couple of months you guys talked me into buying net gear for watching my prime movies. Ya had to know this was almost ready for release. For what I paid for net gear I could have waited and bought this????", "verified": false, "helpfulness": "11/122", "author": "louavulcardinal"}, {"rating": 2.0, "review": "Sticking with Apple TV. MLB is a must have for me.  I stream Prime content through Apple TV and it works fine.  Maybe FireTV will improve over time.", "verified": false, "helpfulness": "7/42", "author": "Peter Donahower"}, {"rating": 5.0, "review": "I'm not going to talk about tech specs or such. This is underpowered compared to an xBox or other items and I could care less how it physically looks compared to xyz product. I've been looking for something small to slap on the back of a TV in another room - this fit the bill and I bought it on a whim. Glad I did.It does everything I want - Netflix, Hulu, Pandora and more. I cut the cable a year ago and for the size, this thing rocks.Setup was a breeze. It found my wireless network and let me connect without complaints, after entering the password. The setup guide let my wife know about features I already knew about, but meh...After it was setup, it went through a software update and restarted twice - about 4 minutes total. Apps download pretty fast - the above listed apps all downloaded in less than a minute total.Netflix looks and acts fine, we picked up on a few series that we had been watching on the xBox. Pandora is easier to use than my xBox was. There is also a screensaver with landscape pictures. If I were a betting man, I'd bet this would show me my own uploaded pictures as well.There are all kinds of games on the device/service - haven't tried any yet. The voice search functionality found an odd title from Disney that tends to get missed a lot by other services (All Dogs Go To Heaven) and even let me know there was a sequel (what?!)...  You can also use the voice feature to switch between apps - I can say \"Netflix\" while inside Pandora, and it'll bring up the Netflix icon to click on, avoiding the extra hops back to the main menu (I hate that issue with my xBox).This is small enough to slap on the back of a TV, powerful enough to do what we need and it even has the gaming option. My wife was pleased with this enough to say that we may want to buy another for our Travel Trailer.Edit: This morning, I also noticed that certain apps don't fully close. Pandora was open in the background, and still paused where I had left it yesterday morning. Interesting feature.Second edit: I took this on a trip in our Travel Trailer, just to see how it would handle the situation. I ended up having to use some software on a laptop to effectively create a wireless network for it to connect to, as there is no browser to type in \"access codes\" for places that have them. ALL apps & games are network enabled. Crappy connections were alright, but it did require re-buffering over and over throughout a single episode on NetFlix. Those wanting to use this to travel won't be too impressed unless a minimal browser is added to allow logging into networks that you must hit a webpage for.", "verified": true, "helpfulness": "45/53", "author": "JR"}, {"rating": 1.0, "review": "You almost had me putting it in my cart, Until i looked at the comparison chart and saw NO HBO GO.. What kinda \"ground breaking\" exactly are you doing? HBO GO is like KING of the premium channels, So much content you're missing.Until you add HBO Go, For me its a NO-GO", "verified": false, "helpfulness": "16/153", "author": "Aaron"}]