[{"rating": 5.0, "review": "Easy to use love it.", "verified": true, "helpfulness": "0/0", "author": "Jerry F. Goodwin"}, {"rating": 5.0, "review": "Easy installation and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "No,  would not work on out TV. I send it back.", "verified": true, "helpfulness": "1/10", "author": "Rubyvue"}, {"rating": 5.0, "review": "couldn't be better", "verified": true, "helpfulness": "0/0", "author": "Werner"}, {"rating": 3.0, "review": "We have enjoyed the Fire, am planning to go satelite free in the future and this item could come in handy. When we have used it, we enjoyed it.  Haven't had it long enough to tell a whole lot about it, the reason for the 3 stars.", "verified": true, "helpfulness": "0/3", "author": "J. Covington \"J Lopez\""}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "eva divine"}, {"rating": 4.0, "review": "I think Amazon might of hit a homerun with this.  Fast upload on movies, and the voice search feature has basically woked flawlessly.  HD movie quality on my 60\" HD TV has been crystal clear, and the sound is great.Only thing they need to do now is incorporate the entire Amazon store onto the Fire TV platform.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "Works well, the only thing I don't like is that the voice search only works for Amazon items not Hulu or Netflix or other apps. It definitely looks a lot nicer than having a laptop hooked up to the tv.", "verified": true, "helpfulness": "1/1", "author": "Jessica Freeman"}, {"rating": 5.0, "review": "INTRODUCTIONThis Fire TV is wonderful. There is enough content available for \"free\" (with Prime) that I don't need to pay exorbitant fees for Cable TV or Satellite TV.AMAZON PRIME'S VAST VARIETYI learned about Amazon Prime's prolific plethora of programming while I was living in a weekly motel with free Satellite TV and WiFi. There, I learned how much time I could waste (I mean enjoy) by watching movies and television programs on Amazon Prime. I loved the variety, and within days, I filled up my watchlist with hundreds of selections, often by using the \"People who like this movie also liked these movies\" feature. First, I watched on the computer, then I hooked up a smart Blu-Ray DVD player that let me watch Prime content on my TV. Occasionally, I even watched a program on the small Kindle Fire screen.Once I saw how much Amazon Prime I was watching, I wondered if I could avoid Satellite (and Cable) TV completely, and I implemented my plan when I finally bought and moved into my own home.========================================HOW NOT TO PAY FOR SATELLITE OR CABLE TV========================================I called TIME WARNER CABLE and got their $35 per month, 15 megabits per second Internet plan, and ordered the TCL LE40FHDE3010 40-Inch 1080p 60Hz LED HDTV (Black) from Amazon, along with the Amazon Fire TV adapter.You could use Amazon Prime, NetFlix, HuluPlus, or one of several other options for your main content provider. Maybe later, I'll get NetFlix to expand the number of shows I can watch.There was an old analog TV antenna on the roof, which I found out the prior owner had never used. It brings in one and a half station sets, three PBS channels, and sometimes, three CBS channels (CBS plus two weather broadcasts), so sometimes I watch CBS World News, and occasionally, I use my Internet connection to catch network shows, like Big Bang Theory, on CBS.com (for one example out of many). Eventually, I'll put a better antenna on the roof so that I can watch network news more reliably.CAN THERE BE TOO MUCH VARIETY?Even before I got this Fire TV adapter, I had managed to fill my Watchlist with many many movies and shows, so many, I can't remember whether some shows are in it or not. There's so much other content available, I haven't made a dent in it, because I keep finding new stuff to watch.When I want to search to see if a particular movie is \"free,\" for example, Star Trek, I do a voice search for \"Prime Eligible Star Trek.\" The main menu offers a \"Newly Released on Prime\" option. And, I can quickly look through various other lists on the TV screen. There is a lot to choose from. They even have a recommendations list where you can see recommendations based on what you've already watched. (NOTE that some of these lists allow you to remove items you are not interested in. I got rid of all the Power Ranger stuff that showed up in the recommendations list.)There is so much content, I can't imagine when I'm going to run out, especially since I am always adding more to my list. Sometimes, it just depends on how I feel, what movie I'll pick from the watchlist, or if I explore the other lists.SEARCHING FOR PRIME CONTENTAnother reviewer complained that he got a mixture of prime and non-prime stuff when he searched. To fix this, just start each voice search with the words \"Prime Eligible.\" You will only see titles that are eligible for free prime streaming. Needless to say, I love this device.SUGGESTIONS FOR AMAZON PROGRAMMERSPlease give us a PLAY ALL feature, so if I'm watching a series of TV show episodes, it can go right from one to the next without my needing to do anything.Let us set up a PLAY LIST, so that the Fire TV can move automatically from one movie to the next when we've set up an entire evening's schedule ahead of time.CONCLUSIONA great product. I highly recommend this to all of you.", "verified": true, "helpfulness": "0/0", "author": "John Williamson 2100 \"J.W.2100\""}, {"rating": 5.0, "review": "Excellent, great success", "verified": true, "helpfulness": "0/0", "author": "Liliam HURTADO"}]