[{"rating": 5.0, "review": "FireTV lives up to Amazon's reputation for producing quality accessories for their  products. The FireTV  INSTALLS VERY EASILY. A user can be up & running in a few minutes. Although my HD TV  can stream  various data/video's as does FireTV , the remote with either manual & especially VOICE search is significantly useful.Great product,Amazon,  Keep up your product improvements.", "verified": true, "helpfulness": "0/0", "author": "grayeagle4510"}, {"rating": 4.0, "review": "This does a great job of streaming over the internet.  Easy to set up and the remote is very functional and easy to use.  Nice size also.  The box itself is small and unobtrusive.  All in all a nice product.  The only reason for 4 instead of 5 stars is that I have not found a way to stream anything that is not from Amazon.  If I could get to other parts of the web with this box it would be a 5 or better.", "verified": true, "helpfulness": "0/0", "author": "Harry Walker"}, {"rating": 5.0, "review": "I intensely dislike being held hostage by commercial television service providers, whether they are via cable, or satellite services.  As a result, we decided to try internet streaming, and after researching the various streaming devices commercially available, we chose to try out an Amazon Fire TV device.  The setup was very simple and the device led me through all the steps with no problem.Because for reasons of economy, we do not subscribe to the faster available speeds from our internet service provider.  The Fire TV box is wireless, but I elected to get the maximum throughput of signal and used a network cable to hook the box directly to my router, without using the wireless capability.  In hindsight, I think it would work fine wirelessly..The results are extremely gratifying.  I did not have to upgrade either my older model Blu-ray player or my T.V. set at considerable expense and replace them with a \"smart\" unit (meaning wireless built in).  The video is smooth, the picture quality is great and except for the initial cost, there is no subscription fee to stream from the internet directly to the T.V.  I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Bill in Vancouver USA"}, {"rating": 5.0, "review": "I really like the Fire TV. I am enjoying all the free movies & TV shows, especially the BBC shows.", "verified": true, "helpfulness": "0/0", "author": "Daleen  E.  Keithley"}, {"rating": 5.0, "review": "This FIRE TV has been everything and more than we expected. Great Game options as well as bringing the family together for Movie Nights again with our subscription to Netflix and Hulu Plus and Amazon Prime. We are definitely going to purchase the Fire Stick next as soon as it is available. Thanks again AMAZON!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am very satisfied with Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Terron G."}, {"rating": 5.0, "review": "Runs great so far. Picked it up for my parents for Christmas, they are pretty slow when it comes to new technology but seem to be able to use this well. The only drawback was that it needed to be updated to run Netflix.", "verified": true, "helpfulness": "0/0", "author": "davenport"}, {"rating": 5.0, "review": "Love it, love all Amazon and kindle products", "verified": true, "helpfulness": "0/0", "author": "lovegames"}, {"rating": 5.0, "review": "works as advertised", "verified": true, "helpfulness": "0/0", "author": "Larry Palek"}, {"rating": 1.0, "review": "I was not happy with this product at all. I feel like I just spent $100 on a glorified Netflix membership. It's already in the mail to be returned.", "verified": true, "helpfulness": "1/5", "author": "Tracie L Smith"}]