[{"rating": 5.0, "review": "I am finding it amazing. I had a problem at the start because my internet speed was way below slow but 2 days, 2 technicians, 2 Wi-Fi access devices later and my internet speed went from .12 to 22 and now the movies are loading without problems - hops/skips/stalls.", "verified": true, "helpfulness": "0/0", "author": "SALLY E. ACEVEDO"}, {"rating": 5.0, "review": "easy to install and great programing. The only issue was at times it does lose WIFI connection other than that My family loves it.", "verified": true, "helpfulness": "0/0", "author": "Darrell Ivie"}, {"rating": 5.0, "review": "best device I ever bought.  Easy to navigate by voice and very accurate!", "verified": true, "helpfulness": "0/0", "author": "Marlon G. Jimenez"}, {"rating": 3.0, "review": "having a hard time figuring out how to use. whatever happened to instruction manuals?", "verified": true, "helpfulness": "0/0", "author": "Vicki Barnes \"mamaw\""}, {"rating": 3.0, "review": "After using Fire TV for just a couple of days with the trial Amazon Prime membership, I realized that I am actually not just buying the Fire TV but also the Prime membership (likely year by year in future). This is OK since It is pretty good to watch the Fire TV with the Prime membership; however, without it you just do not have much to watch. So here comes with a problem: Am I rating the Fire TV or the Prime membership? As a consumer, I would think to buy the Prime membership with a different coverage, or grade so to speak, and thus the price for the box will be inclusive of the Prime membership fee which includes the services of Fire TV. Would this be better serve everybody for what is really needed?", "verified": true, "helpfulness": "0/1", "author": "Amz Shopper"}, {"rating": 5.0, "review": "The voice search is a great feature and most times takes me right to the movie I want. This is way better than my smart TV which is quite dumb.", "verified": true, "helpfulness": "0/0", "author": "Tight Lines"}, {"rating": 4.0, "review": "This is great as long as you have the internet speed to support it. Also, I really wanted it for an older television set, but I am beginning to think an HDMI to RCA cord doesn't exist for this purpose.", "verified": true, "helpfulness": "0/1", "author": "KiloAlphaTango"}, {"rating": 4.0, "review": "it is kind of difficult to co ordinate with what is free", "verified": true, "helpfulness": "0/0", "author": "WINSTON GRANT"}, {"rating": 5.0, "review": "Easy to install and to use!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Athey"}, {"rating": 5.0, "review": "Love this!  Works well and lots of options! The only thing that could make it better is having additional movie apps, although there are lots of movies and tv programs on Prime. Extremely happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}]