[{"rating": 5.0, "review": "Voice recognition that really works what a concept. You and your team are the greatest keep up the good work!", "verified": true, "helpfulness": "0/0", "author": "Bill H.janeh"}, {"rating": 5.0, "review": "Great product, easy setup, extra memory makes a difference when streaming 1080P content.", "verified": true, "helpfulness": "0/0", "author": "Brian Corbett"}, {"rating": 5.0, "review": "This was so easy to install!  Have had it a little over a week and love all the movies and the clarity and sound of it.", "verified": true, "helpfulness": "0/0", "author": "amberstar"}, {"rating": 5.0, "review": "Love it so far.  Highly recommended.", "verified": true, "helpfulness": "1/2", "author": "ccas"}, {"rating": 3.0, "review": "I have Netflex and Amazon Prime, but the Fire TV will not recognize them and want me to join again.  Don't think so", "verified": false, "helpfulness": "1/6", "author": "Bobbi Rufi"}, {"rating": 5.0, "review": "Still amazes me :)", "verified": true, "helpfulness": "0/2", "author": "August M Kain"}, {"rating": 5.0, "review": "Best thing known to man, next to bacon.", "verified": true, "helpfulness": "0/3", "author": "Red Curr"}, {"rating": 4.0, "review": "I love it. It's easy to use. The voice search feature is great! I watch what I want because of prime, which is the greatest. The only thing that is missing for me is HBO Go and that will soon be added to make it perfect. I'm glad I bought it.", "verified": true, "helpfulness": "1/1", "author": "L. Hodges"}, {"rating": 5.0, "review": "Initially I bought this so that I could access XBMC / Kodi. I couldn't be more pleased with the purchase. This think is a powerful little addition to the entertainment system. Great for casting too. Highly recommend to those who don't want to pay a cable bill and still want great entertainment accessibility.", "verified": true, "helpfulness": "2/2", "author": "AJP"}, {"rating": 5.0, "review": "It met all my expectations!!!! I patiently waited for the right time to buy on Thanksgiving week.", "verified": true, "helpfulness": "0/1", "author": "Bien"}]