[{"rating": 5.0, "review": "Great picture good sound and super fast.", "verified": true, "helpfulness": "0/0", "author": "Kai K. Kanemitsu \"Kai\""}, {"rating": 5.0, "review": "VERY EASY TO SET UP. I'm WATCHING MY FAVORITE MOVIES ETC FROM MY Kindle TABLET ON MY BIG SCREE TV. MY PICS PHOTOS ARE FANTASTIC. I AM  AN AMAZON PRIME MEMBER--ALL THE TV SHOWS AND MOVIES ARE GREAT ON MY TV. I HIGHLY RECOMMEND THIS PRODUCT.", "verified": true, "helpfulness": "0/0", "author": "Frances G. \"lizzy42\""}, {"rating": 5.0, "review": "Best streaming device out there.  Voice search is great.  Selection of apps is above average and suits my needs.  The games and other add ons such as weather is a nice feature.  I'd recommend this device to anyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "If this had search ability across all apps it would be a hands down winner. Voice search and remote are way ahead of others. Search was a deal breaker for me so I went to a Roku. Once Amazon changes the search ability to include all apps from one location I'll buy it again.", "verified": true, "helpfulness": "0/0", "author": "Wyatt Seals"}, {"rating": 3.0, "review": "It goes in and out of Wi-Fi and is always buffing 4-5 times in one movie", "verified": true, "helpfulness": "0/0", "author": "jim barr"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 3.0, "review": "Amazon Fire TV is a good service however the amount of Prime movies and shows should be increased. Otherwise I am pleased", "verified": true, "helpfulness": "0/0", "author": "Jessica Brandolino"}, {"rating": 3.0, "review": "doze not except  my prime  says I watched movie and did not", "verified": true, "helpfulness": "0/0", "author": "Kerry H."}, {"rating": 5.0, "review": "Ok I waited for awhile to write my review on this because I was hesitant to take the plunge since I already had a 'smart' tv.  I am SO glad I did though this has made it SO SO much easier to surf from program to program and the microphone I can speak into is such a plus! Setting it up was a breeze and all you really needed was a HDMI cable and BOOM you are ready to go! I have 5 kiddos and each one knows how to use it which translates into a easier life for this Mom! LOVE it Amazon!", "verified": true, "helpfulness": "0/0", "author": "Jesse Mumm \"JESSE\""}, {"rating": 5.0, "review": "Love this, and it is sooooo easy to use.", "verified": true, "helpfulness": "0/0", "author": "Nancy Colby"}]