[{"rating": 5.0, "review": "So far so good as far as replacing cable.", "verified": true, "helpfulness": "0/0", "author": "sheyanne"}, {"rating": 5.0, "review": "Small and fast. No lags for streaming. Nice having an optical out.  Great content. Prime makes it even better.  Add \"HBO Now\" streaming in the future once they get over their marriage with Apple, this will indeed be a cable killer!  Do it!  If Apple TV lowers their price to $69, you will have your work cut out...maybe I should have waited...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to set up.  Love all the watching options that we now have vs. network offerings.  No commercials!!!!  Very good value with my Amazon Prime membership.  Nice range of selections for viewing choices.", "verified": true, "helpfulness": "0/0", "author": "Timothy Wegner"}, {"rating": 5.0, "review": "trying to learn. i need housewives of beverly hills how can i get that channel?  and of course walking dead?  where can i find fox network news?When will I get charged", "verified": true, "helpfulness": "0/1", "author": "Deborah"}, {"rating": 5.0, "review": "got it set up and running,linked to net flix in 10 minutes. the voice search works great", "verified": true, "helpfulness": "0/0", "author": "r11rider"}, {"rating": 1.0, "review": "After literally hours of trying, this product will NOT connect to my WIFI.  My computer and other devices are wireless, so I know my WIFI works.  Amazon help desk was no help at all.  Completely frustrated.", "verified": true, "helpfulness": "2/2", "author": "R. Haney \"ojailady\""}, {"rating": 5.0, "review": "GLAD I BOUGHT IT. LOVE IT", "verified": true, "helpfulness": "0/0", "author": "horace ellison"}, {"rating": 5.0, "review": "An awesome product all around.  The voice recognition does work as well as Gary Busey says.  Great content, worth staying with Prime based on this alone.  The screensaver pictures are absolutely stunning.  Beats Apple TV easily.", "verified": true, "helpfulness": "1/1", "author": "Cooper A Day"}, {"rating": 2.0, "review": "Nice device, made well and easy to use. Past that, the content is limited. Even with Prime there's not a lot of current programming. What more current charges per episode, so there are some issues to work out.", "verified": true, "helpfulness": "0/2", "author": "David Mays"}, {"rating": 5.0, "review": "Works as expected, very fast compared to the the new roku.", "verified": true, "helpfulness": "0/0", "author": "Brian Hughes"}]