[{"rating": 4.0, "review": "I decided to add this to my growing collection of electronics and it was quickly connected to my spare TV in the workout room. What's interesting is that I already have an Apple TV, so why get this? Part of the appeal was access to Amazon Prime Videos and TV.Overall, the setup is extremely easy, the user interface is quite good (but not great), and the voice search works surprisingly well.It also has all of my photos and videos saved and easily accessible, not to mention access to Hulu Plus and Netflix.I found the comparable image quality very good - ie. Netflix on Amazon Fire TV is better than Netflix from my Samsung TV, so I was quite surprised by this.I also opted for the game controller and downloaded a couple of games, but I must fully disclose I have not played them yet.If there's a downside it's that you have to install 'apps' to watch Hulu or Netflix... something that should be pre-loaded in my opinion, but this is a relatively minor point.Other than the battery life on the remote control being dismal, I have nothing to complain about. A good product that I hope will serve me well for years to come... or until I get the itch for the next great thing...", "verified": true, "helpfulness": "0/0", "author": "Chardo"}, {"rating": 5.0, "review": "Very easy to set up. I love it.", "verified": true, "helpfulness": "0/0", "author": "Alias"}, {"rating": 5.0, "review": "Awesome! Super easy to set up (HDMI chord not included). Perfect little remote - all business, no fluff.Love it!!", "verified": true, "helpfulness": "0/0", "author": "CoCo B"}, {"rating": 1.0, "review": "I'm a HUGE fan of Amazon/Amazon Prime.  My Roku 3 broke after a year and I got a refund.  I was really pumped to get the Fire TV console with the gaming controller for my kids (Minecraft especially)I'm really shocked Amazon put something this bad out on the market with Aps that don't work.#1 - Netflix doesn't work.  It's stuck on Orange is the New Black.  I'd read some reviews about it not working since the update but figured that was the exception to the rule - no way would Amazon not have that fixed by Christmas.  Nope.  Perhaps because Netflix and Amazon Priime are competitors and have nearly the same content Netflix just doesn't work - and apparently hasn't since October. Dealbreaker.#2 - Spotify ap doesn't deliver.  My kids love Spotify.  Again, perhaps because Spotify premium and Amazon are competitors, the Spotify ap (unlike the Roku) doesn't actually run music - it will just connect with an iPhone or iPad or other Android device that has Spotify on it.  The Roku Spotify app actually lets you choose and play music.  Unless my kids take my iPhone Spotify on the Fire TV is useless.  Why Amazon???#3 Voice command only works with Amazon.  One of the better features of the Fire TV was the voice search button.  Once again - it works only with Amazon Prime.  There's no reason why you couldn't search by voice on Youtube or Netfllix - they just don't want to allow that.Anyone sensing a trend here?  The Fire TV is designed to get you to buy more Amazon products.  They should give it away for free as that's the case - not charge $99.I didn't find the user interface all that user-friendly either.#4 USB port non-functional.  I was excited at first seeing that Amazon was smart enough to do what Roku has done with the Roku 3.  A functional USB port allows you to play your own content or downloaded movies.BUT again Amazon doesn't want you doing that... they want you buying THEIR content  - so while there's a USB port it simply doesn't work. WHY?  I don't know. Ask Amazon.So there's just the first few things I discovered in the first 10 minutes that basically mean I'm shipping my Fire TV back.  Good thing I waited to buy the game controller (itself way overpriced at $40).  Going to use my savings to buy an older Roku 2 XS with an ACTUAL WORKING USB port - and actual WORKING Netflix and Spotify Apps.Shame on you Amazon.  You should pay ME to use this - not the other way around.", "verified": true, "helpfulness": "7/12", "author": "JoeSixPack"}, {"rating": 5.0, "review": "Amazon could not have made this easier to use unless they sent someone to install it. And even then, all an installer would have to do is plug it in.I used the separately purchased mount that fits on the back of the television set. Plugged Fire into the wall, then into the TV. Viola!We use this on a television in our kitchen which is not conveniently located and, therefore, we cannot hook up cable - or any antenna. So, in the kitchen, all we have is Amazon Prime. And now we are eating in the kitchen (rather than the living room!).The voice operated remote works perfectly.Amazon Prime automatically - with no effort on my part - showed the photos we have uploaded to the Cloud....plays the music we've purchased through Amazon and have in the Cloud. If I could access the music I have in Prime, that would be great - and I may be able to do that...have to work on it.Best part of Fire (for me) is the ease of locating TV shows/movies we watch - much easier than when I access Prime from my other television set (which is internet ready and does not have Fire). I prefer accessing Amazon Prime offerings with Fire and may actually purchase another for my internet ready television set.ADDENDUMSo, my Firebox has been replaced twice. After 2 months or so of use I discovered that the device was not going into sleep mode. It remained on (you can tell my the light) and was hot to the touch. First, Amazon tells me that the device is broken. Free replacement. Same problem. Then Amazon says that it is a technical problem that they are aware of and that I have to put the device into sleep mode everytime I want to turn it off. It's not the end of the world, and I can do that (a few presses of the button). I suppose it annoys me because that is not how the device is advertised to work. That said, I still love the device and the interface for Amazon Prime is SO much better than the interface built into my 'smart' TV. So, Yes, I still recommend this.", "verified": true, "helpfulness": "0/0", "author": "Cranky24/7"}, {"rating": 5.0, "review": "This is the best gadget ever. So easy to hook up, only took about 5 minutes.  If you purchase the Amazon Fire TV you should opt for a membership to Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Terri L. Durr"}, {"rating": 5.0, "review": "Great device! I replaced my sons cable box and he loves the selection of movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Sorry Amazon, I am faithful customer, I am an amazon prime member, I have the amazon credit card and I really really really wanted to live and love Fire TV but it just didn't do it for me.The device looks is just great, sleek and modern and soft it's just perfect, sadly looks are a hard feature to sell when the box itself under performs. My biggest issue was the quality of the HD content or should I say the LACK OF HD quality.Needless to say I returned the device and got instead a RoKu stick which I found 100 times better.", "verified": true, "helpfulness": "2/7", "author": "Abel Mendoza"}, {"rating": 4.0, "review": "Love it! Just wish more shows/movies that really should be free are free - but overall, great!", "verified": true, "helpfulness": "0/0", "author": "LondonLuv \"L Luv\""}, {"rating": 5.0, "review": "Nice option to cable.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]