[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Lyle"}, {"rating": 5.0, "review": "Picture and sound quality are top rate. Never ending list of things to watch, over multiple programs. Very reasonably priced.", "verified": true, "helpfulness": "0/0", "author": "Kim Pesta"}, {"rating": 4.0, "review": "Speed and responsiveness of UI is great, app and media selection covers my needs too. Voice Search works extremely well - the only thing holding it back is the lack of universal search across all media plus the current inability to control via IP.", "verified": true, "helpfulness": "0/0", "author": "Martin Soanes"}, {"rating": 1.0, "review": "Not worth it, the money we have to pay for this little box doesn't have many channels not YouTube", "verified": true, "helpfulness": "1/4", "author": "Alejandro"}, {"rating": 5.0, "review": "Provides great access to additional programming.", "verified": true, "helpfulness": "0/0", "author": "Terry Todd"}, {"rating": 4.0, "review": "It's just another box like others but tailored to sell Amazon. It's fine.", "verified": true, "helpfulness": "0/0", "author": "G. M. Taylor \"Marvin Taylor, Americana Songwriter/Producer\""}, {"rating": 1.0, "review": "I am very disappointed in the Fire TV. Can't use my Vudu. I wish I had purchased Roku or another bluray", "verified": true, "helpfulness": "2/2", "author": "Lana"}, {"rating": 5.0, "review": "This is a fantastic product.  It is very easy to set up, and very simple to use.  We will neverrun out of new movies, shows, and whatever to watch.  It is truly better than other similardevices I have used.", "verified": true, "helpfulness": "0/0", "author": "S. J. Clocks"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Have enjoyed every feature. Better than advertised !! voice command works great. Volumes of movies, TV shows and Music. Very simple to install and operate. Along with Amazon Prime , it is a great addition to my at home entertainment. Amazon always delivers!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]