[{"rating": 3.0, "review": "Can this tv work in India or abroad if it does then I will defiantly buy it but if the tv down not work in India the there is no use for me buying it so please help me with your reply thank you", "verified": false, "helpfulness": "0/17", "author": "parantap sinha"}, {"rating": 4.0, "review": "Pros:-Super Speedy. Fast processor and 2gbs of ram really shine when scrolling through movies and playing games-Simple.  It's easy to pick up and use.-Voice Search (although very dissapointed it does not work with youtube,netflix,etc) only amazons content-Good library for gaming. Sev Zero is great and many good titles at lauch (96) but said to be over 1,000 by June-3rd party controllers supported (moga pro, nyko gamepad, etc) HID profilesCons:-Voice search only brings up amazon content-Only 5.5gb of storage available to user (I hope that usb port is used for expanded memory in the near future)-Great Content: Almost every major app and the big android game studios are bringing content-Cloud supportOverall I really like the Amazon Fire TV. I must admit I purchased this mostly for games. I also own an ouya and I must admit the Fire Tv already has the better library.  Let's hope people support it and amazon succeeds in making this the first successful micro console.", "verified": true, "helpfulness": "1/3", "author": "Michael D. Wright"}, {"rating": 3.0, "review": "This is a first look opinion.  I just got and set up my Amazon Fire TV yesterday.  As a streaming TV provider it is presently very weak.  It can't do anything of any consequence that Roku can't do.  I've heard rumors that HBO GO is in the works.  This is something they should work to get done as quickly as possible.  Offering SHOWTIME ANYTIME is a poor substitute.  Especially for those of us whose cable providers don't support SHOWTIME G...I mean ANYTIME.  I do like the interface.  I can also access HBO GO through my Kindle Fire HDX and mirror it on my TV, which is something.  They should also do more to separate games from tv/movie apps.  The games are ok so far, and I got the Game Controller so I have access to several games of all different types but you may need to open this up to outside developers in order to have the kind of services needed to make us forget our Roku boxes.Update 4/7/2014  No doubt about it.  Am missing much of Roku content.  Still, I'm impressed by some aspects.  Games are mostly lame.  Tried looking up a movie about artist Frank Frazetta using voice interface, and it was a no go.  After I looked it up the old fashioned way, found I could find it with voice if I put in Painting with Fire.  Frank Frazetta came back with Frank Fries Letters Frank Frozen better.  So voice will probably be limited.  I was able to locate director Jean Rollins by Americanizing his name to Gene Rawlins.  This voice input will be a challenge.", "verified": true, "helpfulness": "0/3", "author": "Phillip Stewart"}, {"rating": 5.0, "review": "This review is mainly based around Plex usage, as that was my main reason for getting this device.After the usual Amazon super-fast delivery, i was ready to unbox.  The packaging is great, and as minimal as possible.  Within a few minutes the FireTV was powered up and getting a software update.  I watched the welcome video, which was a nice touch for those newer users.  Just a note- my house is primarily iOS based, i have no android devices.  Currently i use Plex on a NAS with a WDTV.It took a minute to figure out how to install Plex, the app store is not immediately apparent, but i was able to find it and buy it for .99.  Quick install and log-in, boom!  My Plex runs on a NAS, and it had no issue pulling in all the data instantly.  And wow, is it FAST.This is what I would expect if the folks at Plex made a hardware client (how about it already Plex??), its super fast and looks awesome.  I was so tired of the WDTV and its half-baked approach, and how slow it was.  I have heard Roku & Plex is not the best.  So when I saw the FireTV supported Plex for real, I jumped to get it.I played a number of ripped DVDs from my library, and everything started instantly.  Way faster than the WDTV, and no issues with sound as others note.  I am not using the optical connection, just HDMI -> Samsung TV -> Sonos.The remote works great, no issues pairing it.  Of course everyone has one complaint-  the remote clicks are loud.  I might have gone a little crazy with the remote as i browsed the library...As others have pointed out, the voice search only works for Amazon items- a fact that many people felt misled about.  When i tested it, it did work well but i dont see myself using it much, esp for amazon purchases.Overall if you are a Plex fan, this is the ONLY client you need.  It's insane fast, and no issues with playback or box covers/art.  After you turn it on, its just 2 clicks until you are in the Plex app, and that is what its all about- simple and great usability.", "verified": true, "helpfulness": "16/17", "author": "Dan Gerson"}, {"rating": 5.0, "review": "I can't tell you if you need/want one of these streaming devices in your life but I'll say that if you're looking to spend about $100 on one, this is the one I would get. I own an Apple TV2, Apple TV3, a 2nd gen Roku, 2 3rd gen Roku's, and for some reason an Ouya. This one is the fastest. It's also a very polished, attractive interface that I happen to like and the physical box itself is very thin and sexy, but all I really care about is the speed. Even without the voice search and ASAP feature, it's simply the fastest at getting me from wanting to watch a show/movie to watching it. The speed is apparent (and welcome) in every app I've thrown at this little box. Outside of that, at least for my use, most of these boxes offer about the same overall experience. The software does also seem generally more stable as well. Granted I've only had it for a few days, but being a brand new product I have to say it seems less crash prone than the others. I will update this if this changes. Bottom line, this is an excellent performer for this type of product.", "verified": true, "helpfulness": "6/6", "author": "M. Wilson"}, {"rating": 1.0, "review": "I ordered this with high expectations..  I was suprised to find A little amount of content.  The voice search is cool but it only with amazon prime content.  So if i say \"youtube dave matthews\"  it doesn't open youtube and dave matthews.  It will give you an option to open youtube.  Apps?  What apps...  there is like 15.  My roku can rock out weather, ufc and JT.tv amongst a zillion other things.  Whats the point on having a massive engine \"internal specs\"  and no gas \"apps\"  This is an epic fail on Amazon's part.  This willl prally be good a year from now when apps are developed.  One other bonus,  you can flick media content from your Kindle to screen.  Um Who the hell owns a Kindle?,  and if you do,  have you heard of  Apple or Nexus?  Sorry for the Low grade Amazon.  I'll buy stuff all day long from you,  but this goes back..", "verified": true, "helpfulness": "10/47", "author": "Mike"}, {"rating": 2.0, "review": "Perhaps a representative from Amazon could assist me/us with an oddity.  I have a frequency counter, two of them, they are apart of my \"bench\".  I like to know what frequency what is transmitting on, nosiness, curiosity, my right, etc. whatever you which to classify it as, I like to know and that's that.What I found curious was, once obtaining the frequencies used by the Fire TV with my handheld freq. counter was, it sporadically picked up those frequencies from the remote when I was not pushing a thing.  Odd.  Is it a \"call home\", a \"wake up\" or what?  What is it transmitting, when and why?  I really don't have the patience or desire to dig further, with packet capturing, deciphering, etc. it takes time and effort of which I simply haven't any inclination, as I'd already decided the Fire TV just isn't for me.  I wanted to give it a neutral rating of three stars, though had to deduct one for this sporadic transmitting.That said.  HDMI handshaking wasn't entirely spot on when switching inputs on the A/V head unit.  Despite resetting the A/V on Direct, DTS or otherwise was not detected by my A/V (yes, I did make the Dolby settings change/enabling via HDMI in the Fire TV settings).  I also noticed a small ms (millisecond) lip-sync issue on HDMI (there is none with MY A/V with Roku, not for the test movie at any rate) though, one would have to look very hard to detect it, or simply be as anal as myself.  Optical worked for me and eliminated the arguably noticeable lip-sync issue I had on HDMI.  I wish I could assist those stating they are having issues with their Opitcal Out, I -assume- you guys ARE setting the \"Dolby\" \"via Optical\" setting? (Forget precisely what it is called sorry, as my unit is already boxed up ready for return).Menu speeds and overall speed of the unit is where this thing shines, hands down.  It surely is zippy compared to any other set-top box.  Video production is spot on as well, I noticed no issues of it keeping up, no stuttering, etc. albeit, I don't receive those on the Roku 3 I was contemplating on replacing with this.7.1 and zippiness is what the Fire TV has going for it, in a nutshell.  The fact it uses Android as well, rather than Brightscript is a plus for anyone into development of private apps, much like myself.  Side loading on the Fire TV is easy, I hadn't bothered looking into rooting, I'm sure one of the more active groups out there will have it all worked out, if it's not already by now.I wasn't a fan of the UI.  Amazon, don't populate the UI with nick knacks galore please?  If I want an app, aherm, \"service\", I'll load it.  Plex for Android/Fire TV sure does look much better than on Roku though, I'll miss that a good bit (though at the same time, I don't appreciate having to click on sub-menus selections to have channels, shared content, etc. be shown -- with Roku, I just scroll up or down and it's all right there on that one screen).This review is for Amazon's eyes, though naturally it is public.. it appears anyone reviewing and leaving less than 5 stars have droves of individuals clearly Amazon/Fire TV fans marking their reviews as not helpful.. that's cool, power to the people!  Though, my assessment is clear, concise and accurate -- and the sporadic transmissions are still concerning, only because the remote has a microphone.  Xbox One anyone?  I surely hope NOT!..", "verified": true, "helpfulness": "5/17", "author": "The Nobody"}, {"rating": 3.0, "review": "Compared to the Apple TV 1/2/3, ROKU 2 or 3 or Boxee Box in my house, this little box has to be 10 times faster than anyone of my other boxes.I have a large PLEX library and on the ROKU 3 box it takes some time to scroll through it and the FireTV is EXTREMELY fast. I was blown away how fast I could scroll through my library. I went to my ROKU 3 box after using this and was amazed at how SLOW the ROKU was compared to this.The screensaver for NetFlix works on this box compared to the ROKU 3 box. This drives me crazy that the new ROKU 3 screensaver doesnt work with Netflix. If you ask ROKU to fix it they say to contact Netflix, if you ask Netflix then they tell you that ROKU is responsible for the Netflix app - they dont care about their end users.The remote is extremely responsive.The menus on this box are very fast - it is a refreshing change from years of using the ROKU boxes.The Netflix interface DOES have the \"PROFILE\" option AND does have the kids section button.5/2014 update:I would return this if I still had the window to return it.The plex app only does 2.0 stereo and can't do HD audio.The remote is a bluetooth remote and it doesnt work with any harmony remotes so that means I have to keep 2 remotes.The screen goes blank rather than go to a screensaver if you dont use it for a long time which is very annoying.", "verified": true, "helpfulness": "27/31", "author": "J. Lawrence"}, {"rating": 5.0, "review": "It is a seamless streaming device.  All positives, no negatives! I've had chromecast, smart TVs and the PS3 and this is better tan all of them.", "verified": true, "helpfulness": "5/6", "author": "SSS \"SSS\""}, {"rating": 5.0, "review": "I have the Roku3 and AppleTV - and the FireTv is replacing an older Roku.The UI is nice - smooth transitions and fast.Voice Search is awesome - Very happy with purchase - and highly recommended.", "verified": true, "helpfulness": "3/3", "author": "JaneMancini"}]