[{"rating": 5.0, "review": "5 stars", "verified": false, "helpfulness": "0/2", "author": "Malay N."}, {"rating": 5.0, "review": "cool", "verified": true, "helpfulness": "0/2", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I ordered two of these as gifts just four days ago. They were priced at $99 then; today they cost $79. Guess I should have waited a few days (if only I had known).Anyway, the reviews I have received from the recipients have been excellent. They seem to be what they are advertised to be.", "verified": false, "helpfulness": "1/2", "author": "Len H"}, {"rating": 5.0, "review": "Great and easy to install!", "verified": true, "helpfulness": "0/1", "author": "Paula Pulju"}, {"rating": 5.0, "review": "This was the easiest set-up I have ever encountered.  It took me longer to dust behind the tv than to hook up to the HDMI on my television.  .I am an Amazon Prime member and just having the ability to watch movies on my tv rather than a computer is a plus.  Additionally, the voice recognition is amazing.  Works way better than the Sync system in my Ford.  I have already used the Pandora app to put Christmas music on as well as watch several movies.  I have downloaded a cookbook (which is a really cool thing to be able to do).  I am still in the process of finding new and interesting things thru Amazon Fire.I debated on this vs. a smart tv and since my Sony in the living room works well, I decided to go with Amazon Fire and bought it on Cyber Monday when it was on sale.  I am so pleased with my purchase.", "verified": true, "helpfulness": "1/2", "author": "B. Webster"}, {"rating": 3.0, "review": "I've been using the Fire TV for about 6 months now.  The things I like are that we have access to both amazon and netflix content.  A lot of people write off Amazon Instant Video, but if you have kids, there are a lot of different shows to choose from that Netflix doesn't have.  I also like that I can stream my local content with Plex or another app called Vimu.  I use Vimu mainly and it handles all of the files I have on my NAS quite well.  This is a feature the Apple TV is lacking and it why it deserves a failing grade.  Not to mention the fact that it's a dated system.  Lastly, the fact that you can side-load apps is awesome.As for the Negatives, for one, I can't stand the fact that every time there's an update, it resets Netflix.  So annoying to have to log in again and again and again.  Second, the interface is not very intuitive.  There are too many categories on the side and simply getting to the Apps I have installed takes way too many clicks.  I really only use the \"recent\" section so I can get to things quickly, otherwise, I never really go through anything else all that much.  Mainly because it's poorly organized and confusing.  I think Amazon needs to head back to the drawing board with their interface.  Next, the remote is terrible.  We are on our second one, after the first one died on us for no reason.  We are very careful with our devices and remotes, and so I know it was not wear and tear.  Besides, a remote should not die after a few months regardless.  The second remote we got feels cheap and no so great for some reason.  Almost like it's going to break at any moment.  I like the voice control, but that was the first thing that died on the first remote.  Lastly, there's no restart function.  Why, why, WHY?  The first gen Apple TV was this way and it irritated the hell out of me.  Same goes for the Fire TV.  Ours is located up high, above our tv.  So any time I need to restart the device (which happens quite often), I have to climb up to pull out the power cable.  Ridiculous.  I honestly don't know why these functionality decisions get made, but they were clearly not made by anyone who actually uses this device on a daily basis.  One more thing.  Please release an iPhone remote control app.  That is all.Hopefully in a few months I can come back to this review with an update on how some of this stuff has been resolved.  Hopefully.", "verified": true, "helpfulness": "1/2", "author": "nealham"}, {"rating": 3.0, "review": "its ok but i already had an xbox 1", "verified": true, "helpfulness": "0/2", "author": "jussblaz3 \"jussblaz3\""}, {"rating": 5.0, "review": "I was unsure how I was going to like this at first, but after several months of using it, I am seriously considering cutting my cable out completely. I love this.", "verified": true, "helpfulness": "1/3", "author": "Antonio Sala"}, {"rating": 1.0, "review": "WARNING: Minimum internet download speeds required. Much much much higher than 7-Mbps if you use DSL.I am having the same issue as other DSL internet users. Immediately upon startup, the Fire TV requests I download the latest software version. I have DSL that offers max speeds of 3-Mbps. It's all I can afford at $90/month bundled with telephone.  I have no problem with wi-fi streaming three of my computers simultaneously. All playing Amazon Prime videos and movies. But this box will only download halfway, as noted on the screen, then it says my download is taking too long. I should check my internet connection and try again. I've rebooted my DSL modem four times. I restarted Fire TV six times by unplugging the power per instructions. Amazon intentionally keeps you in the dark about MINIMUM download speeds. This is the only wifi smart product which is NOT friendly to my connection speeds. I was reading many other similar complaints in Amazon reviews. They are justified. I am packing mine up and it's going back. I am soooo disappointed. I really wanted to use this at work in my shop.UPDATE:  Went to neighbor down the road. His DSL is 7-Mbps. Downloaded the software. Took 10 minutes! After installing, we tried numerous Prime movies. All buffered every 5 minutes and sometimes less. It came with a warning saying it would continue to buffer. Display never reached HD. It remained on standard.Definitely going back to Amazon. They should be ashamed for not letting us know the minimum internet speed requirements.There are Comment-Trolls on this specific product who respond to reviews with lies, insults and foolish talk. Please report them. They are also registering numerous Amazon accounts, flagging comments and down voting reviews.", "verified": true, "helpfulness": "5/9", "author": "Tech Test Pilot"}, {"rating": 5.0, "review": "How did I go so long without this?  With a newer dvd player or tv of course you don't need this box anymore, but it works really well and is fast and responsive.  The remote is great, voice commands never seem to work well for me, but this works excellently and accurately, the remote scrolling is very fast and snappy.", "verified": true, "helpfulness": "1/1", "author": "Steven G \"ghunted\""}]