[{"rating": 3.0, "review": "Although the Fire TV is neat, I do have buyers regret.  There are other boxes out there that operate more like a HTPC with the same hardware as the Fire TV.  I am disappointed that I cannot load a browser and the fact that there isn't a Vudu app.", "verified": true, "helpfulness": "0/1", "author": "Trent"}, {"rating": 5.0, "review": "so glad I got this, and mad I waited this long...adding kodi is a must so google how to do it...after that you have the ultimate device to watch anything ever....usb port for playing videos from usb drive and ethernet connection for direct internet was a plus for me and which is why I got this over the fire stickthe only thing I wish was better is the voice commands, hopefully with future updates...this is not a big deal though", "verified": true, "helpfulness": "0/0", "author": "prime objective"}, {"rating": 1.0, "review": "i was incredibly disappointed with my Fire TV. I had an Apple TV for several years that met an untimely death. I decided that I would try a different streaming device and after research settled on the Fire TV. Set up was easy and fast and seemed to go over well. However within two days the remote would stop connecting. It simply would not respond no matter how many times I changed the batteries and reset the main system. On top of that, programs would randomly stop constantly. Sometimes I could get through an entire episode of a show without an issues and other times every 10 seconds it would randomly pause. After nearly three months of dealing with these issues and reading how to fix them online I got rid of my Fire TV and returned to Apple TV which has had no issues whatsoever. I would not recommend this to anyone.", "verified": true, "helpfulness": "0/1", "author": "Adam Russell"}, {"rating": 4.0, "review": "I would give it five stars, but the video delay for Bluetooth Beats fheadsets makes them unusable with it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Been using for a few months now.  Love the Amazon Fire TV. Will probably end up buying a few more for other rooms in my house.", "verified": true, "helpfulness": "0/1", "author": "Chad garn"}, {"rating": 3.0, "review": "Ugh, could not watch the debate,  not so easy to figure out how to install more things. Not as easy as I was told.", "verified": true, "helpfulness": "0/2", "author": "dwarstl"}, {"rating": 5.0, "review": "Easy to use just what I needed", "verified": true, "helpfulness": "0/1", "author": "SG H."}, {"rating": 5.0, "review": "Amazon Fire TV is Great! We truly enjoy it are glad that we purchased it!!", "verified": true, "helpfulness": "0/1", "author": "Donald N."}, {"rating": 5.0, "review": "I have both the FireStick and the Fire TV, I also have a Roku 2.  All of these products were easy to set up, pretty much plug in and play per the instructions.  I use all 3 of them, one on each of my TV sets.  They all do as they are advertised and so I basically would recommend all three. 5 Stars for Fire TV, 4 stars for the others, as I will explain.I purchased the FireStick because of it's travel size...but the truth is, for the difference in price the Fire TV unit is still small and portable enough to travel with if needed (along with an HDMI cable) and is much more powerful in it's ability to capture a weakish WiFi signal (read Comcast Arris modem/router signal), thus making it the more desirable of the 2 units.  The Roku 2 also picks up this same simpering WiFi signal better than the FireStick, which apparently has to be closer than 15 feet to the modem in order to \"connect\" effectively and consistently.  (For those of you keeping score, this is WORSE than Bluetooth!  I blame Amazon, Comcast and Motorola (Arris) equally for this.)  My Roku 2 unit also has a great feature - a headphone jack on it's remote.  That feature worked great - the first time I used it, then the volume button on the remote refused to budge from it's lowest setting, pretty much nullifying this wonderful but fleeting advantage.  I probably would've given the Roku the highest marks of all if this hadn't happened the first time I used it, but it did and when I tried to fix it myself, well, it's just one little connection right....yup.... but still this was a bad idea. I ended up having to buy a replacement remote, I suspected this would be the case which is why I attempted the \"FIX\" myself.  I could've bought the $25 OED from Roku but I was already angry that I got myself in this position so I just bought a knock off remote (here at Amazon) for $9 - it works great btw, but doesn't have that headphone jack!So the FIreStick is great if you have a strong solid Wifi signal, but the Fire TV is ultimately my fav, I love the feel of it's remote, it just feels better in my hand and more substantial than that of the Roku even though it's a smaller unit (and the additional purchase game controller is also a neat little gadget).  The only draw back is that neither Amazon product will let you download the VUDU app.  But there is a work around - just link your VUDU library to Ultraviolet and then link your Ultraviolet Library to Flixter or various other apps which Amazon will let you download.", "verified": true, "helpfulness": "0/1", "author": "Paula"}, {"rating": 5.0, "review": "Well worth the price to have all these programs at your finger tips!!!!", "verified": true, "helpfulness": "0/1", "author": "Mark P. Gundrum"}]