[{"rating": 3.0, "review": "When I review this device I compare it with my previous experiences with several versions of the Popcorn hour, WD Live, Boxee Box, Apple TV, Chromecast, Ouya and Roku devices.Easy to install, when ordered via Amazon your account is already setup.Be aware to select gift when ordering or delete your account from the device before giving the device to someone else. Just plug in your cable or config the WiFi.Video quality is good on 65 inch TV. Very smooth experience and there are more apps available than on the Roku when it was first introduced, however popular channels like HBO, VUDO and Crunchyroll are missing.It has only one feature that other devices don't have and that is the voice recognition in the remote, but that gimmick is very sensitive on accents (I am not a native speaker) and only works for Amazon's own content.Gaming severely lacks:- Many games require you to buy the Amazon Fire Game Controller, $40 not even rumble or motion.- Graphical Intensive games stutter, maybe pause background tasks?- Controller introduces latency, it takes 200ms before a button-press leads to an action, this is very obvious in pinball.It is a very closed environment like Apple TV, certainly not as open as the Popcorn hour, Ouya or Boxee:- No access to own content, there is a USB connector, but connecting a USB stick with photo's and movies does not do anything.- No access to the local network, no DLNA or SMB to play own content. You can buy Plex but that has other limitations.- It only mirrors video from Kindle Fire tablets, not from other Android or Apple devices.- Not able to load apps other than available in the Amazon store.Pros:+ More responsive than Roku 3+ Better hardware, a lot of potential+ Better picture quality in Amazon store than other stores+ Nice small and clean boxCons:- Relative expensive, there are cheaper devices like Roku with more channels and similar video quality.- Pushing $100 prime membership, not able to see what is free, locks you in Amazon infrastructure.- The positioning of the buttons on the remote are a bit awkward, it is not possible to reach all buttons with your thumb while holding it. In the dark it is not clear where you have to push, no ridges or dots in buttons.- No headphone jack in remote (a very useful feature on same priced Roku 3, Amazon could improve on that by making the remote rechargeable and the player a docking station)- Not a device issue, but while testing I installed many free apps, every install resulted to an Order Confirmation of $0.00 in my maibox, there is no way to disable that, Amazon, please fix that!- Too many issues to be a gaming device, stuttering, lag and limited controllers.- Closed environment, similar to Apple TV.Overall:Nice TV experience, very responsive, small box. Too expensive for the number of features, this can be fixed by lowering the price or adding more channels and features like access to own content.If the controller lag cannot be resolved it will never be a real contender as gaming device. The same games perform better on the much slower but further very similar Ouya device.If you just want to watch online TV and don't use the Amazon store, buy any Roku device, they are a little-bit less responsive but it offers a lot more content for free. It is even possible to add your own content.If you want to play games, buy a game console, I don't expect that Amazon can fix the lag or opens up the USB to wired or alternative controllers.", "verified": true, "helpfulness": "5/7", "author": "MrGadget"}, {"rating": 4.0, "review": "Fast, slick UI. Accurate voice control. Good initial selection of apps and games, but more choices needed. The biggest issue is the 8GB storage, with really only just under 6GB usable. My FireTV is already full :(. Amazon, please update box to allow expansion of storage via a USB stick. This is a must! I want to buy more apps, but don't have space to.Pleasantly surprised that XBMC (the OUYA fork SPMC version) runs fairly well on this box. Anyway, FireTV has a lot of promise. And, it has already replaced my Roku 3 and our family room media streamer of choice.", "verified": true, "helpfulness": "2/2", "author": "HDM_fan \"Hi-Def Nut\""}, {"rating": 3.0, "review": "The Good1. Size - very nice, compact2. Picture/Sound - HDMI out, so picture and sound are as good as the TV you connect it to3. Price - $100 is a great deal for the \"feature set\" the FireTV has compared to the others in this nicheThe Bad1. The product documentation DOES NOT TELL YOU what services are supported by what Cable/Broadband/Dish providers you might have. Example: The SHOWTIME app does not include COMCAST customers, even though they might be SHO subscribers. Therefore, if you buy this thinking you can watch your favorite SHO programs, check with your provider to see if they are among the few that work with the FireTV2. As others have mentioned - WE ARE PRIME MEMBERS - don't put us in a corner with Baby. Put our option Front and Center, because we're already paying you for the privilege of that status.3. Menu layouts could be better", "verified": true, "helpfulness": "0/1", "author": "Magilla Gorilla"}, {"rating": 4.0, "review": "Needs some work.  Setup is cumbersome, not very intuitive, and lacking detailed instructions.  Amazon seems to assume that the purchaser is familiar with technical details of apps, connections, setup protocols, etc.  As expected, Amazon gives preference to their own products/services thus making 'free' services less prominent.  Search for movies, programs, et al, is primitive and slow.  The remote is excellent.  The screen picture is an improvement over my cable reception.  Response time on screen is fairly quick.  The interface where search takes place is the major drawback.  I am going to assume that Amazon will do their thing and improve everything over time, including program selections and access.  All in all, I'm glad I bought this and await the improvements sure to come.", "verified": true, "helpfulness": "1/1", "author": "Roger"}, {"rating": 5.0, "review": "We \"quit\" cable subscription more than 3 years ago. Since that time, our PS3 has dutifully served as our game console, BluRay player and Netflix/Amazon Video streaming source. It works wonderfully, but my son was concerned that we would wear out his beloved PS3.Therefore, we began researching our options in Roku, Sony, Apple, Vizio and other television streaming dealios. For Xmas our kids received a $100 gift card to Best Buy and we picked up one of the streaming boxes on sale for $120 - I believe it was made by Sony (it was definitely a brand of electronics we have owned and loved). It was a disaster - we are used to streaming and use our wireless for many devices throughout the house but we could NOT get it to work. We returned it to the store and continued looking at other options.As soon as I read the description of the Amazon device, I was excited, knowing that my Kindle Fire had been the EASIEST device EVER to set up and use. And the Amazon Fire TV was JUST AS EASY! I love it, the picture is AMAZING and I have just begun to explore the ways that the Kindle Fire can communicate and share apps, etc. with the Amazon Fire TV. Also LOVE the voice commands - much MUCH easier to find movies and TV series on Netflix and Amazon Video.If you have an Amazon Prime account and/or a Kindle Fire, this is a wonderful way to stream, play games, etc. Highly Recommend so far!", "verified": true, "helpfulness": "0/0", "author": "MontessoriMama"}, {"rating": 5.0, "review": "This is a wonderful thing.It is very fast .TV picture is extremely clear and at only $99.00 they make excellent gifts .If you buy amazon prime,then you will be fully stocked with free movies and not pay shipping charges", "verified": true, "helpfulness": "0/0", "author": "Xiaoyi Gan-Schwarz"}, {"rating": 5.0, "review": "Easy setup: I had it running in 10 mins or so.The UI is easy to use, no \"learning\" or figuring it out required.Voice recognition is so-so, but these things never work for me anyway.  And I don't really know what I'm looking for, so I like to browse", "verified": true, "helpfulness": "1/1", "author": "J. Goldstein \"JudiG\""}, {"rating": 4.0, "review": "I love it except for the fact that Amazon Prime members have to select the \"other viewing options\" to watch the movies, etc. that are free with our Prime membership.  It should be one of the choices on the opening screen.Love the speed of this thing--no wait at all for loading.  Voice recognition works great!  It's easy to set up the Amazon Fire TV.", "verified": true, "helpfulness": "2/2", "author": "Cheryl Liniger"}, {"rating": 5.0, "review": "I think it is a great product. Voice search is incredibly accurate. Best feature. Very responsive. Buying controller today. Those quad core processors really are fast.", "verified": true, "helpfulness": "1/1", "author": "Knight"}, {"rating": 4.0, "review": "I own a 3 year old Sharp 60\" Aquos Quattron 3D which has a few built in apps including Netflix and Hulu+ movie services. I am a Netflix and Comcast customer. Also have a Vudu on demand subscription which I infrequently use. I watch a lot of movies so my preference is a monthly flat fee services verses pay per view.As a Prime member I wanted Amazon TV access and was waiting for this device. I have had it since it's recent introduction and so far am pleased. It's well packaged, feels and looks  like quality. The Smart TV unit is very small and easy to setup. The instructions included are minimal but adequate. If you need more detail you can go to the Amazon site and read or download an extensive owners manual. I did need to refer to my TV manual to understand how to change HDMI connections so I could change from my regular TV view to Amazon Fire TV. On my TV it's simply a button on the TV remote.The Amazon Fire TV remote is great. It's small and only has a few buttons but they control all the functions except volume which you control with your TV remote. The remote is also very easy to use and the Home page is attractive and easy to maneuver. The voice search feature on the remote has proven so far to be excellent and it's a great feature. It will search by movie name, actor name or genre. So far it's never missed. It does bring up Prime and pay per view but you can identify Prime by the banner in the left corner of the movie displayed.I also purchased the HDMI cable offered with it for a modest price and glad I did. It's six  feet long and good quality. I am not a gamer so did not purchase the game console.Currently I already have Netflix and am not interested in Hulu+  so there are not many other Fire TV apps of interest. However my expectation is Amazon will be adding much more content. I was surprised that it currently does not include the Amazon Music Service. For me it's not important because I don't use my TV for music. However it would be a nice to have.At this point I am pleased with the device and look forward to Amazon adding more content. I will update my review if needed once I have more experience with the device. I have no experience with the other similar products available so cannot make a comparison.", "verified": true, "helpfulness": "1/1", "author": "G. Martin"}]