[{"rating": 5.0, "review": "Amazon Fire TV is just great, especially with a prime subscription.  The human interface is easy to use and the voice search is a real plus.  Playing games, viewing photos, listening to music, watching You Tube, watching movies, or  watching TV shows makes the Amazon Fire TV the center of our home entertainment.  I now have two.", "verified": true, "helpfulness": "0/0", "author": "Steven M. Silverstein"}, {"rating": 5.0, "review": "It is great! Easy to hook up and get started.", "verified": true, "helpfulness": "0/0", "author": "Daniel L Hansen"}, {"rating": 3.0, "review": "Audio is a hit N miss, returning to settings reestablishes the connection, this gets old quick !!!", "verified": true, "helpfulness": "0/0", "author": "Arnold D."}, {"rating": 1.0, "review": "I purchased this product wanting and hoping to love it; unfortunately that is not the case.Quick summary of the Pros and Cons:Pros: Voice Search is Flawless  Sleek, quality feel and designCons: Freezes during playback  Does not always respond to remote  Only 5.49 of 8gb available to user  The \"good\" games take up nearly a 1gb, or more, each.  Memory cannot be expanded  Trouble maintaining Wifi connection My Fire TV arrived quickly in awesome Amazon packaging and was easy to set up - very intuitive. I watched the welcome video and decided to rewatch it; that is when my trouble began - the playback just froze up. I called customer service and they had me unplug the device and reboot my router and then they did something remotely and the device seemed to play ok, for awhile. Then I noticed my menu did not look like the menu shown online at Amazon -options were missing. I called customer service and first the woman told me that I should not have an option to select Prime Video. I was adamant and she once again had me unplug the device to power it off and then plug it back in. (This seems to be the first thing they tell you, along with reboot you router. I have to say, because of this device, that I have rebooted my router more in the past week then I have in the previous year!) After going round and round with this woman I asked to speak with a supervisor who seemed to have trouble understanding me. I patiently explained my menu was missing several options that were supposed to be there and was told repeatedly all was well. I finally went on to an Amazon website page, told this supervisor the page, and read the menu options that I was supposed to be seeing to him and pointed out which ones were missing. At this point he told me my new device was old and needed to be updated! Mind you, this was after more than 40 minutes of going round and round with him and the previous woman. Once I had the most recent update I decided to stream some video and it froze again, I power cycled device (note to Amazon engineers, this device needs an on/off switch). Remote stopped working - I power cycled device. Then I easily added the game controller and noticed an update for the regular remote and manually downloaded it (Amazon,why don't these download automatically?) Downloaded a couple of games and noticed that they use a huge amount of the available memory; decided that this isn't the gaming device its touted to be - its advertised as having 8gb but only 5.49 gb are available to the user! Two games used over 2 gb of the available, unexpandable, memory so I decided to return the game controller and found I will have to pay for the return shipping. I unpaired it and uninstalled the games. Then I checked the memory and discovered I only had 3.8 gb of 5.49gb available, this with just 10 apps installed. Once again I called customer service. The rep had me manually clear the cache of apps and check some things, but the bottom line is about 2 gb of RAM use is unaccounted for,that is over 1/3 of the RAM available to me! He escalated it to the Amazon engineers 2 nights ago. Since then I have gotten 2 emails from Amazon customer service asking if I they solved the problem! Anyway, while I am waiting for Amazon to get back to me,I saw the Roku 3 was on sale purchased it and hooked it up. As I type this the Roku is streaming the news perfectly, not freezing, no dropping the Wifi. The Fire TV is going back -it seems like a beta device at this time. Maybe in a year or two I will give it another try.", "verified": true, "helpfulness": "4/5", "author": "reb8 \"reb8\""}, {"rating": 5.0, "review": "I love this product it works great. My internet does not, making it difficult to use. Cannot blame the product for lousy internet.", "verified": true, "helpfulness": "1/1", "author": "Marrina Blanthorn"}, {"rating": 5.0, "review": "Great I love it easy to use easy to understand simply great", "verified": true, "helpfulness": "0/0", "author": "ben"}, {"rating": 5.0, "review": "I bought this to deliver Netflix to my eyes, little did I know it that it would also deliver Netflix to my soul.  An excellent purchase despite the significant drop of my productivity.", "verified": true, "helpfulness": "0/0", "author": "Theodore Quaid"}, {"rating": 5.0, "review": "This little box is just amazing!  We love it!!  It arrived in the mail ready to go. All we did was plug it into the wall and into the TV and it did all the rest. SO easy!  Thinking about purchasing a second one to use on another TV.  Can't ask for anything more!UPDATE:  Ordered and just received our SECOND Fire TV unit and it's up and running.  We are seriously considering canceling our satellite dish service because we watch more on Fire TV than on satellite and a lot of the shows we do watch are on Fire TV anyway.  If Fire TV offered our local channels, it would certainly be ADIOS satellite!!", "verified": true, "helpfulness": "0/0", "author": "L. J. Schroer"}, {"rating": 3.0, "review": "It looks nice, it is fast and it organizes categories nicely. Outside of that I am not impressed with this. The voice gizmo is nice but it doesn't bring up Netflix movies at all. The help section is useless and I had to make a call to get Netflix to download. They had to update my system to get Netflix on it. Update it? It's brand new! Oh well that happens from time to time. But, what I really dislike about this is that the voice system only brings up Amazon items and this system drains my batteries like mad. I watched television for two days and I had to change the batteries three times. I have good batteries too. So, when I watch now I take the batteries out of the remote. What is the point of having a remote if I have to keep pulling the batteries out all the time while watching a show? I have had a ROKU 3 for a while and haven't had to change the batteries yet. I am going to get a new one but will wait for ROKU to get a voice activated one as I know they will do a search for movies for all sites. I like Amazon but they failed in the voice system and the battery department.", "verified": true, "helpfulness": "0/0", "author": "NYC Guy \"NY Baseball\""}, {"rating": 5.0, "review": "Has exceeded my expectations with its ease of use and volume of TV shows and movies available.", "verified": true, "helpfulness": "0/0", "author": "John Nosek"}]