[{"rating": 5.0, "review": "EXCELLENT !!!", "verified": true, "helpfulness": "0/0", "author": "carlos ariza"}, {"rating": 3.0, "review": "Needs ability to play from external drive. Roku does it.", "verified": true, "helpfulness": "0/1", "author": "TweakHound"}, {"rating": 3.0, "review": "Most of the shows avaialbe require a purchase, so it's not at all like Chromecast. Very disappointed - glad it was a gift and I did not have to shell out the cost of the device. We hardly ever use it!", "verified": true, "helpfulness": "0/1", "author": "N Nader"}, {"rating": 5.0, "review": "Great picture!  Easy to install!", "verified": true, "helpfulness": "0/0", "author": "Zeke's grandma"}, {"rating": 5.0, "review": "Simply love my Amazon Fire TV.  I love the fact that the video is sooooo....instant - no waiting for loading...loading..loading for my video subscriptions on HULU Plus and Netflix.  So nice to just use the voice command for the movie title, actor, etc. and Amazon Fire TV pops right up to show me where it is located.  Great purchase - lot of bang for the buck!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 5.0, "review": "Great little gizmo - we love it", "verified": true, "helpfulness": "0/0", "author": "Victoria J"}, {"rating": 5.0, "review": "Much better than streaming with my smart bluray player or my wii U.  I am very pleased with this device.", "verified": true, "helpfulness": "0/0", "author": "Scott Brannon"}, {"rating": 1.0, "review": "I got this item and in about a week a product was released that what a  plug in to the tv.  The new style was $50 less a fraction of the size, and the cord I had to buy separately was not needed.  So I feel Ripped off of about $55.00", "verified": true, "helpfulness": "1/9", "author": "Brad Smith"}, {"rating": 3.0, "review": "At this time I am interested in this appliance, but more specifically in trying to have access to ESPN3.  I would be able to access, but only if I have an approved cable provider (not available in my area), or a Dish network user.  Because I have Direct TV, no go.  It's great that this Fire can access ESPN3, but I would purchase it in a flash should Amazon acquire access for its Prime Members through this device.", "verified": false, "helpfulness": "0/1", "author": "John L."}, {"rating": 5.0, "review": "It performed exactly as was advertised. A rare thing.", "verified": true, "helpfulness": "0/0", "author": "Robert Barko"}]