[{"rating": 5.0, "review": "SIMPLY AWESOME DEVICE ! FOR  A REAL MOVIE BUFF LIKE ME AND NOSTAGLIA FAN THIS THE BOMB !", "verified": true, "helpfulness": "0/0", "author": "LINDA"}, {"rating": 5.0, "review": "works well, easy set up love this item!", "verified": true, "helpfulness": "0/0", "author": "Lorraine"}, {"rating": 5.0, "review": "Nice Product. Works great", "verified": true, "helpfulness": "0/0", "author": "Mark Johnson"}, {"rating": 1.0, "review": "The one reason I got this one is for Prime videos/movies, because Amazon deliberately made a Prime app pretty hard to install on an Android device and it is not available through Google Play store.  I was disappointed at poorer picture quality compare to Netflix, even some HD movies.  Choices are way limited than Netflix.The other reason I bought this is to stream online music.  However, I cannot find Fire Tv Apps for the websites I use, only those requiring subscription.  It also has a problem that you have to leave TV on, and listen to music from TV, seriously?!  I feed digital signal to DAC and amplifier, but it shuts itself off when TV is turned off.  That's a design defect or negligence, whatever you call it. And it even does not do a good job playing Prime music, no shuffle function.", "verified": true, "helpfulness": "1/3", "author": "Dr Square"}, {"rating": 4.0, "review": "Amazon Fire TV was a great purchase for it's price. It has a great processor and a great vga for apps. The voice search works really well, even with the strange names of apps, although it's primary use is to search for content. I'm not an avid streamer of content, but that works smoothly.Anyways, some notable things:- First, the storage is great for small apps and games, and for streaming and using their cloud services. However, when you're planning to download games like San Andreas that's about 3GB in size, they will run very very well but will consume a lot of that small storage space of 8GB. Now with no initial USB storage support this can be frustrating.- Second the top face of the Fire TV gets extremely hot, so don't have kids go around placing their hands on it.- Third, I have also purchased their game controller. It's a decent controller but because I have purchased it I no longer really use the included remote. The game controller is not a lithium battery, so you cannot recharge it conveniently via the USB port located on your Fire TV, you must purchase rechargeable batteries for it. Then remove them to charge the batteries. Mind you, this game controller features no voice search function, which was done very nicely and should have been included.- Fourth, the parental control options are excellent. I can assign a pin code and block transactions to my card, so when a little one accidentally hits something that requires payment, there are more steps to actually make a charge. I really boast their control options for that.- Fifth, Fire TV comes with a screensaver which protects your TV screen. I like that! However, there is no option to really turn your Fire TV off, just a 'sleep' option that really is a hassle to enable. For example in their visual layout you have to go all the way down to settings and then go right until you hit system, and then finally you can hit the sleep option. Wish there was something to enable this right away, like I don't know, a 'power' button.Overall, I'm pleased with the product. It performs very well reading and drawing the visuals. The appstore for it is lacking in the amount of apps compatible, but that's to be expected until more developers code for it. I have yet to encounter any 'stuttering' or visual lag on the apps I have played. The game controller buttons function very well, the layout is familiar as well. Loved the voice searching, and with the Vevo app you can use it to search music as well. The only loss of a star, in my opinion is due to the lack of USB storage support and convenience of a power button.", "verified": true, "helpfulness": "0/0", "author": "James Dawson IV"}, {"rating": 3.0, "review": "Games are marginal at best. There are tons of terrible ones and a handful worth having. I bought the controllers which are nice. It's ok for my kids to play since they're all under 12 and the games are inexpensive. TV and Movies are good I guess but some of the prices are way too high. Would someone really buy 1 episode of a tv show for $3? That seems absurd. You need Prime to get any kind of value. All in all it's ok, certainly cheaper than cable when used with restraint.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "Easy setup.  Nice little remote and interface.", "verified": true, "helpfulness": "0/0", "author": "Sheila Zeilmann"}, {"rating": 4.0, "review": "No issues.  Very fast response time.  Voice search is so helpful.  Would rate 5 stars if voice search worked for all apps. It only works for Amazon prime. That's my only complaint.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Its great.  thank you.", "verified": true, "helpfulness": "0/0", "author": "Valerie Degidio"}, {"rating": 5.0, "review": "Love it so easy to use", "verified": true, "helpfulness": "0/0", "author": "DIANA KASKIW/PEKARSKY"}]