[{"rating": 1.0, "review": "We don't see the advantage of fire t.v. .... It isn't much different than running the Wii, Xbox, or ps4 through the t.v. or renting a movie via redbox... Or watching series through Netflix ....fire doesn't offer current seasons of shows however cable does ...I don't recommend it", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have only had it for a few days; however, besides some problems setting it up, it does everything I wanted.  I can stream Netflix, Amazon Prime movies, and music.  I would have given it 5 stars if setup hadn't been such a nightmare.  The unit could not find my wifi.  I tried many things - called Time Warner (my ISP) and still couldn't get it to work.  Finally Time Warner gave me Amazon's phone number and he had me directly connect the box to the cable  with an Ethernet and let the unit download all the software updates.  This took quite a while.  After that - it picked up my wireless no problem and I really enjoyed it once my blood pressure returned to normal.", "verified": true, "helpfulness": "0/0", "author": "Elise M. Borovicka"}, {"rating": 5.0, "review": "I love my Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Karen G"}, {"rating": 5.0, "review": "Got one for the kids as our TV already has built in WiFi and apps. Really wish I had one for myself as well now. Kids love it and the voice search is quite convenient and awesome!", "verified": true, "helpfulness": "0/0", "author": "Gavin Papworth"}, {"rating": 5.0, "review": "Love the microphone to search", "verified": true, "helpfulness": "0/0", "author": "Isidora R Johnson"}, {"rating": 4.0, "review": "Got this to replace my Roku. Would've liked a few more Apps (Fox Now, Google play, ...), but the picture is great. I just have to keep both boxes hooked up instead of just using one.", "verified": true, "helpfulness": "0/0", "author": "Mooshi Sinned"}, {"rating": 5.0, "review": "Great product with lots of options.  This is going to allow me to stop paying $40 a month for cable movie channels with limited options.", "verified": true, "helpfulness": "0/0", "author": "Douglas P."}, {"rating": 5.0, "review": "easy set up , works great. no problems with finding movies with the voice activated .", "verified": true, "helpfulness": "0/0", "author": "Jack F. Schollard Jr."}, {"rating": 5.0, "review": "We are very glad we bought the Fire TV. In fact I am planning on canceling TV and just keeping internet.", "verified": true, "helpfulness": "0/0", "author": "william balderson"}, {"rating": 5.0, "review": "I could finally move my XBOX out of the TV room. I only used the xbox to stream or watch a DVD since the TV room was too small to play kinetic games. I hated controlling Tv with a game controller. Now I have the Xbox in the exercise room with the space I need. I had to move a DVD player to the TV room. I wish the Fire was both streaming and DVD player but I had a DVD player anyway. Since I stream Amazon Prime and UTUBE only this works for me. I like that I could stream Netflix or hulu too if I wanted. The Fire's size is great. I hope it doesn't have to upgrade as often or takes so long to do so as the XBOX. I am happy with the Fire so far.", "verified": true, "helpfulness": "0/0", "author": "S. Rose"}]