[{"rating": 1.0, "review": "I thought by now in 2014 that there would be content in native 4K Ultra High Def but I guess we still have to wait and deal with old obsolete HD.Wake up Amazon, this is 2014. We want native 4K not old tired unclear HD.Back to my Sony magic box!", "verified": false, "helpfulness": "17/238", "author": "T. Kazalski \"Rock Expert\""}, {"rating": 4.0, "review": "Is there a web browser included or associated with this? The features and quad-core are appealing, but I'd like to connect, even if it's a small one like Opera.", "verified": false, "helpfulness": "5/32", "author": "Daniel Hunt \"D319\""}, {"rating": 2.0, "review": "I was considering this and going to get rid of cable. After reading several reviews I agree that with apps not available at this time and the cost of the gaming controller, this is not something I will buy. If after a year or two, Amazon decides to reduce the cost of the controller or offer it free with the device and more apps are available I may look into it.", "verified": false, "helpfulness": "12/65", "author": "Sandi R."}, {"rating": 3.0, "review": "I just got mine and, so far, there's a lot to like.Setup out of the box is very simple. The plug could stand to be a bit smaller, but it isn't that bad, considering.The remote feels really nice in your hand. The wifi network I'm using has a complicated password and the on-screen keyboard is actually very well done. It leverages some of the media control and android navigation buttons for things like backspace, uppercase, etc.The voice search isn't anything special. I tried a number of different things and it works relatively well, but it's not mind blowing or anything like that. Very much on par with Google and Siri.It comes pre-configured with your Amazon account, so you don't even have to set that up. It automatically lets you take advantage of your Prime account, storage and other features. Video quality was what you would expect for streaming (though the Vevo app has really poor quality compared to the others... very likely an issue with Vevo).The reason I'm giving it three stars instead of 4 or even 5 is because of the incredibly limited app selection. There is no way to load existing Android apps onto this device. So don't expect to install the DramaFever app, or Facebook, or random games you already own.I really hope they open up the app selection soon, because most of what is on there isn't what I want to use at the moment.", "verified": true, "helpfulness": "34/50", "author": "Sam W."}, {"rating": 5.0, "review": "The majority of the down voting of this system are not actually owners of the device.  I just set mine up and couldn't be happier, it supports a large variety of streaming apps with more content coming.  The quality and instantaneous streaming with this device is second to none.  I own a Roku 2 and there's no comparison with frequent buffering issues on my Roku, everything is instantaneous on this device.  The wireless coverage seems better in my home theater room as well than other devices I have used.  The voice control with the controller is more helpful than you would think, not having to type each character in manually will save a lot of time and frustration and from my brief use it seems completely accurate with actor names, titles, etc.Video Streaming was of good quality and began instantly without any delay due to buffering - this was utilizing the Amazon Instant Video Application, Netflix and Crackle Applications.  I couldn't be happier with the fact that I don't need to pause video for it to buffer to the unit prior to playing (I've seen this on 1080p content on my apple tv through both the apple store and Netflix).That being said I also briefly tried Asphalt 8, Sev Zero, and a handfull of other games on my lunch.  The unit handles everything thrown at it and games like Asphalt aren't all that far off from console arcade style racers.  I couldn't be happier with my device just anxious for the coins to be credited to my account as they still haven't hit and I want to purchase more content using my store credit.Would I like more applications for the unit for things like HBO Go, MLB TV, etc.?  Sure, and with time I am pretty confident we will get these.  But to slam a system on launch day because it doesn't offer every single streaming service on the market seems silly. Amazon does support a wide range of applications and are trying some unique things nobody else has done yet.  Given some time I have a feeling this unit is going to be a huge success.", "verified": true, "helpfulness": "30/38", "author": "Mike"}, {"rating": 5.0, "review": "Most of reviewers have not bought the amazon fireTv yet. Don't knock it until you try it. Like with all new devices its not going to have all the features that everybody wants. The fireTv has video content,you can play games, and it has a built in speaker in the remote control so you can say what movies you want instead of typing and it has an quad core processor. The apple tv , chromecast and roku3 doesn't have a quad core processor.", "verified": true, "helpfulness": "13/27", "author": "NinjaJazzyJ \"JJones\""}, {"rating": 5.0, "review": "This thing is amazing. Incredibly fast, love the voice search. Search is one of the most annoying aspects of other STBs. Excited to see all the games content offered and enough cpu to handle graphic-heavy games. Only way to improve this is more apps!", "verified": true, "helpfulness": "10/19", "author": "Samazon"}, {"rating": 2.0, "review": "The idea is great but it needs HBO GO,$99 is way to high as is $99 for Prime.Add more like HBO GO,drop the price and make a lower priced version of Prime(maybe a version that doesn't include the shipping?)The competition simply offers more and is a better value.Will keep my eye on it but as of now its a pass.", "verified": false, "helpfulness": "13/71", "author": "ReSultZ"}, {"rating": 3.0, "review": "There are two things that this box needs to do to replace my Roku 3:1. Unified Search across all the providers.  When I put in Iron Man 3 in my Roku 3 search, it shows me all the providers - Netflix, Amazon, etc where Iron Man 3 is available.  Sometimes, it shows \"free with subscription\" for Netflix so I don't have to pay for it.2. A head phone jack on the remote for my earbuds that turns my earbuds into a wireless headset so I can watch TV at night without waking the kids.  I love this about my Roku 3.", "verified": false, "helpfulness": "14/41", "author": "Brad Sturgis"}, {"rating": 1.0, "review": "Why, in 2014, are we actually making devices with less features than 5 years ago?  My Boxee could play my downloaded files but not this.... Kind of a huge oversight.  I won't be getting one of these until it can stream my existing video collection.", "verified": false, "helpfulness": "50/285", "author": "BMC"}]