[{"rating": 5.0, "review": "I have an Apple TV too.  I think the Fire TV compares very favorably.  I am sure it will get better as Amazon's recommendation engine kicks in.  When you pair it with Amazon Prime its like having a giant library to watch.  I especially like the ASAP function.  Shows and movies really do start instantly.", "verified": true, "helpfulness": "1/1", "author": "Jason L. Tinurelli \"jtinurel\""}, {"rating": 5.0, "review": "please add a light function on there .  i like to watch tv in the dark  at least make the functions light up  thanks", "verified": true, "helpfulness": "1/3", "author": "ANNIE"}, {"rating": 4.0, "review": "As a Prime member I have been looking for a way to watch the videos on my TV. I'm really glad Amazon produced this little gadget. I have Roku, Chromecast, AppleTV and now the Fire TV and this is by far my favorite.The way it presents alternate programming (Netflix) is a bit strange and I sometimes have to uninstall the Netflix App and reinstall it but I'm sure Amazon will address this quirk.All in all I'm enjoying it.", "verified": true, "helpfulness": "1/1", "author": "David Bruce"}, {"rating": 5.0, "review": "It works great and has plenty of Aps that are free. Its the next great step to get rid of cable.", "verified": true, "helpfulness": "1/1", "author": "Bernard J. Wise \"Bernie\""}, {"rating": 5.0, "review": "Wow another great addition to the Amazon label. Easy to install and works as promised. Could use a little more info in the manual about the remote. Had to search on line to find out how to turn it off. You can't! It shuts off by itself.", "verified": true, "helpfulness": "1/1", "author": "Michael H. Mitchem \"Mike\""}, {"rating": 5.0, "review": "Easy to set up and easy to use.  Good selection of apps, to which, hopefully, many more will be added.", "verified": true, "helpfulness": "1/1", "author": "NoMoreAmazon"}, {"rating": 3.0, "review": "it's advertised that you get a lot more TV stations and movies for free then you actually do basically you're paying $100 so you can watch Netflix and Hulu and pay for movies that you guys provide and that's pretty much it very disappointed if I could take it back I would", "verified": true, "helpfulness": "1/10", "author": "Tim Frost"}, {"rating": 2.0, "review": "Still prefer my Apple TV.  Needs a very strong wifi signal to work, otherwise it keeps showing the hour glass symbol.", "verified": true, "helpfulness": "6/10", "author": "DEEPAK DARYANANI"}, {"rating": 4.0, "review": "There is great potential here.  I tend to buy every new TV gadget, amazon integration is amazing.. Netflix and Hulu are OK, Plex and other android aps --- look like android apps.If you are an Amazon Prime fanatic this is for you.  I hope to see better integration with netflix, hulu, and hopefully Plex.", "verified": true, "helpfulness": "0/2", "author": "JKenney"}, {"rating": 3.0, "review": "who has (for a lack of a better description) bent over backwards to help us in various situations and ALWAYS been truly more than fair to resolve concerns, we are a bit dissatisfied with the Fire TV since we have come to expect the absolute best from Amazon.  Setup was super easy and fast, then the problems popped up.  First, our service provider is Metrocast in Southern Maryland, not necessarily the most up-to-date. Two days after set-up, our wi-fi laptops and printer received no signals. Numerous calls to tech support at Metrocast with resets, etc. got us going, albeit for only minutes or a couple of hours.  Until this morning, after another frustrating hour of resets, etc.  the Aha light came on and I disconnected the Fire TV and all is well. In order to use the Fire TV, we had disconnected the newish Roku 3 and the Chromecast. The Fire TV intrigued us with its voice search, what a wonderful idea from punching in each letter of a title. I also forgot to mention, that when Fire TV and the rest was working, Netflix didn't and appeared as a grey screen (despite working when first out of the box).....So, if tech support reads this, please try to address these issues without cookie-cutter replies. We are using a Motorola SB 6580 (router built in).  Thank you.", "verified": true, "helpfulness": "2/4", "author": "AnnaInMD"}]