[{"rating": 5.0, "review": "Upgraded from an Apple tv and like it much better", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Great, works great. I had no trouble with set up.  The only wish I have is to be able to use the kindle firer to send movies etc ... To the big tv. We have a kindle fire HDX  too but that is not the one I use", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Hi, I'm an American in South Korea. Will Amazon Fire TV work over here?", "verified": false, "helpfulness": "0/4", "author": "William Davis"}, {"rating": 5.0, "review": "Love it. Streams much faster than my smart t.v.'s", "verified": true, "helpfulness": "0/2", "author": "djod41"}, {"rating": 4.0, "review": "All I say is I do not miss cable!", "verified": true, "helpfulness": "0/2", "author": "Michelle Ramirez"}, {"rating": 5.0, "review": "Works very fast and is easy to use. Seems to get better everyday and the voice search is really nice for Amazons site.", "verified": true, "helpfulness": "0/0", "author": "Jimdorn1"}, {"rating": 5.0, "review": "I love the Amazon Fire TV.  I can watch Amazon Prime and Netflix on my big screen and have closed captioning as well.  I bought the holder and have it hanging on the back of my TV.  The only problem I had was that initially Netflix wouldn't start.  I contacted Amazon and they told me how to check and make sure that the newest version of the Fire TV software was installed.  I installed the newest version and Netflix worked perfectly.  I recommend this product.", "verified": true, "helpfulness": "0/0", "author": "SusanK \"SusanK\""}, {"rating": 5.0, "review": "I'm still learning everything that Fire TV can do - so far I am loving it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/1", "author": "Howard R. Albert"}, {"rating": 5.0, "review": "It works great and has a great picture.", "verified": true, "helpfulness": "0/0", "author": "E. STANLEY BUFFMAX"}]