[{"rating": 5.0, "review": "What a great product easy to use and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Peter Gleason"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Glenna Sell"}, {"rating": 5.0, "review": "Love it. I have a smart TV with the Amazon app but the video and sound quality are far superior on my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "BK987654"}, {"rating": 1.0, "review": "No Web Browser (No Silk, No Chrome, No Firefox). Nothing!!!! This makes it impossible to leave fenced backyard and browse the world wide web. This is a major disappointment to me because I access a lot of streaming web content and podcasts that are not part of the closed environment. If, Amazon ever provides a web browser app, I will update this review to 5 STARS because I love how fast and easy this works for accessing Amazon prime content.", "verified": true, "helpfulness": "0/3", "author": "Supporting Role"}, {"rating": 2.0, "review": "It is advertised as ready for HBO GO and other cable channels. One of the reasons I purchased this is so that I could get these stations without having to pay for cable. Not the case.", "verified": true, "helpfulness": "1/1", "author": "darla"}, {"rating": 5.0, "review": "Excellent device. At least twice as fast as the other media devices out there. I'd recommend buying to anyone.", "verified": true, "helpfulness": "0/0", "author": "Franklin A. Donovan \"Frank Jumbo\""}, {"rating": 2.0, "review": "I can't find this answered anywhere and there is no questions section on this product.  Does it have home screens that can run widgets?  When not watching TV (which is most of the time) I want widgets displaying time, tide,weather, calendar agenda etc. It says there is android there somewhere, but if it is locked under a fixed interface, I'm not interested. Reducing stars further until I get an answer. So far, the G-box MX2 seems like the best in class for a true android experience.", "verified": false, "helpfulness": "0/0", "author": "James A. Arrison"}, {"rating": 5.0, "review": "Love my Amazon Fire TV.  Easy to use and works great!", "verified": true, "helpfulness": "0/0", "author": "Shopping Queen"}, {"rating": 5.0, "review": "All great so far..Easy to set up and use..Maybe the final nail in the cable killer drama..Started the drama for the Apple (my wife's)vs. Fire TV..", "verified": true, "helpfulness": "0/0", "author": "Stone"}, {"rating": 5.0, "review": "i like the easy why to review movies and tv.i haven't done much else with it but i like it", "verified": true, "helpfulness": "0/0", "author": "David  A Smith"}]