[{"rating": 5.0, "review": "Great product, easy to set up and operate.  Voice search option is amazing!", "verified": true, "helpfulness": "0/0", "author": "Charlie's Mommie"}, {"rating": 5.0, "review": "good as cable  and a lot cheaper", "verified": true, "helpfulness": "0/0", "author": "cody w henry"}, {"rating": 4.0, "review": "I love it for everything except the fact that it is a device with a microphone, and no OFF switch forcing me to unplug it, or remove battery between uses.", "verified": true, "helpfulness": "0/0", "author": "AE"}, {"rating": 5.0, "review": "I love Amazon Fire TV - we purchased this because we decided that we're tired of paying $240 per month to Comcast for television and cable. We kept our cable service ($89 per month), got subscriptions to Sling and Hulu and have reduced our cable\\internet bill by $110 a month.", "verified": true, "helpfulness": "0/0", "author": "Judith A. Riggs \"jriggs15\""}, {"rating": 4.0, "review": "We bought the Amazon Fire TV to replace the PC that we had hooked up to our TV. I'm happy that we can easily stream numerous apps using it, like Pandora and Netflix, and there's a really nice built-in feature of screen savers that I like to see, so when I leave the TV on but don't use the Fire TV, I get to see beautiful screen savers.That being said, we were disappointed that the voice option only searches Amazon Prime and won't search Netflix or other apps. We also haven't found a way to search for only free items on Amazon Prime, so if I want to look for free Mickey Mouse shows for my son, I have to check each and every search result to try and find a free one.Overall, the design is very nice, the user interface is beautifully presented, and I see a lot of room for development with app offerings. We are pleased with this, but I feel like there could be more to it.", "verified": true, "helpfulness": "1/1", "author": "K. Hoksbergen"}, {"rating": 5.0, "review": "easy to setup and use. the downloading of video fast and no long buffering.", "verified": true, "helpfulness": "0/1", "author": "Gary R. Herman \"Gary h\""}, {"rating": 3.0, "review": "Voice control remote didn't work after using it only a few times.Not as easy to find program selections as I hoped.", "verified": true, "helpfulness": "0/0", "author": "Brenda Moore"}, {"rating": 4.0, "review": "very easy to install and love the voice activation feature.  Would like to see more on Prime for \"free\" watching as I can still rent most of the videos I  enjoy with my Redbox account for less money.", "verified": true, "helpfulness": "0/0", "author": "butterfly"}, {"rating": 5.0, "review": "Simple.  It works. I love it.  And the feel of the remote is awesome.", "verified": true, "helpfulness": "0/0", "author": "puresound custom pro brass \"Ned Zeppelin\""}, {"rating": 5.0, "review": "Great device, already have at least 5 others wanting one.  Talked to an Amazon tech and within the next two weeks an upgrade is coming out which will allow you to use a usb3 to a external hard drive 1.5 TERABYTE OR A USB DRIVE ITSELF.", "verified": true, "helpfulness": "1/1", "author": "Laura George"}]