[{"rating": 5.0, "review": "I like everything about it, installation was a snap, no set up needed Amazon Prime already configured. The remote has a good feel to it and is easy to use, the voice recognition works every time.I already had the Roku unit and I highly recommend the Amazon Fire TV for anyone looking for interned streaming.", "verified": true, "helpfulness": "0/0", "author": "A. W. Halliwell"}, {"rating": 5.0, "review": "Very easy to set up and use, picture quality is good. Have only used for movies have not used the gaming functions.", "verified": true, "helpfulness": "0/0", "author": "J Preston"}, {"rating": 5.0, "review": "i have the ruko 2 in my living room but decided to put the fire tv in my bedroom. I love the easy setup and the voice command is a plus. There are so many channels and apps to choose from. I love the fact that free 2 day shipping is offered with the subscription because i order from amazon all the time:) I ordered the game controller as well and received it 2nd day air. I played the walking dead game with it and was hooked:)  So far i have no complaints.", "verified": true, "helpfulness": "0/0", "author": "ndpndnt1"}, {"rating": 5.0, "review": "Love it...easy to use.  As a prime member I am leased with the movie selection.  The picture is perfect.  Like it much better than the roku I had.", "verified": true, "helpfulness": "0/0", "author": "Suzanne F. Rupert"}, {"rating": 5.0, "review": "As a professional in the home theater business I have tried a lot of streaming devices. None can match the performance and ease of the Fire.  The wireless RF remote is great.  You have to get one of these if you stream video very often.", "verified": true, "helpfulness": "0/0", "author": "Earl Geddes"}, {"rating": 5.0, "review": "Amazon has set a the bar very high with this content delivery unit.  Tried it to replace anApple TV unit and am impressed.  Extremely easy to set up, voice command is greatand streaming is flawless.  Only issue is the loss of the movies purchased via ITunes.", "verified": true, "helpfulness": "0/0", "author": "Marc"}, {"rating": 5.0, "review": "Once you learn to navigate around the home home page this product is outstanding. The number of viewing choices is huge and, I suspect, will only expand exponentially.", "verified": true, "helpfulness": "0/0", "author": "John G Earls"}, {"rating": 5.0, "review": "I purchased the Fire TV (and controller) based upon the Amazon description of the items and my actual experience has fully met my expected experience.  The items arrived in a timely manner, were very straightforward to install and sync, and for the most part perform in a very intuitive manner.  I've always found Amazon's help feature to be very supportive and this was no exception. I contacted help to ask about apps/games that appear on my Kindle as opposed to apps/games that appear on the Fire TV. The answer, which seemed reasonable to me, was that games/apps are available on the Fire TV as the developer modifies the use for that format. I understand that............as time goes on more games/apps will be available.  I found the mini tutorial video hosted by a cartoon character gentleman to be just the right approach.  From a technical perspective the system shows no lag, the voice search has worked better than I expected.......(I find it to be very good), and the controller is comfortable to use (or so my granddaughter tells me).  I would purchase this again without any hesitation.", "verified": true, "helpfulness": "0/0", "author": "don"}, {"rating": 5.0, "review": "Very fast with an outstanding picture. Much better than my Roku.  I had both the Roku and the Fire hardwired and the Fire was a clear winner.", "verified": true, "helpfulness": "1/2", "author": "BusComputeGuy"}, {"rating": 3.0, "review": "While the unit works with the amazon prime movies with voice search, it does not search other applications using voice.  That needs to change before I would rate it better than my existing smart tv.", "verified": true, "helpfulness": "0/1", "author": "D.E. Francey (Limestone Art & Framing Gallery)"}]