[{"rating": 4.0, "review": "I really like the Amazon Fire TV and it has performed exactly as advertised.  I've tried to use other wifi devices to play movies on my television, but was often frustrated by buffering due to distance from the router.  The Fire TV has performed well with no issues and the voice control feature is great.  Like many others, I wish it could sort by Prime content so that I could see what movies I can watch as part of my Prime package.  Aside from that it's great.  I've actually purchased two for different rooms and will likely order a 3rd for an extra room.  If you are a Prime Member this is a must-have, in my opinion.", "verified": true, "helpfulness": "2/2", "author": "Christopher J. Tonsing"}, {"rating": 5.0, "review": "This is an easy to use controller and software is also easy to navigate.  Have to make sure the selection is covered with \"Prime\" or else you would have to pay for your selection.  I was able to discontinue the use of my WE game controller for Netflix and Amazon TV  .  I certainly can recommend the purchase of this device.  It was simple to set up also.  However, I still am not convinced on the audio search feature.  It worked once for me, but I couldn't get it to come up with the title I wanted the last few times I tried .  But the ease of using the remote makes up for it.  I gave this a five star rating", "verified": true, "helpfulness": "1/1", "author": "Nancy A. Greish"}, {"rating": 5.0, "review": "The Fire is as good or better than the Apple TV due to the selection of free movies.  Having this is almost like having Netflix without the monthly fee.  The sound and picture are fantastic and the use interface is very intuitive.  If you are Prime member, I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Michael Dewey"}, {"rating": 3.0, "review": "The Amazon Fire TV was very good and for the most part it delivered what it said it would stream to my tv. I did not enjoy it as much as I might have because I was looking for access to the broadcast channels....2,4,6, etc. and I never found them in any of the apps that I looked at. A sales rep (never should have trusted a sales rep) told me that I would receive the broadcast channels. All in all though Amazon Fire delivered what the advertisements said it would, just not what a sales rep said it would.", "verified": true, "helpfulness": "0/0", "author": "Wendy1847"}, {"rating": 3.0, "review": "I bought this to replace my Apple TV3 as I saw the power of this tiny box is huge compared to Apple TV. But it has quite some shortcomings. One such thing is getting Dolby 5.1, DTS sound via the Toslink Optical cable. Amazon must do something to get it fixed. I used to enjoy dolby sound with netflix even with my 3,4 years old Apple TV and I no longer have that feature.", "verified": true, "helpfulness": "1/1", "author": "techgeek"}, {"rating": 3.0, "review": "I am pleased with the remote control, it is small and simple to operate. I have learned how to do searches that give good end results after trial and error. The voice search is effective if you ask the right questions. My only disappointment is that there are so many aps or movies etc. that have a fee. I wish there was more free entertainment available with the prime membership. All in all, it is a good product.", "verified": true, "helpfulness": "1/2", "author": "Lucinda howard"}, {"rating": 5.0, "review": "Easy to use and incredibly stable in comparison to Apple TV and iTunes.  Amazon got this product right.  My wife loves it.", "verified": true, "helpfulness": "1/1", "author": "Terry Chepyha"}, {"rating": 5.0, "review": "Love it..  I can watch all the movies I want. A great box to use when you need it. Interesting.", "verified": true, "helpfulness": "0/0", "author": "Tameka Hunter"}, {"rating": 5.0, "review": "The device is smooth, sleek, and compact. Voice control worked amazing. However I already have an Xbox One and Ps4 which essentially does exactly what the Amazon Fire offers. I returned it because for me personally I would have no use for it but it's the perfect addition for your home if you are not into gaming because it offers every app you could think of in one compact and attractive device.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Vanhorn"}, {"rating": 5.0, "review": "Easier than Apple TV. Easy to use all the different services. Easy to set up. Have both Apple and Fire, now using FireTV.", "verified": true, "helpfulness": "1/1", "author": "William F Walling"}]