[{"rating": 5.0, "review": "Fast and easy to use. Just need good internet speed and cable is gone.", "verified": true, "helpfulness": "1/1", "author": "Angel Limery"}, {"rating": 5.0, "review": "Love it. I didn't think the remote worked but then I read hold down on the button for a while and then it worked.  Easy set up.  I am thrilled with it.", "verified": true, "helpfulness": "1/1", "author": "JB \"Kindle Lover\""}, {"rating": 5.0, "review": "Starts in Brazil?", "verified": false, "helpfulness": "0/0", "author": "Wagner Pedrosa"}, {"rating": 3.0, "review": "Overpriced... I prefer the Fire TV Stick, lower price and does kind of the same...", "verified": true, "helpfulness": "0/4", "author": "JM"}, {"rating": 5.0, "review": "This is the game changer, best device for tv's games and all. Also I love the upgrade that I can use my bluetooth not only for headphones it also used for surround soundbar systems", "verified": true, "helpfulness": "2/2", "author": "hershy b"}, {"rating": 5.0, "review": "Love love love my Amazon Fire TV!!  Makes watching movies fun!  Movies load quickly and easily. The picture and sound are always perfect. What more can I say. If you're considering purchasing this unit, don't hesitate any longer. Go and get it now!!!", "verified": true, "helpfulness": "1/1", "author": "Miguel \"mastubs\""}, {"rating": 5.0, "review": "The unit itself is great. Prime needs to add way more free movies, it serves as my gateway to Netflix essentially, every title I check on prime is a rental every one is free on Netflix, the only reason I purchased it was because my 3 RV TV's arent smart TV's otherwise wouldnt have needed it. If Netflix had a box I would buy it cut out the middle man. Get with it Amazon, its embarrassing for you.", "verified": true, "helpfulness": "0/1", "author": "Noneyour"}, {"rating": 5.0, "review": "The FireTV works perfectly. Although, I have a Smart TV, I use the Fire to connect to my WiFi using 5 GHz, because the TV only seems to find the 2.4 GHz frequency.", "verified": true, "helpfulness": "1/1", "author": "L. Johnson"}, {"rating": 5.0, "review": "The fire TV is a game changer. I've had all kinds of streaming media boxes in the past, and this kills them all, including intel NUC's and most small HTPC's. The fact that you can easily install (including sideloading) any android app, makes this a real winner, and the features that come built in like voice search, x-ray for amazon content, etc, is great. There are a few more things I wish it could do. An audible and comixology app would be great, but that's nothing to do with the hardware, and hopefully they'll make their way there soon.", "verified": true, "helpfulness": "1/1", "author": "Billy"}, {"rating": 5.0, "review": "Just got it! Soon easy-to-use. I love it", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]