[{"rating": 4.0, "review": "I seem to be having some trouble using it, but that could be due to sport injuriesmany years ago. All-in-all, I am happy, but sure hope it gets easier to find movies.", "verified": true, "helpfulness": "0/0", "author": "Emmett O'Donnell"}, {"rating": 5.0, "review": "WORKS GREAT VOICE COMMAND IS AWESOME FEATURE WISH I HAD PURCHASED THIS A LONG TIME AGO !!!!", "verified": true, "helpfulness": "1/1", "author": "Scott Bigbee"}, {"rating": 2.0, "review": "Seems like everything you wan t to watch costs extra. Not what I expected", "verified": true, "helpfulness": "0/0", "author": "joe brassfield"}, {"rating": 5.0, "review": "Probably one of the best purchases we have ever made.  We like it better than the Apple TV and the Roku that we had before.  The voice search really makes it amazing.  It will search for something and tell you where you can stream it.  No buyers remorse at all on this.  If anything we will buy more for our other televisions.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Ingram \"mykindanormal\""}, {"rating": 5.0, "review": "Looking to order another one", "verified": true, "helpfulness": "0/0", "author": "Chino"}, {"rating": 5.0, "review": "It works exactly as i thought it would, however being a student i would love to see the kindle app become available or have the ability to be sideloaded.  This is more economical and easier for all to follow when doing a group study.  Other than this, the device is perfect", "verified": true, "helpfulness": "0/0", "author": "Khail Hayes"}, {"rating": 5.0, "review": "I love this. It is easy to set up & really easy to use", "verified": true, "helpfulness": "0/0", "author": "Heather Bopp"}, {"rating": 5.0, "review": "Good buy. Meet all expectations.", "verified": true, "helpfulness": "0/0", "author": "henry"}, {"rating": 1.0, "review": "Can't get it to stream Netflix movies, can anyone tell me what I'm doing wrong", "verified": true, "helpfulness": "2/3", "author": "John Coloni"}, {"rating": 5.0, "review": "The features available in Amazon's Prime subscription are great. When those features are made accessible on Fire TV it is AWESOME! Voice search works flawlessly. Viewing Cloud photos and videos provides a great family-oriented alternative to regular programming too. Love this!", "verified": true, "helpfulness": "1/1", "author": "Jonathan D. Howell"}]