[{"rating": 5.0, "review": "Best deal around if your a prime member! Amazon is my shopping Home ! Keep it up Amazon your the best !", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Once XBMC was released for the fire TV I was on board! Combined with Amazon's interface and the hardware it brings to the table it is quite the little media streamer. If you need an inexpensive box to stream movies, TV shows, etc. then pick up a fire TV. It also plays some of my favorite old games which is icing on the cake for me!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Galliart"}, {"rating": 5.0, "review": "love it.  no commercial.  no buttons to press to record so u can re watch your favorite programs.  Content is a little outdated with prime and Netflix but there is so much content out there to keep u occupied until the mainstream flavor of the month comes out.  You have to have it in your budget to pay for \"prime\" and Netflix otherwise...I don't think the box is functional.  I believe this applies for the others...Apple TV and Roku.  The Fire TV remote very good and simple.  Kudos!", "verified": true, "helpfulness": "0/0", "author": "Leo"}, {"rating": 4.0, "review": "***Update***I have to take back a star from my review. The unit is great and things are looking quite promising to have this little guy be a real HTPC replacement.  My gripe is about the lack of an IR port on the unit.  I have bought a FLIRC USB/IR receiver and have spent hours in learning that system trying to come up with a way to control the FireTV with my Harmony universal remote.  It's not perfect yet but i am making progress.  Still, those hours of my life that i will never get back, plus the extra expense of buying a 3rd party device all because amazon didn't spend a few more penies per unit to add an ir receiver is very frustrating.***Update***I wanted a simple device for connecting to Netflix and Prime Video to replace my game consoles which used to serve this purpose.  The announcement of the Fire TV was at the right time. After getting the unit it has exceeded most of my expectations.I'm an HTPC user. A PC has been a part of my home theater since 1998 and Windows Media Center has been the core of my home theater configuration since 2005. I don't have cable or satellite.  I get live, local TV via a roof Antenna and an HDHomeRun network TV tuner. I had intended to use the Fire TV for streaming content from Netflix and Amazon but after setting it up I decided to try out XBMC and after a few hours of fiddling I think that this little box could replace my HTPC in the home theater.My setup uses an HD front projector and an older model AV receiver (which does not have HDMI switching) so having Optical Audio output on the Fire TV was very important to me.Basic setup of the unit was trivial. Connected the HDMI output to the projector, and the optical audio to the receiver and within just a few minutes I had Netflix, Prime Video and You Tube working.  After a few more minutes I had the Digital Dolby Plus audio working (you have to enable it in a menu).The next day I decided to install XBMC to see if I could use it to playback video files from a network share.  That setup took a little longer because I've never `sideloaded' an application onto an Android device, but the necessary steps are pretty well laid out on the XBMC wiki page. (they link back to Amazon for how to do the install, and then continue to explain how to configure and launch it)Once I had XBMC functional I proceeded to try to get Live OTA TV working and PVR functionality. That took a bit more time and more reading.  I'm not very familiar with XBMC so there was some learning that I needed to in order to get it to work.My first attempt was with an open source program called NextPVR.  XBMC needs a host application to perform time shifting and recording duties and NextPVR is one of a number of applications that can perform this task.  It took a bit to get that setup, but I did manage to make it work. Although I had no Electronic Program Guide to see what shows were airing.After doing more reading I found another open source application called ServerWMC which is much lighter weight than NextPVR because it actually uses Windows Media Center as the recording back end and EPG. Since I already have Media Center's software I decided to try, and that went very well.  There was almost no setup.  Within just a few minutes I had XBMC connecting to it with full Program Guide functionality and access to the shows that I had previously recorded in media center.The last thing that I did yesterday was to get XBMC on Fire TV to send Digital Dolby and DTS audio to my AV Receiver.  It was a simple matter of figuring out how to enable it on XBMC.If you already have OTA TV tuners setup with a Windows Media Center PC and you get a Fire TV all you need to do is download these three things:1) XBMC version 13 (Gotham) or later.  You want the ARM version which will run on Android devices.  Just google `XBMC Fire TV Wiki' that should get you close to all of the info you need.2) ADB - the Android Debug Bridge.  This software you will use once on your PC (actually I did it on a Mac) to `sideload' XBMC into the Fire TV.  Amazon publishes the information of how to sideload themselves.  There's not a lot to it.3) ServerWMC You will run this software on your Media Center PC. This application will allow you to get access to OTA Live TV and PVR functionally on your Fire TV.  I'm still new with this, but it seems like this is the best software to use if you already have a functional Windows Media Center PC that you want to use for recording and storing PVR content. I have had the app crash a few times, usually when trying to change TV channels.  And last night I had a weird issue where one recorded TV program just wouldn't play (but dozens of others that I have tried do). I'm sure that XBMC will be updated to make this solution more stable but so far I'm really impressed.As for the Fire TV itself what I hope to see soon is an Amazon Cloud Player client.  It's amazing to me that they didn't ship with this. I'm also hoping that Logitech can manage to get the Harmony Smart Control unit to work with the Fire TV.Amazon has done an excellent job in creating this wonderful device.  Thanks for not locking it down so tight that we couldn't easily extend its use to fit our needs.", "verified": true, "helpfulness": "9/9", "author": "Trevis Thomas"}, {"rating": 5.0, "review": "Fast shipping, easy set-up, many options. Great value and much better than apple TV or Roku. Many app options as well", "verified": true, "helpfulness": "0/0", "author": "Amanda Gallugi"}, {"rating": 5.0, "review": "My sister in law already has amazon prime but had to stream videos for her kids using her laptop and a cable. Now streaming is much easier and they really like the interface and useability. I'm thinking of getting one for my family as well now, even though we already have an apple TV.Her one complaint is that it's not possible to only view what is free for prime members.", "verified": true, "helpfulness": "0/0", "author": "Biglou \"Lou\""}, {"rating": 1.0, "review": "I love every single aspect of this product and would've given it 5 stars save for a huge flaw. I buy all my music from Amazon MP3 and have yet to find a way to access my cloud. This is an Amazon service not offered on an Amazon device..... I am at a loss of words trying to describe how illogical that sounds. Please fix this soon... I love my music and would like a chance to listen to it on my TV and even purchase more songs.... AppleTV has iTunes.... help me out here Amazon...", "verified": true, "helpfulness": "4/13", "author": "Apoztle"}, {"rating": 5.0, "review": "I was a little skeptical at first but I'm glad I made this purchase. It's a great product. Very quick response to movies and apps. Love the speaker button on the remote.", "verified": true, "helpfulness": "0/0", "author": "Ivonne Almonte"}, {"rating": 1.0, "review": "This product absolutely is restricted for use outside the USA.  I'm a world traveler and needed a way to keep entertained while traveling.  This is NOT it.  Prime or not, Amazon blocks usage when you cross the USA boarders, particularly in Europe, Middle East and Far East.", "verified": true, "helpfulness": "3/14", "author": "Cpt Roland Jarvis"}, {"rating": 5.0, "review": "This thing works great and the voice search saves so much time. I likely won't use any games on it so I can't really speak to how those work but apps for Netflix, YouTube, etc. work very well.I am also really happy with the speed. We have a smart TV which often will not play Amazon but we know if we go into the bedroom where the Fire TV is we can watch. It seems to have a much better connection, faster stream and runs at HD beautifully.The one thing I HATE, and maybe this is just me, is that the videos about how to use the device cannot be deleted. I'm done with them, I know how to use the device and I want them gone, but I can't. remove them. I like things clean and neat and this includes my files be it on my computer, my phone, my Kindle Fire HD or my Fire TV!Lastly, I've used other streaming TV like Netgear and Roku. This is way better.", "verified": true, "helpfulness": "2/2", "author": "Chad"}]