[{"rating": 5.0, "review": "Excellent. What a neat invention. I love all the things available: TV, Movies, My Apps and Games. I found this easy to set up and use. No problems whatsoever, except operator error! The voice feature works perfectly, has understood my every request. This beats the crap out of my old Sony Media Player! A lot of hard work by programmers and technical people has gone into this. Bless all at Amazon. I love my FTV.", "verified": true, "helpfulness": "0/0", "author": "MTCUBED66"}, {"rating": 5.0, "review": "We upgraded from the ROKU HD. We were considering ROKU 3 although the specs were lacking compared to the FireTv. The only hesitation I had was the absence of HBOGO, but customer service assured me that a deal is in place and it will be added by the end of the year. This box is far superior to the Roku we were using. It is a LOT faster, the interface is smoother and easier to navigate and I love the voice search. This is probably the best feature. I will be thrilled when you can voice search HULU + Netflix which I have read is coming. The remote is small and easier to handle than our old one. We put a parental control password in to prevent our son from making accidental purchases (which has happened), however you have to put the password in every time even for something free, vs just for actual paid items. After being away from Prime video for some time, I am amazed at the variety of programming. I thought we were covered with HULU, Netflix and HBOGO, but there are many shows that are only available with prime and I love that. We are heavy streamers, and there is very little we watch live or on cable. This box brings everything together and showed us what we were missing. The upgrade was definitely worth it. All that being said, we wanted to watch something on HBOGO last night and had to go in another room, which was annoying. The next 2 months is going to drag on that aspect, so I am hoping the addition will be sooner rather than later.", "verified": true, "helpfulness": "0/0", "author": "Regina"}, {"rating": 5.0, "review": "I absolutely LOVE this little machine.", "verified": true, "helpfulness": "0/0", "author": "Colleen"}, {"rating": 5.0, "review": "Great fast and very easy to set and get going I recomend it", "verified": true, "helpfulness": "0/0", "author": "softiefoot"}, {"rating": 4.0, "review": "Went from Roku to amazon. great move, best streamer out today", "verified": true, "helpfulness": "0/0", "author": "RUSSELL BROWN"}, {"rating": 5.0, "review": "We love it and just about ready to cancel my cable TV connection, since we only seem to watch this every night !!  One of the best purchase' I've made.", "verified": true, "helpfulness": "0/0", "author": "J. Doyle"}, {"rating": 1.0, "review": "Disappointed.  I have download speeds of close to 50 mbps and loading cloud takes over hour.  Navigating playlist & artists is difficult.  Finding movie rentals very difficult. If you don't have Amazon Prime it is pretty much useless.  Not being able to connect laptops, smartphones, etc is the back breaker.I've been an amazon fan since it's early days (Stockholder since 2000). I've been very pleased w/ Amazon cloud service & it's corresponding applications, I love kindle readers (especially the paperwhite) but this product is not ready for prime time.", "verified": true, "helpfulness": "6/9", "author": "jleach"}, {"rating": 5.0, "review": "I purchased Amazon Fire TV to cut the cost of our satellite bill and I couldn't be more please that I did. The picture is clear and bright and it is very easy to install and get started, however I had problems getting it to stream programs on my older television and had to install on a newer TV model.The voice search works for me almost 100% of the time, clearly recognizing my voice commands, which makes program selection easy.I love the fact that there are so many programs and movies to choose from and more so that I can watch thousands with now extra cost to me, because I am an Amazon Prime Member.Another feature I like is the fact that the music I have purchased on my Kindle automatically streams to my Amazon Fire TV which makes my day, though I am waiting patiently for the day when the music I am able to get on my Kindle with Amazon Prime will stream to my TV also.Now that I have Amazon Fire TV and have been able to learn about all that it has to offer me, for my entertainment on television, I will be purchasing more boxes for other TV's in my home.", "verified": true, "helpfulness": "0/0", "author": "RP"}, {"rating": 5.0, "review": "A nice selection of music performed by Lang Lang.  Quality of CD was excellent.  Service was very good.", "verified": true, "helpfulness": "0/2", "author": "Ron"}, {"rating": 5.0, "review": "I luv this little box! I love itsr", "verified": true, "helpfulness": "0/2", "author": "Steven L. Armstrong"}]