[{"rating": 3.0, "review": "Has too many limitations the menu button works on only a limited function. There is no way to limit download data quality for on line data users with limited data there needs to be a selection for SD,HD, UHD. We are only using Netflix because we can limit the download quality of programs and movies.Other than that the unit works great.", "verified": true, "helpfulness": "0/0", "author": "Chook"}, {"rating": 5.0, "review": "I love the ease with which it works, you can go from cable tv to Amazon Fire tv in less than a minute and you are cruising your options.  So, even I can use it, if I can get it out of my husband's hot little hands.", "verified": true, "helpfulness": "0/0", "author": "MissT"}, {"rating": 5.0, "review": "I am very happy with my purchase of the Amazon Fire TV!!  I am able to watch Amazon Prime, Netflix, and Hulu so incredibly easily, and it's awesome.", "verified": true, "helpfulness": "0/0", "author": "haleyes"}, {"rating": 5.0, "review": "I have set up my fire tv and I can not get it to use my regular TV or I cannot navigate from one selection to another I selected TV and nothing happened it went to screen saver and that never helped my at all.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "No doubt this is easy to set up, literally plug in the HDMI cables (which do not come with the system) and go. and the voice command remote is fantastic. I said Edward Norton (as an example) and it brought up every movie he's been in! The only reason I gave it a 4 (and maybe it's just my lack of technical knowledge) is I cannot get it to work with my surround sound system. I called for help but got even more frustrated (which is not the norm for Amazon). It just seems that since my surround sound works with my TV that when I plug this into my TV it should automatically work....like I said, it is so simple to set up and overall I am pleased. I'm sure there is a lot more it does as I see that some authors have written a book on it. And just FYI, I do plan to buy the stick as well for an upstairs TV as I don't know why I would need 2 Fire TVs, seems that 1 TV & 1 stick will do the trick.", "verified": true, "helpfulness": "0/0", "author": "Sundance"}, {"rating": 5.0, "review": "Fun to use; easy to connect and start up.", "verified": true, "helpfulness": "0/0", "author": "Donald C. Weiss"}, {"rating": 1.0, "review": "This product cuts out intermittently often. Its quite frustrating for the price, and the wireless connection seems sketchy. I'm hoping that replacing the cord the product came with will help, however I'm still struggling to figure out how to go about doing that.", "verified": true, "helpfulness": "1/1", "author": "Erin B"}, {"rating": 5.0, "review": "Very easy to setup and use, inexpensive for what one gets -- as long as one continues to pay $100 per year for Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I think I may have found the cure to my obnoxious cable bill!! I just got my Fire TV hooked up today (which was insanely easy) so I may be jumping the gun but so far I am very pleased with it. Between Amazon prime TV/movies and Netflix I think I will be just fine without cable. The device is super easy to use.", "verified": true, "helpfulness": "0/1", "author": "niki"}, {"rating": 5.0, "review": "Gary Busey!!!!!", "verified": true, "helpfulness": "0/0", "author": "Joseph"}]