[{"rating": 5.0, "review": "This Fire TV is absolutely Fantastic!  One they get HBOGO it will be perfect!", "verified": true, "helpfulness": "0/0", "author": "Perry Anderson"}, {"rating": 5.0, "review": "Everyone should have Amazon Fire Tv and a Prime Membership.  We now have two so my hubby and Ican both watch whatever we want. Or I can listen to Prime music.  We really love it.", "verified": true, "helpfulness": "0/0", "author": "Faith"}, {"rating": 4.0, "review": "Great and easy to use remote and voise activation but the apps are confusing and amazon prime content is hard to find without going through there pay per view movies.This is why i only gave 4 stars instead if 5.", "verified": true, "helpfulness": "0/0", "author": "Ken Zabel"}, {"rating": 5.0, "review": "Easy to hook up and easy to operate. Amazon fire TV has met all my expectations.", "verified": true, "helpfulness": "0/0", "author": "L I Ratzell"}, {"rating": 3.0, "review": "IT REALLY NEEDS SOME INSTRUCTIONS WITH IT.", "verified": true, "helpfulness": "0/2", "author": "allan"}, {"rating": 1.0, "review": "NOTE: it doesn't work with 1080i TVs. It drops to 720p", "verified": true, "helpfulness": "2/5", "author": "Andrey Yruski \"Andrey\""}, {"rating": 4.0, "review": "Met my expectations, but it could be better if the USB was unlocked to view content from USB storage devices", "verified": true, "helpfulness": "2/2", "author": "Music enthusiast"}, {"rating": 4.0, "review": "Works well. Many free shows available.", "verified": true, "helpfulness": "0/0", "author": "Karyl Maiorana"}, {"rating": 4.0, "review": "The product itself is really really good. I think anyone can use it with ease and ready to play out of the box. The setup is simple and don't forget the box comes already connected to your prime account.The biggest drawback for such a powerful device is the lack of Google Play Store...which is replaced by Amazon App Store. There is no way Amazon App store is going to be anything as big as Google's or Apple's so I don't really see the point of restricting customers  to Amazon only apps or app store!I hated the fact that Amazon decided no to ship the product with an HDMI cable!!!The price wise it's good value if you get it on sale and not the full price. if you-can-unlock it you could do a lot of great things with the device..like adding goolge play store!", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "luis del rio"}]