[{"rating": 4.0, "review": "This thing works well and pretty much streams flawlessly with my admittedly decent net connection.  A couple of things would make it even better.  First, as others have noted, there should be a simple Amazon Prime view so that you can easily browse the free stuff.  Secondly... Voice search doesn't seem to search Netflix, though it works well with Hulu.  Really, really wish voice search worked with the Netflix app.  All that said, the only thing keeping it from 5 stars really is the lack of the Amazon Prime-only view.  It's fast and easy to use with an impressive number of apps.", "verified": true, "helpfulness": "0/0", "author": "Joleen Shook \"-J. Shook\""}, {"rating": 5.0, "review": "We are very pleased with the Amazon Fire TV. It took a little bit of playing around with it but once I got it all figured out I love it. What I had to figure out was how to download apps like Netflex that was not on the home page ubtil I downloaded it.", "verified": true, "helpfulness": "0/0", "author": "S. Carlson"}, {"rating": 1.0, "review": "Extremely dissapointed.  Tried on all three TVs.  Only plays for a few minutes.  Have put on a separate surge protecter so I can turn the power on and off with a switch.  Longest play was 17 minutes.  WiFi is a problem 12 feet from router although I can us my Kindels in my neighbors house from the my same router.Bought n Apple TV so I can play Amaxon Video.", "verified": true, "helpfulness": "1/2", "author": "William R. Porter"}, {"rating": 5.0, "review": "It's easy to use and responds quickly. We are happy with it.", "verified": true, "helpfulness": "0/0", "author": "Kate McBride"}, {"rating": 4.0, "review": "Loving it for the most part.  Biggest frustration (only one, really) is the frequent buffering. I watched one Selfridge episode straight thru for the most part....then. next episode literally stopped to buffer every 5 minutes!!!! I just shut it down and the nrxt episode was fine.  WHY???Plus,I \"rented\" ($3.99) 2 movies this week which both needed FREQUENT buffering. I feel like that shouldn't happen.Wanted to vent about the buffering. I wouldn't ditch Amazon Fire/Prime.....its too awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Constantly drops wifi. The x box work well and no problem with the computer.. To bad this would be greatIf we could watch it for more then 5 minutes at a time..", "verified": true, "helpfulness": "1/2", "author": "ELMER"}, {"rating": 5.0, "review": "Works perfectly...Very unobtrusive...no buffering or any other bad characteristics", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"greatescape\""}, {"rating": 5.0, "review": "Love fire tv, only downfall is a lot of movies you have to buy. I do have netflix so I can watch through fire tv for free. The picture quality is excellent. I would highly recommend", "verified": true, "helpfulness": "1/1", "author": "Tracey D"}, {"rating": 4.0, "review": "Powerful and cheap with the preholiday deal. Not a fan of Amazons sandboxing of this product, but was cheap enough to live with.If youre using kodi/xbmc, let me save you a headache, choose software rendering only and turn off multi-threading, otherwise you're videos will be choppy and unwatchable.", "verified": true, "helpfulness": "0/0", "author": "Ryan M"}, {"rating": 4.0, "review": "Ok, this is tough, because I love Amazon. I have Amazon prime and I also have Netflix. We have Apple tv downstairs and now Fire TV upstairs. I did have Chromecast, but hated having to use an app to control the tv. So, I have used all three. I hate to say, Apple tv, to me, is the best... now Fire tv is a great competitor, but I do think I prefer the menu on the apple tv. I also have had some issues with Netflix on Fire tv, and haven't on the Apple. So, if I had to rate the three... it would be Apple tv, Fire tv and then I wouldn't bother with anything that doesn't have a remote!!", "verified": true, "helpfulness": "0/0", "author": "P. Idoni \"\"ticker\"\""}]