[{"rating": 1.0, "review": "I returned this item. It buffered ALL THE TIME with Netflix. Even my Wii doesn't buffer like that.", "verified": true, "helpfulness": "1/3", "author": "Mamirhi"}, {"rating": 5.0, "review": "GREAT SELLER!!! AS DESCRIBED!!! FAST SHIPPER!!! A+A+A+", "verified": true, "helpfulness": "0/0", "author": "young1816"}, {"rating": 5.0, "review": "Love it. I was able to use it with a projector. Good piece of equipment", "verified": true, "helpfulness": "0/0", "author": "ijybabe"}, {"rating": 5.0, "review": "This is me coming back to give a rare review of a product I purchased.  The Fire TV is a life saver for my entertainment cord cutting project.  I have been working on an all around media center ever since I ended my cable subscription 3 years ago.  I have tried Windows Media Center, Plex, PlayOn, Roku, XBMC/Kodi, MediaPortal and even combinations of the Roku and the XBMC server to incorporate Netflix and Amazon Video as seemlessly as possible.  None have been easy to setup and use for guests, kids or the wife.At a point where the Wife Acceptance Factor (WAF) has become seriously strained along came my first Fire TV.  After getting it, I did not have a lot of hope for it being able to fill our needs so it primarily sat in our guest room waiting to be used for 6 months.  I finally stumbled upon a forum describing how well Kodi runs on the Fire and thought I should give it a chance.  It is amazingly easy to set up, does not require root access and truly is the easiest of all of the implementations I have attempted.  I have replaced one Roku and the Kodi server which saves me on electricity as it was a gaming PC and used a lot of power to be on constantly. We have two more TV's in our house and both of those Roku's will be replaced soon.  I am hoping for an upcoming sale on the Fire and then the remaining Roku's will be given away to someone who would use them.I want to give a list of Pro's and Cons for anyone who is on the fence.Pro's:1. Kodi- Amazon, Please do everything in your power to keep this available for the end user.2. Got Prime- Finally I can easily use all of the features that comes with my membership.  I have been paying for Prime for years with very little ways to access the video content.  With the Fire TV, Amazon Video is our primary streaming service, sorry Netflix.3. Voice search- Please expand this to Netflix.  It does very well and I would like to be able to search Netflix.  Also it would be nice to be able to open Kodi with it, that may be asking a lot.  My hopes are that Amazon Echo can be used to control the Fire TV even though I do not have the Echo yet.4. Great video, sound quality and easy to control-  Remote is small and simple. I wish there was some kind of event service that can control a TV or something but I have figured a way around this.  Video quality is great and is adjustable for various screen sizes.5. Lots of extra cool features-  Too many to listCons:1. Netflix voice search- I have seen some rumblings that this is in the works and I get why Amazon may be dragging their feet to push their streaming service, but it would really make a longtime Prime member and dedicated Amazon customer like myself have a much better experience.2. Other device control- It would be great if there was a way to control other devices or perhaps a universal remote that still allows voice control.  A mini keyboard that couples with my Fire remote is my workaround.  It works well with eventghost on a separate computer to control the TV and receiver. Found on amazon and made by Ipazzport.3. Nothing else that I can see.  Amazon fixed my other issue with storage size with the latest update.For any cord cutter out there looking for the final solution to make it happen, the Fire TV is closest to the answer that there is on the market.  Yes it is Amazon focused with the Video streaming, but what would someone expect from a company offering this service.  It does have Netflix, Hulu and other streaming service support and is the same way of accessing them as Roku or any other player.  Amazon just gave the best features to their own content and who could blame them.  At a time when I questioned going back to cable, cancelling my Prime membership and giving up on giving up the cable TV, the Fire TV really saved my butt.  A lot of blood sweat and tears plus money went into my search for the best implementation and now it can be done with a $99 Fire TV.  Thanks Amazon, I know you are a big corporation and could care less what little old me thinks, but the Fire TV is a winner.", "verified": true, "helpfulness": "0/0", "author": "Ovidson"}, {"rating": 3.0, "review": "It works okay, but there is not much in the way of new stuff. I hardley use it and will probably let the subscription expire.", "verified": true, "helpfulness": "0/0", "author": "clem"}, {"rating": 5.0, "review": "I LOVE THIS AMAZON FIRE TV.  So easy to operate and love the voice search.  Cant say enough nice things.", "verified": true, "helpfulness": "0/0", "author": "Louisa M."}, {"rating": 4.0, "review": "It great... It's already configured, but the only thing that I have to say, is that some Prime movies and shows are not available or not in Spanish", "verified": true, "helpfulness": "0/0", "author": "Ariel Dorfman"}, {"rating": 2.0, "review": "Unfortunately, Fire TV does not deliver as advertised. It is an excellent piece of machinery that technically does what it is supposed to. The voice search and control features are impressive. But the content is a major problem; my wife and I were not able to watch all of our hulu shows on Fire TV, as hulu blocks Fire TV from shows that we can watch with hulu on our computer. This is really unacceptable - how is it that there is less content when one buys an additional device?Amazon Prime content, however, is excellent, and streams with no interruptions. We have a fire stick that works just as well (not quite as fast, and no voice search though).", "verified": true, "helpfulness": "0/1", "author": "A. hopkins"}, {"rating": 5.0, "review": "Love it! Best streaming box out right now!", "verified": true, "helpfulness": "0/0", "author": "George Welsh"}, {"rating": 5.0, "review": "I have purchased three devices in my life that made me very happy from the minute I started using them.  The first was an Apple Mac I bought in 1984, the second my first Kindle in the spring of 2008, and the last my recent purchase of the Amazon Fire TV.  It exceeds expectations for how it performs, and I have already gotten many hours of enjoyment from it.  It is extremely simple to set up and to use, takes minimal space, and relays perfect picture and sound.  The ideal way to enjoy Amazon Prime videos, HBO Go, and other sources.I used a ChromeCast unit for about a year.  The Fire TV is well worth the additional money both for ease of use and quality of images, and will cost less than a penny more per program over the life of the device.My advice is buy one of your own.", "verified": true, "helpfulness": "0/0", "author": "Patrick Schoenfelder \"history and economics fan\""}]