[{"rating": 2.0, "review": "Did I just spend $100 on a Netflix streaming device that can't even download the app? Get it together, Amazon.", "verified": true, "helpfulness": "1/3", "author": "M. Siipola"}, {"rating": 3.0, "review": "Very disappointed. I gave as a gift and it won't let us update.  After reading more of the reviews this sounds like a major problem. Just bummed...and I feel bad for the recipient. I will wait until Friday and call support like some of the other reviewers have done.  Hopefully they can get it fixed.See update in additional comments below!!", "verified": true, "helpfulness": "4/5", "author": "Michelle M"}, {"rating": 1.0, "review": "Really disappointed. At first, the device as a whole seemed pretty functional, but was a disappointment in actuality. The Netflix app refused to download on the system, no matter what I tried. Additionally, I was unable to use HBO Go on it because my cable provider, Charter, has not yet made an agreement with Amazon yet. Amazon likes to blame Charter for this, however they both deserve the blame because this is not an issue on a similar device like the Roku. I'll be returning this to Amazon.", "verified": true, "helpfulness": "3/4", "author": "Yara Hejazi"}, {"rating": 5.0, "review": "No complaints.", "verified": true, "helpfulness": "1/2", "author": "johnny"}, {"rating": 5.0, "review": "so easy to use", "verified": true, "helpfulness": "1/1", "author": "Xandi"}, {"rating": 3.0, "review": "Just got mine today as a gift Biggest flaw is not having the cables to make it work  Why sell a device without the necessary cables  ( it comes without the hdmi cable to connect to the tv )  Guess i have to wait till friday to use it", "verified": false, "helpfulness": "3/6", "author": "rich morgan"}, {"rating": 5.0, "review": "The best media player I have tried so far", "verified": true, "helpfulness": "0/0", "author": "Ijlal"}, {"rating": 4.0, "review": "Just set it up about a week ago. Wanted to see if it would be possible to dump cable for TV over the internet that everyone keeps talking about.  So far it's been great!  It was very easy to set up, mine already came programmed with my Prime account info so all I had to do was set up the wifi connection & that took about a minute.  I was expecting to have some buffering time here & there when watching videos but this thing runs very smoothly.  Other than a few seconds at the start of a video the rest runs non stop all the way through. Have to note here I have DSL service for internet so that's why I was expecting some buffering to occur but with the processor they have in this thing everything runs very smoothly.  I've been watching some of the Prime shows & also videos on You Tube & Twitch. I also am trying out Netflix which is great & have had no issues with any of them.  All run smoothly. The only down side is you really have to search for the free content on Prime & the voice search feature doesn't work very well. Otherwise I would have given this thing a full 5 star rating.  If you want a low cost alternative to cable definitely try this out!", "verified": true, "helpfulness": "3/3", "author": "Thomas B."}, {"rating": 5.0, "review": "Works great, the interface looks nice", "verified": true, "helpfulness": "0/0", "author": "MDiaz"}, {"rating": 3.0, "review": "True enough, it does have some spectacular aspects, such as greater access to the FULL library of videos on Prime Instant, and Netflix, but it does have TWO fatal flaws.One: The screen saver will not function easily, even after repeated attempts. I finally got it to switch to the spectacular images of nature, but this is part of what is problem number two.After sitting for the night, the app locks up, and requires unplugging the power source, in order to re-boot. Again, the screen saver refuses to function, even after several tries, and rebooting a couple of times.Tomorrow morning, I mightl have to re-boot it again in order to function, and I will AGAIN, try to get screen saver to function. I will try again, but if it gives me the same grief, I will be give serious thought to sending it back. I don't want to, because what it does get right is very impressive.Too bad. I like most of it, but locking up, and having to go back into settings to protect my big screen is monotonous.", "verified": false, "helpfulness": "1/1", "author": "Oreille"}]