[{"rating": 5.0, "review": "Wow so much better then our old WD Live box! This is much more stable and the apps like mlb tv, and hulu work much better. Unit also had no problem playing movies off my NAS drive. A+", "verified": true, "helpfulness": "2/2", "author": "Carl Mahler"}, {"rating": 5.0, "review": "Better than I thought", "verified": true, "helpfulness": "0/0", "author": "Thomas M Hopkins"}, {"rating": 5.0, "review": "So cool and easy to set up. Hardly use my cable any more. All the shows and movies I like I can get on Amazon or Netflix with this device. Really works great. Suggest you have the fastest internet speed; higher speed better streaming so no delays. I bought this one for my big screen and the Fire Stick for bedroom TV. Both work great.", "verified": true, "helpfulness": "1/1", "author": "Lorilee"}, {"rating": 5.0, "review": "The best thing out there to stream movies, listen to music and enjoying shows!!! Can't wait to see what else Amazon comes out with. The wireless connection to the internet was fast and the device itself is easy to use.", "verified": true, "helpfulness": "1/1", "author": "Denny Parada"}, {"rating": 4.0, "review": "I have a Kindle Fire HD 8.9 tablet that I would connect to my TV via a HDMI connection to watch movies, TV programs, Facebook & search the Internet.  I thought the Amazon Fire TV would give me all the capabilities of my Kindle Fire HD 8.9 but without having to deal with a HDMI cable.  However, I cannot access the Internet on Amazon Fire TV & that is very disappointing.  I am impressed with the speed & ease to use Fire TV & with the amazing amount of content.", "verified": true, "helpfulness": "1/1", "author": "James Reeves"}, {"rating": 4.0, "review": "Really, really cool.  I didn't know I would like this as much as I do.  the voice search is the greatest.  It just needs a browser, then it would be better for traveling and logging in at hotels.", "verified": true, "helpfulness": "1/1", "author": "Richard K. Kohl"}, {"rating": 5.0, "review": "Great product and even better with Prime Instant Video. I have this and Apple TV - much better interface on the Fire!", "verified": true, "helpfulness": "1/1", "author": "eh"}, {"rating": 4.0, "review": "OK, so far so good. Now, add Fandor!", "verified": true, "helpfulness": "1/1", "author": "Emerson \"jeeem\""}, {"rating": 5.0, "review": "Have had it for months and still have not been disappointed!", "verified": true, "helpfulness": "0/0", "author": "kbrady"}, {"rating": 5.0, "review": "Amazon Fire TV is a quality product.  The UI is outstanding...A very satisfied customer...", "verified": true, "helpfulness": "1/1", "author": "Nashid Abdul Rahmaan"}]