[{"rating": 4.0, "review": "I replaced my HTPC with this and it does what it is supposed to do. No issues connecting to my network and streams beautifully both with Netflix and Plex.  Could use DLNA support and I hope they add it (main reason for 4 instead of 5 stars).  More games and apps being added all the time so I feel this will just get better.  The box itself and remote feel very solid and not cheap.  Voice search does work well but limited at this time in what it can find (7/25/14) although I have already read that they are working to expand its capabilities.", "verified": true, "helpfulness": "1/1", "author": "Knighti2"}, {"rating": 5.0, "review": "Amazon Fire TV makes watching enjoyable and very easy. I have to remind myself to move away from the TV, the opportunities are endless!!", "verified": true, "helpfulness": "1/1", "author": "Eve Chute"}, {"rating": 5.0, "review": "Fabulous for watching programs without commercials.", "verified": true, "helpfulness": "2/2", "author": "Carolyn S. Sims"}, {"rating": 5.0, "review": "I LOVE THIS THING!!!! I like the apps it offers and LOVE that it tied right to my amazon account which means i have acesss to all the Prime movie, music, and shows. I WOULD RECOMMEND!!!", "verified": true, "helpfulness": "1/1", "author": "S"}, {"rating": 5.0, "review": "Easy to install, easier to navigate! Pretty soon it's bye-bye cable!", "verified": true, "helpfulness": "0/0", "author": "Keith Knotts"}, {"rating": 5.0, "review": "Very nice product, especially for the price. The processors are impressive, along with its overall performance. My only complaint is that the voice search feature ONLY works with Amazon Prime Instant Video. It does NOT work on Hulu, Netflix, etc, as of date of this review.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "So far, haven't seen that much free stuff that we haven't already seen or want to watch, however, the unit was a simple hook up and works well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Amazon Fire TV has a limited selection of apps from which to choose.  The feature where you speak into the remote to find a show works well but only within the Amazon site. My thought is that it is a better deal for Amazon than for customers. Overall, I prefer the Roku by a wide margin because the universe of apps is available.", "verified": true, "helpfulness": "0/1", "author": "shaleg"}, {"rating": 5.0, "review": "Where to begin, First of all I didn't want to buy a Smart TV because the TV I have now I LOVE!! I got the Fire TV and lets just say its nothing short of amazing!! First off the packaging was very nice, it was practical! I love the size of the unit itself. It is quite small and able to fit just about anywhere! I remote is very small and sleek, and resembles an Apple TV remote, BUT BETTER!! I have tested the voice search function and have yet to stump it!! I do wish that they would have included an HDMI cable, so that it was ready out of the box!!Now to the functionality:When they say its fast, they aren't kidding. The only issue I have EVER had was the Netflix app. At times its fast as can be..load times in around 5 seconds. Other times it can be 2-3 minutes and extremely pixelated! It's crazy how it fluctuates. I do wish that they include a section for just Prime videos. Seems like when I go to a genre and I want a movie, it is one I have to pay for!!Would I recommend? HECK YES!! I love this box, and use it almost daily. If you want a great alternative to smart tv then this is for you!!", "verified": true, "helpfulness": "2/2", "author": "Matt"}, {"rating": 5.0, "review": "Much better than apple TV!", "verified": true, "helpfulness": "1/2", "author": "Marc Rosales"}]