[{"rating": 3.0, "review": "Ok tv but I prefer the Apple TV cause  I can use Airplay... does all the same things though... Mahalo", "verified": true, "helpfulness": "1/2", "author": "Ptcruising"}, {"rating": 2.0, "review": "I bought this in april and it was great. Now comes September and I can't get it to stream anything on Netflix or Amazon prime. I pretty much only bought it to stream Netflix in HD so it's now useless. At least I still have my Roku 3 that's about a year or so older and still works flawlessly. Maybe I'll find some use for it...Like eating some shrooms and staring at the pretty screen savers.", "verified": true, "helpfulness": "1/1", "author": "mike"}, {"rating": 5.0, "review": "So easy to use, works great with my Fire phone.", "verified": true, "helpfulness": "0/0", "author": "Jerry Muccianti"}, {"rating": 5.0, "review": "This has got to be the best thing I have ever purchased to stream movies!Its fast and easy to use.  I am thinking of purchasing another and giving myroku away!", "verified": true, "helpfulness": "0/0", "author": "EVA MOBLEY"}, {"rating": 3.0, "review": "When I first purchased this device, everything worked as advertised.  Just a couple of weeks ago until now I have issues with Amazon's instant video and Netflix.  I thought it was because of some internet problems, but that wasn't the case at all.  I tried several times reinstalling the Netflix app, that too didn't fix the problem.  Just for grins I checked my Netflix and Amazon instant video apps on my PS3 and they work just fine there.  Don't know who to talk to about this situation.  If anything, it does work for Youtube and Vimeo at least.  That's the reason I gave it three stars.  Not worth the money on this device if there is no tech support on it.", "verified": true, "helpfulness": "5/5", "author": "WX_IVAN"}, {"rating": 3.0, "review": "I love the FireTV with the Cloud Drive photo stream, and the all the new shows to watch on Prime Instant Video! I haven't used my Apple TV for weeks... Plus games it's a great value and more fun.However, I have a complaint about not being able to manually shut off the box. I've noticed that most of the time it doesn't shut off automatically and it stays on all night & day even when I go back to the Home menu. Sometimes it does turn off after a couple hours of inactivity, but most times it does not. I don't like not being able to go to the settings menu and have the option of a manual off & restart. With Apple TV I am able to hold down the 'Home' button on the remote for a few seconds and the box will turn off.Maybe put it on the next update..?", "verified": false, "helpfulness": "1/2", "author": "carley rose"}, {"rating": 5.0, "review": "Our family absolutely loves our Amazon Fire TV. We have had it for about two months now. Our kids want us to purchase another for their room. With Amazon Fire TV, you can always find something to watch! I have only had to call customer service once for assistance in getting the Fire TV to reset. Customer service was great! Shipping was fast too. I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm in love.  My daughter gave me that other one...  for Christmas and frankly it seldom ever gets used.  It's a bit fussy for me.  Let's face it, I have lots of products from both Major Companies - this Fire TV is hands down my best choice in a very long time.  I was already a Prime Member and have been for several years so this was just icing on the cake.My husband jokes that if I don't get a delivery from Amazon weekly, they will call the house to check on me....", "verified": true, "helpfulness": "0/1", "author": "chloek"}, {"rating": 4.0, "review": "This is a warning for those of you with older televisions. The issue with the Fire TV and older televisions is that the software fails to drop to the lowest resolution without user interaction (like a computer with a new video card will do). It was built to be used with a native HDMI display and when connected to an older display with a HDMI-DVI adapter it won’t downscale the resolution to mate with the older display (because it can’t talk to the TV like it can over a real HDMI).  You can get around this in 3 ways: 1.) buy a little box that’ll send the proper signals back and forth between the television and your Fire TV (links below), 2.) hook the Fire TV up to a HDMI capable display, set the resolution DOWN to match your TV (settings, lower to 720/60hz) and then hook it back up to your TV, or 3.) buy a new TV. After you’ve chosen one of these solutions you should also do a factory reset. Just hold the right side of the circle (like arrow right) and the back button at the same time for like 15 seconds you will get an option to do a factory reset.Here's the hdmi -> vga adapter:http://www.amazon.com/gp/product/B003O55U8K/ref=as_li_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B003O55U8K&linkCode;=as2&tag;=lnk14-20&linkId;=B7NVKJUMRESV4GKDIt doesn’t come with a power supply – use this one:http://www.amazon.com/gp/product/B001KU44HE/ref=as_li_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B001KU44HE&linkCode;=as2&tag;=lnk14-20&linkId;=VGOEKSTLJZTFTABGI parsed all this info from this thread, big thanks to all these intrepid troubleshooters! http://www.amazon.com/gp/help/customer/forums/ref=cs_hc_g_pg_pg1?ie=UTF8&forumID;=Fx1SKFFP8U1B6N5&cdSort;&cdThread;=TxCL920T0IZ9K9&cdPage;=1", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This was a gift to my son", "verified": true, "helpfulness": "0/5", "author": "Jose L. Santana"}]