[{"rating": 3.0, "review": "The organization of apps and channels is awkward and doesn't seem like it'll hold up well if a lot of them are added.  Very possible for future software updates to fix this.Out of the box experience was mixed.  I love that it came pre-configured for my Amazon account.  Hooking it up to the LCD TV (720p) in my family room resulted in a Amazon logo, then a blank screen.  I had to hook it up to a 1080p tv to manually configure it for 720p and move it back to the family room.  The menu, apps, and games all work fine, but no streaming video will play on my 720p tv, only on a 1080p tv...despite the Fire TV being configured for 720p.The inability to restrict searched to Prime-only content is annoying.  My PS3 is a better Prime Instant Video experience than this box...but this is also one of the things that I think Amazon could very easily change in the future with a software update.Overall, very much a first gen product...I'd recommend holding off until the software has matured.", "verified": true, "helpfulness": "0/3", "author": "Matt G."}, {"rating": 4.0, "review": "Since we've been Amazon Prime members for quite a while, I jumped on \"Fire TV\" and I'm not dissapointed.  It impressed right away with it's slick packaging design and compact size.  It's similar in this respect to the Apple products that I've owned.  Very easy to set up and the remote (with it's speech recognition) is the best I've seen.I had purchased an Roku streamer last month and returned it within a couple of days.  I had trouble with the audio and their customer support couldn't resolve the issue.  At a similar price point, the \"Fire TV\" us a much better choice.  My only reservation is that it doesn't inlcude an app for \"Vudu\", which I have on another device.  Perhaps this will be added in a future upgrade.", "verified": true, "helpfulness": "0/0", "author": "The Reader \"mr1620\""}, {"rating": 5.0, "review": "I have all 3 major similar devices, Apple TV, Roku, and now  Fire TV.  I like that Fire TV is open to developers so you get a bigger ecosystem, and it has the ability to play games.  I can't stand the Roku sounds any more, that bonk sound is like nails on a chalk board.", "verified": true, "helpfulness": "0/0", "author": "Dave Mozealous"}, {"rating": 4.0, "review": "Fire works very well and is easy to setup.  Just wish it had more connections to other accounts like HBOGO or a way to set that up.Overall, it is a very good product.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Online Shopper\""}, {"rating": 4.0, "review": "Although it will not replace my Apple TVs I do like it. I am going to attempt to write an App for it and if I can it will be something I will be recommending to our clients as I was hoping an Apple TV SDK would have open up by now, but alas we are still on hold.", "verified": true, "helpfulness": "0/0", "author": "Giancarlo Gomez"}, {"rating": 5.0, "review": "Perfect for what I needed it to do. Hope they improve some of their features and add new apps. fast response time so far and the voice feature works very well.", "verified": true, "helpfulness": "0/0", "author": "L. Moore"}, {"rating": 2.0, "review": "Not what I had hoped. Very much tied into Amazon Prime thus limiting the number of free shows. Complaint 1- ac converter too wide, it blocks the plugs on either side of my power strip making them unusable. 2- for $100 you would think they could throw in a $4 hdmi cable. 3- Netflix stopped working after 1 week. I can sign in my shows will not load. I deleted the app and re-installed it but still ng. Going back to my chromecast setup and will consider a Roku.", "verified": false, "helpfulness": "2/3", "author": "D. Naske"}, {"rating": 4.0, "review": "I have Apple TV (the first generation hardware, latest firmware).  The biggest differences between Apple TV and Fire TV are;- pretty much no video buffering and it starts right away, no stopping in the middle.  This is great.- there are tons of free movies with Amazon Prime membership.  On Apple TV, there is no free movie.- Apple TV has iTunes Radio and also my own library.  Fire TV is with no music for now.  I'm sure it's coming in the near future.- never tried Apps for Games yet on Fire TV.  I will.- remote is easy to use (except rewinding and fast forwarding of video) on Fire TV.  \"Home button\" is great, something not on Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"sukiyaki4\""}, {"rating": 4.0, "review": "Basically, Amazon Prime on the TV.  Hopefully there will be more content and enhancements added to make it better.  Easy to navigate and pretty decent amount of content but would like to see more offerings without having to buy them.", "verified": true, "helpfulness": "0/0", "author": "PT"}, {"rating": 5.0, "review": "I have Google TV, Chromecast and Roku 3. Since getting FireTV the others aren't being used (unless they have content I can't get on FireTV - for example, Acorn which I get on Roku).I use it with a Fire HDX 8.9. Second screen use for queuing up programs and X-Ray enhance the experience significantly.Switching on mirroring is surprisingly slow given how speedy other operations are.It's annoying not to be able to get other familiar Android applications easily. I haven't had time to sideload them yet - but why make us jump through hoops?I am hoping for (even expecting) big improvements over the next six months. (Like Acorn and other channels becoming available on FireTV). Then it should become my only streaming device.", "verified": true, "helpfulness": "0/0", "author": "Keith"}]