[{"rating": 5.0, "review": "LOVE IT!!!!!!!!!!!!  This has opened up a whole new TV experience for my mother.  She watches Hulu, Netflix and plays Pandora in the background all day long as she happily putters around her house.  :-)", "verified": true, "helpfulness": "0/0", "author": "Walter Combs"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "nikki cahoun"}, {"rating": 5.0, "review": "My Amazon Fire TV has been GREAT.HOWEVER, a NEW PROBLEM just started within the last few days.  I will choose a program to watch and it downloads slow, starts, then down loads again and again.  If the program does start to plat it only plays a SHORT segment then starts downloading again.  Makes watching impossible.HOW DO I GET HELP??", "verified": true, "helpfulness": "0/0", "author": "Dickey Powell"}, {"rating": 5.0, "review": "Bought this as a gift for my father and he absolutely loved it. He is not too tech savvy and he had zero issues utilizing it and set up was a breeze!", "verified": true, "helpfulness": "0/0", "author": "Bethany"}, {"rating": 5.0, "review": "F'ING ROCKS!!!!  So this is my second  streaming media box, first was the NEO TV.  This Amazon Fire is awesome,  they have really outdone themselves with this one.  The processor that they are using is quick, no lag between what you ask it to do and what it does.  When you leave a show it goes immediately to the menu, fastforward is actually that, fast and forward.Simple straightforward controller allows you to navigate quickly and it has voice recognition.  This isn't like Siri,  when you ask it something it hears you loud and clear.  I haven't had to repeat myself yet and I don't think I will have to with this Fire TV.  Simple set up for those technologically declined people out there should have you watching TV within minutes....no joke.  Combine this media box with Amazon Prime and you get free movies and TV for just 100 dollars a year,  feels like your stealing from the cable companies finally.  I have never written this much in a review.....that is how good Fire TV is.", "verified": true, "helpfulness": "1/2", "author": "Bombnes"}, {"rating": 3.0, "review": "Good but some of the shows I thought I might want only come on DVD.", "verified": true, "helpfulness": "0/0", "author": "David B. Wilson"}, {"rating": 5.0, "review": "I love the small simple remote. Not too many buttons. Speaking to the remote is a cool feature. It's easy to navigate the apps.", "verified": true, "helpfulness": "0/0", "author": "kAsharie"}, {"rating": 5.0, "review": "Wow.  Love this! No more watching on my computer. Easy to set up, easy to use. Even the voice command works!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "It's Amazon amazing. What more need I say?", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "we got this for our family room so many programs to watch better then buying another dvd player .", "verified": true, "helpfulness": "0/0", "author": "cindy king"}]