[{"rating": 4.0, "review": "Works extremely well, much better than using the Wii. It would be 5 stars if the movie selection was better.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great product, fast, convenient, voice recognition works well, only couple negatives . Bluetooth for headsets is needed , but the main gripe for me is , voice search does NOT work with youtube, netflix!", "verified": true, "helpfulness": "1/1", "author": "Pythagorus"}, {"rating": 5.0, "review": "LOVE  IT!  AM ENJOYING THE MOVIES AND SHWS, WISSH I'D GOTTEN LONG AO....", "verified": true, "helpfulness": "0/1", "author": "mary saggart"}, {"rating": 5.0, "review": "Great TV Box for TV and Movies", "verified": true, "helpfulness": "0/0", "author": "Mike whetstone"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I purchased the fire TV, controller and 3 months of sling TV to replace 100 unwatched cable channels and allow my wife and daughter to play games and run apps that are normally restricted to our kindle fire HDX. I am now returning the fire TV as I have no idea why anyone would want it. My TV already has wireless access built in with apps like Netflix, amazon, youtube, Hulu, etc included. If your TV (or Blu-ray player or your PC is close to your TV) does not do this, that is THE ONLY REASON you would want this. Literally the ONLY thing that this can do over literally any other mobile device or PC is watch sling TV.What about my amazon games? Well, first off, there are currently only 13 games from the amazon library that can be played on the amazon fire. Now let my diverge a tab bit. This is from the Fire TV store page on Amazon:\"Expandable USB storage on Fire TV—Use a connected USB flash drive to expand your Fire TV storage for downloaded apps and games—this enables you to have more games downloaded for easy access.\"This is BARELY true if at all. The base unit comes with around 5-6 gigs of internal hard drive space. You can hook up a USB (which I did, I purchased a 128g 3.0 USB drive for specific use with my Fire TV) though for \"expanded access\". Now, let say my wife wants to play \"A Bard's Tale\", one of the only 13 games playable and ADVERTISED to play on Fire TV; it is a 35 meg download but when you start the game it requires 4 gigs of additional download. The 35 megs can be stored on the flash drive but the 4 gigs must be downloaded every time and then removed to fit say, XCom (another advertised game), or Telltale games Game of Thrones. EVERY. TIME. So even though my kindle fire holds my entire library, my Fire TV cannot hold more than one game and depending on the game (xcom enemy unknown, again, advertised to play on Fire TV) may not even be able to hold that one game. So, for clarity. After I removed everything but the essentials from my Fire TV internal hard drive and I had 119 gigs of free space on my flash drive, I could not play one of the only 13 games advertised to be played on Fire TV.In conclusion. I spent $150 and $20 a month to watch 3 channels that I couldnt get from a half dozen other sources. If this sounds like what you are looking for, more power to you. For me I will just run an hdmi between my TV and PC and do everything the fire TV does times, I dont know, a thousand, for no extra cost than what I am already paying for internet.", "verified": true, "helpfulness": "2/4", "author": "Chris Crawford"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "kgamar"}, {"rating": 3.0, "review": "It was EZ to set up and beautifully packaged but it's a frustration:  1.) Amazon prime does not have the programming I'd hoped.  Will need to get netflix.  2.) Voice search does not work in netflix app and so far we have not found our streaming queue.  3.) there seems to be no way to turn off one-click, we really do not want to buy anything via this box,  4.) when we drop prime am sure most of the functionality will still be forced on us and we'd really just like to use this to stream netflix and maybe youtube if we can figure out how.We wanted a generic appliance, feels like we paid for an amazon marketing tool.  Am not that happy with the fire TV functionality but Netflix streaming seems decent.  We got the high Rez, don't know if that is needed either but feels like we've spent enough time on this.", "verified": true, "helpfulness": "3/3", "author": "FiveFlavors"}, {"rating": 4.0, "review": "Device works as advertised and will go a long way towards \"cutting the cord\" from my cable company.  My only problem seems to be the way the remote is implemented (bluetooth?), as I worked a long time to get rid of all the unique remotes for DVD, AV reciever, TV etc etc and program a Harmony remote for all devices.  Apparently, you cannot add the FireTV remote functions to the Harmony (at least my model?) as it needs regular IR remote.  So... I am back to switching remotes back and forth, even for volume control when using the Fire remote", "verified": true, "helpfulness": "0/0", "author": "stanje"}, {"rating": 5.0, "review": "Works well,  easy lookup with voice search.", "verified": true, "helpfulness": "0/0", "author": "James Haskell II"}]