[{"rating": 1.0, "review": "What crap!  It will not work Netflix, Most everything on Amazon Prime requires you to purchase it (As if the $100 you pay for Prime, and $100 for the Fire box) it's still $8.00 for most movies.  I tried customer service, but they won't contact us....  This hunk of crap is going back in the morning....  I feel violated by Amazon...", "verified": true, "helpfulness": "5/16", "author": "Christopher Brock \"C Brock\""}, {"rating": 3.0, "review": "The box is lovely and easy to use, easy to set up. I agree with all the other glowing comments about the box itself. But searching for Prime movies and tv is very difficult. For the highly rated tv shows, they give you a come-on with an introduction or even the first episode for free, then charge quite a bit for additional episodes. It feels like bait and switch! I have to look up things I want to watch on the computer, then see if they're going to charge me for it. Not what I expected. Very disappointed in this aspect.", "verified": true, "helpfulness": "2/6", "author": "Judith Frost"}, {"rating": 5.0, "review": "Great product. Easy installation.", "verified": true, "helpfulness": "1/2", "author": "Melvin Richter"}, {"rating": 4.0, "review": "Haven't had time to full use everything but believe I am going to be satisfied.", "verified": true, "helpfulness": "0/1", "author": "Dietzy"}, {"rating": 3.0, "review": "A bit miss leading, if I did not have netflix and a few cable channels already then I would have to pay to watch anything. Still it's pretty cool", "verified": true, "helpfulness": "0/4", "author": "jerome grace"}, {"rating": 5.0, "review": "Great investment and I have no regrets.  I bought 3 for each tv.  There is plenty of free stuff and if you're a Prime member, it's definitely worth it.  Combine the box with Netflix and you won't miss cable after a while.", "verified": true, "helpfulness": "2/2", "author": "Dr. Williams"}, {"rating": 5.0, "review": "So easy to install. So little!  Love it!", "verified": true, "helpfulness": "1/1", "author": "Patricia Happy"}, {"rating": 3.0, "review": "Very solid streaming device with a nice interface. Limited as a media player tho.", "verified": true, "helpfulness": "0/0", "author": "Gene Janke"}, {"rating": 5.0, "review": "Great Product ,as described, Great Price, Fast Shipping, Great Seller=Happy Customer. Thank You.", "verified": true, "helpfulness": "1/1", "author": "Charles  S"}, {"rating": 1.0, "review": "Sorry about that, but I bought this player online and my friend brought to me in Brazil. So, here this device doesn't work. I didn't make netflix works because de device ask me for the password and when I do this, I have an error message: an error unexpected occurred. I hope the Amazon come to a software's new version with Brazilian support.", "verified": true, "helpfulness": "1/9", "author": "Eduardo Alves Cabral"}]