[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Perry C Petersen"}, {"rating": 4.0, "review": "here is what i think about this device: i have not tried it out yet, yet i wish that amazon would update this device as well as the fire tablets and controllersfor different reasons:1) its so that it can be easier to search across the different catagories for both typing and voice searchas well as make it easier to voice search and type in apps such as hulu, netflix ,and other apps2) you should have a voice assistant for not just the fire remote, but also on ur fire tablet as well, much like how they do with google's google now, where if u can voice search and it will tell u what ur looking ,maybe like have alexa from the echo show up on the fire tablet in such a way to aid in searches much like google now, like u would have way more knowledge from imdb, but it can explain a lot of knowledge about each movie or tv show, like where the movie or tv show was filmed ,location wise,3) a movie and tv suggestion guide where it will show all of the movies that amazon has across prime, for pay, as well as apps such as hulu and netflix4) more games of course5) easier access to audible on both fire tv and fire tablets (and that there should be a prime style to audible where u can listen to both the subscribed books u listen to ,and the purchased books)", "verified": false, "helpfulness": "0/0", "author": "Aaron Johnson"}, {"rating": 4.0, "review": "Overall happy. My major drawback is the sorting capabilities of Prime free categories. I'm more hooked on KODI/TVMC because of search and save. You have to spend more time browsing for what you want on Fire instead of being able to drill down on genres, etc. like other platforms.Don't get me wrong, glad I got this since I was a Prime member anyway. Probably the best unit on the market as far as it's build.Voice search is great if you already know what you want. Works like a charm.", "verified": true, "helpfulness": "0/0", "author": "waterworks"}, {"rating": 3.0, "review": "I have a apple tv and a fire tv boxIf only the amazon tv would let you keep the icons you wanted to use on the main screen I would give it 5 stars over the apple tv box * the remote on the amazon fire tv is awsome compaired to the apple and you can order HBO - go and Sling tv thru amazon unlike the apple box and that's a plus * but the apple box allows you to hide icons you don't use to keep them from cluttering up your main screenStill would reconmend the fire tv over the roku and the apple even with all its short commings", "verified": true, "helpfulness": "0/0", "author": "jeb"}, {"rating": 4.0, "review": "I love how easy it is to use. How well it sets itself. I would like it to  show more newer movies. And I would like it to add new movies weekly.", "verified": true, "helpfulness": "0/0", "author": "Gilda Faciane"}, {"rating": 1.0, "review": "This is just another way to milk money from you.  Everything on this requires a purchase.  Why would you want to pay for something so you could spend more money on it?  I just can't figure out how to return the blasted thing", "verified": true, "helpfulness": "0/3", "author": "Ron Lear"}, {"rating": 5.0, "review": "Very nice - good Wifi Signal too, better than my Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Doogan"}, {"rating": 4.0, "review": "Pretty good media player.", "verified": true, "helpfulness": "0/0", "author": "Josh Braun"}, {"rating": 5.0, "review": "Extremely easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Fran P."}, {"rating": 5.0, "review": "This Fire TV box is the best, hands down.  So good, I own 2 of these and bought 2 more for my family.  Super fast performance with it's quad core processor and 2 GB of RAM.This Fire TV is way better than Google Chromecast or Roku, and also better than the smaller Fire TV stick.  It's roughly 2-3X the price of the smaller Fire TV stick, but the performance is a lot better and worth it in my opinion.  If you are an Amazon Prime customer, this box is perfect for you.  You'll have access to all the Amazon movies, TV shows, and music.  You can also view your photos that are uploaded to the Amazon Cloud.  If you're into games, there is a whole library of games to choose from, some are free, some are paid.This is an Android box so you can also side load apps without rooting it which is awesome.  There are lots of articles online on how to side load apps.We use this Fire TV box every day after we cut the cable tv cord.  We also use it a lot for viewing photos we take with our phones and uploaded to Amazon's cloud.  Highly recommend this box to anyone.  Best TV box on the market", "verified": false, "helpfulness": "1/1", "author": "TechFanReviews"}]