[{"rating": 5.0, "review": "My Roku 3 has been getting less responsive to the remote when watching Netflix. Since the other apps worked fine, I don't think there is anything wrong with my Roku 3 remote. I have watched quite a bit of Netflix, but recently I have been watching more Amazon Prime programming because they have some good TV programming not available on Netflix.Since my Roku 3 has been acting up and I now watch more Amazon Prime, I decided to give Fire TV a try. It was beautifully packaged upon arrival. It was easy to setup and I was on my way to watching Netflix and Amazon Prime. I knew it could play games when I ordered it but I didn't give it much thought at the time of ordering. I was expecting it to be like my Roku 3 with respect to games. I was very mistaken. The Amazon Fire TV is every bit as good as my iPad 3 is when it comes to games. Asphalt 8 plays very smooth and so do the other games I tried. I ordered the controller and like it as well.As noted in my title, there are 2 drawbacks. First, the device only has 8 GB of storage. As a result, I ran out of memory after downloading 3 very large graphic intensive games. It's not a deal breaker because I can temporarily remove the games from the device and store them in the cloud, but it does require a few minutes to download them again. Second, the voice recognition has limited use in my opinion because it refers to Amazon content. I would like it to work in other apps, especially YouTube.Overall I am extremely happy with my purchase and at $99 plus $39 for the controller, it is reasonably priced given the available alternatives.", "verified": true, "helpfulness": "2/2", "author": "S. Simon"}, {"rating": 2.0, "review": "Our blue ray seems to stream better than the Fire.  I am hoping that the buffering system gets better, but extremely annoying when the sound continues just fine and the visuals are frozen in time.  Eventually it all gets synched back up.  Worse is running two movies at once. With the blue ray it was fine. With the Fire it barely works. I am trying a second unit to see if it is better. The jury is still out on that.", "verified": true, "helpfulness": "3/4", "author": "Kari A Saccomanno"}, {"rating": 5.0, "review": "We are so glad we purchased this.  We don't do cable tv anymore!! (on purpose.)  I like the idea of  \"choice of programming.\"  if and when I want to watch news I can watch it!", "verified": true, "helpfulness": "2/3", "author": "Lady G JonWi \"G Jon Wi\""}, {"rating": 4.0, "review": "I develop Internet TV applications, so I ordered a FireTV the day it was announced.Just unpacking the unit was an amazing experience.  Very well thought out and gave you a real sense of satisfaction for buying one.The unit is a solid  low profile device that easily disappears into the background.  I always found the Roku 3 to be in your field of vision, but with the Fire you forget that it's even there.  Big bonus points there.As expected, the video is very tight with good colors and clarity when playing digital media.Then the bad... the interface is horrible.  It's laggy and the apps look very outdated.  The Netflix app is sluggish and is missing the beautiful interface available on the Roku 3.  Thankfully this is software and I'm sure Amazon will up their game wth future updates.If you don't have a Roku/Chromecast/Apple TV already, this is still a good buy if you have an Amazon Prime membership already.", "verified": true, "helpfulness": "2/3", "author": "Justin Long"}, {"rating": 5.0, "review": "I've been a prime member for several years and use the benefits monthly. I purchased Fire TV for a non-Internet HD TV that only gets over-the-air stations, unlike the rest of the house. Setup was simple and quick for a tiny device. The software has similar choices to our Internet Sony HD TV but is much faster. This little device has zero buffering using WiFi. When watching a series, it flows neatly into the next episode, unlike the Amazon software on the Sony TVs. We've been using the Fire TV for a few weeks and still trying out some of the channels. I like the way you can go to the Prime section then break it down by category - a major feature upgrade over the last five years. My only gripe is not fully understanding how the music stations work. A nice surprise was the voice search feature that really works. It has some beautiful images for a screensaver.", "verified": true, "helpfulness": "1/1", "author": "Carbuck"}, {"rating": 5.0, "review": "I already had Chromecast for my TV, so I hesitated on buying this, since it's quite a bit more expensive. The deciding factor for me was the fact that I could stream Amazon videos, along with Netflix. The Chromecast does not stream Amazon. Setting up the Amazon Fire TV was a cinch, done in 5 minutes. The most difficult thing was figuring out how to open the remote to install the batteries, which didn't take more than 5 minutes. The setup was simple and done in a couple of minutes. It has worked smoothly since the first minute. I've had problems off and on with the Chromecast. The neatest thing about the Amazon Fire TV is that I don't have to stream through my laptop, as I do with the Chrome, therefore there are no loading delays.As always with Amazon, the packaging is excellent...classy! The little remote is well designed, and works beautifully. There is even the capability of using the remote to search by speaking a movie name, an actor's name or some other search category.Between the two, the Amazon Fire TV is worth the money and I'm very glad I got it!", "verified": true, "helpfulness": "2/3", "author": "PattiLovesAmazon \"believer\""}, {"rating": 4.0, "review": "The units are sold at a loss to pick up revenue in the subscriptions. So as a 'low cost' unit at $99 is a small misnomer, as you will need to pay for the service to utalise it fully. That is unless you sideload XBMC, which is what i've done, hence more stars.", "verified": true, "helpfulness": "0/3", "author": "Arrgatae"}, {"rating": 5.0, "review": "This is very easy to use and has a large list of movies and TV shows.  The voice recognition feature is superb.  I just ordered the game controller and looking forward to playing games without needing to put discs in a game system.", "verified": true, "helpfulness": "0/1", "author": "Randy Johnson"}, {"rating": 5.0, "review": "This thing works just like advertised.  Setup was quick and easy.  I'm still learning the features, but so far, so good.  Don't hesitate to purchase.", "verified": true, "helpfulness": "0/1", "author": "collier87"}, {"rating": 4.0, "review": "I love it. I think it should have more memory and better up dated movies for prime free movies but over all I like it.", "verified": true, "helpfulness": "0/0", "author": "Tonya Gill"}]