[{"rating": 4.0, "review": "I just got my Fire TV yesterday and here are my initial impressions:Setup was quick and very easy. Make sure you have, or purchase, and HDMI cable, as one is not included.The voice search works well for English titles. I tried searching for several international films with voice and it didn't work. The text search worked well and found just what I wanted. The voice search only seems to look up Amazon content, not NetFlix, for example.The app library is fairly small for apps you might want. HBO Go is coming later this year, which is good. Hopefully Starz Play will join the lineup soon, as it is on other Amazon devices. In a glaring omission, Amazon MP3 is absent.I watched content from NetFlix and Amazon Prime. Contrary to one of the other reviews, I found Prime content easy to find, but it could be easier. In the movie category, there is a Prime section. Ideally, there would be a Prime top (side) menu.Overall I gave it 4 stars. Voice search needs to work on all apps to find content. And more content providers would be good.Update 5/28/2014According to this [..] press release, Amazon MP3 is joining Amazon TV. There will be a Prime top menu as well. Voice search is expanding to Showtime, and several other apps (sadly, not NetFlix yet). No word on HBO Go or Starz Play for the Fire TV, but I know HBO Go is coming (according to this article: [...]) and expect Starz Play to come too (since it is on the Fire Tablets already).I bought this for my non-techie GF and she is loving it. One of her favorite features is the multitasking, where she streams Pandora, and it still plays while she is looking for a movie to watch (although opening Netflix breaks the stream, as it is a different app).", "verified": true, "helpfulness": "0/0", "author": "Kenneth Katz"}, {"rating": 5.0, "review": "This works great and is very easy to use works like the tv commerical says it does thank y ou very much", "verified": true, "helpfulness": "0/0", "author": "rick adams"}, {"rating": 5.0, "review": "Got this for my. Mom and she loves it!!  Best investment we have made in awhile. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "cierra moore"}, {"rating": 3.0, "review": "The Amazon Fire TV unit it well built.  You can tell it is good quality.  However, to tell you the truth the voice control does not beat out the other customary controls and back ground visuals that the other streamer units have.For the price, I paid for the quality of the unit's manufacturing and possibly the voice control.  Although, I will not pick this unit for a second streamer in the house.I only write this because I truly enjoy Amazon and I give you the benefit of the doubt it would be a superior unit to what was on the market.  This is the only reason I am filling out this form.  I believe Amazon cares about its feedback and its customers.Issues.1.  You can't tell where you've been in a series or where you want to go.2.  Game controller is not user friendly3.  Sometimes automation's anticipation is bad judgment.We plan on keeping our Fire however and continue with Amazon its not a deal breaker.  However, it is now 1 of 3 things we cautiously will purchase.1.  Perfumes2.  Large items requiring shipment to Hawaii3.  New products by Amazon (caution not refusal) .V/R John C Veverka", "verified": true, "helpfulness": "0/2", "author": "jcv: a great product especially the display"}, {"rating": 5.0, "review": "Voice search is a plus. You can search movies or actors ect.... Just said I need to add more words but I think it just really done. You can't go wrong with this.", "verified": true, "helpfulness": "0/0", "author": "rick starkloff"}, {"rating": 2.0, "review": "Actually, I would give it a 4.5. However, there are two glaringly annoying problems that should easy to fix in a patch. The first is the lack of a screen saver while watching Netflix (and probably other apps). The second is a little more technical. When going from paused to play and at other times, it chirps my speakers pretty hard. This caused in some way by going from stereo mode (e.g paused) to Dolby (e.g. play). I think if it would stay one mode (i.e. the user set mode) always, the problem would go away. I'm using the optical output to my receiver.Hopefully the developers read this.", "verified": true, "helpfulness": "0/1", "author": "JKP \"JKP\""}, {"rating": 5.0, "review": "Works right out of the box no complicated setup, plug and play setup,, easy to use and the voice command actually works, I love this thing.", "verified": true, "helpfulness": "0/0", "author": "MZ 98046"}, {"rating": 2.0, "review": "Can't believe nothing works on charter subscription. So now I have to continue to use my iPad for watchespn . When this firetv was the reason I bought it.", "verified": true, "helpfulness": "0/5", "author": "Harry Hood"}, {"rating": 3.0, "review": "While it promises TV; its the older, inane shows that are a waste of time; movie selection seems to be a little better than Netflix.  ESPN is not \"real.\" Very disappointed in that b/c I bought it for my dad, and the only sport he watches in NASCAR, and he couldn't watch the races. It was all interviews. HULU is a waste of time;  Pandora is on there, so that's nice.  I ended up subscribing to cable TV for him, so Fire didn't meet the need I was hoping for.  If I had known all this, I wouldn't have purchased it.", "verified": true, "helpfulness": "2/7", "author": "Karen S. Salina \"ks001\""}, {"rating": 5.0, "review": "Debated between Mac TV and Fire. having Prime membership offering me over 45k movies and shows. plus the ability to rent or buy film made this purchase a no-brainer. Think of buying on for the TV in the den. Making me rethink my cable programing.", "verified": true, "helpfulness": "0/0", "author": "larrence"}]