[{"rating": 5.0, "review": "This thing is fast, smooth and top notch. I stream all kinds of videos from netflix and its 1080p. Works like a charm..love the design and the remote control w/voice is awesome. System itself is heavy and doesnt feel cheap.Thank u Amazon.", "verified": true, "helpfulness": "0/0", "author": "nick talalele"}, {"rating": 5.0, "review": "I have used Amazon Fire TV only once. The time I used confirmed it was easy to use and quality was fantastic!", "verified": true, "helpfulness": "0/1", "author": "Ernie S"}, {"rating": 2.0, "review": "I am returning my Amazon Fire TV, I thought it would be great, but when watching netflix the quality is poor.I have to use my dvd player or Roku to watch netflix.the netflix app in Fire is terrible, very pixelated.", "verified": false, "helpfulness": "5/7", "author": "Bob Torrez"}, {"rating": 3.0, "review": "The Fire TV is good, but unfortunately, it's not great. There are several other reviews that go over the features, so I won't belabor those points. However, I do want to make a few observations and offer my own subjective experience with it. For reference, I use Roku 3, Roku 2, AppleTV, and a Mac Mini regularly. The great news is that you no longer need a Mac Mini to get great HTPC features, so we consumers are already posting a win. Nowadays, a sub $100 box does stuff that cost me $800 a few years ago.1. The box itself is sleek and the remote control feels nice. Easy setup.2. Image quality: Very bright, but feels \"over-sharpened\". It looks a little artificial. Over several weeks, I've gotten used to it and it doesn't glare quite as much at me anymore, but I still prefer the image created by the Roku 3 and AppleTV. I don't know if this is a decoding issue that can be fixed with software update or if it'sa hardware decoder issue that is fixed. Again, this is subjective. Some people may like it -- just like some people like \"bass\" in their earphones, or prefer the \"Vivid\" setting on their TV.3. Remote Control: Feels good, looks good, but Amazon put all the work into the voice feature and didn't add \"skip back / replay\" button which is annoying. I read somewhere today that you can double tap the rewind button for that. I haven't tried it, but it's seems a little annoying to me even if it works like that. Except the directional circle and the center OK button, the remote doesn't feel intuitive to me.4. Performance: This is where I hoped that this box would excel since it has a quad-core processor, etc. But using PLEX and some MKV files, it has actually choked on a few of my files! I put this box head to head with the Roku 3, using wired ethernet and wireless ethernet. On a few movies, the Fire TV would stop and stutter, whereas the Roku 3 played them just fine. The box is faster with menus, but on actual playback performance, it was actually worse in some cases.5. Interface: Basically, clunky and cumbersome navigation. Also, it feels like the interface was designed for a 1024px screen and you're viewing on an 800px screen.Clarification:  the reason it appears this way is that there is negative space on the left side and on the top if the screen. Meanwhile the icons bleed off the right side and bottom of the screen, and the icons are cut-off. It's like a web browser was shifted off the screen down and to the right.That may not bother many people, but for me it's visually unpleasing.6. Audio options: Doesn't do DTS, where as the Roku 3 does. With Roku 3, you do need an AV Receiver with HDMI input to get the DTS. If you have an older receiver, you won't get 5.1 surround with Roku 3. The FireTV has an optical out for older receivers. WORTH NOTING: Regarding Dolby Digital Plus, the Amazon comparison chart says that Roku 3 does NOT support DD+. HOWEVER, in my experience, my Roku 3 DOES SUPPORT DD+ via Netflix and presumably other sources.If DTS is important to you, you'll want to get the Roku 3.7. Netflix - interface is not as nice as the one on Roku 3.8. Plex - Plex interface is newer, but not sure I like it better. Even though I keep calibrating the Plex, it never actually works and some part of the left edge of my screen doesn't show an image.8. Moiré effect - Several of the screen saver images produce a moiré effect during the Ken Burns animation (zooming and panning). The images are gorgeous, but as the pan/zoom effect is going on, you can see \"waves\". My guess is that the software or hardware algorithms aren't very good. In either case, by now the technology to pan and zoom is ubiquitous on any platform and this kind of effect should not be happening.Summary: Overall, the Amazon box is a nice addition to what's out there and elevates the game from a hardware standpoint. However, the software leaves much to be desired. Despite the better hardware, I surprisingly experienced performance issues in comparison to identical content on a Roku 3. (Glitchy playback, moiré effect on zoom/pan). Remote control could be more intuitive. Sound options aren't as good. Interface is kludgy.I do not think it is the Game Changer that I hoped it was based on the other review, but I do actually like the box and I'm hopeful that it gets better with software updates. But it is not significantly better or faster than Roku 3 or Apple TV. The menus are faster, it's fun to use something new, but beyond that, the experience with the other boxes is better. Importantly, there's nothing about the box that is bad.Update: My wife likes the interface on FireTV better than the Roku, but I think she is swayed by the gorgeous screensaver :)", "verified": true, "helpfulness": "4/8", "author": "Bhavesh K. Patel"}, {"rating": 2.0, "review": "I bought this because I heard that all you need to do to get rid of high cable fees is get a Hulu Plus membership and Amazon Fire TV. Turns out Hulu doesn't have device streaming rights to most prime time shows, so you either have to watch it on Hulu's website, or go to the channel's website. Now I'm stuck with something I have no use for.Installation was relatively easy, but there are very few supported apps. Except for games, and I didn't get this for games.", "verified": true, "helpfulness": "1/5", "author": "Gaelic Gal"}, {"rating": 1.0, "review": "CAUTION!!!!  Do not buy this product if you want to play your own movies or pictures now or ever in the future.  It does not support this function.  I don't hold it against Amazon for not wanting to let us play our own movies because they make their money from us using their box to generate recurring and purchase revenue.But come on guys!!  If every other box like this plays recorded digital content and yours DOES NOT!!!  Have the decency to put that in the description in big letters...  It's like advertising a car that doesn't have tires.... for people that like to look at their car, but not drive it.I spend 50% of my time watching downloaded movies and the other half watching Amazon and Netflix.  Obviously, this device was never intended for this type of customer.On the positive side, for those of you who have no intention of ever playing a recorded movie (including your children's birthday parties or put up a picture collage), the quality of this product exceeds even Apple's standards.  The design people must be from the future because the designing and machining are the best I've ever seen--on the outside and the inside.If I only wanted a box for streaming media from the internet, I wouldn't hesitate to give this 5 stars..But I gave it 1 because I think someone, somewhere, neglected to add the disclaimer on purpose.", "verified": true, "helpfulness": "4/14", "author": "urufish"}, {"rating": 5.0, "review": "it works good but don't waste yout time with prime it is expensive and you find more movies on netflix", "verified": true, "helpfulness": "1/5", "author": "Robert Tuttle"}, {"rating": 3.0, "review": "I love a lot of the features, but finding the free material (not really free since i pay prime fee's every year) was not easy. It does a great job of driving you to towards shows you would like but finding the ones free on prime is nearly impossible. Same for movies, it has a great selection of movies but distinguishing whats free on prime and which one you want to rent is difficult at best. Also they advertise HBO programs yet they dont have an HBO App... I love the App on tablets but the set top box did not meet my expectations", "verified": true, "helpfulness": "2/4", "author": "Jay Kurzman"}, {"rating": 4.0, "review": "This is a great video, game, and app streamer! Much better than Apple TV (and I'm an Apple guy) because you can not only do all of the same things like stream video and use built in apps, but it basically turns your TV into a large tablet. You can slingshot video from your Kindle Fire HDX to your TV using this device and right back again when you're on the go. It also has a remote, but unlike the Apple TV, the remote has built in voice recognition AND the Amazon Fire TV has gaming controllers available as well! The only drawbacks I can see are two things, it's storage capacity, though it does allow you to save anything you've purchased or downloaded in a cloud format for later use when you want to open up space and has a record of the APPS purchased if you own a kindle to share them between, the other is that most of the games (take NBA 2K14 for example) suffer in graphics quality on your TV because they are APP grade quality and on a big screen you can definitely tell the difference between the console (PS3 or PS4, XBOX 360 or XBOX ONE) and APP versions. So those are the two reasons why I had to go with only 4 stars instead of the coveted 5. Maybe better game programming and patches can fix this later. Overall though it is the only streaming video device I will own. I have since sold my APPLE TV.", "verified": true, "helpfulness": "0/0", "author": "Timothy Bradford"}, {"rating": 3.0, "review": "I bought this to replace a Roku 2.Pros:- Very nice design and the remote feels solid in hand.- Ease of use- Image qualityCons:- Lighting fluctuates while watching Prime shows- No HBO GO- Showtime Anytime does not include DirecTV- Locked down USB port means that you can't play any local media (something the Roku 2 can do)- No clear definition of \"Prime Included\" library so it makes it difficult to find.All in all, it seems to me that Amazon jumped the gun on releasing this product before they had key deals in place that would make this a true contender.I LOVE Amazon and will continue to support them with my Prime membership but this only reminds me why I skipped buying the Kindle Fire Tablet.", "verified": true, "helpfulness": "1/2", "author": "El Pato"}]