[{"rating": 4.0, "review": "I have watched two movies so far. It lives up to it's reputation.", "verified": true, "helpfulness": "0/1", "author": "craig moore"}, {"rating": 5.0, "review": "It not only met but exceeded my expectations. Fast and easy setup. Great channel selection, movies and if you want HBO and Showtime. I don't regret buying this.", "verified": false, "helpfulness": "0/0", "author": "Rich Karns"}, {"rating": 5.0, "review": "Love the ability to watch the older family shows", "verified": true, "helpfulness": "0/0", "author": "Domenic"}, {"rating": 5.0, "review": "I really like this device, It's fast, and offers a ton of apps.while being small and unobtrusive, it still smokes the competition.The remote is really cool. Voice search! and get this, you don't evenhave to point the remote. It will work holding it backwards.(A senior moment!)Amazon prime members get a lot for the money with free movies, TV shows andsome really nice music. I don't have a Kindle but they offer some really good deals on e-books.I am still new to this, and on a free month trial, but so far I give it five stars.", "verified": true, "helpfulness": "0/1", "author": "Don Smith"}, {"rating": 1.0, "review": "So far it's been a disappointment , I'm still trying to discover the advantages of having it . So far I'm spending an average of about an hour or two a day , I'm hoping to discover something that will improve my disappointing feeling .", "verified": true, "helpfulness": "0/3", "author": "pat phillips"}, {"rating": 4.0, "review": "Amazon Fire TV itself works great.  My only reason for rating it 4 stars is that I would like to see more programs added to the programming, including additional \"channels.\"", "verified": true, "helpfulness": "0/2", "author": "Brandon T. Dehaan"}, {"rating": 5.0, "review": "awesome product all in one!", "verified": true, "helpfulness": "0/1", "author": "Belinda"}, {"rating": 4.0, "review": "I'm nice I got used to it, I like it", "verified": true, "helpfulness": "0/1", "author": "Mollie Granger"}, {"rating": 2.0, "review": "Fire TV didn't have any more features than my smart tv had. I think it could be a good product but needs to evolve more and get more available networks.  Thought I might replace cable TV but soon learned that I couldn't.", "verified": true, "helpfulness": "0/1", "author": "Lance Felton"}, {"rating": 4.0, "review": "very easy to use", "verified": true, "helpfulness": "0/1", "author": "Rosie"}]