[{"rating": 5.0, "review": "I absolutely love the Amazon Fire TV. It was super easy to setup and start watching movies right away. Now everyone at my house can enjoy their favorite tv shows and movies. I love how when watching a tv series then it automatically goes to the next episode. When I had my kindle hooked up to the tv you had to get up between each to start the next, however with the Fire TV you can stay seated the whole time. I have already recommended this to family and friends. I'm completely satisfied like I have been with my other Amazon products.", "verified": true, "helpfulness": "1/1", "author": "Amber"}, {"rating": 4.0, "review": "Great except we've had trouble with obtaining videos are various times. Usually, no problem accessing them", "verified": true, "helpfulness": "0/0", "author": "Christina k"}, {"rating": 4.0, "review": "The setup for this is extremely easy. If you are a prime member you have access to a large library of old and new movies. The Amazon produced shows are a mixed bag but most people would like at least some of them. The only two negatives involve the remote. You must use the supplied remote you can not run it with a harmony or other multi function remote. The other issue is the remote is very sensitive so if something brushes it the unit turns on which then interrupts cable or whatever else you may be watching.Overall I would recommend this to any prime member as the wealth of free content is well worth the one time purchase price.", "verified": true, "helpfulness": "0/0", "author": "Thomas G. Cummings"}, {"rating": 5.0, "review": "Great device fast", "verified": true, "helpfulness": "1/1", "author": "paul"}, {"rating": 5.0, "review": "Very good quality, and fast!", "verified": true, "helpfulness": "0/0", "author": "Maximilian \"Digital Painter\""}, {"rating": 5.0, "review": "I LOVE Amazon TV.  It is so easy to hook up and start using. It is small and sleek so it fits in so easily around the TV. I am sooooo happy with this purchase!!!", "verified": true, "helpfulness": "1/1", "author": "Plastics Chick"}, {"rating": 5.0, "review": "Awesome !!!! No lag and picture perfect quality. I highly recommend this unit !", "verified": true, "helpfulness": "1/1", "author": "Michael S. \"Mike\""}, {"rating": 3.0, "review": "It is a very average product... It is somewhat difficult to figure out how to use it.", "verified": true, "helpfulness": "0/0", "author": "Ryan Miller"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Mandy Hammonds"}, {"rating": 5.0, "review": "It makes available some of the Best entertainment available incredible cost. It is reliable, consistent and very priceeffective", "verified": true, "helpfulness": "12/12", "author": "tom"}]