[{"rating": 5.0, "review": "I'm convinced most of the negative reviews are from people who are deliberately trying to give the Fire TV a bad rap. Maybe they are Roku and/or Chrome fanboys. I own a Roku 3 and I like it too, but the Fire is great as well. Just cut the cable this week, but I bought a Roku 3 a couple of months ago to see how being without cable was going to be like. I'm keeping the Roku on the bedroom TV. This Fire is on the main TV. They both have their good and bad points and I'm not going to restate all the Fire's good and bad attributes as those already have been stated by \"competent\" reviewers.A few things I really like about the Fire are the Optical audio out port and the remote. Love the ability to speak instead of fingering through a TV keyboard. I've tried a few of the games using the remote and really found the ones compatible with the remote to be excellent. You can also get a game controller for the more sophisticated games. The remote is small (and all black) and could be easily misplaced in a couch cushion or somewhere. Maybe someone will eventually sell a holder to make it a little larger. Not sure why they didn't give an option to turn off the unit. I know it uses very little power but some folks may have issues with the white LED in their bedroom. At least a menu option to turn off would be nice.As soon as I installed mine, it downloaded a software update and once the system booted again, my Amazon account was already setup (not sure how that happened...anyone know? The packaging of the device was very impressive by the way.If you have a Roku, get the Fire too. If you have neither, then it may be a difficult decision, but if I had to decide, it would probably be the Fire.", "verified": true, "helpfulness": "3/3", "author": "GWT"}, {"rating": 5.0, "review": "The setup is easy, picture and sound quality are excellent, no lock-ups thus far and the unit is very responsive. Plus your Amazon.com account is pre-loaded just like a Kindle. Two thumbs-up!", "verified": true, "helpfulness": "2/2", "author": "Bill"}, {"rating": 4.0, "review": "I admit that I'm a die hard Apple fan and am heavily invested in their ecosystem.  That said, I also have a Prime membership and do most all of my online shopping on Amazon.  Wasn't convinced I was going to grab the fireTV, but my inner nerd got the best of me and I received it today.Overall, I honestly don't see much wrong with the box.  Had it connected and setup in less than 5 minutes and waited for the software update to download and install.  I did not see any significant difference in the update/installation speed when compared to my Apple TV - seemed about the same.  Would have probably expected it to be a little quicker in light of the fact that it has better CPU - but wasn't really an issue.The Voice Search is pretty cool.  Didn't have any issues understanding what I was asking for and delivering the appropriate results.  As it may have been stated in other reviews, I'm only seeing results within the Amazon ecosystem - I'm not getting any options within Netflix or Hulu for example.  It may just be the limited searches I'm doing and if I find it does search across apps, I'll update this review accordingly.My biggest complaint about the fireTV is with the interfaces for Netflix and Hulu.  I admit I'm very used to the interfaces on the Apple TV - so it may be something that I'll get used to as I use the device more.  Honestly, though, I believe I'll probably stick with the Apple TV for these services - it's what I'm used to and what I prefer.I haven't done anything with the games as of yet, but don't anticipate I'll be doing much gaming with it.For me, with the investment that I have in the Apple ecosystem, the Apple TV will continue to be the device I'll use primarily.  I will absolutely use the fireTV for the Prime content that comes with my membership.  When and if the Apple TV gets an Amazon app, I'll likely switch back to that for all my viewing and the fireTV will move to a guest room or maybe my office.If you don't have an investment in iTunes content (and have a Prime account) the fireTV is definitely worth a look.", "verified": true, "helpfulness": "1/1", "author": "1970KT \"kjt34\""}, {"rating": 5.0, "review": "First of all, I have owned every model Roku. So I have a certain level of expectation for another box at that price point.You've likely seen several other reviews so this is going to focus on 1 or 2 things. Audio and Video quality.Wifi connectivity. On par with Roku 3Remote Control: surpasses Roku 3 for text entry, and general control. Does not act as a motion sensing game controller however.Voice Control: my 2 year old can now bring up your favorite cartoons. fantastic.Video Quality: Amazon Prime is beautifulAudio Quality: Amazon Prime 5.1 surround works as designedWifi controller is not IR. Still trying to confirm if a Harmony remote can be adapted to use this so I dont have to use multiple remotes.Speed: I am amazed at how fast this loads and resumes movies and appsOn the other hand: No DLNA option yetPlex: What happened? Pixelation and lacking surround sound? This is an ANDROID APP after all.My Roku plays my Plex media at 5.1 surround sound. After 2 hours of wrestling with the Amazon Fire TV Box (AFTB) I cannot get it to playback 5.1 audio for media recorded at 1080P, dolby digital, 5.1 surround (AC3 5.1).Because I have an extensive digital library, this is a potential dealbreaker for my main home theatre until this is remedied by Plex.The device is amazing to be certain and Plex should not be a dealbreaker for most folks but if you're counting on having fantastic video/audio for your personal library, you may have to hold off until Plex fixes their app, or opt for another device such as the Roku.Aside from those caveats, there is no reason to not pick this up. It is really top notch.", "verified": true, "helpfulness": "9/9", "author": "digitalicecream"}, {"rating": 4.0, "review": "It seems to work fine but as far as I can tell there is no way to turn the thing off...that is seriously irritating.This is an unneeded device in a flooded market - Apple TV, Roku and half a dozen lesser known not to mention that just about every gaming console does everything it does and more.I need to make one thing clear though...if I did not have all the devices that I currently have hooked up to my main TV then this would be my choice for a streaming device. With what I do have, this just does not offer me anything new that I would actually use. This is perfect for someone who has Internet but does not have either a PC or newer gaming console attached to their main TV. I am definitely looking forward to future updates to this product!Last night I loaded PLEX on my Fire TV and once you tweak the settings...it is awesome! Starting to really love this box although I still don't need it. Hmmm maybe I should ditch a few of the devices I have to make it more useful....nahh - won't work as I need most of what I have attached and really would never use in another room. Arrghhh - I love it but don't have much use for it.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer \"Annie K\""}, {"rating": 1.0, "review": "Out of the box mine updated and setup fine. - No ProblemsMy biggest complaint is that Voice Search only searches Amazon and a very few things from HuluPlus...  Should search ALL content from at least the Big 3 (Netflix, AmazonPrime & HuluPlus)Had some picture glitches on HuluPlus & Netflix.  I switched over to my Roku3 on the same content and worked just fine...I didn't like the Menus...  Not as easy as Roku...Netflix looks and works WAY BETTER on Roku3...I think this might become a player in the market that Roku owns...  Maybe...  But has too many problems for me to bet on that at full price...  I might buy one later when they go on sale and the software's been tweaked... Along with more channels added...Considering you can buy a Roku 3 for the same money or less, with a HUGE list of public & private channels, also search that really works...  The Fire TV is, at this point, a very bad choice...  Don't pay them list price to be a Fire TV Beta Tester...", "verified": true, "helpfulness": "267/306", "author": "Zonker \"zonker2\""}, {"rating": 5.0, "review": "UPS Dropped this off today and within 20 minutes I had it up and running. Worse problem was me figuring out which of the inputs it was on LOL.  Plugged it in, put batteries in the remote and it instantly welcomed me and downloaded an update which took all of 2 minutes.  I Browsed around for a bit and then added our account info for Netflix and Pandora. I could instantly see our Netflix queue and also search Netflix and add movies (can't do that with my Netflix enabled TV)  We tried the voice control and that worked well too!  Tried a few movies (just tested out a minute or two) and they loaded super fast - no lag time at all!  We probably won't do the games, hubby will do a few of the sports channels I'm sure.  I tried to do Showtime on demand but we are Dish Network Customers and that service isn't available as an App for the FireTv.  I did see many local cable companies on there, just not ours.  I think this is going to be an awesome addition to our Media Room and I'm sure we will watching more of Amazon Prime and Netflix (we were paying for it, just not using it for all the steps we had to go thru)  It truly is super simple and money well spent.  I realize this unit is only a few hours old - if anything changes I will come back and adjust the rating but right now, 5 solid stars!", "verified": true, "helpfulness": "3/3", "author": "KeeWester"}, {"rating": 5.0, "review": "Excellent product.Wow its perfect! I can watch my favorite shows, movies, music all in just one! Excellent product! I loved it", "verified": true, "helpfulness": "3/3", "author": "Victor Dadashev"}, {"rating": 4.0, "review": "It was trivial to hook up and is working great. But!!!!  They made one change between the fire tablets and this with regard to prime movies. There's no green bar that signifies free prime movie or tv.  It gives the impression (because of what we are used to) the only choice is to purchase. However, if you only select the movie or tv show that is prime and hit play you are good to go. DO NOT SELECT from buttons below.", "verified": true, "helpfulness": "9/10", "author": "Mark Hintze"}, {"rating": 4.0, "review": "I find some of these review bizzarre, but here goes:I am a current Chromecast user.  I find the casting to be slow and both iphone and ipad have kinks in their usage with Netflix.Setup was simple and straightforward. The 'long video' is actually short and helpful.Connection to wireless a breeze.There was an update as soon as it started up, but didn't take more than 5 minutes to get all loaded and ready to go.Got logged into Netflix no problem, though haven't used.The voice control isn't working for me, not sure why, but it's hardly a deal-killer. I'm sure I'll get it figured out.I don't game.  I do watch a lot of movies, and I enjoy the occasional binge-TV.  So far, so good.I'm thinking this is pretty much just awesome.  4 stars only so far, since I haven't really used it much, but will update my review after the weekend.", "verified": true, "helpfulness": "3/3", "author": "Claudia"}]