[{"rating": 5.0, "review": "I love this!! I bought it because I've been forced to watch my amazon movies on my small laptop and when I saw this I knew I had to get it and It is wonderful. However I think they should consider having a option available for you to be able to search your Watchlist for Prime Movies and TV Shows otherwise I love this!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "WOW... Greatest thing since sliced bread. I absolutely love it. I'm glad I'm not married.. I know it would cause problems.. Lol", "verified": true, "helpfulness": "1/1", "author": "david carnes"}, {"rating": 5.0, "review": "I needed another way to access Amazon Prime, Hulu and Netflix in my home theater room.  In the family room I was using Roku and as pretty happy with it.  However I thought I would try the Amazon Fire TV due to my experience with the Kindle and how often I use the Amazon Prime Video features.  It works great and is easy to use.  The setup was simple and works very well.", "verified": true, "helpfulness": "3/3", "author": "R. Kakarala \"RKBuckeye\""}, {"rating": 5.0, "review": "I've long wanted a wireless streaming device, but didn't want the expense of all the bells and whistles I knew I'd never use.  I don't need an Xbox - I don't do gaming, so I'm happy with the choice of not having to pay extra for the gaming feature.  I just wanted something that would stream content to my tv that I could use a remote control with.  I found it!  The picture with the Fire TV is amazingly crisp and clear.  There's no stutter with the stream and it's literally picture perfect.  It was quicker and easier to set up the Fire TV device (which is amazingly small and lightweight) than it was for me to take the back off the remote to insert the batteries.  It's too bad the weather is going to be so lovely this weekend, because I will likely be inside with my new Fire TV.", "verified": true, "helpfulness": "2/2", "author": "D. Parker"}, {"rating": 5.0, "review": "I really really love this!! It works great and streams effortlessly. I recently got rid of all of my cable and with this you have so many other options you don't even miss it. Best buy I have made this year hands down. I would highly recommend this to anyone who is interested - one place for all your streaming services.", "verified": true, "helpfulness": "1/1", "author": "dlissy"}, {"rating": 4.0, "review": "This is a awesome device but with one major issue.  If you do not have a receiver that supports Dolby Digital Plus you will have to settle for stereo sound.  I had a year old RCA and I replaced it with a new Onkyo TX-NR535.  It seems that DD+ is mostly out in the high end devices.", "verified": true, "helpfulness": "0/0", "author": "Frank Askew"}, {"rating": 4.0, "review": "Looking to save some money I dumped my cable and am planning to use over-the-air channels and Fire TV to watch movies and recorded shows. Only complaint I have so far is every show I watch seems to freeze video with audio still going. Not sure if this is a internet issue or something with the box. Would like to hardwire it and see if that fixes it.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "When I saw the Gary Busey ad, I thought it was a gimmick. But it really works! Almost as well as Siri. It does require that you use one of its built-in commands in your request, but it has a LONG list of features and commands. Now I can be where I want to be in seconds rather than minutes with my old Roku settop box.", "verified": true, "helpfulness": "0/0", "author": "davidpsr \"David P McIntosh, Sr.\""}, {"rating": 5.0, "review": "I really enjoy this product highly recommend :-) nice that plays games also music and all kinds of apps 5 stars", "verified": true, "helpfulness": "0/0", "author": "Ricardo Cruz"}, {"rating": 2.0, "review": "It is not user friendly.  If you are on Amazon's app,  a person could end up paying for what they are watching FORGETTING to go to their apps.  The voice thing is kinda cool but not worth the extra money you can save by buying a Roku #3 at $69.00.  Oh and the (Chrome one) is the same as Amazon Fire. Hope this was helpful", "verified": false, "helpfulness": "1/10", "author": "Diana"}]