[{"rating": 5.0, "review": "I love my fire TV! I am a prime member and have Netflix. There are so many fee entertainment options with prime. It is amazing. (Ok not free exactly but after $99 for prime, I have watched at least $1,000 worth of films, tv series, & enjoyed free shipping on goods, love my prime) Fire tv is so easy to set up, plug into HDMI on tv, plug fire tv in, wait a few min.  you are set. You may have to enter your wireless info, but I don't remember doing that. The quality of the picture is great.", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer \"grandma P\""}, {"rating": 5.0, "review": "Wonderful! There is more than enough content to satisfy me. I don't miss cable at all! In fact i watch less tv amd spend more time with my family. Wish there was an easy way tonuse one unit for multiple tv's. It is very easy to use and has quick menu responses. Thinking of getting a second one!", "verified": true, "helpfulness": "1/1", "author": "C. Mcgibbon"}, {"rating": 3.0, "review": "I find the app for Prime on the Roku and Xbox to be much easier to use. Also not having an IR sensor so i can use my Harmony remote sucks too. The Prime content is mixed in with the Pay extra content so finding a show to watch sucks at best , hope they fix that soon or i might return it and buy another Roku.", "verified": true, "helpfulness": "1/4", "author": "Chuck"}, {"rating": 5.0, "review": "We are now taking advantage of the free Amazon Prime movies.  This unit is easy, fast to install, and the voice command search option is really slick!  Very happy addition to our house!", "verified": true, "helpfulness": "1/1", "author": "MV \"MV\""}, {"rating": 5.0, "review": "This is the best Fire Tv , I had A Roku but this Fire Tv beat it by far I like that it's easy to set up and everything is at your finger tips and the bonus voice button that's awesome ,I must say you did it Amazon.thanks.", "verified": true, "helpfulness": "0/0", "author": "maria nanton"}, {"rating": 4.0, "review": "Amazon tv is a great streaming product for prime members. It's easy to use, fast and great high def quality. Unfortunately you can't browse prime only content yet, it's all mixed in with the pay content, but being such a new product I'm sure at some point soon they will update that. We love the voice search feature, works really great for the kids. It's fast and easy. They don't have a lot of apps yet, but they have the necessities, like Netflix, hulu, Pandora, etc. I would def recommend to prime members.", "verified": true, "helpfulness": "1/1", "author": "CRhodes03"}, {"rating": 5.0, "review": "After watching tv from an antenna the Fire TV is a great addition to our house. I like the variety offered, it was easy to set up and use. I am considering adding another fire for our other tv.", "verified": true, "helpfulness": "0/0", "author": "Nicole R."}, {"rating": 1.0, "review": "I'll visit his device built around Amazon and several other services but if you're looking for a Plex client this is definitely not the right one you're better off with an Apple TV and Plex connectNative formats are lacking, speak search is very limited.", "verified": true, "helpfulness": "4/13", "author": "Aphonic"}, {"rating": 5.0, "review": "I rated this a 5 star because it has so many free apps and features that it never gets boring or old I am so impressed with words aren't enough to express how I truly feel about this product. Some of the things I really like would be that after so many minutes that your away from it that it turns itself into a screen changer with some of the most beautiful pictures that I have ever seen. There is no on and off switch so if you was to forget or have to worry about turning it off then the problem is already solved for you. The disadvantage would be the voice search does not always understand what your saying and it only works for the amazon prime movies or tv shows instead of working with all apps that you have. Overall I do highly recommend  Amazon Fire TV it is on of the best streaming devices out.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Hutcheson"}, {"rating": 5.0, "review": "I haven't used it as much, though it appears to be easy to use once I started to use it", "verified": true, "helpfulness": "0/1", "author": "MilwaukeeDevilDogg"}]