[{"rating": 5.0, "review": "This device is great, easy to connect and set up. Watching movies and TV shows on the big screen is so nice. Really enjoy.", "verified": true, "helpfulness": "0/0", "author": "Russell Reinhard"}, {"rating": 4.0, "review": "The ease of installationTo be able to watch on my big tvAble to watch netflix and my amazon prime", "verified": true, "helpfulness": "0/0", "author": "Camper"}, {"rating": 5.0, "review": "The Amazon Fire TV is Awesome.I purchased two.( 1- bedroom ) & ( 1- living room )I also got gaming remote for games, which I would recommend,especially if you have children or grand- children that likes to play games.I would highly recommend, the Amazon TV and game controller is veryUser friendly, and super fast.", "verified": true, "helpfulness": "0/0", "author": "Angela decker"}, {"rating": 3.0, "review": "not enough prime movies and TV shows. I can pay for movies and TV shows on any other streaming device.", "verified": true, "helpfulness": "0/0", "author": "Jacob glass"}, {"rating": 5.0, "review": "one of the best pieces of technology I have owned ,.  Easy to use and the voice command is awesome.  we are 2 happy seniors.", "verified": true, "helpfulness": "0/0", "author": "sassy"}, {"rating": 5.0, "review": "Amazon Fire is quick and easy to use. My movie was ready to watch instantly in great HD quality. No waiting for buffering.", "verified": false, "helpfulness": "1/1", "author": "Greg"}, {"rating": 5.0, "review": "i can now watch amazon prime movies and tv shows on my tv instead on my kindle fire. yes i would recomend it to others.", "verified": true, "helpfulness": "0/0", "author": "Rusty Schad"}, {"rating": 5.0, "review": "I received my Amazon Fire TV yesterday and followed the directions in hooking it up to the television. This is the easiest item I have ever installed. It worked perfectly from the start. Very simple to navigate the different options. Additionally, the remote controls the box, without any problem, which I placed in a closed cabinet. I am very happy with Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Hollywood"}, {"rating": 4.0, "review": "I love it and the performance of Amazon Fire TV is incredible, but it needs more services.  Right now you basically can choose from Amazon, Netflix, and Hulu for content and the rest is very minimal.  Those services work great and look great when viewed using Fire TV, don't get me wrong, but there is a lot more out there when compared to the Roku for example.", "verified": true, "helpfulness": "0/0", "author": "Mike M."}, {"rating": 5.0, "review": "I am a prime member, I like Amazon and I am a gadget guy. Having said that, I also read all the reviews. Each review i have read has seems half for and half against. I also read the reviews here by people who actually bought the device. Basically to sum it up, I am very happy with Fire TV.its fast easy to use and there is a lot of content and i know there will be more.I own a roku and a roku 2, xbox one and a smart tv that I can get most all of this content on. I still purchased this because for me at least, Amazon has always release good products.Having all of the products listed above, I just wanted something that was easy to use. Fire TV is just that. The remote is nice, fits in the hand good, and the simple well laid out buttons are just what I needed/wanted.I didnt mind the extra $40 for the controller, and it is not something you need. So if you dont need it, you dont have to buy it.The voice search is nice. Pretty acurate. Amazon results are what come up the most, but thats ok with me. navagating the apps is easy and user friendly.I was surprised by the size of the box. I was expecting bigger. I wish it was a little bigger as it would have been easier to stack with all my other gadgets, but once its on, it sorta diasapears from view.Very fast +Very easy +Lots of content =A happy customer", "verified": true, "helpfulness": "0/0", "author": "Donnie J. Dennison \"When there is nothing left to burn, you have to set yourself on fire...\""}]