[{"rating": 5.0, "review": "Love it! Got it for christmas, use it everyday", "verified": false, "helpfulness": "0/0", "author": "miriam"}, {"rating": 3.0, "review": "Its ok in order to get anything worth watching you have to purchase it or get the prime app to go with it an some things are priced a little high I think", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 2.0, "review": "Does not have the APPS Roku has and does not display a many movie choices as Roku or my smart TV. I have to reboot about once week or more. That being said it is fast. I'm sure Amazon will fix the problems, but how long will that take?", "verified": true, "helpfulness": "1/2", "author": "LWS"}, {"rating": 5.0, "review": "This is by far the best purchase ever! The interface if much better than what my samsung tv came with. It is much faster and easier to find what you want to watch. It is very easy to use, and even my 5 year old grandson can work it. It works with all services with the exception of HBOGO and xfinity. Hopefully this will be worked out in the near future.", "verified": true, "helpfulness": "0/0", "author": "Linda Henry \"Gramma\""}, {"rating": 1.0, "review": "I am shocked at the poor support from Amazon.  I had three seperate online chats with support about the fact that this device does NOT support 1080i TVs.  EACH one of the three support people disconnected from the chat when I asked directly if the device supports 1080i displays. I will see what this post brings in terms of better support or an answer and will update accordingly. Is this how Amazon treats PRIME customers?", "verified": true, "helpfulness": "2/3", "author": "RICHARD J."}, {"rating": 5.0, "review": "Easy to set up, easy to use. The voice recognition works great.", "verified": true, "helpfulness": "0/0", "author": "Wibby"}, {"rating": 5.0, "review": "This is one of the best devices if not the best.", "verified": true, "helpfulness": "0/0", "author": "C. I. Martone \"foghorn\""}, {"rating": 5.0, "review": "If you are a Prime customer with cable for internet use but no TV package then this is a perfect solution for you. It was super easy to set up and use. Definitely better than spending the extra money on a 'smart' TV.", "verified": true, "helpfulness": "0/0", "author": "Steven M. Duke \"tagati\""}, {"rating": 5.0, "review": "My only complaint is that it doesn't have a YouTube app.  Other than that, I have been exceptionally pleased with this.  I like that it's portable and the specs are better than that of the Fire Stick.  Great Buy!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product to have.since I'm a prime member I enjoy amazon original series. Am somewhat disappointed of lack of free movies to watch  on amazon.", "verified": true, "helpfulness": "0/0", "author": "Damu awasei"}]