[{"rating": 5.0, "review": "A great addition to our TV viewing.  Tons of movies and great games are available.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Jimbo"}, {"rating": 5.0, "review": "As an owner of an Apple TV, the latest and greatest Roku and other devices, I can say this one works the best and is my favorite with one exception: No HBO Go. Its not a deal breaker, but requires us to keep the Roku which does have HBO Go. So, while I love the Fire TV and like it the best, I cannot live without the Roku. Amazon, addHBO Go and I won't be able to live with out the fire. I would then sell my Roku.", "verified": true, "helpfulness": "0/0", "author": "Shane Y."}, {"rating": 2.0, "review": "Won't work outside USA", "verified": true, "helpfulness": "0/3", "author": "Mauricio Pelaez"}, {"rating": 5.0, "review": "love it - SO easy to use!", "verified": true, "helpfulness": "0/0", "author": "T. Naude \"thewillowlady\""}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "1/1", "author": "Gon Y. Yi"}, {"rating": 5.0, "review": "Its a good product", "verified": true, "helpfulness": "0/0", "author": "Pedro Vidal"}, {"rating": 5.0, "review": "I'm sure there are a lot of features this thing does that I'm not aware of. I use it on a spare t.v. just for accessing Amazon movies and t.v. shows. It works perfect for this analog guy in a digital world. Who knows I may even read the directions and find there are other great thing it can do.....Yeah, probably not!", "verified": true, "helpfulness": "0/0", "author": "Harley"}, {"rating": 5.0, "review": "Simple, fast and reliable, I love it.", "verified": false, "helpfulness": "0/0", "author": "Annie Roa"}, {"rating": 5.0, "review": "Best streaming platform ever!", "verified": true, "helpfulness": "0/0", "author": "Omkhar Arasaratnam"}, {"rating": 5.0, "review": "our family has owned 3 Roku devices and decided to switch to the Amazon Fire TV.  I'm glad we did.  the navigation is a bit different than the roku, but the speed and picture quality is incredible.  Very easy to setup.  I wouldn't recommend this if you had no interest in having an Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "M. Anderson"}]