[{"rating": 5.0, "review": "My Hubby and I were very pleased with the arrival of our Fire TV.  The box was all pre registered.  Hooking it up to our TV was simple.  We have WI FI and the longest part of the installation was typing in the password.  In less than 10 minutes I would say we went from box to watching the welcome video.  It gave us a quick walk through and went over how to use the remote.  Very impressive.We are using this for our Prime account only.  But this box can be used for more.  I am impressed with all the movies and shows available in all genres.  I look forward to many hours watching all the goodies.  I highly recommend getting a Fire TV box  it is $99.00 well spent.  Just don't forget to purchase the HDMI cable to connect the box to your TV.  It is not included.", "verified": true, "helpfulness": "0/0", "author": "Silver Fox"}, {"rating": 5.0, "review": "Less than expected performance (My opinion)no response from amazon for more channels", "verified": true, "helpfulness": "0/1", "author": "Jaydev R. Varma \"jaydev\""}, {"rating": 5.0, "review": "Awesome product so fast! Sling TV is great!", "verified": true, "helpfulness": "0/0", "author": "Marco Gomes"}, {"rating": 5.0, "review": "I am very close to terminating satellite TV in favor of Amazon TV. I am waiting for contract to end, and to ensure Amazon delivers a reliable and continuing product and service. So far, I love Amazon's Fire TV and would not consider anything else.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "Great wish more new movies was \"Prime\"", "verified": true, "helpfulness": "0/0", "author": "RLMACKIE"}, {"rating": 3.0, "review": "Bought this to replace Apple TV so I could get Amazon Prime video. Functions OK, but like other reviewers, I'm not particularly happy that the remote is bluetooth, meaning I cannot use my Harmony 650 all in one remote to control it. Not sure why Amazon decided to go that route, so now I'm back to using two remotes.Other than that, as I said functionally, it works fine, the interface is good and now I can enjoy Amazon Prime video.", "verified": true, "helpfulness": "0/1", "author": "DQ Voices"}, {"rating": 2.0, "review": "It does not hold an internet connection long enough, always loading and losing connection.", "verified": true, "helpfulness": "1/3", "author": "ashleys"}, {"rating": 5.0, "review": "Still learning all the tricks - but so far we love it. We tried Roku, but that didn't work at all. So much cheaper than cable!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Doesn't have any good shows unless you are paying for PRIME. Forget it!", "verified": true, "helpfulness": "1/2", "author": "Pauli"}, {"rating": 3.0, "review": "Have dish network and cannot download showtime to go. Also, most of the movies I want to watch have to be rented or purchased. Need a better selection.", "verified": true, "helpfulness": "0/1", "author": "Amber Gibbs"}]