[{"rating": 3.0, "review": "Only works half the time. Get error message about 1/2 films with good wireless signal so I use my video or Apple TV to watch movies. Seems the problem is persistent as other family members are having the same problem", "verified": true, "helpfulness": "0/0", "author": "Michael P. Mcintire"}, {"rating": 5.0, "review": "What a swell thing!  I don't play games on it, since that is not something I do, but it is so convenient to just ask it to play what I want and it also remembers where I was. Even if I am watching many different things!  Also very easy to switch between the Fire and my DVDs, since I do still have those as well.  So glad they made this.  And it is is so small (it is easy to find a place to put it) and easy to set up too!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"usually sci fi/fantasy\""}, {"rating": 4.0, "review": "Nice and fast just wish they would add more older TV shows and the series they already have for the old shows it should have all the of the seasons/episodes. Not just a few.", "verified": true, "helpfulness": "1/1", "author": "Brian C."}, {"rating": 5.0, "review": "awesome picture great 5ghz the only thing that I wish it had was HBO to go as I am a big user of that service.  So easy to use my kids didn't even need instruction from me on how to use it.", "verified": true, "helpfulness": "0/0", "author": "Neal Pelsor"}, {"rating": 5.0, "review": "I received this product as a trial evaluation.Pros:+ Frustration free shipping box reveals cleanly designed product packaging+ Far faster performance than competing devices+ Excellent specs for fast streaming and fun causal gaming+ Voice support feels solid for the supported apps+ Fairly decent, if not small selection of apps in all of the main gaming genres+ A decent, optional game controller which syncs painlessly+ Stylish, very small footprint, with quiet operation and a great remote controller+ The Plex PC to Fire TV media streaming app was added prior to launch, which bodes well for future updates+ Full support for the wired USB 360 pad in all of the amazon store games tested+ Ability to lower the video output resolution to up visual settings and frame-rates in some amazon store games+ If you're already an amazon prime member, there are allot of features available right away like instant streaming+ Amazon acquired Double Helix games studio, the studio behind X-Box One's Killer Instinct and the Capcom digital only Strider RebootCons:- Very small available internal storage when games of over 1 gig are factored in- Voice support doesn't support many apps, Netflix included, which makes the Fire TV feel inconsistent- To use and enjoy all of the features, an Amazon Prime membership would be needed, despite this, you'll still need to purchase some shows, such as Game of ThronesWish-List: Features which should be included in future updates: A larger, more robust game library; across-the-board voice access support; extra storage support; external video & photo media hard drive playback.Review: The Amazon Fire TV is nicely designed with an incredibly small and light form factor. It feels premium in terms of packaging, despite having no HDMI cable included. The unit is also passively cooled, so it's whisper quiet. The remote controller feels comfortable, light, sleek and solid with a soft rubber like finish that feels great. The remote also allows for some games to be played; though the selection is minimal and full of select and mainly older android titles. Rounding out the included fire TV remote's features is voice commands. The remote controller's voice command feature works well, but it only works on some apps. Having used the PlayStation 4 eye and the new X-Box one Kinect, voice in the few apps that are supported apps on fire TV, works better overall on the Fire TV remote.Playing games with the included fire TV remote is possible for certain games, but not as fun as with a game pad, and as such, just passable as a controller option. Sev-Zero acts as an exclusive Fire TV only game, which is playable via the Amazon Game Pad. The official amazon game controller feels good overall, resembling an Xbox 360 pad in terms of analog stick, directional pad and button placement. A nice feature which is undocumented, is the ability to use the official Xbox 360 wired USB pad. It works exactly like the amazon game pad with the center logo button functioning like the home button on the amazon game pad.As far as apps go, the Amazon marketplace takes precedence. As such, some HBO shows, such as Game of Thrones, cost money for individual episodes or seasons, even if, in some cases, you subscribe to Amazon Prime. To be fair, there is a great deal of free streaming content for Amazon Prime members though. The Netflix app does not support the fire TV remote's voice control feature, but the Vevo music video app does. This makes certain features of fire TV feel like they're not consistent across the board.The Fire TV runs very smoothly due to a quad core Snap Dragon 600 processor running at 1.7 gigahertz with 2 gigs of ram, giving it stronger capabilities than any other streaming device. The limited selection of games look great in 1080p as a result, but some games, such as asphalt 8, can't run on the highest visual settings at steady frame-rates, and defaults to medium visual settings. The silver lining here is that the resolution of the Fire TV can drop to 720p in the settings menu. At this point, games like Dead Trigger 2, which defaults to low at 1080p, can comfortably be set to high visual settings. This gives the game more solid frame-rates, in addition to more intense, smoother feeling game-play, with detailed visuals, at the minor expense of visual sharpness. While it can actually run at 1080p on high and still be playable, on certain levels, the frame-rates will drop.The flash storage drive matches the Apple TV, however, with the gaming functionality of the fire TV, this is quite small, at only 8 gigs with 5.4 gigs usable. Storage space is especially an issue when there are games like Modern Combat which can use up 1.9 gigs of space.For those without a game console that has media capabilities, or with a PC that's more of a work desktop than a TV experience, this is a great device to have that's both sleek and stylish. Even if you already have an older streaming device, the added allure of fun casual gaming, a very small footprint, a great remote and excellent technical specs, which include some of the best Wi-Fi speed available for ultra-fast streaming. For the price, as well as excellent gaming abilities, the Fire TV a very good upgrade to video only streaming devices.Note: To turn off the Fire TV you have to unplug it, or alternatively, let it sit idle for 30mins. This is not stated anywhere in the options, or the instruction manual.", "verified": true, "helpfulness": "0/0", "author": "Art-of-Zen Digital"}, {"rating": 5.0, "review": "The Fire TV could not have been any simpler to use. SImply open the elegantly designed box and empty the contents, insert the batteries into the remote, connect the Fire TV to your TV (using a self supplied HDMI cable, the only drawback) and plug the power cord in.The device was easy to use and navigate. Additional services like Netflix was also extremely simple and user friendly.The interface was very intuitive to navigate as well.We have even taken it on vacation so we can watch what we want when we want.", "verified": true, "helpfulness": "0/0", "author": "j kavanagh"}, {"rating": 1.0, "review": "I never was able to get it working. It couldn't install the first firmware upddate. I don't recommended this product.", "verified": true, "helpfulness": "6/8", "author": "Cosmas Cornelius \"Redneck Sysadmin\""}, {"rating": 4.0, "review": "It was easy to hook up and get started.  Which is saying a lot since I am not very tech smart.I was very disappointed that the movies cost a dollar more than Netflix  which I had before.  You maywant to warn people up front.", "verified": true, "helpfulness": "0/0", "author": "Sheila R."}, {"rating": 3.0, "review": "The product itself is good.  However; the choices on Prime is a different story.  They are all pretty much old.  The older movies are too expensive to rent, when you can get it at the Redbox for a cheaper price.I do like the Pandora option on Amazon Fire.  The only way I can access my Prime TV is through the Playstation but it's very blurry and unreadable.  With the Amazon Fire the picture is clear.", "verified": true, "helpfulness": "0/0", "author": "terri"}, {"rating": 5.0, "review": "I am likely going to cancel Comcast because this system is so perfect.  I love it's ease of use and all its options for use.  Bye Bye Comcast.", "verified": true, "helpfulness": "0/0", "author": "Tiara Packer"}]