[{"rating": 5.0, "review": "quad core and innovative, more than i can say for apple tv.great experience.", "verified": true, "helpfulness": "0/0", "author": "rocco"}, {"rating": 4.0, "review": "I gave it 4 stars even thought I'm extremely disappointed.  I had to give the 4 stars because its my own fault for not researching enough.  You see I wanted to use this with my slingbox; however fire tv only works with 2 of the 7 models available of slingboxes.  Make sure you have a new slingbox or fire tv will not work.  Very disappointing.  However, everything thing else about this box is much better than the Roku's I've owned.  I love the voice search and speed of the system.", "verified": true, "helpfulness": "0/0", "author": "chadqberry"}, {"rating": 4.0, "review": "I am still in the learning and adjusting phase. The limitation in my area is sometimes frequent buffering. Not the devices fault, but caused by thearchaic communications hardware of my region. Device use is intuitive. I own/use no cell phone, and have NO knowledge of \"apps\".  The boxhooks up in under five minutes, and was in immediate use. Picture image and sound are a huge leap forward in quality from cable. Some; butnot all shows available, are commercial free. Even with commercial inserts, I have not come across any '3minutes of show 12minutes of ads'.I have not run across an ad-break that exceeds 1 minute yet. With broadcast, cable, or satellite a person is faced with choices of the samemovies, or marathon of shows, not so with on demand. Once I have adjusted to both concept and use, I would probably rate this 5 stars.", "verified": true, "helpfulness": "0/0", "author": "K. Harmon"}, {"rating": 3.0, "review": "have not activated,need the hdmi plug.", "verified": true, "helpfulness": "0/2", "author": "Debra Jefferson"}, {"rating": 3.0, "review": "When I first got the Fire TV I could mirror my Kindle HD on the TV.  Now I can't and have no idea why it stopped working.  I'll try again in a few days.", "verified": true, "helpfulness": "0/0", "author": "Tom S."}, {"rating": 5.0, "review": "Amazon Fire TV is amazing", "verified": true, "helpfulness": "0/0", "author": "jen i"}, {"rating": 5.0, "review": "HelloI live in the middle east in Hachimite kingdom of Jordanid this will work here", "verified": false, "helpfulness": "0/0", "author": "Learning C."}, {"rating": 1.0, "review": "So far I can't get it to work. It's not as simple as advertised.They would have you believe that all you have to do is hook it to your tv, via HDMI, plug in the power, put the batteries in the remote and your ready to go.BULL!!!!All I am getting is a pulsing yellow light!  NO MENU, NO HOME SCREEN, NOTHING; except I have been able to choose a language.After I chose my language it went to a \"search for network\" which it didn't find and then  a screen with \"connect to a network\" which I can't do wirelessly BECAUSE I HAVE NO MENU!!!I have to point out that my tv is in another room a whole 19 feet from my wireless router. I have a computer(with a wireless antennae) and a Blueray DVD which have no trouble discovering the router. It looks like, if I want to find out if I like the damn thing or not, I'm going to have to get a 30 foot Ethernet cable, I have to go around some walls and through a door, to see if I want to keep it..I would also like to point out that the lack of technical support is disappointing.I think these glorious reviews are malarkey.", "verified": true, "helpfulness": "3/8", "author": "Casey Baugh"}, {"rating": 5.0, "review": "My family loves it!", "verified": true, "helpfulness": "0/0", "author": "Linzi Cleveland"}, {"rating": 1.0, "review": "hard to operate, not user friendly", "verified": true, "helpfulness": "1/6", "author": "jeam yao"}]