[{"rating": 5.0, "review": "This is a great alternative to the high prices of cable.  Thanks AmazonI prefer this over the chrome version", "verified": true, "helpfulness": "0/0", "author": "abg"}, {"rating": 4.0, "review": "I have both this FireTV and a FireTV Stick. This unit is MUCH faster and less glitchy. The overall experience is better with this version.", "verified": true, "helpfulness": "1/1", "author": "Andrew"}, {"rating": 4.0, "review": "Real happy with fire tv.", "verified": true, "helpfulness": "0/0", "author": "dinobaby"}, {"rating": 3.0, "review": "Live sport programming via Sling does not look smooth...occasional jitter.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Love my Fire TV", "verified": true, "helpfulness": "0/0", "author": "Starkvegas \"J.R. Baker\""}, {"rating": 3.0, "review": "First few days video looked great. For some reason past few days video looks more like DVD instead of HD. Done a factory reset today and seemed to help somewhat, but my Roku 3 is more consistent with HD video and better quality. If things don't improve may return it before the 90  day window.", "verified": true, "helpfulness": "1/1", "author": "B. Merritt"}, {"rating": 5.0, "review": "Just as good as the new one! Save yourself 20 bucks. All the same features, original packing, etc. Love Amazon Prime and Fire TV!", "verified": true, "helpfulness": "0/0", "author": "619SDBOLTS"}, {"rating": 5.0, "review": "Beats Apple TV hands down", "verified": true, "helpfulness": "0/0", "author": "Nick Abell"}, {"rating": 5.0, "review": "I think I had the first generation of ROKU streaming devices. It had performed well but it had become real slow. By that I mean it was common to reload two or three time for every movie you watched. I kept reading about different units but decided on the Amazon Fire, mainly because I have had excellent customer service from Amazon and I knew I could return it if not satisfactory. I could not be more please with my unit as it is fast, has an excellent picture and has performed with out a glitch. I also like that it has preloaded screen saver pictures that are stunning and many apps from which to choose. I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Kelvin Bass"}, {"rating": 5.0, "review": "BUY IT! You will love it! Your kids will love it! Tell your cable company to kiss your foot. Hulu Plus, Netflix, and Sling a $36.00 subscription and a one time purchase that will change the way you look at your cable bill.", "verified": true, "helpfulness": "0/0", "author": "Todd B."}]