[{"rating": 5.0, "review": "Kicks ass!!!", "verified": true, "helpfulness": "0/1", "author": "James Pearson"}, {"rating": 5.0, "review": "Think it is amazing :-)-would recommend this to everyone", "verified": true, "helpfulness": "0/1", "author": "Angela Hazen"}, {"rating": 5.0, "review": "We LOVE it!  Very user friendly and the voice search is AMAZING!  It works so much better than any voice recognition software I've used! We can't complain at all!  Best $100 we've spent!", "verified": true, "helpfulness": "0/1", "author": "heidirh"}, {"rating": 5.0, "review": "We love our fire TVs.  We have gotten rid of cable and only use the fire TV.", "verified": true, "helpfulness": "0/1", "author": "wilaz21"}, {"rating": 5.0, "review": "I have officially now cut the cord with the cable company because of this little devise.  No more Verizon!  I am a happy camper.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love the product.  Only addition I would like is a sleep timer.", "verified": true, "helpfulness": "0/1", "author": "Elizabeth"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "Cheryl Brand"}, {"rating": 5.0, "review": "I have TiVo, Chromecast and Fire TV.I love the interface to Fire. It's such a pleasure to use. I've been experimenting with using it for NetFlix lately because Netflix's iPad app is TERRIBLE, dropping out constantly and restarting. I wish I could use HBO Go but cannot because of Comcast. Booh!", "verified": true, "helpfulness": "0/0", "author": "T. Beaulieu"}, {"rating": 5.0, "review": "I LOVE IT! its fast and easy to use. we got it for my 8 year old daughter to use and she loves the voice search feature! The game controller for apps is a plus as well! all around very glad we purchased this, if we didn't already have an xbox for streaming in our living room, I would probably get another one!", "verified": true, "helpfulness": "0/1", "author": "Heather G"}, {"rating": 5.0, "review": "it's great & the grandkids just love it for games & watching spongebob, I love it for watching Prime movies & TV shows.", "verified": true, "helpfulness": "0/1", "author": "ellen \"celiacgal\""}]