[{"rating": 4.0, "review": "I think it's a fantastic product, just two complaints... I wish there was an \"App Store\" on the fireTV instead of searching for an app or going online to download it. Second, I really dislike how there is no On/Off Power button.  It just stays on unless unplugged.", "verified": true, "helpfulness": "0/1", "author": "David Tackett"}, {"rating": 4.0, "review": "Excellent!!", "verified": true, "helpfulness": "0/0", "author": "Josian Ortiz"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "fred stoffel"}, {"rating": 5.0, "review": "This is great we don't buy movies anymore and it's fast have not had any issues would recommend", "verified": true, "helpfulness": "0/0", "author": "puresin46"}, {"rating": 5.0, "review": "To make it better you need a hulu type of service added to your Amazon video service, I will gladly pay extra for the service then to pay per episode.", "verified": true, "helpfulness": "0/0", "author": "reynaldo rubianes"}, {"rating": 5.0, "review": "Easy to set up, easy to use, and easy to catch up on all the shows we missed.", "verified": true, "helpfulness": "0/0", "author": "Martha Epp-Carter \"Tall Reader\""}, {"rating": 5.0, "review": "FANTASTIC! !! This is the future of tv.. goodbye DirectTV. Only 1 problem my husband watches movies that I do not like and it shows up as my taste. Netflix has a item that you can sign in, this way his movies go to his taste only. I have been looking for this service on Firetv so far no luck", "verified": true, "helpfulness": "0/0", "author": "Jules"}, {"rating": 5.0, "review": "Priced right. Easy to use with variety of options available.", "verified": true, "helpfulness": "0/0", "author": "Phyllis Stanley"}, {"rating": 5.0, "review": "Love this little box!!! We cut the cord, finally! The interface is slick and fast, very pleasing to the eye and a not real techie family.", "verified": true, "helpfulness": "0/0", "author": "Joshua Shobe"}, {"rating": 5.0, "review": "This is the coolest device ever! I have a slightly older off brand TV and it still works great. I was even considering buying a gaming console so that it'd be easier to watch my shows without having to hook up and move my laptop every time. Instead of spending a few hundred dollars on that, I can get everything I wanted and more for only $40! Amazon could charge way more for this device and it'd still be worth it. Thank you Amazon for making this so affordable and easy to use! Best purchase ever! Oh and the phone app is great and easy to use also! Heard about it by word of mouth and I will continue to spread the word! :)", "verified": false, "helpfulness": "0/0", "author": "Coley"}]