[{"rating": 5.0, "review": "This amazon tv is awesome and I love it", "verified": true, "helpfulness": "0/0", "author": "Ian Jonas"}, {"rating": 5.0, "review": "I love it.  It is all they say!", "verified": true, "helpfulness": "0/0", "author": "Ruthe"}, {"rating": 5.0, "review": "My first response to this is, Great!!! The Amazon Fire works perfect throughout my whole house. The connection is really fast, I am able to move from one movie to the next really fast. Would absolutely recommend this to someone.", "verified": false, "helpfulness": "0/0", "author": "Jonathan Hogue"}, {"rating": 2.0, "review": "The service works ok but it seemed that everything I wanted to watch I had to pay for. It does make navigation very easy to use to get to the shows you have to pay to watch. Why pay for this service in the first place? I was very disappointed in it and don't understand why it is not free. I do not want to pay for a platform that makes it easier to get to pay TV shows and movies. Who needs it? Not for me, that's why I sent it back 2 weeks into my free 30 day trial. I can go to other places to get movies without have to pay.", "verified": true, "helpfulness": "0/0", "author": "hashman"}, {"rating": 5.0, "review": "Absolutely love it!  My Wi-Fi has spotty coverage but the Fire TV performs very well no matter where I place it.  I will be buying another one in the very near future.", "verified": true, "helpfulness": "0/0", "author": "Adrian Brevard"}, {"rating": 5.0, "review": "Convenient and outstanding value.", "verified": true, "helpfulness": "0/0", "author": "MICHAEL T DAMBRA"}, {"rating": 5.0, "review": "wow..im cancelling my Comcast cable right now !! looks like ive been getting ripped off with cable for a long time!  This thing does it all", "verified": true, "helpfulness": "0/0", "author": "nora arp"}, {"rating": 5.0, "review": "So much better than streaming via blu-ray player. Faster startup of movies/shows, faster/easier search, always responds to remote since bluetooth rather than IR.", "verified": true, "helpfulness": "0/0", "author": "William C."}, {"rating": 5.0, "review": "Cable or satellite no more.  This is the best thing since sliced bread!  A one time purchase only, no more monthly bills.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Murray"}, {"rating": 5.0, "review": "As a Roku user, I found the Fire box much simpler to set up.  It truly was as simple as pulling it out of the box, connecting the hdmi cable and power cord. The box detected the network and walks you through the rest of the setup. Within 5 minutes of opening the box I was streaming video.The menu for selecting the videos was quite intuitive and efficient. What I really liked though,  was the HD quality and how well it streamed. My picture looks as good as a DVD! I had zero pauses for buffering. I really like this device!", "verified": true, "helpfulness": "0/0", "author": "L. Scott \"Steeler Fan\""}]