[{"rating": 5.0, "review": "I love my kindle fire TV", "verified": true, "helpfulness": "0/0", "author": "renee"}, {"rating": 5.0, "review": "My wife loves this uses it daily!", "verified": true, "helpfulness": "0/0", "author": "randy"}, {"rating": 5.0, "review": "great media device", "verified": true, "helpfulness": "0/0", "author": "Mark A. Olazabal"}, {"rating": 5.0, "review": "So far I'm going 5 star.  I had the Roku 3 for about three weeks and just got tired of a few items.  Menus were not so great and amazon prime video looked terrible compared with netflix and always figured there was something not right.  Once I got the Fire it was immediately apparent the build quality was much higher, remote more clicky not mushy as the Roku and super fast bluetooth and processor.  Started the initial installation of xbmc and its as snappy as it is on my laptop.  Amazon video is great and menus are so much cleaner and nicer than on the Roku.  Netflix is about the same however loading is faster as well.Here is one star up for grabs, I might eventually demerit one for this simple fact, voice search needs to be universal.  I know they are selling amazon stuff but it needs to at least search within the netflix app or just universally.  It is frustrating to continually go through the process of seeing \"more availability\" on a movie to see if its on netflix rather than \"buy\" it from amazon or rent it.  Available apps seem plenty available and so far have really enjoyed Vevo and Pandora for music.  Jailbreaking aside I believe this just being essentially an android box gives lots of options.  Its nice they did include optical audio out as I might use it down the road being the Roku 3 didn't have that.The remote has great simplicity however I sort of wish for a hard netflix and amazon button for straight away playing.  Again the universal voice search would fix that issue in itself.", "verified": true, "helpfulness": "0/0", "author": "Rizzo"}, {"rating": 4.0, "review": "Good product. Works fine but the interface it's too oriented to Amazon services resulting a poor integrations with the installed apps. For example the search function works only with Amazon video and not with netflix.", "verified": true, "helpfulness": "0/0", "author": "Adrian Rocha"}, {"rating": 2.0, "review": "The control over what you watch is not there.  It jumps from episode to episode program to program.  Sometimes the picture freezes and I have to cut it  off for some time for it to work.", "verified": true, "helpfulness": "0/1", "author": "J. Early"}, {"rating": 5.0, "review": "Awesome device, no complaints!!", "verified": true, "helpfulness": "0/0", "author": "Palagyi22"}, {"rating": 4.0, "review": "I currently live in Nigeria but had the privilege to watch the Amazon Fire TV while on holiday at a friends in L.A. i would love to buy this right now but most of this channels do not subscribe to Africa like Netflix for example.......... Do you have any advice as i really need this device over here. Thanks.", "verified": false, "helpfulness": "0/0", "author": "amanda"}, {"rating": 4.0, "review": "Works well connected easilyTrying to determine how to get captions to show took a little while but so far I am okeased", "verified": true, "helpfulness": "0/0", "author": "Sonya B Dean \"webrose\""}, {"rating": 5.0, "review": "Next best thing to not having cable. One more Fire box in our home and I'm cutting the cord to Comcast!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Mommy to Alana\""}]