[{"rating": 5.0, "review": "Easy to use. I watch Amazon Pime content, WWE network, Netflix, and much more. So easy to hook up and watch. Money well spent. I did my homework and this is the best homestreaming device out there. I love Apple but this surpasses there Apple TV and the others. You won't regret it!", "verified": true, "helpfulness": "0/0", "author": "eric"}, {"rating": 5.0, "review": "Absolutely love it! So easy to use and works great!", "verified": true, "helpfulness": "0/0", "author": "chelsey steeck"}, {"rating": 4.0, "review": "I love the fire TV and I use it all the time. I chose this over the Apple TV because I am a prime subscriber and it made sense for streaming the prim content.My chief complaint is that some of the Apps I really would really like to have are not available yet. Specifically NHL Gamecenter, which is available on Apple TV. Otherwise a fantastic product.", "verified": true, "helpfulness": "0/0", "author": "AlanJ21"}, {"rating": 2.0, "review": "The product is good quality, it's just the platform that is pitiful.  The apps (besides Netflix) are terrible with poor streaming capabilities.I wish Amazon would buy this back from me...", "verified": true, "helpfulness": "0/1", "author": "Josh Dillman"}, {"rating": 4.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "Mable G. Meadows"}, {"rating": 5.0, "review": "Such easy access to all my amazon movies n shows. Hulu Netflix n I love that when I pause n take 10mins to go back to my tv it has a slide show of all my pictures tht I uploaded.", "verified": true, "helpfulness": "0/0", "author": "Melanie lopez"}, {"rating": 5.0, "review": "Love this product.  It does so much more than I expected.  My granddaughter loves to play her games on the internet from the tv.  This freed up my computer and also allows me to monitor what she is doing on the internet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "a Great value", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was a little skeptical about purchasing the Fire TV, but we have had it for a few months now, and it's PERFECT for our family! Since my kids are the main ones who watch television, I was able to  get the programming that we would use instead of having to pay for a bunch of channels that we would never use. Plus, we have Netflix, YouTube and free games! Great purchase of an awesome product!", "verified": true, "helpfulness": "0/0", "author": "Cheree Beck"}, {"rating": 5.0, "review": "GREAT!!", "verified": true, "helpfulness": "0/0", "author": "kitten"}]