[{"rating": 5.0, "review": "What an amazing device. Out performs the apple tv 3 and every other streaming device available And I have tried just about all of them. Buy it and you will not be sorry.", "verified": true, "helpfulness": "0/0", "author": "Louis Tierno Jr."}, {"rating": 5.0, "review": "Really enjoying this product. Works well with little problems.  For those of us who are technically challenged it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Dee Hoffman"}, {"rating": 3.0, "review": "Would be nice if it connected to Google Play. Movie and TV apps could not authorize because my cable company not listed.", "verified": true, "helpfulness": "0/0", "author": "Ray N."}, {"rating": 4.0, "review": "We have thoroughly enjoyed our Amazon tv and we joined Netflix. Our problem is our internet is not fast enough to stream movies through Amazon but we can through Netflix. Go figure.", "verified": true, "helpfulness": "0/0", "author": "Deborah Sturgis"}, {"rating": 5.0, "review": "Very nice to have", "verified": true, "helpfulness": "0/0", "author": "bobby"}, {"rating": 1.0, "review": "I'll start out by saying that the primary reason for the low score is because there's no Vudu app available, and the only way to get access to your ultraviolet collection is through the horribly flawed flixster app, which doesn't play your videos in HD, and doesn't allow you to play TV episodes.I bought the unit under the assumption that an android based player would have a basic app like Vudu available to it, but I was wrong.  I've already got many movies and tv shows in my ultraviolet locker, and I have no plans on buying them again from Amazon digital.If you already have an ultraviolet library, get a Roku.  If you have Prime and/or a collection of Amazon videos, still get a Roku, as Roku also has the amazon app, and gives you a much nicer, cleaner, interface.", "verified": true, "helpfulness": "1/4", "author": "Y2Bogus"}, {"rating": 5.0, "review": "This box works awesome. Better than expected. The only thing I wish it had was a VUDU app, but you can watch your Ultraviolet movies with the Flixster app, so no big deal.", "verified": true, "helpfulness": "0/0", "author": "J. Coe"}, {"rating": 5.0, "review": "Easy to use and the remote control is a plus", "verified": true, "helpfulness": "0/0", "author": "WFS"}, {"rating": 3.0, "review": "Would like to have some of the older movies on prime.", "verified": true, "helpfulness": "0/1", "author": "Judy Noel"}, {"rating": 5.0, "review": "Works great. Much better than Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "travis heywood"}]