[{"rating": 5.0, "review": "we love our fire boxes!!!  works great!  we love the voice activation, easy to use with smaller children", "verified": true, "helpfulness": "0/0", "author": "Janet Coan"}, {"rating": 5.0, "review": "Love it!!! Easy to hook up and even easier to use.", "verified": true, "helpfulness": "0/0", "author": "Stormy Dickerson"}, {"rating": 5.0, "review": "This was my wife's birthday gift from our tech-savy son. When asked to install it, I waited several weeks before opening the box. I learned that we needed a special cable (not included). Taking full advantage of my Prime membership, I ordered the cable -- not expensive and it arrived in two days.With cable in hand, I approached installation with some fear. To my surprise installation was quick, easy and only required me to go to my computer to get my Amazon password. This may have been the most effortless installation I have ever experienced.Use has been easy. The voice recognition feature has allowed us to find shows without lots of scrolling and frustration.This is a six star product.", "verified": true, "helpfulness": "0/0", "author": "Sewickley Ronpa"}, {"rating": 5.0, "review": "With Kodi this thing is awesome!  Very fast.", "verified": true, "helpfulness": "0/0", "author": "Jaron Berman \"wyndspeed\""}, {"rating": 3.0, "review": "I like it and all. I just wish amazon prime would offer more and better free Prim Movie options.This would be an awesome option I wish you could implement. the ability to rent a movie and have the option to apply the rental fee to the purchase price if you like it within a set period of time.", "verified": true, "helpfulness": "0/0", "author": "Jason \"iamhoffer2\""}, {"rating": 5.0, "review": "Great! Best TV option available", "verified": true, "helpfulness": "0/0", "author": "Ian Odell"}, {"rating": 5.0, "review": "So happy with my Amazon Fire wish I would have bought it long time ago.Has all of the shows that I watch. I said good bye to the cable bill saved me hundreds just by getting it i highly recommend people to get it couldn't be more happier", "verified": true, "helpfulness": "0/0", "author": "joetorres"}, {"rating": 5.0, "review": "love it, was just what I need it!!", "verified": true, "helpfulness": "0/0", "author": "doris stout"}, {"rating": 5.0, "review": "Its awesome; there are so many things that you can do with it and you are not restricted with its capabilities like Apple Products.", "verified": true, "helpfulness": "0/0", "author": "Ian Whitfield"}, {"rating": 4.0, "review": "It works extremely well. The resolution is excellent and the speed of loading material is surprising. The only negative for me is, it combines all the movies with the tv shows in my watch list which makes it very time consuming to find what you are looking for. The ROKU that I replaced with the fire separates the two which makes looking shows up much easier.", "verified": true, "helpfulness": "0/0", "author": "Army Retired"}]