[{"rating": 5.0, "review": "Nice unit...I may be replacing my room units. Although I am not a gamer,the graphics are good and games are fun.", "verified": true, "helpfulness": "0/0", "author": "F. Kirschbaum"}, {"rating": 5.0, "review": "Love it got this the other day and was so easy to set up. The best part of this was the voice remote it is just the greatest I hate to search with all those letters you have to punch in. It is just the greatest. I have a Ruko 3 on my others tv and this fire is on my main tv and it's the best. If you are considering cutting the cable go,for it and buy the kindle fire TV you won't be sorry.", "verified": true, "helpfulness": "0/0", "author": "Janice"}, {"rating": 2.0, "review": "Got the Fire TV to stream mlb.tv as advertised by Amazon on the day of its release. Upon hooking it up,to my suprise there was no mlb.tv app. Called customer support and they could not give me any idea when the app will be available. Amazon has been very misleading and the obviously released false information to the news media. Will be returning it.", "verified": true, "helpfulness": "2/7", "author": "Bruce"}, {"rating": 5.0, "review": "I had an off-brand connection device, purchased from an office supply store that only worked with my netflix account.  I love my \"Prime\" membership and it is totally worth it for shipping only, but yippeee, now i can take advantage of the video feature that comes with my \"Prime\" membership.  Installation was so super simple-we thought we had to set aside a couple of hours to set it up-we were wrong.  Totally \"plug and play, \" so easy; the device did everything, with a cute, short video tutorial.  Voice recognition works great-for both of us.  I have access to so many more options than i had before.  The price was super reasonable, compared with other options.  The remote is easy to operate, the unit was already registered to my account, so my pre-chosen watch list magically appeared.  So easy, so thrilled, is reasonably priced, i am thrilled and i am telling all my friends.  My only wish, and this is minor, is that Amazon would list the rental price on the first screen, you can find the price eventually, but, just sayin' . . .", "verified": true, "helpfulness": "2/2", "author": "Gail"}, {"rating": 3.0, "review": "THE FIRE BOX WORKS GREAT NO PROBLEMS. THE REMOTE CONTROL RAN OUT OF BATTERY LIFE AFTER LESS THAN A WEEK ! I HOPE THIS NOT SOMETHING THAT IS ON GOING PERHAPS JUST BAD BATTERYS ! BY THE WAY THE UNIT CAME WITH AMAZON BATTERYS ! AND SO DID THE GAME CONTROLLER !", "verified": true, "helpfulness": "0/3", "author": "Mike Allen"}, {"rating": 4.0, "review": "Disappointed that Directv Is not a supported subscription for tv apps like showtime and espn.  I hope they add DirecTV soon.  Until then I amin a bit of a pickle to switch off the the firetv to regular directv.  Awkward, however the gadget did setup very quickly and is easy to use.  I'll use it for netflix and amazon prime video.  Hope my husband doesn't hurt me for blowing $100 for something that doesn't deliver as much content as our failing google tv device.  We also have a Roku 3 which does have DirecTV subscription service.  What Roku 3 doesn't have that the Fire TV does is an Dolby optical hookup to attach to my receiver for surround sound.  That made the choice for me in selecting the FireTV.  Other than that FireTV is similar in functionality to the Roku3.  If you have a newer receiver than we do, the Roku 3 will support HDMI to the receiver to support surround sound and external speakers.", "verified": true, "helpfulness": "1/1", "author": "Laura \"bleuotterpond\""}, {"rating": 5.0, "review": "Had a Chromecast. Hated it. H-A-T-E-D it. Constantly seeking the network, constantly unresponsive. I've had Rokus since the beginning and been generally happy but this put Roku down. Very fast. Very fast. I may not be stressing that enough. Very fast. I did not like the idea of spending another 40 bucks for an essentially generic bluetooth controller for the games but it paired with my Ouya controller in no time and good to go. Games are overpriced especially since I have bought a ton of these apps for my Fire and now it wants me to pay another 6 bucks for some of the games. Plex works great with local media too so I can avoid setting up XBMC for now. As for shortcomings, they should all be correctable. It does default search Amazon and it would be nice if like the 360 it could search all available options. It kind of does but it is iffy. Also, HBOGO is a must addon in the future. Voice works great and gets better with time. I would have liked to see it a little cheaper and not push so hard to put all your stuff on the Amazon Cloud but overall it's a very nice little piece of kit.", "verified": true, "helpfulness": "1/2", "author": "Scott Christensen"}, {"rating": 5.0, "review": "This is a dream for any TV viewer ; so , instead of wasting your money on an X-box One , get this superior device .", "verified": false, "helpfulness": "2/4", "author": "Demetrio Nieves4th \"D.J.4.7\""}, {"rating": 5.0, "review": "I have nothing but good to say about the Amazon Fire TV.  It was so easy to set up, great connection, and great voice recognition.  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "LiveandLearn"}, {"rating": 2.0, "review": "The unit itself is pretty impressive, but I came to an ugly realization soon after I hooked it up. After downloading  Netflix, Hulu Plus and a few more apps, I discovered that 99% of what I wanted to watch (old movies and TV shows, mostly pre-1990) were unavailable for streaming, unless you fork out more money to 'rent' them...per movie or per episode. If you're into classic tv or movies, your selection is more than woeful. Even shows I watched on my computer via Netflix or Hulu (like The Outer Limits) are now \"unavailable for streaming\", unless I pull out my credit card.  I see what's happening here. They're convincing people to 'cut the cord' only to find more ways themselves to get into your wallet. I fully expect the quantity of free tv shows and movies to go down in the near future. They may be adding new content, but they're taking away a lot more. It doesn't take a rocket scientist to realize what is happening here. 2 thumbs down, Amazon.", "verified": true, "helpfulness": "6/25", "author": "Richard Lewis \"Rick Lewis\""}]