[{"rating": 4.0, "review": "Good. Buffering could be faster.Biggest need is a volume adjust or equalization option. I find myself grabbing my other remote and adjusting sound volume between videos and apps.", "verified": true, "helpfulness": "0/1", "author": "xgg"}, {"rating": 4.0, "review": "I thought when you get Amazon Fire TV you can access for 3 months  HBO, Showtime and .... but it is not.In general it is good edition to family entertainment.", "verified": true, "helpfulness": "0/2", "author": "vigeen dola"}, {"rating": 3.0, "review": "I have had it 2 weeks and still have not figured how to make it work with my sound system, it  may not even be possible, I don't know.", "verified": true, "helpfulness": "0/1", "author": "Sande \"Sande\""}, {"rating": 5.0, "review": "Fire TV. Where do I start? I don't even watch cable anymore. Not true. Only for live sports. But with ESPN soon available to stream, I probably won't need it. I've had smart TVs before, and they're cool, but soooo slow when it comes to loading apps. Same with trying to use my friend's Roku. When I first got the Fire TV, I wasn't expecting much. My TV wasn't smart on it's own, so I wanted this to stream Netflix and Hulu. My first impression? WOW. So fast. I was clicking through everything like it was on my smartphone. Okay, maybe not THAT seamless, but pretty darn close. That processor is spiffy. Voice search is good and knows exactly what I'm searching for, but only brings me options from Amazon. I get it, it's an Amazon product. But I know that movie is free on Netflix. It'd be nice to have options to pick from. Netflix and Hulu both work great on the FireTV box. HBO is stupid because Comcast is awful and doesn't let me stream HBO Go. But I have it set up to stream movies and media from my cloud drive, and can direct play from my laptop to the box to mirror my screen. I like that I can do most things with just the box and my TV alone. I don't want to have to have multiple things on at once, especially when I don't really need it. It has movies, music, tv shows, and games available. The only thing is, since I can now stream movies and tv without my laptop on, I also want to be able to play better games without attaching my laptop to my TV. If Amazon Fire TV can stream games from Steam, I think it'd be the greatest all in one media console ever. With the option for expandable memory now, it could be a possibility. Get on it, Amazon. I'm waiting.", "verified": true, "helpfulness": "0/1", "author": "Susan"}, {"rating": 1.0, "review": "It doesn't work", "verified": true, "helpfulness": "0/4", "author": "Elizabeth Lapple"}, {"rating": 5.0, "review": "Works great, easy to hook up.", "verified": true, "helpfulness": "0/1", "author": "Rick Ludvigsen"}, {"rating": 5.0, "review": "Everything they said it will do it does", "verified": true, "helpfulness": "0/1", "author": "pearlhorse"}, {"rating": 4.0, "review": "It's a nice addition to our satellite dish; some of the Netflix TV rocks!", "verified": true, "helpfulness": "0/1", "author": "Karl F. Jensen"}, {"rating": 4.0, "review": "I have a smart tv now!", "verified": true, "helpfulness": "0/1", "author": "Raymond Pimentel"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/1", "author": "Robert A. Hicks"}]