[{"rating": 5.0, "review": "Very awesome. The family really enjoys it. Very easy to hook up and use.", "verified": true, "helpfulness": "0/0", "author": "noslack13"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/1", "author": "melissa rosado"}, {"rating": 4.0, "review": "Need add on/off button on the control.", "verified": true, "helpfulness": "0/0", "author": "Douglas R Sonnenburg"}, {"rating": 5.0, "review": "Why buy a smart TV when this is so much better and the price of a smart Tv is much higher than one without that option. As soon as I hooked the Fire Tv up it down loaded new software.The picture quality is excellent. I recommend this over the fire stick  because it is quad core and has more storage, voice remote and much more. My only con is that the sound has to be with a optical connection. My Bose system is an older one and has RCA jacks. The fix for this is simple, just get a optical to RCA cord. but it would be nice if it had an optional RCA inputs. It is very small and you won't know it is even there. About the sound, if your TV has a sound bar you will hear good quality sound from the HDMI cord so all is good. It has Bluetooth!! so you can hook up wireless headphones. I think this is a very good product from Amazon but then do they ever have a bad one? Costumer service is second to non, they will work to make you happy. I bought this on a Monday, received it on Wednesday on Friday the price had dropped 20.00 for a one day special. I called and they refunded me 20.00 on the spot. Amazon told me they had a 7 day guarantee to the price if it was lower they would mach it. Gotta Love Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Michael Graycloud"}, {"rating": 5.0, "review": "The best device I have used in years. The no buffering is a godsend!I love that I can just say what I want to watch or an actor/actresses name and it comes right up, instead of having to waste time typing it out. I love streaming my iHeart radio stations and being able to easily access photos and videos to show my friends and family. Easy to use and combines all of my apps into one place, no trying to find multiple remotes. Tons of movies and TV shows to stream, I have saved a ton of money on entertainment. I have purchased them for family and friends for multiple occasions, I highly recommend FireTV.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "A very useful handheld internet resource. I recommend this instrument for its mobility and resources.", "verified": true, "helpfulness": "0/1", "author": "Thomas E Bridge"}, {"rating": 5.0, "review": "No issues.  Working great so far.  Easy to use.", "verified": true, "helpfulness": "0/1", "author": "jdubs"}, {"rating": 5.0, "review": "Does fire t.v. have to have wifi to run? Can i just play my netflix through my phone to the box? Please HELP ME!!!!!!", "verified": true, "helpfulness": "0/4", "author": "David warren"}, {"rating": 5.0, "review": "I just purchased this a couple weeks ago and am already enchanted with it. We decided not to get cable in our new home and only hooked up internet. This Amazon Fire TV is way better than cable ever was. It's easy to find shows and movies for everyone in the family. Most of the ones we watch are free and if we want to rent a movie, it's easier than going to Red Box and cheaper than what cable charged.The only thing I was disappointed with was that the Voice Search only works in Amazon. When I'm using Netflix, I have to search by text.", "verified": true, "helpfulness": "1/1", "author": "gracejpower"}, {"rating": 5.0, "review": "I am a casual user I just need a good streaming device and easy to use for streaming videos in Netflix and Amazon Prime Video.  I can say Amazon fire TV is great device and definitely very easy to use - there is no need for tech background to install and use this it - it is as easy as connecting your DVD player to your TV and the remote function is easier than your DVD or TV remote.  I have subscription to both Netflix and Amazon Prime,  before I bought this device I used my laptop for streaming and mainly access Netflix as I find its layout very user friendly while Amazon Prime Video website is not as good,  but with the Fire TV browsing through Amazon has gotten much better and now we are enjoying both Netflix and Prime.  Here is my set-up.  I have cable Internet subscription from Comcast - the lowest cost and least bandwidth they are offering.  I have one of the Amazon Fire TV installed in my living room using Ethernet connection, it is ready to use as use when I did the connection, the device is already registered to my name so I don't need to input my Amazon prime information,  all I need to do is install Netflix.  I have my second unit in the bedroom and connecting to Internet through Wifi - all I need to do is type in my Wifi password and it is ready to use.  In both cases, I'm getting good quality video which is all I need.  A minor inconvenience when installing Netflix, it failed several times because the device was updating its software which I'm unaware of, I called the support and before they let me know what is happening, the device has already work by itself.  There are several interesting apps available although I have never tried one except the Snowy Ambience screen which my kids enjoyed watching  - those apps can be useful in the future since I don't own gaming consoles.  In summary, if you need this type of device and you are casual user like me who just need to enjoy Netflix and Prime Video - I think this is perfect.", "verified": true, "helpfulness": "1/1", "author": "oliver"}]