[{"rating": 2.0, "review": "I like the speed and the functionality of the fire TV.I will be taking this unit back in for an intermittent Wi-Fi issue. It randomly drops the Wi-Fi and will not pick it back up for several minutes.", "verified": true, "helpfulness": "0/2", "author": "Philip A Liggett"}, {"rating": 5.0, "review": "The Amazon Fire TV is amazing. It's super fast and loads any show in record time.", "verified": true, "helpfulness": "0/0", "author": "Mamc"}, {"rating": 5.0, "review": "So far, so good!  We also have Apple TV, and I like this better, however, we have Amazon Prime and Apple won't play it.", "verified": true, "helpfulness": "0/0", "author": "Roseanne"}, {"rating": 5.0, "review": "we ditched Direct TTV, just tired of their random increase. while we do miss a few British programs...as soon as our computer guru figures out how to obtain local channels for free, we will be very happy. fire TV works reeealy well. we use tv mostly for entertainment,  and with our existing Netflix streaming we have lots and lots of selections!  since Direct TV left their Dish on our house, there MUST be a way to convert it to an outdoor antenna.  Help Amazon!. an indoor antenna didn't work for us. Amazon needs a \"cut the cord kit!\"", "verified": true, "helpfulness": "0/0", "author": "GC, brit wife \"GC, Newcastle, CA\""}, {"rating": 4.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 5.0, "review": "wasn't hard to get to work on the t.v. now I can watch NetFlix and other programs.", "verified": true, "helpfulness": "0/0", "author": "paxson lee payne"}, {"rating": 5.0, "review": "I love it, thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Leia Edson \"smokeyedson\""}, {"rating": 5.0, "review": "I am extremely pleased with my fire tv.  If I am able to get the news from fire tv in the near future- who will have a need to purchase cable tv.", "verified": true, "helpfulness": "0/0", "author": "patricia a. pitre"}, {"rating": 5.0, "review": "Works great just had some difficulty setting up with cable and audio sysgems", "verified": true, "helpfulness": "0/0", "author": "Cindy McMacken"}, {"rating": 4.0, "review": "It's great. Easy set up and good choicrs", "verified": true, "helpfulness": "0/0", "author": "Gayle Tomeck"}]