[{"rating": 3.0, "review": "It just seems that every TV show we want to watch we have to buy. At least on Netflix if it wasn’t on the box we would assume that it wasn’t unavailable.  Another thing, we received it on February 15 we haven’t really used it that much but the batteries were dead this morning (February 24th) on our snow day. Very annoying because we don’t really have anything else in our house that uses AAA batteries. Wish that there was an app or a way I could have added my HTC M8 to control the Amazon Fire TV especially since I can use it to control everything else in my house.", "verified": true, "helpfulness": "0/0", "author": "toshi miyagi"}, {"rating": 1.0, "review": "not happy", "verified": true, "helpfulness": "2/6", "author": "Maritn Hernandez"}, {"rating": 4.0, "review": "Everyone should get one!!! Awesome", "verified": true, "helpfulness": "0/0", "author": "juan lozano"}, {"rating": 5.0, "review": "Best media player I've ever owned", "verified": true, "helpfulness": "0/0", "author": "Dana"}, {"rating": 4.0, "review": "Its sleek, its fast, the menu is easy to navigate.I would give it 5 stars, but it doesnt support Slacker, which is my favorite music app. Pandora and I heart radio just dont cut it.", "verified": true, "helpfulness": "0/0", "author": "D. A. in Omaha"}, {"rating": 5.0, "review": "My first one was DOA but Amazon quickly sent a new one. Very responsive and smooth.", "verified": true, "helpfulness": "0/0", "author": "Bassetbob"}, {"rating": 5.0, "review": "Can't stop watching since I installed it to my television. It's a great addition to my man cave", "verified": true, "helpfulness": "0/0", "author": "Handy"}, {"rating": 5.0, "review": "Excellent media device. No problems. Easy setup. New content weekly", "verified": true, "helpfulness": "0/0", "author": "Kurt"}, {"rating": 5.0, "review": "This box does everything the description says and does it well.", "verified": true, "helpfulness": "0/0", "author": "Charles Wright"}, {"rating": 4.0, "review": "You have to get a keyboard for it or use the fire tv app on your phone.  The voice recognition is a gimmick and often doesn't work (it will make a few hilarious mistakes, but then you'll get bored of that).  The downside of a keyboard is that some of the apps are not written for a keyboard so it is a bit hard to use.  Also the app selection leaves a lot to be desired.  How come I cannot browse internet on this thing.  That means we still have a computer connected to the TV to watch things from internet that are not on youtube.  But overall it became a reasonable replacement for cable especially with a netflix subscription, so we are reasonably happy with it.", "verified": true, "helpfulness": "0/0", "author": "Marketa Lebl-rinnova"}]