[{"rating": 4.0, "review": "awesome  for  gaming  with fast connection  and good for movies too", "verified": true, "helpfulness": "0/0", "author": "Markus Wolfe \"markus\""}, {"rating": 1.0, "review": "This product is TERRIBLE! It restarts...continuously. If you can manage to get to a program in your watchlist or on your recent tab; it will be lost when the box crashes. Sav time, and buy a Roku.", "verified": true, "helpfulness": "1/2", "author": "Clayton Powers"}, {"rating": 5.0, "review": "easy to use, easy to install. well worth the $$", "verified": true, "helpfulness": "0/0", "author": "Kathryn S. Bail"}, {"rating": 1.0, "review": "Not worth the price, buy a cord and hookl to laptop, same thing.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome! Why did I wait so long to get it.", "verified": true, "helpfulness": "0/0", "author": "Diana Phillips"}, {"rating": 5.0, "review": "Perfect.", "verified": true, "helpfulness": "0/0", "author": "Yi Z."}, {"rating": 5.0, "review": "Amazing voice recognition and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Rasham"}, {"rating": 5.0, "review": "LOVE LOVE LOVE!  Super easy to set up and use.  Very user friendly.  We cut the cord with our cable company and are using this plus a regular TV Antenna.  That's all we need and it's great.  Saving over $100/month now!!!  Woo Hooo!!!!", "verified": true, "helpfulness": "0/0", "author": "Tia Cleaves"}, {"rating": 4.0, "review": "I love the fire Tv its so nice to see old shows, and movies. What im puzzled is no Spanish channel like telmundo, or univison.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Rivera"}, {"rating": 4.0, "review": "OK, the first unit I received was DOA... but as usual Amazon came thru with a rapid replacement. The replacement looks like a brand new unit and works perfectly. I am a convert from Apple TV and am an otherwise 100% iOS user. But Amazon Fire TV knocks the Apple TV into a cocked hat. I prefer everything about it, from the menus to the rock-steady reliability. I even side-loaded XBMC (Kodi) and can stream my own videos from a Synology NAS. The voice search is useful and reliable, wish it worked in all apps (Netflix??).", "verified": true, "helpfulness": "0/0", "author": "Tim G. Corcoran"}]