[{"rating": 5.0, "review": "Unit was a gift and it will be well used(based on activity so far. it keeps record of selections made through Prime. well worth the cost.", "verified": true, "helpfulness": "1/1", "author": "Sonny kt"}, {"rating": 5.0, "review": "All I can say it's the best out there.  Better than Netflix by light years.  Truly a wide selection of movies tv shows action flix, you name it.  Too expensive with the latest programs, but we can wait.", "verified": true, "helpfulness": "1/1", "author": "Robert A. Dahmes \"\"Dr. Rob\"\""}, {"rating": 5.0, "review": "I have chromecast, apple tv and now this box. The one I like the most is the amazon Fire TV. Great device for the price.", "verified": true, "helpfulness": "1/1", "author": "Khush N"}, {"rating": 4.0, "review": "I really like the Amazon Fire TV.  However, I  still have not been able to get the Hulu account to download properly.  Also when accessing Amazon Prime, there is no filter to tell you which movies are free and which ones are not.", "verified": true, "helpfulness": "0/0", "author": "Robin RiCharde"}, {"rating": 5.0, "review": "Great purchase. Easy to use, haven't had any issues. Crisp picture, variety of things to do/watch is very nice. Recommend", "verified": true, "helpfulness": "0/0", "author": "Jennifer Ritchie"}, {"rating": 2.0, "review": "Not worth the money. It doesn't come with any plugs so you have to go out and buy those HDMI cables. After I bought the cables I found out my TV only had one port, which held my cable box. I was told I could get a converter which I priced........86.00. So, fire tv 99.00 then 86.00 the the cost for the HDMI cable...well you get the idea. Not worth it, I got NETFLIX. I'll watch that on my Kindle Fire.", "verified": true, "helpfulness": "1/9", "author": "Michelle Hunt"}, {"rating": 3.0, "review": "still figuring it out...I wish there was a guide of available times and shows , I love the search option.", "verified": true, "helpfulness": "2/4", "author": "Marsha K."}, {"rating": 3.0, "review": "The ad's look cool, and it does work more or less as advertised, although a little slower than advertised, but here's the real rub. Mainly it's a sales gimmick, when you access your kindle movie library you get movies and TV shows thrown in that you don't own. You cannot access your own apps and games, you cannot access your own music etc. It is a neat idea and with some work would be a really cool product but, right now it is basically a sales gimmick. The voice command feature is neat but not always helpful. I would still Recommend this product but with the hope that in the future it will be more for the customer and less for pushing items and sale.", "verified": true, "helpfulness": "0/0", "author": "Dar or RPL"}, {"rating": 5.0, "review": "Amazon Fire TV blows your mind when your opening the packeging. I knew right then any one that puts so much detail into the design of the box the item comes im was sure to blow it out of the park on the item itself. I was not diaspointed.  It is a five star experience", "verified": true, "helpfulness": "2/4", "author": "gerald purvin"}, {"rating": 4.0, "review": "Love it, but I wish you could have the same apps as the kindle fire, like the Watch ABC app or the CW app.", "verified": true, "helpfulness": "0/2", "author": "CincyJess"}]