[{"rating": 5.0, "review": "A MUST HAVE I8S THE AMAZON \"FIRE TV\" BUNDLE ALSO HIGHLY RECOMMEND THE \"AMAZON FIRE GAME CONTROLLER\" WITH THE NEW APPS AND GREAT FEATURES YOU CANT GO WRONG ESPECIALY IF YOUR A AMAZON PRIME MEMBER!!", "verified": true, "helpfulness": "0/0", "author": "robbinsdart"}, {"rating": 5.0, "review": "Amazing box. Easy to set up and connect to network. Had it running in no time.", "verified": true, "helpfulness": "0/0", "author": "nri335"}, {"rating": 5.0, "review": "I was to give this product a week before I made a review about the Amazon Fire TV. I decided to go wireless because I don't want the clutter my room with wires. The size of the box was just right for me. I thought by the image of the remote that it was going to be big, but the size perfect for my hands. I got small hands so you know. And it also feels good in the hand. I tried using the remote under the blanket, turned backward turned away from the box and it still worked. My first impression was looked organized fluent. I don't like when things are unorganized. I just wish the home tab had my apps in it, along with the recently used apps. The apps work well for me, like YouTube, Netflix and Twitch. I do have the occasional buffering, but it does not bother me. There is an app I wish they had on the Amazon Fire, but other than that, the Amazon Fire TV is my favorite.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 4.0, "review": "I wish the search worked for everything", "verified": true, "helpfulness": "0/0", "author": "Frank Arena"}, {"rating": 5.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "mamaT"}, {"rating": 3.0, "review": "Easy to set up and picture is clear. However, I really wish there was a way to exclude movies and shows that cost extra!", "verified": true, "helpfulness": "0/1", "author": "Richard T Peavy Jr"}, {"rating": 5.0, "review": "Words Can't Describe How EASY this is to Set up and How Much Easier it is Now to Watch What you Want, When you Want. I do have a word of advice, When you are setting this up, if you don't see the Amazon Logo on your Screen, Make Sure that you Have the TV set to the right HDMI Output and then make sure that All of your cords are plugged into the Fire TV Box and check the other ends of those cords to make sure that they are plugged where they need to be plugged. One Cord Not Plugged in will keep this from working. Don't repeat this, but mine didn't work at first, then I followed all the cords and realized that I was so busy with all the technical cords that I didn't Plug the Power Cord In. ALSO NOTE: Hulu, HBOgo, and Amazon Prime, did not activate right away. After about an hour, all was well. I just patiently waited and didn't fiddle with anything. Pandora Worked right away. I HAVE AN IDEA: I think that I will set up the digital output from the box to my Surround Sound (directly) so that I can listen to Pandora without my Big Screen TV on. THE VOICE REMOTE IS AWESOME - I give this an EASY FIVE STARS! . . . and I haven't even tried to \"FLING\" stuff from my Amazon Fire Tablet yet. I also have a Blue Ray Player that has all the \"smart\" features, but even though it is name brand, it is so slow, I don't use it. I was using my computer for everything. NOW I HAVE MY COMPUTER BACK... as I can run the tv from the FIRE TV. I am So Happy.", "verified": true, "helpfulness": "0/0", "author": "r. krueger"}, {"rating": 5.0, "review": "I had 3 Roku's before. They started not working consistently, so I ordered a Fire TV and a Fire TV Stick. Both exceeded my expectations! Flawless. I had one little things for which I needed customer service. They walked me thought the steps in five minutes, and all is well now. I recommend without hesitation.", "verified": true, "helpfulness": "0/0", "author": "Craig S. Olson"}, {"rating": 5.0, "review": "Easy to use . we have a second one, but this one is so much better.", "verified": true, "helpfulness": "0/0", "author": "scottiemom"}, {"rating": 5.0, "review": "The Fire TV has made it a lot easier to find movies and shows to watch. I was using a Sony Blu-ray for Netflix and Prime but this is SO much better. The voice feature is fantastic. You do need to wait a second after pushing the mic button before talking. Once I figured that out it hasn't misunderstood what I am saying at all. I can't imagine going back to no voice control. One issue I did have when I set it up was no audio over HDMI. My first instinct was that I shouldn't have bought the refurbished model but it wasn't a problem really. I have an older Harman Kardon Receiver and the HDMI is a little bit finicky. I just unplugged the HDMI and when I plugged it back in the audio started working.", "verified": true, "helpfulness": "0/0", "author": "David B."}]