[{"rating": 1.0, "review": "I feel so foolish. I believed Amazon when they said Fire TV was better. I get a message saying it's not going to work unless I remove everything I've downloaded on it. (I don't know what that even means) It goes on to say I need to go to my Kindle to do what??? Why??? I'm so confused. Amazon this is so aggravating. I'm telling everyone who will listen don't buy Amazon Fire TV right now. I would wait at least a year so they can get all of the bugs out. It seems in their haste to release Amazon Fire TV they weren't quite up to snuff in the electronics design or programming department. So I still don't know what to do, if I can't figure it out then I'm sending this piece of junk back to them and pray I get my money back for this shady outfit.", "verified": true, "helpfulness": "3/13", "author": "Raymond Lawrence \"Ray\""}, {"rating": 5.0, "review": "OK, I really like this. Having access to to Amazon content, Netflix, Hulu, etc is great. I do not own a video game console, so this is exactly what I need. I like the apps and even the game selection. I am anxiously waiting for the MLB at Bat app to be available. Once that arrives I will be using nothing else.One note, this is going to best if you have Amazon Prime, if you do not have that this may not be the solution for you. I save hundreds a year with the free shipping so I had it before hand.", "verified": true, "helpfulness": "3/3", "author": "Stuart D. Hatfield"}, {"rating": 4.0, "review": "This app works beautifully. The only downside is the lack of hbo go support. Thats a huge app to be missing. Roku is still ahead in this department.", "verified": true, "helpfulness": "4/5", "author": "Cheen"}, {"rating": 4.0, "review": "Seriously, getting the plug behind everything with the cabinet in front of the outlet was the hardest part of the set up process.  I know I am not using all the features available with Amazon Fire TV, but that's ok, I just like having my Amazon watch list on the television with the press of a button (or a voice command if that's what you prefer).  One thing I noticed was the watch with Amazon prime option is not always on the main screen when a program is selected, and at first I had a little trouble finding it, until I selected 'other ways to watch' then I found the watch with Amazon Prime option.  I like the screen saver option too, wow what beautiful scenery.  I sort of wish I could set the screensaver to play longer than it does before shut down, and it would be nice if relaxing music  would play along with the screensaver too.  I do plan on signing up for Netflix at a later time, and I like that I will be able to get to my account through Amazon Fire TV.  Many other features that I have not used yet, so check it out for yourself!", "verified": true, "helpfulness": "0/0", "author": "Jeanetteeakins"}, {"rating": 2.0, "review": "The Fire has very limited apps. Most glaringly is the absence of HBO Go. And I discovered another annoyance; the remote needs a line of sight to the device. I don't have that problem with the Roku. And the Roku's menu is more intuitive. Amazon has released an inferior product at the same price point as a far better device.  Until Amazon can get its act together, get a Roku or Blu Ray. You'll thank me.Update: I'm sending back and getting another Roku. It's actually a little cheaper than the Fire TV and is far superior for what it's supposed to be; streaming TV. It's like the Fire is trying to be a game system and media streamer all in one and failing at both. So, they're charging me $7 for the privilege of reviewing their piece of sh....junk. Thanks for nothing.", "verified": true, "helpfulness": "2/12", "author": "aavidrose \"Movie Lover\""}, {"rating": 1.0, "review": "Looks great, nice specs, bluetooth remote rocks.  That's where my love affair ends.  I have had two shipped to me and can't get either to work.  All of my other devices work like a charm.  There' no troubleshooting, and amazon support has been okay, but today I can't even email them back as it keeps bouncing.  My top complaints:No troubleshooting feedback - it is a black box - though on the second one I could see it was pulling an IP address.  There's not even a link light on the wired port.No Android App.  Not everyone owns a Fire.  And after this experience, it's not on my shopping list.No wall mount bracket/kit.  It's bluetooth, so it can be hidden behind the TV.  An add on mount for this would be awesome.No ability to surf local content.  If it can't phone home it's a brick.", "verified": true, "helpfulness": "5/12", "author": "Mark Scheuber"}, {"rating": 5.0, "review": "Excellent buy couldn't imagine living without it. The technology behind this tiny box is remarkable beyond words. Glad it's home", "verified": true, "helpfulness": "2/2", "author": "Premo"}, {"rating": 5.0, "review": "OK, so in the search for the doit all streaming box i've had, boxee,WDTV live,HTPC, Chromecast, and a few more. ANd still none has checked all the right boxes. Some the interface is just to plain or to complicated, other just don't do enough. With this one steaming wise you have access to most of the services most users will want, i assume more will come. Interfcae is easy enough my 8 year old can use it and its fast ad snappy. Now to the extras: Because this platfor is android i expect the modding communnity to eventually unlock its full potential. As for what ive done with it, ive manage to load XBMX on it and convert it into the equivalent of my HTPC pretty much. I mean i can stream all my local content from my dvdrips and family movies in my NAS,and stream from all the online services. I mean with this it is the closest thing to a do it all box.. I cant recommend it enough i plan on getting a couple more to replace all my WDTVs at home. And this is just the tip of the iceberg like i said onece the modding community gets a full hold on it. The sky is the limit!!!!", "verified": true, "helpfulness": "1/1", "author": "Francisco Ortiz"}, {"rating": 1.0, "review": "The usb dont seem to have ability to use external harddrive while i enjoy the voice command. I prefer using my computer connected to my tv for amazon prime movies and shows. I am returning this box that is no better than my Roku was which i put roku in the drawer after a few weeks. I used this 2 days and it dont impress me much", "verified": true, "helpfulness": "3/10", "author": "fun12u"}, {"rating": 5.0, "review": "I have had the Fire TV since the release date. So I have been using it for well over a month now.I mainly use it for streaming movies and tv programs from Amazon and Hulu, and it seems to handle streaming HD videos great. I have only had a couple of problems with the Hulu app not streaming older tv shows, pre 1980 programs properly.My main gripe is that the Amazon Music Cloud Player was not included in the initial release, and has yet to show up. I mean, come on! This is Amazon's own device! You would have thought they would have had the build of the Music Player app ready to go and installed it in the core system before releasing it.It is also to bad Amazon had not gotten together with the other content app builders ahead of time so they could have had more apps ready to go on the launch date. There are a few apps that I would have liked to have on the Fire TV. I have them on my Kindle Fire, but it would have been nice to be able to use them on the Fire TV.But other then that, I am really happy with the Fire TV.Update:Now that the Amazon Music Cloud is included, I have raised my rating to 5 stars. I am very happy with the Amazon TV and use it all the time.", "verified": true, "helpfulness": "2/3", "author": "Eric Westrope \"KindleReader\""}]