[{"rating": 5.0, "review": "One of the best items we have purchased.", "verified": true, "helpfulness": "0/0", "author": "chisholm charlie"}, {"rating": 5.0, "review": "Absolutely a must have for those of us who are not technologically savvy.  This box is amazing.  Love it.  Took less than 5 minutes to get up and running.  I cannot explain my joy of using this marvelously simple piece of technology.", "verified": true, "helpfulness": "0/0", "author": "Kelly Harrelson"}, {"rating": 5.0, "review": "Work's great.", "verified": true, "helpfulness": "0/0", "author": "hootybear"}, {"rating": 3.0, "review": "Fire tv has a lot of bugs had to reset 20 plus times since I have owned it. If you want something that has no bugs buy a Roku 3. I have 2 of them and have had no problem with them at all. I will most likely not buy another fire tv. Sad thing is I'm looking at buying 2 more devices. I use streaming devices all the time since we cut the cord. I will tell everyone I know to buy a Roku first. Was hope the fire tv would work better.", "verified": true, "helpfulness": "2/3", "author": "bigbronco"}, {"rating": 2.0, "review": "I've had a lot of trouble with this constantly freezing, disconnecting and the picture scrambling when streaming video. I've had every connection leading up to it including the internet connection and nothing has been found to be a problem. Very disappointed in it's performance so far.", "verified": true, "helpfulness": "0/1", "author": "William Lescalleet"}, {"rating": 4.0, "review": "I received this as a gift about a month ago.  I am giving it a 4 because I want it to do more.  I live in a rural community with poor internet.  I have 3MB (high speed internet).. I know,  ridiculous right!  I have been a prime user and netflix user for several years  I hooked up a mac to my TV so I could watch netflix, prime and youtube or search the web.  I setup the Fire TV in about 5 - 10 minutes, with out the manual and worked out of the box.  At first it locked up ALOT and I almost shut it off, but I was told to give it a chance, that it will download content and catch up.  And After a few ours it stopped locking up and runs perfect. It has not locked up since.  What is missing is that I want is to replace my PC connection.  I can't because the voice command will only search Amazon Library.  It will bring you to the other apps but  then you are on your own, to search the apps through there interface.  Some collaboration and cooperation between the services is needed. But now, for my web viewing,  I use my wireless keyboard and track pad and revert back to the Mac attached to my TV.  I want a single interface for my home entertainment. The web is part of that landscape.  The Amazon Fire TV is a great product, the price is good, the size is  discrete and the voice commands work.  It is very simple to use.  It is a good solution and cost effective if you are ready to drop Cable and convert to Prime.  Your Return on Investment can almost immediate.  So I would recommend it, but don't expect the voice recognition to go beyond prime.", "verified": false, "helpfulness": "0/0", "author": "Jane"}, {"rating": 2.0, "review": "Doesn't have xfinity go, streaming iPhone/android is horrible unlike advertised. The prime videos are okay I guess", "verified": true, "helpfulness": "0/3", "author": "A&P2014;"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "pm"}, {"rating": 2.0, "review": "Just got my fire tv. Disappointed when I went to watch the Harry Potter series that they weren't free. I have Amazon Prime. What gives??? What other movies am I going to find aren't free. Rip off!!!", "verified": true, "helpfulness": "3/10", "author": "Susan S Gillmore"}, {"rating": 3.0, "review": "They've made some incremental improvements since I bought it, so I'm reserving the right to change my opinion. But Amazon is pretty ruthless in driving you towards their content instead of someone else's, which means that the nifty search interface bascially only works with Amazon content. I also can't see a way to limit searching of amazon content to Prime easily.  Some of hte games are cool, and my son likes being able to play minecraft on the tv. But Xbox this is not.", "verified": true, "helpfulness": "1/1", "author": "Keith Gaddis"}]