[{"rating": 5.0, "review": "I like the Fire. I had a Roku 3 before (about 2 years) and that worked perfectly fine until the device just totally shorted out one night out the blue- scared the daylights out of me. The fire is a very sleek box and super light weight (if looks are a concern). It works awesomely and I absolutely love the voice command (which, at first I thought was a bit cheesy, but it's awesome voice recognition makes it super worth it- seriously, it just knows) the only complaint I would have is that Amazon doesn't separate the prime stuff from regular stuff, which I'm assuming is for a reason...they kind of make up for it by having the voice command bring you to all the places you could watch it -I have Netflix and Hulu- so it syncs them and I can choose which station I want to watch from...If you're at the home menu..If you're in amazon or Netflix, it only search in those specific places.I've had it for a month or so and love it to pieces.", "verified": true, "helpfulness": "0/0", "author": "Vickie"}, {"rating": 4.0, "review": "After finally upgrading our family PC my kids were on it constantly watching Netflix and You Tube. I decided to give this a try.I'm glad I did. The voice recognition is amazing. I have a strong southern drawl and it even understands what I'm saying.This is impressive considering just about every other voice controlled devices I own is worthless.", "verified": true, "helpfulness": "0/0", "author": "Dennis P. Williams"}, {"rating": 4.0, "review": "Let me start by saying I love Amazon...and I really Like the Amazon Fire Tv...but  was surprised at the limited number of apps that are available...no candy crush.,.,, no words with friends BOOO...and now that Amazon has jumped into the music streaming business...we definitly need an app for that on TV...I mean who wants pandora when you can have your amazon music library \" that just  got a whole lot bigger\" streaming on your Amazon Fire  enabled tv...One other thing is the price of the pay per view movies is pretty expensive for me anyway...but the free content is not bad at all and now that I have amazon prime it makes more sense...if you dont have amazon prime its pretty much just a vehicle to view netflix on a dumb tv...so in closing not mad at Amazon this is a great product especially if you are like me and have  told your local cable company to stick it...But Amazon open up the app library we need some more choices", "verified": true, "helpfulness": "0/0", "author": "smbs"}, {"rating": 5.0, "review": "So much faster than my older internet method (smart tv).  It's almost as if buffering doesn't exist.  I'm totally satisfied.", "verified": true, "helpfulness": "0/0", "author": "frank orlando"}, {"rating": 1.0, "review": "I got this item to test out and very disappointed. I thought that the features that I wanted would be included in the price of the device. When I found out that in order to get Netflix and Hulu, you have to sign up and pay for these services, I felt misled. This was just not what I desired, to have to more money for more services. I could just get those services and hook up to my tv with a cord and eliminate this device. Also the movement between features was clumsy. You had to either talk into the mic to find something, and good luck with that... or you could go through the features and look at several in order to find what you want. This is not streamlined or search capable.", "verified": true, "helpfulness": "2/8", "author": "AmazonWoman"}, {"rating": 1.0, "review": "Not clear to me what it did when I got it - I thought I could get Net Flix and other providers through it but could not.  It is not on my lap top - just TV - and I still don't see the purpose of it.", "verified": true, "helpfulness": "1/5", "author": "Amazon Customer \"gltcox\""}, {"rating": 3.0, "review": "To start, I own a roku 2, two chromecasts, and an old WDtv live hub. All of them, including the firetv, are pretty similar.The firetv comes already setup to use your amazon account, which is nice, additional setup was limited to adding my WiFi password and Netflix and hulu credentials. The introduction video on how to use the firetv was a little long. The menu system is very similar to my roku 2, vertical list of categories on the left, boxes on the right. One of the first things I searched for with the voice search returned several results including an option to view on hulu. No other search did though even when I searched for Netflix or hulu exclusives.The firetv crashed twice in its first two weeks and also dropped its connection to my network at least twice, requiring a reboot once and a total reset to factory settings a second time to resolve the issue. My roku also crashes sometimes, especially when streaming prime video, so I wasn't too upset.Firetv doesn't support hbogo, if you are a prime member you get old HBO content now but not the next day access to new programming like with hbogo.If you are a prime member and don't already own a streaming video device I recommend  the firetv.", "verified": true, "helpfulness": "2/2", "author": "James Bowie \"jacabo\""}, {"rating": 5.0, "review": "The Amazon Fire tv has surpassed all my expectation and I use it everyday for all my entertainment. Also I would recomend it to all my friends!!!", "verified": true, "helpfulness": "0/0", "author": "Russell Battle"}, {"rating": 3.0, "review": "Works okay as a streaming box, unfortunately it's UI and unique features all revolve around amazon prime. The truth is amazons library just isn't good enough and I found myself ignoring 98% of the home UI and simply clicking on the Netflix, Hulu, or YouTube apps. Also the app versions don't seem as solid on the Fire TV as I experienced consistent glitches that would require closing the app and reopening. All in all not bad, but I would say Roku is a better option.", "verified": true, "helpfulness": "1/1", "author": "Chance \"charnce\""}, {"rating": 5.0, "review": "I have tried many media players since they first started coming out and this sets the bar high.  As far as ease of use and quickness, it beats the other devices on the market in my opinion.  The only thing lacking, just like Roku and Apple TV is the ability to play home files.  For those type files I still have to rely on WD Media Hub HD which has the capabilities of all the devices above plus ability to play just about any file you throw at it but is extremely slow, doesn't have Prime, and clunky GUI.  If the Fire TV picks up ability to watch home media files then I'll throw away all my other devices.", "verified": true, "helpfulness": "0/0", "author": "D Dawley \"bktdd\""}]