[{"rating": 4.0, "review": "Just wish it offered more free features. But the controller does work well when speaking into the mic.", "verified": true, "helpfulness": "0/0", "author": "brie"}, {"rating": 1.0, "review": "Was great until showtime stopped working", "verified": true, "helpfulness": "1/5", "author": "petrock"}, {"rating": 5.0, "review": "Absolutely awesome. And the movies are cheaper to rent then on dish", "verified": true, "helpfulness": "0/0", "author": "Genius Rage"}, {"rating": 4.0, "review": "Bought it for my husbands birthday. I think it's the best gift I have ever bought him. The only thing I do not like, is all the B movies.", "verified": true, "helpfulness": "0/0", "author": "Onehicchic"}, {"rating": 5.0, "review": "Purchased item as a christmas gift for myself. Setup was super simple, we use it in the bedroom to watch our favorite shows.", "verified": true, "helpfulness": "0/1", "author": "BF"}, {"rating": 3.0, "review": "Easy setup. Menu navigation is pretty easy to understand. Though we are still playing, it is a bit hard to find \"channels \". Really missing the direct YouTube app.The things I would like to see upgraded are 1- voice search work for all apps/channels. 2- multiple profiles, so recommendations can be personalized for different viewers.Like I said, still playing with it So maybe I'm missing stuff.", "verified": true, "helpfulness": "0/0", "author": "Susan D Carroll"}, {"rating": 5.0, "review": "I absolutely love my Amazon Fire TV. I have never been very interested in most TV shows but love movies. I like to watch them at my own convenience and it is so easy to operate and can easily stop it and resume watching if interrupted. My favorite Christmas present!! I get to watch movies every day and get to pick out the ones I spend time watching. Love it!", "verified": true, "helpfulness": "0/0", "author": "deborah stephenson"}, {"rating": 4.0, "review": "I really like the fire tv.  Still reviewing the apps but not pleased that a lot of the movies are at a cost.  With Amazon prime I feel these should be at no cost.  What's the difference in purchasing Netflix!  At least for the same cost I would be streaming movies for the price of the package.", "verified": true, "helpfulness": "0/0", "author": "turismo"}, {"rating": 5.0, "review": "This replaced the feature on my Blu-ray which in turn, replaced my Roku. It is EXTREMELY fast at loading apps with very little wait. The previous methods could take a few minutes to access Netflix or Amazon Prime, but this is almost immediate. The voice feature is nice, but brings up many items under apps I do not subscribe to. My favorite feature is not having to hold the controller up and constantly pointing it at the box. I wish the cable and TV were so easy.", "verified": true, "helpfulness": "0/0", "author": "DTC"}, {"rating": 4.0, "review": "We don't have a smart TV, and this has made it much easier to watch Hulu, Netflix and Prime.  Overall it works well, was easy to set up, picture is very clear and lag is significantly reduced, but I do have some negative feedback.I had issues with the apps freezing, and had to restart the Fire TV to resolve it.  It seems to have gotten better or I am just not watching it as much as I did at first, so maybe it was just a matter of overuse.The games are pretty neat but I'm afraid that using the remote all the time will wear it out, and I just don't want to have to buy a controller for the money they are asking.  It also appears that not all of the games can be played with the controller, so really not sure it's worth it.My biggest complaint is with Prime content.  For $99 a year plus the cost of the Fire TV, really feel like there should be more available to watch for free.  Some of the movies that I have wanted to watch are quite a few years old and cost $2.99.  Also, a number of TV shows that are not available to watch or that must be purchased to watch with Prime are available on Hulu.  So it makes me think next year we may not renew it, even though there are other benefits, the main reason we got Prime was to watch instant videos.On a positive note, I am excited that HBO announced they will be available for streaming for a fee without a paid subscription through a cable carrier, and that Fire TV will support it.", "verified": true, "helpfulness": "0/0", "author": "C. Hood"}]