[{"rating": 4.0, "review": "Still learning, but it's great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I've been using this for about a week and have had no problems. The voice search takes some practice but mostly works fine. I would recommend this product. We've never had cable & thanks to this, we'll never need it.", "verified": true, "helpfulness": "0/0", "author": "pmilli \"PHM\""}, {"rating": 4.0, "review": "So far so good. Would like more cost vBulletin effectiveness with different apps", "verified": true, "helpfulness": "0/0", "author": "ben franklin"}, {"rating": 5.0, "review": "Great for family that has a vast range of movie interests... Wish more of the older movies (those before 1970) were all free. Have a device on each of our main TVs. Worth the money. And we are full package DirecTV people.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got it as a gift from my girlfriend this past Christmas,  freaking awesome!  It has replaced my Xbox as my media device on my tv. Like everything about it and I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "m1zunorja"}, {"rating": 3.0, "review": "I have used Xbox, the Fire stick, and Chrome.  None spend the time it seems to take the Fire TV to load streaming data.  The frequent pauses are very annoying.  Otherwise, I like the interface and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Sopasalex"}, {"rating": 5.0, "review": "I have a Fire TV and gave one as a gift this Christmas!  They love it and as much as I love mine.  It is a great value and offers so much content!", "verified": true, "helpfulness": "0/0", "author": "Anita Bunner"}, {"rating": 5.0, "review": "I like that it's fast and small,  I breeze thrum menu quickly", "verified": true, "helpfulness": "0/0", "author": "comcongen \"Buy it cheap buy it fast\""}, {"rating": 4.0, "review": "Really, more like 3.5, but I'll give it the benefit of the doubt.  I got this for Christmas and I'm already quite enjoying it.  The one thing to be aware of is that currently many of the cable channels don't have apps for Fire TV like Starz and FXX.  Luckily I have a Kindle Fire that allows me to mirror to the TV from my Kindle.  So this has not been a major issue for me, but may be for other people who do not.  The other thing people should be aware of is that realistically you need an amazon prime account to have a really good experience with it.  One huge improvement might be to allow you to watch live tv through it, which I Have not found that I have been able to do.", "verified": true, "helpfulness": "0/0", "author": "Colin Walsh"}, {"rating": 5.0, "review": "Turned out very enjoyable and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Brian"}]