[{"rating": 5.0, "review": "Love it!!  So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 5.0, "review": "The Amazon Fire TV is even better than I expected. I love it!", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 4.0, "review": "It installs and works fine.  However, I'm a little disappointed in the movie selection from Amazon Prime.  I thought with the 40,000 movies you advertise most of the good shows/movies from a few years back would be free.  That is not the case.  Not many James Bond titles, or Dean Martin & Jerry Lewis, no Mr. Roberts and so on.Haven't tried TV shows yet.  Wonder if I can get all the old Saturday night Live shows free?", "verified": true, "helpfulness": "0/0", "author": "H. Eugene Polhemus Jr."}, {"rating": 2.0, "review": "First off, Amazon voice works really well!I was hyped about the Amazon Fire TV because I heard great things about it.The problem that I have this this product is that there isn't enough content.There are a lot of shows/series on Amazon Prime; however, many of them aren't up-to-date.The HBO GO, showtime, ect... content are paid content, meaning that it isn't really a perk that you get from buying Amazon Fire TV.I understand that there are a lot of movies in the world, but about 9/10 movies that I search for have to be purchased. What good is my Amazon Prime?Lastly, I was excited about this unit because it is an all-in-one entertainment piece.....The games for sale on the Fire TV are VERY cheap in comparison to PC or gaming consoles.The problem with this is that the device only has 8GB of storage... Since some of the games take 2GB of space or more... I can logically store NO more than 4 of these games on my device. What is worse is that there is currently NO way to expand your hard drive, for the the USB plug-in in the back CANNOT be used for storage.I'm NOT trying to bash on Amazon because I love the company!However, it would be nice if they put more effort into making making this product better.", "verified": true, "helpfulness": "1/2", "author": "Jeroen"}, {"rating": 4.0, "review": "Set up was simple and easy.  We have had it a couple of weeks and it has worked seamlessly.  I have not had much time to really look into the content that is available, but I have been able to find what I was looking for.  The voice search works pretty good.", "verified": true, "helpfulness": "0/0", "author": "Jeff Smith"}, {"rating": 5.0, "review": "Easy to setup and easy to use.  Has an optical audio and hdmi ports.  Has good quality voice recognition.  Very few mistakes.  Voice only works on prime not Netflix.", "verified": true, "helpfulness": "0/0", "author": "William S Phipps"}, {"rating": 4.0, "review": "Easy to setup, easy to operate, great images. What's not to like?", "verified": true, "helpfulness": "0/0", "author": "asylum sound"}, {"rating": 5.0, "review": "This is amazing . With Amazon prime u get lots of free movies and tv shows . The new seasons are not free but it's not to costly to by them . It's saving is a ton of money but not having cable", "verified": true, "helpfulness": "0/0", "author": "mario de lucia"}, {"rating": 5.0, "review": "The Amazon Fire Box sets up like a charm and performs wonderfully.  The voice search function is especially handy. Streaming is very smooth with no delays or problems of any sort.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"plinius the elder\""}, {"rating": 5.0, "review": "Audio device is perfect. I got to see a few movies and episodes of The Wire for the first time. During my free time, I will enjoy viewing any kind of film and TV program.", "verified": true, "helpfulness": "0/0", "author": "Lonzo Roberson-Junior"}]