[{"rating": 5.0, "review": "I've had all three gen's of the Roku and Fire TV is so much faster! I love it. And the games are amazing.", "verified": true, "helpfulness": "0/2", "author": "Matthew Shumaker"}, {"rating": 2.0, "review": "Amazon - if you are listening - would appreciate a response to this.  The objective behind my purchasing this was to be able to use it when I travel (which I do often).  However, I can't connect to hotel WiFi because there is no way to get past the login screens.  So tell me - how is this product useful for this specific use case?  In addition, games and movies that I purchased - why do I have to connect to the internet before consuming them, even if they are downloaded?  Why do I have to prove everytime that I have purchased these?Appreciate your attention,Shobs", "verified": true, "helpfulness": "1/6", "author": "Shobhan Dutta"}, {"rating": 5.0, "review": "Amazon Fire Tv offers great apps and very easy to use. It is a very small unit and very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Pennie"}, {"rating": 5.0, "review": "This little box was easy to install in spite of my complicated TV set up.  It is also easy to use.  Now I only need time to watch the many fun choices.", "verified": true, "helpfulness": "0/0", "author": "Capepenny \"Penny\""}, {"rating": 5.0, "review": "It was super easy to install and it actually works! The voice command feature is amazing, and I swear the picture is clearer then most of my blue rays.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I have had problems with ISP rebooting Fire getting scrambled. Still trying to re set Fire. I had apps in my smart TV already, so  I dont see a lot of added advantages with Fire", "verified": true, "helpfulness": "2/2", "author": "Jim Plucker"}, {"rating": 5.0, "review": "I installed XBMC on this device and in a word...\"wow\". It is much faster than the Apple TV due to it having 4 times more memory, and 4 times the processing power of the ATV2. I now own 3 of these units and I can say i am more than pleased with it. This, when configured properly is definitely a cable tv killer.", "verified": true, "helpfulness": "0/0", "author": "maitai \"maitai\""}, {"rating": 5.0, "review": "Only downside is that it doesn't have HBO Go. Easy to use and lots of features. The voice recognition works incredibly well. Much better than Siri or anything I would have expected.", "verified": true, "helpfulness": "0/0", "author": "engels"}, {"rating": 3.0, "review": "I am having difficulty navigatings the system.  The little info that comes with it is not very helpful.  Seems like a lot more has to be paid for than I expected.  Truthfully, I have not played around with it very much, but plan to give it another try at figuring it out soon.  Going to check at Amazon.com for more support for the device too.  I love my Kindles so am sure this will turn out to be an Amazon favorite of mine too.", "verified": true, "helpfulness": "1/1", "author": "Linda Reed"}, {"rating": 4.0, "review": "too many commercials for Mcdonald, not too many selection, not too many new shows , you can't speed forward the show", "verified": true, "helpfulness": "1/2", "author": "mona eldib"}]