[{"rating": 5.0, "review": "Apps load quick, video streaming is flawless and easy to use. Between Amazon Prime video, Netfix and Hulu+, you always have something to watch.", "verified": true, "helpfulness": "0/0", "author": "Allison S."}, {"rating": 5.0, "review": "I love my Fire TV.  It was easy to hook up and easy to use.  So many great programs and movies  to choose from.  I love the voice search feature. There are many free programs and movies and if you subscribe to any premium channels you can get them, like HBO Plus.I recommend it.  It's great for adults and children. ( It has parental control options )", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 5.0, "review": "Works great and has given us many hours of viewing pleasure.  Saved us the expense of purchasing a much more expensive TV.FYI:  The outside packaging was the same type that I sometimes receive vitamins in but it was not taped; all I had to do was pull open the  flap ;anyone could have looked inside and taken the contents then just push the flap back in.  Back to the product itself -- it's great.", "verified": true, "helpfulness": "1/1", "author": "Dalesylvia Mcelroy \"Photo Buff\""}, {"rating": 4.0, "review": "Still has some work to do on voice search, but overall is a great device. You can't beat the speed.", "verified": true, "helpfulness": "0/0", "author": "Tyler Powell"}, {"rating": 5.0, "review": "Great product, great price, love the games also.", "verified": true, "helpfulness": "0/0", "author": "les"}, {"rating": 3.0, "review": "use it once and have to take it off the.  Sorry its not user friendly.  thank you", "verified": true, "helpfulness": "0/2", "author": "QUINATA"}, {"rating": 5.0, "review": "Love  Love Love so glad I bought", "verified": true, "helpfulness": "0/0", "author": "debbie r"}, {"rating": 5.0, "review": "Love the freedom of watch some thing when you want because tere is nothing on local or DISH!", "verified": true, "helpfulness": "0/0", "author": "Lynn Nulton Lehning"}, {"rating": 5.0, "review": "This device was simple to set up and the best feature is the voice controlled remote.  Makes finding movies a snap.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Does everything it says it will!", "verified": true, "helpfulness": "0/0", "author": "Angela Igrisan"}]