[{"rating": 5.0, "review": "I was looking to replace my old Roku and was debating back and forth between the Roku 3 and Amazon Fire TV. I compared the specs and then when it went on sale for $84.00, that was the clincher for me to get the Amazon Fire TV.I have to admit I'm pretty impressed, but usually am when it comes to Amazon products. I have been fully immersed in the Amazon \"ecosystem\" for many years(with mulitple Kindles and Prime membership), and that was another reason I decided on the Fire TV.Set-up is pretty basic, and after a few software updates and figuring out which cables needed to be attached to what to take advantage of Dolby Surround Sound, I was good to go.The speed of this box is very fast. Its a smooth, clean operation. The picture does seem to be much clearer on the Fire TV than it did on my Roku.If anyone is looking to cut the cord to cable, this is an excellent place to start. I cut the cord about 5 years ago and I haven't looked back. If you can't find SOMETHING to watch on Amazon Instant Video(or Prime), Netflix, HuluPlus or any of the other apps available, then I don't know what to tell you. In the last couple of months, I have watched Deadwood, Southbound Down, American Horror Story, etc. And yes, they are \"older\" shows, but they are still \"new\" to me if I have never seen them, right??Keep up the good work, Amazon!!!!", "verified": true, "helpfulness": "2/3", "author": "Brian T."}, {"rating": 5.0, "review": "First of all, I 'm not a huge TV watcher.  So, it irritates me when I want to watch TV and have to browse through hundreds of channels only to find nothing I want to watch anyway!  This is perfect for me!  If I want a movie, I can find a movie; Tv show, that's covered too!  It also has great options for my 7yr old, who honestly does most of the TV watching.  God riddance to satellite, and hello Amazon Fire!", "verified": true, "helpfulness": "1/1", "author": "mighty mo"}, {"rating": 5.0, "review": "I've been accessing my netflix through a WIi, and thought it would be easier to use this especially with the voice feature.  I've been a prime member for years and knew that was a plus when owning this device.  It arrived fast, easy easy easy to hook up, and after it was installed and I had time to browse around the apps, I was amazed at how many new things I could access.  The best of all is the music videos, and concert videos.  Awesome piece of technology that I wish I would have discovered sooner.", "verified": true, "helpfulness": "1/1", "author": "Rocker Chick \"Aquarius6\""}, {"rating": 3.0, "review": "My family and I have been playing around with the Fire TV for a few days now and while I would recommend it to a friend, it has some annoying oversights that should have better thought out before it launched.Here are my Amazon Fire TV Pros and Cons for a familyPros:1. Streaming TVs and movies through Amazon Prime, Netflix and Hulu Plus work remarkably well. Picture quality is excellent. Everything loads up super fast, much faster than my Apple TV or Samsung Smart TV.2. The voice recognition actually works - even for my six year old who can be a little hard to understand at times.Cons:1. No option for multiple profiles for different users. So if the game you want to play doesn't come with the option to have more than one save, only one person can play it.  Seemingly the only way to have more than one profile is if you set a Freetime profile for your children but...3. Freetime is there but its not awesome, in fact its not even very good - since there is no option to have profiles for different users at the macro level, I have to choose Freetime and then let my kids play which is not ideal because its on our family TV, which my kids can and will just go up to and turn it on so they have free reign outside of Freetime unless I (or they) chose it. Furthermore, once in Freetime, they have access to the apps I've white-listed and all the kids programing from Prime.  The problem is there is absolutely no search function. They have to scroll through literally HUNDREDS of shows until they find what they want. On top of that, if they want to switch between their profiles, I have to input the parental controls password and...3. Parental controls aren't well thought out - I don't want my kids watching tv/movies that is above a certain rating and I don't want them buying things. The PC do that BUT if my kids want to download a free app, I want to be able to give them that option. That's kind of a minor gripe - my BIG gripe is that the pin you have to enter is there, front and center on the TV so whenever I put it in, I have to tell them to look away or go in another room. Granted, there is an option to hide it but all that means is that it turns the key strikes into dots after a second, they can still see which numbers I'm selecting and see them for a second after input. My kids would know the pin after watching me put it in once. Take a cue from XBOX - they've realized this is a problem and made their passcode a series of button presses that wouldn't be obvious to ANYONE looking at the TV.My overall impression is that it does it's major function (streaming) and it does it really well. As far as any other functionality is concerned, I get the impression that it has been (for the most part) directly ported from their Fire tablet. I get it that those controls work really well for a tablet which would generally be used by just one person but this is on my TV, which is whole different ballgame. I'm really writing this review in hopes that they will take customer feedback and improve the areas that need work.Bottom line - Great streaming. Probably not terribly irritating if you're the only person using it but if you want it for your family, you might wait until they fix the parental controls and freetime to be more user friendly, more customizable and just plain better.", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I have never written a review before, but I felt it necessary this time. My husband got me the Amazon Fire for Mother's Day, and at first I absolutely loved it! Then, about a month ago it quit working. None of my apps will play...not Netflix, Hulu, or even Amazon Prime. I am very disappointed and have tried everything that has been suggested to fix it to no avail. Our wifi is working perfectly fine, so that is not the problem. I hope that others have a better experience.", "verified": false, "helpfulness": "2/7", "author": "Tori Hawkins"}, {"rating": 5.0, "review": "Works great.  Fast shipping", "verified": true, "helpfulness": "0/0", "author": "Lois C"}, {"rating": 2.0, "review": "I just got my fire tv to replace my roku and was very disappointed to find  that many of the show apps I had on the roku I can't get on the fire tv. I guess I miss understood how it works. I use all amazon devices so I thought the tv was a great addition especially when it said it could mirror my kindle fire like Apple tv . But  once I got it on I found first that it was extremely limited to the apps available and two it only mirrors with kindle fire HDX . Now this might have been written somewhere and I just didn't see it but it still sucks. So if you are trying to replace your roku and all you watch it Amazon prime this will probably work for you . If you ate someone like me who has multiple apps and subscriptions to watch a bigger variety of shows then don't buy this.", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fantastic! I enjoy it every day.", "verified": true, "helpfulness": "0/0", "author": "RAY DEVER"}, {"rating": 2.0, "review": "Tried a friend's model of this.  At this point in time the menus of the Amazon Fire are too cumbersome.  Plus it has no access to HBO GO, which is the primary reason I'm sticking with ROKU.  I have a small TV viewing area by the fireplace in my sitting room with no cable access but I love to watch my HBO shows there.  Until you can catch up with ROKU's viewing choices I will stay put.  Thanks, but no thanks.", "verified": false, "helpfulness": "2/5", "author": "JC"}, {"rating": 4.0, "review": "I already had the main \"streaming\" content players in this market space, but thought that the Fire TV would be the better gaming option. Especially since the controller is a solid offering. For me, while the gaming aspect hasn't caught on to the extent I would have liked so far, the Fire as \"streaming\" device certainly has. Movies, TV, Netflix, etc all load much faster for me on the Fire than the other devices. I have found the Fire TV to be my go to device for \"streaming\" content.", "verified": true, "helpfulness": "1/1", "author": "MX-5 Miata Fan"}]