[{"rating": 4.0, "review": "I'm very much a gadget guy - I have an Apple TV, Fire TV, and Fire Stick setup.  If you want to enjoy Amazon's streaming selection and would like to play some games, this is a great product.- Great if you are a Prime member and want to stream their shows, (they have a great library), HBO go, Netflix, etc. If video is all you want to do, then I would recommend the cheaper fire stick, as it does the same stuff for the most part (HBO Go will be out soon on the Fire Stick)- The Fire TV has a decent selection of both casual and \"casuals+\" games - family games, action shooters, etc.  I play fairly often over my Xbox games- Good looking hardware no performance issues.", "verified": true, "helpfulness": "0/0", "author": "J D"}, {"rating": 5.0, "review": "I like it. Easy to install. Just wish there was more pre-sales information for old people.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "I am so disappointed!  I was so excited to get this to watch PRIME movies on  the big TV instead of on my Fire or computer  I ordered the first one and tried it out after Christmas and we couldn't get any signal. We tried everything and then contacted support and he said no it is not working and we will send you a new one.  We got the new one plugged it in and worked perfectly... for about 3 min then it would shut off, no signal. Got it to turn on and went to Netflex to try and get that to work... NOPE... wouldn't do anything (and yes I have a subscription).. went back to watching movie on Prime and it started again -  then quit.... no signal... reset everything - started again --we got about 10 mins of the movie and it went out again and this time... NOTHING!  This would have just been perfect for what we need... but it doesn't work!  Why do you have a product that will not perform???", "verified": true, "helpfulness": "0/3", "author": "sportsmom"}, {"rating": 4.0, "review": "I originally purchased a Roku but with over a years worth of use. The Roku unit started to have quirks, nothing serious just sometimes annoying. I purchased this Amazon Fire as a replacement. It is a very serviceable unit. You couldn't go much wrong by purchasing it. I did see, however. where some people were complaining in their comments, about needing a cable subscription to watch ESPN live. Like them I pulled the plug on cable but I was missing football. I don't follow the NFL so I don't know if this is true for pro-games. However, I do follow college. I couldn't watch the games live but ESPN does offer a rebroadcast of college games on their app. So I don't look for the score and watch the game later. I think this a good work around for the games. This doesn't take away from Amazon Fire TV because Roku is in the same boat with regards to ESPN. I am sure that once more people leave cable, ESPN will offer a paid internet streaming service. I have heard that HBO already plans to start doing that.", "verified": true, "helpfulness": "1/1", "author": "James Davenport"}, {"rating": 5.0, "review": "My dear husband bought me a Fire TV unit a couple of months ago, as I subscribe to several streaming video services, including the great movies and TV episodes I watch with my  Amazon Prime, which I highly recommend purchasing with this unit.The unit fits in my small hand, and the remote is also very petite.I have a Southern American accent, and the remote understands my voice commands every time.It was very easy to set the unit up with an HDMI cable ( not included- buy with the unit if you need one) and using the alphanumeric keyboard function on the remote to enter personal log in info for the streaming AV services to which I subscribe.I love my Amazon Fire TV unit so much that I bought my hubby one for one of our family rooms. We are a very happy and entertained family now. :)", "verified": true, "helpfulness": "0/0", "author": "AmandaTX"}, {"rating": 1.0, "review": "A horrible option for streaming. It has taken me 3 days to get the stupid thing to work and now that it is working the wifi won't stay connected longer than 3 minutes what a waste of time and energy. If amazing couldn't figure this bs out they probably shouldn't have started selling it yet.", "verified": false, "helpfulness": "1/5", "author": "Grace Burke"}, {"rating": 4.0, "review": "Some struggle with obtaining apps once connected. Had to look online and read some blogs to work my way through the setup. Have npt had an opportunity yet to stream video.", "verified": true, "helpfulness": "0/0", "author": "Bear"}, {"rating": 2.0, "review": "Most of the movies on prime are terrible. The movies that you want to watch you have to pay for even most of the shows that you can watch on cable. All the older movies that you've seen you have to pay for. What a joke. I got prime so I can watch shows when I wanted and not be prisoner to the times that cable has them on. But I think I will stick to my cable and record the shows like I've been doing.", "verified": true, "helpfulness": "0/3", "author": "Tammy L."}, {"rating": 5.0, "review": "Absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Randall S."}, {"rating": 5.0, "review": "Works Great so far", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]