[{"rating": 5.0, "review": "We love this knew device for watching Amazon Prime movies and television on the television that is not a smart television.  Great purchase!", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 5.0, "review": "My smart tv is / was infuriating. Terrible UI, under-powered hardware, difficult to use, and never buffered movies well (it constantly dropped off the WiFi).I even contemplated just buying a Mac Mini to hook up to the TV!Fire TV is everything I could have hoped for, if you're on the fence and you're a prime subscriber you must buy this. With apps for Pandora, Starz, Hulu, Netflix, and games as well as being an Android platform it's kind of a no-brainer I think.", "verified": true, "helpfulness": "0/0", "author": "Parnell A. Springmeyer"}, {"rating": 5.0, "review": "I bought a tv with built in WiFi and apps. The apps are glitchy and slow.The fire tv just works awesome. The voice search is fun to use. Much better", "verified": true, "helpfulness": "0/0", "author": "Rebekah Jackson, RN"}, {"rating": 5.0, "review": "I am absolutely thrilled with my Amazon Fire TV! We quit using cable a long time ago, choosing to go the Netflix/HuluPlus/Amazon Instant Video route. We were watching all of these apps on our XBox360. The video quality was not anywhere near HD, and we would constantly have buffering issues, even after upgrading our internet service to increase download speed. We got Chromecast to stream stuff from our browser. The Amazon Fire TV is a night and day difference - HD quality, no streaming/buffering issues, almost instant streaming, super simple interface. The video quality is like going from rabbit ears to cable (for those of you who can remember back that far!) I couldn't be happier with my Amazon Fire TV. If you are using the apps I listed above, this is a must have.", "verified": true, "helpfulness": "1/1", "author": "Jay Steele \"Jay Steele\""}, {"rating": 5.0, "review": "In our first week of using Amazon Fire, we did notice a delay (now resolved) when returning to a Hulu program after a commercial - the screen was blank for 5-10 sec though audio was fine.  That seems to have been addressed in a recent automatic update.  Whether Amazon Fire, Apple TV or Roku, all of these work, but work a tad differently, so we are still getting used to the new user GUI.  We've not used the voice activation much yet, though we've played with it enough to know it works quite well.  I often think it's smart for users to \"wait a year\" for bugs to get worked out, but not with Fire TV.  It's ready for prime-time now, and will only get better.", "verified": true, "helpfulness": "1/1", "author": "Kate McInnerney"}, {"rating": 5.0, "review": "The most striking thing about the Amazon Fire is the ease of set up and use. It took less than ten minutes to attach the device to our TV and we were in business almost immediately with a larger selection of movies, tv, and documentaries than is available from any other source we have. I gave one to my 90 year old father-in-law and he's thrilled with it. Anyone would be. Highly recommended.", "verified": true, "helpfulness": "1/1", "author": "David Milofsky \"Jean Milofsky\""}, {"rating": 5.0, "review": "When I say we absolutely love this, I mean it. This is the best thing since Apple Pie if you know what I mean. We have used it every day since we purchased it. So many free movies and more. The new releases are very inexpensive and you have all types of option of how you want to watch it. Luv Luv Luv", "verified": true, "helpfulness": "1/1", "author": "stacey bates"}, {"rating": 2.0, "review": "Now that I've been using the box for a couple weeks I'm getting used to it.I find it difficult sometimes to separate the included prime content from the pay content.Many of the TV shows are $1.99 per episode that should be included.Searching for content is time consuming and I find it easier to choose videos etc from my laptop and save them to my watchlist.My Roku has more to offer with less hassle.", "verified": true, "helpfulness": "4/5", "author": "jean chouinard"}, {"rating": 5.0, "review": "I unpacked the device, plugged it in, attached the HDMI cable (purchased separately) and changed the source on the TV to the proper  HDMI input.  The Amazon Fire TV displayed my wireless router and I typed in my password and the menu displayed.  Took longer to type this in than the setup.I am a Prime member and had access to all the free movies and TV shows under prime as well the pay ones.  The setup option was easy to navigate.  I also uploaded some picture from my phone to the Cloud and saw then on the TV in a matter of minutes.  The Amazon Fire TV was well worth the cost to me.", "verified": true, "helpfulness": "0/0", "author": "Lew"}, {"rating": 4.0, "review": "Husband absolutely loves it!  A new toy for him.  He especially likes the music where he can listen to what he wants to at any time.  Good gift!", "verified": true, "helpfulness": "0/0", "author": "Voracious Reader"}]