[{"rating": 5.0, "review": "Fire TV came fast and has been an awesome product - we have been able to cancel cable. The apps that are available fit our needs!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth W. Daly \"Liz Daly\""}, {"rating": 5.0, "review": "Only thing I don't like is its all about Amazon. Which isn't a bad thing, just miss the freedom and selections that the Roku has.", "verified": true, "helpfulness": "0/1", "author": "Aaron Kelley"}, {"rating": 5.0, "review": "Fantastic device.  I've got a Firestick in the bedroom and love it, but my living room is hardwired with Cat6.  I really wanted something that I could plug in.  Amazingly fast.  I haven't tried the voice activation yet.It seems everything that Amazon puts their name on is fantastic.  We have 5 or 6 Kindles, 3 Kindle Fires, a Fire Stick and now the Fire TV.  If Amazon comes out with anything else I'll buy it immediately.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Remote control was not in package", "verified": true, "helpfulness": "0/2", "author": "gene"}, {"rating": 5.0, "review": "Love this.  Even a 66 year old techno-tard was able to install it!  That is almost a miracle.  It helps that my daughter is letting me be one of her users of the pay for sites.  I'm an Amazon Prime member as well.  I'm a little disappointed that there isn't really many free Prime shows/movies that I'm interested in.", "verified": true, "helpfulness": "0/0", "author": "Peanut"}, {"rating": 5.0, "review": "BRIGHTER PICTURE AND EASY TO INSTALL.", "verified": true, "helpfulness": "0/0", "author": "Marvin A.Katz"}, {"rating": 4.0, "review": "Good so far!", "verified": true, "helpfulness": "0/0", "author": "Tyler LeCompte"}, {"rating": 5.0, "review": "Great little device, turned my TV into a smart TV. Love the voice search on amazon, to bad you can't search free content. easy to install, and use. Learning about the games.", "verified": true, "helpfulness": "0/0", "author": "VGK"}, {"rating": 5.0, "review": "This streaming device is amazing. As long as they keep adding more channel apps like TNT, TBS and more. It already has ESPN, Disney and many more. Perhaps the only thing it is missing is CLASH OF CLANS!!!! Other than that, this device is amazing and fast. A week after I received this device, I cancelled my DirectTV box to my room. Who needs cable when the Fire Tv has HBO, Showtime and most importantly SLING TV. I recommend this device to anybody, that is looking to get rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Yobany"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "terrie"}]