[{"rating": 5.0, "review": "This is dangerous technology!. Since I received this for Christmas, I have stopped watching regular TV.  Being able to watch full seasons of my favorite programs (without commercials) has liberated me, but also has tied me to my couch. I am very happy!", "verified": true, "helpfulness": "1/1", "author": "Maverick1961"}, {"rating": 4.0, "review": "It's a very good product, fast, efficient,  i like very much, sometimes it breaks, and i have to restart, but anyway its worth a lot!", "verified": false, "helpfulness": "0/0", "author": "Conrad"}, {"rating": 5.0, "review": "Just what I was looking for. Netflix + amazon + apps all in one very quick responsive unit!", "verified": true, "helpfulness": "0/0", "author": "Tim Braun"}, {"rating": 4.0, "review": "It was a Christmas gift.", "verified": true, "helpfulness": "0/1", "author": "John P. Cramsie"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Richard Harvey"}, {"rating": 4.0, "review": "It would get 5 stars but it freezes alot after continued play have to reset it ro fix I would also like to have the option to get the game controller for less than $40.00 thats too much give a discount coupon or something when you buy the unit", "verified": true, "helpfulness": "1/1", "author": "Blane Hensel"}, {"rating": 3.0, "review": "Would like to have the capability to view more movies through Amazon Prime - most movies require a rental fee.", "verified": true, "helpfulness": "0/1", "author": "Sherri G."}, {"rating": 4.0, "review": "I purchased the FireTV even though I could access much of the same content through my Sony HDTV. Frequently I had experienced problems with outages and choppy streaming when connecting through the Sony server. These problems have nearly been eliminated with the FireTV. I did experience one minor problem with set up. All of my existing home theater components (Blu-Ray, DVR, etc.) are switched through my Onkyo TX-NR808 receiver. When I connected the FireTV to an open HDMI input, I was not able to bring up the home screen on the Sony TV. The Onkyo receivers are known to have HDMI handshaking problems with some components, so I connected the Fire TV to an open HDMI input on the TV. The setup program came right up and everything was working in just a couple of minutes. I still have sound through the receiver and 7.1 speaker system via the audio return channel through the HDMI connection between the TV and receiver. So far I have only streamed content from Amazon and the Berlin Philharmonic, but have been very happy with the responsiveness of the FireTV compared to navigating through the software on the Sony TV.", "verified": true, "helpfulness": "0/0", "author": "Grigori"}, {"rating": 5.0, "review": "Great product and works well. Like hooking up your TV with an Android operating system for games and apps.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 4.0, "review": "works well,lot of free prime content,needed to power down and back up to reconnect,not sure why yet. Haven't had it long enough but seems like a good add -on to catch up on shows I've not seen", "verified": true, "helpfulness": "0/0", "author": "dc"}]