[{"rating": 4.0, "review": "I like this device.  I can watch prime and instant videos as well as Netflix and YouTube.  I also have a Chromecast, but I can't watch all of these on it without slot of extra trouble.  It's smaller than I expected though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "jesse smiley"}, {"rating": 5.0, "review": "Great works fantastic. Wish i had purchased sooner. Definitely worth the price", "verified": true, "helpfulness": "0/0", "author": "Neil W  Hampton"}, {"rating": 5.0, "review": "Uber fast and user friendly,  about and beyond expectations.", "verified": true, "helpfulness": "0/0", "author": "ivan bernstein"}, {"rating": 5.0, "review": "Love the fire. Just buy one.", "verified": true, "helpfulness": "0/0", "author": "Shadow Valley Arms Co"}, {"rating": 2.0, "review": "First box did not work. Had to have it replaced.  So far the second box is fine. So if I had to rate it again it would be 4 stars", "verified": true, "helpfulness": "0/0", "author": "sonya"}, {"rating": 5.0, "review": "Great product! But don't take MY word for it!", "verified": true, "helpfulness": "0/0", "author": "Jayson Doyle \"Jayson Doyle\""}, {"rating": 4.0, "review": "I love the fire tv platform. I decided to upgrade to the beefier Full fledged model after using a stick for the enhanced responsiveness. In general I haven't been disappointed. though i think my remote is having issues maybe because it often detects the stick and briefly gets confused as to which it is paired with I'm not sure. the only other issues in my experience are: 1. lack of cross provider support ( competition doesn't like playing nicely with amazon Or Amazon doesn't want to play with them. i could expound but others already have and i did in my fire tv stick review which is more involved)2. Lack of custom shortcuts readily accessible from the homescreen. I bought an app to help with this and give access to side-loaded apps but i wish the default home option had a FAVs section right by recent and that either that or recent was the first thing selected After hitting Home ( currently its some suggested content add). Overall worth it but I'd like Amazon to scale back the suggested content as I usually want to get to the same apps all the time and rarely want to pursue what is suggested on home. Suggest when selecting video or apps but not always at the home screen. If you keep it at least make it a sub portion of the screen instead of the first thing you can select and having it take up the majority of the  screen.", "verified": true, "helpfulness": "1/1", "author": "Josh EE and all Techcentric"}, {"rating": 5.0, "review": "Works great, and easy to set up. I wish they would allow a setting to view the movies/tv shows you own alphabetically but other than that I can not complain.", "verified": true, "helpfulness": "0/0", "author": "Scott Williams"}, {"rating": 5.0, "review": "Amazon Fire TV is fantastic.  It is worth every bit of the price and is a better choice than the other options on the market.  The best thing about this is that the remote is very, very easy to use.", "verified": true, "helpfulness": "0/0", "author": "JOHN"}]