[{"rating": 3.0, "review": "Great packaging. Nicely built unit ( Apple influenced). Free program content disappointing with Prime. Everything else costs.", "verified": true, "helpfulness": "1/2", "author": "Davef"}, {"rating": 2.0, "review": "It seemed great on paper, but I have yet to be blown away by this device. It works as expected, but doesn't offer me anything that my PS4, XB1, 360, wii, or apple tv offer.", "verified": true, "helpfulness": "2/4", "author": "metfoo"}, {"rating": 5.0, "review": "Extremely pleased with the Amazon Fire TV so far, all the online streaming is great and extremely fast. Like how they pre-buffer movies so that it basically starts instantly if you decide to watch it. Haven't done anything gaming wise with it yet so I can't review that part of it. As for my personal library of movies, pictures etc. I installed the Plex app along with the Plex server works really great and fast. So far no issues at all and very happy with it, so much so that I ordered 2 more :)I'm replacing my older WD Live TV's with this, and don't regret it one bit!", "verified": true, "helpfulness": "1/1", "author": "George Y."}, {"rating": 3.0, "review": "Its the weakest streamer compared to Roku, Apple, and even Chromecast....unless you're only using it for Amazon movies. The voice search works amazingly.  The app inventory is severely limited. There are a few of the most popular ones available but the other streamers app libraries offer those also and much, much more.  http://www.cnet.com/news/chromecast-vs-apple-tv-vs-roku-3-which-media-streamer-should-you-buy/", "verified": true, "helpfulness": "0/2", "author": "Theerock"}, {"rating": 5.0, "review": "I love my new Fire TV, but the customer support needs some work. When I took my Fire TV out of the box and hooked it all up I noticed it was missing the music on the home screen. I looked on line at Amazon's website and support and it said to go to home screen and hit the music button, THERE WAS NO MUSIC BUTTON.So I made a phone call, and the problems began. For starters the phone tree has no options for tech support for Fire TV, that is the first problem. I ended up talking to 5 different people, all over the world, and it took more then an hour to fix my problem. I talked to kindle people, music people, several Fire TV tech support people, and no one knew what was wrong. I did ask one lady if she ever even has seen a Fire TV because she did not even know what the home screen looked like.The 5th person I talked to, put me on hold for a while and realized that my new Fire TV was missing an up-date and that is why the music button was missing. He instructed me on what to do and he sent me the up-date and then my entire Home Screen changed and the music button was right below the photos on the home screen and now it all works great.The people were all very nice, but how could Fire TV tech support not even know what the home screen looks like? And why do I have to talk to 5 different people and spend over an hour just to get an up-date? Shouldn't that be the first question?I still give it 5 starts because the Fire TV works great and all the people were very nice, but Amazon needed to work on their tech support.", "verified": true, "helpfulness": "1/1", "author": "chris harris"}, {"rating": 5.0, "review": "We cut our ties to cable about a year ago. We have been streaming shows and movies from our prime account to the TV using our Kindle. It worked well enough, but we decided to buy the Amazon Fire TV because it comes with a remote. What a great product!It is easy to use and we love the vast amount of free content we can access through our prime account.  The kids love watching youtube videos on TV and have found many other apps to download, which has increased the amount of content we can view using our Fire TV.", "verified": true, "helpfulness": "2/2", "author": "L. Strehle"}, {"rating": 5.0, "review": "The Amazon Fire TV is the first device of its kind that I've owned after wanting something of its ilk for my living room. Prior to purchasing I had looked at alternatives such as the Roku and Chromecast with the main intention of using it as a simple Netflix player. I'd held off on the others at the time due to other reviews stating slow playback or resolution problems with each.I was close to just getting an Ouya as it seemed to be the best bet (more memory and processing) but it had problems with the Netflix app as well.Then I saw the ad for the Fire TV and took a look, the hardware specifications immediately looked very promising and as a owner of the Kindle Fire HDX I was already familiar with the Amazon app ecosystem and the idea of a robust player that I could image mirror my kindle to was very tempting, I gave in and bought it.I picked up the Game controller as well and when my Fire TV arrived the first thing I did on it was setup Netflix and try out Sev Zero, both worked perfectly and gaming on the device wasn't too bad. For the next couple weeks I used it here and then for Net Flix primarily, but the biggest game changer for me was when Amazon offered Plex as its free app of the day. After that day the Fire TV became something I use on a daily basis, either for movies on Plex (or through Amazon) and I even play more games on it after more became available (Unpossible is amazing, use the controller though), so much so that I've actually cancelled my Netflix subscription because between  Plex and Amazon Instant Video, I don't use it anymore.The Fire TV has been a great purchase, it ended up turning something I had a passing interest in to something I use (on some days) more than my computer. Now if Steam would make a streaming app for it, I never leave my living room.", "verified": true, "helpfulness": "0/0", "author": "Arbitrary"}, {"rating": 2.0, "review": "You get all the free channels and shows that apple offers.", "verified": true, "helpfulness": "0/2", "author": "Gina Besignano"}, {"rating": 5.0, "review": "Very easy to set up and use.  My wife absolutely loves it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like it but as a prime member I feel that you should be able to separate by genre, and the movies that are only available to rent or buy should be separated in its own category. if I pay $100 a year for prime I only want to see listed for what I can actually watch.", "verified": true, "helpfulness": "0/0", "author": "jon"}]