[{"rating": 5.0, "review": "My kindle fire is now 60\" wide in 1080p :) best tv tablet on the market, and I can play all my favorite android games.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "First, I love the Fire TV. I have two of them and would have four but I bought two Smart Visio TV's from Amazon.That said, I need to be able to have multiple credit cards listed so I can bill movies to anothr account. How do I do that?", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 4.0, "review": "Great Product, soooo easy to set up and use.The voice search  is always on the money and does away with allthe typing and hunting, but it only points you to Amazon products.", "verified": true, "helpfulness": "0/0", "author": "Buy Gone \"buygone\""}, {"rating": 5.0, "review": "I gave it 5 stars, because is the best box I have used so far.Easy to use and the wireless is fast.I recommend it", "verified": true, "helpfulness": "0/0", "author": "Jose R. Conde"}, {"rating": 3.0, "review": "I purchased the Amazon Fire TV for my wife as a Mother's Day gift. Overall we both really like and enjoy it, but there are a few things we really would like to see in the future hopefully. I think they would help round the box out and make it more user friendly to everyone interested.First the pros:-The box seems pretty zippy and responsive. I can't compare to Apple TV or Roku because I have never used them, but it seems to flow through everything quickly and easily.-The voice searching works great. I love using this...it beats spending 5 minutes typing out a movie or show name.-It looks great. I like the sleek, clean, black look of it. The weight of it also feels good...its feels like a quality part.-Decent selection of apps for our personal taste. We mainly watch shows and movies, so between Prime, Netflix, and Crackle, I think we will be pretty well covered.Cons:-Searching can be frustrating and cumbersome. I understand that since this IS an Amazon unit, it is going to have some bias towards Amazon, but this can make things pretty annoying. Let me elaborate. If I were to search Amazon for the movie \"The Hangover\" it will come up with no issue. However, \"The Hangover\" is not available free from prime.There is an option that states \"More ways to watch.\" If you click on this you will have the options to buy or rent the movie. But, what if \"The Hangover\" is available on Netflix? You won't know UNLESS you go look at Netflix. I think Amazon makes this difficult for you, because you won't feel like searching Netflix and will just buy or rent it through Amazon. This would be a much better unit if when searched, it was cross referenced with ALL subscribed apps to find all viewing options...rather than guiding you into a direction to buy strictly from Amazon. I want to spend more time streaming and less time searching.-No capabilites for searching only Prime. Again with searching...we bought an AMAZON box and are paying for AMAZON prime...however from what I can see, there is no way to browse ONLY free Prime shows and movies. You can search all movies and shows of AMAZON, but not all of them are prime...this means more options are coming up for renting or buying. Please consider configuring an area on the unit that is stricly Prime to make searching more user friendly.So far those are the two major downfalls I have come across that frustrate me. When I turn the Fire TV on, I want to be quick and to the point. I bought the unit to help me stream the FREE media that Amazon provides to me with Prime...but I feel like they are pushing more to try and get you to pay for shows and movies. Must be some sort of marketing scheme. Hopefully they hop on board with making things more USER (aka customer) FRIENDLY, and not so much Amazon Profits...ha", "verified": true, "helpfulness": "0/0", "author": "Geoffrey Constable"}, {"rating": 5.0, "review": "I received the Fire TV as a Mother's Day gift from my son. As usual with things like that, he set it up (about 3 min- had to find an empty outlet).  Once everything was plugged in it started working. I love the remote that comes with it, not a lot of buttons and easy to use(nothing unnecessary). Tried the talking to it feature and it worked beautifully, better than the Sync in my Ford!  Easy to navigate between screens and the movies stream quickly with a great picture. I downloaded a game I had purchased from Amazon for another device, that took a long time, but I just wanted to try it. I will continue to game on my laptop and tablet.All in all, this is a great device and the price is amazing! To be able to do the same thing on our main tv we spent $400 for a Playstation and this is much easier to use. I would definitely suggest that anyone who is on the fence, don't hesitate.", "verified": true, "helpfulness": "2/2", "author": "S. Flanagan"}, {"rating": 3.0, "review": "Pros:It's made really well, the remote feels really nice in your hand, its very quick and the voice command works well.Serious Flaws:I bought The Bards Tails as it was recommended to me by amazon on it's game menu.  The problem ?* _There is only 8 gigs of memory, and it's not expandable_.I have now purchased the game and there is not enough space on the device to download it!  This can never be 'meant for games' with so little storage.* It drops wifi all the time.  My Roku3 _does not do this_.Other Problems:* The right button is so sensitive, it almost always goes over two spots instead of one.I'm a loyal amazon customer, I have every generation of the kindle, but I'm returning this one.My recommendation: Wait till they fix these early adopter issues.", "verified": true, "helpfulness": "1/1", "author": "Charles Sanders"}, {"rating": 4.0, "review": "Love this amazon fire, kids love the games. Loads super fast. Wish it focused more on Amazon prime. Very nice menu.", "verified": true, "helpfulness": "0/0", "author": "Timothy Cristofoletti"}, {"rating": 4.0, "review": "Overall great box for streaming content. It has the right hardware (hdmi, opt out, Ethernet port). Interface is good, but not great and eerily close to the xbox interface. Remote is good and the Bluetooth part is a must vs IR. The processor speed is also really good. Missing XBMC and an iPad app remote solution to control the box, which would complete it. Plex is good, but you need a remote plex server, which is a pain.Again, great first cut, but it needs a few adds, which I'm sure Amazon is considering.", "verified": true, "helpfulness": "0/0", "author": "SF"}, {"rating": 5.0, "review": "Love it and it is so easy to hookup and use, particularly the voice search.  It recognizes my voice everytime.", "verified": true, "helpfulness": "0/0", "author": "Gary C. Kohring \"Music lover\""}]