[{"rating": 5.0, "review": "small, sleek, fast, could use more apps, i am sure they're coming,loved the microphone, picks up everything, regardless of accent", "verified": true, "helpfulness": "0/0", "author": "Robert Hershkovitz"}, {"rating": 1.0, "review": "What a disappointment. USer interface: great. Ease of use: great. Ability to watch free content on the web-- AWFUL. Very few free shows or movies to watch. Unable to access content on web from streaming sites that don't charge. THe voice commands might be better uited to : come take my money. This has so much potential to break the stranglehold that cable TV has. User interface & ease of use puts Google Chromecast to shame- but Chromecast allows you to watch whatever you want. Fee based or not. THe way this thing works-- Amazon should give these away for free. Can't believe I spent $100 for a devie that is constantly trying to take money from me..Apple-- where are you? Someone PLEASE break the cable monopoly!", "verified": true, "helpfulness": "4/11", "author": "james gregory"}, {"rating": 5.0, "review": "I had used Roku for three+ years and my purchase of the Fire TV was and is exactly what I had hoped for. There is nothing wrong with the Roku; the Fire TV simply offers more channels and more movies... plus, I am able to access NetFlix... AND listen to my Pandora radio channels. There's a lot to love about Fire TV..!", "verified": true, "helpfulness": "0/0", "author": "J. W. Stanfield \"JustJim\""}, {"rating": 3.0, "review": "I got Amazon fire tv because the smart tv I had bought a few days earlier couldn't pick up the wireless signal from my bedroom to the living room although my kindle fire could. I was amazed but a tad confused on how mixed up everything was. I have Netflix and Amazon Prime. The voice response was a kick until I said Orange is the new Black. It picked it up but when I clicked on it I was taken to a show called Addiction. Said something about a cast member from Orange is the new black. Like the fool I am i said it again and got the same thing and clicked on it. Now I am billed 1.95 or  8 for a 19 minute show I don't even want to see and will dispute. I thought I had a pin for purchase but I guess I have to put it in again to stop this. I think the lists of shows is a real big problem. I never could get it to pull up Orange is the new black so have to watch it on my computer. I want to be able to stop all non Amazon prime shows and only see Netflix that I don't have to pay extra for. If I can do it on my computer, I should be able to do it on the tv. Please reprogram this part. I am 73 so too much technology and I am lost.", "verified": true, "helpfulness": "0/2", "author": "Sandy Batt"}, {"rating": 5.0, "review": "Outstanding product!  Arrived as promised, took less than 15 minutes to install and have up and running.  Works exactly as promised.  Make sure to order the Amazon Basics HDMI cable at the same time if you don't have one already, excellent price on the Amazon cable.", "verified": true, "helpfulness": "0/1", "author": "GarRey-AZ"}, {"rating": 3.0, "review": "Nice hardware that can potentially become my choice of video streamer, but not now - returning the device due to limited selection of apps and no work-around to install what I need using web browser and file manger (there is none for FireTV as of now).", "verified": true, "helpfulness": "1/1", "author": "Nat"}, {"rating": 5.0, "review": "It's going to be a long time before I watch 'regular' t.v. again.  Amazon Fire TV was so easy to set up and has such great features that I feel like I actually have control over all my content for viewing. I am technologically challenged in so many areas, but with this venue for watching t.v., movies, etc. I've got this!  So glad I purchased this!", "verified": true, "helpfulness": "0/0", "author": "Martha B."}, {"rating": 3.0, "review": "Have to enter Flixter login and password every time you exit and reenter to view movies which is a long slow process. That's the only negative I have.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm on my way to cutting the cable out of my life. Ever since I received this I have not watched local on my main tv since. It's so fast and easy to use. I plan on buying these for my other TV's. And use a good HD antenna as a back up to get news. bye bye cable.", "verified": true, "helpfulness": "2/2", "author": "HTowninspector"}, {"rating": 3.0, "review": "No ones mentioned it compared to Boxee, which is my streamer of choice mainly due to the amount of local content it'll play, I've yet to see anyone mention anything but plex? I'm not going to try it unless it streams local media (-all types-)!out of the box", "verified": false, "helpfulness": "0/1", "author": "Brian Dean"}]