[{"rating": 1.0, "review": "Doesn't work with the Netflix app.", "verified": true, "helpfulness": "1/7", "author": "Matthew Steltz"}, {"rating": 5.0, "review": "Love this thing!  So easy with lots of options.", "verified": true, "helpfulness": "1/2", "author": "Sheri Burnham"}, {"rating": 5.0, "review": "Great product love having HBO Go, with it had NHL Gamcenter but great product", "verified": true, "helpfulness": "1/2", "author": "matt"}, {"rating": 3.0, "review": "Hard to properly review because it quit working on the second day that I tried it.  Dead, as in dead.  Once I finally figured out how to contact Amazon and arrange to get it replaced, they are sending me another unit two day shipping.  That part eventually was good.  They are loathe to let a customer have a phone number here, apparently. The HD on the failed unit, prior to failure, did not seem to have very high definition...a bit fuzzy.  Also, Fire TV makes it difficult to do Netflix; the unit is designed to push you toward themselves.  We'll see how the new unit does on picture quality and I'll repost...Hoping for improvement.", "verified": true, "helpfulness": "0/0", "author": "VMAXBILL"}, {"rating": 3.0, "review": "Received as a gift. Would not have made this purchase, on my own. Interesting concept, for entertainment. This allowed us to view a couple of nice movies. And, I have enjoyed perusing the \"Apps\" and \"music\" sections.", "verified": true, "helpfulness": "0/0", "author": "E.J. Murphy"}, {"rating": 3.0, "review": "Very responsive, very easy to install and connect to network.  Has  limited number of apps watching movies and accessing internet content.  Waiting for the upgrade.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love love love it. I love the voice search - no more listening to my hubby curse. ONE PROBLEM AMAZON! We lost the remote - ACK - Can we buy a new one?", "verified": true, "helpfulness": "1/1", "author": "Judith Schmitz"}, {"rating": 2.0, "review": "I am a Prime member, but without DLNA support, Fire TV is a non-starter.  My 5 year old TV and DVD player both support DLNA and a host of other services.  I am looking for a single product that can front-end my new AV receiver, and DLNA is a must-have for my NAS-based video and music collection.", "verified": false, "helpfulness": "0/1", "author": "Ed_Audio"}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/1", "author": "Yasser"}, {"rating": 4.0, "review": "Easy to use. It shows up on the TV source list automatically. I like the remote very much.One complaint is, I am not allowed to purchase instant video on spot.", "verified": true, "helpfulness": "0/0", "author": "Ryan Lee"}]