[{"rating": 5.0, "review": "Love it! If your an Amazon Prime member it is the best for streaming and listening to your prime music right from your library. You can do Netflix, Sling TV and still have access to all of your amazon prime. I would highly recommend this to anyone of interest. In fact I just ordered my aunt the Amazon Fire TV Stick. If you don't have Amazon prime it is still a great device for your other applications.", "verified": true, "helpfulness": "0/0", "author": "MONICA LAUCKS"}, {"rating": 5.0, "review": "Love it except Netflix doesn't always work", "verified": true, "helpfulness": "0/0", "author": "Kennie C. Morgan"}, {"rating": 5.0, "review": "I love this. It allows me the ability to watch the movies, TV shows and sports I want without having to spend big bucks with the satellite providers.", "verified": true, "helpfulness": "0/0", "author": "David Crozier"}, {"rating": 5.0, "review": "I love it. It works a lot better than I thought.", "verified": true, "helpfulness": "0/0", "author": "Felicia A."}, {"rating": 5.0, "review": "The fire itself is excellent! The voice activation is easy to use and the entire unit is very easy to install. I was just disappointed that older movies  came with a price tag! I would think that these would be free since we have Amazon Prime. VERY disappointing!", "verified": true, "helpfulness": "1/1", "author": "Eva Osmun"}, {"rating": 1.0, "review": "The Wi Fi Signal in my Bedroom was too low !", "verified": true, "helpfulness": "1/6", "author": "calvin hashimoto"}, {"rating": 5.0, "review": "Quick set up was great", "verified": true, "helpfulness": "0/0", "author": "George Muehl"}, {"rating": 5.0, "review": "Great purchase!", "verified": true, "helpfulness": "0/0", "author": "Victor Duncan"}, {"rating": 5.0, "review": "Love my Fire TV! I dumped cable when I received this and haven't looked back. I have HuluPlus to go along with it but even with paying $7.99/month for that and that my internet charge went up, I am still saving over $75/month. Very easy to use with the easy set up. My 5 year old can operate it without issue and loves the voice recognition feature...even if it doesn't always understand him :-)", "verified": true, "helpfulness": "0/0", "author": "Kristi"}, {"rating": 5.0, "review": "This device is so much more than I expected. There are an incredible number of free apps. I could never watch all this programming. I love the ease of the remote and the voice recognition system is so good it's scary. If you want to dump cable, this is the gold standard of wireless TV. This system is a home run !", "verified": true, "helpfulness": "0/0", "author": "kaline06"}]