[{"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/2", "author": "Dwayne Valentine"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/2", "author": "amber gross"}, {"rating": 5.0, "review": "We are LOVING our Amazon Fire TV!!! We have an Amazon Prime account and a Netflix account. Netflix runs MUCH better with the Amazon Fire TV box. With this box, our entertainment choices have much increased! Also, I like that Prime has both free and \"pay per view\" choices. With \"pay per view\" you get to watch more recent movies and TV series for a good price.", "verified": true, "helpfulness": "0/2", "author": "L. Anderson \"landorasue\""}, {"rating": 5.0, "review": "I am still learning how to use it but I am very pleased so far", "verified": true, "helpfulness": "0/2", "author": "Fred Wudell"}, {"rating": 5.0, "review": "It is so easy to use.. very user friendly.. everything I want at my finger tips and it's voice activated", "verified": true, "helpfulness": "0/2", "author": "Viki Siderakis \"PinpointVS\""}, {"rating": 4.0, "review": "I prefer this over the Roku units I have, including a Roku 3 XD. You can sideload apps like Kodi/XMBC which is very cool. The response is much better than the Roku, this unit has more power behind it, it seems.Mine has some weird goop on the front from something that I peeled off, so there was a QA issue on the line with my unit. Otherwise I'd rate it 5 stars. I'd really like to try out a fire stick to see how well it works.", "verified": true, "helpfulness": "0/2", "author": "SB"}, {"rating": 5.0, "review": "I live Amazon Fire TV.  The User Interface is super easy to use.... it works without a lot of bugs etc.  I highly recommend it.", "verified": true, "helpfulness": "0/2", "author": "Russell Gentry"}, {"rating": 1.0, "review": "1. most expensive product of this type on the market. 2. Do not liek that it requests credit card information to activate. 3. Adding channels is very confusing - not user friendly. 4. 2 installed  weeks and I don't have even 1% use of the procduct.", "verified": true, "helpfulness": "0/4", "author": "rocky cephas"}, {"rating": 5.0, "review": "Happy", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely love this unit....we can watch movies, TV shows etc, without those danged annoying ads every two minutes...If you don't have Fire TV yet...get it....NOW !!!!!!!!!!", "verified": true, "helpfulness": "0/2", "author": "William Gibbs"}]