[{"rating": 5.0, "review": "It's Great! I love it!", "verified": true, "helpfulness": "0/0", "author": "Matthew Grady"}, {"rating": 5.0, "review": "Awesome! I also have a an Apple TV. Fire is way better. Faster cleaner streaming and the interface is much better with more options and much easier to find what you want.", "verified": true, "helpfulness": "0/0", "author": "Anthony Devito"}, {"rating": 5.0, "review": "Awesome time to cut the cord", "verified": true, "helpfulness": "0/0", "author": "Albert Casas"}, {"rating": 4.0, "review": "We are still trying to figure out all the information...", "verified": true, "helpfulness": "0/0", "author": "Patricia Rumble"}, {"rating": 1.0, "review": "I thought when I bought this I would be able to cut my cable. That is not the case at all. I downloaded the ESPN App. It requires a cable subscription to access it. So, I signed up for Sling TV so I didnt have to have cable. Sling TV app didnt work within the Amazon Fire TV box. Furthermore; Patel, the customer service rep for Sling TV, from India was unable to speak clearly enough for us to have an intellgent conversation. So I gave up. Cancelled to 14 day trial with Sling TV, and Im returning the Amazon Fire Box today. Disppointed big time in Amazon, the box, Sling TV and their customer service.", "verified": true, "helpfulness": "2/3", "author": "Brian K Martin"}, {"rating": 5.0, "review": "Have retired the Apple TV to the living room.  Love this unit.  Netflix, Amazon Prime, HBO Go, and Hulu.  Does it all and have had no problems.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "Absolutely Awesome !!!!!!!  Definitely worth the price !!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Carole K."}, {"rating": 5.0, "review": "Love, love, love it!!!!  One of the best things I've bought in a while.  Have dropped my cable down to the very basics, only kept the cable so I would have local channels and ESPN.  My cable bill has dropped $50/month and the cost for Netflix and Hulu is less than $20/month + $99/year for Amazon Prime membership.  That saves me $261/year I can use to buy beer & chips! Only issue is the remote didn't last very long, my daughter dropped it a few times and it stopped working.  No problems with that, just downloaded the Fire TV remote app on my iPhone and I'm good to go.", "verified": true, "helpfulness": "0/0", "author": "Matthew Pyhtila"}, {"rating": 5.0, "review": "Amazon Fire TV is a great streaming video device.  It is fast, responsive and in the limited testing that I’ve done has worked flawlessly. For that  I give it 5 stars.  However, it is not the single device solution that I thought I was getting.  Since the description mentions that you can use it to play your personal videos and since it has a USB port I assumed that it could play my videos from an external drive and I purchased it as a way to get streaming video and to replace my Western Digital Live TV box.  Unfortunately that is not the case.  The device will not recognize an external drive plugged into the USB port.  I can’t actually find a use for the USB port.  The only way to play a personal video appears to be to upload it to the Amazon Cloud and then have it streamed back down to the Fire TV.  This is not the solution that I want to use for the hundreds of hours of video that I have.  So for now the Western Digital Live TV box remains my primary device for viewing video.  I will keep the Fire TV to use on a TV that doesn’t have an Amazon Prime Video app, but I really wish Amazon would enable the USB port and provide the software to play local video, then Fire TV would be a great single device solution for video.", "verified": true, "helpfulness": "2/2", "author": "Rick Longbrake"}, {"rating": 5.0, "review": "Great product so far. I've only had it for about three weeks. It's easy to setup and very straightforward to use.The only thing I would change is the voice search. It would be nice to have it search the current application that is open. I have found it useless when I'm searching for something in Netflix. It will quit out of the application search Amazon Prime for the title, which is not what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Michael Chhor"}]