[{"rating": 5.0, "review": "I've had my Fire TV for about three weeks now, and I love it. I was unsure if I needed one or not, because I have DVD players that will allow me to view Netflix and Amazon Prime and similar services. We also have two Smart TVs. I decided to take a chance on the Fire TV, because one of the reviews here mentioned that it would be faster and have a better interface than the DVD players or the Smart TV and that review was correct. It was also very easy to hook up. I did it myself in about five or ten minutes.So far, I love my Fire TV. When watching a TV show on Amazon Prime, I can find the show more easily, and when it's time for the next episode, it's right there waiting for me. (My DVD player interface required many clicks and waiting for menus to load in, just to get back to the episode list, then click on the episode, etc.) I love how quickly the shows start to play.  The Netflix Ap works great, too.Using the exact same internet connection and hookup (hard-wired), I had a lot of trouble with my DVD player buffering when trying to play Amazon shows (whether Prime or purchased). The shows would play, then buffer, then play for a few more minutes or a half hour, then buffer again, sometimes starting the episode at the beginning when I'd been more than halfway through. It was annoying. I rarely played an episode all the way through without running into this problem at least once, often multiple times, and we have a fast internet connection.After I got the Fire TV, I watched about a season and a half of a TV show from Amazon Prime, and it never buffered on me--not even once. (The first few episodes, which I watched before Fire TV, had the buffering problem.)Even though I have other devices I could use to watch Netflix and Amazon Prime, I think the Fire TV was worth it for me.  I'd actually like to get another one for our family room. I think my husband would like it a lot because it's just so much easier to use than the DVD player interface.I haven't played any games yet, but that is next.", "verified": true, "helpfulness": "3/3", "author": "reesah mouse \"Something about myself! ;)\""}, {"rating": 1.0, "review": "Returning this, it doesn't meet my needs.", "verified": true, "helpfulness": "2/9", "author": "Charles Sherman \"I have been listening to recorded books since 1980's. I am 72 years old and never knew I was Dyslexic until late. Thank God for Audible!\""}, {"rating": 5.0, "review": "Amazon Fire TV is EXACTLY what I was waiting for so I could FIRE cable, & satellite. It took merely a few minutes to install it once it was delivered. I'm just waiting for 'voice remote' to work with Netflix, HuluPlus, in addition to Amazon Prime videos. This is well worth the $99. And ANYONE who complains about Amazon raising their yearly 'Prime' price $20 needs to educate themselves on price comparison.  I literally did a spreadsheet on the amount of money I saved getting rid of cable/satellite. [$1,768.97 to be exact] a year.I bought a $10 antenna and I get all the local channels in I need for local news when I need it in real-time.  Which btw...is much better because if we have bad weather..cable and satellite 9 times out of 10 gets knocked off-- \"air\" doesn't.  Granted the 68 channels I get from the $10 antenna--60% are divided into spanish, religious and hsn channels. lol-- Again, I watch only for local news.The only thing I cannot find anywhere is how to 'refresh/update' all my apps. I'm sure if I call Amazon CS they'll tell me. I'm just used to being lazy now that Amazon Fire TV has spoiled me!", "verified": true, "helpfulness": "0/0", "author": "LilLuV"}, {"rating": 1.0, "review": "I purchase almost everything with the exception of food from Amazon. I have been a prime member since the inception of the program. Without exception, I have always received EXCELLENT customer service. Until now. I'm having difficulty with my Fire TV connecting to my wifi. Last Saturday I spent approximately 1-½ hours (maybe 2) troubleshooting with two women techs on the phone. \"Mary\" (who I was passed to from the first tech because of her expertise) said she thought it wasn't just a problem unique to me and asked me if she could call me back on Sunday after researching the problem. I had no problem with that. No call on Sunday so I called on Monday. Much to my surprise, there was no record of my call attached to my file. The rep was confused as to whether I was talking about fire wire or Fire TV so I was first sent to a different department. Finally, I got through that fire wire was not the same as Fire TV and I was transferred back to digital. We went through the same troubleshooting taking up a lot of my time. I was willing to do it until we were going around in circles and my phone was running out of juice. The gentleman asked me if he could research and call me later in the day. NO CALL. It's Tuesday--still no call.It really pains me to have to say anything negative about Amazon's Customer Service as it has NEVER BEEN LESS THAN EXCELLENT IN THE PAST.  I've noticed I haven't gotten a survey as I usually do after a customer service call. Whoever Amazon has farmed out their digital customer service to will ruin their excellent customer service reputation and they will lose sales because of it. I'm going to wager a bet that there is no record of the 3-4 hours of my time on the phone trying to solve a problem and no record of two promises to call me back. I would have had more respect for these reps if I had received a call saying they were sorry, but they weren't able to come up with a solution for me.I'm hoping Amazon has kept a record of my past reviews and will review my account and see just how much I've spent over the years as a loyal customer. I'm very disappointed that I had to write this review, and I'm hoping someone who can change things reads this and saves Amazon's reputation. I can't be the only one receiving this kind of treatment. It's obvious that the people who are \"techs\" for Fire TV are not the same techs that I've dealt with in the past. In fact, I don't think they are even in the same country. What a pity.", "verified": true, "helpfulness": "823/928", "author": "IMA"}, {"rating": 3.0, "review": "Easy to use.  but the set up is a little limited..  For example, an HDMI connection has the option of Stereo, or Dolby Digital Plus.  My receiver doesn't support DDPlus, so I ended up having to connect it via optical.Also, the remote appears to be RF, which means  it is doubtful it would ever work with a universal/programmable IR remote...But, it's simple, easy to use, and if you have Plex on a server at home, it's a good playback device.", "verified": true, "helpfulness": "1/1", "author": "TivoGuy \"Shopper extreme\""}, {"rating": 5.0, "review": "This is a great little box.  It plays games, and so much more.  My wife loves using the streaming TV with amazon instant video and so much more.  Things like netflix, iheartradio, and many other apps work great.  I am considering getting the controller to see what gaming is like.  The remote is easy to use, and voice search works just as advertised.  Thanks again amazon.  They let me finance the box, which is even better.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey D. Hewitt \"Book Warlock\""}, {"rating": 4.0, "review": "The Amazon Fire TV exceeded my expectations, but I will say, it doesn't bring anything revolutionary to the set top box arena.Wireless performance is strong; retired my Roku 2 immediately.  Plex application performance is stellar and looks ten times that of the Roku bland interface.The only con I have would be the voice search...  the voice searching features would be great if it would work within the launched app, such as Youtube, Plex, etc.. and not just the Amazon infrastructure.", "verified": true, "helpfulness": "0/0", "author": "JOSEPH L. BENEDICT, JR."}, {"rating": 1.0, "review": "I do not like this product for the following:  the product constantly loses connectivity to the network.  It regularly gives a network error and I have to disconnect it and restart it again or I have to forget the wireless connection and reenter the wireless password. If the kids are playing a game, it freezes. It does connect to my wireless, but the connection is regularly dropped.I also have the Roku 2 XS which I have been using for the past 6 months.  There have been no issues with the Roku as far as wireless connectivity no matter how many people are on the network.", "verified": true, "helpfulness": "2/2", "author": "JParker"}, {"rating": 5.0, "review": "I really like the choices of programming ... much better than my current cable provider.The idea of speaking my search terms makes a lot of sense.", "verified": true, "helpfulness": "0/0", "author": "Hal37"}, {"rating": 3.0, "review": "I ordered this as a Father's Day present for my husband.  The remote control that comes with it did not work.  I had to call the order center for customer service, because there is not information on how to contact them directly for this product.  They transferred me to the appropriate department, and they made me go through all of the troubleshooting suggestions that they suggest on the website,  I get this, that is what they have to do.  I told him that I was disappointed, because it was Father's Day, but I was sure that Amazon would make it right.  WRONG!!!!  Over a week later and I am still waiting for a replacement remote.  Still do not have a direct phone number to call them back either.  Fortunately, when I ordered it, I also ordered a game controller with it, so I am able to use it, just not with all of the cool features such as speak into the remote.  So far I think we like the Fire TV, but without the remote, I cannot give a true review.  I will write an update if I ever get a replacement remote.  I live in a rural area and order a lot from Amazon, and this is the first time that I have ever been completely dissatisfied in their service.", "verified": true, "helpfulness": "2/2", "author": "HogDog"}]