[{"rating": 5.0, "review": "This product is absolutely awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "Kimberly A. Vinci"}, {"rating": 3.0, "review": "Device is nice but it is a little buggy sometimes.", "verified": true, "helpfulness": "0/0", "author": "Jerome \"Jerome\""}, {"rating": 5.0, "review": "great picture, small and doesn't take up much room.  Easy to set up and navigate.  We loves it.", "verified": true, "helpfulness": "0/0", "author": "aj224"}, {"rating": 4.0, "review": "Good Deal , But Must Always Pay For Extra", "verified": true, "helpfulness": "0/0", "author": "M. Bassem Idriss \"Bassem C. IDRISS\""}, {"rating": 5.0, "review": "Our tv has an amazon app. Well, this blows that out of the water.", "verified": true, "helpfulness": "0/0", "author": "jon"}, {"rating": 5.0, "review": "Truly everything I could want, easy to install, easy to use, all around great buy", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Is ok... Not enough memory - USB port is just for charging. Wish it could upload or be another portal for more memory ... Not enough on prime tv to watch - what's is the point of having a prime account and still having to buy a lot of movies and games but then having no where to store them. Its basically buying a andriod from 08'", "verified": true, "helpfulness": "0/0", "author": "Alshanice"}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 4.0, "review": "This is a pretty nice unit.  Still new in it's being...  Much of the content you have to pay for, or is just not worth the time.  Of course, with Amazon Prime, you get a pretty large library of things.  Admittedly, I've also subscribed to Hulu Plus and Netflix in addition to Prime, but in doing so, cut the cable!  There are some cool games on here as well.  The talking feature is nice, and makes it easier to search, but you can also use your smart phone or Kindle as a remote which will give you a keyboard to actually type from.  Two things I would like to see improved on with this.  1. The ability to search ALL content over multiple services, not just Amazon's content (the Roku 3 can).  2. The ability to collectively control your content and services from Amazon (like Sony does).  Entering my username and password for every service, over all 3 Amazon Fire TV device that I have just gets old.  Granted, once it's done, it's done; but could be easier.  I haven't purchased the game controller yet, but I noticed it's required to play some games.", "verified": true, "helpfulness": "0/0", "author": "Geoff P \"-Geoff\""}, {"rating": 5.0, "review": "Excellent with Prime. Use it every day", "verified": true, "helpfulness": "0/0", "author": "Shawn"}]