[{"rating": 5.0, "review": "Easily set up, arrived preloaded with my Prime account settings. Question, to save data, I used the settings to 720.  So, I'm assuming here, this will stream video at a lower data rate even if the program is HD?", "verified": true, "helpfulness": "0/0", "author": "rglenn"}, {"rating": 2.0, "review": "I thought it will be much faster than Apple TV but unfortunately it didn't especially on loading", "verified": false, "helpfulness": "1/1", "author": "Abdulaziz Ali Haider"}, {"rating": 5.0, "review": "This is better than I thought it would be and now it is basically the only device we use to get entertainment on the TV as it has Prime (of course) and it has Netflix app too.  The way it works so that the Amazon Prime shows start immediately in full HD is fantastic.  Compared to Netflix, this is a big improvement, even though you wouldn't think it would be.  I guess Netflix did studies and decided that a bit of graininess is OK at the start for a fast load time, but the Amazon Prime technology/software is a far superior experience in my book.", "verified": true, "helpfulness": "0/0", "author": "Richard Tame"}, {"rating": 3.0, "review": "Should work better than it does considering its technical stats.  Seems like the Netflix performance is intentionally poor as Amazon incessantly pushes its subpar Prime offerings.  Despite a fast LAN wired internet connection, constant Netflix stuttering/buffering that is not present with any other device I have.  Buy a Roku instead.", "verified": true, "helpfulness": "0/0", "author": "Anon"}, {"rating": 4.0, "review": "Love it.... Works perfectly", "verified": true, "helpfulness": "0/0", "author": "YanMing Lau"}, {"rating": 1.0, "review": "It should not be HDMI only... I use an older T.V. in my home office and don't really need an HD TV being most of the time I am not looking at the TV screen just the computer monitor. Other then that I think it's fantastic.", "verified": false, "helpfulness": "1/16", "author": "Robert Redin"}, {"rating": 1.0, "review": "Bought it this evening, will be returning it to the store tomorrow. The Netflix app is broken. When I attempt to install/enable Netflix on my brand new Fire TV, I'm greeted with, \"Purchase failure. You have previously purchased Netflix. If your download hasn't started, it will begin shortly.\"Huh? I tried a factory reset, and the problem persists. I took a look at the Netflix app reviews within Fire TV's UI, and found a long list of complaints about a recent app update breaking Netflix. Not sure how Amazon / Netflix can afford to have such poor quality control on such an incredibly popular app.Too bad. It looks and feels like a high quality piece of streaming hardware. But no Netflix is a dealbreaker for me. Now I have to waste part of my day tomorrow returning this and buying another Roku. One star.", "verified": false, "helpfulness": "2/5", "author": "sinbad"}, {"rating": 5.0, "review": "I have been so impressed and satisfied with my Fire TV. I initially was uncertain about this device and bought it just to see how it would compare to Roku and Google TV and even my Vizio smart TV. After many months of use I have come to the conclusion that this is the best device that I have ever used for streaming movies and TV. I have rarely if ever experienced any lag with this device and it seems to move between apps and content with both ease and speed.I recently bought a Samsung Smart TV and so I gave my fire TV to my daughter to use in her room. I thought the Samsung TV would be just as fast and efficient as the Fire TV, boy was I wrong. Even the Samsung TV seems sluggish compared to this tiny little device. Pretty sure I'm going to be getting one of these for every TV in my house.The one thing I do wish was that this device had an app for searching the web", "verified": true, "helpfulness": "0/0", "author": "steven duncan"}, {"rating": 5.0, "review": "I bought the Fire TV as a possible alternative to Comcast Cable.  Our bill keeps going up, and up, and up etc.  Yet I don't know how many times I've turned to my wife (as I'm browsing through what's available that night) and said \"How much are we paying for nothing decent to watch?\"  This is especially true when we hit those periods of the year when both network and cable channels are offering nothing but reruns.Have had this too soon to say for certain but the Fire TV seems to be the answer.  Still need to try HULU and, possibly, NETFLIX before I dump cable  Have some concerns as to some of the cable channels which produce original programs, such as SyFy, AMC, even HBO and Starz aren't available via Fire TV.  Maybe it's worth giving up some of our favorite programs for the money we're going to save.Since I am running all my devices through my A/V receiver, I did my homework with the instructions for my receiver and the install instructions from Amazon and was able to order the correct cables with the Fire TV.  Installation was extremely simple.So far, have only tried a few movies but, since I'm an Amazon Prime member, I'm getting relatively recent releases for free.  With cable I'd have to pay a rental fee of $6-8.  The movies have streamed with no problems such as throttling or loss of resolution.  My Internet WiFi is rated at 50mbps but speed tests are showing that I'm actually running at 60mbps.  Don't know what performance could be expected at slower speeds.So far, am very happy and will probably be dumping cable within a month.", "verified": true, "helpfulness": "1/1", "author": "Robert L. Darveaux"}, {"rating": 4.0, "review": "I love it, I dropped a star because Netflix stopped working.", "verified": true, "helpfulness": "0/1", "author": "Brenna Cosby"}]