[{"rating": 1.0, "review": "I have had a Roku 3 for about a 1yr and wanted to get something for our other TV. I read many reviews and I thought the Amazon Fire Tv would be a good choice based on the reviews. I read that it was faster than the Roku 3 which is why I decided to get it instead of another Roku 3. The day I picked it up I installed it. This took 3 attempts as it kept losing connectivity and I had to start the process over again. Once it was installed I had to install the apps. This takes much longer than on the Roku 3. Seems the Roku 3 already has the apps installed so no wait time. Amazon Fire Tv takes a long time (at least mine did) and it would fail due to losing connection to wifi. After finally getting Netflix on it I tried using it but the wifi connection kept dropping and it couldn't even load Netflix (every time I checked the connection through the settings it kept saying the connection was good). I then tried Amazon Prime and it would open but to try and watch something was impossible. Connection would drop every time. I thought maybe something was wrong with my wifi connection and so I plugged in my Roku 3 into the same TV right next to the Amazon Fire Tv and it worked great as always. No lag, no timing out, no losing wifi connection. It seems the Roku 3 has way better wifi connectivity. I returned the Amazon Fire Tv and got another Roku 3. I highly recommend the Roku 3 over Amazon Fire Tv.", "verified": false, "helpfulness": "0/2", "author": "Meghan"}, {"rating": 2.0, "review": "it is great however, when I set up like ESPN or HBO and not have CHarter communication it miss it. They not accept them. only i can use huhu, netflix, and amazon all good. use your wisdom which better and what you have for internet computer.", "verified": true, "helpfulness": "1/2", "author": "Wyatt Baldwin"}, {"rating": 5.0, "review": "The Fire works great and make access to many apps very easy.  I really like the product and glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Edwin Kwon \"ehk808\""}, {"rating": 5.0, "review": "love it! thanks for the quick delivery", "verified": true, "helpfulness": "0/0", "author": "Carla E"}, {"rating": 5.0, "review": "I just received and hooked up my new Amazon Fire TV and, so far, I love it. I was frustrated by my smartTV apps and their erratic performance, buffering, etc. so I decided to try Fire TV. The packaging is first class, instructions are excellent (except for a missing direction about how to open the battery compartment of the remote unit), and set-up was quick and easy. It was already registered to my Prime account, so online set up went smoothly. The menus are sharp and easy to navigate. The video picture quality is much better than my previous streaming experiences. Contrary to many previous reviews, there is a menu for browsing Prime Video exclusively. I wish the videos were also displayed in a list format, instead of scrolling through to get to a desired video, but is is visually great and works fast. If this performance continues, I will be totally happy with Fire TV.", "verified": true, "helpfulness": "1/1", "author": "homer"}, {"rating": 5.0, "review": "Wow!  This is way better than expected.  I was debating getting this since I own a smart TV, but the interface on this is way better.  Also, the picture quality is better and way less lag time on streaming.  I am happy I cut the cord on cable and got this box instead.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Beastie52 \"beastie\""}, {"rating": 5.0, "review": "Everything has subtitles.  I am delighted.", "verified": true, "helpfulness": "1/1", "author": "catthief"}, {"rating": 5.0, "review": "Why spend the money on a \"Smart TV\"?  Very easy to use user interface.  Love the simplified remote and easy access to Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "joseph sedlak"}, {"rating": 4.0, "review": "i seem to have a lot of things that all do the same thing.  This is just another one.  It's great and all.  Just not ground breaking.", "verified": true, "helpfulness": "0/0", "author": "Bud Z"}, {"rating": 5.0, "review": "Love the box!  Very easy to set up, very easy to use, nice selection of movies and programs to watch...  only negative is the lack of newer movies on Prime, but that obviously doesn't diminish the use of the box!", "verified": true, "helpfulness": "0/0", "author": "Sarah K. Babiarz \"SKB\""}]