[{"rating": 5.0, "review": "Practically perfect in every way", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fantastic, love it, great service, wish it was easier to find movies on Prime though, other then that, very great.", "verified": true, "helpfulness": "0/0", "author": "Macineskar"}, {"rating": 4.0, "review": "It's simple to use. It provides a lot of entertainment and is well worth its cost.", "verified": true, "helpfulness": "0/0", "author": "Carol Raskind"}, {"rating": 1.0, "review": "I received the Amazon Fire for Mother's day.  It is now July and I still cannot resolve one problem.  I cannot download and view Netflix.  numerous calls to customer service, calls to tech support providing them with the specific error message.  Bottom line..i still cannot access Netflix.  One representative told me it was a problem with equipment and I should take it back to store and start over with a new one and see if that works. Huh?", "verified": false, "helpfulness": "3/7", "author": "lvwrmwthr"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 4.0, "review": "Works very well. Would be nice to have a 1/8\" audio out because they are so much more versatile than a digital/optical out. Otherwise it works as advertised and as expected.", "verified": true, "helpfulness": "0/0", "author": "D. Slager"}, {"rating": 5.0, "review": "This is a great tv accessory....has a lot of movies and shows to choose from, some free, others you have to pay for.", "verified": true, "helpfulness": "1/1", "author": "M. Phillips"}, {"rating": 4.0, "review": "Great product, I'm hopeful NBC Sports Live Extra will soon be available on this box. Netflix, WatchESPN, and Prime Video are great to watch so far.", "verified": true, "helpfulness": "1/1", "author": "CJ Cohick"}, {"rating": 3.0, "review": "Same movies as netflix", "verified": true, "helpfulness": "0/3", "author": "Darall R."}, {"rating": 3.0, "review": "I like it and would have given it 4 or 5 stars, but I can't use it in my current home entertainment setup because it requires an HDMI hook-up and I'm all out of available HDMI ports. I sure wish it was connectable through WIFI instead.", "verified": true, "helpfulness": "1/3", "author": "Daniel Bethancourt"}]