[{"rating": 5.0, "review": "No complaints whatsoever.......well.....just one.....if I could have accessed my google movies on this device, it would be a solid 6 out of 5!!!lol.Not enough to make me rate it down though.", "verified": true, "helpfulness": "1/1", "author": "Renato"}, {"rating": 4.0, "review": "Great, this my 2nd. It purchase for a separate TV", "verified": true, "helpfulness": "0/0", "author": "Jill W."}, {"rating": 5.0, "review": "Did exactly what they said it would do.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "just wish the free movies on amazon were in a separate category", "verified": true, "helpfulness": "0/0", "author": "jack"}, {"rating": 1.0, "review": "Supper slow to load the apps, better home screen, more memory, and a case for the control", "verified": true, "helpfulness": "1/4", "author": "Eduardo Gow"}, {"rating": 4.0, "review": "I was previously using an Apple TV. While this is a fine device and I greatly appreciate being able to install 3rd party applications, I am disappointed by the UI. The home screen could be organized much better and I shouldn't have to go to Settings to find all of my installed applications. I understand that the idea is using your voice to find your apps, but this does not work if you have sideloaded apps or if you forget the name of the app. I'm still struggling configuring multiple game controllers. Again, I understand that many of the 3rd party apps are designed with a single touch interface in mind.", "verified": true, "helpfulness": "0/0", "author": "Nick Rodriguez"}, {"rating": 5.0, "review": "I've been using a Roku 2 for the past two years without issue but decided to try out AFTV.  The system runs very well but my only complaint  would be the missing portion for only my apps... Instead you see everything Amazon has available for the AFTV.  I'd rather search for the area rather than have it prominently displayed 24/7.", "verified": true, "helpfulness": "1/1", "author": "MrEous"}, {"rating": 1.0, "review": "Good concept, but Apps work very poorly. First day it was set-up, everything worked great, but now Sling TV or Plex do not work at all. I tested the internet speed and it does not appear to be related to the internet unless, Comcast found a way to specifically block connections from Sling servers.", "verified": true, "helpfulness": "0/2", "author": "Amazon Shopper"}, {"rating": 5.0, "review": "I bought this last year. I stream Netflix, Hulu, YouTube, and Amazon Instant Video. This always quickly loads all of these. I bought my mom one of these for Christmas, and she likes it so much that she requested another one for Mother's Day. The Fire TV is so easy to use. My Dad, who has trouble using some technology can easily use it. I recomend this to anyone who likes to stream content off of the internet.", "verified": true, "helpfulness": "1/1", "author": "Trish \"charleston sunset\""}, {"rating": 4.0, "review": "Sooner or later this will replace Cox Cable at my house.", "verified": true, "helpfulness": "1/1", "author": "Richard M."}]