[{"rating": 5.0, "review": "This is, without a doubt, the best purchase that I have made for my television to date.  A small, unobtrusive box with a single small LED on the front to tell you it is on and working.  Virtually no setup was required, except for signing into the various services that you want to use.My one caveat is that the remote control is very little, much smaller than most other remotes, and is easy to misplace.  I have done so twice in the month that I have owned this.  My suggestion is to either tape the Fire TV remote to another, larger controller, or velcro it to the Fire TV unit itself so that you do not lose it.The build quality is excellent this, both unit and remote.  The unit itself is a bit heavier than expected, but built very solidly.  I have had mine thrown to the floor more than once with no issue.  The unit just keeps on working.  The addition of a small slide show as a screen saver was most welcome.  Much better than the usual static text screen, or bouncing logo of most similar products.Buy this TODAY!  You will not regret it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Let's cut to the chase. Roku 3 let's you search cross platform so you can find where you can get a movie/TV show for the LOWEST price (ie. FREE).I was hoping the voice search could do that. Nope. In fact back in April 2014 there were articles written you soon could search Netflix with the voice search. Still not the case as of Jun. 10th.  Also, you can't even search youtube with the voice function! That would have been a GAME CHANGER!! Imagine if you could voice to text into any dialogue box like on the iPhone? Game/set/Match AMAZON! Missed opportunity.Roku 3 has a better ability to organize your aps too. Is your favorite ap Youtube? Netflix? Amazon? Put them at the top of your home screen! Not the case here. :-(I hope Amazon realizes it is not just competing with Netflix, but also with Roku.  By Giving other video services the cold shoulder it is opening up competitors to its market. They have it cornered on voice searching, but it is only limited to opening aps and searching Amazon video.", "verified": true, "helpfulness": "5/8", "author": "Allan Forbes"}, {"rating": 5.0, "review": "I like it because you can get other programs like netflix,youtube.. the only thing is that they need to have some live tv stations, like rabbit tv...", "verified": true, "helpfulness": "0/1", "author": "Cel Rodriguez"}, {"rating": 5.0, "review": "my son watching it more then me but when i get the chance i do love it always  i will tell family and friends to buy.", "verified": true, "helpfulness": "0/0", "author": "Paulaann"}, {"rating": 5.0, "review": "The ONLY con to this gizmo is that the voice search only uses the built in data - i.e. Amazon content.  It does not search other apps that you have such as Hulu or Netflix.  Not that I really expected that it would index those as well.. it just would have been a nice cheery little cherry on top.I have several other similar gizmos, from the RikoMagic (3 versions), Roku and even a CubieTruck - this one beats them all as an entertainment device.  It is fast, reliable and the interface is simple and intuitive to use.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Gadgeteer\""}, {"rating": 5.0, "review": "I love that I can now catch up on TV shows that I forgot to record for the season, new shows that are a couple of seasons in, and, of course, movies. I also love that I can play games when I am looking to waste a few minutes, and the exercise apps are great for routines when I am looking for something different. The voice control works perfectly! I was already an Amazon Prime customer. So, this device just made sense for me to get. I find I go to my Amazon Fire TV more than I go to my DVR nowadays. AND...no commercials!", "verified": true, "helpfulness": "0/0", "author": "B. Brookhouse"}, {"rating": 1.0, "review": "Missing too many apps and the ones it does have are buried under Amazon stuff. Everything is a jumbled mess. Hulu keeps freezing even though it works fine on Apple TV, computer, and ipad.Update: I moved my modem and router so I could hardwire the Fire TV. It still constantly freezes shows and has buffering issues. Apple TV, which is now farther from the router, never has problems at all. No way to get support from Amazon on these issues.", "verified": true, "helpfulness": "1/4", "author": "Anonymous"}, {"rating": 3.0, "review": "IF WHEN i returned it because the remote did not work [and have been waiting for another never received it,this may be a good product but i cant say because i cant get a replacement! but don't no why!", "verified": true, "helpfulness": "0/3", "author": "carol a gatewood"}, {"rating": 5.0, "review": "As a cable cutter, I must admit I rely on a few different devices for my media intake.Since getting the Fire TV I only require one. This device's User Interface is superb, voice search has never yielded any other result other than the one I have been looking for.The speed of loading media, episodes, movies and apps blows, Apple TV, Chromecast out of the water, loads are instant... This device also allows casting from Android making a Chromecast useless and not needed.The remote is beautiful, perfect amount of buttons and is easier to find when lost in the couch than the Apple remote.I will be making this my new default gift for friends and family.Thank you Amazon (:", "verified": true, "helpfulness": "0/0", "author": "Alexxxx Fair"}, {"rating": 5.0, "review": "This little box is perfect for all my media needs on my TV. And the WiFi strength is great!!! Buy it", "verified": true, "helpfulness": "0/0", "author": "Steven Melton"}]