[{"rating": 5.0, "review": "awesome!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Can't make it work in Canada", "verified": true, "helpfulness": "0/1", "author": "William Fernihough \"billfern\""}, {"rating": 5.0, "review": "So far good.", "verified": true, "helpfulness": "0/0", "author": "Deb Taylor"}, {"rating": 5.0, "review": "Rooted and installed XBMC. Works much better than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "All-access Customer"}, {"rating": 5.0, "review": "Easy to use, small and portable, got it at a great price, we like it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Buyer"}, {"rating": 5.0, "review": "love love love it", "verified": true, "helpfulness": "0/0", "author": "GLADYS STORMS-FAIRLEY"}, {"rating": 3.0, "review": "This product is very good to have if you want to watch movies in different languages and such. and great for dates  The worse thing is though the lag time when you start using apps. and there are a lot of connection problems even when you are directly plugged into the modem.  I know for a fact that my internet connection is strong it just the Fire TV has a hard time handling that so it loses connection. but it reboots in about 2 secs.  It can get annoying", "verified": true, "helpfulness": "0/2", "author": "Nigel"}, {"rating": 5.0, "review": "great with a few exceptions I still learning and trying to find all the movies", "verified": true, "helpfulness": "1/1", "author": "Patty Lykins"}, {"rating": 5.0, "review": "Fire TV is amazing! If you are a college student, you need this ;)Games.Movies.Shows.Music.--------What more could you ask for.", "verified": true, "helpfulness": "2/2", "author": "Alex Cain"}, {"rating": 1.0, "review": "Be warned if you have no \"perfect\" broadband internet connection:Here, we have ADSL with 4 Mbit reaching our home. Amazon Instant Video is running perfect on two different laptops, showing a flawless video stream in HD (high resolution).However, the newly set up Fire TV only brings up a video stream in SD (low Resolution), obviously thinking our bandwith is too slow for HD Video.The testing environment is foolproof (I'm a CTO myself): Same location, same (strong) WiFi, same internet connection. While the laptops running Win7/8 with Internet Explorer & MS Silverlight give a perfect HD stream, the Fire TV refuses to and automatically sets video quality to SD.What's most frustrating:Amazon's online support (via chat) tries to get rid of this support request, rather than answering it. I have given a detailed description, but have been forwarded to 6 (!) different customer service associates, all of them connecting me from one to another. The outsourced support people in Hyberabad/India don't seem motivated at all, right Kushal/Michaela/Amod/Lutfiya/Kumar/Keshav ..?So far: No recommendation. Fire TV given weaker performance than standard laptops, support being incredibly unhelpful and unrespectful.", "verified": true, "helpfulness": "35/38", "author": "HCT Busvermietung GmbH"}]