[{"rating": 5.0, "review": "Easy to install, easy to setup, easy to use. The voice command is a nice feature and real time saver. A great product if you are an Amazon Prime Member!", "verified": true, "helpfulness": "1/2", "author": "lammur"}, {"rating": 5.0, "review": "Easy to use and rarely 'buffers'", "verified": true, "helpfulness": "0/0", "author": "Apryl"}, {"rating": 1.0, "review": "I ended up diresgestering since I was never able to watch anything advertise on the screen. All of the \"Prime movies\" were not available to watch. My options were buy the movie or watch the trailer.", "verified": false, "helpfulness": "1/5", "author": "Nilson Hernandez"}, {"rating": 5.0, "review": "I love this product!  I have a smart TV and Amazon Fire TV operates much better and faster then the smart tv alone ever has.  SO many things to choose from! I highly recommend the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Ann Dyer"}, {"rating": 5.0, "review": "Fun for the whole family got better with this device. Great for streaming Netflix and having a year of Amazon Prime already was a major plus. The kids are amazed by the games available. The streaming is flawless. Plan to order another one tonight and the game controller. The second one will be connected to my stereo receiver and TV so I can take advantage of my Prime music.", "verified": true, "helpfulness": "0/0", "author": "Family of 5 from Richmond"}, {"rating": 5.0, "review": "Compared to Roku, Chromecast and Logitech Revue, which I all have and operate on different TVs in the house...this one is far the easiest to set up and operate", "verified": true, "helpfulness": "0/0", "author": "BEpilobium"}, {"rating": 5.0, "review": "love it!!!", "verified": true, "helpfulness": "0/0", "author": "Charles Terrana"}, {"rating": 5.0, "review": "Save some money don't buy a smart tv", "verified": true, "helpfulness": "0/0", "author": "Sealyons"}, {"rating": 4.0, "review": "The Fire Tv box is a marvel. I love how fast it operates, and that the innards are much better then that of Roku, or Apple Tv. But the Fire Tv apps. need to be as generous as Roku has. It's like having a Mustang, but it does you no good if the gas tank only has a gallon of gas in it. I gave four stars for the box itself only. If there was a rating system for the apps.itself then i would be rating that one star. Come on Amazon, you have a winner with your box, now put in as much attention to the detail with your apps too.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Worked right out of the box, easy setup and directions, excellent voice recognition. As a prime member would like to see more old television shows for free.", "verified": true, "helpfulness": "0/0", "author": "Robert T. Gable"}]