[{"rating": 5.0, "review": "I just hooked this thing up a few hours ago and I already love it. It's the best streaming box I own. Those are Sony smp-n200, Sony nsz-gs7, and a roku 3. The roku is a good  streamer but the fire TV is just faster and in my opinion better. Setup only took minutes, and I mean that literally. That massive, incredibly long software update took 3 minutes 48 seconds, I timed it. People, instead of leaving negative reviews upgrade your Internet, equipment and service. Remote is on par with the roku. Hopefully amazon will release a remote control app to take advantage of the smartphone keyboard to make entering searches easier with Netflix, Hulu, etc. Beware of putting to much trust in the overly negative reviews, most are written by people who don't own nor have ever tried fire TV. In case anyone is wondering why I'm not a verified owner, I have wanted this box since it was released and despite being a prime member I just couldn't wait any longer so I purchased it at best buy.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is truly plug and play. I am already a prime member, with 2 kindles, so it came pre-set with my Amazon information. As soon as you have it connected to your TV and internet, and have put (included) batteries in the remote, the device begins a short instructional video.From the homepage, you have several options. You can download apps for services you already use (Netflix and Hulu), as well as several other apps for things like Smithsonian shows, sports, and other news outlets. There are not apps for any of the network channels, however, but if you get Hulu you will be able to watch most of the new shows. (My main concern with getting away from cable was going to be still having access to HBO for Game of Thrones, and BBC for Doctor Who. I am happy to say that Hulu gets BBC shows, and my sister has HBO, so we can watch it at her place.)From the Fire home screen, you can use a voice-activated search command, which is pretty neat. Search for show names, movie names, or even a genre or actor that you like. It seems to be very sensitive, and understood me pretty clearly.The remote is very small, and only has a few buttons. Pretty straight forward, not confusing at all. Batteries do come in the box for it. I could see maybe getting the gaming remote if anyone in my household wanted to play any of the games. Many of them say that the remote can be used, but it is so small, I would probably get frustrated trying.I removed one star for two reasons - no HBOGo, and the navigation is just a little bit clunky, like the amazon instant video app that I have been using with our PS3.Don't forget to order an HDMI cable if you don't have one at home. This is not included with the Fire TV.I am just thrilled that I will be savings about $70/month that I was spending on cable and a phone that I didn't use. Now I only have to pay for internet and my subscriptions to Netflix, Hulu and Amazon Prime.", "verified": true, "helpfulness": "2/3", "author": "Nana"}, {"rating": 4.0, "review": "UPDATE 3.26.15According to this article (see link), Amazon will be adding USB External Storage support to the Fire TV very soon.  Not sure of the exact date.  This may get me interested enough again to take another look at the gaming aspect of the Fire TV since it has been sitting on the shelf virtually unused for not quite a year now.http://www.highdefdigest.com/news/show/Amazon/fire-tv/fire-tv-stick/Streaming/Media_Players/Set-top_Boxes/dongles/hdmi-sticks/updates/Wi-Fi/USB/amazon-adds-new-fire-tv-fire-tv-stick-features-including-usb-storage-and-hotel-wifi-support/21960Previous post:I love the Amazon Fire TV but . . . (I considered giving it only 3 stars for the comments listed below, but I really like it)OK, after only owning the Amazon Fire TV since last Friday, April 4th, I suspected the limited 8GB of internal memory would be a problem and it is.As of last night, April 9th, my Fire TV internal storage was full. I was trying to install the Deus Ex game that is available for Fire TV and received that message that I needed to delete something. So, I started deleting a few games and finally had enough deleted that it started downloading again except I think it started all over again. About 90% of the way through downloading the 2ND TIME, I got the same message to delete some more. So, I deleted a few more games and then it took off downloading again from the beginning again!! Then, it completed the download and started installing the game and then I got the same message again for a 3RD TIME!! That made me say a few choice words!!At that point, I said to heck with it and figured I'd wait to see if Amazon does anything about this. So, I spent $7 on a game I didn't get to play. See, the USB port isn't enabled so there is no support for external storage. From what I saw, the Fire TV App takes up 2.2 GB of the total 8GB available. Heck, The Walking Dead app alone is over 1GB in size. I can't verify this but I swear each time I was downloading Deus Ex it used up another 700+ MB of memory and when the download didn't complete I didn't get the storage back! So, in (3) attempts to get it installed I swear I used up 2 to 3 GB of internal storage that is still gone. I was looking through all of the apps/games that I have installed and didn't add it up but I really don't have that much installed right now and it only looks like it amounts to 2 to 3GB but where the other 2 to 3GB is, is a mystery. I deleted like (8) total games with a couple of them in the 400 to 500MB range and never got Deus Ex installed.Amazon needs to get this fixed fast for anybody that purchased the Fire TV for any sort of Android gaming purposes. Just hope they fix it faster than OUYA did which took like 6 months plus to enable external storage.I would like to add, that it is a huge engineering oversight, in my opinion, to only give the Fire TV 8GB of internal store.  Just enable the USB port to allow for external storage!! I would gladly go out and buy a $15 32GB USB memory stick or even spend the $50 to $60 on a 500GB external hard drive.In this day and age, the Fire TV should come with at least 32GB of internal storage!! That would allow for at least the storage of (60) 500 MB game considering maybe 2GB would be used up for the Amazon Fire TV app. That would be reasonable and fair.Today, 2.2 GB is used for the Fire TV app leaving less than 6GB of internal store. Considering The Walking Dead is over 1GB just by itself, that leaves only 5GB left. What is left only allows for (10) more 500MB games. So, a system that only allows the installation of (10) to (12) games/apps at 500MB each clearly isn't big enough.Update:  10.14.14Still waiting on that USB External Drive Support.  I have read that you can hack/root your Amazon Fire TV and enable the USB port for External Drive Support but I just really don't want to go there.  So, in the meantime, my Amazon Fire TV just sits there unused, internal storage full, and no, I don't want to have to delete something every time I want to install something new.", "verified": true, "helpfulness": "24/26", "author": "awarlock \"awarlock\""}, {"rating": 5.0, "review": "I gave it five stars because it works as promised and I haven't found anything I don't like about it. It was easy to install and operate.  My daughter wanted me to get a Roku but I got an email from Amazon and ordered it the same day.  We do have a smart tv but this is so much easier to use. I would recommend this to everyone that has wireless internet and a HDTV with HDMI capabilities .", "verified": true, "helpfulness": "0/1", "author": "sandy Lorenzen"}, {"rating": 4.0, "review": "This product has potential to be great. Right now the only complaint I have is that the purchase process does not work as it should. After buying packs for 'You Don't know Jack' it takes minutes to days to actually make those products available for play.", "verified": true, "helpfulness": "0/0", "author": "mike d"}, {"rating": 5.0, "review": "I recently purchased both Amazon Fire TV device and their main competitor, the ROKU3 device.Amazon Fire has:A superior processor chip: quad core, verses the competitor's dual-core.  It is very repsonsive.A superior storage capacity:  8 gigs, verses a tiny fraction of that in any other device.Superior tactile interfaces: The Amazone Fire Remote is tiny, simple, and has a wonderfulfeel in the hand I can only describe as being like \"frosted black glass\".Gaming Options: The optional gaming remote (which I also have) is the best of its kind I've ever held,and several video games are available.  No competitor can begin to compare for gaming.Verbal Interface: Like Apple's \"Siri\"... the Amazon Fire has a voice command that actually works.No other Internet Streaming device has anything like that. (Curiously, not even Apple's own \"Apple TV\")There is no competition at all for the Amazon Fire TV device (yet) in the area of voice command.Amazon Fire offers all the \"APPS\" or \"CHANNELS\" you could possibly want, such as:Netflix, HuLu Plus, and of course their own proprietary Amazon Instant Video,along with several dozen other such options.The only category in which the Amazon Fire TV device falls short of its main competitor,the ROKU3, is that the ROKU3 has over 1,000 \"channels\" of content from a seemingly endlessvariety of \"small time players\", such as individual community churches across America thatnow have their own \"ROKU Channel\" and stream their church services over ROKU every week...or other amateur broadcasters offering everything from \"Jane's Yoga Channel\" to\"The Monaco Tourist Channel\" ... admittedly, all channels that might be of interest to less than1% of viewers.  That's really cool... so I'm also keeping my ROKU3... but that one rather obscureadvantage does not even BEGIN to stack up against the many superior features of theAmazon Fire TV device... making Amazon Fire TV the clearly superior choice.Also... I suspect that over the next year or so, Amazon will start vastly increasing theirown offering of obscure little small-time amateur \"Channels\" (like ROKU), eliminatingthis one slight competitor's advantage.As a final advantage, I would point out that AMAZON is a huge multi-billion-dollar corporation,so you know they are going to continue to support this flag-ship device with software updates andongoing improvements and customer service for many years to come.  That is important.Thank you Amazon for elevating my TV-viewing experience to a new level!John JeffcoatGreatsite.com", "verified": true, "helpfulness": "4/5", "author": "JLJ"}, {"rating": 4.0, "review": "OK - most probably do this - make sure you have an available HDMI output. I have 3 TV sets. The one I wanted to use did not have an available HDMI jack nor did my second choice. The only one I could use is a new Sony Internet TV which should already do what the Amazon Fire does except I have had no success in getting it to function. The Amazon Fire was easy enough to set up. You must know your wifi password if you use wifi setup (fortunately I did). I watched an episode of Alpha House but then I could not get my regular TV back. Gave up. This morning after an hour of messing around with my tv (and 3 remotes) I got the TV working. I am almost afraid to try this again but I'm no quitter. I am 74 years old and I'm sure most would figure it out quickly.When I first connected the Amazon Fire TV I had to wait quite a while because it was adding updates and downloading them. A new device should be updated!After going through all this I will say I am not overly impressed with the choices for Amazon Prime free programs and I do not want to pay any more $$.  I think the price was fine but if it had come out sooner I would have saved a bundle by not buying the \"internet TV\" which was very expensive for a 32\" TV.", "verified": true, "helpfulness": "2/3", "author": "Dog Mom"}, {"rating": 5.0, "review": "This is a must have for watching movies. You will not believe how easy it is to hook up and the voice control really does work just like they say.", "verified": true, "helpfulness": "1/1", "author": "Barbara Blair"}, {"rating": 3.0, "review": "The good: Fast delivery, easy set up. TV picture better than Roko..The bad:  I have a 65\" LED TV. Icons to large,description of program to play is way to small. Roko screen menu a lot better. Unless the bugs are corrected I will return THE FIRE for credit. Wait until menu is corrected & price improves", "verified": true, "helpfulness": "0/1", "author": "C. Heston \"vin\""}, {"rating": 5.0, "review": "It is very user friendly and offers everything that you could possibly want. Large selections - plenty of apps. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Catherine S Risco"}]