[{"rating": 3.0, "review": "Good but needs more content", "verified": true, "helpfulness": "0/0", "author": "steve smotherman"}, {"rating": 5.0, "review": "We had another brand a few years back, thinking it would be a cool way to get Netflix.  While it worked, the picture quality and sound was inferior to a disc of the same movie, (which, we just happened to have for comparison).  Not so, with Amazon Fire TV!  We were amazed at the sharp, high-definition picture and sound fidelity.  It's a great way to watch TV.  We currently have a 10mbs fiber optics internet service, and we use the Wi-Fi connection on the Amazon Fire.  You can also synchronize your phone with YouTube and watch them BIG on the TV.  AND, the screen-saver photos are gorgeous!We have noticed that, when our daughter is \"streaming\" with her computer at the same time, our programs will occasionally pause to load and catch-up.  We're debating whether it happens often enough for us to get the next available step up on our fiber optics service.  We have also noticed that a number of the programs available from Netflix under the regular monthly fee arrangement show up as Pay-per-View on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Old Sometime Hiker"}, {"rating": 3.0, "review": "Eh. It's ok. Think I'll get the roku for the other rooms. May return it. It's nice but you're very limited.", "verified": true, "helpfulness": "0/1", "author": "Stephanie M. Patterson"}, {"rating": 5.0, "review": "Love this!  My husband has a Roku on one TV, and I bought this for living room TV.  I find it easier to use than Roku and really like the 'voice' feature.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So I had hoped to write a review earlier on this product, but lost track of time with life.Anyway, I bought it as soon as it came out, like on day one.  I love it, and best of all, I had a great idea.  Why not take it to hotels with you that offer free WiFi and watch all the movies you want for FREE!  I am going on vacation this summer and will be staying at a hotel.  I will hook this up to the tv and we can watch movies and not pay for them...as long as the WiFi is free.As for a product, its awesome.  I love searching for a movie first on my Kindle Fire HDX and then swiping it to the TV.  I can pause from the Kindle Fire or the remote.  My daughter added her HULU Plus to my Kindle Fire TV and that added even more viewing options, especially since one of my weekly shows did not record.  I was able to watch it.I may not even need to pay for Sat TV here pretty soon.  With all the options open to me, who needs to pay for television anymore?", "verified": true, "helpfulness": "0/0", "author": "Kahfree"}, {"rating": 5.0, "review": "I absolutely love this product! I stream Amazon Prime movies on it and Netflix. it's easy to hook up and use. The price is just right too.", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 1.0, "review": "Only thing it works good for is Prime video.  I am a big plex user and the app looks very un-polished and the video/voice is horribly out of sync.  For some reason too the Fire uses ALOT more bandwidth over other streaming devices.  I also own a Roku 3 and would highly recommend it over the Fire any day.", "verified": true, "helpfulness": "5/6", "author": "Brandon"}, {"rating": 3.0, "review": "In a manner of speaking, this is another Roku type device, but a lot easier to setup since it actually allows the use of a keyboard to enter your information, esp. if you need to enter a long WEP2 key.  Yes, it does shutdown after a while saving some power -- but your phantom power is still going to be on.Voice Recognition -- spot on! That makes searching for stuff to watch very VERY easy BUT it comes with AN EXTREMELY BIG DOWNSIDE.The Downside? The voice search results report items available on Amazon and nothing else, which sucks when compared to Roku. Roku doesn't care, it will report for all the channels you have setup on Roku, but not Amazon Fire TV.And yes, Roku is much cheaper than Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "TexanHawk"}, {"rating": 5.0, "review": "Fantastic product!! The system is very responsive, the voice search works very well, integration to Youtube and other apps it very nice. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Shivon Dosky"}, {"rating": 5.0, "review": "Love this tv!!  I really like how amazon registers it to your account before they send it so only setup is to your wireless network.  I love how just turning on the Fire Tv causes the tv to automatically tune to that HDMI source.  Just easy and great!!", "verified": true, "helpfulness": "0/0", "author": "S. Terry"}]