[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it easy to assemble and better to watch", "verified": true, "helpfulness": "0/0", "author": "1JACLLNS"}, {"rating": 4.0, "review": "More apps needed to catch up with Roku. Otherwise very good.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like the functionality better than Apple TV. Shame you can't use it for HBO Go with Comcast.", "verified": true, "helpfulness": "0/0", "author": "Jenny jenny"}, {"rating": 5.0, "review": "Works great and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "socket"}, {"rating": 5.0, "review": "It really exceeded my expectations. It's better than my ROKU. The price is not bad either.", "verified": true, "helpfulness": "0/0", "author": "Ed Pogi"}, {"rating": 4.0, "review": "I really like the fire tv - but why all of the sudden are shows no longer free prime - my daughter and I were watching Eureka series and all the sudden not prime anymore - we should have been warned to when it was not going to be prime !!!!!", "verified": true, "helpfulness": "0/0", "author": "Kathleen Hurley"}, {"rating": 5.0, "review": "At first I had a problem with it, Then I fixed the problem.(on my end) It works great. Thanks", "verified": true, "helpfulness": "0/0", "author": "Gary Williams"}, {"rating": 5.0, "review": "I am a Directv customer and somehow my bill has soared to over &170 a month. I have installed Amazon Fire TV on three of our tvs.  I have found that some of our family member rarely watch Directv anymore and prefer Amazon Fire TV. The children especially like Amazon Fire TV. I suspect it is because they are more open to change and the older adults watch a lot of news. We have seven tvs in our home and have three generations of people living in our home. I am considering disconnecting directv on some of our tvs and if Amazon gets more news stations I would consider getting rid of Directv.", "verified": true, "helpfulness": "1/1", "author": "Donna"}]