[{"rating": 4.0, "review": "Really easy to install.  There is a lot to choose from and the clarity is amazing.  I have Chromecast but it would stutter everything but Netflix.  No buffering. I currently have NetFlix and HuluPlus and that seems to fit the bill for all of my viewing needs.  I will probably upgrade my Prime too.  With this, I do not need cable anymore.  I am very happy so far.", "verified": true, "helpfulness": "0/0", "author": "Karen M Harter"}, {"rating": 5.0, "review": "Great product, it is very user friendly. Voice remote make searching things a breeze.", "verified": true, "helpfulness": "0/0", "author": "Eric Tarango"}, {"rating": 4.0, "review": "Works Like A Charm-very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Charles Strehan"}, {"rating": 4.0, "review": "I've had this for 9 days,now and I have been very happy with the picture and the availability of media at my disposal.  Just wish I could add a few of my own apps.", "verified": true, "helpfulness": "0/0", "author": "Veronica Bayer-Aidi"}, {"rating": 5.0, "review": "Very pleased with Amazon Fire TV. Bought the box, bought the cable and within minutes had everything up and running. Connected to my Prime account, Netflix and Hulu+ all without any issues.", "verified": true, "helpfulness": "0/0", "author": "lynn m"}, {"rating": 3.0, "review": "The HBO and Showtime apps are not reliable. Both sometimes will not stream, even though Netflix and Amazon Video continue to work.", "verified": true, "helpfulness": "0/1", "author": "Tom Nisbet"}, {"rating": 5.0, "review": "This little box allowed me to cut the cord. No more cable/satellite for me. Ethernet port offers rock solid quality feed. So many options.", "verified": true, "helpfulness": "0/0", "author": "R. Morris"}, {"rating": 5.0, "review": "I cut my cable addiction and with this product have not felt deprived at all. I like my Amazon fire", "verified": true, "helpfulness": "0/0", "author": "dickersonvn"}, {"rating": 1.0, "review": "Not Impressed", "verified": true, "helpfulness": "1/6", "author": "Sara"}, {"rating": 4.0, "review": "I haven't had my Amazon Fire TV a month yet, which makes it too soon to give it 5 stars. But so far, I am really enjoying it. If you are a Prime member and actually watch the videos, then it is worth getting. I use password feature. For those of us who get a little trigger happy and like to push buttons, it makes you take a breath and make sure your not doing something you did not intend. If you are watching a series (with Prime), it will automatically play the next episode... I love that. If you have to leave it and forget to turn it off, a screen saver will come up - which is also a good thing (especially for those with plasmas). When I go back to watching something it starts where I left off. Haven't really used the Prime Music part much, but it seemed ok too. Have not played any games on it yet. Have a couple of apps with it, I've been happy with those. Only used the voice thing once, but it worked fine. Enjoy!", "verified": true, "helpfulness": "0/0", "author": "Loo"}]