[{"rating": 5.0, "review": "wow we love it.", "verified": true, "helpfulness": "0/0", "author": "Pam Wright"}, {"rating": 5.0, "review": "Cant go too far wrong, it would be nice if Amazon and Google app stores worked together, as several apps I already owned are not re-loadable on the amazon side from the google store .... works very well tho", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great, really recommend it to anyone to watch tv..........easy to use and love the voice activation!!!", "verified": true, "helpfulness": "0/0", "author": "craig neubauer"}, {"rating": 5.0, "review": "Better than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Damian Sinanon"}, {"rating": 5.0, "review": "I never write reviews on Amazon. I've been a long time customer since 2002, but I've never been compelled to ever write a review. I decided to write this because I've been so impressed with this product, that I felt compelled to tell people. I've used technology for as long as the first set top box ever existed. I've been through tons of cable boxes, satellite boxes, Roku, Apple TV, whatever it is, I've used it.I am also a software engineer, and really appreciate good engineering when I see it. I've been blown away by this product. I'll tell you why. The user interface is exactly as smooth as you would expect. I've used enough products to be so fed up with lag, that when using Amazon Fire TV, I applaud their engineers and hardware selection for this product. It's fast. It's exactly as smooth as you would want compared to everyone else. Most products lag, especially if your internet is being slow, or you're just trying to do too many things at once. We've all been there and it's frustrating when all you want is to get to the show your interested in.What's even more impressive is that for a v1 product, it seems Amazon hired top engineers who have really done this before. There are so many little things these guys have thought about, that I continue to be impressed each week. The team behind hosting video content through their CDN and buffering capabilities of the hardware is top notch as well. Even when my internet is lagging, Fire TV seriously kicks major ass when adapting to changing conditions. You hardly ever see that in most products especially a v1. I am very happy with the engineers who run the CDN Amazon network, they really make sure great content is provided fast and at 1080p HD.I've been so happy with this product I've bought 8 of them. Yes 8. Because I wanted one in each room and I wanted to give them as gifts to people because it was amazing experience. The details matter, and I want to share some of those with you.From the moment you order one, and have it shipped to your house, and plug it in. Amazon knows the serial number and links it to your account. I don't have to enter my Amazon email and password when setting up? You mean I can just use it? Absolutely amazing, another annoying step avoided! You're telling me I no longer have to use my remote to type letter by letter to find what I am interested in? I can just talk into the remote and Amazon's servers converted my voice to text? Why doesn't anyone else do this?? It's so convenient on saving time. I love that the remote even has firmware upgrades, are you serious? Remotes would have an update? Yes. I like the small details like it telling me my batteries are low, change them before it goes dead.One last thing I have to share that blew my mind the other day that.. As an engineer you know how certain things should be, but what you see that exists on the market today, its just sad. So I lost my remote, I couldnt find it...This has happened to me before and I am sure you. Well, I thought to myself, well I do have a smartphone running iOS, maybe they have an app I can control the Amazon box until I find it? Sure enough they do. But trust me I wasn't expecting much, and I'll tell you why! Like most things I've used in consumer electronics, stuff sucks. I had the same exact problem with my Samsung TV. I misplaced my remote and I thought to myself, ok maybe they have an app? Sure enough they do! BUT when you launch the app, it finds the TV and then it says, OK you need to push OK on the TV remote to authorize the app. Well.... I can't find the remote?! How am I going to do that...So when I installed the Amazon app I was thinking it was going to do the exact thing, like every piece of crap that exists does. Sure enough the guys at Amazon proved me wrong, yet again. They were smart enough to think about the problem at hand, and instead of making you push a button on a remote you can't find, it shows you a 5 digit code, just type it on the phone that you see on the screen and it's authorized. BOOM! It just works. This is the kind of engineering I appreciate and I know not everyone who makes products can have people who appreciate these little details but thank you. Thank you for always saving me time and making the experience great.Hands down buy this product. They are constantly improving the content selection, creating original content and caring about the customer.", "verified": true, "helpfulness": "2/2", "author": "Chris Goffinet"}, {"rating": 5.0, "review": "Best thing I got replaced my direct tv.....better then apple,rouko, and that junk gbox........", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "great ,and simple", "verified": true, "helpfulness": "0/0", "author": "Luis Martinetti"}, {"rating": 5.0, "review": "Been enjoying programs I did not know we're out there", "verified": true, "helpfulness": "0/0", "author": "Rita Foakes"}, {"rating": 5.0, "review": "I love it! Works better than Time Warner!! Thank you!!", "verified": true, "helpfulness": "0/0", "author": "Debra McMullen"}, {"rating": 5.0, "review": "Works as described.  Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Monica Megivern"}]