[{"rating": 5.0, "review": "Easy to use and so much better than any of the others I have tried thus far.", "verified": true, "helpfulness": "0/0", "author": "ShannaBananaBean \"ShannaBananaBean\""}, {"rating": 5.0, "review": "Love this thing! Easy to set up, easy to use, mega content available. Whats not to love?", "verified": true, "helpfulness": "0/0", "author": "AV Junkie"}, {"rating": 4.0, "review": "Works very nice. Easy to set up. Voice search nice feature. Still a little hard to find movies. I did a search on Bing. No good results. Same with Bing Crosby. Eith Crosby got every Crosby except Bing. Funny because there are several Bing Crosby movies available on prime.", "verified": true, "helpfulness": "0/0", "author": "bible a reader \"101science.com\""}, {"rating": 4.0, "review": "A quality product that works as good as I hoped. All it could use is more apps.", "verified": true, "helpfulness": "0/0", "author": "Jacob C. Meinert \"redmenace1015\""}, {"rating": 4.0, "review": "disappointed that the current release movies are not on netflex or prime on this..", "verified": true, "helpfulness": "0/0", "author": "K. Stringer"}, {"rating": 5.0, "review": "Love it! Saving a lot of money every month. It suits our purpose of watching our favorite shows. Thanks for adding new channels", "verified": true, "helpfulness": "0/0", "author": "cynthia gomez"}, {"rating": 5.0, "review": "Better and cable tv if you ask me.", "verified": true, "helpfulness": "0/0", "author": "Marcos"}, {"rating": 4.0, "review": "Easy to set up. Fun addition to tv entertainment. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "tom rejent"}, {"rating": 3.0, "review": "The remote only works half the time. I got it as a Christmas gift so have only had it for 2 weeks and now I have to return the whole thing and have it returned to another state then back to me. A pain.", "verified": true, "helpfulness": "0/0", "author": "Tina Grassi"}, {"rating": 5.0, "review": "Love the Fire TV. Such a good buy. Although some shows/sports require a current cable/satellite subscription, many are available without. I canceled my cable! Again, Fire TV is a really good buy!!!", "verified": true, "helpfulness": "0/0", "author": "Sonya J Goodrich"}]