[{"rating": 4.0, "review": "It's quick and easy to use.  Nice sleek design and comes with many good apps already on it.  Would definitely in the future", "verified": true, "helpfulness": "0/0", "author": "Andy Vasquez \"aHOVA\""}, {"rating": 5.0, "review": "Worked as advertised.  Easy to connect and so far no problems.  I have only used it for Netflix and Amazon Prime movies to this point.", "verified": true, "helpfulness": "0/0", "author": "Judith C. Levitsky"}, {"rating": 4.0, "review": "Pros: Love the interface and ease of navigation. Voice control is a bonus but not mandatory. The sleek design makes it virtually invisible next to my cable box. Cons: I only wish the remote had a volume control. I definitely recommend the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Aaron Kautz"}, {"rating": 5.0, "review": "I loved my apple tv for a long time but you cannot beat the bluetooth remote on this (means I can place the device behind the TV and not need line of sight).The Good:RemoteApp SelectionSpeedSizeThe Bad:Can't use all the iTunes movies I bought with itThe netflix app looks dated (but hulu and others look nicer than the ATV)Hard to tell the difference between iTunes movie price and Amazon price as they seem the same.The Ugly:EXTERNAL POWER.. Ick... so 1999 jeez make it internal or don't bother. If roku was internal it would win.Overall:My being SO against the external power adapter and still preferring this to the ATV means it's one hell of a device. About to order a second one so I can sell my ATV (was using ATV in one room and FireTV in another)", "verified": true, "helpfulness": "0/0", "author": "Aeramor"}, {"rating": 5.0, "review": "Fire TV was easy to set up, basically just plug into TV.  It is great for watching Amazon Prime content and listening to Pandora.", "verified": true, "helpfulness": "0/0", "author": "Grace30 \"Grace\""}, {"rating": 5.0, "review": "The fire tv worked really great. It was super easy to get started and looking for things to watch. I have a Google chromecast, and I like that with the fire tv you don't have to cast to it and drain your phone battery or have your laptop right next to you. Overall it was a great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "the nice feature about the fire is the voice search- easy to plug  in and get started -- so far it has skipped a few times and froze when watching  shows. u would think amazon channels would be free of charge. I pay to belong to prime and certain things are free because of prime membership , but i think it is ridiculous you are charged to rent a movie or a tv show -  if i pay to belong to prime all should be free", "verified": true, "helpfulness": "0/0", "author": "btgem"}, {"rating": 3.0, "review": "Overall the Amazon Fire TV is a good device but unless I missed something it does not fill my need to have live programming for specific sporting events.", "verified": true, "helpfulness": "1/1", "author": "Judson C."}, {"rating": 3.0, "review": "Haven't really found much of a reason to turn it on since I have both an Xbox 360 and Xbox one. The UI is also very bland.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Palumbo-culver \"Nicholas Palumbo-Culver\""}, {"rating": 5.0, "review": "Out of hte box and operating in less than fifteen minutes. Five of those minutes was a wait for my Wi Fi to automatically set up. I'm disappointed at the fee's on many of the selections I can get from Netflix under my subscription. MY wife are heavy users since we don't subscribe to cable.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Jordan"}]