[{"rating": 3.0, "review": "This box came with its share of headaches.Why did I assume that since it came with a USB port that meant you could actually use it?  No playback support from the USB port.  Just there to tease me, apparently.Most smart blu ray players have this feature as well.  If I had one main gripe about the Fire TV, this would be it.  Thanks Amazon!*** Plex is not a great solution.  Streaming over ethernet has severe playback issues at any decent HD resolution... ugh...The home screen has no clock on it.  Please add a clock.No power button on the remote.  You are just supposed to let the thing run for 30 minutes before it goes to standby mode.  You guys serious?  I don't use the (near useless) microphone on the remote, can you guys please allow me to repurpose this button as a shut down button?  Add an option for this?  No?  Thanks, just thought I'd ask.This box does a good job streaming Netflix, Hulu, and some other video apps.  It quickly gets you where you need to go.  Great response and startup time.HOWEVER:The playback of the device was fine when purchased.  Around 4-6 weeks after purchasing, little jitters and a studdering appeared here and there.  It progressively got worse over time.  I did a factory reset about two weeks ago, which brought playback back to normal.  Still, on a brand new device, this is NOT very promising.Two stars because the capabilities of this device do not match the hardware.  My ancient (2011) WDTV Live box was similarly priced.  It is much slower to power on and navigate menus, and there is a considerable delay when pressing a button on the remote.  I have to say I prefer it to this box for the fact that is has fantastic USB playback for several formats.  There is no reason whatsoever not to include this capability on a media box.Amazon, if you want to do your customers a solid, please consider bringing some significant improvements to the performance and capabilities of your product through (near) future software upgrades.EDIT 10-8-2014:After replacing the ethernet cable that connected this box to my router with a CAT6 cord, Plex streaming works MUCH better.  Able to watch high bitrate streams over the network now.  Upped my review to 3 stars because of this.  Fairly happy with the Fire TV at this point overall.No playback issues encountered since I did the factory reset some weeks ago.", "verified": false, "helpfulness": "9/14", "author": "B.Holliday"}, {"rating": 3.0, "review": "What internet speed is needed for this?", "verified": false, "helpfulness": "0/7", "author": "Jonathan Serrano Molina \"jsm\""}, {"rating": 5.0, "review": "First started with the Apple TV but their content was more expensive and had to keep re - entering our Apple ID...aggravating at best!  Bought the Amazon TV and have ditched the Apple. Love the voice selection!!!  Don't miss the time consuming scrolling.  A love the free Prime content and the PBS programs.  Only wish I could stream my Amazon music through this device. Only use the Apple now to stream. Need to add HBO Go as well as Showtime streaming so I can use my subscription.  Bravo Amazon!", "verified": true, "helpfulness": "1/1", "author": "Lauren \"RaeKei\""}, {"rating": 4.0, "review": "First thing I would like to say is this thing is very fast, much faster than the Roku (which I also own) or Apple TV. One of the features I enjoy is the instant stream which there is pretty much no buffer time when choosing a movie or episode (this only works on amazon prime instant video). It is seriously lacking in the apps department right now, I am sure Amazon is working to get more apps but they are just not there right now. There is no big news broadcaster apps such as Fox,NBC,or CBS. Which the Roku does have. They have all the major video streaming applications I.E. Netflix, Hulu Plus, Showtime and many others which is very nice. The games seem much more detailed than the Roku but then again I didn't buy it to play games. UFC app and many of the other tv network apps such as the History Channel, lifetime are not there and would be nice additions. The USB port  is also useless if you thought you could plug in a usb drive with movies on it you cant which hopefully amazon fixes. It sounds like more negatives than positives but it is not this is a very nice media streamer. This product is very young its the first year it has been out where the roku has been around for about 6 years so I would give it time to catch up. I will give 5 stars when they fix the APPs issue. So basically if you are looking for something to stream movies on with the potential for greatness this is your man. If you want to watch news clips and other TV station apps this thing is not quite there and you might be disappointed.", "verified": true, "helpfulness": "6/6", "author": "Logan A."}, {"rating": 4.0, "review": "This is an awesome little device.  Loaded it with Xfinity TV and XBMC and it works great.  The only think that would have given it 5 stars is that it will not stream HD from my htpc server and sideloaded apps are difficult to launch.  For the price though you will not find a better power to cost ratio. I was looking at building one from scratch to save money and the components alone will cost more, let alone the software and slick little packaging.", "verified": true, "helpfulness": "2/2", "author": "Fandavro"}, {"rating": 3.0, "review": "This unit would receive five stars if it didn't have one crippling fault. Approximately every two weeks the sound goes out and becomes tinny and incomprehensible. The only solution I've found is to reset the unit to factory defaults. When this happens you need to:a) Put in your network passwordb) Reinstall all the aps you had previouslyc) Put in your Amazon login/passwordd) Put in your Netflix login/password (if applicable)e) Rewatch the three minute FIRE TV instructional video (there's no way to skip this)After all this, you can use Fire TV again! Huzzah!It's annoying to have to go through this every two weeks for someone who is technically proficient, and I feel sorry for anyone who bought this for an older relative who *isn't*. Good luck visiting them every two weeks to get the unit up and running again!", "verified": true, "helpfulness": "4/5", "author": "Amber"}, {"rating": 3.0, "review": "First of all NO HBOGO!?! That is a huge bummer. Second of all the voice search is for amazon prime video search only, it isn't able to be used for other streaming applications like netflix, kind of another bummer. Thirdly, every month or so it stops working and we have to go through a bunch of steps to clear data and restart etc. pain in the you know what. It does work, except for those times it doesn't every month or so, but at least it is fixable. Oh and fourth, there is no power button to turn it off, you just have to let it idle long enough to turn off or unplug it. I really wanted to love this device but it's just so-so.", "verified": true, "helpfulness": "2/3", "author": "Laura"}, {"rating": 5.0, "review": "While attempting to cancel my mothers Comcast due to her health issues, I ran into the 'machine' that attempts to prevent anyone from canceling Comcast.  We've heard the news stories on this and I lived it.  Talk about the rudest, most ridiculous and inconsiderate people I have ever dealt with!  I could cancel moms lease, phone, power, water, etc but these jackasses at Comcast expected me to provide them a power if attorney to cancel her cable?  Sorry.Shortly after cutting off my moms cable (never officially because they would not cancel it) I cancelled my own cable.  This time around I just told them I was relocating out if state so I would not have to deal with Comcast insanity again.In the end I moved about 10 miles, got a new net provider, an Amazon Fire box and the wife and I could not be happier!  As our TV is a bit older we did need to pick up an additional interface (off Amazon) for a few more bucks but who cares -- we are FREE of Comcast.  And the Fire works just plain excellently.I will be recommending this little box to loads of my friends.  Goodbye forever Comcast, helloooooo Fire!", "verified": true, "helpfulness": "2/3", "author": "D. Kolton"}, {"rating": 1.0, "review": "Doesn't work as advertised, and needs a LOT of TLC.  This product has great potential, but in my experience it just isn't quite ready for prime time.", "verified": true, "helpfulness": "3/16", "author": "Jamie"}, {"rating": 5.0, "review": "Video rentals are too expensive", "verified": true, "helpfulness": "0/6", "author": "Harry MURPHY"}]