[{"rating": 5.0, "review": "We contemplated upgrading to a web-enabled TV, but for under $100 this system from Amazon gave us all the access to movies and TV shows that we wanted. Installation was very easy, and the controls are intuitive. This is the way all electronic systems should be designed.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "What's it mean when yellow light comes on and how power box off.", "verified": true, "helpfulness": "0/0", "author": "lorien malone"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Loved it!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Spring Majors"}, {"rating": 5.0, "review": "Works great easy to access my netflix and prime shows.", "verified": true, "helpfulness": "0/1", "author": "HAROLD THORNE"}, {"rating": 4.0, "review": "Very fast and smooth! I'm coming from an older Roku 2 XD (which has served me very well over the years) but the Fire TV is a huge step up in performance. Great picture quality and a nice user interface.I really only have a two complaints. The first is the way Amazon organizes and presents the Prime video content. Under the \"watchlist\" tab there is no way to separate your movies from TV shows, its just all jumbled together. Even the app on my old Roku broke up the movies and TV shows into separate lists or had the option to view the \"watchlist\" all together. Maybe there is a way to do this but i just haven't discovered it yet. The second issue I have come across is the the Hulu app. I have a Hulu Plus account and noticed that a maximum of 8 shows will show up in my queue at one time. If more than 8 shows are added they just don't appear in the queue. I also have a Kindle Fire HDX and the Hulu Plus app works well and has no issues displaying more than 8 shows in the queue. I contacted Amazon and Hulu about the issue, they both confirmed that it was a problem affecting the Fire TV only and not the Kindle Fire but no timeline on a fix.Other than those two issues I'm very happy with purchase and would recommend it to others. If anyone else has had the same issue with Hulu or no issues at all I would like to hear about it, maybe its something specific with my player.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"marinehrnt\""}, {"rating": 4.0, "review": "I really like the idea of Amazon TV. We bought this to get rid of cable, but unfortunately we are still locked into a contract. I think I like this more for my kids because they can link the content from the Fire HDX through this. We will probably move this out of the front room and into the kids room once we get another TV.", "verified": true, "helpfulness": "0/0", "author": "Amy C"}, {"rating": 4.0, "review": "Can this be used in Canada?", "verified": false, "helpfulness": "0/0", "author": "Ange NS"}, {"rating": 5.0, "review": "this has opened up all kinds of new As usual Amazon has done it again!hings for our TV, we are very happy with this item. a", "verified": true, "helpfulness": "0/0", "author": "Cathy G. Lattimer"}, {"rating": 3.0, "review": "I have the fastest internet service, yet when watching Netflix, it is constantly interupted with spinning as if poor service.", "verified": true, "helpfulness": "0/0", "author": "Connie Mitchell"}]