[{"rating": 5.0, "review": "This has added to my Comcast experience. I find the same is true with streaming as with Comcast. If you pick your brain and finally decide on a movie you would like to watch on any given evening, when it pops up on the screen, 9 times out of 10 it will be rent or buy. I understand why. If you are in business to make money you offer a poor selection of movies and ask customers to rent or buy the good selection. It's capitalism. At least it gives you the choice of watching or not watching. Sam", "verified": true, "helpfulness": "0/0", "author": "Sam Abshier"}, {"rating": 5.0, "review": "I love my fire tv! I haven't wretched a commercial in weeks. If you have the internet + Netflix, u can watch anything!!", "verified": true, "helpfulness": "0/0", "author": "Anwar Philson \"anwar\""}, {"rating": 5.0, "review": "WOW! INTUITIVE AND DOES EVERYTHING I REQUIRE. I ALSO BOUGHT THE GAME CONTROLLER THAT IS EQUALLY AS EXCELLENT.", "verified": true, "helpfulness": "0/0", "author": "The General \"The General\""}, {"rating": 5.0, "review": "Much better than the fire tv stick. It's a plus with the direct lan connection. The navigation feel is also better I'm not sure if it's the remote difference or it's just better hardware. I recommend this if you can hook up a direct internet line to it over the wireless fire tv stick.", "verified": true, "helpfulness": "0/0", "author": "d"}, {"rating": 5.0, "review": "We have been using ours every day.  Love not being glued to a certain time to watch what I like.", "verified": true, "helpfulness": "0/0", "author": "D'Guy"}, {"rating": 5.0, "review": "This works very well. I use it with a projector and have had no problems. I recently replaced the batteries and that was no problem.", "verified": true, "helpfulness": "0/0", "author": "Geoff W Sutton \"G W Sutton\""}, {"rating": 5.0, "review": "Excellent picture and audio quality. Never have any issues with downloading and video starts almost immediately.", "verified": true, "helpfulness": "0/0", "author": "Don l Anhalt"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Lina Franks"}, {"rating": 3.0, "review": "Great amazon fire and we really love this. High quality with a low price and I can watch comfortable with this one.", "verified": false, "helpfulness": "0/0", "author": "Freda Tooth Bone"}, {"rating": 5.0, "review": "Absolutely love this product and Love it even more paired with Sling TV got rid of our cable altogether. Was easy to hook up and easy installation. Navigation window is easy. One thing I do not like is after so long of inactivity it will shut off. There might be a setting to fix that I have not come across it yet.", "verified": true, "helpfulness": "0/0", "author": "Midwest Soccer Mom"}]