[{"rating": 5.0, "review": "I am new to video streaming (having just shut off my cable), and I added in NetFlix and Hulu along with Amazon Prime to give me a lot of options for a fraction of the price. The Netflix interface has *a lot* to be desired, so I'm hoping that will improve over time. Overall, nice interface for all the other content I've been using and easy to use. I thought the voice search feature would be more of a gimmick, but I find I use it all the time and it works perfect for a great user experience.", "verified": true, "helpfulness": "0/0", "author": "TTaylor"}, {"rating": 1.0, "review": "Do not understand how this works. Cost to much to stream.", "verified": true, "helpfulness": "1/20", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super quick setup..Love it", "verified": true, "helpfulness": "0/0", "author": "Navdeep Gadhoke \"NavdeepG\""}, {"rating": 4.0, "review": "the only major problem so far is the videos in \"YouTube\" keep getting stuck after several minutes.", "verified": true, "helpfulness": "1/2", "author": "Redhell"}, {"rating": 3.0, "review": "I bought this and a Roku 3 at the same time.  The Amazon Fire TV is a better device....BUT, it is Limited on Content.  We have all our purchased movies on VUDU and Amazon does not support or offer any way to connect to VUDU.  There are a number of other movie and channel apps that Amazon does not support.If Amazon offered the same connectivity it would be the best....but for now, I use the ROKU 3 most of the time while my Amazon fire tv collects dust waiting until Amazon wakes up and expands its offerings.Amazon also tries to direct you to buy shows to watch even if they are free to Prime users.  You have to be very cautious to not accidentally buy movies that you can get for free.  The voice search is cool, but again, it only works on Amazon content and does not expand to any other apps such as Netflix or Hulu.  So again, be careful to not buy a movie that is free in another app.", "verified": true, "helpfulness": "0/2", "author": "Nightdiverdown"}, {"rating": 5.0, "review": "Love my FireTV, is better than my Roku and much easier to maneuver than the Chromecast", "verified": true, "helpfulness": "1/1", "author": "Adam Rutledge"}, {"rating": 5.0, "review": "I love my amazon fire. Very easy to use just plug in and there you go, microphone works awesome.  I am using it for my Amazon Prime, Netflix and Pandora...even tried Hulu plus with it--works awesome.  Thinking about getting one for another room!  I would definitely recommend this to anyone!!!", "verified": true, "helpfulness": "0/0", "author": "sbarker"}, {"rating": 5.0, "review": "just great easy set up, and now at least I can keep up with all the shows I have heard about but never seen, great for the weekend binge-watch", "verified": true, "helpfulness": "0/0", "author": "Jill St John"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "gafenwick \"George A Fenwick\""}, {"rating": 3.0, "review": "I want to purchase one but it has to have VUDU!!!  Put VUDU on and I'll buy it immediately", "verified": false, "helpfulness": "1/6", "author": "V. Bashaw \"young adult librarian\""}]