[{"rating": 4.0, "review": "The build quality is amazing.... it doesn't feel cheap. It is snappy, quick and convenient. Being able to talk to it just makes it that much better! However I got it under the pretense that it had screen mirroring... I would love to mirror my BlackBerry Passport with it and yet I am unable to and I need it for work. It will be five stars as soon as that feature is fully available to all devices!!", "verified": true, "helpfulness": "0/0", "author": "Phillip Rogers"}, {"rating": 5.0, "review": "Easy to use, it as good as roku.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Extremely easy to hook up. Easy to use and lots of options!! Good value over it's competition.", "verified": true, "helpfulness": "0/0", "author": "KarenD"}, {"rating": 5.0, "review": "Love it.  Easy to install, use and with Prime there is a wealth of programs and movies to watch at no additional charge, both movies and tv.  I am so enjoying the opportunity to watch prior seasons of shows I started watching after initial season(s).  I love the fire tv!  Couldn't be more pleased with ease of use and content!", "verified": true, "helpfulness": "1/1", "author": "MWAA KLM"}, {"rating": 5.0, "review": "best", "verified": true, "helpfulness": "0/0", "author": "Superbart"}, {"rating": 5.0, "review": "Fire tv is excellent.  It brings up Amazon videos so much faster then my wifi enabled dvd device.  Love mine so I got one for my daughter.", "verified": true, "helpfulness": "0/0", "author": "Christine S Green"}, {"rating": 5.0, "review": "So easy to install, takes just a few minutes.", "verified": true, "helpfulness": "0/0", "author": "R"}, {"rating": 5.0, "review": "I was extremely happy with buying this for my father. Turning it on you're greeted  with a easy to follow howto. The store could use some cleaning up,  much like the Amazon site but voice search makes finding anything easy.", "verified": true, "helpfulness": "0/0", "author": "Lowsky1208"}, {"rating": 1.0, "review": "I feel foolish for buying it. Not sure what to do with it. Sucks to be Canadian.", "verified": true, "helpfulness": "1/9", "author": "Craig Abram"}, {"rating": 1.0, "review": "Quite disappointed.Although Amazon implemented good sound with Dolby Digital Plus, this box suffers from very poor picture quality. It displays extremely poor blacks resulting in a washed out picture. The same issue that plagues the Roku series.  The Apple TV remains the videophiles box of choice with inky blacks and a solid picture.I did like the remote and the speed of the device, but the picture quality is a deal breaker. I wonder if they even tested the device on  a high end (Panasonic or Samsung) plasma or OLED TV? Having been launched so late in the game, there is no reason this device should not have been superior to the Apple TV in every way. Additionally there is no Vudu or HBO GO support.  Disappointing.[This device was tested on a 64\" Samsung PN64F8500 Plasma TV]", "verified": true, "helpfulness": "3/9", "author": "B. Byrd"}]