[{"rating": 5.0, "review": "Fire TV is the best!  It is intuitive, a snap to set up, faaaast, and well engineered.  The voice command feature is great for us old folks who remember some things about what we want to watch but not others.  A great buy!", "verified": true, "helpfulness": "1/1", "author": "John L. Starnes"}, {"rating": 5.0, "review": "It does exactly what we are told ot does and does it well, which is all to rare in product descriptions, Easy to install and use, So far we have no buffering issues, which have had on other devices.", "verified": true, "helpfulness": "1/2", "author": "Greyhound"}, {"rating": 5.0, "review": "after having continuous problems with ruku - rebooting every time we use it, and sometimes more, I purchased this based on the reviews and amazon's rep. Even my husband has commented on the sharpness of the picture. download time is better too. Love the voice search on the remote control.", "verified": true, "helpfulness": "1/1", "author": "Susan B \"\"Tell me a story\"\""}, {"rating": 5.0, "review": "I am very impressed with the Amazon Fire TV, it was very easy to set up and has not given me any trouble using it at all. Very user friendly.", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 1.0, "review": "Fire stopped playing videos after 2 months.  Originally I loved this system.  Lots of fun with games and tv.  Now it's not worth anything.  Would advise against buying this product.", "verified": true, "helpfulness": "1/1", "author": "Judith Huckins"}, {"rating": 3.0, "review": "I've been using a Roku 3 for about a year and it is amazingly fast. I can start a netflix movie faster then on my blu-ray player. Then Amazon Fire TV came and has excellent review on it. The hardware has a 4-core cpu (roku 3 has 2) already got me interested. My 1st surprise was netflix app has to be downloaded and install. Done that and it worked even faster then my Roku 3 (wow). A week or so later it started to mess things up with my netflix ( no sound on some movies, and very strangely I lost my que ). Put my roku 3 back on and everything is perfect again. Can't figure out whats wrong yet, maybe i need to erase my netflix software and re-install it ( lol actually I dont even know if i can do that yet ).Since I only use the Amazon Fire TV for watching neflix, I can't tell how it works with so many other things that it can do. Wish me luck", "verified": true, "helpfulness": "5/5", "author": "David L."}, {"rating": 1.0, "review": "I will give this thing up until the return date. I shouldn't have to side load plex, I pay for the service, on normal google play I can get the plex app that doesn't cost anything. Furthermore the plex app on here is old. No web browser. Showtime app doesn't support my cable company, uh comcast, the one from google play does.Update: I've had to side load many apps, something I shouldn't have to do. It updated to the latest firmware without prompting me, now it locks up on video playback after awhile forcing me to unplug it and restart it. Amazon support basically told me to factory reset it. Instead I will be attaching a debugger, then sending them a bill for doing they're job, since they keep trying to recruit me.", "verified": true, "helpfulness": "3/11", "author": "Charles L. Eakins \"ceakins1\""}, {"rating": 3.0, "review": "I like Amazon Fire tv. However I am disappointed that there is no search engine app and seriously irked that a series tv show doesn't automatically continue to play the next episode! I loathe pressing the button after each episode. Huluplus and Netflix has automatic play. Please fix it.", "verified": true, "helpfulness": "6/9", "author": "Ara"}, {"rating": 3.0, "review": "First off, the speed is fantastic. I'm switching over from the roku, which would stutter and reboot occastionally, especially when running the Plex app. The AFTV handles Plex like a beast, so no complaints there.My biggest complaint knocked off two stars because it's a growing pet peeve of mine, but it might not be a big deal to many. With all the capibilities of this product, and the rokus that came before, you would think the popular movie apps would allow you easier access to the entire breadth of their respective libraries.For example, the roku Amazon app, to my memory, had genre searches within the Prime movie menu. By that I mean I could search under the Prime movie genres and only see the Prime movies available, where if I search under the entire genre listing, I'll get rent/buy/Prime movies. Using the genre catagories tonight was extremely disappointing. Hey, sometimes I enjoy checking out the odd horror or thriller film on the weekend, but with the Prime library, why do I have to look up Prime movies on my phone and find them on the AFTV instead of having a dedicated Prime genre gallery? It just feels like a money grab by limiting the number of Prime movie options shown.The same is seen with Netflix. Sure, you've always been able to search by the film title, but you're pretty limited to whatever categories show up when you open up the app. Here I mean here you see movies that are either under categories randomly generated from a random Netflix knows you watched, or are one of the ~30 movies shown for each genre option. The roku had a 3rd party app that, though poorly designed, allowed you to search by genre, subgenre, and then see all films within that group. The app even let you sift through movies that were being removed in the next few weeks and to view a list of movies that will become available over the next month or so.The ability to access the entire Prime or Netflix library by genre/subgenre would be great for heavy users who've cut out cable for these services. This is Netflix's entire reason for existence, so why not give the user the access to the entire library without visiting their website? As for AFTV, I understand they want us to buy/rent movies, but if a long-time Prime subscriber can only see a hundred rental/buy films and not a gallery of free 80's slasher films on a Friday night, he might just end up writing a review of the AFTV instead.", "verified": true, "helpfulness": "5/5", "author": "T Fitzpatrick II"}, {"rating": 5.0, "review": "I love this!  Games are great, as is the voice recognition.  Just what we needed for our brand new TV.", "verified": true, "helpfulness": "0/0", "author": "Karen Epermanis \"KEP\""}]