[{"rating": 5.0, "review": "Works great!  Can stream my favorite shows from Amazon Prime and Netflix at a super price.  I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "S. Egerton \"Kimsea\""}, {"rating": 3.0, "review": "So I was Hyped to open the box today, maybe im missing something here, but cant seem to figure out how to turn it off, also it claims u can play Netflix through the fire tv.. but that must be a lie because ive tried everything to get Netflix to open on the fire and cant seem to get it to work, that was pretty much the main reason I bought this thing, and lastly I cant figure out how to browse ONLY free content from my prime membership.  It does stream extremely well however, looks sleek and nice and has a bad @s$ remote with the voice search.", "verified": true, "helpfulness": "0/0", "author": "Michael Battista"}, {"rating": 2.0, "review": "buying a box to pay to watch stuff that's free on netflix? I feel like an idiot. You get more with netflix without buying a box. Paying 3.99 to rent old movies is crazy. I can go 1/4 mile down the street and rent from redbox ( a new release) for $1.30. Come on amazon get it together, expand your free library to compete with netflix and hulu.", "verified": true, "helpfulness": "0/7", "author": "ezbanshee"}, {"rating": 4.0, "review": "Great I like it", "verified": true, "helpfulness": "1/2", "author": "desmond thomas"}, {"rating": 5.0, "review": "I'm not here to write a book. It's freak'n AMAZING! I have an Apple TV, Roku, Chrome, Sony Blu-ray with apps and Samsung Smart TV. This thing blows them all out of the water, especially for the price.It's FAST and the picture is not a little, a LOT better then all the others. It isn't even close.There are little issues here and there, but Fire TV software seems to be evolving and improving, so I don't see any reason why I'd worry that they won't be eventually addressed. Mature Netflix has a better browsing/favoriting system, Apple TV has a more intuitive, easier interface. Roku is no longer a contender, Chrome just blows.  So, let's give Amazon Fire TV some time to catch up and hope they concentrate on the right things, my guess is they will.Setup was so easy I don't even remember it. Voice control has worked perfectly for me every time. Love that the remote is not infrared (no more pointing!), now I wish all my remotes were the same way.I was disappointed it wasn't set up for AirPlay, but after some searching I found the app \"AirPlay/DLNA Receiver PRO\" on Amazon's app store and it seems to work perfectly, so job-done. I've enjoyed all the apps I've downloaded so far.I've pre-ordered the Fire TV Stick and until something leap-frogs them, I'm sticking with Fire TV.", "verified": true, "helpfulness": "3/3", "author": "The Great Buzzwami \"Buzz\""}, {"rating": 3.0, "review": "How do you shut the Darn thing off??????? Thank you, Donna Lawler It wont shut off and the only way we can get it off is to approach the TV and shut the TV off at the TV…  HELP!!!!@#$", "verified": true, "helpfulness": "1/1", "author": "Donna Lawler"}, {"rating": 5.0, "review": "I really like the UI. Way more user friendly than most other boxes. It's fast and no glitches, My only gripe would be that it is rather cumbersome having to side load XBMC and navigate to it through a dozen clicks. I understand why they did it that way I just wish it was easy to put app shortcuts on the home screen.", "verified": true, "helpfulness": "0/1", "author": "Allen McPherson"}, {"rating": 5.0, "review": "Great product", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this product.  I used to use the apple TV.  Amazon fire tv is so fast, apps work great on it.  Movies look good.  Amazon prime has lots of content, and apps.  Plex media server works great too.", "verified": true, "helpfulness": "0/0", "author": "Gun -it"}, {"rating": 4.0, "review": "It was so good I sold my Apple TV. I do like what's available and the functionality. The only reason it gets 4 stars instead of 5 is they really screwed up on not making this compatible with a bluetooth keyboard. Apple does this, Amazon doesn't. With all of those passwords, it's an urgent requirement. There may be a keyboard that works, but it is specialized.", "verified": true, "helpfulness": "0/1", "author": "Jeffrey \"jbro\""}]