[{"rating": 3.0, "review": "I like the concept. But on several movies we don't get sound. So I will be returning this.", "verified": true, "helpfulness": "0/0", "author": "Christine Webb"}, {"rating": 4.0, "review": "Easy setup good value and great menu of apps", "verified": true, "helpfulness": "0/0", "author": "Veronica Kamerman"}, {"rating": 5.0, "review": "I received this as a gift and have been amazed how easy and efficient streaming has become.  Ideal for amazon prime customers as your watch list syncs with the device.  I love my kindle and now fire tv...Apple should watch its back!", "verified": true, "helpfulness": "0/0", "author": "Julie Young"}, {"rating": 5.0, "review": "Loving the ability to watch want I want when I want. The kids are loving the streaming.", "verified": true, "helpfulness": "0/0", "author": "Michael Nicholson"}, {"rating": 5.0, "review": "Amazon Fire works as described. Easy to hook up.  My beef is wirh amazon prime.  Very few free shows.  I find Netflix to be a better value.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "all seems good, but can not hook up to spotify", "verified": true, "helpfulness": "0/0", "author": "Jerry M. Glogowski"}, {"rating": 5.0, "review": "Returning it. I should have done more research on how to use and what to buy. Im sure its a good buy but just not good for me.", "verified": true, "helpfulness": "0/0", "author": "Melissa Sutton"}, {"rating": 5.0, "review": "My husband loves the Fire TV!!  If you like the 'old' television shows and movies, you will be hooked!  We didn't think we needed one more box or gadget, but this one is well worth it!", "verified": true, "helpfulness": "0/0", "author": "Lynn Barthmare \"lynnieb\""}, {"rating": 4.0, "review": "It's fast and does most of the things you would expect from a streaming device.  I don't like that the voice search only works for Amazon content.  If you want to search Netflix or something you have to manually select the letters. Also the usb port is useless at the moment.  It would be nice to be able to play video from a flash drive or plug in a wired controller.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "A must have if you have prime able to use your prime to it full ability", "verified": true, "helpfulness": "0/0", "author": "Brian"}]