[{"rating": 4.0, "review": "Wow, this thing is really impressive.Its fast.  Really, really fast.  And any Amazon videos load before you play them, making it that much faster.Has most major apps like hulu, amazon prime, netflix, plex, crackle, showtime, but NO HBO.Needs improvement with:Needs phone remote apps - roku and chromecast and even apple tv can be controlled by phone, not fire tv?? major drawback.Also, there's a high pitched noise emitted when a HD video is paused on my fire tv and the output is Dolby DIgital through Toslink optical to my receiver.  My receiver is a fully compatible DD Yamaha brand receiver.  I also use an amazon basics cable.  I spoke to tech support and they acknowledged a few units have this problem.Add voice search to all video appsSlightly improve voice search - searching for plex will bring up irrelevant games and then I must switch to app and select plex.  This happens sometimes with other searches - you have the right result but its not the default one and its mixed with completely irrelevant results as well.Otherwise, this unit delivers how you'd expect it to.  It just does, no need to go further into details.Add an app for my phone, expand and clean up the already awesome voice search, and fix the high pitched noise so I can use DD 5.1 surround and you'll get 10 stars out of 5 from me!Edit: Now android has an app and iPhone is awaiting one.  Good going amazon, way to integrate voice search into the phone app and not get lazy or greedy about it!", "verified": true, "helpfulness": "0/1", "author": "Revo"}, {"rating": 4.0, "review": "Not bad,  but with a slow internet connection it is frustrating to wait for it to load all the time", "verified": true, "helpfulness": "0/3", "author": "Robi"}, {"rating": 5.0, "review": "I haven't had cable for the longest time, to get my TV fix and not watch the same DVDs over and over again, I have always had streaming devices. The previous 2 devices I had were Roku's - one I gifted away and the other finally seemed to stop working after years. When I was looking to buy, I was comparing all the reviews and the different features of all the devices, but I found that with my research for the dollar amount I was spend I was looking at the same device, just different manufacturing. Wanting to try something different I opted for the Amazon Fire device. Set up was very easy and fast; visually Amazon is GREAT (menu layouts and video quality). I really like the home page and the feel of the remote. The only thing I have against the remote is that the previous menu button (turning arrow) reminds me of Roku's rewind feature (where it rewinds a few seconds), so I have inadvertently exited out of program a few times.Amazon has a boatload of applications; I never thought I would have downloaded games on a streaming device, but the Amazon Fire has me hooked. If you are a serious gamer, I don't think it will fit your bill, but if you are like me and enjoy playing from time to time you will love it! Now I just need to purchase the game controller. Additionally, I think one of my favorite features is how I can find youtube videos on my computer and then stream them directly to the TV. I am very satisfied with my purchase and would purchase again.", "verified": true, "helpfulness": "0/0", "author": "T. Hamm"}, {"rating": 1.0, "review": "I wouldn't buy anything gary busey endorsed, because he's a very strange person. wish it had been someone else a little more sane.", "verified": false, "helpfulness": "2/25", "author": "Kindle Customer \"paige\""}, {"rating": 1.0, "review": "Very disappointed. On of the main reasons for buying Fire TV was because of it's so called feature of the ability to watch SHOWTIME ANYTIME FOR FREE, THEN FINDING OUT THAT I WOULD HAVE TO PAY BETWEEN $1.99 - $2,.99 AN EPISODE, DEPENDING UPON WHICH SEASON I WANTED.  how is that for FREE?  Very misleading advertising Shame on you Mr. Bezos.", "verified": true, "helpfulness": "3/15", "author": "Ronza"}, {"rating": 5.0, "review": "Amazing product! Very fast, intuitive, friendly for your kids, it has everything you might want!", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 5.0, "review": "this item works great with my tv, it uses hdmi and picks up the internet signal with no problem, the streaming speed is definitely good", "verified": true, "helpfulness": "1/1", "author": "nel"}, {"rating": 4.0, "review": "This would have gotten a 5th star if it had 2 major hardware improvements:1) this advertises that it will output both Dolby Digital (through HDMI) and analog (through optical) simultaneously, when in fact, it does not. The only way to extract analog audio from this device is to dummy the output down, meaning the main room where surround sound exists is sacrificed. The reason for this desired setup is more common than all manufacturers in general assume. Many of us have needs for analog audio, mine is to use in other rooms of the house where I have multiple zones of audio pumping. Others may have a need for headphone units that take analog audio, or speaker bars that have analog audio.I located an optical decoder online for $40, the cheaper ones do not \"decode\" they simply pass through the sound. A decoder is required if the output is Dolby, so now the Fire TV for me is $40 more than I expected. I decided that since multiple products still don't get it with the newer outputs, I'd get one of these to own so I can use in the future with other products after this one.2) they also failed to incorporate an IR receiver on the unit, which means no learning to my universal remote. There are workarounds, eg: getting a Wi-fi driver on my remote processor, or getting a 3rd party USB to IR kit with a remote that has Amazon controls, etc. but I'd rather have it built in like the Roku and Apple TV both have. The way I look at this type of issue is that in a few years this will be replaced by a newer better box and so purchasing silly extras seem not worth my money.Those 2 hardware issues aside, this unit is fantastic! It's fast and the games are very fun. I haven't entertained a controller yet, but I might try making my PS3 controller work, which requires a $2.99 download and a little bit of setup.The unit just worked out of the box! They already set it up with my amazon account by default which was cool. Coincidently, our Roku 2 has been running flawlessly with Amazon Prime for quite some time, and the day after I ordered this, it kept asking for my amazon account & password. I'm assuming that by setting this unit up, it somehow wiped existing devices off my account, and it did this 3 times. That wasn't very convenient, but not a huge deal.Comparing to Roku 2, which started to lag a bit recently, this device kicks butt! Super fast, responsive, and the content looks more crisp, especially older stuff (not as grainy and pixelated as on Roku) and the sound is better since I can now utilize Dolby Digital (Roku was not compatible with my receiver so I used 5.1).For $84, you can't really go wrong here!!", "verified": true, "helpfulness": "0/0", "author": "Daniel J Taylor"}, {"rating": 5.0, "review": "Best thing ever!", "verified": true, "helpfulness": "0/0", "author": "Katie Maas"}, {"rating": 5.0, "review": "I Love my Amazon Fire TV,especially the voice feature.I also love the games and I'm not a game player but with the controller I bought with the Fire it makes it fun, my sister got the whole set like mine the same day She saw mine. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Sierrasarumi"}]