[{"rating": 4.0, "review": "I have been trying to set up the device for the past hour. It continues to give me the message that it cannot connect to the servers. My other devices are working fine so I know it's not my connection. It's very frustrating that I can't just turn on the device and have it work. I was looking forward to this new technology. I believe I'll return it (thank goodness for free 90 day trial) and purchase a Roku.It took two days but it finally decided to connect (just turned it on and it was working). I do really like it but find that it freezes up quite a bit. I've turned off every other item connected to my wifi, hoping it would solve that but doesn't seem to help. I still think I'll keep it. The ease of use is great and I have a category for prime movies so I guess Amazon fixed the issues others complained about.", "verified": true, "helpfulness": "2/7", "author": "Amanda11279"}, {"rating": 5.0, "review": "I was skeptical at first, but once I got it and easily plugged in and set up, I LOVE it!  Way to go Amazon.  All my Prime movies/shows just a remote button away now.  It is such an easy scan for movies.  I don't use the voice activation much, b/c I don't always know exactly what I want to watch.  Keep it up Amazon, Love you guys/gals!", "verified": true, "helpfulness": "0/0", "author": "Goober"}, {"rating": 5.0, "review": "I absolutely love my fire tv player.  I boots up instantly and is easy to use.  My only complaint is the netflix app is nowhere as easy to use as the wii was.  I would also like more recommendations tied to my interests.  Keep up the great work amazon", "verified": true, "helpfulness": "0/0", "author": "Kreig Peterson"}, {"rating": 5.0, "review": "Finally, thanks to Amazon Fire TV, I am no longer limited to what I want to watch.  It was simple to install. The remote control is easy to use. Now i have the chance to be selective at my pace, not the cable company's pace.  Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 4.0, "review": "I like the less is more attitude as far as the functions of the remote control are concerned. I still feel an on/off button must be included. The small innocuous unit is very appealing and is certainly a talking piece. I remember when cell phones weighed 3 lbs. Don't laugh. You all saw Lethal Weapon with Danny Glover and Mel Gibson trying to use that aircraft carrier to make calls.Besides the picture streams almost as a true 1080p..", "verified": true, "helpfulness": "1/1", "author": "Amateur Critic"}, {"rating": 4.0, "review": "This is a preliminary review, based on my having used the Fire TV for only a few days. Out of the box I was nearly dumbstruck at how small the unit is; it is truly only about as big as two decks of playing cards laid side by side! Setup was straightforward and uneventful. I would suspect that only the most technologically challenged will have any difficulty getting the unit connected.One thing I noticed immediately is the text and resolution of the images you see on the menu screen is sketchy, at best. The picture quality of the streaming video is fine, but reading the descriptions of the selections or any of the setup menu text is next to impossible. I dug into the settings to find where I might improve this, to no avail. There's a setting for video quality, but of the four settings (1080p 50Hz, 1080p 60Hz, 720p 50Hz, and 720p 60Hz) plus Auto, the unit would only allow me to select the Auto setting. It showed the other four settings as being \"unsupported\". I know for a fact that I have a 720p 60Hz receiver, so why I was not allowed to select that instead of Auto baffled me. I plan to discuss this issue with Amazon at my earliest convenience and I will post an update.As others have noted, there's no way to filter out just the Prime content, so you're left to look for the white and blue Prime banner in the upper left corner of each viewing selection. A minor quibble at this point, but hey Amazon, as long as you're adding new services and features, why not make that one of them? I'm not opposed to paying to view something from time to time, but let me see just the Prime stuff, too, if that's my desire.As I said, the picture quality is aces and I've already enjoyed a few episodes of some of the newly added HBO content, as well as having watched a documentary. One feature I especially enjoy is being able to pause whatever I'm watching and picking up where I left off later on my Kindle Fire HDX. That's a super handy feature I know I'll enjoy in the future.As for the wireless capability, connecting to my wireless network was uneventful. One thing, however: depending on your connection, you may find the unit buffering your streaming feed more often than you'd like. That got me annoyed real quick, so I went with a wired connection to the router; problem (seemingly) solved.All in all, I think I'm going to really like this latest addition to my entertainment center. The only drawback at this point is the resolution of the menu screens and my inability to manually select the video quality. Otherwise, the quality of the streaming content itself is great. If you're already a Prime member, this is a no-brainer at $99. My Prime membership pays for itself in the shipping fees I save over the course of the year, so all this great film/TV content is icing on the cake!UPDATE 6/3/14 - I spoke this morning with Amazon tech support regarding the issue of the muddy looking text and images in the menu settings. The tech had me plug the HDMI cable directly into my HDTV. This solved the resolution problem I mentioned above. But there's a catch: My HDTV only has one HDMI input. It's an older Samsung DLP projection model, refurbed and circa 2005 model. It's been a fine unit for me for seven years now, and I've gotten around the single HDMI input issue by having all my HDMI inputs go through my home theater receiver. This works well enough for my Blu-ray player and TiVo, so why not the Fire device? I can't be the only person who has a home theater configured in this way, so I would love to hear from someone else who runs their Fire device through a home theater receiver. Anyway, that might be a caveat for those considering a purchase such as this, but if you have a newer model HDTV with multiple HDMI inputs, then you're probably good to go. Still enjoying the Fire device and the great content, though, in spite of this drawback. Looking at newer HDTV's, though...it's about time. I've definitely gotten my money's worth out of the one I have now!", "verified": true, "helpfulness": "2/2", "author": "bud"}, {"rating": 2.0, "review": "I did not know I had to purchase episodes of my favoraite TV shows or movies. Even older movies I have and just wanted to see if Fire TV had them they ask for payment. Well I guess since I gave up cable, free TV is not really free.", "verified": true, "helpfulness": "1/3", "author": "Theresa E. West"}, {"rating": 3.0, "review": "I order the Fire with big hopes. Unfortunately my dreams were dashed. We currently use a Sony Blu-ray player to access Amazon Prime content, use a built-in ap on the TV for Netflix and have a cable company DVR for \"regular\" TV content. Was really hoping the Amazon Fire would be good to access Amazon Prime and Netflix.Unfortunately the Amazon TV box only partially worked. I booted up fine and let me navigate through but would not load any programming to watch just ended with a black screen. I thought maybe it needed to load updated software so left it to it's own devices for a couple of hours.  Well, it partially loaded a show then the same black screen. Tried rebooting, tried reconnecting then got the Amazon Fire help desk. He was very friendly and we tried all the same things again even rebooting my internet router. Same problem remained.After a good 30 minutes being on the phone with the help technician I decided it wasn't worth the hassle right now. The wanted to \":open a ticket\" that could take a couple of days or more to find the problem. That didn't work for me. Ask just to send a replacement unit that was ok but again it would take the two (often 3 days with Amazon Prime) and I am leaving and needed to set this up for the rest of the family before I leave. I actually paid for expedited shipping to get this in time to set up. Kinda was over the whole Amazon Fire TV when they wanted my credit card number for the new unit.  Finally I just asked for a refund and a shipping label for the unit. It will be returned tomorrow.Pro's: Small unit that doesn't take much space. The voice search seems fine. It could be a fun toy or not.Con's: When you search it show's all sorts of content. If you pick a title that is free for Amazon Prime members it doesn't tell you that. It looks like you need to but the title. You have to maneuver through the \"more options\" to see if it is a free Amazon Prime title. This is pretty rotten and defeats the purpose of using the Amazon Fire box. The box is connected to my account and should be able to show me up front which titles I get free under the Amazon Prime membership.I might try the Fire TV in the future. Hopefully Amazon will work out the bugs and make it more user friendly and less cluttered. Is this were a free or really cheap unit then the clutter would be fine but not for the $99 you have to pay.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "We thought the TV and movie access was just a new perk for being a Prime member but it is just another \"pay per view\". The machine works fine but probably would not have spent that much to get a pay per view service that many people get from TV anyway.", "verified": true, "helpfulness": "0/4", "author": "Frederick D Hutchins"}, {"rating": 5.0, "review": "I have had my Fire TV for a little over a week now and my family and I love it. Very easy to use and extremely fast. Way faster than an Apple TV! I would definitely recommend this product to anyone considering a streaming box!", "verified": true, "helpfulness": "0/0", "author": "Eric V"}]