[{"rating": 5.0, "review": "I remember a time when I stated how awesome it would be to watch whatever I wanted whenever I wanted and only what I wanted.  That was many years ago and I really never expected it to become a reality.  Fast forward to today and Amazon Prime, entertainment and information flow doesn't get any better than this.  The Fire TV shocked me with it's diminutive size and power.  No more freeze up's and long load times with this box, it's fast chocked full of memory and speed.  Surfing for movies is a delight and the voice activiated feature is incredible.  I just can't say enough good things about the Amazon Fire TV unit, it's such an awesome setup.  Some review's have said the interface could be better but after a week of playing with it I love the interface and how the screen scrolls through the movies, it's a user preference thing I guess.  A lot of thought went into this box and it shows.  5 stars to Amazon for this incredible service!", "verified": true, "helpfulness": "2/2", "author": "Thomas W. Moon"}, {"rating": 1.0, "review": "I owned this device for the hope I could root it, and customize it.  Sadly it's locked town tighter then a tightwad. It has so much potential, however lacking the Play Store and now the impossibility of root access,  I'll have to ditch this thing for a Google Nexus Player. So sad.", "verified": true, "helpfulness": "0/5", "author": "Sovereign"}, {"rating": 5.0, "review": "Love my Fire TV! Great product and easy to use! I would love to see extras, like ESPN or other sports channels, without having to subscribe to all those applications. That is where the costs start to reflect cable TV. I am done with cable TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to setup and navigate.", "verified": true, "helpfulness": "0/0", "author": "Frank Costanzo"}, {"rating": 5.0, "review": "Excellent, no complaints. I have several other different units around the house, and now the Amazon Fire TV to our collection to be able to access Sling TV with no hassle and Prime.", "verified": true, "helpfulness": "0/0", "author": "Christoph"}, {"rating": 5.0, "review": "I really didn't know what to expect but was very pleasantly surprised.  Easy to use and set up... voice commands work perfectly.  Now that I have more bandwidth with Excede I can finally use my video streaming from Prime.  This makes it SO easy to do.  Great product and a good price.", "verified": true, "helpfulness": "0/0", "author": "J Asbury"}, {"rating": 5.0, "review": "We have enjoyed watching this.", "verified": true, "helpfulness": "0/0", "author": "Judith Crim"}, {"rating": 4.0, "review": "I was terrified into buying this handy gadget by Gary Busey's enormously scary teeth.  I hooked it up and hesitated to turn it on, afraid Gary Busey would appear in my living room and be crazy to me until I died. Thankfully it works great, I can watch all the movies and shows off of Amazon that don't have Gary Busey in them.", "verified": false, "helpfulness": "1/1", "author": "Candis"}, {"rating": 5.0, "review": "Two words: the best.", "verified": true, "helpfulness": "0/0", "author": "TV"}, {"rating": 3.0, "review": "I like Fire TV for the most part, but I am disappointed that Amazon only allows you to view \"older\" or \"previous\" seasons for some popular shows.  BBC's Orphan Black and FX's The Americans are 2 examples.  For the new seasons they want to charge $3 per episode - on top of the annual \"prime\" membership.  That's a rotten way to treat your subscribers.", "verified": true, "helpfulness": "1/3", "author": "rlungtha"}]