[{"rating": 2.0, "review": "Didn't see any real value since we already have Netflix and Prime through other devices. The \"cool\" voice search feature, only works within the Amazon app. Useless otherwise.", "verified": true, "helpfulness": "0/3", "author": "jshmoe"}, {"rating": 5.0, "review": "I really didn't know about buying this at first. but I love this thing. I can stream espn and netflix in hd and it is really fast and very clear. I enjoy using it and the little remote thing is easy to use. the only thing that would make it better is if the little remote could control the volume on the tv.", "verified": true, "helpfulness": "1/1", "author": "Ethan"}, {"rating": 5.0, "review": "Excellent device. My parents are older and not accustomed to the Chromecast I bought them, but they have no difficulty navigating this after I set them up on it.", "verified": true, "helpfulness": "0/0", "author": "Eclectic"}, {"rating": 5.0, "review": "Easily to set up to and sync to my Amazon account.  Very fast processing and easy to use interface.  Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Watchdog"}, {"rating": 5.0, "review": "I am a not particularly techie senior citizen.  This gizmo was easy to set up and I was able to use it without a problem.  I immediately cancelled all but basic cable because the content is so rich in the Netflix and the Prime sections.", "verified": true, "helpfulness": "0/0", "author": "Lin Hart"}, {"rating": 5.0, "review": "I experienced some trepidation about ordering this after reading some bad reviews, but I have had this for a week now, and it works perfectly.  It is absurdly easy to connect, and offers so much for so little.  The Amazon Prime features can be searched via voice.  Others, such as Hulu and Netflix require you to look through their genre-themed groups, but that is how it works on other devices anyway.  There is a search feature that allows you to \"type\" in search terms, like actor name or movie title as keywords, but I don't find it any clunkier than other not-computer interfaces.  This device is fast and easy to use.  It is quite intuitive, rather like an Apple product.  I am very pleased.", "verified": true, "helpfulness": "0/0", "author": "James K Motsinger"}, {"rating": 5.0, "review": "Love this gadget.  I joined Hulu Plus.  I have cable, and frequently can't find anything I want to watch.  Switch to Fire TV and pull out movies I missed, TV shows I miss.", "verified": true, "helpfulness": "0/0", "author": "Sue Lujan"}, {"rating": 5.0, "review": "Goodbye Roku!", "verified": true, "helpfulness": "0/0", "author": "Eric L. Anderson"}, {"rating": 5.0, "review": "I bought this based on it's specs.  Quad core processor,  2 gb RAM, wireless using the 802.11 ac standard.  The interface is good. Not as clean as my Roku 3 or Apple TV (3rd gen).  But the streaming performance beats them all.  Voice search is cool.The remote is about the size of the Roku remote.  But it has a matte finish that just feels great in your hand.  Fit and finish of the unit and the remote are best in class.Get one.  You'll love it.", "verified": true, "helpfulness": "0/0", "author": "Caffiend"}, {"rating": 5.0, "review": "I LOVE IT!!!!  It Rocks!", "verified": true, "helpfulness": "0/0", "author": "cheryl"}]