[{"rating": 3.0, "review": "It was a little easier to set up than I expected after reading some reviews.  I was disappointed to discover that the movies are periodically interrupted and the picture quality varies during the same film.  I expected better viewing quality.  Also, I thought I could view episodes of current TV shows, it appears I only have access to past seasons.  That's very disappointing.  I'm a Prime member, but there is still a lot that I have to pay to see. I was hoping to reduce my cable bill, but I don't think Amazon Fire was the right choice.", "verified": true, "helpfulness": "0/1", "author": "Rose Boyd"}, {"rating": 5.0, "review": "This thing is awesome!  I have a few Chromecasts around the house and I very mistakenly believed they served the same purpose!  Boy was I wrong!  This is a full computer! It replaced my XBMC PC as it can run XBMC/Kodi even better than my PC.  Once I had it running I realized that with the great remote and the excellent performance, I could sell all my other devices and the stick and fireTV is all I needed!  Great product!", "verified": true, "helpfulness": "0/0", "author": "ZbyTheBeach"}, {"rating": 2.0, "review": "Not enough access to regular TV broadcasts", "verified": true, "helpfulness": "0/2", "author": "stevet"}, {"rating": 5.0, "review": "the Amazon fire TV is a great device for your media watching pleasure. since purchasing the TV I have cut all cables and strictly use the Internet for television watching. the response time of the fire TV is awesome and I like the simplicity of use", "verified": true, "helpfulness": "0/0", "author": "three"}, {"rating": 5.0, "review": "My whole family is addicted to it!", "verified": true, "helpfulness": "0/0", "author": "leo nemeth"}, {"rating": 4.0, "review": "Other than to screen mirror feature not working, its great. If they fix the screen mirror it would be almost be perfect.", "verified": true, "helpfulness": "0/0", "author": "HVAC"}, {"rating": 4.0, "review": "Nicely integrates with Amazon Prime, and Netflix works nicely. Games library is a bit sparse, but a few are good. Set-up was a bit pedantic and took a while, mostly because of tutorial video (that doesn't seem to be skip'able) and software updates (that really probably should have been done behind the interminable tutorial movie!) but overall very nice.", "verified": true, "helpfulness": "0/0", "author": "BRP"}, {"rating": 5.0, "review": "Love, love, love it! I've been an Apple TV guy for several years, in fact I have 3 of them.  Two things have made me abandon Apple TV however.  Plex and Pandora!  I've recently transitioned from iTunes to Plex for my personal movie collection (about 6TB of video).  Plex puts iTunes to shame and unfortunately, Apple TV does not offer Plex.  Then there's Pandora.  I love Pandora and have regretted not having that on my Apple TV.  I've gotten around that by pulling up Pandora on my phone or iPad and beaming to Apple TV, but it's so much more convenient to just have the app on the TV to start with.  Anyway, I'm now fully in the Amazon Fire TV camp and will never look back to Apple TV.  The voice command on the Fire is also cool and works great.  I wish it worked for my personal video collection as well, but it doesn't. That's my only criticism of Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it. Got it to sideload Brighthouse cable app and don't need their little digital boxes for my other televisions. Saves me a couple of dollars a month. Plus has netflix, prime, vevo and other great apps. Best thing is ability to sideload android apps without rooting the unit using developer tools option. Great streaming box, works better than my computer for streaming.", "verified": true, "helpfulness": "1/1", "author": "E.C. Leonard"}, {"rating": 5.0, "review": "It was extremely easy and fast to set up. Also, the picture quality was a lot better than the Playstation 3 that I had been using.", "verified": true, "helpfulness": "0/0", "author": "Laura Hoffman"}]