[{"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Andrew D."}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "melissa newell"}, {"rating": 1.0, "review": "I've been considering subscribing to Amazon Prime but the only thing that keeps making me think twice is the lack of support for chromecast I don't want to have to by a Fire brand device just to watch Amazon Prime shows come on Amazon get with the program, the company would make more money supporting all devices then this silly restriction on forcing the customer to use a Fire device.", "verified": false, "helpfulness": "1/5", "author": "Jeffrey Solorio"}, {"rating": 5.0, "review": "With the vast array of viewing options available on Fire TV I have cancelled my cable subscription and realized savings of more than $60 monthly! The huge selection of movies, music, games and TV shows means there's always something good on.", "verified": true, "helpfulness": "0/0", "author": "Freddie"}, {"rating": 5.0, "review": "Seriously awesome, streams better than my Xbox. Using Sling, and Amazon Prime on it right now and they're great. The beauty of having voice search and an RF remote are such a convenience. No typing, and it's one less box in front of my TV. I'm really thinking of cancelling my satellite now.Few months using this now, I've noticed that Roku has come out with the new Roku3, it has RF and voice, as well as a headphone jack on the remote so you can watch without bothering other people (baby sleeping in my case). But the biggest advantage I found is that they offer a LOT more options for apps (video streaming services) and they also show search results for Netflix and Hulu (Fire TV only shows Hulu). So I might be going for the Roku3 and selling this thing. Hopefully the streaming on the Roku is as good because this Fire TV is amazingly clear. Just need more video streaming services (No CBS for instance).", "verified": true, "helpfulness": "0/0", "author": "Beezer"}, {"rating": 5.0, "review": "Received timely with no issues or complaints. Your service is appreciated.", "verified": true, "helpfulness": "0/0", "author": "R. S. Hutchinson \"Sue Hutchinson\""}, {"rating": 3.0, "review": "Does not work well with sattelite tv , but I have heard it works well with dsl and reg high speed", "verified": true, "helpfulness": "0/2", "author": "William Rogers"}, {"rating": 5.0, "review": "Nice quality. Easy to install. Great little streaming machine.", "verified": true, "helpfulness": "0/0", "author": "Lyn"}, {"rating": 4.0, "review": "There's no need for cable TV", "verified": true, "helpfulness": "0/1", "author": "claudia"}, {"rating": 4.0, "review": "Amazon Fire TV is great if you love living in the Amazon Ecosystem!", "verified": true, "helpfulness": "0/0", "author": "Pasquale Lucenti"}]