[{"rating": 1.0, "review": "It worked unless we had to reset our wireless. Then it froze. Spend at least two hours on phone with tech support. They blamed it on our router (even though every other device in the house worked fine on the router). Their solution? Go to the neighbors and try it to see if it works on their router? You gotta be kidding.", "verified": true, "helpfulness": "10/26", "author": "Scott Moldenhauer"}, {"rating": 5.0, "review": "I received the unit and connected it to my TV and easily configured my WiFi network. Once connected the latest software was downloaded and installed without any issues and I was then browsing available movies, etc.  I will be reducing my cable and using this for movies, etc.", "verified": true, "helpfulness": "0/0", "author": "Paul L. Monette"}, {"rating": 4.0, "review": "all this and its missing FACEBOOK and a wi5i keyboard I hope its coming soon because I have most of it all on my tv", "verified": false, "helpfulness": "0/3", "author": "dennis Sardenga"}, {"rating": 5.0, "review": "I love this device. I setup my Netflix and Hulu Plus very quickly. My Amazon prime was already setup. The movies and TV shows load SUPER fast and this was a very affordable device. I don't see any need for cable anymore. I think this is worth every penny and I'm surprised they didn't charge double for it.", "verified": true, "helpfulness": "1/2", "author": "Stacie M Drake"}, {"rating": 5.0, "review": "I am happy with my recent purchase of Amazon Fire TV, I was amazed by how easy it was to set up and enjoy watching a variety of movies and t.v. shows that are my kindle fire hd.", "verified": true, "helpfulness": "1/2", "author": "anthony harris"}, {"rating": 5.0, "review": "I love my Amazon Fire TV.  The voice recognition on the remote control is AWESOME, no more scrolling through an online keyboard to find the letters you need to search for the movie you want to watch.  Just press a button and say the name of the movie.  There is it, in all forms of options, Amazon TV, Hulu Plus, you name it.  Want to play a game, you can.  And, I highly recommend the Game Controller.  Plus, the games are often and very inexpensive compared to PS4 of Xbox.  They do need more titles though.  Guess what, you can also listen to music with great programs like iHeartRadio.  The graphics are great, movies stream flawlessly, and the search feature in a movie works much better than say on a Roku or even most smart TVs.  The best part is the price $99.  Plus, unlike most movies on demand, if there are specific movies  you like to watch often, you can buy them without having to get a DVD or Blueray.  Time to go watch a movie.", "verified": true, "helpfulness": "1/1", "author": "TommyBear \"ttdat\""}, {"rating": 5.0, "review": "I am a tech nerd, if it is new and interesting, I own it.  As an early adopter of Roku, upgrading through-out the years, I have to say that Amazon Fire TV is a great product.  I had it set up less than 5 minutes and was watching videos from my library.The voice controlled remote worked with no problem and actually found it easy and compared to my Xbox One voice control. I admit my Samsung Smart TV works well, but the voice option does not compare to the Fire TV; being able to talk into remote, the close proximity to my voice is definitely an advantage.The Amazon Fire TV's ease of use and the price is excellent combined with the huge video library makes this an excellent investment.", "verified": true, "helpfulness": "1/1", "author": "Laura Hopkins"}, {"rating": 5.0, "review": "I didn't want to put a Fios receiver in the kids' room, mostly because I didn't want to pay 'rent' for another Fios receiver. The Fire was simple to install (I didn't even need to call for back up), I found a ton of shows the kids could watch since I'm already a Prime member, and I love the parental controls.  Just make sure you turn off your one-click ordering, so your kids don't accidentally purchase any movies or games.  I can limit the amount of time they spend watching or playing, I can know what they are watching, and with the talk feature on the remote, they can find their favorite shows all on their own.", "verified": true, "helpfulness": "1/2", "author": "L. Mac \"macasche\""}, {"rating": 5.0, "review": "I own a lot of electronic gizmos, Roku 2, Xbox One, PS4, Apple TV, and well a lot more. Having said that I really like the interface of the Fire TV and how well it works for consuming Amazon and other Fire TV content providers.Surprisingly enough the feature I have really enjoyed is the voice enabled search. My wife and I were discussing movies we wanted to watch and we decided on Robin Hood: Prince of Thieves. I clicked the voice search button, said \"Prince of Thieves\" and voila it was there, ordered it in a second or so and we were then watching it.The over all interface is very easy to navigate and user friendly. All in all I recommend this device for anyone who doesn't already have a online streaming content device.", "verified": true, "helpfulness": "2/2", "author": "Philip Loyer"}, {"rating": 5.0, "review": "It sets up in less than five minutes.  Has so many apps and options for viewing.  Talk to remote is a great feature.  I've never written a review before but felt I should let everyone know what a great product and value this is to extend your entertainment.", "verified": true, "helpfulness": "2/4", "author": "GRV"}]