[{"rating": 5.0, "review": "We have a good quality HD TV that is not a smartTV.  This was a great alternative to the expenditure of replacing the set.  it was extremely easy to get set up and running.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fantastic!!!!! Was hard to learn all that it offered without research but worth the effort.", "verified": true, "helpfulness": "0/0", "author": "Chris Jemmett"}, {"rating": 4.0, "review": "GREAT PURCHASE,I LOVE THE VARIETY THAT COMES WITH MY NEW AMAZON FIRE TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "great idea--easy use-- easy hook up for new TV's, but can be difficult  and tricky as  older TV's will need  special  wiring or connections --", "verified": true, "helpfulness": "0/0", "author": "C G."}, {"rating": 5.0, "review": "Christmas gift love it I am glad i didn't get cable", "verified": true, "helpfulness": "0/0", "author": "NEDRA FOSTER"}, {"rating": 5.0, "review": "Excellent Picture Quality and Super Fast Menus Masks this the Best Steaming Device to date!  I do suggest that you ensure you have an excellent wireless network signal (801.2n standard) or that you hard wire the box with a standard Ethernet cable so as to get the most enjoyment possible from this device..  Buy one, you'll be glad you did..", "verified": true, "helpfulness": "0/0", "author": "Jeff D"}, {"rating": 5.0, "review": "LOVE it!  We may cancel our TV cable!  Love how easy it is to use, and not to use!  No unhooking wires, etc. just go another way.", "verified": true, "helpfulness": "0/0", "author": "Frank D. Turner"}, {"rating": 5.0, "review": "One of the best products for being able to watch your Amazon and Netflix account. Also like you can add new apps to it. Unlike Apple TV", "verified": true, "helpfulness": "0/0", "author": "Brandy Moss"}, {"rating": 5.0, "review": "Awesomeness in a box ♥", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got the deal with the three-month sling subscription and it was great. In addition to that service I can seamlessly browse video and music contents with my Amazon Prime membership", "verified": true, "helpfulness": "0/0", "author": "Julio"}]