[{"rating": 5.0, "review": "Excellent so far.  I have had no trouble and the Voice control works great.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Wally Kopp"}, {"rating": 5.0, "review": "Love it now I have both on two different TV's. Now music and movies in the cloud are now on the big screen.", "verified": true, "helpfulness": "0/0", "author": "deborah robinson"}, {"rating": 1.0, "review": "When it arrived it didn't work at all. I was really disappointed especially since my first one only worked 24 hours and had to send it back to.", "verified": true, "helpfulness": "4/6", "author": "Krystahl \"Krys\""}, {"rating": 5.0, "review": "Love it so much, I purchased another one for my other room instead of having to take it with me.", "verified": true, "helpfulness": "1/1", "author": "Creative One \"Creative4ONCE\""}, {"rating": 5.0, "review": "Have the Fire Stick also - excellent products all the way around . Solid video streaming with no lags.", "verified": true, "helpfulness": "0/0", "author": "Robert Bohan"}, {"rating": 5.0, "review": "Really like the functionality and layout - user experience is excellent!  This little box helped me cut the cord.  I've installed XBMC Kodi so I am vrry pleased.  The entire family uses this with ease.  Considering buying a 2nd box.  Got Prime with the money saved from cutting the cord :)", "verified": true, "helpfulness": "0/0", "author": "Romaro Nelson"}, {"rating": 2.0, "review": "Why would you sell a HD device to watch movies, without supplying a way for it to connect to the TV.  You have to buy the cable second and the recommended item is a 6 foot HDMI cable for $13.Be careful when buying this.  Especially if you don't look at what is in the box.", "verified": false, "helpfulness": "2/6", "author": "chris studnicki"}, {"rating": 5.0, "review": "This is a great TV Stream box. The user interface is clean & easy to use.", "verified": true, "helpfulness": "0/0", "author": "Leilajake"}, {"rating": 5.0, "review": "Absolutely amazing content!", "verified": true, "helpfulness": "0/1", "author": "Donna M. Gardner"}, {"rating": 5.0, "review": "Love it!! Just what I wanted and need! I didn't realize is was going to be that small, but its perfect and not in the way!", "verified": true, "helpfulness": "0/0", "author": "Christy Uhrich"}]