[{"rating": 5.0, "review": "Wonderful device! My only criticism is that you cannot watch HBO GO on it. That is a huge drawback.", "verified": true, "helpfulness": "0/0", "author": "Junebaby"}, {"rating": 5.0, "review": "Amazing product.", "verified": true, "helpfulness": "0/1", "author": "Juan Francisco Pina"}, {"rating": 4.0, "review": "Still figuring it out ....... to many pay per views on tv shows", "verified": true, "helpfulness": "0/3", "author": "RON BLIHAR"}, {"rating": 3.0, "review": "Not as reliable as I had hoped, but then again it hasn't been out that long.  I've had it since release date, and frequently have to hold the center button + play button to restart it as it states it \"doesn't have a network connection\".  Further more there is no option on the pop-up message to \"refresh\" the connection, which I find ridiculous. I have it connected via Gigabit Ethernet along with a Roku 3 and PS4 that never have problems with network access.  The AFTV has locked up completely during use a couple of times as well.I really like the voice search, but only wind up using it 25% of the time.  It would be much more useful if they would port it for use in-app as well (i.e. Plex)The UI is not as polished or intuitive as Roku.  I wouldn't recommend the AFTV to anyone not technically inclined, as it's definitely more cluttered than other players.  It does quite a bit more than other players, but for most users they simply want a good reliable media player that's fast.The games are probably just as cool as the voice search itself, but again I don't play them often.  I can see Amazon getting the FireTV into households that simply want a small gaming device, with having media player capabilities as well.", "verified": true, "helpfulness": "1/2", "author": "RDubbs"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So much better than ROKU and Chromcast!  If you have Amazon Prime you need this little device.  It works like a charm and is lightening fast.  Little or no delay upon start up unlike ROKU.  Easy set up and can be taken with you to a new location with ease.", "verified": true, "helpfulness": "2/2", "author": "George L. Snediker"}, {"rating": 3.0, "review": "Its a pain, I live here in Colombia , South America, and amazon movies, HBO Go and others dont work here.", "verified": false, "helpfulness": "1/4", "author": "Cajacontrol \"Ing\""}, {"rating": 5.0, "review": "enjoy the unit very much , easy to use", "verified": true, "helpfulness": "0/1", "author": "Jacob Cosby"}, {"rating": 4.0, "review": "I completely love this. I've had EQUISO, NeoTV, Apple TV, The Little Black Box and now Amazon TV. By far Amazon TV is my favorite for streaming. The remote seem so much well developed and responds almost immediately to the TV. The speak-to-search function is the easiest function I've ever seen. The interface looks the most up-to-date and is really pleasing to the eye.After saying all that, Amazon TV needs one improvement. We need a JUST PRIME Search function. When you search for a show or movie, we would like a JUST PRIME filter, so we don't have to go through the items that need to be purchased. Other than that, this is the best media box out there at the moment. Completely happy with my purchase.", "verified": true, "helpfulness": "3/4", "author": "Jason"}, {"rating": 4.0, "review": "Works great. Very easy to install and get up and running. Operation is a snap. Only problem I have had is some confusion over content being available on Amazon prime or having to rent it. Voice search is great.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}]