[{"rating": 5.0, "review": "I love this.  I had a ps3 that I was using for streaming.  huge and bulky.  This is small, was very easy to install. Which is great, because I am not tech suavy", "verified": true, "helpfulness": "1/1", "author": "Colleen J. Hays"}, {"rating": 4.0, "review": "Had several issues with this early on but they have since been resolved.", "verified": true, "helpfulness": "0/0", "author": "Steve...into EVERYTHING!"}, {"rating": 5.0, "review": "love it!  This is very easy to use, and we are quite pleased with it!", "verified": true, "helpfulness": "0/0", "author": "Sue D."}, {"rating": 4.0, "review": "Gave as a gift but so far no complaints.", "verified": true, "helpfulness": "0/0", "author": "Wendy P."}, {"rating": 3.0, "review": "It's okay. Haven't found any really special content. I love Prime shipping and needed this to access content.", "verified": true, "helpfulness": "0/0", "author": "K. Dodge"}, {"rating": 5.0, "review": "We love what his device will do.  Movies, music, and many more features...more than I can describe here (or use, for that matter).  We enjoy tapping into the Amazon movie inventory and one of the \"online\" music sources we loaded...Iheart radio.  There are dozens of source sites for movies, music, games, you name it.  We use the FireTV in our motorhome, so the constant struggle is to have a WiFi source capable of running it.  Campgrounds tend to have weak or spotty WiFi, in which case we use a T-Mobile Hotspot...which works great (again, if there is adequate signal).  I used my Iphone one time and it worked well also.One other note....When I first got this thing, in usual fashion, I was struggling trying to get it working.  I finally called Amazon customer service and after getting passed up twice...the third guy took over a half hour trying to figure out the problem.  He was terrific..  He just kept on until he found the problem and bingo...we had Amazon FireTV!!!  This thing is a must have for every RVer....well, I guess you can use it at home, too, if you must.", "verified": true, "helpfulness": "1/1", "author": "T. Young"}, {"rating": 5.0, "review": "Enjoying it every evening.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Happy with Ooma\""}, {"rating": 2.0, "review": "Ok, so here is a technical review of this item, which I sorta wish I never bought now. Amazon is super weird about their Prime Movie service, I don't know why they just are, as you can't use it (without some effort) on other devices other than Amazon products or an iPad etc. I guess they think bending the arm of the consumer will increase sales, it doesn't no one is going to purchase their products because of one feature - it is a short sighted and stupid policy. However, they have the Amazon Fire TV, which I thought would be a solid product and easily tweak able and something I would like on the cheap. I was wrong, once again some meddling moron at the top who looks at things through proprietary 1995 glasses as a way to push the product line forward. They take an open platform and lock it down, and all to make it as difficult as possible to use the item you rightly paid for and own.Case in point, if you want to go to your Google play store and install some apps YOU CAN'T, nope they do not allow that on the AFTV platform. Why you might ask? I don't know go ask some micro managing moron who is woefully over paid why - I got nothing. What would you like to do on the Google Play store you ask? Oh something like download a keep awake app since I can't make the device stay awake to you know play music for hours. Sure I can tell it not to snooze but the default is going to override it, and why would they not make this a user defined variable, because some moron at the top thinks we don't know what we want. What if your wife works at night and needs music playing through the day uninterrupted on Pandora, oh sorry babe Amazon will not allow me to let this just play continually though the day because screw you is why.But wait, I can root this device, if it is on a certain bios revision, and then block their update in my firewall. Yeah, and if it goes wrong you bricked your device and it is now a paperweight. If I want I can go to lengths that allow me to use my product the way I want, and navigate around the meddling managers moronic decisions....why should I or you have to do this? What about if I want Kodi installed on this app, it is after all on the app store to load, nope can't do that they took it down. But is it still on Google Play, why yes it is and works perfectly on Android devices.Bottom line is just don't buy this, unless you are happy being restricted in what you can do, and never want to customize it for your needs. There are plenty of better options out there for cord cutters as this is just too restrictive. I would love to know when Apple and Amazon will let the customers use their products they buy they way they want?", "verified": true, "helpfulness": "0/0", "author": "P. Tapley \"Evil Genius\""}, {"rating": 5.0, "review": "What can I say, I love this thing!Before having Fire TV I was having to connect my laptop to my tv when wanting to watch Netflix or Amazon Prime shows. Now I am able to keep this connected and its a breeze.The functionality is amazing and very simple. The remote has very few buttons ( I think 7 or 8) which allows even the most electronic illiterate ease of use.This is something the whole family can enjoy. I use it primarily for Netflix and Amazon. My wife uses Hulu and pandora while my son uses it to play games and other apps.The only downfall is the voice search only works for Amazon prime shows. If the can update this to include all forms of media it would be fantastic.I have had a couple issues where Netflix quit working and wouldn't load any shows. I called customer service and they were able to walk me through it and get it up and running again in minutes. If you have this issue here are the steps to resolve it.1.  From the Home screen, select Settings.2.  Select Applications > Manage All Installed Applications > Amazon Video.3.  Select Force Stop, and then select Clear Data.4.  When prompted to Delete App Data, select Clear Data again.After you've cleared the application data, remove the power cord from the back of the device or from the power outlet, and then plug it in back in again to restart your Amazon Fire TV. You should then be able to watch your video.Hope this helps!", "verified": true, "helpfulness": "0/0", "author": "Shad G."}, {"rating": 5.0, "review": "I am not technically inclined - but so far I am loving it.", "verified": true, "helpfulness": "0/0", "author": "Marie Schaffer"}]