[{"rating": 1.0, "review": "Went to set up my AF TV today and it wouldn't recognize my remote.  I tried it on two separate TVs and got the same response.  Changed batteries and got the same response  Guess I'll stick with Hulu.  There's works.", "verified": true, "helpfulness": "3/4", "author": "Happy Camper"}, {"rating": 5.0, "review": "Easy set up.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "I already have Netflix on my DVD so I was going to give the box to my daughter. However, after trying it, the picture was so clear and accessing Netflix was so easy. I kept it for myself. When watching a series, the Fire box automatically advances to the next episode. I can even see the photos I took on my phone. Overall, the Fire box is a good deal!", "verified": true, "helpfulness": "0/0", "author": "D. Moyler \"Harlemite\""}, {"rating": 5.0, "review": "\"Amazon Fire TV\" - is almost to good to be True!  But it is!AMAZING! - but 'Seeing is Believing!'You'll need to get one yourself and after a Quick Installation - you'll know how really GREAT this product is!  The very small Remote (with a 'Microphone') needs to be seen, as well!  (You'll be very surprised with what you can do with the 'Microphone!')So far my friends agree, 'Seeing is Believing' but they tend to believe that it costs $99 dollars per year (probably because it'st so NEAT!)  I quickly dispel that notion - saying, \"NO, it's a one-time payment of $99.\"However, you should be a \"Prime\" member to really use all of the benefits!Get your own \"Amazon Fire TV.\"  You will NOT regret it!", "verified": true, "helpfulness": "0/0", "author": "Bert Berry"}, {"rating": 5.0, "review": "This product was very easy to set up and use. We have enjoyed watching movies and are very happy with this pruchase.", "verified": true, "helpfulness": "0/0", "author": "Betty Miller"}, {"rating": 5.0, "review": "Loving my fire TV. . . so easy to use and so fast!  Hulu, Netflix and Amazon Prime, so awesome.", "verified": true, "helpfulness": "0/0", "author": "Teghan R Meyer"}, {"rating": 2.0, "review": "Not acceptable without 30Gb network.", "verified": true, "helpfulness": "0/5", "author": "Joseph L. Moyer"}, {"rating": 5.0, "review": "I dumped Direct TV for two Hulu 3's and bought this immediately upon release.  I love the Amazon Fire.  The Remote is wonderful and voice feature is great too.  I already had wifi-TV with Amazon App but this is nicer than going thru the TV remote.  We also bought the HD TV Antenna's from Amazon for local reception.  Together with the other products, the Amazon Fire TV is the perfect solution for TV.WHEN WILL AMAZON GET LIVE ESPN?  ESPN Needs to be on FIRE!  We would like to watch Football and other sports live someday soon.", "verified": true, "helpfulness": "0/0", "author": "jumper"}, {"rating": 5.0, "review": "This does exactly what you need it to do for streaming content. Very easy to use and very easy to setup. While there are plenty of people who knock it because of the search results including non-Prime content, but this is a very small issue while it does have a section on the home screen for just Prime content that you can scroll through.It is very fast and responsive in all programs, especially for Amazon content. I have never had anything load faster then when watching Prime shows or renting a movie through Amazon.ONE CAVEAT: If you are buying this to replace an existing streaming box or dongle, I would advice against it. While it does everything very well, it is not leaps and bounds beyond what is already out there.", "verified": true, "helpfulness": "1/1", "author": "Scott Donahue"}, {"rating": 5.0, "review": "...you are linked into the Amazon universe. If you have Prime, and don't have any other set top box, then the Amazon Fire TV is a no  brainer. If you already have a Roku, then I don't see the need for the Fire TV. I do have to say that the Fire TV is fast and has a very nice interface. The voice commands work great. If I'm looking into another set top box, the FIre TV will be my next purchase.", "verified": true, "helpfulness": "0/0", "author": "Ray Castillo Jr"}]