[{"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/1", "author": "isaias Bermudez-Martes"}, {"rating": 5.0, "review": "Works as advertised! On sale at Staples for $84.00.", "verified": true, "helpfulness": "1/2", "author": "Marine480"}, {"rating": 5.0, "review": "Easy to use and responds to voice commands with no problem.", "verified": true, "helpfulness": "0/1", "author": "Ablejo"}, {"rating": 5.0, "review": "I love these units. They are fast easy to use and stream all of my services including my person Plex server. Wonderful unit.", "verified": true, "helpfulness": "0/1", "author": "William Helgeson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Justin Tran"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "LRS"}, {"rating": 1.0, "review": "Why all the German language", "verified": true, "helpfulness": "1/6", "author": "Alan Simmons"}, {"rating": 3.0, "review": "Amazon Fire TV is good, but lacks streaming channels compared to Roku.  Fire TV mirroring work OK, but with the HDX Kindle tablet if your cable provider is Comcast you will be unable to download the Comcast application to stream channels from your tablet and mirror on your TV.  This was a big reason we choose Fire TV, to mirror our Comcast channels, but as we have learned it is not possible to load the Xfinity Comcast app on the HDX Kindle, therefore no mirroring Comcast channels.  Google Play Store is the only place to download Xfinity and Google Play does not support Kindle's.  In my opinion Roku has Fire TV beat at this time with Mirroring and the number of news, sports and entertainment channels.  We will be going with Roku for now.  Fire TV may be a little faster than Roku with the quad core processor.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 1.0, "review": "The screen goes black for several seconds up to a minute or more several times during shows or it freezes on a scene but the audio continues until the video has a chance to catch up.Wish I had not purchased this item.", "verified": true, "helpfulness": "0/3", "author": "c j s"}, {"rating": 3.0, "review": "Voice search isn't available in individual apps like netflix you have to type out your search. I'm not sure how the voice search compiles results, I found that an HBO Go show like Game of Thrones will come back in the results but Netflix movies don't.  Wish there were more apps like a YouTube app for instance. Works pretty well overall though.", "verified": true, "helpfulness": "1/2", "author": "Benedict J. Fischer"}]