[{"rating": 5.0, "review": "love this!!!!", "verified": true, "helpfulness": "0/0", "author": "WBG"}, {"rating": 5.0, "review": "Excellent!  Got for Holidays to see some movies we couldn't get on Comcast and have been very pleased with access, both through Amazon and other services, like Netflix and Hulu.  Still exploring what else this supplies, but well worth it.", "verified": true, "helpfulness": "0/0", "author": "The Omnist \"the_omnist\""}, {"rating": 5.0, "review": "Worked great!!!!", "verified": true, "helpfulness": "0/0", "author": "Rick Rougeau"}, {"rating": 5.0, "review": "Got it quick and it works great", "verified": true, "helpfulness": "0/0", "author": "Michael T Greene"}, {"rating": 1.0, "review": "The technology behind the Amazon Fire TV is amazing and I wish it would work for us.  We have Direct TV and the extra channels we wanted to access we couldn't get because Amazon and Direct TV do not have a working relationship.", "verified": true, "helpfulness": "1/2", "author": "Sleepy's Person \"Linda McL.\""}, {"rating": 5.0, "review": "I bought it for my son for Christmas and he loves it. It's cheaper than the game consoles and the games are cheaper also.", "verified": false, "helpfulness": "0/0", "author": "larissad"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Steven K. Noeth"}, {"rating": 5.0, "review": "Easy set up right out of box. Selection of shows outstanding", "verified": true, "helpfulness": "0/0", "author": "William D. Wilkie"}, {"rating": 4.0, "review": "It's by far the best...It's heading in a good direction with the games, but I can barely play all the games I have due to the limited space to save the games. Fire TV should allow you to have a USB or hardrive connected to download all the games from Amazon. I always have to delete certain games and redownload over and over when I want to play them.", "verified": true, "helpfulness": "0/0", "author": "jhonnatan A."}, {"rating": 5.0, "review": "Great price AND beautiful graphics.  Leave it to Amazon to produce an apple TV like device that does more.  The voice search feature is spot on every time! (just talk clearly, distinctly and not shouting.)", "verified": true, "helpfulness": "0/0", "author": "Tom S \"Tom S\""}]