[{"rating": 5.0, "review": "We have used AppleTV, Google ChromeCast, and a Roku but they all fell short.  The Amazon Fire TV is fast, has great quality video and works with my entire video collection on my NAS via Plex.  This is now the center of our media solution in the livingroom.  Well done Amazon!", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was the easiest device to setup. I have Apple TV and have used BlueRay players since they started with apps. And we have streamed from our iMac, PCs, laptops for years. This has the smoothest playback with little to no issues. It works well in an area where wifi is weak. Navigation is simple, and the voice search system is the best approach I have used. It keeps getting better with upgrades. It is ideal for people with AmazonPrime. Netflix is better and quicker than using a wired Apple TV or wifi BlueRay player.", "verified": true, "helpfulness": "3/3", "author": "Donald W. Johnston Jr."}, {"rating": 3.0, "review": "All in all it works like any other devise to stream, the set up is simple. However I hate that the other devises  I stream with like my blue ray player are simple and make it easy to find free prime content and this is not.  A bit disappointed in this.", "verified": true, "helpfulness": "2/3", "author": "Lena childs"}, {"rating": 5.0, "review": "Works great: there's a lot of content that we would not normally access on a laptop, like Crackle and even Amazon Prime video, that is easier to share as a family on this device.  One interesting thing, which may fascinate the privacy watchers out there, is this: the Amazon Fire remote control seems to have learned how to switch the input source on my TV.  That is, I press the Home button on the Amazon Fire remote, and the TV, which was on input source #5 for theTiVo, switches to input source#3, which is the input source for the Amazon Fire.  Has this happened to anyone else?", "verified": false, "helpfulness": "2/2", "author": "Gerry"}, {"rating": 5.0, "review": "Fire TV is easy to setup and very user friendly. It does what I need and I'm looking forward to additional apps.The one app. I miss and hope to see is the Amazon Cloud music player. I'm also hoping for the History Channelapp. The only problem I had was with my Linksys WiFi. I failed to add Fire to the allowed list and couldn't get mypassword to be accepted. All in all it's a very good device.", "verified": true, "helpfulness": "0/0", "author": "Dennis \"The Technician\""}, {"rating": 5.0, "review": "i bought for my husbands birthday gift its awesome recommend highly to all my friends and family a must have", "verified": true, "helpfulness": "1/2", "author": "Juan Carrillo"}, {"rating": 5.0, "review": "just want to no if u need cable or it just hook up n it will work please let me no about this email thanks", "verified": false, "helpfulness": "0/2", "author": "rose"}, {"rating": 4.0, "review": "This tiny little box has a ton of stuff on it. Set up was easy, and I literally was sucked in immediately. I like the user interface and the overall look and setup. I own a Sony Media player and this is far beyond that. A few things though....the voice search only works for Amazon Prime...it's cool, but it would much MUCH COOLER if it worked for Netflix and Hulu Plus as well. Also it freezes on occasion, especially on some of the video streaming stations they offer. This could be my provider as well, but when I reset the box it usually works better, so I think it's the box. Anyways, this doesn't happen to often, and overall I am very pleased.", "verified": true, "helpfulness": "1/1", "author": "William Dansby"}, {"rating": 5.0, "review": "It picks up the wireless service great. Small remote with all the functions. Function controls are easy and simple to understand.", "verified": true, "helpfulness": "1/1", "author": "Willied"}, {"rating": 5.0, "review": "I've tried Apple TV and Roku and now Fire TV.  For me, Roku was a significant step up in streaming quality from Apple TV -- a lot fewer freezes or hiccups.  But Fire TV was another step up.  I now use the Fire TV for all downloaded TV.  So far, it is the fastest and most problem free.  The Roku will move to the bedroom and the Apple TV will move to the closet.", "verified": true, "helpfulness": "4/5", "author": "Axel175"}]