[{"rating": 4.0, "review": "Love it only down side is the voice doesn't work for any of the apps.", "verified": true, "helpfulness": "0/0", "author": "Guillermo_Melendez"}, {"rating": 5.0, "review": "Love this device. Have bought several more for every room in the house, and buying more for family.", "verified": true, "helpfulness": "0/0", "author": "Luke collier"}, {"rating": 5.0, "review": "As part of the cable-cutting generation, I got this with the Sling TV deal as a way to ween myself from expensive (and unwatched) programming. I've played with Rokus in the past, as well as Apple TV, but I was mightily impressed with the feature set available from this device. It's snappy, doesn't lag while streaming, and provides me the most access to Sling, Netflix, and Prime. This was tested with an ethernet connection (as my wireless router is not very powerful). Regardless, my primary complaint is the lack of storage space on here (for example, I installed two games of about 2 gb each and I only have about 2.7 gb left). I might try to use a USB stick as supplemental storage, but we'll see. Another innovation that would be nice is an easier way to put the device to sleep when I'm away (it only uses about 6 watts at peak, but I'd rather it use as little as possible when not in use). As far as the cloud storage, it's nice, but not as fast in terms of utilization as a media pusher from multiple devices (ie: use my movie library and use this as a streaming device like I can on the Roku). Overall though, I really enjoy what Amazon is doing here. They've realized that as a company services are what sells, and they're providing plenty of that lately, which is why this device is so heavily integrated with their prime network. Kudos for that.", "verified": true, "helpfulness": "1/2", "author": "Stewart Wilkins"}, {"rating": 5.0, "review": "I love my Fire!  Easy to set up and I even took it on vacation.  I wish it had more free movies though.  Maybe make a section where its all of the Prime movies you don't have to pay for?", "verified": true, "helpfulness": "0/0", "author": "Jennifer Kern"}, {"rating": 2.0, "review": "It is a device which is not what one would expect.  Don't get it if you think you can watch TV for free.  A little black box that sucks money from your wallet.", "verified": true, "helpfulness": "0/0", "author": "Mike Moffett"}, {"rating": 5.0, "review": "Great Product !", "verified": true, "helpfulness": "0/0", "author": "Christopher Vasquez"}, {"rating": 5.0, "review": "So nice to be able to watch Amazon Prime and Netflix on the big TV instead of the laptop or iPad! I plugged it in and it worked.Really no set-up other than putting in my Wi-Fi password. The voice remote is nice, but it only works for Amazon Prime.This was a very good purchase for me.", "verified": true, "helpfulness": "0/0", "author": "Cathy Chamberlain"}, {"rating": 4.0, "review": "So far so good.  You don't get 5 stars because finding free content can be a bit daunting.  That isn't so much a problem with the device but with how Amazon presents the information.  Prime videos should be separated from the pay stuff.  That being said, set up was a simple as unpack the box, hook up the wires and go.  The hardest part was finding the wireless network password and entering it.  Once done, watch the little introduction video and away you go.  Streaming was as advertised, voice search really works, video quality is excellent.  I am certainly glad I bought this gadget and sorry I waited so long to do so.", "verified": true, "helpfulness": "0/0", "author": "fanwoodguy"}, {"rating": 5.0, "review": "I love it.  No buffering.  Works great.  If you already pay for a Prime membership, there is no reason NOT to buy this for the free video options (TV & Movie), free music - you will get your money's worth.", "verified": true, "helpfulness": "0/0", "author": "M. Ultz \"Eclectic Energy\""}, {"rating": 5.0, "review": "Flippin awesome, highly recommend to cord cutters, just add Sling and Amazon prime, done!", "verified": false, "helpfulness": "0/1", "author": "Marc Browne"}]