[{"rating": 5.0, "review": "Awesome \"Android\" box!I love it. Fast and powerful system. I have been using it everyday since I got it probably a year now. This thing is nice. I installed Kodi without issue and it stream great. Apps works but the OS is a little hard to get used to at first but after it's a breeze. Apps that's not on the amazon store (usually the one you push) are in the setting...app section. A bit of a pain to get to but oh well.Amazon play back does experience some issue where I get an error so I have to reset the Fire TV but otherwise no lag, freeze or slow down. This is a hit from Amazon.Overall: A great pick if you have Amazon Prime. I have this and 4 Fire Stick.As always thank you for reading my review. If you find my review helpful please up-vote or like.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "Amazon Fire TV is everything I wanted in internet TV. Thanks Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Teresa S"}, {"rating": 5.0, "review": "I love it. I started using it after I git rid of my cable. Don't feel the need to get cable again. All the great shows are either on amazon or on one of the apps you can easily download. It's easy to navigate, it keeps my recent apps readily available. The voice search has never had any issues locating the item I'm searching for. And if the movie or show is not available for free on amazon prime, it even tell me if it's available to watch for free on my hulu app instead of just telling me to purchase it or having to search on my own.", "verified": true, "helpfulness": "1/1", "author": "Sheree Collins"}, {"rating": 1.0, "review": "This was given to us off our Amazon registry. Not sure if it's a lemon or not and can't tell if we'll ever find out because Amazon's customer/technical service has been garbage so far in helping with this item, which usually isn't the case.The box would freeze up, not connect to the internet or just turn off. I factory reset it and now it won't even connect to the wifi. I ordered a amazon fire stick, plugged it into the same TV and it's working perfectly while the amazon fire TV box still isn't. Like I said, Amazon's customer service has been clueless on helping me as well. Will try to return and keep the stick I guess.", "verified": true, "helpfulness": "0/2", "author": "Texas Tiger"}, {"rating": 5.0, "review": "This is the best streamer around. We watch something new every night. We have been able to cut our cable expense by a lot thanks to the Fire TV. Love it!", "verified": true, "helpfulness": "0/0", "author": "Cheryl L. Stephenson \"sherry Stephenson\""}, {"rating": 4.0, "review": "Still getting used to it but it has such potential - I was able to \"ditch\" the Time Warner Cable so it is a plus for me financially.", "verified": true, "helpfulness": "0/0", "author": "avidreader"}, {"rating": 3.0, "review": "Bought it a while ago have not used it much. Seams like what I am looking for is not there or is not free", "verified": true, "helpfulness": "0/0", "author": "LRM"}, {"rating": 5.0, "review": "Great Product and very responsive!", "verified": true, "helpfulness": "0/0", "author": "Leonard W. Hooper"}, {"rating": 5.0, "review": "Easy to use.  So quick too!  Just love it.  Better then TWC & Directv.  So easy to hook up. I can't believe how small it is.  Easy to navigate thru menu. Easy to understand.  So glad I bought this.  Would like to see everyone in family switch to this and cut their cable bills.", "verified": true, "helpfulness": "0/0", "author": "Debra L. Newton"}, {"rating": 5.0, "review": "Just got my amazon fire tv. It's easy to use what else can you ask for? I have prime and hulu plus. I get everything I want to watch and then some. Time to go tell my satellite provider to go pound sand.", "verified": true, "helpfulness": "0/0", "author": "Cj93"}]