[{"rating": 5.0, "review": "Great device for streaming media. I mounted it easily behind my bedroom TV. Definitely considering getting a second Fire TV for the living room.", "verified": true, "helpfulness": "0/0", "author": "Allen Purcell"}, {"rating": 5.0, "review": "I've purchased other products but this is buy far the best! It's so easy to use I'm buying 3 more for my other televisions and more to be given as gifts. Bye bye satellite and cable we don't need your price gouging bills anymore!! This is the BE all of wonderful television products!!!!AWSOME I LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "Little Bit of Honesty"}, {"rating": 4.0, "review": "great, but would like the following improvements:1.  Would like a favorites tap, like your kindle fire HD tablet.  Would like to be able to organize apps.2.  Would like more apps.  Write now I have Roku players, Apple TV, gogo stick and cromecast stick.  Gogo stick and cromecast is a wast of my money.  Apple TV and Amazon Fire TV are simular, but Fire TV has a better proccessor.  roku has more apps.  If you had more apps, I would make my Amazon Fire TV my primary player.3.  Games believe will be better on Amazon Fire TV.  But sucks with Amazon Fire remote.  Recommend ship box with game remote and get rid of remote.  I do not have game remote yet, but I believe it will work better.4.  Search needs a lot of improvements.  Does not always understand what I'm saying and when I try to due text search it does not bring up key board.  I believe this can be fixed with a software update or mybe I just do not know how to get keyboard up.", "verified": true, "helpfulness": "1/2", "author": "Adamo Rodriguez"}, {"rating": 5.0, "review": "Where do I start. We are Amazon Prime members and only use Amazon services. We returned the Roku and stopped using Apple TV. Everything positive said about this product is true. Fast, great video, great sound, easy interface and best of all voice command. The voice command never fails.Worth twice the price.", "verified": true, "helpfulness": "1/1", "author": "Rimfire"}, {"rating": 3.0, "review": "Super easy to use and operate! I want to give 5 stars but I continue to have two major issues.  One (the biggest) netflix won't play the selected item. It connects and processes fine for about 3 seconds - then an error appears to try again later; pick a different show. Two - SOUND! The sound blanks out in every show regardless of source, every 5 seconds (I timed it). UGH!  I looked for an update and couldn't find anything. I thought this problem had been fixed.  Does anyone have any ideas?", "verified": true, "helpfulness": "0/0", "author": "kmct"}, {"rating": 5.0, "review": "This is my first experience with this type of unit and I must say I'm amazed. I set it up on my samsung tv and it was easy to set up and it works fine with the provided remote.", "verified": true, "helpfulness": "0/0", "author": "luke lange"}, {"rating": 5.0, "review": "I've used a Roku for several years, and what bugs me most is the occasional reloading that seems to plague Roku.  I've often turned it off in frustration because I can't make sense of a program that reloads every minute.  Amazon Fire has a good strong connection and remains connected even in an area that doesn't have the best Internet connection.  I found the voice search capability fascinating.  It works well, and gives what you ask for.", "verified": true, "helpfulness": "1/1", "author": "wtcdean"}, {"rating": 4.0, "review": "The product has similar features to earlier smart tvs and BlueRays but does most of them using voice commands which have been very accurate. My only suggestion is to add an off switch as my old brain does not trust the unit to time out after I shut off the tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this mainly for the surround sound feature. However it is very easy to use and the video is clear and steady.", "verified": true, "helpfulness": "0/0", "author": "Billding"}, {"rating": 5.0, "review": "RATED THIS A FIVELIKED EVERYTHING ABOUT THIS ITEM HOURS OF ENJOYMENTID RECOMMEND THIS ITEM TO ANYONE THAT LOVES WATCHING QUALITY MOVIES AND PLAYING GAMES", "verified": true, "helpfulness": "0/1", "author": "Michael Gomora"}]