[{"rating": 5.0, "review": "Works great, pretty good selection, and for a very reasonable price..", "verified": true, "helpfulness": "0/0", "author": "Leila Sequim"}, {"rating": 5.0, "review": "Started with Google but not even comparable with this little box!!!", "verified": true, "helpfulness": "0/0", "author": "Nannette Contos"}, {"rating": 5.0, "review": "The future is here with high performance. Use every day. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "christopher l clutter"}, {"rating": 5.0, "review": "Super easy to install. Basically a plug and go type thing. Very much worth the price and I love the remote. User friendly and the voice command works great. Get it! You won't be disappointed. I've already recommended it to several friends and family.", "verified": true, "helpfulness": "0/0", "author": "Erin Riley"}, {"rating": 5.0, "review": "I just want to say thank you so much for the service & product - It works perfectly", "verified": true, "helpfulness": "0/0", "author": "Du T."}, {"rating": 5.0, "review": "Amazon Nailed it with the the Fire TV. I'm the kind of person who collects their own Media. I have all my Media (movies/TV) stored on my HTPC, I'm a long time user of XBMC and i'm always trying to find the perfect device that will play all my media. Forget trying to jailbreak apples products to do the job. I had the jailbroken ATV2 and it was sluggish and not very pleasant to operate. The Xios DS was also slow, Chromecast actually works well for this, but the fire tv has better hardware so i thought i would test it out.  I gave up waiting for a jailbreak to come out for the ATV3 and then Recently Amazon sent me an invitation to try out the Fire TV. When i opened the packaging i could tell right away amazon had made a great product! I plugged it in and set it up, the whole process took about 10 minutes, it really couldn't get any easier. I installed Plex and was streaming my own content to the Fire TV in just a few moments with no crazy setup procedures and no need to jailbreak anything. It just works and now my family can watch prime movies or our own collection via PLEX. I love XBMC as well, but plex was extremely easy to install and it gets the job done as well so i'm sticking with plex on this build. I'm done with cable and netflix, with plex i can stream my own content to all my devices and share it with my friends as well. My friends love that they can watch my movie collection at their own homes or on their phones.For those of you already using this setup i found the atv3 preset in handbrake a be a good setting for playback on the fire tv and chromecast via plex with no transcoding. Your results may vary, but that's what works for me.", "verified": true, "helpfulness": "2/2", "author": "MikeI"}, {"rating": 5.0, "review": "So happy with fire TV!  Super glad to no longer be tied to expensive Direct TV,  Fish,  and Infinity!", "verified": true, "helpfulness": "0/0", "author": "Janice Vaughn"}, {"rating": 4.0, "review": "I own 7 Roku devices ranging from previous gen models to now owning 3 of the current Roku 3 models (I also own an Apple TV).  I wanted to give the Fire TV a try to compare.  I like it a lot.  If it had Vudu as a channel option, it would replace a couple more of my Roku devices.  It is fast, has good picture and sound and pretty easy to search for things although the voice search has been a little hit and miss.  It will probably get better over time.  I would recommend it highly if you are an Amazon Prime Member (I am).  Out of all the channels avail on Roku and Fire TV, I really only use Amazon Video, Netflix, Vudu, YouTube, ShowTime Anywhere and occasionally Amazon Cloud Player for music.  Roku has all these and the Fire is only missing Vudu. Either device should do a great job for you.  Apple TV has a way to go to catch up, but its good for Apple stuff.", "verified": true, "helpfulness": "1/2", "author": "Darren J. Hamilton \"djhamilton872\""}, {"rating": 2.0, "review": "Received my device in the mail yesterday (Saturday, October 4, 2014. Set it up and had trouble with it staying loaded..still skips and goes blank....extremely annoying!! Planning on returning it and purchasing the Roku 3", "verified": true, "helpfulness": "0/5", "author": "Rhonda J. Sippel"}, {"rating": 3.0, "review": "What attracted me to this item was the USB port.  I did not know that the USB port is useless currently... but I would have explored option as this does not provide me what I was looking to do.The product itself is newer than what I have for my kindle, and plays programs on my plex network as well.  I do recommend it, and like it better than Google Chromecast; but for the cost of each of them, i probably would have gotten the chromecast as the needs this product provides is already satisfied by other devices attached to my tv.I'm going to wait (but not long) to see what they do with the usb port... however, if they don't let me use it soon, I will likely sell this off on ebay to fund a better solution to my tv.", "verified": true, "helpfulness": "0/2", "author": "C.J. De Groff"}]