[{"rating": 5.0, "review": "We absolutely love it! The voice recognition is flawless even on my deep Texas accent. Plus the ability to watch many different channels on one system is amazing. Great product.", "verified": true, "helpfulness": "0/0", "author": "jaenpop"}, {"rating": 3.0, "review": "nothing unusual from other similar products", "verified": true, "helpfulness": "0/0", "author": "george r"}, {"rating": 5.0, "review": "Best item I got in a long time", "verified": true, "helpfulness": "0/0", "author": "SKI Drobinski"}, {"rating": 5.0, "review": "Works great fast shipping!", "verified": true, "helpfulness": "0/0", "author": "John R"}, {"rating": 5.0, "review": "I had tried using 2 different Sony DVD players on different TVs to stream from Amazon prime.  One was connected directly to router and the other was Wi-Fi.  Both would stop and pause steaming and I would get messages that my internet was too slow.  Yet I could immediately go to the PC and steam the same content flawlessly.Got the Fire TV and connected directly to the router.  It performs flawlessly and instantly. Wired the HDMI cable to a input on my Sony STR-DH540 5.2 Channel Receiver and configured the Fire TV sound for Dolby with audio return. Fantastic!", "verified": true, "helpfulness": "0/0", "author": "TI99"}, {"rating": 5.0, "review": "I love, love, love this little device. It does everything it advertises and more. I now have to buy one for every tv in the house. Next step is to cancel the rip off that is cable and stream my favorite shows from amazon fire.", "verified": true, "helpfulness": "0/0", "author": "chad hoose"}, {"rating": 5.0, "review": "Great and easy to use.  It's simple enough where my parents can use it and it has enough add ons to keep the kids busy.  Would highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "J. Quinones \"JQ\""}, {"rating": 5.0, "review": "I wish I could get more aps for it like Roku, but the picture is sharp and clear, the storage is great and I am finding a ton of free things on this. Being a prime member helps a lot, but even without prime there is a lot of free stuff. The voice search is great!", "verified": true, "helpfulness": "0/0", "author": "Dejibo"}, {"rating": 5.0, "review": "One of best purchases in a long time.", "verified": true, "helpfulness": "0/0", "author": "Steven Sutcliffe"}, {"rating": 1.0, "review": "At the beginning I was very impressed with fire tv, I told everyone, then I am sorry I did, I find in order to watch a movie on prime that I have to hold my tv control in my hand BECAUSE of the sound control of the fire box it gets really loud then you can't hear it when the actors are speaking then when the action starts it nearly busts my eardrums because it gets so loud, I bought 2 boxes and I am a member of prime I spent over 300 dollars so now I have to find someway to control what is happening. Does anyone have any suggestions. Just can't enjoy watching a movie with prime, if anyone has the same problem, you can contact me on facebook - Alfred Turgeon in Rockledge Fl. thank you", "verified": true, "helpfulness": "5/6", "author": "alfred turgeon"}]