[{"rating": 5.0, "review": "Works great. Decent apps. Can hook up to sound bar VIA optical. Good Wifi connectivity and good video quiality.", "verified": true, "helpfulness": "0/0", "author": "Hugo Bonilla"}, {"rating": 5.0, "review": "Love using it for Netflix Hulu plus and amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "Finally, a product which allows a household to cut cost and monitor viewing and Game play times for children... not into games so that is about all I can say about them.  I like the unit paired with a digital antenna providing local HD broadcasts I have more then enough viewing opportunities to keep me busy for the rest of my life.  Best thing about all of it is... the money I am saving over cable and satellite.  You will require internet connection, I have a 50 Gig connection running 1 TV,  2 game boxes, 4 computers and I do not have any latency issues with any or specifically the Amazon Fire TV.  I am getting other Amazon Fire products for 3 other TVs.  There are some additional cost if you don not have prime membership, get it... over 200 thousand movies and shows.... well worth it and save on the shipping too.  There are subscription sites for a few dollars you get access for a month or whatever not sure I have not bothered with any of the pay per view offers on Amazon Fire.  Really impressed with this product.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "love fire tv!", "verified": true, "helpfulness": "0/0", "author": "Scott D."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "scott"}, {"rating": 5.0, "review": "We have a two story house, and our bedroom is on the other end of the house from our office where our wireless router is.  Despite that, the wireless-N router we have gives a strong signal in the bedroom, with 3 bars out of 4.  Or at least I thought that was a strong signal.Before buying the Fire TV, we previously tried two different Roku products, the Roku streaming stick, and the Roku 3.  Both showed 3/4 bars of signal strength but neither could successfully connect to the network to actually stream anything.I decided to try the Fire TV, and lo and behold it actually worked.  Setup was easy, and it gives access to all of the streaming services we use (HBO Go, Amazon Prime, Netflix, Hulu Plus, and Pandora).  We haven't had any signal dropouts, though very rarely it will have to stop and buffer for a couple seconds.  The on-screen menu is easy to use, and the remote is nice and simple.  Definitely a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jhbwolverine\""}, {"rating": 1.0, "review": "We defiantly missed the small print when we purchased our Amazon Fire TV box. We have a not so old flat screen TV in the master bedroom which we purchased the Fire TV for. I understand that today never expect there to be any cables or connections with anything you buy. However, we also needed to purchase a DMI adaptor, $30. Get back home, start installing the wires and guess what? The TV has separate RCA connections for the sound. No such luck, that isn't and option with the Fire TV. We have a great picture, no sound. It is probably a fantastic piece of equipment but not for this TV. So either buy a new TV ($440.00 on sale) or pass this onto a family member who has the correct TV that it can be attached to.", "verified": true, "helpfulness": "2/5", "author": "John F. Cipot \"MrJRick\""}, {"rating": 5.0, "review": "Great performance, everything working good so far...It's worthy 100% every penny I paid for", "verified": true, "helpfulness": "0/0", "author": "TNTFM"}, {"rating": 5.0, "review": "Love it SOOOOOOOOO much!!  Exactly what I was looking for!!", "verified": true, "helpfulness": "0/0", "author": "The PINK Laydee"}, {"rating": 5.0, "review": "I love the Fire TV!  I had been researching and debating for almost a year on what to get. It was roku vs chromed cast vs fire stick vs fire tv. The ease of use coupled with the prime membership I have had ultimately lead me to pick the fire tv. Also the free time and parental controls stood out. We have 3 kids so it's not always easy to monitor when there are time limits. Set the free time to an hour and that worry has been squashed now.  Well done Amazon, I'll probably be getting another as soon as I upgrade the next TV.", "verified": true, "helpfulness": "0/0", "author": "THE920oCOM \"Jay V\""}]