[{"rating": 5.0, "review": "I love this thing", "verified": true, "helpfulness": "0/0", "author": "Vinny Addesso"}, {"rating": 5.0, "review": "Returned Roku 3 for Fire Tv. Fire Tv is compatible with my older Dolby Digital 5.1 system and the Roku is not. Roku has more selection but Fire Tv has the main ones and is growing its choices. I have purchased 4 Rokus since they 1st came out and now feel that the Fire Tv has a slight lead because it is faster and has more audio choices. Fire Tv  doesn't work with my Harmony universal remote but there is a workaround. I purchased a FLIRC dongle. It plugs into the back of the Fire and receives the IR signals from my Harmony remote.", "verified": true, "helpfulness": "0/0", "author": "J.H. \"J.H.\""}, {"rating": 4.0, "review": "So far, I love this product. We are enjoying the option to watch what we want, when we want to. The gaming options for our family are perfect and affordable. The only drawback was that our voice activated remote was not working. Amazon has said the easiest way to replace it would be to wait the thirty days and then they will replace it without us having to send in the entire bundle. I look forward to getting and using the remote. For now, the game controller works fine to navigate the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Cathy"}, {"rating": 4.0, "review": "Pretty awesome so far... my only negative is that some shows are limited in viewing or charging per episode, even though I'm an Amazon Prime member?", "verified": true, "helpfulness": "0/0", "author": "Kris"}, {"rating": 5.0, "review": "Excellent! So many viewing options and easy to operate.", "verified": true, "helpfulness": "0/0", "author": "Hollo"}, {"rating": 2.0, "review": "Not enough channels.  Search functions lacking.  Upgraded to a ROKU3", "verified": true, "helpfulness": "0/3", "author": "Donald S."}, {"rating": 3.0, "review": "Nice, but has frozen up a few times already", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Side loaded it with XBMC (Kodi) and cut cable all together.", "verified": false, "helpfulness": "0/0", "author": "justin fahrenkrug"}, {"rating": 5.0, "review": "Amazing!!!", "verified": true, "helpfulness": "0/0", "author": "Ramon Acosta"}, {"rating": 5.0, "review": "Easy to install once you download the latest update. Would have liked more instructions (printed) but finally figured it out.", "verified": true, "helpfulness": "0/0", "author": "M. Mitchell"}]