[{"rating": 5.0, "review": "so far so good i enjoy it is a small little box and unlike my previous streaming devices being a smart tv or my blu ray 3d player it has no issues whatsoever with lagging.have not tried out the vovoic search that much and. I live the layout and that it is putting out in 1080P and the sound is ggreat. The only thing I wish it had was a power button that triggered the sleep cycle or better yet to turn it on and off .", "verified": true, "helpfulness": "0/0", "author": "David Pistey"}, {"rating": 5.0, "review": "great devicelove it", "verified": true, "helpfulness": "0/0", "author": "Alonso"}, {"rating": 5.0, "review": "I love it, my 5 year old daughter loves it and it's wonderful being able to watch shows and movies if there's nothing to watch on tv. Thank goodness for Amazon Fire TV. It's awesome having it to keep my daughter entertained and if I want to watch my DVR shows, no problem. I can switch her to the iPad lol.", "verified": true, "helpfulness": "0/0", "author": "Ayndie"}, {"rating": 4.0, "review": "The streaming is excellent and i have only scratched the surface of what it can do", "verified": true, "helpfulness": "0/0", "author": "jeremy brooks"}, {"rating": 3.0, "review": "I found no instruction came with purchase, also as a senior citizen hard to see such tiny button on remote could at least made button brighter color, select button and menu button too small for senors hands. Does not tell you if watch other then amazon product will be charged for season that is free on site such as Netflix. Now if computer geek this simple but older citizen very confusing to use. In order to receive Netflix movie have go to Netflix and install what movie want to watch, otherwise Amazon charges you.", "verified": true, "helpfulness": "0/1", "author": "Loren Alexander"}, {"rating": 5.0, "review": "THE  FIRE TV IS GREAT.  WAS USING MY COMPUTER, BUT THIS IS SO MUCH EASIER.", "verified": true, "helpfulness": "0/0", "author": "Patterson Lee Birkett"}, {"rating": 5.0, "review": "Already own a Roku and a Chromecast. Received the Amazon Fire TV as a Christmas gift with the gamer's bundle and it has quickly surpassed the other two (which are admittedly older tech but are now put to good use on other TV's in the house). The integration with Amazon services has been a great way to maximize on apps and games also used on our Kindles. Just love the way it works. Voice search is such an amazing time saving feature and gaming on it has been great. One of the reasons we got the Chromecast in the first place was to be able to watch YouTube videos on the TV, which the Roku didn't support. Was delighted to find that there is an official YouTube app for the Fire TV that works well.", "verified": true, "helpfulness": "0/0", "author": "motoveto"}, {"rating": 1.0, "review": "While we are fairly confident this is a good product, we were unable to get it to work on our Sharp HDTV.  We actually tried two of these devices.  After the first one arrived, we spent an hour on the phone with Tech Support only to come to the conclusion that it was defective.  A second one was ordered and this one didn't work either (also another hour on the phone with Tech Support).  The final conclusion is that the Fire TV device will not work on numerous brands of HDTV's that are 5 or more years old.  It would help everyone if Amazon would list which TV's are not compatible before the customer goes to the trouble of ordering the Fire TV.  We wasted several hours trying to get the device to work on our HDTV only to finally learn that our TV was one of non-compatible ones.", "verified": true, "helpfulness": "4/6", "author": "Nancy Lowell"}, {"rating": 5.0, "review": "I received a Gift Card for Christmas and thought I would try out the Amazon Fire TV. I did a lot of research before purchasing it, the reviews on amazon were helpful. This was about the easiest piece of equipment I’ve ever set up, also a plus+. I am an Amazon Prime Member and watching movies on my smart-tv was always frustrating. I hated to open the library, it was small on my screen and it was not done in genre categories. So I would hardly watch it. This Fire TV is a 10 in quality and it's heavenly experience to watch movies now. The screen is large, the categories are precise, and the voice command rocks!!! I LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Jac"}, {"rating": 1.0, "review": "Like it very much", "verified": true, "helpfulness": "1/7", "author": "col"}]