[{"rating": 5.0, "review": "I love my Fire TV. We use it almost all the time!I love how it connects to the internet quickly and I don't have buffering issues.", "verified": true, "helpfulness": "0/1", "author": "Courtie"}, {"rating": 3.0, "review": "Very quick but 3rd party apps are not allowed to be on the front page and a pain to get on unless you use a phone app on an android phone. I would rather just buy a Chinese mini-PC with an intel baytrail processor which is much quicker and windows 8.1 based.", "verified": true, "helpfulness": "0/1", "author": "Gary C."}, {"rating": 3.0, "review": "Nice looking, feels well-built. Fast streaming. What's not to like? Well, the fact that it was too hard to search for free amazon prime flicks. So I returned it and got the R***3 box. Amazon refunded, new box works great, I'm happy.", "verified": true, "helpfulness": "0/1", "author": "Jessa Guy"}, {"rating": 4.0, "review": "Love it works perfectly", "verified": true, "helpfulness": "0/2", "author": "Keisha"}, {"rating": 5.0, "review": "We've come along way from using rabbit ears and tin foil. Keep it coming Amazon, who knows what new technology advances are around the corner for us to gobble up $$$$$$ There is no end to the capabilities of our minds to create breathtaking beauty and great wonders. Children today play with Oracles that possess tremendous power. What will their children's children be learning another 50 years from now?", "verified": true, "helpfulness": "1/2", "author": "Timsalways"}, {"rating": 5.0, "review": "I love the Fire TV but unfortunately my husband and I cannot find a movie we both enjoy. We will keep trying but I really like the way the Fire TV works, easy and convenient.", "verified": true, "helpfulness": "0/1", "author": "J. Emerson \"drama lady\""}, {"rating": 4.0, "review": "very nice, just need time to enjoy it more", "verified": true, "helpfulness": "0/1", "author": "oldjamesn"}, {"rating": 5.0, "review": "I recommend to other, good five star ....", "verified": true, "helpfulness": "0/1", "author": "HENRY A. PAULINO H."}, {"rating": 5.0, "review": "This things is fast. Works great!", "verified": true, "helpfulness": "0/1", "author": "shuey79"}, {"rating": 1.0, "review": "It is not working and I cannot get help so I would not recommend this unit", "verified": true, "helpfulness": "1/2", "author": "Alfred L Scheps"}]