[{"rating": 5.0, "review": "Works good, enjoy it", "verified": true, "helpfulness": "0/0", "author": "m j"}, {"rating": 5.0, "review": "Its great", "verified": false, "helpfulness": "0/0", "author": "augusta santana-ponsler"}, {"rating": 4.0, "review": "Everything works fine - easy to use and set-up. Voice control doesn't work all the time.", "verified": true, "helpfulness": "0/0", "author": "Sarah Gillette"}, {"rating": 5.0, "review": "great amazing", "verified": true, "helpfulness": "0/0", "author": "agripino batists"}, {"rating": 4.0, "review": "This is a great device. Controlling it is very accurate and speaks of high quality. It is redundant if you already have a smart tv. My biggest problem is connecting to the main reason i purchased this. To view anime. Amazon prime does have a decent collection but Neon Alley and crunchyroll apps aren't comparable with fire tv...yet. The one or 2 anime apps are horrible.", "verified": true, "helpfulness": "0/0", "author": "G.A. Xandus"}, {"rating": 5.0, "review": "We love Amazon Fire TV! Great new shows we've never seen like Mozart in the Jungle, Transparent, etc. also love the ease with which we can view Netflix content as well. Just wish the remote control buttons were back-lit so you can see them in the dark.", "verified": true, "helpfulness": "0/0", "author": "Tom S. \"Math Rookie\""}, {"rating": 5.0, "review": "I love my new Amazon fire tv. I have been able to see shows that I wanted to see for some time.", "verified": true, "helpfulness": "0/0", "author": "Patricia Gradine"}, {"rating": 5.0, "review": "i bought amazon fire tv 6 months ago and had to get another one for my bedroom. its a better way to stream movies then a blue ray player. or a smart tv. amazon fire tv doesn't load or pause . it plays the movie straight through. i was having problems with band width problems and when i got the amazon fire tv it stopped. called amazon and they said amazon fire tv is just a better internet streaming device. love everything about amazon. love the prime membership and the two day shipping. and the free amazon instant videos.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV is an excellent product . Do not have any waste . From day one I loved . 100 % recommended if you are looking for staff and family entertainment. I recommend it", "verified": true, "helpfulness": "0/0", "author": "Ivan Rafael Aquino C."}, {"rating": 5.0, "review": "This was better than my expectations Please when some one is buying this unit they should know that they need a fast speed internet to make it work... Something like fast internet is required,", "verified": true, "helpfulness": "0/0", "author": "William S."}]