[{"rating": 5.0, "review": "I bought this on Cyber Monday and was so happy with the price!  The amount of things it has is AMAZING!  It was very easy to install and easy to use!  I love the talk function on the remote.  I WOULD DEFINITELY RECOMMEND TO OTHERS ESPECIALLY IF YOU ARE A PRIME MEMBER!  Lots and lots of shows and movies you can watch!  You can also listen to Pandora or watch YouTube!  So many apps, so little time! Great investment!", "verified": true, "helpfulness": "0/0", "author": "MMRivera"}, {"rating": 5.0, "review": "Got this for my daughter for Christmas and she loves it.", "verified": true, "helpfulness": "0/0", "author": "aluck"}, {"rating": 4.0, "review": "Love the fire tv. Almost wait for loading movies and other apps. Haven't gamed much on it yet. Easy to set up and a nice design. Comes set up for your amazon account. You do have to watch a 5 or 10 minute video before you can use the box(no skipping through). Its a little annoying but you only have to do that once. My only problem with it and its not even Amazons fault is that I am unable to watch HBO Go on the fire tv as a Comcast subscriber. From what I have read is that its on Comcast side not Amazon. I can watch HBO Go on my 360 with Comcast but not amazon. I will be contacting Comcast to complain about it. All in all I like the system the HBO thing bothers me but wont deter me from recommending this to others.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Richard Alles"}, {"rating": 5.0, "review": "I have owned and used this product for about 2 weeks now.Amazon Fire TV does exactly what it says it does. i use mine to stream my Amazon Prime Instant videos and watch Sling TV. the device is very responsive and I haven't noticed any delays using it. my kids have downloaded a few games which i thought was pretty neat.setting up the device was easier than than trying to set a VCR clock ;P. The device seemed almost pre-configured for me. I was very delighted to see that my amazon account sync'd very smoothly, it was as if i already had it in my life this entire time.streaming movies has been smooth. i do have broadband internetnavigating the device is very simple like the remote itself, it is nearly impossible to get lost in the menus.I did also sync the device to my logitech harmony remote. so now i have a smart remote and the original remote. I can say that syncing the bluetooth remote was easy.my comparisons for this product are my Google Chromecast. keep in mind that there is a huge gap in price compared to Google ChromecastAmazon Fire TV can function as a standalone versus the Chromecast which requires a phone or tablet.Amazon Fire TV is fasterAmazon Instant Video app does not work on the Google Chromecastbottom-linegreat buy if you live on Amazon. I've yet a chance to explore all of the apps available to the device but so far I am satisfied.", "verified": true, "helpfulness": "0/0", "author": "Roger Lim"}, {"rating": 4.0, "review": "Need to be able to turn off.  Stays on because of WIF", "verified": true, "helpfulness": "0/0", "author": "Maida"}, {"rating": 3.0, "review": "It was very easy to install just as advertised. I think I will like it more as I learn more about it. There was very little info. on how to use it to get the best results  so I am ordering a book for my kindle that I hope will help me understanding all the aspects of streaming.", "verified": true, "helpfulness": "0/0", "author": "Andrea Williamson"}, {"rating": 5.0, "review": "Wow. I have been wanting to ditch my dish for many years now due to the ever increasing rate charges and just have never found the right combo for me until now. Several times I have tried to us an external antenna to pull in local channels but have never had success. I have also tried to use my computer and the internet for tv but just did not work out well either.  I was going to give Roku a try the my dad told me about Sling Tv so I did some research and also came across this Amazon Fire Tv and the offer combined with Sling TV and it just made since to give it a try and man I am glad I did. I first signed up for 3 months of Sling Tv then I was emailed a promotion credit and ordered my Amazon Fire Tv and of course I used Amazon Prime to have it shipped overnight for next to nothing. I also ordered the Amazon Basic 50 mile range antenna. This was a must for me. Ok so the next day everything arrived. I could not believe how small the Amazon Fire Tv box is. It is almost the size of deck of playing cards and the 50 mile antenna is paper thin. I thought ok how is all this really going  to work? Well I am extremely please that it took all of 5 minutes tops too get the Fire Tv out of the box and plunged in and working. I got it all setup to my personal taste in a few minutes and was watching Criminal Mind episodes on Netflix. Very Very cool. I next went into Sling Tv and my girls wanted to watch Disney so they did.  Next came the antenna problem. I have for several years tried all kinds of antenna's from 20' high outdoor amplified antenna's to indoor amplified antenna's and never got them to work well enough that my wife would say ok to ditch the dish. Well I am very please to say that using the Amazon Basic 50 mile range antenna does indeed not only work as described but works better! I installed it upstairs to get the most height. I also went ontodtv.gov/maps to find out what direction to point the antenna for best reception and wow I am now pulling in 31 local channels and some are 60 miles away!!. Needless to say I am pulling in way more channels than in past using much more expensive antenna's. Oh did I mention that it is also made in the good old USA.  Yeah my wife has finally after many years given me the ok to ditch the dish!! I just called my dish provider and it took longer to cancel my dish Tv than it did to install the Amazon Fire Tv and The Amazon Basic Antenna so I am now sitting back relaxing with my family and cut my monthly bill in less than half by using this with Netflix and Sling Tv. Hope this helps. Thanks", "verified": true, "helpfulness": "0/0", "author": "Michael Countryman \"mike the camera man\""}, {"rating": 4.0, "review": "Using it more and more and may end high priced AT&T; Uverse once I hook up an antenna to get the local stations.  Easy to use and very innovative with the voice command ability.  I use it connected to my Samsung TV and it attaches very easily and works fairly seamlessly.  I could use an Off/On switch on the controller so that I could return to normal TV a little easier..", "verified": true, "helpfulness": "0/0", "author": "Robert Corder"}, {"rating": 5.0, "review": "We love it! We had the fire stick and quickly returned it. This product is way faster and more reliable. Great choice!", "verified": true, "helpfulness": "0/0", "author": "MalloryDiane"}, {"rating": 5.0, "review": "awesome. the hardware blows away all competitors including Roku 3. Also gives the ability to side load apps that you like. Very satisified overal.", "verified": true, "helpfulness": "0/0", "author": "Jason"}]