[{"rating": 4.0, "review": "So far so good, my 6 year old loves the games and apps and from what I can tell it has an extensive selection of movies and TV shows.  Only flaw might be that I am uncertain if a second controller can be introduced for the gaming aspect which would make it a 5-star.", "verified": true, "helpfulness": "0/0", "author": "Chris G"}, {"rating": 5.0, "review": "Love!", "verified": true, "helpfulness": "0/0", "author": "Michelle Mondo"}, {"rating": 5.0, "review": "Love this item!  My son gave it to me for Christmas and I could not be happier!", "verified": true, "helpfulness": "0/0", "author": "Kathleen A. Casey"}, {"rating": 5.0, "review": "This device is easy to use and the features are awesome.  I have had Amazon Prime membership for some time, but had not really taken advantage of the video capabilities until recently.  My husband and I got interested in watching the TV series, Sons of Anarchy just before the holiday and were watching on our Ipad.  Then we discovered this nifty device and now we can enjoy our favorite show as well as many other features and cool apps on our big screen TV.  We are very happy with the Amazone Fire TV.  I will say that we've encountered buffering issues now and then, but it's not been major problem.", "verified": true, "helpfulness": "0/0", "author": "bjc1965"}, {"rating": 5.0, "review": "This is one of the best things I have ever bought. Easy set up and even easier to use. Down loads are super fast with a great selection to choose from.", "verified": true, "helpfulness": "0/0", "author": "Robert A. RIgby"}, {"rating": 5.0, "review": "I love it. Pair Amazon Fire with Prime and my cable subscription is becoming obsolete. Voice recognition works great. A wonderful product.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Love it! Works well very easy to set up. Might get rid of my cable now.", "verified": true, "helpfulness": "0/0", "author": "michael singer"}, {"rating": 5.0, "review": "Really happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Nikki Moen"}, {"rating": 5.0, "review": "Brilliant!  LOVE IT!  I have Amazon on a Sony Blu-Ray palyer and Prime TV is so much easier to use.  Use it every day", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 5.0, "review": "Easy hookup and works great.", "verified": true, "helpfulness": "0/0", "author": "Jerry Mattson"}]