[{"rating": 2.0, "review": "believe Amazon has a dud.  Don't think they figured this one out as well as expected.  Does not cover as broad a spectrum as indicated in the adds.  Only redeeming feature is voice control.", "verified": true, "helpfulness": "1/5", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Interface is awkward to use. Hoping they improve it over time with software updates.I have netflix, hulu plus and amazon prime. When I search for Avengers, first option they show is to pay to watch it when it's free via all three. Need better way to get contents to customers.", "verified": true, "helpfulness": "2/4", "author": "Josh Yim"}, {"rating": 4.0, "review": "Setting up my device was seamless.  Literally, all I had to do is plug and play, Fire TV even know who I was without inputting my user name and password.Only wish there were more apps available but expecting they will roll them in at a later date like AMC, Disney, HBO, CBS, NBC, ABC, etc.Even my kids enjoyed the games.", "verified": true, "helpfulness": "0/0", "author": "Sergio & Diana Ramirez"}, {"rating": 3.0, "review": "I like the device but concerned about the \"apps\" that are available. As a HD Homerun owner I found out that I can't install an Android App that runs on my phone and tablet! Rather disappointing.I also dislike the tight level of control they exert over what apps I can put on the device. The search also doesn't go against all possible places, like Netflix and Hulu. This too is disappointing.", "verified": true, "helpfulness": "0/0", "author": "Charles E. Wegrzyn"}, {"rating": 5.0, "review": "Previously I was using Xiaomi Box. But I was blocked by iCNTV. So my friends recommended this to me.It is just a great product. Have so many TV Channels. I really love it and I think my parents love it the same way I do", "verified": false, "helpfulness": "0/0", "author": "Vicky"}, {"rating": 5.0, "review": "It's the first high quality streaming/apps box that runs flawlessly. I'm sure many of you have tried the ones fro China or even the OUYA, but all those are buggy. Amazon not only offers a high quality product that's fast and reliable. They're also a big company. So you know this product is going to be well supported. It's still early for Amazon Fire TV, but I know Amazon will be updating it with new features and hundreds of more apps and games are coming. Even HBO Go. This is a must buy!", "verified": true, "helpfulness": "1/2", "author": "Ryan Ponce"}, {"rating": 5.0, "review": "this is super fast, repsonsive ... easy to set up ... easy to use even my eight year old had it figured out in 1 second.", "verified": true, "helpfulness": "0/0", "author": "Butterfly23 \"Butterfly23\""}, {"rating": 5.0, "review": "We did not have a Roku or a Chromecast, so I'm not comparing this to those products. We had been thinking of getting one of those other devices but had hadn't gotten around to it when the Fire TV came out. Since we were already Prime members that had been watching free Prime video on our computer for several years, it sounded like the perfect way to get that free content onto our TV. It was very easy to set up and takes up almost no room. The voice interface is so quick to use - it is also surprisingly accurate even when my kids are speaking to it. We haven't seen any lag in the video over our wifi, and the resolution is great.We also purchased the game controller and my kids say it works great and has a decent selection of games. They wanted to try a 2 player game, so they plugged our third party xbox controller into the usb slot, and it almost worked, but not quite. They were able to use the remote as a second controller.We recently bought a family member a \"smart TV\" so they could stream movies and am very sorry that we didn't know to wait and set them up with a Fire TV. I think it's quite a bit easier to navigate the interface - especially the voice search vs. the annoyance of typing on a remote control.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I really like this device. It's very quick and extremely easy to set up....I've have no issues. This little box is especially useful for those who are prime members or if you view Amazon materials. The apps for netflix and hulu and youtube are very good also.One nice feature for things like hulu and youtube (haven't tried netflix) is that you can pair the FireTV apps to a tablet or even a laptop (I used android tablet and chromebook), allowing you to be on your computer or tablet, identify content on hulu or youtube, and then click a label on computer/tablet to have it immediately play on your TV through the FireTV (like with chromecast). Of course you can also just use to FireTV apps also...so both work!The voice search works extremely well for Amazon content and it is supposed to extend to some apps I believe (but not to things like youtube or vimeo unfortunately). For things like youtube, you still have to click through individual letters if you want to do a search....a very clumsy method used by others as well.With the voice search limitations at present, you still have to use the click letter method to spell show names or videos in some of the apps. Amazon needs to make a change to this quickly IMO. If google does come out with their own box and it has voice search across apps (They already do speech to text pretty well with their own search engine as well as Google Now), I think it could hurt sale of other TV boxes. Amazon needs to identify a method to allow apps to use either the Amazon search engine or simply to allow apps to use Amazon speech to text in other app search boxes. This would be a boon for Amazon IMO....no more hunt and peck letter by letter to spell a word...just say it! Please, please, please Amazon....consider this in a future upgrade because I think people would drop Roku and Apple boxes faster than a space capsule entering earth's atmosphere.", "verified": true, "helpfulness": "0/0", "author": "Dean R"}, {"rating": 1.0, "review": "Just got the Fire TV.  Works as advertised with one big exception; The remote control is bluetooth so it won't work with most (if not all) universal remotes.  This is HIGHLY ANNOYING.  Like most people, I use a universal remote (Logitech Harmony) to control the umpteen components in my home entertainment center.  Now I have to get up and get the stupid Amazon Fire remote every time I want to watch it.  At the very least Amazon could have included a bluetooth IR adapter for the 99% of their customers who use a universal remote.  Or they could have made an IR remote like everyone else.  I expect this kind of non-compatible, proprietary non-sense from Apple, but I expected more from Amazon.  I should have just bought another Roku3 instead.", "verified": true, "helpfulness": "8/27", "author": "Kathleen"}]