[{"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Joseph Lee Rose Jr."}, {"rating": 5.0, "review": "As a newbie member of the 'unplugged' generation, I purchased this with the sole purpose of watching HBO NOW on my plasma 1080p TV with digital surround sound instead of just on my PC.  Waiting on AMAZON to update the firmware to handle HBO NOW.  Once that happens, I'll be a happy camper.  The voice search works well and beats hunting around with a keyboard or controller button presses.  Note, this box is VERY small, about the size of two decks of playing cards laid side by side.  Which is a GOOD THING.  Why make monster boxes to take up space in our entertainment centers?  Simple hook up, took maybe 2 minutes to plug in and go.  Can handle wireless or hard-wired Internet.  Has HDMI jack and additionally has optical audio output for high-end sound amps.", "verified": true, "helpfulness": "1/1", "author": "McTechie"}, {"rating": 5.0, "review": "Five star service....couldn't have been better....Thanks Again", "verified": true, "helpfulness": "1/1", "author": "Gabino Sanchez"}, {"rating": 4.0, "review": "Seems very solid", "verified": true, "helpfulness": "0/0", "author": "Stephen Rickert"}, {"rating": 5.0, "review": "Very nice, very fast, lovely picture. So many apps & choices. Planning on ordering a game controller next month.", "verified": true, "helpfulness": "1/1", "author": "A. Baca"}, {"rating": 1.0, "review": "Sling TV isn't worth 20.00.  there is nothing at all on it after a certain hour at night.  and then the channels that are on the basic except AMC just isn't worth it.  I wasted my money but that's how we learn by trying.", "verified": true, "helpfulness": "2/4", "author": "moondance \"moondance\""}, {"rating": 2.0, "review": "Purchased it to stream movies using the Plex TV app.  Unfortunately it isn't capable of playing dolby digital with certain file formats such as the popular mkv.", "verified": true, "helpfulness": "0/1", "author": "Andy Orlikoff"}, {"rating": 5.0, "review": "This works just like advertised.  The voice control is wonderful.", "verified": true, "helpfulness": "1/1", "author": "Bowhunter"}, {"rating": 4.0, "review": "We use the Fire TV with satellite internet service and it works great. Beautiful picture and great sound with no annoying hitches to wait for the  signal to update like we experienced with Chromecast. Only downside is that it uses our allotment of bandwidth at an alarming rate (HD - we need to see if we can lower our signal to just standard).", "verified": true, "helpfulness": "0/0", "author": "UncleMark \"cmdun\""}, {"rating": 5.0, "review": "great..love it", "verified": true, "helpfulness": "1/1", "author": "ARLENE LEVKOFF"}]