[{"rating": 5.0, "review": "Voice Recognition is the one feature that makes it a leader among streaming devices. It instantly streams Amazon's videos and I think the picture looks better, too. I would give away my other streaming device if this one had HBO Go.After watching a movie, we were distracted, and five minutes later absolutely gorgeous photographs of nature popped up on the TV screen. This is from their \"Amazon collection\", and these photos start playing after five minutes of inactivity. I had no idea these were included and it was a real treat to sit and watch such stunning photos of Mother Earth.", "verified": true, "helpfulness": "0/0", "author": "Gina Marie"}, {"rating": 5.0, "review": "I've been looking for an alternative for my Roku player for a while. Rodu isn't a terrible product, but the interface is just too clunky for my taste. I've sprung for the Amazon Fire TV and am glad I did. Here are my impressions:Setup: Couldn't be simpler - it's a plug and play device - batteries for the remote are included, but the HDMI cable is not. It wasn't with the Roku either. Buy a cheap cable from Amazon - don't spring for an expensive Monster HDMI cable, it just isn't worth the money. If you're an Amazon Prime subscriber, the box will arrive with all your information already programed (at least for Amazon). If you're not on Amazon Prime, I doubt this box will be a great investment.Voice Search: Voice search works pretty good, I get the right result about 85% of the time on the first try, though Robert Culp keeps coming out as Robert Colt. Don't dummy up like I did the first time with this feature. \"Sherlock\", I said. On the screen it asked, \"Did you mean Sherlock\"? \"Yes,\" I said. I ended up watching an aging Rick Wakefield playing very bad renditions of \"Yes's Greatest Hits\". You have to click with the remote to confirm your choice.Selection: Amazon TV doesn't offer as wide a selection of choices as Roku, but it does offer the three I'm interested in: Netflix, Amazon Prime and Pandora. There are other offerings available, but I haven't spent a lot of time looking at them. As some have mentioned in their reviews, there's no easy way to search exclusively for Amazon Prime offerings--which is a pain in the keister. Also, I can't access my music stored in the Amazon Cloud. Amazon says that will be rectified, but I'll believe it when I see it.Game play: I'm still stuck in the era of Ultima II and Wizardry, so I'm not the best person to comment on game play. I did get a squeal, big hug, and \"You're the best, Dad,\" from my 12 year old when I loaded Minecraft onto the box. She seems to like the gameplay and the controller, but your mileage may vary.Performance: This box seems to handle broadband bottlenecks marginally better than either the Roku or my Tivo, but marginally is the operative word. In the evenings our internet slows to a crawl and I can't blame Amazon for that. If your boxes are stuck in terminal buffer mode, blame your ISP. Either they're throttling your throughput or as in our case, their infrastructure isn't keeping pace with the demand. Maybe someday we'll have access to cheap, reliable, fast internet service. (Pardon my rant).In sum, I like this box a lot, but I'm not sure it's worth the money unless you're an Amazon Prime subscriber. If so, give it a try.", "verified": true, "helpfulness": "0/2", "author": "Michael D. Bigham \"M. Wassir\""}, {"rating": 4.0, "review": "I like Amazon Instant Video, but my Sony BDP-S1100 Blu-ray Disc Player had occasional streaming issues.  Mostly on Friday and Saturday nights, so it might be Amazon and NOT the Sony.  But this device is slick and streams quickly.  Satisfied, but should be nearly free to Amazon Prime members, I don't like spending the 100 bucks.", "verified": true, "helpfulness": "0/1", "author": "DK"}, {"rating": 5.0, "review": "I just got my fire tv and it's amazing! I use it for Netflix and Hulu mainly and Pandora and I can't say enough about how much I love t. Picture quality is amazing and the remotes voice command is eerily accurate! The only thing I can't figure out how to do is get my Kindle Fire HDX to work with my Amazon Fire TV but other than that is great! Super quick and easy to set up!!", "verified": true, "helpfulness": "0/0", "author": "Charliebfan"}, {"rating": 5.0, "review": "Not nearly as many problems with Fire as with Netflix. Easy to use, cute little design but only a so-so selection on the movies.", "verified": true, "helpfulness": "0/0", "author": "vicky"}, {"rating": 5.0, "review": "We switched from the WD TV Live to the Amazon Fire TV, hoping it would not be as slow in processing. We definitely are happy with our decision. The Amazon Fire TV is crazy fast and has all our streaming TV options, including Amazon Prime video and Hulu Plus app. We no longer have to wait to load a show or movie, and everything is easy to search for. Overall we are very pleased with the Amazon Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Josh"}, {"rating": 3.0, "review": "I acquired the Amazon Fire TV through the 30 day promotion that Amazon was doing. It came a day early and I was excited to get to use it. The box is attractive and a good size. Not too big, but not too small. I also like the combination of matte and polished plastic. Having ordered it from amazon, all of my account information was already there. The only work I really had to do was download and login to Netflix, Pandora, and all of my other media apps.  The voice search was fun to play around with, but I didn't find myself using it very much. Keep in mind that I didn't run into a situation where I wanted to search for TV or movies with a particular actor, though. I will follow what others are saying and point out that it would be awesome to see voice search work on services other than Amazon's own.  So in the streaming department, this thing is just as capable as any other. So what is Amazon's selling point? Games. Games were the main reason I decided to try the 30 day trial. I quickly began downloading, but I ran into a brick wall pretty early. I had downloaded two games and the system told me that I had to clear memory to continue. At this point, I had downloaded Minecraft and Sev Zero. In addition, I had installed Netflix and Pandora. Those were the only four applications I had installed and there was no more memory left on the device. I checked the install sizes and they were all in the Mb range.  This is the #1 reason I sent the Fire TV back. Had I been able to keep an actual library of apps and games on it, I might have been tempted to pay the $100 plus the $40 for the controller. But without adequate memory to play launch games without uninstalling other apps, I can't justify spending the money. If all you want is a stream machine with voice search, jump right in. It's wonderful for that. But if you want a stream machine that can hold more than one game at a time, you might want to wait until amazon releases a Fire 2 with more memory or shell out the big buck and get an actual gaming console.", "verified": true, "helpfulness": "2/2", "author": "Braylon G. Gillespie"}, {"rating": 5.0, "review": "The Gary Busy commercials made me laugh, So i checked this out before got the chromecast, wow im so happy i did. Of all the obvious features the thing i think gets underplayed is the fact that the WIFI radio the Fire TV has out performs my PS3/4 Alienware laptop and xbox360-no im not joking. I am using this thing in a room that usually get zero signal from my dual band wireless fios router. I'm talking streaming a 1080P movie without a hitch, when those other devices barely could load my fav websites in that room. excellent buy- \"search Gary Busy\" lmao!! great commercial.", "verified": true, "helpfulness": "0/0", "author": "Michael Reiss"}, {"rating": 2.0, "review": "Still trying to figure out why this does not support Amazon Cloud Music.  It has Vevo and Pandora.  Anyone? Anyone?", "verified": true, "helpfulness": "0/0", "author": "MikeinNYC \"michaeljmiller\""}, {"rating": 5.0, "review": "So easy to set up, and the viewing choices are great! Glad I waited until Amazon Fire TV came on the scene before purchasing a streaming device!", "verified": true, "helpfulness": "0/0", "author": "gaylanss"}]