[{"rating": 5.0, "review": "Wonderful!!!", "verified": true, "helpfulness": "0/0", "author": "Ronald"}, {"rating": 5.0, "review": "This is a great device. I am very happy with my purchase, and everyone in the family loves the ease of use. Amazon Instant Video is smooth, and the picture seems better than many bluray movies I own. I am to buy another one and put out in the bedroom, and cancel cable. I could not be happier with this device.  It really is better than a five star rating.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Buy it. Go ahead and love it with me.", "verified": true, "helpfulness": "0/0", "author": "Vance"}, {"rating": 5.0, "review": "Awesome devices", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pleased with the ease of use and value received in free and low cost recent movie viewing! Neat voice command device!", "verified": true, "helpfulness": "0/0", "author": "Leroy Brilhante \"Coach LeRoy\""}, {"rating": 5.0, "review": "I wanted to give a Father's Day gift that would be easy for my folks to use, and the whole idea of being able to speak the movie or TV show into the remote had appeal. So I bought this for my Pop, and I'm happy to say he is really enjoying the Fire TV. I own an Apple TV 3G and a Roku 2XS, and this unit is much faster than either of them. That said, if you're deep in Apple's ecosystem, this isn't the box for you. But I can't help but like this device. Might have to buy one for myself one of these days!", "verified": true, "helpfulness": "0/0", "author": "Zeke Fitzberry"}, {"rating": 4.0, "review": "The fire tv would not recognize my hdmi cable, bought new cable, still nothing. The box would come on, show the menu but not play any video. I originally had my cable box in the floor below so I needed the hdmi cable to be a longer one. The only cable that seemed to work was a six foot so I ran the wires up from down stairs and placed the fire tv box behind the tv. I do not get why a longer hdmi cable will not work!", "verified": true, "helpfulness": "0/0", "author": "P. Riendeau"}, {"rating": 5.0, "review": "Best HTPC on the market.", "verified": true, "helpfulness": "0/0", "author": "Nick Gould"}, {"rating": 2.0, "review": "Only voice search amazon content", "verified": true, "helpfulness": "0/4", "author": "Dave"}, {"rating": 5.0, "review": "I LOVE THIS THING!!!!!! Well worth the money. Easy to set up and easier to use. If there is a drawback, it's that you have to order the hdmi cord separately.", "verified": true, "helpfulness": "0/0", "author": "Kyle"}]