[{"rating": 5.0, "review": "Love the response time and voice recognition feature! Pic and sound quality is also great.  Top product of this category.", "verified": true, "helpfulness": "3/4", "author": "roblife"}, {"rating": 4.0, "review": "This is a great product.  It is so easy to set up and very easy to use.  As always, Amazon thought about the customer and brought a product to market that is better than anything else out there.  Yes, the voice command really does work.  The only quibble is that there is no Slingbox App.  If it had that it would be a perfect 5 stars.  Once we get that I will update my review.", "verified": true, "helpfulness": "3/5", "author": "Eileen T Bradley"}, {"rating": 4.0, "review": "So far I'm not sold on the Amazon Fire TV. I have a few media streaming devices in my home including an Apple Tv and a Roku 3. Now you have to realize (from a seller standpoint) Amazon wants you to buy their media, Apple wants you to buy from iTunes and Roku doesn't care (they don't sell movies or tv shows).I have 2 main gripes with it:1)The Amazon Fire TV has no apps that allow me to watch my UV library, which is frustrating. I buy the Blu-Ray UV combo pack on Amazon, this is something they should support. I understand you won't let me watch my iTunes library, but i purchased this from you Amazon! ****edit: Thanks for pointing this out, Flixter now does support UV! Actually works really well though the Fire TV. You get one star back amazon fire tv!2) The picture quality is not as good as the Roku or Apple TV. I have a 42\" 1080p Vizio that is a little older than I would like, so i hooked up the Amazon Fire TV, the Roku3 and my Apple TV to the Vizio and watch clips from Netflix on all 3. The picture was inferior on the Fire TV. Netflix is also MUCH slower on here VS Roku, constantly buffering on the Amazon Fire TVThat being said, the remote works very well (the voice searches) and if you aren't going to compare these directly to the competitors, its a pretty good system. If you buy amazon instant videos a lot, this is the system for you. If not, investigate the Roku3", "verified": true, "helpfulness": "10/12", "author": "pperrella"}, {"rating": 2.0, "review": "Please add Vudu and HBO GO. Would make this a for sure purchase for my family. Until then I cannot get this device even though I like some of it's features. Hopefully this can happen before I settle for Roku 3.Also I think it's wrong and misleading to showcase HBO shows on the product page. Trying to trick people into thinking HBO GO may be available, when it is not. Clearly it is unchecked when you scroll down a bit farther, but still seems a shady move by Amazon.", "verified": false, "helpfulness": "4/17", "author": "T-rav"}, {"rating": 1.0, "review": "I called Amazon to see if it supported The Blaze TV.  They said no.  I'm going to have to go with Roku 3 instead.  I wish I could do Fire TV.  It sounds great.", "verified": false, "helpfulness": "6/40", "author": "Kathy Yehle Johnson"}, {"rating": 5.0, "review": "I'm fairly new to Prime, and I love that I get AIV with my Prime account.  Using AIV with the new Fire TV is easy/awesome.  I also really like the tie in with Cloud.  I'm able to easily show pictures I've uploaded to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Mike Nett"}, {"rating": 3.0, "review": "Let me start with an admission, I am a big Amazon fan. I love my paper-white, my kindle-Fire, my Prime account. When they announced FireTV, I ordered mine before the press event ended.I already have nearly all the streaming content I could possibly desire available on other devices (PS3, xbox360, smart TV, Blu-ray player w/ streaming content, xbox360, laptop, tablets, smart phone), so why would I want the FireTV? Well, you can plug it into an outlet, and there is a tiny flashing white LED light on the front left corner so...yeah, I had to have it.First, the good:PresentationPackage arrived in a sleek little box that looked awesome. Cut one label, lifted the flap, and BAM! A sharp-edged black plastic square with \"Amazon\" emblazoned in gloss right on top. Beside it, nested in its fitted cardboard slot, a compact flat black remote with glossy buttons. Beautiful!Small, heavy, mysterious, minimalist design, the thing is practically porno for gadget geeks. It's seriously tiny, you could tuck the FireTV away anywhere and it would disappear, but why would you? This thing is dead sexy in a way the Happy-Meal-toy Roku or USB-drive-looking Chrome Cast never could be.Set UpAdvertised as \"just plug it in and go,\" FireTV required an update right out of the box--forgivable--otherwise, came pre-set to my Prime account. Once the update completed, connected easily to my wireless network, HDMI to my TV and plug to the wall outlet and it was up and running.I didn't use the optical audio output or the Ethernet port, but I did frown at 10/100 Ethernet. For a heavy streaming device like this, I would have expected gigabit Ethernet. I suppose the majority of users will use the duel-band wiFi, but come on, you went premium on the hardware; don't kill it with a crappy Ethernet connection.The RemoteIn two words: perfect...almost. The remote is probably the best part of the entire package. Wish all remotes were this simple and functional. Love that it is Bluetooth so no line of sight to the device is required. If I could add one--just one--thing to the remote, it would be volume control buttons to program for a TV or AV receiver. Not looking for a full function universal remote, just volume control so I don't have to keep my TV remote on hand.Fits comfortable in the hand, easy to thumb navigate, buttons are responsive, and a nice feel to the direction pad. Add volume buttons and this baby could go into the remote hall of fame. Unfortunately, that would mean adding infrared controls since most devices don't use Bluetooth. This is a bit of a downer.Voice ControlPretty dang good. It understood everything I threw at it--including French titles--and it was reasonably fast as well. I'm not a big fan of voice control in general. I press--don't say--1 for English, and I hate talking to my xbox1. Give me buttons or give me death! But, if talking to your electronics is your thing, you'll dig it.Game ControllerOut of the box, I wasn't sure what to think about the game controller, and I'm still not 100% sure what to say about it. It was a little weird, like making out with your roommate's girlfriend:  Awkward at first, but by the time you get to second base, you're having too much fun to stop.It's similar to the xbox 360 controller, but not quite as comfortable in your hands, but to be fair, that's a pretty high benchmark to compete with. Functionally, it works well, its responsive, and the button layout is familiar. I give it a solid B+ (just don't tell my xbox!)Now for the BadNavigationUp front, I understand this is the first stab at the interface, and navigation will unquestionably get better with future software updates and user feedback, but, here is my first impression:I was super excited to use this as my primary streaming device in my living room, and after four days of use, I have moved it to the master bedroom--for now.If you know what you want to watch, voice search it, and you are done. But if you are like me (God help you), you are a movie window-shopper. Back in the old days, when the earth was still flat and Sarah Palin's grandfather was riding a dinosaur, I would go to the video store and casually look for a movie to rent.I still take that approach to browsing prime for something to watch, and this is my big complaint with Prime in general. Amazon makes browsing the prime catalog incredibly painful on nearly every device. This maybe by design--they admittedly want to steer you toward premium content--but if you want to browse through free content on Prime, Amazon doesn't make it easy.My big expectation for FireTV was that this would finally be the device that would make it easy for me to browse Prime Instant Videos. Big disappointment. I was hoping for: Prime streaming Comedy, Drama, Action, TV, Movies, Originals. Instead I got: Prime recommendations, Prime most popular, Prime new additions, Prime TV popular. The predefined categories are very narrow and shallow with limited selection. The PlayStation 3 remains the best interface across all devices for browsing the prime catalog. I was really bummed that the FireTV was not at least as good as the PS3. My hope is that this will improve on FireTV with time.Gaming: Not a console, but not bad either.I am admittedly not the target market for FireTV gaming. I like dedicated console games, and the FireTV games are not hard-core games. Sev Zero is billed as such, but falls very flat.That said, as tablet and smart phone style games go, the FireTV delivers. Games are responsive, the graphics are clean and sharp even on a 50 inch screen, and there are plenty of games to choose from at launch. The dedicated game controller works well. It fits reasonably in the hands and the buttons are all very responsive.Other apps and servicesThe search doesn't feel like it penetrates well into the other services like NetFlix, and they still need to add a number of other content providers. I have no doubts this will improve with time. I think Roku still has the upper hand here--at least for now.Overall: Lots of potentialLike the Kindle fire's stripped down and limited android interface, FireTV feels like a really powerful device held back by Amazon's tight ecosystem. They offer you \"some\" out of network functionality, but everything is pushing you heavily toward their own content.The hardware is beautiful, fast, and functional, but the functionality has some improving to do.  If you already have a smart TV, or other living room device that gives you streaming access (Roku, AppleTV, Chrome Cast) there is little incentive to purchase FireTV. But if Prime is your main entertainment service, this maybe the device for you.", "verified": true, "helpfulness": "36/43", "author": "pixiechic"}, {"rating": 5.0, "review": "I have already given myself up to Amazon for my music, movie and tv based content prior to the Fire TV's release.  I was, in fact, waiting on the next generation of Roku devices when this hit me by surprise.  Of the other major channels I watch I tend to watch Netflix and Hulu Plus the most.  Which are both present and work great.  The Youtube app, which is a quick download, appears to be the newest gen build and I like using it to browse more than my computer at this point.  I also do use HBO Go but that is only for watching ONE show.To me, as an avid early adopter, I find the tools that Amazon released with this little box to be a sign of great things to come.  If Amazon has proven anything, about the hardware they create, it is that they improve the quality of life as well as the functionality as time passes.  If you look at a Kindle reader 1st generation and a paper white you will see vast improvement.  The same with the Fire tablet and the HDX.  It is also fair to note that if you were to go back to the first gen of Roku devices the channel lineup was pretty barren.  I know because I had a 1st gen Roku (I still have it actually).  Individuals stated the same thing when the first gen Fire tablet came out.  And now with the HDX offerings it is rapidly gaining market share and is quite the great little tablet.  So in essence give it time and lets see what happens.And finally I feel that I would like to give my opinion on one of the major selling points of the device and what I feel the design choices mean to us as consumers.  This point being Voice Search.  If you want to test out what I say here feel free to do so with your own Fire TV.  What I state  here is conjecture based off of usage.I think that voice search only searching Amazon content is a limitation based upon \"design\" rather than blatant money grabbing.  I say design loosely because I know the first response will be something like \"designed to be a money grab\" or the like.  Please hear me out.If you take your remote and do a search for a broad based genre you will most likely see a large number of returns on your search.  This will fill up the ribbon on the screen pretty fast but if you are quick you can see that the results \"stream\" in.  This strengthens the fact that it is \"cloud based\" voice search as stated by the media and during the release speech.  Take a minute to fully think about what this entails.  I read somewhere that the device just packages up your voice and sends it off to the cloud for processing.  Which means that in order to make the voice search as fast as it is they had to move it off device.This is the major point of why the search does not include all of the other ecosystems.  These other ecosystems would have to basically submit and update their listings with Amazon's cloud based search.  Something that I doubt the other vendors were willing to do at this point.  In the end with the way they implemented the voice search it is not viable, right now, to include all of the other ecosystems and maintain the quality of the searching.There are several simple additions in the future that Amazon can implement via updates that would help solve this.  Such as voice recognition, perhaps, for input into search fields or expanding keyboard support for wireless keyboards or the like.Thank you for your time.", "verified": true, "helpfulness": "6/6", "author": "J. Orr \"bulfrog\""}, {"rating": 4.0, "review": "I'm not going to rehash all the stuff others have already said about how this compares to Roku.  So far, I really like it.  I liked my Roku too but it's an older one and, since we are mainly Amazon people when it comes to movie purchases/rentals and such, this seemed like a pretty logical choice for an upgrade.It's working great for Netflix and Prime but here is what I am really loving about it - the way it allows me to show personal photos and videos.  I put the Amazon Cloud app on my phone (Galaxy Note 3) and set it to automatically upload pictures to the Amazon Cloud.  So, now, if I want to share those pictures with others, I can pull them right up on my Fire TV.  That's pretty awesome.  It uploads the videos too.  In the past, when I have tried to stream videos from computer to something like my PS3, the results were lousy.  I don't know if it's my network or what but videos always stutter and freeze.  So far, any that I've uploaded to the Amazon Cloud Drive (or ones that were automatically uploaded from my phone) have worked flawlessly.The down side, of course, is that you only get 5 GBs free with the Amazon Cloud Drive which, I'm sure, could be eaten up pretty fast with lots of video.  But, for now, I'm just happy to have the option and that it is so easy.I agree with other reviews that this unit still has some growing to do.  More apps and USB functionality (why is it there when you can't use it?) would be nice.  But, for most of what I want to use it for, it's been very good.", "verified": true, "helpfulness": "1/1", "author": "J. Blackman"}, {"rating": 4.0, "review": "I've owned almost every media box (Apple TV, Rokus old and new, WD TV, Boxee Box) and have settled on the Roku 3, so I had to try this to compare to Roku.Biggest Con:No infrared receiver to work with universal remotes. Amazon wants customers to use the voice search, which requires the bluetooth remote. I use a Logitech Harmony One with everything and since the Fire remote does not have universal options or volume, users are forced into multiple remotes. Roku also does not use IR with their remote, but they do include an IR receiver so that standard universals can work with it. I've looked into other Logitech Universal remotes like the Ultimate for bluetooth options, because RF, BT, and wifi-direct are fantastic ways to run controllers - however, the bluetooth-capable Logitech remotes are very specific to ONLY the Wii, Wii U, and PS3 units (from what I've researched).Work-around 1:Cheap MCE remote with IR receiver that plugs into the Fire TV USB port. I'm waiting to try this myself, but see online that it has worked for others.How To: Google -> amazon fire tv tips googletvforumRemote Link: http://www.amazon.com/Ortek-Windows-Infrared-Receiver-Ultimate/dp/B00224ZDFYEDIT: Tried this for fun, can't get all functionality, like back button never works. Just not a very good option to do this. Bottom line, use the remote it ships with.Work-around 2:Flirc IR receiver - I can't speak to the efficacy of this option, but see people online claiming to have it working as well.Discussion: Google -> fire tv flirc xbmcFlirc Product: Google -> flircBiggest Pro:Snappy, quick machine that is visually more updated and new-feeling vs. competitors. I've counted out Apple TV for the lack of apps and abilities long ago, but Apple TV is the closest to how nice this feels. This carries into apps like Plex that are much nicer, visually, than in Roku.Overall:Many things done exactly as expected and it functions nicely. I will not be replacing all of my 4 Rokus with Fire TVs, but will keep this one, likely in a room that I don't use a universal remote in. The lack of IR (even if the IR adapter work-around functions well) keeps it from being 5 stars and will probably keep this box out of the main (universal remote/surround sound) room.", "verified": true, "helpfulness": "11/12", "author": "Chris A"}]