[{"rating": 1.0, "review": "only worked a year! Its broken now", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Works as advertised, just plug and play. A perfect accessory for my HT system", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 2.0, "review": "Update-12/23/14- I've stopped using this device b/c the sound logic is VERY frustrating.  The speed and playback when working is fantastic.  The problem with the sound got to be too much, as it was happening once a day and I'd have to unplug the device and plug it back in, then it would work again for a day or so. I run my sound through an external receiver, so maybe they didn't get around to coding that part completely:)  I've gone back to a roku and it works perfectly every time, but it is still much slower than the amazon player.Love the speed especially compared to a roku.  The ONLY downside that i've seen is that the sound started having a tinny type effect to it, but I powered it off then back on and it hasn't returned yet. So hopefully just a one off.", "verified": true, "helpfulness": "1/1", "author": "xerostatic"}, {"rating": 5.0, "review": "Weaning my family off cable tv is going to take time, however, I love, love being able to log onto Youtube.  I am still learning all the programs and apps.  So far, so good.  I think I am going to watch all the popular shows - Orange is the New Black, House of Cards and The Wire.  Amazon TV requires intentional viewing.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My husband and I were tired of paying for cable TV, which seems to be ever escalating in price. So we cut the cable and started using our game consoles to watch TV on hulu, netflix, and amazon prime. Navigating through some game consoles are real pain. So we wanted something solely for TV shows/movies. We were considering Roku boxes, but were excited to see Amazon come out with the Fire TV. We've been Amazon prime members for years now, and purchase many digital movies through Amazon, so the Fire TV seemed like the best choice for us.I've had it for a couple of months now, and I have no complaints. The Amazon Fire TV was super easy to set up. The menu is very easy to navigate. We recently bought a second one for my daughters' room. It was easy to set up parental controls on the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Aatraa"}, {"rating": 5.0, "review": "Best streaming product available!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The device is remarkable!  Unfortunately, the content of what there is to watch does not yet match cable, and the the cost to watch most shows is too high, i.e., there is not enough good free content yet.", "verified": true, "helpfulness": "1/1", "author": "Joe H."}, {"rating": 3.0, "review": "no DNLA, fail, menu are confusing, locked to amazon, unless you do 10 more steps on every selection..voice search, useless..games.. :( need a lot of work, has promise.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchases this as an alternative to cable. I really needed to save money and cut down on monthly costs and switching to the Amazaon Fire TV really helped. I use Prime Video, Netflix and Hulu on the regular basis now. There are just a few things I would be like to see change. One is I have a Showtime account, but for some reason I can't seem to get it to work on the Fire TV and they should really have access to HBO GO as well.But one great thing about the Fire TV is if you have any problems Amazon Customer Service is the best I have ever dealt with. I had trouble with videos streaming and had to call customer services and they answered withing a couple moments and everything was working in just a few minutes.I am glad that I made the switch to Amazon Fire TV, however, I would only recommend this if you are an Amazon Prime Member.", "verified": true, "helpfulness": "1/1", "author": "Amaysha89"}, {"rating": 4.0, "review": "Cons:Needs more internal storage. After installing one of Amazon's own games there wasn't enough storage to install GTA. Thought I missed an option somewhere but the fact is the storage space is way too small. Needs USB external storage support, at minimum.Voice search needs to work across more applications than it does.Where is the amazon music support? If there was an update I haven't seen it yet.Pros:Other than the above the movie streaming experience is very, very good, especially with amazon movies, which start nearly instantaneously. Video and audio quality are as good as your internet connection allows.", "verified": true, "helpfulness": "3/3", "author": "primemember"}]