[{"rating": 5.0, "review": "We are very happy with Fire TV.  It's a different way of watching TV, but we absolutely love it, especially the $120 a month we are saving by ditching satellite.  Subscribe to Netflix and Hulu Plus, while we can't watch shows as soon as they are aired it doesn't matter, we are always so far behind in our viewing.  Been catching up on shows that we missed in the past.  Would highly recommend if you are ready to \"cut the cord\".", "verified": true, "helpfulness": "1/1", "author": "Laura S"}, {"rating": 4.0, "review": "This product is a very good alternative to cable tv. I have been using it for a year and I have not had any issues with lag. It needs to be rebooted every now and then but that has been a rare occurrence. My only complaint is with the Netflix interface. It uses an algorithm for suggestion which is not very great and there are very few categories that you can browse through. For the most part you have to know what you are looking for. It would be nice to switch to something that looks more like the apple tv interface where you can browse all the categories, it makes it easier to find things to watch.", "verified": true, "helpfulness": "0/0", "author": "Tim Gautreau"}, {"rating": 4.0, "review": "easy to install, about 5 minutes. unhappy that 3 weeks after ordering the price reduced by $15. Saw it advertised at discount chain for $84, also. Imagine.", "verified": true, "helpfulness": "0/0", "author": "c peterson"}, {"rating": 5.0, "review": "Works just great...thanks...", "verified": true, "helpfulness": "0/1", "author": "Jimbo"}, {"rating": 2.0, "review": "Most of the time when I attempt to use the Amazon Fire TV there is no sound.  I must unplug the power cord, plug it back in and wait for the unit to go threw the process of rebooting  and then having to locate the desired move and restart it.  This can become quit annoying.  I have called Amazon and been told that this is not common but I have not been offered a replacement.", "verified": true, "helpfulness": "0/1", "author": "Darl C. Clites"}, {"rating": 4.0, "review": "it's ok needs more polish around the edges, it would be nice to have more memory, or a firmware revision to allow usb memory the fact is you offer gaming controllers, if you are going to call it a game machine, fix the memory issue get google play and a decent browser", "verified": true, "helpfulness": "0/1", "author": "deathbreaker705"}, {"rating": 3.0, "review": "This device is terrific, and should be 5 stars - but I'm withholding two until Amazon fixes a couple of issues.First, the good: The device is FAST.  Virtually no lag.  The hardware is beautiful - heavy, sturdy, nice connectors.  There are lots of apps available, and being Android based, many of your favorite games and apps for your phone are available on your TV.The bad:Amazon's intention for this box seems to be to get you to BUY programming.  They have little interest in helping you find the free options to watch the movie/show you want, even if you have Netflix, Hulu+, etc.  There is NO method of saying, \"Please show me a list of free programs\" (even if only on Amazon Prime, but the holy grail is to show me across all of my apps\".  You will constantly see things, click through, and then realize they are pay-per-view.  Very frustrating.  Give me the \"PRIME ONLY\" checkbox, and you get back a star :)I want a uniform interface for video on all applications.  Amazon - it is your job to make sure the individual apps from the major players all have a uniform look and feel from YOUR remote.  When I click \"rewind\", I expect the same 10 second jump-back, regardless of whether I'm in Prime, Netflix, Hule, Crackle, etc.  I don't remember (or care) which application I'm watching in... so I click rewind to jump back 10 seconds, and suddenly it's just zipping back in time.  Fix it, get back a star :)Other Annoyances:I want a quick and easy way to say, \"Sleep\".  Sure it goes to sleep after 30 minutes, and there is a sleep-now option buried 20 clicks away in the settings menu, but I should be able to hold the home key for 5 seconds (or some other simple method) and put it to sleep just because.The voice search is unbelievably accurate.  I want to use it to search everything the box can access, and that means content inside each app.  Unfortunately, Amazon only shows me amazon programs.  For the big players (Netflix, Hulu, etc), this should be integrated together.  Right now, I have to go to www.canistream.it, find where I can view my chosen show, then navigate there and watch it.  Amazon - you can build canistream.it functionality right into the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Muy bueno", "verified": true, "helpfulness": "0/1", "author": "Hector Olivo"}, {"rating": 4.0, "review": "I am very happy with this product as far as functionality.  On the downside, I thought there would be a lot more available free to prime members.  My disappointment and the reason for the 4 star rating is the lack of content available for free to prime members.  For instance, my husband and I wanted to watch the Breaking Bad series, and I had to do a 30 day Netflix trial to get that.The device functions without a glitch though, so I would recommend it as far as the hardware component.  Also, no problems with Netflix, youtube and other apps.", "verified": true, "helpfulness": "0/0", "author": "KTucker \"karent7\""}, {"rating": 5.0, "review": "I had a little issue with the install since my Surround system only has 2 HDMI input ports.  I had to add an HDMI switch to accommodate the gaming system, TV, and the Fire TV.  Once I figured it out, it is awesome.  Thousands of free movies and TV shows, much better selection than Netflix stream, and New movies than OnDemand and the pay Channels.  Highly recommended if you are a netflix user or you have a Prime membership.", "verified": true, "helpfulness": "0/1", "author": "CJMeier"}]