[{"rating": 5.0, "review": "Does what it is suppose to do . Especially  enjoying amazon prime. Was not difficult to connect to my  surround sound. Love  the movies .movies .movies !  Thank You AMAZON FIRE TV", "verified": true, "helpfulness": "0/0", "author": "Clarence Ronald Jackson"}, {"rating": 5.0, "review": "XBMC/ KODI sideloads and runs exceptionally well.  As long as it has that ability I will be happy. However the Amazon App store built in stinks and you cant get many other apps to run through 3rd party. The XBMC/KODI can do it all so who cares about what is built in.", "verified": true, "helpfulness": "1/1", "author": "beefaraoni"}, {"rating": 1.0, "review": "I am surprised why I am not hearing this complaint more. Or may be it happens only in the piece I bought on Cyber Monday for $69?After I bought it, the remote drained three sets of batteries in three weeks. And it was only used a few times a week. I spoke to customer service and they said it was a known issue. They offered to give a $10 discount if I bought rechargeable batteries and a charger from them, which I had to do because I wasn't going to buy a new set of batteries every week. Now the rechargeable batteries run out every 3 days. Every time I want to use it I have to replace the batteries first. This has been a total absolute disaster. I very much wanted to like it but I don't.", "verified": true, "helpfulness": "6/9", "author": "journeyman"}, {"rating": 5.0, "review": "Bought 3 of these as holiday gifts and everyone LOVES it. Thanks Amazon! :)", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "Exceptionally good. Not being able to turn it off unless you unplug the power cord is Orwellian. Not being able to add any bluetooth keyboard is Apple-esque. Of course this is and will continue being a very successful product. The 2 characteristics mentioned earlier are enough to ensure it is.", "verified": true, "helpfulness": "0/0", "author": "stratus"}, {"rating": 5.0, "review": "I love my Fire TV!  Super easy to install and it loads the shows/movies instantly.  I love it and use it daily.", "verified": true, "helpfulness": "0/0", "author": "Lisa M. Grable \"On-line power shopper\""}, {"rating": 4.0, "review": "I looked at the Roku 3 and the Amazon Fire TV for my second TV.  I already have a Roku 3 in the living room and we like it a lot. However, after reading some reviews about the Amazon Fire TV, decided to give it a try, plus they offered $20 off.  When it arrived, we hooked it up, signed in, and started looking around.  Have to say it a pretty nice device but the lack of support for external media is making me pack it up and send it back.  The fact that you cannot read a flash drive or external hard drive through the USB port is not cool.  So, I'll be ordering another Roku 3.If we didn't need that feature, I would most definitely keep it!", "verified": true, "helpfulness": "1/2", "author": "Sim.1"}, {"rating": 5.0, "review": "Great Product! Use it every day my only complaint is amazon doesnt have to many showes, music, and music you can watch and listen too", "verified": true, "helpfulness": "0/0", "author": "the voice"}, {"rating": 5.0, "review": "Easy, quick and painless to install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I really like the interface and the controls, BUT there should be more Television included on Prime. When I bought it I was looking forward to watching shows like \"The Facts of Life\", \"The Partridge Family\", or \"Sliders\". Spending $200.00 ($100.00 for an Amazon Prime Membership, and than $100.00 for the Fire TV itself) to only see that some of your favorite shows are not on Prime...this is highly disappointing. Your negotiators that work with the studios to place shows on to Prime need to work tougher or your going to start to loose customers to other streaming devices.Another large issue you need to address is the way ones TV shows, Movies, and Documentaries are displayed in the \"Watch List\". Simply having selections ordered as most recent first is inferior. One should be able to organize Alphabetically, or to make folders according to genre, and then to alphabetize within said folders.Add more TV shows to Prime and give the user total control over how items are arranged and these actions will help to raise Amazon Fire TV about the competition.", "verified": true, "helpfulness": "0/1", "author": "MMarlys"}]