[{"rating": 2.0, "review": "It does exactly what it is advertised to do. It installed in an instant...buy...What they don't tell you in the ads is that you have to PAY for everything you want to watch!  'Bout $6 an hour. All that programing my cable company gives me for free...I have to PAY for if I chose to use the fire.  Not at all worth the price", "verified": true, "helpfulness": "3/14", "author": "Ronnie Leckow"}, {"rating": 5.0, "review": "This device was easy to setup and even easier to use.  Streaming is excellent.  However;  changes in the Internet prefence laws may allow Amazon and others like Comcast to control the next level of video entertainment.  It is possible that the savings from this compared to Dish and Cable may disappear as the lass change.  An increase in Amazon Prime as well as Netflix and other online sites may make this device no longer a major replacement for Dish and cable.  Enjoy it now while the price is good.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The box is tiny and powerful. The feature that I use and enjoy is the Voice command. That I am still learning to perfect. Me being able to exploit the Fire TV to its maximum potential is a challenge that I welcome.", "verified": true, "helpfulness": "0/0", "author": "douglas liles"}, {"rating": 2.0, "review": "For some reason this could not load my wired internet.  I have 2 (non technical) courses shy of an AS in Computer Information Systems. User error and lack of networking knowledge is not the issue.  I had manually configure the dns settings, which can be a big deal for people that were expecting plug and play.  Especially when you want to something to work when you want it to without waiting for someone with computer networking knowledge to hook it up for you.  My family had to wait for me to set it up for them, which was disappointing for the 9 year old who wanted to check out the new games.  When the system was finally hooked up, the movies would attempt to start and then just load partially without playing.The lack of apps is also a disappointment.  While they may have more apps later, the current selection is really lacking.  I have been an Amazon Prime member for years, and do most of my shopping through Amazon.  I had really hoped this would of lived up to all the advertisements said it would.  However, it falls very short.  I am returning mine.  I may consider re-purchasing once the hiccups are fixed, but currently this has been a huge waste of time and money.", "verified": true, "helpfulness": "4/7", "author": "sbreview \"justme\""}, {"rating": 2.0, "review": "Fire TV is a good first try for Amazon. I encountered a few minor performance issues but the main reason I'm giving it away to a friend center around content access.THE GOODVoice search works REALLY well.Good remote.Extremely quick interface.Extremely fast Amazon content delivery.THE BADPerformance issues:On some panel and AVR combinations (panasonic/emotiva) there are issues with color fidelity and black levels. Even when connected directly to a panel, there are some gamma anomalies noticeable in skin tones but these issues are not necessarily reasons against purchasing the device.Content access and third party apps:I understand how Amazon content is and should be the priority but it's over the top. Apple TV also uses this model yet the interface lessens the impact, and frustration, when accessing non Apple content. Specifically on the Fire TV, all third party apps are basically buried (accessible in a single row) and the remaining user experience is completely dedicated to Amazon content. Furthermore, Prime content is not accessible from a single, clear interface element which is very different than the Amazon apps on Roku and other devices. All of this is perfectly legitimate but at the cost of user satisfaction.Since Netflix has s such a broad user base, one would think Fire TV's Netflix app would be mature but it's on the same level as the sub par panel or blu-ray player based apps. It's sort of frozen in time. Content is still findable but this is really disappointing. Compared to the Netflix apps on the Apple TV and Roku 3, Fire TV is abominable.I'm going back to Roku as it's agnostic approach to content is very user centric.", "verified": true, "helpfulness": "10/10", "author": "Loop7"}, {"rating": 5.0, "review": "I love this thing! I've watched Prime movies and shows before using the Amazon app on both my PS3 and Sony Blu-ray player. However, on those devices the software is a little more difficult to navigate and a whole lot slower to process. And I really loathe the rewind and fast-forwarding while watching Amazon Prime shows on those devices. But there are no issues at all with the Fire TV. It's incredibly fast, easy to fast-forward and rewind, and super easy to search for shows. If you use the voice command it will bring up the matches in no time flat. And to boot, there are tons of games and my X-box 360 controllers work with the Amazon Fire TV so I don't need to purchase extra controllers. I am VERY SATISFIED. Three steps: Connect to your HD cable; Plug into electricity; Log in to your Wi-Fi and your done. I may get one for every TV in the house.", "verified": true, "helpfulness": "3/3", "author": "M. Timmons"}, {"rating": 5.0, "review": "The Fire TV plays Amazon content remarkably quickly and the picture is exceptional.  It absolutely blows away my old Roku XD (notorious for being crazy slow streaming content, especially Netflix, and more often than not wouldn't even stream in HD).  Another reviewer said you will save hours of time by year's end and he is absolutely correct.  It was worth buying just so I don't have to watch the loading bar from Roku anymore.  The Fire doesn't load Netflix as fast as Amazon content, but still much improved over the Roku XD (I have never used the newer Roku 3 so I have no idea how it compares to that).  Amazon and Netlfix have lots of content overlap, but this makes using Amazon an easy choice (you can use the voice feature, it streams immediately, and the picture seems better), assuming you have Amazon Prime.App content is still light but it is quite early in the product life so no need to worry there.  Plex works well enough for local network library files to stream (although Windows Media Center on the Xbox 360 is far superior for recorded TV).  I haven't tried any games yet, but that wasn't why I bought the unit.  First and foremost I simply wanted a streaming unit that was fast and the picture was good.  The Fire TV excels at doing just that.  Recommended.Update 5/4/2014:I was curious what kind of wattage the Fire TV uses, so I hooked it up to a Kill-A-Watt meter.  It looks like it ranges from about 2.2 to 5.8 watts (the Roku XD was ~6 if I recall correctly).  It looks like the Fire TV never actually shuts off, but the wattage is so low it will not be much of a wall wart.  Pretty amazing considering an Xbox 360 S I have rates at a minimum ~70 watts and goes much higher under load, yet this Fire TV performs superior for nearly every app (but not gaming I am guessing).  Of course, that is technology, getting better, and typically cheaper, all the time.  I am seriously considering another Fire TV to use in place of the Xbox 360 for streaming content because it is so much easier to use and again would save so much time loading apps since Amazon and Netflix both take several seconds to load on the 360.  One caveat which I hope gets addressed: the voice control needs to be ported to other apps, Netflix in particular, since it goes back to virtual keyboard searching (which is tedious and annoying).", "verified": true, "helpfulness": "2/2", "author": "Evan Eberhardt"}, {"rating": 4.0, "review": "Set up was simple and the unit worked very well.  Video and audio were excellent.  The only reason I didn't give the Fire TV 5-stars is because the remote is not backlit.  I like to watch movies with the room lights off, and without backlit keys the remote was a little hard to use.", "verified": true, "helpfulness": "0/0", "author": "Undrey"}, {"rating": 5.0, "review": "About 2 and half years ago when i got the amazon fire hd the second generation and I remembered it has the micro usb to watch closed captioning amazon prime movies and tv shows. I remember that my wife and I liked how we watch it on kindle fire hd with micro usb to link the hdmi to HDTV. But I knew that the wire wouldn't work so I decided to talk to amazon that amazon should do set top box for streaming games and movies and tv shows like prime. And I knew that amazon was working on it for the future. And they did it and they made it for games like sev zero in homemade in house games and others. And pretty soon amazon will have more games available in house games and plus other developers games are coming soon thousands of them within months.I have a 3ds xl and Wii U systems and I am replacing from that to Amazon Fire Tv with Gaming and Console capabilities. I have amazon fire tv now and also i ordered another amazon fire tv because my wife and I tends to fight over the amazon prime and gaming situations. I thought it was funny. When I saw the Amazon Fire Tv turn on and start playing on games especially remote control really amazed me the most. The additional controller for hardcore gamers really impressed me the way the system with speed and pick up and graphics really put my jaws dropped!!!! I open the Netflix app and it loads faster than the playstation 3! I think there is a border line from xbox one and ps4 to amazon fire tv cpu and gpu right between xbox 360 and amazon fire tv to xbox one and same way as ps3 to amazon fire tv to ps4 speed and graphics wise.P.S. Don't worry Amazon my wife heat up the popcorn to watch the orphan black since it is not included in the amazon fire tv box. HA!!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Currently own Chromecast and XBoxLive. Have used Apple TV a good deal in the past. Compared to those services, Fire TV's interface is superior. Voice search function is amazingly accurate and fast. Overall very easy to navigate, and the dedicated \"home\" button is a simple/obvious addition that Apple TV, XBox, and Chromecast all lack. Far more responsive and impressive speed -- blows away Apple TV and Chromecast in that regard, and is equally fast if not faster than XBox.Overall I would give five stars, but Fire currently lacks a true HBOGo app. Yes, HBO content is coming for Prime members, but until I can get Game of Thrones streaming the night of the broadcast, I'll keep at four stars. If you don't care about that, then this device is pretty much perfect.", "verified": true, "helpfulness": "1/1", "author": "Devon Petley \"Devon\""}]