[{"rating": 5.0, "review": "So far so good. Movie selection for Prime could be a bit updated. Sound is tops over Apple TV's limited Audio. If I only liked games.....bummer", "verified": true, "helpfulness": "0/0", "author": "Olhippy \"resmith\""}, {"rating": 5.0, "review": "We love it.  Agree with others where we have Netflix and hulu along with amazon prime and I wish when you searched for shows it could go through all the apps but I understand since it is an amazon device.  Also wish you could just search through the free movies and shows that come with amazon prime.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just as advertised, it was quick and easy to set up and it is small so it can fit in anywhere on your system.  Having 40K movies available to chose from is great for those days when you must be home or choose to be home.  As a satisfied Amazon Prime member, I just hope Amazon continues to expand their free collection of available titles.  Streaming is smooth and uninterrupted.", "verified": true, "helpfulness": "1/1", "author": "Frederick A. Czulada"}, {"rating": 5.0, "review": "Fire TV has a lot of great content.  I love the flexibility of being able to side-load apps.  The voice command works well.  Fire TV has some perks that I didn't expect...I downloaded some relaxation apps for $1 each...virtual fireplace with classical music in the background, beach scenes, etc. for when I want to relax but not watch TV.  At first I was disappointed that it did not have a 3.5mm headphone jack, as my husband likes to watch bad movies and I don't want to hear them :)  But I solved that problem by buying a \"Orei DA21 Optical SPDIF/Coaxial Digital to RCA L/R Analog Audio Converter with 3.5mm Jack Support Headphone/Speaker Outputs\" here on Amazon.  This allowed me to connect the Fire TV to the Orei converter and the converter to my wireless Sennheiser headphones.  Peace at last!  :)", "verified": true, "helpfulness": "1/1", "author": "Kat312 \"Kat312\""}, {"rating": 4.0, "review": "I like Amazon Fire TV a lot. I made the mistake of thinking the 200,000 movies and TV shows were free. There is a slight charge for watching. You can watch free if you use Amazon Prime or Netflix. Cackle TV is free. I am still happy with my purchase though. Product works well. Fast shipping.", "verified": true, "helpfulness": "2/2", "author": "Karebear40"}, {"rating": 3.0, "review": "Can I view access media from my network hard drive? I do not own one at this time...", "verified": false, "helpfulness": "0/1", "author": "Jax Jackson"}, {"rating": 5.0, "review": "I got this for my X-Mas. I love it. It is one of the best gift I have received in a long time.", "verified": true, "helpfulness": "1/1", "author": "JT"}, {"rating": 5.0, "review": "Love all the extra features and consolidation of available apps.", "verified": true, "helpfulness": "1/1", "author": "Johnny De La Zerda \"Johnny De La Zerda\""}, {"rating": 5.0, "review": "I purchased one at a Staples store and I had problems with it shutting down.  Amazon was very helpful in troubleshooting it.  After a number of attempts to reset things the problem never went away.  It would play for a time and then just shut down and then reload. Amazon decided to send me a replacement - a new unit with next day shipping - they were great.  The new one is fantastic.  It works great with my WiFi - no problems.  Thanks Amazon. I quit Comcast TV and with a Mohu Leaf HD antenna for local channels and the Fire TV I couldn't be happier.  I now have better content and I am saving money.", "verified": true, "helpfulness": "1/1", "author": "John"}, {"rating": 5.0, "review": "Was a holiday gift. Love all the options I can watch now. Very enjoyable, easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]