[{"rating": 2.0, "review": "I have a net flix account and hulu.  this is great for prime only", "verified": true, "helpfulness": "1/3", "author": "Harry Jay Collins"}, {"rating": 5.0, "review": "Watched TV last night and used my Fire TV streamer for the first time. I can't get over how nice this little box is. I have used Roku and  Sony and never had a better experience then Amazon Fire. HD movies come in great, and I love the voice command with the remote.", "verified": true, "helpfulness": "1/1", "author": "Thomas W Romer Jr"}, {"rating": 5.0, "review": "the only trouble I had was getting the battery compartment opened.  They should have a diagram of it.", "verified": true, "helpfulness": "0/0", "author": "Carol A. Dejacimo"}, {"rating": 4.0, "review": "Hardware:  Snapdragon CPU with fast GPU (Best STB for the price 79.00)  Very well made, small compact size.  Non directional remote and game controller (I believe its bluetooth)Software:  The AMAZON PRIME content is mixed with pay content, this has been reported by other users of PRIME.  I and others can only hope that AMAZON will change this or give us the option to filter sources.  I would like to see more filter options and or UI customizing. One example: The website can filter by PRIME only content then genres.  Amazon has made improvements to finding Prime content (The Free Shows) but still NOT in the same class as the main site.  I would also like to see access to the AMAZON.COM shopping site, shopping from your TV and checking on orders or getting notifications popups on deliveries on your TV screen.  For the tweaker: I have installed a keyboard w/ touchpad (K400) and it works great.  I have also installed my own software VIA DEV options: 1. Web browser \"Chrome\". 2.Media Client.  This rounds out and replaces a larger HTPC with access to my digital library on local network & cloud.Bottom line: The price I got this for it can't be beat.  I think \"Nexus Player\" & the newer Windows mini-pc's are going really open up how we watch TV.  If you have not purchase this then you might want to hold off a little.  New Android TV boxes & Windows 8.1 w/Bing boxes are coming at only 100.00 - 200.00.  I suspect when they hit JAN-FEB 2015 you might see price drop on the FIRE TV or maybe a bundle.I'm very happy with my FireTV I would suggest this over buying a cheap Android BOX that wasn't truly made for TV \"The non TV versions\" and hoping they got it right:)", "verified": true, "helpfulness": "0/0", "author": "TaticalJoe"}, {"rating": 1.0, "review": "I set up our new Fire TV yesterday and it was fine out of the box. It connected to my wi-fi with no issues at all. I uploaded 400 pictures through AmazonCloudDrive, downloaded a bunch of apps, signed up for Netflix and Hulu Plus, watched a ton of YouTube videos in stereo sound, and watched a couple of movies. I loved the microphone - it worked great. Thought this was going to be a good thing and maybe we'd even cancel Time Warner Cable.How quickly that changed when I woke up this morning and turned on the TV. The Fire TV could not connect to my wireless router. First I checked to make sure my internet was working, and it was. I was online on my laptop, and TWC was up and running fine. So the problem was not with my internet connection. I called the customer service number for Fire TV and talked to a person who was just completely incompetent. She had me \"deregister\" my Amazon account and sign back in. This made the problem EVEN WORSE, as now the Fire TV won't even recognize my Amazon sign-in.So now I can't even get as far as signing in, much less the device picking up my wi-fi.I talked to a supervisor who is shipping another unit to me, one-day shipping, (but today is Saturday so it won't be here unitl Monday). He also emailed me a shipping label to return the bad unit. That's all well and good, and I do hope this was a one-off bad unit, and that the replacement will work without issue. But this has been a very bad experience thus far, to only get one day of use out of it.If the replacement works and has no issues, I'll edit my review. But for now, this is it. Buyer beware.*****12/30/14 - EDIT TO ADD: I received the replacement unit and it's DOING THE SAME THING - it won't even connect to my Amazon account, so there is no connecting to my router. I am currently on hold with Customer Service (30 minutes now) waiting for a supervisor, because the Technical Support person told me this is a KNOWN ISSUE with users being UNABLE TO CONNECT. The unit is completely USELESS and I'm waiting for a supervisor so I can get a return shipping label and send this PIECE OF GARBAGE back, along with the first unit that's still sitting at the front door, ready to ship back!Evidently, we need a Roku 3, and that's what I'll buy as soon as I get off the phone with Amazon. For the record, I've been a Prime member for over 10 years, and have never encountered such a disaster as Fire TV.", "verified": true, "helpfulness": "1/3", "author": "allyson c smith"}, {"rating": 5.0, "review": "I can see why cable companies are afraid of these units. A bunch of great TV programs. Very responsive. Much faster than my cable box when it comes to searching. The remote is small and easy to use. The remote is small and easy to loose as well, especially if you have a two year old. My one issue with it is that it is so easy for a child to make an accidental purchase. I have the fire stick as well and my buy another device.", "verified": true, "helpfulness": "1/1", "author": "Ctlouie"}, {"rating": 4.0, "review": "Awesome little box,. PROS: Runs great. Easy to use. Movies stream instantly. Voice search is amazing. Image quality is excellent. CONS: The remote is not ready for games. Missing some popular channels. USB port not support personal files. Android apps can be side loaded but no goes to home screen.", "verified": true, "helpfulness": "0/1", "author": "Humberto E. Alpízar"}, {"rating": 5.0, "review": "I think it's just very nice.  Netflix and Prime work just fine, and the voice actually does work surprisingly well.Also using a XBox 360 controller for casual gaming.  All in all we'll be purchasing another one for upstairs.", "verified": true, "helpfulness": "0/0", "author": "Dana L"}, {"rating": 4.0, "review": "Works great, simple to set up and use.  Can switch to another television easily if desired.  Really like it.  Could use a USB port to allow pictures from external drive to show.", "verified": true, "helpfulness": "0/0", "author": "Willie F. Orr"}, {"rating": 5.0, "review": "I love it very nice", "verified": true, "helpfulness": "0/1", "author": "Tiffany"}]