[{"rating": 5.0, "review": "I LOVE THIS THING!  My two year old grandson has learned how it works and the voice search feature works even with his toddlers speech. He  can find his favorite toons easily. I have no complaints so far.", "verified": true, "helpfulness": "1/1", "author": "blondie"}, {"rating": 2.0, "review": "I was excited to receive my Amazon Fire TV in the mail.  I am stationed overseas and miss US TV programming so I was excited that this product was announced.  Set-up was simple...and then my excitement ended.  This product will not work outside the US because of copyright restrictions.  I would hold off buying this if you are outside the US until you return.  I now have a beautiful paperweight for my office and that is about all it is good for now until I am stationed back in the US.", "verified": true, "helpfulness": "9/10", "author": "J. P. F."}, {"rating": 5.0, "review": "This is meant to be a brief review.If you're a Prime member, it's a no-brainer to try this.If you're a non Prime member, it's still worth checking out.Simple operation, intelligent menus, very easy setup.  Many great options.Using Plex app, our own networked content can be added & played.AF-TV playback quality is stellar.  Fluid with no stuttering or delays, just like cable or broadcast tv.Better than any similar product we've tried.", "verified": true, "helpfulness": "1/1", "author": "SW"}, {"rating": 4.0, "review": "I quit gaming and the only reason i still had my ps4 was to watch Netflix and crunchy roll so now i am thrilled that amazon released this media box its affordable and its extremely fast the only reason i gave it four stars was because it didn't have hbo and crunchy roll and I'm a HUGE anime fan so i was sad to see these apps not available hopefully they add hbo and crunchy roll because if they do that would be amazing if you watch netflix or hulu and like to casual game then this is perfect for you", "verified": false, "helpfulness": "0/0", "author": "Roxas"}, {"rating": 3.0, "review": "Put this through it's paces with my friend who purchased it.  Smooth clean interface, very responsive and no playback lag.  If only it had the ability to play my content it would replace my aging Media Center PC.Not being able to play our home movies and pics makes it a no go though.  Hopefully Amazon will correct this deficiency soon.", "verified": false, "helpfulness": "1/2", "author": "Robert A Ash"}, {"rating": 2.0, "review": "You can't get to your mp3's on the amazon cloud. The remote freezes up constantly and you have to take the batteries out and put them back in for it to work.  I am very disappointed, everything else I buy that is \"Amazon\" brand is excellent. This is completely not a typical Amazon product. I think they rushed getting it on the market.", "verified": true, "helpfulness": "2/3", "author": "Kman"}, {"rating": 4.0, "review": "I love this box. Its convenient, simple and quick.Box: Just about everything you need is in the box, with the exception of the HDMI cable which you can find at any Best Buy or maybe even Wal-Mart I'm not sure we had an extra lying around.Set Up: Set up was simple and easy to manageUse: This is so easy to use and intuitive. I would say it is much better for prime members than non-prime members because by default it searches the Amazon library and voice search does not work in netflix or other librarys/apps.I will clarify by saying I do NOT own any other streaming devices beyond a smart TV and blue-ray devices and a Wii but this box is heads and tails above what I do have. If you already have a prime account this box is a no-brain-er if you do not it is still a great box but I would consider purchasing an Amazon Prime account as it will improve your utilization of this devices features.I would love to see an update to the Netflix app or the box that allows us to search through all the libraries at once though I don't expect that to happen.EDIT: I now have a Roku in house and find that I still prefer my Fire TV. Especially since voice search is now recognizing hulu shows. It may be a matter of personal preference but I like my Fire and it works smoothly and simply. If you aren't looking for fancy apps and to do much more than actually watch TV I highly recommend it.", "verified": true, "helpfulness": "1/1", "author": "Just Me \"Kelsey\""}, {"rating": 4.0, "review": "Widen use of voice activation.  Add classical program to the music videos group'  More foreign, old and independent movies on Amazon Prime list.", "verified": true, "helpfulness": "1/1", "author": "thurmmary"}, {"rating": 5.0, "review": "Way better than google chrome. I like the fact that I can use a remote control and it's really easy to use love it", "verified": true, "helpfulness": "2/2", "author": "paty"}, {"rating": 5.0, "review": "A+ for set up and ease of use.  As a prime member it already knew my name.  Nothing to enter.  Nifty remote with few buttons and nice feel.  With voice search find  what your looking for in seconds!", "verified": true, "helpfulness": "1/1", "author": "james mcadams"}]