[{"rating": 5.0, "review": "My favorite box in the house.  I started with an Apple TV, then the Roku stick, now this Fire TV.  I cut the cable and just have internet now for $45/mth.  I figured we can buy the shows we watch and still save money; and download them on any device and take them with us.  We subscribe to Prime, Hulu and Sling.  Sling on the Roku had very poor performance.  The Roku's remote is terrible, partly because it's RF and the other reason is the squishy buttons.The Fire TV is excellent.  Sling TV is 1000 times better, the shows load up and it feels as though you are actually watching cable tv.  Also, the remote is great.  Each button has a positive click when you push it.It seems that everything Amazon does, it dedicates the proper resources to insure that the product it top notch and worthy of it's place at the top.  I am impressed with their music app, video app and now this Fire TV.  I am an Apple Fanboy and am slowly converting everything over to Amazon.", "verified": true, "helpfulness": "0/0", "author": "Rabes \"Rabes\""}, {"rating": 5.0, "review": "It is a very good experience", "verified": true, "helpfulness": "0/0", "author": "roosevelt rodriguez"}, {"rating": 3.0, "review": "Kind of limited and more costly due to charges for each service network", "verified": true, "helpfulness": "0/0", "author": "Steven Williams"}, {"rating": 5.0, "review": "Easy to set up and works as advertised. Plugged in the HDMI and power cables, connected to wifi and all my apps and programming were available. Also faster and more reliable than a standalone smart TV.", "verified": true, "helpfulness": "0/0", "author": "DaveL"}, {"rating": 5.0, "review": "Love the fire tv works great.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "Nice...", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "I wish it had a browser but other than that love this product!", "verified": true, "helpfulness": "0/0", "author": "C. Rodrigue \"mlm87\""}, {"rating": 5.0, "review": "I love saving the money from no cable bill", "verified": true, "helpfulness": "0/0", "author": "wheelchrgrl91"}, {"rating": 5.0, "review": "I've had this almost a year and it just keeps getting better.  The amount of programming available is growing every day.  Amazon Prime really adds a ton of value also.  I can see there will come a day when I'll be able to cut the cord.  Set up is beyond easy and I've had very few problems.  The box does a really good job of connecting to my Wifi, whereas, my DirectTv constantly needs to be reset.  I predict that within the next year I'll be able to drop the higher tiers of programming I currently have with DirecTV.  And the voice controlled search really does work!", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "Love our Fire TV!!  We got rid of cable/satellite TV and just use an HD antenna for the local channels & the Fire TV for everything else.  It has taken some time to get used to it, but so far we love it!  The Prime membership definately helps but the most recent/popular things are not free.  (Also, you can download the Fire Tv app onto your smart phone and use it as the remote.)Get Netflix or Hulu also", "verified": true, "helpfulness": "0/0", "author": "Cheryl T"}]