[{"rating": 5.0, "review": "The hubby and I love it.  Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Dweeny"}, {"rating": 5.0, "review": "Excellent product!  I would highly recommend Fire TV", "verified": true, "helpfulness": "0/0", "author": "John Fratamico"}, {"rating": 5.0, "review": "More than I expected.", "verified": true, "helpfulness": "0/0", "author": "Harold Holland"}, {"rating": 2.0, "review": "Kind of disappointed that you need to pay for most things. Kind of pointless I could have done that on my computer and for probably cheaper.", "verified": true, "helpfulness": "0/1", "author": "Lyndsi"}, {"rating": 5.0, "review": "Awesome!!  I Live MY Amazon Fire TV!!  The selection of movies is Great!!  Watching you tube on the TV is great.  Love It, Love It!!!!", "verified": true, "helpfulness": "0/0", "author": "Sherry Edwards"}, {"rating": 5.0, "review": "I love it.  I don't like the fact that they charged me 99.00 for amazon prime when it is suppose to be a free trial.  Still trying to get answers on that.", "verified": true, "helpfulness": "1/1", "author": "JYLL BIGGS"}, {"rating": 5.0, "review": "The item is good.I have one problem i didn't understand what the usb sot is for....Eyal", "verified": true, "helpfulness": "0/0", "author": "Eyal harel"}, {"rating": 1.0, "review": "Do u have to have cable for this. Or can u just use that", "verified": false, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am not so sure about Amazon Fire TV yet, because there needs to be more. A lot of the programs I would like to watch cost extra money. Also, it is not very user friendly. I would like to find a browser so I can search Google using the fire. Youtube is difficult to search unless a person connects their phone to the code on Fire TV. There are aspects I like but Amazon still needs to do some more work to make this better.", "verified": true, "helpfulness": "0/0", "author": "J. M. Sharp"}, {"rating": 5.0, "review": "Love it, makes logging in and finding something to watch easy", "verified": true, "helpfulness": "0/0", "author": "CAK"}]