[{"rating": 5.0, "review": "For one of these.  I use a direct LAN connection as it more dependable.  Instead of paying Direct TV a higher monthly fee for HD hookup and equipment, I stream my movies thru the Amazon TV instead.  Most movie rentals cost the same so I think even with the Amazon Prime (for which I get more than just TV) its worth it to me.The processor is very fast and only at the beginning of a movie (but not always) do I see a little buffering.Only wished you could stream the Music thru it as I am NOT going to buy another device.HIGHLY recommended.", "verified": true, "helpfulness": "2/3", "author": "Desert CatMom"}, {"rating": 1.0, "review": "My internet, netflix, hulu, local network reading of HD mkv files Samsung television does everything this $100 box does. I do not have to buy it to know I can download any show and watch it for free is better than this. Please if you have any internet sense and a half new television do not waste your money.", "verified": false, "helpfulness": "2/20", "author": "Abe Stout"}, {"rating": 5.0, "review": "Amazon Fire TV  (AF) was easy to set up and worked from the start.  I love to watch movies which AF has plenty but I also found some TV series which I have not watched and when I started I was hooked.  Great source of low cost entertainment.  I would recommend to anyone who loves movies and tv series.", "verified": true, "helpfulness": "2/2", "author": "David"}, {"rating": 4.0, "review": "There are a few validation issues with developers, like them invalidating purchases if you accidentally uninstall their game, for example (Telltale Games), but the micro console is excellent overall.I'd have appreciated a way to charge matters without a additional research and purchase, or at least presented Amazon's own charging pack in a follow up email and during the purchasing process.  I also would appreciate USB storage being activated sooner than later to so that I don't lose anymore purchases or game data for future uninstalls.  At 8 GB internal storage, less than 6 GB usable out the box, there is no way to enjoy all your games without constantly re-downloading, and even repurchasing them.", "verified": true, "helpfulness": "2/2", "author": "James Marshall"}, {"rating": 5.0, "review": "I wish there was a button that could turn it off without me having to unplug it.  It's suppose to turn itself off but often stays on for hours if I don't do it manually do it.", "verified": true, "helpfulness": "2/2", "author": "Patricia Cooper"}, {"rating": 3.0, "review": "I purchased Amazon Fire TV for our camper. I also have Wi-Fi Hotspot on my phone so I can watch prime movies and tv.  I have Amazon Prime. The problem I am having with my viewing pleasure is that I have VERY GOOD connection with my Hotspot but  almost every day or night the movie will stop and search for a Wi-Fi Hotspot.  Could I have a faulty Amazon Fire TV box?  It is very annoying.  I'm thinking about dropping AMAZON entirely.  Please help me out.", "verified": true, "helpfulness": "1/5", "author": "kana"}, {"rating": 5.0, "review": "We just purchased this amazing unit.  We did have to purchase an additional switch box as our tv only has one port for the HDMI cable. Other than that we love being able to watch whatever we want.  We are hooked on Downton Abbey which we had never seen before. The choices are limitless. The function is very easy to use and the connections are great.", "verified": true, "helpfulness": "1/1", "author": "Bonnie Piehl"}, {"rating": 5.0, "review": "Love watching what I want when I want and it is so easy to start and use right away. Going back to basic cable to san=ve money and will be able to watch jus as much, probably more than the $175 cable bill.", "verified": true, "helpfulness": "3/3", "author": "Patricia Bitzer"}, {"rating": 3.0, "review": "\"Amazon Fire TV is a tiny box you connect to your HDTV.\"Well, yes; maybe except for those two itty bitty tiny dongles: Chromecast & Roku.  On top of their own small size each of the dongles uses USB power access, so all disappears behind the TV.  This is form factor nirvana.I have not seen a power supply the size of the FireTV power supply size since my Lionel train set from the '60s.  We are not trying to replace the DirectTV Set Top Box the size of a 55 Buick with a streaming media player that has a power supply the size of a 55 Desoto.", "verified": true, "helpfulness": "3/7", "author": "JJ L."}, {"rating": 1.0, "review": "Warning.I bought this product, but I could not use it because my credit card is not from the USA.", "verified": true, "helpfulness": "4/11", "author": "Fernando"}]