[{"rating": 5.0, "review": "Amazon Fire TV is absolutely amazing. I am not a technical savvy individual anyway I felt the instructions were very easy to follow. I am definitely going to purchase another one as gifts for my friends. The speed of the applications is super fast and the clarity of the graphics are beautiful. I love Amazon Fire TV and I have already told my family and friends to purchase one. As always Amazon you have never let me down when  I purchase one of your products thank you.", "verified": true, "helpfulness": "2/2", "author": "Brenda Thomas"}, {"rating": 5.0, "review": "We were using a latest-model Apple TV for Netflix and the TV shows that we watch via pay-per-view. But we have not used the Apple TV since we got this. Much better performance all around. And now we can actually watch the videos we're paying for via Prime on our big TV. Most of the time, no waiting for streaming to start and then great video quality. Of course, we have good, fast cable internet. But this box takes much better advantage of it than the current Apple TV does. We expect Apple will upgrade their boxes soon, but they will be doing a lot if they can surpass this Amazon Fire TV. It's just fantastic.", "verified": true, "helpfulness": "1/1", "author": "G. Davis"}, {"rating": 5.0, "review": "Love the sync feature and it is compact and does so much! I can get the most out of the prime membership with Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Lorraine R Orosco"}, {"rating": 4.0, "review": "Loaded XBMC 13.0 Gotham and Llama to configure XBMC to auto-launch.  Now the only reason to ever drop out to the standard FireTV interface is for Amazon Prime Instant Video (PIV).  Finally a box that can handle all my archived content from NAS (BR&DVD; .iso, flac CDs, etc.), integrate with MythTV PVR, and stream Netflix, Pandora, etc. all under one integrated GUI.  Alternatively, Plex could be used in place of XBMC to achieve a similar all-in-one experience without having to leave the standard interface behind.  This is a very flexible box with powerful hardware.If only APV could be launched as an app as opposed to built into the stock launcher I'd give another half-star.  The second half-star missing is for the lack of MPEG-2 decoding in hardware.  The FireTV is more than powerful enough to software decode 480i DVD images and even 1080i off the PVR tuners, so you won't miss out on playback, however it doesn't deinterlace this way, so you end up with nasty jaggies that are hard to ignore.  Of note, while Amazon claims VC-1 is supported this is not currently true, perhaps it will be added later?  This does not affect me personally, not that many blu-rays use VC-1 encoding, but it's always a shame when a claimed feature turns out to not exist.Back to the positive side the FireTV integrated 100% perfectly with my Harmony remote and Flirc receiver.  The included remote is \"OK\" (no stop button..?), but with an IR receiver like the Flirc you can replace it with any other remote you already own.  The only thing you lose this way is voice search, which brings me to my other disappointment:I was naive and expected voice search to return hits to all of the factory installed streaming services, but it seems no matter how many services offer the same content, the results returned are always for purchase on Amazon Instant Video (AIV).  I could almost give Amazon a pass for directing us to their own content even if the same thing is available free on Netflix or Hulu, but as a paying Prime customer it felt wrong that voice search tries to get me to purchase something from AIV instead of telling me it's available to stream free on PIV.  I've heard this will be changing and voice search will soon integrate with Netflix and the other services; let's hope for Prime members they'll also be more open about showing us what we can stream for free before trying to trick us into paying.  Even a system setting such as \"only show free prime instant streaming\" would be a great addition.", "verified": true, "helpfulness": "1/1", "author": "Magialisk"}, {"rating": 4.0, "review": "Has it all! Name your movie and is there. You might have to pay for some of them but is worth it especially on a Sunday night.", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 5.0, "review": "Simply the best. The very first media player that you can really customize and the fact you can side load apps and play games is amazing. Contact me to do next commercial.", "verified": true, "helpfulness": "1/1", "author": "KEVIN W."}, {"rating": 5.0, "review": "I love it, but to be fair, so far I've only used it for my Netflix account and I haven't selected any other program as yet.  I definitely plan to use it to its' capacity!", "verified": true, "helpfulness": "1/1", "author": "Alyce"}, {"rating": 4.0, "review": "Great system but you need to be able to add more channels such as the wwe network as you can do with roku", "verified": true, "helpfulness": "0/1", "author": "ron lloyd"}, {"rating": 5.0, "review": "The coolest part of this product is the user interface. Its super fast and the voice search works very well.The product is very simple open you can add apps and install 3 party apps.The apps are very good and smooth.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Mayhall"}, {"rating": 5.0, "review": "This is just as good as Hulu or Netflix. Get yourself Amazon Prime, enjoy free movie and network/cable TV shows, save on others and enjoy all in amazing HD. Love this!!!", "verified": true, "helpfulness": "1/1", "author": "John Morrow"}]