[{"rating": 1.0, "review": "DO Not Purchase IF you have a VISIO TV. I don't dislike the product its just not compatible with VISIO.  The sound will not work and makes high pitched intermittent noises.  I have removed the FIRE but am still experiencing trouble with my surround sound and other devices (Apple TV & ROKU) and I fear it may have damaged these components.Amazon was great about the problem and said I could return free of charge with no restocking fee OR wait until the developers could come up with a solution... Its been a few months, sent her back today... By FIRE...  Too bad your highly anticipated voice command is not ready for \"everyone\" to experience...", "verified": true, "helpfulness": "1/2", "author": "Tracey Benz"}, {"rating": 5.0, "review": "This looked like a great idea when I read about it.  I got it as we no longer had cable TV and aren't around the TV a lot so just want to watch movies or TV shows occasionally.  At first it did not work and kept saying we didn't have a good internet signal and so we had the Internet provider out twice checking wires and finally putting a new modem in.  I set it up again last weekend and did some more reading on it.  It wasn't as good hard wired and the instructions said to move it out of any cabinets so wouldn't interfere with signal strength so I did and put it by the new modem.  Now it works GREAT and sometimes slows for just a minute and then takes off and plays the whole thing we are watching at the time.  I don't have to turn on the computer now to watch streaming from Netflix either as it comes through just fine on the Fire TV.  I WOULD HIGHLY RECOMMEND NOW.  And as an added bonus -- I got my Internet fixed which I didn't even know had a problem!!", "verified": true, "helpfulness": "2/2", "author": "Carla G"}, {"rating": 5.0, "review": "This is far better than the other competing types! I was using another device to watch Hulu Plus on my tv and was constantly frustrated with it being slow, saying there were network errors, and crashing every time I tried to watch a tv show. I setup the amazon fire tv in no time flat, and was amazed with both the speed and the quality of the picture. For anyone who is using a 5GHZ wi-fi network it is also a huge plus that this is compatible, while other devices won't work on a 5GHZ and therefore are slower. The remote is also fantastic because it allows you to quickly get through menus and get to where you want to go to. Despite having this for a while, I am still constantly amazed by how clear and crisp the picture is as well as how fast this runs. I would definitely recommend this over the other tv devices on the market. Plus, it is a huge benefit that you can access prime content on it! Now hopefully they will upgrade the software at some point and allow you to access prime content separately from paid content.", "verified": true, "helpfulness": "0/0", "author": "boca375"}, {"rating": 5.0, "review": "Love the Fire TV. The interface is so much better than the Amazon app that came with my TV. It works so well that I forget about the device itself. The controller is also very well designed.", "verified": true, "helpfulness": "0/0", "author": "Michael Bigger"}, {"rating": 5.0, "review": "look good item", "verified": false, "helpfulness": "0/0", "author": "roca777"}, {"rating": 5.0, "review": "Need new and more westerns.....", "verified": true, "helpfulness": "0/0", "author": "mary morris"}, {"rating": 3.0, "review": "easy to use and much cheaper than local tv companies! However, we were pretty disappointed to discover that prime members only get the first season of a series for free. You have to pay for the rest of the seasons separately. I was not aware of this when first purchasing fire tv.", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 4.0, "review": "Faster than the Roku", "verified": true, "helpfulness": "0/0", "author": "Steve Mastin"}, {"rating": 4.0, "review": "We love the graphics and the ease of use.  BUT - there's one huge flaw that for some reason is never mentioned in any of the product info.  It uses HUGE amounts of data.  Amazon should really warn people about this issue, but they don't.  So, I'm giving you a heads up before you get a bill from your ISP for going over your data allowance.I wrote to customer service about it, and got a generic no help at all answer. Normally their customer service is exceptional, but not this time.  We did turn off Mosaic as they suggested and tried it out again last weekend.  My husband watches TV for hours on the weekend, and in two days he used 75GB of data.  That's a lot of data.  Take this into consideration before you purchase, and make sure you know that there may be additional cost to use this product.  Not just the one time cost of the unit, but ongoing every month through your ISP.", "verified": true, "helpfulness": "0/0", "author": "Michelle Ravell"}, {"rating": 5.0, "review": "What can I say!! The future of TV goodbye  cable and satellite who needs it? I watch what I want when I want. This is a awesome product. My only complaint is the USB is still not enabled allowing me to use my home network to stream my movies? Hope Amazon addresses this soon as most of the competitors have this option available?", "verified": true, "helpfulness": "3/3", "author": "Richard Matthews"}]