[{"rating": 2.0, "review": "Most of apps freeze up a lot", "verified": true, "helpfulness": "0/0", "author": "regina santiago"}, {"rating": 4.0, "review": "It's fast and easy to use. If you lose your remote you can download a remote app to your phone. I subtracted a star because the home button should be moved somewhere else on the remote. It's really annoying when your searching for something to watch and that button is hit, it backs you all the way out to the main screen. Then you have to navigate back to where you where. Not a big deal, but needs to be improved.", "verified": true, "helpfulness": "0/0", "author": "Jason Carroll"}, {"rating": 4.0, "review": "Was not what I spected", "verified": true, "helpfulness": "0/0", "author": "victor guzman"}, {"rating": 4.0, "review": "Its a great little device. With Sling TV I've just about got everything I need to break away from cable. It just lacks the ability to DVR everything.  Until they fix this the cable companies still have at least one compelling argument on their side", "verified": true, "helpfulness": "1/1", "author": "Emmett W Grandy"}, {"rating": 5.0, "review": "You have to pay for EVERYTHING.  Did you just forget to mention that in your ad?", "verified": true, "helpfulness": "0/0", "author": "Diane Fisk"}, {"rating": 3.0, "review": "Voice search only works with Amazon stuff. Hard to navigate.", "verified": true, "helpfulness": "0/0", "author": "Tobin Mathew \"Peds Nurse\""}, {"rating": 2.0, "review": "My product freezes on me randomly and there noway to search with voice only with prime content not mention prime content has the worst movie list I have ever seen in my life crackle has better movies then that and not to mentiin everything with the good movies you have to buy and there is no power button so in order to turn if off you have to power it down by uplugging it or its gonna mess up the device quickly and go out on you so all in all was a good idea but horrible product I was expecting something wayyy better then I got", "verified": true, "helpfulness": "0/1", "author": "travls"}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "samuel griggs"}, {"rating": 5.0, "review": "By far the best Smart TV interface so far. WatchESPN quality is fantastic.", "verified": true, "helpfulness": "0/0", "author": "KV"}, {"rating": 5.0, "review": "I've been into digital media for many years and was one of the first roku buyers.  I've recently been switching my rokus out for these fire tvs mainly because I like the interface better.  My Rokus have always ended up having hardware problems like no display, bad remotes, random crashes/reboots, and while the firetv has its own issues, I have not noted the same kind of instability as of yet.CONSAmazon locks out its best interface / UX features so that they are only used by Amazon Video/etc services.  I get it, they sell these to sell more of their digital content, and they, like any greedy company, don't want to empower competing digital content service providers.  If they could only open up their voice API to other apps they would go a long way to being the best media player device.  It'd be nice, too, if digital content you watch on say, netflix, would display on the main menus like amazon content does.  In this respect, the Roku is in a better position, since they are not selling digital content and want to support all content providers equally.  However, Roku's interface/ux designers have a lot to learn from Fire TV.PROSBetter media support, faster, more stable, all the apps you need.  Best UI/UX of all the other options.Google's Chromecast?  PLEASSSSSE its trash.  If money is your issue, go with the amazon stick built to compete with the Chromecast.  Plz google, stick to monopolizing the internet..", "verified": true, "helpfulness": "0/0", "author": "fmp7 \"willlynilly\""}]