[{"rating": 5.0, "review": "This box and the features/app are fantastic!!", "verified": true, "helpfulness": "0/0", "author": "Mark Reynolds"}, {"rating": 1.0, "review": "No search function for netflix.No HBOGOAmazon mixes prime and pay into the same search results.  Search for kids movies will display avatars for popular new releases which your children will then want to watch.MLBTV app required purchase of an account to download, even though I had an existing account.Home screen is jumbled and confusing.I give it 1 star for the voice feature.  I will be returning it.", "verified": true, "helpfulness": "3/8", "author": "Mich"}, {"rating": 4.0, "review": "Really like this option when you get rid of cable. We have Amazon Prime, netflix and Hulu. The voice recognition only works for Amazon shows and it is not easy to see which shows are free with Prime. Also, the remote should be slightly bigger to allow for a keyboard which would make it a lot easier to use.", "verified": true, "helpfulness": "0/0", "author": "Sarah L"}, {"rating": 5.0, "review": "I got rid of Direct TV because the shows I watch are on the expensive package and there are NO downgrades.you want to watch these shows-pay up. Fire TV gives me access to all the kinds of TV I watch. I have been able to watch movies, TV shows and documentaries. The device has allowed me to access Netflix and the Smithsonian channel and there are many others out there. I love this .I do not watch hours of TV a day- it is more like a few hours a month but the device means I can watch what I want now. I have a watch list and it will be months before I get through it and of course there is more added all the time.(I will never be without something I want to see) Easy hook up to TV and Internet. Love it and so glad this is an alternative!!!", "verified": true, "helpfulness": "0/0", "author": "jellybean"}, {"rating": 4.0, "review": "nice", "verified": true, "helpfulness": "1/1", "author": "rafael decastro"}, {"rating": 5.0, "review": "Works great, much better than other streaming devices I've used in the past.  Very fast and lots of apps.", "verified": true, "helpfulness": "0/0", "author": "Alex B"}, {"rating": 4.0, "review": "We love our Fire TV. The only complaints we have is that some movies that you would think would be readily available and free, are not. And SO many kids shows are $1.99 and up. Also, just two months after receiving my Fire TV the remote stopped working. Been on hold forever with Amazon to figure it out and hopefully get a new one. They are taking care of it for me so I do appreciate that.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"tarably good\""}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Greg Sweeting"}, {"rating": 5.0, "review": "Awesome, I had done my research first so knew what to expect. Surpassed my expectations....", "verified": true, "helpfulness": "0/0", "author": "Matthew l dillon"}, {"rating": 4.0, "review": "I'd likely give this five stars except that while the installation was rather straightforward, my issue is that my Panasonic HDTV with a home theater 5-DVD is \"synced\" to the TV, so when it comes down to the added cable box (perhaps gone in the near future), I can gain only the sound from the home theater side (including DVD) only by reverting back to the TV internal speakers rather than the external 5.1 system, which is a bit confusing to me with the splitter/switch HDMI box I also purchased.I would have thought that with the splitter, the input would have been transparent with the home theater, so now my thought of changing the HDMI cabling arrangement first to the cable box to the home theater, then the output from there to the TV to accommodate both. The fact is, the Amazon Fire does not relate this concept in installation at all, merely a TV HDMI input.All said, my HDTV has two inputs...one with direct connection with the U-verse box, then another with the home theater for what then ends up as also the DVD portion of the selection. To me, this complicates the overall setup, since I hoped installing simply from the home theater HDMI to the splitter/switch as well as the input to the TV would promote the use of BOTH. Nope...and without a remote control with the powerless switch, evidently the home theater doesn't support this and my selection of a splitter/switch for HDMI must be powered....and yet another remote control to determine the input control...If you understand my situation, I'd love to hear your solutions! I never thought this would be seemingly complicated as it should be rather clear how to deal with this.", "verified": true, "helpfulness": "0/0", "author": "Gidagorfen"}]