[{"rating": 3.0, "review": "I was a little disappointed as I found that I had to apply for several services that I really didn't want. Also I couldn'tfind any type of manual or written operation instructions for this unit.", "verified": true, "helpfulness": "0/2", "author": "Max Gayton"}, {"rating": 1.0, "review": "If you arent going to update plex in the app store then remove it from the list of supported apps.  Plex is past v3.5.x and amazon app store is still on 3.4.8.  Having to side load the latest plex so it works right with the latest version is ridiculous.  I should have stayed with my Roku player.  Amazon has always been good to me but this time you basically robbed me.  I wouldn't pay $5 for this device.  It doesnt even make for a good Frisbee. .", "verified": true, "helpfulness": "2/9", "author": "T. Norris"}, {"rating": 3.0, "review": "Sure wish you'd get HBO on demand on the Fire.", "verified": true, "helpfulness": "0/3", "author": "K. Larsen"}, {"rating": 3.0, "review": "I love this product but I'm pissed that I bought about two weeks ago and now it's on sale.", "verified": true, "helpfulness": "0/5", "author": "Kirsten Curley \"kirsten reads\""}, {"rating": 4.0, "review": "Over all good rating.  \"Watch ESPN\" is worthless.  Can't figure out to use Kendall w/ fire.  Not clear.  Over all good review.", "verified": true, "helpfulness": "0/2", "author": "S"}, {"rating": 2.0, "review": "I regret buying Amazon Fire. I should have purchased another ROKU but I was taken in by the hype. I have slow DSL 3mb download and the Fire certainly flickers. Last night I was watching a program on the FIre and it constantly lost video while audio continued. I gave up, went to another room and viewed the show on ROKU with no problem. Also, voice command only works for Amazon Prime and manual search defaluts to Amazon Prime.", "verified": true, "helpfulness": "2/3", "author": "Alliji \"God's girl\""}, {"rating": 5.0, "review": "I've had numerous smart Blu-Ray players, Roku's, the Xbox in every flavor - this tiny little black box KICKS THEIR COLLECTIVE BUTTS.  Guess what?  When you select something to watch and hit play, (hold on to your hats!) it PLAYS!  There is virtually no such thing as buffering on this device - none.To be fair, I have a 50/10 cable connection to the internet, so I shouldn't expect much buffering issues anyway, but that wasn't how it was with the other devices.  If I hit play, it would sit and buffer for anywhere from 3 to 20 seconds before it would play.  This thing just PLAYS.Using the Plex app, we can stream anything we have ripped to a computer in our home, combined with Netflix, Hulu and PRIME, life is very, very good.  I am going to get one of these for all the sets in my home.  2 down, 2 to go!Can't wait for the Prime Music upgrade, coming soon!", "verified": true, "helpfulness": "5/5", "author": "J. Bachaud"}, {"rating": 3.0, "review": "works well but you should be able to voice command for everything including password.", "verified": true, "helpfulness": "0/1", "author": "marissa"}, {"rating": 5.0, "review": "This is the best thing and I love it! Just trying to figure how I was living without it!", "verified": true, "helpfulness": "1/2", "author": "Ana Torres"}, {"rating": 5.0, "review": "Its working with WiFi?", "verified": false, "helpfulness": "0/4", "author": "javier a."}]