[{"rating": 5.0, "review": "Very happy with purchase", "verified": true, "helpfulness": "0/1", "author": "Shirley Tivis"}, {"rating": 5.0, "review": "Love it! So easy to use!", "verified": true, "helpfulness": "0/1", "author": "Jennifer M"}, {"rating": 4.0, "review": "I bought this with every intention of returning it after trying it out. I tried really hard to find reasons to return it. I couldn't find enough to outweigh my love for this device. I sideloaded XBMC on my Fire TV and have been running all my networked videos through it. It does 1080p just fine.There are a few small gripes I have with the box, so you know it isn't perfect.* I can't get any other bluetooth input devices to pair. I want to use my mini bluetooth keyboard on it, but can't.* Because this is an android device there is the occasional program that will spontaneously crash for no reason.* The app selection is REALLY small.* No IR input so I can't use my universal remote (which powers all the rest of my devices). I like the bluetooth remote, but I really don't like having more remotes* Some apps will keep going in the background and the device won't go to sleep. I purchased this thing for its really low power consumption, so this is a (minor) drain on my electric bill.* The most recent update messed up the dual wifi. Videos that didn't buffer before are having streaming lag.", "verified": true, "helpfulness": "1/2", "author": "W. Madsen"}, {"rating": 5.0, "review": "Simple and neet", "verified": true, "helpfulness": "0/1", "author": "Ken Kingsley"}, {"rating": 5.0, "review": "This is the greatest thing ever to watch whatever you like you dont need to get up to manage or unplug to restart call a technical support we are very satisfied as senior s.after growing up having to turn channel mess with antenna s its the greatest so cant wait to see whats next.", "verified": true, "helpfulness": "0/1", "author": "Sharron A Smith"}, {"rating": 5.0, "review": "Excellent streaming device. Love that I can watch Amazon Prime content from my couch without streaming from a computer or other device. I also have an Apple TV that has primarily been used for watching Netflix but the prime tv interface is so much better I use it most of the time.", "verified": true, "helpfulness": "0/0", "author": "TroyPhotog"}, {"rating": 3.0, "review": "I was offered the chance to try out Amazon Fire for 30 days, cost free. After 30 days, I returned it to Amazon. The interface is a breeze to use and I loved the simplicity of setting up Amazon Fire. Also, the remote and the voice control are great. BUT... the streaming quality was not the best. I get a better picture for Amazon Prime through my Blu-ray player, and the quality of Netflix was worse than a VCR. I'm sure these problems will be resolved soon, at which point I may consider buying Amazon Fire. Until then, I'll stick with my Blu-ray player.", "verified": true, "helpfulness": "1/2", "author": "Scott D Malchus"}, {"rating": 5.0, "review": "Love my Amazon Fire TV! Best investment. Has so many different channels and programs!", "verified": true, "helpfulness": "0/1", "author": "Yanet De La O"}, {"rating": 5.0, "review": "i like it very super fast more than apple tv and g-box ,mx, ect... android", "verified": true, "helpfulness": "0/1", "author": "hung nguyen"}, {"rating": 4.0, "review": "I've really enjoyed Fire TV so far.  It's easy to use and takes up minimal space.  My only complaint is search across platforms is possible.  It would be great if when you type in show/movie it searched across Hulu and Netflix.", "verified": true, "helpfulness": "1/1", "author": "Carly Knight"}]