[{"rating": 5.0, "review": "Decided to fire our cable company due to the ever rising cost. Very very happy with our Fire TV. Our main TV viewing is Amazon Prime, Netflix and Plex. Super easy to set up and use and voice recognition is amazing.", "verified": true, "helpfulness": "0/0", "author": "Allie \"Moms got ESP\""}, {"rating": 4.0, "review": "Just recently installed Fire TV via hard wire connection. Previous efforts with WiFi were unsuccessful. The hard wire connection works beautifully. Just wish there were more TV and premium channel options. Would love to do away with cable TV.", "verified": true, "helpfulness": "1/1", "author": "TEB"}, {"rating": 5.0, "review": "I bought this for the family room. I also have a Roku in the bedroom. I like both. I particularly like the microphone feature on the Fire remote. I do like the M Go search on the Roku more because it searches all apps, i.e., Hulu, Netflix and Amazon so that I can find the best deal. I'd like to see more new content on prime. Overall, I think this is an excellent product and would recommend this and the Roku. I'm very happy with what's available to stream and it's a great way to cut the Cable TV ties. We purchased an HD antenna from Amazon to go along with this and no longer need Cable TV.", "verified": true, "helpfulness": "2/2", "author": "Bonnie S. Hill"}, {"rating": 5.0, "review": "This product is great.  Network TV is basically reruns, reality TV and commercials.  When we chose to take time to view TV it is more quality time spent viewing what we choose when we choose.  Easy to set up and navigate.", "verified": true, "helpfulness": "1/1", "author": "JD"}, {"rating": 5.0, "review": "Very nice love it.", "verified": true, "helpfulness": "0/0", "author": "yarday"}, {"rating": 4.0, "review": "We love being able to watch shows we wouldn't be able to see without Amazon Fire TV. Love Prime but are confused at times as to what shows are free with Prime and why some are not.", "verified": true, "helpfulness": "0/0", "author": "sandra e cook"}, {"rating": 1.0, "review": "Not worth your time or the money!", "verified": true, "helpfulness": "1/12", "author": "David Lind"}, {"rating": 5.0, "review": "i love it the fire tv is amazing. the remote glitches from time to time but i think i may just need to change the batteries. i highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Jason Janecek"}, {"rating": 5.0, "review": "Love this!  We were trying to get Amazon Prime movies on our big screen TV, but the TV didn't have the app built in. Now it works perfectlyand we are more than pleased.", "verified": true, "helpfulness": "0/0", "author": "Peggy S. Campbell"}, {"rating": 5.0, "review": "While all streaming players miss some qualities, like DLNA at ease, the fire TV is simple to use and provides a much better interface and steaming quality than other competitors. I used to only use roku or Apple tv, the Apple TV has replaced both devices and I do not regret it at all!", "verified": true, "helpfulness": "0/0", "author": "Christopher"}]