[{"rating": 5.0, "review": "After owning 3 Fire TV Sticks, I figured I'd better try the big brother on for size. First thing I noticed is even though the Fire Stick isn't necessarily sluggish by any means, the Fire TV is noticeably snappier and more responsive. The voice command thing I don't really care about (spending most of my time in apps like Plex and Sling), but I could see how it can come in handy when navigating the huge amount of content available, especially for Prime members. I have to say I'm impressed with this little box, and it suits my needs perfectly.", "verified": true, "helpfulness": "0/0", "author": "Colt Stratton"}, {"rating": 5.0, "review": "Fast loading of apps and shows. Good selection of prime TV shows. I am a fan of the sleek design, BT remote w/voice search, and the user interface is rather easy to master. A good value.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up, great quality.", "verified": true, "helpfulness": "0/0", "author": "Dominique Beaudin"}, {"rating": 4.0, "review": "For what it provides it is great.  But, so much content requires that I have a cable provider (which I was trying to get rid of by purchasing Amazon Fire TV)  that my options are very limited.  Also, even though I have more than 20mbps there is intermittent buffering.  No one seems to know why.", "verified": true, "helpfulness": "1/1", "author": "jr83"}, {"rating": 5.0, "review": "Awesome box.Fast loading apps.The only downside is that the remote is overly sensitive.It skips over apps and movie/tv choices if you hold down too hard.", "verified": true, "helpfulness": "0/0", "author": "brett stevahn"}, {"rating": 5.0, "review": "New to this experience.  I have been watching tv shows, movies on my initial fire.  I am a prime member and the \"House of Cards\" has always been free.  Now to watch, I have to press the \"buy\" button.  What's up with this??", "verified": true, "helpfulness": "0/0", "author": "Barbara Lake"}, {"rating": 4.0, "review": "Just got unit 3 days ago so still fiddling. Had a Roku 3 at same time. Fire is much faster has optical output for older receivers like mine. Using in theater room 110 inch screen via projector so must have optical output to AVR. Roku doesn't have that option so unless you like silent movies!The good - Comes with Amazon account already on unit and start up is quick and 100% painless. Not a real big thing but setting up 3rd party accounts easier for you use most common email accounts just click on choice bottom of screen adds yahoo.com were Roku have to punch in each letter.  Voice search works like it should and very nice feature actually love this feature hope they make it available to 3rd party use like Netflix and others. I didn't think I would use it much but cuts you straight to the chase without all the confusion. Prime customers have a Prime search only really nice touch. Remember only works with amazon accounts not Netflix or other 3rd party at least yet. Unit loads much faster then Roku has less drops and if it has a drop buffers so fast you barely see the buffering screen. Unit has never stalled yet Roku had stopped a few times and never wanted to buffer a few times even if you went all way back to home screen. Finally did but live show was over. I will mention Fire did get a herky jerky freeze on ESPN sports once but hit select button reloads extremely fast and back to the action. NOTE:This may be issue with Sling TV not Fire or Roku for Roku locked up and would not restart. Never noticed on any other any other channels. Has some very nice features Roku doesn't have. More content then I'll probably ever use though Roku has more. Unit picked up wireless network immediately no issues but does work better on wired. Never tried Roku on wireless but expect about the same. Lots of games you may actually use. Box is extremely small not as sleek as Roku but not as fat. You can put box in sleep mode from menu / settings. Pretty much a pain to get to sleep mode but at least it has one. Roku as far as I know doesn't have that option other then eventually go to sleep. Dual color appears to be LCD lamp tells you if it is loading ,on, working properly.Flashing yellow internet lost or a problem.The bad - Not as much content as Roku not as slick looking menus etc as Roku blue tooth remote works great but battery life may be issue update later. Black remote not flat on bottom. I use this in home theater lay it down you can't see it. must turn on light to find remote. Note Roku same way. Lighted remote would be nice for dark theater at very least white option like PJ has white remote. Need to purchase expensive game controllers if want to get full enjoyment from games. HD picture not quit as good as HD from over air or satellite on 110 inch screen but on 58 inch screen almost undetectable. Using Sling TV which still has a few bugs HD on most cable channels was very good but ESPN for some reason not quit up to snuff but still very good both Roku and Fire.Comparison- Unit just works were Roku sometimes didn't. Select center button located were it should be and much easier to find when using in dark room. The button not the remote. I have used both. Roku is going back Fire is staying. I still have on older Roku simply because it has component out and optical audio which I hang on to it till the day it dies.Personally for me Fire works faster and much better. Even video somewhat better on Fire. While still not perfect thus 4 stars beats Roku 3. Lot more options with Fire. Any issues arise I will update.I don't believe you'll be disappointed with either but faster buffering and more options with Fire.", "verified": true, "helpfulness": "1/1", "author": "James M. Case"}, {"rating": 4.0, "review": "An interesting device that still is in the learning mode by me.", "verified": true, "helpfulness": "0/0", "author": "Judy Scammell"}, {"rating": 5.0, "review": "Got rid of my DirecTV and don't miss the big bill every month. Playing games on my big screen is awesome. The only thing Amazon Fire lacks is UFC TV. Please add it to your line up soon!", "verified": true, "helpfulness": "0/0", "author": "Carlos C. \"Sci Fi Dude\""}, {"rating": 5.0, "review": "Really like my Fire TV box.  Makes watching netflix and sling TV a breeze.", "verified": true, "helpfulness": "0/0", "author": "Brian Smith"}]