[{"rating": 5.0, "review": "This is an easy and excellent way to view either TV shows or films and is surprisingly affordable.", "verified": true, "helpfulness": "0/1", "author": "gadfly32"}, {"rating": 3.0, "review": "Why such a high price for an average product?", "verified": true, "helpfulness": "0/1", "author": "Gurjinder Rathore"}, {"rating": 5.0, "review": "Love it!😀", "verified": true, "helpfulness": "0/1", "author": "Beverly"}, {"rating": 5.0, "review": "Our Fire TV was a gift from our son and has been a wonderful addition to our entertainment system.", "verified": true, "helpfulness": "0/1", "author": "joyce hoynacki"}, {"rating": 3.0, "review": "The fire part of the system is everything it is said to be. Major problem I have I signed up for sling TV and still does not work. Have spent lots if time on the phone problem still there", "verified": true, "helpfulness": "0/1", "author": "don edge"}, {"rating": 5.0, "review": "Love it better than Apple tv", "verified": true, "helpfulness": "0/1", "author": "Dallas W Hayes"}, {"rating": 5.0, "review": "Works great with all the Amazon content. Have not gotten to try it with other sources yet. Still have to watch the tutorial and check out all the features.  Sure I will like it even more then.", "verified": true, "helpfulness": "0/1", "author": "John E. Aiken \"JohnA\""}, {"rating": 5.0, "review": "Works GREAT, easy hook up and nice remote, Love it,THANK YOU!!", "verified": true, "helpfulness": "0/1", "author": "Paul"}, {"rating": 4.0, "review": "This little device is amazing.  I love the layout, the simplicity of it, as well as its speed.  Definitely must get the paid app Plex if you like to stream movies from your computer.  I only wish that you could chromecast to it, to fully replace my chromecast.  There are certain website only things I would love to stream to my tv, and this inability means I need to keep one more device, the chromecast.  I love the Fire  TV....", "verified": true, "helpfulness": "0/1", "author": "Jerome Howard"}, {"rating": 5.0, "review": "We love it!!! One time equipment fee then no more cable bills every month!  The only thing we do not like, is that you can not turn the volume up or down with the remote, (unless it is a option that we are not seeing)", "verified": true, "helpfulness": "0/1", "author": "dale beston"}]