[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 4.0, "review": "I am pretty happy with the player - I am taking a start off - because I think (my opinion here) it should be a more open Android box - it's great that it's working excellent with Amazon Prime (YEAH BUFFERING), great that they have ported many Android games to the device to work better w/ your HDTV - BUT it should be as open and have as many selections available as an Android phone and tablets do.  IF I wanted single source apps and a highly polished user interface - idiot proof operations - I would have bought an Apple device.  I know I can root it and get there - and I am side loading apps (XBMC Showbox) - but it shouldn't have to be an effort!", "verified": true, "helpfulness": "0/0", "author": "Stuart Klaus"}, {"rating": 4.0, "review": "I got this to try prime.  I did not see anything I would like to keep prime, but this is a great device to watch the shows I have bought from Amazon.  It is good to have even if you do not have Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Harold Pont \"Science Fiction lover.  Love JRR Tolkien for years, but other than that I have stuck to the Science Fiction genre.   I love to hear yours.\""}, {"rating": 1.0, "review": "WARNING: Amazon Fire TV instant video not work outside of USA. The GEO IP is detected and can't watch any movie.", "verified": true, "helpfulness": "0/2", "author": "Rod.Cab"}, {"rating": 5.0, "review": "The fire tv is great. It is always fast streaming. No buffering what so ever", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Love it works great complements my Romulus wonderfully. Kids love it as well", "verified": true, "helpfulness": "0/0", "author": "Charlie Aponte"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Glenn T. Paldan"}, {"rating": 5.0, "review": "Totally thrilled - love all the features, and it works perfectly with my TV, too!!!", "verified": true, "helpfulness": "0/0", "author": "Little Tank \"LT\""}, {"rating": 5.0, "review": "Husband loves it, the voice control, even understands me, where other voice command controls do not. very fast and smooth navigation and fast viewing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The AFT has exceeded my expectations. I've been using ATV2 for a few years, the performance of the AFT is very impressive. I also like the fact that I can mount the unit behind my TV as the remote is BlueTooth and doesn't need line of site.", "verified": true, "helpfulness": "0/0", "author": "Carmine"}]