[{"rating": 5.0, "review": "I like the fact that the Fire TV powers down automatically when not in use and it sincs with our surround sound.  So far I have enjoyed the voice search rather than needing to hunt and peck letters with a remote.", "verified": true, "helpfulness": "1/1", "author": "ann76550"}, {"rating": 3.0, "review": "Remote quit working after a month.  Amazon won't replace just the remote and I will need to send the whole thing back.", "verified": true, "helpfulness": "1/1", "author": "Steve Barrett"}, {"rating": 2.0, "review": "Outside US it just a black box with additional wires.Most of the applications (youtube, internet browser and etc.) and prime movie staff does not work.I guess i will go for another one.", "verified": true, "helpfulness": "0/0", "author": "Islam"}, {"rating": 3.0, "review": "Would be much better if it came with more instructions as to how it works.  The installwas simple.", "verified": true, "helpfulness": "1/1", "author": "KAREN S BENEFIELD"}, {"rating": 1.0, "review": "Internet speed available in mt area not enough to get good video stops every few seconds.", "verified": true, "helpfulness": "1/2", "author": "Patricia Porter"}, {"rating": 5.0, "review": "Works exactly as advertised. I have Prime, so most movies are free except for new releases. I had Netflix prior to this, but am going to close my Netflix account! Extremely easy set up - is already registered if you are purchasing for yourself. Automatically finds your wireless network, all you have to do is enter the pass code. With the voice remote, even my non-tech savvy hubby can find a movie!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I installed this, connected it to WiFi, beheld the range of Prime offerings, and rejoiced. The next day --nothing.So I downloaded a Kindle book and skimmed it. Then life interrupted.That's the way it goes for me sometimes.", "verified": true, "helpfulness": "1/1", "author": "St. Leigh in Summer \"Be kind\""}, {"rating": 5.0, "review": "Love this little magical box that delivers all of my TV apps!  So perfect and the price was pretty great, too!!!", "verified": true, "helpfulness": "0/0", "author": "C3SD"}, {"rating": 5.0, "review": "Great value and seller was on time with delivery.", "verified": true, "helpfulness": "0/0", "author": "Nikki"}, {"rating": 5.0, "review": "Nice! I like it!", "verified": true, "helpfulness": "0/0", "author": "JERRY A LEWIS JR"}]