[{"rating": 5.0, "review": "great product.  not as good as i imagined. my gbox mx2 is better i think. but this is good for amazon videos and netflix and stuff like that.  though the tv i bought (the reason i got this cheaper) does the exact same thing as this box.  its alright though i love gadgets though.  i want to try and install xbmc onto this maybe to replace the gbox mx2 to put it in another room", "verified": true, "helpfulness": "0/0", "author": "D7S"}, {"rating": 5.0, "review": "Thanks Amazon TV for giving us an alternative to DISH!", "verified": true, "helpfulness": "1/1", "author": "Mike Kent"}, {"rating": 5.0, "review": "Excellent interface with minimal buttons on the remote. Chromcast is only a 2 star in my opinion compared to this. Waiting for the new stick for the other TV. Dish TV is Gone!", "verified": true, "helpfulness": "0/0", "author": "polobrit"}, {"rating": 1.0, "review": "It works fine BUT will not alow me to watch films even though I am a Prime member....I can only watch movies that I pay for. It also affects Netflix viewing. The \"Amazon Fire\" keeps thinking that I am in another country!!", "verified": true, "helpfulness": "0/5", "author": "Ralph D. Chiocco"}, {"rating": 2.0, "review": "Most of the things you can watch for free are not that good. Everything we want to watch you have to pay for. Netflix is a much better deal. We do like the voice search feature.", "verified": true, "helpfulness": "0/0", "author": "Harley Rider"}, {"rating": 5.0, "review": "I'm giving it 5 stars because it's been a major upgrade for our family. My only complaint is that it's not compatible with the Vudu Player app (yet?).", "verified": true, "helpfulness": "0/0", "author": "Jennifer Ceponis"}, {"rating": 5.0, "review": "Does exactly what i wanted. I liked it so much i bought another for the upstairs tv.", "verified": true, "helpfulness": "0/1", "author": "Chris Russell"}, {"rating": 5.0, "review": "Ok with me.", "verified": true, "helpfulness": "0/0", "author": "BANH HUYNH"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Clark"}, {"rating": 5.0, "review": "The machine is very fast and does a lot more than I expected. The only thing is I wish it did more for music.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}]