[{"rating": 5.0, "review": "When Amazon announced Kindle Fire TV, I was intrigued. I have been Amazon prime member for couple years now and I have always been impressed with their customer service. The first big investment I made in Amazon ecosystem was in Kindle Fire HDX 8.9 inch tablet. So when Kindle TV was announced with mirroring I was curious to try.With that said, let me jump to the review :Packaging:It was simple and neat. Easy to open. They package AAA batteries to use with the remote. No HDMI cables though. I had couple of spare ones, so it doesn't really matterDesign :It is a shiny small black box. Considering it is going to be stacked into media cabinet, I don't think this matters much for me. The remote is nice and handy.Bootup:I connected power, HDMI and ethernet cables. Right away it starts with system update and takes around 5 minutes to get all the updates done along with 2 reboots. Nothing interesting here. After that, there is a demo video talking about the device for 2 minutes. Pretty informative but I was anxious to get to the home screen. No way to skip the demo that I could find. A small annoyance, but a lot of customers will appreciate the demo.First Use and Apps:The device was already associated with my amazon account (like every other Amazon device which ships to customer). I fired up some prime instant videos, they stream right away. Interface is fast and fluid. The device doesn't come with any app installed. So had to install Pandora and Netflix. Netflix is slightly older interface but it works fine for me. I use Apple TV typically for Netflix, so this is more or less the same. I tried Pandora, Vevo. Work as expected. I kind of like the onscreen keyboard. all the keys in the remote are usable making it slightly faster to type and accept (like menu key, back , forward are all usable in the remote). I would love an option where I can buy the app in Amazon store with login details so it is synced to Kindle Fire TV. Well no device has this option, but hopefully somebody will do it in the future. I have DirecTV and hence I don't need HBO GO. I hope to see that soon on device.Video Streaming:It works as expected, it is fast fluid, no frame drops or voice sync issues. One of the best subtitles/closed captioning I have seen is on Kindle HDX , You can alter the font size,colour, background while watching the video. I am happy that Amazon use the same options in Fire TV as well. It may not be a great feature but I like it. Sometimes I need subtitles but not some yellow huge size text blocking most of the screen.Speed:This device is real fast, I have an Apple TV but this one is noticeably faster than Apple TV. It has good set of apps at launch and the apps launch pretty fast too. So complaints in performance so far.Voice Search:It works. I had multiple attempts and it seem to detect my voice easily. I am impressed considering I have a strong accent and it still works. I am looking forward where Netflix or Pandora update their apps to do voice search. This is a great first step for Amazon. I hope they can extend the voice search to do settings and so on. I like the integration of Hulu Plus into the search results.Mirroring:This took a lot of time to setup. The HDX would search but when I connect to Fire TV, nothing would happen. I tried moving the Fire TV to wireless instead of wired. Still the same issue. Eventually, I rebooted both devices and it started working properly. I streamed few episodes of Psych mirrored to Fire TV. No dropped frames and it was super fluid. Earlier I had a Belkin Miracast (for mirroring) but there was issues with frame drops and stutters. In this case, HDX worked flawlessly on Fire TV. I use iPad with Apple TV with mirroring, and compared to that, HDX on Fire TV was equal if not better than iPad /Apple TV.Gaming and Multitasking : I have not got chance to use these yet, will update my review once I get there.I don't own Roku or XBOX so I cant compare Fire TV with either.From my perspective, I found these are real good points on Fire TV so far.Great device for media streaming.Major apps are already present.Fast and Fluid interface. It is simple and intuitive.Easy setup.One issue I noted so far was that Mirroring took sometime to get going, but after that it was flawless.Should you buy it ? If you have Kindle HDX and don't have a Roku or Apple TV and want a new media device. I would recommend this one easily.If you are prime and netflix/hulu plus user, then it is a great buy. It is not a revolutionary product but a well made product.Wishlist :Universal Voice search for all appsSearch should return movies not just in Hulu Plus , Amazon Instant and Vevo but in youtube or Netflix. So people should only be bother about what they want to watch, not from which service they watch. That would be a remarkable achievement. I believe Amazon has taken a good first step with Hulu Plus integration, I hope to see all services integrated.", "verified": true, "helpfulness": "15/15", "author": "Prabhu K \"PK\""}, {"rating": 5.0, "review": "I just received the Amazon Fire TV and love it so far.  Of course, it is competing with the Roku and those sorts of products.  My Roku box is very outdated as it was one of the first to come out and was thinking of ordering a new one when the Amazon Fire TV showed up online.  First, the fact that the remote has a voice command to easily look up titles, etc. is amazing.  It works really well and then it starts to learn your preferences based on searches.  No more crappy keyboard scrolling!  Also, the layout of the menu and the options is very slick and clean.  Not to mention, the remote is easy to use and everything flows on the screen nicely when you're trying to navigate.  I also noticed that I don't seem to have as many issues with buffering during internet video viewing.  It loads what you're watching really quickly.  I ordered a second one for my son to include the game controller since he is an avid gamer.  I am not certain how that side of the system will work since I don't game but I'm sure he'll let me know so I can post a review on that.  Very", "verified": true, "helpfulness": "3/3", "author": "M. Hays"}, {"rating": 5.0, "review": "So far, my wife and I LOVE this!  Fast streaming, great content.  Portability is a plus!  Looking forward to brining this on trips, so we have it to use in hotels.  Waiting for more apps!  WWE Network, please!!!", "verified": true, "helpfulness": "2/2", "author": "J Jacobs"}, {"rating": 5.0, "review": "I have the PS3 and X-box. I purchased this for the family room and glad I did. The optical works great through my Onkyo receiver while playing Pandora and Sev Zero. I just plugged my X-box controller in the USB and worked flawlessly!!!  The game Asphalt works great too. The remote is not very good with games.", "verified": true, "helpfulness": "3/3", "author": "MICHAEL B."}, {"rating": 3.0, "review": "This is a neutral three star simply because I'm comparing devices and expressing an opinion.A few weeks ago I bought a Sony BluRay player (from Amazon) so that I could stream Amazon Prime and YouTube along with the ubiquitous NetFlix. Had FireTV been around (or pointed out to me) I would have considered it, but frankly, the BluRay player does more. It's also wireless, it is programmed with software for picking up various streaming video serivces, it has memory, etc. But it cost $89 and it plays many kinds of discs.The software is what seems to make these devices obsolete before the hardware fails, and at least with the BluRay player it will work for that use after the software stops firing (like my 4-year old Samsung BluRay player. The device works, but the software is now kaput).", "verified": false, "helpfulness": "2/15", "author": "A Close Reader"}, {"rating": 5.0, "review": "My husband bought this and, after using it all weekend, it's clear that it is going to be our new way to stream everything.  We already have an Apple TV, which we like very much, but the Amazon Fire TV is an improvement even to that.  It's incredibly fast, the voice search function works great, it's easy/pleasant to use and even the games add a nice bonus.  Simply put, we love it.", "verified": false, "helpfulness": "6/6", "author": "JAK"}, {"rating": 5.0, "review": "Easy set up. The video and audio is amazing. This is my first streaming box (other than my PC) and it freed my PC from the TV, which is nice. I haven't purchased the controller, so I haven't played the games, yet. Netflix works amazing, though. Other reviews have stated that they might go to the new Netflix format and I hope they don't. I really like the Netflix format on the Fire TV.I'll update this post as I have more information.", "verified": true, "helpfulness": "4/4", "author": "Kinshasa \"Kinshasa\""}, {"rating": 4.0, "review": "I saw a review that mentioned the product had issues with plex, I have had zero issues with plex. I use mp4 format and use a converting software to make sure nearly all my files are this format. I've had a roku since they came out and own the roku3. I'm use to those control so there are a few control features that will take some time to adjust to, otherwise this product is great. Video's buffer quickly and haven't gotten hung yet and the box hasn't rebooted like the roku does from time to time. My single compliant which I'm sure will be addressed is connecting to wireless. I have a new'ish 802.11AC standard router and as everyone knows it uses 2.4 and 5Ghz. I have 4 other devices on the router regularly, one of them being a laptop with an AC card that I installed and I see connection speeds of 600Mbps and higher. After trying to connect several times and failing I called support and I've been suggested to remove other devices and just connect the fire alone...........guess to address possible interference or availably to the router. I plan on doing this today and I'll update this post again in the further. If you can keep you mind open and not compare it to previous set-top solutions I think most will be happy with the product.", "verified": true, "helpfulness": "1/1", "author": "Josh"}, {"rating": 5.0, "review": "Very Fast, Great investment. The menu is very easy to navigate and it supports Plex. The video preloading is also very slick. Makes it seem even faster.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works Great!!one two three four five six seven eight nine ten eleven twelve thirteen to fulfill required number of words.", "verified": true, "helpfulness": "1/9", "author": "Amazon Customer"}]