[{"rating": 4.0, "review": "I have only had my Fire TV for a few days now but have been thoroughly impressed with the speed and performance of this device.  It is 100 times faster than a Sony Wi-Fi BlueRay Player that it is replacing, and the fact that it has Watch ESPN allows me to cancel my cable subscription.  Coupled with Hulu and Netflix, it basically serves as a DVR box for me to watch shows the next day.  The Amazon Video Library is vast and should come as no surprise to you if you are considering getting it.  It's the same library you get everywhere else.All the apps work great and as they should.  I really enjoy the Vevo app, although they should consider improving it.  they being Vevo, so there's nothing Amazon or the Fire TV can do about that.The voice search is cute, but probably something that I'll use maybe 1 out of every 10 times I'm using this device.  If you are looking for something on Amazon Prime its very helpful, however it is not compatible with other apps such as Hulu or Netflix which is what I watch the majority of the time.  I would like this feature to the Mayday button on a Kindle.  It was cool using it when I took it out of the box and while I was still in the honeymoon stage with my Kindle Fire HDX, but I don't think I have used it since.  One of these deals that its neat to show people and a topic of conversation during parties, but not something I use regularly.There are features I wish this device had that would make it really something special, such as a headphone jack on the remote, Amazon music (which I hear is coming), feet on the bottom of the box (it has a rubber-type bottom to prevent sliding but I would recommend using feet instead),  and maybe a \"skip\" button on the remote.  Other than that, it's well worth the investment if you stream a lot.The only thing preventing me from giving this product 5 stars is the fact that it does not have a power button.  You can not turn it off.  After sitting idle for X amount of time it will hibernate, but without pulling the power cord there is no way to power-off the Fire TV.  I'm sure Amazon has a good reason for not having a power button on this, but for the life of me I can't think of one.  If you are like me, it just feels weird not turning something off when you are done with it.  I'm sure we're talking about maybe 7 cents on the dollar, but it would have been nice to power-down the Fire TV before I went to sleep.Overall a great buy.  Would defiantly recommend this to anyone looking for a streaming device.  If you are not a Prime customer you probably wouldn't waste your time looking at an Amazon product, so I'm assuming you are.  Well worth the $100.", "verified": true, "helpfulness": "2/2", "author": "Jon Randle"}, {"rating": 3.0, "review": "While I am always a fan of Amazon, the Fire TV is not quite where it needs to be yet. Of course it is just getting started, but it is seriously lacking on the applications available. Also, the voice search only works to search on IMDB so if you don't have Amazon Prime or Hulu it's not very beneficial. I bought my parents a Roku about two years ago, and they have really enjoyed it. At this rate I'm not really sure there could ever be much a difference between the two if you are just using it to watch movies, tv and listen to music. I am not much of a gamer so I haven't purchased the game controller yet, so I'm sure if you are a gamer it may alter how you feel about it. I went ahead and purchased it, because I'm sure down the road the price will increase.", "verified": true, "helpfulness": "0/0", "author": "ag1234"}, {"rating": 5.0, "review": "This is so cool and you can talk in it  loveitt I have kindle I would have this on all tvs.  This is for fire tv", "verified": true, "helpfulness": "0/1", "author": "Colleen Wroblewski"}, {"rating": 4.0, "review": "This device is easy to use and functions as stated. Channels are limited but I'm sure that Amazon is in the process of adding more channels. High priority for me is PBS.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Haven't used it a whole lot but the speed is fast and the picture quality is really good.  Seems to work faster than the Apple TV I have.", "verified": true, "helpfulness": "0/1", "author": "Cindy Tice"}, {"rating": 5.0, "review": "I have played with my SONY Blu-ray players to obtain satisfactory video streaming from the Amazon video store for the past year. I could never steam Amazon through the players without real problems in buffering/lags.  My existing flat screen TVs are all in good shape so I don't want to spend the bucks to get a Smart TV to get the WIFI internet access.  As a note I have been able to stream anything from Amazon through my Kindle tablets and iPhone devices without the buffering issues, and have very adequate bandwidth on my broadband connection.  I looked to the Amazon Fire device as a possible solution for my TVs and sprang for the 99 bucks.  The Fire TV device has  delivered!  No buffering or lags in watching videos every night for 2 months.  Picture is excellent.  I like the screen displays and screen savers included.  Searching for video content is easy and the method it uses in displaying where you are in watching movies and TV series is very useful.  If it has a negative it would be the rate the remote uses up batteries.", "verified": true, "helpfulness": "1/1", "author": "Doc Helms \"dochelms\""}, {"rating": 5.0, "review": "what a great product! best in this line going. but you have me hooked on it movie/s are better on amazon fire box best yet! cant beat this one use more then p.c. better quality pictures and .course it dose a lot more .believe me .this a must try.", "verified": true, "helpfulness": "0/0", "author": "john mager"}, {"rating": 5.0, "review": "Excellent product! Bought this because we are in an RV Resort with public wifi so we cannot use our Tivo, and the cable they offer is just the basic channels, no premium channels. Cable company will not upgrade jn the park because RV'ers in the past have just left and taken the cable companies DVR with them. Amazon Fire TV allows us to get Netflix. Hulu. and with our Amazon Prime membership also has a ton of movies we can watch included! Very pleased with our purchase, and was VERY simple to set up, just plug and play.", "verified": true, "helpfulness": "0/0", "author": "Douglas Cutting"}, {"rating": 4.0, "review": "Only 1 problem, I wish there was a 'Free Movie' section. I hate selecting a movie that is 20 years old and discover that will cost me $3.99 to watch it.", "verified": true, "helpfulness": "0/1", "author": "James G. Schleis"}, {"rating": 4.0, "review": "Will eventually be better than roku  when interface is improved and HBO GO is added these or my only gripes ,this little box has a lot more potential than roku I believe after it has been up and running for a while", "verified": true, "helpfulness": "0/0", "author": "bill"}]