[{"rating": 5.0, "review": "We set it up with a projector and speaker for a cabin projecting against a wall.  Such fun for the children really enjoy having the ability to do movie night to wherever we can get wifi signal.  The content is excellent something for everyone makes prime a bargain", "verified": true, "helpfulness": "0/0", "author": "AR"}, {"rating": 5.0, "review": "Very cool.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Merkel"}, {"rating": 2.0, "review": "I avoid using fire TV & select from other services eg.netflix because what is included in my membership is not clearly & distinctly separated from the entertainment which I will be billed for.While I do enjoy the voice activated system,the time scanning for extra charges takes the fun out of it & can see myself shopping for a different system when my one year contract is nearing term.Thank You MICKEY", "verified": true, "helpfulness": "2/3", "author": "michael moran"}, {"rating": 5.0, "review": "no complaints, works perfectly, original packaging and looked just new!", "verified": true, "helpfulness": "0/0", "author": "BILAL SHAFIQ"}, {"rating": 5.0, "review": "What would we do without it.  The options, the options, the options.  Each person in the family can find what they want.  From fireside music at Christmas time, to animations the entire family enjoys, documentaries, our own photos and videos, classic TV, a thousand choices at any minute.Thank You Amazon - this was not why I subscribed to Amazon Prime - but it is WHY we are renewing!!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Best decision I ever made. Amazon has hit the mark with Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Corey M."}, {"rating": 5.0, "review": "A great gift!!!", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 3.0, "review": "FireTV works pretty great. But I wanted to use it with a 1080i TV, I'm a little sad the resolution isn't supported.", "verified": true, "helpfulness": "0/0", "author": "Ben S"}, {"rating": 5.0, "review": "Great device, just getting to know it but so far better than Apple.", "verified": true, "helpfulness": "0/0", "author": "HECTOR"}, {"rating": 5.0, "review": "Enjoy the ease at which it can connect to all the movies and TV programs.  It has brought many hours of entertainment. Wonderful selection of videos and TV programs.  Especially the PBS Seasons to view. Amazon Fire TV is a real winner!!!", "verified": true, "helpfulness": "0/0", "author": "Rojean"}]