[{"rating": 5.0, "review": "Love the fire tv. It has great response speed and streams great. I also have a fire tv stick, but the fire tv box is much better. Great job amazon. Recommended", "verified": true, "helpfulness": "0/0", "author": "GEM1N1"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Denni Thomas"}, {"rating": 5.0, "review": "I purchased the fire stick back and im very happy with it only one thing im.having a hard time putting it through my 5.1 surround sound system.", "verified": false, "helpfulness": "0/0", "author": "stephen c prokop"}, {"rating": 5.0, "review": "The speed and variety simply trump the Apple TV.  Outstanding product.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "My husband and I had cancelled our satellite TV. and were using Netflix which we really enjoy, but wanted to be able to stream movies and TV shows. After calling and speaking with an Amazon representative we decided to try the Amazon Fire and we are very pleased with it.  The costumer service that Amazon has always given us goes above and beyond any customer service I have had in the past.  I will highly recommend Amazon Fire to family and friends.", "verified": true, "helpfulness": "0/0", "author": "LCR \"LCR\""}, {"rating": 5.0, "review": "Great with xbmc", "verified": true, "helpfulness": "0/0", "author": "jacrespo"}, {"rating": 4.0, "review": "Love it!!  easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Nancy J. Norman"}, {"rating": 4.0, "review": "had to return the first one, but amazon never lets me down. Customer service is above all else and got me a new one the next day", "verified": true, "helpfulness": "0/1", "author": "bladerunner619"}, {"rating": 5.0, "review": "i likeed", "verified": true, "helpfulness": "0/0", "author": "Reynaldo contreras"}, {"rating": 5.0, "review": "Love the Berlin Philharmonic.  Looking forward to looking around and choosing from the vast selection", "verified": true, "helpfulness": "0/0", "author": "Sebastian"}]