[{"rating": 5.0, "review": "The Amazon Fire TV is a best way of watching all your internet accounts, Netflix, Hulu, whatever you have. Quality and speed is the best! Searching is a breeze.The only reason I didn't keep it as I was looking for a device to replace my cable company and make me able to watch actual TV w/o the big price for cable. Well, that is not yet an option with this box. Hopefully one day Amazon will be able to provide such service at a fraction of cable company prices. I will be the first to by the device at that point.If you looking for a way to watch your internet accounts, movies on your computers etc. Amazon Fire TV is the best way to go.", "verified": true, "helpfulness": "1/1", "author": "Ivettt B. \"IB\""}, {"rating": 5.0, "review": "Extremely user friendly, so simple to navigate with the remote I'm impressed. The Apps available create an enormous selection of content to view, as well as being so easy to install. Now I just watch the local news on free digital and switch to fire tv for all my shows.  NO cable bill, NO dish bill. Just my I-net connection and my video subscription, I'm saving a bunch of money.", "verified": true, "helpfulness": "0/0", "author": "Richard Lane"}, {"rating": 4.0, "review": "Works great with a good internet speed. We didn't want to contract another cable TV subscription for our vacation place but just buying an internet connection and this box with an Amazon Prime has been adequate. Just wish they would allow access via our WOW cable subscription!", "verified": true, "helpfulness": "1/2", "author": "NANCY"}, {"rating": 4.0, "review": "Hello pants...", "verified": true, "helpfulness": "0/2", "author": "Bradley C. West"}, {"rating": 2.0, "review": "This product has great potential but as of now the only thing it does is try to suck up money.  Everytime I try to search for an item, I can't tell what is free and what requires payment.  I watch primetv from my PS4, PS3 and iPad and have always filtered to see new prime content was available.  So I ordered this for my father and was dissapointed to find this feature was missing. On the FireTV, the only way to view prime content is to create a list in your watch list beforehand on a computer rather than having a filter like every amazon app available.I'm returning this product dissatisfied and hope that people know before they order one that they can get a great service from the existing amazon app on iOS, android and the new gen gaming devices.  Skip this until amazon fixes this issue.", "verified": false, "helpfulness": "3/4", "author": "Jonathan Lee"}, {"rating": 5.0, "review": "I love it, I might get prime back, but now I can watch Netflix down step with my wife.", "verified": true, "helpfulness": "0/0", "author": "Charles L Thompson Jr"}, {"rating": 5.0, "review": "Superior product, works with ease.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got this as a surprise birthday gift. This is wonderful! I am amazed at the clarity of the voice recognition software -- it has not let me down once. All of my subscription apps to premium cable channels work great as well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This unit is pretty cool, but I didn't keep it due to the fact that I have 3 gaming consoles that do everything this does, other than 'prime movie's and voice search. If you don't have a console, or are looking to hook up a streaming tv box to another tv, this would be good...even better if you're a prime member.", "verified": true, "helpfulness": "0/0", "author": "jason"}, {"rating": 4.0, "review": "The remote is easy to use, It's was a pretty seamless transition from Roku to the Fire Of course now we spend more time in the amazon portal than others.The interface is very fast and movies load quickly.I do miss he universal search that Roku had - finding movies regardless of what movie service they had. I can see one more downside.The ability to play android games - is already starting to pollute the home screens. I'd be nice if there was a way to have a media profile and a games profile to keep the interface a bit cleaner.", "verified": true, "helpfulness": "1/1", "author": "Mitchell James"}]