[{"rating": 5.0, "review": "Fantastic to have everything in one place on my T.V. My only complaint is that the remote is so small, I keep losing it.", "verified": true, "helpfulness": "0/0", "author": "Lupin"}, {"rating": 1.0, "review": "Why did I waste my money on this?Ok, first off the bad:There is no \"actual\" youtube app. The one you see there is just a website disguised as an app. As such, logging in, registering it as a player, etc. are a pain.Netflix: simply wont work, has never worked. I reset my device to factory, reinstalled netflix. It will always start to stream, play maybe a second, then tell me it cant play this right now. Doesnt matter what I play. I have great internet, hardwired. This shouldnt be an issue.Loading anything else on it that you may want is a pain. gotta root (if you're lucky enough to be able to), and sideload APKs. None of these will show up on the homescreen or anywhere but in the system settings, so that sucks.the voice search button looked useful until I realised it ONLY works for amazon services. It doesnt even work for approved amazon firetv apps like netflix or vimeo or that terrible excuse for a youtube app.I am hoping and praying that some developers port a standard AndroidTV rom to this device, because currently Amazon's hatred for Google, despite them using tons of google to make their systems, is very evident and it ruins the device.", "verified": true, "helpfulness": "1/4", "author": "Ben"}, {"rating": 4.0, "review": "most tv's these days are app friendly out of the box but for a those slightly earlier models, this is a \"should have\".i like it. small console but too little hd space for a variety of apps sideloading. also, a power off feature would have been nice for us energy conscious folks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Plugged it in...watched TV...fell asleep...", "verified": true, "helpfulness": "0/0", "author": "J. Prescott"}, {"rating": 5.0, "review": "This is replacing my Roku, I dislike the navigating it and searching is a pain.The voice search on the Amazon Fire is great and I just ordered a second one.", "verified": true, "helpfulness": "0/0", "author": "$implicity"}, {"rating": 5.0, "review": "Awesome, I love this set...of course works great with Amazon Prime, but ya don't have to...lots of memory and space.  Even a spot for external drive!", "verified": true, "helpfulness": "0/0", "author": "Karl P. \"Bunko Paniczny\""}, {"rating": 5.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "L. Lovelace \"Homemaker\""}, {"rating": 1.0, "review": "Bought it, hate it, can't wait to get the Roku...Free content for Amazon Prime members - maybe it is there, but they don't want you to find it easily.Apps - still trying to activate pbs kids video. Gave up after 45 minutes of failed attempts.You tube- or fire tube as they call it. Not the same :(Really disappointed with my initial experience with a device like this.Never heard any complaints from friends with the Roku. Certainly hope they aren't holding back!", "verified": true, "helpfulness": "1/3", "author": "Helena Photiades"}, {"rating": 5.0, "review": "Great!!!!", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 4.0, "review": "I am torn on this. I kinda like it. I tried getting plex to work on it and it was weak at best. I got this to have a media machine in the bedroom without having to put a computer in there. I thought it would be nice to have a replacement for XBMC. Plex just can not compete. With that being said I am in the process of installing the XBMC app on there and configuring it.I did notice it does have problems with constantly have to re queue large files. Not cool to be watching a movie and have it pause to re queue the movie. LOL.", "verified": true, "helpfulness": "0/0", "author": "Rob Corcoran"}]