[{"rating": 2.0, "review": "Purchased this device Friday, received Saturday. Was not able to install; my Sony TV does not have HDMI. Received the following response from Amazon (notice that you have to get to the help section, ie after you have purchased, that it is pointed out you need HDMI):This is KC with the Amazon Fire TV Department writing you back regarding our conversation earlier about connecting the Fire TV to your TV without an HDMI input by using a Composite converter.After checking with some of the leadership on our side to see if it was possible and they confirmed it has to be a direct HDMI connection, converters are not supported.I was also able to find some information on our Help pages that supports this as well. On the Help pages for Fire TV, in the Get Started section, it does mention that it needs an HDMI connection:\"-High-definition TV (not included)Amazon Fire TV is compatible with high-definition TVs with HDMI.-HDMI cable (not included)Use the HDMI cable to connect Amazon Fire TV to your high-definition TV. Amazon Fire TV supports HDMI A Male to A Male cables.\"http://www.amazon.com/gp/help/customer/display.html?nodeId=201452790I'm sorry that this is the case and that the Composite converter will not work with the Fire TV. Feel free to contact us back with any other questions that you may have.You can click the \"Contact Us\" button on any Help page (www.amazon.com/help), enter your phone number through the Phone tab, and we'll call you. Contacting us through the website ensures that we have your account information ready when we call.If you can't access this feature, here are our customer service phone numbers:- U.S. and Canada: 1-866-216-1072- International: 1-206-266-2992We're available 24 hours a day, 7 days a week.Thank you for choosing Amazon.Best regards,KC", "verified": true, "helpfulness": "5/27", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I was looking at Amazon Fire TV and considering it, but watching that silly commercial and the negative reviews helped me decide against trying it at all, at least for now.  I really don't understand why they thought that commercial was a good selling aid, it seemed so pointless and irritating it's a huge negative.  .", "verified": false, "helpfulness": "3/34", "author": "taxt"}, {"rating": 5.0, "review": "Amazon hit another home run with Fire TV.  Yes, it has a feature set similar to Apple TV.  The hardware, however, is far beyond that offered by Apple (I own Apple TV too).  What really sets it apart, however, is Prime Instant Video.  The availability of movies and TV shows available to Prime members is incredible.  Fire TV loads and plays content immediately.  The video component is absolutely stunning.  Audio is  fantastic, too.  The voice search feature is amazingly accurate (and fun).  Highly recommended!", "verified": true, "helpfulness": "4/4", "author": "Chris"}, {"rating": 1.0, "review": "What good is a TV box if I can't browse on the internet to find what I want to watch on my TV? Yes, there is a sort of TV app, but it's linked to apps that 1, only work in certain countries, 2, want you to pay for the privilege of watching anything but basic stuff and 3, are very limited to what you can watch for free. I want to watch using a programme that lets me watch English TV, you know, BBC, ITV, Channel 4 and this is not possible with this box. A programme which lets you do this is Film On, which lets you watch just about everything that is sent out by almost every worldwide TV station. This will not allow you to do this. Almost every box like this lets you link to your PC or Tablet/phone or whatever and watch any films you may have on them, including photo's. This box is hardly any different to all the others out there, and there are loads, some a lot cheaper. Why cannot manufactures just put a browser, like Chrome into their box? I could Skype with the kids then, full size, or read my emails on my TV. or watch British TV. Come on Amazon, lets have a box with a browser. This sucks!", "verified": false, "helpfulness": "12/52", "author": "William J Ford"}, {"rating": 1.0, "review": "Well, Fire TV it might be good, but the remote will not open to insert the batteries, so I don't know yet.", "verified": true, "helpfulness": "4/47", "author": "Charles A. Butcher"}, {"rating": 5.0, "review": "I think that this product is exactly the same as Apple TV, but very different. You should get it! :)", "verified": false, "helpfulness": "0/9", "author": "Giana P."}, {"rating": 5.0, "review": "A full 2/3's of 1 star reviews (currently 118) have no verified purchase1/2 of 2 star reviews (currently 83) have no verified purchase1/2 of 3 star reviews (currently 117)) have no verified purchase1/5 of 4 star reviews (currently 122) have no verified purchase1/8 of 5 star reviews (currently 310) have no verified purchaseRemoving verified buyers that stated a lower rating due to a software issue (i.e. no HBOGo, screen layout) which will, I am sure will be remedied in an upcoming update. This product is looking more like a hit than a miss.This obviously is an unscientific analysis but it's good enough for me! I'll update my review and adjust my stars if necessary,  after I receive my unit and have a week or so to play!", "verified": true, "helpfulness": "19/22", "author": "Al Mayo \"seahawks12\""}, {"rating": 5.0, "review": "I stopped my cable because it was a waste of money. When I was ready to watch TV I couldn't find anything I wanted to watch. I have been using Chromecast to watch Netflix and Aereo for local channels on my tablet or laptop. When I heard about  Fire Tv I ordered it immediately. it was worth every penny. It was easier than easy to set up, I have access to Amazon Prime which I love and i can rent movies when i want to. And the remote is genius. The voice command works perfectly every time. I also love the idea of the remote instead of my tablet or phone. And the sound and picture quality are better. Now all I need Amazon is Aereo or the equivalent for local channels. Good job Amazon, I wouldn't expect anything less!", "verified": true, "helpfulness": "6/6", "author": "Karla Coleman"}, {"rating": 5.0, "review": "This is the fastest, easiest media player on the planet. I've owned or used all of them, including the latest model Roku and Apple TV units, and both my Sony TV and my Blu-Ray player have built-in media players. This one blows them all away in terms of ease of use (love that voice search), performance (click a title and it plays immediately), and ease of setup.I won't comment on the games feature, since i'm not much of a gamer.Like many reviewers, I'd like to have HBO GO, but it's not a dealbreaker for me.Some of the other reviews for this product (mostly written by people who don't actually own the product) make me think that mankind is doomed.Update, six weeks later: This is the best $100 I've ever spent on TV stuff. I've watched dozens of movies and TV episodes, and it has not stalled, paused, or buffered even once.", "verified": true, "helpfulness": "9/9", "author": "L. Freed"}, {"rating": 2.0, "review": "No Blaze TV?  35 Million viewers and you didn't think in necessary to add access to the channel?  I'll be returning mine to Amazon.", "verified": true, "helpfulness": "7/27", "author": "T. M. Miller"}]