[{"rating": 5.0, "review": "I considered Roku, Google Chromecast and Amazon Fire Tv before i bought anything. After buying this, I loved it. The only thing I would change is having WWE Network available on here.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It didn't meet my expectations because I cannot access anything due to the fact that I'm living in Jamaica. Even though I activated my free month of Amazon prime, I'm am still unable to watch anything because a message pops up on the screen stating that the content is inaccessible due to my geographical location. I am very displeased with this product . I believe that you should make persons aware of these restrictions during advertising of the product.", "verified": true, "helpfulness": "1/7", "author": "kemar burey"}, {"rating": 1.0, "review": "I bought this and i took it to Kuwait, it seems that it doesn't work with Kuwait IP, Apple TV works everywhere!!i will check if the Geographical issue will be solved or not,", "verified": true, "helpfulness": "1/10", "author": "Meshari"}, {"rating": 5.0, "review": "The Fire TV has so many potentials and it's worth the money. I have owned Roku, Gbox MX2, Raspberry Pi...and this Fire TV is by far the best. It blew other boxes, trust me.The voice command works great, I gotta admit that I got a foreign accent but the box understood me 95% of time, much better than my android phone (:I was able to install XBMC Gotham, it works amazingly fast. The output resolution is 1080p in XBMC, which is perfect!If you are not a heavy gamer like me and the box is great for family or occasional gaming, I used the USB hub to plug 2 XBox controllers in and was able to play multiplayers.You could also sideload several android apps into the box such as Spotify and HBO Go. Virtually any android apps could be installed into the box but the orientation will be horizontal, which makes some apps become useless.There are a few things that I hope would be improved in the future:- Hopefully amazon will allow showing sideloaded app to be displayed on the home screen (instead of under Setting)- The mouse pointer is ridiculously big (??), wish it's a little bit smaller- More natively supported apps.- More USB ports for multiplayer game- I havent researched if the storage can be expanded through USB port, I think the internal storage capicity is a little small. I downloaded 2 games Walking Dead and Racing Cars and they took over 2GB of storage and there was only about 4Gb left.- (Skype calling possibility?)- Hope the Plex app fee will be included in the Plexpass like they did with the roku and apple tv.----------------------------------------Overall the box is well worth the money, the Roku 1 I had doesnt support variety of video file formats which annoyed me A LOT when using plex. The Gbox MX2 technically can do anything a tablet can do but there are still compatibility issues with apps (The XBMC works fine on this box but the video resolution is currently decoded to 720p). The raspberry is a cheap media player solution but can be quite slow sometimes for XBMC.Amazon made a great move when not declaring that the Fire TV can be installed with all Android apps (the case that Gbox MX2 is), and gradually makes android apps become 'more' native to its own media player.Hope my review helps.", "verified": true, "helpfulness": "2/2", "author": "Dalton D."}, {"rating": 5.0, "review": "My wife thoroughly enjoys her fire TV. She Especially the voice recognition. Good program selection works well with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have tried several set top boxes (Roku, Apple TV, Google TV, PS3, and Chromecast) this is the first one that I feel has met all my needs. It is responsive easy to setup and has fantastic integration with Amazon Prime (naturally). The only think that has stopped it from being a five star device is the Netflix app (frequent crashes) and a lack of apps.", "verified": true, "helpfulness": "0/0", "author": "Shaun A. Maxson"}, {"rating": 5.0, "review": "Best money I have spent in a long time, especially if you have Wifi and are already an Amazon Prime subscriber!Intuitive, and easy to use, and I am not a youngster.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ZTate\""}, {"rating": 4.0, "review": "The Amazon Fire TV is a great streaming device, and adds considerable value to my Prime subscription. I addition to the Fire TV, I also own an Apple TV (newest model) and a Chromecast. I find the Fire TV to be the best performing device of the three. I don't know if that's because of the Quad core processor inside, or because Amazon has bigger pipes for streaming content to their customers. But this makes a big difference to me, because my Internet connection is very slow (by 2014 standards). I have on occasion gotten a message stating that my connection speed is slow and that it will affect the performance of my video playback. They recommend a connection speed of 880 KB or higher, which apparently I'm not getting. And yet this device buffers less than any other device I own. This leads me to my single greatest feature request for the Fire TV. I would love to see a second generation device that has 16, 32 or 64 GB of internal storage, and a Fire TV that allows Prime members to download and cache content ahead of actual viewing. The Kindle Fire HDX models have this feature. That way I could flag a few shows that I would be interested in viewing in the evening, and download could begin in the morning before leaving for work, or could be started late at night when Internet traffic is less congested. That feature would warrant a five star rating in my review. But still, it's a great device, adds considerable value and is well worth the 99 dollar price tag.", "verified": true, "helpfulness": "1/1", "author": "Chris H."}, {"rating": 5.0, "review": "I give this a 5 star rating because it is a reliable and excellent product that is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lonnie M. Robisheaux"}, {"rating": 3.0, "review": "I will begin by saying, I truly enjoy Amazon's products.  I rarely go anywhere without my Kindle Paperwhite, and while I don't use it too much, I love the functionality and convenience of the Kindle Fire.  While there are other tablets that probably do more, the Fire does exactly what I want and need it to do, and for that I am very happy.So now Amazon has entered the market of streaming devices for your TV.  Is the Fire TV a welcome addition?Yes!...and no.The Fire TV excels in a few areas, but unfortunately falls flat in more areas than it really should.  Bear in mind a lot of my comparisons are going to be based off the Roku 3, as that is the device I am familiar with.First the good things;Speed- For Amazon specific services(amazon video) the device is very fast, loading movies as fast as instantly, the slowest being 2-3 seconds at most.  Loading speeds for other services like netflix or hulu still take a couple of seconds, but it does seem quicker than roku.  Although I will say the speed difference is marginal, I would give Fire TV the slight edge.Voice search- A nice feature(also for Amazon products mostly) that has little trouble hearing what you have said.  I have tried movie titles and actors and there have been very few times that Fire TV didn't understand.  Movies/shows/documentaries in a different language is about the only way to trip this feature up from what I have tested.  A fast and convenient feature.Ease of use- It's a breeze to set up, and if you are already purchased or viewed programs on your fire(or your pc) it will be preloaded and ready on your Fire TV.  It takes longer to watch the intro video than it does to set up the device.The \"so-so\" features;Only a modest selection of apps-  I know a lot of people have fussed about the Fire TV not having HBO Go, but there are also several other channels that are absent at this time.  Fox, CBS NEWS, NBC News, PBS, A&E;, History, Disney, Blockbuster are also nowhere to be found.  Smaller internet channels are also missing like College Humor, Daily Motion, Giant Bomb and others.  Compared to Roku, the Fire TV channel selection feels pretty limited.The remote- Sounds like an odd thing to complain about, especially considering it's very intuitive and easy to use.  So why is it in this category?  It's also quite small.  I could see this thing getting lost quite easily.  It breaking also worries me.  It by no means feels cheaply made, but I don't think it could handle too many falls.  The remote is great, I just think it's too small for it's own good.Bland menu-By no means is this any kind of deal breaker as we are talking about form and not function, but the menu is just very drab and has no character to it at all.  A better layout and some color wouldn't hurt. On Fire tablets, I can understand, but here you have a lot more room to work with.Inconvenient app access- Regardless of how many apps you have, any of them should be easy to access rather quickly.  This is not always the case here.  If I haven't used an app recently, I may have to go through more steps than should have to compared to roku.  Again, not a deal breaker but these devices are built for quick convenience, and Fire TV stumbles here at times.Youtube- I happen to watch a lot of channels on Youtube.  While the Fire TV has an app and it works well, I have a bluray player that I can not only see my subscriptions, but cycle through their playlists as well.  This is a feature that the Fire TV does not have(To be fair, neither does my Roku, Ps4, or Wii U).  I would love to see this updated in the future as it would make navigation a lot simpler.  Also there are times when I try to fast forward and rewind and end up stuck looking at the buffering screen until I back out.  Again, this occurs on my other devices as well, which leads me to believe it's a problem with the app itself.The bad;Prime movies- I can go to my Amazon video app on my roku, go to a menu option for prime movies, and check all prime movies by category.  On Fire TV? Can't do that.  WHY??? No offense to Amazon, but your service should not work better on your competitor's platform.Lack of apps/poorly rated- I've already mentioned that by comparison to roku, the app store for other channels is rather lacking.  Even worse is that a fair amount of apps on the Fire TV are rated rather poorly.  After using a couple of them I quickly learned why, from them operating poorly, ads put in too frequently/oddly placed, or some just crash.  It seems that not only does Amazon need more channels, but they also need some form of quality control.Controller price/quality build- The good news is that while you won't find games of Playstation/Xbox quality on Fire TV, you can find some pretty decent games for a good price that can be played by a controller.  Bad news? Controller is an extra $40 and even worse is that it doesn't feel well built at all.  The cross pad is AWFUL, the analog sticks should feel tighter, and the build feels rather cheap.  If it was priced at $20 I'd say it was reasonable, but I can't suggest it at $40 especially when you find better alternatives for less.Identity crisis-  The Fire TV to me comes off as a device that isn't entirely sure what it is.  It does streaming, it does gaming, but it doesn't do either exceptionally well.  Amazon's video service can be so much better(and we know this because we've seen it better on different devices!), and it's menu system could really stand to be cleaned up in a way that makes everything quicker to access.When all is said I truly believe that Amazon has a solid device on their hands, and these are just the issues of being \"the new guy\".  That said it is difficult to recommend the Fire TV over other devices in it's current state.  Amazon has been pretty good at addressing issues of it's previous products, and hopefully it will do the same here.  If you were looking into a Fire TV, I would personally tell you to wait, as I'm sure in time it will only get better.  If you are looking for a streaming device right now?  Honestly, you can find better options.  Right now I can only give this 3 stars.  It's an ok product, but it could be so much better.", "verified": true, "helpfulness": "98/106", "author": "J-4 \"Entertainment junkie\""}]