[{"rating": 5.0, "review": "AWESOME, I am so addicted.☺️", "verified": true, "helpfulness": "0/1", "author": "Hatti"}, {"rating": 5.0, "review": "Amazing!  It works exactly as promised.", "verified": true, "helpfulness": "0/1", "author": "Kathleen Luxton"}, {"rating": 4.0, "review": "I wish I would have ordered the Fire Stick, would have been cheaper then the box, but so far Amazon Fire Has been a good investment. Lots of movies to choose from if you are a Prime Member. The first & second movie buffered quite a bit so was not sure how I was going to like it but since then it hasn't buffered at all. Would have sent it back if it would have continued to buffer as it is really hard to watch a movie when it stops all of the time.", "verified": true, "helpfulness": "0/0", "author": "Lori Baumgard"}, {"rating": 3.0, "review": "I purchased the Fire TV stick instead because I'm waiting for Amazon to add DLNA and/or direct USB attached media playing capabilities.  Currently I have to have two devices to accomplish this, but as soon as Amazon upgrades this unit to include these common features, I'll buy this one too!", "verified": false, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought this for my mother so she can drop her Basic cable package that mostly only gets her local channels and not much else plus a DVR for $35.00/month. I tested it for a month because she's getting it for Christmas. This thing is FAST....loading Netflix, movies from Prime, apps etc....FAST! I used to stream Netflix from my Xbox 360 and Smart TV on the same cable internet line. Amazon Fire TV is easily 10x faster at loading. She can get Amazon Prime for $99.00/year and have plenty to watch plus all the other benefits it comes with. There are some other free apps for free TV watching also. Crackle and Vintage TV. So you have to watch a few commercials.....just a few but you get movies and TV shows for nothing if you don't want Prime/Netflix or Hulu. I've downloaded a FREE app to maker her TV into an aquarium and a roaring fireplace...all in stunning HD. One of the COOLEST features and my FAVORITE !.... Viewing or streaming and also turning some of the few thousand photos I have stored in Amazon(Unlimited free photos) on my HDTV into a screensaver. We leave the TV on alot more now just to have these photos of our twin babies streaming across the TV in bright HD. OH! and the remote. Awesome! Just talk into it", "verified": false, "helpfulness": "1/1", "author": "JASON P"}, {"rating": 5.0, "review": "Easy setup, great features.", "verified": true, "helpfulness": "0/0", "author": "sarms \"Smiley\""}, {"rating": 2.0, "review": "I don't have films in spanish,and also games,music is difficult to put,is not easy,and the other thing is to use it without paying the annualy Prime,that not guarrantee that i sill obtain music ,films,and games ins spanish,sorry,I am not conforme.", "verified": true, "helpfulness": "0/4", "author": "Fernando Baru"}, {"rating": 5.0, "review": "Wifi remote, 'nuff said", "verified": true, "helpfulness": "0/0", "author": "sarah shu"}, {"rating": 5.0, "review": "Much better than using a wii.  I love the voice command on the remote.  Also, it is so small, which saves so much space.", "verified": true, "helpfulness": "1/1", "author": "cris"}, {"rating": 5.0, "review": "Works as advertised...Great!", "verified": true, "helpfulness": "0/0", "author": "darrell douglas"}]