[{"rating": 5.0, "review": "Great for sling tv!", "verified": true, "helpfulness": "0/0", "author": "Cameron Manders"}, {"rating": 5.0, "review": "This is the greatest thing since the invention of TV!", "verified": true, "helpfulness": "0/0", "author": "Marie McGaha"}, {"rating": 3.0, "review": "I BOUGHT AND RETURNED FOUR OUT OF FIVESOMEHOW THE REMOTES DO NOT WANT TO WORK", "verified": true, "helpfulness": "1/1", "author": "shiv"}, {"rating": 4.0, "review": "I would have given it 5 stars, but I'm definitely bummed about the lag when I stream Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "My family really loves the fire TV.  Works great with Netflix, Amazon Prime, Sling TV.  Did have some initial problems with watch ESPN app but that is probably due to the app itself but I can get watch ESPN to work if I clear cache.", "verified": true, "helpfulness": "0/0", "author": "DAM"}, {"rating": 5.0, "review": "We canceled our high priced dish service and use this along with an indoor hd antenna.  With Hulu plus and sling tv, we haven't missed our dish at all.  If you're looking for an easy way to watch television, this is it.  Even our 4 year old is able to navigate the amazon fire box.  The toughest part is that there's always something to watch.", "verified": true, "helpfulness": "0/0", "author": "josherin615"}, {"rating": 5.0, "review": "Best thing ever!! LOOVE IT!!", "verified": true, "helpfulness": "0/0", "author": "Carolyn J. Gallardo"}, {"rating": 4.0, "review": "Good product but lacks the apps that the Roku and Google Chromecast offer does not support the CBS all access app.", "verified": true, "helpfulness": "0/0", "author": "marc"}, {"rating": 5.0, "review": "This is a great product that gets used daily. If they ever open up voice search to more than just Prime offering, it will be even better.", "verified": true, "helpfulness": "0/0", "author": "Takpro"}, {"rating": 1.0, "review": "good for movies but not sports", "verified": true, "helpfulness": "0/3", "author": "jerry love"}]