[{"rating": 4.0, "review": "Pro: pipes in video & music excellently; voice commands work; easy set up; unobtrusive sleek box; intuitive remote.Cons: always on, tracking internet usage apparently; voice commands don't work so well for someone with an accent; too much defaulting to pay per view/subscription services.Normally use it to look at youtube: old movies & tv shows; could have better navigation for this type of usage.", "verified": true, "helpfulness": "0/0", "author": "M. Buckley"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "John Cua \"Kenpachi\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Terry E."}, {"rating": 5.0, "review": "Its an adjustment from cable but getting use to it. Like not having to pay to watch endless commercials and like being to watch something when we want too.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "I love it.  Since I already had amazon prime I went with the Fire TV when I decided to cut the cord.  I am very happy I went with the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "paul e gilbert jr"}, {"rating": 5.0, "review": "Everything I expected! Works great. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "kbuck"}, {"rating": 4.0, "review": "Wireless awesome", "verified": true, "helpfulness": "0/0", "author": "Dave Browne"}, {"rating": 5.0, "review": "Great device and has exceeded my expectations. I have it wired to router and it works flawlessly but I haven't tried the wireless connectivity yet. The voice activated search feature on the remote works amazingly well too. I believe this unit surpasses any of the competition thus far :))", "verified": true, "helpfulness": "0/0", "author": "Floyd Davis"}, {"rating": 3.0, "review": "Didn't work for me but amazon refunded quickly with no hassle", "verified": true, "helpfulness": "0/1", "author": "brad"}, {"rating": 5.0, "review": "Superb work Amazon! Streaming works great with no buffer lags. Voice search work perfectly too, both myself and my wife have used it and it works. Still have not figured out how to get X-Ray working during a movie though.", "verified": true, "helpfulness": "0/0", "author": "WNCChip"}]