[{"rating": 5.0, "review": "But quick question: how do I power it off? When I first started using it, it would power off by itself when all other power things were off.  But now it seems to be staying powered on.  What do I have to do to make sure it powers off after a little while of no use?", "verified": true, "helpfulness": "0/0", "author": "Nancy Perez"}, {"rating": 3.0, "review": "Would be 5 Stars if Comcast was accepted for HBO ESPN AND SHOWTIME :(", "verified": true, "helpfulness": "0/1", "author": "Ashley Abramson"}, {"rating": 2.0, "review": "Found Roku was much easier to navigate.  Did not seem to offer as much as Roku 3 either.  Not a tech person and so returned the Amazon Fire TV and went with Roku 3.  Very happy with that.", "verified": true, "helpfulness": "0/1", "author": "Phyllis B."}, {"rating": 5.0, "review": "Streaming movie without issue, unit arrived fast", "verified": true, "helpfulness": "0/0", "author": "HNKAJ"}, {"rating": 5.0, "review": "Lot to offer! Plug it in and watch Netflix or Amazon Prime Instant.Fire TV is the integrated app store which can be frustrating at times...There is another way: Go to Amazon's website and either browse all Fire TV apps, or search for what you are looking for, and then remotely install the app directly onto your Fire TV.You can display any photos or home movies you have uploaded to Amazon's Cloud Drive.Fire TV supports Miracast mirroring. which supports Android devices & certain Windows PCs, & Amazon's Fire TV tablets. To make it work, you first need to go to Settings - Display & Sounds and then select \"Enable Wireless Mirroring,\" and then start mirroring on your Fire TV or Android device.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "easy to use, food product", "verified": true, "helpfulness": "0/0", "author": "P. Stratton"}, {"rating": 5.0, "review": "LOVE MY FIRE TV!! I use it mostly for Netflix although the experience with most other apps is also great. I love the voice search. The navigation is easy the remote is smooth in my hand. My main complaint is that you can't turn it off. I like being able to turn devices off but with this you have to unplug it. It says it turns off when not in use but I have come back from using it and it's still on several hours later. I'm a prime member but not that impressed with the video selection in comparison to Netflix, but thanks be to Amazon for offering this great device that allows access to a lot of apps. We compared it to roku and Apple TV, but Amazon had a deal combo of this and a kindle fire I was wanting to purchase for a friend, so I bought it and certainly am having my uses fulfilled. It's so small that it's easy to take with you wherever.", "verified": true, "helpfulness": "0/0", "author": "Prime Member"}, {"rating": 5.0, "review": "I love it!  Easy to navigate and the voice search is quick and accurate.", "verified": true, "helpfulness": "0/0", "author": "Mary B"}, {"rating": 5.0, "review": "I am really loving my Amazon Fire TV.  It has turned my bedroom TV into a smart tv.  I have already told several people about it.  I'm really impressed how well it streams.  I just have standard WiFi...really slow...and I only have had a buffering delay one time.", "verified": true, "helpfulness": "0/0", "author": "loving amazon"}, {"rating": 4.0, "review": "No xbmc", "verified": true, "helpfulness": "0/0", "author": "huongtran"}]