[{"rating": 4.0, "review": "4 stars because I do love it (and really love that a lot of things that are not available on Netflix are available on Amazon Prime).  I only wish there were more apps...especially related to foreign broadcasts. The British TV is available on Fire TV will be the best DAY ever.I also wish the remote was connected to the TV so I didn't need to use another remote just to control the volume.", "verified": true, "helpfulness": "0/0", "author": "Ella Quinn"}, {"rating": 5.0, "review": "I like it thank you", "verified": true, "helpfulness": "0/0", "author": "Omar"}, {"rating": 5.0, "review": "Love it!  Super user friendly and everything you can think of to watch is readily available.", "verified": true, "helpfulness": "0/0", "author": "CHANNIGAN"}, {"rating": 4.0, "review": "Very nice didn't give a five cannot log into Internet", "verified": true, "helpfulness": "0/0", "author": "Joey M."}, {"rating": 3.0, "review": "I love amazon dearly, which is the only reason I am going to review the fire tv. The look of the fire tv is so sleek and futuristic, their is even an installation kit you can buy exclusively for it. The fire tv does not weigh much but just enough to hold it's own against the pull of an HDMI cord. Navigating the fire tv with the remote can be slightly frustrating since the remote is sensitive to the point of it being too sensitive at time. Not as many apps as the roku but I am sure amazon will get more in time as the fire tv is fairly new. The voice search I don't bother with but for me when I did use it, it was iffy. Working at times but only after I repeated what I said a couple times. Once it works though, whoever you searched for pops up, even in apps you have not yet downloaded or own. Speaking of apps, which is my main reason for reviewing this, of my experience, some just do not work or only when they want to. I have not had the same issue as others with the hulu plus app but the netflix app just does not work. This is a big issue for me as netflix is the number one app for streaming media I use. When the netflix apps does work, it still does not work. I pick a movie to play and an error pops up every time and I constantly have to resign into the app. The spotify connect app does not work either and I own an s5 and am a premium user and it still does not work. I dont mind that the spotify app is not a standalone one, im never far from my phone but the fact that it doesn't work is unexceptable. This box is 100$ and my 40$ does everything this box is failing to do. Granted Roku has been out longer, much longer, but if amazon wants to compete they got to get their apps to work and the ones that work to work like the descriptiom says it should. I have not downloaded many apps but of the ones I downloaded, two do not work. I am hesitant to download more for fear that more won't work. On the plus side, this fire tv, much like a laptop remember when you put in the password for someones wifi and saves it, so no re-putting in the wifi password when I take it from moms house to grandma. I think amazon is on to something with the fire tv, they just need to remember that not everyone who is going to buy this box, is using amazon prime to stream content or even have an amazon prime account.", "verified": true, "helpfulness": "1/1", "author": "Lesley Brown"}, {"rating": 5.0, "review": "I had a roku. Every once in a while it would lock up and I would have to completely shut everything down and restart everything. Once it starting locking up, the roku seemed to do it more often which was really annoying. I read abou the Amazon Fire TV and it beats the Roku hands down! I would recommend this product for anyone that has a Television.", "verified": true, "helpfulness": "0/0", "author": "Chantal P. Beason"}, {"rating": 4.0, "review": "Great little android TV box. Can stream netflix from NZ using a DNS forwarding service, but have trouble buying amazon content.Rooted it and installed XBMC on it. With this I can play movies from an external HD and stream them from my PC. The XBMC works well with the remote for the most part, though hard/impossible to do some things without a mouse/keyboard.I haven't tried any others TV boxes, but this one has left a very good impression on me. I'm moving overseas soon, and this is one of the very few gadgets I'll be taking with me.", "verified": true, "helpfulness": "0/0", "author": "Xiao Bao Brown Cow"}, {"rating": 5.0, "review": "This box is awesome!  So many apps.  I haven't even scratched the surface of what this box can do.  As soon as can I will change my cable TV to the minimum.  This box has practically everything I need.  I have told a few a people about it, but they didn't seem convinced that this box is the truth.  It's one of those things where you have to see it to believe I guess.  I'm very critical and usually don't rave about products, but I really like this box.  A couple cons;  The voice feature doesn't always work, but I'm not use to it yet and I don't usually use it; It's a little generic.  Can't wait for updates and improvements in the future.  Good investment.  All you really need is in-home WIFI and this box and you can get away from cable and satellite.", "verified": true, "helpfulness": "0/0", "author": "Craig Horner"}, {"rating": 5.0, "review": "Awesome. love it. the kids love it.", "verified": true, "helpfulness": "0/0", "author": "JEROME A SCOTT II"}, {"rating": 5.0, "review": "Works great, esp with the plex application.  My 6 yr daughter is using it a lot more than me and enjoys using this for kids show.  I pre-ordered the amazon fire tv stick as a result of this purchase.", "verified": true, "helpfulness": "0/0", "author": "A. Wahid"}]