[{"rating": 4.0, "review": "Loved the idea, just had a lot of difficulty with it staying connected to my home network. Had to return.", "verified": true, "helpfulness": "1/1", "author": "Kotagirl"}, {"rating": 5.0, "review": "Device is easy to set up, great interface, great user experience.I also use Netflix, but I like Fire TV better.", "verified": true, "helpfulness": "0/1", "author": "Peter Aman"}, {"rating": 5.0, "review": "Excellent and easy to use.  I had an Apple TV and replaced it with Amazon Fire TV.  The voice search feature works great and the remote control is easy to use unlike Apple TV's remote.  I highly recommend this for Prime members and anyone else. Love the Gary Bussey ad! : )", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought this because using my laptop to stream amazon prime video and netflix was not quite seamless enough. This  was quick and easy to set up and start using. Watched about a dozen shows that first weekend using both of those services and the picture was excellent with no delays or buffering using my medium tier cox cable internet service. Would definitely recommend.  The voice search worked well for those two services.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it.I just wished Redbox was included in the streaming protocol.Only flaw is sometimes doesn't recognize the actors names", "verified": true, "helpfulness": "0/0", "author": "Ronald Matrisch"}, {"rating": 5.0, "review": "I really want to praise this product's ability to hold a solid Wi-Fi connection better than my PS3 for when I watch Netflix. The first time I submitted this review, Amazon rejected it.  I wonder if it was because I mentioned Netflix or because I complained about being forced to use at least twenty words.  I used more than twenty words the first time, so I suspect it could have been either reason, neither of which is justifiable in my opinion.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my Amazon TV great picture!  It was easy to install even for someone like myself who when it comes to electronics is challenged no tools required.....Have no hesitation in recommending it to all.", "verified": true, "helpfulness": "0/0", "author": "Atcgrl"}, {"rating": 5.0, "review": "Not going to burden anyone with a long boring review. Plug and play. Definitely faster speeds and quality than my apple TV. Don't be afraid to buy one. If you do have a problem, it would be due to user error or poor WiFi. Good luck.", "verified": true, "helpfulness": "1/2", "author": "Steve Eide"}, {"rating": 5.0, "review": "I can't believe we finally have a great voice command system.  I don't have to use 3 reps to get into fire,  just pick up the fire remote and bam,  I'm in and telling it what I want to watch.  Good job amazon!", "verified": true, "helpfulness": "1/1", "author": "egilmore"}, {"rating": 5.0, "review": "Amazing, you must have high speed internet(such as Cable). Videos are delivered in HD and the audio is superb.The VoiceSearch actually undestands my voice and works GREAT. I have only operated it a few days, it does stream as advertised with high speed internet.", "verified": true, "helpfulness": "1/1", "author": "David M"}]