[{"rating": 1.0, "review": "Doesn't work well with my Internet has to keep  reloading! !Need to return it", "verified": true, "helpfulness": "0/0", "author": "S."}, {"rating": 5.0, "review": "Works very fast & remembers all your shows & where you stopped watching them!  If you have a smart TV you don't need this box, but I have used both the Amazon app on my smart TV & my box & I prefer to use the Amazon Fire TV Box, even though I have to change the input from my TiVo to the Fire TV box.  I love the voice search when looking for a movie or program.  I think it is worth the money even if you have smart TV, especially if you are a Prime member & have access to all the free movies you get!", "verified": true, "helpfulness": "0/0", "author": "William L. Riechel"}, {"rating": 3.0, "review": "I'll admit to being let down.  Although the picture is the best I've seen, a few little bugs are hurting the experience.1) The remote's back button is so sensitive.  you don't even have to press it.  Just barely grazing it backs you out of whatever your watching.  I have to be careful how I set the remote down or I exit my show.2) Every couple of weeks I have to upplug the base unit for 10 seconods or what I\"m watching slowly degrades into a stuttering slide show.  Once I reset it, it is beautiful again.  I've tried it connected to wifi and LAN, same problem.That being said, it's awesome when it works.  I use it with my Fire which shows me what actors are on the screen and gives trivia about the show I'm watching.  If a software update comes out and fixes the stuttering, I will revisit this review.  I'm already used to the remote and most of the time use my Fire or phone as a controller.", "verified": true, "helpfulness": "1/1", "author": "D. W. Shaw"}, {"rating": 3.0, "review": "The hardware works well.  Apps are lacking and hard to browse for movies etc to discover new ones.  You have to know what to search for.", "verified": true, "helpfulness": "0/0", "author": "Karli S. \"karli\""}, {"rating": 3.0, "review": "Why is the Hulu app so prone to not working on the Amazon Fire TV.  Commercials play no problem, but the video often gives an error.  Coincidence... me think not.", "verified": true, "helpfulness": "2/2", "author": "Jay Turner"}, {"rating": 5.0, "review": "Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "John Smith \"feega\""}, {"rating": 5.0, "review": "Excellent product, way better than roku 3.", "verified": true, "helpfulness": "0/0", "author": "Polmix"}, {"rating": 5.0, "review": "If you have weak wifi, get this table top model instead of the fire stick, as it can plug into a cable from your LAN. I have regular problems with the HDMI only stick unit losing sync. It's very frustrating to have the % wait meter pop up a dozen times during an hour long program. I like the remote and interface much better on FireTV than my Roku, which is getting retired.", "verified": true, "helpfulness": "0/0", "author": "Lagarto"}, {"rating": 3.0, "review": "Very cool. My kids love it, but it is lacking something very essential. The available channel apps require paid access and the device alone does not provide that. When loading and using apps, you will be referred online to what gives you access. In my case it is the access provided by TWC. The comparison Chart is a little deceiving. The Time Warner App is not available for Fire TV but the Amazon Prime App is available on every device. I was hoping to get rid of/ augment my cable boxes. I noticed that ROKU does have the TWC App. I may purchase one.", "verified": true, "helpfulness": "1/1", "author": "Elke S."}, {"rating": 5.0, "review": "Love it! Very fast and voice search is great.", "verified": true, "helpfulness": "0/0", "author": "Scott Holmes"}]