[{"rating": 5.0, "review": "Loved it - started using right away - just as described", "verified": true, "helpfulness": "0/0", "author": "Carol A Brown"}, {"rating": 5.0, "review": "I ordered the Amazon Fire TV not really knowing what to expect.  I have experienced the Apple TV, however after reading about all of the competitors, I chose this one.  I am totally impressed.  Since I already had Amazon Prime and subscriptions to Netflix (and a host of others), all I had to do was add my log-in information.  It was simple set-up and there is great selection of movies and tv shows available.  I also ordered the game controller.  There are some good free games available, too.  Definitely will be purchasing another one in the near future.", "verified": true, "helpfulness": "0/0", "author": "Mavis N. Jones \"Blue Momma\""}, {"rating": 5.0, "review": "FAST FAST error free streaming.", "verified": true, "helpfulness": "0/0", "author": "G. Kupfer \"hoghauler\""}, {"rating": 5.0, "review": "A great addition to my entertainment systems especially with the extras that Amazon provides.", "verified": true, "helpfulness": "0/0", "author": "Robert M. Mitchell"}, {"rating": 5.0, "review": "Works great....responds instantly!!", "verified": true, "helpfulness": "0/0", "author": "Susan Ferguson"}, {"rating": 5.0, "review": "Easy to use and set up. The voice feature is great and saves a lot of time searching. Compact.", "verified": true, "helpfulness": "0/0", "author": "Gerry"}, {"rating": 4.0, "review": "I really want to like the Fire TV as I do everything Amazon. Voracious readers, movie, TV and gamers in the household. Remote voice control is very helpful.When I ordered, I blindly added two game controllers. The game controllers do everything the primary remote does, \"except\" allow the voice control. No microphone. This probably won't phase most users, in my opinion, but this would be a helpful improvement for v2 controller down the road.We have quiet times in our household, at least 4 or more ways to connect to media, but most require me to use a bluetooth headset. This will be fixed at some point, no doubt, but so far, based on xdadevelopers comments, typical 3rd party BT headsets added as game controllers, or via api, were needing supported offset for better sync of audio to video.I attempted USB hub controlled headsets, and other options, no luck so far. I'd readlly like to see a 3.5mm controller jack for remote and game controller for tethered headset, ala Roku3.Please add search, voice control for titles indexed from high value partners, Netflix, Hulu Plus titles. Search finds Prime and Amazon Instant Video hits first, 2nd screen, then very small lower right box \"other ways to watch\" and then only taken to the app, not the hit found. Search cannot find titles not also on Amazon. I do understand Amazon's business reason for this, but ultimately search finding 3rd partly app titles would make a very useful, and greatly increase FireTVs value in this competitive space.Keep up the improvements, it has great features now, and awesome potential!", "verified": true, "helpfulness": "0/1", "author": "cpufox"}, {"rating": 5.0, "review": "Ease of use as a Prime Member is  best in class.  With Prime, Hulu Plus and Netflix, I have access to a tremendous amount of content.  As original production content continues to move to the Streaming Services, the selection will only improve. Fire TV is easy to install, easy to use and the 1080P resolution is better than anything that Time Warner offers.  I have a Digital Antennae for 30+ local stations and can almost cut the cord to cable!", "verified": true, "helpfulness": "0/0", "author": "Donald Trace \"DT\""}, {"rating": 4.0, "review": "No power button. Other than that does everything I expected plus, Red Bull TV!", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 3.0, "review": "Fire TV, well it works well within the Amazon world. I have an Apple TV and a Roku box, so I wanted to see how this one compares. I also have an Xbox 360 and a PS3, along with 2 smart TVs and Wii's. I like to see how all of them stream and what is good and bad about all of them.Streaming with this bad boy is great, rarely have any issue, and seems to function great as a basic streamer, but I don't have any issues with any of my devices streaming.Interface with this device could definitely use some work. It really seems like they took all the worst traits from the menus of every other device and combined them. I can get past the fact they are putting what will make them money up front, but they even make that a hassle.Games are ok, haven't found anything that makes it a must play. I bought a controller with mine and have tried the games, my daughter plays minecraft on it, but she still prefers the 360. Anyone that thinks this is the top of the line video game system needs their head examined. It is a tablet style gamer with a controller, but with such a limited amount of apps, it is disappointing.Now you can read this or not, but I am hoping Amazon notices this. Potential is great, but potential without a plan is just a dream. This little box is fast enough, and powerful enough to do quite a bit, but letting it flop around in dead space is a failure.1. Make the remote able to be programmed with volume up/down and power for a TV so this can be used with one remote.2. Open up the store and get some local provider content like Verizon/Comcast/TWC apps so this can be part of the ecosystem. The more people are on this the more they will look at pulling stuff from your store.3. Give me a reboot option in a menu, Hulu plus especially does not update until you get all the way out and and open something else and then go back in, rebooting would be a nice option to clear the memory so it would load better.This device is ok, and that is a sad compliment for a company that has been very innovative. For the price, I don't think I would by this again, I would go for another style streamer. If your world is on Amazon, and they are the main focus of your online interface, this is a pretty decent option. There are better.", "verified": true, "helpfulness": "0/0", "author": "Stephen C. Hays"}]