[{"rating": 2.0, "review": "No matter how convenient these TV/widget devices get, most of the free content out there is old stuff you have probably already seen a number of times or junk that you wouldn't want to waste time watching! This Amazon Fire TV gadget just gives you voice searching for the same old stuff!Paying for just a few of the newer content providers will run up a tab similar to paying a premium for Dish or Direct TV, so cutting the cable saves next to nothing! I cut the \"cable cord\" back in 2009 and soon discovered that unless I was willing to pay for a few select context providers like Amazon Prime, Hulu+, Redbox, Netflix or iTunes, the free stuff was no better than the 200+ channels on cable that were not worth my time or money. When I switched to streaming there where no gadgets like this Fire TV or anything else and most of the LED flat screen TV's were just beginning to put a few providers widgets on their TV's. I set up with a 2009 Mac Mini with 4 gigs of ram to a 55 inch Samsung LED TV. This set up allowed me to surf the net, email, news or watch what ever content was available on the internet and did not confine me to a few widgets!Entertainment choices have gotten somewhat better since 2009, but these widget gadgets like Fire TV are really not much more than a few of the most common and old content providers icons to a limited experience and seem quite useless to me!", "verified": false, "helpfulness": "1/6", "author": "GT ACE \"Say something about yourself!\""}, {"rating": 4.0, "review": "I am currently happy with the Amazon Fire.  I just switched from cable to streaming...I also have a Roku...So far it works well, the voice command is a nice feature...I don't love the remote....wish it was lighted...in the dark, always pushing the wrong button...the home and play button are too close together...Home button should be on top of remote...so I push Home instead of play....A LOT and have to start over...otherwise..a good lil streamer", "verified": true, "helpfulness": "0/0", "author": "DJM"}, {"rating": 5.0, "review": "Buying the Amazon Fire TV was the best $99 I've ever spent !  Excellent Hi Def, Voice Search that actually works !  Easy and fast setup, your up and watching your favorite TV Shows and Movies in a matter of minutes.", "verified": true, "helpfulness": "2/2", "author": "Stan116"}, {"rating": 5.0, "review": "Very Slim Design and footprint and FAST!Opening the very nicely laid out packaging (very nice--Apple-like quality).Fast connect as claimed, boot up and very nice introductory tour if you care to watch it.The menu UI is very responsive, once you get the idea that it is column-based using left/right navigation (not immediately intuitive, but not difficult either).The pre-buffering of movies that you browse through and eventually launch is a very, very nice touch and ex-Roku users will appreciate this.To be fair to Roku, we have been using one of the early ones.  So the comparison may not be apples-to-apples.  However, Amazon knocked our socks off with this.30-day free trial turned out to be a 30 minute decision to commit.  Nicely done Amazon!", "verified": true, "helpfulness": "2/2", "author": "Tombo \"mukkimon\""}, {"rating": 5.0, "review": "I purchased two of these items from you - one for my daughter and family and one forus....we love it!  Much better than my old ROKU", "verified": true, "helpfulness": "0/0", "author": "Jean Beckers"}, {"rating": 2.0, "review": "thought this box would eliminate a router as streaming would go directly to it.if I'd known this I would've just bought a router and used in conjunction with bluray player-really don't see the big advantage to this box from others-not happy", "verified": true, "helpfulness": "0/8", "author": "gary dean"}, {"rating": 5.0, "review": "works great and cheaper than dish premium channels have freedom to watch what and when you want.plus you have apps for games music all-around entertainment.", "verified": true, "helpfulness": "0/0", "author": "T. D. Anthes"}, {"rating": 4.0, "review": "I'm pleased with this product, it is fast and goes very well with netflix and in general with any video. A few things I find weird are:1. You can't connect bluetooth headphones.....That's one big downer for me.2. Some apps you can't access from the apps shortcut, you have to go to settings and launch them over there.3. No internet browser, or google play store.....4. Sometimes netflix crashes. I think it could patched later.5. Of course, useless if you live outside USA. No amazon video for the rest of the world..........but Netflix covers that part.Hope it helps.", "verified": false, "helpfulness": "1/3", "author": "Teresa"}, {"rating": 5.0, "review": "does netflix work on amazon fire tv? i read somewhere they don't have netflix available on it yet. im not techy at all and im so confused as to whether to buy a roku or an amazon fire. i already have an amazon prime membership. are there are any other costs besides the $99 box and an HDMI cord? are there monthly subscriptions for hulu and netflix (if it is available)? bc on the amazon fire tv page it says the netflix app is free, but would i still need a subscription? i also read it was around $250 to get started but im not sure if thats bc maybe they think most people dont already have the prime membership. please help!", "verified": false, "helpfulness": "0/2", "author": "Abigail B. Conrad \"abbey\""}, {"rating": 5.0, "review": "I was looking to get a Roku 3 and now I am glad I didn't Hooks perfectly with my PLEX server, Pandora, Netflix, even my phone. I can choose a YouTube video on my Android Phone and then tell it to show on the FireTV. One of the best buys I have made!", "verified": true, "helpfulness": "1/1", "author": "Ryan Gergen \"Gergen\""}]