[{"rating": 5.0, "review": "Love this for the entire family! Easy access to apps like Netflix and games!  We are also loving all the Amazon Prime shoes we didn't watch before!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "App storage space is so little. It has glitches in in that causes apps to have to be Uninstalled and reinstalled. i paid for prime service but the videos still all say we have to rent them.  And there is no reading app that I could find. That is something my daughter and I both looked for.", "verified": true, "helpfulness": "0/0", "author": "bimini price"}, {"rating": 5.0, "review": "I love this.....We have watched so many free show by being an amazon prime member.  It was the easiest installation of any computer programs.  Yes, yes, yes", "verified": true, "helpfulness": "0/0", "author": "CherylBeck"}, {"rating": 5.0, "review": "More versatile than I expected, use prime music as much as prime video, a first rate product and service. Voice sesrch is amazing.", "verified": true, "helpfulness": "0/0", "author": "JoeB"}, {"rating": 5.0, "review": "Excellent quality, I love this tv box", "verified": true, "helpfulness": "0/0", "author": "Rafael Gomez"}, {"rating": 5.0, "review": "The best money I have spent in years.We have an older TV and I am pretty technologically stupid.  Hate trying to figure out DVDs, etc.Amazon Fire.  OH MY GOSH.  So easy.  My 8 year old mastered it before I did.We watch tons of Netflix (also a good deal) and I hated not being able to watch it on our television.  Some of our favorite things to do -Netflix for movies and Animal Planet/Nat Geo/Survival shows.  Hulu for old TV shows (my teen is a big fan of Woody Harrelson - it has been so fun to introduce her to Cheers!) Amazon streaming for renting new movies AND for free exercise shows.THANK YOU AMAZON!", "verified": true, "helpfulness": "0/0", "author": "christi mccoy"}, {"rating": 5.0, "review": "surpassed my expectations,", "verified": true, "helpfulness": "0/0", "author": "Amelia"}, {"rating": 5.0, "review": "Fabulous..it's like magic", "verified": true, "helpfulness": "0/0", "author": "natalie d hoffman"}, {"rating": 4.0, "review": "Great for Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "m d obrien"}, {"rating": 5.0, "review": "Beyond my expectations, way better options than Apple TV!", "verified": false, "helpfulness": "0/0", "author": "Ashley"}]