[{"rating": 2.0, "review": "This unit is plagued with problems.The first one I bought required downloading a firmware update before it could be used.The download was interrupted and the unit wouldn't work even with extensive help from the technical support people.I was sent a replacement (had to pay postage to return the defective one) and it works intermittently.I have a old model Roku unit which still works much better than this Amazon Fire TV unit.Don't buy this unit,  I wish I hadn't.", "verified": true, "helpfulness": "0/0", "author": "Robert Hand"}, {"rating": 2.0, "review": "The USB port is disabled so i was very disappointed when it arrived because i already had the Fire Stick. So now i had an overpriced fire stick. It was really close to being a perfect product if the USB port was active.  Why advertise the USB port when you cant even play back any audio or movie files from the USB port like any Blue-ray or DVD player out there. If you like the device get the Fire TV Stick at 1/4 the cost. I have them both and you cant tell the difference on netflix or watching movies on prime. Also, the interface is setup to trick you on buying content so be careful . They give you a free show, then the next one starts and you hit watch and next thing you know it, you have a 5 dollar charge for watching one episode. So set up a pin on each device.Its not a bad device it just that i could not tell the difference between stick and this TV box. Not using it for games nor using the voice feature. It seems smooth on video playback but it would be nice if it had a sleep option on the main screen. It is hidden in the menus if you want to put device to sleep.", "verified": true, "helpfulness": "1/1", "author": "homer"}, {"rating": 5.0, "review": "excellent product !!!!!!!!!!!!!!!!!!!!  The VERY BESTvoice recognition available anywhere.  Totally amazing", "verified": true, "helpfulness": "0/0", "author": "daveok7"}, {"rating": 5.0, "review": "Shipped fast and was just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Frank  Brumlow"}, {"rating": 5.0, "review": "I like figuring things out my way.  I love technology and dislike locks.  As such I am among the last to buy into an \"ecosystem\" of products from a large company like Apple, Microsoft, Google, and of course Amazon.But amazon provides my family with such good pricing, shopping experience, and customer support that over the years we have turned to become to a prime member centering on the shipping at the start.  A year or two into this, we would occasionally get some good value out of watching a show or two on the Ipad.  Fast-forward another year, I found out that I can enjoy some old TV shows I enjoy while working out at the gym on Android (late to add from Amazon).  So our value has increased.  We also added AmazonFresh to our subscription because it provides a valued service for our family right now.I have a personally built multi-media system in our home where we watch our own content, augmented with minimal cable TV content (that is still way overpriced for us).  I have been using Popcorn Hour players for some time for our version of a \"set top box\".But with the prime tease for a very low cost I purchased a FireTV Stick on sale for prime members only.  I was a bit reluctant but it was a cheap enough test.  I was immediately impressed with the usability of the interface, remote function, and quality of design and execution.  I still use the Popcorn Hour on another TV input for my local LAN personal collection of media (Movies, music, Home Videos Photos etc....).  I like the way Amazon Music and Photos are well integrated into the entire FireOS experience.  But while at home, I like to leverage my local LAN resources whenever possible to limit my Internet bandwidth consumption (Cox still watches usage apparently).  Plus I like my music uncompressed CD quality(FLAC) and higher resolutions, all not provided by common streaming services.  So suffice it to say, I need the control of what I always had as well as the cool things Amazon provides.I was so blown away by what Amazon has done that I started to read what others think..  Uniformly, it is an A+ product -- and there are ways that Amazon has allowed users like me to gain even more functionality we want from the box.  That is sideloading.  Huge hats off to Amazon for allowing this.  Please do not become an apple or other competitor and stop this capability without rooting.  I dont want to have to root anything.So based on these reviews, specifically what advanced users were able to do with XBMC open-source software, I decided to take a deeper plunge into Amazon -- and buy 2 Fire TV boxes in addition to the Fire Stick I just got.  The Fire TV boxes are compelling because of the extra power/performance inside, presence of Optical SPDIF output for audio passthru to receiver for high-res FLAC decoding of my music and local movies.  Also the USB port will likely become valuable to enable things like my older IR-only Harmony Remotes (havnt done that yet).Now that these two FireTVs are up and running and my Stick in in my Travel-Pouch now (good idea I think), I am extremely impressed.  I was able move 100% of the tasks done on my older Popcorn Hour over to the FireTV.  This includes integration of my NPVR backend with HDHomerun for viewing my Cox Cable LiveTV feed through the FireTV (via my NPVR backend) --- access to time delayed play --- and playing all my captured/recorded MPEG2 Transport Streams from my Cox Cable input on my media server.  This, of course, in addition to my local Music Library (all lossless and very large). local movie content (in any format), and all my family videos and photos show work great on the FireTV now.How does the FireTV do with the aggregation of all the wonderful Amazon Content (free ,subscription, and PPV) along with my local media collection and needs.  Answer --- much better than the other approaches I have been using.  The FireTV is fast, well designed and robust (already in its early stages).  The underlying android OS provides the needed services and features for users like me to get so much more value out of the FireTV as well.  This is even if they are not exposed to the average user through their FireOS UI (which by itself is a great design for 90% of the users of the world).The FireTV has easily become the best single gadget I have purchased/added to my highly technical home portfolio for some time since my Logitech squeezebox nearly a decade ago.  It has WAF, kids can use it easy --- and it looks great on the TV.Does Amazon want us to continue to use the FireTV as I am above combining the best of the Internet world at Amazon with our local media --- I certainly hope they don't do anything to stop it.  The combination has made me a even bigger supporter of Amazon and am spreading to word to similarly minded friends and family who want a good single box solution for all their needs.  In reality, when we want to see a movie or use a service which we do not have local access, the closest and easiest way to get this movie or whatever is to just use Amazon FireTV!  It is brilliant that Amazon has created such a capable box that just about anyone (even the uber-techies) can appreciate and love.A word on FireTV HW.  The chipset chosen was very good, design and integration great -- no fan -- supper small -- well built.  The Wifi is not bad at all.  I expected to go wired into an external 802.11n bridge of good quality to get needed local streaming performance.  But the MIMO n wireless performance is just as good as my external bridge so I never needed the wired connection.  I just cannot stop being impressed with what this team of people at Amazon has done here.  Hats off.", "verified": true, "helpfulness": "4/5", "author": "JimT"}, {"rating": 4.0, "review": "So far, I'm mostly lovin' it!  I do wish that the voice commands worked for Netflix, but I guess you can't have everything.  It is very quick.  I was using my PS3.  This thing blows the PS3 out of the water as far as speed for watching streaming.  I don't play the games, so I can't really comment on that.  The menu is great and very user friendly.  with the update, they do have separate sections just for Prime content, but you may have to do the update yourself.  It's easy to do, but my Fire TV didn't come with the update--just a heads-up.", "verified": true, "helpfulness": "0/0", "author": "Pain-free"}, {"rating": 2.0, "review": "It's okay at best.Going in, my expectations for this product was that it would play Netflix and Spotify easily and it came with a remote. If it plays HBO Go, sports, or Amazon media, that's extra. My xbox 360 was crapping out, the Fire Stick is on backorder, so I pulled the trigger on this order. I regret this choice and have already put in to return this product.Pros:---Setup: opening the box felt like unboxing an Apple product. It was very simple and the setup is good. I would move the intro video to before setup of the wifi. (Disregard the shipping service damaging the box)---Remote: the remote is pretty good. I prefer not to use any type of voice controls because they are usually not accurate, but this time it was very clear and was very accurate. Remote is minimalistic and feels good in hand.---Apps: plays Netflix in menu-driven UI. Very fast and clean. Easy to use.Cons:---Menu: I felt like this product was shoving Amazon media down my throat. I've already bought the product so calm down. It felt like a machine that plays Amazon media and has other apps available. The menu felt overwhelming. I think Amazon media should be equal and available as an app, not included as options in the menu. ie. Netflix app shouldn't be sitting next to The Office in the menu.---Turning the device off: I sat there for about 20 minutes trying to turn this device off. I caved and looked it up. It doesn't turn off, but can go into sleep mode after 30 minutes. That's weird and wastes electricity even if is using a minimal amount. Do I just turn my tv off and let the Fire TV on? That's weird.---Spotify: Like I mentioned before, for me to want and use this, Spotify needed to be available. Spotify is available but as an app that has to be connected to by a remote device, phone or tablet. So I would click the Spotify and then it guides the user to open the app on the phone or tablet then push the media from the phone to the Fire TV. It would be better with a menu-driven UI that I can login to and then browse with the remote. I don't if Amazon needs this fix or Spotify, but this feature can be utilized on a device like Chromecast for a lot cheaper alternative. This might change in the future and might be an update away. For now: Dealbreaker.---Search and voice search: the search only looks for particular apps or Amazon media. If I search for The Office, there should be an option to play it through Netflix or Amazon (if it's even available).---Apps:------Spotify, see above.------HBO Go: not available, but coming.------Games, not interested, plus the remote is spendy...------Sketchy apps------Sports: Watch ESPN, and a limited availability that are freeOverall it does not do the things that I want it do to. It can be improved and updated, but for now it doesn't. Needs to be updated with a better Spotify app, more sports options, HBO Go, off-feature, and better UI.", "verified": true, "helpfulness": "2/3", "author": "MarsH"}, {"rating": 3.0, "review": "I purchased this Amazon Fire TV knowing that I would get a much better streaming from Apps and other Application specially the Twitch TV and what I found out that they only stream at 480p rather than 1080p or it depends upon your internet connection. This needs a bit update and at least update the apps that are currently running in the system. Especially Twitch that they recently purchased.", "verified": true, "helpfulness": "1/1", "author": "Kazzzzz"}, {"rating": 3.0, "review": "It's a good probuct, but it would be better if I could download the show to watch later like the Kindle Fire HDX.", "verified": true, "helpfulness": "0/1", "author": "Warren"}, {"rating": 3.0, "review": "Works great.  But there is one issue.  It forgets the internet settings and has to be setup again each time I use it.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}]