[{"rating": 5.0, "review": "The Fire TV is a great device. Connecting to Netfix, and Hulu plus was simple. Tons of content if you have Amazon Prime.", "verified": true, "helpfulness": "1/2", "author": "Andy"}, {"rating": 1.0, "review": "the instructions should be more", "verified": true, "helpfulness": "1/6", "author": "sheriff45"}, {"rating": 5.0, "review": "best streaming box I have seen. good apps and options and full of content and also fast too.", "verified": true, "helpfulness": "0/1", "author": "Jlacillade"}, {"rating": 5.0, "review": "I purchased the fire stick which had problems with stuttering.  My wife loved the product so much she wanted to try out the Fire TV since it was hard wired and shouldn't run into the same issues as the fire stick did.To date we have had no problems with the fire TV a all.  It is very stable and runs cooler than the fire stick.  The interface is extremely friend and everyone in the house is able to use it without a problem.I wish you could have the parental controls to be a bit more specific.  For example, for an amazon prime 'free' movie that is rated PG and blow I would like my children to be able to watch it WITHOUT requiring me to input an unlock code.  For anything PG-13 or higher and anything that costs money I would still like it to ask me for an unlock code.  Currently anything we watch on Prime requires that I enter an unlock code, which is tedious at times.", "verified": true, "helpfulness": "1/2", "author": "TBKHomeworld"}, {"rating": 5.0, "review": "a great streaming device. does everything it says it can", "verified": true, "helpfulness": "0/2", "author": "Roger D. Bullis \"new guy wanting\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/2", "author": "Melvin Scott"}, {"rating": 5.0, "review": "We used to use our TV and DVD player to stream music from Netflix.  Neither devices compare to the Fire TV.  Goodbye skipping videos, network drops, etc.  The Fire TV is a powerful little device and has many options.  I ended up choosing it over the other options because of WatchESPN app that comes with the device, but was pleasantly surprised with all the other options.  Amazon Prime is great although I wish they would display the \"free\" prime streams on the thumbnail instead of having to open the stream to find out if it is PPV or Prime.", "verified": true, "helpfulness": "0/1", "author": "Carlo Matos"}, {"rating": 4.0, "review": "Its a great item. Reduced my cable bill. Dont have to buy extra movie channels on cable. But more explanation needs to be given on product about the movies you have to pay you have to pay for in the box. Also, i can figure out how to use the $25 credit i have for getting the app for the amazon prime mivies on the fire box.", "verified": true, "helpfulness": "1/2", "author": "Leon Hall"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/1", "author": "Sviatlana"}, {"rating": 2.0, "review": "I have several Roku and I purchased the Fire TV because of it's parental controls.  First the parental controls don't work as expected you cant get into any streaming sites like Netflix or Hulu because it has adult content.  So that was the first mistake I made the second was even going to the Fire TV when Roku worked so well. I have had my Fire TV for 1 year and 2 months and it just quit working in the middle of a movie,  won't power on tried changing the remote batteries and checked another outlet.  In the past Amazon's customer service has been great they have replaced my Kindle after the warranty period and refunded charges.  This time was not the case, I could hardly understand the representative and I never spoke with tech support she just came back and offered me a refurbished for $58.00.  I said no because apparently they don't last that long I will just buy another Roku since they aren't disposable.  I then asked her if she wanted to buy my Amazon Fire from me to re-sell as a refurbished to some other sucker?  She declined:( So in my experience I'd suggest skipping the Amazon Fire TV for any other consumers out there.", "verified": true, "helpfulness": "1/2", "author": "Nicole C."}]