[{"rating": 3.0, "review": "I have a lot invested in Amazon. My music and pictures are all on their cloud services and I have been a prime member pretty much since it came out. I love the offerings Amazon brings so I had to try to the Kindle for TV. Honestly I have been pretty impressed by what it offers even though they really try to push your purchase of content over the free stuff on Prime. What is seriously lacking is a web browser and the Amazon music cloud. I would love to be able to play my music on the kindle as well as search the web but neither of these services are offered on there. Honestly I am a bit surprised by it. You can look at your pictures on the device but not listen to your music. Anyways I am hoping these two features come in future updates.", "verified": true, "helpfulness": "3/4", "author": "Charles Musselwhite"}, {"rating": 3.0, "review": "We are thinking of purchasing this item but I have extreme limitations with dexterity.  I can not hold onto the remote someone must set it on my wheelchair tray so that I can poke the buttons with my thumb.  The way this is shaped; with out extensive modification to make it stable; someone else will have to push the buttons for me so that I can speak to do a search.  I like the features of the box and what it comes with but the controller looks like it will be very difficult to use.  The star rating is meaningless for this review as on one count I would give it a 4 or 5 (I want to buy it)  but the controller looks like it would get a 1 or even 0. So I gave it an ok", "verified": false, "helpfulness": "0/4", "author": "chaneyb@erols.com"}, {"rating": 5.0, "review": "I've got multiple AppleTVs, I've got Roku, Chromecast, and other set top boxes.  But the Amazon Fire is by FAR the best.  It's much more responsive, it has a great interface, and it has an RF remote that doesn't need to be pointing at the box in order to work.If you want to watch your Amazon Prime, Netflix, Hulu and other apps - get THIS device!", "verified": true, "helpfulness": "1/1", "author": "John Pozadzides \"John P.\""}, {"rating": 5.0, "review": "I am a bit challenged when it comes to technology so I was pleasantly surprised at how simple this was to install. I had some issues with Netflix but a call to them straightened it out. This is my first experience with streaming and it is great! I am a 67 year old grandma and if I can figure this out anyone can!", "verified": true, "helpfulness": "2/2", "author": "Susan A. Harvey \"Grandma Shoefly\""}, {"rating": 4.0, "review": "I love the quality of the product, the speed it has to buffer and stream movies. What I don't like is that Vudu (where most of my movies are) is not included with the device, and watching the UV movies on Flixter show only SD and not HD though I have them stored in HDX format. When you search for a movie it shows you only Amazon movies, it does not show you other options e.g. Netflix (where the movie might be free)... Over all great first step, looking forward to seeing the next software update.", "verified": true, "helpfulness": "1/1", "author": "Nimrod I. Vered"}, {"rating": 4.0, "review": "Really nice presentation out of the box. Hardware has a solid feel. Small and understated. The controller is simple. Setup is simple. Use is really simple and easy for norms. The screen saver's amazing photos will make you want to leave your TV on all the time.In addition to Amazon content, it runs Hulu, Netflix, and a bunch of other streaming apps. You need a stout internet connection.If you want to play games, you need the game controller.The user interface seems like it needs a little work. Obvious things like being able to search for free Prime movies are not currently implemented. I expect that Amazon will work this part out over time.There is no web browser available. I hope this changes, and there really is no need for the omission. The number and type of applications is still extremely limited as developers have not had time to adapt software to the platform. Some of the feature applications appear to still be buggy (Hulu in particular).This is a pretty good game machine. Again, you need to buy the game controller for this. Games simply cannot be played with the standard controller. Storage is extremely limited though. Some of the games take over 1GB of storage, and you have less than 6GB of storage free when you open the box. You can't connect a USB drive (I tried - it won't even auto-mount EXT2), and there isn't a micro-SD slot.All in all, if you are buying now, consider yourself an early adopter. I really like where this is going, but it's not quite ready yet. Expect some bumps in the road, or wait a few months before purchasing. The hardware feels good, the software (both Amazon's UI and third party add-ons) feels rushed, and Amazon needs to admit they made a mistake with the storage and figure out a fix. Really, though, a small number of gripes for a really nice settop box. Amazon has done a really good job on this.", "verified": true, "helpfulness": "3/3", "author": "J. Smith"}, {"rating": 2.0, "review": "Need another month to check it out.  had Netflix children for grand daughter in kept re loading.  switched back to Apple TV and had no problem", "verified": true, "helpfulness": "4/10", "author": "James MacMullan"}, {"rating": 1.0, "review": "I feel cheated. Buy AMAZON FIRE and not warned me that it is not compatible with my country since trying to use it to get the message ONLY FOR USE IN USA.", "verified": true, "helpfulness": "13/34", "author": "Domingo Daher"}, {"rating": 4.0, "review": "I am a long time user of the PS3 streaming app. I have become very invested in my amazon digital library. Once I hear about the fire TV I had to have it. The first thing I love is the automatic configuration which sync'd to my Kindle (first version)  so now I have all my favorite apps. I can't wait to buy the controller and play sonic. The next thing I noticed was the better quality of streaming over the PS3 version (for Amazon content). I had to turn down my surround sound system. I can't judge the 1080p as my TV is only 720p.I love voice search. But, it doesn't feature commands. So for example, it doesn't power off when I say power off. I assume soon it will. The next area of concern is the heat from the box. It is warm after hours of bindge watching. The simplistic device is great. I do miss the PS3 interface. I want to have a list format to select from. It is a side scroll like netflix. It may feature it but I haven't located it yet.8 hours into using the device I can say I am very happy. I love the cloud integration. It is also small and light enough to take on my business trips.", "verified": true, "helpfulness": "1/1", "author": "Z. M. \"minininja\""}, {"rating": 2.0, "review": "The system is sleek and operates fast when functional but there are too many glitches and bugs. This was not ready for release. Here is why I returned mine:\"Consistent bugs with Netflix app where it just opens a white screen, problems when waking up from idle where the internet is undetectable and worst of all video randomly drops out and turns screen to snow.\"", "verified": true, "helpfulness": "5/7", "author": "Jeff_J"}]