[{"rating": 3.0, "review": "Good but not revolutionary. Unless addicted to Amazon's ecosystem, a potential buyer has other good choices in the marketplace for streaming devices. Fire TV is not a must-have gadget.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Prime movies a little week. Netflix better over all functionality very good", "verified": true, "helpfulness": "0/0", "author": "William Bianconi"}, {"rating": 5.0, "review": "I love love love this device.  Incredibly easy to set up and use. I would recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "alice schuler"}, {"rating": 5.0, "review": "Once you get SBMC on it, all is well with the world.", "verified": true, "helpfulness": "0/0", "author": "Polys"}, {"rating": 4.0, "review": "It's a great product.  I wish there was a power button.  This generation is all about keeping it green.  You would think by now everyone wants to conserve as much power as they can.Just knowing the fire TV is still on when I'm not using it, it bugs me.", "verified": true, "helpfulness": "0/0", "author": "cheno"}, {"rating": 3.0, "review": "It's a good device for the most part and the voice works as advertised, but only within the confines of Amazon which is very limiting. I have Hulu and Netflix accounts, but the voice search won't look on those sites for a show. As an example I set up the device, added all the connections for Netflix and Hulu, then did a voice search for Arrow and the only result was the Amazon On-Demand season DVD that I would have to purchase to watch, even though HULU has the curent season paid for and Netflix had the older seasons already paid for.  So that and it would only show in a 720 frame on my 1080p monitor, even though my computer will fill the screen nicely. I believe that has something to do with it being compatable with 1080i not 1080p. I am a computer tech and did try to change the display settings but the device would not budge off of auto select. I returned the device since it didn't fit my needs.", "verified": true, "helpfulness": "0/0", "author": "Da Riddler"}, {"rating": 5.0, "review": "Love it. Very easy to search for possible movies you want to watch. I like being able to buy movies and have them right there instead of hard copies. Downfall is sometimes there are movies I want to watch but they don't have it. All in all very pleased with the product.", "verified": true, "helpfulness": "0/0", "author": "Erik Burstert"}, {"rating": 5.0, "review": "I love Amazon TV! I've had Roku as well, but the Amazon Fire TV is user friendly and works nicely with your Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far so good yet... I don't have time to play game... So no opinion on game.  Movies & youtube look good and fast buffer.", "verified": true, "helpfulness": "0/0", "author": "phillip huynh"}, {"rating": 5.0, "review": "No issue.", "verified": true, "helpfulness": "0/0", "author": "Phuong1961"}]