[{"rating": 3.0, "review": "i really haven't used it yet,iit is definetly not buy and plug in and use as advertised,and they don't tell you you need a special wire.I am a little older and not really computer savy so I waited for my son to come and hook it up also not knowing you need wifi or whatever its called .however I have faith in amozon and they straightened out my wire problems so I guess I will get to using my fire tv which I really wanted", "verified": true, "helpfulness": "0/1", "author": "dominick guarino"}, {"rating": 1.0, "review": "What a disappointment. Have had the fire tv for around 1 month and in the last day the videos are starting with ads. Why am I getting ads on  a product I paid for and watching a service I also pay for. Back to Netflix I guess...", "verified": true, "helpfulness": "12/13", "author": "Sirsmeg"}, {"rating": 5.0, "review": "easy to set up and great options for movies and progams", "verified": true, "helpfulness": "0/0", "author": "Sealion \"Sealion\""}, {"rating": 2.0, "review": "It won't power on after several attempts and had to return it for replacement.", "verified": true, "helpfulness": "0/0", "author": "Mohammed Kabiru"}, {"rating": 1.0, "review": "Box worked for two days. It will not turn back on. It is a total waste of money at this point.I can not get support to trouble shoot the issue.", "verified": true, "helpfulness": "1/1", "author": "glen copatch"}, {"rating": 5.0, "review": "I cut my cable and the selection on my Fire TV is outstanding. Great Product of course it mirrors Amazon's other products and services.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I just got this week and installation was easy.... already watched a couple of movies.... now I am just trying to figure out how to get the news, once I figure that out, I am cancelling my cable.", "verified": true, "helpfulness": "0/0", "author": "Cheryl M. Wellman \"Cheryl\""}, {"rating": 5.0, "review": "Great, lots of movies and TV shows", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It is fast, but it has its limits. Almost everything I want to watch has to be purchased, even with Prime. Also, some of the shows I've watched are free for one season, then there's a charge for the next season. Some of the shows have an Amazon commercial at about 2 times the volume of the show you're watching. Finally, the optical audio out sound is very harsh.", "verified": true, "helpfulness": "1/2", "author": "S. G. Jurcak"}, {"rating": 4.0, "review": "nice machine", "verified": true, "helpfulness": "0/0", "author": "thomas lim"}]