[{"rating": 5.0, "review": "Got the Fire TV, installed and set up in less than 5 minutes. We're thrilled with how well this device works. We're Prime customers, and now wecan watch all our prime videos and movies on the big screen, not just the computers. This is a great item, so easy to use.", "verified": true, "helpfulness": "0/1", "author": "Mr. Ronald J. Mendleski Sr."}, {"rating": 5.0, "review": "Amazon Fire TV gets the most use out of any device I have.  Love gaming with Amazon game controller.  Movies, TV, Music, Gaming, Apps, Photos.  I use my Kindle Fire HDX to wirelessly mirror my tablet screen to the TV.  KINDLE FIRE HDX ONLY does screen mirroring.  Amazon Fire TV is the greatest thing since sliced bread.", "verified": true, "helpfulness": "1/1", "author": "dynamicdivinedude"}, {"rating": 4.0, "review": "Very pleased and offers more than expected", "verified": true, "helpfulness": "0/0", "author": "SHEWOMAN"}, {"rating": 3.0, "review": "Cool product, love the voice control, great potential. BUT......voice control only searches thru amazons videos, or you can search another program like Netflix and use bottoms from there on. Also the biggest let down is there is no HBOgo service for those of us with Comcast(not Amazons fault)(it's the Comcast tyrants fault). Another let down especially for me personally was the USB port is basically useless, don't plan on watching movies from a usb, the device and apps within do not support mvk or MP4 video.", "verified": false, "helpfulness": "0/1", "author": "Andrew"}, {"rating": 4.0, "review": "This thing is GREAT! I bought it for my 10 year old for Xmas and I absolutely love it. There are parental control features and the apps download/open extremely quickly. When I made this purchase, an Amazon call rep told me that you can use an Xbox controller with the Fire box. This is not true (at least I haven't been able to get it to work), so you will have to purchase the Amazon Fire or Nyko controller separately if you need a controller. Gameplay, on the games that do not require a controller, is fine (my son loves \"Hungry Shark\"). I have never experienced lag, and honestly, this thing loads streaming content (HULU, Amazon Prime, Netflix, Pandora, etc) much faster than my Xbox360. We recently purchased a controller, so I'll update my review when it arrives and we've had some time to play around with it.The only reasons I did not give it 5 stars is that you cannot program a \"sleep timer\" and there is no single button to turn the thing off (you have to go into settings=> system=>sleep). Not the biggest deal in the world, but it can be annoying. And the remote burns battery power pretty quickly. Other than those, I have not come across a downside.**Update 4-20/15: Wow, Amazon has hiked the price $20 :-(. Anyway, a recent update has addressed one of my issues with turning the system off, allowing users to hold the home button to reach a shortcut to put the Fire TV box to sleep. Still, it would be nice if there was a sleep timer... Also, the controllers take FOREVER to ship. I can't wait to try it once it FINALLY arrives.***Please ignore all of the 1-star reviews from people who have not even purchased this product. This is a great streaming device with lots of games and streaming apps included for no extra charge. I am an avid gamer and would not presume this would replace my Xbox; however, it is a WONDERFUL product for a great price. Great for kids' TV, and adults.***", "verified": true, "helpfulness": "1/1", "author": "Mika"}, {"rating": 5.0, "review": "Neat little box.  Can get alot of \"stuff\" on it.  I already subscribe to Hulu Plus, Netflix and CBS All Access.  Although that CBS thing is a story on it own.  Of course, that's another whole story.  It is not the Fire TV's fault.  Still learning and growing with it.  Very excited to see all it can do !!  I do wish the little box had an \"on, off \" switch.  It kinda comes on at strange times !!  But, I'm good.....I'm going to keep him !!!", "verified": true, "helpfulness": "0/0", "author": "Humlou"}, {"rating": 5.0, "review": "I have enjoyed a lot of programs and movies on fire tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "it was dead on arrival.  waiting for a replacement to be sent", "verified": false, "helpfulness": "0/1", "author": "roberto addoms"}, {"rating": 5.0, "review": "A+++", "verified": true, "helpfulness": "0/0", "author": "joseph gallante"}, {"rating": 5.0, "review": "Better than Roku 3!", "verified": true, "helpfulness": "0/0", "author": "HCDC201 \"Jeremy B. Daniels\""}]