[{"rating": 5.0, "review": "Our family is loving the Amazon Fire TV.  Haven't even touched all the options yet, but we are looking forward to everything Amazon Fire TV has to offer.  Recently at large family celebration, while everyone was chatting and relaxing after a good meal, we quietly switched on our Amazon Cloud Photos on \"slideshow\" and Pandora music.  Then we enjoyed watching the family as the photos caught everyone's attention, finally drawing everyone toward the wide screen TV to watch our family history slideshow.  Soon everyone was laughing and remembering and enjoying the show.", "verified": true, "helpfulness": "2/2", "author": "Grammy"}, {"rating": 5.0, "review": "I love the voice command feature! It works great, much better than our old one which was another brand. Fast shipping and great packaging too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The FireTV shows plenty of potential as a media streaming/entertainment device.  It's OK out of the box with Amazon video streaming, Netflix, Hulu, etc.  I hope more apps make their way to the device as time goes on.  Noticeably missing is a Spotify app!BEWARE those of you with data caps on your broadband provider.  This thing will chew threw it like a fat kid eats cake.  In 3 days it ate up nearly half of my 300 GB cap with Cox Internet.  From what I can tell, it depends on the show that you watch, as there aren't always 1080p streams available for a given show.  I could not find an easy way to downgrade the stream so as to not use so much bandwidth.  If you have the speed, it will try and use the maximum at all times by default.  I ended up setting QoS (Quality of Service) on my router.  This forced the FTV to choose lower bitrate stream (looks like bad mobile YouTube).  I may give it a little more bandwidth to increase video quality.  But this is pretty advanced stuff for the average user.  Hopefully Amazon will address this in a future update.", "verified": true, "helpfulness": "4/5", "author": "socos"}, {"rating": 3.0, "review": "good for watching reruns of old shows", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I am not sure if spending 99 dollars and then still having to pay for movies, and old ones that have been out 20-30 years. the search feature is good, it does find your searches, but then you need to pay to see them, unless it's in prime .", "verified": true, "helpfulness": "0/0", "author": "Diane R"}, {"rating": 5.0, "review": "The only way to watch TV!  Pictures great, easy to use interface.  We don't use the voice search much, or play to many games yet.  Need to explore them more.I hope voice search works with more apps soon... I also hope there will be more \"live\" news channels available....  That's the one thing I miss about dropping cable.The other wish would be to allow slideshows/picture viewing from something like Facebook or Google+.  I don't want to have to manage another online source...", "verified": true, "helpfulness": "0/0", "author": "EP"}, {"rating": 5.0, "review": "Great little device!", "verified": true, "helpfulness": "0/0", "author": "Yadi"}, {"rating": 5.0, "review": "Really do like this product. We order this along with the Roku 3 and use both of them on different TV's and they both work great and do a very good job. The amazon fire remote is a lot better I think than the Roku remote but that is just me, we are very happy with both of them and would but another one with out any problem.", "verified": true, "helpfulness": "0/0", "author": "ronnie"}, {"rating": 4.0, "review": "I tried this for a month thanks to amazon.  Like it so much chose to keep it.  So simple to use and navigate, easier than the clunky smart tv on our samsung tv.  So small and easy to set up.  So glad we bought this.", "verified": true, "helpfulness": "0/0", "author": "Jeff Teal"}, {"rating": 3.0, "review": "The device works fine.  The free content is worth what you pay for it - old movies and B-list TV shows.  I expected a lot more from Amazon.", "verified": true, "helpfulness": "2/2", "author": "J. Murphy"}]