[{"rating": 5.0, "review": "i like the fact you can customize what you pay for and not pay for channels that you dont even watch at better price than cable or satelite!i shaved 100.00 of my bill which is worth it!", "verified": true, "helpfulness": "0/0", "author": "john macejko"}, {"rating": 5.0, "review": "Great entertainment center.  Using this box with Prime, and a Netflix membership is the way to go for media on demand.  The menue structure and search function takes a little getting used to, but with a little trial and error you will be flying through your apps, and checking out all the free prime videos in no time.My 9 year old loves all the fun apps and shows she has found to watch on the Disney channel on Sling TV.  I have a hard time getting the remote back from her most days.", "verified": true, "helpfulness": "0/0", "author": "Fletcher"}, {"rating": 5.0, "review": "Easy to use with no problems. Just hooked it up, logged in and watched my favorite shows", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got rid of the $100/month fee to my cable company for the $99/year Prime.  I am disappointed that so many of the shows I want to watch have a fee, but I have been able to find enough to watch without the extra fees.  I am happy that  I got the fire tv.", "verified": true, "helpfulness": "0/0", "author": "Trisha"}, {"rating": 1.0, "review": "Please CANCEL my FREE subscription.  Obviously I misunderstood.  I have to pay.", "verified": false, "helpfulness": "1/10", "author": "Dorothy"}, {"rating": 5.0, "review": "Amazon Fire is so much better than google Chromecast. We LOVE it!  It is so user friendly!  There is almost never a delay.  It is awesome!  It has made streaming so much more enjoyable! It is super easy to set up and use. It is a really good product and I wish we'd bought one for our household a year ago.  We bought one for the living room and then a week later we loved it so much that we bought a second for the master bedroom.  It is a great way to stream and alternative to cable.", "verified": true, "helpfulness": "1/2", "author": "Shoe Maven"}, {"rating": 5.0, "review": "Simple for anyone to install and use.  I'm not a techie, and I'm 70--and I installed it by myself and have used it for some of my favorites, including the Roosevelt series, Downton Abbey, British mysteries, and lots of factual programs.", "verified": true, "helpfulness": "1/1", "author": "Sandra F. Strange \"bookladyEnglishteacher\""}, {"rating": 5.0, "review": "I love my Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Beth Rudisill"}, {"rating": 5.0, "review": "When our satellite misfunctioned, a friend brought her Amazon Fire for us to use until our system could be repaired.  After my husband learned to use it, he fell in love with it - I knew we had to get one also.  He watches several shows/movies a day using the Amazon Fire (totally retired).  I understand that the Amazon Fire can also handle Netflix streaming - considering that also.  May have to buy a second system so that I can use it too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Freezes, lags, just an utter pile, but a Tony and be flab you did.", "verified": true, "helpfulness": "1/12", "author": "chris stockwell"}]