[{"rating": 5.0, "review": "Very fast great  buffering,  Very nice", "verified": true, "helpfulness": "0/0", "author": "N A"}, {"rating": 1.0, "review": "Not what i expected, i already have movie, series programs.etc", "verified": true, "helpfulness": "1/9", "author": "Esdras Paredes"}, {"rating": 5.0, "review": "We are so happy we purchased this, we bought another one. Excellent product all around. Far superior to Roku, in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 3.0, "review": "Here are my _opinions_ regarding this device.  We currently have a Roku 3 on the family TV.Interface 1. Amazon, you need to simplify, simplify, simplify!  Don't rely on voice search for people to find everything. 2. Allowing for a grid layout would make it much nicer and make it much easier to find content. 3. Actually, allowing for pretty much ANY customization to the interface would be very beneficial.  a) Ability to hide channels we don't use  b) Ability to pin apps that we use frequently into a FIXED position for us OCD folks.  c) Ability to launch apps we sideload from the home screen.Extensibility 1. The ability to sideload additional Android apps is awesome.  For example:  a) Plex for PlexPass is not available in the Android App Store (caught up in approval process???)  b) XBMC, VUDU, Firefox, Flash and alternate launchers can be loaded  c) I assume it violates the warranty, but if you don't update to the latest software you can root the device.Hardware 1. USB port that I've heard you can hook up a wireless keyboard to (not tried) 2. Quad core CPU means that everything it does, it does fast!Bottom line 1. My wife and kids don't like the interface and want the Roku back in the family room so that will happen. 2. I will either return this or move it down to my man cave where only I use the TV.  a) If I keep it then I will definitely replace the default launcher application so I can launch apps with one or two clicks.  b) I updated the software so can no longer root the device, or I would do that, too.Amazon, if you up your game when it comes to the interface, you would have a great box here when you compare it to the competition..", "verified": true, "helpfulness": "2/4", "author": "Thad Peiffer"}, {"rating": 5.0, "review": "Excellent, tiny, powerful streamer!", "verified": true, "helpfulness": "0/0", "author": "rateIT"}, {"rating": 1.0, "review": "Worked great for the first week of use but now the device is stuck on the screen saver. How do I get it working again?", "verified": true, "helpfulness": "0/4", "author": "Norma L sanchez"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/1", "author": "Michael H."}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "pamela s wollet"}, {"rating": 4.0, "review": "We love our Amazon Fire and would of given it 5 stars, but whats the point of siging up for Prime at $99/yr if most of the Amazon instant video you have to rent? I hoped that with a Prime membership and the Amazon Fire box we would of had access to so much more, like our Netflilx and Hulu Plus accounts. We are still keeping our box to stream our other accounts and hope that eventually Amazon instant video will have better access.", "verified": true, "helpfulness": "0/0", "author": "Bridget Kraushaar"}, {"rating": 4.0, "review": "Really fast. Voice search is great!", "verified": true, "helpfulness": "0/0", "author": "Jason McDermott"}]