[{"rating": 3.0, "review": "Nicely engineered but... after a few months of Netflix it plays movies in a tiny box in the upper left corner of the TV screen on 4K TV in 1080p mode. It also quickly ran out storage for games and other programs. It needs more storage. It's about to go back to be replaced by AppleTV or Midnight box. You need to root it before connecting to router if you want to get to GPlay store. Kodi side-load works great, do your FTV homework first. I haven't tried alternate controllers. I'd like to send audio out to BT or Airplay receiver.", "verified": true, "helpfulness": "0/0", "author": "John Hayes"}, {"rating": 5.0, "review": "Amazon fire tv is awesome. Works great and very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Robert Iturralde"}, {"rating": 1.0, "review": "Nothing is free. Not only are you forced into watching commercials while watching HULU,unless you pay for PRIME, you get charged on your Amazon account.Hulu and Netlix both have an additional monthly charge for service.", "verified": true, "helpfulness": "2/3", "author": "Jack F. Rose"}, {"rating": 3.0, "review": "note what I thought it would be. you still have to purchase a lot of shows.", "verified": true, "helpfulness": "0/0", "author": "julie sloan"}, {"rating": 4.0, "review": "Loved the Fire TV. So far it works well. Except, for the jumping of the shows we tried to watch at the beginning of the shows. It's easy to use. I have not tried out the voice enabled as of yet. Maybe, later.  Over all, my husband loves the Fire TV. Just wish Fire TV had more movies in Sci- Fi genre.Less of a selection than Netflix. But it does seem to have more current movies.", "verified": true, "helpfulness": "0/0", "author": "momof2inMi"}, {"rating": 3.0, "review": "I wish there were more app channels such as Discovery and TLC. The app channels that require a code to access do not have Time Warner Cable as an option for service provider so I can't even use them.", "verified": true, "helpfulness": "0/0", "author": "M Harper"}, {"rating": 5.0, "review": "super good streaming", "verified": true, "helpfulness": "0/0", "author": "curtis"}, {"rating": 5.0, "review": "Is MUCH better than any other streaming device I have used.", "verified": true, "helpfulness": "0/0", "author": "Jason S. Taylor"}, {"rating": 5.0, "review": "Great product, works well and has great parental controls.", "verified": true, "helpfulness": "0/0", "author": "Neal Dietrich"}, {"rating": 5.0, "review": "This thing is awesome! Voice recognition works without flaw. Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Donald David  Downey"}]