[{"rating": 5.0, "review": "Exceeds expectations!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just love it , the search is the best", "verified": true, "helpfulness": "0/0", "author": "mcmoore2"}, {"rating": 5.0, "review": "Awesome picture quality and sound quality. And a wide selection of genre.", "verified": true, "helpfulness": "0/0", "author": "Jane Cline"}, {"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "0/0", "author": "Ricky"}, {"rating": 5.0, "review": "Absolutely love this app. We don't have cable or satelite and this is perfect.", "verified": true, "helpfulness": "0/0", "author": "Gustavo Taranto"}, {"rating": 5.0, "review": "I love my Fire TV.  I had no trouble hooking it up and setting it up within minutes I was browsing through it and have been since watching TV shows and Movies.  Once or twice I have had a issue with my internet, but that is a rare occurance", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"joderae\""}, {"rating": 5.0, "review": "I love it.  This was given to me as a Christmas gift.  I did not like watching TV because to me there really wasn't anything I wanted to see.  But now I am enjoying the Hallmark movies and many other shows.  It is so easy to operate.  The voice activate is excellent.", "verified": true, "helpfulness": "0/0", "author": "Pauline B. Pachec"}, {"rating": 5.0, "review": "Awesome media Device. I ended up buying 2. I would recommend this over others I have an Apple TV 2 and the Amazon fire puts it to shame. Video streams in 1080p I can also play games & music that I download from Amazon. All media is shared with devices on my account. I would recommend over any other devices. Only downside is you can not use the usb port for external hard drive. Other then that it's pretty solid & fast.", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 5.0, "review": "Awesome! Great! We love it! Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jamie Robatin"}, {"rating": 1.0, "review": "No, Amazon Fire TV did not meet my expectation!  It will only work in the morning and not every morning.  Around 10:00 AM it starts acting up -- with it's constant downloading.  I have DISH Net and they tell me I have the most powerful system that they have so it must be your system.  Also I'm suppose to get books for free so I bought 3 Kindle Edition books and was charged for them.  I'm not seeing how great this Prime is!", "verified": false, "helpfulness": "1/3", "author": "Icechest"}]