[{"rating": 5.0, "review": "I just installed the Amazon Fire TV yesterday and found it to be a snap to setup. The four step process is easy to follow and the box found my WiFi connection quickly. The little animated movie that followed the connection process was fun to watch when it explained how to use the product. I love the voice activated search which I find to be very accurate. This is something that Apple might consider for an update to my Apple TV. I watched a Prime movie last night to see if it would be a buffering problem and had no problems or issues. I can see this as a much better product than the Google Chromecast which I had to return. It offers more content too. Another comment regarding this product is the quality of packaging. It is shipped in a custom box that could be considered to fit an expensive watch! Each of the three pieces that make up the Amazon Fire TV are individually wrapped and set in a nice form fitting compartment. I believe that Amazon will have a big hit, especially with Prime members.", "verified": true, "helpfulness": "1/1", "author": "Thomas N. Gilmore"}, {"rating": 4.0, "review": "I ordered my new amazon fire TV on Wednesday evening and had it and had it by Friday afternoon.  Easy to set up and as advertised the movie set up is quick!  I have been enjoying ever since!", "verified": true, "helpfulness": "2/2", "author": "Bob Borgren"}, {"rating": 5.0, "review": "Hi,Not a lot to say? Bought this with no HDMI cable, only using the (composite / yellow, white, red) on my tv with the RUKU). Some of my \"Instant Video\" stuff is older shows (just standard definition or worse?) but glad to say that when I bought the Amazon standard HDMI cable everything is playing fine! Also, love games & the new AMAZON controller for the many, new offerings seems really appealing!Also, Amazon sells a \"Toslink optical cable\" for your music library. Yes, more money BUT I don't like to use those apps that will always need some of your \"ID\" info, rather just buy the cable (around $6.00).--------------------------", "verified": true, "helpfulness": "1/1", "author": "CAPRICORN ONE"}, {"rating": 2.0, "review": "We have had the product now since April 7, 2014. The biggest problem we have had during ownership is that about every 45 days of use it won't play any TV or movies on any service including Amazon Prime and Netflix. Support has you to first clear the application data. If after that does not work support has you to reset the device to factory defaults. So the first time this happened the clearing app data worked and the second time it happened it did not work and we had to reset it. Now, after a clear data you must reconfigure the application again to work. After a reset of the device you must run through the entire one hour of setup. Where is downloads its update, you connect it to your network, you register the device... all that. Ya it very painful.Besides that major major defect it also needs significant improvement is the parental controls. There is only one option for parental controls as of April 10, 2014 and that is to turn on password protection. What this does is to make it so anytime anyone wants to watch something or play a game you must enter the password. So, basically anytime you want to do anything on Fire TV when parental controls is turned on you must enter the password. Parental controls need to have many more customizable options before they will be useful.The only other issues that came up was during the installation process. Out of the box the product connected to our fastest in home WiFi hot spot automatically (5GHz). However it immediately downloaded an update. Right after the update was done it would no longer see the fast WiFi and instead would only see the slower one (2.4GHz). Rescanning for the networks would not find the 5GHz. I called support and they told me to pull the power cord on their Fire TV, wait 25 seconds and put power cord back into the Amazon Fire TV. After that it saw the 5GHz network just fine. So the setup is a little clunky, requiring a hard reset for the WiFi to be fully functional.", "verified": true, "helpfulness": "2/2", "author": "Ron"}, {"rating": 5.0, "review": "If amazon instant video is your primary source for streaming movies or TV then this is a great product for you. It definitely gives Amazon first priority.If you primarily use other services such as Netflix then this device has excellent performance but it is no different then any other streaming device for Netflix.The UI is intuitive but it needs a few little refinements. The bluetooth controller is good but it sometimes moves too fast (scroll pressed once but moves two or more panels) but I am not sure if that is an issue with the UI due to the higher performing hardware or the user.", "verified": true, "helpfulness": "1/1", "author": "JPM"}, {"rating": 5.0, "review": "Amazon Fire TV is an excellent resource for abundant entertainment opportunities.  Extremely easy to connect and the ease of operation is fantastic.", "verified": true, "helpfulness": "1/1", "author": "CHIMOIKE"}, {"rating": 5.0, "review": "Never been easier to watch movies and tv shows. Navigation is easy and it practically sets itself up. If you are a prime member do not hesitate. The music apps are a little choppy. No technical issues so of now. So far it's great.", "verified": true, "helpfulness": "1/1", "author": "Vicki Quesenberry"}, {"rating": 5.0, "review": "The Fire TV is great.  Easy to connect and loaded with movies, TV Show and game selections.  My first unit was defective and Customer Service was wonderful.  They worked with me and when it was determined it was the Unit, Amazon replaced it immediately. The new one works perfectly and I am very pleased.", "verified": true, "helpfulness": "2/2", "author": "Susan K"}, {"rating": 4.0, "review": "i allready have a tv that is a SMART tv but it did not have AMAZON as any of the channels to watch. i use my kindle fire hdthen plug it to the tv with the hdmi cord. but with the Amazon Fire TV i get MUCH MUCH more. i love tha my photos are there to show on my TV and i really love the voice control.the only thing i did not like is when useing the voice control it only searchs Amazon.but other than that it is the best....also the Game selection and graphics are GREAT. if you buy this make sure you also buy the game control.", "verified": true, "helpfulness": "1/1", "author": "randy teague"}, {"rating": 3.0, "review": "This purchase is for my grandchildren & husband, as far as I can tell they like it so that makes me happy.", "verified": true, "helpfulness": "0/0", "author": "Judy McBath-Brown"}]