[{"rating": 2.0, "review": "I am returning my Amazon Fire because my internet is to slow for it to work correctly. Even if my internet was not too slow I would still return it due to everything you can watch/play on it costs (even with Prime membership) and there was nothing it offered that I couldn't get free with my smart tv or movie app.", "verified": true, "helpfulness": "1/5", "author": "Amazon Customer \"Shay\""}, {"rating": 5.0, "review": "product worked OK for me.", "verified": true, "helpfulness": "0/0", "author": "gary johnson"}, {"rating": 5.0, "review": "works very well and easy to set up, the only problem we had was with our TV , not all of the input plugson the TV worked but once we found the one that did it worked great, still getting used to using it but not to much of a learning curve really. Enjoy it and hoping to replace cable with this , it seems that we may do it once we practice a bit and find all that we like on Amazon Prime and other things offered. Very similar to the Roku but a bit easier to use so far", "verified": true, "helpfulness": "0/0", "author": "Happy Amazon Shopper"}, {"rating": 5.0, "review": "I toggled between Comcast and Fire TV for a month. The Fire TV packaging is very Apple/Tiffany's-elegant! The fit and finish of the hardware is high quality (I even bought the game controller). Setup was easy, and if you have a blue light on the front panel after you've turned your TV off, remember to press the Home button and the Fire TV will go to sleep after a while. Unexpected pleasure--ordering apps at Amazon.com for the Fire TV and what...yep...they show up on the Fire TV when I get there. I've downloaded the History Channel, Smithsonian, Netflix--it's like I have a cable box just for me!  I am running 100mb Internet and don't have any problems with speed. I am just upset that I kept spending $166 on Comcast when I could have had this. p.s. the virtual fireplace adds a bit of ambiance to the room when I am working at home. Amazon: thank you, I love this thing.", "verified": true, "helpfulness": "0/0", "author": "Eric Scott Taylor, IV"}, {"rating": 3.0, "review": "Wish I had bought a Ruko - Amazon is too locked down - you need to \"Root\" this device", "verified": true, "helpfulness": "1/3", "author": "Rhett"}, {"rating": 3.0, "review": "It says 2GB storage, receiving messages that low on storage all the time. Just one streaming app I use a lot;", "verified": true, "helpfulness": "0/2", "author": "SENTHILD"}, {"rating": 5.0, "review": "Really a wonderful little device.  I have also ordered the usb Fire TV but have not received it yet.  I followed the directions and it was very easy to hook up.  I'm not an avid TV person but I do like movies on occasion.  I keep a prime membership and that is plenty of choices for me.  If it were not for my husband, I would only get basic cable and then use my box more.  It pretty much could do without cable.", "verified": true, "helpfulness": "0/0", "author": "Pattsy Yancy"}, {"rating": 5.0, "review": "so much better than paying for hbo, showtime, etc at $45 a month. Well worth the one time fee.", "verified": true, "helpfulness": "0/0", "author": "COURTNEY"}, {"rating": 1.0, "review": "I did a factory reset due critical low storage and now it keeps on showing it again,I called cust. Support and they can't fix the problem and they want me to so another factory reset so I decided to return it back.", "verified": true, "helpfulness": "1/8", "author": "noel"}, {"rating": 3.0, "review": "Works as expected. If your bored and want to watch old movies.", "verified": true, "helpfulness": "0/3", "author": "Stephen"}]