[{"rating": 5.0, "review": "Does exactly what I expected and was easy to set up. My only complaint is that when I do searches it doesn't automatically search Hulu and Netflix I have to do those individually.", "verified": true, "helpfulness": "0/0", "author": "OutdoorDude"}, {"rating": 5.0, "review": "Works better than the Apple TV. Plus it has microphone in the remote! Keeping you from having to type every little detail into the search bar.", "verified": true, "helpfulness": "0/0", "author": "Brian D. Smith"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Yesenia"}, {"rating": 2.0, "review": "I ordered this thinking I would use this to stream movies like my Apple TV. After having it for a couple weeks I've decided I don't even want to mess with it and returned it. If it does anything like my Apple TV, when it's working it's the next best thing to candy, but when it's not or it's just thinking forever and not downloading my movie it's not worth the agony. I'll either stream straight from my iPad or get the Blu Ray and have surround sound.", "verified": true, "helpfulness": "0/1", "author": "Mercedes"}, {"rating": 4.0, "review": "Works well, but the remote is wifi (can't use a generic universal remote with it) and it is much easier to find Amazon content than other content.", "verified": true, "helpfulness": "0/0", "author": "David W Thunes"}, {"rating": 5.0, "review": "Love the Amazon Fire TV and the push to talk feature. Comparable as far as ease of use and cost to the Apple TV. I would recommend both.", "verified": true, "helpfulness": "0/0", "author": "KR"}, {"rating": 4.0, "review": "If it weren't for so much lag in Netflix I would give it 5 stars.  Other than that, the Fire TV is great.  Voice Command works as it says it does, all the apps are functional, and I wouldn't change anything about it (besides the lag in Netflix).", "verified": true, "helpfulness": "0/0", "author": "Criscassee"}, {"rating": 3.0, "review": "I've had it about two weeks. I love the variety and ease of selection. It's a little early to tell how it's going to work out.", "verified": true, "helpfulness": "0/0", "author": "Michael Velasquez"}, {"rating": 5.0, "review": "We ditched cable before Christmas and I bought this to fill the void.  There are tons of apps and what-not available to pass the time and not pay $170 a month for crappy T.V. programming.  We did have to download updated software when we first logged in so some of the apps would work.  It took just a few minutes and things have been great every since.  We have had no real buffering issues that some other reviews spoke about.I am very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Alan"}, {"rating": 2.0, "review": "The Amazon Fire TV itself is fine.  However, the two triple A batteries that the product came with for the remote did not work at all.  Then I went out and bought another pack of Triple A batteries at the store.  After using the Fire TV for one sitting, the batteries would die every time!  Then I went out and bought the heavy duty rechargeable Triple A batteries that the Amazon Fire suggests that we get and even those went dead after every use of the Fire TV!  Either I have a faulty remote or this product really stinks.I would not recommend this to anyone as the remote has been wrought with problems.", "verified": true, "helpfulness": "1/2", "author": "Remic"}]