[{"rating": 4.0, "review": "Found it easy to setup. Learning how to use the program format came fairly easy. We have only had it for a little while but look forward to much enjoyment from all its features.Had I known beforehand, I would have ordered an audio optical adapter to connect to an external audio system.", "verified": true, "helpfulness": "0/0", "author": "Alan C Pratt"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Ty8765"}, {"rating": 5.0, "review": "Works great, was concerned since we are on long distance wireless ISP!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"k.a.\""}, {"rating": 1.0, "review": "I was disappointed to find it is difficult to limit the available selections to just the Amazon Prime free viewing options.  It also goes almost immediately into the next episode when you are watching a TV series of shows. I DO like the fact that the remote does not have to be pointed at the box and works from quite a ways away from the actual Fire TV box. We have a smart TV and I do not think my $99 purchase of this box was worth the money.", "verified": true, "helpfulness": "1/2", "author": "Susan Coady"}, {"rating": 1.0, "review": "Having lots of trouble with it.  The TV now flickers which it didn't do before.  It is not easy to navigate around.  It is virtually impossible,to get any customer support for,this via phone.  Big Ugh!", "verified": true, "helpfulness": "1/3", "author": "Mary B. Schindler"}, {"rating": 5.0, "review": "Got this as a Christmas gift, and I absolutely love it. It was a snap to set up. It came registered to my brother's Amazon account since he had ordered it, but it was very simple to switch it over to my account. I now use as my prime way of watching tv (we have cable but I've found I prefer my Amazon TV). I also find this easier to work and navigate than Apple TV and would definitely recommend it over Apple. The voice search is extremely accurate as well - every time I've used it, it has brought up exactly what I was searching for. All in all, I love this product and would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Amanda W."}, {"rating": 5.0, "review": "The Fire TV is awesome. I bought a new tv but didn't want to spend the money on a smart TV, in doing so I saved hundreds. I then received this as a gift and it completely changed the way I use my TV. I don't need anything else on my tv, even my cable box since it has an app for that! Everything is in high definition, it's overall a wonderful item. I would recommend this to anyone.", "verified": false, "helpfulness": "0/0", "author": "Pete C."}, {"rating": 5.0, "review": "Nice technology.  Set up is easy.  While the number of entertainment options is fewer than Roku, the important ones are there (Hulu Plus, Netfllix, Pandora, Amazon Instant video, etc).  If you're an Amazon Prime user, it gets even better with hundreds of free movies, a good range of TV shows, and Amazon exclusives.The truly nice touch is voice control.  If you want to find a favorite movie, TV show, or actor, the remote control allows the selection to be spoken, and does a quick search to turn up all of the ways your selection can be viewed.  In my use of the voice search it has never made a mistake, always correctly interpreting my request.  I should also mention the remote.  It is a well thought out, even elegant, bit of hardware.  Small yet easy to find among the couch cushions, the control ring and the buttons have a positive feel, their operation becomes quickly familiar.Finally, I like the speed of the unit.  I use a wireless connection and find there is never any lag in the video or sound.  Picture quality is very good even on our largest TV.  Bravo Amazon!  Nicely done.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have been an Apple TV user for years, this device allows more flexibility, more power, better remote, and decent interface.", "verified": true, "helpfulness": "0/0", "author": "John Davis"}, {"rating": 5.0, "review": "Great product!!! Can't say enough how easy to use it is...", "verified": true, "helpfulness": "0/0", "author": "Chuck C."}]