[{"rating": 5.0, "review": "Better than Apple TV and I am a true Apple customer with IPods, 2 IPads and multiple Apple computers.  This brings together my Netflix and Amazon videos.", "verified": true, "helpfulness": "1/1", "author": "William McGuirt"}, {"rating": 2.0, "review": "I love this product. Alas, why can't I build my own play list? It would be so much more amazing if I could make a list, check it twice. And let it play on and on and on. Maybe it's just me but I love waking up to the show of my choosing. Sometimes I don't want to wake up to a screen saver and silence. Sometimes I want to set the fire to go off at a time of my choosing. I need these options. If you work for the fire department heed my words. You can be the first to do this or the last.On top of everything above me. I just found out through a friend that a movie I have been waiting for to become a new release was actually available yet it wasn't to be found.  I had to ask fire to find it (via blutooth microphone). Really?  What is going on in the fire fighter department?  Are you too busy relishing the fact that amazon is the best thing ever?  I stand up for you all every chance I get. I just want to sleep at night knowing I can trust what I see on the screens you give me. Bad form.", "verified": true, "helpfulness": "1/2", "author": "Skot"}, {"rating": 3.0, "review": "I purchased this and a Roku as part of my cord-cutting initiative.I like what this box does in terms of playing video, etc.  But... what most surprises me is the fact that I can't access my Amazon MP3 player.  It offers Pandora, et al but seems to only want you to see your Prime videos (with very little file management) and your photos, also not very user friendly.  Interesting that the non-Amazon apps are much more friendly than access to my Prime Cloud, especially when I want to listen to music.  The Roku offers a much better interface app for my Amazon Cloud Player, etc. Add to that the Roku allows you to plug headphones directly into the remote and you have a winner hands down.  Sorry Amazon.  I'm going to leave the Fire Box hooked up but frankly won't use it that much... but I'm hopeful they improve the capabilities.", "verified": true, "helpfulness": "1/3", "author": "Albert R Hydeman"}, {"rating": 4.0, "review": "AFT short of getting 5 Stars for one reason, locking down the access to google play. Amazon did a great job with this device, Am sure there is more to come looks like they are just testing the market. My Advice to Amazon give the consumer the choice don't lock down other source or app repositories like google play.Great/Fast media and game player", "verified": true, "helpfulness": "0/1", "author": "otmane jdia"}, {"rating": 5.0, "review": "FireTV is amazing.  I have been a long time Apple customer, and admirer of everything Apple.  When I got the first AppleTV it was pretty good.  When the 3rd gen AppleTV was released and the iTunes store became what it is today, it got even better.  Now that FireTV is out, it completely blows the AppleTV away!  I loved Amazon Prime streaming, but only could watch through my iPad or laptop.  I purchased a new Samsung 60in almost specifically for Amazon Prime streaming but found that the TV was super chatty on my network and no longer felt comfortable with my TV connected to the internet.The FireTV was super easy to setup and install.  What made it even better, when I plugged everything in it was already registered to my Amazon Prime account.  This cut down on the setup and made it almost effortless to start using it.  When selecting a movie, streaming is near instant.  Shows that are Prime eligible start playing in seconds.  Shows that require rental take a few extra seconds to authorize payment and begin playing.  This process is way shorter than AppleTV's.I am completely blown away with my FireTV, and use it almost every day.  Cant wait to try out some of the games that are available and more apps content is available.", "verified": true, "helpfulness": "2/2", "author": "Jeremy"}, {"rating": 1.0, "review": "It won't work with my surround sound system so it is completely worthless to me.  It has more use as a paperweight.  I wasted a lot of money on a piece of junk!", "verified": true, "helpfulness": "3/16", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So much to discover.  I absolutely love it.  Glad I purchased it.  Opens a lot of doors to movies I have never heard of and would love to watch.", "verified": true, "helpfulness": "1/1", "author": "bob navarrete"}, {"rating": 5.0, "review": "We are thrilled with the new Fire. You can choose from thousands of movies on prime. If you don't have prime, there are plenty of newer movies to choose from at very reasonable prices.", "verified": true, "helpfulness": "1/1", "author": "Barbara  A Martin \"\"love to write\"\""}, {"rating": 5.0, "review": "This is my first box of this kind and I did a lot of search before I purchased it. For those of you that have never owned anything like this and are wondering if it is worth the money IT IS !!!  This thing is SO awesome. Honestly I probably would have paid twice as much for it.Some things I love about this box:I can watch my YouTube workout videos on here. (they no longer show on Fit Tv but are all over YouTube)I love the Pandora feature. It is really cool just to be able to do that on my TVThe remote is easy to operate for people with long nails (I know, I know girly but true)So awesome when you have little kids that like certain shows a lot. You can just put on Bubble Guppies until their heart is content lolWill add more as I find new things.", "verified": true, "helpfulness": "3/3", "author": "yolonever"}, {"rating": 3.0, "review": "I've owned the Roku as well as the Amazon Fire. They are very similar and offer basically the same features. I liked how Amazon Fire had the audio search however I have learned it is pretty useless. You can only search Amazon database. For example, I might search for Kitchen Nightmares. It will list all the episodes on Amazon which you can purchase and most is not free even with Amazon Prime. It does not search the other apps like hulu or Netflix for episodes. On top of that, I usually have to repeat myself several times before it recognizes what I'm saying. As for Amazon Prime, probably the only beneficial thing about it is that it comes with free shipping. Most of Amazon Prime moives and tv shows are  offered on Hulu and Netflix. I already have a subscription to both. So, why should I pay an extra $99 month? I don't see the benefit for me since I don't purchase too many items with costly shipping online throughout the year. It's alright.", "verified": true, "helpfulness": "1/4", "author": "Nicky"}]