[{"rating": 4.0, "review": "First time user.  Very impressive so far.  I bought the device to get the kindle on the big screen TV.  Have not tried Hulu or Net Flix yet.  The reviews on them thus far scare me right now.  But I'm loving the ability to watch my shows from the Prime right now on the big screen.  Its what I bought it for.  Could not believe how easy oy was to install.  Love it thus far.", "verified": true, "helpfulness": "0/0", "author": "Jo Huber \"Missing Ole Hawaii\""}, {"rating": 5.0, "review": "Great voice search", "verified": true, "helpfulness": "0/0", "author": "John F. DeLillo"}, {"rating": 5.0, "review": "We love Fire TV!  I found it easy to connect and the interface is very user friendly.  This was a great option for our family!", "verified": true, "helpfulness": "0/0", "author": "Nicki B. Hamm"}, {"rating": 5.0, "review": "Easy to set up and start.  Easy to search for favorite tv and movies. Can 'fling' programs from kindle to fire tv. Very happy with fire tv.", "verified": true, "helpfulness": "0/0", "author": "mslaura"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "ERNST BORCHERT"}, {"rating": 1.0, "review": "Amazon Fire TV was not for me. Starting off it had an audio issue. Seeingly if the program you were watching wasn't formatted for digital audio, that program had no sound through my TV speakers. So, anything older that I watched (I tested it with old Star Trek episodes) was video only. I'm assuming this could be fixed if I outputted sound through speakers or a receiver. The second reason I did not like it was the search feature. Although the voice search is pretty cool, the search results only returned content from Amazon. The Roku, however, gives results across all apps you have installed, whether that be Netflix, Amazon Prime, Hulu+, etc. Lastly, Amazon Fire TV did not have an agreement with my cable provider, so I could not connect HBOGO. So, I returned my Amazon Fire TV and got a Roku 2.", "verified": true, "helpfulness": "2/3", "author": "Miguel D Harris"}, {"rating": 5.0, "review": "amazon fire tv is everything that i have read...easy to set up;easy to navigate;when you select a movie or tv show it starts without any load time or buffering. this is the best device i have bought to date", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "irina"}, {"rating": 5.0, "review": "This is easy to set up and with Amazon prime and Netflix you have plenty of movies and tv shows to watch.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "Excellent device. Very fast and responsive. Kids love it, there are enough games on amazon.com to keep them busy. Only caveat would be the limited internal storage (8GB). It took a week only to fill it up. Streaming wise (Amazon, Netflix, BBC News) works perfect.", "verified": true, "helpfulness": "0/0", "author": "Sorin M"}]