[{"rating": 2.0, "review": "The Matricom G Box is way better. Amazon has done a great job in keeping open source customers from getting their entitled content. This unit is the crown jewel of an example. So hey Amazon, make it free or offer a rebate for paid online content and it's worth it. Otherwise, don't waste your money on this or a roku. BTW, nice work on the comparison. lol", "verified": false, "helpfulness": "2/24", "author": "Crane Hardware LLC"}, {"rating": 5.0, "review": "Let me note a couple of things:1. With a Prime Account this is amazing, otherwise IDK2. Perfect for a causal gamer3. Perfect for a family living room with kids (I dont have teens)4. The UI is impeccable5. The Bluetooth remotes are to die forHaving owned everything from Roku to OUYA this little box filled the hole in my living room. The truth of the matter the purchase of FireTV for me started with a problem, my smart TV.  While sleek looking and having great picture quality the smart part of my smart TV, like all smart TVs, is a gimmick to sell.  It functions, but with such error and overall slowness that it led me to look for other options to consume online media on my television. What I have found with the FIreTV is that amazon took account of this and made what I would have asked for.  Sleek, simple to use, and with enough horse power to run almost any game you could think of. I cannot say enough good things about this little box.How should the FireTV grow:1. Voice Search - It needs to be universal.  I want it not just to search prime, I need Netflix and Hulu to be searched as well.2. Home menu - Again, being universal is a necessity. I want to see my last shows I watched, watch lists, recommendations, ect to be right there. Partnering with Netflix would be odd, but could only benefit both parties.3. Remote - VOLUME BUTTONS. Its rather frustrations going from a smart TV where I need one remote to having two. With new HDMI technology you can integrate volume buttons that relay back to the TV and it would be amazing to have. Also a headphone jack wouldn't hurt.", "verified": true, "helpfulness": "37/45", "author": "Deck of Cards"}, {"rating": 5.0, "review": "First if you are a person who watches TV series in marathon sessions, its a must have with its prefetching.We've had problems with both the Xbox 360 & our Vizio TV providing Amazon so the change in Fire is awesome.For anyone who has used a TV that doesn't ... it does have your Watchlist.It understands Seasons so you just need to find the show and it does the rest.Games have been fun, but limited amount available.The mic based search seems to kick Kinect's but so far too.The Most Recent being a combo of Games, Media Content, is nice.All in all it does provide a better experience than our other two sources but ...Okay the downsides that I think will all be taken care of through updates:- No Play from the beginning so those of you like me who cut out soon as the credits begin, this could be a nuisance on rewatch.- No next episode, but the season interface is much nicer so it isn't that big a deal.- The controls in games seem quirky, not sure if that is an issue with the controller or the game provider but don't expect like an Xbox Arcade quality.- Make sure you disable your key for viewing Prime/Purchased material unless you want to go nuts.The Yes they are trying to sell you part- Okay so Xbox you've got only Prime & your Library and its kind of a PIA to look for something else you end up using a computer. You kind of get used to that. On the TV and on the Fire a lot of the lists they provided you with are intermixed. Also you'll find several shows are not marked Prime, but when you get into them they are.- It is VERY easy to buy something you are watching on Prime, so make sure you require your Key to buy.I still think it is a full 5-star though because the downsides are VERY minimal so far and nothing I wouldn't expect dealt with based on user feedback.And frankly it is way further than the 1st Gen Kindle Fire was or for that matter any of the other devices I had used to try to stream Amazon content.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "PRO The voice search really works and is really FAST the Fire TV is great it very responsive device. set up was easy. So if you have amazon prime content than this the box for you. It's also has the main apps that I use Netflix hulu plus and amazon. The plex app does work great on it. I put my music and video and it's played all of it. so far it has more potential than the Roku3 which I also have, its faster than it hands down.  so I am very happy with it. it also plays gamesCON The voice search is setup for amazon and at this time and the USB is not able to use yet. as I said I use plex. the box is still young. it also doesn't have as many apps like the roku3.It still need vudu app because I have content on vudu.I would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "Monte"}, {"rating": 1.0, "review": "I wanted to love this, but can't.  I have used it for a week and Netflix has froze 3 times with a white screen requiring a in lug of the unit. Finding free amazon content is almost impossible if you just want to browse.  Can only use voice search on amazon stuff a huge disappointment. Power is always on there is no power button.  My Vizio tv has Netflix and Amazon so why did I buy this again? Very disappointed.", "verified": true, "helpfulness": "224/257", "author": "Dewayne"}, {"rating": 3.0, "review": "Just got it and have no problems setting it up and running. definitely a much superior media player than Roku and any other out there in the market. But lack of apps, i got more apps on my Sony blue ray dvd player and Roku.", "verified": true, "helpfulness": "0/4", "author": "paul"}, {"rating": 2.0, "review": "I own several streaming solutions (Roku3, Chromecast, Xbox 360, solutions built into TVs and Blu-ray players, and many older things too ancient to mention). I had some initial connectivity problems, wired Ethernet didn't work (but I didn't spend any diagnostic time on it). WiFi connection worked well, but reported slow download (I've got a slow 3/1 DSL line, maybe that was the issue). The feel of the software is VERY speedy compared with the Roku, and even the Xbox. Graphics loaded faster than I have come to expect, especially with my slow DSL line. Netflix and Youtube seemed more stable than usual as well, with less buffering.My complaints mainly stem from how the free Prime videos seem to be hidden behind layers of paid episodes. With my 3 and 5 year olds in the room, I did a voice search for one of their preferred shows that I knew was free with Prime, and up popped dozens of episodes that were new and exciting to them. All showed costs associated with them, with a few showing up as 'watch now'. I know Amazon wants to sell stuff, but getting my kids all excited over episodes that I'm never going to buy was a bit annoying. There should be a 'Hide all but Prime' mode.An advanced network diagnostic mode would be nice. When I had initially tried connecting via wired Ethernet, it failed with a generic sounding message advising powering off the unit. Would be nice if it would display the IP settings, MAC address, or more failure info.The microphone search should extend into Netflix and other Apps, maybe by adding in a \"Search Netflix for...\" header to your search request.HBO Go is a notably missing App.The Plex App (nice and low initial price, thanks!) worked better than any of the other Plex implementations I've seen so far. Very speedy as well.The future multi-user parental controls and dedicated kids content sounds quite interesting, I can't wait to see how that turns out.All in all, a nice unit, but could be so much better.5/31/14 UPDATE:  Down to 2 stars...As far as I can tell, there's no way to integrate this unit into a home automation system via direct IP control. There seems to be a way to kludge it together with an IR to USB converter, then IR bugs on that unit from the home automation system, but that's pretty lameI've had a constant battle with scaling. It would great if the unit could save the various scaling options on a per-resolution basis. My TV is 1080p, and my projector is 720p. I usually have to run the various screen scaling wizards every time I switch displaysWhy the heck does it ask me for my PIN number every time I want to watch a Prime video? It's free... I don't feel like I need to authorize a $0 purchase.", "verified": true, "helpfulness": "6/9", "author": "A. Yalowitz"}, {"rating": 3.0, "review": "the device is pretty good and easy to use.  it really makes me crazy that the default option for amazon prime video is not the free video included with my prime membership.  i've accidentally bought a couple of shows because the free prime version is not the default.  pretty tricksy move by amazon, I am Not Pleased.", "verified": true, "helpfulness": "6/8", "author": "E. Flynn"}, {"rating": 1.0, "review": "have the apple tv, shocked this fire tv doesn't have mlb.tv.  will be returning the product.  tons of reviews on the fire state that the fire tv supports mlb.tv.  shame on me for not contacting amazon before i purchased the product", "verified": true, "helpfulness": "12/30", "author": "JJB"}, {"rating": 5.0, "review": "Sure... it does the same things the $60 Roku does but the interface is amazing and the speed on this unit is unmatched. Buffering is nonexistent and for me that's worth the extra money alone.", "verified": true, "helpfulness": "1/2", "author": "Kenton T."}]