[{"rating": 5.0, "review": "Fast shipping and it works great!", "verified": true, "helpfulness": "0/0", "author": "Online Addict"}, {"rating": 4.0, "review": "I'm 65 and scared to death of new electronic devices, but love using them.  This device was easy to set up and easy to use.  What more could I ask.", "verified": true, "helpfulness": "0/0", "author": "Linda K. Hughes \"Cookie Lover\""}, {"rating": 5.0, "review": "Love love love", "verified": true, "helpfulness": "0/0", "author": "Amy R."}, {"rating": 3.0, "review": "not pleased, I was thinking that the fire TV would be more like the Roku where there is more access to other sites that offer a variety of information(cooking,religious,healt,etc) not simply more movie applications that charge for movies. I do find the redeeming quality of the Fire is that the move search is very good for documentary's,one of a kind movie and tv show. But I am not able to give up the Roku.I provides a more rounded list of programs and materials.", "verified": true, "helpfulness": "0/1", "author": "scooter c"}, {"rating": 1.0, "review": "I bought this product because I thought it would be better, more powerful, more flexible than my $30 something Chromecast and my Roku. NOT! I can't even cast a video without buying a program. What's up with Amazon? I had made a choice to go with lots of their products because I thought they were different from Apple. They are just as bad. I'm very disappointed with this product and how inflexible it seems. All I got extra for my 100 bucks was voice control and I don't even need that much. If I had it to do over again, I'd get the Chromecast or the Roku.", "verified": true, "helpfulness": "0/1", "author": "Stephanie Morgan"}, {"rating": 5.0, "review": "Great unit for kodi! Nothing else works in Canada though so be aware Canadians", "verified": true, "helpfulness": "0/0", "author": "charity wagner"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "jose jimenez"}, {"rating": 4.0, "review": "Still not enough \"live\" feed. Everything else is great.", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 5.0, "review": "Amazing product meet my standards great for the family an children one push of a button an your on your favorite tv show or movie a cool feture is the voice command great product money well invested", "verified": true, "helpfulness": "0/0", "author": "Elmer"}, {"rating": 1.0, "review": "Disappointed, to say the least.  Connectivity is spotty, stops working periodically, what ever I am watching freezes or turns to fuzz at least 3 x an hour, or doesn't work at all.  Major pain in the neck to be watching something and having it go out. Reminds of when cable first started in the 80s and would go out all the time, remember yelling \"Cables Out!\" as a kid? get used to that with Amazon Fire.", "verified": true, "helpfulness": "1/2", "author": "PTE"}]