[{"rating": 4.0, "review": "I like my Amazon FireTV....my only gripe is that I wish there was a way to allow you to stream local content. If not, to allow an external drive or thumb drive to be used in the USB slot so that I could watch movies locally....there have been times that I wish to watch what I have on my PC that I can't find on Prime or YouTube or any other streaming service I subscribe to. But, outside of the PLEX issues, I don't have any real complaints.", "verified": true, "helpfulness": "0/0", "author": "James Dauphin"}, {"rating": 5.0, "review": "Originally bought the Fire TV Stick.  And while I was satisfied with it, it needed a speed boost.  So, I bought this one, and i'm liking it a lot.  It's so fast and effective.  And it is now all my entertainment available from one interface, including hbogo which the stick doesn't have yet.  And the ability to sideload apps makes things even sweeter.  I'm using it to run emulators among other things.  Overall great product.", "verified": true, "helpfulness": "0/0", "author": "Mike V"}, {"rating": 5.0, "review": "I am very pleased with Amazon fire tv. It works great. It was a snap to hookup, as long as you have an hd tv and a strong wifi signal you should not have problem. I have Amazon prime so I have hours and hours of content. I am glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "muzik lover"}, {"rating": 5.0, "review": "So far, this little black box is the best thing since my router boosting my internet service! Gives my house cable without all the extra bills and I couldn't have asked for a better gift. Thanks, Amazon, for the creation!", "verified": true, "helpfulness": "0/0", "author": "JCara"}, {"rating": 5.0, "review": "love it!!!", "verified": true, "helpfulness": "0/0", "author": "richard synmoie"}, {"rating": 5.0, "review": "Amazing product. I use it almost everyday with my Home Theater!", "verified": true, "helpfulness": "0/0", "author": "Heriberto J. Alvarez \"Hery16\""}, {"rating": 5.0, "review": "This streams at a high rate and is great for kodi/xbmc!!!", "verified": false, "helpfulness": "0/0", "author": "terrence cromartie"}, {"rating": 5.0, "review": "Very easy to install. I love the remote, because you don't have to \"aim\" it at the unit. I have mine behind the TV and works 100 percent. I find this a great feature. Works with my Belkin Wi-Fi without any refreshing. The Belkin is a N-dual band router, again \"streams perfectly\". Full 1080P on all the movies and shows! The voice command works as described, very cool feature! I only had this for one week and don't like giving reviews this early, but this thing just blew me away! I do have Amazon prime which helps big time for free or extra content. So, keep \"Prime\" option in mine if you purchase this unit. Remember, Prime is $99 dollars a year, BUT gives you many extras not only with Amazon Fire. I don't want to sell this review boosting Prime, but I like the free two day shipping on all \"Amazon orders\"--cool feature. Oh, I forgot to mention that the price was marked down from $99 dollars to $84 dollars and this helped me to decide and give it a try! Glad I did! So much more to talk about, but little time I have. Hopes this review helps?", "verified": true, "helpfulness": "1/1", "author": "Albert E. Behrens"}, {"rating": 5.0, "review": "This is amazing.  I am so tickled to get Amazon Prime & Netflix on my tv.  And the verbal command function works great.  I'm a low tech gal but this was so easy to set up.  I am thrilled there's finally a way to get what I want where I want it, without the monthly cost of cable.", "verified": true, "helpfulness": "0/0", "author": "Bess"}, {"rating": 3.0, "review": "Originally purchased this as a gift for my father. He wanted more viewing options and ease of browsing now seeing he isn't tech savy, but loves movies. I felt this might be ideal, especially with voice command. The device itself is nice, the prime options are less than satisfying falls well short of what Netflix has to offer.Eventually the device might provide better value but there are numerous other options if you are looking for a device to steam audio or movies which serve other purposes.", "verified": true, "helpfulness": "0/0", "author": "James P. Dean"}]