[{"rating": 3.0, "review": "We ordered this device as soon it was available and have been using this since April 2014. Primarily use it for Netflix, Prime and Youtube. The Voice search works well but with only Amazon stuff and does not work with other apps like Netflix, Youtube etc. Not a big fan of the remote. Since the remote works via bluetooth, its very easy to activate it by accident and its super annoying. There should be a hard button to lock/turn off the remote. Something we discovered by accident is that the Fire Tv can be controlled by our Sharp TV remote. The original remote batteries lasted only 3.5 months. Amazon should release smart phone/tablet apps to control this device for better ease of use. Other than some of the drawbacks listed, the device is fast and good value if your Smart TV does not have a good set of built in apps.", "verified": true, "helpfulness": "1/1", "author": "Lakshmi Shweta Katreddi"}, {"rating": 5.0, "review": "Love it!You can also install XBMC on it, which makes it even better because you can access your own media through this little box too. I no longer need to wire my PC to the TV.", "verified": true, "helpfulness": "1/1", "author": "Frenchy \"Mrsharky\""}, {"rating": 5.0, "review": "This is awesome!  I originally purchased it so that I could mirror my Kindle to my TV and stream, but then I found out I didn't need to do that with the Fire TV, that I could stream straight to the TV, even better!  It works great, and I haven't had any issues.  I did have a bit of difficulty getting it to work initially, but that wasn't Amazon, that was owning a Samsung.  I called Amazon customer service twice.  The first person I got took me through some steps that didn't work, eventually reaching the conclusion that it wasn't compatible and I could return it for a refund.  Disappointed and not wanting to give up, I called Amazon support one more time before shipping it back, and she had me up and running in about 10 mins.  Since the Fire TV is so new, it just came down to encountering a customer service rep who hadn't dealt with my issue yet.  I'm glad I made the second call!!  Well worth the money.", "verified": true, "helpfulness": "1/1", "author": "KAR"}, {"rating": 5.0, "review": "Sweet, slick, and fast.  Lives up to 'as advertised'. Once you register, about as plug-n-play as you can get; super-easy setup.  Comes without a high-speed HDMI cable for connection to your HDTV, so make sure you order one along with the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "mtr_01"}, {"rating": 5.0, "review": "The Fire TV box has been great. I've watched full seasons of a few shows, a lot of movies, and found it to be easy to operate and fun to own. I think Amazon gives you a lot of \"machine\" for the money. Only issues include the following:1) Sometimes, the unit loses touch with the TV through the HDMI cable. I have to generally turn the TV off and on again to reestablish the link. No big deal, and possibly an issue with the TV, not the Fire TV box.2) On very dark scenes, you sometimes loose pitch definition with the movies coming through the Fire TV. This means that you really can't see what's going on, other than murky shapes moving in the darkness. I haven't noticed this on the TV with other sources, or with movies streamed to my laptop. Not a deal breaker, but something to consider.Overall, the HD picture has been crisp, and the box rarely has to \"buffer\" during the showing of the movie.The purchasing process for the box is easy and quick, and the shows are available right away.Setup was a snap. No harder than setting up any wifi-capable device, and easier than most, as Amazon sent it pre-configured for my account.If you don't have a smart TV, this with provide you with the functionality on an older unit. High value for the money, and provided you avail yourself of the free content, a great value going forward.", "verified": true, "helpfulness": "0/0", "author": "Patrick Tracy"}, {"rating": 5.0, "review": "Amazon Fire TV gets my highest ratting...  I know you don't care but it works great...", "verified": true, "helpfulness": "0/1", "author": "Patrick Wellins \"I am a teaching pastor for Calvary Faith Center in Rancho Cucamonga CA.  Love my wife at peace with my kids, and adore my grandchildren!\""}, {"rating": 5.0, "review": "I use plex and netflix and this thing is super powerful.This sounds weird but there might be too much amazon all over it. I love amazon and I have used their media services but if you don't rely on their services, then you don't get to fully take advantage of the device.If you were a die hard amazon services person this would be perfect. I did find myself cruising the HBO stuff on Amazon now because it was right there in my face.", "verified": true, "helpfulness": "0/0", "author": "Joseph W. Manning \"I buy stuff on amazon everyday thank you PRIME\""}, {"rating": 2.0, "review": "The device is one of the most powerful in the market, and for that I would give it 5 stars.  The only concern I had prior to purchasing is the lack of Apps and I was right.  I am a DIRECTV subscriber and I can use nothing that requires a cable service provider.  For example Showtime, Espn, Disney and many others.  This is very frustrating because the apps I am able to access are available on other devices at no cost.The device quality and speed are excellent and it is another amazing Amazon high end product, but for DIRECTV subscribers beware.  I will continue to use my Ruko device as it supports DIRECTV.  Hopefully as time goes on an agreement will be reach for this satellite service.", "verified": true, "helpfulness": "1/4", "author": "Jimmy Mc"}, {"rating": 5.0, "review": "I have used other similar products, but Fire tv is by far the best. No lag, very intuitive, the price is worth it.I had no setup issues, and since it come already set to my prime account, it was virtually good to go right out of the box.I would recommend this to anyone who uses youtube, Netflix, and most definitely Amazon Prime.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really enjoy this little magical stream TV. It is so fast and I love the feature and it's apps.  Their movies are quite expensive though since I am not a prime member.", "verified": true, "helpfulness": "0/0", "author": "Yve"}]