[{"rating": 4.0, "review": "Works fine and easy to setup..", "verified": true, "helpfulness": "0/2", "author": "George McGinn"}, {"rating": 5.0, "review": "I have had every one tv box, but the fire tv is by far the best I have 3 fire tv's now and I put my apple tv's on retirement.Super clean interface, incredibly fast, a super cool voice control. This is by far my favourite of all times!!", "verified": true, "helpfulness": "0/1", "author": "EDUARDO J BAZ"}, {"rating": 5.0, "review": "Love this thing...we started out with the Roku player back when they first came out. We used it when there was nothing else on and we were happy with it. A friend gave us an Apple TV and it was ok but I didn't like the limited buttons as it took too long to navigate screens. When we got the Amazon Fire TV it was like upgrading from a analog TV to a digital model. The picture is better the controls are awesome and you can search by voice. TV done right, way to go Amazon.", "verified": true, "helpfulness": "0/1", "author": "Rodrigo R. Garcia"}, {"rating": 1.0, "review": "Not  for me, it wouldn't let me watch movies from my home media server. unless I side load special software or use plex pass which you have to pay for", "verified": true, "helpfulness": "0/3", "author": "Ty"}, {"rating": 4.0, "review": "Does what it's supposed to do. Small and compact and most important it's wifi.", "verified": true, "helpfulness": "0/1", "author": "Patrick Fitzgerald"}, {"rating": 5.0, "review": "I'm not going to repeat what everyone else has already said.  OK, I'll repeat a summary:- FAST FAST FAST.  No lag.  At all.  Apps start up very quickly.  I primarily use Netflix as my video entertainment provider and access it across all platforms (cell phone, XBox, Mac, iPad, et. al).  Netflix is by far the fastest on the FireTV unit.  Because performance is such a big deal for me, it's why I gave it 5 stars.- Remote works great.  I love that it doesn't use IR.  You don't have to have line-of-sight in order to use it.  I've seen negative points about the remote and I disagree with them all except when it comes to gaming.  It definitely stinks as a game controller, but it isn't intended to be one.  So I really like the remote.- Voice search rocks.  This is a two-part bullet point -- Voice recognition (VR) and what it actually searches.  For VR, I normally HATE voice recognition software.  Every other piece of software I've used is mediocre at best and usually just plain bad (XBox Connect, I'm looking at you).  This thing works perfect everytime.  No training.  No need to e-nun-see-ate the words.  Just speak normally and it correctly identifies what you said.  For the results, it is a big disappointment that it doesn't search other applications .  It ONLY gives you amazon content results.  I was actually expecting that, so it doesn't bother me too much, but I know other products search everything so it's an area for improvement.- Easy, straightforward interface.  This is very subjective.  I like it because I'm not a fan of bells and whistles that don't provide functionality.  Give me a simple, intuitive interface any day over a dog-and-pony show.  So unlike a lot of other reviewers, I like the FireTV interface.- Good customer service.  Early on, I noticed my remote needed a software update (you read that right -- the *remote* needed it, not the box).  While attempting to update it, the download seemed to hang.  Long story short -- I got in touch with Customer Service quickly and the rep was as helpful as she could be.  (It turned out to be nothing, really -- just that the software package is large and it has to stream it to the remote itself, which is very slow).There are areas that could be improved, but that's true of anything.  The big thing for me, is it completely met my expectations, which very, very rarely happens.  I'm probably going to get a second one for my TV in the pole barn since the apps on the TV are sooooo sloooow.", "verified": true, "helpfulness": "0/1", "author": "C. Dombroski"}, {"rating": 4.0, "review": "This is a great product when combined with other streaming software. Check the internet for the list. They reason I purchase it was for its storage size and it ability to utilize 2.4 ghz and 5 ghz wireless network. Boy its been a blast ever since I set up this bad boy. Streaming has never been easy and fast.*I say buy it if your a prime member. there is a lot of free content for prime member plus you get to enjoy the voice command function*Don't buy this to play only games. Invest your money somewhere else. An extra 200 dollars to your budget should get you something better.*Buy if you plan on installing other streaming apps that may require huge space.Good luck.", "verified": true, "helpfulness": "0/1", "author": "ikenna3"}, {"rating": 5.0, "review": "I wish you had Comedy Central. I love that show and John Stewart. I would like to see his nightly shows before he departs.", "verified": true, "helpfulness": "1/1", "author": "Tony"}, {"rating": 5.0, "review": "5/5 Works great, so much better than a firestick.", "verified": true, "helpfulness": "0/1", "author": "Jason"}, {"rating": 5.0, "review": "We like it better than Apple TV. It's faster and voice search is awesome.", "verified": true, "helpfulness": "0/1", "author": "Khaki"}]