[{"rating": 4.0, "review": "Works very well in my sun room.  I would recommend to friends and family.  I have not yet been able to install a media player like Roku to view pictures from my net storage drive.", "verified": true, "helpfulness": "1/1", "author": "Bruce Singleton"}, {"rating": 4.0, "review": "We're happy with this device. Except that the menu button apparently does not work so we're unable to have captions on Prime content. I have to say that if you aren't a prime member(or if you don't subscribe to at least two of the services available) this device is not for you. The cost of renting movies from Amazon would be dumb..use Redbox if you're in that situation. Or sign up for the cheapest streaming plans.The other issue I have is that sometimes a Prime eligible show shows as Prime on other formats(Fire tablet, PC, etc) but will show as pay to rent on the Fire TV screen of the television. This is not, however, probably a FireTV issue because it happens when we attempt to stream the show over our xbox as well. I can be sitting in my bed watching a show for free on my tablet but when I decide that I'd like it on the big screen I can't stream it. I've got an email in to support, hopefully they can fix that for me.All in all we'd still purchase this item. It replaced the xbox for our bedroom television and cleared up a ton of space. I really like it.", "verified": true, "helpfulness": "0/0", "author": "S. Thomsen \"veruto\""}, {"rating": 5.0, "review": "I love this thing, Works great. excellent picture quality.Very simple easy setup.Hardest thing was the network password,Who the hell knows that? This beats all the other streaming media players, chromecast, Rouku. Buy this.", "verified": true, "helpfulness": "0/0", "author": "Robert Ethridge"}, {"rating": 3.0, "review": "I have this hooked up via a wired ethernet connection.  Worked great out of the box.Much like the Kindle Fire the menus are intuitive(imo) and easy to use.Once installed apps load up fast, but mileage may vary if using wifi(Just like any other media box)The main reason I could never give this 5 stars is because you can not plug a usb into it to play movie files.  As someone who has stored all DVD's into storage and keeps rips of them on data storage this is a big deal.  On the Roku I was going to replace I have been able to play all my kids shows(it's main use) as well as some of my movies without having to turn on my playstation and retrieving the DVD from it's admittedly unorganized library.  Keep in mind most Roku's also do not have local storage capabilties, I just happened to buy the model that allowed it.Apparently the USB shown in the picture is supposedly there for Developer use and possibly for some future accessories.I was fooled by the preview pictures into thinking the USB could be used for external storage, but I can't exactly blame the product description as nowhere does it state that it has this application.  I do think the side by side comparison it shows with other products should have this feature compared as well.This is great for streaming and for access to the store(which let's be honest is what companies like Amazon,Google, and Apple make these devices for).  For my personal use I just want a box that loads items fast, has great streaming capabilities with a decent quality picture, and of course plays my video, music, and picture files without directing me to cloud use. I have a place for it in my household, but not as my main media box.  So far my Roku beats out even my Playstation for commonly used features as I keep the Roku on at all times without feeling it heat up.  Until I find a device that outshines what my Roku currently does, they will continue to get my money.", "verified": true, "helpfulness": "0/0", "author": "Barry Fountain"}, {"rating": 1.0, "review": "Loads more then the movie lasts. I have it right next to my Roku, to compare. I can watch two movies on Roku before I'm capable to watching one on Amazon. Too frustrating.", "verified": true, "helpfulness": "4/6", "author": "Gloria Lopez"}, {"rating": 5.0, "review": "Wonderful product!  Highly recommend. Easy to set up and use. Not just for Amazon. We also use it for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Emma"}, {"rating": 5.0, "review": "I have been using the Amazon  Fire TV for about two months now, and it is the best $100 I have ever spent. I have now cut off all cable TV service, installed a digital antenna for local stations and use the Amazon Fire TV for watching all of the regular shows I usually watch. The setup is easy and the navigation is a breeze. The only problem I had was last week when it was difficult to download programs, but I discovered that it was because available memory was running low. I found out that I could easily correct this by clearing data in the \"Settings\" menu.", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 3.0, "review": "I enjoyed the product, but it was too expensive compared to Google Chromecast.  It also duplicates a lot of things that are already on a smart TV if you have 1(I do)", "verified": true, "helpfulness": "0/2", "author": "Marshal Goldberg"}, {"rating": 4.0, "review": "I have the roku, google and Apple TV and this is faster the all of them. I only wish that the voice search worked with Netflix, etc.  other than that, I got no complaints. Glad I decided to try it.", "verified": true, "helpfulness": "0/0", "author": "ceg1"}, {"rating": 1.0, "review": "I received my Fire TV a week ago.Installation was no brainer, took 2 minutes.Remote works well, though voice search needs improvement.Navigation works well.2 problems:1. Deceptive information by Amazon.com: I bought the device primarily for free streaming \"thousands\" of movies and TV shows and old HBO series. I started to watch one such HBO show, \"Broadwalk Empire.\" Clearly marked as \"Prime,\" meaning no extra charge. What wasn't said, and extremely deceptive, is the fact that only some episodes at the beginning are free, than you need to pay for each episode although I'm a \"Prime\" member, and since inception. Sneaky and deceptive....if I knew that I needed to buy after certain number of free episodes, I wouldn't start watching it. Amazon marked it as \"Prime,\" implying that it is free, while it is not except for the some episodes....sneeky and very deceptive.2. Several times in 1 week the streaming stopped and it took 2 to 20 minutes each time to resume. I have extremely fast cable connection (check the strength often), and each time I had this problem the modem and the router was functioning well, i.e. not related to connection issues.", "verified": true, "helpfulness": "49/54", "author": "Izzet Ozdogan"}]