[{"rating": 5.0, "review": "The single nicest thing compared to all competing products is 'NO BUFFERING\".  There are no delays; ever.  The Search function works well too.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "I love the Amazon Fire TV. I have it in my office and catch up on some of my favorite shows while I work, streaming for free through Amazon Prime. Perfect for what I need! :)", "verified": true, "helpfulness": "0/0", "author": "Rachel Quatkemeyer, author of This Extraordinary Life"}, {"rating": 5.0, "review": "this has allowed us to watch more on a TV set that only carries basic TV but in a room warmer than the room with full TV showing. Very easy to install and run even for us elderly.", "verified": true, "helpfulness": "0/0", "author": "Doris A. Clark"}, {"rating": 1.0, "review": "it's just not for us, my wife has the tv on all the time, and with fire that doesn't work, You have to pay for everything, and if we need  to pay, we just aren't going to enjoy it. money is the reason I won't be staying with prime, also.", "verified": true, "helpfulness": "5/26", "author": "Mdcrusier \"H\""}, {"rating": 5.0, "review": "Very simple review.. This is just amazing and hands down beats the ROKU for speed and ease of use. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Richard C. Hartung"}, {"rating": 4.0, "review": "I don't have cable in my room so this is perfect. I love amazon instant video, and that is mainly what I watch. I am not impressed with the offerings of hbo or other cable apps. I am not into Hollywood movies. I really like the fact that you can buy or rent shows right off the box unlike the app where you have to leave and go to the amazon site to make a purchase. For some reason I have trouble accessing crackle but other than that it's great.", "verified": true, "helpfulness": "0/0", "author": "liesel strong"}, {"rating": 3.0, "review": "The hardware specs are nice and user interface is snappy. But lack of HBO2GO and the fact the hardware costs around $25 more than what I can pick up a Roku 3 on sale makes it only 3 stars for me. Maybe down the road or when more apps become available it might be worth it but until that happens I would say save your money and get a Roku 3.", "verified": true, "helpfulness": "0/1", "author": "Gregory L. Stout \"Rodan1967\""}, {"rating": 5.0, "review": "Simple to use.  Fast and Responsive. Never had a streaming lag or any issue yet.  All of the layout and menu organization have been easy to use and navigate unlike the Amazon Video built into other devices.  I already had a large Amazon video collection, this made accessing it on the big TV a breeze.  Since I received it 2 weeks ago, 95% of what I have been watching has been through the Fire TV.  So very happy with it, Absolutely Loving It.", "verified": true, "helpfulness": "0/0", "author": "WRM3"}, {"rating": 4.0, "review": "Loved the ease of programming my new Fire TV but noticed inconsistencies within apps. It's not compatible with cable so I have to unlock one and 're-hook the other and that's a hassle. Overall it's an improvement over the usual garbage other companies content. I figure it can only improve.", "verified": true, "helpfulness": "0/0", "author": "Cindy Beard"}, {"rating": 5.0, "review": "Great streaming box, used it for a couple weeks now. No problems .  Very happy! Considering the gaming controler. Haven't tried gaming yet looks promising. Would have liked more storage, at least 16 if not 32 gb", "verified": true, "helpfulness": "1/1", "author": "TufRap"}]