[{"rating": 4.0, "review": "I learned something today.  I have a cable subscription that includes HBO and Showtime.  I assumed that if my cable company had a deal in place with the channel I would be able to watch the channel on all of my devices.  I can watch HBOGo on my Smart TV,  windows computer, my Android tablet, my Android phone, my old Roku 1 (I bought the fire TV to replace this), Xbox 360, XBOX One, my son's Playstation 3 and 4, and my wife's iPad.HOWEVER,  my cable company (Charter) doesn't support HBOGO on Amazon Fire TV.  I debated back and forth between a new Roku 3 and Fire TV and decided Fire TV was a better fit for me.  I was really disappointed about the premium channels.  I gave the device 4 stars because it is super fast and very responsive.  I also liked the separate game controller and game selection. I sent it back and got the Roku 3 so I could access my premium channels (The Roku 3 works great BTW).My suggestion to you is to go to the \"activation\" websites (ie: hbogo.com/activate) for the \"cable\" apps you want to run to be sure your cable company supports them.  Don't  assume because they work on one device that they will work on another.Also, I give Amazon's return policy 5 stars.  Easiest return ever.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this! Easy to use and not as glitchy as my Apple TV", "verified": true, "helpfulness": "0/0", "author": "Aimee Maher"}, {"rating": 4.0, "review": "An excellent product and it is my preferred tool for streaming. BUT. I am using it with a 4K UHD TV and it does not list nor play 4K UHD content. Please fix this and my rating will go up.", "verified": true, "helpfulness": "0/2", "author": "Robert E Collins"}, {"rating": 5.0, "review": "LOVE THIS!!!", "verified": true, "helpfulness": "0/0", "author": "Summer"}, {"rating": 4.0, "review": "Excellent product....I bought it just to use Sling TV and it works great!", "verified": true, "helpfulness": "0/0", "author": "Nate browne"}, {"rating": 5.0, "review": "Installation was easy.  The remote takes a little getting used to, but I'm able to easily watch my content from Prime and HULU.  To clarify my comment about the remote, the remote is small and I have a large hand span.  Not as easy for me to use as a normal TV remote.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey McDaniel"}, {"rating": 5.0, "review": "Great item!!!", "verified": true, "helpfulness": "0/0", "author": "James A Crawford"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "timothy schenck"}, {"rating": 5.0, "review": "I love it you can finally watch everything on your tv", "verified": true, "helpfulness": "0/0", "author": "alec hay"}, {"rating": 5.0, "review": "I freakin' love this. Plays Hulu, Netflix, Prime(obviously) without a hitch. Plenty fast and you don't have to have line of sight for the remote...thank you radio!", "verified": true, "helpfulness": "1/1", "author": "Dan"}]