[{"rating": 3.0, "review": "Less Prime movies that meet my interest than I was hoping for.  I have to unplug the power supply and plug back in for each use.  As  my TV can't find the connection unless I do this.", "verified": true, "helpfulness": "0/0", "author": "Clint"}, {"rating": 5.0, "review": "Finally I don't have to hook my damn laptop up to the TV to watch my Amazon Prime videos. Streams better and the optical audio input is huge. Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Chuck O"}, {"rating": 5.0, "review": "I love it ! Great product! . Just wondering IF it has a browser apps.", "verified": true, "helpfulness": "0/1", "author": "Carlos L Tenorio"}, {"rating": 5.0, "review": "Now from the start if anyone was wondering I have no sort of bias for any of these products Fire TV, Or OUYA.AMAZON FIRE TVYou probably think the Amazon Fire TV is a media streaming  device (like roku or apple TV) that can play games right? WRONG!! The Amazon Fire TV in my opinion is better the the Roku and Apple TV combined, and I have both (which I ordered from amazon)Reasons why the Fire TV is better than the ROKU or Apple TVYou can play games with any bluetooth, or HID controller (no need to buy amazons $40 controller)You can attach usb keyboards or mousesAll your games that you purchased on amazon for your phone or tablet can now be played on your TV at no cost to you.OUYAUnlike the Amazon Fire TV the Ouya is not as plug and play simple. BUT!!!!! If you're tech savvy (like myself) you could unlock the full potential of theOuyaHere are some areas the OUYA beats the Amazon Fire TVYou can sideload unofficial games PERFECT for internet pirates (looks around the room with hands in pockets)You can play old emulated games on the Ouyas vast amount of compatible emulatorsThe Ouya has removable expandable storage (so when the FBI bust in your house all you gotta do is remove the usb stick ) lolTHE VERDICTSo which one of these devices is right for you? It depends are you a torrenting rom downloading jailbroken psp owning type of guy? Or are you a Kindle Fire HDX gaming Netflix watching, only trust ordering from amazon type of guy?The Fire TV has the faster processor \"Snap Dragon\" (same as iPad) but is limited on what you can do as far as openness to \"unofficial applications\" (which could change with development) But on the other hand the ouya has a \"Tegra Processor\" same speeds as the 2012 Google Nexus and is much more hackable I MEAN \"Customizable\" or \"Open To Change\"Article Written By: \"Squiggly Line\" QJ lol ~QJ", "verified": false, "helpfulness": "0/0", "author": "Quinstin Chandler"}, {"rating": 3.0, "review": "So far, I'm pleased with the snappiness and speed of the Fire TV. The interface is clean and easy to navigate. The device cannot be placed inside a cabinet. I originally had it inside a cabinet (that my cable box remote signal can penetrate) and I wasn't able to connect to my wifi network.My one peeve is that there is no \"off\" button for this device. You have to wait 30 minutes for it to go to sleep.UPDATE: After now having this box for about 4 months, I've noticed some quirks with it that require me to update my review. On random occasions, my apps are wiped from this device. Apps like Netflix, Hulu Plus, etc that I have installed no longer show as installed and I have to re-install them. This has happened about 5 times. Additionally, this box drops my wifi connection very frequently. I have upgraded, high speed internet and very infrequently have issues streaming content from my Smart TV or Apple TV. On the FireTV, my internet connection is frequently displayed as \"Connected With Problems.\" I'm not sure if I have a faulty unit, but the connection problems are enough to make me not want to use the device.", "verified": true, "helpfulness": "0/0", "author": "Lauren M"}, {"rating": 5.0, "review": "Best set top box on the market. Much better than Chromecast and AppleTV.", "verified": false, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 1.0, "review": "the people want an all inclusive television-hard-drive (between 1-3 terra-bytes)... ..expecting to pay a one-time-payment of about $199.00 -$599.00 (depending upon the cost for data-storage-devices)... ..what about \"live\" sports & entertainment??  Answer: forget about \"live\" sports because that always requires to have some sort of \"cable/phone hook-up\" and that almost always means recurring expenses instead of \"one-time-expense\"  .....I think there will be some \"preloaded-terrabyte-boxes\" and of course there will probably be ways to purchase \"semi-custom\" or \"fully-custom-boxes\"  ....(I'm really against the \"hook-up\" devices because of \"recurring expenses\" and \"privacy issues\" (you start to get that \"corporate-cable-experiences\" instead of \"family-enjoying-television-experiences\"))", "verified": false, "helpfulness": "1/21", "author": "TK Batniji"}, {"rating": 3.0, "review": "The TV box was easy to set up and has some great features, but there is NO local file playback so you can't play any non-amazon videos you may have on your computer.", "verified": true, "helpfulness": "0/3", "author": "Jennifer M."}, {"rating": 5.0, "review": "Very nifty! I don't pay for cable because I really don't care for it and how expensive it is. But I do love watching my shows so I just pay for fast internet and netflix. Fire TV is portable and super easy to use. And you can have other apps for it like Netflix and Hulu on there so you can watch all those shows as well. When I orginally bought it I thought \"man, i hope its worth the cost.\" and it is really. Its just what I need. I could really see college kids benifiting from a product like this too. No cable bill, just uses your prime account. I love it! I've had it for quite some time now and use it way more than I thought I would.", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 5.0, "review": "I love how fast this thing is.I love how accurate the voice search is.  The only thing missing is voice search support for Netflix which is supposedly coming.", "verified": true, "helpfulness": "0/0", "author": "KY"}]