[{"rating": 5.0, "review": "When I come home from work after a long day, get cleaned up relax and sit down to watch TV.The last thing I want to do is spend 15 to 20 minutes looking for a movie I've heard about . With the fire all I have to do is ask it and what I'm looking for is there on the screen. How cool is that!!", "verified": true, "helpfulness": "1/1", "author": "budbrockman"}, {"rating": 5.0, "review": "I love this little box. It is easier and perhaps even smarter than my \"Smart TV.\"  I am a tough one to please....and without hesitation, I love it!", "verified": true, "helpfulness": "1/2", "author": "manda"}, {"rating": 5.0, "review": "Pros:Fast loading mediaEasy setupEasy user interfaceExcellent wifi receptionExcellent video qualityExcellent audio qualityHas the basic apps that I use 99% of the time*Definitely recommend the Plex app for only $0.99 for your personal content and iTunes interfaceCons:No volume controlLimited infinite scrollingNo USB storage supportUtilizing the Plex app and a dedicated media server for my own library of content, plus the available apps on the device, this little box delivers almost all my family's media needs. The most likely missed hardware will be a blu-ray/DVD player for discs that we have and not ripped yet. We have not purchased any game controllers but see this as a plus in the future. Why it doesn't include a device volume control is puzzling? Also, it would be very helpful to have top-to-bottom infinite scrolling when you reach the end of menus. (Left to right infinite scrolling is available in some apps.)The complaints are nitpicking and could be resolved in an update. We wanted a device that streamed online content with smooth picture quality and good wifi reception. This device delivered...plus some.", "verified": true, "helpfulness": "2/2", "author": "Timothy Styczynski"}, {"rating": 2.0, "review": "First the positives:  The unit is definitely solid.  It is a strong box compared to my Roku3 and it is pretty sleek.  Additionally, setting it up (other than Showtime) was a breeze, and the issue with Showtime is more related to Showtime itself which can be difficult sometimes.  It is very cool that Amazon preloads your account info so my Amazon Prime info was already loaded, this small thing is something that shows Amazon knows how to please the customer.  Also I have Amazon Prime so I assume I have more access than many others (I have Hulu Plus and Netflix as well - a movie junkie).Now the BIG minus.  Why in the world would you have a USB port and simply not turn it on?  I like to move my movies from my laptop to a USB drive because it keeps my computer from getting filled.  I can put maybe 20 movies on a flash and back it all up on an external drive so I have all my movies, pictures, videos) saved and backed up without destroying the storage on my laptop.  I then watch movies (or used to) on my Roku3. In fact, I had hoped that I would not need to convert everything to MP4 because I assumed with such a robust system and processor it would not be as picky as the Roku on what formats were accepted.  So I packed up my old Roku and spent a good couple of hours setting up all my accounts just like I wanted.  I then put my flash drive into the new Fire TV and low and behold...nothing.  I tried to access the photos and was told I needed to upload any photos to the cloud.  I tried to find an App to access the drive and found out the USB port is nothing more than holder for your flash drives you can put them there for safe keeping until you boot up your Roku.I realize that streaming is the way of the future...but seriously.  Unlike those that knocked the system for not having HBO, I knew what I was getting.  I verified the apps I wanted and checked to verify it does have a \"USB 2.0\" port.  It seems a little disingenuous to state you have a USB 2.0 port but when you purchase the system you find out that the \"USB 2.0\" port is not actually a functioning item, it simply is a hole.  Very tempted to return...undecided at this time.", "verified": true, "helpfulness": "9/11", "author": "St. A Boiler"}, {"rating": 5.0, "review": "I bought this after getting frustrated with my Sony blu-ray player (I bought it for Netflix, amazon Prime, etc.) dropping my services whenever my router would reset. Have had no problems with this product so far, just wish there were more apps. I'm guessing these will come once the product is more mature.", "verified": true, "helpfulness": "0/0", "author": "Shawn M Cherry"}, {"rating": 5.0, "review": "What does Amazon do? Really? Essentially? They deliver. That is at the very core of their service. The Fire is a streaming service like many others, and has pretty much the same service apps as many other. But hers the difference: the experience is all about delivery.Each step of the physical delivery process was tracked by free text messaging, as you would expect. But out of the box the Fire TV was preset with all my wish list, recently viewed, pre-signed in! Amazon delivered me my content immediately.Literally 2 min set up and that was including plugging it in to power and HDMI. In fact I think it took be longer to make sure I had turned the HDMI connected the right way for the TV, than it did to set up the Fire.The voice search delivers both he content simply and seamlessly, (even taking into account my Irish accent), but also delivered one of the fun-est experiences for the kids. They adored asking the remote to find stuff. We have an xBox which we can use voice with, but Fire TV delivered a very real and fun tactile element,Great stuff... really great.", "verified": true, "helpfulness": "0/0", "author": "Thom Franey"}, {"rating": 5.0, "review": "First came my Kindle e-reader and I loved it!  High quality, excellent customer service and a perfect reading device for someone like me with visual difficulties, struggling to read regular books.Then came Kindle Fire HD ! Even better! Now I could read and do so much more! Again, a high quality device!Now Kindle FireTV! WOW! My husband & I love it! Netflix was horrible on so many levels! Our biggest problem was Netflix hardly had good movies to stream & we were extremely frustrated with constant stoppage while we were watching, and the price kept increasing.Now with our Prime membership we get even more benefits! It is a small device that packs a big wallop of all entertainment! All my iPhone apps & especially YouTube are on our large HD screen! It is so simple to transfer from devices! Movies are great! New Releases & love the large free Prime library as well.Also, being able to view our family photos on TV is wonderful, wonderful! - especially because our son recently was married and now we can see them and home videos on the big screen!Thanks Amazon for making life more fun!", "verified": true, "helpfulness": "2/2", "author": "Beverly Romance Books \"Beverly\""}, {"rating": 3.0, "review": "The voice software is NOT all encompassing. The voice search only is for Amazon media. We are heavy Netflix streamers and you have to load it as an app and do the regular arrow search for a movie/show. This was a huge disappointment because the voice search feature was the selling point vs. the competition. Hopefully they will do an update ASAP that encompasses searches in all media applications. Other than that the functionality is ok, and enjoy the style and options. One other big disappointment which may cause us to return this in the next week has to do with it's reboot capability/wifi. We lost internet connection twice and instead of searching for wireless networks it requires a physical connection in order to reset itself first. This means unplugging the device moving to another room next to the router attaching to another tv to boot up get it back on the wireless connection undoing it and moving it back to the desired location. Have had to do it twice so far. Reboot, factory reset (a pain to reinstall all apps and passwords) and it doesn't help. If we have to do this one more time without them fixing this on an update, it's going bye bye.", "verified": true, "helpfulness": "3/5", "author": "Sydney R."}, {"rating": 3.0, "review": "Great Interface, Great voice search, Big fan of Amazon, Big Fan of cutting the cord on my cable company...But missing two key components to run my living room!", "verified": false, "helpfulness": "2/5", "author": "dtpa639"}, {"rating": 5.0, "review": "I have an Apple TV and this product has it just beat out. Love my Apple products, but with the gaming this offers, the voice search, and it's quicker load speed, it has edged out the current Apple TV 3 model. Gaming can be a little laggy on some of the games, but for what you pay for, it is acceptable by far. No issues other than a couple of times in the nba game it has frozen and made me start game play over. Again, for the price, I do not expect ps4 type of experience. Streaming shows/movies is great as well. I do recommend it to anyone interested in it.", "verified": true, "helpfulness": "0/0", "author": "Joe B"}]