[{"rating": 2.0, "review": "The quality of rendering video is worse than Apple TV and Roku 3. Other than that - I like the snappy interface.", "verified": true, "helpfulness": "4/9", "author": "darp \"darp\""}, {"rating": 5.0, "review": "This compact dynamo is the best $99 that anyone can spend on their home theatre solutions. It is \"missing link\" in streaming in all regards.By saving the content through its new software delivery platform, buffering problems that traditional standalone devices (like RUKO, Sony Blue-Ray Players, X-box, Apple TV, etc.) have since many ISPs like Comcast and Time-Warner fail to properly allocate bandwidth for Netlfix, Hulu, Amazon Prime and similar streaming services that compete with them.It sets up quickly and easily. Even my 83 year-old mother could do it: this is truly plug-n-play. Amazon Prime video service is the main focus of the User Interface (\"UI\") but the second category shows the others: Hulu, Netflix, ShoTime To-Go, ESPN, and a couple of others. CNBC \"Fast Money\" traders gave negative responses to the device because they work for Comcast and don't understand technology. This is not just another streaming device. This is a game changer.", "verified": true, "helpfulness": "6/10", "author": "GECCO2 \"Geck\""}, {"rating": 5.0, "review": "This product is the icing on the Amazon cake. I dont want netflix or HBOgo cause I have Prime. It has all the movies I want when I want them. I should have bought stock in Amazon years ago :(  This is the best thing since sliced bread!", "verified": true, "helpfulness": "2/3", "author": "Mark Ice"}, {"rating": 5.0, "review": "Love it! It's fast, easy, and has a lot of great apps. Can't wait for HBO to come soon! Nice!", "verified": true, "helpfulness": "2/3", "author": "slh"}, {"rating": 5.0, "review": "I do watch TV shows on my PC from Amazon Prime on occasion.I have heard about Roku boxes, and Chromecast thingies, but my impression was that they only work with paid movie downloads. DOn't know if that is the case or not, but they never interested me.When this FireTV thing was announced, and it said it worked with Prime video stuff, I said \"okay, let's try this one\".It's a really small little box, and very unobtrusive. The remote is sleek and handsome looking. My only BIG gripe was with the owners manual, that did not explain or show one little speck of how to open the remote to install the batteries. I tried a few times to 'slide' the back off, like some other battery powered devices I have, and nothing happened. Eventually I figured out that the back needs to be 'pulled backward' to open it. Other than that, it was very easy to set up and get working.After looking at a few of the info videos, I tried Voice Search and it works as advertised. It instantly found a result, I selected it, and started watching the program on my 40\" TV versus a PC monitor. It was pretty cool.So I am a happy camper with this new box, it will allow me to watch my Prime \"free\" stuff on a big TV and that is all I wanted to be able to do.", "verified": true, "helpfulness": "4/5", "author": "Grumpa Tom"}, {"rating": 5.0, "review": "LOVE Amazon Fire TV. Great interface. Especially love the voice search feature. The apps work well and you can play Amazon Prime videos, which you cannot do with ChromeCast. I had a ChromeCast previously and Amazon Fire TV is MUCH better. The only drawback is it does not have HBO Go as an app. Wish it had this feature.Worth the price. The quad-core processor and memory is better then all other products currently on the market. Highly recommend.", "verified": true, "helpfulness": "1/2", "author": "Duane Bradshaw"}, {"rating": 5.0, "review": "Now this is something special.  I ordered it the first day it went on sale and it arrived two days later.  I hooked it up and it was as easy as they say. Plugged in the HDMI cable and power cord.  Presto, it had my wireless name and all information built in.  I spoke a movie name and within maybe one second or sooner it was on the screen ready to watch. Dallas Buyers Club for $5.99. This is the future especially for an old guy like me.  Do yourself a favor and buy Fire TV.", "verified": true, "helpfulness": "4/6", "author": "Mel Oster"}, {"rating": 5.0, "review": "Wow, this is so much better than the chromecast.  Works really well, no lag at all, great user interface and excellent at streaming movies.  If you're a prime member than its a no brainer given the free movies and tv shows available. Nice remote, just wish it had volume controls on it.", "verified": true, "helpfulness": "3/4", "author": "ny-state-of-mind"}, {"rating": 2.0, "review": "OK, I think my needs are relatively simple:-I want a device to stream my media library using PLEX- I want to be able to watch YouTube Videos-I want to be able to stream my Netflix queue- I need to be able to control all my media devices with one universal remote (Harmony) - I would like this experience to be fast and smoothI've tried everything: TIVO, Roku, AppleTV, GoogleTV, PS3, WMC and now the Amazon Fire.It is unfortunate that the Fire does almost everything I desire, except 1 showstopper: It has no IR capabilities.  In other words, I need to have multiple remotes to enjoy my media.  This is not acceptable to me or my family.  Consequently, after only a few hours using the Amazon Fire, I have disconnected it and am sending it back.A pity, its hardware is super.  It blows the Roku away in terms of responsiveness.  My Plex media load and stream very fast on the Fire (unlike the Roku which takes forever to cache even the cover art).I guess I'm going to have go back to the pokey Roku.Amazon, what were you thinking?", "verified": true, "helpfulness": "8/15", "author": "Cory C. Wagner"}, {"rating": 5.0, "review": "Fire TV installed very easily, upgraded itself and started working without any difficulty. The voice search worked the first time and has bee easy to use and effective. The remote works as expected. The menus are well organized and easy to use. My only disappointment is that MLB.TV isn't available.", "verified": true, "helpfulness": "3/4", "author": "J. R. Link"}]