[{"rating": 4.0, "review": "I have used two of these before. One was at a friends and it worked great on his but when I bought one I thought it was my internet. I kept getting a network error so I had assumed it was my internet and I held onto it for awhile. When I finally got the chance to test it out at his place where I know his works, mine gave the same network error and continued to disconnect and reconnect. Sadly by this time any return was out of the option and according to this I can't order another unless it's refurbished currently?  I had tried to find a solution in the forums but there doesn't seem to be any and as I mentioned above, I can't use any warranty or returns at this point. I guess the point is if you have a network error and the box keeps disconnecting and reconnecting, don't assume it's your router and wait to test it elsewhere. Sadly this will be a cost out of my pocket for something that didn't work the day I got it. Hopefully they offer it again so I can buy another someday.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 1.0, "review": "Disappointing, difficult to set up and we couldn't search just prime movies and shows.", "verified": true, "helpfulness": "0/1", "author": "lindalou"}, {"rating": 5.0, "review": "This little box is very impressive. It streams video with excellent quality even on wireless without perfect signal. I have not played games on it but as far as streaming HD video content it's just as good as the xbox one. I have used sling tv amazon prime video and Netflix on it with no problems. Even the apps like vevo work great.", "verified": true, "helpfulness": "0/0", "author": "CASCA \"casca21\""}, {"rating": 5.0, "review": "Love it! Easy, intuitive, reactive and comfortable remote. Nothing on the negative list.", "verified": true, "helpfulness": "0/0", "author": "Saundra A. Lewis"}, {"rating": 5.0, "review": "Amazing! The entire family loves it we get anything we want for shows.", "verified": true, "helpfulness": "0/0", "author": "Super Mom"}, {"rating": 5.0, "review": "Love it..... Got rid of my 200.00 month cable bill", "verified": true, "helpfulness": "0/0", "author": "M. Mallory \"in medical field\""}, {"rating": 1.0, "review": "Disappointed that Amazon didn't explain that some of the TV series they showed would cost extra to see.  Otherwise, it works okay.", "verified": true, "helpfulness": "0/0", "author": "Albert C Dietz"}, {"rating": 5.0, "review": "We love it!  We have cable internet WiFi upstairs and the TV system is downstairs. It was very easy to hook up through the AV Receiver and thepicture and sound are awesome.  Love the music channel too!  We also use Netflix movie with 3 out at a time so when they are mailed back we can choose to watch a movie with the Fire TV. We can't tell the difference between a movie disc and the Fire TV but it helps to have a awesome receiver too.", "verified": true, "helpfulness": "0/0", "author": "Kaydee"}, {"rating": 2.0, "review": "Everyday after being on for a few hours.. The screen goes blue. And I have to unplug the power cord everytime to get anything to pop up.. Very dissatisfied", "verified": true, "helpfulness": "0/0", "author": "GMB"}, {"rating": 5.0, "review": "Nice device.  Love the graphics.", "verified": true, "helpfulness": "0/0", "author": "Stephen Keller"}]