[{"rating": 5.0, "review": "have really enjoyed this since receiving it great movies", "verified": true, "helpfulness": "0/0", "author": "Thomas Crawford"}, {"rating": 5.0, "review": "well worth it everyone should get one", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 1.0, "review": "Well just after my warranty expired guess what? It died. Great Amazon, really appreciate it.", "verified": true, "helpfulness": "2/4", "author": "Richb \"Richard\""}, {"rating": 5.0, "review": "Love it much faster than the fruit one 😉😉", "verified": true, "helpfulness": "1/1", "author": "Eric Martinez"}, {"rating": 5.0, "review": "Easy set up and brings lots of content.", "verified": true, "helpfulness": "0/0", "author": "Harry W Wood"}, {"rating": 5.0, "review": "Good bye cable when contract is up next month your gone. I watch little tv to begin with many of the shows people have said to watch last season are available easy hookup.", "verified": true, "helpfulness": "1/1", "author": "liv2vac"}, {"rating": 2.0, "review": "Sometimes you just don't know what you are looking for until it's too late. I purchased Amazon Fire, but it's not a lot better than the blue ray player I'd been using to access Netflix, Hulu, and other streaming TV services. I pay for HBO Now, but can only view it on my iPad or computer. I should have done research first, because I would have purchased the Apple TV in order to have HBO Now stream onto my flat screen. HBO Go is available, but only if you have cable and pay for it that way. I'm through with cable. Who knows how long I will have to wait before Amazon streams HBO Now. Ugh.", "verified": true, "helpfulness": "0/1", "author": "Kiki Squirrel Books"}, {"rating": 3.0, "review": "I have to admit, I'm kind of disappointed. I bought this to partly replace and compliment my 5 year old AppleTV. But it has some issues.In Netflix it gets laggy. It's not that it is buffering. But it's like the box can't keep up with the video. It freezes for a moment or two but the audio keeps playing and then it catches up. I have a strong internet connection and have never encountered this issue on the AppleTV or Xbox One.Hulu freezes quite a bit. I end up having to back out and resume the episodes. It's to the point where I've stopped using the app in the hopes that they update it.It isn't all bad and that's why I gave it 3 stars. I LOVE the remote. The voice search is excellent and I love how you don't have to point the remote directly at the unit for it to work. It's nice and small and looks classy. The thing has real potential. I'm just surprised there are so many issues with it with how long it has been out. If the issues aren't addressed soon, I may think about replacing it or selling it on ebay.", "verified": true, "helpfulness": "1/1", "author": "Sarah"}, {"rating": 5.0, "review": "Very awesome MLB is the Bomb", "verified": true, "helpfulness": "0/0", "author": "6msw9"}, {"rating": 5.0, "review": "So far I'm enjoying this, and they are correct when they say the voice search actually works. Still learning the ins and outs, but having fun switching around my Amazon Prime, Hulu Plus, HBO go and Showtime anytime options.", "verified": true, "helpfulness": "1/1", "author": "Don"}]