[{"rating": 4.0, "review": "I like this little gadget. It used to reset often and I would have to program the wifi over and over again but it stopped doing that. Even if I unplug it now it automatically programs. Only thing is there is no off button. Why would they not make it with an off button? Kinda fishy there.", "verified": true, "helpfulness": "0/0", "author": "Anne Compau"}, {"rating": 5.0, "review": "This product is GREAT!!!! It meets all my TV and movie viewing needs perfectly (which is admittedly not real great, and limited to Amazon Prime, for the most part). It also allows me to view without any streaming problems (unlike the ones I had with my first Kindle Fire 8.9) PBS programs by downloading their app. Easy to set up, easy navigation. Wonderful!", "verified": true, "helpfulness": "0/0", "author": "tippy"}, {"rating": 2.0, "review": "Not impressed at all!  I bought this for plex support that was a headliner at launch but wont play surround for mkv files, stick with a roku", "verified": true, "helpfulness": "0/1", "author": "Frank Hoeft"}, {"rating": 5.0, "review": "I love this - wow - I'm cutting the chord so this will make life easier.  Easy to set up.  Really.", "verified": true, "helpfulness": "0/0", "author": "mare"}, {"rating": 5.0, "review": "Replaced a ROCU with the Fire TV and what a change. Every one loves and enjoys it. Plenty of free games and prime movies. Add the fire controller and you will have hours and hours of enjoyment. Exercise, Food, Music, Games Movies, just all kinds of apps. to enjoy.", "verified": true, "helpfulness": "0/0", "author": "cincydon"}, {"rating": 2.0, "review": "A friend gave me this because they did not like it.  I have a Roku box in the living room and wanted one for the bedroom.  The words on the screen are small and I'm not crazy about the layout/organization of apps and episode descriptions.  What I really dislike about it is that it automatically plays the next episodes.  My sleep timer shuts the TV off but it continues playing.  Also, since I got rid of cable as I save more money by paying for newer episodes on Amazon TV, the choices on Roku are $1.99/ep or $2.00/ep in HD.  This Fire TV only offers the $2.99.  I do not need HD just to catch up on my shows.  Getting another Roku.", "verified": true, "helpfulness": "0/1", "author": "Jmcn"}, {"rating": 5.0, "review": "I really enjoy watching instant videos using this device.  The viewing selection is large and the 1080p picture is fantastic.  It remembers where I stopped watching and resumes right there when reactivated.  Wakes immediately.  My watch list is getting full.  No problems connecting to my wireless network and it seems to work seamlessly.The only problem I've experienced is with the remote control.  The original one ate batteries in two days!  The replacement one is great, and Amazon service took care of it right away.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Love it! Would get 5 stars if it worked with iTunes content........", "verified": true, "helpfulness": "0/0", "author": "Sue Willoughby"}, {"rating": 5.0, "review": "Love this system--have now purchased 2 and plan on giving this as a gift for Christmas.  Streaming is much better than cable (no more huge cable bills and I can watch what I want, when I want!).  Just wish Amazon Fire TV would get HBO shows like, Game of Thrones!  They do have Walking Dead (for purchase by episode--and cost is reasonable).", "verified": true, "helpfulness": "0/0", "author": "Sunny Days \"Eddy\""}, {"rating": 5.0, "review": "After my Boxee went to heck, I bought a Roku and wasn't all that impressed.  I've had Fire TV and absolutely love it.  Fast response time in starting shows, easy to use interface, Couldn't ask for much more.  Hoping down the road the USB port will support a hard drive of some sort.", "verified": true, "helpfulness": "0/0", "author": "david n kleveland"}]