[{"rating": 5.0, "review": "Muy bueno", "verified": true, "helpfulness": "0/2", "author": "Jaime Inda"}, {"rating": 5.0, "review": "works great watch movies and play games", "verified": true, "helpfulness": "0/2", "author": "Ken"}, {"rating": 5.0, "review": "Love the fact I go from, my computer screen to my big screen. Picture is fine, sound is fine and having more choices is beautiful! After reading some of the previous reviews, think I waited til the right time to purchase. Easier to find what you are looking for now. Library needs to grow bigger, but, totally please every one! Then again, something to shoot for!", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 4.0, "review": "Only problem I've not been able to fix yet is syncing the device with my tv remote and volume control is a problem.  Also I can't use my blu-ray player with the device. Frustrating technical difficulties not fixed by contacting customer service. So I'm currently stuck with netflix on another TV.", "verified": true, "helpfulness": "0/0", "author": "L. Many"}, {"rating": 1.0, "review": "This was a total ripoff. The voice command worked for about four commands and then kept saying \"please repeat\". You couldn't search on Netflix. What a mess.", "verified": true, "helpfulness": "1/6", "author": "SGH"}, {"rating": 3.0, "review": "Returned because anything worth watching or fairly new costs $$$$. Got a blueray streaming player that does everything I needed.  If you have Amazon Prime then you get more to watch but Hulu gives me more for same cost.", "verified": true, "helpfulness": "0/2", "author": "TexSardo \"LG Rogers\""}, {"rating": 1.0, "review": "Not at all what we wanted.", "verified": false, "helpfulness": "1/10", "author": "Tuni"}, {"rating": 3.0, "review": "Fire TV works great as advertised, other than the fact I wanted to be able to screen mirror my phone on my tv, which it apparently doesn't support the latest galaxy s5 operating system kit kat", "verified": true, "helpfulness": "0/0", "author": "Derek"}, {"rating": 5.0, "review": "great love it", "verified": true, "helpfulness": "0/2", "author": "joseph lyle chrisman"}, {"rating": 4.0, "review": "Interface is really nice, especially with Prime and Netflix memberships.", "verified": true, "helpfulness": "0/1", "author": "J. McGahey"}]