[{"rating": 4.0, "review": "My amazon fire tv always freezes on me while I'm watching.Some times longer than others.", "verified": true, "helpfulness": "0/0", "author": "Bling ;0)"}, {"rating": 5.0, "review": "Works great and must buy", "verified": true, "helpfulness": "0/0", "author": "Wastewon"}, {"rating": 4.0, "review": "I really like it but doesn't have as many channels as the ruku", "verified": true, "helpfulness": "0/0", "author": "janie guthrie"}, {"rating": 3.0, "review": "since we connected Amazon Fire TV I am no longer able to stream Amazon prime video on my lap top ... BUMMER ... why?", "verified": true, "helpfulness": "0/0", "author": "pasn \"marina towers girl\""}, {"rating": 5.0, "review": "We are so fracking happy with it. If you're not a Prime member this will likely pay for the membership (getting shipping nice, too). I guess the HBO2Go issue is fixed but isn't a big deal for us.Things like an OD on The Closer for free and getting the first 2 season of The Americans (remembering) arre great.Hook up was HDMI cable to three TV, 15 minutes of swearing while I reconfigured the power strip and maybe 3 minutes software configuration. It came setup with our Prime ID & such so we were watching a movie inside of 30 minutes.Get the Fire TV app for your smart phone. Having a keyboard is worth the price. Oh, wait, the app is free, even better.", "verified": false, "helpfulness": "0/0", "author": "Dillon M. Pyron"}, {"rating": 5.0, "review": "Works great and easy to use. I have it in my bedroom, because I have a smart TV in the living room. I almost want to switch the locations because the Fire TV is so easy to use. The smart TV has a lag when switching the source and the Amazon Fire TV is on fire, when using its’ quick and smooth functions.  .", "verified": true, "helpfulness": "0/0", "author": "Betty"}, {"rating": 5.0, "review": "This was absolutely worth the money. I wanted to be able to stream prime music, and it works superb. I also use the Netflix and YouTube apps. The prime tv and movies is excellent. I connected an HDMI cable to my 1080p tv and a digital optical cable to my surround sound receiver. Movies on both prime and netflix that stream in dolby digital pass to the receiver just fine. Superb quality for music and tv audio. Also the apps are much faster in loading than the apps on my tv. The only thing I'd say is that to open the remote you need a screw driver to pop it open. No biggie there. Just thought it would open by hand.", "verified": true, "helpfulness": "0/0", "author": "Erich Carlson"}, {"rating": 3.0, "review": "Just ok, the local space is too small", "verified": true, "helpfulness": "0/0", "author": "Anton"}, {"rating": 5.0, "review": "Absolutely love it! Allows me to watch all my TV shows with different apps.", "verified": true, "helpfulness": "0/0", "author": "Meeee"}, {"rating": 4.0, "review": "Pretty awesome device. Allows for all your media apps to be in one place. Voice search is pretty neat, too. Probably going to sign up for Amazon Prime now to maximize my multimedia experience. One thing that irks me about it is the home screen will periodically be \"unavailable\" so I'm essentially staring at a blank screen. Otherwise I would have given the product 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Andy Havron"}]