[{"rating": 4.0, "review": "This is a fast machine but aside from that, has some shocking oversights including NO standard access to Amazon Cloud drive to listen to music...are you kidding me?! Why they would leave that out is beyond me but fine...that's not a game changer. However, one of the big selling points of this device is the voice search...which only works for Amazon content and fails to deliver targeted results (for example, search within Prime or your own library). Instead, it delivers the most expensive results first (HD etc) which will charge you when clicked upon to play. There is no way to search within sub applications. No voice navigation or support for the visually impaired. No way to filter search results....sigh. You get the idea. Even navigating your very own library is a pain in the neck thanks to the fact that you have to horizontally scroll through all the results one by one rather than be able to see the full screen of results. The number of app's that come standard on the machine is pretty limited. All in all, this is a step up from the Logitech Revue we've been using for the past several years but frankly, given the fact that is has been YEARS, I expected MUCH more!", "verified": true, "helpfulness": "7/7", "author": "AmazonJavaJunki"}, {"rating": 4.0, "review": "I'm enjoying my Fire TV: it's fast and smooth. Voice search works great. As a prime subscriber, it's great for kids. Lots of content to keep my son and I entertained.", "verified": true, "helpfulness": "1/1", "author": "Jon Arnett"}, {"rating": 1.0, "review": "This unit does not get very many channels compared to others.  If you are a Time Warner, Dish Network, or Direct TV customer you can use the Roku box to replace your cable box.  Amazon Fire does not get the Time Warner Channel, the Dish Network Channel, or the Direct TV channel.  While it is voice activated, that is not a selling point for me.  If you steam from Amazon this is probably a good choice.  However, for the money and features Roku 3 is clearly the best TV streamer on the market.", "verified": false, "helpfulness": "8/29", "author": "Art Vandaley \"Laineein\""}, {"rating": 5.0, "review": "I used to be tethered to my TV... a 15 ft HD cable attached to my Kindle....  It worked great - but what a hassle!! Now - this tiny little box - and an actual, working remote have freed me from all that cabling - AND I can now get SKADS more services in addition to my Amazon Prime - although that is the main reason I got the Amazon Fire TV. It just works beautifully.  And it has a gorgeous screen saver which is almost as much fun to watch as the shows.  I now also have IHeart Radio and loads of videos from ITunes, physical fitness sites, cooking sites - and so many more that I haven't yet explored.  So now I'm \"tethered\" to my TV.... figuratively if not literally..... Best $99 bucks I ever spent!  Thanks Amazon!", "verified": true, "helpfulness": "4/4", "author": "Connie in Salem \"Connie\""}, {"rating": 1.0, "review": "Listen, I am basically an Amazon fanboy...I do a lot of shopping thru Amazon, so it pains me to write this review, but it's gotta be done.  Corporate stupidity just HAS to be addressed.I have a couple Roku's, a Google Chromecast, a couple TiVo's, etc.(1)  Voice search is nice, but searching overall is UNACCEPTABLE as it is NOT a universal search, like on Roku (i.e...search ALL sources for a movie, etc, not just Amazon).(2)  Will there EVER be a way, Amazon (are you listening?), to search Prime for the FREE content?  The Fire TV doesn't do it. Unacceptable.(3)  The Roku 3 has a headphone jack on the remote...BRILLIANT...this simply has to be a standard feature on these kinds of boxes...but the Fire TV does not have it.  Unacceptable.(4)  No HBOGO.  Unacceptable.(5)  No volume control.  OK, none of these boxes have what would be a VERY desirable feature...a volume control on the remote...so the Fire TV does not lack here compared to the competition, but it sure seems like Amazon should have figured out how desirable a volume control would be, and included it.(6)  Adding android apps is very hard for average users.", "verified": true, "helpfulness": "434/499", "author": "Bill-NM"}, {"rating": 4.0, "review": "It's ok to buy this box now, since the power is already in the box itself.  The advancement in the service will come in the form of updates to the online sw that controls which content you see and how it is displayed to you.  The SW is behind AppleTV and others by a few generations, but Amazon has the heart to stay in the hunt until they have a dominant and winsome product, just like they did with the Kindle, which carved out the reader niche in spite of very powerful competition.Cons: I have Prime and want to watch the free movies, but when I search, I have to dig down through a few menus to find out if the content is free or paid.  It is easily possible to pay for content that I already own, by selecting the wrong play and pay options on the first menu.  Only after I go into the \"Other\" menu, do I find the button to play the movie for free.  This is a big pain and quite a flaw in user friendliness.  Prime membership should have prime play buttons on the main screen, like on the Amazon web site.Pros:  Like everyone else, the voice controls are a relief from point and click typing.  Amazon has a winning idea here that is well implemented.  Even though the voice goes back to the cloud for processing, it is lightning fast.  There is one privacy concern I have about what happens to my voice commands off in the cloud.  I don't want the NSA listening to my conversations through the remote control of my TV.Looking forward to good things to come...", "verified": true, "helpfulness": "4/4", "author": "Rob & T \"I believe in Miracles\""}, {"rating": 4.0, "review": "I like the new Fire TV, but I don't think it's quite as well designed as the Roku 3.The Roku offers a way to search all your \"channels\" while the Fire TV requires you to search inside each app.  The Fire TV's \"Voice Search\" would be great if it didn't search only Amazon's offerings.But, at least, that's software and something Amazon can improve with updates.  The Fire TV hardware looks good and the specs of the stuff inside the box are much better, but the remote isn't very nice.The Roku 3 remote fits nicely in your hand.  When you grab it, it naturally falls right into place and it's easy to locate the right buttons. The Roku's remote also doubles a game controller.  The Fire TV's remote is hard to hold, easy to pick up upside-down, and it slides around in your hand.  The buttons are spaced too far apart and there is nothing to differentiate them by feel.  It's just much more awkward using the Fire TV remote.The Fire TV's more powerful hardware should give it an edge, but I haven't much of a difference so far in picture quality or usability.For now, I'd give the Roku 3 a slight edge over Amazon's offering. It's easier to use and offers a few must-have channels that aren't available as apps on the Fire yet. But, the Fire TV is a close second. Asked to choose between the Roku 3 and Amazon Fire TV ... I'd choose to wait for the \"Roku 4.\" :-)", "verified": true, "helpfulness": "1/1", "author": "Roger Smith"}, {"rating": 4.0, "review": "I'm impressed by how fast the buffering and response is.  I also love the voice search!  I'm disappointed that I can't stream my Amazon Cloud player through it (I have that app on my samsung smart tv, why wouldn't I have that option on an Amazon product!!!?)  I don't think this is a game changer, but it's a good product.....", "verified": true, "helpfulness": "1/1", "author": "L.H."}, {"rating": 2.0, "review": "Easy to set up, though we had to use our own HDMI cable. The first they we did was get Hulu plus. We no longer have access to all our favorite CBS shows now.( unless we use hulu on our PC)While watching hulu the sound went off sink with the picture. Started working right again and then I lost the picture all together.", "verified": true, "helpfulness": "5/16", "author": "Melinda M Bonds"}, {"rating": 4.0, "review": "My requirements were:+ Streams on the 5Ghz band of a Dual Band Router, for best internet streaming performance+ Has Netflix+ Has Amazon Prime Content+ Has a means for me to play my own personal content (e.g. home vidoes, etc).Out of the box, the Amazon Fire TV had items (1) through (3) of my requirements. by downloading the Plex app, I was able to create a home media server on my Mac Mini and can stream personal content to the T.V. which satisfied my (4) requirements.WHY NOT 5 STARTS THEN?!?Voice Search - Cool Novelty, but not practical for the froogle watcherVoice Search (1) only searches Amazon content, and does not seperate Prime Content from Non Prime Content. I can find the movie I want, but 7-10 I would need to buy it which is NOT what I typically do as an Amazon Prime Memeber.The USB 2 Port MysteryWhy Amazon has included a USB 2 Port with no purpose is perplexing. The existence of the port was an exciting prospect to hook up an external hard drive and play person content such as large 50GB .MKV high resolution movies (that don't stream so well over the wifi). This dream did not come to fruition as the port seems to do absolutley nothing. There is not even a menu within the interface that addresses the USB port.If AMAZON Really wants to dominate this space, the USB 2 port will need to allow for external hard drive hook up to play content. like the WD TV Live. Also cross app search with the voice to search funtion would be very powerful as well.", "verified": true, "helpfulness": "11/12", "author": "Sam Carroll"}]