[{"rating": 4.0, "review": "It's awesome my girlfriend and I love to play all the little games. The selection is great and integration of the apps is astounding. The only quirk that I'm sure will be fixed is that it's mainly oriented to amazon products. Such as prime videos are the only search criteria for the voice search. Great product none the less.", "verified": true, "helpfulness": "1/1", "author": "Jameson Gregory"}, {"rating": 4.0, "review": "It works as said", "verified": true, "helpfulness": "0/0", "author": "donnell"}, {"rating": 5.0, "review": "Really good", "verified": true, "helpfulness": "0/0", "author": "gloria lopez"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Noel Trimmer"}, {"rating": 5.0, "review": "Great machine. Fast, easy to use, syncs with amazon cloud, etc. One suggestion: Allow search functionality to access content within apps such as netflix and hulu.", "verified": true, "helpfulness": "0/0", "author": "pditty121"}, {"rating": 5.0, "review": "We have used it five times and are very pleased with it.  It connected easily by hdmi cable to our TV.", "verified": true, "helpfulness": "1/1", "author": "Vivian L. Pelham \"Senior Homemaker\""}, {"rating": 5.0, "review": "I've had this for a few months now and I LOVE it.  Set up was easy and minimal, you basically just plug it up and use. I love that I can watch all of my shows on Hulu and Netflix, my kids use it way more than I do.  They download games and apps and will play on it all day if I let them.  I'm going to buy the game controller soon and I may even buy a 3rd Fire TV so that I can have one on every tv in the house.", "verified": true, "helpfulness": "2/2", "author": "Charmaine Duncans"}, {"rating": 5.0, "review": "I have a Vizio TV that already has all the streaming Apps, but Hulu wasn't loading videos at all sometimes.  I tried deleting and reinstalling the App, resetting the modem, I even switched from At&T; Slow Speed Internet (5 mbps) to Comcast (50 mbps).  Fire TV was my last resort and I'm amazed.  Now Hulu videos load and the countdown for video play for all services usually start at 97% loaded...3, 2, 1 and the video starts playing.I've had Amazon Prime for a couple of years and I was always disappointed that the Watchlist I compile online was never available on the Vizio App for Prime.  Fire TV fixed that.Another nice surprise is that it seems that all the menus I use (Prime, Netflix, and Hulu) are all the same with Fire TV.  The menu for Hulu using the Vizio App seemed like it came directly from 1987, about 20 button pushes to get to the video I wanted to watch.  The Fire TV menu system is awesome.  I haven't tried the voice search yet but I'm sure it will be handy.I purchased Fire TV to help solve the video problem, but I was pleased to see all my photos from my Fire Phone and the music from my Amazon library are available on the Fire TV now.Set up was simple.I haven't explored all the features yet but I did notice a screen saver with some beautiful stock photos from Amazon.Even if you have a TV with built in streaming Apps, get the Fire TV.  It makes everything easier and faster.", "verified": true, "helpfulness": "0/0", "author": "Mike Osborne"}, {"rating": 4.0, "review": "It's faster than the previous streamer I used, good picture quality and fast download.  The remote seems a little too basic, I don't like that there's not a power button.  They say its okay to leave it on but the unit is hot and makes it harder switching the mode on the tv.  I've also have had to unplug/replug it several times to get the tv to recognize it.  I would like to use Netflix on it, but I understand they only offer an older, clunkier version of the app.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Its mostly a netflix box for us at our house, but it is responsive and the voice feature is nice! I wish they would separate the free streaming prime options from the ones that require a purchase, I'm afraid one day I (or someone in my house) will slip up and accidentally order something, but other than that it is really nice.", "verified": true, "helpfulness": "1/1", "author": "Michael Pearson"}]