[{"rating": 4.0, "review": "I bought two of these. Not every movie is free to watch if you are a Prime member. Though I really enjoy this product, there is much room for improvement. I feel that amazon can do very well with this product and I hope they add many more apps within the next few months", "verified": true, "helpfulness": "0/0", "author": "Fabz \"..Fabz..\""}, {"rating": 5.0, "review": "Far superior to the Roku, Apple TV or Google Chromecast in every respect.  I own all four.But...  Where are the media server extensions!I can't complain.  This is my GoTo streaming box now.  The Roku 3 was before I started using this one.  Sorry Roku.  No comparison.It's solid.  Well designed, well thought out.  The voice search works just as well as they advertise it does.  The Toslink is a great addition too.  Now I can actually take advantage of my audio systems sound quality and audio paths.", "verified": true, "helpfulness": "0/0", "author": "W. V. \"cne9999\""}, {"rating": 4.0, "review": "fun and reasonable priced-amazing voice recognition-I just need to remember to use it-I spend too much time on the computer", "verified": true, "helpfulness": "0/0", "author": "Don Mondo \"Donald McAfee\""}, {"rating": 2.0, "review": "I bought it to watch Netflix. I am disappointed it reduces the size of the picture when showing Netflix. I feel like I bought a device to make purchases. Amazon should give this device to customers. I will play with it a more before I throw it in the junk closet.", "verified": true, "helpfulness": "0/4", "author": "b lain"}, {"rating": 5.0, "review": "Great !!", "verified": true, "helpfulness": "0/2", "author": "tamira cousett"}, {"rating": 5.0, "review": "Love our Amazon fire tv, we only had access to on demand from cable.  We seldom used it because it had so few options, didn't seem worth the trouble.  We had no streaming devices and knew little about how it works.  Amazon Fire tv is very, very easy to use and offers so many choices.  We are into more tv shows than movies, so we have been able to catch up on some shows we never started watching.Only thing that we didn't understand before purchasing, was the need for a strong wifi connection.  Ours was old and couldn't handle the new device.  Once we upgraded our router, all was fast and easy.  Thanks", "verified": true, "helpfulness": "2/2", "author": "susie"}, {"rating": 5.0, "review": "Only had this a week but Love this product !!", "verified": true, "helpfulness": "0/1", "author": "North East IA"}, {"rating": 3.0, "review": "First if all, let me say this is the fastest media streamer I've ever experienced! But, and it's a BIG but, there is NO browser! That extremely limits the ability greatly of what this device COULD be. No option to create custom channels, or to install a broader range of apps. And now, Amazon has blocked Root access.For what it is, it's still a great media streamer but the things I mentioned above only allow me to give 3 stars.", "verified": true, "helpfulness": "1/2", "author": "Honest Reviewer"}, {"rating": 5.0, "review": "WOW! Very impressed from the start!1. Nice compact precision packaging. The unit is surprisingly small, but weighty.......featureless black boxwith inputs in the rear.2. Very easy setup (at least wired)......I just unplugged the old Sony BlueRay, and plugged in the FireTV.3. The controller is also small, nice ergonomics, velvet feel.......very intuitive controls.....I don't have tolook when using.  In contrast  the Sony had 42 buttons!4. The GUI (graphical user interface) is a pleasure to use.  I'm finding content I never knew existed. Very well organized.5. Much faster to load content, easy to fast forward, etc.6. While watching a movie, we paused it to get a snack, and a slideshow screen saver came up....we watched thebeautiful images (mostly scenics from all over the world) for the next 30min without any repeat images.....there mustbe about 100 in the slideshow. Great photography......full screen HD. =O7. The \"icing on the cake\" is the voice recognition search function.....WOW! I didn't even have to train it.Even if it \"only\" works with Amazon content (for now?), it's a huge plus and fun to use.Note:the only problem it had was \"Zatoichi\".........which BTW is an incredibly well done series about a blind swordsmanmonk/massuse in feudal Japan.....a national art treasure. He will \"grow\" on you. ;)After working great the first day, my internet  (cable) was down for 2 days. After getting the net back up, Amazon Fire TVwould not stream content, even though I re-booted it. I called Amazon support today, and got great support from Johann C.He had me go to Settings> Applications >Manage Installed Applications>Amazon>Force Stop, Clear Data.Then he had me un-plug FireTV,  re-boot the cable modem.  After the internet connection was back up, I plugged in the FireTV,and everything was fine again. =)I have no \"cons\" so far......this is a huge improvement over my previous streaming hardware & software.Great job, Amazon! =)", "verified": true, "helpfulness": "0/0", "author": "Calvin C. Mcgaugh"}, {"rating": 1.0, "review": "I am giving this device a 1 because the remote is  HORRIBLE!!!!!!!!!! The resolution on the device is fantastic. Processor is FAST.  Easy to maneuver around amazon menu as well Netfilxx and HuluPlus.  But the remote constantly loses signal.  I have to literally sit and wait after unplugging and plugging the device over 10 times.  I am on my second remote.  Same problem.  I don't know why the device does not lock into the signal.  Today,  the device notified me that my batter was low (note remote was working fine), I then go and put fresh batteries in, and the remote no longer works.  I WILL ABSOLUTELY NOT RECOMMEND THIS DEVICE TO ANYONE!!!!!! I RECOMMEND PEOPLE PURCHASE THE ROKU 3 OR THE APPLE TV.  iF THE REMOTE WORKED REGUARLY, I WOULD SAY DEVICE IS GREAT.", "verified": true, "helpfulness": "3/9", "author": "Juan C. Odio"}]