[{"rating": 5.0, "review": "Superior technology to all other streaming devices on the market! It has exceeded all my expectations. I bought a second one.", "verified": true, "helpfulness": "0/0", "author": "Eric P Connolly"}, {"rating": 5.0, "review": "Very impressed with this unit", "verified": true, "helpfulness": "0/0", "author": "Leon W."}, {"rating": 4.0, "review": "Very user friendly, although the voice feature only works for amazon and not other channels when searching for titles. Other than that, I really enjoy using it.", "verified": true, "helpfulness": "0/0", "author": "Np83"}, {"rating": 5.0, "review": "Opens new doors in streaming and home entertainment", "verified": true, "helpfulness": "0/0", "author": "garydebra"}, {"rating": 3.0, "review": "Fire TV is nice. I think the free part needs to be a bit less advertised. There's a lot of free stuff, but even some old TV shows from the 80s are still pay. Not real happy with Fire TV. Let's hope the menu expands to more free content", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 3.0, "review": "Great for kids!", "verified": true, "helpfulness": "0/0", "author": "Dana"}, {"rating": 3.0, "review": "I admire the Fire TV for its voice and gaming features, although I rarely use them. I cannot give it more than 3 stars as there are two vital elements missing: 1) lighted buttons on remote, and 2) built-in ability to receive IR signals from custom remotes. I can only hope that Amazon will allow trade-ins of the original FireTVs when these features are added to the next release.", "verified": true, "helpfulness": "0/1", "author": "Rich B. \"Rich B.\""}, {"rating": 3.0, "review": "Picture isn't clear at times and it freezes often", "verified": true, "helpfulness": "0/0", "author": "mrs d"}, {"rating": 5.0, "review": "So far I really like it.", "verified": true, "helpfulness": "0/0", "author": "Christopher"}, {"rating": 5.0, "review": "Voice search is amazing. It really works. Less using a four directional keypad to enter in titles is a real time saver and makes you wonder why this wasn't done before but it is only for Amazon content and VEVO (music videos) (at least for now). You can not use the voice search with Netflix for example.", "verified": false, "helpfulness": "0/0", "author": "Hansel"}]