[{"rating": 1.0, "review": "The FireTV is fine as long as it's working. If it stops working, Amazon Customer Service is terrible. Buyer beware.", "verified": true, "helpfulness": "2/6", "author": "lenspixels"}, {"rating": 5.0, "review": "Received as a gift. After getting a data plan for the installation site and subscribing to Amazon prime, we are very happy with the options, quality and ease of use for this product. The only complaint is the lousy internet service we are stuck with in this part of our Great State of Michigan!", "verified": true, "helpfulness": "1/1", "author": "Shoprat1407"}, {"rating": 1.0, "review": "The stats are good on this but we go through about 6 sets of batteries a month. The remote just keeps dying. I also bought the wireless game controller and am having the same problem with that. Another feature I dislike is that there is no ufc tv which the roku has. Even though the fire tv boasts a faster processor, I can't tell any difference. So I'll keep filling the landfills with dead batteries until im ready to face the $100 loss of this product.", "verified": true, "helpfulness": "2/4", "author": "slowpoke"}, {"rating": 5.0, "review": "When I first received the Amazon fire TV I loved it. But after 1 year and 3 months it no longer works properly. My movies keep stopping and starting and I get a message that my internet speed is to slow. Not true I have 2 Roku's that work fine. and I just bought a new Airport Extreme. Echo works fine and my Amazon Fire HDX. everything works except this Fire TV that I've been bragging to my friends about and to make it worse I can't send it back because it's over a year old. If someone at Amazon reads this I wish they would offer a solution either fix it or discount me another one. Your loyal customer GlennUpdate : After Amazon sending me to the Amazon Fire support page I was able to trouble shoot my problem. It was my fault after I changed my wireless router I forgot to go in and change the network settings. Everything is working fine now and my faith in Amazon has been restored.", "verified": true, "helpfulness": "4/4", "author": "G Leftwich"}, {"rating": 5.0, "review": "Enjoy the easy of use and available services with my prime membership.", "verified": true, "helpfulness": "1/1", "author": "orgulio"}, {"rating": 5.0, "review": "Mostly love the Amazon fire TV. However, the volume on some movies steamed through the unit is difficult. There are times when I cannot hear what is playing.", "verified": true, "helpfulness": "1/1", "author": "BooBoo Louie"}, {"rating": 5.0, "review": "Very easy!", "verified": true, "helpfulness": "0/2", "author": "Unknown"}, {"rating": 2.0, "review": "I've had the Fire TV since February, approximately 4 months.  In the beginning, I thought it was a nice alternative to cable/satellite and for the most part it is, I suppose. I have Amazon Prime, and I also have a subscription to Netflix.  between the two, I've been able to find shows that I care to watch, and the whole thing costs me about $200/year as opposed to $200++/month from one of the leading cable companies.  However, I've had some very frustrating problems that, had I known what was in store, I may have chosen some other alternative.It seems that I have to reset the box by unplugging it and plugging it back in again about once a week.  I know on the surface that doesn't sound like a big deal but trust me, it gets annoying.  Additionally, I've had to reset the box to factory settings 6 times - more than once a month.  When the box is reset to factory settings you have to re-register it and then download all of your apps again and do the initial login for each one of them again.  Its a pain when you have to do it once, but do it 6 times.  Fire TV won't seem as cool then as it did when you took it out of the box.Right now I can watch the movies and TV series I purchased from Amazon with mostly no problems.  But I can't get my Netflix subscription to work.  I have a Smart TV in another room that doesn't need something like the Fire TV box to get my Amazon and Netflix service, and it has no trouble at all providing me with my Netflix content.  So that leads me to believe its an issue with the Fire TV black box.I've called customer service on it several times.  They have always been very easy to work with and have always resolved the issue.  But it ALWAYS COMES BACK.Amazon Fire TV reminds me of the early home computers and software:  The idea is a really good one but the execution is pretty lame.  Always crashing or locking up and requiring a reboot on a daily basis.  Great idea but the technology doesn't seem to be there.  At least not in the little $100 box from Amazon.", "verified": true, "helpfulness": "2/3", "author": "Ensign Suder"}, {"rating": 5.0, "review": "Very impressed with the performance!!!", "verified": true, "helpfulness": "0/0", "author": "eugene ivey"}, {"rating": 4.0, "review": "Fast and comprehensive.", "verified": true, "helpfulness": "0/1", "author": "Daniel L. Magro"}]