[{"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Arthur Alexander"}, {"rating": 3.0, "review": "I was kind of sad when I found out I could've got it for $84 through Staples", "verified": true, "helpfulness": "0/0", "author": "Roger Vogel"}, {"rating": 4.0, "review": "Great investment! Great unit compared to others on the market. Build very well and at least feels more durable compared to an apple tv device, although sort of similar in visual appeal. Amazon has definately set the bar with this one with all the things you can do- only thing negative to say, if its negative at all- is it didnt come with a remote control, but I guess thats fair being gaming is not its main function, it does it well though!!", "verified": true, "helpfulness": "0/0", "author": "CITYEdWIN \"Large Late Music\""}, {"rating": 5.0, "review": "This unit far exceeded my expectation, works great!!", "verified": true, "helpfulness": "0/0", "author": "HOLLAND"}, {"rating": 5.0, "review": "Easy to set up and connect to my home WiFi.Amazon Fire TV delivered on everything that I bought it for.I have been using it every day.", "verified": true, "helpfulness": "0/0", "author": "Roy R Zold Jr"}, {"rating": 5.0, "review": "After literally months of not using our Verizon cable service - because too many of the channels are garbage and the better ones are only available with the highest packages, we decided to turn our cable boxes in and just stream what we want to see off the Internet.We have a media center computer to stream on our 60\" HDTV, but the Fire TV box allows us to do the same thing in our basement family room.$100 gets you a month of Verizon Fios Triple Play... and $100 gets you pretty much endless months of streaming plus the yearly Prime renewal fee.  It's kind of a no-brainer.  We will not look back at crappy cable again.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Cline \"Veteran Internet Shopper\""}, {"rating": 3.0, "review": "Works well, but not as user friendly as AppleTv", "verified": true, "helpfulness": "0/0", "author": "John M"}, {"rating": 5.0, "review": "This is a very unique item and sleek. My family loves it.", "verified": true, "helpfulness": "0/0", "author": "Lawayne Tanksley"}, {"rating": 5.0, "review": "easy hook up, easy to use, lots and lots of free viewing...love it!!", "verified": true, "helpfulness": "0/0", "author": "ringo"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Brian B."}]