[{"rating": 1.0, "review": "Disappointing in the extreme. My personal observation is that a person cando better with the XBox1 or a multi purpose blue-Ray DVR. Just another gimmick to part you from your money. You can buy an he blue ray DVR that can do more than the FireTV for half the price.Jim", "verified": true, "helpfulness": "11/31", "author": "Jim"}, {"rating": 5.0, "review": "Just got my box and I love it. I not a techie by any sense of the word so I can't comment on all the gaming stuff and special hook ups, but if you just want to watch movies and tv shows this review is for you. I was an amazon prime member but always thought it would have been better if I could stream the movies and shows through my tv instead of on my computer. The box is small but not cheaply made. The set up is super easy, power cord, HDMI cable, batteries in remote and that's it. There's an instructional video that tell you how to use the remote and it's a go. I was a little hesitant about the voice recognition search, but it worked perfectly. There are only a couple of apps, but they all are music or movie/tv related which means you can use the box without having an amazon prime account. Downloading the apps are simple, so no biggie there. Happy, happy, happy with this purchase.", "verified": true, "helpfulness": "5/5", "author": "Lakisha Crigler"}, {"rating": 1.0, "review": "So I came across the \"new\" Amazon Fire TV....Let us ponder this a moment. You hook it up to your HD, yes you have to have an HD TV. Okay, I am with this sooo far.So what is it? It gives you the capability to watch videos and shows through Amazon, Netflix, Hulu plus, etc. Well isn't that something, considering most HD TVs are internet capable, many have those same options built it. Then there are those of us who not only have a bluray that has the exact capabilities, but there is also the surround sound boxes that also have them. And let us not forget about new gaming systems. They have them too!So, my question to Amazon, why? Why are you trying to rip-off people by charging them $99 for something they most likely already have? This is a fail in my eyes.Just sayin.", "verified": false, "helpfulness": "8/48", "author": "Up All Night Book Addict \"Amber from Up all Night Book Addict\""}, {"rating": 3.0, "review": "Can't play movies from local USB Drive.Most games can't play without game controller (another $40).  This makes the unit cost $140.No HBO GoNo third party app install (not really big deal to me.. yet)", "verified": true, "helpfulness": "3/5", "author": "Van Lam"}, {"rating": 5.0, "review": "Can anyone tell me if this equipment can be plugged into 220V. I know a lot of the newer electronics can be, however I haven't found any of the power specs for this.Thanks", "verified": false, "helpfulness": "1/2", "author": "rebecca diel"}, {"rating": 3.0, "review": "I was expecting something as good as Roku and that didnt happen, returned to Best Buy, maybe try again someday.", "verified": false, "helpfulness": "0/3", "author": "Barry Caldwell"}, {"rating": 5.0, "review": "I own Apple TV so I can compare the two well,Here we go:* User interface, much better and simpler/intuitive than AppleTV* Remote is super cool. No more pointing. The bad thing is that I cannot use my Logitec Harmony 800 with it!!* Many more applications and flexibility, Android on my TV.* I'm missing the AirPlay  connectivity with my other Apple Device. Amazon, can you be more open to accept that you are not alone and be better than Apple who keep it all as close systems with business driven products. After all you are working for US, we are  your customers.* Simple setup and no need to sign in, they know who you are and make all the connection for you. I wonder if this means that you may experience problem buying it as a present.* Superb video quality, Better then AppleTV* Netflix is not that good. Video is not as good as on AppleTV with Netflix app.* Make my Amazon Prime a much better value prop", "verified": true, "helpfulness": "2/2", "author": "J. Avital"}, {"rating": 3.0, "review": "When i got my tv it started acting up, losing wofi connections n stuff but then i seek for support and after that it runs fine....Storage is a big issue right now I am already full with the availble storage with only intial application n it doesnot support external storage from usb or hard drive.....that suck! Please fix it....Other then that work great! But yaa u will need higher internet speed atleast more then 15mbps...otherwise using fire tv will be stressful.....", "verified": true, "helpfulness": "2/5", "author": "vijaybhai patel"}, {"rating": 1.0, "review": "Amazon says they are listening to us with this device.  Yet the page asking when there will be Amazon video support for the chromecast has thousands of users asking for it.  You can't even stream through the browser anymore!  THEY ARE ACTIVELY RESTRICTING ACCESS TO PRIME VIDEOS TO REDUCE COMPETITION!  I was once a prime member, no more.  This is shallow and childish.", "verified": false, "helpfulness": "11/46", "author": "Aaron"}, {"rating": 5.0, "review": "I've had a lot of experience with set top boxes. I also worked for TiVo in the last few years. Selling against the likes of Roku and Apple TV gave me a lot of insight into knowing what I wanted from Fire TV. Well, it has delivered! I purchased the first day. I've been using it every night and it hasn't disappointed yet. It just works and works extremely well. I even stopped going to Redbox!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]