[{"rating": 3.0, "review": "I really find it inconvenient that the Fire TV remote App is not available in all country stores, neither iTunes or Google offer it for Costa Rica.", "verified": false, "helpfulness": "0/0", "author": "Leonardo Arboleda"}, {"rating": 4.0, "review": "Awesome device! Only lost a star because the search (voice or typed) gives results centered around Amazon's products only, and even though apps can be sideloaded, the apps on Amazon's store are very limited at the moment. I also wish we had the option of placing sideloaded apps in the  \"Recent apps\" list. Just to launch these apps involves us having to dig through menus.Powerful, sleek looking hardware with a beautiful functional menu, this device has a lot of potential. Make it happen Amazon!", "verified": true, "helpfulness": "0/0", "author": "R. Napier"}, {"rating": 4.0, "review": "It does what it claims to do, though it should have at least a basic web browser app, should be able to look at the internet and such, perhaps even shop on Amazon right from my tv...", "verified": true, "helpfulness": "0/0", "author": "Bahrutile"}, {"rating": 5.0, "review": "I love Amazon Fire tv the only thing is I wish there where more TV series.", "verified": true, "helpfulness": "0/0", "author": "Shannon Church"}, {"rating": 5.0, "review": "Awesome. Don't need Comcast again. This is saving me a huge fortune. Now i can watch from both tv's as this is my second fire box. You won't regret getting it, at all. I just use this and a light weight blue flat square, $6 dollar antenna from Amazon, the antenna is called is homeworx, if you are interested.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "I was disappointed so many things still have to be purchased or rented or have to have satellite account still. Hoping to cut the cord from satellite company. My son loves the games and controller.", "verified": true, "helpfulness": "0/0", "author": "Happy daughter = happy mom \"Amanda\""}, {"rating": 5.0, "review": "Love it.  Responsive easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "M. Chiro"}, {"rating": 5.0, "review": "Made our cheap flatscreen a smart tv.  Perfect!", "verified": true, "helpfulness": "0/0", "author": "Rebecca Keegan"}, {"rating": 5.0, "review": "Easy to use and a perfect connection to all things Amazon plus so much more. Keeps our five and two year olds entertained for hours when we're busy with something else", "verified": true, "helpfulness": "0/0", "author": "Dan O."}, {"rating": 5.0, "review": "Something would have to be pretty special for me to give a 5 star rating. This is it.  And so easy to hook up and use. Already gave one for a gift also.", "verified": true, "helpfulness": "0/0", "author": "atir"}]