[{"rating": 5.0, "review": "yup", "verified": false, "helpfulness": "0/1", "author": "brian"}, {"rating": 5.0, "review": "I haven't tried out all of the features and capabilities yet but so far it has exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Oliver Heim"}, {"rating": 5.0, "review": "We loved our first one so much that we canceled the cable service and ordered another Amazon fire tv.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Better than Roku we had prior to purchasing this! Tons more movies and shows to watch!", "verified": true, "helpfulness": "1/1", "author": "Nick Fogle"}, {"rating": 3.0, "review": "Great potential, but depending who your cable provider is will probably make or break your purchasing decision. I have Xfinity/Comcast and cannot utilize Showtime Anytime or HBO Go yet.  I purchased another similar streaming media product so I can utilize those two programs.  I only use the Fire TV when I need to stream something from Prime Instant Videos as the other product does not support it.  When Showtime Anytime and HBO Go can get activated this would be my go to all in one streaming device.", "verified": true, "helpfulness": "0/2", "author": "JW"}, {"rating": 4.0, "review": "I have used the TV services on a PS3 and a WII U and by far, this interface has given me an easier time finding movies I'm interested in, and didn't think of. The voice search works well and beats trying to type your search on character at a time.Streaming is also smooth, and video quality is great. I find myself enjoying more movies now, than watching re-runs on TV.One thing to keep in mind is that the benefits of the interface are in favors the Amazon Prime videos (which is to be expected). It works well with Netflix, and other services too, but doesn't really provide any benefits over any other streaming media player.", "verified": true, "helpfulness": "0/0", "author": "lemming"}, {"rating": 3.0, "review": "This items is goodBut not working in saudia arabiaAnd not subtitles with filmI am unhappy", "verified": false, "helpfulness": "0/2", "author": "adel"}, {"rating": 5.0, "review": "Best Device Ever", "verified": true, "helpfulness": "0/1", "author": "A. Lane"}, {"rating": 5.0, "review": "Easy to set up no issues simply and works great very impressed", "verified": true, "helpfulness": "0/0", "author": "joe mancuso"}, {"rating": 5.0, "review": "So far so good, the only thing I don't like is the fact that there is not an app with in this to utilize amazon prime music. Its very limited.", "verified": true, "helpfulness": "0/0", "author": "AMBER JONES"}]