[{"rating": 4.0, "review": "It's been great so far with a few comments.  I'd rather have the option of turning the unit off instead of waiting the 30 minutes or unplugging it.  I'm not sure if it's higher or lower performance than other equipment connected to the router as it drops the connection more than others.", "verified": true, "helpfulness": "0/0", "author": "Cutting96"}, {"rating": 5.0, "review": "I love it so much it is way better than our roku. Super kid friendly but still waiting for freetime. My kids can say what they want to watch it is so easy to use even for a 3 year old.", "verified": true, "helpfulness": "1/1", "author": "Momof3"}, {"rating": 5.0, "review": "I really like this product. It is well designed. Easy as pie to setup and provides tons of content.  The golden day when I can cut the cord and drop Cable TV is closer now that I have Amazon TV.  What will I do with all that extra money each month?", "verified": true, "helpfulness": "2/2", "author": "WD \"WD\""}, {"rating": 5.0, "review": "great picture voice search is the wildest thing works like no one would be leave I love it I love it", "verified": true, "helpfulness": "1/2", "author": "RICHARD MCCLENNEN SR"}, {"rating": 1.0, "review": "The only thing that works well w/ this product is the voice control. Using it w/ Prime is ok except most of the movies are for fee only. The biggest problem is \"buffering\". Anything I have attempted to watch is in a constant state of \"buffering\" I don't have that problem when I use by Blu-ray with Netflex.", "verified": true, "helpfulness": "3/10", "author": "William N. Marquis"}, {"rating": 1.0, "review": "You can't watch what you want to without having to pay again to watch it .I thought once you payed a monthly fee you could watch what you wanted to this is so unfair the roku box is so much better", "verified": true, "helpfulness": "1/9", "author": "Magalena Moore"}, {"rating": 1.0, "review": "I was not able to hook up to the internet. It would not accept my internet name or password. I followed the direction and tried numerous times. Various internet names appeared but not mine.", "verified": true, "helpfulness": "1/6", "author": "Marilyn Danielson"}, {"rating": 2.0, "review": "We have an older TV we were planning to connect to the Fire TV.  Adds for Fire said all you need is an HDTV which we have - but failed to mention that the only type of connection for Fire TV is  HMDI which we do not have.  Went with a Roku which did work and it is a recent model.  Had to return the Fire.", "verified": true, "helpfulness": "0/3", "author": "Sterling45"}, {"rating": 2.0, "review": "When comparing Roku and Fire, I don't see a reason to choose fire tv over roku. Amazon advertized games but really how many people would play games with fire tv not with high performance device like xbox/ps. Roku has more coverage for apps like dish world which allows users to watch international tv network. Customer care for fire tv has no idea about when these apps would be available for users. When I mailed customer care, I received a standard copy paste answer without any specifics.My email to customer care was: I couldn't see the app from dishworld on fire tv so reaching out to you. [...]I am planning to buy fire TV but more of the apps are already available on my LG smart TV. one of big use of fire TV for me would be to watch dishworld (For Indian channels in USA). Do you have a plan to add dishworld support on fire TV?Amazon's response:Hello,Thank you for showing your interest in Fire TV.I understand you want to see dishworld app on Fire TV.It is always important for us to hear how customers react to all aspects of shopping at Amazon.com. Strong customer feedback like yours helps us continue to improve the selection and service we provide.I appreciate your thoughts, and I've forwarded your comments to appropriate department and we'll consider your comments as we plan further improvements.We are always striving to provide the best possible service to all of our customers. Your comments will help us make this service more convenient for all users. Thanks for taking time to offer us your thoughts.We always like to hear from our customers, and we're glad you took the time to write in; we appreciate your loyalty. If there are any aspects of our service that we can improve, please do not hesitate to say so.Thank you for your continued patience and understanding. We value your business and hope to see you again soon at Amazon.com.", "verified": false, "helpfulness": "2/6", "author": "chandan"}, {"rating": 1.0, "review": "I was really hoping to replace my Roku however Amazon Fire TV is missing is HBO Go, MLB.TV, NHL GameCenter, NBA League Pass, Epix, Vudu, SlingPlayer, Major League Soccer, Redbox, WWE Network all content services that my Roku box currently have and I use and I use 8 of those all the time.  It takes far longer to use Amazon’s text based search function, having to first change the search default from voice to text. Then you have to do three steps just to get into the text search area and scroll through letters from A-Z, punching in each one manually. For ease of use, speed and simplicity, Roku’s text based search beats Amazon’s Fire TV hands down.  My thought is now the Amazon Fire TV is clunky, un-polished and missing tons of content filled with useless content. If all you have is a subscription to Amazon Prime, then this box might suit you just fine. But if you want to do more than just stream content from Amazon and want a box that doesn’t feel like it’s in beta, don’t pick the Amazon Fire TV.  I sent mine back maybe Amazon Fire TV2 will be better.", "verified": false, "helpfulness": "3/4", "author": "Kenneth"}]