[{"rating": 5.0, "review": "I purchased an Amazon Fire from Best Buy, same price and the only reason I did is because my Blu-Ray went kaput!, though I am a prime customer, and generally get anything we order within 2 days, I needed it NOW!. We have had it up about 5 days now and first off let me tell you, my husband is literally scared of setting up any kind of electronic, we usually get frosty with each other. Not this time, quick and so easy to set up, he was even smiling. We stream Netflix and its perfect, better than our Sony BluRay was before it died. I love all the things it can do, we keep finding fun things to do with it every day. I highly recommend this, especially because my husband set it up so easily. One more thing the voice command makes it so easy to find prime movies, even genre. Like Romance, scifi. Very cool", "verified": true, "helpfulness": "1/1", "author": "Thirsty in Palos"}, {"rating": 5.0, "review": "My Amazon Fire came in today and I was so excited!  First of all, even the packaging is so elegant and nice down to the smallest detail of the clear seal tape on the remote and the unit itself.  The remote is perfectly set up and easy to use.  I unpacked everything, went in and plugged it into the TV, put in our wifi password, watched the quick instructional video, selected my Netflix, put in my password etc and bingo, ready to watch TV.  I had read in some reviews that the voice command seemed to work best with Amazon Prime and not Netflix, however, the first title I gave it came up perfectly.  I tried three more, there they were so I think voice command works very well with Netflix.  I'm excited to have this because lately there isn't alot to watch on our 300+ channels so if this works as well as it has started out we are going to be downgrading our cable cost.  Fingers crossed!!  PS - Be sure to order the HDMI cable because it does not come with.", "verified": true, "helpfulness": "2/2", "author": "SouthernGal820 \"Bailey\""}, {"rating": 5.0, "review": "I am writing this review after only a few days of using the Fire TV, but already I am very impressed.I first have to compliment the packaging.  I have always been impressed with Apple's minimalistic packaging approach and I am glad to see other companies following suit.  The unit itself is tiny, I was shocked when I unpacked it.  The remote is small too.It took barely any time to set it up, just plug in the HDMI cord and the power cord, wait for a brief download process, and you are good to go.  I didn't even need to read the instruction manual to know how to navigate the Home Screen, although I will be reading it this weekend to learn about all the cool features I haven't figured out yet.I have used Amazon Prime streaming, Hulu, and Pandora on it and so far it is great!  I have never had a streaming internet tv device before so I have nothing to compare it to, but I have to imagine that this is one of the better ones out there.Oh, and I love the Voice option on the remote!  I honestly did not think I would use it but it is so much easier than searching around for letters to spell out the titles.  The only one it got stumped with was my son's favorite show, Umi Zoomi, but who can blame it.  It's a weird name.", "verified": true, "helpfulness": "3/3", "author": "HCC"}, {"rating": 5.0, "review": "I cut the cable over a year ago and currently own three Rokus (1,2 and 3).  I was hesitant about getting this and didn't know if I even needed it.  I decided to replace the Roku 1 box if I liked it.Wow, it is keeper!  Yea, it doesn't have all the channels, but it has the ones I watch.  No problems with the setup and it did a quick update.  What makes it different is the speed, Dolby+ audio and games.  The menus need to be refined, but are usable.I am looking forward to getting my back-ordered controller to see how the game play really is. I realize it is not a front line game console, but may be a cheap alternative to our Sony machine.Rock on Amazon, I can't wait to see your new cellphone lineup when it releases!", "verified": true, "helpfulness": "2/2", "author": "Whiptastic"}, {"rating": 1.0, "review": "(yes, you read that correctly - the actual name of the device is KFTV aka Kindle Fire TV; \"Amazon Fire TV\" is more of a branding/marketing thing)Amazon App Store won't let me install kindle reader - \"not compatible\"I sideloaded a copy of kindle reader, gotten from Google Play Store. it runs, it knows my identity because of the underlying Amazon Framework already existing on FireTV, it is able to log me in. the one thing it does not do is show *any* of my books. one thing that did work, was the Feedback button. yes, I used kindle reader, running on my firetv, to politely ask Amazon via the Feedback button, why my Kindle Fire TV could not read Kindle books. apparently the feedback button works, Amazon replied to me via email less than a couple hours later! (I did not include my email or name in my feedback, so obviously the kindle app IS correctly logged in etc. since Amazon had no problem sending it to my unique amazon login email)maybe a lot of people don't want to read ebooks on their tv. but for people with disabilities, it would be wonderful.in all other ways, this is an excellent device and I would normally give it 4 or probably even 5 stars. all I ever really wanted was an android console that had a REAL app for Prime TV - up until now I have been using OUYA with web browser and a rapidly-becoming-outdate/EOL Adobe Flash plugin. firetv is a MUCH better experience for amazon instant video!!!", "verified": true, "helpfulness": "3/16", "author": "Henzo Broquee \"HB\""}, {"rating": 5.0, "review": "Easy set up, works flawlessly!I have it in my office lobby, plug it in, use a HDMI cable, ensure your wireless works, log in to your accounts, and that's it! Great for Amazon Prime, Netflix, Hulu, etc. Would highly recommend it for work, home, school, etc. I've already ordered more!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was very pleasantly surprised how easy it was to set up; I am not helpless, being in the technology fields myself - but it is much appreciated if I don't have to work when purchasing a new device.Speech works even with my accent; we have not had opportunity to try out any game, we are waiting for the controller;I love the remote control and wish any would be as clearly designed, and easy to handle.I especially like that I can lock down the instant video (or all buying) on my credit card as I have children in my home.", "verified": true, "helpfulness": "0/0", "author": "OmaMarion"}, {"rating": 4.0, "review": "Man, is this thing FAST. Needs more content though, something easy fixed by installing XBMC. Once the option to add external storage via USB, this thing will REALLY open up!!", "verified": true, "helpfulness": "0/0", "author": "Oscar Calderon"}, {"rating": 5.0, "review": "Since I got the Amazon Fire TV, it was a little slow at first but that was because of my internet connection.  But since I got my internet connection right, I have been having a \"BALL\" with my Amazon Fire TV.  All I got to say is I just \"LOVE\" Amazon, and you are the best.", "verified": true, "helpfulness": "0/0", "author": "Margaret Burnett"}, {"rating": 2.0, "review": "I would give this 4 stars if It didn't cost so much after the purchase price. It has NO off function. If you unplug it and plug it back in, it auto turns on, after 5 seconds or 5 hours.. It takes 5 minutes of idle time to \"go to sleep\" then ANOTHER HALF HOUR to shut off! That's a half hour of electricity and bandwidth. 35 EXTRA minutes every time you watch ANYTHING. I called customer service to make sure I wasn't crazy. The rep said...\"It doesn't have that functionality at this time.\". Is there anything else in the WHOLE of the universe that is the modern era that you can't turn off? Seriously?!? No off switch? No hold the home button to turn off? You shipped it like that? The voice search is the best! I gave 2 stars for that alone. While it only searches the Amazon library, it does that perfectly. Netflix, Hulu, Crackle, all easily accessed and enjoyed. I don't mean to dwell, but NO OFF BUTTON?!? C'mon! I truly hope they do a software update to fix that glaring omission in an otherwise 4 star product. You might not think it much, but over a year an hour of this a day could add up to a hundred dollars or more in electric bills. It's just in idle. I'm stunned this isn't front page news. A car that ran for half an hour after you get out of it; front page news! The first ever electronic that can't be turned of by any means... Sorry, but this freaks me out. It's hooked up to my internet and electricity, but I can't turn it off?!?*Update* Buy a Roku. Needs to be reset to factory settings and reload EVERYTHING about every 4-5 weeks. Apps won't play certain videos then most videos. After getting over the no off switch insanity, I started using it every day. It's functional and user friendly. The voice search only works with Amazon's app. I understand they are trying to sell digital products, but if you're like me you don't throw away money on \"buying\" digital movies and television. I can't say how many times I use the voice search to find a movie for sale or rent. I then look on Netflix or Crackle it's there for free. Earbuds in the remote would be a better and more useful feature. The point of no off switch was to keep apps up to date. They do not. Resetting to factory is painful and time consuming.", "verified": true, "helpfulness": "6/19", "author": "Bruce W. Johns \"Belgragahd\""}]