[{"rating": 1.0, "review": "I wanted to love Amazon FIre TV. I bought it shortly after it came out, and I'd hoped it would improve over time (I thought maybe it needed software updates). The Amazon video app works fine, but I can't always access Netflix, and Hulu constantly freezes. I watch Hulu shows most, followed by Netflix. My Roku is far superior to the Amazon Fire TV. This is definitely a purchase I regret.", "verified": true, "helpfulness": "1/5", "author": "Lucinda Morabito"}, {"rating": 5.0, "review": "i love saving money. no need for cable!", "verified": true, "helpfulness": "0/0", "author": "Dwayne Parker"}, {"rating": 2.0, "review": "There are too many little irritating problems that just make this a bad product.  The YouTube application is a trainwreck.  There are not nearly as many games available as they make it seem, and most of them are either 4 bucks or you can play a really limited version for free and then the microtransactions start.  Voice search only works for Amazon Instant video.  I just wish I had gotten the Roku.", "verified": true, "helpfulness": "1/1", "author": "Beast"}, {"rating": 1.0, "review": "I had a Roku (loved it) and an Apple TV (loved it) and now the Amazon Fire (not really loving it).  I purchased this to replace my Apple TV.  I was very happy with the decision.  Until I tried the Hulu Plus app (which is the app that I use the most).  It worked great for about 15 minutes and then the picture froze but the sound kept going.  I started it over and it played for about 10 minutes and the whole thing froze up.  I emailed Amazon and they tried to help but couldn't get it to work.  So unfortunately it is back in the box and in my closet because that is a deal breaker for me.  Upset about the wasted $100.This would have been a 5 star if the Hulu App would work because the rest of the features are better than I expected.  If you are using thing other than Hulu I highly recommend this product.  If you are looking to use Hulu Plus I would recommend either the Apple TV or Roku.", "verified": false, "helpfulness": "0/3", "author": "Melissa orr"}, {"rating": 2.0, "review": "Not much storage for apps!", "verified": true, "helpfulness": "1/1", "author": "rm250"}, {"rating": 5.0, "review": "Wow.  I had an original Roku.  This just blows it away.  Easy, easy, easy setup, a remote that works from anywhere nearby, all the same content feeds that you really care about (Amazon, Netflix), and a lot more that I haven't even really discovered yet.", "verified": true, "helpfulness": "0/0", "author": "Danal"}, {"rating": 5.0, "review": "LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "Dawn J. Kerns"}, {"rating": 5.0, "review": "Fire TV is Great !!! Lots of very good movies on Prime TV and most at no cost.", "verified": true, "helpfulness": "0/0", "author": "William R. Rueth"}, {"rating": 5.0, "review": "Just love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it love it.  optical out, runs all 3 streaming services I use.  small, fast.", "verified": true, "helpfulness": "0/0", "author": "R. Fairchild"}]