[{"rating": 5.0, "review": "basically  excellent !!!!!!!!!  good bye cable t.v !!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "The Amazon fire was a present from my son!  The unit itself is easy to use and the remote is fantastic especially the voice search!I'm still learning how to find all the possibilities that amazon prime offers. I've been also talking to my co-workers about amazon prime , keep up the great job you all are doing!!!!", "verified": true, "helpfulness": "0/0", "author": "mark"}, {"rating": 5.0, "review": "Wonderful little device.  Easy to use and takes little space on the TV table.  The selection for Prime members like myself is outstanding.", "verified": true, "helpfulness": "0/0", "author": "Arthur M"}, {"rating": 4.0, "review": "This works great, if you are using your computer like I was, stop, buys this you will love it. However the voice search seems to no longer work, worked great for a few days, and stopped, I have tried trouble shooting it but nope, have to search ye olde fashioned way now.", "verified": true, "helpfulness": "0/0", "author": "qwerty"}, {"rating": 5.0, "review": "This is a great device to add more entertainment to your TV.  I have high speed internet and cable through Midcontinent Communications and I have the Fire TV connected to my TV through a home theater receiver.  It works exactly as advertised. I haven't experienced any buffering or other issues.  The picture quality is excellent and the responsiveness is too.  I have Amazon Prime so I have lots of movies/TV to watch whenever I want.  Yesterday I loaded the watchESPN app so that I could watch football being broadcast on ESPN3.  It was simple to confirm my Midcontinent account and the HD picture quality was still excellent.  What a great way to watch a game instead of on a PC screen!  I also listen to my music collection through my home theater with it.  It's easy to pick what you want to listen to on the TV screen, then the screen saver comes on as you listen so there aren't any issues there either.  I'd buy it again without any hesitation.  Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 1.0, "review": "shame on you for the most recent firmware update.  i now own a black plastic brick.  next time i'll stick with home made.  maybe next time you should simply not upgrade the device rather than brick it?", "verified": false, "helpfulness": "1/5", "author": "Michael J. Johnson"}, {"rating": 5.0, "review": "We love this! We got rid of cable to save some money, and this is a great alternative! We've mostly used it to watch Prime shows & Netfix.", "verified": true, "helpfulness": "0/0", "author": "Angela M. Reckert \"amp\""}, {"rating": 3.0, "review": "Does not work with DLNA. Big disappointment.", "verified": true, "helpfulness": "0/0", "author": "Edward Cross"}, {"rating": 5.0, "review": "Nice product , easy to use", "verified": true, "helpfulness": "0/0", "author": "Bill Peoples"}, {"rating": 4.0, "review": "So far its an A", "verified": true, "helpfulness": "0/0", "author": "RAY"}]