[{"rating": 5.0, "review": "I just started but love the vast selection of movies, music and bonuses.", "verified": true, "helpfulness": "1/1", "author": "Hawaii Reader"}, {"rating": 5.0, "review": "Watch it all the time", "verified": true, "helpfulness": "0/0", "author": "Taresa Muse"}, {"rating": 4.0, "review": "Easy set and it does everything as advertised.  I have one complaint that the search feature does not do cross platform like the ruko?  Will this feature be added so it will search prime Hulu Netflix etc.", "verified": true, "helpfulness": "0/0", "author": "Solomon"}, {"rating": 5.0, "review": "Easy to set up, easy to use.  Just wish I could connect to my Amazon Cloud reader and read my Kindle books on the big screen.  Otherwise very usefull, especially if you have Netflix and HuluPlus.", "verified": true, "helpfulness": "0/0", "author": "P. M. Whitehouse"}, {"rating": 5.0, "review": "Best media player ever. I side loaded XBMC and I stream my content from a AirPort Extreme where I have a USB hard drive plugged in. I do have to reboot the fire tv about once a month but I think that is just because I run XBMC none stop.", "verified": true, "helpfulness": "1/1", "author": "Jeff Roberts"}, {"rating": 4.0, "review": "Not all movies are available through the amazon prime, some movies are available by paying a fee independent from the membership.  Also I don't like that you can only stream movies.  Picture quality is excellent.", "verified": true, "helpfulness": "0/0", "author": "Whitetulip"}, {"rating": 5.0, "review": "Got the Fire TV two weeks ago, so far I love it. The only thing that I would ask them to change, and maybe because I am used to the Apple TV, will be the layout of the Apps and when the Free Time for kids is really Free, then this will be an awesome product.", "verified": true, "helpfulness": "0/0", "author": "Sergio Ochoa-Sanchez"}, {"rating": 5.0, "review": "Love it, love it, love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Sunshine43221 \"R M B\""}, {"rating": 5.0, "review": "I  love this device.  I use it all the time for tv shows, movies and now music.  Definitely worth the price!", "verified": true, "helpfulness": "0/0", "author": "Lou Ann B \"brown9340\""}, {"rating": 5.0, "review": "So far I am well pleased with my purchase.  Being an Amazon Prime member I've been able to watch movies and am still playing around with it but so far I like it.", "verified": true, "helpfulness": "0/0", "author": "Halfton57"}]