[{"rating": 5.0, "review": "This is a great little box. I have / have had just about every box like this ever made (Roku etc). They get better and better as time goes on. The hardware (CPU and RAM) in this one is the best of any of them (right now). That means fewer video issues and less stops while the box buffers data. I'm sure in a year or three this box will look a bit dated hardware wise, that's how this stuff always works.The box updates fast, apps download quickly, there are a ton of free this and that you can install on the device. The included remote works well and the voice search is actually useful. If you can't find something, just ask it and hit the enter button.Setup was quick and fairly painless. Getting around to the back of the AV receiver to plug in the HDMI cable was the hardest part.  It came up on the (wired) network via DHCP right away. It did a couple of updates and reboots (just like a Roku 3) before it was ready for use. It was already set up with my Prime account, I had to punch in the Netflix and Hulu Plus stuff for the subscriptions I've already got. After it was running I re-addressed it with a fixed address, that went fine as well.After watching shows and movies on it for a few days, there has not been a single \"wait, buffering, back in a while\" sort of event. With some of the other stuff I own, those sort of messages are fairly common on a saturday night when everybody is busy doing video. Video quality and sound quality is top notch. No massive pixelation on action scenes (so far), no weird stereo only sound, no crazy looking backgrounds when the scene goes flat. If that stuff does not ring any bells with you, buy some of the older gear ...The only real competition for this box is the Roku 3 (sorry Apple). I love my Apple TV, I've had various models since they first came out. It's just not got the apps, games and the channels. The Roku has a massive channel lineup. My favorite of the bunch is Acorn TV. Having a wide lineup lets people pick obscure stuff (like British TV) that they happen to like. The Roku menu is to my eyes a bit more clunky. It's not got apps or many games. Right now, Roku is ahead on channels and the Fire TV is ahead on hardware performance. Tomorrow there may be a Roku 4 (or 5 or 6). Tomorrow Amazon might announce 1000 more channels.What could they improve? Well, did I mention adding more channels ... guess I did once or twice. I run PLEX for local media, that works for me. Others seem to prefer DLNA shares, been there / done that, not my favorite. Getting the USB port up for local media would be a nice touch. So would a bluetooth headset. There's nothing on this list that came as a surprise. I'd read up on the box before I ordered it (yes it was a quick read in order to buy it on the first day out). None of it is a very big deal to me ... except Acorn TV :)What I expect to happen - there should be an update to stream music from the Amazon Cloud service. They are coming up with more real games for this box (there's only one now plus a bunch of tablet games). There are sure to be more channels. The USB port must eventually do *something*.  Hopefully the device can be run from an IP stack so it will integrate with WiFi based (phones / tablets) remotes. Integration with a Silicon Dust style / cable card tuner would also be a nice thing (yes this has drifted from \"expect\" to \"wish\" to \"you are dreaming\").Who is this for right now - people who don't yet have an internet streaming media box or who have one that's a bit brain dead. People with a Kindle HDX and a Prime account (but no box) would be an ideal audience. People with good internet connections (10 Mb/s and up).Who is this not for right now - people with 40 TB of local media who can only share it via NFS or SMB. People who are fully locked into the Apple / iTunes infrastructure for both audio and video. People who want to watch local channels, but dump their cable box. People with poor internet connections (2 Mb/s and down). People outside the US are not going to get much streaming on this, so its not a good bet for them. People who did not (yet) buy an HDTV, this is only going to work with a HD set.What's in the box - You get the (little) bluetooth remote. A 1.2 x 1.2 x 1.8\" power adapter (16W max, 100 to 240 V 50/60 Hz). The Fire TV. Batteries for the remote. It comes with an option for a 30 day free Prime membership.What's not in the box - No HDMI, optical, ethernet, or USB cables. No game controller. No pre-paid subscription to Netflix (Hint : check out the Netflix web site). If you need cables or the game controller - Amazon would *love* to sell them to you. If you don't need them, you don't have to pay for them (they are never really free).What to do? If you don't already have Prime and are ready to get it - sign up for it *before* you buy the Fire TV. That way it will come pre-loaded on the box. You will save at least 30 seconds of setup time (and 20 or 30 button pushes) that way.", "verified": true, "helpfulness": "10/12", "author": "Uncle Bob"}, {"rating": 5.0, "review": "I received this tiny little marvel yesterday (4/5/2014).  I managed to find an HDMI cable and plugged it in.  The batteries delivered with the unit remote didn't work but fresh ones did just fine.  Then I was amazed at how easy it was to set up, use and get working.  The vast array of selection is amazing.  The tiny handheld remote fits nicely in your hand and the voice search/activation does amazingly well.  When you 'search' I haven't figured out how to focus on what I'm searching; it isn't really clear.  Nice to be able to search cross/applications but I don't think it works that way.The video output is excellent.  I have it going through my sound system amplifier and my Bose speakers.  Even has screen savers I found when trying out a search (many are free).  Seems to nickle and dime you with apps but you can search for the free ones.FInding movies is great on the Amazon list and if you are a PRIME customer (who isn't?) most are free to view.FAST and great buffered selection over my dual/channel wifi.  You can select which band to use.Setup is a snap and the 'keypad' is one of the easier ones to use.  Wish one of these boxes would offer a wireless keyboard; selecting one letter at a time is a pain in the but, but functional no less.", "verified": true, "helpfulness": "3/5", "author": "Skip Stein \"Management Systems Consulting, Inc.\""}, {"rating": 5.0, "review": "This is one of these products that was a joy to receive. It was a snap to setup. It came preregistered to me since I ordered through Amazon. My Hulu and Netflix accounts were easy to setup. The video quality is excellent. Load times are fast. The only beef I might have is the voice search, which works very well, only works on Amazon selection of content. Hopefully voice search will expand to Netflix and Hulu in the future.", "verified": true, "helpfulness": "2/3", "author": "Robert R. Hawthorne \"Robert\""}, {"rating": 2.0, "review": "I'll keep this short and direct as there are many reviews here you can read in more detail:I set this item up for a neighbor yesterday. She is a Prime member and paid $100 for this. Personally, after toying with the Fire TV for a short time, I will be sticking with my $50 Roku.PS - I am also a Prime Member and the Roku is much easier to use for Amazon content. With my Roku, I can choose to browse through the Prime movie content exclusively. Very convenient.", "verified": false, "helpfulness": "6/23", "author": "P J Penrose"}, {"rating": 3.0, "review": "I got the Fire TV because I was not using the free movies from my Prime subscription.  I thought it would help my get more out of that subscription.  First I'll list the positives.  It is very nice that as soon as I select a show it starts.  This feature is somewhat baffling and is the kind of thing that doesn't sound all that exciting until you actually use it.  I also really liked the voice search, there is nothing more annoying than having to type on a on-screen keyboard with a remote one letter at a time.  The voice search was accurate and quick.  The few things I didn't like were more to do with the offerings and user interface.  It would be nice if I could tell Amazon to only show the videos that I have access to for free.  The way I could see this working is by showing all the things like Netflix, Hulu Plus, Amazon Prime, and anything else I have an account with, and then collapsing the Vevo and other offerings behind a \"more\" section.  As for the movies I have to pay for? Show those under a store section, and when I search for them and they aren't included in my \"free or already subscribed to\" options.  The user interface feels more like I'm digging through advertisements to find videos I can watch, than a library of content I've already purchased.  My last gripe is they talked about it being an open-ecosystem yet I don't see Google Play options on videos I can purchase.  I also have no way to access those videos.  I feel like there are surely other services too that aren't on here.  Now this is understandable I suppose because it requires those companies to cooperate, but one of the big features discussed was an \"open-ecosystem\" and I don't see it.", "verified": true, "helpfulness": "6/9", "author": "David M"}, {"rating": 1.0, "review": "Since it is not easily possible to filter out the Amazon prime content it's just a $99.- tool to pay amazon even more money for pay per view content....My sharp tv is doing a better job with Netflix and my computer makes it easier to find prime movies that are included in my subscription ....now if it would include international apps that would be a killer", "verified": true, "helpfulness": "11/38", "author": "Me"}, {"rating": 3.0, "review": "Update:Knocking off a star because the Bluetooth remote is a PITA.Can't imagine what problem that is supposed to solve.If you're watching TV, you are going to be line-of-sight to your gear anyway, so what's wrong with IR?Original Review:Took a chance on this because the Netflix app on the PS3 seems to be getting slower and slower lately, and I wanted something that would stream Pandora. It arrived on time and installed in half a minute. It connected fine to the network, but the update kept timing out despite all the recommended troubleshooting, so I gave up and went to bed. Next morning, tried again and it worked perfectly. I'm guessing there was an issue with Amazon's servers.The Netflix app launches almost instantly and responds well. Happy about that. Pandora also.Awesome integration with content purchased from Amazon.So far, I'm very impressed. Except for:I was hoping the Amazon app would be as responsive as Netflix with rewind/fast forward functions.It's better than the PS3 app, but a little disappointing.Hopefully Amazon will enable the USB port soon. It would be nice to access my own content from an external drive.The remote is Bluetooth, so I can't program my Harmony 700 to control the Fire TV box. Back to juggling remotes until Logitech comes up with a solution.Four stars.", "verified": true, "helpfulness": "2/3", "author": "Bobarian"}, {"rating": 5.0, "review": "This was my first streaming media box. I do not own a Roku, Chromecast, or AppleTV. I do own a Wii U which offers a similar experience and I do own first gen Kindles. I mainly bought into FireTV as another way to access prime content which it does fairly well. I wish it would offer more ways for me to explore prime content. While the voice search feature is nice it mainly points out content that Amazon would like me to purchase. I did enjoy how the voice feature worked with the Vevo app which allowed me to see all the music videos available for any artist on the Vevo network. I did also enjoy the Youtube TV app which integrated and paired with my iphone easily and I was able to setup TV playlists that worked with FireTV very easily. I did buy a controller and I played through a bit of Sev Zero, Double Dragon Trilogy, Crazy Taxi, and Sonic CD. I am a pretty casual gamer and I was able to lose myself in the games for a few hours pretty easily. The controls on Crazy Taxi and DD are a bit wonky but that is more a problem with the games and not with Fire TV. I believe I will get many hours of enjoyment with this box and I can't wait to see what else Amazon comes up with.", "verified": true, "helpfulness": "1/1", "author": "rynsmns"}, {"rating": 2.0, "review": "I bought this because of the repeated promise of \"simplicity\" with the search. Amazon repeatedly touted \"a voice search that works\". Well it does work, sorta. I am an Amazon Prime member so I thought this device would be a great new way to better use their streaming services rather than just Netflix, and it is, again, sorta.The voice search does recognize your commands very well, but it just searches Amazon, not Netflix, Pandora, Hulu, etc. just Amazon. That's bad enough, but to make matters much worse, you cannot have the search feature differentiate between programs you can watch for free via your Prime membership vs programs you have to pay Amazon's completely ridiculous prices of $5.00 to rent or $20.00 to buy, so in using the one of the main selling points of this device, you must wade through all of the programming that you do not want to pay exorbitant rental fees for in order to find the (comparatively to Netflix) relatively few viewing options available via your Prime membership. So forget the voice search, it's basically (at this point hopefully) useless.The good points are:*It is fast. I wakes from sleep mode much quicker than AppleTV. It is responsive and quick while using the remote to navigate the menus.*The interface is pretty good. Clean, and easy to use, though it still pales in comparison to that of AppleTV.*The no point of site requirement via Bluetooth is my favorite feature. again the remote works great with the device itself behind a closed media closet door.I hope Amazon will correct\\improve these search feature via an update, but who knows at this point. I don't hate it, but given the price and limitations of the search, AppleTV is still a better product. The Amazon Fire has some promising features, hopefully the will spend more time on making the search more inclusive instead of games that I doubt many people will ever care very much about.", "verified": true, "helpfulness": "10/16", "author": "Ken"}, {"rating": 5.0, "review": "I’m an electronics junky and I’ve owned many of the available streaming boxes, Apple TV, Boxee Box, Popcorn Hour A300, WD Live, 6 Roku’s, a couple of Google TV options, and I am really impressed with the Fire TV.The closest comparison is the Google TV devices.  It’s a little tricky to get all of the audio and video scale options set up correctly because some of these settings must be done at the system level first, then within the app (Plex).  But once it’s set up correctly it’s a very nice option.As others have said it’s very fast and powerful, the GUI is clean and simple (wish I could move things around like Roku), and for now it’s a bit limited on the app offerings.  I’m not sure that the rest of my family will take to it as easy as they do the Roku’s, but once you get used to the arrangement it’s good.Where I think the Fire TV shines is the speed, picture quality is amazing, and the future options with android and the power under the hood.", "verified": true, "helpfulness": "2/3", "author": "Hilde"}]