[{"rating": 5.0, "review": "Incredible. Wish we had it sooner. If you watch a lot of Netflix or Amazon Prime movies & tv shows, then this is the solution/ best gift ever. All you do is plug it into your tv and the super easy remote (speak \"Hobbit\" and presto - it's there!) gives you all the movies right there on your tv. We cancelled our cable a year ago and never missed it -hooking our laptop up to the tv whenever we wanted to see stuff on the big screen - but we should have just grabbed this instead. It's just like having cable back again, without the insane monthly prices AND - and this is super nice - NO MORE COMMERCIALS!!! Yaaay! We were at a hotel last week and the programming was so offensive and there were so many commercials that we seriously wished we'd just brought our Amazon Fire TV box (it's a mini-box, really) with us - would have made our stay a lot nicer.Basics: just like your laptop or tablet needs wifi or an ethernet plug-in to play movies, tv shows and youtube videos, so does the Amazon Fire TV box. But intstead of the movies playing on the box, they play on your tv instead. Simple as that. Wham. Bam. Superior. Sweet. Far easier installation and ease of use than we realized. It may seem super hi-tech, but it's just so intuitive and simple that it doesn't come off this way. AWESOME present for anyone who loves Amazon Instant Videos, Netflix, Hulu, etc...", "verified": true, "helpfulness": "1/1", "author": "TCampbell \"TCampbell\""}, {"rating": 5.0, "review": "LOVE IT!  Best early Christmas present EVER!!  The technical staff was very helpful when I called with a question.", "verified": true, "helpfulness": "0/0", "author": "Barbra A. Hoge"}, {"rating": 5.0, "review": "It works great, love it!", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "I really like the Firebox.. Looks like they are still add new features because the Music section isn't usable yet.Its very similar to a roku but a lot faster and the Plex support is great.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "If you go back 50 years and see what people would dream about when it comes to the amazing things that tv would do, this is it. The only thing it won't do is bring you breakfast in bed. The user interface is very intuitive, and I am one happy end-user. I can't believe that for $99 a year, I get all the access this amazing streamer provides. Free two-day shipping is just icing on the cake!", "verified": true, "helpfulness": "1/1", "author": "Kevin Days"}, {"rating": 4.0, "review": "Overall this is a fantastic device.Taking one star because I hope it has an easy way to manage and launch side loaded apps.", "verified": true, "helpfulness": "0/0", "author": "choice"}, {"rating": 5.0, "review": "The FireTV box is very simple to setup and use; I have been enjoying the ability to stream all sorts of content to it, including Amazon Prime movies/shows, as well as Netflix.", "verified": true, "helpfulness": "1/1", "author": "Elliott Elrod"}, {"rating": 5.0, "review": "Love it... super fast.. and very good!! Better than most android box out their. ..", "verified": true, "helpfulness": "0/0", "author": "Guillermo"}, {"rating": 5.0, "review": "Works well. Has many apps, but still missing a few popular/mainstream apps which im sure in time will be added. Voice recognition works extremely well and the device is very fast/responsive", "verified": false, "helpfulness": "1/1", "author": "Dennis C. Maa"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "gabriel"}]