[{"rating": 5.0, "review": "This is our best option for consistent quality while streaming.  We have a nice computer hooked up to our home entertainment system & even Netflix works better & seems to stream more smoothly on this Amazon Fire TV.  Our broadband speed fluctuates some (rural cellular) but the Fire TV often pre-downloads the next show in a series you're watching ... so it's ready!  No pausing to buffer!  The other super-cool ability is to mirror my Kindle Fire HD which can also download some of the Prime Instant Videos / Movies.  So we've got 2 options to watch streamed content in HD on our sometimes slower connection, without having to downres or wait to buffer.", "verified": true, "helpfulness": "0/0", "author": "PW"}, {"rating": 5.0, "review": "Works great and makes my television even better.  All my favorite apps in one place ON my television.", "verified": true, "helpfulness": "0/0", "author": "Irish"}, {"rating": 5.0, "review": "Excellent product for movie lovers but not so great for sports fans but easy to use", "verified": true, "helpfulness": "0/0", "author": "Ibrahim Yassin"}, {"rating": 1.0, "review": "This product can be good but: i bought two fire sticks, the two give me problems, after that i bought fire tv, i had problems and ask for  replacement,  when the replacement arrive,  was defective as well,  I was tired and I ask for a refund, i paid $79 and amazon refund me $53,  maybe send me  all defective products, its ok, the problem is when you paid $ 79 and amazon send back $ 53. I don't recommend This product and i  expecting some respect from Amazon, i m a good customer!", "verified": true, "helpfulness": "2/3", "author": "Adriano Uliano"}, {"rating": 3.0, "review": "It worked fine until it went hay wire. Afraid to use replacement as it seemed to have messed up LCD input channels.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very fast with barely any buffering shipped fast and voice search is amazingly accurate.", "verified": true, "helpfulness": "0/0", "author": "Josh N."}, {"rating": 4.0, "review": "So far I'm very happy with my Fire TV.  The interface easy to use, clean.  Can't wait for more apps to be added...Like Directtv. (Crossing my fingers.)  it is worth the purchase, I got it with the sling TV special .", "verified": true, "helpfulness": "0/0", "author": "Tanja Charles \"TCharles\""}, {"rating": 5.0, "review": "Simply Amazing", "verified": true, "helpfulness": "0/0", "author": "Whiscombe"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "This thing is great.  Sorry Apple TV, I'm a convert.  Much faster and easier to use.", "verified": true, "helpfulness": "0/0", "author": "tapeape"}]