[{"rating": 5.0, "review": "I'm on my way to ditching Comcast and this is one component in trying to reach that goal.  I'm really surprised at how seamless and quick the streaming is and it works well with Netflix too.  I was also impressed with the graphics of the games.", "verified": true, "helpfulness": "8/9", "author": "Scott Cole"}, {"rating": 5.0, "review": "The price point is right, and the UI is clean and easy to use.  It even has nice touches like letting Pandora radio keep playing while in-game on games where I don't want to listen to the game music.  I didn't realize How I Met Your Mother is free on Amazon Prime Instant Video, so I've been binge-watching that ever since I got this device.  We're using this on the second TV in our house that doesn't have a cable box hooked up to it (sometimes I connect my XBox to it).  I guess I could get a lot of that same content on by XBox, but I have one of the older ones and it is LOUD when on, unlike the Amazon Fire TV, which is silent.The device offers seamless integration with Amazon Cloud Drive photos as a screen saver or slide show.Where's Amazon Cloud Player integration though?  Seems oddly absent.Also the voice search, in addition to the clean UI, makes it really easy to use.  It's neat that you can do a voice search for anything, even an artist, and it pulls up the results across all apps that have relevant content, like the Vimeo app for music videos.Great stuff, glad I bought it, and would recommend it to anyone!", "verified": true, "helpfulness": "7/7", "author": "dyanacek"}, {"rating": 2.0, "review": "I did extensive research for the Amazon Fire TV. I read 5 reviews and watched all the review videos I could find before I ordered the Amazon Fire TV.None of the reviews or video reviews disclosed a very serious omission (except CNET's review just 2 days ago that I did not read until yesterday) and that is you CANNOT voice search any other application except Amazon Prime. Say you are in Netflix, and you voice search a movie or TV show, the Fire TV pops you out of Netflix and sends you to Amazon Prime where it may cost money to watch the show in question whereas the show I was wanting to watch was free on Netflix.This is such a serious omission that I a forced to return the product for a refund.The HBOGO app is not on Fire TV yet. I knew that going in, but how long will it be before it is. Who knows. Tech support at Amazon could not even tell me. So I will stick with Apple TV and my Roku 3 and my Roku HDMI Streaming Stick. Roku has PLEX and that is a total winner my book.Once Amazon incorporates voice search across all applications, I will be all in not to mention HBOGO.The Amazon Fire TV is the fastest streaming box ever. When you request a show and push go, the video starts immediately. Not 2 seconds or 3 seconds but NOW. Accessing the menus is also very very fast. Again, this steaming box is hands down the fastest there is BUT it all goes away with a bad implementation of voice search.If you do not need voice search then the Fire TV is the best when it comes to speed and you want to stay in the Amazon Prime ECO system.First adopters suffer the most.", "verified": true, "helpfulness": "11/18", "author": "Ted Hartman \"Ted\""}, {"rating": 3.0, "review": "I confess, I'm a bit of a Streaming Media Player junkie.  I have all the major ones...Apple TV, Roku 3, Chromecast, Slingbox 500...even the Vudu XL Box.  Throw in the blu-ray player, Tivo, a mac mini running Windows Media Center paired to a HD HomeRun Prime, and of course, the TV...I'm up to 12 separate remote controls. This is exactly why a Logitech Harmony remote is a god send for me.  It keeps my wife from leaving me.That's why I am astounded that the Fire TV is the first A/V device (other than Chromecast, for obvious reasons) that my Harmony cannot control.  I'm really disappointed that Amazon didn't put a 10-cent IR receiver in the Fire TV, so those of us who use a Harmony (or other brand universal remote) can utilize it.  Roku has had several models that use Bluetooth or WiFi-direct for their remotes...yet they still had the foresight to put an IR receiver in every version of their player.  Even Vudu realized the importance of IR compatibility in their short-lived XL Box and offered a plug-in IR dongle accessory!  Perhaps Amazon could offer a IR dongle accessory, using the USB port?  Or even just build in software support of a 3rd party usb-IR dongle would be sufficient.  There are plenty of USB-IR dongles available for Window Media Center PC's.I realize they had to use Bluetooth so that voice searching works...I get that.  And when I want to use Voice Search, I have no problem grabbing the stock remote out of the drawer and using it.  But for every day navigation, I'd much rather use my Harmony.Besides the IR issue, the Fire TV has a decent user interface, and is the fastest to start streaming content, bar-none.  I am astounded at how quick the movie starts playing.  It makes the other media streamers feel like snails.  I used to think my Internet connection just wasn't fast enough, but the Fire TV blows that theory out of the water.  So, other than the lack of IR, it's a solid media streamer.", "verified": true, "helpfulness": "6/9", "author": "Blakeintosh"}, {"rating": 5.0, "review": "I didn't have any of these streaming boxes (definitely wouldn't get Chromecast as it sounds like spyware, period, but had thought about Roku), however, with my confidence in Amazon the day I read about this, I impulsively just ordered it. Only $99 (plus $5.49 for hdmi cable--Amazon gives you the option before you complete your order and I was glad I did--so easy when they both arrived together)--seemed like a real bargain, especially if you're a Prime member. I know I could have been streaming free videos to my Kindle Fire but...it's small and I never bothered to do it. Now, with this coming on the regular \"TV\" screen...perfect!Anyway, I always find setting things up kind of stressful. (Will it be difficult? Will everything be there? Will it actually work without any troubleshooting needed?)  The set up for this was exactly the three simple steps it said (oh and also, they're right about \"easy open packaging\"--no plastic wrap or annoying plastic containers that require a knife to open. Just a nice little black cardboard box--remove the front sticker/label and open--so neat and quick and easy. The batteries in it and the power cable are in the little black box inside. I almost missed seeing the batteries, but they're there.)The Fire TV is so nice and simple. Just a flat square black box (smaller and thinner than I expected), the power cable to plug in, a remote control with simple controls (pictures for back/forth, home/menu, etc.), and two AAA batteries. Everything you need for setup is included (if you bought or have an hdmi cable too).We plugged it in. Turned on the tv, set it to an \"hdmi\" setting on our menu and then the Fire TV began automatically installing. It had no problem at all connecting with our router which I thought might be very poorly positioned (far away, down low, lots of interference, but... no problem at all). And there's no problem turning the router on and off--the Amazon Fire starts up as if it was never turned off. (There was a little problem that it reconfigured our tv formatting the first time we used it, so we had to go back into the LG settings, but after that it kept the settings fine.)It had a nice, quick animated introduction to how it works. Then we played with the controls, watched a few things and the picture quality with Amazon streaming was outstanding. Beautifully clear, even on some old tv shows from 1970, and absolutely NO buffering!  Perfect quality in all respects, as if it was all playing straight from a dvd.Excellent voice recognition:  I really want to mention how great the voice recognition software is. Push the microphone button, say a key word or title and ... voila! It identifies what you want extremely quickly and well. (You can also use the text to type in and it's pretty fast narrowing down a list each time you put in a new letter--voice is obviously easier, but I appreciate having a text option, too).Important:  You can go to settings and \"opt out\" of having your selections tracked, etc. for Amazon marketing purposes. I did this, but not at first. So, later that night I got an email asking for an evaluation of the first thing I watched--just a quick rating 1-5 stars, easy to do, but I'd rather not be tracked. Since \"opting out\", I haven't received anything. (And, yes, we've been really enjoying this all weekend.)If you're a Prime member, there's a lot of selection, but...two small comments. First, be careful to check if something you're looking for is available for free from Prime. There were a couple of times we had to look beyond the first screen to see that it was.Second thing, and this is directed toward Amazon itself, is there a directory anywhere that lists all the available movies, tv programs, etc.? If you can't have a comprehensive list (words, not pictures which take forever to scroll through) on Fire TV, why not at least in a single \"booklet\" online somewhere? It is beautifully easy to find what you're looking for (voice or text entry works well), but if you want to browse and find something new it isn't easy at all.I really think this little device--plus Amazon Prime--is a game changer for the company. (How I wish I'd kept my stock at $39 a share! Too late now...)  I definitely recommend it--5 stars..", "verified": true, "helpfulness": "6/6", "author": "Elisa 20"}, {"rating": 1.0, "review": "The product seems to be very sensitive to wireless network configuration. It provides no useful information beyond \"Fix your Network Settings.\"When I brought it up at home it wanted to install a software update first thing. It complained that it thought the network was too slow and aborted it after 30 minutes. Second time it appeared to successfully install the update, but then was unable to connect to \"Home\" blaming the local network. I had entered the password in clear text and have many devices including Google TV/BlueRay and Apple TV quite happily working on the network.I verified that the local network had reasonable performance by turning on a video from Hulu Plus using the Apple TV connected to the same wireless router. I had no problems with full HDTV watching the video with Apple TV immediately afterwards. Every time I tried to connect again using the Amazon Fire TV I got \"Connected with Problems\" and \"Unable to display HOME due to Network Settings.I stuck with just using the Apple TV at home since I had bought the device mainly for traveling.When I got to the hotel a couple of days later I had the same kind of problems. It would \"Connect With Problems\" and then not show Home. The hotel's network is open, but an access log on web page has to be used in order to open up the account. The page to do so never came up. All I get is Connected With Problems and \"Can't Connect to Home\".To test the device I brought up my Verizon Wireless MiFi and tried to connect to Amazon through it. Although it too complained \"Connected with Problems\" I was able to see my video library and everything functioned as expected.To date the only wireless device I have been able to connect to my library with is one where I have to pay per GB over LTE. This is unusable for me.For the heck of it I will pick up another router in order to try the device with a wired connection when I get home. Maybe plugging it into a wired connection will make it usable at home. I am out of ports at the moment in that location.I have been an early adopter of nearly every generation of Kindle and then Fire. I have been for the most part very happy with them. This is the only time I have bought anything from Amazon and have not been have it do anything useful with it. I am stunned. This product does not seem to be ready for prime time yet. It needs better diagnostic and troubleshooting information beyond pronouncing that every connection has problems. It needs to be able to support the case of a login web page being needed before I can use it on the road which is the main reason I bought it.The one positive thing I can say about it is the picture quality over my MiFi was very good. The screen saver photos were incredible too. Unfortunately they must have been coming from the cloud because they went away when I turned of my MiFi.", "verified": true, "helpfulness": "16/37", "author": "Volney \"Volney\""}, {"rating": 5.0, "review": "It was a snap to set up and worked perfectly through my Onkyo receiver.  The remote works great even with the FireTV in a media cabinet.  I found the box to be very fast in terms of UI.", "verified": true, "helpfulness": "3/3", "author": "DLimp"}, {"rating": 5.0, "review": "I have 2 Apple TV boxes and I am very satisfied with them but the voice remote on Amazon Fire TV is really high tech. Picks up voice command without a problem. The streaming is as good as Apple TV and getting the convenience of Amazon Prime movies is just terrific!Set-up is very easy and all functions are explained in the set-up introduction. Amazon is becoming the major contender in the streaming field and this product is proof of it!", "verified": false, "helpfulness": "3/3", "author": "KEN TELLS ALL \"Perfectionist\""}, {"rating": 5.0, "review": "Setup the box within minutes, I was able to connect to all my services with no issues. I bought this as an alternative to another Roku box, and I have no regrets.", "verified": true, "helpfulness": "4/4", "author": "Larry S"}, {"rating": 1.0, "review": "I connected the Amazon Fire TV to my Sony HD TV and it quickly booted up. I connected it to my WiFi and it loaded new software. After the software was updated the TV screen went dark and I was unable to access the home page.  I disconnected the power and waited 30 seconds as directed in the online trouble shooting guide. It quickly booted and asked me again to connect to the internet which I did although it was already connected.  This time the TV screen glowed bright white but I was still unable to access the home page which is where all the options are for solving problems. The only button on the remote that works is the \"back\" button which goes to the internet connection page. After skipping that as it was already connected, the screen again went blank. I reconnected my Sony streamer and it works fine. I would really like to use this Amazon Fire TV but there is no way to get help except to go to the \"Home\" page which I cannot access. A phone number for a help line would be beneficial for electronic jerks like me. I'll keep trying but may have to return it due to the lack of assistance from Amazon.", "verified": true, "helpfulness": "12/28", "author": "Bugman_Ret"}]