[{"rating": 1.0, "review": "I am planing to buy it, looks impressive.. somebody knows if works for south-america or is just for USA? AMAZON must publish if this gadget works outside from USA... the world is more than USA and Canada.", "verified": false, "helpfulness": "9/102", "author": "Mario Enrique Cantor \"mariocantor\""}, {"rating": 5.0, "review": "I saw this little box advertised on Amazon's home page on Wed Apr 2, 2014 and promptly ordered it as soon as I read the description and realized I could easily hook it up to my TV and watch all my Prime movies and shows on TV, plus ESPN live match telecasts, Hulu shows, games and more.It was delivered Friday the 4th. It took all of five minutes to take it out of the box, strip off the protective packaging, insert the provided battery cells into the slim remote and hook it up to the TV and connected to my home internet network. My wife and I are NOT tech savvy individuals who are good with complicated gadgets and such, but we did not even need to read the attached slim booklet that came with it to figure out how to do it. (Side note: order the HDMI cable that Amazon offers up for a cheap price with the Fire TV box in case you don't have a spare one at home), It comes pre-configured to your Amazon account already.Once connected  to the TV and my WiFi, I could easily launch Prime videos and watch them on the big screen while sitting in my comfy recliner, rather than on a computer screen or on my iPad. I also watched a game telecast for a few minutes on the \"Watch ESPN\" app on Fire, which needed an additional two simple steps for verification the first time you use that app.I cannot tell you how excited we are to get and use this device. And I must say, even though Amazon does say the box is small, we were happily surprised by how slim and compact it really is. Picture and sound quality is HD 1080p.Superb little device. Cannot recommend it highly enough. Buy it, you will love it too!!!!", "verified": true, "helpfulness": "13/14", "author": "Yogi D \"Yogibear\""}, {"rating": 1.0, "review": "I was excited to see the Fire TV become available due to its specs.  I have been comparing it to the Roku and was leaning toward the Fire TV.  One of my requirements however is international programming with Russian language shows.  The Roku offers this, but from what I can see, Fire TV does not.  I sent an email to customer service inquiring if there is any international programming available or plans to add some, but I received an idiotic response telling me the Fire TV is only available to U.S. customers.  I assumed that since I've been a long time Amazon customer and my account information clearly shows that I live in the U.S. that their customer service people would know that, but I guess they are not that bright.  Further more, I thought my question was clear since I inquired about international programming, not using it in another country.  But again, i guess i was wrong.  So I have to assume at this point that international programming is not available and go with a Roku.", "verified": true, "helpfulness": "11/82", "author": "Angryone"}, {"rating": 4.0, "review": "I have been playing with my Amazon FIRE TV for a couple of days now and it's ok.  Nothing too exciting.  The version of Netflix is the same old generic app that runs on most devices.  Not the nice new slick version that runs on my Roku 3 which is actually embedded into the Roku hardware as is HuluPlus. The voice search is cute, but only seems to work with Amazon Prime video. All in all, it's a decent and ok STB. Only time will tell and we will see what appears over the coming weeks and months.", "verified": true, "helpfulness": "4/4", "author": "Co-Create"}, {"rating": 3.0, "review": "My kindle fire HDX download digital books and app with no problems,But when I try to purchase and download MUSIC,I am toldthat where I live (TRINIDAD and TOBAGO) my country is not within the ZONE and the downloading will not be executed. As suchI am wondering if the Amazon Fire TV will work re the ZONE matter.Edward.", "verified": false, "helpfulness": "1/20", "author": "Edward Montserin"}, {"rating": 5.0, "review": "Not sure where these negative reviews are coming from.  I've done plenty of messing around with the competing products on the market, and this is by FAR the best option out there. Not only that, but I'm confident it will get even better as updates are pushed out and more apps get published to the store.Size, performance, and voice search alone warrant a 5 star review.", "verified": true, "helpfulness": "12/14", "author": "Nimbus"}, {"rating": 1.0, "review": "I was really excited  when I saw this.  I currently have an Apple TV and lament the lack of apps. However not having HBO Go on the Fire is a deal breaker for me.", "verified": false, "helpfulness": "13/112", "author": "emily"}, {"rating": 1.0, "review": "I received my Fire TV yesterday . I spent three hours trying to connect it to my home WIFI network to no avail . I called Amazon Fire TV Tech Support but they could not help me . I do not understand how such a new product cannot connect to a simple home WIFI network . At the same time when I was trying to connect the Fire TV to my Wifi Network, I had an Ipad Min, a Nexus 7 , a Nexus 5, an Ipod Touch 5, a Samsung Galaxy Player 5.0 , a Google TV box and a Wii connected to my home Wifi Network . I turned off all my gadgets and tried to connect the Fire TV and it did not work . I deleted my WIFI passwork from my Nexus 5, Nexus 7 and google TV and reintered them and they connected immediately .I am going to return this Fire TV today . I have not even decided if I want to replace it becuase I was so disappointed . Has anyone else experienced this problem ?", "verified": true, "helpfulness": "43/72", "author": "Al Diallo"}, {"rating": 5.0, "review": "Got to try one out, the gaming is awesome for a streamer - played RipTide, very fluid and could play with the standard remote.  The voice search actually does work well.  I tried to stump it on a few obscure searches 'Weird Al Yankovic' and 'UHF' and it got them both.  As soon as I can sell or trade in my Roku 2 XD, will replace it with a Fire TV.  We're cable cutters and watch Amazon Instant and recently Netflix free trial.  Starting to build the Amazon Instant HD library as the discs are becoming a pain.  Enjoy being able to watch on any device and find the content.  Device size is smaller than you'd expect.", "verified": false, "helpfulness": "5/7", "author": "D. Purdy"}, {"rating": 5.0, "review": "Well after using it last night and sleeping on it, (the experience... didn't actually sleep on my Fire TV) I had been debating between 4 and 5 stars. I am a longtime media streamer. I have 7 Rokus and have bought 3 more as gifts to family. I also have a Chromcast and an Xbox 360. Additionally I have tried various other streaming devices such as  Netgear NeoTV, the D-Link MovieNite etc.(I am still trying to figure out why I bought the Chromecast  the least useful gadget I have ever owned. )First of all the Fire TV is everything that Amazon claims it is.  It is fast. It is sleek. The interface is handsome and of course very Kindle Fire like.After hooking it up it immediately downloaded updates. ( An annoying process that almost every new computing device does whether it is a phone, tablet, streamer, or computer. It seems to take forever but it is really not that long, it is just that we are in Christmas Morning opening presents mode and time slows down when you are excited about trying something new. ;-)  )I give it 5 stars because Amazon delivered what it said it would. I doubt it will replace anyone's existing favorite. I would recommend it to anyone just entering the streaming media game and who has kids and Amazon Prime. It is a fantastic portal to Amazon products.Many people have tried to compare it to Roku, Apple, Chromecast etc but to me I compare it to my XBox.  It plays Video, Music and Games so for some, who want to have a less expensive alternative to an XBox One, there it is.  (Of course you cannot compare it XBox One or PS4  but not everyone wants to shell out $50 - $60 dollars for a game or $400-$500 for a game console. This is plenty for the casual gamer or kids.)Being on the Android platform will allow the number of apps to increase exponentially and for watching Amazon's videos (Prime and Pay) it is perfect.About the experience....For Amazon's offerings it is the best out there. I highly recommend Amazon Prime as it is comparable to Netflix plus I have saved a bundle on free shipping.  The interface for the movies is first class. The remote's FF and RW buttons also act as skip forward and skip back buttons.  Press RW once to jump back 10 seconds or hold to rewind.  Same for the FF button.  The interface for Amazon video is similar to the new one for Netflix on Roku 3 with the entire screens background feature the highlight movie.  Surprising the interface for Netflix on Fire TV is the older one not the new one.The Plex app works fine for all my DLNA needs. (playing media from my home computers)Wish list.1. Allow us to change the position of Apps. When you start adding apps the latest one is the first one on the list, so add them in reverse order to get your most frequently used ones at the top of the list.  There is a row of tiles for \"Recently Watched\" that allow you remove from that list but it is kludgey.  Those of you who have a kindle fire will recognize the system. Or add a quick Access or Favorites row of tiles at the top of the Home Screen.2. Would love to have Amazon tie into the Ultraviolet system. I have close to 200 movies there. You can reach it through the Flixster app but HD is not available on the Flixster app.3. HBOGo4. Vudu5. HBOGo6. Vudu7. HBOGo8. VuduAmazon....Get my point?In summary I will keep it and use it for Amazon offerings. It will sit beside my Roku 3 which I will use for everything else until the apps on my Roku get ported to Fire.  I do wish it had and infrared sensor so my Harmony remote could use it but it is not a showstopper.", "verified": true, "helpfulness": "12/13", "author": "Cliff Korth"}]