[{"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Jenny Kerr"}, {"rating": 5.0, "review": "Easy to set up and it came very quickly.I loved it so much I purchased two.", "verified": true, "helpfulness": "0/0", "author": "randall howard"}, {"rating": 4.0, "review": "Overall I've been really happy with both my FireTV's and First TV Stick. It would be 5 stars if the voice search would search everything and not just Amazon content. That would really make it a user friendly device and put them a step above everyone else. Other than that though I use them nearly daily and love the speed, ease of use and companion remote and app. I got one of these just to try it out and liked it enough to get one for upstairs. I did a lot of research for Roku, Apple TV, Chrome cast etc... but landed on this because I'm a huge Prime member and it makes it so easy to just be connected in.  My phones, iPad, etc... sync'd up quickly and easily to stream stuff to the TV.  I honestly thought I would never use it and figured I'd return it, so I'm surprised that I use it more than Comcast almost and have considered going Hulu and dropping cable...I also really like how Amazon is stepping up to bring quality like Apple has done for years not just in the product and how it works but to the product material, quality of packaging and attention to detail. I've been really happy so far...", "verified": true, "helpfulness": "1/1", "author": "jasonstuff \"jasonstuff\""}, {"rating": 4.0, "review": "I'm very pleased with it so far.  It was easy to set up and use.  I even took it along with me on an annual ski trip I take with friends.  It was great being able to watch movies in the evening as well as listen to music.  After installing AllCast app, I was even able to stream pics/videos we took during the day onto the TV using the box,  The only thing I find a bit frustrating is that it does not allow you to install many apps that should be allowed and that supposedly do work.  Instead, it appears that users are forced to find side-loading solutions to do so.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Not happy. I planned to give this as gift. Device worked for day-1. from next day its not even powering up.", "verified": true, "helpfulness": "2/3", "author": "Gulshan Kumar \"Gulshan\""}, {"rating": 5.0, "review": "What would life be without the Fire TV?!  Love this product and the voice control is great.  Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Really enjoying this device- does everything I was hoping that it would.", "verified": true, "helpfulness": "0/0", "author": "David M. Impson"}, {"rating": 4.0, "review": "if I purchased a fire tv, whats my return policy in returning the fire box if not happy please, and thank you", "verified": false, "helpfulness": "0/0", "author": "luigi trovarello"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Wesley michael dadosky"}, {"rating": 3.0, "review": "It works great, sometimes. Fast, simple, etc. With that being said it's annoying that the remote constantly stops working. Replaced the batteries the numerous others a few times, however it just decides to stop, nothing seems to fix it. It will randomly just start back working, could be 5 mins, 5 hours, 5 days. I'm sick of it. This last time it died for good and a damn remote cost another $30. I will not being purchasing another simply because it shouldn't have broke after a few months.", "verified": false, "helpfulness": "0/1", "author": "Robert Jason Miller"}]