[{"rating": 5.0, "review": "Love everything about such a clear picture", "verified": true, "helpfulness": "0/0", "author": "Bridget Fino \"Be YOU that created God you to be\""}, {"rating": 5.0, "review": "Nice cable cutter, works great, I have the game controller too, nice to be able to use as a remote for all features.", "verified": true, "helpfulness": "0/0", "author": "TBOT"}, {"rating": 4.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Jordan Samsel"}, {"rating": 4.0, "review": "I was given the amazon fire tv as a xmas gift and I love it I own a diff player and it doesn't have some of the features the fire does I'm so pleased with this..", "verified": true, "helpfulness": "0/0", "author": "maddy"}, {"rating": 4.0, "review": "Good item works just fine", "verified": true, "helpfulness": "0/0", "author": "Daniel W Wyttenbach"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Luis V."}, {"rating": 1.0, "review": "Don't think that once you buy this that you can watch movies and TV shows. You still have to pay for anything you want to watch. Bought this for my mom for Christmas, terrible idea. It's just a money maker. No extra incentives from Amazon TV. If you already have a smart TV, Blu Ray or gaming concole, you do not need this. It's about as useless as the old DTV convertor boxes lol. Sending back to Amazon.", "verified": true, "helpfulness": "1/5", "author": "vincent wilson"}, {"rating": 5.0, "review": "We love this so much! We will be ordering more for other televisions in the house.", "verified": true, "helpfulness": "0/0", "author": "tntmccarn"}, {"rating": 5.0, "review": "Super simple setup. Ready to play right out of the box. I love it.", "verified": true, "helpfulness": "0/0", "author": "Luke B."}, {"rating": 1.0, "review": "Thought it was a good idea but not.  There isn't much available to watch easily that you don't have to pay for.  Almost everything I wanted to watch costs money.  I opted to join NetFlix and used the FireTV for that use.  Will discontinue Prime after the 30 day trial to reduce that cost.  Would not suggest this to anyone.", "verified": true, "helpfulness": "0/2", "author": "Christopher Fort"}]