[{"rating": 4.0, "review": "The product is very well built and extremely fast my only disappointment with it is I can't use my external hard drive with it which I have a ton of movies and pictures of which I would love to be able to play and view using the fire tv I don't see the use of having a usb slot that's not functional I brought the tv instead of just the stick because I thought I would be able to do so if I knew I would have just purchased the stick !  Other than that it's fairly impressive,", "verified": true, "helpfulness": "1/2", "author": "A.Maldonado"}, {"rating": 2.0, "review": "The fire tv sometimes has jiggling video when streaming.  It is also expensive when compared with the Sony BDP-S3200, which is a blue ray player and streamer.  We find we use the Sony more often as the picture seems more stable.", "verified": true, "helpfulness": "0/1", "author": "Boat owner \"teka3\""}, {"rating": 5.0, "review": "Bought Amazon TV after coughing up 150$ a month to cable. It's easy to use and decent selection of shows with Hulu plus and Netflix. I move a lot so this is a great way to avoid dismantling cable and sometimes paying moving fees. My only, not even complaint, but quirk that bugs me is that to put it to sleep, you have to scroll to the bottom and then over to system. Hawaii is crazy with electric bills so to save a little money I power stuff down. Other than that I love it and it's cheaper and better than cable in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Kevin Eubanks"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jean M. thompson \"Snowflake\""}, {"rating": 4.0, "review": "Just installed Amazon Fire TV out of the box...and it works!", "verified": true, "helpfulness": "0/0", "author": "RU Justnuts"}, {"rating": 5.0, "review": "Easy to use . . . just as advertisec", "verified": true, "helpfulness": "0/0", "author": "Kay J."}, {"rating": 5.0, "review": "The most challenging part of setting the fire tv up was plugging it into the outlet behind the entertainment center. Within 5 minutes, we were up and streaming a movie using our Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "futile after purchasing Samsung smart tv.", "verified": true, "helpfulness": "0/7", "author": "amazonian aficionado"}, {"rating": 5.0, "review": "Fire TV is AWESOME!!! We love it!!!!", "verified": true, "helpfulness": "0/0", "author": "smithathens"}, {"rating": 5.0, "review": "A++ great picture fast response time.", "verified": true, "helpfulness": "0/0", "author": "Raul Soto"}]