[{"rating": 5.0, "review": "Simple and utterly complete home entertainment system.", "verified": true, "helpfulness": "0/0", "author": "Ted Strecker"}, {"rating": 5.0, "review": "Amazing. Netflix streaming along with Plex.", "verified": true, "helpfulness": "0/0", "author": "trancuongv"}, {"rating": 4.0, "review": "From a pure viewing experience, the unit works as expected. It was VERY easy to set up and get going-plus it was $20 off for the Holiday. For my Nexflix account, however, the interface is cumbersome. So, I went on the Netflix website on my laptop. I picked the shows I was interested in and can now find them easily on my list. I also did that for Prime viewing, makes it easier to find what I want that is Prime eligible. This unit was a whole lot less expensive than replacing my TV, and that was reason enough for me to try it. The voice search is also a bonus...works great!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "Love it :) I just wish is can show you out to turn it off I'm not sure how to do that I just put it too sleep ?", "verified": true, "helpfulness": "0/0", "author": "alfredo"}, {"rating": 5.0, "review": "Thank you Amazon, Great job on the Anazon Fire TV. keep up the good work. :)", "verified": true, "helpfulness": "0/0", "author": "JESSE D HILL"}, {"rating": 4.0, "review": "very impress with the quality of programs in HD. But still confused on what channels are available to watch with out a cable/satellite provider. Some apps/channels you have to have dish or directv or some other subscription service to watch. That was a disappointment. You really have to keep some sort of subscription to get channels and I have  not figured out networks yet. There is very little information out there on what is really going on. I do like it for some really neat app that are FREE. Yoga, art, and of course Netflix,Amazon, Hulu and a number of movie/tv offerings. Another great thing are the reviews. They do help you from wasting your time downloading. I would say do your research, but there does not seem to be anyone out there that can give us the 101 on streaming tv. I believe it is the future, we are just a little early.", "verified": true, "helpfulness": "0/0", "author": "Deborah J. Morgan"}, {"rating": 3.0, "review": "Was expecting something a lot better from the adds and descriptions.", "verified": true, "helpfulness": "0/0", "author": "zachary mcgee"}, {"rating": 3.0, "review": "I would have given this product a 5 star but unfortunately after one week the remote completely didn't work.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My mom was looking for something like this for her living room. I had let her barrow my Chrome Cast to see if that was something she would be interested in. She has a hard time figuring it out so we tried out the Amazon Fire TV. She was able to use it with only a little coaching and loves it. I also loved it and replaced my Chrome Cast with one.", "verified": true, "helpfulness": "0/0", "author": "B. Scott Spicer"}, {"rating": 3.0, "review": "I had really expected to be able to access a web browser and stream videos that way. Very disappointed :(", "verified": true, "helpfulness": "0/0", "author": "Denise Caravelli"}]