[{"rating": 3.0, "review": "My Fire TV box was great while it lasted - easy to setup, fast load times - worked with a wired and wireless connection, and had support for the content we were looking for (Prime, Netflix, HBO Go). However, the good times didn't last as long as I had hoped. Just a couple days ago, the box mysteriously decided not to display anything on the TV. I could see a monochrome Amazon logo come up on the TV when the box started but after that - zilch. I could hear the usual click sounds via the TV when I used the remote so something was definitely moving across my HDMI cables. I switched cables, switched HDMI ports, did all the usual resets - no luck.Finally my Amazon customer service call ended with a \"your warranty period expired and we will give you a replacement for $50 instead of the retail price of $99\". Tempting as it seemed, I didn't know how reliable these boxes were and didn't want to shell out another $50 right after the warranty expires again for the new box. Time to go buy a Roku I guess...but the Fire TV box was good while it lasted.", "verified": true, "helpfulness": "2/2", "author": "Jay R"}, {"rating": 4.0, "review": "Good product.  Stable operating system.  All of my other smart app devices freeze and lock up.  This player is rock solid for playing amazon or Netflix videos.", "verified": true, "helpfulness": "0/0", "author": "ReviewDude"}, {"rating": 4.0, "review": "is it working in Saudi Arabia?", "verified": false, "helpfulness": "0/1", "author": "twoa2m"}, {"rating": 1.0, "review": "The only reason why I bought Fire TV instead of AppleTV is that I have an Amazon Prime account and I wanna make full use of it (Prime Instant Video).After I received my Firetv, the thing never worked properly. Everytime I loaded the Prime Instant Video, connection problems occurs even though I have 100M Mediacom Internet and I connected my Firetv with a cable. I called the customer service 3 times and they couldn't fix this. Now the only thing works properly on this Firetv is Netflix, which costs me another 10 bucks every month.Highly disappointed.", "verified": true, "helpfulness": "2/3", "author": "kozol"}, {"rating": 1.0, "review": "This would be a five star review except for one thing - it does not support Acorn TV. I really enjoy Acorn TV and can get it from ROKU. Would not have bought this, if I realized I could not get one of my favorite channels.", "verified": true, "helpfulness": "1/3", "author": "DaHunk"}, {"rating": 5.0, "review": "Easy to set up.  Great resolution. Easy to navigate. Very please with it.Going to quit this feedback so I can go watch it.", "verified": true, "helpfulness": "0/0", "author": "J. Moore \"Judy\""}, {"rating": 5.0, "review": "So far my family and I love Amazon Fire TV!I truly believe that I get a better quality picture without having cable.With a set of a nonamplified rabbit ear antenna and Fire TV I can watch everything I like at a fraction of my old cable bill price.I wish I had gotten Fire TV sooner.", "verified": true, "helpfulness": "1/1", "author": "rockhauler114"}, {"rating": 5.0, "review": "Great things come  inside this device", "verified": true, "helpfulness": "0/0", "author": "Mike Sulin"}, {"rating": 5.0, "review": "Great product...very satisfied with my purchase.  I will be purchasing another one for my bedroom", "verified": true, "helpfulness": "1/1", "author": "Tammy Rehbein"}, {"rating": 4.0, "review": "Works great, voice control awesome, easy to set up and absolutely loaded with options both free and to pay others such as Netflix. Small footprint.", "verified": true, "helpfulness": "0/0", "author": "Rockin Lochen"}]