[{"rating": 4.0, "review": "Enjoying", "verified": true, "helpfulness": "0/0", "author": "Art"}, {"rating": 3.0, "review": "I bought and then returned it; Almost every video required payment. Could not even get free videos from YouTube !!!", "verified": true, "helpfulness": "1/3", "author": "Sadroo Lalani"}, {"rating": 3.0, "review": "I can't log in.  It does not bring up a keyboard on the screen to log in.  I went to Amazon help and could not find an answer to this or any procedure to go through.  One day I will spend more timeon this.  I can connect to Netflix direct via the TV set now, so have been using this connection besides HBO, etc.", "verified": true, "helpfulness": "1/2", "author": "Christopher Menkin"}, {"rating": 3.0, "review": "IT's OK, it does a few things good and there are some nice features. I wish that some of the apps were designed for the Fire TV and not just Android apps that are applied to the Fire TV.The next version will be better, offer more features and I might look at it again then.", "verified": true, "helpfulness": "1/1", "author": "G. M. Reed"}, {"rating": 5.0, "review": "From Day One I have fallen in love with my Fire TV.  So much that I now rarely watch cable TV.  I like the access to Amazon Instant & Prime Videos, unlike the Chromecast that is quickly gathering dust.  It also gets much better signal quality than the Chromecast.  The access to more and more content and apps is appealing as well.My only two complaints are not being able to search for specifically free Prime Videos and there's no way to keep my kids from purchasing content with one-click.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "When the Fire can support MKV files and have a USB 3 port than I will get it.  Til then, it's a waste of my money. I currently have the Roku 3 and the Apple TV. If the amazon fire wanted us to walk away from those devices, all they had to do was make it a no brainer. Well, for me, and probably a whole host of others, It was was a no brainer......don't buy it......yet.  The amazon fire might have missed their big chance to steal customers away from the roku 3.", "verified": false, "helpfulness": "3/12", "author": "Nigel"}, {"rating": 2.0, "review": "Got a warning E-mail from Cox yesterday.  My bandwidth usage doubled since I plugged this in.  Amazon says it's because of the mosaic screen saver, but I only use the standard screen saver.I already have an android TV box in my bedroom, I put this new one in the family room so I could watch my shows out there too.  So, it's not like I'm watching more streaming video.", "verified": true, "helpfulness": "1/1", "author": "D. Brundage \"Data Dude\""}, {"rating": 4.0, "review": "I like that I can access both Prime Video and Netfix.  I like the voice search on Prime, wish it worked for Netflix.  If you plan to move your Fire TV to another WI-FI, turn off the purchase pin before you do that, a bug has it try to verify your pin before it can establish a new network connection.  I wish I could directly project my IPAD screen onto the Fire TV without going through a WI-FI I don't control.  That would allow me to project Dish Anywhere or similar to screen, now I have to fall back to direct HDMI from IPAD.", "verified": true, "helpfulness": "0/0", "author": "Village Looper"}, {"rating": 5.0, "review": "So easy, so good I bought another one for the bedroom tv.  Congratulations to Amazon for doing it right.  Love it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "This device requires payment for what I would receive free with Amazon Prime, Netflix, or Premium channels series or movies, for which I'm already subscribed.  I like the voice commands.  When I plugged it in, It already recognized me, which was good.  But it will not recognize my Prime Membership.  So, I don't like it.", "verified": true, "helpfulness": "2/3", "author": "Demi"}]