[{"rating": 2.0, "review": "YouTube video playback hangs every 6 or 7 minutes (I guess youtube app in firetv struck when there is an advertisement in between the video). every time I'm replaying the video and forward to the same length of earlier streaming and watching. there is no support on this available over internet.", "verified": true, "helpfulness": "1/2", "author": "Sudhahar"}, {"rating": 5.0, "review": "Turn any tv into the best smart tv.. This device turns your tv into an Android based smart tv.. Any app the doesn't come loaded you can \"side load\" most apps from your computer over your WiFi network..  I've installed Google chrome, HBOgo, Showtime anytime,  Max Go.. They all work as it should.. (Showtime you gotta install a rotation app tho)I even hooked up a wired XBox 360 controller and all games I have tried work great..  I have also hooked up a wireless keyboard/mouse combo to browse  the internet.. Very powerful device,  just could use a little more internal memory, but It's not an issue.. Highly recommend to anyone wanting a smart tv.", "verified": true, "helpfulness": "2/3", "author": "kory kersy"}, {"rating": 3.0, "review": "The fire tv equipment worked fine but Amazon prime is not all it states. Too many normal tv shows have to be paid for and not free such as Paw Patrol or any kids shows. The movies are very old movies to choose from. No recent ones. I should have done my research before buying. Just want to cut the cord but this doesn't help :(  Just my opinion so far but maybe after I research more I can upgrade it.", "verified": true, "helpfulness": "1/4", "author": "scarecrow"}, {"rating": 5.0, "review": "I LOVE IT BUT COMCAST IS A THEIF THEY WONT LET ME HAVE LIFETIME OR A AND E ON IT. BRIGHTHOUSE AND TIME WARNER ALLOWS BUT NOT COMCAST. AND CIMCAST CHEATS THEIR CUSTOMERS ESPECIALLY THOSE IN GATED COMMUNITIES THEY PAY TWICE!!  IM REPORTING THEM TO THE FCC OVER EVERYTHING I CAN YOU SHOULD TOO!", "verified": true, "helpfulness": "3/6", "author": "Reader \"Reader\""}, {"rating": 5.0, "review": "Firstly what I use FireTV for is: - Streaming things from my computer using PLEX media server - Viewing content online from Netflix, Amazon Instant Video, Watching YouTubeI have enjoyed using FireTV and have only had very minor issues with it over the last 6 Months.LIKE: - Sleek Interface and easy to manage controls - Quick loading of applications and content on it - It's very small, and doesn't take up much space underneath my TV - Comes preloaded with your information from PRIME by Amazon when you take it out of the boxDISLIKE: - The remote is very small, I and my wife have had a hard time finding it in out bed - No on/off switch. FireTV is always on, it does go into sleep mode after extended time without it being used  - Clunky functionality when using Amazon instant video, this isn't just a FireTV problem but also a general Amazon problem. They do a poor job of distinguishing from PRIME and regular (purchasable) content. There is an option to setup a pin to avoid unwanted purchases.Overall I really like it and would purchase it again", "verified": true, "helpfulness": "0/0", "author": "Sniper1"}, {"rating": 5.0, "review": "It works hand in hand with our Kindles. I liked it so much I bought another one for my son's tv. Just plug and go. We use Prime and this adds to its benefits.", "verified": true, "helpfulness": "1/1", "author": "Bryan \"CyberJäger\""}, {"rating": 5.0, "review": "Simply the best!!!!!", "verified": true, "helpfulness": "0/0", "author": "richard afrah"}, {"rating": 5.0, "review": "Love it. Works so much better on streaming than my blueray player does. Really simple to set up and use. The voice command is a neat feature and works like a charm every time. For the money this is a great deal.", "verified": true, "helpfulness": "1/1", "author": "Cindy Overton"}, {"rating": 3.0, "review": "PC's quickly get Virus that prevent many from ordering from Amazon. Many people will not keep buying PC's that quickly morph into bricks.  I'd put one of these in thousands of rooms if they has a browser.", "verified": true, "helpfulness": "4/10", "author": "Mr. Donald Charles Long \"longtimber\""}, {"rating": 4.0, "review": "Overall, it's a fantastic piece of streaming hardware. If you're looking for a television-connected device for IPTV via Netflix, Plex, etc., look no further.Let's break it down:The Good- Best hardware available for a streaming device- Bang for the buck; extremely cost effective compared to other solutions available in market- Better application selection than most streaming devices; plus it runs Plex beautifully- The remote's pretty solid and responsiveThe Bad- The software clearly still has some issues, and it lacks the polish that you'd see from an Apple product.- Buggy audio at times that requires a reboot- Only way of rebooting is to unplug the power, then plug it back in. Really? You couldn't add a reboot function to the system menu?- The gaming aspect of this seems quite aspirational/early adopter; I don't see much value here- No HBOGo; although it's coming soon, I find this to be a pretty big gap", "verified": true, "helpfulness": "1/2", "author": "Joe D"}]