[{"rating": 4.0, "review": "Makes it easy to watch Prime Instant Video, but what about my music.  When will Fire TV include Cloud Player?", "verified": true, "helpfulness": "2/2", "author": "Phil M"}, {"rating": 1.0, "review": "I had this for 2 days and finally returned it. When it does work the speech search is great, one of the best I seen. But I had lots of enter pin, can not connect to network, enter pin, loops. After many reboots and getting lucky I was finally able to deregister my account and return it. They say, \"Get started in minutes\" More like tens of minutes! From out of the box to 20 minutes of downloading new software. I think this is still a bit on the buggy side. Very disappointing. I expected more from Amazon. Now I understand why the reviews are heavy in the 5 star and 1 star category.  I liked the idea of Android apps, maybe Roku will add that soon.", "verified": false, "helpfulness": "7/24", "author": "Mister Ed"}, {"rating": 5.0, "review": "The Fire Tv is a great streaming device. The voice commands work great, it has always understood what I am saying. Hopefully Amazon will expand this to all apps.I bought the controller also, and it works good. I have to learn to use it. I'm not a big gamer, but the free game Sev Zero looks great. And if you have a kindle fire HDX, you can download \"air support\" to allow someone else to play the game with you.Also, with the Fire HDX you can start a video on the tablet and fling/switch it to the Fire tv. And with X-Ray, you can get info as the movie plays .The Fire Tv lets you see your photos that you have in Amazon's cloud service, but you can't access your music. Hopefully this will be added.  Of course, the biggest thing missing is Amazon.com shopping!!!!! How cool would it be to voice search on Amazon.com!Overall, I love the Fire Tv and hope Amazon can open up the voice commands to all the apps. And tell us what the usb port is for. Expanding storage?", "verified": true, "helpfulness": "1/1", "author": "John Spence \"Hooked on Kindle!!\""}, {"rating": 1.0, "review": "All of these companies are preying on the technically uninformed.  It's a poor substitute for a computer.  As far as content is concerned it's just a vehicle to charge you more money for more services. (many of which you can obtain free of charge) Minecraft-antiquated, HULU-Free, You Tube-Free .....REALLY??The hardware specs are a real piece of work as well...\"Surround Sound\" ...You get \"Surround Sound\" by setting up a Surround Sound environment via your speaker system. Nice that they are able to separate the audio channel but I didn't see a set of surround sound speakers offered. Even if they had, it's a promise they can't make because surround sound starts in the recording studio.(Mono is always going to be a mono signal ! (same goes for stereo .....Regardless of what hardware you run it thru).Not all of the services they offer are free either.  The amazon fire TV is a \"player\" not a service.SO don't get played. . . Learn how to use your computer.", "verified": false, "helpfulness": "8/62", "author": "S. J. Goodwin \"Jay\""}, {"rating": 5.0, "review": "I have been watching the fire TV for the past few days and the Fire TV has maintained my TV viewing interests. I have many set top boxes and most have been a passing phase because their inability to retain my interest and television viewing habits. oh yea and it plays games too. I have the Apple TV, Google TV, Roku, and The TiVo Romio. I have always wanted to be able to cut the cable cord but haven nearly been able to, that is, until the release of the Fire TV. It seems as if the amazon Prime streaming content is nearly robust enough to compensate for cable or broadcast television. The apple TV was up there because of my iTunes Cloud content. the thing is, my Amazon Cloud content is older and gives my iCloud a run for its money because most of the music i purchased by physical disks with the auto rip added bonus. my amazon instant video library has been a deciding factor for all of my set top boxes besides the Apple TV. My tiro Romio was in the lead because it would record and time shift the local news and my soaps. my soap is the only program keeping my tied to the cable. My TiVo is able to play my Amazon Instant Video library but I have to set the programs to ceue  up from a web browser. sure i could rent a video with my Tivo and Amazon instant video BUT, I am a prime member. I would have to air play amazon Prime video content to my Apple TV from one of my iOS devices. Amazon has something going on because google is supposed to release an android television box soon. Amazon did it first. out of all of my devices, the Fire TV seems the quickest with a better and crisper video experience. I am in no way a videophile but if i was i would have to vote for the Fire TV. all of my other set top devices are 1080P but seem lacking compared to the fire TV. I still can't get over the crisp video along with the lightning fast processing power. I never knew what i was missing before dealing with the Fire TV. My Roku and Goggle TV had Apps, but they pale in comparison to the logical deployment of the Fire TV apps. the Roku apps were bizarre and not made for television experiences. The TiVo had apps as well but it seemed like they were an after thought and didn't quite fit logically in to the television experience. The Amazon Cloud came before the iCloud and both are extremely valuable assets to providing an exceptional television viewing experience. both have similar policies for making your content purchased from each provider with little or no hassle. both provide free disk space. I believe i do recall amazon cloud has an iTunes Match equivalent so i will need to investigate that feature a bit more.being able to put content on my amazon cloud drive makes the content available to access on my Fire TV.the only Game I have been able to try out on the Fire TV was the Jack one because the game controller i purchased at the same time i did the Fire TV is on back order and won't be here for another day or two. as simple as the game was the Fire TV processor seemed to hit it out of the ball park and I can't wait till the controller to get here so i can play an actual video game.", "verified": true, "helpfulness": "2/2", "author": "Michael L. Fluharty"}, {"rating": 5.0, "review": "I love this this is the bEst thing ever expect its apple and a lot of stuff from Apple sucks", "verified": false, "helpfulness": "0/7", "author": "Jennifer AK Daniel"}, {"rating": 5.0, "review": "I got sick and tired of unplugging and restarting my ROKU box from constant freezing, non stop lag and just utterly slow response time.  This new FIRE TV is instant, there is ZERO lag and I have no more frustrations, The games are cool and my kids love them, the voice command is 100% accurate so far.. The only thing i don't like and i may be missing something is that when you voice search you only search Amazon shows even if your in another app like HULU or Netflix. So if you want to search something in another app you still have to type the old fashion way... If i am wrong someone please correct me,", "verified": true, "helpfulness": "1/1", "author": "Todd M. Petersen"}, {"rating": 4.0, "review": "Received this on Friday around 10AM and by 1030 it was up and running.  It was really easy to set up,plug in the HdMI cable (not included) and place the batteries in the remote,plug in the power supply, turn on the TV and select the Amazon Fire from the input list, the next thing you know we are watching the welcome and use video and then a prime movie.My only complaint,and I know it is picky, but the HDMI cable should be included,  I just happened to have one laying around to use, but if the user does not have one the out of Luck until they head put to the store or order for. amazon.", "verified": true, "helpfulness": "1/2", "author": "M. Lavery \"Diver Mike\""}, {"rating": 5.0, "review": "I was reluctant to post a review because really there is not much to add to the other 5 star reviews that are already out there. However, I am so pleased with this product that I just felt I had to add another positive review.I received my device a few days ago. I am not a techie and this is my first streaming device, so in all honesty, please be aware that I am not comparing this against any other device. I am reviewing this item strictly on my experience with it so far.First, I would be remiss in not mentioning the packaging. This was a thing of beauty in itself. It was gorgeous and well thought through. I feel that someone or several someone's worked hard to protect the product during shipping. The package itself was pretty banged up when I received it so I was worried that the device might have been damaged as well. However, the nice little box it came in was in perfect condition and the device itself well protected. It was also very easy to open. Thank you to the designers.Right out of the box, the Fire TV felt sturdy and sleek. It does not feel cheap in any way and I like the clean look of it. After plugging it in, it immediately had me connect to my wifi which went without a hitch. BTW, we subscribe to a 12mbps DSL service and use an Actiontec wireless router to piggyback off of that (I hope that makes sense). Immediately the device started the software upgrade which I expected having read the reviews. It told me right away that our internet was a bit slow, but I noticed that it continued the upgrade and decided to wait. It took about 10 minutes and went into the funny little intro video. Ok, really people? This bothered some of you? It hardly took any time and it was done.Moving on, the menu is simple which I really like. I am a Prime member and love the fact that the Amazon stuff is in the forefront. This is why we bought the device.  It was already registered to my account and so using the voice deal, I was able to bring up the last movie that I had already started watching on my Fire HDX.  I clicked on resume and it immediately started up where I left off. The picture quality is...well excellent! My Mom was in the kitchen and happened to look over, she just stopped what she was doing, stared, and said \"Oh my\".  The sound was also on the same level of excellence. I immediately proceeded to watch to Prime movies (free) back to back and thoroughly enjoyed both. No lag, no delays, no pixilation.The remote feels perfect. It is intuitive and I don't have to go looking through a bunch of buttons for the right one. The voice search works well and quickly.I also tried the mirroring function which generally works well. The exception that I have found so far is when I tried to mirror a UV movie that I streamed through Flixter. There were significant lag issues. That is not a problem however, since I have already downloaded the Flixter app onto the Fire TV itself. I do not anticipate issues there but will modify my review as needed.So, for my needs, this device is absolutely wonderful and I anticipate many happy viewing hours to come. I am not a gamer, but who knows, I may even give some those a whirl. I am so glad that I ignored all the negative reviews by people that did not even purchase/try the product or complained about the apps etc. that they could not get through this device even though it was clearly shown in the product explanation on the Amazon page. Personally, I got really tired of wading through your so called reviews. Please, get over yourselves.", "verified": true, "helpfulness": "6/6", "author": "Travel Fan"}, {"rating": 5.0, "review": "Got my Amazon Fire TV yesterday and hooked it up last night. I like it a lot. I have Apple TV but you can't watch Amazon content on it, hence, I purchased this new unit. Setup was a breeze and although it's kinda creepy how the unit already had all my Amazon login info pre-loaded, I'm sure less tech-savvy folks will appreciate that move. I hope Amazon hasn't opened themselves up to a security breach by doing that, though. (Imagine if someone else somehow received your package; They could conceivably see all your private personal information stored at Amazon.com ...)Anyway, nice box and really nice feeling remote, although I'd have preferred a slimmer one. No biggie.Can't wait to access my Amazon Music Cloud stuff, which is slated to begin being available on Amazon Fire TV in May.Five stars.", "verified": true, "helpfulness": "1/1", "author": "rstamberg"}]