[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "carla turner"}, {"rating": 5.0, "review": "Awesome box for the price. I've recommended this to family and friends. Main selling point was the ability to download apps, its really the only reason I bought this.", "verified": true, "helpfulness": "0/0", "author": "Raymond Owens"}, {"rating": 1.0, "review": "The network connection got lost frequently. I have apple TV with the same network connection, when the Amazon Fire giving me problem with the network connection, Apply TV doesn't.", "verified": true, "helpfulness": "5/7", "author": "apcpackaging"}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Have only had the product for a few days, but it was easy to install and operate.  Have found that when initially starting to watch a video, there is some hesitation while the product loads ... but after the first 5 minutes or so into the video, the videos play without a hitch.  I believe this is due to the wireless connection, and initial video loading process.  Seems like a reasonable product for the price, and like the variety of services provided.", "verified": true, "helpfulness": "0/0", "author": "GreyBear47"}, {"rating": 4.0, "review": "Works very well.  Have not had the chance to use it very much.  May update later.", "verified": true, "helpfulness": "0/0", "author": "D. Littlefield"}, {"rating": 5.0, "review": "I have 4 rokus as they have come up the rank. I really have  enjoyed them. My daughter gave me the Fire TV for valentines. It was easy to set up and I was watching HULU within 10 minutes.  I really like that I have available so many apps, photos etc from Amazon. It will be fun to see the pictures on screen of my family, trip and numerous visits. You cannot go wrong in purchasing the Fire TV. It does help if you have Amazon Prime, which I highly recommend for everyone. It is nice to have such generous children though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lou Ann Halsey"}, {"rating": 3.0, "review": "I really wanted to love this box.  And I really love so many things about it.  The voice search would be absolutely amazing, except for one fatal flaw...IT DOES NOT SEARCH NETFLIX!  It basically only searches prime and crackle and every now and then will return Hulu results but they are hidden among a plethora of Amazon Prime results.  I get it, it is an amazon product, but if you are going to incorporate things, then incorporate them.  Saving graces are that it has Sling and you can run Super Nintendo Emulators on it", "verified": true, "helpfulness": "0/0", "author": "JPE Marketing LLC"}]