[{"rating": 5.0, "review": "Works well. can finally give up on cable and save money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was extremely disappointed when I got it up and running to find out it didn't have the VUDU app. I was going to return it for the roku 3 because I knew that had the Vudu app. However, I thought I would try this out for a couple of days... boy am I glad I Kept it. The processing power on this little thing is amazing. The hardware specs kill anything out there in its price range. Not to mention it is running android and there is a whole community out there to help if you need to sideload other apps such as Vudu. Also the gamming capabilites are top notch And adding the ability to use other controllers to play games is brilliant. games run smoothly and the fact that I was able to connect my moga power pro. Controller to this unit puts it over the top. It also has the ability to use Bluetooth headphones which can be a pro and a con. The Bluetooth interferes with the WiFi a/b/g/n protocols.  So streaming Netflix and using Bluetooth headphones are a no go But there are work arounds like hardwired network or using the new ac WiFi protocol. Over all the best unit I have used.", "verified": true, "helpfulness": "0/0", "author": "Zac Rodrigue"}, {"rating": 4.0, "review": "Great device... super easy set-up and installation.  The voice search feature on the remote is awesome!  Streaming works flawlessly with great resolution.  Did the Amazon Prime trial and our only disappointment is/was the selection and cost for rentals.  Just rented the latest installment of Night at the Museum for $5.99 and could have spent $1.60 at redbox.  Yes, there is convenience not having to leave the comfort of your sofa but as an active family we are always out and about.  The amount of available content needs to increase and rental costs need to decrease in our opinion to choose Amazon over Netflix.  Not sure if we will keep Prime but the Fire TV streaming device is fantastic!", "verified": true, "helpfulness": "0/0", "author": "Michael Tinaglia"}, {"rating": 4.0, "review": "would like to be able to search by genre!", "verified": true, "helpfulness": "0/0", "author": "Danny Jordan"}, {"rating": 5.0, "review": "We absolutely LOVE this!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"crazy busy mom and business owner\""}, {"rating": 5.0, "review": "User friendly most of the time.", "verified": true, "helpfulness": "0/0", "author": "Steve L Quisenberry"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Mauricio Garcia"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "E. Casamayor"}, {"rating": 5.0, "review": "This is a great addition to my TV.  Easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Williams"}, {"rating": 4.0, "review": "The device works the way it is supposed to. Once the apps catch up it will be best.", "verified": true, "helpfulness": "0/0", "author": "Craig J Campbell"}]