[{"rating": 4.0, "review": "I really enjoy this because as a Prime member I get all sorts of programs to watch for free. It was easy ti install and the voice response search program also works very well.HOWEVER, there is no real on off switch and I would like to have one.When watching at night,sometimes it turns off with the TV and sometimes it stays on. If you unplug it, then it has to reset once you plug it in again. Also has a very bright white LED on-light, which I would be happy to have toned down to a dark green or blue.", "verified": true, "helpfulness": "0/0", "author": "mer"}, {"rating": 1.0, "review": "Crappy quality and buffering.I thought this was supposed to eliminate buffering. I have a slow internet connection and was looking forward to making a selection, downloading it for later uninterrupted and HD picture. I could have lived with that.But...this is the same ol' crappy quality and interrupted streaming to buffer the low quality stream.Am I doing something wrong, or was I just sold a bill of goods?", "verified": true, "helpfulness": "0/8", "author": "Mike in SF"}, {"rating": 4.0, "review": "I like this product a lot.  I have two and pre ordered two fire tv sticks.  Would have given this five stars but this device needs a true universal search.  Please add this feature Amazon.  If I rent something that I could have watched for free on netflix it does not make me like your company.", "verified": true, "helpfulness": "0/1", "author": "Shipco"}, {"rating": 5.0, "review": "really nice design- the voice feature works very nicely- better than I expected.  I think the one of the main draws to this is if you have a prime account, if you don't have a prime account you might not get all all the benefits of having the fire tv.the ease of use could not get any better In my opinion.  Amazon really did a good job designing this unit.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "There is great potential in the product, but it isn't there yet. Right now you could get a bluray player for much cheaper and have about 90% of the apps and functionality of the Amazon Fire TV. Your only missing out on the controller and games.The controller IS a big deal and the menu screen navigation is smooth and ordered well. But the fact that the voice control wont navigate to Netflix or Hulu options removes the vast majority of items I would actually want to find. I think this will be a fantastic product once it syncs voice search with Netflix, Hulu, and other apps along with following through on HBO Go. This is a definite 5 star product in the making but if you have a smart bluray player, just wait til Amazon has everything in order before buying.", "verified": true, "helpfulness": "2/2", "author": "M.Morris"}, {"rating": 1.0, "review": "The Amazon fire is NOT ready for prime time yet. The Interface sucks. The box lock's up constantly. The fancy voice search only shows you stuff on amazon prime and even if a show is on prime amazon tries to get you to buy the show that's already available on prime. Amazon also forces you to use their awful app store instead of google's.Don't waste your money... buy a Roku", "verified": true, "helpfulness": "1/5", "author": "Loren Turnbow"}, {"rating": 2.0, "review": "the operating system is sub par when compared to apple tv or roku. very clumsy format for finding the apps that you already downloaded to the system.  device only shows the apps that you have used recently not all of the apps that you have purchased.  it does recognize 5 gHz wifi signals, but so does the apple tv.  I have all three of these devices (Apple TV, Roku, and Fire TV) in my opinion, the fire tv is by far the worst of the three.  I understand that it has more apps than apple tv, still would take the apple tv or roku over the fire.", "verified": true, "helpfulness": "0/2", "author": "joseph m arnold"}, {"rating": 5.0, "review": "Great product. I love it.", "verified": true, "helpfulness": "0/1", "author": "Grace Morash"}, {"rating": 4.0, "review": "I was under the impression being a prime member meant I got something other than just /using/ Amazon TV. For the most part you just get the privilege of spending more money.Disappointing.", "verified": true, "helpfulness": "0/1", "author": "Bell Fontaine"}, {"rating": 5.0, "review": "I decided to try Amazon Fire TV since I have Prime.  Amazon had set my box up for me so all I had to do was add it to my WIFI.  No problems.  It really walks you through what you have to do.  Took about 5 minutes because I had to turn on my computer to add it to my WIFI.  Easy to navigate.  I love that I can pause a show and come back a week later and start where I left off.  The picture is great!  I agree that it would be nice to have an easier way to find out which programs are free and which ones I have to pay for.  Love that I can listen to my music.  Easy, easy, easy.  I've been considering getting rid of my cable TV since I don't watch it very much.  With Amazon Fire TV, I watch only what I want to watch, no commercials, and no high cable bills.  Now I'll be able to watch more new movies on my Fire TV with the money I save.", "verified": true, "helpfulness": "0/0", "author": "Cleo"}]