[{"rating": 1.0, "review": "Seemed really slow compared to my Roku.  I really wanted it to be great.  Super laggy.  Maybe because mine was refurbished, but I had to send it back and keep my roku.  The remote is nice for adults, but if you have kids uh.. uhh... way to small.  You will lose it quickly.  Wish I had an option for some kind of strap for it because it fits so nicely between my couch cushions, behind the couch, under the rug, in a kids nose etc.", "verified": true, "helpfulness": "1/2", "author": "The Chupacabra"}, {"rating": 4.0, "review": "We unboxed and used our Fire TV tonight! I'm a long-time owner and fan of the Apple TV, and I have an HTPC (a repurposed Mac) that we've been using for Plex and browser-based Amazon video, so I was looking forward to seeing what Amazon's experience was like.Pros:-- Setup was incredibly simple.-- Video and audio quality are great (one caveat on video below).-- Menu is easy to use.-- The Plex app was well worth the $2.50 in credits and works flawlessly.-- Using the free IP Cam Viewer app, I can view my home security cameras too!Cons:-- I don't want Voice Search to return Hulu Plus results, as I don't have or want that service.-- Amazon Cloud being the only option for photos is silly; needs an option to used a local SMB network shared folder.-- You can't filter new release movies based on whether they are available for rent yet.-- Having only the \"top\" prime movies/TV is okay, but a Prime filter would be far, far better.-- Wish I could move particular apps into the main menu for easier access.-- New release movie rental prices are overall more expensive than Apple TV.-- The gamma is wrong for video playback--too bright and lacks contrast. Can't find an option to change this.-- No documented API for IP remote control, which means poor integration with iRule and other automation apps.-- No IOS remote control app yet.The con list is long, but most of the items would be simple software tweaks. I'm very happy with the device overall, it's far better than the option I've been doing (playing Amazon Prime videos in a browser window on my HTPC and controlling them using VNC from my phone).", "verified": true, "helpfulness": "2/2", "author": "Richard S. Tallent"}, {"rating": 5.0, "review": "very happy with how easy it was to set up and im loving all the choices I have", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 5.0, "review": "Love this, works great for Amazon Prime, Netflix,  Hulu and more", "verified": true, "helpfulness": "0/0", "author": "Marlo Foglesong"}, {"rating": 1.0, "review": "i feel i have gotten the shaft i cant get it to work i sent amazon a message with no resolve", "verified": true, "helpfulness": "0/2", "author": "Donnie"}, {"rating": 4.0, "review": "Better than watching TV over the Internet but is still limited when streaming.  Just tried to watch the ball drop in Time Square & there were definite technical difficulties.  It would also be nice to watch the news streaming the entire news cast rather than selecting one news story at a time.  It's still a good value compared to a cable connection & much easier to navigate than TV over the net.", "verified": true, "helpfulness": "0/0", "author": "S. Ellen Westlund"}, {"rating": 5.0, "review": "Love it! Easy hook up. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "M. Hardy \"Happy Grl\""}, {"rating": 5.0, "review": "We are loving this", "verified": true, "helpfulness": "0/0", "author": "Stacey Willett"}, {"rating": 4.0, "review": "Fire TV arrived on time and was easy to set up. It does require an HDMI port on the TV in order to work and my all-in-one remote doesn't seem to be able to handle the change in TV settings to access that port, so I had to get the TV remote back out to switch to that HDMI port. The FIre TV remote is very easy to use and the speech to text search function is quite accurate.  I just need to solve the proliferation of remotes issue!", "verified": true, "helpfulness": "0/0", "author": "dwilson113 \"David Wilson\""}, {"rating": 5.0, "review": "An amazing, economical and welcome addition to our home!", "verified": true, "helpfulness": "0/0", "author": "William OConnell"}]