[{"rating": 1.0, "review": "More fussy about signal strength than Apple TV, at least with my set-up. Currently, we are not using it.", "verified": true, "helpfulness": "1/1", "author": "Timothy Manning"}, {"rating": 5.0, "review": "Great purchase. Great movies! Great live channels! Review all past seasons! It goes on and on. Really happy with it!!!", "verified": true, "helpfulness": "0/0", "author": "randall"}, {"rating": 5.0, "review": "Amazon Fire TV in all honesty has surpassed my expectations. Easy to connect, simply by following the on-screen instructions. Access to awesome apps and games...(not to mention, thousands of films and shows!)\"Good Bye cable!\"\"Hello Fire TV!\"", "verified": true, "helpfulness": "0/0", "author": "Erlin Scott"}, {"rating": 5.0, "review": "We're now in the process of buying Fire TV for all of our TV's and plan to slowly wean ourselves off the way too expensive cable TV!!!  My whole family loves Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This update broke my Fire TV. I have a standard Fire TV. Every time I turn my TV off for more then a few minutes, such as overnight, when I turn my TV back on the only signal my TV receives is a black screen. The only way I have found to get my Fire TV to send any picture other then a black screen to my TV is to restart my Fire TV. Everything worked fine before this update. This started happening just after I updated to this new Fire TV firmware. I have made no other changes to my Fire TV or my TV.If anyone knows anything more about this problem such as a fix or some news that Amazon knows about it please speak up. Thank You.", "verified": true, "helpfulness": "1/1", "author": "Chris Nickels"}, {"rating": 5.0, "review": "This is a great product for those who need a new or faster streaming media player.  In my own experience, I've used media players via Playstation3 and Playstation4, integrated Apps on a samsung blu-ray player, and integrated apps on a Vizio TV.  Taking into account my experience with various app players, I think, overall, this is a fantastic little device.  As always, Amazon devices are greatly skewed towards those who are invested heavily in the Amazon experience.  If you aren't a Prime member and don't care to be one, you may want to consider passing.  If you aren't a Prime member and have no clue what that is, this might be the perfect opportunity to take the leap and get access to a huge library that includes fantastic exclusives.  Prime doesn't really cost that much, but as it's success grows I foresee the costs to increase.  That is kind of a good thing in my opinion, as long as it's still competitive.The main reason I purchased this was because it had greater access to apps, including SlingTV.  I really wanted to watch some select live TV channels, and Sling is the way to go for me right now.  Unfortunately, PS4 did not offer it and I also am not in the test market for Playstation Network's own streaming TV service. Finally I can start watching some SEC football!The device powers on immediately, connects quickly, and is extremely responsive.  I haven't bothered playing any games yet, but I'm sure that based on it's internal hardware specifications, it will be similar gaming to any other modern smartphone (which is surprisingly good nowadays!).  You probably will not buy this for gaming...but it could pass as one in a pinch if you are bored and have absolutely no access to anything else.  I have not used the game controller so I have no opinion yet on that.If you've used the Amazon Prime app before, the layout will immediately feel familiar to you and you will find yourself navigating Amazon services and downloadable apps with ease.  I had no problems whatsoever trying to find Hulu, Sling, and other Apps that I wanted.  The remote is also simple and easy to use.  It's also tiny, so don't lose it.This is also tiny, so you can take it with you without any issues.  The same can't be said for something like a PS4.  Yes, it's larger then the Amazon TV USB stick and more expensive, but let's be honest, the technical specs on this will beat the USB stick into the dirt.  If you want better performance, buy the Fire TV box and pass on the USB stick.I haven't experienced any streaming performance losses.  Buffering can sometimes take a moment, but overall the streaming quality is identical to my HD streams from other devices.  Much of the performance on these apps depends on your own personal internet connection.This is a great product from Amazon and it seems they took their time with it.", "verified": true, "helpfulness": "1/1", "author": "Zoucrew \"Mizzoutig\""}, {"rating": 5.0, "review": "My wife and I love this product.  The voice feature is great.  I do wish that it would work with the non-Amazon features too.", "verified": true, "helpfulness": "0/0", "author": "Adam D. Omega"}, {"rating": 5.0, "review": "Needs manual but fantastic device!", "verified": true, "helpfulness": "1/1", "author": "Candace E. Case"}, {"rating": 5.0, "review": "We like it very much and use it every day", "verified": true, "helpfulness": "1/1", "author": "tassone"}, {"rating": 4.0, "review": "Only downside I have is that it does not play movies off a hard drive.", "verified": true, "helpfulness": "1/1", "author": "Steve M"}]