[{"rating": 5.0, "review": "I am very pleased with Amazon Fire TV. With the vast range of viewing choices and the handy voice search capability, I am all set with my entertainment needs.", "verified": true, "helpfulness": "0/0", "author": "Father of Clark"}, {"rating": 5.0, "review": "Everything a man could for thanks!", "verified": true, "helpfulness": "0/0", "author": "James Bishop"}, {"rating": 5.0, "review": "Made it real easy to replace my apple tv", "verified": true, "helpfulness": "0/0", "author": "Chris Anderson"}, {"rating": 2.0, "review": "It would be awesome if I didnt have to restart it every once in a while to work properly.  I am not sure if this is related to Amazon fire or Apps I am having problems with ( Hulu/Sling).  Sling used to work well earlier.. however now I am finding myself restarting the entire box once a day.. even then it hangs up in the middle of a show ( doesnt happen with chromecast).  That said.. device is real fast and interface is solid... stability is only thing I am questioning right now.", "verified": true, "helpfulness": "0/1", "author": "choolgo0z"}, {"rating": 1.0, "review": "I got the Lemon of the bunch and they aren't willing to correct the issue..... beware as there might be a bad batch of these.", "verified": true, "helpfulness": "2/5", "author": "Ron A."}, {"rating": 5.0, "review": "It's wonderful.", "verified": true, "helpfulness": "0/0", "author": "marcus coleman"}, {"rating": 4.0, "review": "Very pleased with my purchase.  Simple and easy installation/hookup.  No serious problems, just a few things that a novice has with new equipment.  On a couple occasions, movie reception was interrupted and had to reboot by unplugging the power cord for a minute or so", "verified": true, "helpfulness": "0/0", "author": "ME Mills"}, {"rating": 5.0, "review": "Awesome streaming player.", "verified": true, "helpfulness": "0/0", "author": "Robert Rambo \"rrambo\""}, {"rating": 4.0, "review": "Muy bueno", "verified": true, "helpfulness": "0/0", "author": "Julio Torres"}, {"rating": 4.0, "review": "Took off a star because it doesn't support hdmi audio passthrough.  Other than that, this device works perfectly.", "verified": true, "helpfulness": "0/0", "author": "gmoney"}]