[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Daniel Hines"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Donda"}, {"rating": 5.0, "review": "Easy to set up and works great", "verified": true, "helpfulness": "0/0", "author": "Dale Berridge"}, {"rating": 1.0, "review": "I can't use almost any of the features that the Amazon Fire TV gives me. I live in Ecuador and I can only watch Netflix because the Amazon Prime Video service only works in USA, Germany and the UK.", "verified": true, "helpfulness": "1/3", "author": "Christopher Novoa"}, {"rating": 1.0, "review": "Trying to get this set up through Sling TV was a headache!!! After nearly an hour of back and forth with Amazon and Sling TV, I thought I was good to go. Then the Sling TV rep pulled a fast one and I wasn't going to be given the 14 day free period as it clearly states on the app. When I questioned him, the answer was that was just the way it was. So I stopped that order and will be returning the box to Amazon without ever finding out if it works. Actually I think that is false advertising and is known as bait and switch which I also believe is illegal.", "verified": true, "helpfulness": "1/2", "author": "lucinda"}, {"rating": 5.0, "review": "Love it! Very easy to use right out of the box. Very smooth controls. Great quality streaming. Highly recommend it", "verified": true, "helpfulness": "0/0", "author": "Gabriel"}, {"rating": 1.0, "review": "This thing worked well out of the box.  It was easy to setup and link to my prime account.  I liked being able to watch prime movies on my television rather than my computer screen.  That all changed. I went away for work for 3 days. When I got home and tried to use FireTV the unit would not turn on at all!I went online and tried the suggestions on the firetv support site.  I then spoke with a customer support agent and described my issue.  He said they would send a new power supply and if that didn't help they would then send a new unit.  Doing the quick shipping math, even with one-day shipping, if the unit is defective I won't be watching anything on my brick of a device for 5 days minimum.  I asked them to send me a new unit and I will send this one back and therefore no back-and-forth.  They told me the device light would still come on if it was the device, the light not coming on indicated a power supply issue.  I said, \"ok, i understand that but send it overnight so I am not waiting multiple days.\"  He promised it would be sent for one-day delivery no later than Tuesday. This was on a Sunday after 5pm so I was okay with that.Monday morning i received an email from Amazon to expect my power supply Wednesday by 8pm!  Really.  Amazon doesn't care about keeping promises to it's PRIME customers!  This thing better work.***Update:  Surprise!  Didn't work.  Why couldn't Amazon just do as the customer requested in the first place.  Had this piece of junk for a few weeks now used it twice.  sending it back.", "verified": true, "helpfulness": "0/1", "author": "xpete"}, {"rating": 2.0, "review": "I bought this item in Jan....really like it ! I was able to hook it up myself! The minus is the remote.trying to get my e-mail address so I could try \"sling\" using the remote voice it kept spelling my name wrong after hours of trying ...I  have not found anyway to find help from sling\" to try this before the trial ends or how to cancel Anyone  have any suggestions? CJ", "verified": true, "helpfulness": "0/1", "author": "cjinnorthwest"}, {"rating": 5.0, "review": "Trying to get away from cable and the Fire TV works great. Easy to hook up and navigation is great. Voice command is awesome.", "verified": true, "helpfulness": "0/0", "author": "EARL OVERMOYER"}, {"rating": 4.0, "review": "We purchased the Amazon Fire TV to give us a streaming option while traveling.  It worked great for Amazon and Netflix streaming but the PBS app was choppy and constantly buffered while trying to watch a program.  Overall, we are satisfied with the performance but wish it worked the same for all of the available apps.", "verified": true, "helpfulness": "0/0", "author": "John"}]