[{"rating": 5.0, "review": "Performs as advertised!", "verified": true, "helpfulness": "0/0", "author": "Paul Zeisler"}, {"rating": 4.0, "review": "Am truly enjoying it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Works great, fast, lots of great features with the interface. Much better than my Roku.", "verified": true, "helpfulness": "0/0", "author": "Preston"}, {"rating": 5.0, "review": "It downloads the programs very fast. Also, there are many to choose from.  Alpha House is excellent!", "verified": true, "helpfulness": "0/0", "author": "JK Enterprises"}, {"rating": 5.0, "review": "Have not had it that long but have enjoyed the few movies that I've watched on it", "verified": true, "helpfulness": "0/0", "author": "Joy McCoy"}, {"rating": 5.0, "review": "i have roku ,chromecast,but amazon fire tv is the best and my favorite", "verified": true, "helpfulness": "0/0", "author": "Ted Putnam"}, {"rating": 5.0, "review": "Excellent little box!", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 4.0, "review": "I really love this little device, but it could be better with the addition of built-in DLNA support.  You can use PLEX, but I would prefer a built-in solution that doesn't require a subscription or payment to a third party.The layout of the menus is workable, but there is room for improvement.  I would like it if you could set up a personalize page where you could create a group or multiple groups of applications, movies, music, etc.  I would also like it if the on-screen keyboard had a QWERTY layout instead of ABCDEF.  I find the linear ABCDEF layout to be much more difficult to navigate and I would greatly prefer something like a real keyboard.  This wouldn't make as much difference if the voice search worked with Netflix, but it doesn't.The interface is quick and responsive, albeit not as easy to use as a tiled interface like an Android phone, iPhone, Mac (when in folders), or Windows 8 computer.  This sort of setup is easier for me, but it might not be to everyone's liking, so your mileage may vary.As far as setup goes, it is dead simple.  Plug it in, discover your network, and go.  No problems at all.  My wireless networks were discovered quickly and were easy to configure.  The ethernet port is only 10/100, so you won't get gigabit throughput if you you have greater than 100Gb network service.  This won't really make much difference, as streaming doesn't require that kind of speed, but it is still worth mentioning.The FireTV has much more RAM than its competitors, as well as a faster quad-core processor.  These two items are vital to making the device snappy and responsive.  You can add a USB memory device to expand storage capacity for applications and such, so it is flexible as well.Bottom Line: GREAT little box with tons of power and features.  Would be a five-star device with a few small changes.  HIGHLY recommended!", "verified": true, "helpfulness": "0/0", "author": "TheTerrorBeyond"}, {"rating": 1.0, "review": "Was not getting sound", "verified": true, "helpfulness": "0/1", "author": "Evey"}, {"rating": 4.0, "review": "So it's very neat and compact. The speed is great too. The only issue I have is with the search and the apps. My ideal behavior would've been to be able to search through all available apps but the search only works within Amazon content. If you want to search netflix you have to type it with clicks. I also would liked to have the option of comparing my options, for example if Amazon sells a movie for 3.99 but I can watch it in Netflix for free I like it to show me the options.Also there are not that many great free content. Although I loved watching some of Amazon's exclusive series.", "verified": true, "helpfulness": "2/2", "author": "Farnaz Baniahmad"}]