[{"rating": 5.0, "review": "We absolutely love our Amazon Fire TV.  Will be purchasing second Amazon Fire TV in a month or so.  So much better viewing than cable TV.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "We have only had this for a couple of weeks but with the prime we have been able to watch many of our shows on our tv. It was easy to setup  and only took a couple of minutes. I would recommend it if you have a prime membership or a netflix account.", "verified": true, "helpfulness": "0/0", "author": "Brooke"}, {"rating": 4.0, "review": "It is a little harder to master than I expected. I still am trying to figure out how to stream free movies from Netflix. All of the newer titles come with a price even though I have enrolled with them?", "verified": true, "helpfulness": "1/2", "author": "B. Chase \"careful shopper\""}, {"rating": 5.0, "review": "All of the benefits of Amazon Prime streaming on my television!!!  This is very easy to install and I did need the HDMI cable (sold separately).  So many options it is hard to decide what to watch next!", "verified": true, "helpfulness": "0/0", "author": "DCP"}, {"rating": 4.0, "review": "I loved the fact that I could watch TV and so many movies when my schedule permitted.  And for the cost of only wireless internet instead of the like, $200 my friends spend on tv, internet and phone.  I dove right on the Amazon TV bandwagon.  I would have given it 5 stars if there were some kind of clock on the tv or home screen like there is on my kindle.  I watch episode after episode some times and lose track of time...no clock, it sucks.  I also wish I could jump from episode to episode with one click like I can on my kindle instead of backing all the way out.  Hey amazon guys...work on that.", "verified": true, "helpfulness": "0/0", "author": "Leslie"}, {"rating": 5.0, "review": "I've been using XBMC on home theater PCs (Linux and Windows) for several years to be able to stream my movie collection through the house.  For years I've been looking for a small, low-power device I can use to run XBMC but also be able to use Netflix streaming, Pandora, and Amazon Video.Originally I thought the Boxee Box would be the perfect device, but it fell flat. The Raspberry Pi can run XBMC but it's under powered, lacks WiFi built-in, cases are extra, and there are issues with 5.1 audio to a receiver and no remote.  I also looked at the G-Box.  It looks great, is more friendly to hacking, but only outputs 720p (\"decodes\" 1080p, but doesn't output that to the TV), and doesn't support Amazon Instant Video (since there's no Android app for it).  Netflix and Pandora could work but you have to side-load the app.The Amazon Fire TV has great hardware, quad core, 2GB of RAM, WiFi built-in, and optical audio out.  The remote is RF rather than IR, so it works really well; no need to point it at the device.  It supports Amazon Prime, Netflix, Pandora, Hulu, and more out of the box.To use XBMC, you can enable wireless ADB access, and use the adb tool to push the XBMC APK to the device.  I wish it was available from the Amazon store, which would make it easier for the less tech savvy.  XBMC runs really, really well.  The only issue I've had so far is that the volume control doesn't affect the audio volume.  I have to control that with the TV remote.  It's been able to play every file that I've thrown at it, even 1080p encoded with very complex settings (x264 veryslow, almost placebo settings with 9 refs and 8 bframes) and AAC, AC3, and DTS audio.  I haven't had a chance to hook it up to my receiver to test the bit-streaming, I'm just using it with HDMI to my bedroom TV.Overall, I'm so happy with this as a media player that I've thought about buying more for the other TVs and re-purposing my HTPCs to just be servers in the basement.Regarding gaming, the only game I've tried is minion rush, which my kids love to play, but I did find that it had some noticeable frame rate issues.  It's probably due to the Adreno 320 just not being able to push the 1080p resolution.  It would have been better off with a 330.Overall, awesome device and beats all the other Android-based media players hands down.", "verified": true, "helpfulness": "1/1", "author": "Chris Thompson"}, {"rating": 2.0, "review": "The internal storage is only about 5GB and while they advertise all the GTA games there's no way you can add them to your storage.  Walking Dead, same issue.  If they're going to advertise these types of games, not apps but actual games and your forced to store them locally then they need to provide adequate storage options.  It's great for watching prime but they absolutely have to fix the storage problems.  If you're thinking about gaming then don't buy this until they fix this issue.", "verified": true, "helpfulness": "1/3", "author": "Chris Wills"}, {"rating": 4.0, "review": "I'm a long time Roku user, I've always loved the simplicity and features of the devices.  I purchased a new television and wanted to add another Roku, but decided to see what else was available at the same price point.  I decided to try the Amazon Fire TV, and I must say I'm glad I did; its so close to being the perfect streaming video box.  But Amazon didn't stop there, its also a fairly capable game console, and plays quite a few Android-compatible games.  I've had mine for a couple of weeks now, and I'm loving it!  But still, it has a lot of room for improvement, all perfectly possible because of the powerful hardware under the hood.- Voice search:  It is fast and accurate.  In all the time I've used it, it has never incorrectly detected my speech (YMMV).  The problem is, it currently only works with Amazon's library and content on the device (ex. searching for apps).  Its rumored that the Netflix and Hulu Plus apps will be compatible with voice search \"soon\", when that happens, it will make the on screen keyboard obsolete.  It is fantastic, but limited at  the moment- Amazon library:  On the Roku, its very easy to discern titles included with Amazon Prime Instant and buy / rent titles, its not so easy on the Fire TV.  This seems like an easy fix, but its very annoying at the moment.If you're in the market for a new streaming box, you should really consider the Fire TV.  Its got a lot of power out of the box, and the potential to be perfect with some minor updates.", "verified": true, "helpfulness": "5/5", "author": "Slim Jim"}, {"rating": 2.0, "review": "Unpacking and Setup:  The Amazon Fire TV has a good start but needs improvement. First the packaging, the Amazon Fire TV took more time to get into than the Apple TV and had unnecessary boxing. The Amazon Fire TV packaging is great only if you believe packaging for electronic devices should be like the early 2000s. Also a small but important detail is the fact that the batteries had to installed whereas the Apple TV the battery is already installed for you so you spend less time unpacking the device and setting it up. To Amazon's credit, Amazon tied the Amazon Fire TV to my account from the get go which is one step less than you need to do for the Apple TV once the device is turned on and ready to go. Also during the setup, unless it was only my Amazon Fire TV, the power cord took more force than I originally thought and made me feel as if I was going to break the power cord while I was plugging it into the back of the Amazon Fire TV.Usability:  The Amazon Fire device only comes installed with Amazon installed only which is great if you live only through Amazon Prime and Instant, but for most people I doubt they only live off of content from Amazon. Netflix had to be installed which took about 30 seconds to a minute with the Amazon Fire TV downloading and installing it on the device for me to use. Once installed, just like the Apple TV or any streaming device with Netflix the username and password had to be entered (which is normal for all Netflix apps). The issue I had with Netflix on Amazon Fire TV was the fact that the Netflix app on the Amazon Fire TV game me no indication whether it was streaming the video in HD or not (not sure if that's because of Netflix or Amazon).  On screen keyboard layout differed between each App including the Amazon Instant which doesn't help when typing using the remote if I have to search for where the letters are because I'm not sure if the keyboard layout is set up in QWERTY or Alphabetically.  The Voice Search (which is present on the Apple TV only if you use an iOS remote device) only searches Amazon's database and not any other app that may be installed, so no voice searching Netflix.  To Amazon's credit they do provide plenty of subtitle options when streaming a video from Amazon, but only for Amazon videos, not Netflix or ESPN (at least from what I noticed).  Games on the Amazon Fire TV played well except for the lag between the remote, device, and what was seen on screen. For example I played a bowling game on the Amazon Fire TV and the device didn't always register a click from the remote and when the device did register a click from the remote it tended to lag badly between from when the remote was clicked and where the accuracy meter stopped. The lag between the remote and device was noticeable throughout the experience, with the audible click sounds lagged behind the actual clicking on the physical remote. It's great that the remote doesn't need a clear line of sight like the Apple TV's included remote, but Amazon may want to rethink that if the lag between the remote and the device persists and add an IR so speed up the process and get rid of the lag.Pros:  Remote doesn't need clear line of sight to device, Amazon voice search is accurate, Amazon Fire TV tied to Amazon account with no need to enter information, Subtitle options within Amazon Videos provides plenty of customizable options, HD stream holds within Amazon Videos even when fast forwarding.Cons:  Amazon Fire TV doesn't register remote immediately and lags noticeably when clicking the remote, Amazon Voice Search only searches Amazon's database (not universal search), Packaging of Amazon Fire TV too excessive and unnecessary compared to packing of Apple TV, Each App has a different layout and design so navigation is inconsistent especially the on screen keyboard layout between apps is inconsistent.Overall:  Amazon Fire TV is only a good purchase if you live in Amazon's Eco-system (Prime and Kindle Fire), otherwise the Amazon Fire TV tries too hard to combine a Roku and Apple TV into one and fails at where both the Roku and Apple TV excel at.", "verified": true, "helpfulness": "3/7", "author": "on184 \"Mike Abili\""}, {"rating": 5.0, "review": "According to my husband and daughter Fire completely kicks the Roku's and Chromecast's butts. They were completely frustrated with both systems, very often not being able to warch their shows due to severe delays in the broadcasting of them. There are also a much larger range of apps available, many which are popular that the Roku didn't have. Chromecast was suppose to enable us to connect our tablets, Samsung, and it didn't. All the issues with those 2 we don't have with the Fire. I know my family is extremely happy with, so far no complaints.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]