[{"rating": 5.0, "review": "Setup was super easy. It works great for the Prime and Netflix. I haven't gotten to play around with much else, but very happy. The voice activated feature is nice and has worked well.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "awesome!", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 1.0, "review": "I was a little disappointed, I have purchased several movies on kindle and I have prime, so I was really looking forward to using this device.  I currently have Apple tv and Chrome, both of these devises work well, I cannot say the same about Fire, it show some footage and then downloads, a couple more minutes of footage and then downloads again.  Can't see me using this if this is as good as it gets.", "verified": true, "helpfulness": "1/3", "author": "Sue Cartwright"}, {"rating": 5.0, "review": "I love this thing, much faster than roku", "verified": true, "helpfulness": "0/0", "author": "CHARLES W STUART  111"}, {"rating": 5.0, "review": "I love this thing and use it daily.", "verified": true, "helpfulness": "0/0", "author": "AJH"}, {"rating": 5.0, "review": "Simply fabulous!!!!  I'm not very computer savvy.  However, this was baby simple to install.  I just took it out of the box, plugged it into a wall socket and connected the HDMI cable from the unit to the TV, then just sat back and enjoyed a whole new level of entertainment.  Have only started to work through Amazon Prime, but will start using Netflix and Hulu soon.  Love, love, love it.", "verified": true, "helpfulness": "2/2", "author": "B. Smith \"bgsmith66\""}, {"rating": 5.0, "review": "Great product, especially worth the price if you're a prime user!", "verified": true, "helpfulness": "0/0", "author": "brady22"}, {"rating": 5.0, "review": "Got the Amazon Fire TV after I returned the Roku.  The Roku had trouble connecting to my wireless router but once I hooked up the Fire TV, it had no trouble.  My wife has been using this in the bedroom every night for weeks and she loves it.  My living room has a PS4 so I can do just about everything I would need the Fire for in that room so I just need one Fire TV for now.  If I wanted another Fire TV, I wouldn't hesitate to order a 2nd.  Setup was really easy, even my wife could have hooked this up.  I wish the voice search tool worked a little more quickly but hey, it works pretty well for what it does.  I've mainly just been using Amazon Prime and my Amazon video library with this device so I have not installed Netflix or other apps yet so I can't speak for 3rd party apps.  The remote seems very solid so it seems like it could take some abuse but I'm not willing to try that for the sake of it.Overall, this device has done what I've purchased it for.  Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Droogs"}, {"rating": 3.0, "review": "I tried it for a week and found very nice features but some stuff to improve:Pros:1. Voice commands (no doubts right?)2. Pretty snappy3. easy setup4. they fixed \"Unknown sources\" for the apps5. XBMC runs nicely and smoothly (OUYA version of it). It parsed my huge library of movies 3 times faster than other versions of XBMC on different hardwareCons:1. Voice commands work only for amazon services. Nothing like: watch Pulp Fiction in Netflix, listen to radio Blah in Pandora. This is kind of expected but still makes you feel2. 5.1 sound output on HDMI and optical from Amazon Prime and Netflix is only \"Dolby Digital Plus\", so if your receiver is like mine without it, then you will have to use stereo (or buy a new receiver, right?). Except for XBMC where you can have a decent 5.1 sound and you can specify yourself which Dolby Standard to use if any3. Apps you install are not possible to drag to the home screen, you literally have to do 6 moves to get to the app and run it4. Typing text with the stock remote is a complete pain in a butt, so you literally have to have at least 3 remotes: #1 Original Fire TV remote for voice control. I am not sure voice control will work with any other mic/remote. #2 Something like Mele F10 for text typing #3 Your receiver remoteOverall it is a nice device if you are not as picky as me and your demands are not as wide. For me it is pretty useless though considering all of the cons", "verified": true, "helpfulness": "0/0", "author": "A. Barvinsky \"andrew\""}, {"rating": 5.0, "review": "Really enjoying the Amazon Fire TV box with my Amazon Prime membership.  I love the ease of accessing content and the suggestions and ability to easily rate and write reviews of shows and movies I enjoy.  Much easier to access movies using voice recognition than scrolling through or manually typing titles like with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Riley Cook"}]