[{"rating": 5.0, "review": "We bought this after having bought the Fire TV Stick.  Not sure we actually needed this full size edition but we do love it.  Playback starts quickly and I really makes accessing your library and Prime videos and music super easy.  The voice remote is fantastic too.", "verified": true, "helpfulness": "1/1", "author": "Eric in CT"}, {"rating": 2.0, "review": "Had to replace the remote three times in less than a year. The last time was last week. Need to address the reliability issue with the remote.", "verified": true, "helpfulness": "2/2", "author": "Minh Vu"}, {"rating": 5.0, "review": "Great wonderful always something on.", "verified": true, "helpfulness": "0/1", "author": "Debbie M. Maxey"}, {"rating": 4.0, "review": "Great ítem for prime users everything in one.Just a suggestion will like to more different aps and more Amazon series  the previous of some of them looks great  will love to see more.", "verified": true, "helpfulness": "0/1", "author": "RAFAEL ESTRADA"}, {"rating": 5.0, "review": "Set up is a breeze - remote is easy to navigate. This is the second media streamer I've owned and this one is more stable that the Sony SMP-100 it replaced. Debated between this and Roku, but the natural tie-in between the Amazon Fire TV and my Prime music, watch list and library tipped the scales. Just wish I could get Acorn TV on this one.", "verified": true, "helpfulness": "2/2", "author": "kurt odenwald"}, {"rating": 5.0, "review": "One of the best gifts I've given my wife.  She loves it and even shows it off to friends.  I bought the game controllers too and we now have games that we play together.  She actually let me disconnect her playstation which cleaned up some wiring.", "verified": true, "helpfulness": "2/2", "author": "Diego J."}, {"rating": 2.0, "review": "I had problem with streaming", "verified": true, "helpfulness": "0/1", "author": "Mahmoud Mazi"}, {"rating": 5.0, "review": "The box works great exceeded my expectations. Best feature is the search by voice. Someone deserve a \"Borat\" high five for that ideal. Thanks again Amazon.", "verified": true, "helpfulness": "0/0", "author": "charles polston"}, {"rating": 5.0, "review": "Did what i expected.", "verified": true, "helpfulness": "0/1", "author": "COskier"}, {"rating": 5.0, "review": "With Amazon Prime, installing Fire TV is completely brainless.  Great job by Amazon getting this right!  It comes pre-installed with your Prime settings -- simply unpack, plug it in, plug in the HDMI, turn it on and follow the on-screen prompts -- takes MAYBE 10 minutes.  Small, easy to use and nearly invisible, Amazon -- with Sling TV -- has just changed TV + streaming for the better!!  Say goodbye to bundled cable extortion!", "verified": true, "helpfulness": "0/0", "author": "Jethro"}]