[{"rating": 4.0, "review": "I'm enjoying the free prime some old westerns I haven't seen. The picture quality is as good or better than what I have with blueray player!", "verified": true, "helpfulness": "0/0", "author": "Will Barker"}, {"rating": 5.0, "review": "Much better than my Apple TV. The content is awesome and I can play games too. I love it. Now if I could get cloud player on it it would be perfect. UPDATED: Amazon Music just came out for FireTV. It's awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Ajay \"Ajay\""}, {"rating": 5.0, "review": "This thing is fast.  Like blazing fast.  If you used a roku you will notice the jittering and lag.  The newest roku resolved most of this to a very satisfactory level.  however the new amazon fire tv is even faster than that.  If you tap  the home button it takes you home faster than the home button on my smart phone.  The remote is easy to maneuver.  The voice control is pretty accurate however its quite annoying when it takes me to something on amazon I have to pay for that Netflix has to free hopefully that will be resolved as they bring Netflix support.  The streaming seems to buffer faster than the roku and display seems even better.  All i can say is i can wait for the next generation of this product.  If you are looking to buy one of these get it you will not regret it.  I don't watch cable anymore just hulu plus, amazon prime, and my Netflix is all i need.", "verified": true, "helpfulness": "1/2", "author": "Jason LaBar \"Tech Junky\""}, {"rating": 4.0, "review": "It's good for the $100 price tag. I wish the buffer was bigger, like 1GB or something so that I wouldn't have to wait for movies to buffer. Amazon should allow me to \"queue\" shows sequentially and have them reside on a local HDD.  Maybe allow an SD card slot so I can install memory for these type things.  Oh well.  It's $100.", "verified": true, "helpfulness": "0/0", "author": "David from DC \"daytraitors\""}, {"rating": 5.0, "review": "A great gadget - got it, out of the box, hook up, connect to router - watch, listen, have fun.", "verified": true, "helpfulness": "0/0", "author": "cdruli"}, {"rating": 1.0, "review": "As an Amazon customer, I am deeply offended by the continuos lack of accessibility support in Amazon products across Fire TV and Kindle. As a visually impaired user, Fire TV is completely unusable because it lacks text-to-speech, contrast control or font boldness adjustment. I and 30+ million other Americans who are hard of sight, visually impaired or blind, will never buy an Amazon Kindle or a Fire TV and will avoid buying books and movies from Amazon as long as Amazon views us as not important enough. Amazon should take a page out of Apple design principle, who offers extensive accessibility options in all iOS devices and ships the Apple TV with text-to-speech enabled by default.", "verified": false, "helpfulness": "1/15", "author": "Olivia C."}, {"rating": 4.0, "review": "Overall I am very happy with the Fire TV.  Very snappy interface, easy to use and setup and works beautifully with Amazon Prime.Only wish I have is that it had more memory.  It quickly ran out with a handful of apps.", "verified": true, "helpfulness": "0/0", "author": "jhelms54"}, {"rating": 5.0, "review": "I was a bit skeptical at first, but my whole family loves it. Very easy setup. My son thinks talking into the remote is \"so awesome.\" I will be ordering more to replace cable boxes.", "verified": true, "helpfulness": "0/0", "author": "DeWayne Higgins"}, {"rating": 3.0, "review": "I bought this in hopes of watching cable news but it did not offer anything I was interested in seeing. No conservative broadcasts.", "verified": true, "helpfulness": "1/4", "author": "Keith K."}, {"rating": 1.0, "review": "I had been using Apple TV but decided to get the Fire TV b/c of my Prime membership. I hooked it up today and watched a couple of shows. However I noticed that once I had hooked it up, the remote which used to control both my cable box and my tv and allowed me to adjust the tv volume and switch between input devices was no longer working for the tv controls but only for the cable controls. So far I've tried unhooking everything, rebooting everything, disconnecting the Fire TV etc and nothing has worked. Contacted customer service and they were less than useless. I never had a problem like this with the Apple TV.Update: After speaking with the cable company, it was determined that the Fire TV box knocked out the coding between the tv and the cable remote. They had to be repaired. Something with which the Apple TV had never interfered.", "verified": true, "helpfulness": "3/17", "author": "Victoria"}]