[{"rating": 5.0, "review": "Works better than expected.", "verified": true, "helpfulness": "0/0", "author": "John Pollard"}, {"rating": 5.0, "review": "This does work real slick.  And the price is good.  Very happy with this.", "verified": true, "helpfulness": "0/0", "author": "NovaLamp \"lamp4\""}, {"rating": 5.0, "review": "best decision I ever made. if you have a Prime account... you need this!!!", "verified": true, "helpfulness": "0/0", "author": "MOUNTIN DU"}, {"rating": 4.0, "review": "I've have had and used the Fire TV for many months now and it it competes in our household with a Apple TV, Roku 3, and Chromecast. It is a honestly really nice player and the voice search is one nice thing to set it apart from the other players out there. It is fast, the video quality is great and the setup was amazingly easy. When I ordered it, it was already associated with my account so I just plugged it in and it worked. Amazon did a lot to polish this set top player. The reasons that it doesnt get 5 stars comes down to two issues. First, you can't sort by only prime video. I can do that with my Roku, why can't it be done on an device made by Amazon? The other issue is that using Netflix, Hulu or others is a treated like a second class citizen. They are inside an icon, unsearchable by voice. It's an Amazon player that happens to play other things services in a much clunkier way than native Amazon content. It would be nice it the remote did streaming audio like the Roku as well.", "verified": true, "helpfulness": "2/2", "author": "Nikolas Roby"}, {"rating": 1.0, "review": "First off, this is my SECOND Fire TV. The first one didn't work right and I called Amazon support. They suggested I send it back for an EXCHANGE except some stupid moron processed it as a REFUND so I had to buy the Fire TV a second time because no one can read the customers account notations. Hopefully, this time they'll REFUND this dud that is meant only for NEWER TV models ONLY.You need an HDTV for this to work. Using an HDMI cable will not work nor will any other cable options as indicated in the Help section. The only way this will work is if you have an HDTV. If you don't, you're wasting your time. I will NEVER purchase any product that is made by Amazon such as Fire TV, Fire phone, kindle, etc. Will not be renewing my Prime membership either since I can't use the Fire TV to watch the NUMEROUS instant videos I have purchased. Yet again, Amazon wasted my time.", "verified": true, "helpfulness": "3/16", "author": "jbreakz \"Jennifer\""}, {"rating": 1.0, "review": "Not as good of deal as expected. Not many free items. Most had to pay to get.Also first TV didn't work. Replaced it & finally after trying all HDMI ports couple of times,etc finally got it to work.", "verified": true, "helpfulness": "1/7", "author": "Sarah Jane Smith"}, {"rating": 5.0, "review": "I've been impressed with the Amazon Fire TV so far.  The amount of quality content available is pretty amazing, especially between the Amazon Prime Video and Netflix accounts.  The only negative thing I've noticed is I have to force the Fire TV into \"Sleep\" mode when I go to bed, otherwise there's a bright beacon glowing behind the TV instead of the room being dark.", "verified": true, "helpfulness": "1/1", "author": "WastexGames"}, {"rating": 5.0, "review": "I have been a long time user of AppleTV and to make me replace four of them is a big deal. This thing just kills the AppleTV on how quickly it loads shows, it never has issues with streaming 1080p and it runs Plex. Done deal. I also own a couple of Rokus and some other similar devices.", "verified": true, "helpfulness": "1/1", "author": "Phil Neil"}, {"rating": 5.0, "review": "Son is very satisfied", "verified": true, "helpfulness": "0/0", "author": "Cynthia Rea"}, {"rating": 5.0, "review": "Plugged in and started watching Good Wife immediately!  Bought two more for gifts already. Easy to use, fast streaming and very organized. Have Netflix and amazon prime so plenty of options. Only one small complaint, the remote is so small that it keeps getting lost.  But still worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Aunt Debi"}]