[{"rating": 5.0, "review": "Love everything about it!! Use it everyday. A must have for all Prime Members!!", "verified": true, "helpfulness": "0/0", "author": "Jonlynn M. Vancho"}, {"rating": 3.0, "review": "Many recent and good older movies had to be paid for. Netflix may provide more movie options and cost less.", "verified": true, "helpfulness": "0/1", "author": "Piromrak K Evans"}, {"rating": 3.0, "review": "This unit has limited capabilities when you match it to it's competitors. The number of apps you can obtain is very limited versus hundreds of available apps for the top selling unit on the market. You also cannot stream embedded video (ie: video clips from Yahoo, Google, etc.) across FireTV. You only have the ability to stream videos from web sites that have the stream or share capabilities (ie: Youtube, etc.). It can also stream saved video or movies from your phone or tablet but, again, this is very restrictive when you make comparisons.", "verified": true, "helpfulness": "1/1", "author": "noir"}, {"rating": 2.0, "review": "Seems like it should be easy to use, but actually activating different services is a pain.  Still haven't gotten HBOGo or hulu plus to work on it yet.", "verified": true, "helpfulness": "0/2", "author": "Francesca"}, {"rating": 5.0, "review": "I was in the market for a new streaming device to replace my old WD Live Plus box that was getting a little dated when I decided to give the Amazon Fire TV box a try. As it turns out the box is quite a little powerhouse. I researched on-line on how to sideload apps to it and managed to sideload KODI (aka XMBC), FireFox Browser & an Icon customizer. This boosted the Fire TV's potential quite a bit as the KODI app lets you stream your personal video library to the Fire TV as well as your pictures & music libraries. With this add-on app along with the Fire TV's Prime Video selection, Netflix, Pandora and tons of other apps has turned out to make me a happy Amazon Fire TV customer.", "verified": true, "helpfulness": "2/2", "author": "ColorMeBlue"}, {"rating": 5.0, "review": "AMAZING!!!", "verified": true, "helpfulness": "0/1", "author": "Michelle Leach-Rivera"}, {"rating": 3.0, "review": "I did not like that it takes so much time to load the information from the Amazon Kindle to the Amazon TV .  I wish that the Amazon Fire TV would give you the option of not loading all of the apps.  I have enjoyed the movies that I have watched, but I am having trouble reading the movie information without standing directly in front of the TV to make my choices.  All in all I have enjoyed being able to watch movies I would not normally not be able to watch without renting or buying the movie in a store.", "verified": true, "helpfulness": "0/0", "author": "Deb"}, {"rating": 4.0, "review": "Great! !!!", "verified": true, "helpfulness": "0/1", "author": "DESHAWN"}, {"rating": 5.0, "review": "I love it! I'm cancelling my Netflix subscription.", "verified": true, "helpfulness": "1/1", "author": "Kalibungo"}, {"rating": 5.0, "review": "Best hundred bucks I ever spent. Went out and purchased another Fire TV for the upstairs the next day.", "verified": true, "helpfulness": "0/0", "author": "Rick Miller"}]