[{"rating": 5.0, "review": "Worth the money; I like being able to watch my Prime Instant Videos and play games on my TV.  I can also access other apps such as You Tube and NetFlix.  I like my Kindle Fire, but sometimes, it's nice to sit and watch and do things on a bigger screen.  Th voice control is nice to have also.I only wish I could access my FaceBook games; maybe it's something I haven't figured out yet.", "verified": true, "helpfulness": "0/0", "author": "Dawn"}, {"rating": 4.0, "review": "Like other reviews,I would like the choice of seeing the \"free movies\" first. Other than that, I love it. The voice option is terrific. Amazon is living up to it's name.", "verified": true, "helpfulness": "0/0", "author": "Anne@Midnight"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product!  Works great with Amazon Prime, Netflix, and ESPN.", "verified": true, "helpfulness": "0/0", "author": "Murray Rodes"}, {"rating": 2.0, "review": "another way for amazon to sell you stuff. the voice search only works for the amazon purchasable stuff not for netflix/hulu etc..", "verified": true, "helpfulness": "2/4", "author": "S. Ali \"S A\""}, {"rating": 1.0, "review": "if I had been able to use this, I know I would have loved it.  but unfortunately, my system wasn't able to use it.actually, I had ordered two units, one for me and one for my daughter.  I've received a refund on one but have not received a refund for the other.  I plan on contacting Amazon about that one.", "verified": true, "helpfulness": "3/10", "author": "Josephine Story"}, {"rating": 2.0, "review": "Bought Amazon Fire TV and a Roku 3. This was my first experiences with any streaming player so I wanted to compare. The Roku 3 streamed like a breeze with ZERO buffer on Amazon Prime, Netflix, and HuluPlus -- just flawless.I disconnected the Roku 3 and plugged in the the Amazon Fire TV -- it looked slick as did the menus so I set up my accounts. I tested an Amazon Prime movie -- sold, smooth, no buffer, full HD. Tested Netflix, horrible -- stopped, buffered, and locked up. Tested HuluPlus and the exact same thing, but the audio would play and the screen would lock up. I unplugged the power on Amazon Fire TV, plugged it back in and restarted it. Same thing happened -- tons of buffering and locking up on Netflix and HuluPlus. Immediately boxed up Amazon Fire TV for return and bought another Roku 3 and couldn't be happier.", "verified": true, "helpfulness": "3/3", "author": "Brandon E."}, {"rating": 5.0, "review": "Easy to set up and voice search,  works as expected.  I am one step down from fastest internet speed available and no problems with streaming.  I would highly recommend having a computer or Kindle to navigate through movies and programs and place them in watch list as opposed to hunting on the Fire itself.  I have not tried the gaming yet and will need to get a controller if I want to.  The controller seems a little over priced so it will not be soon.  Overall I am recommending this to my friends and have had a steady stream of them in to check it out.  A great entertainment addition!", "verified": true, "helpfulness": "0/0", "author": "Rosemary Williams"}, {"rating": 5.0, "review": "Very clear and good choices for movies and tv.", "verified": true, "helpfulness": "0/0", "author": "Fredrick E. Myers \"Classic movie lover\""}, {"rating": 5.0, "review": "Arrived in perfect condition.. Thanks!", "verified": true, "helpfulness": "0/1", "author": "Celeste ROse"}]