[{"rating": 5.0, "review": "I was surprised when I found out how much this little box does. Besides streaming movies and video, I have access to Amazon prime music, apps and can watch a slideshow of my own pictures which are stored on the Amazon cloud (for free because I am a prime member.)", "verified": true, "helpfulness": "0/0", "author": "Retired Housewife \"Becky Patton Logan\""}, {"rating": 5.0, "review": "The voice command does work. Easy set up. Simple to operate.", "verified": true, "helpfulness": "0/0", "author": "Mr.Griff"}, {"rating": 4.0, "review": "Seems to work fine now. For some reason it was difficult to sign up for Netflix, read past reviews and saw others had the same issue, and somehow got it to work after resetting or just being patient during a course of a couple hours. It would also be nice if the voice commands could be upgraded to work on Netflix and Hulu and the other aps.", "verified": true, "helpfulness": "0/0", "author": "Packer fan"}, {"rating": 5.0, "review": "Love this !!!", "verified": true, "helpfulness": "0/0", "author": "Evelyn Guilbault"}, {"rating": 5.0, "review": "Great variety thanks", "verified": true, "helpfulness": "0/0", "author": "Archie R Romney"}, {"rating": 2.0, "review": "I had high hopes for this but we became frustrated early with purposeful disorganization Amazon has plotted to get you to dig through the pay for programming to get to the free ones, Many series have the first show or two free then 1.99 each for the rest.Someone  not paying attention coud be hooked for big charges at the mend of a month. Add to that the tendency to freeze up and we have very fast internet because of our business,", "verified": true, "helpfulness": "0/1", "author": "Jerry White"}, {"rating": 5.0, "review": "If you are looking at Amazon Fire TV, It means you are interested in Streaming Services, to make your life easier and a complete Streaming Box with every thing you need to watch.Before I state my experience with Amazon Fire TV, I have a long years of HD Media player from PopCorn Hours 200C and TVix and others old one to the newest modern one starting from Apple TV, Boxee Box, Roku 3, PS4 and Xbox1.All of those HD media player streamer I have used for one thing NetFlix and HD contents. Plus I'm picky and I can tell which one is good for streaming contents and that due the UHD TV I have.1- I have 20mbps and Just upgraded to 50mbps and that means every thing should stream all fast and HD.2- I'm a fan of Blu Ray media, but that doesn't mean I'm interested to get all the blu ray around the world.3- Using Monster Black Platinum Ultimate High Speed HDMI Cable.Netflix App has reached every Media play every game consoles and every Smart TV. But the question which one is the best for in those.A- NetFlix Streaming in (PS4) takes 2 Minutes to reach 1080 Ultra HD.B- NetFlix Streaming in (Apple TV) reaches 1080 about the 60 seconds.Netflix Streaming in Amazon Fire TV reaches 720 first 5 seconds and reach 1080 After first 10 seconds.The same with the rest of streaming contents apps, and that is my experience, I used to think Apple TV is the best so far because it has every thing you want.When It comes to performance from what I have experienced Amazon Fir TV comes first and the best so far, I do love Apple TV but Amazon Fire TV has stolen my geeky Heart. Now you need to be patient Amazon will for sure add movies and TV shows.One thing I also love about it, it gives the ability to control picture setting from your HDTV, not like PS4 it has to control the (RGB Range) and (Y Pb/Cb Pr/Cr Range) Amazon Fire TV doesn't interfere with the picture setting, which give me the ability to have your own setting in the TV.Also It can take advantage of your high speed internet connection.Last though I want to pass to every one who is interested in Amazon Fire TV, Go ahead nothing can be compared to AFT.---------------------------Updated Reviews Feb 16 2015---------------------------I couldn't stay still without testing my all Media TV box streamers, I had this feeling and his urge to test which one I should make it my every day driver and main TV streamer, so I ran a test to find out and convince my self that I made the right choiceANNNDDDDWho best fits my video streaming needs? also where those apps could run as smooth as possible.1- Apps Used in the Test:  NetFlix, Hulu Puls and Amazon Instant Videos2- Devices Used in the Test:  PS4, Apple TV, Amazon Fire TV3- Cable Used in this test:  Monster Monster Black Platinum Ultimate High Speed HDMI Cable4- Samsung 65\" UHD 9000 Curved.5- Harmen Kardon latest Model.6- 50mbps speed connection7- Goodbye Vudu I got Amazon Prime. (you don't need vudu, unless you are in love with their XHD streaming quality)My test focus not in how fast the device launch the app, but instead is the performance while streaming those apps as I mentioned up.A- Netflix has a setting called Ultra HD streaming 7GB per hour.B- Amazon Fire TV has HD indicator which get highlighted, meaning the Stream is in HD.I went through all of those device testing each app with big screen and see for my self which one run smooth as possible and get the best quality streaming.Result1- Launching apps in PS4, Apple TV, and Amazon Fire TV is fine for me.2- Streaming content in HD takes time in PS4 and Apple TV, you have to wait about 2 minutes and more to see the whole show crisp and nice in it's glory HD. Plus there are weird pixels like the streaming drops down a bit.3- Between all of those great devices I can assure that Amazon fire TV is the only device that when ever I stream HD content it takes few seconds to see the full 1080 in Netflix. Plus there is something I don't know what to name it, every time I see a show in Netflix or Hulu Plus or Amazon prime, I see the picture very very clean and smooth and that's only in Amazon Fire TV.Final Though for that update I confidently can say that Amazon Fire TV is the best so far, and I mean it.", "verified": true, "helpfulness": "0/0", "author": "Mozef Kaddas"}, {"rating": 4.0, "review": "The Amazon Fire TV is a nice little box to view Amazon Video, Netflix and HULU.It's very responsive and the remote is great (Bluetooth).One downside is (as usual with Amazon products) that you're limited with your apps, and that voice search (for obvious reasons) is not integrated with apps like Netflix and Hulu.If you want to watch Amazon Instant Video, Netflix or HULU, then I can highly recommend this device.If you want to install for example Kodi, or play video/music from a USB drive, then better go look somewhere else.", "verified": true, "helpfulness": "0/0", "author": "Johannes Luijten"}, {"rating": 5.0, "review": "Very happy with this, very userfriendly.Only sad thing is that i cannot buy this in Belgium and had to buy this in the US with a special parcel service to get this into Belgium.I was using Apple TV before but the content with Fire is much more elaborate.", "verified": true, "helpfulness": "0/0", "author": "Rudy"}, {"rating": 5.0, "review": "Absolutely amazing.  We bought the stick and this device.  We use the fire tv box for the big family TV in the living room and the stick in the smaller rooms.  There are so many options for television and movies that are free with Amazon Prime.  We disconnected our satellite TV service and went with the most basic channels to get the local news.  We are saving 100.00 a month by using Fire TV.  I don't know how the satellite companies will stay in business if Amazon can bring TV to homes for free.", "verified": true, "helpfulness": "0/0", "author": "lach@megalink.net"}]