[{"rating": 4.0, "review": "very fast, I bought two of this after buying about 10 other brands media boxes.Pros1. Fast2. runs android ( you can install many apps ) hint **You have to know how to do it3. voice search works very well.4. Prime member section has a lot of moviesCons1. Only one usb ( should have at least 2 to 4 ) I had to buy other device to add more ports2. Internal memory is too low ( fills up easily )3. No full Amazon app store ( i find this weird since it there own device ) limited apps4. No Web browser app built in5. I get a lot of errors saying to call customer service when device goes into standby Hope this helps, It is a very good device but it needs work.", "verified": true, "helpfulness": "0/0", "author": "Rohan G."}, {"rating": 5.0, "review": "I really like my Amazon Fire TV!!! I did have a lower end Web player but, the differences are remarkable. Once you get the hang of the great graphics and colorful menues your on your way to having fun. Great picture, plenty of apps. I've had mine for well over a month and I'm still finding new features to have friends fun with.", "verified": true, "helpfulness": "0/0", "author": "C. Cauble"}, {"rating": 5.0, "review": "I have the Apple TV, Roku 2, Fire stick AND the chromecast. The Fire TV is the fastest of them all, with the Roku coming in a close second. The Apple TV, Fire stick and chromecast lag at times too, but not with this one. Everything works great and the remote is very responsive. I highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Freddy Rivas"}, {"rating": 4.0, "review": "quick but does not offer all the apps I want.", "verified": true, "helpfulness": "0/0", "author": "genius"}, {"rating": 5.0, "review": "Bought it for my mother, who is technologically challenged, and she was able to use it right from the box.  She doesn't have cable and only internet.  This helped her capture the content she was missing without cable.", "verified": true, "helpfulness": "1/1", "author": "Channing Thomas"}, {"rating": 5.0, "review": "I just love this!", "verified": true, "helpfulness": "0/0", "author": "Gina Howarth"}, {"rating": 5.0, "review": "Love my amazon fire TV!! Best investment. Easy to use and we'll worth the $", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 2.0, "review": "The go right side of the control wheel has to be pressed hard and long", "verified": false, "helpfulness": "0/1", "author": "Tal Pomeroy \"Living o the bleeding edge\""}, {"rating": 5.0, "review": "Fire TV has completely changed the way my family watches TV. The best part is that there is enough content available between our Prime subscription and the available apps (some are unofficial and require side-loading), we were able to cancel our DirecTV subscription, which is a HUGE relief all on it's own. I can't imagine going back at this point.", "verified": true, "helpfulness": "0/0", "author": "Chris Wessel"}, {"rating": 3.0, "review": "I was very impressed with some of the comments, after reading several I decided that I will purchase the Amazon Fire to experience the hype. Sadly, after having viewing a few shows, the device kept freezing up on most of the channels. After several attempts to prevent freezing I reboots, reset and I was getting an error message. I decided to call Amazon techinical support and what a bigger mess, apparently the first, second nor third rep knew what to do. After several phone calls I finally reached someone who knew what they were talking about.  I had to clear out the cashe two times, reboot it worked for a while, now I'm back to frozen programs. So, I decided to give APPLE TV, a try and I love it easy to maneuver and NO FREEZING! I wish I could give it more stars but unfortunately, I can't. The one thing that I did like was the voice command.", "verified": true, "helpfulness": "1/1", "author": "Kalogne Thomas \"Kologne\""}]