[{"rating": 3.0, "review": "To many pay shows", "verified": true, "helpfulness": "0/0", "author": "joe jr"}, {"rating": 4.0, "review": "It is a bit difficult to find out if there is a charge for videos.  I have Amazon Prime and Netflix and still am still trying to learn how to search for videos.  I still don't know how to turn the little box off.", "verified": true, "helpfulness": "0/0", "author": "Patti Petersen"}, {"rating": 5.0, "review": "Love my Fire and now it got even better because it has HBOGo. Very fast and easy to install, very convenient voice search and many apps. I chose the Fire TV over a Roku (compared the 2) and I'm not a bit disappointed. Recommended.", "verified": true, "helpfulness": "0/0", "author": "Kit Moresby"}, {"rating": 5.0, "review": "Better  than Apple TV !", "verified": true, "helpfulness": "0/0", "author": "Digital Man \"puravida\""}, {"rating": 5.0, "review": "Works great .The only complaint is I wish there was more prime movies worth watching", "verified": true, "helpfulness": "0/0", "author": "andrew millett"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "MR. A"}, {"rating": 5.0, "review": "Perfect for me. FAST, easy set up, nice picture. You need Amazon Fire if you are a tv watcher. Love easy searches & Netflix app.", "verified": true, "helpfulness": "0/0", "author": "Anon \"Gwg\""}, {"rating": 3.0, "review": "I had trouble with this connecting to my internet.  I've moved since this and wonder if it would work now, but I've already sent it back.  I'm not sure why it wouldn't connect before..all my other devices would.", "verified": true, "helpfulness": "0/2", "author": "Jessica Deckard"}, {"rating": 3.0, "review": "I love it. Except for the fact that every time I go to use it, my batteries in the remote are dead. I don't use it every day. I use it about once a week. I have replaced the batteries twice in the remote, and I have only used it three times in a month. I guess it is a good way for Amazon to force you to buy rechargeable batteries from them.", "verified": true, "helpfulness": "0/3", "author": "Chase Frazier"}, {"rating": 2.0, "review": "The video streaming is really fast and the quality is great. However, it has made me download Netflix more than once which was frustrating when I just wanted to turn it on and watch something. I was given the Amazon fire as a gift so I had little prior knowledge of what it was about. I still don't really understand all of the features. It's nice to watch Netflix on, but you can watch Netflix on a lot of other devices as well. The voice command feature is nice and it seems like there is a wide selection of movies, however all of the movies cost about the same as they would if I used my time warner on demand. Maybe the fire offers a lot better selection if you have Amazon prime. It just seems like the fire's interface isn't very friendly and has a cold business setup. I'm in my late 20's and I usually embrace technology, but I just don't see why I would use this and pay the same for movies if not more than I would thru my cable on demand services or red box.", "verified": true, "helpfulness": "0/2", "author": "Adri"}]