[{"rating": 5.0, "review": "I love it, it is really user friendly plus a good variety of show and movies.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Really small , I had no problem finding a spot for it.", "verified": true, "helpfulness": "0/0", "author": "lulu Muniz"}, {"rating": 5.0, "review": "I love it, it's faster than all the others, the picture quality is great and the content is awsome. Couple with prime and watch a full aray of movies and tv. Great!!!", "verified": true, "helpfulness": "0/0", "author": "Bruce E Balemian"}, {"rating": 5.0, "review": "Always works great, never have any problems with it! Much better than our AppleTV which is super glitchy!", "verified": true, "helpfulness": "0/0", "author": "Happy Customer"}, {"rating": 4.0, "review": "Very easy to use and to set up. I would highly recommend getting Amazon Prime with this product to easily view content available as a prime subscriber.", "verified": true, "helpfulness": "0/0", "author": "Richard Barretto"}, {"rating": 4.0, "review": "Well built device. Works well with quick response. Would have liked it better if it also had IR in addition to a Bluetooth remote so I could control it with a universal remote. Also would have like to be able to install apps available on Google Play without having to sideload them.", "verified": true, "helpfulness": "0/0", "author": "jhumroo"}, {"rating": 4.0, "review": "Works very well, but had to upgrade wireless router.  The tech information is very weak on the required speed to effectively utilize this set.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This has got to be one of the best things that I've purchased except for my Kindle!  I love the programming available, finally getting to watch some HBO series that I'd always wanted to, starting from season 1, episode 1.  The quality of the picture is spot on and is so easy to take to another room to enjoy the movies or whatever you fancy.  I've cut my UVerse down to the basics and it's hard to believe that I haven't missed that programming at all!I'm so thankful to an Amazon customer service rep that mentioned it to me while I was calling for something else entirely.  For under $100. and a free year of Amazon Prime you've got a fantastic bargain.", "verified": true, "helpfulness": "0/0", "author": "K. Delucas"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Cristina Perez"}, {"rating": 4.0, "review": "Some of the way menus are presented on subscription channels to you tube get jumbled which is frustrating.  Easy setup, and except for a few little problems it works as expected.  Wish there was easier compatibility with kindle and web surfing ability as well.", "verified": true, "helpfulness": "0/0", "author": "Andrew Cunningham"}]