[{"rating": 1.0, "review": "Received the item as a Christmas gift. The remote is absolutely impossible to open to put in batteries. Broke both thumb nails and still can not get it open. Tried the help from customers section and found other people had the same problem. What good is the Amazon Fire TV if you can not install batteries to operate. Suggestion: The remote is poorly designed and needs a complete redesign. DO NOT BUY until Amazon solves this problem.", "verified": true, "helpfulness": "5/12", "author": "James C. Cate"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Billy lloyd"}, {"rating": 5.0, "review": "Love it love it !!!!", "verified": true, "helpfulness": "0/1", "author": "Wendi mccloy"}, {"rating": 5.0, "review": "Love it, Streams great!", "verified": true, "helpfulness": "0/0", "author": "JBNascar Fan"}, {"rating": 5.0, "review": "Love it best purchase in s long time my grandson loves the game controls", "verified": true, "helpfulness": "0/0", "author": "Diane Angell"}, {"rating": 2.0, "review": "If you're tech-savvy this is worse than Apple restrictions.Amazon, you have any idea how big of a mistake this is without root? Also how much pain it is to side load apps?Yet you screw us all over trying to harness it's full power. I bought this for my family just to realize how much of a \"dumbbox\" you made it. Your voice search is only for your Ebanezer Scrooge greed Amazon Prime. Which is unavailable for Netflix/Hulu/YouTube.Oh I know what you worry about, but really to fix that problem is to make your service actually affordable.", "verified": true, "helpfulness": "3/6", "author": "Rick Grenda"}, {"rating": 5.0, "review": "We enjoy the different selections", "verified": true, "helpfulness": "0/1", "author": "Courtney"}, {"rating": 4.0, "review": "I bought this for my 17 year old son for Christmas. So far he is loving it, with the exception of having interference from his brothers kindle fires. If my son is watching a movie on the Fire TV, my 2 younger sons can pause the movie using their Kindle Fires. Or if the Kindle Fire is close to the FireTV it changes to what ever the Kindle has on it (game or whatever). This is disappointing because my husband and I were planning to buy the Fire TV for ourselves, but we use our Kindles all the time while watching TV. This will be an issue! I hope Amazon can fix this issue!!!", "verified": true, "helpfulness": "3/5", "author": "lisa"}, {"rating": 5.0, "review": "easy installation, simple navigation and a wealth of content that I m still exploring.", "verified": true, "helpfulness": "0/1", "author": "Ca. Phil"}, {"rating": 5.0, "review": "Wow!! right out of the box and everything worked to perfection! A wonderful little thingy that brings all of your gadgets and time wasting joys together in one tiny device. A whole lot less is going to get done this year! Thank you Amazon.", "verified": true, "helpfulness": "2/2", "author": "P. Barber"}]