[{"rating": 5.0, "review": "I absolutely LOVE this streaming device.  It's perfect for the avid Amazon junkie such as myself!  I just discovered, after several months of having the device, that when you play music from your Amazon playlist, the lyrics scroll up on the screen much like karaoke.  I'm sure not everyone would appreciate this feature, but I thought it was awesome.  Otherwise, it's just an overall great device that has far exceeded my expectations.  The only con that I see right now is that it does not offer the HBOGo app.  I'm sure it will be available soon...at least I hope so.", "verified": true, "helpfulness": "1/1", "author": "ntheflow"}, {"rating": 5.0, "review": "So far I love this fire TV! The only thing I wish it had was amazon prime music. Or maybe I just don't know how to access it yet", "verified": true, "helpfulness": "0/0", "author": "Craig"}, {"rating": 5.0, "review": "Incredible.  I want another one for my other TVs.", "verified": true, "helpfulness": "0/0", "author": "David T Berling"}, {"rating": 2.0, "review": "Amazon fails to tell you this before you buy this unit:I bought this Fire TV unit so that I could watch ESPN as advertised (Monday Night Football in particular). When I connected the unit and downloaded the ESPN app, it asked for the name of my TV provider. In other words unless you already have a paid provider subscription like DirecTV, Dish, TWC, etc., you can't watch ESPN on Fire TV.If I had a paid provider I wouldn't need Fire TV, but Amazon doesn't tell you that up front. Same with the History channel.Then what really ticked me off is that Fire TV says you can listen to your Amazon Music Play List.I loaded 98 tunes to my Prime Music Library, then went to my Fire TV and no music was available. I contacted customer support and was told that you can't listen to your Prime Music Library on your Amazon Fire TV.WTF?", "verified": true, "helpfulness": "2/4", "author": "Robert Di Giulio"}, {"rating": 4.0, "review": "Good product for the money. My biggest complaint is that it can't seem to maintain a wifi connection to my router, and when the connection dies I need to reboot the Fire TV by unplugging it and plugging it back in. Hopefully this is either a problem with my router or something that will be fixed in a later software update.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Love this item, especially the voice search.  I have an older LG plasma HD TV and now it is \"smart\".", "verified": true, "helpfulness": "0/0", "author": "Youki"}, {"rating": 4.0, "review": "DO LIKE IT:-Easier to use v our Roku HD (line of sight, etc).-Voice control - although we haven't mastered that yetDON'T LIKE IT:-You have to click the movie to see the cost of an Amazon movie (buy v rent)-Getting a movie in SD requires more clicks and it's not super intuitive where to find that option (Mountain living means slower internet which doesn't support HD streaming)", "verified": true, "helpfulness": "1/1", "author": "BakerSpot"}, {"rating": 5.0, "review": "THIS IS A REAL REVIEW.. I bought this a couple a weeks ago for my vizio hdtv. I was looking for a product that could turn my hdtv into a smart tv like my sister's vizio smart tv. This does an amazing job. The remote is simple, useful, and has great feedback. I was debating on whether to get the Google chromecast, but the google chromcast doesnt do half the sh*t this does lol. Great product it does everything a smart tv does basically. MAKE SURE YOU HAVE ACCESS TO WIFI BECAUSE IT WONT WORK WITHOUT IT !!!", "verified": true, "helpfulness": "0/0", "author": "Mellissa coleman"}, {"rating": 4.0, "review": "If you want a really decent home theater on a budget, this is a great way to go - perhaps the best.  Simply hook it into a projector, and your home stereo, and you now have a system to rival IMAX.  The interface is easy to use, and is \"good enough\" for most viewing activities.  There are a couple of draw-backs, though:1 - It does not let you pre-download movies.  I have a very fast internet connection, but even still it will drop quality in the middle of a movie, and / or pause and re-buffer if there is a glitch.  A simple solution to this would be to allow one to pre-buffer even 5 minutes of the movie, or better yet, download it.  (Compare this to the Kindle Fire HD tablet, that lets you download.)2 - It is more locked down than even the Kindle Fire Tablets, in that you cannot browse the Internet, download many 3rd party apps, including many of those from Google such as Google Earth, or even read a Kindle book.3 - The voice search works great with amazingly good speech recognition, but is limited in where it can be used.  For searching in apps like YouTube, there is an on-screen keyboard, but it is terrible.  What is needed here is to allow voice input for any app requesting a keyboard.Also note that it does not support 4K.  Its 1080p only.  I'm hoping for a high-end device just like this, but a little bit less locked down, the ability to add memory to pre-buffer and pre-download, and with the ability to browse the Internet.Other than noted above, the image quality is generally quite good, or even excellent.  It is very convenient to use and setup, and you get a reasonably decent selection of movies through Amazon Video, Amazon Prime, and optional services such as NetFlix, Hulu, Youtube, etc.  This is a really nice interface for a tv / theater experience.", "verified": true, "helpfulness": "1/1", "author": "Carl"}, {"rating": 5.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "Virginia Bookwoolfe \"ittlewoman\""}]