[{"rating": 5.0, "review": "Great, real easy to use.", "verified": true, "helpfulness": "0/0", "author": "Thomas DiFilipo"}, {"rating": 4.0, "review": "Works great, lots of good TV and movie Prime selections and Fire TV is an easy to access and organized gateway to pay subscriptions like Netflix, Hulu Plus, etc. The Fire TV box is tiny, so out of the way, the remote is also small, but has simple intuitive controls that makes it easy to manage viewing as well as to navigate. Voice search for Prime works great; no special effort required to enunciate and it is not necessary to speak in a loud voice, however, it does not extend into other services accessible through the Fire TV box. The original Prime TV shows are all well produced, about half fit my demographic, which is better than network or cable TV rates. The Prime subscription that supports Fire TV also allows the same content to be run on my Kindle HD and PC.If there was something that could be improved it would be to reduce the cost of classic TV and obscure B movies. $4 to watch the Kung Fu pilot and $2 per episode adds up quickly and $3 for a SciFi B movie rental is a little still. Of course, Amazon provides many free of charge with Fire TV and there are over 40,000 TV and movie titles available.", "verified": true, "helpfulness": "0/0", "author": "Joe D \"RealGuns.Com\""}, {"rating": 2.0, "review": "Like the player but the remote broke after 8 months of light usage. The remote was never dropped or damaged - it just started to lose functions until it finally stopped altogether. A replacement remote costs $30- which is 1/3 the cost of the unit itself. Luckily you can download an app that lets you use your smartphone as the replacement remote, but it is sub-par as far as it's usability compared to the real remote with important functions such as fast forwarding and rewinding.", "verified": true, "helpfulness": "0/1", "author": "djfoto"}, {"rating": 1.0, "review": "Search only works with Amazon, even after paying a 100.00 price tag for the box too much of the the material on it is [Pay To Watch]. You still can't watch TV without having a subscription to a major cable or sat. co. Not worth the money.", "verified": true, "helpfulness": "1/5", "author": "Julia Shaver"}, {"rating": 5.0, "review": "Fire TV setup is painless just like advertise.  Setup took about 15 minutes would have been less if I had a keyboard.  Program selection is excellent along with the other streaming media software.  The device is about two cd stack on top of each other.  Remote is simple to use, one nagging thing is that you do not have a sleep button on it.  In order to put Fiver TV to sleep you have to navigate to the settings menu and then select sleep.  Also,it would have been a major plus if Amazon would have added a headphone jack on the remote like their competitors.  Enough with cons,  mine Five TV is using a wireless connection to get to the internet and it does an excellent job.  The Fire TV is in my bedroom, just over 60 feet from the router which is a Comcast issue that really does a bad job of streaming media but the Fire TV works like a champ.  The Fire TV beats out my Samsung Smart HDTV wireless performance hands down and Samsung is only 20ft from the router.  Overall I like the Fire TV for streaming media and view my pictures, movies, and all files that I have store on Amazon Cloud.  It is worthwhile to be a Prime Plus subscriber.", "verified": true, "helpfulness": "0/0", "author": "luieji"}, {"rating": 1.0, "review": "even after 2 months of this item, I haven't received my refund yet, don't know who to contact for refund.", "verified": true, "helpfulness": "0/4", "author": "hardikkumar patel"}, {"rating": 4.0, "review": "Very nice.  We cut the cord to our satellite subscription and are going with Amazon Prime, Netflix and Hulu Plus.  Will save hundreds per year. Would have been 5 stars but have an issue where Hulu Plus is not working through the Fire TV.  Have no issues with Hulu on our tablets and laptop.  Have not checked the internet if there is a work around/solution.", "verified": false, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "Love it!  Very easy to set up and connect to my wi-fi!  Can't wait to start watching!", "verified": true, "helpfulness": "0/0", "author": "Lawrence \"RN Mom\""}, {"rating": 3.0, "review": "Meh...I have the Roku HD which ran me about $49 on sale. The Amazon Fire TV box is better, but not by much and not in ways that matter to me. Yes, it supports games but I don't want to play games. If I did, I'd play on a gaming console or PC and get a far better experience. It has some other apps which are slightly useful but hardly game changers. If I can get airplay to work (supported app?), especially from my iMac I would add a star.Otherwise, it's newer and faster that the Roku. The interface for browsing and searching for content is OK. It works well enough but compared to the Roku, better in some respects and worse in others. Essentially a wash. As far as watching content, No difference at all. Both play Netflix and Amazon content. I have a fast broadband connection (50 MB), so I rarely have issues with streaming content.I'd have been better off keeping the Roku (I gave it to my son). It's really not any improvement over a 2 year old Roku that cost half as much.", "verified": true, "helpfulness": "0/0", "author": "Dan Rode"}, {"rating": 5.0, "review": "Best money I spent works very well. Easy to operate.Love it", "verified": true, "helpfulness": "0/0", "author": "Anthony Marino"}]