[{"rating": 3.0, "review": "Cons: If you don't have a Hulu account you won't be able to watch much. There are a few shows that come with a Prime membership, but not much. We have just been using the Netflix app mostly. I think there should be a separate menu where you can search only things that are available to you (that you don't have to pay extra for)Pro: The voice search seems to work well. I haven't had any issues with it. Easy to use, nice clear picture.", "verified": true, "helpfulness": "0/1", "author": "Lisa j."}, {"rating": 5.0, "review": "Great product.  Lots of movies to choose from.", "verified": true, "helpfulness": "0/0", "author": "Peter Davie"}, {"rating": 5.0, "review": "This replaced the \"old\" computer that I used for Amazon Prime and Netflix.  It pretty much met my expectations, as I wanted a faster startup and shutdown, which I Fire TV definitely provides.  Also, alot more stable than my old Windows XP computer, which had occasional issues with Silverlight and Netflix playback.Only negative so far was Netflix' app for Fire TV.  It took 2 days of constantly trying to get it to run.  Finally, it just started working.  After that, it has only had one recent hiccup, when it \"forgot\" that I had already logged in with Netflix, and it started acting like I was a brand new Netflix user (I re-logged in, and everything is fine, for the moment).Only thing missing from Netflix' app is the DVD queue. I use my tablet for that.", "verified": true, "helpfulness": "0/0", "author": "Phillip H. Darling"}, {"rating": 5.0, "review": "Great product, very happy with it. Much better than the Roku 3 we tried out a few months ago. Fast, and never has any lag issues. Definitely would recommend, especially if you add a Netflix membership. We dropped ATT U-Verse TV awhile back and needed something to fill the gap. OTA is good for news and there is a suprisingly good amount of movie channels out there with the antenna although you have to put up with commercials. The Fire TV has closed the gap with the nice array of tv shows and movies available.", "verified": true, "helpfulness": "1/1", "author": "T. Holmes"}, {"rating": 5.0, "review": "Works great, was unhappy that it went on sale less than a week after I ordered it.", "verified": true, "helpfulness": "0/1", "author": "Michael Bernard"}, {"rating": 4.0, "review": "Works good. Wishing there were more free movies to watch. Even as a prime member, not a large enough library of free movies. So all in all about the same as the roku i replaced.", "verified": true, "helpfulness": "0/0", "author": "Jack O'Neal"}, {"rating": 5.0, "review": "Love it absolutely !!", "verified": true, "helpfulness": "0/1", "author": "montez d hudson"}, {"rating": 5.0, "review": "Wish it would also work with IR remotes like the Logitech harmony. Still missing some apps like Ted. Otherwise pretty awesome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Live it", "verified": true, "helpfulness": "0/1", "author": "Hany Youssef"}, {"rating": 4.0, "review": "It works fine for most people. I personally prefer my roku 3 over fire tv but that's personal preference.", "verified": false, "helpfulness": "0/1", "author": "Joshua Leady"}]