[{"rating": 2.0, "review": "While the Fire TV is well designed and works as advertised......the content just isn't there.Wish I had purchased the Roku 3 instead.  It would have given me everything Fire TV does and a lot of additional content.", "verified": true, "helpfulness": "1/3", "author": "Don N. Nelson"}, {"rating": 5.0, "review": "I've been using the Amazon Fire TV for a couple months now and I really love it.  It's much quicker than the Roku 3 in terms of playback, menu changing, item selection, etc.  I also find the UI to be much better as The Roku uses a carousel effect but fails to give back proper information on files making search a nightmare.  I should note that I mostly use the Plex app on both devices and have found the UI to be superior on the Fire.The voice command search works well in the Amazon world for Prime, but is basically worthless otherwise since it doesn't tie into other services to find the information you seek (NetFlix, Hulu).  Overall, I really like the device.  The speed and UI really do it for me.  The downside is that there aren't many apps available for the Fire TV unlike the Roku which has a massive amount.  With time there will be further additions, but until then, either expect to use the major players available, or supply your own content through Plex.", "verified": true, "helpfulness": "0/0", "author": "Nick P"}, {"rating": 3.0, "review": "I took upon Amazon's free trial of this product. One feature that stands out when compared to other streaming units in the market is the voice search - sleek and works (almost) all the time. I was hoping Fire TV would come with silk or similar browser. That would have this product great. Overall, not a compelling reason to switch from roku that I already own.", "verified": true, "helpfulness": "0/0", "author": "Harish C. Mohan \"Harish\""}, {"rating": 5.0, "review": "This streaming TV box is great.  Extremely fast loading with the QuadCore processor.  The only thing I don't like is there is no way to turn it off unless you unplug it.", "verified": true, "helpfulness": "0/0", "author": "Susan Miller"}, {"rating": 5.0, "review": "I downsized on cable and saved $70/month and got a month free on Amazon prime. The unit has already paid for itself. I will buy the $99 yearly subscription from Amazon prime and continue the savings throughout the coming year.", "verified": true, "helpfulness": "0/0", "author": "Rita.Harriman"}, {"rating": 4.0, "review": "I love our Kindle Fire TV. It is small and unobtrusive. Comes ready to set up. Set up is simple. It is easy to get to and easy to use. My favorite feature is the speech search option it works great and makes searches simple and fast. There are only two things I would change about it. I don't like having to scroll through all the pay films trying to find the prime films. They need to have those seperated out", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We have a bluray player with widgets, xbox360 & Apple TV all for Prime Movies & Netflix.  We almost never used Prime because it was so much trouble to search for movies.The speed & quality of the video has been excellent, no hang-ups like on our other players, search is great & we use Netflix & Prime constantly on this system now - sold the Apple TV yesterday.  If you are a prime member this is an excellent addition & if you are a big netflix user that has delays & pauses it's probably worth the upgrade from whatever you're using now.", "verified": true, "helpfulness": "0/0", "author": "skisby \"skisby\""}, {"rating": 5.0, "review": "With the installation of our Fire TV, I can completely justify my decision to pull the plug on Comcast. My $160 monthly cable bill and the viewing choices dictated by Comcast are history. They have been replaced with content of my choice through Amazon Prime. Netflix, and Hulu Plus for about $40 a month. This means that my Fire TV paid for itself in one month and I will save $1,440 a year in the bargain.", "verified": true, "helpfulness": "1/1", "author": "lanmill \"includemeout\""}, {"rating": 4.0, "review": "Overall,  pretty happy with this unit.  It was easy to establish a link to my wireless router,  and installed without issues.It was also easy to link thru my home theatre equipment for enhanced video and audio.Streaming video thru Prime is seamless,  speedy,  and the selection is OK.It has an app for HuluPlus,  but NOT for the free version...HULU.If I had any reservations at all,  it would be that the voice search is only applicable to items found on Amazon.I have Netflix as well,  and any searches thru them require that I type in the search request.This proprietary search feature is easily fixed by Amazon,  but apparently,  they don't want you searching across otherplatforms thru the voice search.For this reason,  it only got 4 stars.", "verified": true, "helpfulness": "1/1", "author": "AJ"}, {"rating": 5.0, "review": "I spent about 6 month pricing/comparing digital media streaming devices - Roku, Google Chromecast, AppleTV, NeoTV....you name it and I researched it.  After all that time, I couldn't pull the trigger on buying one and dropping cable.Then, I got an email from Amazon asking me to try this device for 30 days for free.  If I didn't like it, I could send it back - no risk.  I LOVE it.  We get access to all of Amazon Prime, with the ability to rent or buy movies as well.  Netflix, Hulu, Vevo, Pandora, iHeart Radio, YouTube and according to Amazon, Disney and ABC will be added to the lineup later this year (and those are just a few...).  It has a voice search that works great (although, it only searches Prime content - maybe you should get on that, Amazon) and the ability to play games with the gaming controller that you purchase separately ($39).Set up was a snap - plug it in (you'll need the HDMI cable - not included) and turn it on.  There may be an update, and you have to let the instruction video play through and then you're ready to go.  It's easy enough to browse everything within the box - even without the voice search (although, I think that with their commercials hocking that as the advantage over other boxes, it should search content across ALL providers).  While I think that the upgrade on the voice search and the ability to search only free content would be fantastic upgrades, over all the device is EXTREMELY user friendly and exactly what I was expecting.As a dedicated Amazon user (we have 4 Kindles in our home and I'm a Prime member), this device was the best choice for the money.  I would recommend this product to friends and family.", "verified": true, "helpfulness": "2/2", "author": "Brandi N. Summers"}]