[{"rating": 4.0, "review": "I wish more recent movies were on it,alot of the old I have seen. I like it otherwise,was very easy to hook up. Very clear and I like the remote size.", "verified": true, "helpfulness": "1/1", "author": "dpolk"}, {"rating": 5.0, "review": "Works great for XBMC.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Thus by far is my best purchase.  Beats hooking up the Wi every time I want to watch Hulu and Netflix.  A little move apps if the channels I like to watch and I will be saying bye bye to Direct TV.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Cummings"}, {"rating": 3.0, "review": "This is nice media streaming device, especially nice for Amazon Prime members which I am. One thing I didn't like is it first shows the \"pay for\" selection of a movie where you have to choose other viewing options before you may realize the movie is a \"prime\" (no additional charge) movie. This should be a first option especially for a preregistered Prime member. The picture quality was as good as any 1080 device I have and the voice command functions quite well.Overall, this is a good media streaming device with some nice features although without as many media choices as other (e.g. Roku) streaming devices. Fire TV ranks right up there with the others but does not surpass them.", "verified": true, "helpfulness": "0/1", "author": "Richard La Barca"}, {"rating": 5.0, "review": "Amazon Fire Tv I love it. Better then Apple TV and Roku", "verified": true, "helpfulness": "0/0", "author": "kiddcage2010"}, {"rating": 5.0, "review": "This is my third tablet and the smallest and love it . Reading the book is a pleasure and will be ordering them for sure for this tablet . The books are clearer on this tablet. I am so glad I got this tablet", "verified": true, "helpfulness": "0/4", "author": "harriet l williams"}, {"rating": 2.0, "review": "The fire TV works just fine, it runs most major services (Hulu, Netflix, even a Plex app.) I was a little upset by the lack of an official youtube app, but the \"popular\" one one their store works fine.The main reason for this review is the interface. I constantly have to dig through a few menus to find what I'm looking for.If you're looking for a device that runs everything (even prime instant video) and is easy to use, look at the Roku 3.", "verified": true, "helpfulness": "2/5", "author": "Owen"}, {"rating": 5.0, "review": "LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Have tried a Chromecast, Apple TV, and Roku. The Fire TV is by far the best!", "verified": true, "helpfulness": "0/0", "author": "BatteryDrained"}, {"rating": 3.0, "review": "I *really* wanted to like this box -- been looking for a one-size-fits-all streaming box forever.  I have a Boxee Box (fantastic until it was abandoned by the developers and D-Link), Western Digital WD-Live, Chromecast, TiVo HD-XL (which does Amazon and Netflix, both poorly) and Oppo BluRay Player with built-in apps (does a great job but has a terrible interface).  None of these devices support Amazon Video except TiVo and it doesn't do Prime Video, so I figured I'd try the Amazon Fire TV to see if it might replace these devices.The short answer is no -- there are just too many glitches, so it's going back within my 30 day trial period.  The first issue is compatibility with my Marantz AV8801 -- I could not get the Amazon Fire TV to display full-screen using any of the available rear HDMI inputs. All content showed in a box in the middle of the TV screen and try as I might, I couldn't find any setting either in the Amazon Fire or in the Marantz to change that.  Plugging in Chromecast or WD-Live to the same input worked just fine -- 1080i output to my admittedly old Sony RPTV and 2-year old Sony LCD TV using the Marantz' two HDMI outputs. Plug in the Amazon box and everything is fuzzily displayed in what looks like a 360p box floating in the middle of the screen.In desperation, I tried the front panel HDMI input, and the Fire TV did work properly with that input. It's not any different than the rear inputs and the settings in the receiver were the same, but for some reason that worked and displayed a beautiful image.  But that led to the next problem -- try as I might, I could not get the Amazon to output anything other than 2 channel Dolby Digital sound.  It's supposed to have Dolby Digital Pro (whatever that is -- it is on the list of audio formats that my receiver supports, but I'd never heard of it) but I couldn't get it to output anything other than stereo.  Using Netlix, I watched \"Doctor Who\" with both the Amazon FireTV and the Chromecast (same episode) and the Chromecast sound was much better.I also have a Plex server, and the availability of the Plex app for the FireTV was another reason I wanted to try this device.  That was a non-starter -- while the very first program I tried to play streamed properly (causing me to declare success), after that nothing worked. I'd start a program and it would sit and spin for a while and eventually declare the program unplayable (no problem on the Chromecast), and once that happened, then the FireTV wouldn't play anything at all (including Netflix or Amazon VOD) until I power-cycled the FireTV. And when it did work (which was maybe 1 out of 10 programs that I tried, with frequent power cycles), I just got the two-channel audio.  It's been several months since the FireTV and Plex were released, so there has been plenty of time to work out the kinks.So the Amazon FireTV is regretfully going back (and I need to figure out how I can get the $5 I paid for Plex back as well). I'm giving it three stars because it did play Amazon VOD well, has a good remote, never stuttered on playback (when it worked, that is), and has a truly speedy interface. It may work perfectly well for a lot of people with simpler setups -- that is, who will plug it straight into a TV and just want Amazon VOD and Netflix. I'm looking forwards to the inevitable v2, which will hopefully have all the kinks worked out. I hope it also supports DTS and lossless Dolby or DTS multichannel audio formats (like Boxee or the Oppo BluRay player do) -- that make that a no-brainer. But for now, color me disappointed.", "verified": true, "helpfulness": "1/4", "author": "ZimFromIrk"}]