[{"rating": 5.0, "review": "It's going to save on cable bill love it.", "verified": true, "helpfulness": "0/0", "author": "Merry Baldridge"}, {"rating": 5.0, "review": "Great entertainment box. This box offers it all. Very easy to use. Works flawless without a hitch.", "verified": true, "helpfulness": "0/0", "author": "Furbykid \"1bigkidd\""}, {"rating": 4.0, "review": "Giving it 4 stars wish there were more free movies, series and comedies.", "verified": true, "helpfulness": "0/0", "author": "SannyBlade"}, {"rating": 4.0, "review": "For Amazon content it is the best, as I would expect. The search function is great and the voice search is even better. The hardware is impressive and 720p content flows smooth. The user interface is simple yet decently intuitive. DD 5.1 audio is okay for TV shows but....Now the cons;1. Due to the limitation of the hardware the device is incapable of bitstreaming (ability to push full uncompressed audio such as DTS-MA or Dolby TrueHD to a capable receiver).  A deal breaker for hard core home media folks...2. Integration with Plex Media Server. This is barely passable, the app is ancient in software years.  A deal between Plex and Amazon to work together for home media servers would make this a \"must have device\". If you were to take the playability of almost all audio and video files like the WD Live TV does and pair it with the AFTV, allow bitstreaming, and work with Plex to create either a built-in player or an up to date app then this would be the best player/streamer ever, hands down!If my 2 listed cons were fixed then I would give 5 stars, buy at least 2 of them and it would allow me to advise all my freinds and clients to go get theirs too.What do you say Amazon and Plex? Or will I have to continue to switch between the AFTV and the venerable and powerful XBMC/Kodi for my movie needs?", "verified": true, "helpfulness": "0/0", "author": "Scott H."}, {"rating": 5.0, "review": "Easy to hook up and use. Very intuitive!", "verified": true, "helpfulness": "0/0", "author": "Melanie Charleston"}, {"rating": 5.0, "review": "Excellent product from the start. Amazon has continued to improve the product and applications over time. We have almost \"cut the cable\" and moved to entirely streaming content.", "verified": true, "helpfulness": "0/0", "author": "Scott R. Huff"}, {"rating": 5.0, "review": "Easy set up and connected straight away.  Voice command is great and it actually works with whom ever talks to it.  Highly recommend the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"queen of piers\""}, {"rating": 1.0, "review": "This product might not suck if it was actively being updated by Amazon. For me, this is the last piece of Amazon branded hardware that I will purchase. Most of the applications such or don't actually work for the FireTV. There isn't a native YouTube app so you have to hope the third party one actually works. The UI is terrible. The Apps selection is random and crappy. There isn't much available from the software repository. The final nail in the coffin is Amazon's abandoning product support, pump and dump, when you are a major company is just bad form.Save your money. Get an AppleTV or use your Playstation/Xbox - it does more then the FireTV already.", "verified": true, "helpfulness": "0/2", "author": "J. A. Mohr \"johnathonm\""}, {"rating": 5.0, "review": "Worked as expected right out of the box. Especially like the Amazin cloud photo service - automatically uploads photos from my phone to watch on the TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the Amazon TV. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Nancy J Dobbs"}]