[{"rating": 4.0, "review": "great piece of hardware, so far no complains.", "verified": true, "helpfulness": "0/0", "author": "Osonyer"}, {"rating": 4.0, "review": "Very happy with this purchase.", "verified": true, "helpfulness": "1/1", "author": "Wellington Jackson"}, {"rating": 5.0, "review": "Loving Amazon Fire TV so far. It's only been hooked up a few days and no complaints so far.", "verified": true, "helpfulness": "1/1", "author": "aleida saadati"}, {"rating": 5.0, "review": "We lived without cable for over 5 years.  This was an affordable option that got us all the channels/services we wanted.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Rita"}, {"rating": 1.0, "review": "It has a very bad connection. The regular fire is perfect, we should have stayed with that.", "verified": true, "helpfulness": "1/2", "author": "cindermintgirl"}, {"rating": 3.0, "review": "I rate it 3 star because tv shows are only shown after the season. I've given up cable tv so this will have to do for now even though there is no comparison.", "verified": true, "helpfulness": "0/1", "author": "debra pettigrew"}, {"rating": 5.0, "review": "This box is fantastic. I highly suggest this box if you want high quality video streaming over WiFi. It's also great that it has an ethernet port for even better performance.", "verified": true, "helpfulness": "0/0", "author": "Zebulon S Canniff"}, {"rating": 5.0, "review": "I could not be happier with my purchase of the Amazon Fire TV unit. I've been a prime member for roughly 5 years now and the Fire TV gives me so much more access to free movies and TV shows that I would have to pay for on other units! I purchased the Amazon Fire TV about a year ago and cannot begin to tell you how many TV shows, that I never watched prior to purchasing this, that I was able to catch up on and watch them from the beginning of season 1. Some of these shows are now in their 5th or 6th seasons! The Amazon Fire is also great for families with little children (the password protected feature is awesome) as there are many, many shows for children in the unit. I've downloaded several screensavers that I swap out throughout the year. I have a fireplace during the Winter months that, other than the no heat, gives the impression of a real fireplace! If you are a TV buff and for the past several years have heard people talking about all the great shows on TV now you can certainly find them on the Fire and watch the past season.", "verified": true, "helpfulness": "0/0", "author": "John F"}, {"rating": 1.0, "review": "This has NEVER once worked for me.  my fault though for procrastinating and not returning it within the time frame.  Just will not turn on.Probably defective but I didn't realize that at the time. Now its too late. lost my $100.", "verified": true, "helpfulness": "2/4", "author": "Lois T. Davis"}, {"rating": 5.0, "review": "Super", "verified": true, "helpfulness": "0/1", "author": "Rafael Atiles"}]