[{"rating": 5.0, "review": "Must be good my daughter commandered it and she's an Apple user I haven't got to watch it", "verified": true, "helpfulness": "0/0", "author": "William Knasel"}, {"rating": 1.0, "review": "Very poor reception to the wireless router. All I got was the circle of death, hooked up the xbox at the same location and had no problems connecting to Netflix and other entertainment. I also brought in the ipad and still no problems. Called technical support and they were not much help. Sent the unit back for credit. I did like the controls and voice command, I wish Amazon would have came up with a solution.", "verified": true, "helpfulness": "1/3", "author": "D. Shriver"}, {"rating": 4.0, "review": "good player lacks of a decent youtube interface and apps", "verified": true, "helpfulness": "0/1", "author": "Jorge Gálvez Quintero"}, {"rating": 4.0, "review": "Great streaming media with lots of apps & function. Be even better if it played divx.", "verified": true, "helpfulness": "0/0", "author": "CityGrifter"}, {"rating": 4.0, "review": "I have not explored yet all the capabilities of the Fire TV (that's why only 4 stars!)Installation is easy and flawless.First use to access Netflix was very easy and fast (much faster than via my LG Blu-Ray player)Search via the voice command works pretty well. (even with my French accent)The remote is small, simple but very handy and efficient.What I did not explore yet is all that is available via Fire TV. (so far only Netflix and YouTube)", "verified": true, "helpfulness": "0/0", "author": "B. Guillot \"Papyguillot\""}, {"rating": 3.0, "review": "The button mechanism on the remote works fine scrolling right, but poorly scrolling left.  The menu and system is easy to use and pretty functional, but the one time I tried the voice command, it bombed (strangely, it appeared to convert the speech to text exactly right, but then couldn't find that text in the search (the text was an exact title of a tv show, which i found via browsing)", "verified": true, "helpfulness": "0/0", "author": "rob"}, {"rating": 4.0, "review": "It is a lot smaller than I was expecting!  Lots of apps and voice recognition is a little buggy but overall pretty decent.  Well designed UI and navigation is fairly easy.A few complaints however:1. I'd like to be able to browse the web with it, there is no browser app or any way to browse the web2. No HBO GO app.  I have the HBO GO app on amazon but I cannot use it on my fire!! WTF!", "verified": true, "helpfulness": "0/0", "author": "Matthew G."}, {"rating": 5.0, "review": "I got this on a whim, and love it!  It does take a connector that I didn't have, but my son was able to hook it up for me without any trouble!", "verified": true, "helpfulness": "0/0", "author": "J. Hartman"}, {"rating": 5.0, "review": "We all love this product.  It is very user friendly and works great with the Amazon videos and Netflix.", "verified": true, "helpfulness": "0/0", "author": "CWJI"}, {"rating": 5.0, "review": "Just purchased a few days ago works great free movies, sports and much more has replaced my apple tv easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Robert Juarbe"}]