[{"rating": 5.0, "review": "I bought this to replace a Roku 2.  The one thing which I noticed, and which one other reviewer has commented, is that the picture is MUCH cleaner than with the Roku 2.  Same setup, same cable, same TV, but sharper image for the exact same picture.  Audio is via the optical cable, very nice.  Got it mainly for the gaming, will report on that later, but in general, I am very happy with the device.  ps: when I set it up, Netflix wouldn't work.  I reported this via the help menu, an Amazon representative called me back within 30 seconds, and then talked me through the fix in a few minutes (I had to download a software update and reboot the device).  Most impressive to be able to talk to a person, never reached anyone so quickly with Verizon (ha!, takes half an hour).", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love the Amazon Fire TV. Very easy to set up and use.", "verified": true, "helpfulness": "0/1", "author": "Cheryl Reynolds"}, {"rating": 5.0, "review": "I have several Apple TVs and they work well.  But I have to say that the Amazon Fire TV is much faster and works great!  I will buy more as needed.  Seems to be very well made too.", "verified": true, "helpfulness": "0/0", "author": "Ripleyo"}, {"rating": 5.0, "review": "It's fast, easy to use and a lot of features I'm still discovering.", "verified": true, "helpfulness": "0/0", "author": "Tom Scholl"}, {"rating": 5.0, "review": "I love the Amazon fire TV. I have previously used a PS3 and the WII for streaming TV and this is so much better. The picture quality is better and it is so much easier to use. And if you subscribe to Amazon Prime you can use voice recognition that works very well. You can also listen to your music through this and on most songs the lyrics appear on the TV which is a really cool feature. It also has a lot of great apps. One of my favorite that I have found is an app that has a bunch of documentaries. The app is free. During the movies there are commercials, but they are not very long and for free what do you expect. Also I can control the videos from my Amazon fire tablet. So if I am in my room and my 5 year old wants a different cartoon on in the other room, I don't even have to get up. I just pick up my tablet and change it from there. I would recommend the Amazon Fire TV to anyone.", "verified": true, "helpfulness": "0/0", "author": "MATTHEW D MYRICK"}, {"rating": 5.0, "review": "Love it! I can't even think of anything else to say. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Megan Wilson"}, {"rating": 5.0, "review": "Absolutely love my Fire TV, I now can watch al my favorite movies on the go....the device is compact enough to pack in my suitcase, so when I'm at a hotel with limited channels I have my own movies.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"zelenia\""}, {"rating": 5.0, "review": "This was puchased after much research into all the different ways to stream movies to my TV.  I decided to go with Amazon because it is a trusted company and the content available with Amazon Prime is mind-boggling!  Easy to install, easy to use.  I think is meets my needs very well, indeed....now excuse me, Downton Abbey awaits!", "verified": true, "helpfulness": "0/0", "author": "Chris Crossland"}, {"rating": 4.0, "review": "Great little box. Streaming video and movies are seamless and clear", "verified": true, "helpfulness": "0/0", "author": "James Harris"}, {"rating": 5.0, "review": "This device is revolutionary... Amazon connects the entire world to you because Amazon is not limited to one single service like streaming in an explosively fast and simple to use device.  By fast, I mean faster than everything else including cable, satellite, or other similar devices.  The voice option that comes with the Fire TV is a must and makes life so much easier.  This device is small enough to be inconspicuous wherever you place it, yet large enough to be the device you use the most with your TV.  Combined with Amazon Prime, there is nothing you can't do.", "verified": true, "helpfulness": "0/0", "author": "Konstantine P"}]