[{"rating": 4.0, "review": "I am a man who loves gadgets.  And this little gadget is the most elegant most used gadget in my home.I used to use a Roku 2 in my home and thought man this is the greatest. Then it broke, and after I wept bitterly I ended up getting a Playstation 3.  The Playstation had the functionally of the Roku but with less channels.  (most I never watched anyways)When amazon announced the Fire TV I really wasn't too thrilled... I thought that my PlayStation does all that plus I can play games.  But after a few weeks I decided to buy the Fire TV and give it a chance.  I literally have not turned the playstation on since, other than the occasional blu-ray disc. (I don't game too often, and when I do its usually on the PC)I love the Fire TV.  I love how easy it is to use and to set up.  Originally my biggest gripe about it is that there is no off button.  But I got used to it. I love that I just have to turn off my TV walk away, and it will put it's self to sleep.  Its great when you want to get in and start watching you don't have to wait for a boot up. If your on the fence, come join us on this side of the fence.  It outweighs the competition with ease and power.  You will not regret it.", "verified": true, "helpfulness": "0/0", "author": "Kevin T Callison"}, {"rating": 5.0, "review": "I really am enjoying my new Amazon Fire TV.  I really wanted a smart TV for my bedroom and this was right on the money.  It is really easy to setup and control. I would recommend it to anyone that is looking to be able to access Netflix, and Prime instant videos.", "verified": true, "helpfulness": "0/0", "author": "Ke1982Ke"}, {"rating": 2.0, "review": "Pros:▶Great for Prime Music, strong connection and lovely variety included with my Prime membership▶Good but inconsistent for Instant Streaming movies. When a movie/show works it's very good, but shows often have serious problems. For instance, Amazon Originals new series \"Bosch\" has no audio on every episode. Same with \"How I Met Your Mother\". Yet it all works fine on my PS3 & PS4 Amazon App. Amazon has worsening quality control issues in every department and Fire brand devices are not an exception.▶Powerful enough to play big games (I assume; See Cons)CONS:▶This is its worst flaw by far - that you have about 4.5 GB of usable storage space. It makes you choose - do I want one awesome game like Deus Ex (almost 3 GB) and one medium game and no apps, do I want apps and a few small/medium games and no photos or videos? It's a nearly unusable amount of space. You thought the first Asus Google Nexus tablet was unusable after the OS update? Well, Amazon decided that Google ginormous mistake that destroyed the Nexus branded tablet's market appeal was a great idea? Let's repeat the same action and expect a different outcome, cause that's the definition of insanity and Amazon seems to like the idea of making high-risk business ventures based on the criteria of insanity. Due to the insulting lack of usable storage...DO NOT BUY A FIRE TV FOR GAMING, ITS 4.5GB OF USABLE STORAGE MAKES IT UNUSABLE FOR TODAYS ANDROID GAMER.My favorite game on Android is Bard's Tale - an action-rpg and the funniest game I've ever played. Guess what? If I erase everything on my Fire TV, reset to factory settings, the sub-5 GB of storage is STILL NOT ENOUGH FOR THIS ONE GAME WITH ITS HD TEXTURES PACK. That's right, the entire available storage is still not enough for one game with modern graphics. Play it in low res or don't play at all.Amazon clearly made the decision the fire TV should be 8GB from sitting in an Ivory Tower...I'm saying Amazon is totally out of touch when it comes to what Mobile device users want. Oh and you cannot use external storage - flash drive, etc. not accessible.▶Movie and show functionality is inconsistent, lots of technically broken series and shows in the Amazon library.▶ZERO reporting system. Wanna rate a show? Wanna report that Bought or How I Met Your Mother have no audio stream or that other series won't even play? Start up your computer, log in to Amazon, and write an email to the support team. Amazon has made technical issue reporting as much work as possible, most likely do they can publish statistics to shareholders and the public on how solid their software is. Or maybe they just don't want to know and don't want to be compelled to fix unplanned issues.▶Total lack of sort functions, no real organization in the UI. The UX (User Experience) is a clustermuck in general - all of my watching shows, movies, installed apps, purchased but not installed apps, installed games and purchased but NOT installed games are lumped in one long horizontally scrolling icon list - there's no way to sort it, organize or prioritize the list, or hide items that aren't installed. And every category (Amazon Fire TV menu system is a direct copy of the Netflix menu system layout-wise) is equally a mess with no ability to customise.▶Quality control issues are epidemic at Amazon lately - especially in customer service, support, and problem resolution (wanna talk to a poorly trained person in a Filipino call center with poor English skills? No? Well, you're gonna. Or Jamaica - same problems. They'll basically tell you they can't do anything).Example:I just sold a New high end smartphone (Nokia 1520) as an Amazon seller, got scammed and Amazon actually helped the  criminal commit fraud and steal, despite my detailed level of physical evidence I presented that he was stealing. They refunded the $300 sale price and he still has my property. An Amazon agent told me \"we may have made a mistake but there's nothing we can do now. You should try emailing him and begging for it back.\" I record all phone calls so I have that on record too. And seriously? We helped him steal but we won't do anything? Beg the guy who victimized me for my property back? That's insulting. And thats Amazon in 2015. AZ has all the integrity of Wal-Mart now. The last hope for a customer centric multinational has fallen prey to shareholders bullying and profit-over-ethics practices. We all knew it was coming. Amazon won't protect you nor will they enforce their own policies, I PROMISE YOU. Treat Amazon as any other online retailer, just don't make the mistake of believing in them. I was naive to trust they'd have my back.I recommend waiting for Amazon to realize how flawed this all is and release the Fire TV II with 32GB + storage. Until then, pass this up. Even at $89 sale price, you'll have no advantages over the phone, PS3, and PS4 apps. NO advantages. Gaming is mostly useless on this device and there's no access to Google Play store.", "verified": true, "helpfulness": "1/2", "author": "Solar Agility \"Solar Agility\""}, {"rating": 5.0, "review": "Performance and easy of use are fantastic! XBMC/Kodi can easily be sideloaded! I just wish they would let us use usb for external storage.", "verified": true, "helpfulness": "0/0", "author": "Kolja Klemkow"}, {"rating": 5.0, "review": "nice to have", "verified": true, "helpfulness": "0/0", "author": "ernie"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Gary Vermillion"}, {"rating": 5.0, "review": "It was very easy to install, and the voice feature is cool. With PRIME there are lots of free choices.", "verified": true, "helpfulness": "0/0", "author": "SNR330"}, {"rating": 3.0, "review": "Lacking a Internet Explorer App.  Therefore I gave it 3 stars because I can't stream everything I would like.  It's no better than the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 4.0, "review": "This is way snappier than the roku or Chromecast.  Sometimes it takes a few seconds for the HD pictures on Netflix to render. Every once in a while there is a little hicup in the delivery of the video.", "verified": true, "helpfulness": "0/0", "author": "HYPER1090T"}, {"rating": 5.0, "review": "Excellent product, with a great price.", "verified": true, "helpfulness": "0/0", "author": "Brent"}]