[{"rating": 1.0, "review": "The remote was the key reason I bought this.  The Netflix app is terrible.  You have to select how big to scale the picture, why isn't this done automatically?  It's HDMI?!  There are black bars on the outside of the picture so clearly the app is scaling to 16x10 and not 16x9 like is should be which is the HDTV standard.  So this is a lazy implementation of an app designed for computer screens on HDTVs.  I love the black bars.  It causes all sorts of pixelation artifacts and there appears to be no way to change it.So not only is the display quality awful but the kicker is the voice recognition DOES NOT work with the Netflix app.  Whole reason I bought the stupid thing.  When you do a voice search within the Netflix app it automatically searches PRIME content.  What the heck?  So now I get to hunt and peck a virtual keyboard just like every other poorly implemented Netflix app.  PS3/4 has a far superior interface sadly.The worst part was there was a stutter every five seconds in Netflix playback.  OK, why does this thing have a quad core processor if it can't even handle a single HD stream?  Almost certainly going back.", "verified": true, "helpfulness": "6/9", "author": "transientcylon"}, {"rating": 5.0, "review": "Best purchase I have made in a long time.", "verified": true, "helpfulness": "0/0", "author": "Roy W. Eddings"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jeff Hoff"}, {"rating": 5.0, "review": "This is by far one of the best (small) investment I've ever made! I enjoy it tremendously! All my entertainment at the touch of a button. It's simply perfect!", "verified": true, "helpfulness": "0/0", "author": "laurlaure \"laurlaure\""}, {"rating": 5.0, "review": "This was easy and works exactly as promised. I am a happy customer.", "verified": true, "helpfulness": "0/0", "author": "Blringer \"Barbara H P\""}, {"rating": 1.0, "review": "did not work for me", "verified": true, "helpfulness": "0/10", "author": "Jerry M."}, {"rating": 5.0, "review": "Best purchase I've made all year.  I waited until I'd owned the device for about 6 months before reviewing it.  Primarily use it for Prime, Netflix, Hulu Plus and Youtube videos.  But also play some games on it (Sev Zero and Minecraft are fun).  Several years ago I downloaded my entire music collection (10,000 songs) to Amazon, and when Amazon added music functionality I suddenly had the ability to play all of my music - love it!  Plus Prime Music is coming to Fire TV by the end of the year - 1 million more songs to choose from.  I have my phone set up to automatically upload pictures I take to the Amazon Cloud - these can be viewed on Fire TV as well.  It's the whole family's go to device for media consumption.  The only caveat is to make sure to have decent Wifi speeds - there can be some lagginess at lower speeds.  Just buy one - you won't regret it!", "verified": true, "helpfulness": "1/1", "author": "David F. Bates"}, {"rating": 4.0, "review": "The Amazon Fire TV is incredibly responsive and quick. It recognized voice commands from everyone in my family even down to a 4 year-old. It's an impressive gadget.I only tried it out for the 30-day trial period that Amazon offered Prime subscribers. I did not like the fact that there is not a way to filter for Prime only listings as of the time of this review. Other than that, I found that the other features (Pandora, Netflix, Hulu, etc) it provided are mostly readily available on my Blu Ray player and most of our movies and TV shows are purchased through Apple. If I solely purchased digital items through Amazon, this might be a better option.", "verified": true, "helpfulness": "1/1", "author": "Nancy"}, {"rating": 5.0, "review": "Can't wait to see what follows this. It is amazing to say the least!", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 3.0, "review": "I have a question.  My husband ordered two of the Amazon Fire TV and paid for them with his card.  I have prime in my name.  Can we set it up so it will work with my prime?  He believes that there has to be a way because if he bought it for a gift they would have to be able to set it up for them.", "verified": true, "helpfulness": "0/0", "author": "Crystal Roder"}]