[{"rating": 5.0, "review": "I Love my Amazon FIRE!!! Wish I could watch my NFL???!! I need to watch my live games...GO BEARS!!!!", "verified": false, "helpfulness": "0/0", "author": "Jose R. Javier"}, {"rating": 5.0, "review": "Much better than AppleTV!!!", "verified": true, "helpfulness": "0/0", "author": "Shaggs"}, {"rating": 5.0, "review": "Wonderful addition to our home!  Has everything we need! Took out of the box, plugged it in and voila!!!", "verified": true, "helpfulness": "0/0", "author": "Michele Kocinski \"mmkocinski\""}, {"rating": 3.0, "review": "Could not get netflix. very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Ernest C. Vieira"}, {"rating": 1.0, "review": "no it was a total rip off!the only reason I got it was so I didn't have to type on that stupid keyboard on my roku or apple tv anymore. i saw blogs and news reports back in May that announced amazon was fixing the voice search problem this summer. well now its fall and the only thing the voice search searches is amazon! so I can only use it 20% of the time. I still have to type in all my other app!But that's not the worst part. most of my apps do not work and crash constantly. the customer service was terrible and I found the solution online myself but the fix involves clearing data, deleting the app re-installing re-signing in, confirming your device on your computer with a password, blah blah blah. I should be able to turn the tv on and it works. not re-set up all my apps every 3 days when they crash and need to be re-set!all this being said it works great for amazon but don't buy it unless you also have a roku or apple tv to watch anything else you might subscribe to.", "verified": true, "helpfulness": "0/2", "author": "costomer"}, {"rating": 5.0, "review": "I bought this for my daughter .love that it put me in control on what I want my daughter to view by password enable  just love it .Easy to set up  .Thank you Amazon for this great product .", "verified": true, "helpfulness": "0/0", "author": "susan  morreira"}, {"rating": 5.0, "review": "Incredible product! Love the fact that it's quad core and has both wired and wireless internet connectivity. I am considering getting rid of my satellite TV service as this is far superior. The user interface with voice search works really well. Bravo Amazon!", "verified": true, "helpfulness": "0/0", "author": "Mo."}, {"rating": 5.0, "review": "So simple, even I could install and use it!", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "I absolutely love my Fire TV. It is compact so it doesn't require much space on your entertainment console. The streaming is fantastic - it is incredibly fast and the picture quality is excellent. I would highly recommend the Fire TV to anyone. I also got one for my grandparents because it is so easy to use. It has a great range of applications so you can watch from nearly every service and you can also play video games from a huge library. Set-up time is less than a minute. This is by far one of the best purchases I have made on Amazon.", "verified": true, "helpfulness": "0/0", "author": "kems1992"}, {"rating": 5.0, "review": "great device to use with kodi (aka xbmc).", "verified": true, "helpfulness": "0/0", "author": "forty0z310"}]