[{"rating": 5.0, "review": "New to streaming, but I really love this product.Would recommend to anyone.", "verified": true, "helpfulness": "1/1", "author": "S.B."}, {"rating": 5.0, "review": "Love it compared to Apple it has  much more and was very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Sandra M. Woolf \"s.woolf\""}, {"rating": 4.0, "review": "The system is very good in terms of speed and streaming. With Amazon Prime there are many benefits, particularly the 2nd day shipping perks. In terms of content, it would be nice to have more free movies versus on demand films. Also, the gaming content could be expanded and access to free games and the google playstore would be a plus. Also, the game controler for the system is on back order and third party controlers are also hard to find and/or pair with the system. In general, the searching functions for video and game content could be improved so you could filter for things like prime free videos, videos by date of release, and similar features for game searches. All in all, though, I like the Amazon Fire TV box and find it easy to use.", "verified": true, "helpfulness": "1/1", "author": "Poseidon"}, {"rating": 4.0, "review": "Really enjoy the Amazon series.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A little hard to connect, but on certain that was done it was great. The speaker is really cool. I discovered that my amazon fire phone photos showed up, which a lot were videos of our puppies so we had many laughs as we played them and one of our puppies actually watches TV.", "verified": true, "helpfulness": "1/2", "author": "Kim M Deitch"}, {"rating": 4.0, "review": "I'm writing the review hoping that Amazon sees it & adds a feature I'm requesting.....First, this is a solid box. I've tried just about every media streamer out there & this is hands down the easiest to setup & use. The system is crisp & smooth. It's a nice media hub that can play games. Really cool to have my Prime movies, Netflix, HBO Go, etc. Amazon has added their Prime Music since I bought mine & it's a nice addition. You can play a lot of Prime music free along with your own purchased music. Now, one of the areas it's lacking is the ability to play your home media, like ripped DVDs or Blu Rays.  It doesn't seem to have the ability to render M2TS files, you could use Plex but your Plex server would be doing the rendering. This was a sore spot for me for a while until I discovered I could side load XBMC (Kodi). It is SWEET. This pretty much put the box at 5 stars for me....however....I noticed the video output was not as crisp & vivid as my Xtreamer Sidewinder. The video output seems a little flat. I had noticed this while streaming Netflix & Prime videos. I gave it  a pass because I really had nothing to compare the quality to. The Blu Ray rips however I could compare the quality. I tried going into the settings on the box & found there's nothing to really adjust the output (picture) of the box. Like if we could boost contrast or color etc. I'm fairly certain the hardware is capable of better video output. Perhaps an update could address this by making the output performance better or add some adjustable settings for the video output.FYI - I also have a FireTV and that far & away whips any other stick device out there & you can side load XBMC on it also :)", "verified": true, "helpfulness": "1/2", "author": "J. Valencia"}, {"rating": 4.0, "review": "Wish that better instructions came with fire tv and thst it offered live tv streaming of abc,nbc & cbs", "verified": true, "helpfulness": "0/0", "author": "DONALD THOMPSON"}, {"rating": 5.0, "review": "This is amazing, great connectivity and also fast streaming.", "verified": true, "helpfulness": "0/0", "author": "Priyanka"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Eve2014"}, {"rating": 5.0, "review": "Amazon Fire TV is great. More movies than we can ever watch!", "verified": true, "helpfulness": "0/0", "author": "James E. Davis \"Jim Davis\""}]