[{"rating": 4.0, "review": "My experience:I bought the Amazon Fire TV after having a bad experience with Roku 3 connecting to my Comcast router-model combo (the Roku devices have a known problem with these devices, yet Comcast refuses to change them). After spending a few hours with Fire TV I'm sold. I will say I am hard to please with technical devices. I greatly appreciate when a company puts a lot of work into R&D.; I'm a big believer in quality design across the board. From unboxing, to connecting to everyday use. It should be intuitive and effortless. The Fire TV delivers in all areas. What I love most about this device is its speed. It's fast, lighting fast. My girlfriend who had a Roku before commented \"this feels like we're watching live TV, it feels more like a cable box\" I explained that's because the buffering of content is very fast and the menus have no stutter whatsoever. It just works and it works very well.Why I favore Fire TV over the competitionAs far as the Roku 3 vs Fire TV debate goes. The bottom line is the Roku 3 has more channels to pick from. I took  close look at those channels and determined a good number of them (e.g. HBO Go, etc...) require a cable subscription to that service to activate the app anyway. The apps I want (Hulu Plus, Netflix, Amazon Prime and Amazon Instant Video Rentals, Smithsonian, PBS, Documentary and Indie Film channels are all here and they work great. if you care about performance you will favor the Fire TV. Next the voice control here works very well. The recondition is near flawless. It's not just a novelty, the voice search is something you'll find yourself using and it gives the Fire TV a real advantage over the Roku 3. The game support was a feature I didn't give much attention to but having played them I am impressed. It delivers 1080p 3D gaming comparable to previous generation consoles (think somewhere between a Nintendo Wii and a PS3). The OS here is Fire OS which is a fork of Android. So Android games can easily be ported to Fire TV.  I only wish Amazon had worked harder to integrate voice search into other apps. It does work with more than just Amazon's catalog but not all apps support it.", "verified": true, "helpfulness": "1/1", "author": "Jeremy Deats"}, {"rating": 5.0, "review": "I have used both Apple Tv and Roku. Amazon Fire TV is better in every way.The Interface on the Fire TV is much better than the others. It is easy to find what you are looking for and I love the display. I wasn't too impressed with the displays of both the Apple TV and Roku.The voice search is seamless, although it only works for Amazon content at the moment (which is fine with me because it's all I use), The voice recognition is more accurate than on my iPhone. Siri always misunderstands what I'm saying, but not the Fire TV.The speed is greatly improved over Roku and Apple TV. There are fewer instances of pausing to buffer. Also, I had a minor issue one day and called Amazon support. They were very helpful and resolved the issue no problem.", "verified": true, "helpfulness": "1/1", "author": "Stephen Willis \"SRW\""}, {"rating": 4.0, "review": "It's the most powerful, but amazon needs to loosen up control a little.  It's a solid platform, but voice search only works for amazon and Hulu.  Sideloaded apps don't show up except for within the settings menu.  Maybe if XBMC/Kodi makes it into the amazon app store it will get better.  I guess we will just have to wait for developers to migrate.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "a ok", "verified": true, "helpfulness": "0/4", "author": "Dewey E Willis"}, {"rating": 5.0, "review": "is it free", "verified": false, "helpfulness": "0/9", "author": "R. Daley"}, {"rating": 2.0, "review": "This is a pretty good device when the remote control works. It has only worked for about two hours of the time I have had it. I am a big AMAZON fan so I though it would be awesome. After having intermittent problems at first, the remote finally just stopped working. I have tried to find an app to take its place and there is not one. After spending over hours searching the internet for help and eventually spending 30-45 minutes on the phone with amazon support, the person decided it is okay to send me another remote but she won't be doing that until 24-48 hours after I receive an email from the  \"other team\" which won't be coming for another 24-48 hours... so the first whole week or more of having this, I won't be able to use it. AMAZON,Please give us an app for this to offset the horrible remote controls.", "verified": true, "helpfulness": "0/5", "author": "MrWoodle \"-W\""}, {"rating": 4.0, "review": "I don't like that it doesn't link with my computer to play the movies I already own. Amazon definitely needs to fix this issue. I do like the interface, but don't like how search doesn't cross platforms (like Netflix).", "verified": true, "helpfulness": "0/1", "author": "Taylor H."}, {"rating": 5.0, "review": "Loads video fast; needs more apps like Daily motion.", "verified": true, "helpfulness": "0/3", "author": "Rodney W"}, {"rating": 3.0, "review": "still undecided, it's very sleek and easy to use, but the movie selection seriously lacks, and accessing prime free movies and tv's is no small feet.  You have to pretty much visit amazon online and troll through their library to find much, or scroll through the 100 titles or so you see on the fire tv screen.  Mostly it's set up for you to spend money buying movies and tv.  It's ok, I've used it with PBS and it streams incredibly slowly, I haven't tried much else yet.  It's neat and works great but it still seems more of a novelty thing right now.  I will say I love the voice search option but wish it worked for things out side of amazon as well.  I'm giving it only three stars mainly for the lack of content but the device itself probably warrants 4.5 stars for ingenuity and ease of use and set up.", "verified": true, "helpfulness": "0/2", "author": "Mark Merris"}, {"rating": 5.0, "review": "Amazing! I love it. I watch it every day!", "verified": true, "helpfulness": "0/0", "author": "Catrinia Paulson"}]