[{"rating": 5.0, "review": "Love it!!! Bought second one for  another location.", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 5.0, "review": "LOVE IT! A little hard to manage in the beginning, but now it's great!", "verified": true, "helpfulness": "0/0", "author": "T Dias"}, {"rating": 5.0, "review": "Exactly as described. Awesome", "verified": true, "helpfulness": "0/0", "author": "marty teater"}, {"rating": 5.0, "review": "I absolutely love my Amazon Fire TV.Having recently moved and previously paying a fortune for TV (Comcast) and only watching two programs a week, I decided to cancel my TV subscription and buy a Fire TV box. I already have UK TV box which I pay quite a lot for in the USA and tend to watch more UK TV than US TV.I like watching the movies on the Fire and catch up on some of the TV shows I missed somewhere along the way.Only had it for a few weeks but thoroughly enjoying it ad free.The only downside is there are no live news channels but I tend to watch UK news anyway because US news is atrocious.Would love the Amazon Fire TV more if I could receive BBC / ITV / C4 on it, but not in the US sadly.", "verified": true, "helpfulness": "0/0", "author": "Amanda J. Brett"}, {"rating": 5.0, "review": "Easy to install!  I was viewing my first movie in 3 minutes!  I  love Amazon Fire TV !  I look forward to when HBO NOW is offered!", "verified": true, "helpfulness": "0/0", "author": "Christina A. Mason"}, {"rating": 5.0, "review": "I haven't had it long, but so far I love it !!!  It puts me in charge of what I watch, bur more important When I watch.", "verified": true, "helpfulness": "0/0", "author": "steven schroeder"}, {"rating": 5.0, "review": "Love this!!  I don't know how it compares to things like Apple or Google TV, but I like that it gets my Amazon Prime shows, Amazon Music, and all the other apps it has.  I also like the voice search - works very well for me, although I have read others have had problems. I also like that the remove is not bulky - but be careful, easy to lose in the couch because of that - slim.  The laziness in me is considering getting the Fire Stick for my other TV so I don't have to move this around!  Very pleased with this item and would highly recommend!!", "verified": true, "helpfulness": "0/0", "author": "MJ Amazon Customer"}, {"rating": 4.0, "review": "The Fire TV was easy to install and I'm loving all the features, free movies, music and simple interface - this thing even has a screen saver that comes on when you're listening to music! We've always just had our Comcast cable service without DVR and occasionally used Comcast OnDemand to watch/rent movies - but I'll never watch from Comcast again. The voice recognition software is amazing and brought me to exactly what I was looking for every single time I searched.", "verified": false, "helpfulness": "0/0", "author": "Villacis Wareheim"}, {"rating": 5.0, "review": "This TV is the greatest option on the market! Great graphics GOTTA LOVE AMAZON!! WWOOOT!!", "verified": false, "helpfulness": "0/0", "author": "Timo malepeai"}, {"rating": 2.0, "review": "Confusing to use, slow, and poor support.", "verified": false, "helpfulness": "0/0", "author": "J.B."}]