[{"rating": 2.0, "review": "Unfortunately, this product does not view Netflix streaming video correctly. The video and audio are almost constantly out of synch. Returned it for a refund as netflix is more than half of my viewing.", "verified": true, "helpfulness": "0/0", "author": "Bill Barker \"Bill Barker\""}, {"rating": 5.0, "review": "Everything I hoped it would be.", "verified": true, "helpfulness": "0/0", "author": "Dawes Dunham"}, {"rating": 5.0, "review": "Makes life in Korea much nicer. Works well with our DSN service.", "verified": true, "helpfulness": "0/0", "author": "Jen Riser"}, {"rating": 4.0, "review": "Less than 6 months. Changed batteries and now I'm ordering a new controller. First the voice search quit then the controller.. I'll keep ya'll posted on how long the new one lasts::: One year warranty. Didnt have pwrk  so when I made this review Amazon caught it and is sending me one to replace it without asking and crediting me for my purchase.... Talk about on the ball...", "verified": true, "helpfulness": "0/0", "author": "brian rezek"}, {"rating": 5.0, "review": "I'm coming up on one year of use in April and I gotta say...this thing is AMAZING It's super fast and easy to use. I play games, watch movies (prime/netflix), listen to music (amazon and pandora), and can see all my phone photos/videos on my TV (unlimited photo storage for prime members). Amazon has upgraded the interface  a few times and is consistently adding new Apps( history channel, etc) that make this my go to device for all my electronic entertainment. Every time I show guests what it can do they are amazed and want one too", "verified": true, "helpfulness": "0/0", "author": "Sailingtime"}, {"rating": 1.0, "review": "I could not get past the second step of the setup process, even after calling Amazon multiple times today.For whatever reason it will not connect to my modem with an Ethernet cable. My ISP confirms everything is fine on their end. An Amazon rep created a tech ticket for me this morning and said they would get back to me  because it was an issue the developers had to look into. It's a real drag that I went through setting up internet service in my home, solely to use this device and for it not to even come on. I did buy it refurbished,  maybe that is part of the problem...", "verified": true, "helpfulness": "1/2", "author": "Green3000"}, {"rating": 2.0, "review": "It is a great product, but I just didn't feel it was worth the money for me because of the small amount I watch TV.  I ended up getting the fire stick instead and I could justify the expense for my 2 hours of tv per week.", "verified": true, "helpfulness": "0/0", "author": "Phillip Turner"}, {"rating": 5.0, "review": "I love this box. Better than the Apple, has everything and more!!!", "verified": true, "helpfulness": "0/0", "author": "Cindy Wilson"}, {"rating": 5.0, "review": "Love it but save you money but a firestick..has everything except voice command and that only works with prime not hulu, or netflix", "verified": true, "helpfulness": "0/1", "author": "Randall Schwartz"}, {"rating": 5.0, "review": "small but powerful.. i got everything i want in that small box", "verified": true, "helpfulness": "0/0", "author": "tripond"}]