[{"rating": 1.0, "review": "You can't watch nothing without paying . But streams fast videos on nettflix", "verified": true, "helpfulness": "2/8", "author": "Ernesto"}, {"rating": 5.0, "review": "Very easy to use.  The audio search seems very precise.  Speaking \"Gary Busey\" actually brings up Busey movies.  It seems to function as advertised.  If you have a wifi connection and the price is okay with you, you shouldn't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 2.0, "review": "Returned it. Too \"AMAZON\" proprietary. Picture was great but the roku 3 we bought instead and it is just better navigation and the picture is close to the fire.", "verified": true, "helpfulness": "7/7", "author": "Amy Coster"}, {"rating": 3.0, "review": "Wish the layout was more like Apple TV,  fire TV movie listings are too small.", "verified": true, "helpfulness": "1/1", "author": "John Rose"}, {"rating": 4.0, "review": "As expected..used to apple tv and this is pretty much the same, pleased with product", "verified": true, "helpfulness": "1/1", "author": "Billybraveheart"}, {"rating": 5.0, "review": "I thought that Netflix had the market cornered on free home movie viewing, but Amazon Fire TV is the new leader in my house.  I thoroughly enjoy the amount of available movies by genre and I can put the ones I find on-line in my WatchList!  Absolutely recommend that all who have Prime membership enjoy this to the fullest and take advantage of what Amazon offers...Never been more happy with the amount of choices...Thank you Amazon!", "verified": true, "helpfulness": "1/1", "author": "RandellB"}, {"rating": 2.0, "review": "returned - didn't use it - after reading it thought that it was not worth it", "verified": true, "helpfulness": "1/7", "author": "mek"}, {"rating": 3.0, "review": "Had to do a complete system update before it would work properly, but tech support didn't know that. They were completely clueless. I had to figure it out myself. If you're going to purchase this, update it right out of the box. You'll save yourself a headache. As to Amazon available content, it easily beats Netflix and Hulu Plus.", "verified": true, "helpfulness": "7/7", "author": "Excalibur"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Julie F."}, {"rating": 3.0, "review": "Good, just doesn't. Work like I thought it would", "verified": true, "helpfulness": "0/1", "author": "Kimberly Herbert"}]