[{"rating": 3.0, "review": "Love everything about the FireTV. The only problem I have is the fact it doesn't track consistently from unit to unit, and gets stuck a lot..never on AD's only on the actual shows.", "verified": true, "helpfulness": "0/0", "author": "Candria"}, {"rating": 5.0, "review": "very easy to install and easy to use!!", "verified": true, "helpfulness": "0/0", "author": "Connie McCarty"}, {"rating": 3.0, "review": "The main reasons i bought this unit over the Fire Stick was the parental controls and voice search.  I was disappointed as the parental controls are geared for small children all i wanted was to be able to set on and off times for my teenagers.  If you use the parental controls you can't do that you have to restrict content including prime and for more advanced features there is a monthly fee.  The second reason was the voice search but what it does not tell you is the voice search is limited to Amazon Products, no Netflix, Hulu Etc.  Overall it is a good product but i could have gotten the same results with a Fire Stick for less money.  I hope they read the review and make upgrades.", "verified": true, "helpfulness": "0/1", "author": "BCC \"Bill\""}, {"rating": 5.0, "review": "I like this because of the voice prompt.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Why no Vudu app?", "verified": true, "helpfulness": "0/0", "author": "brenton"}, {"rating": 5.0, "review": "Easy to use and the voice recognition is fun", "verified": true, "helpfulness": "0/0", "author": "jim holbrook"}, {"rating": 5.0, "review": "This is a very easy to use product, especially for those with a Amazon Prime membership.  I don't like that there is no easy way to delete viewing history.  You must do it item by item.  Also it would be nice to be able to turn off recommendations.  They often just clutter the screen and are of no value.", "verified": true, "helpfulness": "0/0", "author": "Thomas J. Carter"}, {"rating": 5.0, "review": "I am enjoying the Amazon Fire lineup.", "verified": true, "helpfulness": "0/0", "author": "Mitzie"}, {"rating": 5.0, "review": "Fantastic device! Love it more than Apple TV. More options and the same price. This is the better investment for your home or personal use.", "verified": true, "helpfulness": "0/0", "author": "Tolima Colombia"}, {"rating": 5.0, "review": "Like Magic .. This little gizmo was super easy to set up, delivers everything as promised, and works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]