[{"rating": 5.0, "review": "If you can connect to the internet via wireless from home, this is the best way to watch movies.  Say the name of the movie you are looking for .... choose it from a menu, then start, stop, fast forward (or reverse) to your heart's content.  I was amazed to find that video quality is very good - more reliable than viewing YouTube videos on my PC, which is connected directly to my router by an ethernet cable.After you have set it up (equivalent to connecting your laptop to a wireless network), it couldn't be easier to use.  Just set your TV to use the HDMI input, then control it with the remote.  (Voice remote recommended!)I have noticed that once every two or three days, it loses its connection to the internet ... but turning it off and back on (by unplugging it) quickly fixes that.If you already have Amazon Prime, Fire TV is a must!", "verified": true, "helpfulness": "1/1", "author": "Timothy E. Fremouw"}, {"rating": 4.0, "review": "We are overall happy with this box, it's very small and easy to set up. The only downside is that not every movie or show is free with prime membership and some costs $2.99 per episode which is too expensive. But there are plenty of free movies and shows to keep you busy for long time.", "verified": true, "helpfulness": "1/2", "author": "Oksana"}, {"rating": 4.0, "review": "i returned it  it worked great but was what thouth", "verified": true, "helpfulness": "0/3", "author": "JAMES DAVIS"}, {"rating": 5.0, "review": "easiest to install and works just like advertized", "verified": true, "helpfulness": "0/0", "author": "lorrie shue"}, {"rating": 5.0, "review": "Absolutely love it. It is so easy to use and offers lots of choices.  In addition I can add Netflix or any of the other streaming companies.  The Shows produced by Amazon have been very good. I would recommend it to anyone who wants it to see movies.  I do not know how the gaming works.", "verified": true, "helpfulness": "0/0", "author": "Loretta From Virginia"}, {"rating": 5.0, "review": "I love this.  Easy to use.  I use it almost every day.  It allowed me to \"binge watch\" Downton Abbey.  If you have Amazon prime, there are many free tv shows and movies.", "verified": true, "helpfulness": "0/0", "author": "nrslynn9"}, {"rating": 5.0, "review": "I have been watching Amazon prime tv/movies on my kindle for a few years.... it's soooo much nicer having on my actual tv! Love it!! The kids really enjoy all the different movies and shows, too.", "verified": true, "helpfulness": "0/0", "author": "L. Koopal \"freddykooper\""}, {"rating": 5.0, "review": "I recently returned the Fire TV Stick and replaced it with the regular Fire TV box. I'm much happier with the box. It's very small and compact. I was able to easily hide it behind my cable box out of sight. Amazon does not make it clear that with the TV Stick, the USB requires a small power cable. This disappointed me as I had an ugly cable sticking out from behind my TV, and all of my other cables had already been hidden in the wall. Additionally, the TV Stick had very poor reliability and poor Wi-Fi signal reception. This regular Fire TV has none of those issues. I ran the HDMI cable directly into an HDMI port on my Blu-ray player and therefore I am able to view the shows with surround sound. Because I was able to run it through the Blue-ray player, I also easily hid the cord. The remote control is easy to use and I love that it does not require line of sight, so you can pretty much hide the box wherever you want to. The Amazon original content is pretty good and will only get better, especially now that they have released something like 15 pilots. The popular ones will be made into full series, so it should be fun to experiment with the different options to see what they come up with. I am a huge Michael Connelly fan and was particularly happy to (finally) see a TV adoption of the Harry Bosch series. Overall, a good purchase that I am very happy with and definitely recommend, especially compared to the TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "I bought FireTv  for 80$. I am very much happy with it's features and performance. I have been using Kodi (XBMC) in two Raspberry Pis. Now I  set up Kodi in Fire TV. I am really impressed with the performance, as it is more powerful than Pi. I am still using Pi ( RASPBMC and OpenElec).  If you are prime member, it is more advantageous. I am mainly using this for Kodi.  Cons:  It does not support external hard drive (thru USB).", "verified": true, "helpfulness": "0/0", "author": "Mogaram"}, {"rating": 5.0, "review": "I love this device. Having previously used numerous devices from game consoles to Apple TVs to run XBMC and serve my media throughout my house I was reluctant to purchase another piece of equipment. I read that specs and saw that others had found a way to run XBMC on the Fire TV. I purchased one and found installing XBMC as easy as downloading an installer to my computer and sending the files wirelessly to the Fire TV. The box has a nice interface and is extremely fast, so fast that I purchased a couple more and replaced my Apple TVs through my house. I highly recommend to anyone familiar with XBMC and looking for the best device to run it.", "verified": true, "helpfulness": "0/0", "author": "mqueen"}]