[{"rating": 5.0, "review": "We have two TV areas in our house and currently stream video in both rooms using either a dedicated media computer or a Blu-Ray DVD player with 'Smart-TV' features.  Will Amazon Prime let us register two Fire TV devices to the same account?", "verified": false, "helpfulness": "6/59", "author": "Thomas C. Rice"}, {"rating": 1.0, "review": "Okay, I didn't read anything on the page, I watched the commercial, and I have no idea what the hell this does.  I know that Amazon was desperate and used Gary Busey of all people.  You don't even see the device until the end and all it shows is what Xbox one can do with the speech thing.  The worst commercial ever with no content at all.  Makes me not want to buy it on principal.", "verified": false, "helpfulness": "18/423", "author": "Tricia scharnberger"}, {"rating": 3.0, "review": "If the Amazon Fire TV included HBO GO, I would buy it today! This is must have to compete with Apple TV.", "verified": false, "helpfulness": "4/119", "author": "David Emanuel"}, {"rating": 5.0, "review": "I wonder if most of the reviewers did the feature comparison chart showing the various other devices.  From what I see on that chart, this device trumps them all.  Love the voice activated search feature!!!!  Would love to get this product, but we already have 3 ROKU's on 3 different TV sets and they're still working....  Can't justify the cost to replace at this time.  But will definitely put this on my wish list for the future.  I will, however, highly recommend this product to a friend who presently accesses Netflix through her enabled DVD player and has nothing but issues with delayed streaming, extensive buffering, etc.  Not to mention the DVD player does not support a lot of the streaming services, including Amazon.", "verified": false, "helpfulness": "6/69", "author": "ladydi100"}, {"rating": 5.0, "review": "People, this product is just a beginning. Amazon's programmer will add more content like Apple TV. Are you really believe they won't? You just need to wait!", "verified": true, "helpfulness": "12/59", "author": "Oksana"}, {"rating": 5.0, "review": "This is the way of the future to watch TV, I'm glad Amazon has stepped up to meet the needs- Thank you", "verified": false, "helpfulness": "9/66", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I love Amazon but FireTv is not about the customer and more about the sales. You are limited to one row on the home screen with a Prime membership. Now that HBO Now is on Apple TV, I regret buying this device and am strongly considering buying Apple TV as a replacement. I use my Roku and I love it.", "verified": true, "helpfulness": "7/122", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I may be the only person in the world that cares about this, but I would like a section where I could browse my 100's of ebooks. I can't fit them all in my kindle storage space. It would  be nice to browse through the book covers in the big screen, to help me decide what my next reading will be and yes to show off to my friends, especially to show off  my History/Military History's ebook collection. ;)", "verified": true, "helpfulness": "34/105", "author": "QBA"}, {"rating": 1.0, "review": "They just had to try and rip off the Apple TV. How lame of amazon. When has amazon ever been original? They see someone else's good idea and want to try to make money off of it. Seriously? If amazon wants to be great then they need to be original.Every time I've purchased an amazon device I've been very dissapointed with the quality. I'm very happy with my Apple products.", "verified": false, "helpfulness": "19/446", "author": "Luke"}, {"rating": 2.0, "review": "this may have been addressed in another comment but the preview has HBO shows in the video but this doesn't offer HBO Go? how is that possible?...oh wait I know you can buy those episodes on Amazon :)", "verified": false, "helpfulness": "15/180", "author": "mark Korolishin"}]