[{"rating": 5.0, "review": "Worth the money", "verified": true, "helpfulness": "0/0", "author": "Allan"}, {"rating": 4.0, "review": "Love all the options, but the home screen is confusing.  The fire stick looks simple, but it, too, took some getting used to.  I LOVE having captions on my Amazon movies on the TV.  The captions would show on the computer but not the TV.  The price is right for all of the extra sports channels we are getting.  We've never had cable, so this is a lot of fun.  Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "DCM"}, {"rating": 5.0, "review": "Very happy with Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Sassy1teresa"}, {"rating": 5.0, "review": "Super speedy.Voice search is spot on.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey L. Whitney"}, {"rating": 3.0, "review": "I've had this device since November. In the beginning it was love at first sight. It was responsive, vibrant, exciting, easy to use and set up. Now, 6 months later, I want a divorce. There is no sound 99% of the time, it flashes angry messages of \"network connection lost\", tells me prime and netflix are unable to stream at this time....I've coddled it by troubleshooting, checking my network connection (where it states my signal is \"very good\"). I've signed back into my internet by dropping the connected network, no luck. I've taken it off life support by unplugging everything and plugging back in. I've changed the batteries in the remote, blessing each AAA power source before closing them into their snug little home. The only thing that seems to bring life back into this love affair is restarting the whole system - several times a day. I've not had any luck our counselor, Customer Service. I've taken care to ensure it's dust and hairball free, triple checked all connections and cords (all Amazon Basics) and regularly check for updates in case I've neglected it in some way..... *le sigh* I'll still cling to the hope that there's a chance Fire and I can rekindle our love (I thought I'd never recover after Timberlake and Spears broke up), but until then I'll stock up on tissues and Blue Bell. Oh wait....another dagger in my soul!", "verified": true, "helpfulness": "2/2", "author": "monica way"}, {"rating": 5.0, "review": "Set it up with our home network.  Took about five minutes.", "verified": true, "helpfulness": "0/0", "author": "Kelvin C."}, {"rating": 5.0, "review": "This item has been excellent for us.  I rarely give 5 stars, but this time it deserves them.The only complaint I had at the outset was that it was so difficult to turn the thing off (navigating the menus), but a recent automated software upgrade took care of that.  Others must have complained about that as well.  Now I hold down the home button and it goes right to sleep.  Perfect.  The buttons are very sensitive, so if you lay your paperback book across it while watching Dish TV, the TV will instantly change sources and switch to the FireTV.  I just have to keep it well out of the way.The rubbery surface is fairly easily gripped or the shape of it would make it want to 'squirt' out of your hands.When you start FireTV, it also turns on your TV and switches HDMI source to FireTV (see above).  I wish my Dish remote switched it back as easily.  I always have to hunt down the Samsung remote.In the device upgrade, they say they included Bluetooth but I haven't used that yet.  I wish it worked for the whole TV.", "verified": true, "helpfulness": "0/0", "author": "GMcCoy"}, {"rating": 4.0, "review": "Just as Amazon intended, the Fire TV box is the natural stepping stone streaming device choice for consumers who have Prime, even if they don't have other Amazon mobile devices. However, it isn't yet the Apple TV (or Roku of G-Box) killer. It is worth consideration by anyone who does a lot of home digital entertainment streaming, due to its faster processor and storage that the other brands do not deliver. Both are essentials and a smart move by Amazon.Backstory: We are cord cutters a/o 3 years ago and cannot imagine ever signing on for the misery of Comcast and other predatory cable companies. For the past 9 years, we've also been device streaming users, beginning with the 2006/2007 Apple TV1 that had 160 gb storage, a USB port and lots of horsepower. But the digital world rapidly moved on and an old OS Tiger system doesn't cut it in today's 1080 compressed data world, even with the addition of a Broadcom crystal chip. The subsequent ATV2 is what all other manufacturers have used as their template to build upon. It was stable and the iOS could be jailbroken for backloading with a ton of great content, like XBMC, Navi-X and unlocked international media channels. Apple put a stop to that with the next gen Apple TV 3, which is why it hasn't sold as well and why Apple left their ATV product line to age and mold over 5+ years, instead of simply adding the kind of storage and processor that Amazon did to their Fire TV. The ATV is still the more intuitive, feature-rich and an overall better design, with the added functionality of iTunes. The door was left open for Roku, G-box and Amazon to walk through, so they have. Of those 3, I'd pick the Amazon Fire. It not only has the Prime content feature but also a decent interface, a USB port, the OS ability to *easily* hack and sideload a lot of Android apps, including media player portals, such as the invaluable TVaddons (Kodi is okay, but TVAddons is more flexible and customizable on the Fire. Hint: Navi-X runs better with TVAddons on the Fire). We have the ATV2 sitting on top of the larger Fire box. They serve different purposes for streaming of different entertainment. I don't ever see that changing, as we always will be primarily Mac and iOS. If an Android user is looking for an all-in-1 streaming device, then the Fire is a good choice. However, I wouldn't even consider it were it not fairly easy to sideload apps and content in addition to what's available from Amazon in the way of media, apps and games.", "verified": true, "helpfulness": "0/0", "author": "mareem"}, {"rating": 2.0, "review": "Have had frequent problems with the Fire TV unit since I got it,  Has trouble recognizing the remote, frequently resets while searching programing, and now, 2 months later... it will not recognize the remote at all.  I have had to use my fire card instead that I have for another room.  Additionally, online help is basic at best.  There should be detailed reset and help articles listed... I know Im not the only one !", "verified": true, "helpfulness": "1/1", "author": "Spokeguy1"}, {"rating": 3.0, "review": "It could be wonderful if it worked outside the US without VPN or if u could buy movies with non US credit card.", "verified": true, "helpfulness": "0/1", "author": "Fabio Ramos"}]