[{"rating": 5.0, "review": "This does a great job streaming Sling tv not to mention Hulu and Prime Instant Video.  Much easier to use than Chrome, and its compatible with more stuff (namely Prime and Sling).  Also, i have ATT Uverse internet which did not work with Apple TV.  But it works great with Fire TV.", "verified": true, "helpfulness": "0/0", "author": "EB"}, {"rating": 5.0, "review": "Wow - I really love my new FireTV.  I've been a long time user of Roku, my last one being a Roku 3, but I like my FireTV much better.  The thing that really sold me on it was that I could connect bluetooth audio devices, like headphones and speakers - which was the first thing I did pretty much as soon as I got it.  I had grown to love the Roku 3 with the headphone jack in the remote - it was a far from perfect solution, but it worked.  With the FireTV, I have connect my Plantronics BackBeat Go 2 and also my Bose SoundLink Mini bluetooth devices and both work perfectly.  Navigation is easy, a little funky but you quickly get the gist of the flow.  My needs are simple, I use Netflix and Pandora regularly, and I'm a Prime member so watch Prime instant video and listen to Prime music.  The Roku app for Amazon music doesn't have ability to listen to Prime stations or Prime playlists, so that was another reason I was looking to switch - that and I was getting tired of buying AA batteries in bulk to power the earbuds for the Roku 3.  That will save me a lot of money, annually, right there.  Will update the review after I've used it for a stretch, but so far beats my Roku 3, in my opinion, anyway.  Very happy with it - thank you, Amazon! ~ UPDATE ~ after having had FireTV for a while, still like it very much, but its been a bit buggy with playbak on Netflix and Amazon instant video.  Its been especially buggy with bluetooth audio devices playing back movies from my media server using the Vimu player.  I kept getting a REALLY annoying audio lag where the audio was out of sync with the video.  To correct this - turn off Dolby Digital Plus in the audio settings for FtireTV.  Credit for this fix goes to a Reddit poster.  The bluetooth was fine with Amazon instant video and Netflix, but not when streaming local content - VLC media player wasn't any better, same lag as Vimu player.  I hope amazon fixes this lag with bluetooth for future releases when streaming local content.", "verified": true, "helpfulness": "0/0", "author": "Klaatu"}, {"rating": 1.0, "review": "I bought one of these for my parents and within a month they noticed an audio problem. They'd be watching a show on Netflix or Amazon Prime and all of a sudden the audio would sound like it was recorded in a can. The noise it was making was awful and the only way to fix it was to pull the plug on the box and then plug it back in. That fixed it for about a day or two, and then it happened again and again. I called Amazon support for them and they agreed that we probably got a bad unit so he sent us another one. Well it's doing the same exact thing now and unfortunately we're out of warranty so we're stuck with it. We've been through all the troubleshooting etc and nothing fixes this problem. So buyer beware.The truly sad part is that it's a really nice device, but the sound issues just make it impossible to love.", "verified": false, "helpfulness": "3/5", "author": "Redmond Jackson \"Redmond Original\""}, {"rating": 5.0, "review": "The fire TV is the best made and most stable Android box on the market hands down!! Beware the M8 knockoff boxes out there, alot of them are just plain junk !! The fire TV has TONS of potential and is very easy to enable if the research is done.", "verified": true, "helpfulness": "0/0", "author": "jamezspec"}, {"rating": 5.0, "review": "Great user interface. Very easy to use for those non-techies. The Netflix app is so much better than the one on the Apple TV; great aesthetics.  USB port works; but must format as fat32.  I'm extremely pleased with my upgrade to Amazon prime and my purchase of the Fire TV. I don't even use my Apple TV or chromecast anymore.", "verified": true, "helpfulness": "0/0", "author": "S.H.A."}, {"rating": 4.0, "review": "Over all I like this. It brings almost all of my video into one place (sling, netflix, plex, amazon). I feel the UI for sling and amazon is much better then standard, and for the others it is about the same. The search ... leaves much to be desired. It works better to build your watch lists in netflix or amazon, then watch in fire. Not a real big issue, since you don't need to do that very often. A big downside, for me is the size of the remote. It is small, very small. Since you have to use it for everything it is to short, to narrow, and to light. The down is much to close to home, and I find myself kicked out of where ever and back at the home page way to often.", "verified": true, "helpfulness": "0/0", "author": "B. Bergstrom"}, {"rating": 5.0, "review": "LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "LaStrawberryMom"}, {"rating": 5.0, "review": "It works pretty good with slingbox", "verified": true, "helpfulness": "0/0", "author": "robesmit"}, {"rating": 5.0, "review": "Love it!  It was worth the purchase price just to watch my new addiction The Good Wife!  I was surprised by the response time.  Very fast.  Much more responsive than my fancy Blue Ray player.  Amazon has always been generous with the perks for the Prime Member and Fire TV is a testimony to the terrific company that is Amazon!", "verified": true, "helpfulness": "0/0", "author": "YogaMamma58"}, {"rating": 5.0, "review": "Awesome. Works great", "verified": true, "helpfulness": "0/0", "author": "David T."}]