[{"rating": 4.0, "review": "The twitch app needs a lot of work. I mean seriously.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The speed is amazing. Amazon built and designed this product amazing well.", "verified": true, "helpfulness": "0/0", "author": "speny12"}, {"rating": 5.0, "review": "I am disappointed that, as a prime member, I don't have free use of some of the programs I want to view.", "verified": true, "helpfulness": "0/0", "author": "The Bush"}, {"rating": 4.0, "review": "So far so good, I like the interface and love the remote. You can't go wrong with this one. It should have more usb ports and HDMI ports.", "verified": true, "helpfulness": "0/0", "author": "tirilene"}, {"rating": 5.0, "review": "Amazing picture quality.  Doesn't freeze like other systems we've tried streaming from.  Couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "N. Long"}, {"rating": 5.0, "review": "I love this device. Watching movies and TV has never been easier.", "verified": true, "helpfulness": "0/0", "author": "Atunyese V. Herron"}, {"rating": 2.0, "review": "This product is clunky and hard to use. The Amazon interface is very inferior to Netflix. This fact may be the downfall of an otherwise decent product.", "verified": true, "helpfulness": "0/1", "author": "DAVID A GOLDTHWAITE"}, {"rating": 5.0, "review": "I hesitated to buy this, since my TV and Blu-Ray player can be used with Amazon Prime, but I am very pleased with it.  The interface for selecting and viewing Prime movies and TV is much easier to use than the others.", "verified": true, "helpfulness": "0/0", "author": "Gerald W. Bell"}, {"rating": 5.0, "review": "Works great and was easy to set up.", "verified": true, "helpfulness": "0/0", "author": "JIM MILES"}, {"rating": 1.0, "review": "NOT compatible with many devices ~ If you plan to watch on a tablet, forget it ~ Amazon wants you to buy their Fire TV tablet ....", "verified": true, "helpfulness": "1/3", "author": "Pony"}]