[{"rating": 4.0, "review": "This device is very easy to use; the remote was easy to figure out although I have not tried the voice commands yet. The video and audio quality are amazing and the setup was extremely easy. I watched it for a month before ever looking at the online video instructions. I'm a bit disappointed in the number of titles available for Amazon Prime members, did I misunderstand the hype there? However, I have found quite a few titles that I plan to watch in the future. Hopefully, there will be a lot more Prime content available in the future.", "verified": true, "helpfulness": "0/0", "author": "Donahoo \"merand\""}, {"rating": 4.0, "review": "Love the voice promptAmazon and app features are easy to useWaiting on control to test out the gamesOnly issue - it won't work with old flat screen tv's that don't have HDMI socket", "verified": true, "helpfulness": "0/0", "author": "Zhamyr"}, {"rating": 4.0, "review": "We like it very much but there are still many, many things that you have to pay to watch.  Don't think if you buy this item everything you can watch everything for free.  The free items are very few.", "verified": true, "helpfulness": "0/0", "author": "susan dahl"}, {"rating": 5.0, "review": "Great! More than I have time to watch.", "verified": true, "helpfulness": "0/0", "author": "ricky reynolds"}, {"rating": 5.0, "review": "We just love the Amazon Fire.  Lots of variety, movies, TV, music and a voice activated remote search that really works.", "verified": true, "helpfulness": "0/0", "author": "achillen"}, {"rating": 5.0, "review": "Love it, better than cable.", "verified": true, "helpfulness": "0/0", "author": "Etosha Prescott"}, {"rating": 5.0, "review": "I have not had cable for two years, this is a great alternative, also gives me access to games and music too!", "verified": true, "helpfulness": "0/0", "author": "Irene Adams"}, {"rating": 5.0, "review": "This totally opens the power of your TV.  Of course you can get all of your favorite apps: Netflix, Pandora, Hula, ESPN etc etc but there are so many options available. As a Prime member... you get countless TV, movies, MUSIC. You can elect various music playlists. There are games, photos and a wealth of apps.  Your can mirror with your Ipad, phone, Samsung . Takes about 2 minutes to set up and enjoy. GREAT value!!", "verified": true, "helpfulness": "0/0", "author": "Meet Me in St. Louis \"Kathy\""}, {"rating": 5.0, "review": "It's very user friendly,  already synced to your account.  I can even listen to prime music.", "verified": true, "helpfulness": "0/0", "author": "eric turner"}, {"rating": 5.0, "review": "super fast connection way better than Comcast on Demand", "verified": true, "helpfulness": "0/0", "author": "Pierre in Marin"}]