[{"rating": 3.0, "review": "I really like the concept and would be great. The interface is pretty good to maneuver through and find what you are looking for, the voice recognition works pretty good, though I wonder about some of the results we get. I like having the different apps, games, tv and movie options. I've even downloaded and played a few games, we use it for Sling TV as well. But my two biggest issues are that it is clunky. Using the remote sometimes it works smoothly and scrolls or navigates easily and is responsive, other times it is very very delayed and the only way I can describe it, is glitchy. Also, at times I will go to apps or games (as an example), but the screen still shows the tiles for the most recently used apps or the home, it just doesn't change. Sometimes it seems to be very slow in opening anything as well, lots of processing or loading occurs, other times without a hitch. So until Amazon can work out the clunkiness of it, I can only give this a 3 star.", "verified": true, "helpfulness": "0/0", "author": "inthegr8nw"}, {"rating": 1.0, "review": "Horrible streaming device. It loses wifi often, but all of my other devices are still connected and work. Restarting/rebooting doesn't always solve the problem. I spend more time rebooting than using this hunk of junk. I will be replacing this thing.", "verified": true, "helpfulness": "0/1", "author": "Cameron's Mom"}, {"rating": 5.0, "review": "I was a little worried about getting rid of cable and getting two of these with the tablo because I can only get 5mbs internet.  I thought we could only use 1 tv at a time for the amazon fire and watch ota tv on the other.  Some how this can stream on both my tvs at the same time at a lightning speed.  No buffering and tons of content.  The voice controlled remote really works, unlike my phone.  There is no way I'm going back to cable again.", "verified": true, "helpfulness": "0/0", "author": "shane"}, {"rating": 1.0, "review": "Not a fan of the interface and it slows down pauses way to much.", "verified": true, "helpfulness": "1/4", "author": "Gustavo Barba"}, {"rating": 5.0, "review": "All things considered, this works extremely well.  From our experience it is easier to use, faster and more user friendly than Apple TV or Roku.  We have both of the former and are delighted with the Amazon Fire.  I was very skeptical of the voice command feature.  To my amazement, it works extremely well - better than any voice command feature I have experienced.  We have no complaints whatsoever and, if you are going to have only one of these devices, recommend this over both Roku and Apple TV.  The others do have areas where they excel, but this is the best overall.", "verified": true, "helpfulness": "0/0", "author": "WSA \"WSA\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Shavonne Nembhard"}, {"rating": 5.0, "review": "It works great! Unlimited Choices. Totally Awesome!", "verified": true, "helpfulness": "0/0", "author": "Brian Smith"}, {"rating": 3.0, "review": "No volume control or mute button on remote.", "verified": true, "helpfulness": "1/2", "author": "Regan Stefanik"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "AHMAD I ALSHATTI"}, {"rating": 5.0, "review": "Amazon Fire TV is exactly what I was looking for to replace my cable. Huge selection for me to watch. Glad I made the switch to Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Deb Riffle"}]