[{"rating": 4.0, "review": "Amazon Fire seems to work well but all those \"free\" movies seem to have vanished in cyber air as every time I search for a movie, I find a rental or purchase fee.  Amazon Prime works well for merchandise but for movies, any movie, all movies, go to Netflix and don't even open up Amazon for movies,", "verified": true, "helpfulness": "0/0", "author": "Arthur Butler"}, {"rating": 5.0, "review": "Good thing to have. It works great lost of movies. Love it. Amazon is great!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "julie donahue"}, {"rating": 3.0, "review": "kept freezing and not allowing me to connect my Galaxt S5 for screen casting/fling", "verified": true, "helpfulness": "0/0", "author": "Eliam Lopez"}, {"rating": 5.0, "review": "It is so easy to hook up. I love having access thru my tv. Home run for Amazon. Again.", "verified": true, "helpfulness": "0/0", "author": "J. La Tour"}, {"rating": 5.0, "review": "This device is incredible. Still has a wrinkle or two to iron out but I just purchased my third one.  My only compliant is with apps that Amazon has been slow to add.  Amazon has to embrace the competition if it wants to sell more hardware.", "verified": true, "helpfulness": "0/0", "author": "War Eagle Man"}, {"rating": 5.0, "review": "The fire tv is a great little device, it has it's flaws but for 99.00 you can not expect the world. If your wifi is shaky do not buy it but that is true for all streaming devices.This is a good little device and the best out there.Do not listen to the haters they are clueless Amazon lived up to the device and then some", "verified": true, "helpfulness": "0/0", "author": "dina"}, {"rating": 3.0, "review": "Seems like it should be great but it's just OK. Picture is nice when it's working right but it's just not living up to the hype. My xbox works  better. Hope they upgrade it I really want to like this thing.", "verified": true, "helpfulness": "0/1", "author": "Matthew Brady"}, {"rating": 5.0, "review": "I'm 70 & it was the easy to set up and use. Love it!", "verified": true, "helpfulness": "0/0", "author": "Joan F. Georgick \"Grneyes\""}, {"rating": 5.0, "review": "OMG.......I am in love with this. Is that possible. My whole family love the amazon fire.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "There are some apps I would like to see that are not present; in time perhaps they will appear.", "verified": true, "helpfulness": "0/0", "author": "GarbageBug"}]