[{"rating": 4.0, "review": "I wish when you searched for a program / movie it would give all available options, not just the ones on Amazon. (I.e, Hulu, Netflix). And unless I'm just a moron (which is possible) I would like an \"off\" button. I definitely like it though and it makes any TV a smart TV.", "verified": true, "helpfulness": "0/0", "author": "jason hooker"}, {"rating": 3.0, "review": "At first the audio was \"funky\", now it's better. I'm worried about watching sports. NFL and MLB.", "verified": true, "helpfulness": "0/0", "author": "john h curl"}, {"rating": 5.0, "review": "I love Amazon Fire TV!  I found it easy to identify Prime programming - I don't understand why others have been complaining about that.  Perhaps the program has been updated?  Or I am less picky.  But it's so easy to use, instant programming and the screen savers are also very nice!!", "verified": true, "helpfulness": "0/0", "author": "L. Talan"}, {"rating": 4.0, "review": "I really like the Amazon fire TV.  It's much better than my  previous streamer.  I love the continuous play of episodes rather than having to go back and click for each one.  I also like that I can just play my instant downloaded videos on the TV rather than having to hook up my computer to the TV or just watch them on the laptop.  The only problem I had was getting the Netflix app to work and my instant downloaded videos to show up.  I called customer service and they were great with helping me get everything running smoothly.", "verified": true, "helpfulness": "0/0", "author": "Staci"}, {"rating": 5.0, "review": "This is the perfect add on to my television. I have only basic cable. The Fire gives me access to my Prime content, Netflix and so much more that I don't think I'm missing out on anything, now", "verified": true, "helpfulness": "0/0", "author": "Kathy Avena"}, {"rating": 5.0, "review": "Wow... I've used 'em all... Chromebox, HTPC's..all with XBMC (rooted, etc..).  This really closes the deal.  I have CAT5 pulled as copper is king, however I haven't had to use it - even for those large Blue-ray formatted movies.  Yes streaming them over my LAN (2.4 GHz from my NAS (hard wired to my ASUS GB port enabled router)) with no buffering.  Almost scary to think that someones finally figured it out.  Haven't even looked at which WIFI NIC they've used on their board, but I'm impressed!Thank you Amazon, you truly knocked it out of the park.", "verified": true, "helpfulness": "1/1", "author": "Christopher T Kaiser"}, {"rating": 4.0, "review": "The product works very well. Meets most of my expectations.  However, i did think I would be able to use my USB stick in the back of the device.  You are unable to do so.", "verified": true, "helpfulness": "0/0", "author": "Leah Brown"}, {"rating": 5.0, "review": "Want to save money? Cut the cable and get amazon fire tv box, plus amazon prime and enjoy all the shows etc it offers. Add in a hulu or netflix and you will save alot money over cable tv. You can get local channels with an antenna.", "verified": true, "helpfulness": "0/0", "author": "Richard D. Parsons"}, {"rating": 5.0, "review": "Amazon Fire TV is simple to use and there are more options than I originally thought. I have more aceess to newer movies. I am very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! So many apps. Super fast processor. Easy to use. Great game selection too. No need for cable with this!", "verified": true, "helpfulness": "0/0", "author": "cb"}]