[{"rating": 3.0, "review": "My Sony DVD player with roku does pretty much the same thing and controls my DVR  Voice control works nice though", "verified": true, "helpfulness": "0/0", "author": "rodney walker"}, {"rating": 5.0, "review": "Extremely simple set upSimple navigationExcellent contentLove the additional content with Amazon PrimeMay be able to cut the cord with cable provider", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Earl Shepard"}, {"rating": 5.0, "review": "No complaints about the product, the problem was simply that my ISP connection is too slow for this.  I had same problem with Roku3.  I purchased the Roku Stream Stick and it works fine just fewer bells and whistles.  Budget concerns, you know!", "verified": true, "helpfulness": "0/0", "author": "ThriftMaven"}, {"rating": 5.0, "review": "Easy to set up, and use.  I love it.  If you are a Prime member, this is a must!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"library lady\""}, {"rating": 5.0, "review": "Great, device! Got a free trial and continue to be impressed with it. Was also very impressed with the price! Prime is frustrating as you pay for a yearly service and you have to buy movies/videos on top of that!", "verified": true, "helpfulness": "0/0", "author": "B. Peasel"}, {"rating": 5.0, "review": "User-friendly, does exactly what I need, good quality product. Love the voice search option. Wish there were more Prime TV shows.", "verified": true, "helpfulness": "0/1", "author": "KarenM"}, {"rating": 5.0, "review": "It is streaming in the films without interruption. And seems to be working very well.", "verified": true, "helpfulness": "0/1", "author": "Dortodor"}, {"rating": 5.0, "review": "We are Prime members so this was a perfect fit for the bedroom TV.  My wife loves it.  Happy Wife...Happy Life!", "verified": true, "helpfulness": "0/1", "author": "Michael Auler"}, {"rating": 5.0, "review": "Better than Apple TV! I own them both....", "verified": true, "helpfulness": "0/1", "author": "Stantuf"}, {"rating": 5.0, "review": "My tv has one of those apps. It doesn't remember what you last watched. I'd sit down with dinner and start clicking away and eating. By the time dinner was half gone I'd get to the last tv show, I think, I watched to find the next episode. With the fire box, I sit down to eat, and before I finish the first mouthful of food I'm watching the next episode. Now instead of watching just one series because that was all I could remember which episode I was on, I can watch 9 or so and the box remembers where I left of one each one. I love variety.It remembers your recently watched and also has your amazon watch list. Navigation with the control is very simple and fast. I like browsing titles but the voice search is great too. The remote seems to not need line of site. I can lay in bed and have the remote under the blankets and still operate it.", "verified": true, "helpfulness": "1/1", "author": "Keith Finkel \"Keith\""}]