[{"rating": 4.0, "review": "I'm really enjoying the \"Fire\" the only thing that I don't,is the voice part of it.I can't get it to work. But that's ok, I can live without it.Also, how much will it cost me per month?", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "When I was searching for video streaming, I was concerned that our network connection is sometimes spotty in quality.  I thought the buffering strategy of this unit would help smooth out those issues.  I can say we have never had a problem with poor quality video or lost connections.  I think the quality is better than I'm receiving for my HD channels on my satellite tv.  And, we so enjoy skipping commercials on the tv series.Amazon Prime has a wide selection of videos that are free.  Once you get used to how that is displayed (it says something like View Now with Amazon Prime -- meaning it's free), I'm sure you will find lots to watch there.  And the selection, including rentals, is excellent.", "verified": true, "helpfulness": "2/2", "author": "Dr. Joann J Ordille"}, {"rating": 5.0, "review": "It's so easy to use.  Responds very fast also.I highly recommend over comparable products,although there really aren't any.", "verified": true, "helpfulness": "0/0", "author": "MONTY R."}, {"rating": 5.0, "review": "This was a gift. The recipient loves it. She uses it to download movies and tv shows.Claims it's one of the best gifts she's ever received", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great for Netflix and Amazon Prime. I wish the remote had numbers on it because the on screen display can be easily mimicked by my child and he could end up buying stuff.", "verified": true, "helpfulness": "0/0", "author": "Matthew Novitsch"}, {"rating": 5.0, "review": "This is awesome!  I had trouble streaming with the Roku 3.  I've had NO trouble with the Amazon Fire TV!  It's easy to set-up and use, and the emote is great.  I only wish TV shows and movies were separate on my watch list.  Maybe this could be a software update?  Of course the voice search can help here too!  BTW I was able to sell on Amazon my Roku 3 for a good price!", "verified": true, "helpfulness": "0/0", "author": "NJ Cloister Collection"}, {"rating": 5.0, "review": "I just plugged it in and used the remote and it was great.  Saw a bunch of free prime movies and also bought the ones that I wanted in my library so that I can watch it again in the future.", "verified": true, "helpfulness": "0/0", "author": "FireFlyHI \"FireFly\""}, {"rating": 5.0, "review": "My mom loved her Mother's Day Gift! It's a great gift and makes streaming movies easy to use. Kids will love it and makes watching movies fun!", "verified": true, "helpfulness": "0/0", "author": "Mya L. Stringer"}, {"rating": 5.0, "review": "Delivers a very good picture & sound! You should give it a try. It is very small and compact. Love it.", "verified": true, "helpfulness": "0/0", "author": "Joshua"}, {"rating": 3.0, "review": "nice device with a slick interface and I can see it working well for people in the USI brought this on a recommendation from a friend who has it working with XBMC which I was interested in doing as well but for me there was too lag", "verified": true, "helpfulness": "1/2", "author": "Drak41"}]