[{"rating": 4.0, "review": "We have found this to be a useful alternative which provides low-cost TV entertainment.", "verified": true, "helpfulness": "0/0", "author": "Rodney J. Fink"}, {"rating": 5.0, "review": "Fire tv! Excellent :-))) recommended", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "now if you could just create amazon fire internet I could ditch Comcast forever.", "verified": true, "helpfulness": "0/0", "author": "stuff"}, {"rating": 3.0, "review": "I bought the fire tv 2 weeks ago to replace my Roku 2XS. We currently also have Verizon FIOS. I just took it back and picked up a Roku 3.Some of my pros and cons actually are not the fault of the player; but still as the consumer they are some personal annoyances that led me to send it back. Just bought a Kindle FireHDX and love it and was excited about the complete integration of Amazon products; which is why I wanted the Fire TV to work for me.Pros:Nice design. Far better looking and feel than the Roku, including the remote.PQ is very nice- possibly a tad better than Roku- but hard to tell as both were 1080p.Sound: greatWorks with Harmony Hub remote: You have to pair it through Bluetooth- but it does work.Integration to Amazon is cool. Your photos from the AMZ cloud and AMZ music from the cloud all will appear and everything is synced to your AMZ account. You can make the screensaver your family photos if you want. That was nice.Faster app loading times than the rokuCons:After 1/2 hour of non use- the unit will shut off...which at first I liked better because it actually powers down, unlike the Roku. However,  when you come back to it and switch the TV input the screen is black as the unit is off and you will need to push a button on the remote (any button to \"wake it\". )  Not a big deal- but when using universal remotes like Harmony you get spoiled into everything turning on with a push of one button and knowing everything \"switched properly\" by seeing an image once the inputs changed.Not the greatest selection of apps. Loaded with game apps - which I don't play.  Confusing on how to load and find apps. Really a poor menu. The main apps like \"netflix\" are easy to find- but others that you know are there because you researched that fire tv had the app take a while to find. I tried using the \"search\" to find these apps, but it will only search movies...and I don't believe ALL movies- just amazon movies are searchable. History Channel app and some others were useless to me as complete apps to access all areas of app because at this time there is no functionality with some apps/ fire tv and FIOS. The app works- I just can't access all the content because FIOS is not selectable as a provider. All the apps in question are available on the Roku with FIOS selectable as a provider as I checked.Bad menu.  You cannot customize at all. If you have certain apps that the family uses- they will appear at the top under \"last viewed\"...but if you happen to just browse other apps - they will move your main selection out of view--I found my self clicking \"remove from last viewed\" every day so that the main 3 apps we use were still at the top to quickly click.Harmony hub remote: Because the Amazon fire remote is so unique, most apps require the fire remote.  If you are using a Harmony HUB type remote and not the fire tv remote you will still have complete functionality, but there are annoying pop ups when first opening most apps that read \"this app requires a fire tv remote- please check remote--click here to enable app anyway\".  Once clicked \"enable app\" the app starts normally, but it is annoying. Of course, the unit is designed to work with the fire tv remote and not a universal remote, so I can't complain too much, but they should fix this.A couple of times in the 2 weeks I had the fire tv- some apps would randomly close- or would not open. It was not the connection as my connection is wired. One night the unit did not shut off and I thought an update had made the unit to not shut off like a roku... I posted in a fire tv forum and the administrator wrote to force close the apps because one is more than likely still open, which caused the unit to not shut down. To do this you have to go to the settings and individually force close all apps. I refused and just unplugged the thing and plugged it back in and the problem was solved. Something like above is going to happen- it happens with new computers--it just was another annoyance to my already growing list after only 2 weeks!NOTE: I mentioned Harmony remotes several times in this review. It does work well with the Harmony Hub type or remote...but from what I understand that is the only type that is compatible with the fire tv at this time.I wanted to love the Fire TV...but I did not like it enough to keep it. The family forced me to send it back and get a Roku 3 as my family hasd similar annoyances with the unit.", "verified": false, "helpfulness": "3/3", "author": "ranchfrog"}, {"rating": 1.0, "review": "Don't expect to use this thing but ONLY to watch content purchased from AMAZON. They should give it away for free!!!", "verified": true, "helpfulness": "2/9", "author": "David AB \"Dave\""}, {"rating": 3.0, "review": "It is very nice, but you cannot play Pime Music.", "verified": true, "helpfulness": "0/0", "author": "Fenando"}, {"rating": 1.0, "review": "Horrible. Constant waiting for Netflix to \"reload \". I'm connected with wi Fi. Terrible I will try a wired connection. My advice is to think twice about this product.", "verified": true, "helpfulness": "1/3", "author": "Riverman63 \"Drudge\""}, {"rating": 5.0, "review": "This device is so perfect the wife and I canceled our Directv account and only use this product. Side loading apps is so easy on this thing and it is fast, very small,and voice search actually works on it. Side loaded XBMC so we get the current TV shows and movies that come out for free, and the Amazon Prime membership is great. We watch tons of shows and listen to music on this device. The only bad thing is when we try to mirror our Kindle Fire HDX to the Fire TV it mirrors but the video skips frames and the audio is clearly not in sync with the video which is a real bummer, which is one main reason why I bought the Fire TV and Kindle Fire bundle. Contacted Mayday and Prime Service but do not seem to know the answer to it. Also their customer service is 10/10 extremely friendly and willing to help.", "verified": true, "helpfulness": "1/1", "author": "Brock"}, {"rating": 4.0, "review": "I bought this gadget to use it outside USA. Of course all prime movies and tv's are not available outside USA. I am not a tv fun so I am not too disappointed because of that. I am glad I can get my tune in working smoothly and it helps me cast my Kindle screen on tv. I wish however it also created its own WiFi so that when used for PowerPoint presentations away from WiFi it would work smoothly. Increase apps that can be used outside USA. Make the USB port functional. The gadget itself is perfectly designed.", "verified": true, "helpfulness": "0/1", "author": "Lloyd Makamure"}, {"rating": 5.0, "review": "Amazon has done their homework when it comes to the fire TV box. Would recommend to all my friends and family. Such a great product to view all apps in a fast streamline manner. So easy to use my six-year-old has a blast using it. Picture is crystal clear streams very fast even though I only have 12mbps service.", "verified": true, "helpfulness": "0/0", "author": "Sanchez"}]