[{"rating": 4.0, "review": "It's excellent - very fast, much faster than a Roku.  The only problems are that the Dailymotion interface is unusably bad (you can't even sign into your account), the YouTube interface isn't as practical as the Sony Media Player one, and the voice search thing pretty much only finds what's available on Amazon streaming, avoiding Netflix completely.  Still, excellent picture quality.", "verified": true, "helpfulness": "0/0", "author": "Greg Scouras"}, {"rating": 5.0, "review": "Easy to setup", "verified": true, "helpfulness": "0/0", "author": "Robert Menapace"}, {"rating": 4.0, "review": "I am enjoying my Amazon Fire TV a lot. The only thing I miss is I cannot surf the internet as I can on my Kindle. Still I recommend it to everyone.", "verified": true, "helpfulness": "0/1", "author": "warped space"}, {"rating": 5.0, "review": "Love it! Easy to use and has many options that we enjoy.", "verified": true, "helpfulness": "0/1", "author": "Ellen V. Murphy"}, {"rating": 5.0, "review": "I bought this for my husband. He loves it. No mor ads and he gets to watch shows I don't care about. I stream as I have a Smart TV. The Fire is so easy to hook up.  A great buy.", "verified": true, "helpfulness": "0/1", "author": "KATHY HILL"}, {"rating": 1.0, "review": "This box has the potential of being thebest box on the market because it is a good marriage of strong hardware with a potentially flexible Android OS - however with the way they did the menu and closed up the system, you lose all of the flexibility and the potential and get the worst usable streamer on the market. I have pretty much tested every single streamer out there, there is only one that can run everything and is flexible enough and it is the Xtreamer Prodigy 4K. The Amazon Fire TV has the potential to be much better than the Xtreamer, all they need to do is to stop feeding the menu system with 100% usless content and let the user decide what apps he or she actually want to have on the menu. Roku also feeds the menu system with tons of content that most people don't want but at least they had the decency to allow you to remove/delete the items you don't want so you have a clean menu system with only what you want. Roku is anothe super box that is far better than this Amazon Fire TV, the problem with Roku is that you cannot install android apps and so a very popular app like Kodi cannot be installed, and the alternative Plex is just not good enough. You can install Kodi on Amazon Fire (if you are either technical or can follow simple YouTube video steps) however not all Android apps work on the device, for example the Time Warner App does not work, even though it is an Android box and the app works on other Android devices - it looks like Time Warner may be the one blocking the Amazon Fire devices. If Amazon Fire will open up the menu system to be customized by the user, and have a working Time Warner Cable app, as well as allow native Android apps to be installed, it would be the best box on the market and get a 5 stars from me. For now, one star for usability and platform support.", "verified": true, "helpfulness": "3/4", "author": "Iuval Hatzav"}, {"rating": 5.0, "review": "I used to watch Prime content on my laptop.  Now with the Fire TV I can watch it on the TV.  Much more comfortable.  The set up was extremely easy and it found my wireless network instantly.  Couldn't be any happier with it.", "verified": true, "helpfulness": "0/1", "author": "Kathy George"}, {"rating": 5.0, "review": "Just received and so far I enjoy the diversity of entertainment on it.Only had it a couple of days so talk to you in a month or so", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "My wife and I just purchased Amazon Fire TV because we watch a lot of TV and movies together in the evenings. My wife has normal hearing while mine is shall I say different. My wife suggests that my hearing may be selective, and to some extent that is true. But I do wish to be able to hear the TV we watch together but this requires a different volume control for each of us. Since Amazon Fire TV has Bluetooth, I thought I had found the answer. My LG Bluetooth headset will work perfectly with Amazon Fire TV and I'll be able to hear the TV just fine. However, When Amazon Fire TV activates Bluetooth as an audio device, it also deactivates the TV speakers. So now I'm back almost where I started from.I just had a chat with Amazon about this issue and while they were sympathetic and understood my need, they clearly indicated that this currently could not be done. I truly doubt if it will ever be changed, so my wife and I will need to see if we can find a work around or if we will simply be returning the product.I'm hoping this review may help others like myself who need both the TV speakers and the Bluetooth speakers channeling audio signals simultaneously. It is not currently possible.", "verified": false, "helpfulness": "2/3", "author": "jxm"}, {"rating": 5.0, "review": "Love it....100 times more than crapple TV.", "verified": true, "helpfulness": "0/1", "author": "JRz \"JMR\""}]