[{"rating": 4.0, "review": "I love it.  It is very fast,  very powerful,  and its Android, so you can add apps and make changes since it's an open source software.What i don't like though,  is that the applications can not be reached easy, still needs some improves on the home display.  It's mainly focusing on prime only.  I risk of the home screen is for all the apps,  not only for the prime. But it's still the best streamer I've ever had.", "verified": true, "helpfulness": "0/0", "author": "W"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Mayra"}, {"rating": 3.0, "review": "It is a very well made device but if you don't have individual account with a cable provider, it's basically useless...The audio search is nice but it will only search for content within Amazon Prime. So if you have a Netflix account and you want to watch House of Cards for free, when you search for it, only the episodes from Amazon Prime are displayed and you need to pay for it...If Amazon really wants to be a platform for streaming, it needs to better accommodate the materials from different providers...", "verified": true, "helpfulness": "1/1", "author": "Diana"}, {"rating": 5.0, "review": "It's fantastic", "verified": true, "helpfulness": "0/0", "author": "Larry Chapple Sr."}, {"rating": 5.0, "review": "Best thing I ever bought on Amazon. Got rid of the need for a TV service.", "verified": true, "helpfulness": "0/0", "author": "Stephen Slusser"}, {"rating": 5.0, "review": "I love the amazon fire. Watch netfix and hulu too and other apps", "verified": true, "helpfulness": "0/0", "author": "Ronnie"}, {"rating": 4.0, "review": "I tried the 30-day free trial and was very pleased with this product.  The only problem I ever had was buffering when my grandson was playing videos on my tablet while I was watching a video from Amazon Prime.  Simple to set up and connect to the internet.  Netflix worked well with this product also. Unfortunately I was not able to continue the service due to an unexpected veterinary bill.  I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "S. Green"}, {"rating": 1.0, "review": "The unit works, only there is no Service in Mexico where I Live. I has to return the unit. netflix has Service in Mexico.", "verified": true, "helpfulness": "1/5", "author": "BHO"}, {"rating": 5.0, "review": "A great way to enjoy streaming video and use your amazon membership to get more for value.  A great device that is easy to learn and could give Apple TV and Roku and run for their money.", "verified": true, "helpfulness": "0/0", "author": "David Saunders"}, {"rating": 5.0, "review": "The best!", "verified": true, "helpfulness": "0/0", "author": "edgar l."}]