[{"rating": 5.0, "review": "We have prime and this is the perfect companion to Prime.  If you have Prime Shipping why not take advantage of the added benefit of your Prime Membership for all the great series and movies and also any apps.  My only gripe is that you have no off button on the remote and the unit stays on and shuts itself off after a predetermined time.", "verified": true, "helpfulness": "0/0", "author": "Gregory Lang"}, {"rating": 5.0, "review": "I am really enjoying Fire TV.  It was easy to set up, and is easy to use.  I don't feel like I can get rid of cable just yet, but this is a step in that direction.", "verified": true, "helpfulness": "0/0", "author": "Kim Hengehold"}, {"rating": 5.0, "review": "Just like new", "verified": true, "helpfulness": "0/0", "author": "J Pursell"}, {"rating": 3.0, "review": "The selections are modest. The remote is just a bit too simplistic and navigation can be a bit frustrating. Network television shows are outrageously priced. Movies range from moderately new releases to very old. Searching by genre seems impossible. The device itself is a bargain, but keep in mind that browsing is limited to Amazon content.", "verified": true, "helpfulness": "0/0", "author": "Dawn"}, {"rating": 3.0, "review": "It is ok. If you do not have prime it would be a waste of money. Was about to return it to the store, until I upgraded to prime.", "verified": true, "helpfulness": "0/1", "author": "michael Breinich"}, {"rating": 5.0, "review": "This product is Amazing!  I've cancelled show time, HBO and all the pay per view channels on my satellite dish.  Don't need them any longer with Amazon Fire TV.  Really easy to set up.  As a prime member, it was already programmed for use.One thing to be aware of, when you plug it in make sure it is plugged in correctly.  If it doesn't come on, turn the plug around.  The polarity needs to be correct.I've already recommended it to friends about 5 times now!", "verified": true, "helpfulness": "0/0", "author": "FlyClark"}, {"rating": 5.0, "review": "who wouldn't love fire tv?", "verified": true, "helpfulness": "0/0", "author": "Krisanto Karlo Nicolas"}, {"rating": 1.0, "review": "Netflix did not work on it.", "verified": true, "helpfulness": "2/6", "author": "Brian"}, {"rating": 5.0, "review": "Great smart box. Easy Navigation", "verified": true, "helpfulness": "0/1", "author": "JAY"}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/1", "author": "Paul W. Tougaw"}]