[{"rating": 5.0, "review": "Love it!", "verified": false, "helpfulness": "0/1", "author": "Heather goins"}, {"rating": 3.0, "review": "I like XBMC on box but FireTV not allow event it is very good box", "verified": true, "helpfulness": "0/0", "author": "Nhut P."}, {"rating": 5.0, "review": "Instructions were clear and not confusing,very user friendly,easy to install, easy to navigate to where ever you want to go, unit is small and does not take a lot of space. Just a great unit for our family.", "verified": true, "helpfulness": "0/0", "author": "Fred Kenyon"}, {"rating": 5.0, "review": "I love it!  Easy to use, great programming.", "verified": true, "helpfulness": "0/0", "author": "Ron Baker"}, {"rating": 2.0, "review": "Very few working APPS.  Stick to ROKU....", "verified": true, "helpfulness": "1/6", "author": "Linda Thomsen"}, {"rating": 5.0, "review": "I love the voice command. Makes it very easy to find movies on Amazon prime.", "verified": true, "helpfulness": "0/1", "author": "George P"}, {"rating": 1.0, "review": "There is only enough memory for six games. If you want to download more you have to keep deleting some to make room. Had I known it had almost ZERO memory I would not have wasted my money.", "verified": true, "helpfulness": "3/7", "author": "kristin smith"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I really like the features of the Amazon Fire TV, with one exception.  Selecting movies or TV shows by voice automatically takes you to Amazon movies or TV shows.  Option for Alternative Viewing Options is too small to read from viewing distance, and twice I have inadvertently selected a movie or TV show and was charged for my selections even though I am a Prime member.  Dialog boxes' print should be made bigger so that are readable without having to get up and go to my TV screen to read what they say.  I was successful if having the first charge reversed, I hope I can have the second one removed also.", "verified": true, "helpfulness": "0/1", "author": "Robert P Worst"}, {"rating": 2.0, "review": "Much too limited for what it is.  I expected complete voice command and control but that's far far off into the future.  They need to rethink who they are targeting it for,  Competition is rampant is this market and I don't see where they excel at any level with this product.  The remote is toy sized and will easily be lost.  Overall a negative experience so I returned it.", "verified": true, "helpfulness": "1/1", "author": "Robert Edison"}]