[{"rating": 3.0, "review": "Note- updated my review to reflect the accurate ram count and a fire TV alternative..Its a great box with 2 major flaws.1... Tho advertised as 8 gig of ram, the fire tv only ships with 5 available. And that 5 gigs of ram gets eaten up in a very quick way with just a couple of games (Gameloft games, for example). And until the USB port on the device gets opened up to allow for storage devices, it will remain very limited.2... You must be connected to internet at ALL times to use the device. Even if games are offline games, it doesn't matter. You are greeted with a pop up that cannot be dismissed until you reconnect. So 4G hotspot users, take heed!I kept this device regardless of these flaws for bedroom TV, but too limited for family room.A great alternative is the MINIX Neo X8-H. I'll create a review for it soon in the proper place, but for now I'll state it ships with 16 gigs, 3 USB ports and an SDHC card slot.And in one of those slots, rests a 500 GB external HD, that is is recognized by the android OS as a legitimate external drive. So I can have unlimited games for it, and doesn't require being online to use.As of right now there is not a Google play store app for prime videos, but Amazon has recently been reported as saying one is \"imminent \"", "verified": true, "helpfulness": "9/9", "author": "MacDaddy"}, {"rating": 5.0, "review": "Love it! It's great!", "verified": true, "helpfulness": "0/1", "author": "James E, Concord NC"}, {"rating": 2.0, "review": "i have roku, apple tv, netflix and now fire tv. i am an amazon prime member and i get charged for every episode i watch. same shows on netflix that cost $18 a month is ~$1-$2 per episode on firetv even though i pay the prime membership fee.", "verified": true, "helpfulness": "2/10", "author": "Vincent Gabriel"}, {"rating": 5.0, "review": "Love Amazon Fire TV, hate the remote. Amazon please revise the remote to be more user friendly and have lighted controls.", "verified": true, "helpfulness": "1/1", "author": "PJN"}, {"rating": 4.0, "review": "I wanted a device for Amazon Prime content and that could also run XBMC for my NAS content - and that's what I got. It does other stuff too it seems. I'm hoping the remote generates codes that my Dish TV remote can learn, even though unlike the ATV2 you have to map 7 buttons instead of 3.Cons:Have to sit thru an Intro video before you can use it. Great if you can stand the Millenial voice, for the rest of us hit mute and wait till young Lispy finishes going on about voith thearsh etc.Dreadful carousel menus (I thought only Sony did this to us)No home screen customization.No A-Z interface to Prime content, why does everything have to be pre-chewed into Categories? Only option is to use a PC to edit your Watchlist. There used to be an XBMC plug-in for Amazon Instant Video that had an A-Z interface but Amazon seem to have blocked that now.Pros:Comes in easy to open no-hassle packaging (no box-cutter needed).Fast with readable on-screen graphics & menus, in other words everything the GBox MX2 isn't.Installs easily, though if you want to enter your own IP settings the screens were designed by someone who's never seen a consumer device Network setup screen before - even has a setting for Network Prefix Length (what!)Can install XBMC easily, and it runs fast & reliably. Don't have to jailbreak / root it to make it work, though you can if you want to plug in a USB drive or edit the homescreen. Frees you from Apple jailbreak misery (quick, CL your ATV2 before word gets out.)Voith thearsh that actually works, sorry, young Lispy got to me, Voice Search that actually works.", "verified": true, "helpfulness": "5/5", "author": "opanto39 \"opanto39\""}, {"rating": 5.0, "review": "I was thrilled with my 1st Fire TV, and just ordered a 2nd box to replace the clunky old Roku LT on my other TV.  The Fire TV 's interface is simple to use, and the Bluetooth remote with voice search is a must for any couch potato.  Seriously, who wants to search with a remote.  The only downside is that the Fire TV is new device, and many of the apps available on other devices are not yet supported.  So, be patient for a few more months until the Fire TV gets up to speed with those other streaming boxes.", "verified": true, "helpfulness": "2/2", "author": "Ben Johnson \"opnmkt\""}, {"rating": 5.0, "review": "Very good Product.", "verified": true, "helpfulness": "0/0", "author": "Luiz"}, {"rating": 5.0, "review": "I have owned an roku 3, a neo tv and this is by far the best of the online streaming devices. app loading is fine (I saw some complaints about that) the three big guys (aside from amazon services) netflix, hulu and plex load great stream great never buffer for long and never force close (i'm looking at you neo tv). I never have an issue buffering for extended periods before, or during and it seems to be able to play anything plex throws at it. I am a little disappointed that they went with carousel style menu structure although the side tabs help. voice search does not look in your apps (netflix and hulu) for content when voice searching but you can say netflix and hulu and they will pop right up (honestly any apps you use often enough will be on top of the recently used). This brings me to the biggest gripe I have which the lack of a customizable home screen I wish I could pin things to a home screen (in tile like fashion) rather than having to find every single time in the recently used bar. Although this is annoying it isn't enough to drop it a whole star so 5 stars", "verified": true, "helpfulness": "3/3", "author": "Tony"}, {"rating": 1.0, "review": "No power off button. No features like the fire phone. Basic menu s and it doesn't show what items you already bought in amazon. Just understand that without a prime membership, this box is utterly worthless outside of paying for netflix or hulu plus. You can pay for premium movies as well. While this box is very fast, it lacks channels in comparison to the Roku series of boxes. I really wanted to give this box the benefit, but im not sure it lives up to what it can do with its fast processing power. Most of the games require the controller and that is $40. If you have the controller, you can play some decent mobile games from the amazon store.THe games i could play, they worked well.", "verified": true, "helpfulness": "3/6", "author": "missdarkstar \"missdarkstar\""}, {"rating": 5.0, "review": "It's absolutely FANTASTIC……Amazingly fast and very easy to use….The remote control is awesome….  Voice and button activated…LOVE LOVE LOVE it….", "verified": true, "helpfulness": "1/3", "author": "M. Wayne"}]