[{"rating": 5.0, "review": "Great price, easy set-up, instant viewing!", "verified": true, "helpfulness": "0/0", "author": "Raymond I. Booth III"}, {"rating": 2.0, "review": "I'm sticking with the Sony Google internet player", "verified": true, "helpfulness": "0/3", "author": "Timmy G"}, {"rating": 4.0, "review": "Love it besides it does not work work with xfinity/Comcast subscriptions only reason not getting 5 stars", "verified": true, "helpfulness": "0/0", "author": "Richard Rose"}, {"rating": 5.0, "review": "Took a little time to get used to it but once I got the hang of it it is a great addition and this is what I was looking for. Well satisfied with the performance and with the price.Robert Nowak", "verified": true, "helpfulness": "0/0", "author": "Robert Jnowak Sr. \"Robert J. Nowak, Sr.\""}, {"rating": 2.0, "review": "Remote didn't work. Minimal Prime movie choices. Same movies you would get from Netflix.", "verified": true, "helpfulness": "0/3", "author": "Dan Bennett"}, {"rating": 5.0, "review": "It's great I got one in every bedroom my kids love it", "verified": true, "helpfulness": "0/0", "author": "hugo"}, {"rating": 5.0, "review": "I am very pleased with the orders recently and all the items for quality and shipping timeThanks Amazon", "verified": true, "helpfulness": "0/0", "author": "joe morgan"}, {"rating": 1.0, "review": "DO NOT BUY FOR ANYTHING OTHER THAN PAID VIDEO STREAMING SERVICES...I got one of these for Christmas. I asked for it because the price was right for some really good hardware, and I had previously seen somewhere Amazon commenting on how \"open\" the device is.It technically does what is offered, but the device is so locked down that you cannot do anything else with it. The FireOS this device runs is a butchered fork of android. In this case it' so crippled you cannot use the USB port on the back for anything more than a wireless keyboard or syncing Bluetooth devices! I discovered this because I have a hard drive of my own movies I wanted to watch and android games I wanted to try on the big screen, but NOPE, NOT ON THIS DEVICE. You must root the device toadd that functionality back in. And as of the most recent updates, even obtaining root was made impossible.If you want to install an app that isn't on the play store, I hope you like using command prompt or terminal, because the only way to sideload apps is wirelessly through the android developer toolkit. You can't just download the app online because there is no web browser. You can't download the apk and side load it from a flash drive, because Amazon disabled the use of external storage.The interface is bearable. However, it will only show apps you installed from the amazon app store. If you took the time to go through the hoops I just mentioned, you will notice that your app is nowhere to be seen, except for hidden deep, deep in the settings options at the very bottom of the menu. There are available apps that work around this, to list your sideloaded apps for less hassle. BUT why should I pay money for what should have been the case to begin with?In my research trying to get everything I wanted working on this device, I also determined Amazon's initial tier tech support to be a bunch of bungling fools outsourced from India. But that's a whole other complaint. Suffice it to say, this did not help my shock at how useless this device was turning out to be for me.In summary, Amazon has removed almost all freedom from this device and does not care about what the customer feels. I will not purchase another amazon product until they get their act together. I'm disgusted by how far out of their way they went to disable what this device could do.to be fair, if the issues I listed were addressed, I would love the darn thing. I want to like it, I really do.", "verified": false, "helpfulness": "3/8", "author": "Wm. Michael Ethridge"}, {"rating": 5.0, "review": "I love my Fire TV. Would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "FM Lenon \"F.M. Lenon\""}, {"rating": 5.0, "review": "I am really liking my Fire TV.  It is very user friendly.  I gave up my satellite and switched to this and have survived.", "verified": true, "helpfulness": "0/0", "author": "Karen L. Payton \"karen l hart\""}]