[{"rating": 5.0, "review": "It done good!", "verified": true, "helpfulness": "0/0", "author": "Randy Cherland"}, {"rating": 4.0, "review": "I could not use it more than what my smart tv could give.  Hence returned.  But it is a wonderful piece.  Liked the look and feel and performance.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"Jey\""}, {"rating": 4.0, "review": "Really fun but doesn't work with my slower speed connection while my computer does.", "verified": true, "helpfulness": "0/0", "author": "Chasjr"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Marcello Augusto Lima Vieira de Mello"}, {"rating": 4.0, "review": "Just got this for Christmas. It works very well. I like the voice searching (so long as you use Amazon content), and there are some good apps.One thing I'm VERY disappointed about though is that there isn't a web browser app available (not that I can find at least). Now, this is my first time ever getting a device like this so perhaps it is normal, but it's very frustrating that I can't pull open a web browser to go look something up online. I feel like I've downgraded big time from my media PC for this one reason. Granted, we use Amazon Prime video a lot so for that reason alone I'll still give it 4 stars, but I'm very sad that I'm so limited with this device...", "verified": true, "helpfulness": "0/0", "author": "D. Eggertsen"}, {"rating": 5.0, "review": "Great, great, great", "verified": true, "helpfulness": "0/0", "author": "EA"}, {"rating": 5.0, "review": "Purchased it when it was on sale for $79.99.  Couldn't pass it up.  Anyway, after about 2 months of use I can say that we love it!  We don't play any games on it, just watch movies: Netflix, Hulu plus and Amazon prime, it truly is fast and amazing.  The voice command has been spot on with no issues and video playback is fantastic as well as the browsing speed between each app.I had chrome- cast for over a year and it was nice, however this blows it away!The only issue we have is that the remote seems to be real fast and typically skips over what we are attempting to highlight", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Loving it so far! Just what the doctor ordered. Watching some shows we were really wanting to see.", "verified": true, "helpfulness": "0/0", "author": "discndat"}, {"rating": 3.0, "review": "Do not get this if you have comcast cable or xfinity.  Otherwise easy to use.", "verified": true, "helpfulness": "0/2", "author": "caryn"}, {"rating": 5.0, "review": "An amazingly good product.", "verified": true, "helpfulness": "0/0", "author": "Frank Stretz"}]