[{"rating": 5.0, "review": "Great for streaming!", "verified": true, "helpfulness": "0/2", "author": "Joslyn Dresser"}, {"rating": 5.0, "review": "ITS AMAZING LITTLE BOX ! NO REGRETS ON BUYING THIS ,WAS SKEPTiPAL.. BUT PROVE ME WRONG ITS FAST AND ALOT CONTENTS", "verified": true, "helpfulness": "0/2", "author": "Dianna lebron"}, {"rating": 5.0, "review": "Amazon Fire TV's is great  my grandchildren love to watch the past series of Disney shows and with amazon primeA lot of movies . I am thinking about buying another to put in the family room.", "verified": true, "helpfulness": "0/1", "author": "ELC"}, {"rating": 5.0, "review": "My family and I \"cut the cable cord\" three and a half years ago.  We have owned a couple Roku products in that time.  Amazon Fire TV is significantly faster and more responsive than its Roku counterpart.  Some reviews claim Roku has more content, which it does, but that content is mostly unwatchable and unnecessary.  My family and I get our television viewing predominantly from Prime, Netflix, Hulu, Vevo and WatchESPN.This product is terrific!", "verified": true, "helpfulness": "0/0", "author": "Michael Steven Archer"}, {"rating": 5.0, "review": "Your price are to high nice gift", "verified": false, "helpfulness": "0/2", "author": "Matthew"}, {"rating": 5.0, "review": "Works Great. Real easy to get it started.", "verified": true, "helpfulness": "0/0", "author": "Christopher Tolleson"}, {"rating": 2.0, "review": "like the shows and the content, but after a month the Fire TV box stopped working and had to return it, so paying for something I can't watch for two weeks!!  Amazon gave me a refund, but can't seem to answer if they are sending me another one like I was told or I have to buy another.", "verified": true, "helpfulness": "1/3", "author": "Martin Boor"}, {"rating": 1.0, "review": "No option to continiously play a series of videos/ season of episodes.No option to play local content from USB.", "verified": true, "helpfulness": "6/17", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I fell into the Amazon hype on this. I have tried all the TV products and this by far is the worst. It promises free shows and apps, and so far everything I've tried to access is a paid for only option. I have amazon prime and still have to pay for additional.Voice command is nice IF it understand you which it usually doesn't. Love amazon but this was a terrible buy wish i could get my money back.", "verified": true, "helpfulness": "6/14", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Much better than my Roku 3, Apple TV, or hell even my Xbox One. With Plex, works super fast and never lags. Love it", "verified": true, "helpfulness": "1/2", "author": "Slim Charles"}]