[{"rating": 3.0, "review": "Easy setup and it works okay, but it's no better than my Roku 2.  In fact, I can't seem to find a way to listen to my songs from Amazon, something I can do on my Roku 2 using the Cloud App.  The voice search is nice and the box is sleek, but so far I don't see this as a \"game changer.\"  I'm a casual user and I only use it for movies, music and TV shows.", "verified": true, "helpfulness": "2/4", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love the amazon fire tv, but it needs more apps. Right now I'm using the roku 3 because of the many choices it  has. When fire tv get's some more choices(apps) then I'll start to use it... Let's go amazon get some apps", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 3.0, "review": "Just spent the last five hours trying to get my new Fire TV and Bose speaker system to play nice. They don't. Can get visuals, but audio is not compatible. My next step it to try and Optical Audio cord (????) - got that info from an Amazon tech rep and he was great. So was the Bose tech rep. who ended up saying that the Fire TV was too new for them to have any troubleshooting info. Both reps were polite, funny, nice and I kept 'em on the phone for like an hour each.Anyway, buyer beware...", "verified": true, "helpfulness": "0/0", "author": "Adrienne J. Burfield"}, {"rating": 4.0, "review": "It works well!! Our only complaint is that there are limited free movies/shows available through Prime, Netflix and Hulu Plus. It seems like 60% of the shows we want to see you have to pay for or are not available. :(", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 1.0, "review": "BUT unfortunately I can't. I had everything connected and running in 5 minutes, but Amazon FireTV won't accept my sign-in information. It just says \"Sign-in failed\" over and over again. I went online, logged into my account (as per usual) just to make sure that I was using the correct e-mail address and password and still NOTHING. \"Sign-in failed\" I looked all over Amazon for help relating to this question and there was absolutely none. I guess I'll just return it and go purchase a competing product. I'm also re-thinking my Prime membership, as it is clearly less valuable since I can't even stream it using Amazon's own device.Poor form, Amazon. Extremely disappointing.", "verified": true, "helpfulness": "5/13", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This does not work as stated.  There is no help number to call to get help with it.  It's like they send it to you and then you're on your own.  We should have purchased through Best Buy the we would have had technical help.  We WILL be sending it back.  If there was a way I could give it ZERO stars I would have.", "verified": true, "helpfulness": "4/17", "author": "Pamela Fellows \"paniejean\""}, {"rating": 1.0, "review": "we did not like this product at all.  We couldn't believe that the very same shows that we had on netflex and the shows that we got with Roku for free, Amazon Fire Tv wanted us to pay for.", "verified": true, "helpfulness": "6/18", "author": "Amazon Customer \"peruser of The Word\""}, {"rating": 5.0, "review": "If you are invested in Amazon Prime then this is a no brainer.  Works wonderful, super fast, no buffering at all.  Streams in wonderful 1080P all my shows and movies. Netflix App works fantastic and streams with no issues.  I have Charter Internet and it works great with no issues at all.  I have just the basic cable channels that you have to have and this has become my go to device for movies and TV shows.  Great going Amazon!  Hmmmm now should get a Kindle Fire HDX to be able to download my Prime Movies...oh the delima! LOL", "verified": true, "helpfulness": "2/2", "author": "Jeffrey A. Higgins"}, {"rating": 5.0, "review": "This thing is fantastic!  No more storing dvds that you only watch once a year!  Also no more keeping track of movies your friends borrow.  Bam now all I need to do is sell all the old dvds except a select few so I can use the china cupboard for something else.  Hmm perhaps china that's a naval idea.  Only problem we had was a loading issue.  All you had to do was pull power cord and it worked just like you would a pc.", "verified": true, "helpfulness": "1/1", "author": "lizzy"}, {"rating": 1.0, "review": "Not worth the money and I'm stuck with it, i guess This so-called streaming device is constantly buffering. It takes 3.5 hours or . more to watch an 1.5 hr movie. This device needs a lot of improvement, the hoopala is all bogus.  My Roku is a much, MUCH better choice. I guess it's time to go on Facebook. AmaS Szon Fire TVUPDATE 05 16 2014I purchased this product, I think, before the update and wasn't aware of it before I sent that derogatory review. The update sold me on this exceptional product. It's faster than Roku, not much, and the graphics are exceptional. I'm keeping both devices as the Roku has more services/offers. I recommend both, they're nip n' tuck. I intend to reduce my dependence on Comcast.", "verified": true, "helpfulness": "4/12", "author": "slouchybud"}]