[{"rating": 5.0, "review": "this product is amazing, it went way over my expectations", "verified": true, "helpfulness": "0/0", "author": "merrily conrad"}, {"rating": 3.0, "review": "I've had some issues with this product after setting up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "remote eats batteries which effects voice search", "verified": true, "helpfulness": "0/0", "author": "Mark A. Hayes"}, {"rating": 5.0, "review": "LOVE!", "verified": true, "helpfulness": "0/0", "author": "Brandi"}, {"rating": 1.0, "review": "Bought Fire Tv during Sling tv promotion.  While it was working it is an amazing device capable of  running popular apps like other set top boxes. What seperates it from others is the hardware which has no trouble streaming shows/movies provided you have a good internet connection. Also since it is based on Android one could do other things with it make it very versatile.The bad:  Quality control seems to be an issue as others have experienced day one failures.  I used my Fire Tv for about 8 hrs and put it in sleep mode. Next morning Fire Tv had no lights on and was unresponsive. Amazon reps think its the power adapter and sending me a replacement.  Lets wait and see.", "verified": true, "helpfulness": "3/4", "author": "Anonymous"}, {"rating": 2.0, "review": "Great picture and easy to use but looses picture in middle of show, picture finally catches up with sound but it is a pain.", "verified": true, "helpfulness": "1/2", "author": "J. Clark \"J. C.\""}, {"rating": 4.0, "review": "A lot of reviews have been written about the Fire TV and its interface. So i wont repeat a lot of it. As of Feb/2015 it now has a Prime only category on the home screen. I know many reviews didn't like it mixed with paid content. It allows you to put your PIN on watching and / or buying shows. That's nice so people are not running up charges on your card. Over all the device works really well, the menus and content seem to load faster, start sooner and be more responsive then the Amazon Video app built into my Samsung Smart TV.Only thing to ponder which i didn't see anyone else talk about. There is no way / button / method to turn off the Fire TV box. Its always on, always watching unless you physically pull the power cord from the wall. (well joke about watching, hopefully.) Also when i un-boxed it and plugged it in for the first time my Amazon account was already filled out, it knew who i was. I know there has been some rumoring about how some Smart TV's and now Fire TV is listening to your home and uploading to cloud based data centers. Just makes me pause. I think its unlikely they are constantly recording people. I assume its only when you hit the voice activated search button. But why can't you turn it off?*** UPDATE ***Ive been using the box today. I guess its a little glitchy. I pre-purchase TV seasons, when new episodes are released they are added to my library. Today a new episode was released in season 6 of a show im watching. From the home screen i select my library, the first \"icon/tile\" is the cover art for season 6 of this show. I select it. But it loads season 1 of the show. I nav to the top and change season selection from 1 to 6, which then puts me on episode 1. Now i have to scroll to the last episode in that season... and the new release for the day isn't even in the list. It not there to be watched. I switched to the Amazon app in my smart TV and it works fine, the episode is there and it shows up on top of my library to watch.Also during all this drama, the Fire TV box library screen disappears and i get a message that connection to the servers has been lost with a retry button. Checked internet, have connection, open Amazon in smart TV and it loads my library. So... it wasn't my connection or the Amazon servers themselves. Whatever. I have not thrown it away yet, but its lost its wow factor.*** MORE ***Its been a few more days and the issue with new releases isn't a glitch, its a design flaw. It does it on every single show new release. If you wait till the next day it will sort itself out and work correctly. But when its first released its all messed up and not available in the library.Another feature that has annoyed me, is when watching a TV series it immediately starts playing the next episode before you have a chance to intervene. On the web and on my Smart TV after an episode ends, it goes back to the season menu and lets you decide when to start the next one.", "verified": true, "helpfulness": "1/1", "author": "Phil_whiteboy"}, {"rating": 1.0, "review": "I Can Not UseThis Box Offline! I Can Not Watch My Purched Vidows or Listen To My Purched Music With out an Internet Connection!!!!!!!!! If My CABLE IS DOWN SO IS EVERY PART OF MY AMAZON TV!!!!!!!! ZERO STARS!!!!!!!!", "verified": true, "helpfulness": "1/5", "author": "William Carl Carver"}, {"rating": 5.0, "review": "Hardwired to modem.  Fast. lots of choices. Although I need to use my PS3 to watch NHL gamecenter , I believe Roku and Apple tv have NHL apps.  Overall quite satisfied. Oh and need an easier way to turn off aside from going all the way down the menu then over to system then \"sleep\".  Maybe there is and i just havent found it yet.", "verified": true, "helpfulness": "1/1", "author": "jeff bowden"}, {"rating": 5.0, "review": "This was easy to set up and I love the variety of programming! I also both the Fire TV stick for my bedroom tv.", "verified": true, "helpfulness": "0/0", "author": "gorfi"}]