[{"rating": 3.0, "review": "Great technology, excellent quality. Particularly l loved the speech recognition through the remote control. However, I feel extremely frustrated not to access abroad US the best programs offered by Amazon such as Prime Instant Video. At least there should be an alternative program to replace it for international customers. Also the most of the best films are not available for rental.", "verified": true, "helpfulness": "0/0", "author": "Fabio Steinberg"}, {"rating": 5.0, "review": "Very satisfy with Amazon Fire TV", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Cool gadget but! Okay, the good, so cool, small, works perfectly, wow! The voice command feature is amazing, But! I got this because I want to cut that cable cord. I am paying for 250+ channels but like most folks I only watch maybe 30 but we all know you can't pick the 30 you like and just pay for those, you have to get the package. So, back to this unit. I thought you could download any apps... Since pretty much every channel I like has its own app now that would work perfect! Well, you can't! The apps are very limited. I ordered Amazon Prime and I have to admit pretty much every and any show I can speak into that small remote comes right up! BUT every show cost money! Current 1/2 hour TV shows are $2.99 each!! That is with the $100.00 a year Amazon Prime membership. That sucks!! This cool unit came so close to being perfect! It works great, picture is perfect, everything but content. There's show but not the stuff I'm looking for. I did more research and it looks like the hackers can do it but you have to hack the Fire TV system and I don't do things like that. If I am missing something folks please let me know. I am so disappointed, this unit is almost perfect! Just know before you buy it you can't watch the shows you want without paying for each and every show one at a time to the tune of $2.99 a show on the Amazon Prime membership!!! If I did that it would cost me around $50.00+ a day! Any advice from users that had this same experience but found a fix... Please let us all know. Thanks", "verified": true, "helpfulness": "0/0", "author": "Mike M. \"MrMikeFla\""}, {"rating": 5.0, "review": "We really like amazon fire tv. We also have apple tv but to watch the amazon prime movies and tv programs we had to use the ipad. With amazon fire tv we do not have to upload through the ipad, everything is done from the fire tv and we really like the voice recognition.", "verified": true, "helpfulness": "0/0", "author": "Robert Flowers \"florida  Bob\""}, {"rating": 4.0, "review": "Easy to set up and great interface in many ways.  Would like to be able to filter out prime movies.  Voice search great!  Wish it applied to other apps like Hulu or Netflix  Would prefer to be able to \"cast\" from my computer at times as it is sometimes more complicated and time-consuming to search on the screen - especially on YouTube.  Otherwise very easy interface...  Love it with those reservations.", "verified": true, "helpfulness": "0/0", "author": "Sharon D"}, {"rating": 1.0, "review": "few movies or tv shows", "verified": true, "helpfulness": "1/6", "author": "james jennings"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Larissa S."}, {"rating": 3.0, "review": "Some apps dont run smoothly and crash..", "verified": true, "helpfulness": "0/0", "author": "michael bell"}, {"rating": 4.0, "review": "Works great.  Just wish it showed you better on what shows you have watched.  My Vizio tv is better.", "verified": true, "helpfulness": "0/1", "author": "Brian"}, {"rating": 1.0, "review": "I have ordered 2 of these so far, one to replace the first one. They are awesome when they work, Both worked for about two days then it seems like the remote no longer works, I have tried four different sets of batteries. power cycled the box a dozen times, I have the latest update for the remote and the box. Still nothing. It was the same on both boxes. I am not going to try a third box. I may try it again when the forth or fifth generation comes out.", "verified": true, "helpfulness": "0/2", "author": "Arthur Barton"}]