[{"rating": 4.0, "review": "The Amazon Fire TV is pretty solid, but I wish it wasn't as proprietary as they make it.  Unlike their competitor Roku, the Amazon Fire TV will not let you compare the rates of a show or movie across multiple subscriptions (netflix, hulu, etc.  I really wish they would allow you to do this, as it would make the user experience way better and also promote willingness in integration.  Honestly, I am going to open up Netflix or Hulu if Amazon charges for the movie/tv show, so really it isn't saving them any money.  If Amazon has it free with my prime membership, just promote the video on their service in the master list; problem solved.Last, I think one of the coolest thigns with the Amazon Fire TV is the ability to sideload apps.  If you are willing to understand that an app isn't supported and are willing to do some homework, you can indeed put additional android apps on at your own discretion.  This allows the Amazon Fire TV to blow any other product out of the water.", "verified": true, "helpfulness": "0/0", "author": "stromb0li"}, {"rating": 5.0, "review": "The installation was simple and trouble free.  I have utilized the service to watch numerous movies and attempted one game.  Thanks for such an excellent product!  Robert Gray", "verified": true, "helpfulness": "0/1", "author": "Robert Gray"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV for my Samsung Smart TV....yes I know, I shouldn't need it, but since upgrading my router for faster internet speed on Verizon Fios my Family Room Smart TV no longer will connect or if it does it won't keep the connect very long.  I have changed out the antenna's on the router and bought internet booster for each floor...and needless to say, Verizon is NO HELP!  This little, and I mean little box, has solved my issues.  It's easy to set up, works like a charm.", "verified": true, "helpfulness": "0/0", "author": "edawson52"}, {"rating": 5.0, "review": "This blows my Roku 2 out of the water. Silky smooth transitions from screen to screen app to app. no hiccups, or lockups to speak of. The one thing I wish it had was the ability to play audible books, since my fiancee and I love to sit and listen to books, but then again, no one else is doing that either.", "verified": true, "helpfulness": "0/0", "author": "Snakeeyesesd"}, {"rating": 5.0, "review": "so very simple to install and a GREAT way to spend snowed-in days!!  We love it!", "verified": true, "helpfulness": "0/1", "author": "polkadot"}, {"rating": 5.0, "review": "This was a upgraded for me and I love the speed of it!!", "verified": true, "helpfulness": "0/0", "author": "MSU"}, {"rating": 1.0, "review": "I purchased this for the reason that it can be wired so I don't have to have wifi radiation blasting in my  room.  Well, even when it is wired up there is no way to turn off the wifi - customer service verified this.  I would buy again if this was corrected.", "verified": true, "helpfulness": "2/3", "author": "MG"}, {"rating": 4.0, "review": "I love this box in every way but one.We utilize Amazon Prime, Netflix, PBS, and Plex media Server and multiple other apps, and it looks like the  \"Voice Search\", which works beautifully, only searches Amazon's content.If your primary goal is NOT Amazon content, then this feature is pointless.I would have given \"5 Starz\"  if all my other apps were included in the search.Amazon!...if you read these reviews, PLEASE include ALL APPS in your Voice search or I personally will choose the Roku next time.", "verified": true, "helpfulness": "0/0", "author": "mssharonanne"}, {"rating": 4.0, "review": "... I know that there's many things I still need to learn.(i.e.:  should I be paying to watch TV shows if I have \"Prime?\"", "verified": true, "helpfulness": "0/0", "author": "Judy Bowen"}, {"rating": 4.0, "review": "Like on how well it does work!Would like to seem some \"live TV\" apps instead of just past episodes.The movies on Prime and Netflix do not have a lot of the current 'hot' movies. They do have a great amount of movie to pick from.", "verified": true, "helpfulness": "0/0", "author": "LeeAmaz07 \"l. s.\""}]