[{"rating": 5.0, "review": "I purchased the Amazon Fire TV because I love movies and old TV shows and would route them through my computer to my TV. Amazon Fire TV provides a much better, crisper picture than what I had been doing for both Amazon Prime and Netflix. It was easy to set up and the voice command has been accurate every time I have used it. I highly recommend to anyone who is looking to view Amazon Prime content or any other content... love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I am giving it three stars as I know its the first release of this product from Amazon and expect it to get a lot better in the next several weeks/months as firmware gets developed.Pros- easy setup, solid construction, voice search works well; Amazon's investment in this segmentCons- No unified search (have to do multiple searches (one for netflix, one for amazon prime, one for hulu, etc); Does not support MLB TV yet but I understand it will soon.In addition to the unified search, i would like to see the ability to control the Fire by my laptop or ipad logged into my amazon account.  (The fire comes registered to your Amazon account so it already has linkage, just can't start streaming or pick movies from the Amazon account.I also see that the IMDB site seems to be loosely linked with Amazon.  It would be really nice to have tight integration between IMDB \"watchlist\" and the fire TV.Keep going Amazon. I will upgrade you to 5 stars when the product gets there.", "verified": true, "helpfulness": "0/0", "author": "Photojon"}, {"rating": 5.0, "review": "No set up hassle.  When I use it the response is so very fast.  Love the voice search.  Look forward to update to allow access to my Amazon cloud music.", "verified": true, "helpfulness": "0/0", "author": "kerriesue"}, {"rating": 5.0, "review": "This is a great alternative to hooking the laptop up to the tv, or watching apps through a game system.  We rent/buy a lot of prime videos and it's great for watching them!  We are also subscribed to Hulu and netflix, but those both have a monthly fee...", "verified": true, "helpfulness": "0/0", "author": "Kari G."}, {"rating": 5.0, "review": "I love my roku 1 it is great. I have a chromecast as well. But this new box is great. Just need more apps and whatever someone thinks up. Cheap enough To have one in every house. I think it is just a stast to something big.", "verified": true, "helpfulness": "0/0", "author": "Toni T"}, {"rating": 5.0, "review": "I have been using the Fire TV for over a week now and I have been very impressed. Previously I was using a Samsung Smart TV to watch digital content and there was always a problem with things taking a long time to load and freezing even though the internet connection was fast. There is no delay with the Fire TV. The interface is user friendly and is similar to the Kindle Fire HD. The remote is a perfect size and has great range.I didn't buy the device for the gaming capabilities but I have been really impressed. SevZero which is included with the game controller is very well made and fun to play. Overall this is a great device and a great value!", "verified": true, "helpfulness": "0/1", "author": "P. Word"}, {"rating": 4.0, "review": "I've been playing around with the Amazon Fire TV for over a week now and I'm pretty impressed. I had Netflix on my smart tv but it was so slow that I didn't even use it. I didn't know if it was the wireless router or what.Plugging in my AFTV wasn't as easy as they claim because the picture didn't come on the TV (HDMI cable was loose), the remote didn't conncect (don't know why but I rebooted AFTV and it worked), and it wouldn't connect to my wireless network (I have a wireless extender and after I disconnected this AFTV connected and I rebooted the extender and everything was fine).As far as the speed, it's pretty impressive. Everything plays right away. The Netflix on my TV sometimes would take 5 min to play something. The speed alone is a reason to buy AFTV,The games seen pretty cool. I ordered a remote controller but they are on back order so I haven't played a lot of them. Again they load right away though.I really like having Pandora and IHeart Radio on AFTV as I can play them through my surround sound. They also load right away.I have two major complaints - First, Amazon Prime does not have it's on search category or grouping. Searching for free movies is a pain sometims. Second, the number of movies and TV available to Amazon Prime seems low. I do have a Netflix account so it's not a huge problem.I also feel that AFTV is new and they will come out with a bigger and better version in three months...For $100 I think that it is worth the price.", "verified": true, "helpfulness": "0/0", "author": "Bastogne"}, {"rating": 4.0, "review": "I ordered the Amazon Fire TV in hopes of resolving a wireless network issue we had in our lower level family room.  Access to Amazon, Netflix, etc. was going through an older Blu-ray player with the main router upstairs and a repeater in between.  Access was sometime good...but mostly only fair or not at all.  Received the Fire TV; installation was simple and it worked great immediately.  Wireless access has been strong and not a problem!!!  Husband is happy...and I no longer have to try to resolve the old networking issues every day.  Love that the Fire TV unit is small, compact and doesn't take up much space.  For us it was a great purchase.", "verified": true, "helpfulness": "0/1", "author": "pparker"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV because I love movies and old TV shows and would route them through my computer to my TV.  Amazon Fire TV provides a much better, crisper picture than what I had been doing for both Amazon Prime and Netflix.  It was easy to set up and the voice command has been accurate every time I have used it.  I highly recommend to anyone who is looking to view Amazon Prime content or any other content.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We received our Fire TV box yesterday and setup quickly and easily. Some apps aren't very polished like Netflix which needs some major work due to hangups and size of thumbnails not fitting screen well. As others have mentioned HBO Go isn't here yet but its only a matter of time. The UI is very intuitive and well laid out and fast to load apps, and buffer etc. We already had a Kindle Fire HD but unfortunately since it isn't 2nd gen we can't utilize second screen. We had to get a 15' HDMI to micro HDMI cable to connect it to our tv directly. I'm hoping Amazon can do a software update on the Kindle Fire HD 1st gens to help customers like us out. That or a 3rd party app becomes available. The voice control is pretty good but again I'm hoping Amazon realizes customers are screaming for it to search all their apps as well not just Prime. This would go a long way in taking Roku market share from the holdouts. We will wait and see what kind of games come out to determine if it's worth it to buy the controller. Overall happy to be rid of Comcast tv and the ill performing On Demand, big portion of the bill for that.", "verified": true, "helpfulness": "0/0", "author": "Electric Vehicle Outfitters, LLC"}]