[{"rating": 4.0, "review": "very good ,I liked", "verified": true, "helpfulness": "0/0", "author": "HUNG PHAM"}, {"rating": 5.0, "review": "everything I expected and more", "verified": true, "helpfulness": "0/0", "author": "JOHN COMINSKY"}, {"rating": 5.0, "review": "Perfect, as it should be.", "verified": true, "helpfulness": "0/0", "author": "Michael Price"}, {"rating": 4.0, "review": "I was trying to decide between anther Roku box  and a Fire TV box. Having being familiar with Roku I was leaning towards another Roku. I decided to try the Fire TV because of it's hardware and that I am a prime member. The biggest selling point for me was that I could do HDMI to the TV and optical out to the A/V receiver.The Bad:Out of the box I did not like it. It starts in prime which I kind of expected. However I thought it would start at your watch list. It takes a few clicks to get past recommended and new videos to your watch list. The other thing I do not like is how the watch list works. If you go to your watch list the movies and TV shows are together (this is ok). If you go to the TV menu you can get to your watch list TV shows (this is good). If you go to the movie menu there is no option for movies on your watch list (bad). The other thing I do not like is that the apps menu is at the bottom. I would like it at the top or better yet have the ability to change the order of the menus. That's it for bad. These are all inconvenience and can be fixed with software upgrades if Amazon so desires.The Good:This thing is a hot rod machine. It is very fast, has a great picture and great sound. The remote is blue tooth which allows you to hide the box and/or not point the remote at the box. The voice search works very well and solves one of the issues I mentioned above of the app menu being at the bottom. If you do a voice search and say the name of the app you can start the app there. It has all the major apps like Netflix, Hulu Plus and crackle. Netflix works the same way it does on a PC allowing you to use profiles unlike my smart TV's. I also like that it has all the major radio apps like Pandora, iHeart radio and Tunein.I would defiantly recommend this product. The more I use it the more I like it. The things I do not like are just inconvenience and not performance issues. If Amazon continues to refine this I think it will become the best box out there.", "verified": true, "helpfulness": "1/1", "author": "john"}, {"rating": 4.0, "review": "Great streaming device.", "verified": true, "helpfulness": "0/0", "author": "D. Hawkins"}, {"rating": 5.0, "review": "So far so good. Makes my TV a smart TV. Have been watching a lot of Amazon Prime and You Tube.", "verified": true, "helpfulness": "0/0", "author": "James Clayton"}, {"rating": 3.0, "review": "We have had Fire TV since April 2014, we liked it so much we bought a 2nd.  The Fire TV itself is great, but we have found that after a few months the service has significantly dropped off.  Let me explain - in the beginning there were no issues watching tv/movies, playback was smooth with no interruptions.  In the past 6 months the service has been so poor that we have been unable to watch most any shows without constant buffering.  I have been in touch with our DSL provider (AT&T;) and have even added a second satellite internet service (Hughes.net) to try and solve the issues.  AT&T; has upgraded our service, replaced lines, replaced routers and so on and yet we are still unable to watch.I have tried all of the trouble shooting options given to us by Fire TV FAQ help, with no solutions.  I must say that Amazon does generally notice when we have playback issues and often issues a refund for the movies we rent.  But why is there no solution for this problem?  One thing we have noticed is that SD playback is better than HD, but PRIME SD is not available for many shows (SOA for example) - HD is free with Prime but SD costs $.I love the idea of Fire TV and we still use it almost daily, but I wish the playback service was a better.  For now we suffer through.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Book Mama\""}, {"rating": 5.0, "review": "I love this addition to my tv viewing.  I received it as a gift!", "verified": true, "helpfulness": "0/0", "author": "N. Pocobello \"mystery lover\""}, {"rating": 5.0, "review": "Excellent--easy to use.", "verified": true, "helpfulness": "0/0", "author": "Terry Redd"}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "Anu"}]