[{"rating": 2.0, "review": "I was happy w/ the product for several weeks- really a good step forward for homes looking to ditch cable. The voice search works well, but unfortunately only w/ Amazon's content (you still have to do the clunky typing to search all other providers like Netflix, Hulu, etc.). but after 3-4 weeks, the remote stopped working. Amazon replaced it, so they stand behind it just fine.One remote reset trick is to hold the \"home\" button for ~15 seconds, which they say re-pairs the remote w/ teh box. that worked once for me, and only for about 20 seconds. then it was just dead until the new unit arrived.", "verified": true, "helpfulness": "2/4", "author": "Chris Yenkey"}, {"rating": 2.0, "review": "the amazon fire was advertise as 200,000 free movies, I cant get nothing free different from Bloomberg, I don't know if it don't work inthe Bahamas, if I am missing a way to get free movies mail me an update please, otherwise the item is no use to me.", "verified": true, "helpfulness": "3/9", "author": "peter rolle"}, {"rating": 4.0, "review": "Nice form factor.  Super easy set up.  Small.  Responsive.  The only drawback to this sweet little device is the lack of apps.  It is basically an Android device but missing some basics.  No VUDU?  That was a shock.  But this is way faster than the Roku when moving from screen to screen and for app start up.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon Fire TV is great, I just love  all it can do and it knows my voice so well and give me what I'm looking for to watch as movies to Netflix to games to play, Amazon Prime and so much more in fun. A great buy at a price you like. 5 star winner in my book. Amazon and Fire TV are good friend together to have in your life in all the good ways.", "verified": true, "helpfulness": "0/0", "author": "Ronald Brezenski \"poeronald\""}, {"rating": 5.0, "review": "I have been off of cable for about 4 years now. I have been using my XBOX 360 as my TV device. I dont play much video games.I bought a \"Smart TV\" about two years ago so that I could access netflix / Hulu / You tube without XBOX, but found that the UX was crap, network management was poor and performance was unacceptable so I went back to the XBOX.Just prior to buying the Fire TV, I used the Chrome cast that I bought my daughter for Christmas, Great performance for $35, but doesn't touch the Fire TV. Though I like being able to control the device from my Phone / IPAD or PC, I dont want have to use another device to access it. The Fire tv BT controller works beautifully.Well spent $99. Great design, Great performance, Great sound, Great picture. I haven't tried the gaming. I think I will check that out soon and update this review.", "verified": true, "helpfulness": "0/0", "author": "Michael Villani"}, {"rating": 1.0, "review": "Will not connect to a surround sound system that uses RCA cables without at least $35 worth of converters and extra cables.  Does not come with either HDMI nor the Toslink cables.  All you get is a remote, some batteries, a power jack and the device.  My Roku was a better choice.", "verified": false, "helpfulness": "2/17", "author": "Cobalt-Blue"}, {"rating": 5.0, "review": "I like this product. It set up fast due in part to my Prime account, and the interface is simple. Basically, about a 5 minute learning curve. It's hardwired to an ethernet cable, so I can't comment on the wifi performance.", "verified": true, "helpfulness": "2/2", "author": "Edmund C. Ritchie"}, {"rating": 5.0, "review": "Now I can watch all my favorite things in my 'Baby-Cave!'. Amazon Fire TV is so simple to set-up, it's small and discreet and the 'Voice' search mode is a joy to use. Movies, music, Youtube, etc., etc.. Amazon Prime is crystal clear, utilizing every aspect of the Amazon Fire TV's WiFi capabilities! Amazon not only provides the best internet shopping and shipping, it's now becoming a clear leader in providing it's own brand based products and media services! Amazon Fire TV is a must for those who enjoy the wide, and ever-increasing, home entertainment mediums! So, get one you won't be disappointed!", "verified": true, "helpfulness": "2/2", "author": "The Baby Neil"}, {"rating": 1.0, "review": "im a prime member and iheard this would be ideal for me but it would not stream amazon prime movies or utube. my brother is watching prime on his ps3. im very disssapointed and in all good counciess ness cant recmend anybody puchaseing this prduct", "verified": true, "helpfulness": "2/10", "author": "Douglas Slade"}, {"rating": 4.0, "review": "My son was in another room using his Kindle Fire HDX while I was watching a show on Amazon Prime, suddenly my show was not in my control.  My son was playing with the controls and the Bluetooth function was on.Love the voice search function.  Generally like the system but haven't had it for long yet.", "verified": true, "helpfulness": "3/4", "author": "Faye A. White-willinger \"Faye RN\""}]