[{"rating": 5.0, "review": "Fire was probably the easiest thing I have ever installed.  You plug in a USB cable, plug in the box and start watching movies.  It was pre-programmed with my Prime info so no setup was necessary.  Love it!", "verified": true, "helpfulness": "1/1", "author": "CountryGirl"}, {"rating": 3.0, "review": "Sounds like a great idea.  All this power, all those channels, and so much more, but no HBO GO?  Ever heard of a little show called Game of Thrones?  What about True Blood?  The Sopranos?  True Detective?  All these shows and more available for streaming at the touch of a button, on demand, at any time on any day.  What would a Saturday binge watch be without that option?  The one thing Fire is lacking is the one thing I and so many others find ourselves watching the most.  Until you're able to ink some kind of a deal with HBO, Amazon, I'll stick with my Roku.", "verified": false, "helpfulness": "2/6", "author": "R. Jordan"}, {"rating": 5.0, "review": "Got me to the channels I wanted fast and easier then roko", "verified": true, "helpfulness": "1/1", "author": "brown"}, {"rating": 5.0, "review": "I love my box. I can watch what I want when I want. I no longer have to attach my computer or kindle to the tv to watch Amazon Prime or Netflix.", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer"}, {"rating": 2.0, "review": "Good for about two weeks then constantly pausing to buffer its extreamly annoying.  If their is another device that doesnt do this none stop get it because this is horrible.", "verified": true, "helpfulness": "2/5", "author": "george"}, {"rating": 2.0, "review": "This is great if you dont care about Netflix or HBO Go...otherwise its a waste.  Will not let me log into Netflix...tried over 20 times....uninstalled...reinstalled.....wouldnt buy again.", "verified": true, "helpfulness": "2/8", "author": "Jim Willson"}, {"rating": 4.0, "review": "Noticed Amazon Music finally got added....deducted one start as there is no \"search\" feature in Music. With over 4 thousand albums Going fro A to Z ever time is a big hassle and if your thumb slips you are starting over. Also would like Sony's Music Unlimited as a available App as well As Cirus XM app.", "verified": true, "helpfulness": "1/1", "author": "David W. Hungate"}, {"rating": 1.0, "review": "The fireTV was a big disappointment I have constant hesitations in programs where you can hear the voices but the picture is frozen or the picture just pauses for a few seconds.  I am seriously considering purchasing the ROKU.  I don't recommend the FireTV.", "verified": true, "helpfulness": "0/0", "author": "Guy Smith"}, {"rating": 5.0, "review": "I love this thing almost as much as my Kindle!", "verified": true, "helpfulness": "1/1", "author": "poopuppy20032"}, {"rating": 5.0, "review": "Just bought it and loving it! I tried the MHL to HDMI cable because it was cheaper. You get what you pay for.  I love the Amazon Fire TV. I can watch my subscribed shows, it has app (could have more, but you get so much more than the MHL to HDMI) and it is worth the price.", "verified": true, "helpfulness": "2/2", "author": "AJ"}]