[{"rating": 3.0, "review": "has issues with downloading the Netflix app.", "verified": true, "helpfulness": "0/1", "author": "Danielle Whitaker"}, {"rating": 5.0, "review": "Love it!  If you like movies all day every day... you'll love it!", "verified": true, "helpfulness": "0/0", "author": "Monica Thain"}, {"rating": 4.0, "review": "Works great love it.. very simple to set up and use. Kids love the voice command option.", "verified": true, "helpfulness": "0/0", "author": "Lon Osborne"}, {"rating": 4.0, "review": "response fast", "verified": true, "helpfulness": "0/0", "author": "yuan wei"}, {"rating": 5.0, "review": "So far I am happy with the Fire TV.  It was really fast to get it setup, it is super easy to use and navigate and I am finding a lot to watch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is a great TV device. In fact, it may be the best on the market right now. So why am I giving it four stars? Believe me, it was a tough decision. First off, I want to say I've used just about every possible method of streaming digital content to my TV: multiple game consoles, Google TV (Logitech Revue), Chromecast, dedicated Android sticks (Tronsmart CX-919) etc. All have their pros and cons, and my old favorite (the Revue) just couldn't cut it anymore. Software support has almost completely dried up, and the aging hardware and buggy OS mean my three units were only working about half the time.Enter the Fire TV. There's not much more to say - if you're here, you've read the professional reviews and the countless customer reviews. It's a great little box. It's the fastest standalone media box I've ever used, and plays content flawlessly. The interface is simple. Load times are negligible (Netflix loads and plays faster than any of my other devices). I even got a cheap Logitech Universal Receiver and paired the keyboard/mouse combo from the Revue to the box following some simple instructions online. In short, I already said it: the Fire TV is the best standalone media device I've ever used.So what's the catch? Why knock a star? Software selection. There simply isn't enough support yet to fully recommend this box as a five star device. Now, not all of this is Amazon's fault. Certainly it's not the fault of the hardware - lots of places will tell you how to run software from outside the store on the Fire TV. But not everyone is a nerd, or interested in going through additional steps. For instance, one of my primary functions in life is family tech support. I can't expect my mother to understand or attempt these types of advanced - and potentially warranty-voiding - procedures. Glaring omissions from the app store include Xfinity TV Go and Starz Play. Again - this isn't necessarily Amazon's fault, as those app developers need to add support, but unfortunately in many cases a device is only as good as its ecosystem.Finally, another minor ding I would mention is of DLNA support for streaming content from one's own media library. However, there are plenty of options for anyone looking to be so intrepid (Plex or Kodi both spring to mind, the former being fully supported but paid and the latter being free but requiring a little tinkering).In conclusion, as a 'power user', I would give this a solid five stars. But from a public, straight-out-of-the-box experience, you may find some minor limitations. With support increasing all the time (HBO Go was a welcome recent addition), this could easily vault to an all-around five-star product. If your primary uses are Amazon video and Netflix, this is a no-brainer.**Note: I did not try gaming on this device, though I've heard it works just fine for what it's expected to do.", "verified": true, "helpfulness": "0/0", "author": "Tucker Hottes"}, {"rating": 4.0, "review": "Love it but was surprised that there wasn't a power button.", "verified": true, "helpfulness": "0/0", "author": "Karen Vaughn"}, {"rating": 5.0, "review": "We love it! We watch movies and play games on our fire TV.", "verified": true, "helpfulness": "0/0", "author": "Mayra Lala"}, {"rating": 4.0, "review": "It works flawlessly, I only with it had more prime time movies in the classic  genre, (40-60's era).", "verified": true, "helpfulness": "0/0", "author": "BOB K."}, {"rating": 5.0, "review": "Works great. Dissapointed that voice search is only available for amazon and not for apps like Netflix etc.", "verified": true, "helpfulness": "0/0", "author": "syd108"}]