[{"rating": 4.0, "review": "It is a great little unit and works great. The only frustration was in getting it to connect to my network. I called amazon help and all they could do was send me a new unit, and the unit wasn't the problem. After a lot of research on the web, I found one post (on a non-amazon site) that said to work the Fire TV needs network passwords to be alpha numeric, with no special characters. So I changed the password on my network to make it alpha numeric, and then the Fire TV connected to my wifi with no problem. It would have been nice if amazon had this fact somewhere in the instructions or trouble shooting information about the Fire TV. In any case, now that it is working, I think I will like it and use it a lot.", "verified": true, "helpfulness": "7/7", "author": "John L. Pearson \"jlarsp\""}, {"rating": 4.0, "review": "Search features are sorely lacking, organization is a mess, but the product is fast and reliable!", "verified": true, "helpfulness": "1/1", "author": "OrangeSpots \"OrangeSpots\""}, {"rating": 4.0, "review": "Not bad. I bought this to run XBMC so I could watch the movies I have stored on my media server. After having tried out the XIOS-DS, Raspberry Pi, and Ouya this has by far been the best experience running XBMC on a budget device. Being able to stream content via Showtime and access Amazon Prime movies is a definite bonus as well.I would give this 5 Stars if Amazon made the following improvements: 1) Add HBO Go (supposed to be in the works and available by year's end); 2) Make it possible to add shortcuts for side-loaded apps to the home screen. My biggest complaint with the box is that it is more locked-down than it really needs to be. It would be nice if Amazon made it easier for people who want to run apps that are not available in the Amazon App Store to do so.", "verified": true, "helpfulness": "1/1", "author": "Kyle"}, {"rating": 4.0, "review": "I love my Amazon Fire Tv box. It's easy to use and set up.", "verified": true, "helpfulness": "0/1", "author": "Sandra Chelf"}, {"rating": 5.0, "review": "I actually like this more than my appleTv- granted my apple is older. But this is easier to use and I love all the movies with Prime.", "verified": true, "helpfulness": "0/1", "author": "nicole s"}, {"rating": 5.0, "review": "I am addicted to the simplicty of this system!  Up and running within seconds and it was so easy!  I have already consumed one full season of an Amazon Prime created series and look forward to finding so much more to enjoy!  Who needs cable?  Amazon Prime gives you so much for a fraction of the cost!", "verified": true, "helpfulness": "1/2", "author": "Beth R"}, {"rating": 5.0, "review": "This can change the face of DVD rentals and I am loving it!", "verified": true, "helpfulness": "0/0", "author": "Mdunn"}, {"rating": 4.0, "review": "I like it only thing is it needs more apps", "verified": true, "helpfulness": "1/1", "author": "Dan"}, {"rating": 5.0, "review": "Awesome! Shop on Amazon Smile and you get great movies and shows free, free shipping on prime purchases and you donate to Rookie's Reward pet food bank! Love it!", "verified": true, "helpfulness": "0/0", "author": "Elaine"}, {"rating": 5.0, "review": "I like it", "verified": false, "helpfulness": "0/2", "author": "Amazon Customer"}]