[{"rating": 2.0, "review": "The mechanics of this works perfectly, but I wasn't aware that it would use so much of my Internet data. Way more expensive than cable or satelite tv. It is just not in my budget to use at this moment.", "verified": true, "helpfulness": "0/1", "author": "B. J. Nickles"}, {"rating": 4.0, "review": "great gizmo!", "verified": true, "helpfulness": "0/1", "author": "Brian J. Douglas"}, {"rating": 5.0, "review": "This is the best investment I could have made.  40,000 free choices are just way too many.", "verified": true, "helpfulness": "0/0", "author": "Lynn Mooney \"gizmo junquee\""}, {"rating": 5.0, "review": "This is a great product and easy to install", "verified": true, "helpfulness": "0/0", "author": "John McLeod"}, {"rating": 5.0, "review": "Love it!  My workout videos were purchased through prime and fire tv allows me to load them up and steam within seconds. I also love watching all my shows on tv as opposed to my laptop. I'm really glad they included games and I will be purchasing some soon. (I've already played and enjoyed some of the free ones.)My only complaint is with the twitch app. It seems that you can only watch the most popular streams and you have to really dig to find anything that's not on the front page. I wish they would add a category search and user name search feature.", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "Great HD and sound, Graphics in the games is great, I give it A+", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love the new fire tv. Have one for every tv in the house!!!", "verified": true, "helpfulness": "0/0", "author": "kathy"}, {"rating": 4.0, "review": "So far, so good.  The ESPN app is a little flaky. Overall load time for new video is reasonably brief, and buffering delays are minimal.", "verified": true, "helpfulness": "0/0", "author": "BobM1952"}, {"rating": 3.0, "review": "Great overall, but the voice search doesn't seem to support advanced searches. When you do a search for prime movies/shows it lists everything..including items you need to pay for. Also lack integration with other apps like net flixs apps. Should be expanded to allow voice searching within a 3rd party app.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome.  Rarely buffers despite multiple systems streaming at once.  Best Christmas gift!", "verified": false, "helpfulness": "0/0", "author": "Kimberley Lee"}]