[{"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/4", "author": "Othman Rashed"}, {"rating": 5.0, "review": "My son loves this!!  He watches movies and uses it all the time for games!!!  get the game controller for the kids!  It is worth every penny!!!", "verified": true, "helpfulness": "0/0", "author": "Heath Heimer"}, {"rating": 5.0, "review": "I love this little box. I can watch movies for free using Amazon Prime or I can choose to rent a movie. No signing up for a subscription service or going to a rental store for me!", "verified": true, "helpfulness": "0/1", "author": "S. Martineau \"working mom\""}, {"rating": 2.0, "review": "I have not bought this, but am reviewing the \"Comparison chart\". The Chart is out of date, AppleTV now has Showtime and since Amazon doesn't have iTunes (which isn't included on the chart as a content source) they are both on par with what they do and don't support", "verified": false, "helpfulness": "2/15", "author": "Justin Drew"}, {"rating": 5.0, "review": "Wow. Blown away. To be honest, the only reason I bought the Amazon Fire TV was because I had been trying and trying to play videos off my network on the DLNA player on my Blu-Ray. This was the most frustrating experience, with lots of incompatibilities, and when I got it to work the odd time, trouble with rewinding or fast forwarding. Oh, and the picture quality was crappy which I thought was just caused by the quality of the videos I ripped from my DVD's. Anyway, I got tired of fighting with my blu-ray and looked and saw the Amazon Fire TV had a DLNA player available within it, and I didn't see a ton of complaints from people trying to get it to work. I already have a smart tv with apps for Amazon VOD, and Netflix so I didn't need another provider for these services and only really cared about the DLNA client, and since this was only $99, I'd give it a whirl.Setup was a breeze, it came already tied to my Amazon Prime account. The hardest part (seriously) was finding the HDMI port on my tv. I had it up and running within 5 minutes of starting the install, and where my Blu-Way wouldn't work with most of the media servers I had tried to set up (Router, NAS Drive, Windows 7 Server) this worked seamlessly with all of them and would play all the formats I had. And my god...the video quality playing my DVD rip was seriously 10 times better than it had been on the Blu-Ray. This was a bonus I was not expecting. And nice things like FF and RW worked as they should. I am very happy.Another thing I wasnt expecting was to switch from my smart tv interface for Amazon VOD and Netflix to using the Fire TV interface. FireTV is much faster to move through the menus and I think the video quality is even better than it is going through my tv apps. I don't know why, but it looks like it is. The voice search runs perfectly as well. So, all in all. This was a killer purchase. It met all my key needs for playing my network video files, plus I got benefits from it I was never expecting in terms of better access and video quality on Netflix and Amazon VOD. And I haven't even plugged in the game controller I got yet. Seriously, this box is amazing!", "verified": true, "helpfulness": "3/3", "author": "Caper"}, {"rating": 1.0, "review": "Hey Amazon! NO VUDU, NO VUDU, NO VUDU????WHY?????Some of us have 100's of movies to watch on VUDU.NO VUDU = NO SALE!!!!!!!!!!", "verified": false, "helpfulness": "5/25", "author": "tthippy"}, {"rating": 5.0, "review": "This little box is amazing.  It runs so smoothly, and quickly.  The options of apps you can add to it is unbelievable too. This has been one of the best purchases I have ever made for a streaming device.  It works way better streaming than my Playstation 3 console, or the Blu Ray player I also use to stream.  For the low price that this item sells for, if you are a person that enjoys watching streaming videos from Amazon Instant Video, Netflix, or any other app you use, this is definitely a product you want to own. It was super easy to install, took about 10 mins at the very most.  Just make sure you own an HDMI Cable to hook up to the Fire TV and your TV, or make sure to purchase one with the Amazon Fire TV.  When you purchase this device, you won't regret it at all.", "verified": true, "helpfulness": "2/2", "author": "Scott C."}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "1/2", "author": "marcisa walker"}, {"rating": 5.0, "review": "Fire TV is great and really easy to set up. Lots of free programs on Prime. No problems so far.", "verified": true, "helpfulness": "1/2", "author": "Joe W"}, {"rating": 1.0, "review": "It seems the FireTV will not display Amazon Prime content when used with an HDMI converter.  I have a 35\" TV without an HDMI input. It's a fantastic with an absolutely beautiful picture. I've used an HDMI converter with other similar devices without any issue, but with Amazon FireTV, the Prime content typically cuts out after a few seconds. It has displayed an entire Prime show twice in about 100 attempts. It displays all free content, Youtube, Crackle etc without any issue. This is very disappointing, as it appears I will need to purchase a new TV to view my fully paid for  Amazon Prime content.", "verified": true, "helpfulness": "1/8", "author": "S. Com"}]