[{"rating": 4.0, "review": "This thing arrived yesterday and so just getting familiar with it.  We already have two PS3s, two ChromeCasts and an AppleTV3.The ChromeCasts work well for net stuff but for the living room...not the most user friendly devices for my non-techie wife.  Pros:  Cheap, small, easy to set up  Cons:  limited to streaming & web, wife needs instructions every time;  need laptop or computer to accessThe PS3s are far and away the best devices we have for streaming content Netflix, Amazon Prime, HULU et al; games and for our videos and movies from our NAS (network attached storage device).  Pros: Easy to use, universal, can access our movie, photo & music library.  Cons:  Can be pricey (figure $100-150 for a used one), bulky and put out a lot of heat.The AppleTV3 we bought mainly for mirroring our iPad and iPhone, a feature we don't actually use much.  Pros:  can mirror Apple products, works with iTunes  Cons:  doesn't work with Amazon Prime, you must convert your libraries to iTunes, the remote is infrared (line of sight),  the remote buttons absolutely sucks, Netflix takes a long time to load, it is painful to fastforward or reverse and impossible to do so accurately.  It is shocking how bad this product is.Amazon Fire TV:  it was a breeze to set up, the remote is RF (the unit can be placed out of sight) and feels significant in your hand.  FireTV responds instantly to the commands from the remote, you can navigate with precision.  The picture seems better than the AppleTV picture.  We haven't had time to explore all the features but it seems that it does not natively have a protocol to pull from our NAS movie library.  It is my understanding that there is a work-around with PLEX.  Stay tuned.We don't have the Roku but the specs (memory, processor et al) are better on this thing.  I don't mind the higher price b/c I'd rather have the higher performance.  After playing with the Fire TV for ten minutes I did pack up my AppleTV3 in the original box (it's a month old) and placed it for sale on CraigsList.", "verified": true, "helpfulness": "3/4", "author": "TheUnscented"}, {"rating": 4.0, "review": "We own a Tivo (with Netflix streaming), an Apple TV, and a Chromecast. I bought the Fire with my own money. (Amazon \"Vine Voices\" get Amazon Fires for free.)We prefer the Amazon Fire's big, bold interface to that of any of our other streaming devices. This little box is fast and responsive. It pre-streams the videos it thinks you'll want to watch, so content begins playing almost instantly. On our 60\" LCD HD screen, content is clean and crystal-clear. This is a much better solution than AirPlaying our Amazon Prime content from my iPad to the Apple TV.We've come across one very odd  quirk: when we (finally located) and turned on the \"Dolby over HDMI\" surround sound option, we experienced glorious surround sound on our Sonos system when watching Netflix or playing games ... and no sound at all when streaming movies from Amazon Prime. We've tested things pretty extensively, and only Amazon Prime programming is silenced under these settings. Having to turn this feature off in order to hear Amazon Prime streaming movies has been disappointing.In short: this is a fine little box. We think it would be better if there were One Box to Rule Them All -- a single box that could act as DVR and streaming player -- and, eventually, there will be. But for now, especially if you want one box that can stream virtually everything except your iTunes music, movie, and t.v. show purchases, this is a fine choice.Have lots of Apple gear (iPads, iPhones, etc.)? Get an Apple TV. If you have no deep investment in Apple's ecosystem, get this.", "verified": true, "helpfulness": "1/2", "author": "Mark McElroy \"www-madebymark-com\""}, {"rating": 5.0, "review": "Not sure why so many other people reviewing this want it to do everything that other similar items do not do either. I have two Apple TV units, and Fire TV, so far, is much nicer:the Bluetooth remote is great without line of sight required, is much quicker in response, and has better functions - movies load and start instantly, where Apple TV has some delay - the games are good quality and the game controller works great  (NBA 2K14 is really good, not PS4 good, but also only $7 instead of $60 and I'm playing on a $99 unit rather than a $399 game system)  - I get to choose which apps to add and am able to do so - set up was much easier and quicker than Apple TV - the home menu is much more user friendly.Yes, I don't have access to my iTunes library, but I don't have access to my Amazon.com video content on Apple TV either. Some people have talked it down because it does not have HBO Go ... but Apple TV does not have Showtime Anytime ... so there. Companies enter into \"exclusive\" contracts with other companies, and things like that happen ... it keeps thing competitive. Fire TV has been out since Wednesday and I already replaced Apple TV on our primary TV with it.I am really looking forward to seeing what types of apps are in the future for Fire TV.", "verified": true, "helpfulness": "4/5", "author": "D. Hull"}, {"rating": 3.0, "review": "UPDATE++ 4/6/14After a full 48 hours with this device, I have decided to return it. While I did like the interface and the speed of the device, I was finding that it was locking up several times. The remote was very odd and noisy and overall did not feel like I was getting more value from the Amazon Fire TV over the Roku 3. I decided to return it and hang on to my Roku 3.The main reasons for the return:1. The software does not seem refined and becomes very slow/lagged.2. The product itself seems to have been rushed out. I realize in the tech industry time is money, but this product seems to have been rushed by Amazon without proper testing.3. The remote control was very loud and annoying. I've been using a Roku remote for quite some time and it's whisper quiet. The remote that came with the Amazon Fire TV was very \"clicky\" and noisy.ORIGINAL REVIEW++ 4/4/14After 24 hours of use, I have come to the conclusion that the Amazon Fire TV will become the best streaming device available IF Amazon stays on top of software updates and continually listens to customer feedback and improves the device. Overall, I am very impressed with the speed of the AFTV. I also have a Roku 3 which I've been very pleased with as well.Pros --Very fast and easy to use interfaceGood app support out of the boxController easy to useSetup took less than 5 minutesCons --As a Prime member, I find I have to choose \"other viewing options\" on many movies to watch them for free.Noisy remoteOlder Netflix interfaceIf you are in the market for a new streaming device, I would highly recommend looking at the AFTV. It's a very powerful device and the fastest on the market. You can't go wrong with either this or the Roku 3. At this time, the Roku is better supported and has far more channels (apps) to download.I will continue testing my AFTV for the next week and update my review accordingly.", "verified": true, "helpfulness": "2/4", "author": "Joe D."}, {"rating": 5.0, "review": "I replaced a Roku with this unit. I also have Appletv on another set. The Fire is the fastest streaming I have experienced yet. Picture quality and interface are superb.This is close to home entertainment shangri-la.My dream is the day you will be able to say the name of any Movie ,TV show or music ever created and have it on your screen. This is a good step towards that.I haven't tried gaming but have ordered the controller.", "verified": true, "helpfulness": "3/4", "author": "R. Hanson"}, {"rating": 5.0, "review": "this is what I have been looking for small easy to use and the whole family can now watch my prime movies together on the regular tvthanks for as usual a great product", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer \"ani drolkar wangmo\""}, {"rating": 3.0, "review": "This is another ho- hum streaming box. The voice search is a nice feature, but it only works for the proprietary Amazon apps. My biggest disappointment  is that there is no access to the Amazon Cloud player. Perhaps Amazon will correct this with a future update. I regret the purchase. It is more digital clutter that will go unused.", "verified": true, "helpfulness": "3/7", "author": "Dandydoc"}, {"rating": 4.0, "review": "Ok so I have played around with it for only a few hours and I have been reading the other reviewers comments about it.  One thing that you have to keep in mind that this thing has just launched and there will be new things added to it.  You cant just rate it for what it is now.  Think about it:Quad core and memory - fastest out there (unless apple tv comes out with a better one)USB -not yet enabled but think why its there... there will be an upgrade for use (possibly connecting an external drive?)Games and Apps - its like how all things started... small but as time goes on and everyone else gets on board it will growRight now as it is I am giving it a 4 for the hardware and the games and for the apps content...", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The user interface leaves a lot to be desired first and foremost. Nothing is customizable, and searching through the Amazon Prime/Instant Video library is tedious unless you already know what you're looking for. The voice recognition feature does not work with searching Netflix, Hulu Plus, etc. It only searches within Amazon's ecosystem. Apps like Netflix and Hulu Plus constantly crash, and running YouTube is horrendously slow. I thought I could overlook the lack of HBO GO given the fact that Showtime Anytime would be available, but being a Directv customer, I do not have access to this app. I'm sure in a year from now, after many software updates this device will reach its full potential, but until then I'll stick with my Roku 3.", "verified": true, "helpfulness": "8/10", "author": "Spencer"}, {"rating": 5.0, "review": "Out of the box this is the best I have ever used.  I have used everything from the original Roku to the latest.  The Roku works and is effective but the remote is sluggish and moving between apps is sluggish.  I also use the chromecast that I like and use for mobile presentations from my kindle to clients but it is sluggish and limited compared to the fire TV or the Roku.  What can you expect for it's size and pricepoint.The Fire TV is responsive to the remote and the remote \"feels good\" in the hand.  Controls on the remote are well thought out and I especially like the way the voice search works.  You push the search button and speak while holding it down.  When you release the button it attempts to figure out what you said.  I have a Samsung smart TV that has speech but it does not handle it well... push the button and it eventually starts listening and then tries to figure out when you have stopped speaking and THEN tries to guess what you said.  The Fire TV is very accurate in  interpreting voice.  Best I have seen including PC voice recognition... of course it is looking at a subset of the universe of speech... movie/TV database.Search looks through the apps, amazon content and surprisingly, some of the other apps... not all as I expect all don't have API's available to search and cannot be always running and available for interrogation.The number of apps available is good, much better than earlier Roku units or Apple TV's initial try at it.  The only ones I am concerned with are Vudu and HBO Go and both are available on my Kindle Fire HDX which I use to connect to it with display mirroring.Setup of the box was a no-brainer.  Initially I connected via hard wire and it found the network automatically and pulled an IP via DHCP.  Make sure that the box is connected before turning it on or reboot it (unplug and replug it) if you didn't connect first.  Connection via wireless wasn't much harder.  It found all my (and all my neighbors) wireless networks and connected after I provided the password.  Speed of the network is smooth and downloads are very quick.  The normal buffering is very fast but I do have a fast network and my wireless router is wireless-n.I initially had issues connecting my kindle fire hdx to it via screen mirroring.  I went to kindle fire help menu (on setup home selection) and selected the option to call me back... they already had both my phone numbers and I received an immediate callback from amazon - 9pm at night in my bed.  :^)  The support tech was competent and got me going quickly (it took a reboot of my kindle fire hdx and the fire TV and we were in businessFor those of you looking for HBO Go that is the way to go :^)The games are very nice, but not what I will use it with.  The game that came with the controller - Sev Zero is very impressive and control of the game is quite responsive, consistent with my lack of reflexes and eye hand coordination.Overall, I am very pleased with the fire tv and it has already replaced my Roku 3 in the bedroom.", "verified": true, "helpfulness": "4/5", "author": "R. MIller \"RJMiller\""}]