[{"rating": 5.0, "review": "I was thinking to buy an Android based TV/Media Box. After some search I coudln't find a stable one except the Amazon FireTV. I am really happy that i gave a chance firstly to FireTV. It is amazing. Mirroring over my Samsung Galaxy device, web-browsing, apps, games and more thing that you can explore. I just would like to be more free inside the system but even with some limits on the system, this device will fit your needs. If Amazon could give us also some new limits which would cover Expert Users, it would be not just 5, but also a 6-Star device. If you are not sure, i would recommend and say just give it a try..", "verified": true, "helpfulness": "0/1", "author": "Akif Ozdemir"}, {"rating": 5.0, "review": "We got this for free when we signed up for SingTV and we absolutely love it. The menu is easy to navigate, the remote is uncomplicated and easy to use, and the voice search is easy enough to use that my three year old daughter can use it (sometimes with my success than others). We used only the Amazon Fire TV for 4 months over the summer when we canceled our cable and it was super easy to access all of our apps.", "verified": true, "helpfulness": "0/1", "author": "AKGOF"}, {"rating": 5.0, "review": "I haven't had cable in nearly 3 years and for the year leading up to my purchase of the Amazon Fire TV, I was using an Apple TV. Now, I'm not going to say which is better *cough Fire TV cough cough*, but I will say that they both have great features. We typically use the Amazon Fire TV in the living room for streaming on a daily basis and for fun games from Jackbox Games when our friends visit. If you're looking for a quality streaming device with the option to play mobile games, you will not be disappointed in the Fire TV.", "verified": true, "helpfulness": "0/1", "author": "Bryan Butte"}, {"rating": 5.0, "review": "good buy", "verified": true, "helpfulness": "0/1", "author": "Pattrian Darling"}, {"rating": 5.0, "review": "Extremely easy to use. I especially like the design of the password screen!", "verified": true, "helpfulness": "0/1", "author": "Lacey"}, {"rating": 5.0, "review": "This is at least our 5th purchase. We buy them for family after they visit our house and use our Fire TV. We love it and so do they. I swear my husband needs to become an Amazon rep so we can start making commission. Easy to set up and use and used every day in my house.", "verified": true, "helpfulness": "0/1", "author": "Gebicki"}, {"rating": 1.0, "review": "Product had nothing but problems.  OS crashes and remote disconnects.  Nothing specially and much less user friendly than Roku.  Only advantage is the ability to sideload Kodi/XMBC.", "verified": true, "helpfulness": "1/3", "author": "Mr. B"}, {"rating": 5.0, "review": "Fire TV is the best $100 Ive ever spent on anything. At first when I bought it I soon realized  that I was sick of how many shows I wanted to watch cost additional money. I slowly started using my Directv more again.After a couple months I went back and started using Prime Fire again and was happy to notice that there were so many new shows to watch that came with my $10 a month Prime  membership. If it wasn't for my stuck in there way's lazy roommates I would cancel Directv all the way. One of the best features is Prime Amazon can be used at anytime on any box in the house with my membership.To Date Ive purchased 9 Amazon Fire Boxes. I have one in every room of the house. I also have 2 just in my room.You can also pack up the little box and take it with you anywhere that has wifi pretty much and there you go and have everything on the road you have at home. One negative is that it has made me a bit lazier and I cant concentrate on one show enough as I know there are so many others to watch at the same time. Meaning it is so much easier to enjoy one show if you have no other choices. New Apps all the time.Some good some bad but this is a new and growing area which will continue to grow. The only COMPLAINT I have is that I have to unplug the box every couple days for about 5 seconds and then plug it back in and reset as for some reason the Fire box will only spin trying to start a show if this isn't done. Not the biggest deal as my box has easy access and I just unplug the power. A couple things they should do it make the buttons glow in the dark as I often push the wrong ones and stop my show and have to go back and start again.it does resume in the place left but the glow in the dark would also help to find the remote as I watch in total darkness often. Great Investment and from what Ive seen better than any of the competitors.  You wont be disappointed.", "verified": true, "helpfulness": "1/2", "author": "Cornelius Lucious Butterflake"}, {"rating": 4.0, "review": "It works well, especially if you have Prime, Netflix, and others.", "verified": true, "helpfulness": "0/1", "author": "Thinking man \"Sammy m\""}, {"rating": 5.0, "review": "I had to replace a new Roku 3 with a Amazon Fire TV.  The Fire TV provides clear and brilliant signal.  The Roku 3 kept dropping the signal to the TV, even though I tried 2 different new units.", "verified": true, "helpfulness": "0/1", "author": "Samuel Bohannan"}]