[{"rating": 5.0, "review": "Very fast speed and very explainable!", "verified": true, "helpfulness": "0/0", "author": "brian verhoeven"}, {"rating": 5.0, "review": "This is the best one compare to other boxes.  I have WDTV, Roku 3, Apple TV but none can compare to this unit.  It's fast and has nice interface.  I like the voice recognition feature.  The sound is also better than the others.  it comes with optical audio output.", "verified": true, "helpfulness": "0/0", "author": "Harry D."}, {"rating": 5.0, "review": "LOVE IT! I've been streaming through by blueray DVD player, but it keeps cutting off. This doesn't happen with the Fire TV. It's sooo easy to use and setup.", "verified": true, "helpfulness": "0/0", "author": "Barbara J. Longley"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "Beyond awesome! Best thing since canned beer.  I got this on Cyber Monday for $69.  I have a \"smart tv\" but it is plain dumb next to this new device.  Setup was easy as can be and now everything like Amazon Prime movies, Amazon Music, Netflix etc are at my fingertips. No jumping through hoops.  Just speak into the remote and it finds what you want to watch (within Prime movies not Netflix).  No typing.  If you are a Prime Amazon user and don't already have a media streaming device (Apple TV, Roku, etc), don't hesitate to purchase this! I'm doing a happy dance! Normally, I'm Apple all the way but I think Amazon is going to give them a run for thir money with this product.", "verified": true, "helpfulness": "2/2", "author": "Trish803 \"TrishN\""}, {"rating": 5.0, "review": "Great product and very good value for the price.  The packaging and user interface is excellent. I've bought two of them now I liked the first one so much.", "verified": true, "helpfulness": "0/0", "author": "Craig"}, {"rating": 5.0, "review": "Voice activation appears to only work for Prime and other related pay applications specific to Amazon..", "verified": true, "helpfulness": "0/0", "author": "Frank McCrink"}, {"rating": 3.0, "review": "Parental Controls?- If you are like me, the most interesting part of this device is the \"speak-and-search\" feature.  Especially for kids, they can just say \"Jessie\" and their favorite Disney show results will be there to select.  The problem?  That some zombie results show up right next to the picture of Jessie.  Sure they say they have \"freetime\" which is kid friendly.  But the issue with \"freetime\" is that the kids can not search any of the amazon instant videos.  The only things available for \"freetime\" is the movies that you purchased and any apps that you allow, like for example Netflix.- Another issue is that you only have the ability to turn on the \"PIN\" feature for everything or nothing.  So for my kids to watch \"Jessie\" they need the PIN the same as if they tried to watch \"Game of Thrones\".  Of course I want them to be able to watch \"Jessie\" at any time they wish without a PIN.  As a parent, I do not want to have to enter a PIN number every time their show is over to watch something else that is rated G.- Why not have the ability to say, only show results for n rating or only ask for a PIN for rating n or higher?- We have 4... yes FOUR of these things.  All are set without a PIN.  I just have to hope that when I am not watching, my little kids have not accidently selected a zombie movie.", "verified": true, "helpfulness": "3/3", "author": "MyReviewMyStory"}, {"rating": 3.0, "review": "Isn't quite as good as billed", "verified": true, "helpfulness": "1/3", "author": "BSM"}, {"rating": 3.0, "review": "My husband and I were looking for alternatives to high-priced cable and/or satellite subscriptions.  Fire TV is great if the shows you love happen to be available free on Amazon Prime.  Otherwise you'll still pay for every show either by the season or by the episode.  We are now considering returning the Fire TV and just sticking with Google Chromecast (which we already had) - you get much more for for a lot less money.  Had we realized we were still going to be buying our shows individually, we most likely would not have purchased the Fire TV.  So do your research before buying to make sure you are actually getting what you want.", "verified": true, "helpfulness": "3/3", "author": "Louise J. Dover"}]