[{"rating": 5.0, "review": "We have both chrome cast and amazon. We prefer the amazon.", "verified": true, "helpfulness": "0/0", "author": "Christina Keryte"}, {"rating": 5.0, "review": "I have fallen in love with my Amazon Fire TV :))", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Outstanding, five times faster than running movies thought out DVD player.  No more waiting to start a movie or show to start.  No more of the the movie stopping and buffing because of streaming speeds.The Voice search that actually works, Just ask for a movie, actor or genres and you get a list.Well worth the money, and if you get it on sale its a win, win.", "verified": true, "helpfulness": "0/0", "author": "David Lambert"}, {"rating": 5.0, "review": "I have used Amazon Fire TV for one week and I love it. I was already a Prime member. I am still trying to get my photos off my phone for slideshow.", "verified": true, "helpfulness": "0/0", "author": "Angela T. Nelson"}, {"rating": 5.0, "review": "Easy for anyone to set up. Great product.", "verified": true, "helpfulness": "0/0", "author": "Stephen Caro"}, {"rating": 5.0, "review": "Everything I expected and more!", "verified": true, "helpfulness": "0/0", "author": "Johnathon Norton"}, {"rating": 4.0, "review": "I love it so far, positive things.. very easy to set up and navigate and I am not a very proficient computer/electronic geek. It automatically has all the songs you previously bought from amazon and plays them with the words like Karaoke.  I highly recommend the searching voice remote! Expensive but well worth it to me. SOMETHINGS TO BE AWARE OF is that even though the Fire TV spouts Netflix, Amazon Prime and a ton of other aspects they are very limited unless you buy a subscription, (although first 30 days are free) and even when you get a subscription to Amazon Prime many main stream shows you have to pay money for, and if they are current shows you can only get many of them a few weeks after they air on regular TV & some you are limited to a few seasons so you cant always start from the beginning. You should get this and look at it as a menu to access all the TV shows that you can get on your computer free, like on regular Hulu. unless you go the extra $100.00+ that gets you Amazon Prime, Netflix  etc...yearly subscription.", "verified": true, "helpfulness": "1/1", "author": "Lita"}, {"rating": 5.0, "review": "If you are an Amazon Prime Member, this is a must have. Plenty of movie options,very easy to navigate and plays 1080p.", "verified": true, "helpfulness": "0/0", "author": "Paul T. Gabrys"}, {"rating": 5.0, "review": "Easy to use.  Picture is great.  If you have amazon prime this makes your prime membership well worth it.  You have access to a lot of free content and don't have to pay a fortune to watch the for pay stuff.  However im still not sure where the on/off switch is on the remote.  I got it for $69.99 and I think for that price it's worth it.", "verified": true, "helpfulness": "0/0", "author": "Joseph G Chandrankunnel"}, {"rating": 5.0, "review": "Voice recognition is clearly a benefit over competing devices and works well.  Quick and responsive.  Set up is quick.  I have a Roku and Apple TV and I turn to this first because of the remote.", "verified": true, "helpfulness": "0/0", "author": "David Kim \"dk\""}]