[{"rating": 5.0, "review": "Excellent.  operate the remote with the ipazzport fire tv keyboard, one assembly to control home entertainment devices.http://www.amazon.com/iPazzPort-Multi-Media-Entertainment-Presentation-KP-810-30K/dp/B00NN5OHG2/ref=sr_1_1?ie=UTF8&qid;=undefined&sr;=8-1&keywords;=ipazzport+fire+tv", "verified": false, "helpfulness": "0/0", "author": "Favi"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "victor gonzales"}, {"rating": 1.0, "review": "I tried to like Fire TV but I can't. All the shows I watch on regular TV I have to pay for them! I thought I was going to save money not have to spend more. $2.99 per episode is NOT my idea of saving money. The first one Fire TV I received I had to return. The sound would not work. I was on a call with tech support for 2 hours! It was a nightmare. The second one I received worked just fine but then the issue with Prime arose. I was a \"guest\" of a Prime Member and was removed so I could purchase my own and enjoy the free trial. That wasn't an option which is NOT a good sale. ALL new customers should be able to take part in the free trial. I was able to get that resolved and now I have to pay for the shows I watch. I would've thought with the extensive shows offered under Prime that would be the case.Maybe someone can shed some light on a better option?", "verified": true, "helpfulness": "1/5", "author": "Pureeloquence"}, {"rating": 4.0, "review": "This product is so much better to deal with than the annoying apple tv. However. I do wish that I had more on my apps. Not having Hulu is annoying. Hulu plus is more annoying. Overall though, this was a good buy.", "verified": true, "helpfulness": "0/0", "author": "Pedro"}, {"rating": 5.0, "review": "I have had 2 other media players before my Amazon Fire TV and I find there is no comparison. The ease of operation is by far the best. Also the speed of connecting to what ever app you choose is amazing. I joined Amazon Prime a few months ago but didn't take full advantage of the movies and TV they offered because during my leisure time I'd rather watch the big screen. Now with Fire TV it's right on the menu and I can search what I want with voice command.  When watching Netflix the movies start almost instantly and have yet to experience any interruption in viewing. With HULU it even lets me know when a new episode of my favorite show is ready for viewing.  Picture quality and sound are outstanding as well and have no equal to my cable provider. And just like all things Amazon the choices of apps are wide and varied with new ones added almost daily.  With my Fire TV, Amazon Prime, Netflix and Hulu I have said goodbye to my cable TV and enjoy more selection for less then .60 cents a day.  The best $99.00 investment I have ever made.  Don't forget the game controller. Thousands of games at no extra charge. Believe me in this day and age I seldom get a chance to extol a product with such enthusiasm but Amazon Fire TV and Amazon Prime will make you a believer.", "verified": true, "helpfulness": "1/1", "author": "warren root"}, {"rating": 2.0, "review": "REQUIRED ADDITIONAL ELECTRONICS, NOT USED , SENT IT BACK. DO NOT ORDER BEFORE REVIEWING AND RESEARCHING THE PRODUCE FOR COMPATIBILITY.", "verified": true, "helpfulness": "0/7", "author": "J. Emerson"}, {"rating": 1.0, "review": "do not buy does not work", "verified": true, "helpfulness": "1/12", "author": "Patricia Corona"}, {"rating": 5.0, "review": "Fantastic fiery speed.I've tried a few other devices and none come close to the speed of the Fire.  I'm very happy with the abundance of content which I know will only be growing.And, it has to be said, the voice search is just wonderful.  I'm British, living in the USA and it has no trouble with my accent.  Out of all the searches I've tried it only failed once and even then it gave me two options, one of which was correct.  It may sound like a gimmick but after one has used these devices and realizes how cumbersome it can be to search through menus, it turns out to be far less a gimmick and far more an essential aspect.", "verified": true, "helpfulness": "0/0", "author": "Ian M. Walker of Walker's Words"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "M W"}, {"rating": 5.0, "review": "Works best with Prime.  Netflix is clunky.  100x's better than chromecast.  The remote is very useful.  I thought that the voice search was gimmicky before I tried.  I was wrong.  It works great.", "verified": true, "helpfulness": "0/0", "author": "Luther Fan"}]