[{"rating": 5.0, "review": "It works.", "verified": true, "helpfulness": "0/0", "author": "Pawprint"}, {"rating": 5.0, "review": "Great, thanks A+", "verified": true, "helpfulness": "0/0", "author": "lt28b"}, {"rating": 5.0, "review": "I was so excited to finally order my Amazon Fire TV box. When it finally arrived I couldn't wait to hook it up! As an Amazon Prime member I was instantly able to enjoy all of the extras provided to a Prime member. I couldn't have been more surprised at everything available on the Fire TV box! The box is easy to use and it's simple to navigate the many options. I love the voice control option and I was pleasantly surprised at how well it worked. I'm so glad I made the decision to purchase the Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "Mande Sumner"}, {"rating": 5.0, "review": "It's awesome beats my Apple TV and my smart tv", "verified": true, "helpfulness": "0/0", "author": "kevin cunningham"}, {"rating": 4.0, "review": "Like it, learning to use", "verified": true, "helpfulness": "0/0", "author": "Ms. Do Right \"Blonde\""}, {"rating": 2.0, "review": "Not bad just very limited movies and TV shows included in Amazon Prime. Everything else (all the good ones) are for rent or sale.", "verified": true, "helpfulness": "0/0", "author": "Priscilla M Akuoko"}, {"rating": 3.0, "review": "Sorry, but Roku 3 is better...", "verified": true, "helpfulness": "0/1", "author": "Paul Sheyko"}, {"rating": 4.0, "review": "I was pleased except for one thing, the spotify app that amazon chose for fire tv will not operate alone, it only works with a tablet or phone. I have also roku, my roku does not need anything else, neither does the smart tv itself, I like the tone of music on FireTv they have improved it a lot from the beginning so I want to use that but I should have to involve another device like a phone or tablet, that makes it a pain, then you have to pair them etc, kinda loses the moment sometimes", "verified": true, "helpfulness": "0/0", "author": "Gerald Klein"}, {"rating": 5.0, "review": "Everyone needs one.", "verified": true, "helpfulness": "0/0", "author": "Tony Dorsett"}, {"rating": 5.0, "review": "I did a little research after deciding to cut ties with the satellite company and landed on this little nifty box. The apps are easy to download, including; Netflix, Slingtv, and Plutotv. The remote is super responsive and easy to handle.  I have yet to find something that irks me on the Amazon Fire Tv setup but so far I am completely satisfied. We are planning on buying a second for our basement tv setup once they have them in stock again.", "verified": true, "helpfulness": "0/0", "author": "L. Crane \"DizzyMizzy\""}]