[{"rating": 5.0, "review": "as good as netflix  maybe even slightly better, and two day shipping on amazonas a bonus what more could you ask for  ?", "verified": true, "helpfulness": "0/0", "author": "fanniesson"}, {"rating": 2.0, "review": "Has a tendancy to freeze up, and not work well.", "verified": true, "helpfulness": "0/0", "author": "CARISSA"}, {"rating": 5.0, "review": "I am one of those people that hardly ever watched TV until instant streaming was available. I hate spending time having commercial pushed on me in the middle of whatever I'm watching. Im also rather clumsy with remote controls, I just keep hitting wrong buttons and the screen goes to blue or something like that. Then I have to wait for someone to come around and fix the darn thing for me, so through out my life I have mostly even not had a TV.However I have to use the remote to put it on HDMI 2, which I can deal with and it takes me from all the traditional TV to the streaming that I want to watch. The Fire TV is so easy to use and if you are a Amazon prime member it's really a must have. You can talk to it, but if you go on for example Youtube you have to type in what ever it is you wanna watch.  Since I haven't watched much TV in my life there is a lot out there for me to watch. Even if I have to pay for some programs its well worth it. I live in the country and I depend on my entertainment to be at my home. I got this at a reduced price on Cyber Monday its proven to be worth every penny. I also learned to use it within 10 minutes. The Fire TV is somehow attached to you when you buy it so Amazon knows it's yours and there is really no set up time. The only thing it didn't come with a HDMI cable which you are going to need.", "verified": true, "helpfulness": "0/0", "author": "Embla"}, {"rating": 5.0, "review": "This product is amazing.  First, it was delivered very quickly and very easy to open and set up.  The audio and video is Theatre quality and the available apps are an added plus.  I will be ordering a second one.", "verified": true, "helpfulness": "0/0", "author": "Pilates Queen \"Pilates Queen\""}, {"rating": 2.0, "review": "My first thoughts coming out of the package were \"WOW!\" this Fire TV is going to be so cool. That statement and feeling was definitely the peak of my excitement. The setup was simple and the navigation fairly straightforward. However, when it came to playing content other than Amazon Instant Video, and lets face it - they don't have much content for prime members anymore, the box sucked! It can't even handle some of the most common audio codecs and even some very popular video codecs are missing. Why?!If they were attempting to create a streaming box to compete with the likes of Roku and Apple TV, they definitely failed miserably. Oh and don't get drawn in like I did for the cool \"voice search\" feature. It only works with Amazon instant video content. The voice search will NOT work in any 3rd party apps like Netflix, Plex, Hulu, YouTube, etc.So all in all, this box was a huge bust! Don't buy it unless all you use is Amazon content and I don't know a single soul that does that! LoL", "verified": true, "helpfulness": "0/2", "author": "Jeff W."}, {"rating": 4.0, "review": "Got my new Fire TV device yesterday and started playing with it. Pretty cool to be able to watch the Prime movies & TV shows with no extra charge if you're an Amazon Prime member. Prime offers some fairly new stuff, but I'd say probably 80-90% of the offerings are at least several years old, not a lot of current stuff, at least not that I could find (I didn't see the Sopranos on there, though I know it's on Prime).Here's the kicker, though. I had been watching a series on PBS (\"How We Got To Now\") and saw it on Fire TV so I decided to watch it there. Then I got an email \"thanking\" me for my purchase and a bill for $4.00+ with tax, for watching that show. There is probably a button I clicked that said \"Buy for $3.99\" or something, but there was no confirmation button and I didn't realize I'd \"bought\" that episode.  I wasn't careful and assumed there'd be no charge, especially since this episode is available free on TV.  $4.00 for a free show, and one that I already had on TIVO?? I can handle paying $4.00 for my mistake, but if I'm not very careful those little charges can add up quickly.So yes, I'd recommend the Amazon Fire TV box because it has enough good stuff on Prime to make it worth the price. And the voice search is a pretty cool feature...BUT if you get it, BE VERY CAREFUL because a slight press on a button at the wrong time and, bang! You'll get charged for something you didn't even know you bought. And unlike physical merchandise from Amazon, which has a great return policy, there is no \"oops\" button to cancel this kind of order or get your money back... at least not one that I have found.", "verified": true, "helpfulness": "1/1", "author": "J. Propp \"Interested in Everything\""}, {"rating": 4.0, "review": "I love the voice recognition. great quailty. I like it better than the roku", "verified": true, "helpfulness": "0/0", "author": "Duane Torstensen"}, {"rating": 5.0, "review": "This has been on of my best purchases yet. I completely did away with my Dish Network and got subscriptions to Netflix and Hulu Plus as I recorded most of the shows that I watch any way. I dont like that Netflix tends to buffer more than any of the other apps and that I have to pay to rent some of the movies that I watch, but over all I have been very pleased.  I like voice recognition in the remote and that I can watch live ESPN as well. It is easy to transport and take with me.  I recently purchased the stick as well and find both to be equally worth the money.", "verified": true, "helpfulness": "0/0", "author": "J9"}, {"rating": 5.0, "review": "Works very well. Great price.", "verified": true, "helpfulness": "0/0", "author": "Matt Britt"}, {"rating": 5.0, "review": "Screaming fast video loads - nearly real time for wifi streaming video on split network 20mbps internet, vs. our 4yr old streaming bluray on same wifi. Better buffering than our previous player, no lag or pause. TIny black box, single HDMI hookup to TV with exceptional picture quality and some nice screensaver scenery in case you let it time out. Quick start video if you need it. We were watching a show within about 2 minutes of opening the package. Easy to use remote, basic but does the job (does not pair with the TV to control your TV audio volume for example, only controls the Amazon Fire box). Bought it on a sale, but would buy again full price, very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Kim Hyers \"kim h\""}]