[{"rating": 5.0, "review": "This is amazing.  I am still learning all of the features I can watch and/or listen to.  Super easy to install and get linked on my WiFi.  No problem getting my Netflix account synchronized!  I did get Hulu which works without issue on Fire TV and with my Kindle Fire HDX.  I am not missing cable and can't thank you enough for this amazing technology which is saving me money!!!!", "verified": true, "helpfulness": "0/0", "author": "freeagentrocks"}, {"rating": 5.0, "review": "I love the Amazon Fire TV!.  I use it with my Kindle Fire and Display Mirror it.  I also use Prime instant video and Netflix as well as play a few little game on it.", "verified": true, "helpfulness": "0/0", "author": "Charles Compton"}, {"rating": 5.0, "review": "looks as good as cable picture, cheap, cutting cable", "verified": true, "helpfulness": "0/1", "author": "4suremann"}, {"rating": 5.0, "review": "love it!!! you gotta buy one. then cut the cord on all that pesky cable crap", "verified": true, "helpfulness": "0/1", "author": "jason morrison"}, {"rating": 4.0, "review": "For me, the only drawbacks are that the voice search will only work on Amazon and that I'm forced to go to the Amazon website to negate my viewing selections from spawning innumerable recommendations for me. Otherwise, the item is easy to operate and works very well with my wi-fi connection.", "verified": true, "helpfulness": "0/0", "author": "CAS"}, {"rating": 3.0, "review": "Faster than the Roku 3. Some things better, like AirPlay apps that you can't get on roku. Some things worse, like Plex app from 2011 that can't play DD 5.1, only stereo... what?Installed SPMC (XBMC port) and pleXBMC FTW. Not the bright future I was promised. Voice search only works for Amazon store. So much potential, but details suffer. Almost a good gaming box too.. but catalog too small. V2? it's already fast enough to be my preferred device, but the ecosystem / software constraints make me down vote....", "verified": true, "helpfulness": "2/2", "author": "jarom r lee"}, {"rating": 4.0, "review": "Works fairly well. It sometimes has issues staying connected to Pandora. Other than that, seems to be fine. Would be nice if the voice search worked with all services. Not just prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "great product", "verified": true, "helpfulness": "0/1", "author": "hannes ter linde"}, {"rating": 5.0, "review": "Easy setup and great search feature works great, if you want to purchase movies from Amazon (does not search in Netflix or Hulu Plus). My only disappointment is the lack of a Google Play app since I already have a collection of movies that I own on Google Play. Also, I have been waiting for six weeks now for the game controller I ordered. 2 day shipping is great unless it takes 2-3 months before it ships. Then, really, what's the point?", "verified": true, "helpfulness": "0/0", "author": "Jason Zohara"}, {"rating": 5.0, "review": "Surpassed my expectations. Great picture quality and fast. My wife and I watch all the time...and when we are not watching we are listening to music. Great purchase.", "verified": true, "helpfulness": "0/0", "author": "James E. Smith \"James\""}]