[{"rating": 1.0, "review": "Will receive moves but no volume. If your an expert at reading lips you will like this device.", "verified": true, "helpfulness": "1/9", "author": "Steve Sonnier"}, {"rating": 5.0, "review": "Best Streaming box in the Market.. Really look into what this box can do.. love my fire tv..", "verified": false, "helpfulness": "0/0", "author": "Roy Isidoro"}, {"rating": 2.0, "review": "WARNING: Check your internet speed before you purchase this item. I had it hard wired and it was the only device connected to the internet and I could not watch a movie without loading every 15 seconds. it said my internet was to slow but I have and LG streamer/blue ray player that works flawless with various other devices running on the net at the same time. I was highly disappointed and purchased another LG streamer for 36.00 and returned this item.", "verified": true, "helpfulness": "1/3", "author": "coby armstrong"}, {"rating": 1.0, "review": "UPDATE: Tore my entertainment center apart to find rearrange devices and use by blue ray's HDMI... Things are magical this Christmas morning to say the least!  Finally up and running and watching 007 Skyfall...  Audio and picuture do not match up at all.  Really not impressed with this so far.  On main menu the picture is blinking... Not sure if it is an issue with my Sony Bravia or not will have to play with it.  I will update if things get better, but this thing is probably going back to Amazon.Opened this Christmas morning 2014...  Really excited to try it out!  NO HDMI CABLE???  Seriously Amazon??? What is the reasoning behind that?  Now I have to go brave the crowds the day after Christmas to get a HDMI cable.  Thanks Amazon... you really thought of everything!!", "verified": true, "helpfulness": "1/11", "author": "Aaron Donat"}, {"rating": 5.0, "review": "So easy to install, up and running in no time. Be sure to check for up dates after installation. Some items were missing on the home page, namely the music option.", "verified": true, "helpfulness": "1/1", "author": "Geishee"}, {"rating": 5.0, "review": "very entertaining", "verified": true, "helpfulness": "0/0", "author": "KORBz \"KORBz\""}, {"rating": 2.0, "review": "I love this unit, but until Amazon can get me a remote that continues to work or that doesn't go through batteries in three days, this poor rating will remain. I  am quite disappointed in the fact that I've had two remotes I need to send back.Otherwise the box runs great", "verified": true, "helpfulness": "1/4", "author": "Andrew"}, {"rating": 3.0, "review": "It has a lot of great things about it. I'm just disappointed that Netflix won't work on it. It says it isn't compatible, which is weird since in the advertisement it shows that it is apart of it and should work. Being able to use netflix was one of the main reasons why I went with Amazon Fire and not something else. Hopefully it will work sooner or later.", "verified": true, "helpfulness": "1/5", "author": "Laura"}, {"rating": 1.0, "review": "Thi device is garbage, why do I need to turn my tv into a kindle, it serves no purpose, and is insulting to call it a gaming platform.", "verified": false, "helpfulness": "0/5", "author": "Dan C."}, {"rating": 3.0, "review": "I have an active Netflix subscription, however, I'm not able to navigate it or choose movies with Amazon Fire TV.  What is the fix for this?Thank you.", "verified": true, "helpfulness": "3/6", "author": "jameswhe \"James\""}]