[{"rating": 3.0, "review": "I would give it 5 star's if it supported Google's services, I do turn to my Chromecast more often because of Google music.", "verified": true, "helpfulness": "0/0", "author": "Barry E."}, {"rating": 5.0, "review": "Absolutely wonderful! Everybody should own one.", "verified": true, "helpfulness": "0/0", "author": "Ernesto rodriguez"}, {"rating": 3.0, "review": "Should be more free movies and games", "verified": true, "helpfulness": "0/0", "author": "matt lee"}, {"rating": 5.0, "review": "Exactly as advertised.", "verified": true, "helpfulness": "0/0", "author": "Thomas R. Chase"}, {"rating": 3.0, "review": "Very disappointed in the number of movies you have to pay for.  I wanted to watch a movie with Tom Selleck  made in 1980, I would have had to rent it for $3.99.  And it's not just movies, but old TV series you have to rent.  On the positive side, there are series produced for Amazon which are outstanding.  Would not highly recommend.", "verified": true, "helpfulness": "0/0", "author": "BRH"}, {"rating": 5.0, "review": "very simple to use with a lot of cool  features. I love it", "verified": true, "helpfulness": "0/0", "author": "Diana Oslin"}, {"rating": 5.0, "review": "works great, the spoken deal is terrific", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "I'm very impressed with the HD image, which may have as much to do with my FiOS signal as the Fire TV, but the combination means I get a crystal-clear image, whether it's Netflix, Prime, Watch ESPN, or History. It seems soooo stupid that in order to access Watch ESPN, you have to already have access to ESPN via a cable or FiOS operator, but that's not the Fire TV's fault. It's what keeps us from cutting the cord completely.I loved that when I plugged in the device, it greeted me by name and had my Watchlist queued up and ready. I can't find a way to turn the device off, but I haven't let that worry me too much. I haven't tried any games, but the TV-watching apps have all worked as well as I hoped.", "verified": true, "helpfulness": "0/0", "author": "J. Bohn \"nathanandjane\""}, {"rating": 5.0, "review": "Me and my wife love this we use it everyday!", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 4.0, "review": "Very happy that I finally purchased this product.  Would highly recommend to all.", "verified": true, "helpfulness": "0/0", "author": "Araminta R Hunter"}]