[{"rating": 5.0, "review": "I am very satisfied with Fire TV. It sets up easily...just make sure you have HDMI cable to connect to your TV.  The voice command on the remote worked fine right out of the box. Menu set up is good. Make sure you have your WiFi password to tap your network.", "verified": true, "helpfulness": "1/1", "author": "Stephen Zielinski"}, {"rating": 4.0, "review": "We like his new streaming system but I don't always like how the automatic search is always through Amazon. With the Roku I could search every app in there whole system more easily. There is probably a way on the Fire but I may not be as use to it yet. I like the voice command feature that can get be between apps much faster which is great. The other issues that we have with it I think are from our internet not the Fire itself. Overall very happy with the purchase.", "verified": true, "helpfulness": "1/1", "author": "Jubilee"}, {"rating": 4.0, "review": "I use this all the time. It's great.  Love the screen saver feature.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Magee"}, {"rating": 1.0, "review": "Buy one in April 2014 and other damage control is not a web browser.", "verified": true, "helpfulness": "1/14", "author": "Ramon Jaquez"}, {"rating": 5.0, "review": "OMG, I love this!", "verified": true, "helpfulness": "0/0", "author": "Debbie in Houston"}, {"rating": 2.0, "review": "I bought this for my aunt so that she could watch Netflix, among other things, on her tv. I am trying to update her on all the latest gadgets. The Fire TV works well for her, she is able to use it without any problems or confusion. I am however a little peeved that the VUDU app is not available on the Fire TV, I have a lot of content on VUDU, including Game of Thrones and I wanted to watch the show with her while I'm visiting. All of my devices at home have the VUDU app and I just don't understand why I'm not at least able to download it. Regardless she enjoys the Fire so I won't be returning the device(she already threw the box away) but I probably would have gotten her a Roku if I had the choice again.10/18/14 Update:After tinkering with it a little more, I have decided to bump my review down to two stars. It doesn't even have HBO GO! I didn't buy this for games or apps that are not mainstream. If it had all of the mainstream apps that typically come with similar products and Smart TVs, this device would be fantastic! But it's limiting my access to my content and I just wish I had done more research before buying. I really expected more from an Amazon product but I guess they would rather have you buy HBO content from their instant watch than have access to something you already have. For the record, I don't appreciate it when companies nickel and dime.", "verified": false, "helpfulness": "2/3", "author": "Serenity"}, {"rating": 5.0, "review": "It's awesome! I love that I can make changes to my Amazon account thru the Fire TV or the computer/mobile/tablet. Very quick & easy to set up & use!", "verified": true, "helpfulness": "0/0", "author": "Sonia R. Robles \"Sonia R. Torres Robles\""}, {"rating": 5.0, "review": "WOW.  This was the best 100 bucks I've spent in a long time.  Amazon has it figured out, there is no doubt about it.  Apple takes a back seat to this for sure PLUS with prime you can watch stuff forever for free.", "verified": true, "helpfulness": "0/0", "author": "R. Matthews"}, {"rating": 5.0, "review": "I love this thing.  I love the fact that I can sideload apps because it does not support UPNP.  But you can sideload XBMC so that I can stream all my movies, music, pictures from my local NAS.  If this feature was ever removed then it would not be worth it to me anymore.  It does have the PLEX app but I do not like plex as this little device is a beast.  The only thing is the apps are not really up to date.  Netflix is out of date and really wish Netflix or Amazon would update the app.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 1.0, "review": "would not recommend as a substitute for apple tv or any other streaming device. Device finds wifi connections but cannot connect even after a wifi booster was purchased. Several times  a week the remote will be unresponsive even after changing the batteries for brand new ones. When the device is connected it has variable frame rates and can either perform adequately or poorly, nothing really to be amazed at.", "verified": true, "helpfulness": "4/10", "author": "Parker Faul"}]