[{"rating": 4.0, "review": "Really like how easy it is to use... I enjoy using the apps.... The only change I would request is to have local channels...", "verified": true, "helpfulness": "0/0", "author": "Shell"}, {"rating": 3.0, "review": "This product has it's ups and downs.  Generally works but not as easy to navigate as first thought.", "verified": true, "helpfulness": "0/0", "author": "Marta S. Lewis"}, {"rating": 5.0, "review": "Very Good streaming devices... HD Quality", "verified": true, "helpfulness": "0/0", "author": "JV"}, {"rating": 4.0, "review": "Was jazzed to get my unit. Thought 300,000 channels was going to be overwelming, BUT... I find even with being a PRIME paying member, lots of shows are on sites like Hulu and they want you to pay a monthly fee to access many of the good shows. They give you just enough free shows to hook you, then let ya know the balance will cost you. My RabbitTV gives me more free hulu shows than my Fire does. Not to happy about this since I pay my Prime yearly fees, and thought that would do it to see quality shows and movies. I understand about Showtime and Netflix as they have always been a subscribe company.  If I had wanted to pay fees to watch tv, I would have installed Cable or Satellite. If it seems to good to be, it probably is.  I Do Like my Fire TV, just not the fees for so many things wanted to watch.  It would also be nice to know a show is a \"pay to view\" when doing searches instead of having to open each show. Frustrating.  Also, I bought my Fire TV while my Prime subscription is good and Fire keeps telling me I can see more shows after I join and pay for a Prime membership. I was told my Prime account was set up already when I received my Fire, but after 3 weeks I still get same message and cannot view the shows that are said to be available to Prime members. Calling Customer Service to get this fixed!!!!  Yes, Amazon Fire TV was super simple to hook up and use. Just hate those hidden fees to watch shows on certain sites.", "verified": true, "helpfulness": "0/0", "author": "Alienai \"Alienai\""}, {"rating": 5.0, "review": "so far this has been an excellent item would recommend to others", "verified": true, "helpfulness": "0/0", "author": "ic"}, {"rating": 4.0, "review": "Love it!  The only problem I have is you can not voice search everything.", "verified": true, "helpfulness": "0/0", "author": "klee"}, {"rating": 1.0, "review": "Not a good with wifi, same router as I use with a 5 star of other TV equipment, but this one is very slow on this device.", "verified": true, "helpfulness": "1/8", "author": "Rob Williams"}, {"rating": 5.0, "review": "Works as advertised. Wife and daughter use it all the time and seem completely in control of it.", "verified": true, "helpfulness": "0/0", "author": "daniel PS"}, {"rating": 1.0, "review": "Total dissapointmet!  Does NOT set up as advertised.  Does NOT prompt for a password, as do \"smart\" devices that recognize guest log-ins.  If these so-called smart devices are so smart, how come my iPod and iPad have no trouble recognizing the need for a guest log-in and don't require me to do any IP address bulls*t?  Sure, I can search through lots of places to figure this crap out - have done so too many times in the past.  Was led to believe it wouldn't be necessary here.  Not so.  Returned as soon as I started to even consider trying to mess with it beyond the advertised set-up procedure.", "verified": true, "helpfulness": "1/9", "author": "Bruce goldberg"}, {"rating": 5.0, "review": "This unit sets up in minutes and I love the voice search. No typing that takes forever. Buy a HDMI cord when you order as it does not come with one.", "verified": true, "helpfulness": "0/0", "author": "Construction guy \"Construction Guy\""}]