[{"rating": 5.0, "review": "Easy setup and works great", "verified": true, "helpfulness": "1/1", "author": "MICHAEL"}, {"rating": 5.0, "review": "I own a Roku 3, a Apple TV, and a Chromecast. The Fire TV outperforms them all. Very happy with it.", "verified": true, "helpfulness": "1/1", "author": "Donald Bair"}, {"rating": 5.0, "review": "I bought the fire tv for my children for Christmas. On the plus side they love it. Easy to use, easy to set up and I am a prime member so there is so many options to watch. The only negative thing is I have to pull my children away from it. They get lost in the Amazon fire tv. So now I watch tv in there room to spend time with them!", "verified": true, "helpfulness": "1/1", "author": "Iva \"crazy mom\""}, {"rating": 5.0, "review": "Love this...before purchasing Amazon Fire TV I had gotten a blue-ray player with Wi-Fi that would never connect to my home network.  This connected flawlessly.  I'm pretty sure that it took me longer to get to the electrical supply and plug it in that it took to connect to my network.I also purchased the total mount TV mounting system to hang it on the back of my TV so that I didn't have to have it laying on the stand underneath...This is a great way to use it, as Fire TV does not need direct line of sight to use the remote.It's very easy to tell which shows are included with prime as they are listed in their own section and also have a banner at the top of each show to let you know if the show is a \"prime\" show or not.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device. The ability to just say the name of the movie or command really beats having to type in the data.", "verified": true, "helpfulness": "1/1", "author": "bdl"}, {"rating": 5.0, "review": "I love Amazon Fire tv. Easy to set up and access. I only wish that you could access Acorn tv as you can with Roku. I enjoy BBC shows and Acorn allows a greater library of these shows.", "verified": true, "helpfulness": "3/3", "author": "Laurie"}, {"rating": 3.0, "review": "Too much viewing time is wasted by \"buffering\" It breaks the continuity of watching a program or movie.I called AT&T; and had them check the Internet speed and it is the max available in our area: 21.44 and 1.90We make sure there is no other use of our WiFi in use at the time. Our PC is Windows 8 and it is hard wired. The only other use is a lap top and two cell phones, none of which are in use when using the Amazon Fire TV. If you have any suggestions, please advise but it detracts tremendously from the use of the Amazon Fire.", "verified": true, "helpfulness": "0/1", "author": "Grampa3a"}, {"rating": 3.0, "review": "Everything I try to watch freezes! All I get is the darn buffering circle. Maybe it isn't the Amazon fire that's the problem I'm going to have it checked out by someone who knows better than I do.", "verified": true, "helpfulness": "0/1", "author": "gail"}, {"rating": 5.0, "review": "It is easy to setup and it's ready in less than 5 minutes.  The available movies are awesome.", "verified": true, "helpfulness": "1/1", "author": "Gary R. Smith"}, {"rating": 5.0, "review": "Best smart hub ever!!!", "verified": true, "helpfulness": "1/1", "author": "Freddy"}]