[{"rating": 5.0, "review": "It is very easy to use, and facilitates well my access to movies. It was very easy to install and I have had no difficulty with its operation.", "verified": true, "helpfulness": "0/0", "author": "Joseph C Rhea"}, {"rating": 3.0, "review": "Like the features but how do you turn it off once I'm done with watching? I'll revert back to tv mode but the box is still on. Worried about wear and tear. Other than that it still meets my needs.", "verified": true, "helpfulness": "0/0", "author": "Patriot Citizen"}, {"rating": 5.0, "review": "Supper!!  Love to use it.  Great another product from Amazon.  Looking Kindle for working with Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Frosty"}, {"rating": 4.0, "review": "Great device. It has only a problem: I can't use Amazon Prime outside the US.", "verified": true, "helpfulness": "0/0", "author": "Federico Manias"}, {"rating": 5.0, "review": "I have Apple tv and the Logitec Revue-this is much better.  Apple won't let  you get to amazon video and Logitec is slow. When I opened the box for Fire TV it looked like a black Apple- very sleek packaging.  When I turned it on it automatically put in my Amazon ID. Very fast - love it.", "verified": true, "helpfulness": "0/0", "author": "js"}, {"rating": 3.0, "review": "3 Stars. Right now, it's just ok. I pray I come back and edit this saying that I love it! There's nothing really that differentiates it from other set top boxes. Gaming isn't a selling point either on this as you're really just playing mobile games on your TV. HBO Go, Showtime apps missing. A big let down is that you can't access Amazon Prime Music from the box. Why? No reason given and it makes no sense. You CAN access your personal library though. If you want me to use that though allow me to import more than 250 songs without paying more. That should really be a part of the Prime package. Also, the organization of the apps is not laid out very well. It feels like a beta version and that's confounding because my Amazon experience is better on other devices. Also, it feels dangerously easy to purchase movies/shows that you can access for free via Prime. But if you're going to try to push me to purchase a movie or tv show, why not throw in the Blu Ray option as well?The interface is quick to load and the voice search does work, but there are many times I say something very specific, it understands it, I click the result, but it gives me the weirdest results. Also, I don't get why I can't use the voice tool to execute commands like a XbOne, I think that would be helpful. I'd also love the ability to control the volume of the program via the box as what happens is one show is louder/quieter than the other and then I have to go get the other remote - might as well use a Smart TVs built in functions instead of this box.One of the things that used to make Netflix great was the ability to easily explore and discover new movies and shows. And right now this box doesn't allow me to feel like I'm exploring anything, it feels like everything I have is pre-filtered and fed to me and not chosen by me. Maybe this is more of a qualm with Prime than with the box though, as also, the content is practically a mirror of what's on Netflix.In the end, it's a sleek right-quick box that does the same as other boxes. The GUI is a little rushed in design and kind of bleh. I do love the lyrics feed for music, the speed of the apps, and the slideshow is pretty. 1080p output is also a big plus over some. I got it as a gift so it's not something I'd return and we don't have a smart TV where it's hooked up and saves me from having to move my game systems from room to room to watch programs (unless it's something on HBO).My dream is that Amazon gets in bed with MSoft/PS and generates an app that allows me to stream my games over my network from the bigger boxes (a la the PS Vita TV). But I know that's just a dream.", "verified": true, "helpfulness": "0/0", "author": "TriLambdas"}, {"rating": 5.0, "review": "I love this machine.", "verified": true, "helpfulness": "0/0", "author": "P. Carter"}, {"rating": 5.0, "review": "I luv everything about it", "verified": true, "helpfulness": "0/0", "author": "phil sudkamp"}, {"rating": 4.0, "review": "I like my Amazon Fire TV.  The only thing I wish it had was a Prime Instant Video category.", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 3.0, "review": "It works fine, except on occasions we cannot get sound.  We tried replacing the HDMI cord, but it still happens.  Other than that, it is good.", "verified": true, "helpfulness": "0/0", "author": "Stanley P. Hallman"}]