[{"rating": 4.0, "review": "Great v1, but I'm excited for more games, mp3s and spotify.  Coming soon? Voice search works great. Better Netflix integration would be nice but the is up to netflix.  Reid? Are you paying attention?", "verified": true, "helpfulness": "1/1", "author": "Sioux Denim"}, {"rating": 5.0, "review": "Easy setup! Works great! We are very happy with quality of programing available and the simple use of the menu.", "verified": true, "helpfulness": "0/0", "author": "C. Howard \"watcher\""}, {"rating": 5.0, "review": "I have to say, the set up was not as easy as advertised for this tectard.  However, when I finally figured out that I needed to plug in to my receiver rather than the TV, and managed to get my WiFi password recalled, my four year quest to stream Netflix ended since we have never been able to get the WiFi to work reliably with our Blue Ray.  I'm also excited I can put my Amazon Prime membership to wider use and am planning to return some newly purchased, but unwatched, DVDs since I can now stream those movies through Netflix or Amazon Prime.  The downside is that I was unable to figure out how to set the Fire TV up using my newly and expensively installed internet hook up ($700 to run to a difficult to access part of my basement TV room) but am satisfied since I managed to get the WiFi to work.  So far, so good.", "verified": true, "helpfulness": "1/1", "author": "R. F. Nyeholt"}, {"rating": 4.0, "review": "This is a much cheaper option than having cable. So far everything has been working great- adding hulu subscription is worth it to get more current tv shows. It is a little confusing as to what is included with your prime membership as far as shows and movies since some have a price on them per episode but they are really included. they should say free with prime if they don't cost extra. Happy overall so far with cutting out the cable bill!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "First off Amazon as usual does a fantastic job on packaging making it safe and yet easy to open. I can't tell you of things I have damaged opening with a box cutter or something equally damaging. The navigation is simple and clean and I will soon add a Amazon Prime account when the title selection gets better but for now I will stick with Netflix. The only drawback of using Netflix over Amazon is that the voice feature only works with the Amazon website. Hook up was simple and I added the Amazon HDMI cable when ordering because it was cheaper than most others which I recommend you do. It took about 20 minutes to download and install the most current update and it was simple and did not require any computer ability. So far Fire integration only works with Kindle fire HDX, something I hope they add to Kindle Fire HD in future updates so if you have or want a Kindle reader keep in mind for you to use it with Fire TV it only works with the HDX with no current plans to add any of the current others. This could be useful if you want to continue watching something you have started to watch on your TV and wanted to take it to another room to watch on your Kindle Fire HDX reader. Although I love Apple products this seemed to have better support than Apple TV and I got the feeling that Apple was ignoring their product while Amazon is really behind this one.", "verified": true, "helpfulness": "1/1", "author": "Robert Suffecool"}, {"rating": 5.0, "review": "Easy to use, loads very quickly, simple to install, great selection. This streams better than my Xbox One and the search functionality on the fire works 10 better. I bought one for my mom and one for my dad and both of them have no problem using them without tech support from their son (Amazon made this thing really easy). The games are fun and I've been playing sev0 over titan fall on my Xbox because it is fun and challenging (disappointed with titan fall). This has taken a lot of friction out of my movie watching experience and I love the benefits of Prime. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Mike L"}, {"rating": 5.0, "review": "Everything it said was correct, so easy to use and the voice control is awesome. The others will have to a lot of work to get close to this product as it blew the competition away in all aspects.", "verified": true, "helpfulness": "0/0", "author": "Ronnie Powell"}, {"rating": 4.0, "review": "So I am the owner also of a chromecast. I purchased this when it released ASAP, being an amazon prime member, streaming media and game play were the plusses before buying.Pros:Build: very nicely built.. Slick gadget in a good weighted small box. Remote is sleek and beautiful, great hand hold, great buttons,..intuitive interface for anyone. Just plug in and go.Media: ability to stream right from your tablet off YouTube. Opens an even more arry of goodies.Apps: The ability to run apps and games (some) and optionally available game pad.Smooth: loads considerably faster than chromecast, no skipping and very little delay if at all.Cons: - tends to get hot sometimes, which possibly leads to occasionally freezing. Have had to reset a couple times.Mic: mic control is great, however, it's limited to the amazon collection only. Will not search YouTube etc.Amazon membership: being a prime member I would have expected more prime movies and tv but it's very limited. All the \"good\" stuff is purchase only.. Would love to see a broader collection.. Perhaps make just new releases purchasable.Games/apps: At this time there are only a very small handful of games and apps this can run, so don't expect to be looking through your whole android app gallery. The games so far aren't all that appealing yet. Looking forward to more.All in all a great buy. Maybe more expensive then you'de like but has other options for membership like hulu for example. It would be really well worth it with a broader prime choice.", "verified": true, "helpfulness": "0/0", "author": "Songfeather \"Angie m muller\""}, {"rating": 5.0, "review": "Fire TV adds value to my Prime membership. Fire TV has all the programming I needed and the voice activation feature works very well and saves time.", "verified": true, "helpfulness": "0/0", "author": "Joe OHara"}, {"rating": 5.0, "review": "Product arrived quickly and set-up took less than 10 minutes from opening the box through software setup (including update over the Internet to current version).  The voice search function works incredibly well.  I was watching my first movie within seconds.", "verified": true, "helpfulness": "0/0", "author": "Customer"}]