[{"rating": 5.0, "review": "AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Mark K. Fritz Jr."}, {"rating": 5.0, "review": "this is an awesome product. very responsive and tons of content. we use ours constantly and got rid of cable. app selection is ok but is picking up but overall a GREAT product.", "verified": true, "helpfulness": "0/0", "author": "desertotter"}, {"rating": 5.0, "review": "Quick and easy set up. Apps and prime are great.", "verified": true, "helpfulness": "0/0", "author": "BostonGirl80"}, {"rating": 5.0, "review": "Great to be able to watch movies and TV programs without constant interruptions from advertising. We're glad we have the system. It was easy to set up once we swallowed our words of \"we're too old to figure this out\"!Thanks!", "verified": true, "helpfulness": "0/0", "author": "Cool Granny"}, {"rating": 5.0, "review": "I am very pleased with my purchased I attached it to a 9 year old set and all is good the picture quality and sound are working great haven't tried the voice yet. Setup was very easy.  Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "regina jenkins"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Jan Leeder"}, {"rating": 5.0, "review": "I really love it...  The netflix interface takes a bit to get used to and there needs to be a tactile feedback of some sort between the home and the pause button because I keep mixing them in the dark.  All in all, I'm pretty happy with this impulse self gift.", "verified": true, "helpfulness": "0/0", "author": "Jrandomguy"}, {"rating": 5.0, "review": "I am thoroughly enjoying my Amazon Fire TV - especially after cancelling cable TV. Great movies, shows, games, etc. The system is so user friendly too. I am somewhat of a senior citizen, and had no problem hooking everything up myself! Love it!", "verified": true, "helpfulness": "0/0", "author": "JOLYN MOUNTJOY"}, {"rating": 5.0, "review": "We love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "dboyd"}, {"rating": 5.0, "review": "Love it. Wish voice command works with Netflitx.", "verified": true, "helpfulness": "0/0", "author": "Elio F."}]