[{"rating": 5.0, "review": "Easy to set up; easy to use. Great selection of movies and television programs. The ability to watch something, pause it and come back in five minutes, or an hour or a week and pick up right where you left it is great. We may never watch broadcast TV again.", "verified": true, "helpfulness": "0/0", "author": "Larry Rogers"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "tera"}, {"rating": 4.0, "review": "I am pleased with Amazon Fire. I was surprised that so many of the movies were for a rental fee. I can understand the most recent movies had a fee, but not movies that were much older.", "verified": true, "helpfulness": "0/1", "author": "Howard Meagle"}, {"rating": 5.0, "review": "I love this little device.  It was so easy to put together and set up.  I was watching in such a short time period.  I still have more to learn about all that Amazon Fire has to offer but so far so good.  Love this", "verified": true, "helpfulness": "0/0", "author": "B Kerber"}, {"rating": 5.0, "review": "This is a true plug and play device and it is awesome. My entire family loves it. They have fixed the menu problems others mentioned and it has easily already paid for itself!  Any Prime member should have one of these.", "verified": true, "helpfulness": "0/0", "author": "D. Carrico"}, {"rating": 5.0, "review": "Amazon Fire has plug and play simplicity and an amazing menu of selections.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!  It was easy to install!", "verified": true, "helpfulness": "0/0", "author": "Sharolyn S. Kawakami \"Books4salebyLilolani\""}, {"rating": 4.0, "review": "The installation was easy, and very smooth.  It was simple to also move from one TV to another set in the house.  However, I took the system with me on a trip to Europe (Switzerland), and almost all content was blocked.  I understand that there are copyright issues, but to find that not a single item was possible to view, even using local stations in Switzerland, and neighboring countries, not to mention the numerous English language stations from the UK, Germany, France, Italy, etc., was very disappointing.  Too bad, unless Amazon Fire TV has a solution, this is a handicap for world travelers.  Help, anyone?  The Amazon Fire TV Web page covers everything else.", "verified": true, "helpfulness": "0/0", "author": "Betsy Greene"}, {"rating": 5.0, "review": "Love it! User friendly! Worth the price!", "verified": true, "helpfulness": "0/0", "author": "Daizee888"}, {"rating": 4.0, "review": "i'm addicted!!!", "verified": true, "helpfulness": "0/0", "author": "Jeff Fischer"}]