[{"rating": 5.0, "review": "Better then Apple TV!!", "verified": true, "helpfulness": "0/0", "author": "Nichole Smith"}, {"rating": 1.0, "review": "I would rate this at 5 stars if I could get Netflix to work on it.  After 5 different machines and hours scouring the internet the only way I can get Nexflix to work on it is to direct wire it to the modem.  Amazon Prime works fine as does everything else.  I would normally have given up by now, but I am really hoping I can figure this out and get it to work wirelessly with Netflix.  Tech support for both Netflix and Fire TV have been pretty much no help.  Sooooo if anyone can help me solve this problem please email me!", "verified": true, "helpfulness": "2/5", "author": "Jack Sherlock \"Jack\""}, {"rating": 4.0, "review": "Very good product", "verified": true, "helpfulness": "1/2", "author": "patrick goodman"}, {"rating": 5.0, "review": "This is the best purchase i have made as far as tv accessories. It is so easy to use. Lots of movies from Amazon. Mic works great. I never have to repeat myself. As many know, when you have to pause a movie, it lasts for 20 minutes and times out.You then have to start over or search to where you ended. I have paused movies on my fire, come back 5 hours later with the beautiful screensaver on, click the arrow on the remote and movie continues. It is also easy to find movies. I have a hard time on comcast  on-demand. It is also very easy to watch series. When the episode you are watching is about done, there is an icon on the bottom right that looks like a dvd cover. All u do is click it to go onto the next episode. Just love it.", "verified": true, "helpfulness": "2/2", "author": "Chris Muise \"Indigo326\""}, {"rating": 5.0, "review": "Great product easy to set up and use, great picture.", "verified": true, "helpfulness": "0/1", "author": "Mark Peacock"}, {"rating": 5.0, "review": "Love Prime TV!  Supports most popular apps and is easy to set up. A no brained if you are a prime member. Tons of tv and movies and the prime original series are pretty good.", "verified": true, "helpfulness": "0/0", "author": "Garrett Graham"}, {"rating": 5.0, "review": "Amazon Fire TV is one of the best purchases I have made for my entertainment.  A few of the things that shine about this device.-The picture quality is perfect.  I use Fire TV cabled directly to a 100m port on a firewall so not sure how everything works via wireless.-The voice search works every time and just makes getting what you want quicker and easier.-If you are watching a series it remembers what series and show you stopped at.-There was no setup because it came configured with my Prime Account.", "verified": true, "helpfulness": "0/0", "author": "Dean VoIP \"Network Analyst\""}, {"rating": 4.0, "review": "I wish there was a sleeper timer on this.  There is the sleep option but I like to fall asleep to whatever it is that I am watching.  A sleep timer on this would be a 5 star rating. Overall, love it.", "verified": true, "helpfulness": "1/1", "author": "Lynn"}, {"rating": 2.0, "review": "Two stars - One each for each Fire TV I own. No stars for the Fire TV Stick.I have a few media servers. Roku 2, Roku 3, Google ChromeCast, neoTV, Logitech Revue, Visio Stream, and a few more that just don't matter.When Amazon first came out with Amazon Fire TV, I was excited. I know Amazon's commitment to customer satisfaction, and that gave me comfort to expect Fire TV to blow everything else out of the water. So I purchased Fire TV when it first came out. Then my son brought me one for my birthday and a Fire TV Stick for Christmas (the dates are fairly close).I'm much more impressed with Amazon's Fire TV Stick than with Amazon's Fire TV. I've been nothing but disappointed with Fire TV. Well, I can't say it's all bad - I do like the feel of the remote included with Fire TV. Not so much the Stick's remote. But the Fire TV remote is the best thing in the box. I have two - so two stars for the remote.Maybe Fire TV will grow on me once they get enough apps. My Roku allows me to watch anything I want to watch. From channels ABC to Zoo TV, and anything from my computer. And my computer contains some great video apps that are easily pushed through Roku. Not to mention, the Roku supports PlayOn and PlayLater while Amazon Fire TV doesn't. That distinction alone is enough to pass on this box. If Roku's remote felt like Amazon Fire TV's remote, Fire TV would get zero stars from me. Roku offers so much more. I keep waiting for Fire TV to catch up. But I'm tired of waiting and will only recommend Roku to family and friends (and you).I'm so disappointed Amazon didn't get this box right before they launched it. I'd tell you about all the freezing, crashing, and other things I hate about Fire TV. But the list is too long and I'm too lazy to go through it all.I'm completely happy with my Roku. I use it all the time. And every time I use it, I get even more upset with Fire TV. I own a Fire TV, a Fire TV Stick, and another Fire TV that just aren't worth using.ROKU FTW!!!Give Fire TV another year and see if they sort out their shortcomings. But for now, do yourself a favor and pass.", "verified": true, "helpfulness": "0/3", "author": "Dennis Johnson \"Shopper\""}, {"rating": 4.0, "review": "Nice equipment very powerful.", "verified": true, "helpfulness": "0/1", "author": "Jose R Hernandez"}]