[{"rating": 5.0, "review": "I purchased the Amazon Fire TV for my father for a Christmas present.  I needed something that was simple for him to use.  It was incredibly simple to set up. Once I set it up for him, the first thing he tried after getting on prime  instant video, was the remote that has voice activation.  What a brilliant solution to put on a remote for those that are not technology savvy.  He said \"Frank Sinatra\" and wham o, all of Frankies movies appeared! My father said, \"well I'll be damned, look at that\"!  It's the small things in life that delight us.  That certainly delighted my father, as it did for me to see his reaction. It was such a joy to see him so pleased with himself.  My father mentioned that he thinks there are a few of Frankies  movies he hasn't seen yet.The whole Fire TV package is simple to use and worth every penny.  I am not a wiz with technology, but I could set this up and move about on the screen with no problem.  I set up Netflix with no trouble at all.  The fire TV plenty of apps to choose from.  I wanted something that would give him both Amazon prime instant video and Netflix.  This was the whole package.  I purchased it on black Friday for $69.  I doubt it will be that price rangeanytime soon.To bad, I would buy one for myself! I realize that this review is not giving the techy stuff that some of looking for.  I simply don't have those skills, but for the novice, I hope this helps you out.", "verified": true, "helpfulness": "1/1", "author": "precious pup \"P.p\""}, {"rating": 4.0, "review": "I like it alright, But there's a lot of things to pay for. I'm trying to get use to it, but it may take some time.", "verified": true, "helpfulness": "0/0", "author": "thomas miller"}, {"rating": 4.0, "review": "Fire TV works as expected.  Amazon Instant Video is a big disappointment.  I do not see a way to search for free videos on Fire TV  (web interface does have this ability).  One video I watched had commercials just like cable TV (what gives?).  Content availability is much less than expected.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 4.0, "review": "Have had some issues and had to do a factory reset within a week of getting it. But have had no problems since and love it!", "verified": true, "helpfulness": "0/0", "author": "Lauren Engels"}, {"rating": 3.0, "review": "Amazon you really need more TV entertainment apps, such as directv, dish, bravo, amc, stars, Discovery, national geographic etc.  PLEASE!", "verified": true, "helpfulness": "0/1", "author": "Whaling's"}, {"rating": 5.0, "review": "Love the Amazon Fire TV, the voice command is really nice option and the menus are easy to navigate.  We do experience some issues with streaming, have AT&T; coming out to make sure internet is working as required.", "verified": true, "helpfulness": "0/0", "author": "Machell Enke"}, {"rating": 5.0, "review": "Easy to use, lots of great apps.", "verified": true, "helpfulness": "0/0", "author": "Gary Shipley"}, {"rating": 4.0, "review": "We have just started using, but find a nice selection of movies to watch that are Free, several of the ones we wanted to watch, had a small fee, that we put off for now.  More we use i'm sure we'll see a great benefit - and even the ability to get rid of any movie channels we have with our TV service which would save a great deal of Money. So we are very satisfied to date with the use of this fun addition to our movie / video watching", "verified": true, "helpfulness": "0/0", "author": "D. S. PARSONS"}, {"rating": 5.0, "review": "Nice, easy to use, another great Amazon product.", "verified": true, "helpfulness": "0/0", "author": "alpha-dog"}, {"rating": 5.0, "review": "I was thrilled with the product, but  use it due to slow internet speeds", "verified": true, "helpfulness": "0/0", "author": "Ruth G. Kunzi"}]