[{"rating": 2.0, "review": "The interface was pretty enough. I was looking forward to the voice search feature, but that turns out to only with within the Prime library (which was extremely hard to navigate efficiently). One main reason I wanted to try it was for Plex functionality. App barely worked, but the Plex app on my Roku works wonderfully. Even the Netflix app was shoddy as far as consistency goes. Disappointed in the product overall, as what's the point if most of the apps don't work as they do on other machines?", "verified": true, "helpfulness": "0/1", "author": "T. Beam"}, {"rating": 5.0, "review": "Very good, and fast, could use more options for viewing format and customization, but solid performance.", "verified": true, "helpfulness": "0/0", "author": "Tower DC \"Tower of Power\""}, {"rating": 3.0, "review": "It does not support DTS 5.1 surround or AC3 Audio. Only supports DD 5.1. Needs more audio support. Also freezes sometimes in the middle of a video, audio will keep playing but video will freeze. Happens in Netflix and Plex.", "verified": true, "helpfulness": "2/2", "author": "Matt J."}, {"rating": 5.0, "review": "The hardware is excellent and the interface is intuitive. I have Hulu+ , Netflix, and Plex (for streaming my media) installed as well as a few randoms I downloaded to check out  and it runs them all perfectly. My only complaint at the moment is the HBO GO app is still not available (as of July 4th). Once that is available I may never touch my cable box again.", "verified": true, "helpfulness": "0/0", "author": "DazeyChain"}, {"rating": 4.0, "review": "I would like to be able to add side loaded apps to the carousel on the main menu.It needs a way to filter tv shows, by streaming service like amazon, hulu, netflix etc. and also be able to filter shows that are free to prime members.Overall a great tv streaming box. I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "stacy milne"}, {"rating": 1.0, "review": "Needs to be versatile enough to work with Directv and on TVs are HD but don't have HDMI ports.", "verified": true, "helpfulness": "3/3", "author": "DarlingNicky"}, {"rating": 2.0, "review": "All the good movies on prime you have to pay for", "verified": true, "helpfulness": "0/1", "author": "js"}, {"rating": 5.0, "review": "The voice search has never not worked. Its really really good and user friendly. Any moron can be up and running in 10 minutes (or quicker if you already know your wireless router password) Prime is the best deal going", "verified": true, "helpfulness": "0/0", "author": "Paul H. Miller Jr. \"Tab's tout\""}, {"rating": 5.0, "review": "Amazon Fire TV is perhaps (strike that..) IS the BEST STREAMING MEDIA DEVICE available today for the money!CPU wise; this thing rocks! Its fast, stable, practical, cost effective, small and energy efficient! FYI; we actually had NO TV ANTENNA for 9+ MONTHS however the FireTV made our free time better than ever!! Netflix was our initial reason for the purchase. After 2 days however, we were watching Amazon Prime content as often or if not more often that Netflix! We LOVE Netflix though we are really getting to LOVE Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Mark Vella-West"}, {"rating": 5.0, "review": "it is really good I really really like it & I like the  voice Search  cause you  say the name of your favorite actors and all his movies there the thing i rcommended you guys to change is to amzan tv have a manual button because if you lost the remot there's no way you could enjoy watching your favorite show thanks amzan love you", "verified": true, "helpfulness": "0/1", "author": "sundaydador"}]