[{"rating": 5.0, "review": "This is so easy to install and use for us non- tech types. Love the voice command. Definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Vicki Munsinger"}, {"rating": 5.0, "review": "I received this as a birthday gift.Technology and hardware: I have run this side by side by side with Apple TV, and a Roku on my High Speed Network.Personally, I prefer the video and load speed delivered by Amazon TV.Aesthetically:,  I prefer the variety of TV and movies available through Amazon, and since I have started using my new device I feel like I am receiving the best possible value from my prime account. I am almost always able to find something interesting to watch without paying an additional fee.I have 3 remotes for streaming devices next to my chair. When I leave \"Regular\" TV I always grab the Amazon Remote to see what's available 1st.I think I'm going to delegate Roku to the lounge in my office.If I had the new Kindle fire to use when sending photos and videos to my Screen, Apple TV would probably be donated to some worthy cause.Other opinions may differ, but I prefer Amazon TV.", "verified": false, "helpfulness": "0/0", "author": "E. B. Van Arsdale"}, {"rating": 5.0, "review": "Amazon Fire TV is excellent for Prime members.There are bunch of contents. However, there is still limited number of contents compared to Netflix.Fire TV has gaming service, so it is easy to enjoy the simple gaming.However the number of contents is also not enough for Prime Member.", "verified": true, "helpfulness": "0/0", "author": "Namseog K."}, {"rating": 1.0, "review": "Amazon Fire started working out good but within a few weeks of using the item, it start buffering throughout the movies selected. So delays would last as long as five minutes. This is not a good product and I give it a grade of \"wasted money\".", "verified": true, "helpfulness": "4/6", "author": "Tim Smith"}, {"rating": 5.0, "review": "I have to say that my wife and i absolutely LOVE this device! One doesn't have to be a NASA executive to use the box, or set it up for that matter... Instant streaming means no more pauses during a program, even when you've got computers, and ipads, and iphones etc etc etc....The only CON which i have found is this.... I just received an email from my internet provider proclaiming that we've used 300GB of data in about an eight day period!We have never used a steaming device before, and stupidly assumed that unlimited streaming (aka Netflix and Amazon Prime etc...), meant one could watch as much as one wanted too.... However, my internet provider assured me, that... While Amazon and Netflix don't care how much we watch... THEY DO! We've been limited now...Therefore, i thought i should mention, since i didn't notice anyone else had...l that one's internet provider dictates just how much streaming one actually does (not Netflix... not Amazon). So, one might wish to check with their own provider to see if buying one of these is actually worth it. What good is it if one can only watch an hour or two on the weekends? And trust me, we have a massive data usage plan. In the past, the highest we had ever used was around 90GB in an entire month.... And in the six days of having Fire TV... We've used 311GB!Also, one more thing... Since nobody had mentioned this, and it is not covered in the instructions which came with the Fire TV unit.... We were unsure of what to do when we were done using it for the first time. Were we supposed to unplug it? Or what? As it does not have an on/off switch... We were unsure. Not to mention the fact that it gets HOT while streaming! And we didn't like the idea of going out, or leaving it unattended without unplugging it. That certainly seemed inconvenient to do each time one uses it! Tried calling Amazon to ask this silly question... And the person simply repeated my question (three times), and then said they were unsure! Really? I took it on faith that it would, like other devices i've owned, go into \"standby\" mode once we were done streaming. Sure enough, about a half an hour or so after we switched to the regular cable box... The light on the unit went out. One turns it back on by switching to whichever hdmi outlet source they are using, and hitting the \"home\" button on the remote for the fire controller. It might sound silly now..l but shouldn't they tell you how to turn the thing off right from the start? Its not like theres a power button on the remote!Overall though.... This is the nicest toy we've bought for ourselves in awhile. And the price can't be beat! If the device holds up well, we will think about the Fire Phone units too.", "verified": true, "helpfulness": "3/3", "author": "Adventurewriter"}, {"rating": 5.0, "review": "Buh buh buh buhh buhhhh, I'm lovin' it WAY more than McDonalds!  My only regret after buying this is that I didn't buy it sooner.", "verified": true, "helpfulness": "0/0", "author": "Travis Alexander"}, {"rating": 5.0, "review": "My folks have a roku box, but I chose the Amazon fire and I think it's so much better! Definitely recommend having a Prime account as well to really enjoy it!", "verified": true, "helpfulness": "0/0", "author": "Lisa M Intardonato"}, {"rating": 3.0, "review": "this was great when i was able to get this to work. i ended up sending it back because i couldn't get it to connect consistently. I'll probably get it again in the future.", "verified": true, "helpfulness": "1/4", "author": "Sarah"}, {"rating": 2.0, "review": "Setup and use are easy however I Had to contact support because streaming would stop within seconds of starting.  Turns out that the Fire TV device is NOT compatible with HDMI switches.  This is not publicized nor is it common knowledge.  It apparently sees the switch as a recording device and stops streaming to prevent copywriter infringement.  That's fine however the type of switch I was using was a 2x1 (2 in 1 out) intended to support simultaneous connection of both the Fire TV and a blu-Ray player to the single HDMI port on my tv.  adding insult to injury Was the fact that I had purchased the switch from amazon and was charged $5.22 to return a purchase I would not have made had Amazon published the fact that the Fire TV is not HDMI switch compatible.  Omitting important information like that makes correct purchasing decisions difficult at best.Bottom line ...the device seems to work fine when connected directly to the TV, but I will be very cautious about future purchases from Amazon and may not renew my Prime membership.  Perhaps it is time to go back to brick and mortar stores who refund your entire purchase, not half of it.", "verified": true, "helpfulness": "5/10", "author": "David S Hodgson"}, {"rating": 2.0, "review": "Many customers have stated that the Fire is using up their ISP bandwidth allocation much faster than their previous media players.Reason is two fold, first off the screensaver needs to be turned off and secondly, the cue feature which allows a show to play immediately, rather than wait for it to buffer. This is the true culprit.If you turn these two features off, you should notice your ISP usage drop.My two stars are because Amazon should have told their clients and also due to the lack of DTS audio on Plex.", "verified": false, "helpfulness": "0/0", "author": "Andrew I. Munro Sr."}]