[{"rating": 5.0, "review": "The Fire TV packs extremely impressive hardware and an intuitive interface.  Coming from years of dedicated WD TV Live use as a media center, I have switched to the Fire TV, with XBMC/SPMC sideloaded.  Interfacing with my media is so much more pleasant.  Bar none, the Fire TV is the least expensive, most comprehensive XBMC hardware out there.", "verified": true, "helpfulness": "0/0", "author": "Michael M. \"Yay interwebs\""}, {"rating": 5.0, "review": "I was amazed by the content! If you are an Amazon Prime member, this is a \"must have\"!", "verified": true, "helpfulness": "0/0", "author": "A. Ali \"musicbuff\""}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 4.0, "review": "Amazon TV is Great!!  I love the original programming and the inventory of streaming video available.", "verified": true, "helpfulness": "0/0", "author": "Pader Potts"}, {"rating": 4.0, "review": "Very easy to install and to use.  Lots of movies and shows available!", "verified": true, "helpfulness": "0/0", "author": "Nancy M. Cummings"}, {"rating": 5.0, "review": "Best thing I ever did for myself....Raising 4 kids back in the day, I hardly watched TV except for Soaps...Now I can watch anything from that era... I Love movies now too...Thank you For this Awesome Amazon Fire TV...", "verified": true, "helpfulness": "0/0", "author": "Beverly E Deal"}, {"rating": 5.0, "review": "This device is so awesome.  I took alot of time going back and forth on what device I should get.  This device does everything and more.  It is fast and streaming anything is not a problem.", "verified": true, "helpfulness": "0/0", "author": "lil log"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Sebastian"}, {"rating": 5.0, "review": "I love having all the choices of movies and television series.", "verified": true, "helpfulness": "0/0", "author": "Olive M DeLuca"}, {"rating": 5.0, "review": "This is great. Easy to operate for a senior citizen. :)", "verified": true, "helpfulness": "0/0", "author": "Joy Frevert"}]