[{"rating": 4.0, "review": "This is a great device if you don't have a smart TV (apparently mine streams Amazon Prime, but the interface is so terrible that I never bothered using it) or other streaming device besides the Chromecast (which is very limited).First of all, little things: the packaging was very nice. The remote itself feels amazing to hold and the buttons are very simple. The Fire TV itself is beautiful, very minimalist. All you see is the tiny LED on the front when it's in use.The voice search IS great! It didn't catch \"Idina Menzel,\" but it could be because I searched her name right after searching John Travolta. It brought up musicals, Will Ferrell, etc. without a problem. Voice search only works within everything available on Prime it seems (things available to rent or stream), and I wish it included the Netflix titles, perhaps with a \"See on Netflix\" button instead of just showing me the \"rent\" option for what isn't on instant Prime.I wish you could sort by Amazon Prime-only movies, with an interface similar to Netflix's. I want to see what's available to me NOW, not what I can rent.The games are fun, and it's pretty cool to be able to play phone games on the TV. My whole family actually enjoyed playing Minion Rush. I don't have any controllers yet, and I hope that 2P games, if they aren't out yet, are coming in the future.I've only had mine a day, but so far I'm loving this purchase! We do have an xbox one, smart tv, and even a computer hooked up downstairs into the same 60\" monitor, but the xbone interface for netflix is SO AWFUL that we hardly ever use it (unlike the one on the 360) and it's a pain just to have to start up the computer and interact with such a huge screen with computer peripherals. Because our Vizio smarttv is rather clunky and slow, it has never loaded any video streaming for us before somehow crashing. This Fire TV clears those problems, and with an INCREDIBLY simple interface.Love it! I would give this 5 stars if you could use the voice search for commands and inside apps (such as Netflix).EDIT April 11, 2014:After using my Fire TV for about a week, I've settled into what I use it for most (until I get my gaming controller, which is apparently on backorder until the 23rd). I mostly wanted a device to watch my favorite shows (via Netflix or locally) without any troubles. It's MUCH faster to launch and use the Netflix app on the Fire TV than it is on my smart TV, the xbox one, and the computer hooked up to it via HDMI. It's also PERFECT for streaming locally via Plex -- my music, TV shows, movies, and more are so very easily accessible on here vs. the computer hooked up (which is not my PC) and the xbox one (which is such a nightmare for this task that I barely consider it). This app is only 99 cents and will make your Fire TV experience a lot more enjoyable, so you really owe it to yourself to get it.I absolutely love the feel of the remote and how simple and intuitive it is to use. After fiddling with the TV remote for the input button, which despite always being in the same spot, I always have trouble finding, it's a joy to use a remote that is much simpler. This probably makes me sound old (I'm 20). The remote orientation doesn't matter, so you don't fiddle around with making sure you've pointed it correctly. I suppose this is because it uses BT.The voice search, which I use somewhat often, is a joy to use. It's much better than shouting across the room at the Kinect, which only picks up what I say less than half of the time. I hope Microsoft doesn't save voice recordings the same way Amazon does, because about 80% of that is just me yelling profanities at the Kinect.", "verified": true, "helpfulness": "36/42", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Well this does look cool and having games is a big one up over roku.I have a chromecast and on your chart I have noticed some errors.The chormecast has VOICE SEARCH as its built in to all andriod devices, and the chromecast does have NO LINE OF SITE REMOTE cause your phone or tablet is the remote and you just need to be on the same network not in the same room", "verified": false, "helpfulness": "4/33", "author": "mike reyes"}, {"rating": 1.0, "review": "I took the plunge and ordered this the day it was released and hit the one day shipping button. The set-up wasn't too bad. There was a problem with getting the device to update.  It refused a few time with an annoying message \"try later\". Once I get past this it the set up was fine.  The start up video was helpful.In terms of value, it isn't worth $100.  Overall, it is no better or worse than other offerings. It is okay but nothing more.And yes, throwing in a HDMI cable would have been a nice gesture.Update--After a month, I have to say that the device gets knocked down from three to two stars.  The search engine is not particularly friendly and the device drops its connection too frequently--particularly after a film ends.  If you own another box, there is little need to buy this one.Update--One year later---The rating is down to one star.  The device is not reliable, constantly dropping the connection.  The each time I check the connection and it shows \"strong\".  It has gone from bad to worse.  I can honestly state that this purchase was a waste of money. I am looking at Apple as a replacement.", "verified": true, "helpfulness": "3/10", "author": "Craig T. McDonnell"}, {"rating": 4.0, "review": "As said in the review title, I'm missing Spotify in the included apps! C'mon, guys, Spotify is THE music streaming service!", "verified": false, "helpfulness": "5/22", "author": "danif"}, {"rating": 3.0, "review": "I have devices that are already capable of accessing Youtube, Netflix, Hulu and even amazon video. I'm a little concerned about Amazon's offering, I dislike a product that's tied so closely to the company that's trying to push me content. Do I need to spend $100 on another box that does pretty much the same thing as devices I already own, like my TV and blu ray player?  Do I need voice search?  You may think it's money well spent but I'm betting it won't be long before this is heavily discounted, followed by the 'new improved' version. Unless you're desperate for online content and your TV / DVD / blu ray player are years old, I would say save your money, at least until the price drops.", "verified": false, "helpfulness": "7/33", "author": "growly"}, {"rating": 4.0, "review": "I have 4 Apple TVs, so I may be biased, but here it is...Pros:Ships already configured to your account - no set up needed.Games play surprisingly well.Amazon has some really great exclusive content.The whole system feels fast.Voice search works really well.My game controller paired automatically.----------------------------------Cons:Browsing sucks - It's tedious trying to browse for something you might be interested in.  You have to scroll past very large icons sometimes one season will be an icon then other shows will appear and then the second season of that show will show up as another icon.The remote isn't infrared, so if you have a universal remote that only does infrared, you won't be able to use it with this.  They should've at least put an infrared port on the box itself that would allow limited functionality with universal remotes (no voice, no games).The USB port does nothing (yet).  Hopefully apps will come that will allow us to play media on USB sticks/drives, but really this should've been a default app that Amazon made sure was correctly done and worked as well as anything else on the device.----------------------------------I bought this for the exclusive content and games.  As an owner of many Macs and iOS devices, having Apple TVs makes sense due to AirPlay and being able to play content across the devices, but Amazon's Fire TV is a better product in of itself.", "verified": true, "helpfulness": "18/22", "author": "Kevin Edwards"}, {"rating": 4.0, "review": "Most people already owned this before Amazon came out with it.  It's called a Playstation 3.  Or Xbox 360, if you like paying Microsoft an extra $10 a month to use your own internet and streaming service you've already paid for, and don't have Blu-Ray's.  However, for people with zero interest in serious gaming, or playing Blu-Ray discs, this is a solid buy at $99.Another Issue I have with this device is the pre-buffering.  Loading videos before you even decide to watch them sounds like a good way to waste any bandwidth cap you might have, and having that happen millions of times a night produces unnecessary heavy network traffic waste.So to sum it up, this thing is just a big fancy Android tablet with your TV as the screen.  If you already have a smart TV, gaming console, Roku, or similar device, it is either redundant, or inferior.  If you are a Prime customer, don't own any modern home entertainment devices besides a Blu-Ray and a nice TV, this might be for you.", "verified": false, "helpfulness": "10/33", "author": "M dubb"}, {"rating": 3.0, "review": "I am Confused. I purchased this to replace my ROKO as far as streaming content on my TV. So where is my confusion. When I stream content using the ROKO program available in my Prime account are free, but with the Fire TV the same programs have to be purchased. WHY? I found the same thing is true with I stream content from my Prime on my Smart TV. I does not make sense to me. I am Confused. I am a AMAZON Prime Member and the content I stream from my account should be free regardless of how I stream the content.I don't want to stop anybody from purchasing a Fire TV, but this should be a simple fix for Amazon to complete. I just think streaming content should be the same regardless of which device that the content is being streamed on.", "verified": true, "helpfulness": "8/20", "author": "mike c"}, {"rating": 1.0, "review": "Ok, I was really stoked for this box, I'm not a hater who doesn't want to give this a chance like some of the posters here, but I've had a less than stellar experience.Got the Fire TV this afternoon, sweet, unpackaged, ready to go. Plug it in and told it needs an update, fair enough as an Xbox 1 owner, I know the drill. Sometime later, I eventually get a lovely screen proclaiming \"Unable to update your Amazon Fire TV\" \"blah blah blah contact support\".I'm no Ron Swanson, but I am a man, so of course I spend the next 4 hours trying everything I know to see if the issue is on my end rather than contact tech support. Heck, I'm the guy all my friends and family call when they need tech support, I got this right?Wrong. I tried everything, wired, wireless, DHCP, static, DMZ, check firewall ports, even taking the router out of the equation, keep getting a message that it can't connect to get the update. Tried over a period of 7 hours in case it was just busy network, product launch and all. Still no dice, it won't let me do anything as it needs to update, so it's talking to the Amazon servers, but refuses to get the update, which could still be a server issue and nothing wrong with the box, fair enough.BUT.. The great thing about the horrible design is that I'm essentially left with a brick, as I cannot do anything with the stupid box without doing the update. I can't go to the home screen, can't check out the UI, can't do anything but be openly mocked by it. Really Amazon? What muppet allowed that through? It won't even go to a menu so I can at least mess around with it, just an instruction screen telling me to contact support.Beaten and emasculated, I finally contact tech support, only to be told to try everything on the support page (I already pointed out I'd been there and done that, but no t-shirt), which I did once more and still nothing. Support then told me that as the product is new, they're not trained on it so they'll have to get me a specialist. Okey dokey, I'm ok with that, I understand that, as well as the fact I'm probably paying to be a Beta Tester but whatever, I just want it to work.Well after getting bounced around and put on hold for 15 minutes, support hung up on me. I never even got a chance to raise my voice dammit. I think I'm gonna use it to hurl at the overabundance of hipsters we have here in the Bay Area, as that's all the Fire TV is any good for now.And yeah, I'm a moron, paid for 1 day shipping for this and a controller, first world problems huh?UPDATE:Finally spoke to a guy in support, as soon as I told him that I was stuck in an update loop he asked if I wanted a return or a new one, so went for the return. I'm guessing my issue is now a known issue. The soonest they could have got me a new one was Monday, and considering I'd paid one day shipping, and then wasted almost a day trying to get it to work, I'm over it. I'm definitely a little sad, as I was really looking forward to seeing what this box could do. I'm jealous of those of you that are having a good experience, maybe I'll try again in the future once they've figured it out, or wait to see if Apple or Roku come out with something better.", "verified": true, "helpfulness": "493/583", "author": "Danny"}, {"rating": 5.0, "review": "I already own an Apple TV & Chromecast. Compared to those 2, the Fire TV without a doubt beats them both by a mile. I find the user interface quite a bit more friendlier than the Apple TV (or the non-existent Chromecast interface). The voice search integration is a great convenience... saves so much time from having to click through each single letter to find what I want to watch. Also, I found the predictive streaming to be quite smart and accurate most of the time.The BIGGEST win for me is the seamless integration with Amazon Prime Instant video. I'm already an Amazon Prime member, but I couldn't stream any Amazon content through my Apple TV or Chromecast to my TV, since Amazon video isn't supported on either of them. So I had been stuck with Netflix for all these years...Now that I have the fire TV, I can finally cancel my Netflix subscription ($96/year) which will pretty much pay for the Fire TV after a year. Well worth the investment in my opinion!*I wish some the other services are not made as separate standalone apps. It would have been nice for them to be integrated to the entire Fire TV UI. Like, the voice search can only do Amazon content. It cannot return searches from other apps, which is a shame.", "verified": true, "helpfulness": "16/19", "author": "xinger"}]