[{"rating": 5.0, "review": "Much faster than my apple TV and more realiable", "verified": true, "helpfulness": "0/0", "author": "C. Lee Brister"}, {"rating": 1.0, "review": "Definitely  not what i expected.", "verified": true, "helpfulness": "0/0", "author": "sick circus"}, {"rating": 5.0, "review": "Love it.. So fast loading.  I like that i have my Amazon Mp3 app on there so i can play my music as well.  With there was an on/off switch but thats just minor as you can put the unit to sleep manually or it will do it itself after 30 minutes.I have the WD Live TV box for my bedroom cause i have my 4 TB movie hardrive hooked up to it.  And the way the menus are for the popular apps  (hulu, netflix) are night and day.. I got this cause i do have Amazon prime and really had nothing that streamed to the TV since its like only Fire TV and Roku have the Amazon app.  I could have used my PS4 but i dont want my gaming system to be on constantly to watch movies as that is not its job lol.The voice command works wonderfully.  Im not sure if there is a way when using it, it wouly only bring up PRIME movies instead of all movies.  I did have to set my 5 digit code so i dont buy crap by accident lol.I would recommend this if you are looking to get a streaming device.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 4.0, "review": "Works great. Easy to use interface and remote. I wish it had an off button or could shorten the time before sleep mode.", "verified": true, "helpfulness": "0/0", "author": "Robert Wilson"}, {"rating": 5.0, "review": "I use the box with Sling TV. no complaints especially if you have prime account. The content included with Prime is better than or equal to Netflix.", "verified": true, "helpfulness": "0/0", "author": "Nated14"}, {"rating": 4.0, "review": "i like it but the purpose was to get rid of cable bill.  most of the apps require a cable service in order to use.  that SUCKS! Was disappointed in that. only thing i can use is my netflix unless im doing something wrong or don't know of something.", "verified": true, "helpfulness": "0/0", "author": "marvin"}, {"rating": 5.0, "review": "I love the Amazon Fire!  It was so easy to install and started right up without any issues at all!  It gives us a great picture and we can stream everything on it.  We bought one of the first Roku's that came out and it eventually quit working....I researched and ended up getting this.  So glad I did.  I have no problem recommending this product!  It's really awesome!", "verified": true, "helpfulness": "0/0", "author": "Alys M. Peck"}, {"rating": 5.0, "review": "So far so good with this. The voice command does work surprisingly well! It beats trying to stream through the phone or the ipad and has worked flawlessly through 10 movies or so, and every voice search has yielded the correct search.", "verified": true, "helpfulness": "0/0", "author": "Darryl F. \"Am2n2it2quit\""}, {"rating": 5.0, "review": "In LOVE with my Fire TV!!!!", "verified": true, "helpfulness": "0/0", "author": "Neyda"}, {"rating": 1.0, "review": "There are much better products out there than this one. Amazon should really stay out of this market. A few complaints: Voice search only works for the home screen. Cannot voice search in apps like You Tube. If you do it will take you out of the app and back to the home screen. My third party game controller would not even power on when plugged into the USB port. Really? I have other media centers that can do so much more, like my WD Live.", "verified": true, "helpfulness": "1/2", "author": "Liberty5"}]