[{"rating": 4.0, "review": "Very quick and responsive. I am glad it allows me to incorporate my Netflix account, but am a little annoyed that the voice search only searches the Amazon catalog, and not Netflix. That means that If I'm looking for a particular film, I have to do it twice each time.  I have a Google TV box as well, and it does a far better job of searching, reporting \"This film is available from four sources\", giving a list and prices for each find.Another annoying aspect is that this box doesn't know about HBO Go.  There's no way to add it as an app.", "verified": true, "helpfulness": "2/3", "author": "Charles Weston \"melomaniac\""}, {"rating": 1.0, "review": "Disappointed.  Voice search is ONLY to Amazon videos.  Prime Videos still lack quality shows.  We found when it was hard-wired to the internet, after being connected for an hour, the internet connections dropped and the device was warm.  Suspect a bad chip on the device.  Using wireless, the quality of video is less and takes longer to load content.  We had to do hard resets due to issues with Netflix.  Turns out the issue was on the device itself needing to be put back to factory reset.  Crazy as we did not customize it.  I'm glad we waited to purchase a second as this time I will probably go with the Nexus Player.", "verified": true, "helpfulness": "4/9", "author": "Robby Curry"}, {"rating": 4.0, "review": "Works much faster than Amazon app on my Smart TVs and Apple TV boxes.", "verified": true, "helpfulness": "1/1", "author": "BH"}, {"rating": 1.0, "review": "Paying $2.99 for a movie that was made in 1941 is just out of the question. You have to pay for just about every movie. This could cost lots of money.  I am returning the one I got. It is a great idea, but just a tad to expensive. Kids could really run up a tab on this.", "verified": false, "helpfulness": "3/17", "author": "Ayla"}, {"rating": 5.0, "review": "The voice search feature on this Fire is excellent. What a time saver!!", "verified": true, "helpfulness": "2/3", "author": "Media Man \"Les\""}, {"rating": 4.0, "review": "I like the system but the navigation could be a litter easier to work with for my kids.", "verified": true, "helpfulness": "1/1", "author": "Donald A. Pedersen"}, {"rating": 4.0, "review": "It's a good product, but not as good as a Roku 3 (I have both). Setup on both basically the same-neither one comes with an HDMI cable. I give the edge to Roku 3 because the Amazon Fire keeps dropping my Netflix account info, necessitating frequent input of email and password, and Roku has earplugs that go in the remote. Some minor differences: no voice input on Roku and larger remote. They both work fine for streaming movies.", "verified": true, "helpfulness": "1/1", "author": "everyday man"}, {"rating": 5.0, "review": "Very easy to use and set up. Recommend this for anyone that is interested in streaming TV and movies.", "verified": true, "helpfulness": "0/0", "author": "Lron"}, {"rating": 2.0, "review": "I have both a Roku and the Fire TV.... In a three TV household. The Roku does not play any favorites. The Roku has apps from all over the net and gives each one equal footing on their platform. Unfortunately, the Fire TV plays favorites.... Example: The Netflix app on the Fire TV is the worst one possible, if you can find it on the Fire TV. It took me forever to dig through the user interface to find where Amazon hid the Netflix App and then it is not the full version of the Netflix app. It is some stripped down version I have only seen on the Fire TV. Another annoying issue is the search app on the Fire TV. The Roku search app searches everything and gives you options from around the web. The Fire TV search app only returns items from Amazon even if the content is free else where. I am VERY, VERY sad Amazon could not get get of it's own way and put together a good media device. Oh and by the way, absolutely no Slingbox support from the Fire TV. Really... Come on! Amazon you can fix this. Until then I can not recommend this device.", "verified": true, "helpfulness": "4/6", "author": "trekkie"}, {"rating": 5.0, "review": "Absolutely love our Fire TV!  Such a wonderful alternative to the expense of cable or satellite service.  Now we are able to watch what we want to watch...when we want to watch it!", "verified": true, "helpfulness": "0/0", "author": "Cristi M."}]