[{"rating": 5.0, "review": "I don't know how I lived without this.  Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Annette Lefforge"}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Jeff B."}, {"rating": 3.0, "review": "Don't get me wrong, I like my Amazon fire. I have a subscription to Hulu, Netflix and am a Prime member. The Fire comes pre-installed with your membership info so you can start using it immediately. However I thought it would be better and here is why:-I have to enter my Hulu Login at least three to four times a month.-I have to do the same with my Netflix login-When using the search feature the Fire only checks in the Amazon and Hulu list. It won't display results for Netflix.-Sometimes shows I know are on Amazon, don't show up in the searchOverall, I am a little disappointed. Nothing I like is on Prime, so I can either buy the movies (which I guess is nice) or search in Hulu or Netflix for it. I might as well use my Wii...", "verified": true, "helpfulness": "2/3", "author": "Jack1e"}, {"rating": 5.0, "review": "I'm thoroughly enjoying this product and I'm mostly watching Prime for free. I just wish that Prime would get more movies for free and more seasons of tv shows. But it's easy-to-use and the voice finder is spectacular.  Also, Amazon credited me $15.00 when they put it at a lower price and I was really pleased with that.", "verified": true, "helpfulness": "0/0", "author": "A.Cat"}, {"rating": 3.0, "review": "It is easy to use and install and I like the ability to speak your search but I am disappointed that everything through Amazon Fire has a cost. There are no free shows, even TV shows! I like Netflix because you pay one price a month and everything is included, no extra cost. I may change my mind in a year but for right ow, if I can get it on Netflix I won't be paying for it on Amazon Fire!!", "verified": true, "helpfulness": "1/2", "author": "M. Mulligan \"Mike In VA\""}, {"rating": 5.0, "review": "We've had it three days - we love it! It was so easy to set up...my ten year old son did it, actually. Fast response time on the searches and the voice command. We're really getting the most out of our Amazon Prime account streaming programs through it. My five year old now asks to turn on the television by saying \"Mom, can we watch Amazon Fire TV?\" The games are great, there's a ton of free ones, and it keeps the kids off my phone playing Flappy Bird! Before we were using a Wii to log on to Netflix - the controls were clunky and it took forever to log on and get a program started. This tiny little $84 box completely buries it! Highly recommend, especially for a family with internet that doesn't want to pay cable's ridiculous prices for entertainment.", "verified": true, "helpfulness": "2/2", "author": "icelander711"}, {"rating": 5.0, "review": "I'm actually thinking about buying another one for kids room", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Love Fire TV... Addicted.", "verified": true, "helpfulness": "0/1", "author": "jim"}, {"rating": 4.0, "review": "Easy to set up and use.  Haven't explored it to the fullest, but very happy so far.", "verified": true, "helpfulness": "0/1", "author": "Mary Frances Bowry"}, {"rating": 3.0, "review": "Buffers constantly.  Had Comcast router  replaced.  Improved but still interruptions.", "verified": true, "helpfulness": "1/5", "author": "John Gamache"}]