[{"rating": 5.0, "review": "Easy to set up and easier to use!", "verified": true, "helpfulness": "0/0", "author": "Steven R. Giudici"}, {"rating": 1.0, "review": "If you enable developer ADB and restart it will brick the Unit no power at all, it did that on two New Fire TV, if you plan on installing apps you'll be disappointed.", "verified": true, "helpfulness": "2/3", "author": "Suzanne Capano"}, {"rating": 1.0, "review": "Horrible product would not connect to wifi Eventhough wifi is fine and the Apple TV is connected just fine. called tech support they couldn't even figure out how to fix it! What a joke I want a full refund!", "verified": true, "helpfulness": "2/3", "author": "Zablocki"}, {"rating": 5.0, "review": "As advertised. The interface is quite smooth, and the voice search works well. So far no issues with streaming or the few apps I've tried. I use it primarily for Amazon Prime, and Netflix and it works very well for both.", "verified": true, "helpfulness": "0/0", "author": "kdjorgensen"}, {"rating": 4.0, "review": "I am very happy with the Amazone Fire TV. just wished the remote was a little bigger, I keep losing it.Otherwise it is very easy to use and the quality of the picture is great.", "verified": true, "helpfulness": "0/0", "author": "sabrina"}, {"rating": 1.0, "review": "It would have been nice to know what speed is needed to use this device. We live in a rural area with rather slow internet speeds and the movies would not load. Very disappointing.", "verified": true, "helpfulness": "2/3", "author": "Paul"}, {"rating": 5.0, "review": "AMAZING DO REALLY WANT TO TALK ABOUT THIS PRODUCTS I CAN'T SAY ENOUGH ABOUT IT JUST TRY AND DECIDED FOR YOUR SELF PERIOD.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I have been using HBO GO and NETFLIX  apps on my mobile devices and TV with built-in wifi and those devices could not hold a candle to this thing.It is SO fast and the streaming quality is amazing and high quality.The only regret I have is not buying this sooner.", "verified": true, "helpfulness": "2/2", "author": "Chris"}, {"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Daniel L Perrigo"}, {"rating": 5.0, "review": "Feels more like a high end device over the Chromecast. I didn't want to spend $100 a month for cable or satellite service so the $20 SlingTV is great, other than friends asking if it was a porn subscription.", "verified": true, "helpfulness": "2/2", "author": "TheBest85"}]