[{"rating": 1.0, "review": "not what i expected you can't watch regular like TV you need to have NETFLEX or HULU.", "verified": true, "helpfulness": "2/39", "author": "Elsa Cruz"}, {"rating": 5.0, "review": "Amazon Fire TV beats the pants off of the Apple TV.  The voice control at first seems like a gimmick, but it's not.  Everyone in my family uses it, it's really cool and beats using the controls to find the show you want.  I picked up another one for the bed room and got rid of my Apple TV.  Only disappointment is the lack of an HBOGO app at the time of this review; it also can't stream my iTunes library but I expected that.", "verified": true, "helpfulness": "2/2", "author": "zbooks"}, {"rating": 4.0, "review": "I wish the voice searched worked with Netflix", "verified": true, "helpfulness": "3/3", "author": "Daniel G Beguhl"}, {"rating": 5.0, "review": "Love it! Super easy to set up and navigate! Shows/movies load very fast", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love that little box that could.  It works very well.  When I had a question about closed captioning, I sent a message for someone to call me, and in less than a minute the phone rang.  A nice young man walked me through setting up the closed captioning.  Nicely done!  I am enjoying my programming with captioning and like the assortment of programs available.", "verified": true, "helpfulness": "2/2", "author": "Kathy Mullins"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/2", "author": "Ron"}, {"rating": 5.0, "review": "First of all I must tell you I am not an IT guy, so this review will be limited from an IT perspective.LOOKS: I am impressed with the package and the way this Fire TV looks. Before installing and power up, it made me feel like I bought a classy product. From package to Fire TV gizmo everything looks high class.TECH (opinion): It is plug and play as they say, all you have to do is to select your wireless connection. It has port for internet if you want to wire it, but I like as few cables as possible. For me, wireless is a plus in any gizmo. It loads up pretty quick, actually I am impressed how fast it powers up and is ready to go, even after it has been loaded with apps! Yes, speed is important AFTER you load all your software.It does not have a power button, don’t look for it. It is supposed to sleep after you press “home” button. Make sure you don’t have music apps playing or smth else in the background. My Fire TV did not sleep more than 24 hours, and I guess is because it had an app running in the background. In MHO, not having an on/off switch could be an issue sometimes, but maybe I am old school.It has a USB port, but from what I understood, it is for developers. I did not connect an external hard drive to it yet. If you read this and have time to try it, please comment and let me know if it can be used to add a drive to extend the memory (my bet is not, because I don’t see options in the software for external drives). I am puzzled a bit about the apps and device vs cloud space. It appears that if you load something from Amazon then the app is saved in your Amazon cloud. That means, you should not need extra space… in time. But you can remove the app(s) from the device and reload from the cloud when you want to use it, basically, like a swap to free memory. So, about this, since I have an 8 GB Fire tablet too, I am not sure, but it seems that’s how it works (please comment if you know more).Game apps: You get a free good race game, Asphalt. Some games you play with the remote that comes with the TV box, and for some you will need the overpriced console. The remote: simple and classy. Has a nice feeling. I am not much into games, but this Fire TV handles very well the game. No lags, fast loading and so I have no complaints here. I did not purchase this for games – just so you know. I use it for watching TV or streaming music (Pandora, iHeart, NPR and other radio stations).TV APPS: some good some “eh…” Unfortunately the mainstream is not ready for internet TV in MHO. However, some news and programs are updated in a matter of hours not days. I am planning on ditching the monthly cable TV subscription in a year from now, so I have some time to pick/choose and adapt. I am interested in news mostly… and I don’t find ok paying 80$ a month to watch a movie a day…if.But as it is now, I don’t think internet TV is where it should be in the 21st Century. But this is a problem due to the big corporations and some kind of monopoly and deals between big corporations. I hate I have to register with my cable provider for some apps. But I don’t think is Amazon’s fault, yet, Amazon could drive the market by pushing for better.COMPLAINTS: Amazon should do a better job at organizing the kids’ content! No dear Amazon, Power Rangers have nothing to do with science for kids! Amazon, don’t become like the other players. I think we like you because you are different, so start focusing on kids’ education more, and add more interactive apps for them! Not only cartoons. Yes, your Tumbleleaf is great. But please get out of the mainstream and create a better “Amazinstream”. Hope you become the new standard.Summary: I like my Fire TV. Fast, looks good and it keeps me satisfied if I don’t want to use the cable. However, I hate I cannot use my FIRE TV to listen to music while I turn off the TV. I want to stream from iHeart music without keeping my TV on. Apparently this cannot be achieved through Fire TV.What I wish FIRE TV would have *please comment and vote for:Internet browser. I mean why not put the Silk on Fire TV?Add: Amazon Player (music) and to also have the option for photo slideshow from OUR collection (drive, not cloud). Integrate photo slides in it, with nice slideshow options (see My Memories app for ex.). Why? Because I would pay you 3$ for such an interface. I like playing my own list of music during my own photo slide show on TV. Let me connect to my computer wirelessly. THIS would be a big blow to the mainstream now. I like Amazon service against Apple music because I can use the music I purchase across all my devices, now why don’t you become a real deal and increase portability in 21st Century, it’s going to come down to this anyway. Yes, I got the PLEX… for this, but is an old version. Are you planning something? Then cheers! NO? Then please plan for something like this for the next update.PLEX… is (1) disconnecting at times, and (2) my slide show goes in sleep mode after 15 min or so. I still try to figure out why and what can I do to slide for entire day (?!@#?). And is an old version!Create educational games for kids. Not like xBox. Make them better. When you write something on their screen, add “read me” option for kids that don’t know how to read yet. Add read me option for the entire content, yes it might take some space but is ok. Why not adding some of the great educational apps present on the tablet (READ ME TYPES), add them to the Fire TV. (If they’re already there then I have a hard time finding them).Add possibility to connect my hard drive to the Fire TV!!! And let me use my content or increase the space on Fire TV. Let me not worry about swapping the apps… and I will buy even more. Because now I am thinking “oh man. I need more space. I will run out, neah… don’t buy”. Here was an insight!Add My Memories app, if you take your time to develop a good Amazon app for photos.Add headphones option.Add more content: apps, and new movies. Add better entertainment apps and Kids apps. It takes you too long to update or add apps, there are reasons I understand, but it has been half a year since the Fire TV? Survival of the fittest. Become a revolution!", "verified": true, "helpfulness": "4/4", "author": "Bogdan"}, {"rating": 1.0, "review": "So horrible. Can't even use for first time. It won't update tried unplugging it 10 times. And www.amazon.com/firetvsupport. Is not available. I am so agitated.  Even upgraded my Internet to turbo. About ready to take it back and cancel my upgrade on the Internet.  Even just opened a amazon account.  :( disappointed.", "verified": false, "helpfulness": "2/13", "author": "paul mcintyre"}, {"rating": 4.0, "review": "nice but big.", "verified": true, "helpfulness": "1/4", "author": "Carlos M. Robinson"}, {"rating": 3.0, "review": "Still confused.  Instructions are too limited for an 81 year old technically impaired male.  Everything seems to cost money too!  Not really sure just what it does or can do or why I bought it in the first place!!", "verified": true, "helpfulness": "2/10", "author": "Charles F. Auman"}]