[{"rating": 5.0, "review": "So much easier to use than my Wii system that I was using previously!  Best decision ever!!", "verified": true, "helpfulness": "0/0", "author": "kelly"}, {"rating": 5.0, "review": "High quality and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Stephen R. Pell"}, {"rating": 1.0, "review": "not worth the money, same content is available on the internet. was looking to switch from Directv but the cost to watch TV shows is prohibitive.", "verified": true, "helpfulness": "3/7", "author": "bk2144"}, {"rating": 5.0, "review": "Awesome on it's own but paired with xbmc it's a game changer", "verified": true, "helpfulness": "0/0", "author": "Graeme Boal"}, {"rating": 4.0, "review": "My friend has this and loves it, and it looks great.  I got the Apple TV first, and when I learned about Roku 3, I got it for the second TV and liked it far better than Apple TV..  I just gave my Roku 3 to my grandchildren, and looking to replace.  This device truly is a leader of the pack, and after seeing and enjoying it at my friend's house I know I would love it - but I am hooked on that little remote that lets you plug in the headset, and that by far outruns the voice activated feature for me, I sure wish the Fire TV remote had that too.", "verified": false, "helpfulness": "0/2", "author": "Gabrielle G"}, {"rating": 3.0, "review": "The first generation of the Amazon Fire TV is a strong offering. The sign is thin, compact, and matte black. It has fast media streaming performance, but the app navigation feels archaic.Setup:Setting up the Fire TV was an easy two step process- (1) Plug it in. (2) Setup your Internet connection. Amazon had my Amazon account pre-activated on the Fire TV. After watching the tutorials, I was ready to go through all the movies on Amazon Prime and Netflix.As stated above, the carousel interface isn't the best system to navigate through the menus. Nonetheless, Fire TV's interface is quick for scrolling, paging, and shifting through the menus. I believe PlayStation's Netflix App has great navigation. This is also something that XBox and Apple TV failed at getting right at the time that I used the Fire TV.Content:The Fire TV is jammed pack with apps. The HBO Go app was the only one that seemed to be missing. Amazon Prime wasn't streaming HBO content at the time, but Amazon Prime free streaming and On-Demand streaming was jammed pack with shows and movies to rival Netflix. Amazon also has a strong algorithm to predict what I want to watch next and have it ready for me to hit the play button.Amazon's X-Ray service shows detailed information about the television show and film. This feature doesn't carry over to the other apps (Netflix, Hulu Plus, and other non-Amazon services).Remote Control Functionality:The remote control utilizes Bluetooth with simple to use functionality and voice command. The remote control is similar to Roku 3 or Apple TV- four way controller and basic buttons for play / pause, fast-forward, rewind, menu, back, and home. There's also a button at the top of the remote to activate Amazon's new universal voice-search function, which gets a lot of use in the Amazon apps. Voice search is the best feature of Fire TV. Hold t he mic button and say a name, then their body of work appears. The feature can call actors, games, TV shows, music, directors, genre, etc. Amazon's voice-search solves the tedious action of typing with a simple remote control.Pros:- Great voice search functionality- very accurate- Fast performance- Strong list of appsCons:- Voice search doesn't work in non-Amazon apps. I would like to use voice commands.- Carousel UI doesn't work well- Some apps are buggy", "verified": true, "helpfulness": "2/3", "author": "Charles H. Babb \"C.Babb\""}, {"rating": 3.0, "review": "After a couple of months with the Amazon Fire TV I've decided to unhook it and wait for some much needed app updates.  Don't get me wrong, I like it fine and my complaints are more with the apps themselves than the Fire TV box... it just got to the point where I felt like I needed to go back to my Roku for my sanity's sake.My main use for the Fire TV was to act as a Plex player.  I spent months ripping my DVD and Bluray collection and tried every set-top box under the sun.  The Amazon TV's version of Plex was far more user-friendly than the Roku's, but it's got significant problems under the hood.Our house uses a wired network, and ripped Bluray movies have no problem playing at 1080p/20mb on a Roku 3.  On the Fire TV, though?  720p/4mb was the best I could do.  Anything higher and I'd get the dreaded \"Can't play this video\" message.  I tried every single combination of Direct Play, Expirimental Player, etc etc etc and that was the best quality I could get.Amazon movies, Netflix movies, all worked great.  If you're a Plex user, though, you would be better off going with a Roku until they've ironed out some of the Fire TV issues.", "verified": true, "helpfulness": "1/1", "author": "txgamemaker"}, {"rating": 5.0, "review": "This seems like a very well made and useful product. PLEASE RESPOND: Can I connect this to a tv with a coaxial cable? Do I need a converter? And if so, where can I find what I need .", "verified": false, "helpfulness": "0/0", "author": "Michael S."}, {"rating": 5.0, "review": "With two Fire TVs in the family, I feel that I can finally write the polished review that I have been waiting for. These machines were largely purchased as home-sharing media hubs and due to the similar aesthetics to Plex, it felt more comfortable than a Roku. While we already owned a Roku, this has completely replaced it. Plex runs like an absolute dream on the Fire TV and that is even in a two story home with plenty of wireless interference. To further prove just how great the Plex capabilities are, plenty of the movie files that have been viewed are 20+ GB Matroska Video files and they run without a bit of buffering. This happens without any 'fancy' fiberoptic internet capabilities, but basic Comcast at one home and Time Warner at the second. Absolutely delightful!Pros:-Speed: Plex runs amazingly fast, Prime content loads without lag, and Netflix has no issue. Plex library of about 4.5 TB and the Fire TV blazes through it on a nightly basis.-Games: Even without the gaming controller, our family has had a few hours of fun toying around some of the games, especially the youth oriented ones.-Clarity: The Roku was never able to get picture that looked this crisp, even using the exact same videos. Big Bang Theory comes in rich and clear with no pixelation (even during the introduction) and superhero movies (ASM, Man of Steel) play without blur, fuzziness during motion, or any other issues.Cons:-Cost: 100 dollars feels a bit steep, but even with that price we have felt inclined to purchase another. The product really does work well enough that you don't end up regretting the cost.-Gaming Controller: Sold separately and I still haven't made the cost to buy it, but I look forward to adding it to the collection of remotes in this house.", "verified": false, "helpfulness": "0/0", "author": "Lauren Edwards"}, {"rating": 5.0, "review": "Very~ good!", "verified": true, "helpfulness": "0/0", "author": "SUKHYUN KIM"}]