[{"rating": 5.0, "review": "Easy installation. Worked first time as expected. I simply connected it to an HDMI cable and plugged the thing into a power source.  The remote with voice recognition works exceptionally.  Apps download in seconds and most of the apps I've tried worked well.", "verified": true, "helpfulness": "0/0", "author": "Vogrod TorBin"}, {"rating": 5.0, "review": "Easy, easy, easy, to plug and play. Was up and running 10 minutes after opening the box. Voice search results are excellent and simple.", "verified": true, "helpfulness": "0/1", "author": "Mitch F"}, {"rating": 1.0, "review": "If you don't have a cable log in for every single app, such as ESPN, the History Channel, etc, this is a pretty terrible investment. When using just the Amazon Fire TV box, you cannot search for anything. No searching Netflix. No searching Amazon Instant Video. No searching apps or games. It only shows what's popular. I don't know if it would work better with the tablet, so it does the searching and it loads on the screen? But as for an individual product, it sucks.", "verified": true, "helpfulness": "2/4", "author": "Kirsten A. Bowman"}, {"rating": 5.0, "review": "The Amazon Fire TV has more than met my expectations.  This device is allowing us to advance screenings of movies, an entire series of TV programs, and plus a lot of movies. The Amazon Fire TV projection of all movies is clear and actually surprisingly vibrant.  The purchase process is easy and you only have to purchase the item once since the purchase will be placed into our bank and we will be able to retrieve our show anytime. The Amazon Fire TV is the perfect purchase.", "verified": true, "helpfulness": "0/0", "author": "Lori Shultz"}, {"rating": 5.0, "review": "With the prime account and the fire I have all the Television I could ever hope to watch.", "verified": true, "helpfulness": "0/0", "author": "Sweet"}, {"rating": 3.0, "review": "The Amazon Fire is fine,  It will not Pair with my Harmony Ultimate Remote!!!  The Roku 2and 3 will work with the Harmony!  I had to return the Fire TV.  However it Will work with most Systems.  I would recommend the unit for most people!!", "verified": true, "helpfulness": "0/0", "author": "Furman Walter"}, {"rating": 5.0, "review": "I like it much better than the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Mike Medina"}, {"rating": 3.0, "review": "Pros:It does provide a nice, clear HD picture. It is easy to use Netflix on it.I like that you can speak into the remote and it will search for you.Cons:You have to buy an HDMI cable to connect it.There is not as much content as you think.  There is a lot available as you will see when you turn it on, but a large percentage you must pay for.  I was hoping to get rid of Netflix and only have fire, but there just isn't enough free content on prime to do that yet.", "verified": true, "helpfulness": "0/0", "author": "Lobstah \"Maineiac\""}, {"rating": 5.0, "review": "it is pofited", "verified": true, "helpfulness": "0/0", "author": "wanda kymack"}, {"rating": 3.0, "review": "The product met my expectation, thanks.", "verified": true, "helpfulness": "0/0", "author": "Luis Van Der Linden"}]