[{"rating": 5.0, "review": "Love it.  Thanks to the great review a non-techie middle-aged woman wrote, I took a chance and bought one of these for myself as I wanted to watch Netflix on a TV and not my iPad.  It was an absolute cinch to install - only took a few minutes and it loaded and worked perfectly.  I tried out all of the features except gaming (which I'm not interested in).  Netflix worked great, the Amazon Prime movies and everything already in my library was in there, as was all of my music.  I also tried uploading my photos from my iPhone and that also worked perfectly.Great gadget - loved that it was on sale for $84 or I probably wouldn't have bought it.  Highly recommended for anyone who isn't too technical and just wants to watch TV and movies and listen to music.", "verified": true, "helpfulness": "1/1", "author": "Cheer Mom \"cheermom\""}, {"rating": 4.0, "review": "I really like fire tv. Its portable so all I need is wifi. four stars only because I would like more channels. I do believe that the amount of channels will increase with time, it's a new product for Amazon. Its easy set up, and very easy to use, we have A prime and Netflix so we have a lot of choices, if you don't have these two the selection might be slim.", "verified": true, "helpfulness": "0/0", "author": "laura Madera"}, {"rating": 5.0, "review": "Here's what I love, I already pay for Prime because of the shipping and support. There's all this free content that comes with it. You have Prime Instant Video and rather than sit in front of your computer to watch this content, now you can chill in the most relaxing rooms of your house and watch this with the whole family.The voice search is flawless and a time saver - however it won't work in other apps such as Netflix, for example. But it's really nice.The remote is very comfortable and simple.I have a Samsung 3D Smart Blu-ray player and it always dropped signal and when that happens, it stops whatever I'm watching and I have to start over from the beginning. It was ridiculous.My Fire TV rarely drops signal and when it does, it just goes into a loading \"buffering\" state and let's me pick up where I left off.The unit is so small and compact it always goes with me when I travel. Although I admit that not all hotels have TVs that allow this to be set up, I can see that changing. Set up is just as simple as plugging the device into your HDMI port on the back of your TV and into the unit itself and then plugging in the power supply.  Find \"Input\" on your TV or remote, switch to HDMI 1 or 2 and then  add your wireless connection.Most hotels have a simple browser login that enables this and in at least one case, this authentication required by their inhouse network settings prevented even their own techs from getting the FireTV to work but when it does, it's really nice.Besides the games and the ability to access other apps, there is an amazing slideshow in their screensaver.I literally cannot find a single fault with the device. I would recommend it to anyone who is already a Prime Member!", "verified": true, "helpfulness": "0/0", "author": "LoveMeSomeAmazon"}, {"rating": 2.0, "review": "Initially when I got my FireTV I loved it, but recently it is now unusable due to constant crashes and audio issues.Often when watching Amazon content (24 for example) it will play for a few seconds then go to a blue screen. Pressing 'home' eventually takes me back to the home screen where subsequent attempts to watch give the exact same result. The only way to clear the issue is to power cycle the box, at which point everything works fine for a while.Next, I often get audio drop out from both the HDMI audio and the optical output. As above though power cycling often fixes this but not always.For me one critical menu option which is missing is 'power cycle' or 'reboot' since I have to do this so often now and my Fire TV is in a different room and up a flight of stairs.This is a real shame since Fire TV showed sooo much potential, but this crashing means I simply can't be bothered using it any more. Back to Roku.Steve", "verified": true, "helpfulness": "0/0", "author": "Steve C"}, {"rating": 1.0, "review": "The USB port does not work!The voice button Only works for Amazon Movies.  I tried it on You Tube and found it did nothing.  Same with all other Apps, Only Amazon Movies App.There is no On/Off switch.If you turn on your TV and the Amazon Fire fails to come on, that can be a problem.", "verified": true, "helpfulness": "1/6", "author": "Floridaking"}, {"rating": 5.0, "review": "Enjoying it", "verified": true, "helpfulness": "0/0", "author": "Ellen I. Shiflet \"NANA\""}, {"rating": 3.0, "review": "It works well howver. it screws with my sound TURN OFF every time I go back to tv.Also I have prime before I got the Fire TV and nowI have to pay ANOTHER 99.00 FOR THE RE-UP OF MY ORIGINAL PRIME i GOT LAST SEPT. When I started this with the Fire TV.I don't have a lot of channels as with the Original I got last sept.So I really think it is not worth the money I paid for it.Also wish they had Spiritbits from HALLMARK channel.  Which was  ON MY Roku player.HoweverthatI took off for the Fire Tv.If someone is out there please do something to correct these issue mentioned above.", "verified": true, "helpfulness": "0/0", "author": "Matthew Tetreault"}, {"rating": 5.0, "review": "Have all but abandoned my Roku for this device.  Fast, fluid works really well.  No buffering no hesitations on playback.Very recommended solution", "verified": true, "helpfulness": "0/0", "author": "JRinPA"}, {"rating": 5.0, "review": "I am completely blown away by my amazon fire tv.  I'm catching up on a lot of series that I didn't have time to watch when they were on.  I love it.", "verified": true, "helpfulness": "0/0", "author": "newslady66"}, {"rating": 3.0, "review": "I've been giving the Fire TV a whirl since it was released back in April --- so I've definitely given it a good go.  When it was announced I liked the idea of an Amazon product streaming device --- Amazon makes very quality products : nothing really groundbreaking or exciting (kindle e-reader excluded) :: was hoping this would revolutionize my (recently cord-cutting) tv-watching experience.Firstly, the positives ::1) It is very speedy.  Apps, especially Amazon native apps, launch very quickly (almost immediately).  Which is nice to get right into watching something.  Apps like Netflix, youtube et. al. launch fast but not really any faster than the other boxes on the market.2) Voice search.  Surprisingly, I use this a lot -- it is my go to for searching for anything.  Wish it worked with content other than Amazon --- but I suppose Amazon makes money on 'their' content.  Hopefully an update will allow cross-app voice search.3) It is fairly stable -- I rarely get buffering or skips :: so it is pretty reliable.  Though there are times it will act very strange and why won't Pandora say in my \"Recently Viewed\" panel??4) The screensaver \"photos\" are very nice (my wife's favorite feature)5) Nice clicky remote6) Easy setupNow, the negatives ::1) The apps or lack thereof.  Sure, it has the standard list of YouTube and Netflix etc... But where is PBS, NBC, CBS, and Spotify?  I gave up my Roku 2 thinking I would just load up all the apps I used on Roku but was really upset to realize Amazon has a very skimpy selection of worthwhile apps.  I know I can sideload apps but, ugh, I'd rather native apps with full functionality.1a) The app store seems to be inundated with pointless apps --- Gosh, I thought we've realized \"your device is only as good as the content/apps available for it\" (Microsoft app store should be a very clear example of what NOT to do).  I hate having to surf through apps that are just money grabs or filler.  How many \"fish tank\" or \"rain window\" apps do we need.  There should be some kind of standard right?2) Voice search doesn't work cross-app :: adding this would bump up my rating a full star.3) I'd really prefer an actual process for reseting/restarting the Fire TV as opposed to having to pull the cord out the back.  I have the box tucked away and I hate having to unplug it to restart.  Roku was smart and put a reset button on the inside (where the batteries go).4) It runs (the box itself) pretty hot.  Sure the hardware is pretty substantial but still ---All in all --- it's okay :: but it's days are numbered in my home entertainment system.  There are far better alternatives on the horizon (which will undoubtedly contain the Amazon Instant App --- so Prime material).  I just wish someone would knock it out of the park :: this isn't something I want to update so often.", "verified": true, "helpfulness": "0/0", "author": "gr33n"}]