[{"rating": 5.0, "review": "Easy set up. Easy to use. Great picture quality. Love teh navigation, and the remote is perfect. Definitely worth the money if you enjoy streaming, especially if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Candace L Kludt"}, {"rating": 5.0, "review": "Set up is easy. Using it on a wired network. Using a desktop PC with PLEX installed as a media server for streaming my media.", "verified": true, "helpfulness": "0/0", "author": "Thom Jones"}, {"rating": 5.0, "review": "Excellent both husband and I enjoy it", "verified": true, "helpfulness": "0/0", "author": "Angela L. Rigdon"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "John G. Samiotes"}, {"rating": 3.0, "review": "I've used my Fire TV for a couple months now. All in all it's a good device.The recent addition of ads on the menu screen is rather annoying though. I'm not a fan of purchasing a product at a premium price, only to be shown ads.Hopefully Amazon realizes the error of their ways, but I won't hold my breath.", "verified": true, "helpfulness": "4/4", "author": "Andrew Kessler"}, {"rating": 3.0, "review": "I already have Neflix on the Xbox360, and the only thing that I like better about the FIRE-TV is the remote. The remote was designed very well, and it is very easy to use compared to the XBOX controlers.", "verified": true, "helpfulness": "0/0", "author": "Ghncgbb"}, {"rating": 4.0, "review": "I have quite a few digital movies on disneymoviesanywhere and also on Vudu. It would be great if it could link to those accounts.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Maas"}, {"rating": 5.0, "review": "Set up was easy, everything worked properly the first time. Speech recognition is excellent. Search is a bit slow but I search online at Amazon.com occasionally and find things to put on the watchlist  while I watch something more entertaining on Fire TV at the same time.", "verified": true, "helpfulness": "0/0", "author": "Worker Bee"}, {"rating": 5.0, "review": "Amazon Fire works great with cable TV,  but if you have satelite internet be sure to watch usage per month because movies will use up several GB's per movie. Netflix makes It possible for you to receive unmetered usage between the hours of 12:00 AM to 5:00 AM. I am not certain about Amazon Fire, but I would like to hear some feedback concerning this.", "verified": true, "helpfulness": "0/0", "author": "Bill Schultz \"Nature Lover\""}, {"rating": 5.0, "review": "great device very simple to use.", "verified": true, "helpfulness": "0/0", "author": "RAYJAYSOLDIER"}]