[{"rating": 1.0, "review": "could not get the fire box to work on my set.  changed boxes, changed hdmi cables twice...used the stick and it works fine  ?????", "verified": true, "helpfulness": "0/1", "author": "Lenny"}, {"rating": 5.0, "review": "It works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Erica Martin \"Sugar Hut\""}, {"rating": 5.0, "review": "Still not sure I wouldn't like Apple TV better...but, so far, so good.", "verified": true, "helpfulness": "0/0", "author": "Richard Graham"}, {"rating": 5.0, "review": "Love love love my fire tv! I can find any movie tv show documentary I want and if they don't have it available I can rent it in HD for a great price! Way better than cable which I've gone without for almost 2 years.", "verified": true, "helpfulness": "0/0", "author": "Jazemen Moreno"}, {"rating": 5.0, "review": "We've had this for two weeks now. We LOVE it!  We eliminated our Direct TV and are only using this box and a subscription to HULU plus to get my favorite shows from ABC network. I wish there was a way to organize the items, so the ones you have to pay for can be hidden, but they do give you lists for the Prime shows and movies, which helps.", "verified": true, "helpfulness": "0/0", "author": "LauraShad"}, {"rating": 5.0, "review": "Here's what I originally thought: 1 StarI'd rate the Plex app on Fire TV zero stars if I could.The Plex app on Fire TV doesn't work.  Oh, sure, you can download the Plex app to your Fire TV, and sign into your Plex account, but once you start playing a video, it doesn't take long before the video freezes for a second or two before it continues playing, again.  And then, within a few seconds, the video freezes on the screen, again.  What a BIG disappointment!I've read Amazon's support for apps on their products is poor, and now I believe it.Here's what I think now ... 5 Stars!I've changed my rating to 5 stars because after I followed the instructions at amazon.com/firetvsupport, Quick Fixes, Video issues on Your Fire TV Device, I'm no longer having video issues using the Plex app. Everything in Plex is working as it should.  My videos play flawlessly via the Plex app in Fire TV.", "verified": true, "helpfulness": "2/3", "author": "Henry \"Skip\" Molander"}, {"rating": 5.0, "review": "Excellent so far. Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Jennifer Schulz"}, {"rating": 5.0, "review": "Fantastic product", "verified": true, "helpfulness": "0/0", "author": "Delores"}, {"rating": 5.0, "review": "So glad I got Amazon Fire TV. Worth it. Love how much I can watch and how easy it is!", "verified": true, "helpfulness": "0/0", "author": "SMULawyer"}, {"rating": 5.0, "review": "Easy to install and use.  The remote is tiny and difficult to open to apply batteries.  I had to go back to Amazon reviews to find out that the remote opens by sliding down.  I used a table knife to get it open because it is tough to open.  I gave this product five stars because once you get the remote set, the Amazon Fire TV box makes watching movies easy!  Afterall, if you are paying for the Prime membership, why not take advantage of watching these movies for free on your big screen TV instead of a computer.  I love mine!", "verified": true, "helpfulness": "0/0", "author": "Lizzie Mae \"love country living!\""}]