[{"rating": 2.0, "review": "The remote control broke after 30 days....and the free movies they boast about, it's not available,  u have to pay for them", "verified": true, "helpfulness": "1/6", "author": "paularez"}, {"rating": 4.0, "review": "I bought this product for my 83 year-old mom so she wouldn't have to have to learn how to do \"hunt and peck\" searches for programs. Unfortunately, and more fool I for not foreseeing it, the voice feature only works with Amazon services so that hope failed. That aside it's a great product and I'm happy with the purchase. I'm also happy with the installment purchase plan and intend to pick up a Kindle Fire as well.", "verified": true, "helpfulness": "0/1", "author": "Tommy in Idaho \"Dr. T.\""}, {"rating": 5.0, "review": "Great video streamer when combined with the included benefits of Amazon Prime. We probably will be hard pressed to view all 40,000 movies!!!", "verified": true, "helpfulness": "1/1", "author": "W. Sather"}, {"rating": 4.0, "review": "We ordered our Fire TV by mistake, my daughter thought she was buying a book.  We decided to try it out and actually really like it.  No more thoughts of sending it back and love the movies on demand. Glad we kept it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "SOMETIMES I CAN NOT GET IT TO READ OR PLAY WHAT I WANT.  LITTLE FRUSTRATING.  WISHED I HAD AN EASY WAY TO CONTACT YOU GUYS", "verified": true, "helpfulness": "0/1", "author": "Melanie Muse"}, {"rating": 2.0, "review": "I was very excited to order and receive my Amazon Fire TV unit.  However, I recently returned it and ended up purchasing the Roku 3, which I love so far.I am an Amazon Prime member and was excited to use the Fire TV to stream Prime Videos, as our current Blu Ray is not compatible with Prime (I also have Netflix, Hulu, etc. so could utilize those features as well).  I considered purchasing an entirely new Blu Ray unit with Amazon capabilities, but the current unit works fine and the cost increase over Fire TV or Roku would have been significant.The set up steps couldn't have been simpler...plug the unit into the tv, plug it in to the power source, set up internet access.  However, I tried and tried and my two year old Samsung HD TV could not 'sense' the Fire TV unit.  To troubleshoot, I switched the HDMI cable to confirm that it wasn't the issue, changed HDMI ports on the tv, reset the power several times, and changed the batteries in the remote.  The unit started with a yellow blinking light (nothing about that in the manual, but I decided to wait it out), which then turned to a bluish white blinking light.  During all of this, I was getting no connection to the tv.  After 30 minutes of doing the same steps over and over, it 'magically' connected and the power light was a solid blue/white (I say magically, because I have no idea what was different this time).  I figured the problem was solved and the family sat down to watch a movie.The unit worked fine that evening.  I am giving it more than 1 star, because while it worked, we enjoyed the features.  The interface was simple to use, the voice search option was great.  Overall a good unit if working properly.Unfortunately, the next morning after the Fire TV unit had gone to sleep overnight, it could not reestablish connection with the tv.  I tried everything listed above AGAIN, but it never worked.  Frustrated, I packed the item back up, returned it to Amazon, and ordered the Roku 3.By contrast, the Roku immediately connected and has no problem reconnecting after the unit has gone into sleep mode.  The services are similar and has all of the apps we require (primarly Amazon Instant Video, Netflix, Hulu).  Keep in mind that I am using the same HDMI cable and the same port on the tv with no problems at this point.It is very possible that I got a dud...I haven't seen many other reviews with this problem, but this was my experience.  I could have reordered the Fire TV, but didn't want to risk another return.  Amazon has a great return policy, so I easily shipped back the item and received the refund very quickly.  If you are interested in this item and don't mind the possibility of a return, give it a try.  Like I said, when it was working, we really enjoyed it.", "verified": true, "helpfulness": "0/1", "author": "Amber"}, {"rating": 5.0, "review": "I wish they would make an app for connecting it to your phone and computer like a chromecast type thing, but that being said it is way better than chromecast. I would highly recommend this product. I'm really not a huge fan of using my xbox one or ps4 just to watch netflix because I feel like it is kind of a waste, but this is great for that and PLEX. (my two most used apps). I haven't used it for gaming, but it looks pretty legitimate about it. PlaystationTV is coming out, but I imagine Amazon has similar ideas in mind. From my own experience I would rate this over the chromecast, neoTV, Roku, and AppleTV without a doubt as the best $100 streaming device. I know you can get some of the others cheaper, but I really think this one is the best when it comes to value and will only get better.", "verified": true, "helpfulness": "0/0", "author": "VisibleKitten"}, {"rating": 5.0, "review": "So easy to hook up, I did it my self. My husband and I are getting older and have problems with the new devices, this is great.", "verified": true, "helpfulness": "0/0", "author": "Darlene Doty"}, {"rating": 5.0, "review": "I was a little skeptical about buying this, but I really wanted to use my Netflix account to watch movies on my Samsung TV (older with  internet connection problems).  This sounded like it would solve my internet connection issues and it did.  It immediately downloaded an update upon installation and within minutes was up in running.  Not much to it!  I love that I can browse all of the Netflix movies in addition to my Amazon Prime library.  Speaking into the remote can be a bit tricky and it might take a time or two for the voice recognition to figure out what you're saying, but it is pretty impressive.  Would recommend this to anyone looking to expand their TV viewing experience.", "verified": true, "helpfulness": "0/0", "author": "WestCO"}, {"rating": 5.0, "review": "I really like the Fire unit. It makes viewing much more complete. I have recommended this to friends and family.", "verified": true, "helpfulness": "0/0", "author": "gary kinsey"}]