[{"rating": 4.0, "review": "Not a 5 because...it can't be turned off...it blink at times...but I love it!....XBMC runs good!", "verified": true, "helpfulness": "0/0", "author": "Joel"}, {"rating": 5.0, "review": "great!", "verified": true, "helpfulness": "0/0", "author": "Catherine Alvarado"}, {"rating": 5.0, "review": "Replacing Comcast with it. Tired of being on the phone with them every other week. Happy with this purchase. Got prime membership for $99 a year instead of paying $120 to Comcast terrible service every month.", "verified": true, "helpfulness": "0/0", "author": "SAEED KHAN"}, {"rating": 5.0, "review": "Awesome!  I was disappointed that the Stick version wasn't available until after Christmas - (Coincidence?)  But, the Stick doesn't have the Voice Recognition feature which my wife loves.", "verified": true, "helpfulness": "0/0", "author": "Mr. McPenny \"Mr. McPenny\""}, {"rating": 5.0, "review": "I got this as 30 day trial and ended up keeping it. Prior to the AFTV, i owned the roku 3 which worked really well with netflix, amazon instant video and hulu.  But i felt like it was too walled it and lacking features. While it does have gaming, they are very casual and subpar.  So in comes the AFTV.  It has all the big name streaming options (hbo go recently added) that the roku 3 has but the search function points you to amazon content unlike the roku 3 which will give you multiple options.  Gaming is no comparison.  The AFTV has console like games. Graphically they are a step below the PS3.  Some games can be played with the included remote or optional game controller which some games require.  The fun really begins in tinkering beyond its intended use.  If you are tech savy, a quick google search will lead you to step by step guides on what is possible on this device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This has opened a whole new movie world for us.  Although recent videos must be rented, there is a much better selection of no cost movies than Netflix.  My entire family is enjoying this!", "verified": true, "helpfulness": "0/0", "author": "Janet Hansens"}, {"rating": 2.0, "review": "Voice search fun, but it only searches prime, not any of the other channels you have added. This is unlike the Roku (which we got after we returned this), which searches ALL channels and then presents you a list of which ones are showing your selection, and for how much money. \"Free on Prime, Included with Netflix, $2.99 on..\"", "verified": true, "helpfulness": "1/3", "author": "J. Muskovitz \"joshm317\""}, {"rating": 5.0, "review": "I really like this device.  It's absolutely great.  However, if Amazon truly wants to make this a cable cutter's dream, I'd suggest adding two things:1. A coax input to connect to an antenna (which Amazon makes: http://smile.amazon.com/AmazonBasics-Ultra-Thin-Amplified-Indoor-Antenna/dp/B00DIFIP06/).  Combine that with a channel guide app.2. OTA DVR functionality.  Possibly connect it to an external hard drive.  Suggest storing the video locally, but maybe Prime members would have the ability to upload recordings to Amazon's cloud so they can watch them on any device.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Speech recognition is great! They need to expand beyond blue tooth so programable remotes can control", "verified": true, "helpfulness": "0/0", "author": "Hank Pearson"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Dana Russo"}]