[{"rating": 5.0, "review": "So easy to set up and even easier to use.  Every movie I've searched for has been available ... even the oldies!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Voice search is cool but needs to work with Netflix. Games feature is cool for the big gamers but needs to separate itself from Rome and Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Hector S."}, {"rating": 5.0, "review": "Love this!! Such an easy set up and so easy to use. And the music streaming is awesome. I had my regular tv shut off and now i only use Fire TV!! This product is perfect for my lifestyle! I cannot wait until more apps for different TV channels are available. The only negative would be i was not aware of the amount of data it uses. I had to switch to a service that had no data cap.", "verified": true, "helpfulness": "0/0", "author": "MGonzales"}, {"rating": 5.0, "review": "Love it so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Bjgarcia"}, {"rating": 3.0, "review": "It's fast and easy to use but there isn't as much free content as imagined. I was however to get rid of my Wii as my media source and use only Fire TV, it's super fast!", "verified": true, "helpfulness": "0/0", "author": "Geoffrey Odermatt"}, {"rating": 5.0, "review": "So easy and way more organized than the others", "verified": true, "helpfulness": "0/0", "author": "isaac"}, {"rating": 5.0, "review": "Awesome, easy, best on the market by far....", "verified": true, "helpfulness": "0/0", "author": "Marc J. Bagby"}, {"rating": 5.0, "review": "This is a great little device. I don't have cable so all I need is my internet access and I can watch most of my favorite shows and movies. I did end up using the LAN rather then the WiFi because it seems to stream better plus not having a cable provider limited some of my watching ( like trying to watch the World Cup on ESPN) but I do use an over the air HDTV antenna which gives me all the network channels that I need.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I keep getting messages...on prime error is \"Player Error\"Netfix is iffy, lately I get the message to try a different title, however I get this message on every title on netflix.I tried the 20 second reboot, but that dosent help", "verified": true, "helpfulness": "0/0", "author": "Roy Zeringue"}, {"rating": 5.0, "review": "Nothing more to say than I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Stephen B Mitchell"}]