[{"rating": 5.0, "review": "Was very easy to set up. Easy to work.", "verified": true, "helpfulness": "0/0", "author": "becky l allen"}, {"rating": 2.0, "review": "Have tried using Miracast (screen mirroring) with three different devices with no luck, Sony Xperia tablet, Samsung S5, and an ipad. Scanning finds the device but none were able to connect. Might return and try a Cast.", "verified": true, "helpfulness": "0/3", "author": "Scott G."}, {"rating": 2.0, "review": "Junk after 6 months.  It started out fine, but turned to a glitchy pile of garbage after just 6 months. Locks up, resets in the middle of viewing content, major lag problems between audio and video, where the video will delay, stall, and then run in double time to catch up to the audio.  The only way to fix the sync is to reset the whole box, which forces you to re-enter all passwords, re-download apps and watch the entire intro again, which you can't skip.  Also, where is the iPad remote app?  I know Amazon and apple hate each other, but cmon guys. It's 2015. Stop pulling your sister's hair and give me something I can use.  This stick remote is terrible for typing, and doesn't light up so it's nearly impossible to find in the dark.No longer impressed.  In fact, my entire Amazon experience these days has been pretty slow and expensive.I DO NOT recommend this product to anyone who is looking for a good streaming device. Apple TV is better, and Netflix has better content (not to mention 95% of the same free tv and movies) than prime. I'll be disconnecting after the year and going back to Apple TV, which is only just slightly better, but enough to make me cancel prime.", "verified": true, "helpfulness": "0/2", "author": "Andrew H"}, {"rating": 5.0, "review": "Easy as pie to set up. Make sure that you get an 'AmazonBasics High-Speed HDMI Cable' I purchsed the  6.5 Foot cable and this was the perfect size.", "verified": true, "helpfulness": "0/0", "author": "Nonya"}, {"rating": 5.0, "review": "Fast, easy, user friendly. Great product!", "verified": true, "helpfulness": "0/0", "author": "Lauren Sarlo"}, {"rating": 4.0, "review": "I give this a 4 star because some of the movies does not play good \"it make a weird sound that is not apart of the movie. It's kinda like Dj Screw mixes\". I'm not sure if it's the device can't decode certain movies. I would love it if amazon remove movies that are NOT English or add a button for us to select the language \"I think some of these movies are voice over in English\".The device itself loads fast", "verified": true, "helpfulness": "0/1", "author": "Wayne"}, {"rating": 5.0, "review": "Loving it.", "verified": true, "helpfulness": "0/0", "author": "Jonathan D Grandison"}, {"rating": 3.0, "review": "Voice search is cumbersome at best... if you are lucky enough to be understood you still need to search the suggestions for the prime content.  Help suggests adding \"prime only\" to your voice search, but if your key word is more than 5 syllables and then you add \"prime only\" don't expect the voice search to know what on earth it is you are talking about!Also, the kids viewing time thing is a subscription per child. I considered making one account for all my kids and paying the charge, just for peace of mind, but then I discovered you cannot add content to their 'safe list' unless it is purchased and in your library... you cannot pick prime items and add them.... this makes that feature for most parents completely useless.Playing games is incredibly difficult as the button reacts when it is released, not when it is pressed, so most games which involve any kind of speed coordination are impossible to play.  I have ordered the game remote to see if that improves, but if not I will be tempted to return both the box and the game remote.Voice search only searches Amazon content and not Hulu or Netflix... I can live with that, but users should be aware.", "verified": true, "helpfulness": "0/0", "author": "I J Read"}, {"rating": 2.0, "review": "Direct Tv does not let it work.", "verified": true, "helpfulness": "1/4", "author": "Royal L Yates Sr"}, {"rating": 5.0, "review": "Use it every day!!!!  Love it, lots of variety!!!", "verified": true, "helpfulness": "0/0", "author": "GLAMGRAN \"diydiva\""}]