[{"rating": 3.0, "review": "Keeps dropping connections or taking a looooong time to load an app. Connectivity and stability are worse than Apple TV. Nice selection and navigation, voice search is especially nice.", "verified": true, "helpfulness": "0/0", "author": "William Greg Robbins \"Greg Robbins\""}, {"rating": 5.0, "review": "We are loving it! Easy to find things by speaking into the control and actually easy to find Prime movies to watch without have to pay for anything else.Plus, based on what we are watching Amazon sends me emails with other movies that are similar to the ones we are watching.If you love the old movies you'll love Amazon Fire and the control could not be easier.  We have order the Amazon Fire Flash drive for the other TV so we don't have to move this one from one tv to the other when our grandson is here.", "verified": true, "helpfulness": "0/0", "author": "JWilson \"aromalife\""}, {"rating": 1.0, "review": "very bad! worse than apple tvsecond-screen only amazon video, can't support proxy and vpn", "verified": false, "helpfulness": "0/2", "author": "Smith W."}, {"rating": 5.0, "review": "Easy to install.  I like the free movies via Amazon Prime a real bonus.  Easy to use", "verified": true, "helpfulness": "0/0", "author": "K. J. Mann \"Karen Gavello/Mann\""}, {"rating": 5.0, "review": "Set-up was straightforward.  Navigation is easy.  Works Great!", "verified": true, "helpfulness": "0/0", "author": "Curt in MN"}, {"rating": 3.0, "review": "There are no live sports options. Commercials will often load and play and when they are done and the show is supposed to start, it freezes so I have to go back and restart.  Definitely not ready to replace cable. I'm not a big tv watcher anyway but I would say it is complimentary to a basic cable package to save money.", "verified": true, "helpfulness": "0/0", "author": "doug glass"}, {"rating": 5.0, "review": "Great picture and sound.  Easy to connect.  Far better than the Blu ray players I was using to stream.", "verified": true, "helpfulness": "0/0", "author": "Steve Goodoien"}, {"rating": 5.0, "review": "This changed our lives!Amazing voice recognition and soooooo much easier to set up than the xbox - when you just want to watch a few episodes of your show.", "verified": true, "helpfulness": "0/0", "author": "Jonah B."}, {"rating": 5.0, "review": "Very easy to set up and operate. Audio and video quality is excellent when watching a program. I should not have waited so long to purchase this unit.", "verified": true, "helpfulness": "0/0", "author": "Donald C Gerber"}, {"rating": 5.0, "review": "Gets me all I need to watch.", "verified": true, "helpfulness": "0/0", "author": "Ken V"}]