[{"rating": 5.0, "review": "Great product. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Alan"}, {"rating": 5.0, "review": "If you are considering streaming. This is it. Get one for every room. Better than anticipated.", "verified": true, "helpfulness": "0/0", "author": "HAPPY OR UNHAPPY \"MATT KURTZ\""}, {"rating": 5.0, "review": "I'm thinking about getting rid of my cable. This has introduced a whole new viewing pleasure. Not main stream new different option other than prime time. I bought a few more for gifts this xmas", "verified": true, "helpfulness": "0/0", "author": "Bradie Haner"}, {"rating": 5.0, "review": "After trying out the Amazon Fire TV Stick for a day, I liked it so much that I ended up buying the full-fledged Amazon Fire TV! Just like the Fire TV Stick, the Fire TV has the same easy to view and easy to navigate interface - so easy that I didn't even have to explain to my niece how to use it. She simply picked up the remote and was on her way. Also just like the Fire TV Stick, the remote controller is very easy to use. The voice search seems to be accurate, and because the remote uses Bluetooth, I don't have to point it anywhere specific for it to work.I mainly use the Fire TV for Netflix, RedbullTV, Spotify Connect (hey - no need for a Bluetooth receiver anymore either!), Plex (for my network library), and Prime movies. (My star rating reflects the fact that this machine has everything that I was looking for; if your tastes differ, then your rating may be different too.)In my review of the Fire TV Stick, I mentioned that I've already tried (and spent money on) the Chromecast, I've tried Roku, I've tried Apple TV, and I even built my own HTPC. The Fire TV Stick replaced all of those devices, and I only went with the top of the line Fire TV because of the Ethernet connection - I have a large library of media files on a network drive located about 4 rooms away, so I wanted the ethernet connection to ensure the fastest data transmission speed I could have, for no skipping, lag, or unintentional movie pauses. So far the Fire TV has been really impressive. I also now have a few open HDMI ports and power outlets available from all the other devices I've since removed from my home theater setup =)By the way - The other devices are going to be either resold or given to relatives... all except for the original Fire TV Stick I started with - that stays with me, but I put it into my travel backpack so that when I'm out of town I can just plug in the Fire TV Stick into the hotel TV and I'm good to go.", "verified": true, "helpfulness": "2/2", "author": "James R."}, {"rating": 5.0, "review": "So far Amazon's Fire TV is wonderful. I was able to set it up and begin using it within minutes. The remote is simple and easy to use. The voice commands are heard and understood with little repeating, which is refreshing! No more cable tv trap!!", "verified": true, "helpfulness": "0/0", "author": "msvicki"}, {"rating": 5.0, "review": "Fantastic in every way except it needs to be able to stream content from a home server or PC.  Until It does this, I won't be buying it.", "verified": false, "helpfulness": "0/2", "author": "D-Man \"D-Man\""}, {"rating": 5.0, "review": "Brings a whole new experience to prime subscription. Love it", "verified": true, "helpfulness": "0/0", "author": "David Fenton"}, {"rating": 5.0, "review": "I like being able to send the youtube video on my phone to my screen in seconds.  this box wakes up my av receiver and starts playing.  works great.", "verified": true, "helpfulness": "0/1", "author": "Daniel \"Woof\""}, {"rating": 5.0, "review": "Does what it is advertised to do.  Don't know for what else you could ask.", "verified": true, "helpfulness": "0/0", "author": "jupiter"}, {"rating": 1.0, "review": "International customers should be told it does not work in countries outside the USA", "verified": true, "helpfulness": "1/4", "author": "Amazing"}]