[{"rating": 5.0, "review": "When I cant find anything on cable (most of the time)I switch to \"fire\" it always has something and because I have Prime, most of it is freeeeee", "verified": true, "helpfulness": "0/0", "author": "CjCollins \"OVERSPENDER\""}, {"rating": 3.0, "review": "So, I had high hopes, but it's turned out to be \"ok\".  I am not a gamer, or expert, but able to do alot of computer work, software for my job, internet, apps, tablets, etc.  First, be prepared to have a MOBILE DEVICE nearby, cuz to setup the  Fire TV device, and your access to apps like Hulu, you have to also enter your login and password on a mobile and add the device...yes, this after entering your login and password on the fire - so, twice the work, which is VERY tedious with a remote, scrolling thru letters on a tv screen.  Once you are setup, the next disappointment is hey, you can't get even old versions of you kids favorite tv show, like paw patrol on nick jr.  I can watch it on their website on the computer, but NOT on the kindle TV - cuz, oh yeah, you can't navigate to websites on here.  Why???????  I want my kid off the computer, so  I can use it for computer stuff, not TV shows!  So, selection - as you already know, prime is the attraction, but come to find out, you have to click at least 4 times, or more, to actually watch a show via prime, and ya hafta go past the pay fee button first.  you can easily make a mistake, and pay $3 or more per episode, if you don't keep clicking thru screens to the \"prime\" version of a show.  Beware - its tedious.  and your kid might not do it properly.  Luckily, you can enter a password to protect vs. purchases, so that is a good feature.  Overall, nice, cuz we needed some kind of \"black box\" to get internet access shows onto the TV, without tying up the computer.  So, for $100, it's served that purpose.  But, after 2 weeks, the audio search stopped working.  No on / off switch, so unplugging device to reset it is reminding me of the 1990's Microsoft computer i had.  Ugh!  Overall,  decent.  Can be slow to navigate choices, so I've started searching Prime on the computer, faster and easier, adding items to my watchlist, then when it's time to watch something, it's in my que as a reminder.  That's a nice feature - browse one day, watch another.  Very easy to move from room to room in the house, as I have an extra power cable, so the cables are permanently setup up on 2 tvs in the house.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "NETFLIX DOESN'T WORK!  The new app for Netflix is useless...it does nothing.  The \"apps\" for things like Crunchyroll and Funimation default to the media you must PURCHASE, irregardless of whether or not you already are subscribed to one of these sites via your computer/tablet.  I can view Narruto Shippuden on Crunchyroll via internet...but CANNOT on the Fire.Most of the \"Prime\" movies that are free, we've already seen on cable.Purchasing a Fire HD tablet will allow \"mirroring\" onto the TV, but not certain we want another Amazon product.  Probably will upgrade AV receiver to one with Wifi, mirroring capabilities and use existing Android tablet and phones.The Fire TV is going back.", "verified": true, "helpfulness": "3/5", "author": "Amazon Customer"}, {"rating": 1.0, "review": "don't buy if you want to watch NETFLIX, worked good for my 30 day trial, now I haven't been able to use NETFLIX for 3 weeks since it updated and they have not fixed it and no one can get it to work", "verified": true, "helpfulness": "3/5", "author": "Anthony"}, {"rating": 2.0, "review": "After moving into a new home, I discovered we couldn't get U-verse TV, which we're used to and works very well.  So, I looked at TV alternatives and chose Fire TV.  It was great--at first: easy to setup and start using.  But I was disappointed to discover that every TV episode I wanted to see was about $3 each, which adds up too much.  Despite all the negative reviews of Hulu Plus, I gave it a try because $8/month is reasonable.  It worked well the first few days, but for whatever reason, it has progressively gotten worse, with picture freezes while the audio continues, and times when there is no picture at all, just audio.  Most evenings, I can't use Fire TV at all, as a result.  The a la carte approach is the wave of the future, but not until it actually works well, which this combination of Fire TV and Hulu Plus don't, at least for me.", "verified": true, "helpfulness": "0/2", "author": "Dave Snook"}, {"rating": 3.0, "review": "Not as many free movie titles as I expected.", "verified": true, "helpfulness": "0/0", "author": "NMI"}, {"rating": 5.0, "review": "Works as advertised! Good quality!", "verified": true, "helpfulness": "0/0", "author": "Blake"}, {"rating": 5.0, "review": "I am enjoying this every day.", "verified": true, "helpfulness": "0/0", "author": "Robert Oblak"}, {"rating": 5.0, "review": "Works like it should fast shipping plug in and your done", "verified": true, "helpfulness": "0/0", "author": "Tom Bergeron"}, {"rating": 5.0, "review": "I love the fire remote control. You can finally voice search for movies.", "verified": true, "helpfulness": "0/0", "author": "pjohn7"}]