[{"rating": 5.0, "review": "perfect.  easy hook up.  and not having to wait to see next seasons hbo's etc show's is great . catching up with many t.v. and movies,and can pause, rewind as needed.  i love it", "verified": true, "helpfulness": "0/0", "author": "CARLOS PENA"}, {"rating": 3.0, "review": "I ended up returning it because it only works with Amazon Prime.  The speech recognition software is very good.", "verified": true, "helpfulness": "0/0", "author": "Lori Wood"}, {"rating": 3.0, "review": "Received this as a gift.  Didn't offer much new over the voice recognition search.", "verified": true, "helpfulness": "0/0", "author": "Old Duke"}, {"rating": 5.0, "review": "Easy to set up, easy to use.  Effectively integrates Amazon Prime, Netflix, etc into easy television viewing", "verified": true, "helpfulness": "0/0", "author": "Rebecca K Gonyea"}, {"rating": 4.0, "review": "It's definitely one of the coolest toys to go with my tv.  I haven't figured out all the bells and whistles yet even though there is a tutorial video to walk you through bunch of stuff. Only paid attention to getting the tv working.  Will be looking at the rest of the things that you can do with this new toy.", "verified": true, "helpfulness": "0/0", "author": "b4real"}, {"rating": 4.0, "review": "Maybe I need to work on this more but it appears that you have to pay to watch any \"good\" or current movies.", "verified": true, "helpfulness": "0/0", "author": "Teresa Lenort"}, {"rating": 5.0, "review": "I loved it, it was everything I expected.", "verified": true, "helpfulness": "0/0", "author": "shelly"}, {"rating": 5.0, "review": "LOVE IT.  Don't know how it compares to other similar products.  But it works as advertised.  The voice activation feature works great.  I love the apps, games, videos, up to date news and sports (ESPN) stories.  Still finding out all that it does.  So far so good.  It does not have a on off button.  But, after 30 minutes of inactivity, it shuts off automatically.  My daughter is already trying to claim it for her room.", "verified": true, "helpfulness": "0/0", "author": "Tony Brooks"}, {"rating": 5.0, "review": "I have both the Fire TV and the Roku streaming devices, and I've got to say that the picture quality of the Fire TV is superior by far!The menu features are about the same except the voice comand button on the Fire TV.  That alone is one of the best reasons to invest in the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Markkus"}, {"rating": 5.0, "review": "I chose not to have cable tv.This is the way to go! Easy to set up.I didn't want to wait 2days for the mail so bought it at Best Buy.Same price.", "verified": true, "helpfulness": "0/0", "author": "Laurie"}]