[{"rating": 4.0, "review": "It is ok but not all I expected. Even with Prime viewing is limited somewhat. Shows and movies I would like to see are not available free with prime. I am still not sure it is worth $200. I would mention it to friends but tell of drawbacks.", "verified": true, "helpfulness": "0/0", "author": "Robert A. Martin Sr."}, {"rating": 5.0, "review": "I'm really happy with my Amazon Fire TV.  It's a great way to stream TV and it plays games! Now all it needs is a decent version of Slender Man.", "verified": true, "helpfulness": "0/0", "author": "Kenneth L Lemieux"}, {"rating": 5.0, "review": "Love my Amazon Fire Tv. Very easy to set up even for me (electronically challenged). Easy to use. Very happy with my purchase.", "verified": true, "helpfulness": "1/1", "author": "paw"}, {"rating": 5.0, "review": "I don't know how I lived without this for so long. At first I had problems setting it up but then I figured it out: Impute on my cable remote.  Now it's all up and I get to watch video's on demand at amazon and Netflix and loving it. I also love that there are free movies and TV shows that I can watch as well. It's a good deal, and will save me a lot on cable, which I was paying 130 for. Now, with Prime membership, I get all the movies and shows I want and when I want them for less than 100 dollars a year.. and free shipping on other items. Good deal for sure.", "verified": true, "helpfulness": "2/2", "author": "Lori"}, {"rating": 5.0, "review": "Roku was very easy to set up. Up and running in less than 3 minutes. 5 minutes to learn the control and then finished. Within 15 minutes a functioning unit. Fast, accurate, not too many buffer problems. Definitely better than Apple TV.", "verified": true, "helpfulness": "1/2", "author": "William Singer \"wrsinger\""}, {"rating": 5.0, "review": "I would give this product 10 stars if I could. Someone has already told about the ease of set up but I must reiterate what they said. Take out of the box, hook up to TV, plug in to power outlet and follow onscreen instructions. It took me less than 10 minutes. Anyone can do this. I love the voice control. Say the name of a star and up pops all of the movies they are in. I'm not a game player so I can't speak to that function but for watching TV shows and Movies, it can't be beat. I am a Prime Member so my choices are even more extensive. My husband (who said I didn't need it) loves it too. I think I deserve an I'm sorry from him.", "verified": true, "helpfulness": "3/3", "author": "Reading Queen"}, {"rating": 4.0, "review": "very fast easy setup but the menu is messi  and Netflix  need to be updated  and USB has to be working for an external hard disk", "verified": true, "helpfulness": "0/0", "author": "prebski"}, {"rating": 4.0, "review": "Amazon fire is a great asset to have if u do not have a smart tv and have a hdmi connection from computer to tv. Only negative thing I have to say isn't with the product itself but the espn now application isn't available in my area and was only reason for the fire.", "verified": true, "helpfulness": "0/0", "author": "Jacob Moye"}, {"rating": 5.0, "review": "I have roku, a htpc setup with xbmc. I bought this on a whim. People with xbmc were talking about it. I put the new xbmc gotham on it, works perfect. Now I have a complete media center. Can get rid of roku, and the htpc. I do use a pc to run plex though. But it works seamless..The 1080p support is awesome. I have run a 3d movie through it, and so far never an issue..If your looking for a great xbmc box and complete media center this is it", "verified": true, "helpfulness": "1/1", "author": "Kyle Grundtisch"}, {"rating": 4.0, "review": "Unfortunately, I love all the advertisements about the product. I ordered it, but only to find out my JVC TV was way out-of-date for this product. I only have one HDMI cable input. Until I purchase a new SMART TV, I'll wait. I would definitely recommend it for those of you that have TV's with more than one input.  Fred Meyer Electronics advised I could use a splitter on both ends to make it work, but that's not what I want to do. C Hubbard", "verified": true, "helpfulness": "1/1", "author": "Carol Hubbard"}]