[{"rating": 3.0, "review": "Very easy to set up.  I like the unit however I do hate how the pay and free shows are not seperated better.", "verified": true, "helpfulness": "3/3", "author": "Justin"}, {"rating": 5.0, "review": "Love it. Turn it on and it starts working.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like amazon tv but i do not like its gaming system. I bought two controllers but have had trouble finding any games that you can play with two people. All typically only offer single player mode. If anyone knows of any two player games let me know!", "verified": true, "helpfulness": "0/0", "author": "Megan"}, {"rating": 5.0, "review": "This thing is fast. Loads content from the internet way faster than my other boxes.", "verified": true, "helpfulness": "1/2", "author": "Jeffrey Mark Peronto"}, {"rating": 5.0, "review": "I cannot say enough good things about this. When I opened the box I was impressed at the beautiful presentation.  My family had fun with the voice recognition.  I do not like shows that are violent, maybe that is too strong a word, but fighting, killing, is not for me.  Neither is romance, first hour is people getting to know each other, and about an hour and a half later, they argue, break up etc., then at 10 minutes to the hour all is well again and they are in love. So I turn to Fire TV and enjoy.  I had a slight problem, and found that you just click on contact or support, and they call you.  I was thinking I had to sit home and wait, but the phone rang immediately.  The woman I spoke to went out of her way to solve it, but she finally had to send it over to Tech Support, and they automatically fixed and updated it.  They constantly amaze me!", "verified": true, "helpfulness": "3/4", "author": "Joanna Jenkins"}, {"rating": 5.0, "review": "works great and so easy to install.", "verified": true, "helpfulness": "0/1", "author": "sue obrien"}, {"rating": 4.0, "review": "Solid, the remote looks better and feels better to the touch then the Roku. Love the voice command or you have to do is press the button and say what you want to watch. May purchase another one for my other TV.", "verified": true, "helpfulness": "0/1", "author": "David M. Yee"}, {"rating": 4.0, "review": "Great product! super usefull... keeps the kids busy and I use it for exercise videos. wish I could search for Prime shows though", "verified": true, "helpfulness": "1/2", "author": "C. Gonzales"}, {"rating": 3.0, "review": "\"USB PORT DOESN'T HAVE ANY FEATURES BUT IT CERTAINLY WAS DESIGNED FOR A PURPOSE...\" -- that's what I've got after calling Amazon Technical support service department. No comments.", "verified": false, "helpfulness": "0/3", "author": "A-T"}, {"rating": 5.0, "review": "Great for kids.  Very easy to move from room to room.  Kids even take this with them when staying with grandparents.  App selection is getting better.  It would be great if Amazon could create a kid zone for prime TV.  Maybe we haven't figured it out yet (freetime?), but the kids spend most of their time in netflix kids because it's easy to find and it has their content.  It's really hard to play flappybird, but I think that's just my lack of gaming skills.  Great product.  Considering purchasing a second one.  Also the first product that's making us seriously consider cutting the cord with cable provider.  We also own an apple tv, roku (latest model), 2 chromecasts. This one is easy to use and stands out from the others. Also seamless to move between PS4, kindle, fire TV.", "verified": true, "helpfulness": "1/2", "author": "MBott"}]