[{"rating": 5.0, "review": "We bought the Amazon Fire TV to supplement our viewing options for times when the satellite service goes out because of heavy cloudcover, rain or snow.  I considered making this purchase for months because I was unsure whether our DSL service would be capable of streaming video. Well, I finally bought the Amazon Fire TV and started the installation. I had no trouble connecting the box to our TV, but for some reason, I could not get my 'communications company-supplied' DSL modem-router to accept the password that would allow the box to connect wirelessly to my network.  A little frustrated, I got out a long ethernet cable that we had from one of last computer set-ups and, with fingers crossed, I plugged the box directly into the router.  Excelsior! To my surprise and relief, it worked great so now we have an additional video viewing alternative to the satelliteservice and our antenna \"over the air\" local channels.  We love it, especially with all the no-cost films and TV shows on Prime Instant video.", "verified": true, "helpfulness": "0/0", "author": "PK Burket"}, {"rating": 5.0, "review": "It meets most of my expectations except there is alot of content that is still PPV and not sure why. Like movie UNCOMMON VALOR, came out in 1984 and still costs $3.99 to rent. Over all ease of use and setup are a breeze.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Holderness"}, {"rating": 5.0, "review": "Indispensable for cord-cutters or shavers.", "verified": true, "helpfulness": "0/0", "author": "Michael M."}, {"rating": 2.0, "review": "was under the impression that since 99% of the kids and 90% of the adult stuff did not work on the fire stick maybe I needed the fire tv. WRONG they get you with the free to members games and goodies but then it says you need permission ok from who? and they don't work. the adults area you gotta pay for everything almost maybe .99cents or 2.99 its another gimic brought into your home to make you spend more money. If it says FREE it should mean that period .is not less than the trueth is a lie just like our politicians they don't lie they tell less than the thruth WRONG again.", "verified": true, "helpfulness": "0/0", "author": "cpasqua"}, {"rating": 5.0, "review": "Way better than my roku!", "verified": true, "helpfulness": "0/0", "author": "Lolita"}, {"rating": 5.0, "review": "Absolutely LOVE my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "MDL"}, {"rating": 4.0, "review": "Awesome streaming hardware, the best I've used.  Still missing the NHL app.  An easy 5 star with the NHL app.", "verified": true, "helpfulness": "0/0", "author": "Goose \"Goose\""}, {"rating": 5.0, "review": "Great device. I highly recommend it", "verified": true, "helpfulness": "0/0", "author": "Julio"}, {"rating": 5.0, "review": "I don't know how I lived before my Amazon Fire TV!  It is so easy to set up and use.... I ordered another one !", "verified": true, "helpfulness": "0/0", "author": "DocHouseMom \"Susan\""}, {"rating": 5.0, "review": "Very responsive unit. Easy to use and enjoy. With sling tv app, this is replacing my cable service and saving me $$$", "verified": true, "helpfulness": "0/0", "author": "John Tyler Morrison"}]