[{"rating": 2.0, "review": "I was unimpressed.  I returned it when my free trial expired because I just didn't see the value.  The biggest drawbacks were the advertised channels are only available if you subscribe to one of the limited cable providers.  That means now you have a lot of worthless options to go through in the menu.  You do get Amazon Prime videos and netflix but that wasn't not enough really.  Not when I can find a blue ray player with those same features.  The voice control worked ok but again, didn't really make it worth the price since I couldn't see how you would use it unless you already knew what shows and movies were available.On the plus side, it did have a good picture, amazing really.  (I use headphones to listen so I'm not sure I can comment on the digital surround sound.)  I'll probably continue to try to find some other option with a better value and features which are useful to me.", "verified": true, "helpfulness": "0/5", "author": "Jules Hunter"}, {"rating": 2.0, "review": "If you are looking for a device which stream Amazon Prime, go for it. If you want to browse the internet, or use some other streaming service, think twice. It has go a powerful voice search and speed", "verified": true, "helpfulness": "2/7", "author": "kurien"}, {"rating": 1.0, "review": "The Voice Search feature is central to the use of this device as it is the only way to search for new content. The unit I received for a thirty day free trial did not have a usable Voice Search function. The beep signal to begin speaking was almost immediately followed by the end of speaking time beep, leaving no time to even blurt out the name of the content to be searched. As there is no other way provided to enter a search string, I returned Fire TV as non-functional. I will watch future reviews and may buy one if Amazon fixes this fatal flaw.", "verified": true, "helpfulness": "3/10", "author": "J. Donovan \"Smart Shopper\""}, {"rating": 1.0, "review": "Apple TV, that's all I'm saying!", "verified": true, "helpfulness": "2/19", "author": "minimedic71"}, {"rating": 4.0, "review": "I have had my amazon fire tv since Friday and like a review I just read it is hard to find amazon prime instant videos it not easy to use but when I have found something to watch it works well I really don,t know how to use the watchlist feature if I put something on it will I really get to watch it later I also get amazon instant video on my viera tv it seems to work better than the amazon fire tv is there something I am not doing right", "verified": true, "helpfulness": "0/0", "author": "charles duncan"}, {"rating": 5.0, "review": "The performance on this thing is amazing.  I went from 2nd gen Apple TV to a Mac Mini running iTunes, and was always pleased with the performance.  I decided to give the Mac Mini to my son and get a new ATV for our bedroom.  I started to pull the trigger on a new ATV but thought I would check out the stats on the Fire TV first.Fire TV beats the other devices hands down as far as being the latest technology, the quad core processor is awesome.  ATV is old tech, FTV is the latest and greatest (Apple has some catching up to do).  The real reason I first was going for ATV was iTunes, which I've been using for about a decade.  I've purchased a LOT of content on iTunes.  However, I've been a Prime member since the year Prime was first offered, and when Prime started offering videos, I started using it right away.  Nowadays I find that anything I want to watch on iTunes is on Amazon Prime, and if I have to pay for it the price is about the same.  Of course, there is almost no \"free\" content on iTunes, so you have to combine iTunes with Netflix to get the equivalent of Prime.So, content-wise, if you have Amazon Prime, the Fire TV has a big advantage over Apple TV and Mac Mini (which costs several hundred dollars).  If the ATV and Fire TV had the same level of hardware performance, I would still go with Fire TV because of the content advantage.  BUT, seriously, ATV is nowhere near Fire TV in terms of hardware specs. ATV is old tech, Fire TV is next gen (actually, it's like they skipped a generation or two).The voice search has worked flawlessly every time I've used it.  The remote has a good feel, and it well laid out (and doesn't have a hundred confusing buttons, which I hate).  I like it better than the Apple remote, and hope it lasts longer than Apple remotes (I've had to buy a few of them).  Apple really should add a button or two plus the voice command feature to their remote, which is perhaps a bit too minimalist.When I plugged it in Fire TV immediately started downloading and installing updates, but in a few minutes it was all rock and roll.  It hooked up immediately and without any fuss at all to my wireless network, and though I only have 12 meg service it has been running HD video without a blip.And seriously, the unit itself is tiny.  This thing really has a quad core processor?  It doesn't look much bigger than a quad core chip to me!One more thing, the remote is not IR, and you don't need to be in line of sight with the unit.  I've held the remote in the next room and operated the unit with no problem at all,  Truly amazing.I don't know about Roku or anyone else, but my family is a big user of Apple products.  We have two iPhone 5 cell phones, two ipods (ipod touch 4th gen), latest iPad mini, an iPad 2, and a Mac Mini.  Always thought of myself as an Apple kind of guy, but man, Jeff Bezos is really turning me into an Amazon kind of guy (full disclosure:  my son has a Kindle Fire and one of my many daughters has a regular Kindle).  I need to buy my son a phone next month, if the Fire phone was available on Verizon I would buy it in a heartbeat.Buy the Fire TV, you won't regret it.", "verified": true, "helpfulness": "2/2", "author": "Kenneth D. Lee"}, {"rating": 5.0, "review": "So easy to use! I like that my grandma can now watch Netflix and Amazon movies on her older flat screen TV.", "verified": true, "helpfulness": "0/0", "author": "CSSC82"}, {"rating": 4.0, "review": "Works very well.", "verified": true, "helpfulness": "0/0", "author": "Larry D. Kindle"}, {"rating": 1.0, "review": "Not satisfied with our purchase. It is very hard to understand on how to use this product. It should not be that confusing!", "verified": true, "helpfulness": "1/9", "author": "Amazon Customer"}, {"rating": 1.0, "review": "i'm very upset amazon really should have their departments coordinated. I can't get Amazon Music on it. I can't download 99% of android apps. I can't send movies from my iphone to it. It doesn't network with my PC. I'm returning this and getting a google chrome!", "verified": true, "helpfulness": "2/8", "author": "j10012 \"j20825\""}]