[{"rating": 1.0, "review": "Received and tried to get Netflix app to work with assistance from Amazon customer service for an hour and a half. No go. Then he said to wait 2-3 days for further technical help. No thanks. Showtime app isnt supported by Comcast as well. Total wash out. Apple TV here I come.", "verified": true, "helpfulness": "2/3", "author": "twgdmj7"}, {"rating": 5.0, "review": "I can't say enough good things about this device!The GUI looks good, and the way it starts streaming instantly is pretty amazing. My previous streaming devices have been Sony, and the Fire TV blows them out of the water in both performance and aesthetics.There is however an issue with wireless network passwords. The Fire TV will not authenticate your connection if your password is 18 characters long and contains the characters / and \\. Don't bother contacting tech support to ask them if the problem is with your password length, or the special characters. You will only end up hanging up in frustration.", "verified": true, "helpfulness": "1/1", "author": "J. Isaac"}, {"rating": 5.0, "review": "Great product.  easy to install/use.  Apps are pretty well thought out and haven't had many issues with them.  It would be nice if some apps came with instructions or tutorial to make it easier to follow.  For Amazon prime account holders its really a must have item to take advantage of all those free movies.  It would be nice if they allowed you to filter by free or pay. Well thought out product.", "verified": true, "helpfulness": "0/0", "author": "Steve K"}, {"rating": 5.0, "review": "Awesome! Spent 2 months researching between FIRE TV and Ruko 3. FIRE TV wins hands down. Better processor and storage. Works great with Netflix also. You just need to manual update for Netflix to work. That is easy to do. I love Christain musice si I got the IHEART app and able to have the stations play on Fire TV, No need to pay for cable which I don't.December 16: I ordered another Fire TV to give to my nephew. He LOVES it! Will buy another for a friend soon!", "verified": true, "helpfulness": "0/0", "author": "colleen drew"}, {"rating": 5.0, "review": "With Netflix and Hulu added to our Prime, it's all we use since it arrived. We are still exploring the additional media apps, but are so far very pleased. The voice command works for everyone, even the toddlers. Many shows we watch on Netflix or Hulu are not Prime and the voice command only works to find Amazon media. But the menus are simple to navigate and the little ( easy to lose) remote has very simple, clear buttons. There's an option to sync with the kindle and flick media over, neat.Only major concern so far is that when I set the parental controls nearly all the children's Prime content was blocked on all our Fire devices. After much research and trial and error with customer support it seems that as most the shows are unrated, they are blocked. So to access kid content, we have to remove parental controls. I hope Amazon will allow parents to override individual shows or otherwise resolve this issue.", "verified": true, "helpfulness": "0/0", "author": "yolanda"}, {"rating": 4.0, "review": "Lets just say i canceled  my cable  after using the Amazon fire tv", "verified": true, "helpfulness": "1/1", "author": "Mrs Techno Junkie"}, {"rating": 3.0, "review": "I like my Roku 3 better.The fire TV is good but Roku has a simpler and easier to use menu system and I just like it better", "verified": true, "helpfulness": "0/1", "author": "Dr. XYZ"}, {"rating": 5.0, "review": "Voice search puts this leaps and bounds above the other competitors. It's very accurate and super convenient.  Voice search isn't available in apps, so I still need to help when my youngest are using Netflix.  If they made voice search ubiquitous, it would be unreal.", "verified": true, "helpfulness": "0/0", "author": "mrfurhley"}, {"rating": 1.0, "review": "I ordered on line and received it today.  Connected it and it in a foreign language .  No apparent way to change to english.  Bad job Amazon.", "verified": true, "helpfulness": "1/6", "author": "RichardS"}, {"rating": 5.0, "review": "I've had Apple TVs for years and have been relatively happy with them. This is definitely better than they are, though. When I am using an app that is available on both Apple TV and Fire TV, I always go to the Fire TV. It is much faster than the Apple TV, and the way apps are displayed is based upon which you have used most recently. Primarily we use it for Netflix and Hulu Plus, but dip into the Prime content on occasion.The voice command works for finding Amazon content, but I cannot get it to locate a show on the Netflix or Hulu Plus apps. That requires either scrolling through, or using the remote to enter text. That's annoying, but it's no different from using Apple TV or Roku.", "verified": true, "helpfulness": "0/0", "author": "Christine"}]