[{"rating": 4.0, "review": "I played around with mine a bit last night, and these are my initial observations compared to Roku. Many of these points are minor, but are just things I noticed.Pros:- Premium look & feel. Felt like I was unboxing a much more expensive device.- I like the lower/flatter profile, as it disappears next to my tv- love the faster menus, less laggy interface- voice search is near flawless. It understood everything I tried.- beautiful screen saver. I actually just sat there and watch it a bit.- ASAP within Amazon Prime (zero buffering)- seems to run a bit cooler than my Roku3Cons:- ASAP doesn't seem to do much in Netflix, still buffers, maybe even longer than Roku3.- In Amazon Prime, it's a bit confusion what's free with my membership and what isn't,Even free Prime stuff has a buy it in SD, HD, etc... I was always paranoid I was accidentally goingto get stuck paying for something I thought was free. I wonder if this is intentional to sucker peopleinto paying for free content.- Voice search only works for Amazon Prime, or to bring up an app.- No HBO GoIf they update this box so that search & ASAP works throughout, it will be my favorite box. The navigation speed and ASAP ( along with maybe the voice search) are killer if they get them to work throughout the apps.Also, while I didn't try any games, what they showed during the intro setup video look quite impressive graphically. If you are a casual gamer and don't feel like spending $400 for a full blown system, this could be something else that pushes you towards the FireTV. If their controller was a bit cheaper, I probably would have bought it, but at $40 I'll wait.", "verified": true, "helpfulness": "6/6", "author": "Michael M"}, {"rating": 5.0, "review": "I set up the Amazon Fire Tv yesterday. I am very pleased so far. I got it mostly to more easily watch Amazon videos and Netflix. I was pleasantly surprised with the additional content and found myself browsing for hours. The instructions to set up the box were not that clear, but I finally figured it out. I was trying to put the hdmi in the wrong spot, and the black on black circular control was not clear to me at first I kept trying to hit the arrow buttons. But now that I am clear on how to use the remote I really like it. I love the voice search too.", "verified": true, "helpfulness": "1/1", "author": "P. Friday"}, {"rating": 3.0, "review": "Just got mine delivered yesterday, easy to setup.Pros:1. Very snappy performance, very, very snappy2. In app experience very similar to Roku/Other Streamer channels3. Don't get why people so upset about no HBO GO. HBO Go requires a cable subscription right? Isn't the point to cut the cord?4. Voice search but also a con, see belowCons:1. Very annoying intro video/sales pitch that you can't skip2. Do not like navigation interface - dual vertical nav column is not entirely intuitive and makes TV look busy.3. Voice search, while it works, is currently ONLY limited to Amazon content in my experience so far (I have Netflix, Hulu, and Plex channels/apps installed), so if you search for something that for example is on Netflix (as part of subscription) and Amazon, only shows Amazon content. This also stinks if you use Plex, b/c Roku universal search works across everything including your content (i.e. Plex).", "verified": true, "helpfulness": "1/3", "author": "Charles F"}, {"rating": 2.0, "review": "The UI is better than the rest of the pack, but the voice search only works for Amazon content (of which I have none) and not for any of the other streaming services supported by FireTV. I feel I was misled as the advertising (video and product description) failed to mention that explicitly.And speaking of voice search that \"actually works\" - it doesn't always; many times it missed some of what I said probably due to the fact that you have to hold down the button the whole time. Different from Siri and for an apple user like me it is difficult to switch that muscle memory I have for speaking to a device. I'm returning FireTV and am bummed because I was very hopeful this would be THE device to use.", "verified": true, "helpfulness": "8/10", "author": "Ryan F Krause"}, {"rating": 5.0, "review": "I received the Fire TV on 4/4.  I decided to buy it after reading all the reviews and ignoring the one star reviews from people who clearly had not purchased the Fire TV (seriously?).I was streaming Amazon Prime and Netflix through a Panasonic BluRay player.  Yes, it worked.  But not well.  The interface was super clunky.  It took forever for anything to load (especially Netflix, you could fall asleep waiting for Netflix to load) and there was often buffering while watching videos.  I had actually been thinking of getting a Roku to stream with but it was hard to justify spending the money when I had something that worked, just not that great.  When I pulled up Amazon and saw the Fire TV my immediate reaction was \"I WANT\".From taking the Fire TV out of the box to downloading and installing the updates took about 15 minutes (and that was with the cat yowling for the entire time - if I can quickly set up a device with the loudest yowler on the planet making me nuts, anyone can set this up).  The box is small and unobtrusive.  I tucked it away on a table next to the TV.After watching the tutorial video, I of course decided to immediately test the voice search.  I searched for at least ten different titles and actors and the voice search was correct every time.  It really works.The videos load SO fast.  The Tudors was up and running in a couple of seconds with a beautiful 1080p picture.  It's awesome.  For all the impatient people of the world, this is your device.I also decided to download a game and try it out even though my game controller has not arrived yet.  I chose Polar Bowler which I figured would be fairly easy to play with the remote.  The game downloaded fast and played smoothly and the graphics were nice.  I'm sure that the controller will be better, but you can play a simple game with the remote.  I'm a casual gamer and I'm sure I'll have fun playing some games even though I'll be primarily streaming videos (and some music).The remote is a nice size and very simple.  I appreciate the limited number of buttons and the good spacing of the buttons.  On my BluRay player I was constantly accidentally hitting the wrong button which would kick me out of whatever I was watching or navigate to the wrong place.The interface is simple but easy to use.  If you go to the home screen you have a menu on the left for things like \"search\" \"watchlist\" \"your video library\" \"tv\" \"movies\" etc. and to the right are rows like the carousel on the Fire for recent viewing, new prime offerings and the like.  The ability to do some customizing would be nice, but that may come in the future.I'm satisfied with the offered apps.  I don't need every app offered on the planet.  I would never use the majority of them.  I don't care about the absence of HBO Go (and anyway I'm certain it will be offered in the next few months).  I set up Netlfix and it works much better on the Fire TV than it did on my BluRay.  The videos on Netflix don't load nearly as fast as Amazon's videos load, but still plenty fast.  I hope that Netflix and other apps on the Fire TV are updated to work with the voice search.  That would make this device perfect.If you already have a Roku 3 or an Apple TV that you love and you're not interested in casual gaming, you probably don't need a Fire TV (but you might want one anyway).  If you don't have any streaming device or have one that you're dissatisfied with, you should definitely take the plunge with the Fire TV.  I love this device!", "verified": true, "helpfulness": "1/1", "author": "D.L."}, {"rating": 3.0, "review": "Plugged it in and it flashes between orange and white but never displays anything on the screen. Now I get to deal with the return fun.UPDATE! Was able to get it back up after restarting the unit a few times. We will see how it goes.", "verified": true, "helpfulness": "3/7", "author": "Calvin G"}, {"rating": 5.0, "review": "First off, you must own one before commenting if the product works or not. I have one as of yesterday afternoon. Out of the box the device reminds me of the first Roku in width. The software upgrade was a bit slow but it depends on the speed of your network. Once rebooted I was stunned at the beauty of the picture and audio. I has zero loading, reloading errors which was a nice change and was able to watch movies without interruption. There are some who say the apps and menu selection are limited but I'll ask them, when Roku and apple tv launched their first video tv product how many working apps did they have and how good was the video?  For the first installment of the Fire TV I must give it 5 stars. I love my Roku players and don't plan on replacing all 5 in my home but the Fire TV is a nice addition to the family. On another note Amazon, please add my music and audio books to the Fire TV library. My digital library is extensive and I'd like to take advantage of it.", "verified": true, "helpfulness": "3/3", "author": "Karen"}, {"rating": 2.0, "review": "4/6/14I can't say I solved the problem, but I may have fixed it, at least for now.  After trying a few reboots, and even switching WIFI settings around, I pulled the batteries out of the remote and put them back in again.What led to this was the voice command had stopped working completely.  I'd hold the button and get some kind of error message. It occurred to me that if the issue was in the device with the microphone, maybe resetting it would do something.It is working much better now.  Amazon was zero help on this.  Polar opposite of their strong support for the Kindle Fire HDX, which provides amazing support.  Not so for Fire TV.  Rating stays at 2 stars for now while the dust settles.4/6/14Buggy!!Fire TV's \"Help\" videos were stopping and resetting after about 20 seconds.  They were playing through just fine on the first day.Remote works, now it doesn't, now it does, now it doesn't - seems to be responsive only once it's active and then it's quick, but if you put it down for a while and pick it up, push the button, and you WAIT, and WAIT, and then something happens.VERY FRUSTRATING.Will they say it's my WIFI connection?  It should work fine, as it does with other devices.  At the moment, nothing else is using the WIFI, only Fire TV, and it is just fits and starts.With my Kindle Fire HDX, I get a button that says \"Mayday!\" and instant help.Try finding help for Fire TV.  You will hear the sound of crickets.I like the video quality, and the streaming is great once it's going.  But getting around - you would think if it can stream video, it has more than enough punch to scroll from menu to menu.  But it does not.  It is stinking slow, quite often.It still occasionally jumps back, unpredictably, from one menu location to another.There is more that I can't remember.  This is supposed to be the be-all-end-all.  Not so.  I'm also not happy that the reviews are finding so many things missing in this product.I am thinking that I may return it and wait for Apple's next offering.  We can survive without fluff quite nicely.  Was hoping for something more substantive, that WORKED reliably.Lowered to 2 stars for inexcusable bugginess from a world-class outfit with top notch specs.  Inexcusable.---Update-4/5Although this device is quick and responsive - that is, when it is - I found myself sitting there waiting for the box to respond to the remote indefinitely tonight, and could only get any kind of response by pressing the Home key and then going back to what I was doing - which was installing apps.Maybe coincidence, maybe not, but it seemed to start with these problems after I activated the game controller.Another thing, it would sometimes go in the opposite direction.  I would try to scroll across the list of apps, and if I selected one, I would go back to the previous screen.  Again, I had to hit Home, and then start all over again.FINALLY, there are so-called \"free\" apps that are not free, but rather sneaky come-ons with 14 day trials for a non-free version.  I absolutely hate this.  A trial is not a free app.  If it isn't crippled in any other way, and it often is, it is still a loan, a temporary access to the service after which you are cut off.I do not mind paying for subscriptions.  I even appreciate trials that let me check out the service first.  But I absolutely despise the sly and deceitful snake-oil that prompts you to download something as \"free\" when it is definitely NOT free.  I am now looking for two things - how to get those apps off the Fire TV, and how to find the apps on Amazon where I can give them the appropriate feedback/review.On more of the upside, I'm finding additional useful apps and hoping there will be a few that give me what I want with respect to news, weather, and traffic - local stuff that is so indispensable to those of us who aren't bussed to our jobs in Silicon Valley.--I want news, weather, internet information.  So far, this looks like a really nice toy, for entertainment only.  I have enough toys already.I know this thing is evolving but I really want to cut the cable.  Cut - the - cable.But Fire TV is not doing that.  My first impression is that it is basically an Amazon revenue pipe, and whatever doesn't make them money, directly or indirectly, seems to be filtered out of my choices.If I don't see more than that happening on this thing but QUICK, it is going back to Amazon for a refund.What does work, works great.  Love that part.  But I need more.  It's all sugar and cake, not a meal.", "verified": true, "helpfulness": "5/13", "author": "jmhr"}, {"rating": 2.0, "review": "So, here's the deal.  Is it fast? yes.  Is the UI slick? yes.  Is it better than Roku?  not sure.  Here's my list of pro's/con's:Pros:- FAST...very fast, actually compared to Roku.  Of course, its a quad-core processor, its naturally going to be swift.- UI...really nice, actually better than Roku in terms of look/feel.  great user experience- form factor...tiny, minimalist.- remote...pretty nice, really like the voice feature- Amazon one-click purchasing...obviously handy when purchasing apps.Cons:- no HBOGo?  That's like not having Netflix available....especially considering Game of Thrones is due up very soon.- my BIGGEST issue: Audio support.  I was really hoping i could get up to 7.1 surround through using Plex.  Most of what i watch is being served up from my PC in the form of 1080p .mkv's.  Most of which are either 5.1, DTS, or higher audio formats.  All i get working is 2.0 stereo.  This is a major issue considering my intended usage...to replace my Boxee box.  The only time i can get an audio signal over 2.0 is through the Amazon Prime movie selection and its Dolby Digital +...which sounds great!  I just wish i could get that through both Plex as well as Netflix (once again, only 2.0 stereo).  Roku will at least do 5.1 using netflix.- direct play of media files from my PC (other than using Plex).  Once again, a great feature of the now discontinued Boxee Box...i can't understand for the life of me why all these new media boxes don't offer this functionality.While I'm sure there will be some software updates/patches coming soon, i'm likely going to return  this thing until its ready for primetime.  Good effort, but its not really meant for the tech geek, but rather for mom or grandma.", "verified": true, "helpfulness": "5/10", "author": "Mr. Roboto"}, {"rating": 5.0, "review": "One feature that I really like that isn't mentioned are automatic screen saver slides that start up if the device isn't being used.  The screen saver shots don't seem to repeat (presumably they are streamed over the Internet), and are very relaxing travel and natural scenes.The device set up without difficulty (although I did purchase a TV sound bar to increase the sound quality), and is very intuitive to use.  Our remote might get lost (we have a family \"tradition\" of somehow losing remotes) -- the remote is small -- but Amazon does have replacement remotes available for $27.  Nice to know they're available if needed! ---", "verified": true, "helpfulness": "2/3", "author": "craigery"}]