[{"rating": 2.0, "review": "My TV is already using the HDM port to run my TV .I cannot us the for for Fire fox TV and to run Firefox.  What do you suggest I do.", "verified": true, "helpfulness": "0/1", "author": "Unknown"}, {"rating": 2.0, "review": "Poor choice of movies, voice command doesn't work.  I have to pay for any type of current movies if they even have them.  I thought the Amazon Prime I subscribe to would not charge extra for movies.  What is the sense of a subscription?", "verified": true, "helpfulness": "2/5", "author": "kay reeves"}, {"rating": 3.0, "review": "Loved the basic concepts of the Fire, but after telling people (who were watching me set it up) how so many movies were \"Prime\" and therefore free, was embarassed to see that some huge amount of offerings were not \"free\". I'd echo the suggestion/request to have a feature that let's you view \"Prime\" offerings only and or $1.99 offerings only.Also was amazed to see that recent episodes of TV series cost $2.99? How does that make any sense when you could have recorded the same episode for ZERO cost? One of the main reasons I purchased this was to avoid needing to record shows.Also was very upset by the need to pay $40 (40% of the unit cost) to buy a non-included HDMI cable. Couldn't they include at least a short, basic cable and charged a bit more?", "verified": true, "helpfulness": "0/2", "author": "GZ"}, {"rating": 2.0, "review": "Upon installation , my Ethernet connection would not  connect . The support sites did not help . Amazon would really benefit from live online or phone support . Hooray for the refund button .", "verified": true, "helpfulness": "0/0", "author": "ralph smith"}, {"rating": 1.0, "review": "Nowhere in the description do I remember reading your TV needs an Ethernet connection.  The cable isn't included, so i went to buy the cable and when I got home and looked at my set to plug it in, there was no place and my set isn't that old.  I guess I need to invest in a new TV.  I think I'll just watch on one of my I-Pads for the time being.", "verified": true, "helpfulness": "6/17", "author": "William  D. Mullinix \"Guillaum M.\""}, {"rating": 5.0, "review": "Its tons of fun. I truly enjoy using the product with no complaints. But I hate they make you write so much in the review.", "verified": true, "helpfulness": "0/1", "author": "lettremortre"}, {"rating": 5.0, "review": "For years i've been using a crt tv with no internet access. Heard good things about about Samsung including the FireTV. So, I finally purchased a Samsung 32inch flat panel TV along with the FireTV and Love IT! I waited for the right thing to come along and this is it!  Amazon FireTV is the bomb! Setup was a breeze, depending on your tv, the only thing you have to be aware of is the input method.  If you have Amazon Prime and Netflix, you'll love this for your tv. As a matter fact, regular TV will soon be a thing in the past. Highly recommend!", "verified": true, "helpfulness": "2/2", "author": "Rafik \"RafikNY\""}, {"rating": 5.0, "review": "I am writing this on the hopes that people who work for amazon actually read these things. The fire tv is actually a pretty great product, it works fast, has a decent amount of apps, and the voice search is accurate and convenient. However the one problem is one that other customers have brought up. There is no way to view \"Prime Only\" movies and tv shows. There are a few categories such as most popular tv/movies on prime, and also recently added tv/moves on prime.I have an xbox one in my living room and a fire tv in my bedroom. The app on my xbox one is leaps and bounds better than the interface on the fire tv. The main point being, the xbox amazon prime app has only prime content on it.I get it tho, amazon wants people to buy content directly from them but they can do this another way. Please add the amazon prime app to the list of available apps. Or simply make a category that is \"Prime Only\". This seems like a simple solution and will get rid of a lot of the negative reviews on this product. If you are able to change this, Ill change my review to 5 stars right away. Great product but needs an update to fix this one annoying part.EDIT: 8/26/2014I said I would change my review when they fixed this and low and behold they did so here I am. I pointed out that there was no \"Prime Only\" section and would be a great addition to the device. I actually had someone from amazon reach out to me and let me know that they were working on this update. Now the Prime Only is a section and will alleviate a lot of the negative reviews on here. It's really amazing when a company listens to their customers feedback and actually respond to it. The Fire TV will only get better in time as they release more apps/updates/and content. Its assuring to know that Amazon listens to their customers and plans to make the Fire TV even better (crossing my fingers for HBO go app!!) 5 stars for the Fire TV and Amazon. Cheers!", "verified": true, "helpfulness": "4/5", "author": "Jeffrey"}, {"rating": 3.0, "review": "I bought this on a whim, as apparently I'm addicted to streaming boxes, having owned every generation of AppleTV, Roku and others.It's pretty ambitious, with lots of ideas crammed in there that should make it better than the others but in reality they don't offer anything particularly compelling.  For instance, speech recognition only works for searching Amazon's own stuff.I use this as a Plex frontend, and it is beautiful and fast, but has stability issues compared to running it on my other Android devices where it's rock solid, so I think it could be a FireTV problem.The remote stupidly has the home button right in line with the most used buttons, so for the first few weeks expect to keep exiting all the way out of whatever you're doing and ending up at the home screen.The whole coins system of purchasing stuff is a waste of time.  Haven't they seen what Microsoft did with the Xbox currency?  It's just a frustrating and needless obfuscation that keeps you one more step away from knowing what you're really spending.Games are fun, but nothing mind blowing.  Plus, the power-off key for my controller is the home button, which once the controller turns off, the FireTV seems to think it's still pressing the home key, so I can't do anything.  I end up leaving the controller on and waiting for it to go to sleep.I expect big things to come out of this though, it's a great first shot.", "verified": true, "helpfulness": "1/1", "author": "mwo \"-M\""}, {"rating": 5.0, "review": "Very happy with this liottle box. I was watching my Prime videos and Youtube videos just minutes after plugging it in. No streaming issues and has great HD picture. Voice search has had no problem recognizing my words.", "verified": true, "helpfulness": "1/1", "author": "Pat A Pal"}]