[{"rating": 5.0, "review": "This was an early Christmas present to my son. He absolutely loves it. He says it's very fast and picture is crystal clear, unlike his game players that he was streaming from. I'm thinking I should have one for the TV in the living room. Then when my friends come over we can all watch a movie from my video library. My son loves the game playing feature too!", "verified": true, "helpfulness": "0/0", "author": "Diana Wise"}, {"rating": 5.0, "review": "First day using it and it's awesome!  But found a couple flaws:1. Kept getting a purchase failure when trying to download Netflix.  To fix it, I had to run a system update by going to System > About > Check for System Update.  Had to give the box a rest to update, when I checked back a couple hours later my issue was fixed.2.  Watch ESPN app doesn't work with Directv.  I hope they fix this!", "verified": true, "helpfulness": "2/2", "author": "RBC"}, {"rating": 5.0, "review": "Unlike other devices, this one understands my voice with no problem.While it does a great job of finding videos on Amazon it would sure be great if it could find stuff on Netfilx.I wish Amazon had more documentaries and foreign videos.", "verified": true, "helpfulness": "0/0", "author": "C9419"}, {"rating": 5.0, "review": "I cannot say enough about how much I love this little black box! We recently stopped our DirecTV in favor of strictly streaming. Amazon Fire TV makes it so easy to surf my apps. I just love it!", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 3.0, "review": "This device definitely has potential. There are a few features that the Fire TV is missing:  1. The Flixter app is a subpar substitute for Vudu. I can watch all of my Ultraviolet movies, but not my TV episodes.  2. The app that allows you to control Fire TV with your smart phone or tablet is still MIA.  3.  Screen mirroring from a mobile device (without buying a 3rd party app) is convoluted and unnecessarily difficult. I still have not been able to.  successfully mirror my Samsung Galaxy Note 10.1 2014.I'm glad that Amazon added Prime Music to the list of features. This is a great benefit of Prime membership.  With some minor tweaks this could be the top dog in the arena!UPDATE December 6th 2014. - The Fire TV remote control app is now available for Android. I still haven't found it for iOS.", "verified": true, "helpfulness": "0/0", "author": "danfab"}, {"rating": 5.0, "review": "We have cut the (cable) cord, so to speak. We purchased this to assist our family with streaming Amazon Prime shows and it works great. The interface is easy to use, especially since we are using it for Amazon. I would say it is definitely geared toward Amazon service so if you are looking to use it for other services you may want to look at Roku or another option. It's fast and smooth and easy to find what we want with the voice activated button and easy search functions.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've had a Roku for several years, the Fire TV runs circles around it in every way.  The performance of games, menus, videos, everything on this tiny device is just amazing and in the month I've had it no freezing or rebooting.  With support for Prime videos, Netflix, Crackle, Vevo, YouTube, and now Prime music, my only problem is watching my bandwidth cap as there's so much to see.  The bluetooth remote is awesome too, you'd be surprised how nice it is not to have to point the silly thing at the TV, and the 2nd screen for the Fire tablet is pretty cool too (though I haven't needed it much since the unit itself has everything I use).  If you love games, the controller is definitely a worthwhile addition, I hope Amazon keeps the awesome games like Sev Zero coming.  One of my favorite purchases this year, thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "budjdjdj"}, {"rating": 4.0, "review": "I will have a review in a week.", "verified": true, "helpfulness": "0/0", "author": "luv dem boots"}, {"rating": 5.0, "review": "This device works perfectly with my tv and internet. Extremely easy to use and setup! Not to mention all the different apps! Hope it will have the HBO app soon", "verified": true, "helpfulness": "0/0", "author": "Nicholas Hall"}, {"rating": 5.0, "review": "Works fine, easy to setup, looks like a winner.", "verified": true, "helpfulness": "0/0", "author": "Don Ryerson"}]