[{"rating": 4.0, "review": "Very good, would highly recommend it.  Would love to see more free movies and shows with Prime to better compete with netflix.", "verified": true, "helpfulness": "1/1", "author": "Craig Mohamad"}, {"rating": 5.0, "review": "is just amazing", "verified": true, "helpfulness": "0/0", "author": "Adan Parra"}, {"rating": 5.0, "review": "simple helpful entertainment tool", "verified": true, "helpfulness": "0/0", "author": "Creative"}, {"rating": 5.0, "review": "Very easy to setup, Quality of reception is excellent. I receive the unit from relative that had already used it in a west coast time zone hence the HOME screen time was west coast time. I had difficulty trying to set it to east coast time. With the assistance of chat and a knowledgeable  agent the issue was quickly solved.", "verified": true, "helpfulness": "0/0", "author": "Lester V Perkins"}, {"rating": 5.0, "review": "I'm a big fan of this product.  My Smart TV Netflix app does not compare to this one.  Amazon Prime is much better as well, it offers me more choices when browsing for movies compared to my smart TV.  The apps and games are great as well!", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Rafael Reveron"}, {"rating": 5.0, "review": "BEST. PURCHASE. EVER. MADE. there is nothing more to say. For someone who doesn't like regular cable tv, this is gold! And the best part is knowing what u have now is not all you'll get!", "verified": true, "helpfulness": "0/0", "author": "steph"}, {"rating": 4.0, "review": "Not bad, I do enjoy using it, more apps too would be great.", "verified": true, "helpfulness": "0/0", "author": "Darrin"}, {"rating": 5.0, "review": "It works great hard wired to my router. I love it.", "verified": true, "helpfulness": "0/0", "author": "AO"}, {"rating": 2.0, "review": "Yes i like it. Didnt know i had to have permission from cable companies to view old shows", "verified": true, "helpfulness": "1/1", "author": "carlos a austin"}]