[{"rating": 2.0, "review": "I liked the packaging of this product and the fact that it is voice activated.  I do not have the premium services of Netflix or Amazon Prime.  The only thing I could do with the box was stream Pandora radio.I also liked the screen saver aspect, nice pictures.Just not for me at this time.", "verified": true, "helpfulness": "1/2", "author": "Hal Starling"}, {"rating": 3.0, "review": "I ordered this product on a 30 day trial as a Prime Member.  I received it within a couple of days and was excited to get started.  Set up was so easy a child could do it.  I added a Hulu Plus Trial Membership to make this thing fully functional.  I tried out the voice activated remote control which translated my voice perfectly and found the programs I was looking for with great ease and relatively quickly.  I was able to navigate to Hulu Plus and search through those offerings as well.  Everything works well...except -The offerings through Amazon all cost a minimum of $1.99 and higher.  This could be a costly proposition.  Searching using the icons was confusing and not in any particular order - not alphabetical, so it was a laborious process to look through all the offerings that way.  No way I could figure out how to discern FREE programming from priced programming.  Same with Hulu Plus.  Everything I searched for had an additional charge and was not in alphabetical order.  Could not easily find a way to ferret out only free programming.  Could not find a way to search only through Prime membership offerings, which would have given me the free options I get on my p.c.After playing with this for about a week, I decided to return it.  The upcharge required for the TV shows I was looking for was not for me.  Great idea that needs a little more work.  I would consider buying again later if they get those issues worked out.", "verified": true, "helpfulness": "1/1", "author": "pattivhome \"pattivhome\""}, {"rating": 5.0, "review": "I am so happy I tried this!!  I love it and will be keeping it, so many great things to do with it.", "verified": true, "helpfulness": "0/0", "author": "April Knowles"}, {"rating": 5.0, "review": "The amazon TV works great I was surprised at what it has to offer. I've always had my apple TV but this has so once I connected the amazon TV I found myself using it instead of my other device's.", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 3.0, "review": "Amazon Fire is better suited for younger generation and the many ways they're using technology everyday. For someone older 67yrs. it could be good, but a person must have a high speed or broadband internet connection for it to be useful. Dennis H.", "verified": true, "helpfulness": "0/1", "author": "Dennis Hames"}, {"rating": 4.0, "review": "Similar to Apple TV but better! Netflix and Hulu autopay (play the next episode on its own) AND you can pick the apps you want to download. The voice function is great for browsing your apps or for finding things to watch.", "verified": true, "helpfulness": "0/0", "author": "Danielle Robinson"}, {"rating": 4.0, "review": "Liked the convenience & ability to watch entire seasons but surprised that not all items are available to Prime customers for free.", "verified": true, "helpfulness": "0/0", "author": "Diane Sorrentino"}, {"rating": 4.0, "review": "Very easy to figure out! Nontechnical people do not be intimidated!! Awesome selection of apps and it produces a great picture.", "verified": true, "helpfulness": "0/0", "author": "M'Lissa C Smith"}, {"rating": 1.0, "review": "Did not want to connect to the wifi even though the ps3 and roku connected just fine. It did work when it was like 5 feet away from the router, any further and it wouldn't connect.", "verified": true, "helpfulness": "1/3", "author": "Andrew Ortiz-cruz"}, {"rating": 4.0, "review": "I purchased the Amazon Fire to stream Netflix.  Very satisfied with that.  It will take some time to decide about the value vs cost for the other streaming feeds.", "verified": true, "helpfulness": "0/0", "author": "Dennis W."}]