[{"rating": 5.0, "review": "Love amazon fire TV! It is easy to set up and use. I was streaming via my laptop prior to this purchase. Fire TV is easier and no streaming issues.", "verified": true, "helpfulness": "0/0", "author": "Treno"}, {"rating": 5.0, "review": "Got this for my mum for Mother's Day. I was able to set it up easily in a few minutes. Took me a while to figure out the that the center circle is the actual button but then things were really easy. All we needed it for Netflix and my mum is so happy with it.", "verified": true, "helpfulness": "2/2", "author": "Elizabeth A. Delaney \"elizabethamber\""}, {"rating": 4.0, "review": "This is a good device .  I like it because it is small and works very well. Makes your TV a smart TV so to say.", "verified": true, "helpfulness": "2/2", "author": "June"}, {"rating": 2.0, "review": "There's a lot to like about the Amazon Fire TV. It's zippy, unobtrusive, and the remote feels luxe. There's also much to dislike: the perplexing lack of HBOGo, the Netflix app looks several-generations dated, and the strange choice to implement the marquee feature (voice search) solely with Amazon's content.My biggest issue is as an Amazon Prime member. I expected a much easier way to find & discover Prime video content. This isn't the case, since the Fire has no visible notation of what is Prime content during search, until you drill down into a show.As the UI on the Fire TV stands now, you are forced to select a show from Amazon's library, and then maneuver to that specific episode's page, and then select the option to watch for free below the purchase buttons. Prime video content, It may be included, but it's impossible to tell at a glance what is/isn't free without some effort. I understand that Amazon is trying to sell content, but offering Prime video as a selling feature, and then making it incredibly challenging to find isn't the way to build user loyalty.Update: after reading this review, Amazon attempted to call me, and then sent a follow up email. The email is pasted below:Hello,Tried giving you a ring but wasnt able to get a hold of you, after reading your review figured I would give you a heads that what your looking for will be coming sorry for the wait though.With a free software update being delivered to you this Spring, you will be able to browse several categories of Prime content, including, but not limited to: Top Prime TV, Top Prime Movies, Prime TV for Kids, Prime Movies for Kids, Prime TV by Genre, and Prime Movies by Genre.HBO GO will become available on Amazon Fire TV later this year. HBO GO is HBO's authenticated streaming service offering subscribers instant access to over 1,700 titles online including every episode of new and classic HBO series, as well as HBO original films, miniseries, sports, documentaries, specials and a wide selection of blockbuster movies.In addition, classic HBO programming will also soon be available on Amazon Prime Instant Video.Thanks for using Amazon Fire TV.Best regards,Brandon H", "verified": true, "helpfulness": "5/5", "author": "m.e."}, {"rating": 3.0, "review": "This device needs more free movies attached to it as selection. Aside from that the device itself is good. But as a prime member I wish they would add more of a selection for under prime members.", "verified": true, "helpfulness": "3/3", "author": "mayra ruiz"}, {"rating": 5.0, "review": "It's easy to hook up and the variety of entertainment is good. Mainly for me it is the convenience of not having to bring my lap top out of the office and hooking it up to the TV to watch Amazon Prime, Netflix or listen to Pandora. The voice command really works!", "verified": true, "helpfulness": "0/0", "author": "Vicki"}, {"rating": 5.0, "review": "Before this I was streaming TV and movies using a Samsung Blu Ray player with wireless connection.  It was adequate usually, but sometimes streaming was interrupted and I would have to wait and try streaming whatever I  was watching later.  Then I saw the Amazon Fire TV commercials and decided to try it.  It is exactly as advertised.  Better picture quality and sound than I was been used to.  Also closed caption was much much better and best of all no streaming interruptions.  The one good feature you won't find anywhere else is the search function.  The voice activated search feature actually works.  I have not stumped it yet.  It is amazing.  Excellent product and works exactly as advertised.  Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "R. Brooks"}, {"rating": 1.0, "review": "It sucks it should come with the cable to or at least let it know on the description so we can know to bye it before it gets here", "verified": true, "helpfulness": "2/11", "author": "Juan Martinez"}, {"rating": 1.0, "review": "I followed all the instructions, the ethernet cable and watched the online presentation trying to figure out for a week how to get this internet connection rolling. Punching in codes (internet gateway and what not) several times only to have it repeat 'no connection' does not inspire confidence in this product. It is very frustrating to hear 'how easy' it is for others. I have great internet with my computer, laptop and ipad but not this.", "verified": true, "helpfulness": "5/7", "author": "Erika"}, {"rating": 3.0, "review": "Should have been five stars but device is severely hindered by the lack of USB support and dnla.  While amazon and Netflix are both good, people often have videos on USB drives or on dnla networked devices.", "verified": true, "helpfulness": "2/2", "author": "Melvin Cook"}]