[{"rating": 3.0, "review": "Nice design and easy to configure but lacks features for the price. If might be a good device for gamers but regular users will find it lacking. Nothing much special compared to much cheaper Chromecast. Cannot play local media and no screen cast option. I don't play much games so $100 price was a bit higher.", "verified": true, "helpfulness": "1/1", "author": "Arafat Ahmad Qureshi"}, {"rating": 1.0, "review": "This simply was a disappointing product all around. I have many tech items and aware of what I was purchasing, but not realized how gimped this product is in many areas. Returned after 2 days. I'll explain why.For one, 8 gig storage space for apps when some of the gaming apps on this system almost 2 gigs and there is only 5.4 gigs available to you is simply unacceptable without some storage solution via a USB port. Sorry, I don't feel like installing or uninstalling items all the time.Second disturbing thing about this product is what you download to it, is non accessible offline. That is right folks, you cannot use it unless you are completely online all the time. Let's supposed I want to play my games that Ive downloaded on my Fire TV and im away from home and no access to internet. Guess what, tough luck. Reeks of the DRM idea that Microsoft tried with the Xbox One and completely ruined their image.The apps in the Amazon store say that a certain game uses a game controller. Guess what, the game controller doesn't work. NBA 2k14 was compatible with the Amazon controllers. Now its not. But yet, the app is pushed on the store to purchase but no supported way to control the game. Ridiculous.The game controller...don't get me started. Dead zones galore. Half the games weren't responsive to it at all unless I yanked the analog controller all the way in the direction I wanted it to go. Ugh. Save yourself $100 and get an Ouya or save for a retro style system. Please do not purchase this for the sake of gaming.The last thing is Netflix is not even updated. It is the same app I have on my Smart TV that Ive had for a couple of years. No update, no nothing.But the Amazon Fire TV is recommended for those who don't game regularly, an older person who just wants something basic, and someone who has Amazon Prime. If not, stick with a Roku for your Netflix or your gaming system for that matter. The PS3 Netflix app blows this one way out of the water.", "verified": true, "helpfulness": "8/10", "author": "Brian"}, {"rating": 5.0, "review": "I bought this for my parents and they love it!!! easy to nag and use apps!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I enjoyed this product and works wonderfully.  I like the voice search.", "verified": true, "helpfulness": "0/0", "author": "Ka-Wing Chew"}, {"rating": 5.0, "review": "I LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Theresa K."}, {"rating": 5.0, "review": "I bought this for my husband for his birthday. The only bad thing about it is that he wont watch anything else!!!", "verified": true, "helpfulness": "0/0", "author": "milesmile"}, {"rating": 4.0, "review": "In direct competition with Roku 3 in my opinion.  I have this and the ROKU, the only thing that stops me from giving this 5 stars is Amazon's hatred of Google.  With Roku you can watch YouTube and stream YouTube from a computer/mobile device.  PLEX works great on both devices, as does Hulu and Netflix.  Sure you can access lots of apps through the Amazon app store.  We are also Prime members but I still don't understand why there isn't some filter in the movies/tv show section for just free Prime content.  It's a great start, but I think could use some software updates and filters.", "verified": true, "helpfulness": "0/0", "author": "Bethany L Thomas-Longmeier"}, {"rating": 5.0, "review": "We received our Amazon fire TV today and couldn't be happier.  What a great product!  After dealing with another brand for quite some time, we finally decided to try out the Amazon. For months we've been dealing with not being able to even access Amazon Prime or Netflix at times (even though they worked on our computer), slow uploads of movies and shows, and buffering in the middle of a show.  Not anymore!  The Amazon Fire was simple to install, and we were able to access shows and movies immediately!  No more frustrating evenings!  We highly recommend the Fire TV!", "verified": true, "helpfulness": "1/1", "author": "Terrie Harper"}, {"rating": 5.0, "review": "This is a no brainer for anyone who has Prime. It is as seamless as cable or satellite and in my case is more dependable.", "verified": true, "helpfulness": "0/0", "author": "James W. Sutton"}, {"rating": 5.0, "review": "awesome so far, canceling our cable now!", "verified": true, "helpfulness": "0/1", "author": "R."}]