[{"rating": 4.0, "review": "Updated 06/15 -Wow, new Music app is awesome, can get playlists, streaming, you get your music to this instantaneously, new games are awesome, and it's still blazing fast on devices and on Amazon backend (AWS).I am very, very impressed, this is no longer a work in progress, and v.1 release, it is now mature, and a complete replacement for my Apple TV (Well I do use Apple TV to get to HBO for GoT)Updated again 06/11Well I am still waiting for Cloud Player, and have added the newly released streaming music from Amazon, really surprised it's taken this long to get an update outBUT, what I really want to talk about is how fast this thing is, when I select play on a movie, it's instantaneous, think about that.Responsiveness locally on the box is super quick, but for them to have their cloud so quick is really amazing.I changed my mind, this will replace my AppleTV, especially once they get the music deal worked outI'm really impressedUpdated 05/11/14I am coming around, maybe it's the new HBO content? But I have been on FireTV more this weekend then the trusty old AppleTV.I am just waiting for the end of May update to Fire that is supposed to add Amazon Cloud Player, because AppleTV music player SUCKS big time, only very, very minimal functionality.If they get that right, will add another starWas also reading Q&A; and Fire, didn't realize they use MPLEX, and their is a PLEX app, so you can stream from video from local server, nothing for me, but many people will be pleased with that.Admit, I have an Apple TV, ChromeCast, XBox, Samsung DVD w/internet, and a Sony Receiver with WiFi and streaming apps, and now the Amazon Fire, so I can get NetFlix on all 6 devices :-)Out of the 5 I had, I had I use the AppleTV 99% of the time.So after an hour or so with the Fire, I can see it has TONS of potential for Amazon content, now they just need to add all my music, I have purchased hundreds of MP3's and have them in the Amazon cloud, but they are no where to be found in this current release, don't think it will take them long to get it out there, as that will increase their revenue stream substantially.I also don't see a way to get to Amazon the marketplace, wonder if they will release a keyboard for that.Bottom line, THREE STARS for now, there is nothing here that will make me give up the AppleTVI can see using Fire for all Amazon content, and then using the AppleTV for everything else.As someone else said, the NetFlix interface on Apple is SO much better", "verified": true, "helpfulness": "1/1", "author": "Michael L. Shanks \"MikeLee777\""}, {"rating": 5.0, "review": "Where do I start? Content devices :  PS3, BluRay network player, Apple Tv v3, Apple Tv v1 (running Crystalbuntu Linux), iPad Air running AirVideo over AirPlay, 4k TV. All hardwired Ethernet.Primary source material is served up via a Macbook Pro running iTunes with 16TB storage on a Drobo 5N SAN backend. Primary use is via Apple TV v3 streaming LOCAL iTunes documentaries, movies, music and photos; the simplicity of having all my content local, organised and easy to access via custom playlists is enormous. And because it is all local, it is fast. No Internet connection needed.I do not care at all about Netflix, YouTube, iTunes rentals or any other subscription service. And I will not get any of those services.Missing was easy access to Amazon Instant Video. Both Roku and PS3 offers Amazon Instant Video access, but the Roku interface sucks, and the PS3 Instant Video interface is not far behind the Roku for being onerous to use.As a Amazon Prime subscriber, I enjoy all the free British sitcoms on Amazon Prime Instant Video - but only on my iPad Air. Which means having to stream it via Airplay to the Apple Tv v3. Cumbersome.Enter the Amazon Fire TV.For me, it does one thing and it does it well. I am very happy with this purchase.", "verified": true, "helpfulness": "1/3", "author": "Stephen Rawlins \"EnglandGreen\""}, {"rating": 2.0, "review": "I had to return the product the same day I got it because of the remote. First of all, it was nearly impossible to open it. Finally, when I did and put in the batteries, I could not close the cover. It got stuck and since it is plastic, I was afraid it would crack. So, I packed it up and returned it for a refund.", "verified": true, "helpfulness": "2/9", "author": "Kenneth Kaye"}, {"rating": 1.0, "review": "I was quite excited about my purchase if this and then I plugged it in. The worst part of this is the incredibly poor sound quality. There is a high pitched whistling coupled with an echo on all channels. I tried several different HDMI cables. The cables work with other technologies and the tv sound works fine at all other times. There is no other option beyond the apple fire tv is faulty. I'm plugging my Apple TV back in.", "verified": true, "helpfulness": "5/28", "author": "SB"}, {"rating": 4.0, "review": "The Amazon Fire TV is a good piece of hardware.First the good:It is fast, easy to setup and works well.  All the streaming apps I care about are there beside HBO Go (Which is more of an issue with Amazon having to work with HBO to add it).  If you have an Amazon Prime account you have access to a ton of content right from the start.  Netflix and Hulu are here and work well.  For Netflix it is still using the older interface (Roku 3 has the newer, sleeker designed Netflix interface already) but it loads fast and videos load even faster.  The much touted Voice Search feature really does work super fast *I am using a Wired connect with Verizon FIOS so users with slow wifi connections and/or service providers may not get the same speed as it does use the \"Cloud\" to process searches*. Access to a bunch of free and cheap android based games is cool too, you certainly can't play this stuff on the current Roku or Apple TV.Now the bad:The interface HEAVILY favors Amazon Prime content, this makes sense but for those of us with Netflix and/or Hulu it would be nice to get to THAT content just as easily.  Right now its an extra step to get to TV shows or movies within the interface which is a bit of an annoyance.The Voice Search feature is mostly limited to Amazon Prime content, again this makes it tough when I say \"House of Cards\" and the first result is the TV show on Amazon Prime at $1.99 an episode ($2.99 for HD) when I have Netflix logged into my account on the device and I can watch it for free.That is it for the bad for me.The box is SUPER fast and responsive, setup was a breeze (My parents would love how easy it was to get up and running) and most of the video / steaming services people want are already there.  HBO Go will come in the future I'm sure as Amazon works with HBO.As far as the rest of the bad above, I sincerely hope Amazon will allow other video services to work on the box as seamlessly as the Amazon Prime Videos do. I would love to be able to search across Amazon Prime, Netflix and Hulu with the results favoring services I already have so the only time I see the first result being a Pay option is when it is not available any other way.If they manage to integrate their amazing voice search and ASAP tech with Netflix, Hulu and hopefully soon HBO Go I think this will be hands down the best streaming device on the market.", "verified": true, "helpfulness": "3/3", "author": "Christopher Lilly"}, {"rating": 3.0, "review": "Got it today and am not as excited as I was when I ordered it. It is missing a couple of things which if it added it would be THE streaming box instead of another streaming box1. Add a headphone jack on the remote, its on the ROKU 3 and is great late at night when your living room is next to the master bedroom.2. Add support for the USB port to allow us to plug in a flash drive or USB hard drive. I use the WDTV but its getting outdated and WD seem to have lost interest in it a little. WDTV supports almost any format. Copy them and you will add so much value to the box.3. Voice search only support Amazon. Please change this, I know its a Amazon product but if we also use HULU and Netflix it should allow searches for those as well. it needs voice version of ROKU 3's search function which shows all the shows on each available apps would be a big improvement4. Update Prime so it groups seasons together, right now they are all over the place. Never understood that way of listing on Prime5. Update Prime so it goes to the next show in the season, right now it just grinds to a halt. Copy Netflix here and run the next show after one has finished.Basically Amazon Fire would be the number 1 box if it copies and out does it rivals instead of just adding their box to the mix. Scale back a little on the all Amazon all the time look. We know its Amazon, a lot of us have Prime, don't make it so many clicks to use something else.Don't get me wrong its a good box and the games are fun on the big screen instead of a tablet or phone (especially if you don't have a XBox/Playstation) but they really need to dial back the Amazon in your face and improve the way other apps are integrated. You get the feeling that the next Amazon Fire TV model will the one to have once they get feedback on this one.I'm not sure yet if I will keep it.ROKU 3 is the best out there for the way it searches Amazon, Netflix and HuluPlus for shows and the great earphone socket. WDTV is the bestfor adding a hard drive or flash drive and viewing your own content. Amazon Fire TV really only adds a limited voice search and better games (than Roku).As others have said, if you don't already own a streaming box then this is a good buy. However, If you have a ROKU 3 this won't replace it......YET.", "verified": true, "helpfulness": "8/10", "author": "J. Darcy"}, {"rating": 3.0, "review": "We have several ROKUs as well as some Blu-Ray players offering streaming.  Amazon Fire TV is one of several options in this house.The bad news:The voice search is very cool--but it appears to only work for Amazon content.  For Netflix, which we also stream because it contains more content included at no additional cost than Amazon Prime--is still manual.  But, if I didn't have this device, I'd be searching manually for Netflix items as well as Amazon so I guess that's better.  My hope is that Amazon rewards us for taking a risk right out of the shoot with the release of this product and does not think we'll buy another one to get voice search for Netflix; but a firmware update is in order.The good news:Fire TV sets up quickly--and because we're Prime customers--we didn't have to do ANYTHING to get set up for our account with Amazon...it arrived ready to go as soon as we put the device on the network--didn't expect that.  Has an intuitive and clean interface that looks great.  Initial loads of movies, etc. are much faster.  And the picture is crystal clear HD with great sound.Overall, we're ok with it--but Amazon needs to fix the integration with other streaming services with the voice search.  I'm sure there was concern about loss of market, but if Amazon offers a great product and plenty of content, it won't lose any more customers with this device than all the other streaming devices out there.", "verified": true, "helpfulness": "1/3", "author": "G. Towell"}, {"rating": 2.0, "review": "If you are tied to the Amazon ecosystem this box is for you.  The interface is primarily geared towards watching content from Amazon and not just Prime.  This is really focused on purchasing or renting Amazon content.ProsSearch by voice works very wellCrisp clean text and images for the menu and other contentEasy setup (although didn't get my timezone correct, EDT)Starts streaming Amazon content quicklyConsInterface is not friendly to an owners content, only towards buying/renting. Requires many clicks to get to the content you want.Home button doesn't display your owned content, except in the \"recent\" menuRemote is touchy, difficult to move forward and backwards in menus or movies without going past the contentIf you don't buy solely from Amazon, stick with a Roku 3Search only works for Amazon content. If you are in another app, say Plex or YouTube, search will take you out of the app and provide results outside of the the app you are in.I would recommend you stay with a Roku if you ware not tied to Amazon only content.  The menu is easier to navigate and you can readily see your content.", "verified": true, "helpfulness": "8/10", "author": "Outlander0088"}, {"rating": 3.0, "review": "Works fine. Better than my TVs built in smarts. Games are fairly bad. Otherwise very snappy, although it had to download content before it got started. Very nice out of the box. Very easy to set up. Bluetooth on the remote means I have to have two remotes, which is stupid. Why not put volume on the remote with IR.  Earth to everyone, I don't want two remotes. I like the Bluetooth. I don't like two remotes. I don't think my harmony will control it.One more thing. I want to search youtube with voice. Voice search defaults to amazon, even when you are in the youtube app. You're in youtube and you use the voice search and it takes you out of youtube and gives you results from amazon. Crazy. I'm pretty sure going to return it. My tv is smart already, the games are not great, and the voice search is disappointing.", "verified": false, "helpfulness": "3/6", "author": "Jake Hart"}, {"rating": 4.0, "review": "I received my Fire TV today and it was super easy to setup and start using. The device already knew who I was and it was already linked to my account, but I was a little surprised to be able to purchase an app (Plex) without having to provide any sort of credentials. I would have expected there to be SOME protection against my account usage should this device have been stolen from my porch.The device itself is really good and smooth. I bought it primarily to use with my Plex setup at home, and after purchasing the app using Plex was a breeze.Netflix was similarly easy to set up and use.One thing I miss from my older Logitec Revue is the ability to control power/volume on my TV itself from the device / remote. I'm back to needing a remote for my TV and a remote for my device. Small thing, but part of why I'm giving 4 stars instead of 5.Overall I'm very pleased with this device, with a minor security concern and a slight loss of functionality vs my Revue that this is replacing.", "verified": true, "helpfulness": "1/1", "author": "Jesse Keating \"Linux Ninja\""}]