[{"rating": 5.0, "review": "I love my Amazon Fire! So far I have watched some T.V. programs and movies. It is just great. Thank You.", "verified": true, "helpfulness": "0/0", "author": "Donna L Woodring"}, {"rating": 5.0, "review": "I have the Fire TV and the Fire TV Stick and I think they are similar that most would be very happy with the Fire TV Stick, with that said the Fire TV has an ethernet port and that is very valuable as the home network has more and more devices.", "verified": true, "helpfulness": "0/0", "author": "TechWatcher"}, {"rating": 5.0, "review": "I love our new Amazon Fire!  I received it as a Christmas gift.  Installation was easy and using the remote is super easy!  I appreciate that since we have so many remote controls already.  This one is small, the voice recognition is great and finding the titles / actors you want is easy.  I wish everything was as easy to use as this device!", "verified": true, "helpfulness": "0/0", "author": "BK3623"}, {"rating": 5.0, "review": "This is simply the best entertainment purchase I have ever made.  Simple to use, Inexpensive.  And it opens up the entire Amazon library with the touch of a button.  I wish I had bought this year's ago.", "verified": true, "helpfulness": "0/0", "author": "Jim Huling \"author of The 4 Disciplines of Execution and Choose Your Life!\""}, {"rating": 5.0, "review": "Great experience! Love the menu layout & developers tool", "verified": true, "helpfulness": "0/0", "author": "Aida Diagne"}, {"rating": 5.0, "review": "This product exceeds my expectations by a magnitude of 10! Thank you!", "verified": true, "helpfulness": "0/0", "author": "Thomas E. Brannon \"Bigram\""}, {"rating": 5.0, "review": "The Amazon Fire TV is everything I hoped it would be and more.  We are disconnecting our DirecTV because we do need it now.  I highly recommend the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works very well with HBO GO  I have purchase HDMI cable before and they are great.", "verified": true, "helpfulness": "0/0", "author": "Mark Wiecek"}, {"rating": 5.0, "review": "Do not hesitate to buy this. It is definitely the best device available", "verified": true, "helpfulness": "0/0", "author": "HappyUser"}, {"rating": 5.0, "review": "Love the Amazon Fire, since I donot have Cable this is a great alternatve.", "verified": true, "helpfulness": "0/0", "author": "Jill \"MJL\""}]