[{"rating": 3.0, "review": "Very quick little piece of equipment. I like watching youtube alot. My phone connects to it which makes searching alot quicker but has a problem staying connected... wish voice worked with all the apps.", "verified": true, "helpfulness": "1/1", "author": "scott j janz"}, {"rating": 2.0, "review": "Disappointed. My videos played at a lower resolution than on my Roku, and I stopped using it after a day or two. Haven't turned it back on since.", "verified": true, "helpfulness": "2/5", "author": "Rohit"}, {"rating": 3.0, "review": "Can I use a air remote which has a headphone jack like Mele F10 Pro with the Fire TV?Can any remotes with headphone jack be configured to be used with this? and works out of the box for audio.I know you cannot use a blue tooth headphones since there is no support for it in fire tv unless you side load some stuffs. \\", "verified": true, "helpfulness": "0/4", "author": "Priya"}, {"rating": 1.0, "review": "Apple TV is far better.  The user interface is totally confusing.  Most of it is a come on to buy movies on Amazon as opposed to taking advantage of Amazon prime.  Skip it.", "verified": true, "helpfulness": "3/12", "author": "Guy Beau"}, {"rating": 5.0, "review": "Good golly Miss Molly!  I am so pleased with the Amazon Fire TV.  I did sign up for Netflix and have Prime and there are so many choices.  I thought about ordering since the day it came out, but kept wondering if I should do it.  I finally did and it is so worth it.  I got an antenna today for local channels and am canceling my cable tv tomorrow.  Hook up was pretty easy for me, so anyone can do it.  This is going to save me over $1,000 a year.  LOVE FIRE TV!Update:  So after having Fire TV for a little over a week, last night the Fire TV, which is suppose to go to sleep after 30 minutes of no activity, stayed on for 3+ hours, until I finally decided to unplug it.  I am not comfortable having my internet running non-stop.  So I will plug it in when I get home from work and see if that happens again this evening.  I did find an online forum about this, so it appears to be a problem.  One person got a huge bill from his internet provider for using too much.  I will post an update shortly.", "verified": true, "helpfulness": "2/2", "author": "Nev Dolly"}, {"rating": 5.0, "review": "Pulled it out of the box and in less than 10 minutes I had my Netflix up and running.  I even joined Hulu Plus since I got this streaming player. I keep forgetting to try the voice control (no surprise, I never use Siri either!!).  Works great, downloads fast, clear picture.  Definitely a keeper!", "verified": true, "helpfulness": "0/0", "author": "k_gri72 \"k_gri72\""}, {"rating": 1.0, "review": "If I could I won't give it any stars..Has not worked right since we signed up for it.my remote has been replaced twice and the new one doedn't work.Haven't been able to use it in over 3wks..not a  service I would recommend.", "verified": true, "helpfulness": "2/8", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product and well worth the money. I just wish they had a special listing for ALL THE FREE movies for prime members. I also want to know if the Soundmatters wireless Bluetooth would work for this. I want to purchase it but need to know first.Thank you", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"QTMAC\""}, {"rating": 5.0, "review": "Love it, nice hardware Amazon!", "verified": true, "helpfulness": "0/0", "author": "Tanner Norris"}, {"rating": 5.0, "review": "This thing Rocks, no lag, remote easy to use also", "verified": true, "helpfulness": "0/0", "author": "Ethan Walker"}]