[{"rating": 5.0, "review": "Up and running in less than 30 minutes.  I am very much enjoying the huge variety of viewing options I now have thanks to this little bundle of joy!", "verified": true, "helpfulness": "0/0", "author": "Mary-Jo Lacey"}, {"rating": 5.0, "review": "I loved it", "verified": true, "helpfulness": "0/0", "author": "Lisa Coleman"}, {"rating": 5.0, "review": "Works great right out of the box. Connected to our wifi easily, adding apps is easy and despite some of the loudmouth complaints, finding what is and isn't Prime content isn't really that hard.", "verified": true, "helpfulness": "0/0", "author": "Benjamin J. Ricci"}, {"rating": 5.0, "review": "Really nice especially if you have prime, Lots of great free games and low cost games, The voice search is really great just remember to hold the button down not just push it for the search function, the remote control works good with the games but the Fire game controller is much better and you get some free coins to use to buy games if you want.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I wanted to try more on fire. but I really did not want to give every new option (hulu, netflix) whatever my credit card for a \"free\" trial .either it is a no hassle free trial or not...its not", "verified": true, "helpfulness": "0/0", "author": "THOMAS FOX"}, {"rating": 4.0, "review": "I like it when it works.  After delivery it worked fine for several days and then the sound quality went bad.  Worked with fire-tv support and they sent a new cable.  Did not fix the problem.  Called support back and this is the first time this century I've had a bad experience with Amazon.  They said they needed to escalate my issue and would call me back.  Three times they said they would call me back and never did.  Finally on my last call to them and after being passed around to various technicians, the last technician said it was a known problem with my brand of tv-Dynex and they were trying to work with Dynex to get a fix.  I decided to keep the fire tv expecting at some point a software upgrade.  A month later still bad sound but my brother-in-law bought a new Samsung tv so I brought the fire tv over there to show him (and to listen to quality sound).  You guessed it--sound was still bad.  I really felt I was sold a bill of goods with the Dynex story from fire-tv support.  I called back very upset at being misled.  This time the fire-tv support technician had me troubleshoot the fire-tv cache and hooray sound quality came back!  It's been a week now and no sound issues and I'm using it quite a bit.", "verified": true, "helpfulness": "1/1", "author": "J. Glass"}, {"rating": 5.0, "review": "Fire TV is terrific!  It's really easy to use and the selection is great with a lot of content being free with Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "M Barstad"}, {"rating": 5.0, "review": "Great hardware.  The pre-buffering for Amazon content is awesome.  I'm rooted and running XBMC as my launcher with the option to return to the amazon launcher, its just about perfect.  As a dev it would be nice to have some simple wrappers for the UI widgets or a better api sample app (along the lines of the AndroidTV fragments just released).  If you're tied into the Amazon ecosystem this is your best option (I've owned/own GoogleTV, AppleTV, Roku, and other misc Android boxes).  If you're not tied to Amazon and are willing to spend 5 minutes rooting it, you can make it do just about whatever you want it to.  Best hardware I've come across so far in my 5 years of cable cutting.", "verified": true, "helpfulness": "0/0", "author": "Nerdrow"}, {"rating": 3.0, "review": "not enough free movies and tv programs", "verified": true, "helpfulness": "0/2", "author": "Virginia L."}, {"rating": 5.0, "review": "My daughters gave me this as a Father's Day gift this year and it ranks as one of the all time best presents in my book.  Installation took only a few minutes.  The voice recogntion tech is a marvel, enabling easy access to myriad products.  And access is the point here:  I've had Amazon Prime for years now, but it is only in the past few weeks that I've more fully taken advantage of all it has to offer.  It defintely enhances the whole experience.  If you have Prime, you need Amazon Fire TV to complete the package.  The only drawback I can see at the moment is that, at least initially, you'll find yourself watching a heck of a lot of television.  But, given the variety and quality of so many of the offerings, that's not such a bad thing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]