[{"rating": 5.0, "review": "the fire tv is great, quad core fast loading. side load apps. its awesome!", "verified": true, "helpfulness": "0/0", "author": "Hindean"}, {"rating": 4.0, "review": "Unit works as specified, but rated only 4 stars because not satisfied with instructions and explanations on how everything works. Data supplied with unit not worth much, and you have to go online to get full instructions on how to run devices. Control is good, simple and straight forward. Disappointed in \"shut off\" of unit measures. No \"off\" button. Unit supposed to shut down automatically after 30 minutes but does not always do that. I had to search through on-line instructions on how to put in \"sleep\" mode. This important to me because I do not like to leave items plugged in and burning energy when not using them. All in all a good system although I might have been able to get by with the stick.", "verified": true, "helpfulness": "0/0", "author": "Sledge \"Sledge\""}, {"rating": 5.0, "review": "I'm legally blind and what a difference in my life Amazon Fire has made in my life. Words can't explain the ease in which I can now use my T.V.,my music,games ,movies you name it, all you do is say what you want and  Amazon \"Fire's\" remote produces flawlessly. May the good Lord  bless and protect you and yours this holiday season to all those who are involved with Amazon. you're just simply the BEST! Forever grateful, Robert Hunt,Salem,Ma.", "verified": true, "helpfulness": "0/0", "author": "robert hunt"}, {"rating": 5.0, "review": "Love this one,  works great and all my prime content at my fingertips is awesome!", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 1.0, "review": "I've been looking into getting some sort of gadget to watch Tv, either Google, Apple or amazon looks good but when you talk about being a Prime member what is that and how much a mont or year is it? What are the hidden cost?I bought a Quad Core but had to order a Samsung Lan to make it work so I'm still waiting for that to arrive, it might give me everything I need but I'm not sure so any feed back here would be greatly appreciated.Thanks for your feed back.", "verified": false, "helpfulness": "1/8", "author": "angie"}, {"rating": 5.0, "review": "It is really fun to use my voice to play videos on Amazon.  I also like being  able to vew Netflix.", "verified": true, "helpfulness": "0/0", "author": "Karin"}, {"rating": 1.0, "review": "Very disappointed in the Amazon Fire TV. I have the Roku 3 in the living room hoping that Fire TV would replace it. I like the Voice search function on the Fire TV. I love amazon and they are my first choice when it comes to my online shopping. In this instance the ROKU is better hands down. The Roku interface is better thought out and easier to navigate. The Fire TV pushes Amazon content way to much. Everything that is interesting (to me) you have to pay for. It's to saturated with shows you have to pay for. Netflix, HULU and other sites work as they should. I haven't played any games on it but that's not what I bought it for. Best thing about the ROKU is that it connects through an app to my cable company. So I have the option to watch my cable through the Roku which again presents my cable channels in a easy way to navigate and manage. Neither can replace cable or satellite TV as of yet but hands down the easiest and most free content to access is on the Roku. If I did the same with the Fire TV, I would spend more than than my cable bill. You still can find good free shows if you take the time to  muddle through all the Amazon pushed pay content. This is just my opinion, but I believe this will go the way of the fire phone if they do not change the focus and stop using this great gadget as a marketing tool to push their content.", "verified": true, "helpfulness": "4/10", "author": "Edward Smith"}, {"rating": 5.0, "review": "MOVIES and TV SHOWS ON COMMAND. VOICE ACTIVATION IS WONDERFUL. RECOGNIZES ANY VOICE WITHOUT PROGRAMMING", "verified": true, "helpfulness": "0/0", "author": "CJMORT \"CAROL JEAN MORTENSON\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "paulejr440"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Carol Nathan \"I love love to read (and listen) to great stories!\""}]