[{"rating": 3.0, "review": "yes and no, really would like to see tv shows like the walking dead, the middle, the blacklist, and a few others, We are still figuring out the system,so could be we just don't know how to find these. Also, wondering if you knew if netflix may have these shows? May purchase netflix", "verified": true, "helpfulness": "0/0", "author": "Chanda Hubert"}, {"rating": 5.0, "review": "It was a breeze to get this up and running. I have watched many streaming AMAZON videos and it was fast, smooth and no issues whatsoever. It should be noted that at this time, the TV must be on so the device does not go to sleep so you cannot stream music and then shut TV to listen. I spoke to tech support and this was by design and sent my comments to the design team. I understand reasons why they would do this, but maybe a setup options to change it may have been a good idea. For music from AMAZON, if you have Prime you can stream all that you have in their cloud, but not the other un-bought music that can be streamed on your computer that Amazon has given access to.On playing some albums besides the photo on the TV, the lyrics appear like Karaoke, not sure how or why, but it is cool.If you are a Prime member, and use AMAZON for video, AMAZON TV is certainly the way to go because it is so nicely setup for AMAZON. You still have NETFLIX etc, so those options are still there. So far I only used it for AMAZON. My setup is via wireless and had no performance issues at all. It works like I am using a DVD player in my house!", "verified": true, "helpfulness": "0/0", "author": "DrewNY001 \"AmMe\""}, {"rating": 5.0, "review": "LOVE IT. Made me cut the cord from the dish people", "verified": true, "helpfulness": "0/0", "author": "Amanda B."}, {"rating": 5.0, "review": "The best. Try amazon prime time.", "verified": true, "helpfulness": "0/0", "author": "david"}, {"rating": 5.0, "review": "This is the future of television. The remote fits your hand and operates intuitively. Set up is a breeze. This is a lot of product for the price.", "verified": true, "helpfulness": "0/0", "author": "DallasClubGuy \"DCG\""}, {"rating": 3.0, "review": "Fire TV is great, especially since I already had a Prime membership for school books (membership is half price for students with a .edu email) but the batteries in the remote run out extremely fast. I'm replacing 2 AAA batteries weekly.", "verified": true, "helpfulness": "0/0", "author": "DFerg"}, {"rating": 4.0, "review": "great thingy but had trouble making it afford me CC on my TV. Called 'Help' and got a tech who did not know what Closed Captioning is!!! She gave me over to yet another tech...she also did not know what Closed Captioning is. She finally understood what I wanted when I said \"subtitles\". After ten minutes or more, trying to clarify exactly which device we were talking about at one moment to the next, I found the CC indicator. Yahoo. I never did find out how to \"mirror\" but I had a significant headache by then and disconnected. I really love being able to speak my desires and have the appropriate show/program appear. It is much better/faster then my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Ursula \"Ursula in Spokane\""}, {"rating": 5.0, "review": "love having so much in one place!!", "verified": true, "helpfulness": "0/0", "author": "Mark L."}, {"rating": 1.0, "review": "Looks interesting but not worth the $99+ price range - this is overpriced from all I read and compare.If Amazon priced this right they would be more successful in my opinion and I would probably buy it.I think I will buy the Roku 3 at Walmart's for the lower price.", "verified": false, "helpfulness": "1/7", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I was pleasantly surprised by how cool this device is. The videos from amazon prime start almost instantly. You can rewind and forward at different speeds while not pausing the video. Try doing that with netflix vidoes on any device. Setting up was easy too, I use the wired connection and love that it is an option. Installing apps in a breeze. The voice search works well even with my Indian accent.", "verified": true, "helpfulness": "0/0", "author": "Premal Shah"}]