[{"rating": 3.0, "review": "This is a nice device. Good hardware, software, etc... but it has a big deal breaker for me. The remote is Bluetooth only, so I can't control it with my Logitech Harmony Universal remote (IR only), so I'm going to have to return it.Someday, everything will be low power Bluetooth (including my universal remote) and that will be great. Today is not that day :/", "verified": true, "helpfulness": "0/3", "author": "W. Meredith"}, {"rating": 3.0, "review": "really haven't gotten to use it a lot yet but set up was very easy.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Put on xbmc found files that would not play why do u have to go to all applications to just use xbmc should just be able to get it from the home screen", "verified": true, "helpfulness": "0/2", "author": "jason"}, {"rating": 5.0, "review": "After struggling for years with various movie channel subscriptions through our cable provider, and buying movies on pay-for-view, we have finally discovered the perfect solution to TV viewing.  This device is absolutely the most prudent entertainment investment we have ever made.  Wouldn't give it up for 10X the purchase price.", "verified": true, "helpfulness": "2/2", "author": "Arthur D. Hayes"}, {"rating": 1.0, "review": "was simpler to buy a thunder to hdmi and stream straight from my laptop", "verified": true, "helpfulness": "2/9", "author": "adam"}, {"rating": 4.0, "review": "I could almost give this a five star review. I just wish the voice command worked with Netflix and the other apps.", "verified": true, "helpfulness": "2/2", "author": "M. Perry \"miss smart shopper\""}, {"rating": 5.0, "review": "Simple to setup and remote is easy to use. It took only about 10 minutes and I was ready to start enjoying prime content.", "verified": true, "helpfulness": "0/1", "author": "Ingólfur Gauti Arnarson"}, {"rating": 5.0, "review": "Love the Amazon Fire TV. Was going to buy the fire stick, but since it was out of stock until 1/15/15, I went for the Fire TV. So glad I made this choice. After talking with some techy friends, they told me to go for this and put up the extra $60.00. Well worth it!!! I was also once a Roku user, and I do love Roku, but I would pick Fire TV over Roku any day. You can play games with the remote or you can buy a controller for the Fire TV. You cannot access all games with the remote, but they do offer a nice selection for the remote. you can access tons of amazon instant videos, Hulu, Netflix and more. I love my Fire TV :)", "verified": true, "helpfulness": "0/0", "author": "Jennifer Lock-Horev"}, {"rating": 5.0, "review": "Love the Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Darwin or Tana Baker"}, {"rating": 1.0, "review": "I am not satisfy with product...GUI is quite complex", "verified": false, "helpfulness": "1/9", "author": "alpesh"}]