[{"rating": 5.0, "review": "I bought this with birthday money from my son. I particularly like the ease of installation, the huge selection of movies and videos, and the ability to speak into the remote. Highly recommend that you become a Prime Member to take advantage of all the rewards.", "verified": true, "helpfulness": "1/1", "author": "Roger A Engstrom"}, {"rating": 3.0, "review": "EDIT: (4/17/14) I sent the Fire TV back to Amazon today. Too many issues for me out of the box. Maybe I'll try again when version 2 comes out in the future.ORIGINAL REVIEW:I recently purchased a Roku 3, which works very well. However, I was excited to see the Fire TV announced, featuring better specs than the Roku 3 for nearly the same price, and instantly ordered. After using the Fire TV for almost a week I'm mostly unimpressed with what it has to offer. Software updates could very well fix what's wrong with the unit and my review may change in the future. Right now, though, the Fire TV is a mediocre purchase.PROS: The best thing about the Fire TV is the speed. It's seems a bit zippier than my Roku 3 and it could improve more with a more optimized interface and fine tuned apps.CONS: Unfortunately, there are several:**First and foremost, the interface annoyingly and unnecessarily separates Amazon Prime content from content from other providers like Hulu and Netflix. If I'm looking for a an episode of Doctor Who, the Fire TV should show me where I can watch it across the apps I have installed. Instead Amazon Prime content is pushed to the forefront while content from everywhere else is segregated in the \"Apps\" section. Plus the Amazon content is mixed together, with Prime content and paid content receiving the same importance. Browsing through and finding free Prime shows can be a major chore.**The included apps are okay, overall. A bit sparse right now, but I'm certain the offerings will improve. Also, when comparing the same apps on Fire TV and the Roku 3, almost all of them seem to work better and run smoother on the Roku. A good example is the Plex app. While the Plex interface on the Roku 3 is ugly, it runs circles around the Fire TV version. Plex on Fire TV freezes and often knocks me back to the main menu, plus has an odd issue with not displaying subtitles. Again, this could be fixed with app updates, so we'll see in the future.**I was excited to see the Fire TV offered android games, but thus far playing games has been a very mixed bag. The issues seem to stem from poorly translated games and a very sub-par game controller. Games built for a touch interface don't always translate well to a controller interface, especially when the controller itself is kinda junky. Plus, after already logging in to Amazon's GameCircle some games wanted me to sign up for what I assume is a completely separate achievement and leaderboard tracking service. Sadly, the games that worked best so far have been those that require the most basic of interactions and use the included remote control. Again, most of these issues can be dealt with via updates, but that game controller is another huge problem all on its own...that d-pad is horrid!OVERALL: I would tell most people to wait. Let Amazon work out the kinks. Maybe a few updates will fix the issues I have. I certainly hope so, because right now I'm regretting the purchase.", "verified": true, "helpfulness": "3/4", "author": "Bob DeBusk"}, {"rating": 4.0, "review": "I stopped by Best Buy on my way home from work last night. I'd been trying to get a Plex server set up and streaming to my Xbox 360 and was having a heck of a time getting it to run without major buffering problems/stuttering. I have friends who use the Roku (2 and 3) and it came highly recommended. I did some research and decided on the Roku Streaming Stick for the sheer number of apps and the fact that it's only $50.Well, Best Buy didn't have it in stock. They did have the Amazon Fire TV, however. I've been a fan of Amazon for a long time, knowing they have the best customer service around and always make solid products. When doing my research on streamers, I knew the Fire TV had just been released, so I decided to get it instead (I could have easily ordered the Roku Streaming Stick through Best Buy or Amazon, but I didn't want to wait - I'd already been trying to get Plex running for three days).I excitedly hurried home, opened the box and hooked it up. I tell you what, this thing is so easy to hook up your great-granny could do it. It doesn't come with the HDMI cable, but those are cheap and I happened to have an extra from the last time I purchased one (which was, coincidentally, for my 360).I waited for the firmware to update and loaded the dishwasher while the introductory video played. It seemed pretty run of the mill stuff: here's how to access everything, here's what th remote buttons do, etc. As soon as the video was done, I started the dishwasher and sat down to play with my new toy.I was immediately disappointed with the interface. As others have noted, it's obviously biased to Amazon. You have instant access to Amazon content, but if you want to launch an app, you have to go into the apps menu. I can deal with this, but I would have preferred a more neutral interface akin to the Roku. What really bothers me, however, is the darn carousel. WHY does Amazon insist on this? They use the same thing for their Amazon Instant Video app for blu-ray players, and it's terrible. Nobody wants to scroll through dozens of movies to find the one they're looking for. I guess Amazon figures it isn't a big deal since people will learn to love the voice search, but it isn't hard to make a more user friendly GUI. When you add the carousel to the fact that the apps are buried, you get a fairly meh interface. It's not the worst thing on God's green Earth, but it's far from perfect. Speaking of apps...Since I had planned on buying the Roku Streaming Stick, I never bothered to check the full list of Fire TV apps. I knew it had a lot of games, but I still have plenty of 360 games I haven't touched. I'm sure I'll check out the games at some point, but it's not a selling point to me. I had talked with my friends about the Roku apps they use, and I'd been wanting to check out the History Channel and Fox News apps. No can do! They don't exist here. This sucks, because I was really hoping to catch up on Vikings since I'd cut my cable six months ago. Sure, all the big players are here, but I admit I was looking forward to running through the list of Roku's thousand apps to see what neat things the user community has come up with. Maybe a nerd channel a la G4 or a Christian channel for Focus on the Family movie reviews. These niche apps can add a lot of personality to a streaming box, and Amazon just doesn't have any of them. None. If you want news, you'll have to get it from Bloomberg or HuffPost. <_< I figure the list of apps will expand over time, since Roku obviously didn't launch with over a thousand apps. But with such a late entry into the market, you'd think Amazon would have used their massive industry weight to get more apps on board at launch. But it is what it is - the PS4 and Xbox One obviously only launch with a few games, not a thousand. This list will undoubtedly expand over time.Up to this point, it probably seems like all I've done is complain. Yet I obviously gave the Fire TV a good rating of four stars, so I must like it! The reason is because, despite the bleh interface and the lack of apps, what's there runs like a top of the line machine. Amazon put a lot of money into the hardware, and it shows. You're probably used to Netflix having some load times when you browse their thumbnails, right? That's gone. It still takes about 20 seconds to open, but after that you can scroll through the Netflix interface like nobody's business. Same with Hulu and every other app I tried.And that Plex server I had been trying to get working on my 360? Local videos stream from my laptop to the Fire TV perfectly. Note that the Plex app currently costs $.99, which is a discount price from the $4.99 they're currently charging on Roku. It's beautiful though, absolutely beautiful.So you have a choice to make for streamers, and right now I think the choice is between the Fire TV and a Roku. Fire TV gives you faster hardware, but the Roku gives you 10 times the number of apps and a better interface. If Amazon can ever get those extra apps (and I assume they will), Roku is in serious trouble.", "verified": true, "helpfulness": "1/2", "author": "Aaron"}, {"rating": 5.0, "review": "Excellent set-top box. Works smoothly. Easy set-up. Nice approach to navigation especially including the home and back buttons. And the voice navigation feature is clever -- a big time saver. I own AppleTV and Chromecast, too, but like the FireTV so much I've already ordered a second one for another room. Wish it had HBOgo but hopefully that's coming soon.", "verified": true, "helpfulness": "0/0", "author": "wayne stewart"}, {"rating": 1.0, "review": "Choose to search for program , only choices listed are those you can purchase not programs you already paid for ie netflix", "verified": true, "helpfulness": "4/22", "author": "zachary r freedman"}, {"rating": 5.0, "review": "ProsSo far i love the fire TV it was a player with the specs i finally wanted so i bought one, and i have been very satisfied with it so far. Pretty much use this exclusively for Plex and streaming my own library but netflix works great and i tried a couple games that worked great as well.Navigation is simple and easy to use, remote is simple and responsive and don't have to point it at the box works through walls. Would recommend this to pretty much anyone wanting a fast responsive media set top box. Has more features that i have not even got to take advantage of since i don't have kids.ConsWish i could use the voice search within plex or even better voice search would search through Prime, Netflix & Plex for media. Also miss the Headphone ability that the Roku 3 has to offer... not a deal breaker though.", "verified": true, "helpfulness": "0/0", "author": "Rory"}, {"rating": 5.0, "review": "overly  surprised by the built quality and styling. This is the type of product you'd accept from Apple not necessarily Amazon (an E-retailer). Amazon absolutely nailed it. From the minute you plug this thing in you notice how zippy it can be. voice search is flawless. I am really happy I bought this Fire TV.", "verified": true, "helpfulness": "1/1", "author": "John Scardina"}, {"rating": 5.0, "review": "So easy to set up, use. Can't wait for more streaming services/channels to be available but I would recommend this product to all.", "verified": true, "helpfulness": "0/0", "author": "Kelea Denmark"}, {"rating": 2.0, "review": "The number one reason I bought this device was to watch Prime movies and TVTo do this is very cumbersome on the fireThe search tool shows you non prime shows first and the prime logo does not show up on the shows after a searchUnlike using the web site you can filter out the prime shows only in your searchSearching for prime movies and TV shows is much better using the computerThe fire TV does not offer that feature.Showtime anytime from Charter cable does not support the fire TV deviceI knew this before buyingThere is no browserVoice control will only search Amazon site", "verified": true, "helpfulness": "6/11", "author": "Cooldave52000"}, {"rating": 4.0, "review": "I had hoped that the voice search would locate all possible locations of the movie or television show I am looking for, including Netflix and HuluPlus (similar to Roku 3's search function).  I was disappointed to discover that only the movies on Amazon Instant Video can be searched.", "verified": true, "helpfulness": "1/1", "author": "Edward I. Hubbard"}]