[{"rating": 4.0, "review": "We've had this for just under a month now. We've been very pleased w/ how easy it is to navigate and hook up. Our only quirk w/ it is that if my step-son is watching Netflix downstairs on his Playstation and we try to watch something on the Amazon Fire upstairs, our viewing usually looses the battle to buffering. Not sure if that's an Amazon Fire issue, or just an ISP line issue. Either way, we are fairly pleased w/ our purchase. We purchased it for a cheaper price by partnering w/ Sling TV, so really, not much to complain about.", "verified": true, "helpfulness": "0/0", "author": "Orcinus81"}, {"rating": 5.0, "review": "I absolutely love the Fire TV.  My roommates and myself use this almost daily and have been able to completely get rid of Cable TV.  The Fire TV has great processing power compared to the other devices available and has an unbeatable price.  With that great power it is able to stream seamlessly in full HD.  The apps it has with it are also alot more varied and a better selection that the apple tv or roku.  It works great with Youtube, Amazon streaming both music and movies, Plex, and even Pandora.  Amazon hit the mark with the Amazon Fire TV and I doubt I'll get another streaming box/stick ever.The only downside about it is the remote uses alot of batteries and dies pretty quick, but its an easy fix, just buy rechargeable batteries.", "verified": true, "helpfulness": "0/0", "author": "Blackout"}, {"rating": 4.0, "review": "So far it's doing fine. While watching \"Bosch\" it stalls in a couple of places. Could be user error. Still like it, though.", "verified": true, "helpfulness": "0/0", "author": "W. Smith \"Jodysan\""}, {"rating": 5.0, "review": "so far so good with the fire tv ! it is very fast (no lag i have 12mbps internet speed) i did sign up for sling tv and save on the price of the fire tv box and i am trying prime for 30 days and i really like that to but i am only one day into this and i need more time with this but i can say video quality and speed of the box is KILLER amazing something so small can perform so well . i wonder if the good folks at amazon will intergrate dvr function via external hd after all the fire box has a 3.0 usb port in the back. UPDATE! okay i have had this for a week now and  most of the time watch sling tv and to my surprise most of the programs are dvr'd  for you so i no longer feel dvr intergration is needed but i am still learning as i go .", "verified": true, "helpfulness": "0/0", "author": "tomster"}, {"rating": 5.0, "review": "I am getting rid of DISH, Net Flix and everything else! All I need now is FIRE TV and Amazon Plus and I can rule the world! :)", "verified": true, "helpfulness": "0/0", "author": "R. Mascaro"}, {"rating": 5.0, "review": "Everything that I was expecting it to be!", "verified": true, "helpfulness": "0/0", "author": "Michelle Jones"}, {"rating": 5.0, "review": "Very fast! Great remote and I love the voice control feature. So easy to find my shows now!", "verified": true, "helpfulness": "0/0", "author": "L. Mueller"}, {"rating": 5.0, "review": "One box to rule them all...Awesome ...best box top sideload feature is unbelievable ....xbmc/kodi...goodbye cable tv.", "verified": true, "helpfulness": "1/1", "author": "IHVH"}, {"rating": 5.0, "review": "I purchased this only because of the discount from getting SlingTV, and boy I'm glad I did! I had purchased 3 Roku's for myself (and 2 for family members), and never had any intention of giving them up. But there are three reasons I'll be replacing them all eventually:1. The performance of the Fire TV is dramatically better than either of the Roku's. The response time when going through the Fire TV's menus, searching through applications - anything I do is much faster with the Fire TV.2. Yes, the Roku has more channels. But guess what? The Fire TV has all of the channels that I watch.3. As expected, Fire TV puts Amazon Instant Video front and center... neutral as far as I'm concerned. But they make it so much easier to use, that I might actually use it from time to time. Big thumbs up.Oh, one more thing - the remote is great. I like the layout much better than the Roku remote, and it seems to communicate better (no more pressing buttons two or three times before getting a response). And it just feels better in my hand.", "verified": true, "helpfulness": "0/0", "author": "Robert Ray"}, {"rating": 5.0, "review": "This thing is fast, very responsive.", "verified": true, "helpfulness": "0/0", "author": "N Reed"}]