[{"rating": 3.0, "review": "I had hoped that this product would afford me the capability of ending my dependence on my cable TV provider. Although it may well do that eventually, it is lacking the necessary Apps at this point and it remains to be seen how long it will take the developers to get them out to the consumer. Several of the Apps that facilitate gaining access to free online video streaming that exist for the Kindle product line are as yet not available for the Fire TV product. I have been assured that these Apps are under development but could not obtain any kind of forecast or commitment for availability. All in all, the Fire TV works very well withing the bounds of its current limitations.", "verified": true, "helpfulness": "4/6", "author": "Michael B. Jarboe \"Mike in Denver\""}, {"rating": 5.0, "review": "I have not been more tickled by a product since my ipad. I really enjoyed the experience vs. using a laptop to watch prime videos. The voice search is an awesome feature and the ability to support apps like espn, netflix, pandora, makes it truly useful. Setup was a breeze. Usage is easy. I highly recommend it.", "verified": true, "helpfulness": "1/1", "author": "The Doctor"}, {"rating": 4.0, "review": "Well first let me say i have used and sell many different streaming boxes. I have a blu ray player that streams netflix and vudu and amazon. Then i have a tv that streams Netflix, Amazon, and hulu plus.I have used many brands of Android Mini PCs they are called which is what the fire tv is just locked down rather then being open.So when the Amazon Fire TV came out i had to check it out.There are many other boxes out there. Roku, chrome cast and apple tv and so on.I still prefer an android mini pc running XBMC. Much more open easier to load items on and full access to the play store.I have an android MINI Pc and an Apple TV 2.My apple tv is great considering its years old it still runs great and i have full access to my iTunes account and anything on there. with XBMC loaded i have all the free stuff i need. However its only 720P and it is several years old.For me i prefer the mini pc such as the minix X7 or X7Mini. But here are the pros and cons of both boxesFIRE TVPROS1. Amazon Prime. While most all TVs come with this anymore and some blu ray players the interface here is much nicer and smoother and easier to use.2. Netflix Super HD DD5.1 There are no other android MINI PCs that have netflix in HD right now. This is a fault of NETFLIX with android. Only a couple android tablets have netflix in HD. its a DRM issue. Because my Apple tv 2 has had it for years. However we should see it sometime soon now that Netflix had it worked out for the FIRE TV3. Simple interface. Its not the best but its very simple to use and would work for anyone not familiar with android since its not a typical android interface4. Can run XBMC. It is a pain to load and not as easy as other android mini PCs But once installed it runs all the add ons and plays 1080P video well. And expect this to get even better as the developers work on a custom XBMC version for this box.CONS1. Locked interface. You can't change the interface its locked down. so if your looking to customize you can't at least not yet. Once root access it found then maybe.2. Hard to load any apps not authorized by Amazon3. Little content available. The extra movie and tv add ons make you watch a commercial before you can watch anything. and if you stop in the middle of a show and try to resume guess what? You have to watch another commercial anywhere from 45 seconds to 1.30. Its not a huge deal but it seems anywhere you have to watch commercials for anything. Id rather pay a little for the add-on if there was more content available.4. No full access to amazon app store. Very little can be loaded on it. And no access to the Google play store.5. No retro gaming since you can't load any emulators on it.Now the idea of a streaming box goes all the way back to the original Apple TV. However it did not take off for apple and the Apple tv 2 is popular among the market still because it can be jailbroken and have unofficial apps loaded on it.The Ouya game system is another box that is small and came out last year as the go to box for streaming media and playing games and retro gaming. However the processor in there the Tegra 1 was already old at the time of the OUYA release. They did that to keep costs down. The ouya could have netflix and hulu side loaded easily on the box. Then Plex and XBMC were official apps for media streaming and there have been other apps for media since.However the OUya must be used with its Game controller and each extra is $50. Most people don't want to use a game controller all the time for watching contentThen comes the wide selection of Media streaming boxes also known as android mini PCs. There are boxes and there are ones that are about the size of 2 or 3 USB sticks put together. Brands such as Minix, Tronsmart and more.These boxes offer a more tablet like android experience. They can load netflix, Hulu, xbmc and can stream live tv and more.So how do all these compare?You saw the pros and cons above for the Fire TvHere are the Pros and CONS to the other android mini pcsPROS1. Many video apps including live tv, cartoon apps and many more all available in google play2. Full access to google play store3. Netflix (not full HD super HD yet but should be coming soon)4. Emulator apps available to play retro games from Atari 2600 to Sega , all nintendo including gamecube and PS15. Can customize much of the interface with live wallpaper and themes to fit you.6.Lots of tv apps available in the play store from major networks and foreign language channels from major countries around the world.7. Interface looks like many android tablets so would be familiar to some.CONS1. No Voice Search2. No Amazon Prime without allot of work and even then its not as nice and fluid as the interface found in the Fire TV3.No Netflix HD yet. Again its very much possible as developers have shown these boxes can handle it but netflix has not made it available officially yet4. The interface while having the ability to customize it could be confusing for someI have tested many of these boxes and i prefer MInix as they always work and the company provides great support.I like the new Fire Tv its really cool and i like that you can do some games with it and more will come. I don't like that i can't get to the play store. That is one of the downsides of my apple tv.There is so much that can be done with the other boxes and i like that i can play retro games and i can download games to it that we can all play. Yea the Fire tv has games too but so many more are available on the play store.What box should you get?Well it depends. If you can get someone to install XBMC for you on the amazon box and you don't care about customization and your not concerned with retro gaming and other add ons for tv this is a great box.I think there is no reason you can't even have both. Maybe 1 for the bedroom tv 1 for the living room tv or something.The other boxes like the minix take a little more set up. However i know here on amazon and on ebay people sell them fully configured. I have also seen the Fire tv coming installed with XBMC as well.I am very curious to see where AMAZON will take the fire tv. Hoping that they open it up more and allow more content on the box.", "verified": true, "helpfulness": "2/3", "author": "Jason"}, {"rating": 1.0, "review": "You can get a chromecast, which is far better, for only 40 bucks! It's small and doesnt take up any counter-space either!", "verified": false, "helpfulness": "4/29", "author": "josh"}, {"rating": 5.0, "review": "Great product! I have an apple TV and this box is definitely an upgrade compare to Apple. I also installed Xbmc on I and it works great.", "verified": true, "helpfulness": "1/1", "author": "Kelvin"}, {"rating": 4.0, "review": "My husband and I bought this to replace the laptop we have been running as our home entertainment system. For movies and tv, Fire TV is a fantastic system. Videos load extremely quick. Loading speed is probably the single biggest reason to buy fire tv. The video quality also seems to be sharper.To be fair, we are amazon junkies. We are prime members, we both own about three kindles each, and we do just about all of our shopping via amazon. We also buy music via amazon's MP3 store. I was really amazed that there is not an amazon cloud player app or feature on the fire tv!!!  I hope they will add one. Also it would be fantastic if they could add a scaled down internet browser like Amazon's Silk browser. Add those two features and fire tv would be a perfect 5.", "verified": true, "helpfulness": "2/2", "author": "HMKELL"}, {"rating": 2.0, "review": "I really wanted to like this device, but instead I've already stopped using it.  Amazon is trying waaaay too hard to get you to purchase movies and shows, at the expense of a good consumer experience.  For example: when you search for a movie or show, the results shown are always the purchase option- \"buy it for $1.99\", \"but the season for ..\".  You then have to click on the last option helpfully called \"Other ways to watch\" to find out that in fact this content is also available for free through your Amazon Prime subscription!  So basically I can't let my 6-yr old alone with this device or he will buy up a storm because that's the default option that's always presented to you and you have to go through several clicks to access the free option.  Another example: search doesn't show you that the content you just searched for is also available for free through your Netflix or Hulu Plus subscription.  Wow.  So then I set up a parental controls pin to prevent my 6-yr old from accidentally buying stuff.  Unfortunately, this means that I now have to enter the pin every time I want to watch something, even if its free.  Yikes!  So basically, my child can't use this player at all or I'd have to give him the pin and we'r eback to square one with him buying everything he wants to watch.  Hate this feeling, and don't expect it from Amazon, but yes folks, we're being ripped off.", "verified": true, "helpfulness": "3/10", "author": "SimSim"}, {"rating": 3.0, "review": "Disappointed that the usb port is on the back and not the side or front.  Tried to use, like the Roku, to play movie on a flash drive without success.  Couldn't even find it and impossible to get at the usb port when it is installed under the tv and all the wires back there.  Couldn't link to media stored on the network.  Waiting for more firmware updates...", "verified": true, "helpfulness": "2/9", "author": "ldj \"Don Jessup\""}, {"rating": 4.0, "review": "All about content, content, content. Choices are limited right now on the gaming side. Plus, no HBO go. Regardless, good first effort,", "verified": true, "helpfulness": "1/2", "author": "Bryan M. Wolfe \"book geek\""}, {"rating": 4.0, "review": "1 review for the hardware, 1 review for the access to content.This unit is first class. The quality of the video and speed is impeccable. ok 5 stars here.Now.......the content is favoring access to Amazon streaming.  Tough to navigate to non Amazon.  No voice search outside Amazon. I'm assuming more content as time goes by.  No access to Internet URL's  I can get full HD with Intenet capability by conntecting my  HD tablet HDMI out instead of the Fire.  The remtote is Bluetooth so can't be used with a universal remote.  3 stars here but could be updated if Amazon opens this up to the usual menu of apps available.", "verified": true, "helpfulness": "1/1", "author": "B.L."}]