[{"rating": 4.0, "review": "Sometimes the screen goes blank and nothing will fix it except unplugging it. Also, it works fine, but stop for a bit to do something, start the program back up and it gives an error message about the HDMI not being good. I use Amazon brand HDMI cable. I unplug the cable, plug it back in and then it is fine until the next time it decides to say that the HDMI is bad. The unit doesn't get moved around and the HDMI cable is never touched, so why it says it is bad and then fine again by simply reconnecting the cable makes no sense at all. I bought this to replace a Roku which would freeze up or screen go purple requiring the cable to be reconnected.I had hoped Amazon would have been better quality.  I do prefer Ethernet connections over Wi-Fi, especially when running 1 Gb in the house.", "verified": true, "helpfulness": "0/0", "author": "Michael O'Malley"}, {"rating": 5.0, "review": "good pricegood performancegood quality", "verified": true, "helpfulness": "0/0", "author": "chan namgung"}, {"rating": 4.0, "review": "I bought a Fire TV on release day, another one 6 months later, and then 2 Fire TV sticks on their announce date. I love the Fire TV interface and think that the apps are generally pretty great. The only complaints I have are that the interface is VERY Amazon-centric and tries to channel you into using their services (and thus buying/renting things from them). It's also disappointing how you can't \"cast\" from a computer, phone, or tablet to the Fire TV unless you have a Fire Tablet. I realize they want you to buy into the ecosystem, but they're just forcing me to buy a Chromecast at this point.For now, your best bet for a home media set top box is either an Amazon Fire TV or Roku 3. Roku has a few more apps and more of an open interface, but I've also heard that the interface is kind of junk on the Roku. The Fire TV is very polished...but if you're not using Amazon Prime or renting/buying from Amazon a lot, the interface is 90% worthless to you.", "verified": true, "helpfulness": "0/0", "author": "A. Vehlies"}, {"rating": 1.0, "review": "It didn't work for me, i'm returning it. It updated fine, the menu works fine, it conected to my wireless network without any issues and to my netflix account, but every time i tried to watch something it didn't work, on netflix it caches and shows like 10 secs of viedeo and then it stops, if i have subs on, the subs keeps playing for another 10 secs while the video is stopped, i tried different movies and the same story. The amazon videos, wont even play, not even the tutorial videos, they start buffering and go up to like 80% and then they stop, and won't play no matter what. I resetted the device and tried again, i checked netflix on my ps3, roku and laptop and everything is working just fine. I've seen unboxing videos of this guy and looks amazing, but this one was defective, so really bad, now i have to buy another roku at bestbuy.", "verified": false, "helpfulness": "1/2", "author": "Luis"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "melvin mcconnell"}, {"rating": 5.0, "review": "We have very poor internet here, but with Amazon Fire TV we can watch movies!", "verified": true, "helpfulness": "0/0", "author": "cc"}, {"rating": 4.0, "review": "Setup went fine. Should have computer handy for accessing help and Faq's on Amazon.com.", "verified": true, "helpfulness": "0/0", "author": "Bato"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Honce"}, {"rating": 3.0, "review": "It doesn't support local files playback and in order to access a NAS I had to sideload xbmc. The applications loaded are not accessible from the main screen.", "verified": true, "helpfulness": "0/0", "author": "jazzcool"}, {"rating": 5.0, "review": "it's amazing", "verified": true, "helpfulness": "0/0", "author": "J. Pfaller \"MBM\""}]