[{"rating": 5.0, "review": "Setup was a breeze - connected and running in 5 minutes.  It actually performed well streaming movie and TV show content with a wireless connection (using TP-Link Archer C9 AC1900 Dual Band Gigabit Router on the 5 GHz band).  Haven't checked out the gaming features yet.  The voice command remote works well.  I tried it in a relatively quiet environment, so I can't vouch for its performance when there is plentiful ambient noise.  However, all the searches yielded the correct results based on spoken commands.  The packaging and device design are nice, and it made me think that Amazon is trying to mimic the quality feel of Apple devices (I have an Apple TV, iPhones, iPads, and a MAC Mini in the house).", "verified": true, "helpfulness": "0/0", "author": "Major Hochstetter \"Genuine_TuffGuy\""}, {"rating": 4.0, "review": "Good looking device,  great content.  the only issue I have is that it is pretty full out of the box,  not much room for adding your own stuff", "verified": true, "helpfulness": "0/0", "author": "William R Georgen III"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "anuska"}, {"rating": 5.0, "review": "Works as expected and happy with the price. A+", "verified": true, "helpfulness": "0/0", "author": "Casey Hladky"}, {"rating": 5.0, "review": "Set up flawless- operation -flawless.", "verified": true, "helpfulness": "0/0", "author": "H. Mason"}, {"rating": 5.0, "review": "I absolutely LOVE the Fire TV.Very user friendly, my 5 year old knows exactly where to go and access her movies.Great product.", "verified": true, "helpfulness": "0/0", "author": "Celia"}, {"rating": 5.0, "review": "Love the Fire TV.  Have about 8 Boxee Box units throughout the house....however plan to switch to the Fire TV as it's much better than anything out there.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Arrived on time in a very nice box. Connecting to my entertainment system was effortless. I was browsing thru Prime movies in just a few minutes. It detected my wireless router without any problems.", "verified": true, "helpfulness": "0/0", "author": "meband2000"}, {"rating": 5.0, "review": "I can't really knock the stars off for this but it runs Kodi pretty sluggishly sometimes. Subtitles, audio, and video are always out of sync but it was not really designed for that so oh well. I would look into disabling both hardware acceleration options. You have to go to Settings (make sure you are in expert mode) then video and hardware acceleration. Can't remember the options but I turned them both off and playback is smoother but not always perfect. I did the same for the Fire TV Stick as well.", "verified": true, "helpfulness": "0/0", "author": "Matthew Gambill"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Michael Hawkins"}]