[{"rating": 3.0, "review": "I didn't fully understand what I was getting. I thought I'd be able to watch current TV shows without paying. Even signing up for the 30 day Prime trial, I still don't receive current TV shows. I recommend Prime with fire TV or you have to pay for everything you watch.", "verified": true, "helpfulness": "0/0", "author": "Niccol Valentine"}, {"rating": 3.0, "review": "Cool device but did not include as many \"old\" series for free as I thought it would.  Surprised that many over decade old still cost to view!  Also could not view recent episodes of local tv shows (NBC, CBS, ABC etc) as I was told you could by a sales person.  Would love to see it include ID channel.Screensavers are amazing.", "verified": true, "helpfulness": "0/0", "author": "S. Reeder"}, {"rating": 5.0, "review": "Enjoy watching my Prime Lists and especially Listening to my MP3 Music from Prime", "verified": true, "helpfulness": "0/0", "author": "Tracy \"Tracy M Coker\""}, {"rating": 5.0, "review": "great movie", "verified": true, "helpfulness": "0/0", "author": "Queen"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Meredith K"}, {"rating": 4.0, "review": "No issues. Very nice technology. Hope I can figure out how to integrate it with other remotes. I'm up to 3.", "verified": true, "helpfulness": "0/0", "author": "Larry Ray Meadows"}, {"rating": 5.0, "review": "My son bought this for me for Christmas.  I thought \"what am I going to do with this?\"  He showed me the basics of operating it and I love it.  I am hooked on Orange Is The New Black on Netflix.  Can't wait to start watching other great programming.", "verified": true, "helpfulness": "0/0", "author": "Barbara B"}, {"rating": 4.0, "review": "This worked as advertised.  Was easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Cuddlefish"}, {"rating": 5.0, "review": "Best purchase ever.Easy to set up, and works great.", "verified": true, "helpfulness": "0/0", "author": "Nicky's son"}, {"rating": 1.0, "review": "I hooked it up and saw one movie then didn't  work any more!!  what am I doing wrong?", "verified": true, "helpfulness": "1/2", "author": "Donna Christensen"}]