[{"rating": 5.0, "review": "So far appears to be a well thought-out product and a nice benefit of Prime membership. The price is very reasonable, set-up was extremely easy and the variety shows is extensive.", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 1.0, "review": "This product sounds good, but please read before you spend your hard earned money. If you think you will save any money with this product you are WRONG!. Every show, series and movie I have been remotely interested in watching has a ridiculous price tag. The advertisement makes it look like many shows are free. Maybe if your a huge Gomer pyle or happy days fan. Any remotely modern show is more expensive to watch thenit is to go to Box stores and purchase the entire series on DVD. This horrible service is a SCAM. The bright side is the actual device is outstanding, but I never use it due to the criminal prices set by the greedy people at Amazon. I bought the entire first season of  the tv show \"the 100\" on DVD which I can even loan to my friends for 12 dollars cheaper than it was offered on amazon prime, actually even cheaper than that if you bought the HD version on amazon prime....this service is a joke...STAY WITH CABLE", "verified": true, "helpfulness": "1/4", "author": "Jason B.. \"JJB\""}, {"rating": 5.0, "review": "I enjoy the  fire t.v. easy to hook up to Wi-Fi  a lot of great movies well worth the price. nice 2 day shipping", "verified": true, "helpfulness": "0/0", "author": "DALE HENDRICKSON"}, {"rating": 5.0, "review": "Fast", "verified": true, "helpfulness": "0/0", "author": "andres"}, {"rating": 5.0, "review": "Wow!", "verified": true, "helpfulness": "0/0", "author": "Patrick McNeil"}, {"rating": 5.0, "review": "I love it for its search capabilities. Enter an actor's name and all his movies come up. My son was kidding me about my attachment to the Echo, and he mentioned a movie similar by the name of Her, so I entered it and presto, it came right up on Cinemax. Crazy movie though, still don't understand the ending.", "verified": true, "helpfulness": "0/0", "author": "James G. Elwood \"Jimmy G\""}, {"rating": 5.0, "review": "My grand kids were visiting and they had a great time playing the games.  We also watched movies at night, it was great.", "verified": true, "helpfulness": "0/0", "author": "Cathyann M."}, {"rating": 4.0, "review": "Watched a couple movies only so far no games.Works ok at home but i purchased this for when we are at the lake.No problems so far but we will find out this weekend at the lake.", "verified": true, "helpfulness": "0/0", "author": "J32barker"}, {"rating": 5.0, "review": "Amazing right out the box.", "verified": true, "helpfulness": "0/0", "author": "Stormageddon darklordofall"}, {"rating": 5.0, "review": "Absolutely love it! I am not even close to being a techie, but no problem setting up. I would definitely recommend it", "verified": true, "helpfulness": "0/0", "author": "Susan Bishop \"KymL\""}]