[{"rating": 1.0, "review": "I have two computers and other devices which work with the same password, the password will not work with the password....have tried an tried all I get from Amazon Fire is \"try again\".", "verified": true, "helpfulness": "1/9", "author": "Patrick Harold"}, {"rating": 5.0, "review": "Easy to install and operate. Why did I wait so long to get it? It would be nice if Amazon would allow prime members to more easily identify and browse the prime free videos. but the Amazon Fire TV is great.", "verified": true, "helpfulness": "0/0", "author": "FCN"}, {"rating": 4.0, "review": "I really like most of the qualities of Fire TV.  I like the voice activated feature.  I love the fact that I can get Watch ESPN on this device.  I watched the NCAA Regional Tournament on ESPN3 and the picture on my HD TV was fantastic.  The only complaint I have is that when trying to select a move on Netflix, the movie descriptions are tiny.  I'm an old guy and I have to get out of my easy chair and walk to the TV in order to read them.  This is a disadvantage over my ROKU device but easily correctible.", "verified": true, "helpfulness": "0/0", "author": "Gary W. Johnson"}, {"rating": 4.0, "review": "Need some work still.  Not up to par with the Roku's yet, but it is all on the software side, not hardware.  I need to power cycle mine weekly as it stops responding. Has a lot of the major steaming services, but missing almost all the sports services.  Give it a year or do and it hopeful should be all straightened out.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "works great, just plug in and after a 3 minute video, u go it. Only complaint, to get the free Amazon Prime moves, you need to clink \"more ways to view\", there are three other pay for view options - only after clicking \"more ways to view\" does one get to amazon prime.  Perhaps I missed the part of the video to get directly to AP but it should be as easy as getting the pay per view option.  So far my son's (8 and 10) have been able to navigate that but I can foresee the day that their Dad (me) and their Mom forget to take this extra step......", "verified": true, "helpfulness": "0/0", "author": "Gregory L. Piccininno \"Gregory\""}, {"rating": 2.0, "review": "we believe our DSL speed was not sufficient for this item to work properly.  In an area closer to better internet service, this would probably work fine.  It was returned.", "verified": true, "helpfulness": "0/4", "author": "Mike 'n Alice"}, {"rating": 5.0, "review": "With Amazon Prime...so many movies, tv shows, etc to choose from.  I could never watch them all.  I did have to upgrade my internet, though in order for it to work but I needed to anyway", "verified": true, "helpfulness": "0/0", "author": "MsVetRN \"msvetrn\""}, {"rating": 3.0, "review": "Ran into problems with Wi-Fi.  Amazon said it was the cable company.Cable company said I'd have to add additional equipment to boost thesignal.  Not willing to do that.", "verified": true, "helpfulness": "0/2", "author": "KC"}, {"rating": 5.0, "review": "This is amazing!!! There is everything we like, need, or use right at our fingertips!! Lots of fun games and apps. I use this most for Amazon prime tv and movies. Easy set up and use!", "verified": true, "helpfulness": "0/0", "author": "loved it"}, {"rating": 4.0, "review": "Runs smoothly and is probably the fastest of the tv streamers when channel surfing. Moderate number of apps. I only wish the remote had its own earphone jack for private listening with headphones, otherwise, a good product with great potential.", "verified": true, "helpfulness": "0/0", "author": "Jesús"}]