[{"rating": 5.0, "review": "Awsome!  Netflix runs as an App, as does Hulu, but we have had no issues with that.  My iPad connected easily, as did my Mac. This little box is fast and super easy to use.", "verified": true, "helpfulness": "1/1", "author": "David Tarrant"}, {"rating": 5.0, "review": "Love my fire TV. I do my research and I do read the reviews. It was an easy setup and user friendly. I am  not a instruction reader, so am happy when I can work with on my own.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "As a prime member I just plugged it in to TV and internet and it worked!!", "verified": true, "helpfulness": "0/0", "author": "rob"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "drn7332"}, {"rating": 1.0, "review": "I used to think my Fire TV was the greatest, but at the end of October Netflix sent out an updated version for their app on the Fire TV and since then it has not worked. I have called Netflix a few times and they insist it is a problem with the Fire TV. I have literally spent hours with the help desk trying to sort out the problem. I have tried restarting, reinstalling, deleting programmes, et al and while I may be able to view Netflix for a short while the very next morning, we are back to square one.It is now close to a month and I still cannot enjoy my Fire TV to the fullest or even view simply TV shows for my kids on Netflix.can someone please help me, because the people at Amazon as nice as they are, simply cannot ...", "verified": true, "helpfulness": "3/6", "author": "Paul Pantin"}, {"rating": 5.0, "review": "I love it!  I've  only had it two days and I'm  still learning about it.  It was so easy to install.  I am extremely  happy with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I don't know why I delayed so long in getting the Fire TV.  I had a Kindle Fire which I did not use.  It was too small for viewing (I am 70).  I wasn't really getting all that much for being a Prime member.  Wow.  I love being able to watch and rewatch favorite movies and TV on my schedule.  Now, when there is nothing on my 500 TV channels, I just switch over to Fire TV.  I find I am using it every day.  The picture is beautiful.  I have the captioning I want.  Great sound.  I may get rid of some of my expensive cable channels.", "verified": true, "helpfulness": "2/2", "author": "Pam Scott"}, {"rating": 5.0, "review": "Much much better than apple tv!", "verified": true, "helpfulness": "0/0", "author": "Rebecca Cope"}, {"rating": 5.0, "review": "its awesome.  i do wish Playon was available for it though.", "verified": true, "helpfulness": "0/0", "author": "K. Foster"}, {"rating": 5.0, "review": "Love the voice activation control. Easy to install and no quick to download features.", "verified": true, "helpfulness": "0/0", "author": "Mark"}]