[{"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Stephenie Russey"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Katchoo"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Dave Brady"}, {"rating": 1.0, "review": "Love it!", "verified": true, "helpfulness": "2/15", "author": "Veronica E Hosein"}, {"rating": 5.0, "review": "The order arrived quickly, but I couldn't load batteries into the remote. Customer Service was very helpful, & I even found an online manual (while on hold, between conversations), but was stumped.  So Amazon emailed a shipping label (which I couldn't print, since my printer needs new ink cartridges).  I had to visit children, & was worried about being away too long, so Amazon handled everything.  However, my brilliant son showed me later how to insert the batteries, & I really love being on Prime!  It's awesome! Now, I've got to speak w/Customer Service again (about the charges),  but I'm confident that they'll handle things well.", "verified": true, "helpfulness": "0/1", "author": "Cameo Walkin"}, {"rating": 4.0, "review": "works great. just wish it included an easy way to install xbmc on the main menu.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Provides great access to on-line programming", "verified": true, "helpfulness": "0/0", "author": "B. Frank"}, {"rating": 3.0, "review": "As long as your a big Amazon fan it is a great product.  Using it for any home videos is not available.", "verified": true, "helpfulness": "0/3", "author": "James Petersen \"Jim P\""}, {"rating": 4.0, "review": "Not to be confused with the less expensive and less capable Fire Stick...  I bought the Fire TV because I don't want to use wireless if at all possible. Fire TV amazed me with the ease with which it punched through my router and out to the internet. Updated itself, took my password and just like that, was up and running. I have absolutely no interest in watching movies on a tablet, so the test was...what does it look like on my 52\" HiDef TV? It's arguably higher quality than cable. I can't describe all the features... I just bought it to stream to my TV and this it does flawlessly over a Cat V cable from my computer's router. Next.... Getting rid of all but basic cable.", "verified": true, "helpfulness": "1/1", "author": "Ian MacDonald"}, {"rating": 5.0, "review": "I love the voice search and it searches all apps!", "verified": true, "helpfulness": "0/0", "author": "Anette M. Matthews"}]