[{"rating": 4.0, "review": "I have only had this for a few days. So far, I think it is great! Need more time to understand the product better. My only wish, is that I could get the local news (at the time shown for the recent day). I was disappointed with how many recent tv shows require a \"pay fee\". Some of my favorite shows such as: \"Castle\" is cost effective. (disappointment) I give the Amazon Fire TV a four star only because of the \"pay fee\" on so many recent tv shows.", "verified": true, "helpfulness": "0/0", "author": "Martha L. Toner"}, {"rating": 1.0, "review": "Terrible. Major problems with audio, games don't load right. Very sneaky content screening, it will charge you for movies on prime even if you already are a member etc.Don't buy this, wait for version 2.", "verified": true, "helpfulness": "3/4", "author": "Jonny G \"tresero\""}, {"rating": 4.0, "review": "Very easy to install and set up. My only complaint is that it tends to freeze randomly. I returned my first one to the retailer thinking it was the unit. With the replacement I still have the same issue not to the same degree.  It's not the cable because I replaced that as well. However I still give the rating I posted.", "verified": true, "helpfulness": "0/0", "author": "Snow White \"Maria\""}, {"rating": 4.0, "review": "Love it and still no shower!", "verified": true, "helpfulness": "0/0", "author": "Carlos Salce"}, {"rating": 3.0, "review": "The interface is snappy and easily navigatable but the voice mechanism does not search within applications such as netflix which kcal most defeats the purpose. One of the reasons I picked up the fire tv was the excellent experience I had with amazon video service. For instance, on a old sony blu ray player which had amazon video, we would get refunded the cost of a rental if the quality of video or sound was low.  With the fire tv I have rented four videos and one did not play and another had diminished quality of video. Neither were refunded. I know this is more of an issue with the video service but it's worth noting here.I think the device is better than the Apple TV (sound cutting out is a big problem with that one) and I would move completely off the Apple TV if amazon would get hbo go.I did not use the other features such as playing games", "verified": true, "helpfulness": "0/0", "author": "Doug Ahole"}, {"rating": 2.0, "review": "What an amazing product that works better than the rest. But why can't I get the best picture quality with flixster, Netflix, and any other movie application??? Apple TV shows all HD. But fire can only show amazon movies in HD?!?!?!", "verified": true, "helpfulness": "0/0", "author": "Joseph Hernandez"}, {"rating": 1.0, "review": "half the show on prime won't load and the movies are always buffering. I have great internet service and my Apple TV works just fine with it. I only buy it to watch things on Amazon Prime and I can't even do that.", "verified": true, "helpfulness": "3/3", "author": "Micheal"}, {"rating": 5.0, "review": "I'm writing my own \"updated\" review since some refuse to update theirs about this product. In an unbiased way, I think this is a great product that has been produced when other streaming boxes are in their 3rd hardware output. Some feel that this Fire TV should have come free for PRIME users, but it has been explained that this item is NOT of PRIME although it maximizes the use of it. The product does not go 'with' PRIME, it is a separate streaming box w/video gameplay as well as other features. It does NOT have a browser and was not meant to replace anyone's existing streaming boxes but rather to give others an option if they don't have any streaming box already. Some will look at what this item has to offer and decide to trash what they already have, my advice is that you look at the specifications (Amazon shows you a chart for you to visually compare each streaming box type on the market), see what YOU need in a streaming box and make your choice off of your own assessments.I have been spending a great deal of time on one persons post about 'critical flaws' - but that persons gripe is based on what HE expected and not what Amazon 'intended'. Yes a developer cannot please \"everyone\" but to come out with a device that is faster, stronger, does just about everything the other streaming boxes do and a bit more...is in my opinion awesome. And to do it all on the 1st try (when the other streaming boxes on on their 3rd hardware output which is still not as powerful as the Fire TV!), says a lot about what this box has to offer!The 'gripe' that many had about this product WAS that the prime content was not readily available and they WERE correct. I don't think it was a problem because PRIME content was still available, it just was not available 'exclusively' and separate from the Instant Videos and purchasable movies - until NOW:UPDATE: \"There IS NOW separate PRIME content navigation, with all the bells and whistles. The home screen navigation NOW has: PRIME VIDEO and under that selection is everything for PRIME:RECENTLY ADDED PRIME TV -RECENTLY ADDED PRIME MOVIES -RECOMMENDED PRIME TV -RECOMMENDED PRIME MOVIES -HBO on PRIME INSTANT VIDEO -PRIME MEMBER EXCLUSIVES -TOP TV on PRIME -TOP MOVIES on PRIME -KID's TV on PRIME -KID's TV GENRES -PRIME MOVIE GENRES...In that order. Works great too. Some are having issues with the software just recently (and I hope that gets fixed), but for the most part everything is good to go. Looking for them to add a few more Apps (ex: HBO GO is said to be coming) along with an update to activate the USB input to allow for external memory via flash drives, hard drives and etc.With this and all of the other great features which came with this product, I feel that it is worth givng it a try. Hope this helps ;-)", "verified": true, "helpfulness": "2/2", "author": "CritiKiL"}, {"rating": 2.0, "review": "Love the voice search but every 20 min I get a \"Lost Connection\" error. This doesn't happen with my Apple TV or Mac on same network. Amazon support couldn't fix and no offer to return product... Just \"we will call you back\"", "verified": true, "helpfulness": "1/2", "author": "Thomas Patrick Wood \"www.masterytv.com\""}, {"rating": 1.0, "review": "It was reprogrammeinternally and after calling Amazon 3x to fix the issue it STILL does NOT work.  I thought I would receive a new one but now am told that would not solve the issue without explaining what will solve the issue.  I am at the point of shouting that fix it or I will return it and buy an Apple TV.", "verified": true, "helpfulness": "9/11", "author": "Barbara Wagner"}]