[{"rating": 4.0, "review": "I really like this device.  I was very skeptical at first as I already have several devices that basically do what this device does, but it's so slick and smooth with the radio frequency style remote (vs. most infrared remotes).  What that basically means is that you don't have to point the remote at the device which is AWESOME!!.  The interface is very nice and smooth and FAST!  The only reason I don't give it five stars is that it occasionally skips/blips instead of perfectly smooth playback.  I'm not sure if that is a function of the device or the service I am using, but it is noticeable nonetheless.  The voice search is slick, but really only works for Amazon content.  This is a great device and I am very pleased.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"presidentsdad\""}, {"rating": 5.0, "review": "The unit was very easy to set up, the main menu screen is visually pleasing and the there is a wide range options for radio, podcasts, and music.I like it.", "verified": true, "helpfulness": "0/0", "author": "Plain Lady"}, {"rating": 5.0, "review": "In my home, I own a Smart TV, Smart Blu-Ray, Kindle Fire tablet, 2 laptops, 2 smartphones, a Playstation 4, and have digital cable, with HBO and Showtime...The Amazon Fire TV is my favorite!  I love that I can watch HBOGo, and Showtime Anytime, which none of my other devices offer.  I can also play most of my games that I've purchased with my Kindle, on the Fire TV, with my PS4 game controller!  Amazon has the best customer service IN THE WORLD, and I will continue to buy their products!!  The one con is I've had to unplug and plug it back in a few times, always after I've played a game with the game controller...sometimes it has a hard time recognizing the fire remote again.  It doesn't happen often.  Still LOVE it!", "verified": true, "helpfulness": "0/0", "author": "Carla"}, {"rating": 4.0, "review": "You should check to see if your cable provider allows for HBO GO.  I purchased this based on that it was advertised that HBO GO would work and then once it was hooked up, I found out that the two of the largest cable providers do not allow it.  (Charter, Comcast)  It isn't the products fault, but Amazon should be careful in the advertising.  Set up was very easy and the connectivity to my wifi seems to be better than using chromcast.", "verified": true, "helpfulness": "0/0", "author": "Lake-H"}, {"rating": 4.0, "review": "Great product. Offers hours of entertainment and exclusive apps. Would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Zachary Hughes"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "leslie weiss"}, {"rating": 3.0, "review": "I'm Happy, however I have charter as my cable provider so a lot of the apps I can't use on theAmazon fire tv but I can with my Kindle. Example hpogo", "verified": true, "helpfulness": "0/0", "author": "Narrissa Denise Hand"}, {"rating": 5.0, "review": "It's so convenient and fast.  Clear digital HD too.  We watch Sling TV lots.", "verified": true, "helpfulness": "0/0", "author": "Linda Shanks"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Shawna"}, {"rating": 5.0, "review": "It's Very good easy to use the remote control very good and I also can use wireless mouse.Only one problem if I lost the remote I don't know where to get another one because the remote work only same base can't witch different oneGood media player", "verified": true, "helpfulness": "0/0", "author": "Then H. Chau"}]