[{"rating": 5.0, "review": "Lightning fast, clear HD picture, very nice selection of movies, the only issue is the new releases are not available as fast as they are on Comcast, some movies are cheaper then Comcast, some are more expensive. The box is very low profile and blends in with my other electronics.", "verified": true, "helpfulness": "1/1", "author": "Shari Arato"}, {"rating": 5.0, "review": "HiI think this is the best complete movie venue to come along. I've been a member of Amazon Prime for 4 years now and now that I own Amazon Fire, I am more impressed than ever.I've personally guided 5 family members and 7 friends into Amazon Prime and they love it as well.Ron CavalierWimauma Fl", "verified": true, "helpfulness": "1/1", "author": "RONALD CAVALIER"}, {"rating": 3.0, "review": "the remote is good, and still finding good content, but the chromecast can cast a tab in chrome, I wish Fire TV could do that.", "verified": true, "helpfulness": "1/3", "author": "steveb"}, {"rating": 3.0, "review": "Shipping and packaging was an A+ as it always is with amazon. The product has a nice sleek look to it. The quality of the images is amazing. Installation was a breeze. We have had it in use for 3 days and have already had to reset it twice. It started off working okay but then the error messages started appearing when we would load Netflix. Then it happened again while trying to play a video with the Amazon app itself. Needs to have some bugs fixed before I would buy it for the other rooms in my house. For now I will stick with Roku.", "verified": true, "helpfulness": "1/1", "author": "Karen B."}, {"rating": 5.0, "review": "I purchased the Fire TV hoping that it would solve the constant buffering / picture quality issues I was experiencing with my Roku.Because I have been a Roku advocate for years I was skeptical of the FireTV, yet curious enough to try one out.I hooked it up and went through the setup. I found out immediately that the Fire TV box was already registered to my Amazon Prime account. (Nice touch Amazon!)Next I downloaded the firmware update via ethernet, (I HIGHLY recommenrd this) loaded Netflix and Hulu Plus apps, and commenced watching.WOW!! What a difference!!Many claim that buffering and picture quality are network related issue and not the fault of my Roku box. I vehemently disagree with that statement.We currently have 12 Internet connected devices on our home network (Tablets, smartphones, desktop, laptop) and I can tell you that I ran my FireTV inder normal network traffic load conditions and I experienced ZERO buffering or picture quality issues.If you are a Roku user like I was and found yourself getting frustrated trying to exit  Hulu Plus and getting hung up in the process, I can tell you that the Fire TV will turn that experience into a memory!. No more \"Hulu Hangup\" . The Fire TV sports a quad core processor and 2 gigs of ram and it islightning fast. Switching between games and movie straming apps is almost instantaneous.The voice search feature for Amazon Prime works flawlessly. I am looking forward to voice search for Netflix  and USB external streaming support being enabled in the near future.My only gripe against FireTV is that there is no WWE Network app available for it. That will probably change soon though, as the selection of Android apps are constantly being added/ported to the Fire TV.Now that Roku has been eclipsed by the competition, I suspect they will attempt to up thier game and produce a streaming box that they hope will sway ex-Roku faithful back to the fold.Problem is, Android is the future..............Signed,A Fire TV convert", "verified": true, "helpfulness": "6/6", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have Netflix and fire  tv allows additional choices. The voice recognition is great. I do have prime but without it it would be too expensive to use on a regular basis for me. I strongly suggest that a brief program/movie explanation as Netflix does would be very useful, especially those which require rental or purchase.John Burgess", "verified": true, "helpfulness": "0/0", "author": "John Burgess"}, {"rating": 1.0, "review": "I expeted for it to work as described, As a prime member I expected more movies to watch free. It appears now to me that everything AND i MEAN EVERYTHING that I want to see always has a price attached to it. The only good thing I see in it is, It has NETFLIX and I can watch my movies there. when I use the voice search to find a NETFLIX movie it only takes me to the Amazon pay movie site for the same movie that is free on Netflix.Trust me I would gladley recommend to an enemy to throw away his money and buy this worthless thing. to my friends I would tell them to save their money and just get Netflix. The box is less expensive and the movies are free with my monthly service I pay. It appears to me that Amazon is extremly money hungy. they want a a fee to become a Prime member and then want to charge for the more desirable movies. Oh no, I do not like this Amazon fire TV at all", "verified": true, "helpfulness": "5/13", "author": "Oh What a feeling! \"interested\""}, {"rating": 5.0, "review": "Switched from an Apple TV to the Fire TV. Will never look back!!!  Easy to set up-plug in- change the tv source- Voila!!!", "verified": true, "helpfulness": "0/1", "author": "Roland Fowlks"}, {"rating": 3.0, "review": "You can get better things for TV. Why buy something that will try to sell you programs, buy something that gets programs for free. It isn't Amazon they don't like free TV.", "verified": false, "helpfulness": "1/2", "author": "Rodney B. Ring"}, {"rating": 1.0, "review": "I bought it for the voice search feature.  I pull up content from YouTube on my TV.  Typing in the search criteria is a pain.When I search for content (that I know is available on YouTube), can pull it up using typing on computer Fire TV says nothingin catalog.  Can you help with making content on YouTube available using voice search via Fire TV.  Otherwise I think it is wastedmoney for me.", "verified": true, "helpfulness": "6/11", "author": "Larry Kline"}]