[{"rating": 4.0, "review": "{Updated Review} I've now had the Amazon Fire TV for a few months, and I'm lowering my rating.  There are 2 reasons.  First, it freezes up.  If I've been using another device on my Samsung TV, such as the XBOX, and switch back over to the Fire, I frequently need to unplug the Fire and plug it back in before the TV finds a signal from it.  This is getting quite frustrating.  Second, I've had 2 occasions where I've received an error trying to watch videos in my library.  If I pull out my computer, I can watch them fine.  But the Fire has trouble.  Download speed is still very good, and I've not had a movie interrupted by slow speeds like regularly happens with Netflix.  I also still really like the remote.At the time of this writing, I've had the Amazon Fire TV for about 1 month.  In the past, I've used a Samsung Blu-Ray player and an X-BOX One to access Amazon Prime and Netflix--my 2 primary entertainment sources.  I've played a bit with Roku, as well.  I decided to try Fire TV after Netflix kept hanging on the X-BOX.  I was also frustrated by having to type in searches, and I was intrigued by the Fire TV's voice search.So let's start at the beginning.  Fire TV arrived in a nice box, and it took perhaps 5 minutes to get everything plugged in and turned on.  The Fire TV was already configured to my Prime account.  All very cool and well done!  The Fire TV itself is small and inconspicuous.  The I pressed the microphone button, said \"Band of Brothers\", pressed the middle button to confirm the results of my search, and Voila!  Almost instantaneously, I could watch Band of Brothers, episode 1.  It worked just the way it was supposed to and the way I wanted it to!Second test, because I had heard of problems with Netflix, and we also use Netflix a great deal, I selected Netflix.  (Found Netflix, by the way, by pressing the microphone button and saying, \"Netflix.\"  It worked! Way cool!!!)  I selected the Netflix app and was told that Netflix would be downloaded and installed shortly.  I waited, tried again, and got the same message.  I waited, waited, waited.  A few hours later when I went to bed, still no Netflix. FAILURE! I was wondering if I would be sending the Fire TV back the next day.  But, the next day after work, I decided to try again.  SUCCESS! I don't know why there was such a delay, but Netflix has worked with *no problems* ever since, and my wife has watched several shows/movies on Netflix.  Unfortunately, voice search only works on Prime, so you have to search within Netflix the old fashioned way.Third test--Pandora.  We often have Pandora running in the background.  X-BOX doesn't do Pandora well, because they want you to pay for their music service. So I pressed the microphone button and said \"Pandora.\"  There it was!  I entered my Pandora account information, and Pandora works just like it should.Fourth test was the remote.  It's sleek and simple!  I love it.  I don't like a cluttered remote where I have to struggle to find the right button.  Using the fast forward and reverse buttons took a little practice to master, and I recommend reading the instructions for those, but now I find them quite effective.  And, the show you're watching will continue showing on the screen, while in a small box in the corner, you can see where you are fast-fowarding and reversing to.  Very nice.My final comment is that all of the shows I've watched have loaded quickly and the quality has been excellent.  Because Netflix now works, and the voice search is awesome, Fire TV gets a LOVE ranking from me!", "verified": true, "helpfulness": "1/1", "author": "bard"}, {"rating": 5.0, "review": "So Easy to use, got it for $69 on Cyber Monday", "verified": true, "helpfulness": "0/0", "author": "iMA"}, {"rating": 3.0, "review": "very good", "verified": false, "helpfulness": "0/2", "author": "tareq"}, {"rating": 3.0, "review": "Can anyone tell me if repositories can be added to this device. I currently have boxee box and would love to keep using some of my current streams.", "verified": false, "helpfulness": "0/1", "author": "ANS"}, {"rating": 5.0, "review": "Easy,easy,easy for old folks", "verified": true, "helpfulness": "0/1", "author": "missvan"}, {"rating": 3.0, "review": "Pretty good although locked down with inability of removing or at least hiding specific menus. I dont want to see all the PRIME stuff if I dont want to. Also doesn't work when trying to mirror from s4 and Tab 3. It just exits the mirroring screen and tablet or phone will get an error.", "verified": true, "helpfulness": "0/1", "author": "mammothman"}, {"rating": 3.0, "review": "Im wanting to buy this so bad but its still unclear to me as to, whether or not I can access WWE network from it. Can someone please tell me so I can decide if I want to purchase it or not.", "verified": false, "helpfulness": "0/5", "author": "shawn stover-johnson"}, {"rating": 4.0, "review": "So far so good.My husband and me are still exploring the features but we're having fun so far.Really enjoying the movies and Seinfeld's web series.", "verified": true, "helpfulness": "0/0", "author": "cristina ponce"}, {"rating": 5.0, "review": "Loving it!", "verified": true, "helpfulness": "0/3", "author": "Smonty \"Sglennhar\""}, {"rating": 5.0, "review": "This is the best product I purchased this year!  It is so easy to set up and use.  I love the remote control.  You just speak into it and it finds what you want to watch.  If you are on the fence about this, don't be.  It makes a fantastic present for anyone or a gift to yourself.", "verified": true, "helpfulness": "3/3", "author": "Yvonne Roga"}]