[{"rating": 5.0, "review": "It's so much easier to watch tv with my girls now. And they love it too. ...I'm not the most computer savvy person. So the simplicity was so worth the time it took to write this!", "verified": true, "helpfulness": "0/0", "author": "Big Bo"}, {"rating": 5.0, "review": "Very good product and much faster than my smart tv apps.", "verified": true, "helpfulness": "0/0", "author": "Gary Lussier"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Joshua"}, {"rating": 4.0, "review": "As soon as I opened the box, I knew I was going to love it. The Fire was so easy to set up, configure with all my apps, and just use in general. My only complaint is the difficulty I've had with bright house to get my hbogo working on the tv. Everything else has been extremely easy. Amazon prime music playlists are free and nicely curated. I debated about which Internet/tv gadget to buy, and I am very happy I chose the Amazon fire.", "verified": true, "helpfulness": "0/0", "author": "Beth Blackwell"}, {"rating": 5.0, "review": "I am loving the Amazon Fire TV so much so that I bought another one for my studio TV. Soooo very easy to instal. so easy to use! and great packaging too ... yeah Amazon", "verified": true, "helpfulness": "0/0", "author": "Mdl49"}, {"rating": 5.0, "review": "Fantastic product.  Better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Joseph V. DeChellis"}, {"rating": 5.0, "review": "I'm so pleased with this purchase it works great now I have movies galore to watch since cable and satellite suck they show the same shows over and over! Plus it's simple to operate ... Love my fire box", "verified": true, "helpfulness": "0/0", "author": "Mary A. Mays"}, {"rating": 5.0, "review": "This is the best thing since the advent of the television. Yow, I've not watched cable TV since I've setup this box. Luv it, love it, luv it.", "verified": false, "helpfulness": "0/0", "author": "Cedric Summers"}, {"rating": 3.0, "review": "it was a gift and am currently using it to see how well it works.. Will wright an assessment later.", "verified": true, "helpfulness": "0/2", "author": "J. DickersonSr"}, {"rating": 5.0, "review": "This little gizmo works so much better than the various game consoles we have used in our home. The apps and features react more quickly and we rarely have any bandwidth issues or stalling.", "verified": true, "helpfulness": "0/0", "author": "Robert Toupin \"BloodCrow\""}]