[{"rating": 5.0, "review": "Met and exceeded all of my expectations!  The selection is great and operation works for me.", "verified": true, "helpfulness": "0/1", "author": "Tom Reeves"}, {"rating": 5.0, "review": "Since I finally got it going \"I love it\" can't wait  I get the courage to cut the cable cord  !!!", "verified": true, "helpfulness": "0/1", "author": "rose martin"}, {"rating": 5.0, "review": "The picture and audio quality are great; it is easy to setup and use.  I also bought the game controller which is fun to use with the games and was also able to use the controller with my computer that has Bluetooth.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Dorsey"}, {"rating": 5.0, "review": "So much to see, so little time. Love it.", "verified": true, "helpfulness": "0/1", "author": "Mary"}, {"rating": 5.0, "review": "Super easy to set up and works great. Love it.", "verified": true, "helpfulness": "0/0", "author": "Toowishful"}, {"rating": 5.0, "review": "This is the ultimate non- tecky review.First your house must have wi fi or fast internet connection, I had to get fios from frontier for tv. (I have a flat wall antenna from amazon which works great for the basic 10 local stations.)The fire plugs into the back of the tv with the belkin HMDI cord, buy the better cord. it goes in hdmi 1.Turn the tv on , go to the menu on your tv remote, go to HDMI channel 1. Fire will be waiting for you. follow the directions,I have the best luck loading all my programs on my computer , in prime videos.I bought fire because my recording system, bought last year on amazon stopped working and I wanted to watch PB -downton abbey.The apps are loaded from the computer, then go to fire and follow the activation directions, very easy.Check the apps before you buy to see if it meets your needs. I wanted History and Public broadcasting, no sports channels.The remote is easy to run , once you get the battery in, the voice recognition does a good job.You will need a large surge protector to get all of this plugged in, I am also running sennheiser headphones, which are wonderful.I am very happy I can watch movies and PB anytime I want, with crystal clear sound and picture, I am even gasp considering up grading my tv----I am historically a reader, not a movie watcher. I get up to go to work early and have missed years of programs, so now I am catching up.", "verified": true, "helpfulness": "2/2", "author": "Vintage PowerReader \"A Vintage Reviewer\""}, {"rating": 3.0, "review": "Apple Fire TV provides great access to Prime movies, music and shows and has worked for Netflix. My one major complaint is that there is not enough memory and you can't add an external harddrive to increase memory. Get messages that memory is low and have to uninstall aps to continue watching movies.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!  Worth every dollar.  Great easy way to connect to Amazon Prime and other services like Netflix.The voice option helps but remember this only searches the world of Amazon.  What does this mean?  If there is a show on Amazon and Netflix it will pull availability from Amazon which may have a fee depending on the program.  Not a big deal but something to consider.No issues with downloads or buffering.  Fast and super clear picture.I certainly recommend it and may buy another one for another TV.", "verified": true, "helpfulness": "1/1", "author": "TSR \"tsr24\""}, {"rating": 5.0, "review": "very nice unit. It works well and does the job for me", "verified": true, "helpfulness": "0/0", "author": "Bruce Finley"}, {"rating": 2.0, "review": "Does what it says but most smart tv's already do it, and there are better systems out there like roku. The game controller is also impossible to get", "verified": true, "helpfulness": "0/0", "author": "dan"}]