[{"rating": 1.0, "review": "It installed properly, but I cannot stream ANYTHING. I get an error message. I suppose my att DSL is too slow.", "verified": true, "helpfulness": "4/14", "author": "Joseph E. Maloney"}, {"rating": 1.0, "review": "this product is the poorest android box, the remote half the time will not work POOR. Completely poor, Completely poor", "verified": true, "helpfulness": "2/15", "author": "John J. Skinner"}, {"rating": 2.0, "review": "I bought the Fire TV the day it was launched and I intended to use it for media streaming and games for my 7 yr old. If the gaming is going to be one of the reasons you buy this, please buy something else. Problem is that apart from 4-5 games, rest of the game in the available catalog are for tablets and phones and that creates huge problems. The games are optimized for touch controls and do not translate well to controller based control systems so much so that you cannot even quit some games or advance through levels. My son has been so frustrated over these issues, that this silly box is not worth the aggravation. Media streaming works as advertized but there are other more mature options from Roku and Apple available. I am a loyal Amazon subscriber but this product was not very well thought out...especially the greedy decision by Amazon to sell incompatible games in the app store.", "verified": true, "helpfulness": "2/3", "author": "Patriot4971 \"Patriot\""}, {"rating": 4.0, "review": "I love how easy it is and how well it works. Great cost for device. The down side is that there are hardly any new releases on Prime so kind of defeats having the membership for this. The other down side is that the movies are higher cost than most all streaming memberships but up to $2.00 each. Overall glad i have ,but will use other sources for regular priced items I was trying to get away from. Vivo feature was nice surprise since MTV isn't really music videos anymore;)", "verified": true, "helpfulness": "2/2", "author": "Julie Anderson"}, {"rating": 5.0, "review": "Great stuf a lot better than Rokus and apple stuff. I am using it every day, I think I wont go back to the stuff that I was using.", "verified": true, "helpfulness": "0/1", "author": "Jose R. Nieto \"Zapatero\""}, {"rating": 5.0, "review": "Amazon scores another winner with a great product. Many other reviews are out there regarding specs and personal experience with the Fire TV, so I will just say we are a super happy family using the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Mojo AZ"}, {"rating": 5.0, "review": "This is a great find, because I was trying to figure out how to watch Netflix on my tv but it wasn't possible because we don't have the kind of tv that can connect to too many things. It's not a high tech tv, I mean it's a nice tv but it can't do everything without some help. So the amazon fire tv box makes our big screen tv so much more fun because now we can watch Netflix, listen to iheart radio and pandora radio all the time. It's a great thing to have for families.", "verified": true, "helpfulness": "1/1", "author": "Janique"}, {"rating": 4.0, "review": "There's certainly no 'wow' factor, but it's fast and works well. I've been using a Roku 2 for a few years now so this is a nice compliment.I have noticed some shuttering while watching Netflix. I think there's a great opportunity for Amazon to open this thing up for way more apps or even a protocol like DLNA.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "I love this from the packaging, the box it came in to the feel when I touch it.  After that it is very easy to use.  It responds even if the remote is not facing it at all.I like being able to get more from my Prime account.  I heard I could watch movies, but had no interface to enable it.  But if you need a restful moment or two, let the screen saver kick in.  (It will after a while if you leave it mid show to watch a TV broadcast.  Alone the visions are worth the price of the box.  Then if you push a button you are back at the thing you left off from.I appreciate being able to see some of the shows I might have wanted to see on PBS but don't know when to tune in.  When I have seen my watch list as it is here I may reinstate my Netflix, but for now I'm good at a very reasonable price.Love it!", "verified": true, "helpfulness": "2/2", "author": "sargant"}, {"rating": 4.0, "review": "Amazon Fire TV works right out of the box! I am very pleased and will recommend to others. The price of the chromecast dongle is better. The voice search on Amazon TV is amazing!", "verified": true, "helpfulness": "0/0", "author": "J. Lee"}]