[{"rating": 2.0, "review": "I was very disappointed to find out it never turns off... and according to the Amazon customer service rep I talked to the only way is to unplug it.  That is not an option.As far as function it works fine.  The UI is smooth and easy to use as is the remote.If you are looking for a player that has Twitch, this is one of the only I could find.", "verified": true, "helpfulness": "3/5", "author": "Kydex"}, {"rating": 4.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "mmckee03"}, {"rating": 5.0, "review": "Awesome product by amazon.  Great if you are an avid Netflix user.", "verified": true, "helpfulness": "1/1", "author": "Danielle"}, {"rating": 1.0, "review": "Beware!! Many, Many Fake Reviews on Here! Review this product elsewhere to find out the real deal. Bummer!!", "verified": false, "helpfulness": "3/20", "author": "TJ \"TJ\""}, {"rating": 5.0, "review": "Loved the first one, so I bought 2 more and cut the cable in my house completely so we are ALL Amazon! Great and fast streaming box. Very smooth in general. We love the remotes that are so easy our 3 & 4 year olds can operate. Voice Search is remarkably accurate. Small gripes / software improvement requests would be to add an option/remote configuration to power off the box, as well as an option to sort and view only Prime content, for those of us who rarely buy on-demand AIV programs...otherwise it's 97% perfect!", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 4.0, "review": "I own an AppleTV, a Vizio Co-Star, and now a FireTV.  I was interested in the FireTV mostly because the Amazon app on the Vizio is terrible (freezes, lag, tiling, no audio) and the AppleTV will never, never, never get Amazon content.Is it better than my Vizio Co-star?  Much better -- for Amazon content.  The performance is excellent.  The Co-star does search across all content providers (Hulu, Google Play, Amazon, and Cable TV provider) to give me multiple options to watch content.  I can pick the cheapest for a movie but otherwise, the FireTV is superior in most ways.Is it better than an AppleTV?  Much better -- for Amazon content.  Since the AppleTV doesn't provide Amazon content, this should be obvious. Much better -- for (Amazon) gaming.  Since AppleTV doesn't do gaming, again... obvious.  But the Hulu interface on AppleTV is superior, the Netflix interface is superior, and HBO GO is completely absent on the FireTV.  The AppleTV interface for finding movies is superior.So FireTV gets 4 stars.  I like it.  Will it replace my Co-Star? Probably.  Will it replace my AppleTV? Not likely.What would it take to get rid of my AppleTV?  If I had a wish, I would wish Amazon to transfer my content from iTunes to Amazon would be HUGE.  Making me repurchase content is insane.  However, this seems very unlikely.  If FireTV had HBO GO, I'd be less likely to use my AppleTV.  If FireTV searched across providers and had HBO GO, I'd only use my AppleTV for iTunes content.Needless to say... it's close Amazon but not an AppleTV killer... yet...", "verified": true, "helpfulness": "5/5", "author": "David G. Rettig"}, {"rating": 1.0, "review": "Aciden", "verified": false, "helpfulness": "1/19", "author": "William R Damas Martinez"}, {"rating": 5.0, "review": "i like it", "verified": false, "helpfulness": "1/2", "author": "shayeholmes"}, {"rating": 1.0, "review": "Lots of audio problems with this Fire TV@!", "verified": true, "helpfulness": "5/10", "author": "Larry Collins"}, {"rating": 4.0, "review": "That's good for me.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]