[{"rating": 5.0, "review": "It's one of the best purchases  we have ever made", "verified": true, "helpfulness": "1/2", "author": "Jayne Butcher"}, {"rating": 2.0, "review": "I purchased this device as a Christmas gift for my Dad so he can watch Netflix.  Turns out Netflix does not work with this device!  Acoording to the reviews I read, it hasn't been compatible for awhile.", "verified": true, "helpfulness": "4/8", "author": "Robert Esparza"}, {"rating": 5.0, "review": "Much faster than I could imagine... So far so good", "verified": true, "helpfulness": "0/1", "author": "Brett"}, {"rating": 5.0, "review": "Christmas gift for my wife. She loves it. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Brent Mackie"}, {"rating": 4.0, "review": "We love this and have been watching so many movies and hooked on Pretty Little Liars! I only wish Netflix was voice activated as well.Loved that it came down in price too! :)", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "I love the Kindle Fire TV.  It set up in under a minute and had a video to follow so anyone could do it in that time frame.  The only thing that is sad has nothing to do with the Kindle but with my cable company - COMCAST which wants Netflix and HBO to pay premium fees for internet use and since these companies will not I cannot use them on my Kindle since Comcast will not support any third party access to them!  It is easy to set up Netflix and HBO on the Kindle but when you are asked to pick your cable provider to finalize the setup there are hundreds of companies but no COMCAST.  They have chosen to be the sole authorized provider which means they want me to purchase another cable box.  That is not Kindle's fault or issue but be aware that companies like COMCAST are out there.  This Kindle TV syncs automatically with my Kindle HDX tablet and is simply amazing! Buy it!", "verified": true, "helpfulness": "1/1", "author": "Arthur Jarrett \"Child Advocate\""}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/1", "author": "JL"}, {"rating": 5.0, "review": "I love this. Now I can watch my prime movies and Netflix movies on my TV instead of my iPad. I love it.", "verified": true, "helpfulness": "0/0", "author": "Swell Gal Mary \"swellgal\""}, {"rating": 5.0, "review": "The Fire TV works great. Easy to install, use, and a pure joy. We also have an Apple TV, also a good product, however for Prime Users, the Fire TV is the best. The quality and speed of this device is top notch. Highly recommend Amazon Fire TV.Update:After 7 months I continue to highly recommend Amazon Fire TV. Just works for me.", "verified": true, "helpfulness": "0/0", "author": "Cassandra Penn"}, {"rating": 4.0, "review": "Don't get me wrong I really like the FireTV, but the lack of control over the apps. Takes away from the experience.I have an Apple TV and a Roku2. I bought the FTV to replace the Roku. Of the three the Roku was the weakest. I would have bought the latest one, but Amazon offered the FTV at $30 off (lighting deal).Even after all this time the Apple TV still has a slicker look and feel. The menus are really well thought out.The Fire's base menus are a huge step up from a Roku2's (note: the Roku2 is not the latest model). They compare well to the Apple. The voice search works most of the time. For instance it has a problem telling the difference between two similar words like \"pact\" vs \"pack\". There should be a way to correct manually, but there isn't. It's a work in progress, but to be fair a good start. When I'm using my Apple TV I miss the voice search (imperfect as it may be).I took off a \"star\" because I think Amazon should put more pressure on the App authors. Don't just settle for any old thing. I use Netflix, Hulu, and Plex. Plex, while free on Roku, is better on Fire but costs $2. Netflix is pretty good on Fire, but better on Apple and Roku. Hulu (I'm only talking about the app not the service itself) kind of sucks in Fire while it's great on Apple and Roku. It's kind of hit and miss.I'm keeping my Fire TV. It does what I need it to do (Prime video, Plex and Netflix) and hey I got it for $30 off. My guess is It will get better.", "verified": true, "helpfulness": "1/1", "author": "Michael8596"}]