[{"rating": 5.0, "review": "Love my Fire TV! Wish there were more new movies for Prime members, many new releases are expensive to watch but overall selection compares to Netflix, without the hassles.", "verified": true, "helpfulness": "0/1", "author": "wendy"}, {"rating": 5.0, "review": "I bought Fire TV because I am a Fire Phone owner and I have Amazon Prime. I have to say, why the heck didn't I buy this sooner! First off, out of the box, the build quality is outstanding. The remote Maybe small but it feels substantial in your hand. The ability to use not only Amazon prime streaming but Netflix Hulu and all the major apps that I use on a daily basis with my other device has made my \"casting\" device Irrelevant. The nicest feature is probably the voice command where you can speak into the remote and it will take you to exactly what you're looking for. The onboard animated instructions leave no questions for a new user. I cannot recommend this unit Highly enough. I wish I bought it a year ago. Not only can you watch streaming Video but you can also play video games the wireless remote option looks like a win-win for families. Even Netflix operates easier on the FireTV than it does on the computer or a mobile device. Do yourself a favor and toss the other cast device aside and replace it with the Amazon fire TV.", "verified": true, "helpfulness": "1/2", "author": "Dagoberto P. Patlan \"DJ Dogbone\""}, {"rating": 3.0, "review": "They removed Kodi (XBMC) from the appstore and you can not connect a hard-drive to it. Amazon is limiting it. Other than that it works fine.", "verified": true, "helpfulness": "0/2", "author": "BV"}, {"rating": 3.0, "review": "I love it - when it works. For the most part, it is awesome.  On occasion, though, the sound stops working and I have to reset it to correct the problem. Netflix doesn't work well on it, I'm discovering.  Twice now, it freezes up on a particular episode and I cannot figure out how to fix it. It allows me to go to the next episode, but the problem persists with the current frozen one no matter how many times I reset, etc.  Not sure if this is an Amazon problem, a device problem, or a Netflix problem.", "verified": true, "helpfulness": "1/2", "author": "AB3"}, {"rating": 5.0, "review": "It works great,and came in a timely manner!!!!!", "verified": true, "helpfulness": "1/2", "author": "Todd Gouge"}, {"rating": 5.0, "review": "I'm not a tech savvy reviewer, just a grandma who has wanted a device like this for my bedroom tv. It arrived, I opened, I hooked it up (2 minutes), installed the batteries (they worked), it updated software (8 minutes and I won't complain about software updates because the kindle fire hdx automatically updates it's software and has been improving since the day I got that). Why did I decide to get this over the competition products? I have been super happy with all of Amazon's kindle products in the past, and I have had every one and I trust Amazon to stand behind their product. I look forward to future software updates on this device, like I did Apple IPods in the growth of that product. I still have that iPod, but it's really just a \"walkman\" now for when I do my walks with the dogs.", "verified": false, "helpfulness": "1/2", "author": "VAC Motorsports"}, {"rating": 5.0, "review": "Yeah the firetv stick is great because its portable and cheap, but if you are regularly streaming, you probably want a hardwired connection. I get much better and more consistent performance from this unit as I am able to plug ethernet directly into it.", "verified": true, "helpfulness": "1/2", "author": "Joshua R"}, {"rating": 4.0, "review": "The Fire TV pretty much met all of my expectations. Being a Prime member for a long time this additional perk is a great deal. I love that I can watch all of the old odd ball movies that I watched as a kid. I was kind of surprised at having to pay for the old movies with having prime although they are only a couple of dollars. The remote is easy to use and the voice recognition works very well.On a side note my first Fire TV delivery was taken from my porch after delivery. I notified Amazon and they had a new unit sent to me in a couple of days without any hassle. I really give Amazon a thumbs up for that.", "verified": true, "helpfulness": "1/2", "author": "Ron Cannell"}, {"rating": 5.0, "review": "Love fire TV.", "verified": true, "helpfulness": "1/2", "author": "Crystal"}, {"rating": 1.0, "review": "i dislike Amazon Fire TV. i better is Apple Tv", "verified": false, "helpfulness": "0/7", "author": "Will Archer"}]