[{"rating": 2.0, "review": "A LOT OF CONTENT HAS TO BE PURCHASED. ESPECIALLY ANYTHING NEW. Cannot Use HBO OR SHO OR MAX IF THERE IS NO AGREEMENT BETWEEN CAVLE COMPANY and AMAZON.", "verified": true, "helpfulness": "0/3", "author": "john"}, {"rating": 5.0, "review": "The Fire T.V. is amazing!!! I can get csught up on all of my shows!!", "verified": true, "helpfulness": "0/0", "author": "nerd"}, {"rating": 5.0, "review": "The Amazon Fire TV is an outstanding alternative to the Apple TV. It cost less and it has everything I need on it.", "verified": true, "helpfulness": "0/0", "author": "Terrell Richards"}, {"rating": 3.0, "review": "•I would like a cursor feature•remote is pretty basic•the apple Amazon Fire app gives me more options-but what if I didn't have that option?", "verified": true, "helpfulness": "0/2", "author": "Don Lundy"}, {"rating": 5.0, "review": "We like it", "verified": true, "helpfulness": "0/0", "author": "jazmin flores"}, {"rating": 5.0, "review": "I love Fire TV!!!  We have had it for several months and it is wonderful. We have a Samsung Smart TV and bought this for a smaller bedroom TV after deciding to cut from cable TV.  I wish I would have bought this first.  I would have purchased a less expensive TV and this to go with it.  It does everything the smart TV does and more!  I am not tech savy and this was so easy to install that I couldn't believe it.  Just plug it in to your TV and it works!  The voice recognition is great!  My young daughter uses it with no problems ever! I cannot recommend it more highly.  If you are thinking about buying it, just do it!  You won't regreat it!", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "LOVE this, it is saving me alot of money and we can watch movies anytime we want.", "verified": true, "helpfulness": "0/0", "author": "Ellen"}, {"rating": 5.0, "review": "Great device. Thanks to my girlfriend for this awesome Christmas gift!", "verified": true, "helpfulness": "0/0", "author": "Jaime"}, {"rating": 3.0, "review": "Hard to start going.  Me vies do not continue as they should.  A lot of interruptions", "verified": true, "helpfulness": "0/1", "author": "Linda S Horne"}, {"rating": 4.0, "review": "Works well. would be better if youtube was also an option.", "verified": true, "helpfulness": "1/4", "author": "Tim Vining"}]