[{"rating": 5.0, "review": "The Fire TV device (or stick) is a must have for Prime Members and other Amazon addicts.  I like it much better than the AppleTV which doesn't offer any value out of the box (i.e the content is only available if you pay for it).  By contrast, Amazon offers a wide selection of movies and games for Prime members at no additional charge.  As soon as you plug the device in you can access millions of hours of free content as well as the option to purchase additional titles.  Amazon will even pre-configure it for your account before they ship it.I recommend buying this even if you have streaming capabilities in your PlayStation, Chromecast or Roku.My only complaint is that I find the user interface to be confusing.  It is difficult to browse through content beyond the 10 most popular titles in a category.", "verified": true, "helpfulness": "0/0", "author": "Steve Keifer"}, {"rating": 4.0, "review": "Just what I was looking for. Bye bye cable.", "verified": true, "helpfulness": "0/0", "author": "Bill Witherspoon"}, {"rating": 5.0, "review": "Best mini player I have used to date...setup easy, playback easy,  The unit is responsive and have had zero issue streaming any type of content.  A+ Amazon!", "verified": true, "helpfulness": "0/0", "author": "robistro"}, {"rating": 5.0, "review": "So far we love the Amazon fire...We joined the Prime to watch some of the movie content that they have for free...", "verified": true, "helpfulness": "0/0", "author": "Just a Guy \"Tech-guy\""}, {"rating": 3.0, "review": "We were very surprised when tv series on basic cable channels are pay per episode.  Some of these episodes are older.  Wasn't expecting that!", "verified": true, "helpfulness": "0/0", "author": "Sally Terpilowski"}, {"rating": 5.0, "review": "So very excited to receive our Amazon Fire TV!  I've wanted it since the beginning, and bought last week when it was on sale.  Setup was incredibly easy and the voice remote understood us immediately!  Our Amazon Prime membership is totally worth the cost with the free TV, Movies and Music and now we can access it all so easily with our Fire TV.We've bought 3 different smart BluRay players, and for some reason they haven't provided access to Amazon.  Thanks, Fire TV, for solving that problem too.", "verified": true, "helpfulness": "0/0", "author": "Mom of Three"}, {"rating": 2.0, "review": "It requires a strong wifi signal to load programs without possibility of outside amplifying antenna", "verified": true, "helpfulness": "0/1", "author": "Michael W."}, {"rating": 5.0, "review": "We love all of our Fire products.  Took a little bit to figure out how to stream some off of some things but it works with just about everything we want it to work with.  Would suggest this over Roku or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "J. Hess"}, {"rating": 5.0, "review": "I really like it. So easy to use and it really does \"listen\" to me! I'm from the stoneage and I actually had it hooked up in less than 5 minutes!", "verified": true, "helpfulness": "0/0", "author": "Shopper"}, {"rating": 4.0, "review": "I want to kick my cable in the teeth.  So I've read the reviews and all the verified consumers have nothing but good things to say about Fire TV.  So I want to take a chance however I am on a limited budget (who isn't these days) and needed to know if I had to have separate Internet service or if the Fire TV came pretty connected to the Internet Help I have to do this quick because I am going to go broke paying for Data with Verizon", "verified": false, "helpfulness": "0/0", "author": "Javana Goodman"}]