[{"rating": 3.0, "review": "I was looking for something to replace my boxful of rokus, apple tvs, chrome tv and other failed vessels of hope for my on demand dreams. Alas, for now, this ones only advantage that I can see is the voice recognition, but it only works for AMAZON products. Which I hardly ever use, because we hardly rent, and I don't find the prime selection compelling. On a chat with a rep I was assured that they were developing the software update so that the VR could work on the other apps, (Netflix is specifically what I need, like the rest of the world), so we'll see. I'll keep it in case that's true and because I just bought an extra small TV for my office with which I can use the Apple TV that I replaced the Fire on the big TV with. For now it's 3 stars because of this premature, in my opinion, release, and that there is no mention of the omission of the the VR in the other apps in the description. Oh! And if you are IN Netflix and attempt a voice search for say, oh, I don't know, \"House of Cards\", (free on Netflix) it will FLIP YOU BACK TO Amazon and let you purchase or rent episodes. Nice try, but no thanks!", "verified": true, "helpfulness": "1/1", "author": "K Vaughn"}, {"rating": 3.0, "review": "Overall the experience with Fire TV is simple and does what it says.  I haven't tried gaming but the streaming video experience is top notch and fast.  The picture quality from Amazon HD is better than I imagined.My biggest issue is with surround sound.  My current receiver does not support DD+ and FTV doesn't support the long standing standard of DTS.  So no surround for me until I replace my receiver.  I also stream a lot locally so Plex was good to have day-one.  But Plex needs some work still and I'm not sure if it is Plex or FTV that prevents video from direct streaming bit nearly everything has to be transcoded.  I do not see this is on other devices I run Plex on.So 3 stars until something is done about DTS.  I may even have to consider another solution if something isn't done in the next 27 days.", "verified": true, "helpfulness": "3/3", "author": "S. Guagliardo"}, {"rating": 4.0, "review": "Missed the out of box experience without an HDMI cable. Looking forward to more apps soon. How about Amazon Music?", "verified": true, "helpfulness": "0/0", "author": "Dane Roberts"}, {"rating": 5.0, "review": "Connected it to my bedroom tv.  Beautiful picture and easy to use.Easy to set up and use apps.  Netflix actually works more seamlessly than on my smart tv that came with it.", "verified": true, "helpfulness": "0/0", "author": "Sandra Ice"}, {"rating": 5.0, "review": "my son is 9 and loves it..says its the best  100 bucks i ever spent....pretty easy to navigate...definitely better than Chromecast", "verified": true, "helpfulness": "0/0", "author": "kim johansen"}, {"rating": 3.0, "review": "Voice SearchPro: Voice command makes it easy to find programsCon: It only finds programs on Amazon (often for a charge) even if they are available Netflix, Hulu, etc. (without additional charge)Con: Using services like Netflix still requires you to cursor through an onscreen keyboard matrix to type in search requests. Grrr!ProgrammingPro: Major services like Netflix and Hulu are thereCon: Other services are downloaded apps with no better interface available on other devices like Roku or many Smart TVsCon: Roku and my LG Smart TV have more services available... at least for nowGamingPro: Many of the games you like on your phone or tablet are available as appsPro: You can play most with the included controller, or purchase the game controller for greater control and more gamesCon: While many of these games are popular they are not the same caliber as games on PS4 or XBox OnePricePro: $99 is relatively painlessCon: Roku has more streaming services at a lower starting priceOBEPro: Out of the box it was already set up for my Amazon Prime accountCon: It took 5 minutes or more to download the required software update before startingCon: All other services' apps had to be downloaded, even the most popular services like NetflixSumming UpConsidering the voice search is the primary differentiating feature it was disappointing to find it only worked for Amazon content. I hoped Amazon had worked with Netflix and others to extend the voice search to those services, but that was not the case.  And, considering the price for watching popular programs like Breaking Bad or Game of Thrones through Amazon's service it is hard to justify Amazon not making the price of the Fire TV device more competitive like Chomecast and the newest Roku.In short, I was disappointed.  I'm sending it back and will stick to my Roku on my bedroom TV and in the den my LG Smart TV's streaming capabilities.", "verified": true, "helpfulness": "3/3", "author": "Charles W. Mitchell \"Church Techie\""}, {"rating": 5.0, "review": "Just purchased this device and am extremely satisfied in every way!!!Fast, high quality, easy to set up and use! Voice search is fantastic!!!No more buffering and loading!!!", "verified": true, "helpfulness": "0/0", "author": "SJV"}, {"rating": 4.0, "review": "Pros:FastEasy to useEasy to setupCons:Need more supported apps and contentI'm waiting to see how much Amazon FreeTime will be.  It should be a free content rating and safety control system for kids.  I'll update my post then.", "verified": true, "helpfulness": "1/1", "author": "Wes Palmer"}, {"rating": 5.0, "review": "The best set top box I've owned so far.  I've tried Apple TV, Chromecast, Google TV and Roku.  The voice search feature works as advertised.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Amazon fire tv is a great buy, it has all of the movies that I love to watch. I wish it had more games to choose from,I am a video gamer, I bought fire tv mainly for my gaming fixation..But I love everything about Amazon Fire TV, it gives those other streaming boxes a run for their money.", "verified": true, "helpfulness": "1/1", "author": "William Morgan"}]