[{"rating": 5.0, "review": "Love it so far, got our fire box a few weeks ago and its crazy fast, reliable, and EASY.", "verified": true, "helpfulness": "0/0", "author": "User"}, {"rating": 5.0, "review": "I just wish it had an on/off button", "verified": true, "helpfulness": "0/0", "author": "Val"}, {"rating": 5.0, "review": "Just like new. Can't tell the difference", "verified": true, "helpfulness": "0/0", "author": "angela yan"}, {"rating": 5.0, "review": "great streamer", "verified": true, "helpfulness": "0/0", "author": "Everett"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Kristian Balog"}, {"rating": 4.0, "review": "Good option for watching tv, though it would be nice if more shows were free.", "verified": true, "helpfulness": "0/0", "author": "Mike Shnaidman"}, {"rating": 5.0, "review": "Still adapting to the product, I watch one movie so far. Excellent picture and sound and looking forward to watching more and utilizing the other features provided.", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 5.0, "review": "Great product. A lot better than Apple TV etc.", "verified": true, "helpfulness": "0/0", "author": "Ian Anderson"}, {"rating": 4.0, "review": "The fire tv works great. The only disappointment is that hbo go doesn't work with comcast.", "verified": true, "helpfulness": "0/0", "author": "ben welker"}, {"rating": 5.0, "review": "So far we are pretty happy with it. Set up is a piece of cake. We have been prime members for years, so this was the next step. I'm a little unhappy with some of the selections. I had thought almost everything would be free to prime members, but this is just not the case. Over all its pretty good. The game selection really needs improvement, but I am sure if this takes off, it will improve.If you are contemplating buying this...go for it. We had thought about Apple TV, as I am a huge Apple fan. The specs on this box just blew them out of the water. Extremely fast response time when going thru the menu. Absolutely no lagging when watching movies or playing games. Definitely worth the price.", "verified": true, "helpfulness": "0/0", "author": "Daddy"}]