[{"rating": 5.0, "review": "This is the absolute best Xmas present ever", "verified": true, "helpfulness": "0/0", "author": "gale"}, {"rating": 4.0, "review": "First time I have used a product of this type. Works well enough that I have elliminated cable.", "verified": true, "helpfulness": "0/0", "author": "M Lovett"}, {"rating": 5.0, "review": "TV fire was very easy to install only took 15 minutes for the entire process.I love have been watching movies and listening to music everyday,", "verified": true, "helpfulness": "0/0", "author": "Debby Rijos"}, {"rating": 2.0, "review": "had to return it.. Would constantly rebuff Netflix videos and get stuck at 25% or 99%. Prime videos would work ok but there were way too many issues with Netflix. My Xbox 360 connected to the wifi perfectly and streamed without issues.. Not the case with this fire tv. I was really hoping to get my dad started on house of cards too...", "verified": true, "helpfulness": "0/0", "author": "Wardenbeats"}, {"rating": 5.0, "review": "So easy to set up. I'm Very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "PattyKay"}, {"rating": 5.0, "review": "Enjoy it very much", "verified": true, "helpfulness": "0/0", "author": "Susan K"}, {"rating": 5.0, "review": "Great product, very fast", "verified": true, "helpfulness": "0/0", "author": "Kelly Nelson"}, {"rating": 5.0, "review": "The Amazon Fire TV is really cool. Very easy set up. The possible of what to watch are endless.", "verified": true, "helpfulness": "0/0", "author": "Brittney"}, {"rating": 1.0, "review": "I bought this device specifically to stream Netflix.  Almost everything I stream skips horribly - programs are not watchable.  Unfortunately, I waited too long - hoping the problem would correct itself - but no, it didnt, and now I am passed the point of no return :(", "verified": true, "helpfulness": "1/3", "author": "reader"}, {"rating": 5.0, "review": "I love amazon fire tv, you're able to watch tv episodes from you favorite shows. In addition, some great movies. Then add you favorite music and you're great!!", "verified": true, "helpfulness": "0/0", "author": "Mita228"}]