[{"rating": 5.0, "review": "Excellent. Best TV ever. Will never go back to cable again.", "verified": true, "helpfulness": "0/0", "author": "Christine J. Schmidt"}, {"rating": 5.0, "review": "I never thought I'd enjoy anything like this as much as I do...hard to imagine how I'd do without it now. Only thing is I'm turning into a couch potato!", "verified": true, "helpfulness": "0/0", "author": "S. Wendt \"daily walker\""}, {"rating": 4.0, "review": "Like it a ton.  Kind of difficult to install if you're not a geek though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Netflix and youtube were the first app I installed. Had to restart fire TV box to see them working. Every now and then Netflix streaming seem to have a problem. Did not face this with roku at all.", "verified": true, "helpfulness": "1/1", "author": "AmazonUser"}, {"rating": 4.0, "review": "Works better than the Fire Stick, but get's hung up periodically.  Need to unplug and restart.", "verified": true, "helpfulness": "0/0", "author": "John McCarthy Jr."}, {"rating": 5.0, "review": "Easy, easy set up and when you combine it with Amazom Prime it is a phenomal device.", "verified": true, "helpfulness": "0/0", "author": "Stephen in Dallas"}, {"rating": 4.0, "review": "It's faster but I have to re-boot it too often.", "verified": true, "helpfulness": "0/0", "author": "Mitchell Mensch"}, {"rating": 3.0, "review": "It's alright, but I've gotten so used to the Roku that I think I like Roku more.", "verified": true, "helpfulness": "1/1", "author": "JDB"}, {"rating": 1.0, "review": "I purchased this primarily to receive Hulu services better than a Wii.  It appears to be much worse, with no feedback from Amazon or Hulu on when or if this issue will be resolved.", "verified": true, "helpfulness": "2/3", "author": "Jerry"}, {"rating": 5.0, "review": "It always has a clear picture. It's easy to use and has been a great replacement for cable.", "verified": true, "helpfulness": "0/0", "author": "TWS \"I'm a writer and I love books!\""}]