[{"rating": 5.0, "review": "Wow! Open the box... Plug it in & and boom it works. Easy set! When deleived it is already connected to your Amazon account if you have one so no set up required! The Apple app is amazing for this. The lay out is great and user friendly. I am a apple person but this Amazon product blows everything out of the water. The app also has voice search which makes searching very easy. I would recommend with for anyone. must buy if you use Netflix. I never took full advantage either of all the Amazon tv shows and movies/music they offer and this little stick will help with all of that!", "verified": false, "helpfulness": "0/0", "author": "Zackery Noel"}, {"rating": 5.0, "review": "The device is very small, taking up little space, but don't let the size fool you. Not only is it loaded with easy to use inovative features, but the the units price is very low. After using for a couple weeks, Amazon Fire surely gives the most bang for the buck! I am much more than just satisfied withmy purchase.", "verified": true, "helpfulness": "0/0", "author": "James J. Borowy"}, {"rating": 1.0, "review": "This product is TERRIBLE!!  I had such high hopes - it arrived in beautiful packaging (very Apple) we plugged it in and LOVED the user experience.  Very easy navigation, beautiful screens and displays.  Unfortunately, the streaming quality is terrible!  It buffers every 30-45 seconds.  It locks up, it restarts, the image locks up but the audio keeps playing!  It is really bad.  We have had several Roku's and still have one plugged into the TV that we used as the backup to Amazon Fire.  Roku continued to work perfectly!  We have very fast internet speeds and do not have any issues streaming on our laptops, iPads or through Roku.  If you are looking for a FAST, reliable streaming device...this is NOT it.  I was very disappointed because I LOVE Amazon and I wanted this product to be as great as everything else Amazon does.", "verified": true, "helpfulness": "1/3", "author": "Joel Breeggemann"}, {"rating": 5.0, "review": "Great selection of shows and apps", "verified": true, "helpfulness": "0/0", "author": "Kenneth D Dawson"}, {"rating": 5.0, "review": "I absolutely love it.  I bought the attachment to go on the back of the TV for it to slide into so that it is out of the way.  I was totally surprised at how easy it is to use.", "verified": true, "helpfulness": "0/0", "author": "Patricia R Pianalto"}, {"rating": 5.0, "review": "I  just cut my cable cord. Saving $240 per month now. I would love to see all the cable companys fall apart. There needs to be a major disruption in the cable business soon. I hope AMZN and GOOGLE and APPLE take all the business away from the huge corrupt monopolized cable companies.", "verified": true, "helpfulness": "1/1", "author": "streetname"}, {"rating": 5.0, "review": "The Fire TV exceeded my expectations.  The whole family really enjoys watching the Prime video content as well as Netflix from the same box.  The box is very responsive and has the bonus of running apps.", "verified": true, "helpfulness": "1/1", "author": "Mark Powers"}, {"rating": 5.0, "review": "Best purchase thus far!", "verified": true, "helpfulness": "1/1", "author": "Stephanie Pereira"}, {"rating": 5.0, "review": "I love it what a wonderful product.", "verified": true, "helpfulness": "0/0", "author": "monee michelle maupin"}, {"rating": 5.0, "review": "As Advertised", "verified": true, "helpfulness": "0/0", "author": "David"}]