[{"rating": 2.0, "review": "If you use you want the best device for streaming video; DON'T get Amazon Fire. The voice search is a feature I thought would like;the problem is that it only searches Amazon TV , not any other stations/Apps you may have like a ROKU.You may find what you want on Amazon however you may find the same program or movie on Netflix or Hulu included with subscription.I thought I was upgrading because my ROKU wasn't HD I just assumed Amazon would have about the same content available; they don't.I'm returning the one I got", "verified": true, "helpfulness": "2/6", "author": "John"}, {"rating": 5.0, "review": "I purchased mine at Best Buy.  I love my Amazon Fire TV with just a few exceptions.  First, where is Prime Music?  Amazon, come on!  Why do you not have an Amazon branded service on an Amazon branded device?  Let me guess.  DRM?  Anyhow, I was really bummed when I fired up my Fire TV and it wasn't there.  Second, I don't care for how it shows apps in the cloud or that have been uninstalled right along with the installed apps.  It is confusing and results in a cluttered interface.  I would prefer not to see apps in the cloud in my recent or popular sections.  Third, the selection of games is still dismal.  I know that there is the vague promise of 1000's more on their way at some unnamed point in the future, but right here right now, the choices are pretty thin.  Consequently, there is little incentive to buy the controller at this point in time.  I suppose that is it for my dislikes.  Otherwise, the device loads video fast.  The voice search is convenient, but of limited functionality at this time as it only works with Amazon Video On Demand.  I love the pictures when the device is not used for a short period of time, but before it goes to sleep.  I really, really love that it displays the lyrics to some songs when playing music!Update:Okay, I have Prime Music now and many more games.  Now I simply love my Fire TV.  The UI is still confusing, but you get used to it.  The only other thing I would want is universal voice search, otherwise I am very, very satisfied with my purchase.", "verified": true, "helpfulness": "1/1", "author": "Jme1971"}, {"rating": 3.0, "review": "Don't ya just love it when -- a comparison chart somehow does not include a major feature in a competitor's product but not their own.Dear Amazon, where is the \"Remote with Headphone Jack\" category on your comparison chart?  This is the most beloved feature on my ROKU 3.  I would be unlikely to buy another device that is missing this feature.Disclaimer: Obviously I have not tried the Fire TV.  However, I am a big Amazon fan in general - amazing customer support.  I wrote this 'review' to strongly encourage Amazon to include this feature on their next Fire TV/remote.  So, 3 Stars for what is probably a great recipe but missing a key ingredient.", "verified": false, "helpfulness": "0/7", "author": "Cagayan \"Cold in Ohio\""}, {"rating": 5.0, "review": "I really like the fire tv. It has allowed me to lower my cable package and I still have more to watch now. Being a prime member makes this even better. I like it", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Really fast, the speech search is great.  There are some apps and channels that FireTV doesn't have compared to Roku- but it's an Android OS and I know that's the way all of these things are going.", "verified": true, "helpfulness": "1/1", "author": "Scott G"}, {"rating": 5.0, "review": "June 20, 2015:  I've raised my rating for the Amazon Fire TV for the following reasons:1.  The box is the heaviest in my set-top line-up, which includes Roku and Apple TV.  Why is that important? Besides that turbo-charged circuitry, the box has enough heft to stay in place while the others fall of my dresser each time I walk past the TV.2.  The box is the most efficient, pulling up a movie, television series, youtube video 33% faster than the other two boxes.3.  I've finally gotten the hang of the voice recognition system.  It's fast, accurate--and addictive!  As fast as I can say Gene Autrey or Roy Rogers, Champion or Trigger gallops into view with a movie starring either of my favorite cowboys.Original review:The entry-level ROKU, frequently discounted to $40, may be made of lightweight materials, but it's one of the the most user-friendly, versatile, dependable set-top boxes on the market.  Its only serious limitation concerns the access to Youtube videos--at which the Fire is better, but not by a large margin.  For some reason, Fire limits your viewing to a select list of popular videos, whereas Apple TV (when used with AirPlay) is as flexible as the Youtube app on your iPhone or iPod.  So for $140 the ROKU plus Apple TV are your complete ticket to the broadest array of entertainment, music, and documentary materials available from pay services like Netflix, iTunes, and Amazon Prime as well as public-domain and personal media materials.The Fire TV is well constructed (the largest and heaviest box of the 4 tested), offers an attractive display, and has a \"solid-feel\" remote superior to that of the ROKU or the chewing-gum stick-sized Apple TV remote.  But accessing many Youtube videos and personal items, such as those contained in an Apple or Amazon cloud, comes with a steeper learning curve than the Apple device requires.Google's ChromeCast has little to offer except media materials accessed through a Chrome browser (which I don't use) and Netflix videos (often shakily formatted).  Even though the device is touted as a \"space-saver\" and \"cord reducer,\" it requires not 2 connections but three: the device itself slips into an HDMI port on the back of your TV; one cable extends from the device to an AC (electrical) outlet; a 2nd cable extends from the device to a USB connection (which my Sony TV doesn't have).  The absence of a remote control might be viewed as a plus by anyone who has misplaced theirs too often.  Still I would rather see a rechargeable remote with an onboard micro receiver and transmitter, enabling the user to lose two cables' worth of clutter.Note to all manufacturers of these boxes: Why can't you include a simple, universal (and if not, programmable) \"input\" button? Each time I go to the box, I have to hunt for the TV remote that changes the input setting from regular TV signals to the ones from the box.  Adding that button to the remote would be more appreciated, at least by one user, than being able to \"talk to\" his remote switch.  The latter is all about novelty; not practicality.", "verified": true, "helpfulness": "4/6", "author": "Caponsacchi"}, {"rating": 2.0, "review": "I'm not impressed.  One of the reasons I bought it was due to the processing power, and the hopes that my Netflix experience would be much better.  However, the Fire TV does not deliver.  The Netflix app fails most of the time, and when it does work, it's in constant buffer mode, and the internet connection frequently drops off.  Movies on Prime on the other hand, never seem to have a problem with connectivity, and Prime movies play nearly 100% with zero buffer issues.  I'm also disappointed that Amazon doesn't have an agreement with Comcast cable, so apps like Showtime Anywhere won't work because I can't login to my subscription.  It is both annoying and disappointing, considering I can use both Netflix and Showtime Anywhere on my laptop and other devices without issue, but not with the Fire TV.", "verified": true, "helpfulness": "4/8", "author": "Jeffery M Stauffer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "1/3", "author": "cjc3041"}, {"rating": 4.0, "review": "Overall this is great product. I love how fast it works and I've talked about replacing our PS3 for streaming with this instead. It's easy to use and install and does provide access to apps and streaming very well.I do think it has some kinks though. We've had it about 4 months now and though it usually does ok it for some reason will randomly have the screen go blank when we're watch Hulu Plus. I'm not sure if this is an issue with Hulu or the Amazon TV, but it doesn't happen on any other device so.....maybe the Amazon TV.Also, the fact that you have to unplug it to turn it completely off is annoying, if I'm not using something I don't want to be paying for energy to run it. I've also noticed that I can't pause a show on my Amazon TV and pick it up later on my Kindle, it simply won't work. I have to exit out of the show completely on the Amazon TV first, that's not a HUGE deal and sounds simple but many times I get distracted by my kids in the moment and forget it's paused and not exited, then when I get to the gym I can't finish watching whatever it was. I called and support told me that's just how it is, but given that I like having Amazon products because of the ease of using the same info on all devices that doesn't make any sense.Volume seems to vary some between apps/shows which is annoying, but not a major issue.The last \"hiccup\" as I'd call it is that you have to clear the data cache for apps sometimes to get them to run. It's also not too hard to do, but it's not really highlighted in the instructions so that's another issue we had to call and wait to talk to support to figure out. I think we probably are the frontline users as we bought one soon after it came out, so we had the joy of discovering all this stuff.Tips for future development Amazon- figure out how to make the voice search usable over all apps, allow us to turn it off completely when not in use with the remote, and fix the cross over of data between devices please!! I do like it though. Worth the money we spent on it.", "verified": true, "helpfulness": "1/2", "author": "Laura Condry"}, {"rating": 5.0, "review": "I'm no techie and found the concept of getting rid of cable to be a little scary.  I just want to turn my tv on and have it work, for the most part, and I don't have a lot of time to fiddle with connections or figuring out technology.  This is very user-friendly.  You essentially plug in the power and then connect the HDMI cord.  You then have access to prime, netflix, and other services.  I have enjoyed it so much that I'm getting rid of cable as soon as my contract ends.  Cutting the cord finally!", "verified": true, "helpfulness": "1/1", "author": "Grace"}]