[{"rating": 5.0, "review": "Got this for my Dad. He loves it! I let him set it up by himself. He was surprised at how easy it was to setup and configure. Within minutes he was watching Amamzon Prime Video. I was impressed at the ease of setup also. The voice recognition is great! Quality of materials and the software are well done.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Better and cheaper than cable!", "verified": true, "helpfulness": "0/0", "author": "Wflores"}, {"rating": 5.0, "review": "So far I absolutely love this thing, it is so easy to set up, use and sits anywhere because it is so small. What a great buy and you would never know it was refurbished, it looks and was packed like a new one", "verified": true, "helpfulness": "0/0", "author": "joseph laroue"}, {"rating": 5.0, "review": "great love it", "verified": true, "helpfulness": "0/0", "author": "steve skaggs"}, {"rating": 5.0, "review": "Use it every day, usually for free older movies. Wish they had more free stuff, but it's still good enough for every day use.", "verified": true, "helpfulness": "0/0", "author": "Joe H"}, {"rating": 5.0, "review": "Great purchase. I use it on a tv in my garage that has no cable hookup. No wires to get trip over and really easy to hook up and use.", "verified": true, "helpfulness": "0/0", "author": "DKT35"}, {"rating": 3.0, "review": "The TV meet expectations and more. The issues I encountered were availability of the TV being in stock and the carrier situation that further delayed my TV.", "verified": true, "helpfulness": "0/0", "author": "me"}, {"rating": 5.0, "review": "The Fire TV and Amazon Prime offerings are just what I was after as an alternative to DTV. I think video games and watching sports are colossal wastes of time, but I do enjoy movies, dramas, comedy’s and sometimes special effects shows if well done. There are lots of no cost/ low cost offerings. I haven't signed up for Netflix yet as the prime offerings are plenty for the foreseeable future.  The Fire TV itself works as advertised. The picture quality is as high as it gets. The voice feature I initially though of as a useful gimmick, is actually very helpful in getting right to the title you want and it is fast. So often I purchase things based on hyped up marketing, only to be disappointed at the actual product. So far this one hasn't followed that mold.", "verified": true, "helpfulness": "0/0", "author": "C. Henderson"}, {"rating": 3.0, "review": "i don't fully use all of the options as i do not subscribe to prime.  you would need to be a prime subscriber to get all the benefits of this unit.", "verified": true, "helpfulness": "0/0", "author": "Ray Hicks"}, {"rating": 5.0, "review": "I do love  Amazon Fire TV.  I have not had it long, but have enjoyed tremendously, watching the old classic, The Philadelphia Story.  The best surprise, however is the ability to watch \"my music\"  through my hi-fi system", "verified": true, "helpfulness": "0/0", "author": "Dr. Muriel Kowlessar"}]