[{"rating": 5.0, "review": "My new gadget!", "verified": true, "helpfulness": "0/0", "author": "Brian Funes"}, {"rating": 4.0, "review": "Somewhat disappointed in the fire. Works great but so many of the programs I would like to watch carry a $2.99 price tag per episode. This includes many old tv series. And hulu plus is a joke.  You cannot watch a program with out the picture freezing but the sound continues. They need to fix this flaw.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Content it great, easy to set up.  I find the sound quality annoying...sound rises and falls to unacceptable levels and I must adjust it constantly to hear the dialog in movies and then the background soundtracks are so loud they will blast you out of the room.  Therealso needs to be a written instruction manual.  It is a pain to keep switching back and forth to the appropriate section of the menu to look up what you want and then try to remember what it said while trying to apply the instructions.", "verified": true, "helpfulness": "0/0", "author": "Colleen M Koniszewski"}, {"rating": 5.0, "review": "Very fast", "verified": true, "helpfulness": "0/0", "author": "Dave Brinkhus"}, {"rating": 4.0, "review": "Only thing I would change is get more current free movies on Prime.  Choices for free movies are not that great.", "verified": true, "helpfulness": "0/0", "author": "Janice Stroman"}, {"rating": 5.0, "review": "This little box is amazing, I didn't realize (I'm a senior citizen not into electronics) I could get the \"old\" music from Pandora, love Netflix, when my daughters sister-in-law came and hooked it up for me, I couldn't hug her or tell her  thank you enough, its great and looking forward to seeing how to use some of the other benefits from it, like games. So thank you so much will for sure recommend this to my friends.", "verified": true, "helpfulness": "0/0", "author": "michelle"}, {"rating": 2.0, "review": "Hulu Plus skipped and froze. We have fast internet and had no issues streaming Hulu Plus on our PS3. We tried different things per Amazon's instructions and it would work for a day, maybe two but then start skipping again. Loved the look and feel of the menu and would have LOVED it had it not been for the issues with Hulu Plus.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "Love this, especially the mirroring with my  kindle. The only two things I would  upgrade are the media storage capacity and an easier way to switch to this device. Right now I have to go to my television settings and change my input to HDTV. It would be nice to change it to a channel like the old Cd/vcr players  and let it work vs changing the setup each time. Maybe there is a way and I just have not figured it out it. So far I love, but am still playing around with it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Krikat\""}, {"rating": 4.0, "review": "Easier for kids  to use than the chromecast, but also not as powerful when casting your screen.", "verified": true, "helpfulness": "0/0", "author": "Jerremy Barker"}, {"rating": 5.0, "review": "Item was easy to hook up since we already had apple tv. We just changed out cords. But Amazon fire TV is easier to use and actually connects to Amazon, which apple TV did not. Love voice command. It actually works.", "verified": true, "helpfulness": "0/0", "author": "julia p bailey"}]