[{"rating": 3.0, "review": "One Major Flaw in Parental Controls:  There's no way to set a rating level, like \"Teen (PG-13, TV-14)\" and allow you to stream amazon videos without a pin (as long as the rating level is at or below the level you set).  Ironically, this is available if you use a third-party device (iPad, phone, or smart TV), but not available when you use Fire TV (Amazon's own device).On the Amazon web site, you can set viewing restrictions and select each third-party device (including a web browser) that you want these restrictions to apply to.  However, you are told that this is not available for Fire TV.  You must set the restrictions on the Fire TV box itself.  But the Fire TV only has an all-or-nothing approach to video restrictions.  You can set a pin, but no age-based rating restriction.  So, once you've set the pin, you have to enter it every time you try to start a video (TV episode or movie), even if it's rated G.  This is a huge pain!  I've searched and searched and cannot find a way to set a rating level.  Wow! This is extremely surprising.  If somehow I've missed this, I wish Amazon would reply and explain how it can be done.  I've updated to the latest firmware version 51.1.3.0 and there's no way I can see to do this.", "verified": true, "helpfulness": "1/2", "author": "Susan Jorgensen"}, {"rating": 4.0, "review": "It's almost perfect. It's easy to set up, plug and play easy!Search function works great and is starting to detect videos that are available for free within other applications. (with the newer firmware updates).The main thing FireTV is missing is external USB support, and since they locked the bootloader, it's broken root support as well. Apart from that, I wish they would add screen cast from Android or Windows (apart from Kindle).But if you are not looking to change it's UI, sideload apps (don't appear anywhere but in Application Manager) or root it, then FireTV is the way to go.", "verified": true, "helpfulness": "0/1", "author": "Ankit"}, {"rating": 5.0, "review": "it works very fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mike Jahed"}, {"rating": 3.0, "review": "it freezes up when viewing non Prime features", "verified": true, "helpfulness": "0/0", "author": "THURSTON HUNT"}, {"rating": 5.0, "review": "I have used several Roku devices including the Roku 3 for Amazon Prime over the past two years. They have worked well but all had a problem connecting to the internet and receiving the Dolby 5.1 signal which often faded in and out reverting to a PCM stereo sound signal.I installed the Amazon fireTV. It took a little time to download the latest updates and set up completely, but I have found it far superior to all my Roku devices. The connection to the internet is better and appears more stable. The picture is very clear and the sound which plays Dolby D+ 5.1 is excellent and constant for the several movies I have watched. I am pleased with this system and it is well worth the $99 cost.", "verified": true, "helpfulness": "0/0", "author": "P. Cleu \"thertrv\""}, {"rating": 3.0, "review": "Have no idea how to use it. Should have  very clear easy directions. Has been sitting since I got it", "verified": true, "helpfulness": "0/3", "author": "gerrybog \"family fan\""}, {"rating": 5.0, "review": "What a device, it is unbelievable. Love it!", "verified": true, "helpfulness": "0/0", "author": "Esteban Pruneda \"Say something about yourself!\""}, {"rating": 5.0, "review": "So far so good, it's small and compact which I like. Ready to go out of the box and links to your prime account right away.", "verified": true, "helpfulness": "0/0", "author": "sradja"}, {"rating": 4.0, "review": "This is a great device, Amazon has done a very nice job with it. The Fire TV has a speedy processor and the interface is very nice and easy to navigate. Basically does everything well. Videos load in an instant, (no buffering AT ALL) and the quality is fantastic.The Fire TV connects to your Wi-Fi right away and sets up in seconds. One very nice feature is the voice search on the remote which is connected via bluetooth. Amazon has a nice selection of channels & apps, and the integration with amazon prime is really cool. It can be the ultimate cord cutter, but when compared to the Roku 3, it falls short in a couple of ways....(this is just for comparison purposes, since I own both devices)First and foremost, (and this a dealbreaker for me personally) is that it has NO DLNA support...Meaning you can't watch your own digital library of videos, Unless you connect it directly to the USB input of the Fire TV. It also means you cannot use PLEX or other streaming software via your home computer or laptop. I personally have an external hard drive connected to my Router (which is DLNA compliant- most are) and I stream my entire digital library on all my devices, including my TV via my Roku 3's native media player. With the Amazon Fire, you can't do that. In fact, I couldn't even find a native media player for it. I'm sure Amazon will eventually fix this via a software update in the future, but for now, no DLNA support.Secondly, the remote on the Roku 3 is much more responsive because its a Wi-Fi based, so you dont even have to be close to the device to control it. The Amazon Fire's remote is Bluetooth based which is cool but you have to be close to it and it just doesn't feel as responsive as the Roku's remote. Not such a big deal, because the Fire's remote still does work very well.Third... there are way more channels on Roku's channel store, especially given the fact that you can add over 100 different private channels. This is also not such a big deal, because lets face it...most of these channels are useless, but it's nice to know that they ARE available.If I had not already owned a Roku 3, and had not gotten spoiled by those extra nice features that I just mentioned, I would probably say that the Fire TV is perfect. (it's still a stunning device). Trust me, if you buy it...there will be no buyer's remorse, you'll love it. But if it's a toss up between the two,...go for the Roku 3.", "verified": true, "helpfulness": "3/4", "author": "D. Mendez \"DMBRAVEST\""}, {"rating": 1.0, "review": "What a waste of money. Worked great out of the box, but now every time I try to use it, it doesn't work right unless I restart it several times. Sometimes there is no sound at all, sometimes sound, but it can't access videos on Hulu or Netflix. I upgraded to this from a Roku that I've had for several years...never had this kind of problem. We have good internet connection...Comcast high speed....so what exactly is the problem here??", "verified": true, "helpfulness": "3/5", "author": "Michelle L Wilcox"}]