[{"rating": 1.0, "review": "I purchased the Fire TV as a media steamer... as advertised by Amazon.  For example, I had hoped to stream my recorded local broadcast television stations to it.  However, it is clear after a couple months of attempts and research on the internet that the device is only for Amazon-approved content. What a bunch of crock!I feel the same way as https://www.techdirt.com/articles/20141128/08291529271/amazon-fire-tv-firmware-update-bricks-rooted-devices-prevents-rollback-to-previous-firmware-versions.shtml : if I buy something, I should be able to use it however I see fit.If you already own content and are looking for a device to view it, look elsewhere! If I could, I would return in a heart beat.", "verified": true, "helpfulness": "2/5", "author": "Jacob Eisinger"}, {"rating": 1.0, "review": "Constantly buffering.  Prime movies are old.  It appears that I had spend $100 to receive your marketing device to promote and sell your other movies.", "verified": true, "helpfulness": "3/8", "author": "Richard Draper"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/1", "author": "G.Arnold"}, {"rating": 5.0, "review": "Love the Fire TV-- I have an older HD TV and this device gives me access to Prime, Netflix and all the other apps via my TV.  It was easy to set up and the Voice search is fun.  I noticed in another review that \"the unit stayed on all the time\" I found that if after using my Fire TV if I returned to HOME it turned off but if I stayed in an app it did stay on.  When I re connect to the Fire is comes on immediately. Just a thought for others concerned about the unit \"staying on\"", "verified": true, "helpfulness": "1/1", "author": "Sally A Arnold"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "pbj61"}, {"rating": 4.0, "review": "I like it so far.  I've been using for a week now. The remote should've few more buttons, no issues.", "verified": true, "helpfulness": "0/0", "author": "Sridhara Venkateshaiah"}, {"rating": 5.0, "review": "Even better than I expected", "verified": true, "helpfulness": "0/1", "author": "Gregory N. Stafford"}, {"rating": 5.0, "review": "I have purchased two of the items and am pleased so far with the product.  It's easy to set up and operate.  The voice search is especially nice.  In addition to prime (which is great) I use it as a central control for other apps such as Hulu plus and Netflix.  If I could view F1 and football games I wouldn't need cable at all.", "verified": true, "helpfulness": "0/0", "author": "Coconut the Critic"}, {"rating": 2.0, "review": "CAN NOT SEARCH BY PRIME ELIGIBLE. Frustrating. My bad - I read a number of reviews that said you could not search \"FREE\" or \"Prime\" included. I thought they did not know how to use it because I can search Prime only on laptop. YOU CAN NOT SEARCH PRIME ELIGIBLE OR FREE ONLY ON THIS. You always get a select menu on bottom of screen, Pay $____ or pay _____$ or see other ways to watch box. If you are a prime member you have to click other ways to watch to know if it is prime and most of the time your choice is NOT included with prime. I find myself using my laptop to search for Prime included choices then going to the Fire TV to search for one I know is Prime.There is a good thing, The screen saver pictures are beautiful.", "verified": true, "helpfulness": "1/5", "author": "Kenwood"}, {"rating": 5.0, "review": "Great box.  Very fast if you have good internet.  Very little buffering. Voice search really works.I noticed there were a lot of one star reviews, so I checked out many of them.I'd say about 70 percent of them are from people who thought all the movies would be free or had some other uninformed notion of how the box works. There are some really dumb reviews:  I had to use wires to hook it up, my TV only has one HDMI port, I can't get my cable channels on it.The only legit 1 star reviews seem to come from people with slow DSL.  Their download speeds are too slow for the unit.", "verified": true, "helpfulness": "0/0", "author": "Rossputin \"Mike A.\""}]