[{"rating": 1.0, "review": "Not all it's cracked up to be. If you don't have prime, everything costs money, and none of the aps work without you going through a ridiculous registration process, and or paying for things individually. The content that is free is impossible to find, and isn't worth watching when you do find it. Device has a USB port, but it's only for keyboards and game controllers. You cannot use a thumb drive or external hard drive to view your own pictures and videos, and listen to your own music. Aps are twitchy and lock up from time to time. I have had to unplug and plug the device in several times, because it froze. No DVR function either. Unless you go all in and pay for prime, Sling, Netflix, Hulu, HBOGo, and other services ($90 bucks a month or more total) you are better off sticking with Dish or Direct.", "verified": true, "helpfulness": "1/5", "author": "x71p"}, {"rating": 3.0, "review": "I am not fully satisfied because since I got Amazon Fire I only got half an hour of sound. After that the sound was gone. I've tried using all trouble shooting options suggested by Amazon,  none worked.I would love to hear from Amazon on how to fix this problem so  I can fully enjoy the device.", "verified": true, "helpfulness": "0/0", "author": "Gui"}, {"rating": 1.0, "review": "Eats a tons of data per movie.  Not for country folk !", "verified": true, "helpfulness": "0/2", "author": "Frank frolick"}, {"rating": 5.0, "review": "Way better than Apple TV and I am a huge Apple fan. It's just an overall great product. Love it!", "verified": true, "helpfulness": "0/0", "author": "Jules"}, {"rating": 4.0, "review": "I give it four stars only because I have tiny TV and I can't read anything on the screen.  But, if you don't have a tiny TV... you should buy this.", "verified": true, "helpfulness": "1/1", "author": "Laura"}, {"rating": 1.0, "review": "Worked for a grand total of 40 minutes. I was able to download HBOGO and finish watching an episode I had already started viewing on my Kindle. Good sound. Good picture. No problem. Then I tried to watch the next episode in that series. Sound went in and out. I hit pause to allow for buffering. It did not help. Soon there was no sound at all. Tried watching an Amazon Prime video. No sound and lots of red spots. Maybe it's a memory issue, I thought. So I plugged in the extra memory stick sold as an add-on. Got a screen warning that the memory stick was not supported. Then why was it sold as a suggested add-on?Then I got no sound and some red lines on the screen. Went through the troubleshooting video. Nothing about red dots or lines. Basic suggestion: Unplug it and plug it back in. Tried that. Now the Fire homepage has red dots, red lines, and blinks on and off. Another helpful suggestion from troubleshooting video - HDMI wire may be defective. Really? I bought it as a recommended add-on with my Amazon Fire TV unit.I am a teacher. I do not have a lot of spare time. I was looking forward to being able to enjoy some videos and music with this device. So far it's been a frustrating waste of time.", "verified": true, "helpfulness": "0/3", "author": "Elizabeth B. J. \"hazelnut_books\""}, {"rating": 2.0, "review": "Has no paper work and just sits there...have no clue how to use it...sheer disappointment!", "verified": true, "helpfulness": "0/2", "author": "Bobby A."}, {"rating": 1.0, "review": "Started off loving this thing, but little by little the forced ads are getting sleazier and sleazier.  First it started with slipping ads into the Amazon Prime content which I was paying for so I could watch it ad free.  Then ads even started showing up in TV Shows and movies I purchased out right.  If I have to watch ads no reason to pay for it.The final straw is that the episode lists for some TV shows now have fake episodes listed that are actually tricks to auto enroll you in other services.  ( See the picture.  Note that episode 13 is listed twice.)  If you click on that you will be auto enrolled in Hulu, and auto billed.  It will then be on you to go to Hulu your self and manually cancel the subscription you never wanted your self.  This is just sleazy.  This is a show that I already had access to on Amazon Prime.  It is ridiculous for me to be dragged to Hulu where I have to pay for it a second time, AND where I would have to watch it with even MORE ads.  The only one benefiting here is the money Amazon is clearly getting under the table to trick and screw over it's customers.I have thrown in the towel and gone back to AppleTV.RE-UPDATE:  There no longer seem to be ads at the start of Amazon Prime content, so that has at least improved.", "verified": true, "helpfulness": "19/21", "author": "Brian \"Another over opinionated mammal\""}, {"rating": 4.0, "review": "I liked it a lot.  There were a few programs that were unavailable.  My husband, however, wants the \"remote in hand\" to flip channels and watch a lot of useless sitcoms.  Therefore I had to return the Fire TV.  But if it was just me, I would be totally satisfied with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little box s amazing! I don't know what I did without it.The remote makes it so easy ,just ask and gives ityou...", "verified": true, "helpfulness": "0/0", "author": "D. Goosman \"Darlene Goosman\""}]