[{"rating": 4.0, "review": "Very pleased. Still learning all the features, but happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Dana Smith"}, {"rating": 4.0, "review": "I have not had much time but so far it is very goog.I really like the voice search.", "verified": true, "helpfulness": "0/0", "author": "Burl Moody"}, {"rating": 5.0, "review": "I first tried the Fire TV upstairs and my wi-fi signal was too weak.  Hooked it up to the downstairs TV and it worked flawlessly, no hassle whatsoever.  A real plug-and-play device.  If I can boost my wi-fi upstairs, I'll probably buy another.  Oh yes, superb packaging, as with other Amazon products I've purchased.", "verified": true, "helpfulness": "0/0", "author": "Hagen LeBray"}, {"rating": 5.0, "review": "I love my amazon fire tv", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 5.0, "review": "Fire TV Rocks", "verified": true, "helpfulness": "0/0", "author": "Brewstirs"}, {"rating": 5.0, "review": "Love it!! We would recommend this over any other!!", "verified": true, "helpfulness": "0/0", "author": "Susan M. Hack"}, {"rating": 5.0, "review": "The easiest piece of electronic equipment I have ever had to operate . My wife took a year to learn how to use a microwave we had the Fire TV for less than two weeks and she will not give me the remote.  it is that easy to use. Voice command is one of the nicest innovations. Also being able to look at my photographs on large screen through the cloud is spectacular to say the least.", "verified": true, "helpfulness": "0/0", "author": "Johng45"}, {"rating": 2.0, "review": "This is a great device for Amazon.com in that it helps them get you to pay for content. As far as being a device made to stream the content you may already have in your system storage it isn't very good and is poorly thought out from the standpoint of design. Why not make a device that can use the different video wrappers that are out there and have been out there for years. For pete's sake, it doesn't even recognize the original DVD wrapper TS_Video. Nor does it recognize .ISO files. If you want to watch your content encoded in those wrappers or anything but the newest of the new, you'll either have to transcode everything to MKV or use a really buggy adaptor software called Plex. It never worked here and it's GUI is terrible. Forget it. Get a WDTV Play which does everything without extra software that barely works anyway.What a waste of $100 is the Amazon Fire TV*", "verified": true, "helpfulness": "1/3", "author": "DEAN STRIEPEKE"}, {"rating": 5.0, "review": "Just hooked up the Fire TV a few days ago. It's surprisingly simple. I didn't even have to ask my son for help. :)  One thing to keep in mind. When they say the remote control battery back is difficult to get off, they are NOT kidding. Honestly, I thought something was wrong with mine. The fact that I was sick and not feeling well didn't help. It did finally come off though, and after that, everything worked perfectly. It's so easy to use and really convenient to have everything right there and awesome to be able to my favorite Amazon shows on the tele instead of the computer. The remote usage takes some getting used to, but I think that's true with any new system. So far, no complaints. I'll update as I get more familiar with it.", "verified": true, "helpfulness": "0/0", "author": "Christi Durden"}, {"rating": 5.0, "review": "Simple to set up and simple to use. It's ability to convey Amazon Prime content along with Netflix, Vimeo, etc. makes it vastly superior to cable for anyone with high-speed internet.", "verified": true, "helpfulness": "0/0", "author": "Randy Gibson"}]