[{"rating": 5.0, "review": "I love it. It's great and user friendly. The additional applications that can be done make it a great but and value!", "verified": true, "helpfulness": "0/0", "author": "Archie Demandante"}, {"rating": 5.0, "review": "Excellent  fast", "verified": true, "helpfulness": "0/0", "author": "GUIDO"}, {"rating": 3.0, "review": "There are many apps, but Watchup, which is what I would like to take advantage of, asks to start a new account.  I did, I put in my email address and  password, and the system accepted it.  When I went back in to sign in, the system repeatedly says my credentials are incorrect.  I did it at least seven times, and just gave up.  Who do you talk to about the problems you may have with some of the apps?", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "LOUIE VALLADARES"}, {"rating": 5.0, "review": "Thrilled beyond expectations. Took the place of my Apple TV. Once I get it all synced with my universal remote, I'll be happy.", "verified": true, "helpfulness": "0/0", "author": "P. Joiner \"PJ\""}, {"rating": 2.0, "review": "Keeps losing connection to Amazon, needs to be reset. Annoying.", "verified": true, "helpfulness": "0/1", "author": "Bob Leger"}, {"rating": 5.0, "review": "Installed very easily. Works like a gem.  It only gets seconds to get going with a movie or tv show.  After I watch I always take a few minutes to look at the shows recommended for amazon prime, and select some for my watch list.  When I bought this, I thought I might need a supplemental service to have enough movies available.  This has not been the case.  So far we have excellent movies to watch, for free, from amazon prime. We both are very pleased with fire tv.  The voice search is quick and works for things all ready in the system.  If a movie is not available, voice search does not recognize it.  No problem.", "verified": true, "helpfulness": "0/0", "author": "Pcola Joe"}, {"rating": 5.0, "review": "If u tired of paying for cable this box is it. It has a lot of games recent shows new movies u can purchase its a cool device no complaints", "verified": true, "helpfulness": "0/0", "author": "edna Skinner"}, {"rating": 2.0, "review": "Where as the idea is wonderful and I have been able to see several shows I cannot make it work correctly.  I have had several people try to get it set up correctly for me but do not yet have so that I can actually just sit down an watch a show.  I am sure that when I it set up correctly it will be fine but with hours of customer service calls.. and friends help iam still not not there.  More later", "verified": true, "helpfulness": "0/1", "author": "patsy wolf"}, {"rating": 5.0, "review": "I shouldn't have to comment to give it 5 stars", "verified": true, "helpfulness": "0/1", "author": "Carey Probst \"BMW Nut\""}]