[{"rating": 3.0, "review": "a lot of the apps don't work", "verified": true, "helpfulness": "0/1", "author": "lost 434 pictures"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "M. Gilbertson \"Nahnay\""}, {"rating": 5.0, "review": "Absolutely love this unit, sling tv looks great!", "verified": true, "helpfulness": "0/0", "author": "Gary A. Brooks \"Trsptfire\""}, {"rating": 4.0, "review": "I've had it for 4 weeks now. It's a good option. Viewing movies on a PC is OK but with Fire TV , I can watch on my larger TV.", "verified": true, "helpfulness": "1/1", "author": "Gary Cuthbertson \"Pop Pop\""}, {"rating": 5.0, "review": "I tried pretty much every streaming box.  I've had Chromecast, Roku streaming stick, Roku box 3, Matricom mx2 g-box.  The interface isn't the greatest looking, and the navigation interface and the remote aren't the most functionally built.  However the reception is amazing, and this device is lightning fast.  The ADB option is what separates this product from everyone else you push pretty much any android apk onto this box.  I browse with the chrome browser, use tons of android apps, and little to no buffering.  I ended up buying this product for my parents, my brother, and they love this device.  The content from the app store is still rolling out, but I would take this product over the Roku 3 any day.  This device has much more storage, and had better reception.  I'm a little disappointed they don't have a locational option where you can get local based content though.", "verified": true, "helpfulness": "2/2", "author": "kin137"}, {"rating": 5.0, "review": "Good!", "verified": true, "helpfulness": "0/0", "author": "jeffrey smith"}, {"rating": 5.0, "review": "A++++++", "verified": true, "helpfulness": "0/0", "author": "Noel"}, {"rating": 2.0, "review": "Usb port does not work", "verified": true, "helpfulness": "0/0", "author": "Brittany"}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "carlhall2"}, {"rating": 5.0, "review": "Love the voice command feature", "verified": true, "helpfulness": "0/0", "author": "narcisa"}]