[{"rating": 5.0, "review": "Love this, great alternative to cable and have been using Prime Music daily.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Porter"}, {"rating": 4.0, "review": "I really like this streaming box.  My only complaint with it are the lack of channels and its relatively expensive compared to other boxes - I have much more selection with my Roku.  But, in terms of streaming this beats the Roku hands down - its much faster and there's as lot less buffering during shows.  I live in a very rural area and my internet speeds are pretty slow so the ability of this to buffer and handle streaming without much lag time and stops in the middle is great!My solution to the lack of additional channels is to use my Roku for the channels like Warner Archives and Acorn that I subscribe to and use the Fire TV for watching Netflix and Amazon Instant Videos.  Not perfect but a workable solution.", "verified": true, "helpfulness": "1/1", "author": "Stella LaRue \"kellygirl\""}, {"rating": 5.0, "review": "Very cool toy.", "verified": true, "helpfulness": "0/0", "author": "Gregory Parker"}, {"rating": 5.0, "review": "Great Product, we use ours in the bedroom.", "verified": true, "helpfulness": "0/0", "author": "michael v. gulas"}, {"rating": 5.0, "review": "The Amazon Fire TV is way by far the best out, i actually stop using my Apple TV after I used the Amazon fire TV after the first day", "verified": true, "helpfulness": "0/0", "author": "keith moore"}, {"rating": 5.0, "review": "for 99 bucks, one of the best purchases i have ever made.  add in another 99 buccks for a year's  worth of prime access, it's still a huge bargain.  we have some bandwidth issues with our ISP but we can work that out.  be warned, there is a learning curve.  you have to learn where to find the programming that you want.  it's all there, you just have to look. The music is available and it is awesome. we were paying 140 a month for satellite service and not getting anywhere near the channels we get on the fire box. when we replace the TV in our master bedroom with a smart TV, a Fire stick will go there.  Satallite---1680.00 per year.  Amazon Fire + Prime-----$200.00.  we did the math.  you try it.", "verified": true, "helpfulness": "0/0", "author": "Richard K. Davis"}, {"rating": 5.0, "review": "Crystal clear picture, easy to use, LOVE the voice search feature. Unfortunately, it can't correct the issues with Hulu's streaming, so, don't expect that to go away - that's Hulu's continuingly irritating issue. Lots of Apps if you like those, and lots of channels to choose from. Would love to see Acorn media added - I watch lots of the Brit series and movies. Also, VidAngel (currently in Beta) would be great - they do cleanups of the movies those of us who are practicing Christians and otherwise averse to smut/language/gratuitous violence won't watch in original form.Overall, I would buy it again, and recommend to videophiles everywhere!", "verified": true, "helpfulness": "0/0", "author": "Belle Voce \"I'd rather be singing\""}, {"rating": 5.0, "review": "Have purchased multiples! Has saved me hundreds on cable!", "verified": true, "helpfulness": "0/0", "author": "Kristin Lewis"}, {"rating": 5.0, "review": ":)", "verified": true, "helpfulness": "0/0", "author": "Brieanna"}, {"rating": 5.0, "review": "I love how easy it connects and how youtube selects what I might like based on my prior selections. Fantastic deal, I give it 10 stars if I could !", "verified": true, "helpfulness": "0/0", "author": "harry burr"}]