[{"rating": 5.0, "review": "this is a christmas gift for our 11 year old.  we don't want him to have cable in his room.  this was a better alternative.", "verified": true, "helpfulness": "0/1", "author": "J. Kihlken \"Mom of 2\""}, {"rating": 2.0, "review": "I don't really find anything useful with this product.  Many things I wan to watch I have to pay for!  The whole point of buying this product was to NOT have to pay additional fees...so I feel like I wasted my money.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer \"Ice Pack Mary\""}, {"rating": 5.0, "review": "Better than the Roku 3! The Fire's auto setup at setup time is fantastic as the unit does everything on it's own. The high definition on the Amazon Fire is greatly appreciated! The downloading also seems much faster than the competition. Roku's units have a major problem, they heat up then lock up! I used to put the Roku in the freezer for a quick cool down which worked but is NOT the way to treat electronics! I have no such overheating problems with the Amazon Fire. The one thing the Roku had over the Amazon unit was it's ability to remember what was already viewed. That capability is sorely needed in the Fire's programing especially if you are watching series programs.  Am hoping that Amazon will fix this one sore spot through firm updates in the near future. For now, set your TV on fire, burn your cable, and sell your Roku on Ebay!  Dang! I think i forgot that Roku in the freezer! :>)......Aldo", "verified": true, "helpfulness": "0/2", "author": "Aldo Mosti"}, {"rating": 5.0, "review": "why not add a camera on the front of the box so it can be use with skype and other chat sevices and apps.and also a remote with all letters and a touchpad on it.", "verified": false, "helpfulness": "0/1", "author": "josito"}, {"rating": 5.0, "review": "It met our expectations plus.  Easy to use.  Very happy with purchase.", "verified": true, "helpfulness": "0/1", "author": "Nancy C Wilson"}, {"rating": 5.0, "review": "works great. very impressive", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love our Fire TV when using it with Amazon Prime!  It has made all our other gadgets obsolete.  I wish I'd known before how great it is.", "verified": true, "helpfulness": "0/1", "author": "R. P. Brooks \"RMChief\""}, {"rating": 4.0, "review": "Enjoy the features and the rapid video streaming..", "verified": true, "helpfulness": "0/1", "author": "Antonio Rodriguez"}, {"rating": 5.0, "review": "I bought a good blu ray player same time my dad bought a fire box. I eventually had to get the fire box because of how much better and quicker it is. Does what you tell it to right when you push the button. Great product", "verified": true, "helpfulness": "0/1", "author": "Jason Beachum"}, {"rating": 4.0, "review": "Nice box. I have the Roku 3 as well and the Fire is a bit cleaner picture-wise. The ability to do more games is also nice. It would be 5 stars except that the remote is bluetooth only which means it will not work with my present universal IR remote. Not a big deal but I wish it had IR. It also lacks the variety of apps (I especially miss Acorn TV) that Roku has.It does have all the important apps, however - Netflix, Hulu Plus, of course Amazon Prime, and PBS, etc.It also has an optical audio out which is a big deal if you have an older A/V receiver. The Roku 3 does not, which is points off for the Roku. I also like it's flat low profile better than the funky puck style of the Roku.", "verified": true, "helpfulness": "0/1", "author": "William \"Skeptic AstroImager\""}]