[{"rating": 3.0, "review": "I go this and a roku.Yes, the roku is now less powerful and has less games (oh noes!).But... the amazon is more powerful for same price.Why roku wins?  In-remote headphone jack.  We have a huge entertainment system.  If I want to watch a BA movie and not wake up the house, I simply plug in the headset.  Instantly my 7.1 shuts off and the sound is in my earbuds.If Amazon had this, it would be the winner.  If they update to add this, they will dominate.  Until then, this is a great bachelor device.  If  you've got people living with you, the Roku wins.Amazon Voice search is a little wonky.... you can search for Netflix movies, Vudu movies etc that you already own or have a subscription to, and it points you to Amazon to buy a new copy!  YAY!", "verified": false, "helpfulness": "3/6", "author": "BaPuters"}, {"rating": 1.0, "review": "if you use Plex to play your DVD collection in mpeg2,  it's not going to play smooth.  The video stops and goes every few seconds even with wired network.  It's going back to the store.  Sorry.", "verified": false, "helpfulness": "10/34", "author": "Amazon Customer"}, {"rating": 1.0, "review": "When oh when will Amazon realise that theres millions of more customers outside the USA that would love to have access to their products but sadly we cant...even more so in Ireland... c'mon Amazon... lets have a level playing field here... more money for you.", "verified": false, "helpfulness": "10/52", "author": "Patrick Seery"}, {"rating": 5.0, "review": "It's only fantastic so far. But Amazon is going to improve in the near future with games and advanced search ability, etc.. Received it this PM. I have used ROKU 3, and Apple TV. for awhile but the Fire has much better sound for one thing. Glad I bought it and it will only get better.", "verified": true, "helpfulness": "6/6", "author": "J. Franklin"}, {"rating": 5.0, "review": "I just love the remote and the accessibility of all the programming in one device...I would highly recommend it!  Buy yours today!", "verified": true, "helpfulness": "3/4", "author": "jayroe1234"}, {"rating": 5.0, "review": "I replaced an earlier model Roku with the new Amazon Fire TV, and just a few hours after getting the Fire TV and hooking it up, all I can say is WOW. I'm going to get $40 or so selling the old Roku on eBay so that knocks some off the $99 the Fire TV cost. The voice selection is the best feature, It works!", "verified": true, "helpfulness": "2/3", "author": "T. Gardner"}, {"rating": 3.0, "review": "As an Amazon Prime subscriber, I was hoping I'd able to watch ALL of Amazon's content for free on this device, but I was still asked to pay for a lot of movies and TV shows. If I didn't already have a streaming device, the Fire TV would be fine, but I don't get anything new from what I already have.", "verified": true, "helpfulness": "0/7", "author": "Carlos Santander"}, {"rating": 5.0, "review": "I am thoroughly impressed with this device.  It was extremely simple to set up, the menus are incredibly easy to navigate, everything responds instantaneously, and the picture quality is outstanding.  I have had roku and chromecast, and while I'm keeping my chromecast (and love it for what it does), this fire tv will quickly become my most used television and movie viewing device.", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 3.0, "review": "First let me say that I do own a Roku XR (one of the older original models) as well as an Apple TV (brand new edition).I had purchased the Apple TV thinking I would replace the Roku I had in the bedroom and then purchased the Amazon Fire TV to replace the Roku in my family room. I thought I could try out the Apple and Amazon models.Here's what I found:1)  Strong points the Amazon has over the other two?  None.2)  Number of apps (channels) available goes to Roku hands down.  Worst for app selection...Amazon.  Of course if you only watch the big ones like Netflix, Hulu, Crackle or children's channels it won't bother you.3)  Worst for layout and ease of navigation...Amazon.4)  Voice search on Amazon....eh no biggie don't get excited.5)  Remote buttons hardest to use because of size....Apple.6)  Apple and Roku both take a few seconds to load up, Amazon loads instantly.7)  Layout of content presentation for Netflex is awkward on Amazon.8)  Free movies available (included in the monthly fee for Roku although not current in the theater movies) goes hands down to Roku.9)  Current movies (in or just out of theaters) available to purchase or rent goes to Apple with the largest selection. Roku streaming does not offer current movies to rent or purchase.  Amazon has a very limited selection.10)  Music from your I-tunes account is only available with Apple TV.  In fact anything in your I-tunes account can be shown or heard on Apple TV....and you can sync all of your Apple products like I-phone, I-pad, I-pod and Apple TV.  This is really nice to have available.11)  Quality of picture is very good on both Amazon and Apple.  Since my Roku is an old model I will excuse the poorer quality picture.  It just isn't sharp like the others even with HDMI and an HD TV.Summary:  if I had to choose today between the three, Amazon Fire TV would be my last choice.I would certainly choose the Apple for syncing ability, excellent picture quality, current movie choices, and good navigation.I would probably also choose a newer model of Roku (just to upgrade the old one I have) for the sheer volume of streaming choices all included in the monthly fee of about $8 and use both boxes.Amazon Fire TV just doesn't offer anything special except voice search and that is just not exciting.Would I recommend Amazon's Fire TV?  No.", "verified": true, "helpfulness": "2/9", "author": "Search Alot"}, {"rating": 5.0, "review": "The main reason I ordered Amazon Fire TV was to be able to watch Netflix on a TV without Internet access nearby. My Blu-ray player has the Netflix app but does not have wireless. Fire TV has wireless Internet access.The actual connection and setup were very simple. All I had to do was put the included batteries in the remote, plug the power supply into the Fire TV box and the wall outlet, and connect the HDMI cable from my TV to the Fire TV. It automatically powered on and began searching for software updates as soon as I had it plugged in. Actually downloading and installing the software updates took about 10 minutes, which was just enough time to build some anticipation.As soon as the firmware updates were complete, it immediately launched into an intro video explaining the basics of what can be done. The really cool part is the voice button on the remote that allows you to simply state the title of a movie or the name of an actor, while Amazon digs in the cloud and pulls up results for you to watch. You can't get much easier than that. You don't even have to type in a title.Once I was past the intro video, I started downloading some apps I knew were going to be important to me (Netflix) and some that looked intriguing to try. It didn't take very long to download the apps and I was able to start using the services immediately. I haven't even begun to scratch the surface, but some of the available apps are Pandora, Hulu Plus, BloombergTV, ESPN, and Showtime. You can also play games on it, but since I didn't purchase a controller, I haven't attempted to download any games. My son is urging me to get moving on that, however.The picture and sound quality are great and I couldn't ask for more. The remote is tiny (especially compared to my DirecTV remote) and extremely light. The buttons are laid out well and easy to find, and the commands are super-responsive. It's so convenient and user-friendly, I am about to start suggesting it to everyone I know--especially those friends who are attempting to ditch cable and satellite all together. This is an excellent, fairly-priced alternative.", "verified": true, "helpfulness": "4/5", "author": "Breeni Books \"www.breenibooks.com\""}]