[{"rating": 5.0, "review": "Easy to setup and use. Streams video better than my xBox or Blu-Ray player. Small foot print you hardly notice it sitting there next to TV. I would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "John A Murry"}, {"rating": 4.0, "review": "I love my fire tv but I do wish that there was a place were you can view the available prime only not everything and the buy on a separate viewing page. I understand why you do it but it would make so mush easier for your prime viewers. Like most people I am on a tight budget and can't always afford the pay movies. It would be nice if you can fix that some how.", "verified": true, "helpfulness": "1/2", "author": "Cindy Hamilton"}, {"rating": 5.0, "review": "Ease of use, switches it self to the correct HDMI input.  Love the Voice searchBlends in well with my TIVO System", "verified": true, "helpfulness": "0/0", "author": "Jim Dech"}, {"rating": 5.0, "review": "Love this! A step up from roku and now with the HBO specials available- it's amazing! I'm so happy I purchased this!!", "verified": true, "helpfulness": "0/0", "author": "H. Ross"}, {"rating": 5.0, "review": "Being able to tell the remote what your looking for is just the icing on the cake.I canceled Netflix 2 dats after installing.", "verified": true, "helpfulness": "0/0", "author": "Ed Mathias"}, {"rating": 4.0, "review": "I would have given it 5 stars if they had included a user manual. It is not difficult to figure out all the basics but it would have been a much better with a little more detail. It doesn't help my attitude  when I see a number of  manuals on sale for $8.00 + dollars.", "verified": true, "helpfulness": "2/2", "author": "Karl Jesinghaus"}, {"rating": 5.0, "review": "I like this purchase a lot. I just got rid of my cable TV due to cost and they had made changes and got rid stations with no replacements. I wanted to save the money every month.  I fire has done that for me. I can watch my favorite programs now on HULU.", "verified": true, "helpfulness": "0/0", "author": "Garnet Volquardsen"}, {"rating": 4.0, "review": "Having been a Prime member for some time and requiring a special device or brand of TV to access this programming made us feel like we were not taking full advantage of the membership. I sprang for the $100 Fire device. I was disappointed at how many movies are not free. Admittedly, I haven't explored the entire library by any means, but did spend a half hour or so after receiving the device looking over programming and saw a great deal of pay-per-view movies. On the plus side, the streaming seems fairly flawless and one can FF and RW easily - more easily than Netflix, IMO. I like the compact size of the device and the remote control is very easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "A. Henderson \"acimdreamer\""}, {"rating": 5.0, "review": "Awesome product.  I am so glad I purchased this.  Very easy set up too.  Very reasonably priced.  It is a great item!", "verified": true, "helpfulness": "0/0", "author": "E. Barillaro"}, {"rating": 5.0, "review": "Set up and ease of use is great. Just wish more stuff was available on amazon instant video. Overall easy for anyone to use regardless of tech knowledge.", "verified": true, "helpfulness": "0/0", "author": "joseph siano"}]