[{"rating": 4.0, "review": "Really wish there was a way there might be but I haven't found it yet of connecting my movies that already have on our drive to that", "verified": true, "helpfulness": "0/0", "author": "aaron patterson"}, {"rating": 5.0, "review": "I bought this for my husband for Christmas and he loved it!It was very easy to set up and is very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Susan Libby"}, {"rating": 1.0, "review": "The key is you have \"access\" to lots of television shows and movies. But, what it doesn't tell you is that you have to pay to watch most of them! $2.99 to watch an episode of General Hospital! I can watch for free on ABC.com. Honestly, I incorrectly assumed I would have access to the Internet through this system. The voice activation was a very cool feature. But, if I have to pay for nearly everything, the voice activation is not worth it. The point of getting this system for my family was to save money from the high fees of Cable television. This system was not the solution.", "verified": true, "helpfulness": "4/9", "author": "Paula Byars"}, {"rating": 5.0, "review": "Not much of a TV fan so I bought this. Tried it for a week. Cancelled my cable. Saved over $120.00 per month!!!!! Love it!!!", "verified": true, "helpfulness": "0/0", "author": "peter j belmont"}, {"rating": 3.0, "review": "Okay so far.  Could be a lot better.", "verified": true, "helpfulness": "0/2", "author": "Marty Sutton"}, {"rating": 3.0, "review": "I was disappointed in the tv options was hoping for access to broader programing.  I was also disappointed in the so called advantage of being an amazon prime member.  the selection of \"free\" movies are all old releases most of which we have seen the the cost of renting the \"new releases\" is over $6.  I can get it cheaper at the local grocery store. it is a sharp and clear hd picture but overall am disappointed", "verified": true, "helpfulness": "0/2", "author": "Elizabeth L Lee"}, {"rating": 2.0, "review": "i'll rate again later when I have it a bit longer. The selection of movies has a bit to be desired, however the unit itself works great except I wish there was a way a prime member had a way to choose better releases. Have you even seen some of the movies I don't even know half the movies let alone heard of them or the actors. Unless I'm missing something is there a way to shut the unit off when i'm not using it", "verified": true, "helpfulness": "0/3", "author": "Marty J."}, {"rating": 3.0, "review": "3 1/2 stars.  So far it's pretty good.  Size, speed, price, Prime Music and Video.  The available Apps are OK.  The UI could be better (scrolling from left to right can be annoying if you have a lot of movies or even apps to go through) but I figure that will get better with time.  However, the Parental Controls (FreeTime) still does not allow you to add any movie you want from either your Watch list, Recommendations or any available Prime Instant Video.  The only thing it allows you to add from is from your Video Library, in other words, what you have purchased.  Unless you plan on actually buying a lot of movies, that's messed up.  Bottom line, it needs better Parental Controls.More Apps are needed but I figure that will come in time as well.Overall, the price, search function, Prime Music/Prime Instant Video and hardware are great!  The UI, Parental Controls and App availability could certainly be better.", "verified": true, "helpfulness": "2/2", "author": "J. in Colorado"}, {"rating": 5.0, "review": "The Fire TV is a must have! The voice search is amazing.  I even found  a Spanish title movie by saying it in Spanish.  The speed of browsing through the choices is instantaneous.  It is just as fast as my going through my Tivo.  The Fire TV, like the Tivo, is one of those gadgets that once you have used it, you can't live without it!  I monitored the electrical usage  of the Fire TV for 112 hours, and it used 0.48 watts.", "verified": true, "helpfulness": "1/1", "author": "Manny \"Manny\""}, {"rating": 5.0, "review": "After reading all the reviews and comparing the other brands (Roku) I found Amazon Fire TV to be exactly as advertised.. Met all expectations, easy to use, best purchase I ever made!", "verified": true, "helpfulness": "1/1", "author": "Michael Murphy"}]