[{"rating": 5.0, "review": "love it love it could add ps3 and ps4 games if they might think about getting a contract to ea sports or something like that", "verified": true, "helpfulness": "0/2", "author": "MR.Parker"}, {"rating": 5.0, "review": "Wow - it's fast. Love the way I can get extra sports on ESPN through my XInfinity subscription that I can't find anywhere else", "verified": true, "helpfulness": "0/1", "author": "P&T"}, {"rating": 5.0, "review": "I just received it and set it up. Simple Setup. I used ethernet, since streaming performs better for me on wired vs wireless. I still have old DSL connection where I live. The biggest selling point for me was I was able to install XBMC to stream my own content in addition to my Amazon Prime Content. Specs are great. I was able to stream Avatar 1080p on XMBC Plugin with less than half CPU and RAM usage on a 55in Samsung 1080p 240Hz Smart TV. Amazon content streams without issue on a 12Mb connections from my ISP. Yes. That is the max they (my ISP) offers in the Boon Docks where I live. Love the Optical output. Hooked Optical Audio Cable to my surround sound and what a difference from other set top boxes I have had in the past. I have not used all the features as of yet. It does have parental controls, which I like to prevent unauthorized purchases without a PIN when selecting content to view. I like how the content is separated on the home screen from Prime Content to Paid Content. Like the voice search. Was able to find movies quick without typing on a remote without QWERTY Keyboard. I don't have children but it does have a feature where you can set up pre-selected content just for your children to watch. All in All, in my opinion only, this is a great little box compared to whats on the market and the ability to ad XBMC, which is currently not supported on any RECENT popular set top boxes with the ability to stream Amazon Prime Content as well.", "verified": true, "helpfulness": "0/0", "author": "alias2012"}, {"rating": 3.0, "review": "Nowadays, every device purports to stream online content in some capacity or the other: cell phones, Soundbars, Smart TV, game consoles, watches, refriderators etc etc.. So there's a lot of choices out there, depending on what kind of content you want to watch and what kind of user experience you desire.For this review I'm going to stick to comparisons of the Amazon FireTV with the Roku 3 and Apple TV  since they are  primarily all the same type of device, billed as content streaming devices.I will break the comparisons into three areas: Device Hardware and Features,  Content and Apps, Design and Extra Unique FeaturesDEVICE HARDWARE AND FEATURESWith regards to Hardware specs and device capacity, I will say the Fire TV is hands down the most powerful. A glance above at the product description page , and the comparisons with other devices will detail that . So I won't repeat the specs.However, owning a Roku 3 and having used the Apple TV also, I've never felt that there was anything I did with either of those two devices that didn't respond fast enough or that the power and capabilities they provided weren't sufficient for the tasks I expected of them.So on that score I will say that outside of future content delivery innovations that might necessitate a need for more power and capacity, this alone would not necessarily motivate the purchase of the Fire TV over the Roku 3 or Apple TV.  As of today.They all perform very well with the hardware they come with. I will score this one for the FireTV anyways.CONTENT AND APPSAt the end of the day it's all about the content. Regardless of the power or speed of your device.If you are an Amazon prime user or you are looking to get all your content primarily as purchases from Amazon -  whether music, TV shows or movies - then this will be great for you.  The content provided by Amazon's digital services work seamlessly and are front and center. I would even go as far as to say that this device is probably ONLY a vehicle to drive amazon digital content sales. In this regard, I will say the Apple TV is similar. Apple content is featured prominently and much easier to purchase and access on the Apple TV, and other third party content apps seem like after thoughts or superfluous fillers.If you've ever bought any music from Amazon or movies or Shows, they appear there in the library and can be streamed easily off the cloud.However, if you want your content from any other source that you either have a subscription for or can get for free i.e, youtube, netflix, hulu, plex that's when you see how buggy and unintuitive the apps are.This is where I feel the FireTV suffers and lags behind. Granted it is a relatively new device but some of the apps are just so unbelievably bad in comparison to what exists on any other device out there.For instance, the netflix app on the Fire TV must be a version that's over 2 years old. It is so clunky, crashes, and doesn't even have features that most people have come to know and rely on i.e ability to create different viewer profiles, with unique content viewing logs for each profile, or the ability to search via categories or even a  carousel that cycles from start to end and automatically back to the beginning again.I bought two of the FireTV , one for myself and another for a friend who has a similarly atrocious netflix version on an older streaming Blue Ray player. I will have to return the one I got for my friend cause the problem won't be solved for him with this. It's hard to believe that a product that came out in 2014 still has such old outdated software and apps. In my mind it's comparable to a powerful computer coming out in 2014 and still running windows 98.Such problems don't exist only with Netflix app. Apart from the fact that a popular apps like HBO Go that I like and use on my ROku 3 or Playstation 3, don't yet exist on the Fire TV, Most of the apps that do exist  look like they were rushed to the market, and not finished properly.I can only hope that amazon's software people can work on these issues and provide updates to these apps and also provide more third party apps that people use.Apple TV also has similar issues. Outside of their own provided content, most third party apps suffer.  I don't want to get cynical and say that it's deliberate on the part of services like Amazon and Apple TV to make their content shine, and other third party content providers apps so insufferably bad that you get steered away from it.On this score I will give this to the Roku 3.  The Roku 3 has a ton of apps that work very well. Even the Amazon app works great on there and I can buy and watch content easily from amazon on it.[UPDATE  September 11 2014 ]ANOTHER IMPORTANT POINT TO NOTE WITH CONTENT ON AMAZON FIRE TV is that you have to turn on Parental Controls settings to be able to activate PIN controlled purchases on your device. If you don't have kids and don't think twice to check that section you won't see any tabs for using a PIN for purchases as a safeguard in case any one but you is with your remote control and is attempting to go on a one-click shopping spree on amazon as the device is automatically tied to your account. I think Amazon could have done a better job of separating the activation of PIN protected purchases from the general controls for Parental Control, or at the very least making the option visible before you turn on Parental controlsThe device is tied to your amazon account and bank account. EVERY PURCHASE for APPS, movies, TV shows , music, etc is one-click. If you don't activate Parental Controls and Turn on PIN protected purchases it's open sesame to your bank account.COST, DESIGN , GAMES, UNIQUE EXTRA FEATURES,They all cost the same. At par there.Looks wise they all are sleek, slim tiny devices with simple remotes that get the job done. Off all three, Fire TV feels the heaviest and sturdiest..Probably cause of increased hardware capacity.  But they all look sleek and streamlined. Apple TV and Fire TV look better than the roku 3  , to me. I like the Roku remote feature where you have a headphone jack that can mute the sound from the TV and play only via the headphones. Great for watching TV or listening to music at night. Especially if you have company or neighbors that might be trying to do other things.For the FireTV, the microphone on the remote that provides voice search is nifty and works pretty well. But for now, it works best , as with everything else FireTV, only with Amazon provided content. If you try it with any other app, you get directed back to the home page or to amazon content.  Apple TV doesn't have any extra features that are worth mentioning.Also when listening to music purchased off amazon, the lyrics for some of the songs, especially the newer ones, are displayed Karaoke style on the screen while you listen. It's a nice feature if you care about the lyrics of the music you're listening to.When it comes to gaming I prefer to do that on a device like my Playstation 3, so I won't really touch on that in this review. Amazon has more games than Roku or the apple TV but that is not of a lot of interest to me.On this score of Design and Extra Features I will Tie the Roku 3 and Amazon Fire TV.To summarize, the Fire TV is a promising streaming device but it still has some ways to go on fully delivering on that promise. The bulk of the issues with it have to do with the software and making sure there is better integration of third party content.I would have given this device 3 and 1/2 stars but that option doesn't exist, so I'll leave it with 3 stars for now.  For a device that's still newly launched (in the last couple of months) the FireTV competes strongly with its peers in the field who have been around a whole lot longer and had more time to iron out their issues. If these software issues are fixed and more apps are added , i.e HBO GO, and better integration with third party content providers is offered I will say the Fire TV will be the number one streaming device. But for now, that title is held by the Roku 3.Pros:-Powerful hardware-Sleek minimalist design-Easy set up and easy to use-Easy and seamless access to amazon digital servicesCons:-Third party content and apps don't work too great-Software needs tidier User Interface and Experience-You have to enable Parental Controls to even see that there is an option to have PIN protected purchases.", "verified": true, "helpfulness": "2/2", "author": "B-RockSolid"}, {"rating": 5.0, "review": "I bought Amazon Fire V after having bad experience with one of the Chines Android TV box. This is so much better on all aspects: performance, usability, support.", "verified": true, "helpfulness": "0/1", "author": "matrix.mania"}, {"rating": 5.0, "review": "I bought the FireTV box on a 30-day trial to test it against my AppleTV box. I kept it and it has replaced the AppleTV. It is tremendously more reliable, as Apple often required me to go find a computer and log in to iTunes, which tremendously delayed watching the shows. I have never had such issues with FireTV; it always works flawlessly. Lots of programming available. Love the RF remote.", "verified": true, "helpfulness": "0/0", "author": "B. Montgomery \"bkmont\""}, {"rating": 1.0, "review": "I gave my Roku 2 away because I thought Amazon TV would be an excellent product.The streaming quality instead of an improvement is a total fiasco!Go with a Roku 3 and avoid this dog.", "verified": true, "helpfulness": "2/8", "author": "James lucas"}, {"rating": 5.0, "review": "Fabulous, Quick, Sensational, Smooth, Highly Recommended, Perfect", "verified": true, "helpfulness": "0/0", "author": "E. Brown \"I don't allow anyone to put a limit on my dreaming, and I dream big, ALWAYS.\""}, {"rating": 3.0, "review": "Not what I expected.  It seems like most of the movies need to be paid for.  It's not easy finding the free ones from prime.", "verified": true, "helpfulness": "1/4", "author": "seagirlnaples \"Cglass\""}, {"rating": 5.0, "review": "I don't usually do reviews on products that I have purchased through Amazon, but I must say, just after one night of using th Amazon Fire TV as well as installing XBMC, I must say I am very impressed.  I will be looking for a wireless keyboard remote.  I tried using a Favi FE-01BL Mini 2.4 GHz Wireless Keyboard and Mouse trackpad, but it didn't work as cleanly as I thought it would.  The handheld remote does the job.The XBMC App was easy to install and installed in less than 10 minutes after the initial setup introduction from the Amazon Fire TV.  I couldn't be happier with the device in both the compact design as well as the content and functionality it provides.", "verified": true, "helpfulness": "1/1", "author": "Edmund Cuison"}]