[{"rating": 5.0, "review": "Easy to install and use.  Voice search works GREAT.  Even found only Free Amazon videos with voice search.But did not find a way other than voice to select only free Amazon stuff.Fast and sharp.  Love the small flat shape.  Packaging is very first class with package fit & finish as good as it gets.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as advertised.  Has a very fast response time to all downloads.  Could use a few more apps though.  Overall, very pleased with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I already owned a Roku 3, but decided to give Amazon Fire TV a try for a TV in a different room. The menu navigation through the Fire TV is much slower than the Roku 3. With the Fire TV, there was a noticeable delay after pressing a direction button on the remote and seeing the cursor move to the next selection on the screen. It was not a huge problem, but noticeable enough to be annoying, especially considering that there is no noticeable delay on the Roku 3.The other problem I had with the Fire TV is that the video would randomly stop playing and display a \"Network Connection Issue\" message. When this happened, I was immediately able to restart the video and resume playback, so it didn't appear that the connection was actually lost at all. I know that there is no problem with my network or internet connection because I have no problems with streaming video on any other devices. Amazon technical support was not able to determine the problem, so they sent me a replacement device. However, the replacement (new) device had the exact same problem. I decided to return the Amazon Fire TV for a refund and purchase another Roku 3 instead. The Roku 3 has had no problems whatsoever and I'm very happy with it (and at the time of this review, the Roku 3 is $10 cheaper).", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 1.0, "review": "I received this as a gift, but I haven't purchased any content and haven't found much decent free content so it's pretty much worthless to me.", "verified": true, "helpfulness": "0/6", "author": "Scott"}, {"rating": 4.0, "review": "Lots of great options and tons of free TV channels. Much better than cable!", "verified": true, "helpfulness": "0/0", "author": "Laura Kramer"}, {"rating": 5.0, "review": "very nice media streamer.  Has plenty of power to handle any video.  Does a great job with video games too.  all around nice entertainment center add on.", "verified": false, "helpfulness": "0/0", "author": "Robin P."}, {"rating": 4.0, "review": "I love everythong about it just wish it had a on and off switch", "verified": true, "helpfulness": "0/0", "author": "Wytwan Orr"}, {"rating": 5.0, "review": "I love it.i just wish have more free options to joy it", "verified": true, "helpfulness": "0/0", "author": "mirtill lewis"}, {"rating": 5.0, "review": "I love this product.  I have used the Chromecast, and the roku stick, and this is the best of the lot.", "verified": true, "helpfulness": "0/0", "author": "newmkt"}, {"rating": 4.0, "review": "It's a really great way to watch my amazon prime movies on the big screen verses my 7 inch tablet.", "verified": true, "helpfulness": "0/0", "author": "prboyles"}]