[{"rating": 5.0, "review": "Hands down this product is far more better than my Roku ever was!  After reading some reviews, in particular struggles with using the product on Wifi and also Netflix being slow, I was at first hesitant.  However, I found no issues in any of those areas.  Using Amazon Prime on my Roku became almost impossible as it kept buffering or not running at all, however had no issue with Netflix.  But moving to Amazon Fire TV, not only are all my programs running fast and smooth, I found additional programs that are not offered via Roku.", "verified": true, "helpfulness": "0/1", "author": "Anna DePinto"}, {"rating": 4.0, "review": "It's great yet I didn't realize the limited number of movies to watch, maybe i'm doing something wrong. Set up could not have been easier, that was great!", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 5.0, "review": "Love our Amazon tv. We got it for Christmas along with a Netflix subscription and between Amazon and Netflix we can always find something we want to watch. Questioning whether we need cable tv any longer.", "verified": true, "helpfulness": "0/0", "author": "amyd714 \"amyd714\""}, {"rating": 5.0, "review": "Best product I have used in a long time. No need for the chrome cast or any other device. Easy to use and many options.", "verified": true, "helpfulness": "0/0", "author": "TPosi6"}, {"rating": 5.0, "review": "Excellent product . Easy to install but a HDMI cable should be included with the order.", "verified": true, "helpfulness": "0/0", "author": "REMJr"}, {"rating": 5.0, "review": "Its awsome can watch anything  at any time .No more direct tv was spending  to much $$$", "verified": true, "helpfulness": "0/0", "author": "eddy montiel"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Yvette Martin"}, {"rating": 1.0, "review": "I am returning it. Not functional for me.", "verified": true, "helpfulness": "0/5", "author": "Lee"}, {"rating": 1.0, "review": "Wasn't able to use it because my TV is not HDCP Compatible ... I have it in a box to be returned...It would have been nice to know this issue before I ordered it", "verified": true, "helpfulness": "0/3", "author": "STACEY ARNETT"}, {"rating": 3.0, "review": "Disappointed with the free movie selection, not a very good variety.  The best choices you must purchase.  Those are cheaper to rent through Red Box", "verified": true, "helpfulness": "0/0", "author": "Marilyn P."}]