[{"rating": 5.0, "review": "Great picture!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I do like this unit.  It is FAST, simple and has worked wonderfully for me for the past year or so.  Only today was I hit by what I am amazed to see missing.  I wanted to hook up a bluetooth speaker.  It is not an option, sorry Amazon I had to knock off a star in an otherwise wonderful product.  I just wanted to go sit on the patio and listen to the pandora channel I had on, and didn't feel like turning up the TV that loud.Please add this capacity", "verified": true, "helpfulness": "0/0", "author": "Randy L. Miller"}, {"rating": 4.0, "review": "Really like the speed and app selection. The UI could need some work especially if you don't have Prime but everything can be found fairly easily. I would recommend to anyone looking for a steaming media player that is an Amazon Prime subscriber. It's nice having the ability to install Android apks such as Kodi.", "verified": true, "helpfulness": "0/0", "author": "T. Smith"}, {"rating": 5.0, "review": "The Amazon Fire TV box is great! We have it hard wired into our net and it is super fast, and very convenient. We got it after enjoying the Fire stick which we got first and then moved to the basement kids room where there is no net access. We use the Fire TV upstairs in the family room and use it probably more than the cable box.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great piece of technology.", "verified": true, "helpfulness": "0/0", "author": "Toomanybeerz"}, {"rating": 5.0, "review": "This was very easy to install. I didn't have to look at instruction until I paired the game controller then I was finished. Took about 5 minutes. There's a lot more stuff to do on here than I realized. Well worth the time and money.", "verified": true, "helpfulness": "0/0", "author": "Harold Sheppard"}, {"rating": 5.0, "review": "Love it!  So much easier than Chrome and has at more options.  Definitely a keeper.", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "I enjoy the Prime TV, I decreased my cable bill significantly.  The only minor thing was that I though I would have more free programs being a prime member. Overall very satisfied, I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Patti \"Patti56\""}, {"rating": 5.0, "review": "Amazing product. If you are considering purchasing one do yourself a favor and buy it. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Janet"}, {"rating": 5.0, "review": "Exceeded all my expectations. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "David F."}]