[{"rating": 3.0, "review": "Works well with Prime Instant Video, Prime Music, and Netflix, but if you're going to use a PLEX server beware. Files must be mp4 if you want surround sound. MKV won't work. The only reason I chose this over a Roku is because it has an optical out for my surround sound receiver. In addition to the PLEX app, various other apps don't support DD surround sound including Tablo. Also disappointing is that the Fire TV doesn't have an IR control option so I cannot use my Harmony remote.", "verified": true, "helpfulness": "0/3", "author": "Aric"}, {"rating": 5.0, "review": "Easy to use on my large LCD TV and hooks up to wireless network with no problem.", "verified": true, "helpfulness": "0/2", "author": "Mooseet"}, {"rating": 5.0, "review": "Excellent way to see EVERYTHING.  Easy set-up and operation.", "verified": true, "helpfulness": "0/1", "author": "IT"}, {"rating": 5.0, "review": "Bought as a gift for my Dad and he loves it!  We've got Prime, so Prime video works great.  I bought myself a Nexus Player and honestly, if I could go back, I'd have gotten myself the Fire TV only because Amazon refuses to support the Nexus Player which is quite ridiculous, so I can't watch Prime Videos on my Nexus Player.  Oh well.  The Fire TV is great, though.", "verified": true, "helpfulness": "0/1", "author": "Jay"}, {"rating": 2.0, "review": "it does not stream netflix very well at all", "verified": true, "helpfulness": "1/7", "author": "ronald rodgers"}, {"rating": 5.0, "review": "The best part of Amazon Fire TV is the music!  Living in a rural area, radio is awful...if you can get reception... even the satellites have trouble.  I not only have Rdio or Pandora, I have access to all of the music I buy from Amazon which I can play through my Amazon Fire TV and my full surround sound TV set up and with Amazon Prime I have full albums to choose from for free.  I love it.  The TV/movies are good too...I'm finally getting to watch the Downton Abbey series and other programs which I never had access to before.  I'm canceling all my other subscriptions except for Amazon Prime and my internet!  Yeah!", "verified": true, "helpfulness": "0/1", "author": "NWshopper"}, {"rating": 5.0, "review": "excellent & easy to use. Great programming too!", "verified": true, "helpfulness": "0/1", "author": "F. Lohman"}, {"rating": 5.0, "review": "I've owned an Apple TV, a Fire TV Stick, and this Fire TV. The Fire TV is by far the best. There isn't UI lag of any kind and it plays high quality video.", "verified": true, "helpfulness": "1/2", "author": "Samuel"}, {"rating": 4.0, "review": "The Amazon Fire TV is great. I give it 4 stars, I would give five if it had good enough usb support. The remote is good it handles most of the operations well. The unit is fast compared to some of the other set top boxes I have tried. The voice search is great, it just needs to be expanded so it can be used through out the whole system. The usb interface is not very good, you can only use a limited type of devices. If this problem was fix, this would be one of the best set top boxes in this price range. Another good thing about this unit is you can add third party apps to enhance its operations.", "verified": true, "helpfulness": "1/2", "author": "John F. Clark Jr."}, {"rating": 4.0, "review": "Still working with it, My cable provider will not let me access HBOGO", "verified": true, "helpfulness": "1/2", "author": "James Cogbill"}]