[{"rating": 3.0, "review": "Technically the best compared to others on the market, my complaint is that the selection of movie apps such as Vudu which I have a very large library and the lack of Cable apps such as HBO GO.", "verified": true, "helpfulness": "1/1", "author": "M. Majors \"msmajors67\""}, {"rating": 3.0, "review": "When you add the MLB and PBS aps I  will switch from Roku......Roku  customer service is terrible and they dont seem to care if you're happy with their product or not.", "verified": false, "helpfulness": "1/1", "author": "Thomas Smolen"}, {"rating": 5.0, "review": "I received my Fire TV today, I am surprised, amazed, thrilled and extremely pleased!  it's all that and a bag of chips! The ease of use is so simple, hookup is a breeze, I had it hooked up and running with in 3 minutes!! The remote is small so what, My only con is: the voice search should be for everything. To own this and not have Amazon Prime should be a crime, LOL, it's a must for the Fire TV.  I gave up Direct TV in January, I was paying to much for what I was getting. With the Fire TV it's customized tv at your finger tips, no more paying for channels you don't need and no more cable bill! I hope more people are waking up and ditching pay tv. I pay $7.99 for Netflix, I watch Crackle for free, no more commercials, no more unwanted/un needed channels, movies when I want, sit-coms when I want. no more running to 'pick up' a dvd, I'm telling ya streaming is where it's at and this device is a must!! Life is hard, this is easy.", "verified": true, "helpfulness": "5/5", "author": "Hootiewoo"}, {"rating": 5.0, "review": "Excellent STB .. My 17 yr old son summed it up best while playing one of the games  \" Why cant Apple to this\"", "verified": true, "helpfulness": "2/3", "author": "John Mielko"}, {"rating": 5.0, "review": "I absolutely love my FireTV. I watch multiple movies and shows via Netflix and Amazon Prime via my computer and SmartTVs but the download speed is almost instantaneous and the picture is sharper and clearer. Kudos to Amazon on making a great product.", "verified": true, "helpfulness": "1/2", "author": "Art"}, {"rating": 5.0, "review": "I highly recommend the Fire TV. I have owned both Apple TV and Roku. Each have pros and cons. The Amazon Fire TV blows both of them out of the water. With the Fire, I have not had any issues with streaming-no buffering, no stuttering,etc. It connects with the apps very quickly, much quicker than other devices or my Smart TV. I am thrilled with this product. It offers numerous apps that should satisfy almost anyone.", "verified": true, "helpfulness": "2/2", "author": "Ann"}, {"rating": 2.0, "review": "Purchased this devise to watch both Netflix and Amazon.  After working with it for hours, guess what? Netflix is not compatible with Amazon.  Since I already enjoy Netflix, and use a cheapo Chromecast that works just fine,  I may send this back.  If someone could enlighten me, I would appreciate it.", "verified": true, "helpfulness": "1/6", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Over all, really like the features and power of such a small streamer. 2 complaints though come in the form of a lack of Internet Browser, and the way Prime Membership isnt exclusive, but offered as part of all the millions of movies and shows available for purchase. Firstly, i dont want to have to strum through all the content I cant watch with my already paid membership. I dont want to see new items i have to purchase in order to watch, and it in fact shines light on how small the Amazon library is.Secondly, this was intended to replace my Logitech REvue Google box, and unfortunately i didnt check to see if it offered a browser. Why would of it been hard to offer a built in browser? I'm almost considering returning this for that very simple reason. I'm sure people will say its for security purposes, but I'd rather run the risk. Additionally it would be great if they offered a way to hook up a webcam and stream video between others.Also, the games are pretty good. I only have the remote control for now, but even then its computing power is impressive.", "verified": true, "helpfulness": "1/1", "author": "Chris D. Barton"}, {"rating": 5.0, "review": "This unit works very well with the HD tv we have. It has no problem picking up the Wi-Fi signal from another room where the transmitter unit is located. We watch netflix and amazon prime movies on it and it is a wonderful addition to our video unit.", "verified": true, "helpfulness": "0/0", "author": "cojack369"}, {"rating": 5.0, "review": "Yes, the voice search only works for Amazon selections, but from the home screen you can call up other services by speaking their name, for example, say \"Netflix\" and the log-on icon appears.  I expect that voice recog. will expand in the future.Easy setup?... How about instant! No lag streaming compared to other devices that stream Amazon IV.At $99 dollars this is a BARGAIN!Recommendations for future development - enable voice recog. feature to do cross service (Netflix, Hulu+, et al) serches, also enable voice to enter passwords & log-ins for all services.", "verified": true, "helpfulness": "1/1", "author": "PRB7 \"PRB7\""}]