[{"rating": 5.0, "review": "I thoroughly enjoy this new (to me) tv concept. I don't have cable and for me, thinks is even better. Love it!!", "verified": true, "helpfulness": "0/1", "author": "net mcclintock \"grmmynet\""}, {"rating": 1.0, "review": "I DO NOT RECOMMEND IT. Fire TV itself is okay, but it is nothing better than apple TV. The real problem is actually the customer service policy offered by Amazon. It is failed and not helpful at all. Sometimes we want to watch the same scene and my device gets mute, no sound at all, after we rewind or fast forward a couple of times.I called the customer service and I was forced to procedure technical support myself following their instructions over the phone. Two hours later and nothing resolved, I was told by the attendant that someone from the engineer department would call me in 2 F*****g days. It is absurd and unacceptable that I have to wait that long even though I bought the extended warranty with the device. The warranty department makes everything even more difficult and DOES NOT speak to the customer directly at all.The stress and frustration with Amazon customer service policy, making us work for them for FREE, is the reason I am moving back to Apple TV.Amazon huge mistake is its incapability to resolve the customer problem within 24 hours.I will be trowing away my Fire TV. With that, i am canceling my Amazon Prime. Who needs Amazon Prime if I can shop somewhere else and watch movies and shows in other channels and devices???Customer satisfaction should be Amazon Fire TV first rule in their books!!!", "verified": true, "helpfulness": "0/0", "author": "Luis  Mitter"}, {"rating": 5.0, "review": "An overall great product. I love the UI and the speed of the fire tv compared to my parents apple tv. It feels much more responsive with the better processor and I couldn't be happier with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Joe Charlton"}, {"rating": 4.0, "review": "I love it. just hope more channels come available ei syfy cbs nbc abc ect....", "verified": true, "helpfulness": "0/0", "author": "sally starling"}, {"rating": 5.0, "review": "Oh, my gosh - this is great!  I especially love being able to get my Pandora here!  love, love, love it!", "verified": true, "helpfulness": "0/0", "author": "SisterSue"}, {"rating": 4.0, "review": "After viewing advertisements for Amazon Fire TV it was decided by our household to buy and try this new product to check all that was stated about everything that was possible with this product. We have found this product to be all that it was advertised to be.", "verified": true, "helpfulness": "0/0", "author": "Charles B. Caessens"}, {"rating": 1.0, "review": "I bought this  cause advertised it was to have Gary Busey In the movie called eye of Tiger and it not was a pointless buy", "verified": true, "helpfulness": "1/12", "author": "W. C. WINSTON"}, {"rating": 5.0, "review": "We used to just hook up our laptop to the tv to take advantage of our Prime membership.But since we listen to Pandora daily we decided to use this product to further our Amazon experience.Our main use for the Fire Tv is daily use of Pandora and to watch our movies from Prime, but you can do so much with this unit.Our surround system hooked to the Tv makes using Pandora and awesome experience.", "verified": true, "helpfulness": "0/0", "author": "D. Ritchie"}, {"rating": 4.0, "review": "This is a powerful system, with great app coverage.  The voice recognition is by far the best I have used.  The only negative this I can say is that the device is made for Amazon Prime users.  Sure it has Netflix / Hulu etc, but Prime is a part of the OS.  The voice recognition only provided Amazon results, other companies devices all for searching though out all your apps (i.e. Netflix hulu).  The hardware is amazing and I would recommend this to any Prime member, but without Prime it is wasted.", "verified": true, "helpfulness": "1/1", "author": "Van Ketch \"VanKetch\""}, {"rating": 4.0, "review": "I just received my Fire TV and remote yesterday. The need was to avoid streaming from my PC, which overloaded it through buffering my Amazon Prime subscription. My expectations were too optimistic. What appears on PCs with Amazon Prime is a handy, intuitive interface to locate all the prime content without the \"noise\" of other product that is of no interest, unless I specifically search for a title. Otherwise, the hardware design, setup and packaging is superb!", "verified": true, "helpfulness": "0/2", "author": "RudiGee"}]