[{"rating": 4.0, "review": "Looks great. Bloomberg alone will pay for unit. One thing bring overlooked is that most flat careens are wall hung. An optional wall hanging holder for the unit would be a big plus if Fire TV will pick up signals and commands in vertical position.", "verified": false, "helpfulness": "0/2", "author": "Ronald S."}, {"rating": 5.0, "review": "It was easy to install and is very easy to use.", "verified": true, "helpfulness": "1/1", "author": "Patricia A. Keep \"Patty K\""}, {"rating": 2.0, "review": "We like many of the features but really object to the pricing on viewing a series where you are charged over $6.00 per episode so that a 10 installment series can cost over $60. Way too much money !!!", "verified": true, "helpfulness": "4/7", "author": "James Pickard"}, {"rating": 4.0, "review": "Awesome device for a first edition.  Add the full HBO GO catalog and I would give 5 stars....or if HBO go would allow you to \"cast\" to the FireTV then I'd give 5 stars, but both HBO and Amazon seem to be in agreement with only letting us have access to some content, not all.And please Amazon, update the GUIs so it's perfectly CLEAR whether a movie/TV show you search for is free w/PRIME or requires payment!  Both your website and this device's layout are confusing.", "verified": true, "helpfulness": "0/1", "author": "spaceghost"}, {"rating": 5.0, "review": "The only irony here is Amazon got the HBO contract to host/stream their series over Netflix and everyone else. Not supporting HBO Go seems odd.", "verified": false, "helpfulness": "0/2", "author": "J K"}, {"rating": 5.0, "review": "I love this. I've been watching some old movies. I'm thinking about getting rid of my cable. Who needs cable!!", "verified": true, "helpfulness": "0/0", "author": "Budman"}, {"rating": 5.0, "review": "I just can't figure out why I didn't buy it sooner!!  A really great device, simple to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Gary N. Roos"}, {"rating": 5.0, "review": "Sold my Roku for the Fire TV, why?  Because it had an optical out port for my 5.1 surround sound system.  Now audio from Netflix, Amazon prime etc really does sound as good as the picture looks.  Very pleased with the box and would buy it again.", "verified": true, "helpfulness": "1/2", "author": "J.J. Calabrese"}, {"rating": 5.0, "review": "Love the ease of verbal movie selection. Seamless operation and setup was easy!", "verified": true, "helpfulness": "0/0", "author": "Nancy W."}, {"rating": 4.0, "review": "Still waiting for apps that Roku 3 has that Amazon Fire does not, but processing speed is awesome.  Have not used voice prompt on remote yet, but plan to. Overall, a good purchase.", "verified": true, "helpfulness": "0/0", "author": "phillyguy"}]