[{"rating": 4.0, "review": "If you have Amazon Prime anyway, this is a great pairing that actually enhances your Prime account.If you don't have Prime - this may be the incentive to consider it !There is a large amount and variety of content available. I haven't yet dug into games, but most operation is easy to use and learn so I imagine it would be easy to use as well. Install was effortless and the online help is useful although there is a gap in help content for some features. Maybe they are still working on it. Hopefully will be available in the next update.I would recommend it  - Good purchase !", "verified": true, "helpfulness": "1/1", "author": "JP-San_Jose"}, {"rating": 4.0, "review": "It took about three minutes to set up. It works well and does exactly what it was designed to do.  The one time that I had poor reception on a movie that I paid to rent Amazon processed a refund without me having to ask for it.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Started with the other cheaper one but it kept breaking up during the show (buffering). Then, it'll sometime stop working all together and I'd have the reset it up again.I'm a binge watcher and the device is practically running 24-7. Then came the Amazon Fire TV. No buffer breaks, no setup hassle (hook it up and go), I get both my Prime and Netflix, no prob! Even tried some of the apps that's included with the Fire TV.I've got a TV in each room, next time I come back stateside, each TV will have one so everybody in the house can watch their own thing!", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 5.0, "review": "Had tried streaming video through Samsung Smart TV, but this is much better.  Voice search works well.  Loading speed very good, no signal loss as of yet.  Games are fun, and we ended up getting the controller even though we hadn't planned to.  Looking forward to having music added as well.  Honestly we're using the Fire TV a lot more than we had expected to.", "verified": true, "helpfulness": "0/0", "author": "RobandJen"}, {"rating": 3.0, "review": "Not sure yet on this thing.  If you have a smart TV and Prime, it doesn't seem to offermuch more... will give it some time to get more stuff on it, then see if I really like it or not", "verified": true, "helpfulness": "0/0", "author": "Dennis Eaves"}, {"rating": 5.0, "review": "Just what I needed..... This is the BEST ever,  The only feature missing is an off button.  All in all, I really, really enjoy all the shows!", "verified": true, "helpfulness": "0/0", "author": "Moe Moe"}, {"rating": 4.0, "review": "We have had this for a couple of weeks and so far it is great. I only wish that the voice search would work within which ever application you are in like within just NetFlix when I am inside the NetFlix app.  Works great and fast.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Blakeney \"Ravenous Reader\""}, {"rating": 1.0, "review": "FIRE TV IS A WASTE OF MONEY IF YOU WANT TO WATCH MLB.COM OR ACORNTV.  IT IS MY FAULT, I DIDN'T DO ENOUGH RESEARCH.  THANK GOODNESS I DIDN'T BUY 3 OF THEM.  HEREOME ROKU 3.  I BET YOU NEVER SEE THIS REVIEW", "verified": true, "helpfulness": "1/12", "author": "Janeane A. Weitzel \"weagency\""}, {"rating": 1.0, "review": "We only stream movies and films, so instead of a flat screen TV, we opted to get a projector. Until recently we would plug our laptop or iOS device directly into the projector. This was a hassle because 1) you can't charge the iOS while it's streaming so you have to hope the battery's full or swap out the iPhone/iPad mid-show, and 2) HBO blocks the connection between an iOS & a projector, so if we wanted to watch HBOgo on the big screen, we'd have to reorganize the cables and connect a laptop.When FireTV announced the HBO parntership, I was psyched. Guess what -- even with the HDMI to VGA converter with R/L Audio Converter, the Fire TV will not work with a projector. So we got the AppleTV. It's not only compatible with our projector, we found out we could stream HBOgo through our iOS wirelessly, which means it can be plugged into a power cable across the room. Perfect!", "verified": true, "helpfulness": "2/8", "author": "solara"}, {"rating": 3.0, "review": "I have three main complaints.The first is one that most people have already complained about - there isn't a good way to sort through your searches for only Prime results.The second is the fact that the Netflix app isn't user friendly at all. This could be rectified by mimicking Apple TV's Netflix app which allows browsing, suggestions, recently watched, etc.The last complaint is something relatively new. Amazon recently launched Prime music. Unfortunately, it's impossible to utilize this feature on anything but the computer (for example the iPhone 5S spends forever buffering without accessing content). It would be great if you had access to Prime music on the Fire TV.", "verified": true, "helpfulness": "3/4", "author": "Sinclair"}]