[{"rating": 4.0, "review": "GREAT CUSTOMER SUPPORT AND ASSISTANCE. I have an issue with the button on the remote. When I tap/push the selector button it seems to skip occasionally. CS old me to replace the batteries and this still did not resolve the problem.", "verified": true, "helpfulness": "0/0", "author": "andrew addison"}, {"rating": 4.0, "review": "I ordered this system for one reason - digital audio output (separate from the HDMI).  I have a roku 2, and I am happy with it.  I also have a really high end soundbar, a paradigm soundscape.  For those familiar, usually the only way, or preferred way, to get sound to the soundbar is from the audio out of the TV.  While watching movies streaming from the Roku I noticed that the sound was not 5.1 like, so I checked my TV settings, and sure enough, the audio output was PCM.  The only other option from the [Samsung] TV is their own DTS 2.5 NEO.  Samsung doesn't process the dolby digital audio signal thru HDMI.  I could keep the NEO setting, but there is significant lag in audio if I watch over the air TV in the NEO setting, and of course, the TV only lets you increase the lag of the audio, so there seems to be no feasible way to fix this.I want to add rear speakers to complete the surround sound, but it is an even worse conundrum trying to do that.  It's my own fault for getting a soundbar and trying to integrate it with a traditional system, but nonetheless, it is my predicament.  The only way to skin the cat is to get digital audio out.  My receiver can process the dolby digital from any HDMI no problem, but of course, it doesn't have a digital audio pass thru out, i.e. I wouldn't be able to send the audio signal to my awesome soundbar.  I looked at extracting the audio from the Roku HDMI, but that seemed stupid, and it couldn't process the dolby digital signal anyway.  The cheapest method for me was to buy the amazon fire.  I've read mixed reviews.  I hope I like it.  I like its high memory.  I hope it integrates well with Harmony remote control.", "verified": true, "helpfulness": "0/0", "author": "Example: Mark Twain"}, {"rating": 1.0, "review": "Unfortunately, it work for a few minutes and was blurry and no sound(on first setup i used an hdmi to rca convertor). When i switched it to an hdmi tv it just said no signal. It was not the hdmi cable. The device would not turn on again. It was pretty much a brick. I am not sure what happened. Maybe it was processing an auto update i wasnt aware of when i disconnected. I dont know. I called customer service and the remote restart did not work. Customer service said they were aware of the issue and that it was not just me. Bad batch of hardware? Not sure but i was left with that and an open resolution. Theyd be in touch but nothing else. Worst customer service resolution ever. Talk about bad fcr. I buy too much from amazon all the time. I love amazon. I rarely have returned things and the only real problems i had was from other sellers. I wanted to really like this but so far its been a bad experience. I got 50 percent off with sling 3 months. Thought it was a great deal basically paid for controller. I should have realized if the contoller is on a 2 to 4 month wait. Anyway this whole experience has been disappointing. I hope ill have a good update soon but for now 1 stqr. Btw kindle fire 6s i own are great devices but becaus our original 7 in fire failed on us years ago i was hoping to be able to playthe games it couldnt because of the sub 7 inches device exclusion for apps. Now i cant even try that. Anyway hope you experience has been better buf mine hasn been.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Stop thinking about it and do it...worth every penny!!!", "verified": true, "helpfulness": "0/1", "author": "CinEd"}, {"rating": 5.0, "review": "I don't watch much TV but this system works pretty good.", "verified": true, "helpfulness": "0/1", "author": "Roughout"}, {"rating": 5.0, "review": "Love it love it!", "verified": true, "helpfulness": "0/1", "author": "Nurseydi"}, {"rating": 5.0, "review": "Call up my movies with just my voice! So easy to use (and I's 67 years old). This is a good thing.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I've cut the cable/satellite because of this. I love my Amazon and use it daily.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 5.0, "review": "Fire tv is the greatest!!!!!", "verified": true, "helpfulness": "0/1", "author": "michael francis ward"}, {"rating": 5.0, "review": "The product is solid.  I do not like the interface at all. The side scrolling is cumbersome and very hard to brows with.  Wish amazon would change this and open whole page on each category so can get a page full of 9 or 12 items to view at a time.  The sliding left and right on a single row stinks.  It's from Amazon, so you know the product will always be supported.  And it has true 5.1 audio, which is, in my opinion extremely important for a good movie experience.. I never have liked Dolbys synthesized surround.. Everything sounds muddled.I give 5 stars because it's the best out there... Even better than Apple TV..... For the price, it's a no brainier ...  A must-have addition to your entertainment system.", "verified": true, "helpfulness": "0/0", "author": "Eric M Anderson"}]