[{"rating": 5.0, "review": "Wasn't sure if we were going to like it. We have had a few Roku's and really liked them! But, this is so much better!! Very satisfied, and exceeded our expectations!!", "verified": true, "helpfulness": "0/0", "author": "SuzieW"}, {"rating": 5.0, "review": "Love it! Replaces my want for a chromecast.", "verified": true, "helpfulness": "0/0", "author": "Chris S."}, {"rating": 5.0, "review": "All I need on the weekend is my Amazon Fire TV, a meal, and an ice cold soda...and I'm good to go!You will not be disappointed with this purchase!!", "verified": true, "helpfulness": "0/0", "author": "MrsDixon4Life \"Ta-Meia Dixon\""}, {"rating": 4.0, "review": "Beats the competition hands down, but to be a long lasting market leader they're going to have to relax the tight grip on what apps and software they allow to run alongside their defaults.I'm reviewing this for the hardware, versus other small home entertainment boxes in the $99 range.I like the Netflix, Hulu, and heck even Amazon Prime offerings I can access through this little box.  But one of my primary means of comparison is how well it will access and play stuff on my media server.  The short answer here is: poorly, but read on.The Apple TV 2 had the same limitations.  Both Apple and Amazon would prefer you integrate your collection with their system and in theory they have everything you could want in their cloud ready to use at all times.  Unless you have lousy bandwidth.  Or far from mainstream taste.  Or aren't willing to go \"all in\" with one of those companies, especially after spending countless hours ripping and organizing all the music and movies you have collected on CDs and DVDs.  So for that I use an add-on \"media center\" system called Kodi (formerly XBMC).  There are others, this is the one I use.To do this on the Apple TV 2 I had to \"jailbreak\" the device and carefully balance updating the software with maintaining complete access to the hardware (*my* hardware, which I paid full retail price for).  Following that I was able to install the add on software and use it as an option to the installed \"channels\".  Apple didn't bless the arrangement, but it put my media center right there on par with my Netflix and Hulu applications.In the Fire TV, I don't need to \"root\" the device to get my selected media center software installed, but I can't have it running there alongside the apps Amazon has deemed worthy, Pandora, Netflix, Hulu, NFL Now, whatever (to include several different fireplace cracklin' log apps, and a dozen seasonally relevant \"mood\" applications).  No, to start my media center app I have to go down to the system menu for applications, select manage all applications, select my application and then select launch. (read: it's a real pain in the rear end)In the opinion of this cut-cord media consumer, the one impediment Amazon has placed to being a truly market dominating device is not giving users free, unimpeded access to run any application I wish with equal rank to those they've blessed.  I think I speak for a large contingent of people who are willing to give up the right to complain if doing so wreaks havoc with the system.Also, the Plex media center option available through the Fire is outdated and buggy.", "verified": true, "helpfulness": "0/0", "author": "Earl Ax"}, {"rating": 1.0, "review": "Still have not had product functioning the way it is being advertised. Very disappointed, will try further attemps before sending it back.", "verified": true, "helpfulness": "1/2", "author": "Ron"}, {"rating": 3.0, "review": "This may just be personal preference, however, I think I prefer the Roku system better. The amount of apps on the FireTV is nice, but the navigation seems cumbersome. It is fast and responsive so if you haven't tried another interface I'd suggest this.", "verified": true, "helpfulness": "0/0", "author": "Shaun Miller \"CPC-Tech\""}, {"rating": 5.0, "review": "Loving Fire TV. Don't know why waited as long as I did. So many options and choices.", "verified": true, "helpfulness": "0/0", "author": "William Wright"}, {"rating": 5.0, "review": "Love it! Works like a charm. Easy to install. Plug and play! Especially great with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Viktoriya Lazarova"}, {"rating": 1.0, "review": "To many things you have to pay for!?", "verified": true, "helpfulness": "2/5", "author": "colleen kemp"}, {"rating": 5.0, "review": "Very fast streaming. Absolutely the best streaming device we have tried!!", "verified": true, "helpfulness": "0/0", "author": "Joan Johnson"}]