[{"rating": 1.0, "review": "not sure may be returning item", "verified": true, "helpfulness": "1/5", "author": "Irene Rittenhouse"}, {"rating": 5.0, "review": "We have previously used a smart BlueRay player, and this is definitely a step up.  Quick processor, lots of content and small footprint.", "verified": true, "helpfulness": "0/0", "author": "MatthewConrad"}, {"rating": 3.0, "review": "The equipment was easy to set up and works flawlessly. Good picture, easy navigation, etc. ( The voice commaand, not so much.) Even so I probably won't be able to use it. I, like millions of other rural residents , do not have access to cable or DSL services. I am currently using a Verizon Home Fusion system for internet access and data is quite expensive. The Fire TV gobbles it up really fast, leaving me nothing left for basic internet usage. Amazon could help in this respect if it allowed adjustment to lower resolution quality and/or posted the amount of bandwidth a given show or movie consumes. Currently it does not offer either option. I'd recommend this equipment for someone who does not have this problem but for me, I wasted $79.00.", "verified": true, "helpfulness": "0/0", "author": "dmg1"}, {"rating": 5.0, "review": "Replaced my Roku with this and haven't looked back!  This is the future of television if you ask me.  The games are excellent for the most part.  I do wish they would update the menu system though.", "verified": true, "helpfulness": "0/0", "author": "Dan Johnson"}, {"rating": 5.0, "review": "I'm not sure anyone can add anything to reviews for the Fire TV that hasn't already been said, so I'll keep this short. This device is simply awesome - especially if you're a Prime member. The only time you will EVER not like this device is being forced to watch the 2 minute guide after the initial setup, but it's a small price to pay for such a great streaming box.The box and remote are both sleep, and the design of the OS is terrific and smooth. The voice commands work exceptionally well, and the quality of video is outstanding. You could leave the Fire TV exactly as it comes from Amazon and be more than happy with it, but if you're looking to cut ties with cable TV, you can put this box on steroids in about 10 minutes by sideloading Kodi (formerly XBMC) onto the Fire TV. Anyone can do this by following some simple instructions (Google for more info), and I'd highly recommend it myself.", "verified": true, "helpfulness": "0/0", "author": "Nick Panaccio"}, {"rating": 5.0, "review": "Makes navigating very easy.", "verified": true, "helpfulness": "0/0", "author": "TLew"}, {"rating": 5.0, "review": "When they say that the voice search really works.....it really works !  I haven't had to repeat anything at all.  If you're an Amazon member, this is the ideal T.V. accessory to have.  It works flawlessly and is very easy to use.  I am so happy with my amazon T.V. that I have removed my apple T.V.. To play games there is a amazon game controller for sale but I think it's a bit expensive.  The standard remote is extremely easy to use as a game controller.  Great product.", "verified": true, "helpfulness": "1/1", "author": "Tommy D"}, {"rating": 5.0, "review": "This is a great item to purchase. Keep you watching television without being bored. Easy setup.", "verified": true, "helpfulness": "0/0", "author": "shantay sherman"}, {"rating": 5.0, "review": "Great..love it", "verified": true, "helpfulness": "0/0", "author": "Kennith Smith"}, {"rating": 5.0, "review": "Fire TV is a great addition to our viewing choices. Very good product. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]