[{"rating": 5.0, "review": "Love my amazon TV I got rid of cable a year ago and have missed watching my large screen TV.", "verified": true, "helpfulness": "0/0", "author": "Samy \"Samy's Dog House\""}, {"rating": 4.0, "review": "Beware, I bought this for my husband and I think that unless I become a tv star, he won't be watching me as much as this, but he deserves the Best so I sat Thanks.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Boddie"}, {"rating": 4.0, "review": "Good. Still getting to know this device but so far I have not been disappointed.", "verified": true, "helpfulness": "0/0", "author": "leah harmon"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "Bagman"}, {"rating": 3.0, "review": "It's not bad but i find my self needing to reboot it often to get Hulu and netflix to work . At least twice in a row before they work probably .  both of those app's need updated big time compared to the roku 3 Hulu Netflix version's  which i have also. to be honest it's kind of up in the air which is better if it was not on sale and i had a 50 dollar Amazon gift card i would be second guessing purchases get going Amazon on updating your Apps ...  This is a powerful little piece of kit don't hold it down by crappy apps and sloppy code.. or people will stick with other offerings like Roku ect because right now i am not so sure....", "verified": true, "helpfulness": "0/1", "author": "aaron thompson"}, {"rating": 5.0, "review": "Love it!!! So easy to use, this thing is fantastic!!!", "verified": true, "helpfulness": "0/1", "author": "MiSSJiGGaJ"}, {"rating": 5.0, "review": "Love the options and the fluid menu system!", "verified": true, "helpfulness": "0/0", "author": "C2"}, {"rating": 5.0, "review": "This is my third!", "verified": true, "helpfulness": "1/4", "author": "kameir \"Kameir\""}, {"rating": 5.0, "review": "I absolutely love my Amazon Fire TV. Had it for awhile and thought I would need someone more hookup savy than me to help me set up so it sat.I finally buckled down out of shame to set it up so I pulled up a youtube video on set up and followed it, though the given instructions were the same but I thought there had to be more to it. Hooked it up with just one purchased cable required and synced and downloaded which only took maybe 2 minutes and ready to go. Easy navigation and voice Que work worked great.downloaded HULU, Netflix, Pandora and Amazon Prime is already in unit. HD is stunning and full screen on most programs and gave my 8 year old Daughter about 2 minute instructional and she had it down no problem. I can' speak of the gaming quality but plan on getting game controller. An impressive bonus is the screen saver which is a slide show of stunning landscapes from around the world which my Daughter and I often just let roll through for fun. Really breathtaking scenes in HD. If your on Prime than this is fantastic deal.", "verified": true, "helpfulness": "0/0", "author": "Matt802"}, {"rating": 5.0, "review": "I love everything about it.  Best purchase on Amazon thus far.", "verified": true, "helpfulness": "0/2", "author": "Angela"}]