[{"rating": 5.0, "review": "I recently replaces my Roku with a kindle Fire TV and I am glad I did. We have other Kindle products and I love the way the Fire TV enhances the digital experience in our home. We have Freetime unlimited and the kids are used to the parental controls on their HD6 tablets. The Fire tv has the same feature. In my opinion the Fire TV is the best way to stream content today.Pros: great picture, easy setup, simple parental controls, and all of the content I need.Cons: The Amazon content is pushed on you. Their videos and content are at the top of the home page. You have to scroll down to get anything else.", "verified": true, "helpfulness": "0/0", "author": "jaydub1977"}, {"rating": 5.0, "review": "life is good.......I trust anything Amazon offers.......I love it", "verified": true, "helpfulness": "0/0", "author": "Venus22 \"journey1122\""}, {"rating": 1.0, "review": "This item sucks! Tried on all of my televisions and could not get it to connect. I returned it and was only given 70 dollars refund despite the fact that it is defective. I ordered the Firestick and it worked great with no problems connecting.", "verified": true, "helpfulness": "5/8", "author": "Veronica Amenedo"}, {"rating": 1.0, "review": "I was disappointed in the limited amount of TV shows available also I am deaf in my left ear and use close captioning a lot which is not available not for the deaf or hard of hearing", "verified": true, "helpfulness": "3/6", "author": "Sylvia L Bauer"}, {"rating": 3.0, "review": "Have enjoyed FIre TV. I have used mainly the Netflix App. Have also used the Slingplayer App. When using the Slingplayer App, the signal is not as good as with Netflix.There are two Apps that I would like to see. First, Golf Live Extra (Golf Channel) and PGA Tour App (to be able to watch live golf)", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 2.0, "review": "Easy to install and operate. Disappointed in unsupported connectivity to a variety of external sound systems..!!  Really??? Amazon Fire TV expects you to opt for flat screen TV speakers vs. surround sound systems?", "verified": true, "helpfulness": "0/0", "author": "mbiss"}, {"rating": 5.0, "review": "Works very well great purchase", "verified": true, "helpfulness": "0/0", "author": "Jeff Peterson"}, {"rating": 3.0, "review": "I have a lot of fun with the Fire TV, but also some frustrations.  My internet connection is slow at times, and Amazon movies stop to buffer a lot.  If the same movie is in Netflix, I would rather watch the movie with the Netflix App.  I am guessing that the Netflix servers have better technology to handle limited bandwidths.I have rented Amazon movies, and I have been happy with the outcome.  Of course, I have realistic expectations of movies delivered with an internet connection.  I have a soundbar attached to the TV and the sound from the movies it is pretty good.  I prefer renting from Amazon than from Apple iTunes (I also have an Apple TV). Apple TV must download the whole movie before watching, which means 2 to 3 hours of download time before the movie is available for play. On the other hand, the Fire TV movies are available right away after clicking the rent button. The image quality will vary depending on the internet speed, but I prefer such over waiting for hours.  It is a chore to get my family to seat in the living room to watch a movie, and when we make our minds to do so, we want the movie now.  It is too bad I keep on getting those silly iTunes cards as present and I have no option but to rent movies or pass those cards to others.  I do not buy music from iTunes, I prefer to buy from Amazon because I want my music to play on any device.That brings me to the topic of music. I have a large collection of music I have purchased from Amazon over the years.  I greatly appreciate that Amazon makes available the purchased music to play from the cloud.  The Music Prime service is wonderful, I can discover new artists or new songs from the artists in my music library when available in the Prime service.  The lyrics display is a piece of genius.  I have had some parties with friends singing to the lyrics.  The Prime songs can be easily downloaded in the iOS Apple devices.  I carry a large collection of Amazon Prime music downloaded in my iPod, which I listen to while in the car and wherever.  The iOS software is pretty good.  I wish some features were available such as ranking songs or deleting a song when in the Play now screen.  At least, the Amazon iOS software is better than the software in the Amazon devices such as the Fire TV and the Amazon Kindle.An that brings me to grievances.  The music software in the Fire TV and in the Amazon Kindle HDX is very beta.  It has many rough edges that limit the enjoyment.  The software is very inconvenient for large music libraries (say with 500 albums or more).  For example, in the Fire TV you have to click one-by-one to browse.  Therefore, I can only listen to my artists and albums that start with A or B.  It requires a lot of patience to get to my preferred artist, U2.  In the Kindle, the option is to finger browse, which is better than clicking, but still very inefficient.  On the other hand, in the iOS you can directly search by text or initial.  After finding the artist in the iOS software, an option is available to download all of the songs by that artist to the device.  Such option is not available in the Kindle, for example.Another problem with the music software is the playlists.  Playlist do not synchronize in the Fire TV and the Kindle Fire.  After spending a lot of time creating a playlist, the playlist in the Kindle contains only a small fraction of the songs I requested to be added.  On the other hand, using the PC software, either a web browser or the stand-alone Windows software, I can verify that the playlist is complete in the Amazon cloud.  I can use the iOS Amazon Music app to continue modifying the playlist and synchronizing with the cloud.  The Fire TV and Kindle Fire will not synchronize with playlist modifications using the PC software or iOS apps.  Why the playlists do not synchronize?  I do not know. I have tried restarting, disconnecting, changing settings and nothing.  Also, the Fire TV has some songs in my library that should not be there, after I deleted them a long time ago.  There is a problem with cache and synchronizing in both the Fire TV and Kindle Fire.  The Kindle Fire does offer some functions that I do not find elsewhere such as finding related playlists to an artist, and quickly adding songs from an artist to the library, but the finger browsing of my catalog is driving me nuts.I hope Amazon fixes these issues and releases a music software for Amazon devices that is more mature.  When re-designing the software, it should be assumed that music collections are big.  The music software in the PC and iOS devices is pretty good to handle large libraries.I still like the Amazon Music Prime a lot, I will renew my Prime membership for this and the other services, but the music experience could be improved with better software.The Amazon devices (Kindle, Fire TV) are recommendable, but let's face it.  It mostly makes sense to own these devices if you have a Prime membership.  If you do not, and do not intend to become a Prime member, then get a Roku 3.  If you have Apple devices, then consider an Apple TV and take advantage of the Airplay function.", "verified": true, "helpfulness": "1/1", "author": "Edward"}, {"rating": 4.0, "review": "Great product. Just won't play purchased videos from Vudu and Google play movies and tv. Wish that could be added to Amazon Fire TV options or app selections.", "verified": true, "helpfulness": "0/0", "author": "Mark Williamson"}, {"rating": 5.0, "review": "So far so good. Even have sling tv with the device.", "verified": true, "helpfulness": "0/0", "author": "justin ruiz"}]