[{"rating": 1.0, "review": "I really don't lik the idea how easy it is to buy a movie. One wrong finger move and you just bought yourself a movie. Layout of your channels is not organized. I don't lik all the suggested channels and movies taking up so much room. Trying to find channels is not easy as Roku. I like my channels only right there on the screen. I'm glad we didn't buy this and won it in a drawling. To me it's a waste of money.", "verified": true, "helpfulness": "6/10", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Arrived super fast. Very easy to install. Works great at 3 Mbps! It even impressed my skeptical wife, that's a huge success.", "verified": true, "helpfulness": "0/0", "author": "P. Roberts"}, {"rating": 4.0, "review": "Very good item for  Very good price.", "verified": true, "helpfulness": "0/0", "author": "Adolfo Soto"}, {"rating": 1.0, "review": "Fire TV works when it wants to and does great when it does. Fire loves to crash. I can barely make it through a movie without it crashing and restarting. Overall piece of junk. Buy a rooku or something else.", "verified": true, "helpfulness": "5/6", "author": "Kevin Zeglen"}, {"rating": 5.0, "review": "unit is very stylish. Remote is perfect. navigation is really easy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "0/0", "author": "Shawn Connors"}, {"rating": 5.0, "review": "Best current media streaming device.", "verified": true, "helpfulness": "0/0", "author": "euorr"}, {"rating": 3.0, "review": "Hard to find options that are FREE to watch. Unless, prime member. And Hulu plus is awful, always freezing.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "when I tried and link it to my wireless network, the software update wouldn't work.  i had to plug it into the Ethernet to get that part done. so it downloaded the SW update but now it is registering me as being a UK subscriber. there's no way to change this. when I ask for someone to call me, nothing happens. and now the only way I can seem to get anyone to notice is by writing this review.  really this is just a call for HELP.  I love amazon (*)  so please, help?the * is because I got sent 3 copies of the same book today having ordered one.  better than none, but don't need the extra two!", "verified": true, "helpfulness": "2/3", "author": "George Patterson"}, {"rating": 3.0, "review": "NO HDMI CORD; bummer; for the cost a HDMI cable should be included. I was not able to use right away due to this. Works great, and would have given a 5 star. HDMI cables are so cheap anymore; they should be included.", "verified": true, "helpfulness": "1/4", "author": "Dan Lilly"}]