[{"rating": 5.0, "review": "Looooove my Fire TV!!!!", "verified": true, "helpfulness": "1/1", "author": "Laura Stiefel \"Laura Stiefel\""}, {"rating": 4.0, "review": "Great product and very smooth operating. One of the reasons I went for the Fire TV over other products and I'm glad I did. If there was an issue I would say is that I would like the have all my free Prime Movies and TV shows isolated.", "verified": true, "helpfulness": "3/3", "author": "Patrick Wiborg"}, {"rating": 5.0, "review": "I've used this for a few months now. It's amazing that this quiet little box has taken over 90% of xbox use. More specifically, netflix, hulu, and random mucking around. I don't game with it - yet. I wish I could hook a blueray player to it so I could watch my few 3D titles.Also - I wish it had an off button on the remote. It would make switching between media devices a lot easier because the automatic HDMI switch in my projector tends to get trapped by Fire TV. It would automatically switch to another device if the Fie TV wasn't putting out an HDMI signal. Yes, I know about putting it to sleep after wading through menus. What a pain.I tried using voice search to tell it to sleep. It searched for content instead. sigh.", "verified": true, "helpfulness": "0/0", "author": "Tyler Forge \"realist\""}, {"rating": 1.0, "review": "My house burned down within a week of receiving this device, and the fire started in the outlet where the unit was plugged in. I never noticed if it was overheating, but I lived in my house for 16 years without any trouble with the outlet or anything else plugged into it. It is just really eerie.", "verified": true, "helpfulness": "3/6", "author": "Spring Parker"}, {"rating": 5.0, "review": "the content is all there like the rest. a good overall choice with easy menus. the price is a bit higher but you get more inside and expandable (usb stick) storage. I also got a 5 payment plan offer billed monthly ($20). the fire also has some gaming capability(get a separate controller).", "verified": true, "helpfulness": "1/1", "author": "SF GIANT-49ER \"JOMO\""}, {"rating": 4.0, "review": "Love it. No problems so far.", "verified": true, "helpfulness": "0/0", "author": "Michael Cope"}, {"rating": 3.0, "review": "This is a fine streaming device.  I definitely appreciate the snappy performance, the built-in services and apps, and the ability to download other apps from the Amazon Market.However, why are there no network TV apps available for this device?  They are in the Marketplace, but only for Kindle?  Come on, Amazon.  If the apps and content are licensed for one Amazon product, why not another?  After all, these are tv shows, and my Fire TV is connected to my TV.Can't download CBS, NBC, ABC...  I was going to buy a couple more Fire Sticks for other TVs in the house, but I'm honestly reconsidering going Roku.", "verified": true, "helpfulness": "2/2", "author": "B. Russell"}, {"rating": 1.0, "review": "I tried the Amazon fire stick.  It was junk.  We had to wait for things to upload, or there were interruptions in service....aggravating.  I have high speed internet/cable  I never have issues.  Then, I upgraded to Amazon fire TV thinking that would help.  Man.  It was no better than the fire stick.  Then I bought Apple TV.  Works BEAUTIFULLY.  IVE HAD IT FOR FOUR MONTHS WITH NO ISSUES.  Too bad I can't return the junk I spent good money for.  I'm out a couple hundred bucks.  For total, wasteful crap.", "verified": false, "helpfulness": "2/5", "author": "monica schlegel"}, {"rating": 5.0, "review": "I own a Roku 3 and an Apple TV and the Fire TV is my favorite. Because of the faster processor and greater memory things load so fast, play well without glitching and works well with all the Amazon devices too. The Digital Dolby sound is cool too especially on my theater sound entertainment system. Very nice!", "verified": true, "helpfulness": "2/2", "author": "SGTGWJ"}, {"rating": 4.0, "review": "the search by voice is impressive!!!", "verified": true, "helpfulness": "1/1", "author": "James Rotta"}]