[{"rating": 2.0, "review": "UPDATE: May 15, 2015 Netflix issues continue.I have been hanging on hoping the Netflix and/or Amazon would get these issues resolved, but it seems that isn't going to happen.  Netflix still 'stutters' the video after a while, requiring a clearing the application cache and then rebooting the Fire TV.  Just clearing the cache will not resolve the issue, neither will just rebooting the device.  This means waiting minutes just to jump into Netflix.  The problem is bad enough that today we decided to give on on the Fire TV and order a Roku 3.  I really wanted this device to work out.  The tech specs appear stellar, but the execution of this device for anybody who uses Netflix is poor.----Original reviewThe Amazon Fire TV works very well with all Amazon content, so as a prime member I'm happy with that part of it.  The voice search is also very nice, but it does not search into Netflix which makes it much less useful.  Speaking of Netflix, the Netflix App on this device is currently less than stellar.  It sometimes stutters the playback and this week stopped working altogether (requiring a full Reset to Defaults to get back after calling customer support).  Overall for about the same price I feel I should have went with the Roku 3.  I've never had any trouble with the two I owned.  So far the Fire TV has had a number of small issues, and the major Netflix issue.  It just seems like this device just isn't quite ready for prime time.", "verified": true, "helpfulness": "3/4", "author": "DaveC"}, {"rating": 5.0, "review": "have not hooked it up yet", "verified": true, "helpfulness": "1/7", "author": "David Taulbut"}, {"rating": 5.0, "review": "I love everything about it, but my favorite feature is the voice activated search.  I only wish there was some way to filter Prime eligible video from those that must be rented or purchased.", "verified": true, "helpfulness": "0/0", "author": "April Bracy"}, {"rating": 5.0, "review": "This box streams Youtube much faster than my old D-link did. It also has a lot to offer! I think this was a great purchase.", "verified": false, "helpfulness": "0/0", "author": "Renate Galloway \"Renate\""}, {"rating": 5.0, "review": "Why Five Stars?  It setup in less than 2-minutes and works great!  If I'm watching TV on satellite and I go to turn-on my Amazon Fire TV, my Yamaha RX 475 receiver recognizes exactly what I'm doing and switches over to the Amazon Fire port.  Yep, boom there it is!  No other button to mash.  Setup is incredibly easy, picture quality perfect and will help make cutting off satellite TV so easy in December when my contract runs out.", "verified": true, "helpfulness": "2/2", "author": "William J. Sandford"}, {"rating": 4.0, "review": "It is everything I expected.  Plus the pictures and music down load was a bonus.  Both my wife and I are happy with our decision to switch from the Disc to Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Jim Miller"}, {"rating": 4.0, "review": "Okay, so we've had it for about four weeks now. It's really great, it is. But. . . I bought it for my kids, plural, and there can be only ONE profile. So my two kids that like to play Minecraft have to play in the same area of the world. Also, all of the achievements credited to one person. Storage is somewhat limited, 8GB. Really? It would also be nice if they included Audible as one of the apps. It would be great if the kids could choose their own stories to listen to at quiet time. Other that that, it's great. A lot of free games that the kids really like, and even the paid apps aren't all that expensive (less that coffee). I didn't think the Smithsonian channel would get so much play, but my littlest nature boy loves it! So, I'm giving the Fire TV only four stars because I'm hoping the profile thing can be fixed in the software. The storage thing I don't know. And I think Audible is an Amazon company. . . so, I'm gonna keep my fingers crossed. :)", "verified": true, "helpfulness": "0/0", "author": "M. Shell \"Boobie Mom\""}, {"rating": 5.0, "review": "This thing is terrific.  I LOVE Amazon Prime, and this makes accessing those movies a breeze.  Easy to install, affordable, and compact.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Julia B"}, {"rating": 4.0, "review": "Very! easy setup , clicked right to Netflix, Youtube plays well  You need more apps and access to adult apps", "verified": true, "helpfulness": "0/0", "author": "P. Lipscomb"}, {"rating": 5.0, "review": "I am really impressed!  Streaming movies to my tv is so easy and the picture is amazing.  I didn't think the voice controller would work as well as it does but it makes it so easy.  If you have kids or grands you will want to order the game controller when you get your fire tv.  There are many games to choose from and will keep them (or you) engaged for hours.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]