[{"rating": 5.0, "review": "I have a fairly new (less than 12 months old) LG Smart TV and the performance of Amazon Instant Video and YouTube was/is very poor via wireless and ethernet. So I took a chance and purchased a Fire hoping that is would perform better.It's awesome. The download speeds are great. Nothing changed except instead of trying to stream from my TV, now I'm streaming from the Fire. I'm assuming it's because of the blazing fast processor speeds.Anyway. A great purchase.", "verified": true, "helpfulness": "0/0", "author": "Jim Deitzel \"Jim\""}, {"rating": 4.0, "review": "Amazing device, super high quality, delivers 1080p on everything from netflix to hulu. Very responsive and load times are infrequent. The microphone is super accurate. I'm about to get the controller as well, so I will update this review and talk about the games. Blows away the competition in its price rangePros:-Only quad core set top box in its price range, super fast processor.- Access to almost all major viewing services like hulu, netflix, amazon instant video, showtime.- Predictive software actively tries to remove load times from your viewing experience- Has a growing appstore with really good affordable games for the casual gamer- Certain apps like youtube and netflix let you use your tablet or smartphone to search for videos and then play them on your tv, without having to load the videos on your phone or tablet.- For gaming, it uses any bluetooth controllers, not just the Amazon controller.Cons: -You can second screen, but only from an Amazon tablet. Doesn't (yet) have the ability to second screen from any android device, but supposedly this is being worked on. Once this problem is fixed, I would not hesitate giving this product a 5 out of 5", "verified": true, "helpfulness": "0/0", "author": "Gil Maman \"Gil\""}, {"rating": 1.0, "review": "You'll be happier with a Roku. I have both and the Roku is superior. Once you get past the ability to talk to the remote and tell it what you want, you'll discover that Amazon Fire doesn't have the variety of Roku. You can watch Amazon Prime on Roku plus many other channels..I have problems with the menu skipping and garbled audio. I called Amazon nearly 3 weeks ago and as of the writing of this review, still haven't resolved the problem.", "verified": true, "helpfulness": "5/7", "author": "Walter L. Manns \"Lee Manns\""}, {"rating": 5.0, "review": "Love it.  I've been recommending to everyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is my first time dealing with this type of video device. Obviously it is combined with Prime. I was a little hesitant at first because I  thought the prime material would be minimal and of low quality. Boy was I mistaken. Many of the movies are top quality and new ones are added often. Some of the better mini-series are a little more iffy in that they will let you see the first episode on prime but they will charge a minimal fee for additional episodes.", "verified": true, "helpfulness": "0/0", "author": "voyager"}, {"rating": 5.0, "review": "enjoyable and easy to use", "verified": true, "helpfulness": "0/1", "author": "w gale reid"}, {"rating": 5.0, "review": "This is really cool to have better than gbox!", "verified": true, "helpfulness": "0/1", "author": "Mike"}, {"rating": 4.0, "review": "This should be a 5 star product but it is missing one key feature.  It has no web browser capability (at all).  You can run content through applications.  For example, you can access your YouTube.com content through the YouTube app.  What you cannot do with this product is surf over to the comedy central website or PBS website and access free content from those venues.  You can still direct connect a laptop or PC for these features but the FireTV does not yet replace those devices.  What is strange is that the Kindle Fire does have a web browser (Silk), so you would think that it would be easy to port this over to the FireTV device.  My hope is that this feature is added or that the amount of apps increases dramatically to cover free content from providers like PBS kids and Comedy Central rather than just relying on the Amazon Prime service and limited number of apps for their content.Don't pay too much attention to the negative reviews about the search capabilities of this device.  The search capabilities on this device are somewhat cumbersome BUT you can easily overcome this with a device like a personal computer with internet access.  Go to the amazon.com website and log onto your account.  Search for what you want and add it to your watch list.  What the device does better than the PC/device access is making new and featured content much more visual.  The voice feature works well and adds another layer of search capability.  Once you figure out what works best for you,  how to search for content on the Prime service becomes a non issue.What is great about this device is how fast and clear it streams video content.  You can watch your Amazon prime content, any videos you buy, sports, Youtube, Hulu in FULL HD and without any pauses, delays, or quality loss.  It is very impressive.  Better than a personal computer and soooo much better than the ondemand quality you get from something like DishNetwork .One caveat is that some of the applications like ESPN and Showcase will require you to have a TV content partner such as Dish, DirectTV, or cable to access their pay content.  For a consumer like myself who runs a HD/digital antenna and uses the FireTV to supplement content this can be a bit of a letdown.  But, there are a large number of content providers than give you free or for fee access with this device without a cable/satellite service.  For example, MLB will sell your their service without a cable provider.  If you consider how much a satellite/cable bill is for premium services the fees each service costs are very affordable.  Between the FireTV and my antenna I cover almost all of the content I enjoyed before dropping my satellite service and at greater convenience and resolution than my DishTV service or Uverse services ever could and at a very low monthly cost.  It is fantastic.", "verified": true, "helpfulness": "4/4", "author": "Douglas MacDonald \"GameEnthusiast\""}, {"rating": 5.0, "review": "This is probably the most simple to use product that I have used for being able to watch Hulu Plus and Netflix.  I absolutely hated using the blu-ray players to do it.  This unit is so easy to use and we love the ability to speak into the remote!", "verified": true, "helpfulness": "0/0", "author": "Daniel A. Scott \"Eagleman\""}, {"rating": 5.0, "review": "Things sweet!", "verified": true, "helpfulness": "0/0", "author": "Josh"}]