[{"rating": 5.0, "review": "I was tempted at first to use a roku box but after watching the videos on the ability use voice recognition to select content it was a no brainer. That worked well and Amazon has a lot of content to watch, better than NETFLIXs for some things. I lost my control somehow after a couple of weeks and Amazon promptly replace the unit and I sent the remaining box back!.. can't beat that for customer service!.", "verified": true, "helpfulness": "0/0", "author": "Gary Hopkins"}, {"rating": 2.0, "review": "I mean, this thing is pretty cool and all, but the Prime section (Just like Netflix) isn't updated frequently enough. I have been starring at movies like \"Mud\" and \"Flight\" for over 2 weeks now. Give us some fresh content for being a Prime member. Also, the majority of the \"good movies\" are $3.99 - $4.99 ... I could just go right to Redbox and rent a movie for less than this (which I did on one occasion) ... The biggest fail for this, is the non existense of HBO GO app. Seriously .. how does this not have HBO ? .. No Game of Thrones, no True Detective, etc. Overall this is a user friendly device, but the lack of fresh content, and no HBO is terrible.", "verified": false, "helpfulness": "3/8", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got my Amazon Fire TV last night and had it hooked up within minutes.  I have a smaller TV that I like to keep in my bedroom that has no atena or cable hooked to it.  Now I can relax in bed and watch all my favorite amazon shows.  So portable and small I could even put it in any of the rooms in the house!  Way to go amazon!  One of your best products yet!!!!!!", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer \"Lissa\""}, {"rating": 3.0, "review": "I have tried using this on both of my 2.4 and 5 ghz wifi signals and the results are the same, Netflix and Plex stutter constantly. I even tried unplugging the Fire TV, but still the problem persisted. Hopefully a future update fixes this problem, but for now I feel that my Roku 3 does a much better job.", "verified": true, "helpfulness": "2/3", "author": "Jeff"}, {"rating": 5.0, "review": "I love it!  Easy to set up and use.  Amazon has done it again.  Fire TV is better than cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Searching\""}, {"rating": 5.0, "review": "I recently got this because my five year old daughter took possession of my Roku HD. Now she loves the Amazon Fire TV, especially watching the family photos and videos on amazon cloud. We are subscribed to Netflix, Hulu+ and Amazon Prime, but we seems to use Netflix all the time. The Amazon Fire TV's Netflix app is great, and the Netflix Kids option is very easy to use for her. I like very much the products looks and feel. Very easy to setup and connect to the internet. I highly recommended!", "verified": true, "helpfulness": "1/1", "author": "Jose J. Batalla"}, {"rating": 5.0, "review": "Very happy with the purchase and even happier that it can be sideloaded with XBMC. What's not to love being able to get this done using an Android device and 2 apps to connect to the FTV and be able to SL in under 3 minutes? Couldn't do that with an ATV or Boxxee Box. Not to mention being able to connect to a dedicated DLNA server and access all of our movies, music and photos. Can also use a Favi mini USB keyboard rather than the remote control. Overall happy with the device. All of the apps/programs/etc load rather quickly not to mention ASAP. Makes rewinding a snap. Much faster than our Sony 3D blu ray player but not so fast as the nMedia 6000B HTPC which is running Windows 8.1 x64 bit. Can't compare it to a Roku or any other flavor besides ATV and Boxee Box. However... If you're someone who is sitting on the fence wondering if it's for you (FTV), well only you can answer that. For me and my family, it fits our entertainment needs. Well... The thing sits in our master bedroom so I guess it's me and the Mrs. who kind of dig the thing... There is one thing.... The UI is IMO kind of clunky. Not to the point to where I/we want to throw shoes at the wall or nothin but could use a bit of sprucing up. Will be interesting to see if folks are able to add skins to the unit since it is Android based as well as perhaps drop a different version all together.", "verified": true, "helpfulness": "1/2", "author": "R. bell \"dudeplayingtheotherdude\""}, {"rating": 5.0, "review": "I recently installed Amazon Fire TV in place of a Roku box I had and I am thrilled! I've used Roku for years with varying degrees of success, but no more. The Amazon box is superior in every way--picture quality, features, ease-of-use, reliability, you name it. This is just the latest in a list of fine Amazon offerings I use. I have two Kindle readers as well, have been a Prime user for years, and use cloud and MP3 player. I will always check out something new from Amazon over any competition.Keep up the great work!", "verified": true, "helpfulness": "1/1", "author": "Harley H. Puthuff"}, {"rating": 5.0, "review": "Very well done! Easy set up, no problems thus far with the device, have not tested voice search but will.", "verified": true, "helpfulness": "0/0", "author": "Gs \"Gs\""}, {"rating": 4.0, "review": "I recently got this because of my three year old daughter.  We originally purchased DVDs for her to watch in her room on her dvd player but after a month of use the dvds would be so scratched they wouldn't play. we started buying digital DVD on amazon and letting her watch them in the main living room this obviously prevented the adults from enjoying some down time ;) She is three so we have a non-internet enabled TV in her room (for parental control on what she watches and accesses - hence no cable connection)  So when I heard about this device I immediately purchased it. Un-boxing and setup took less than 15 minutes and was a breeze to get running. The controls are intuitive and easy to understand and the visual menus let my daughter see and pick what she wants to watch.That said I only have one Con about the device - Parental control.  When I setup the device it asks if you want to enable parental control in the form of a pin (if you already have one setup with your linked account it uses that one)  the problem I have is that once parental control is enabled it is required to watch ANYTHING even already purchased content.  I cannot say prompt for pin only on PG or higher rated content or to purchase content so when my daughter goes to our movie library and selects Dora the explorer to watch I have to enter the pin for every episode she wants to watch. I am pretty sure this is a bug or maybe I don't understand how to configure it differently but it is definitely a pain in the but to run to the device every 30 minutes to input a code for the next episode of a children's cartoon.Other than that I love this device.", "verified": true, "helpfulness": "0/0", "author": "Andrew R Roe"}]