[{"rating": 4.0, "review": "ok for netflix. prime has way to go- kinda wish i'd gotten apple TV, but it has potential. Needs better free movies or some agreement with HBO or something to make it to the next level.", "verified": true, "helpfulness": "0/0", "author": "Conrad R. Gagnon"}, {"rating": 5.0, "review": "Use it all the time. Instantly gets you everything you need. If you are already a Prime member you can stream so much content its a no brainer. I bought this for the bedroom as in the other rooms of the house my Playstation 4 handles all the streaming, but to spend $80 on this box and get all this is a bargain.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "I am not really happy with this product. I bought it for husband cause he loved the idea of the voice command from the remote control...This was meant to replace my Apple TV. ( I needed for another room)At first go, the amazon fire TV worked like a charm but one week after install the voice control did not work...and continues not working. It has never been dropped or handled roughly, it's storage in a box inside of our entertainment center and it just broke.To make matters worse, we ordered \"Lucy\" (by typing the title cause or voice control remote does not work) and the movie wasn't available for us to watch at that moment, it gave us an error massage that in sum asked to came back later...We waited a few minutes and NOTHING. Well, we ended up ordering \"Lucy\" thru our cable provider. We did NOT watch the movie thru Amazon but still had to pay for it. I sent a email to amazon complaining about the problem and received a auto replay to troubleshoot someone else's problem. WOW!!!!Piece of junk on my opinion, needless to say Apple TV its back in action.", "verified": true, "helpfulness": "1/2", "author": "Daniela"}, {"rating": 5.0, "review": "Amazing piece of hardware. Fit for every entertainment need.", "verified": true, "helpfulness": "0/0", "author": "Luis José López Miranda"}, {"rating": 5.0, "review": "Fire TV is Awesome! Our LG Smart TV is great, but the Fire TV Quad processor is the best, 1080p HD, and voice recognition is ideal. I know people that have Chromecast and it does not even come close to Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Scott Hickey"}, {"rating": 5.0, "review": "The wife and I finally cut the chord from cable/satellite, and are happy we did.  The Amazon Fire TV allows us to watch the shows we wan't to watch with HULU, Netflix, and Amazon Prime.  We may have to wait longer to catch up on the shows, but its worth it not having to be a slave to cable providers.  The Amazon Fire TV was stupid simple to set up, and very easy to use.  The device comes pre-loaded with most apps you'll use, and it is easy to download and install others.  It is also a gaming system, although I haven't used this feature.  I look forwards to buying the gaming controller so I can try out the games.  I also like that the remote is Bluetooth so you don't have to point the remote at the box; a great feature for lazy bums like me who can't be bothered with lifting my arms off the couch.  You can also search by speaking into the remote, although that only applies to searches through Amazon Prime; it doesn't search through HULU or Netflix...yet.  I am very happy with my purchase.", "verified": true, "helpfulness": "1/1", "author": "FilbertBobstop"}, {"rating": 5.0, "review": "Buy this! If you don't have a smart tv, buy it now! We are having a blast. Now we can watch all of our Netflix and Amazon favorites on our 47 inch Philips instead of our laptops and iPads. And, bravo to the designers of the sleek and simple itty bitty remote.  SO glad we bought it!", "verified": true, "helpfulness": "0/0", "author": "Valentino Bull Terriers \"Valentino\""}, {"rating": 3.0, "review": "It freezes up all the time.", "verified": true, "helpfulness": "0/0", "author": "Kevin L. Gage"}, {"rating": 5.0, "review": "Loving it!!!", "verified": true, "helpfulness": "0/0", "author": "Lisa M. Carter"}, {"rating": 5.0, "review": "The Amazon Fire is a wonderful tool for taking back your TV. You can subscribe to Netflex or Prime TV and watch uninterrupted shows to your hearts content. Just a word of warning, you need to have a good strong WiFi signal or you will have interruption of your viewing.  The \"Fire\" will get better reception than the \"Stix\". I tried both, had to finally call the telephone company and purchase additional Mps to almost eliminate interruptions. Went from 3 to 6 Mps, cost about $5 per month to get the additional strength.  WiFi signals are very unsteady! We do enjoy uninterrupted viewing, and can follow a story line much better. DO NOT call NetFlex and ask for assistance, they will endeavor to sell you a security program for your computer that is unbelievable! Just pay to have you WiFi signal increased. It will work just fine.", "verified": true, "helpfulness": "0/0", "author": "Glenn Luttrell"}]