[{"rating": 4.0, "review": "LOVE  this product!  Very easy to use right out of the box.  Although I do wish it did stream HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Cristina Rene Hodge"}, {"rating": 5.0, "review": "We previously viewed Amazon web content (i.e. Prime movies and TV shows) using app through our Panasonic plasma TV.  With the Fire TV, the interface is significantly faster (using the same wired, Ethernet connection), the video quality is astonishingly improved, and the audio quality is similarly increased.  Best $89 I've ever spent on my home theater set up.  Very highly recommended -- even if you already have access to Amazon content through another device.", "verified": true, "helpfulness": "1/1", "author": "Fly Navy"}, {"rating": 5.0, "review": "My son received one for his birthday, and it makes me want to get rid of my Apple tv! We also have Amazon Prime, so we get the music and video streaming as well. It's on sale right now, so I highly recommend it as holiday gifts", "verified": true, "helpfulness": "1/1", "author": "Life Coach Brandi"}, {"rating": 4.0, "review": "Easy to use and full of great contact. I am surprised that a goo many old movies(30 years and older) are not available with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Joseph A. Bird"}, {"rating": 4.0, "review": "The only reason I don't give it 5 stars is because it does not have a Vudu app...other than that this thing is amazing! The hardward is excellent, and the wifi range is much better than the Roku that it replaced. I replaced the Roku in my bedroom with this because it kept dropping signal...I even used range extenders INSIDE my room and it would still drop signal. The Fire TV connects flawlessly, and faster, and I love it. Just wish it had a Vudu app.", "verified": true, "helpfulness": "2/2", "author": "Ryan Shirley"}, {"rating": 4.0, "review": "What a great device.  To give you a little bit of a background I experiment with many devices.  These include Google TV, Roku, Android, and just a standard computer behind the TV.  Among these the computer seemed to be the best solution but it was pricey.  I was a bit skeptical with the Fire TV after all of the reviews I have read.  I am convinced that this is the BEST device now and here is why:  1. It gets Amazon Prime Movies/Music/Photos/TV shows effortlessly with the touch of the mic.(obviously)  2. Android runs under it.  This is good because after you root the device you can get all of your google apps on this bad boy.  (One of the best apps being XBMC - THE BEST online streaming application avalible today)  3. They are constantly updating with more and more content.  Just 6 months into it and they have some 200,000 apps/games.  4. I like using this as a gaming machine and being able to stream my games and movie library to it.  5. It has an ethernet port that eliminates any clunky WIFI need.  6. 5.1 surround sound through optical audio  7. Quad core processor so it is as snappy as can be.  8. Fully customizable.  9. I LOVE THE REMOTE.With all that said it is the perfect streaming device and the ONLY reason I am giving it 4 stars instead of 5 is it doesn't come from Amazon with an \"open system\" or \"rooted.\"  If they would have had this from the beginning this would have beat all other boxes out of the water.  I hope that one day device manufactures will realize that we are humans and like customization and to be able to install our own software and apps.  If Amazon ever gets around to read this I would say job well done with this one.  I would only add that I would like two things in the next generation:  1. Expandability; 8GB goes REALLY fast!  Or the ability to buy a model with more storage like we do for our smart phones.  2. Open system; I understand the majority of people just want something that \"works\" but if Amazon would sell a \"Developer\" version that were completely open and ran any app you can throw at it I think it would go a long way for their \"Fire\" devices.", "verified": true, "helpfulness": "0/0", "author": "GadgetGuruLV \"Chambonito\""}, {"rating": 5.0, "review": "it works great....good by direct tv and dish network!", "verified": true, "helpfulness": "0/0", "author": "Thomas M Williams"}, {"rating": 5.0, "review": "One of the best things about Amazon Fire TV is ready to go as soon as you press a button. No lag, very little buffering, if any. Even though Netflix is downloaded as an app, it comes on very quickly when selected. The clarity of the picture is astonishing. I was a devoted Roku owner for 8 years, had varying issues with the small box, but kept buying the next model when it came out. I recently had a very big issue with Roku box and decided to try Amazon Fire TV.Setup was so easy. I plugged it in, and that was it. Since I ordered it from Amazon, it came pre-registered. It was great. I started watching immediately. I would recommend it to anyone who loves streaming without the cost of cable.", "verified": true, "helpfulness": "0/0", "author": "Lyn Jamison \"Dusa Dog Games\""}, {"rating": 1.0, "review": "Terrible.All the hype maybe caused higher expectations. First ill give it this its faster than the rest. However what it lags its a deal killer and since im too lazy to return it im stuck with it. Guest room it will go... The major problem with this device is limited apps. And the limitation that you cant plug a thumbdrive in it and watch movies.. Whats the point for the USB port then.. Developer uploads.. what a load of crap.", "verified": true, "helpfulness": "1/9", "author": "Alfredo Pisano"}, {"rating": 4.0, "review": "Nice idea.  EZ to use.  Sure beats Satellite. Cost is great. But didn't take me long to burn up all the  FREE movies of interest to me.Just went back to buying  DVDs.To be fair this MAY have options I am not  smart enough to find. Yet.I am a huge man so have minor difficulty w/ the tiny remote.I do very much like the  RESUME ( where you left off ) option.... even after viewing something else in the meantime.", "verified": true, "helpfulness": "0/1", "author": "rb"}]