[{"rating": 5.0, "review": "I absolutely love my amazon fire tv  because I have such a slow internet speed in my bedroom that my amazon,  or hulu  plus comes in very slowly but with my amazon fire tv it comes in great even better than on my smart tv in my living room and i love the voice activation", "verified": true, "helpfulness": "0/0", "author": "ann"}, {"rating": 5.0, "review": "once we got it hooked up, which took a little more explanation that the directions provided (and another cord) we have found it easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Angela Harrell-O'Brien"}, {"rating": 5.0, "review": "Simple setup and operation. Fast response to voice commands. No buffering while streaming. Wide range of streaming choices. Very affordable.", "verified": true, "helpfulness": "0/0", "author": "Wayne D. Oronzio"}, {"rating": 3.0, "review": "Overall the device is ok but I would prefer if all video selections from different services (i.e., Netflix, Amazon Prime) were integrated into one selection area.  It seems like a waste of time to have to search each service to see if they have the movie, tv show, etc....  My other observation is that I find the Amazon Prime, service to be an expensive option to rent videos.  I am already am an Amazon Prime member so it does not seem appropriate that I should have to pay once again to rent a video, show, etc.Generally speaking all recent movies or tv shows require the user to pay a charge/fee.  In general my perception of Amazon Prime instant video service is that it is a ripoff.  I doubt that is the perception Jeff Bezos is striving for.  My suggestion is to use the Amazon Fire TV to watch shows from Netflix and not Amazon Prime Instant Video Service.  My suggestion to Amazon is to rework the business model.  The costs associated with using your service is excessive and under no circumstances would I recommend it.", "verified": true, "helpfulness": "0/1", "author": "Jim T"}, {"rating": 5.0, "review": "I absolutely love it!  As a person who has 2 Apple TV's and 2 Roku's I can say I like say currently I like the Fire TV the best. It's fast, very easy to use and I really like the layout.", "verified": true, "helpfulness": "0/0", "author": "Matthew Somerville"}, {"rating": 5.0, "review": "My children have enjoyed the gaming as the walking dead for xbox lagged. I enjoy the many choices that it has and the remote  is great. Keep working on it . Awesome", "verified": true, "helpfulness": "0/0", "author": "Kellie Lombardi"}, {"rating": 5.0, "review": "The voice control on this remote is amazing , its a game changer! I unplugged the Roku box , Amazon Fire TV is on fire! Luvin it", "verified": true, "helpfulness": "0/0", "author": "clyde ford"}, {"rating": 3.0, "review": "Nice start. I Wish it supported h.265 for future proofing the device, I think we will need to buy next version next year or when it comes out :-)  Netflix for example is starting to stream movies using this feature.  It cuts the bandwidth in half for the same quality or if they want leave the same size but increase quality.  Who knows, maybe amazon might have something up it sleeves, maybe with a future update they will add support for it, if they do it will be thru a software decoder because the current hardware that is inside the firetv doesn't support hardware decoding for HEVC.One other thing that I would change is the ability to search and play movies thru the voice command from Netflix, Currently if it finds a movie from voice command it only gives you the option to buy it or rent from amazon or stream it from prime if its available.  Netflix has tons of more movies that are available for streaming that are not on prime.  Wish it could integrate better with fireTV.  Don't know if this a restriction on amazon's part or if netflix has to update its app.  Most likely its on amazon's part as it would lose money if it gives the option of streaming it from netflix when the user can rent it from amazon.Also I have about 1300 movies in ultraviolet account I wish also that amazon would join the UV association and allow me access to my movies thru their library.", "verified": true, "helpfulness": "6/13", "author": "Alexweb1000"}, {"rating": 5.0, "review": "The voice recognition capability is the best I have seen in any product. Also great interface and sleek looking product. Remote is also super simple to use.", "verified": true, "helpfulness": "0/0", "author": "Maniketh Gopikrishnan"}, {"rating": 5.0, "review": "Pros:-Fast-Easy to use-Affordable $99-Games-Amazon Prime Instant video-Voice controlCons:-Unable to load content from USBI own the apple tv, roku, chromecast, and Amazon Fire TV is by far the best streaming console on the market. RPi w/ XBMC may be able to load content from USB drive but it lacks content from netflix, hulu, amazon prime, etc. I look forward to a more affordable game controller before I purchase one.", "verified": true, "helpfulness": "0/0", "author": "Ben"}]