[{"rating": 5.0, "review": "Hands down best streaming box you can buy!! $99.99 for a streaming HD 1080p box and a game console!!! You can't beat the quality and the price!! If you don't own at least one in your home it's a must!!! Amazon don't please don't change a thing about your Amazon Fire TV box it's perfect exactly how it comes and how it is now!!", "verified": true, "helpfulness": "0/0", "author": "Derek Holtzapfel"}, {"rating": 2.0, "review": "Unfortunately it did not stand up to the hype it freezes have unplug to restart I had to return it maybe I got a bad one out off the batch", "verified": false, "helpfulness": "0/0", "author": "Patrick Tapper"}, {"rating": 5.0, "review": "Love it.", "verified": false, "helpfulness": "0/1", "author": "Valerie Wespesser"}, {"rating": 5.0, "review": "Absolutely!  I love that prime is optional. I steam Netflix and Hulu, total monthly biLloyd for tv $15 vs my cable bill which was $85. My family and u are able to watch all the same shows and movies as we did before on our schedule.We love it so much we purchased a 2nd unit for our bedroom.", "verified": true, "helpfulness": "1/1", "author": "Carole"}, {"rating": 5.0, "review": "I am very happy with this unit and am going to order another for a different tv.Very Happy", "verified": true, "helpfulness": "0/0", "author": "Mark R."}, {"rating": 1.0, "review": "I really hate it .  I got it  with my WellsFargo points.  I like the Roku so much better, you get more channels.  If you like the Smithson channel and others like that you can't get it.  Before you buy one check and see if it has the channels you like.  I went back to my Roku so if any one wants a new one let me know.", "verified": false, "helpfulness": "0/1", "author": "RBJ"}, {"rating": 5.0, "review": "Great product! ASAP makes watching new episodes easy", "verified": true, "helpfulness": "0/0", "author": "Karajan"}, {"rating": 5.0, "review": "I love the speed and the new update with autoplay next episode is great. I can't wait until the fire stick comes in so I can try it out against the Fire TV. My one main complaint (and I called tech support on) is the font size cannot be changed. I have a 32\" TV in the bed room (about 12' x 16') we dont watch TV often in there, but I cannot see the menus from the bed.", "verified": true, "helpfulness": "0/0", "author": "Diamends"}, {"rating": 4.0, "review": "This is a great streaming device.  The quad core processor performs very well, giving very quick response times and navigation.  The voice search is fantastic.  However, I rate it four stars and not five because, as others have pointed out, the voice search only covers Amazon Instant Video.  We have been a Roku household for some time and like the Fire TV just as much.", "verified": true, "helpfulness": "1/1", "author": "Patrick"}, {"rating": 5.0, "review": "I love my Fire TV and will soon cancel my $100 a month cable. One month of no cable pays for my Fire TV. Thank you Amazon Prime.", "verified": true, "helpfulness": "1/1", "author": "Betty Hester"}]