[{"rating": 4.0, "review": "A little difficult to get the hang of it at first, but I feel more comfortable with it now. I like getting Netflix and Hulu plus onto the big TV monitor.", "verified": true, "helpfulness": "0/0", "author": "Loueta K. Chickadaunce"}, {"rating": 5.0, "review": "I am returning the replacement as my original began working on the music element of FireTV. Note that I didn't change anything so you guys must have.", "verified": true, "helpfulness": "0/0", "author": "Jack Morris"}, {"rating": 5.0, "review": "The installation was fast and easy. Once installed viewing pictures, videos and movies was a snap. It reached my high expectations. Highest rating from me!!!", "verified": true, "helpfulness": "0/0", "author": "William F. Thomits"}, {"rating": 4.0, "review": "I would love this IF it had a lighted control.  Most of the time I prefer to watch movies in low light, which means that the control is dark and unreadable.  How much would it have cost to have a backlighted control?  I would have paid the extra cost.  Very frustrating!Other than that, the device is great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great addition to my entertainment system.Excellent with a Prime subscription.", "verified": true, "helpfulness": "0/0", "author": "William R. Voland \"plexxus\""}, {"rating": 5.0, "review": "I am loving this! I still have more to explore, but so far it is GREAT!", "verified": true, "helpfulness": "0/0", "author": "Deborah Williams \"DebroahWms\""}, {"rating": 5.0, "review": "My son has Amazon Fire TV. So one evening my wife and I went to his home to see what it was all about. We were amazed! The clarity, sound and performance we great. The system is incredibly  easy to install and operate. After about an hour, we were convinced that Amazon Fire TV was the way we wanted to go. We purchased ours that night. After years of paying for cable TV with it's constantly rising premiums and poor choices, we were finally able to get rid of the $174 dollar a month cable bill & Sign up for shows \"WE\" wanted to watch. All for about $47 dollars a month plus the cost of internet! Our family is very happy with our Amazon Fire TV!!!!", "verified": true, "helpfulness": "0/0", "author": "ray perkins"}, {"rating": 5.0, "review": "LOVE IT!!!! So easy to use and the voice command is so great.", "verified": true, "helpfulness": "0/0", "author": "Gary Weishaupt"}, {"rating": 5.0, "review": "Loving it!!!", "verified": true, "helpfulness": "0/0", "author": "Kaipo Stant"}, {"rating": 5.0, "review": "Love it. Researched all options. So glad we went with Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "W. GOOD"}]