[{"rating": 5.0, "review": "Great buy if you get the deal with Sling TV (paid 49.99 for it). I only have internet at 6 Mbps and I hardly have issues with speed. Most of the few loading issues I've had was with Hulu Plus, but after unplugging it and my modem for 2 minutes and trying again, it was fine. Netflix is flawless.", "verified": true, "helpfulness": "0/0", "author": "Kim G"}, {"rating": 5.0, "review": "Great product. This is the second one we have in our house. I love the addition of the prime music. I wish Apple would let you stream your music thru your TV streaming devices.", "verified": true, "helpfulness": "0/0", "author": "John King"}, {"rating": 5.0, "review": "I actually had to have 3 sent to me before one worked. I sent the first one to my son in Austin to check out because I thought that maybe I was doing something wrong. It's so simple I don't know what you could do wrong but just to make sure I sent it to him and that cost me $ 26.00. Everything that they sent me was free because I have Prime and when I sent the second one back that was free. I was so happy to finally get everything to work and I do love it now.", "verified": true, "helpfulness": "1/1", "author": "Linda Periman \"Linda\""}, {"rating": 5.0, "review": "So much easier to use and search for shows and movies than streaming through my blu-ray player.  Access to your watch list is a dream....", "verified": true, "helpfulness": "0/0", "author": "Willard"}, {"rating": 2.0, "review": "I am a huge Amazon fan and user. The fire itself has been great. Except for one fatal flaw. You cannot restrict movies by rating. With three young kids, this is a no-brainer. I am shocked Amazon would put this out without that ability. Their solution was the parental restriction which requires a passcode to be entered before EVERY movie can be played, regardless of rating.  The restriction is available for instant video thru the website and apps on Roku, etc. So Roku has features the fire doesn't when playing Amazon content?  RIDICULOUS. Amazon needs to correct this ASAP or push us to using Roku or other streaming devices that allow us to protect our kids.", "verified": true, "helpfulness": "2/4", "author": "mcinniseast \"mcinniseast\""}, {"rating": 3.0, "review": "I got this when it was new. Luckily amazon accepts returns for products. I did its job, but only if you are interested in amazon content. The control functions properly and the voice command is a nice plus.It is just limited, unlike the Roku, in which you can add as many varying channels as you'd like. Its like having a kindle on your t.v. Nice, but limited.", "verified": true, "helpfulness": "1/2", "author": "Miguel A. Garcia"}, {"rating": 5.0, "review": "I love it.  Great investment", "verified": true, "helpfulness": "0/0", "author": "David Robertson"}, {"rating": 4.0, "review": "Faster and easier than Apple TV", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product. Latest software update allows to sink Bluetooth headphones for silent night time TV viewing.", "verified": true, "helpfulness": "1/1", "author": "Carlos"}, {"rating": 5.0, "review": "A very useful product for watching commercial free TV!", "verified": true, "helpfulness": "0/0", "author": "Craig Ulrich"}]