[{"rating": 5.0, "review": "It nice", "verified": true, "helpfulness": "0/1", "author": "jammy"}, {"rating": 5.0, "review": "Great product, much better than Apple TV  which I still use. Easy to navigate and has much more services available", "verified": false, "helpfulness": "0/0", "author": "Bill Wilson"}, {"rating": 5.0, "review": "The system is so easy to use and takes only minutes to set up and ready to watch your favorite shows, movies and programs..", "verified": true, "helpfulness": "0/0", "author": "pat"}, {"rating": 5.0, "review": "Love the fire TV.  Wish there were better/more games for it but that's all.", "verified": true, "helpfulness": "0/0", "author": "Timothy K Jaynes"}, {"rating": 5.0, "review": "Working great, I have xbmc loaded with my plex server streaming to this box.  Really fast and love the voice search.", "verified": true, "helpfulness": "0/0", "author": "cbreaud"}, {"rating": 5.0, "review": "Love it and love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I just installed Amazon Fire TV yesterday and was immediately impressed with the ease of getting it running and with the picture and sound quality.  I mostly bought it for the ability to easily stream Amazon Prime videos, Netflix and Hulu Plus but was impressed with the other apps available and the free programming some of them provide.  Over time, as a few more of these apps become available I could see dropping or greatly reducing my cable.  I am disappointed that the voice search features do not work with Netflix.  I hope Amazon gets that changed soon.  I would also appreciate the ability to search for programming across the installed apps instead of each separately.  (If that can be done I can't figure out how???).  Overall I am very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "John Anderson"}, {"rating": 5.0, "review": "It was easy to install and operate.  I am  very  satisfied.", "verified": true, "helpfulness": "0/0", "author": "carreng"}, {"rating": 4.0, "review": "Works as advertised. Having voice search options is really nice. I am using the wireless connection so far with no latency being noticed in content delivery. I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Brian N Messenger"}, {"rating": 5.0, "review": "I tried CHROMECAST and was very disappointed. I ordered fire TV with my prime membership and could not be more happy. I pluged it in and started watching TV right away. The choices are almost limitless.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]