[{"rating": 4.0, "review": "When I first got my Amazon Fire TV I almost sent it back.  I completed the return form and everything.  I already had an older Roku HD and I didn't feel that the Amazon Fire was any better, but I decided to give it a week's try - and I decided to keep it.  What got me hooked was the voice control remote.  I just love it.  The picture and sound quality are awesome, and it was very easy to setup and operate.  If you don't have a media add-on for your TV then this is a great investment.  If you already have a Roku or Chrome, you might not be as impressed.  However, I have all three devices and I like the Fire better than the Chrome and as well as the Roku.", "verified": true, "helpfulness": "0/0", "author": "Ms. Pam \"I love technology, reading, music, and shoes (not necessarily in that order.)\""}, {"rating": 5.0, "review": "Bought this as a gift for my grandparents. They aren't tech savvy but seem to have gotten the hang of this with no issues. The voice search makes everything a lot easier and they really enjoy their apps. They're still waiting on the WWE app to come to this device but other than that, everything works like a charm!", "verified": true, "helpfulness": "0/0", "author": "Shooter"}, {"rating": 5.0, "review": "Finally able to reduce that cable bill! Love the voice search feature! Has come in handy many of times! Slim and sleek design and love the remote! (Clearly the important stuff.)", "verified": true, "helpfulness": "0/0", "author": "S.Cassella"}, {"rating": 1.0, "review": "The good...The remote and on screen user interface is easy to use.After selecting a program, the \"Customers Also Watched\" suggestions are helpful in finding relevant content.Streaming of Amazon content works well.The unit small.The bad...Voice search only works for Amazon content.Netflix streaming can be intermittent with long waits looking at a red bar.The very poor Netflix app is difficult to use to find content. No suggestions and slow text searching. (Where is the updated Netflix app?)The unacceptable...No way to search Amazon Prime content alone.User is constantly funneled towards paid Amazon content, a clearly manipulative tactic by Amazon.Overall, Amazon Fire is great if you only watch Amazon content. Other channels like Netflix are difficult to use and are not searchable using voice search. (i.e. you need to load/log into Netflix and text search its content.) I have to admit that I regret this purchase and should have gone for a Roku.", "verified": true, "helpfulness": "1/1", "author": "KG"}, {"rating": 4.0, "review": "I love the Countless Prime movies offered on Amazon Instant Videos, I love the Prime Shipping, And I LOVE that Amazon added HBO contents! That was a conclusive deal for me to get Amazon Fire Tv on the very day HBO content became available on Amazon instant videos.However, I own an Apple TV, and I may be mistaken that I may have noticed a slight difference in resolution quality where Apple seems to stand out a little more. I noticed it when I viewed a purchased movie on Apple TV like Wolf of Wall Street, and a prime video on Amazon, that was Bedazzled. It could be the desperate year in which both these movies were made though. But overall the resolution quality in Amazon is still great and sharp. The audio quality I expected it to be stronger on my surround sound system when watching Avengers, but it seemed a bit soft, esp, for that strong surround sound I want when watching an action movie. Though when it comes to Streaming an action movie or playing an action movie on a 50gb Blu Ray Disk, I always choose Blu Ray Disk for optimal modern day action movie experience.I didn't like the interface to navigate through the apps, movies, and tv shows, being that they appear on the left side of the screen. I prefer the movie and TV show selection to appear in the middle of my tv screen. Amazon needs to update this soon!The remote is great. Voice search is great. The Amazon Prime and HBO contents is great! But it would be great if Amazon would create a smart phone app for those who have iPhones and Samsung phones to use as a second remote.Overall Amazon Fire TV is great, I love the hardware design and remote, I love the countless movies and tv shows added. I love the HBO contents! I love the price. And it's definitely worth canceling my Directv cable that I was paying $50 dollars a month to see local basic channels that I cared nothing about to watch, where with Amazon I can pay $100 dollars once a year, and get great movies and tv shows to see at a very affordable price and high quality. Thank you Amazon!", "verified": true, "helpfulness": "2/2", "author": "frank peralta"}, {"rating": 5.0, "review": "I love the voice controller and that you can play games, watch TV, and movies at the same time without switching to another unit. I would tell everyone to buy Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Lorraine Jones"}, {"rating": 5.0, "review": "I'll update this review as I gain more experience with the box, but so far so good.  I've tried the Plex app w/ a Plex Media Server running on a mac mini in the adjoining room.  Both are streaming w/ wireless N.  I can stream 7GB .mkv / .mp4 movie files with no problems.  Browsing box art looks great.  Tried Netflix - also great.  Can't wait to watch more Deadwood w/ Amazon prime.Next, I'll be side loading some android apps, and I want to try XBMC Gotham.  The remote feels good and I love that there's no directionality.  I have an Apple TV -- I've enjoyed that product a lot, and I'll continue to use it.  But Amazon's box is clearly a lot more powerful, and I look forward to geeking out and experimenting with it.", "verified": true, "helpfulness": "1/2", "author": "Robert L. Alley \"calc_nerd\""}, {"rating": 5.0, "review": "I am so glad that I gave up cable, Major money saver and I don't miss it at all.. SUPER EASY to setup!!!!! took like a total of 30 sec and about another 2 for everything to sync up.. LOVE THIS!!!! my son is 2 and everything is there... PLUS NO COMMERCIALS.. yay for us, we cut the cable cord.. :o)", "verified": true, "helpfulness": "2/2", "author": "Barb B."}, {"rating": 5.0, "review": "First off, let me say that this product is AMAZING!  I have literally tried every product possible to stream media.  From game consoles to Blu Rays players and my Samsung TV's.  Nothing, and I do mean NOTHING has ever worked.  Until I plugged this in!  It takes approximately 10 seconds to set up and once you simply key in your information, you're good to go!  Amazon Prime runs LIGHTNING fast!  Literally seconds after selecting a title, it begins to play and never pauses.  I am honestly amazed at how well this product runs.  To top it off you can even play games.  And I'm not talking about cheap \"app\" games either.  There are some true titles to be had!  I wouldn't doubt that within the next few months, AAA titles will be streaming as well.  And with the ability to add an actual controller, you can't go wrong.  If you don't have this box you MUST GET IT!  You won't regret it and at only $99, you can't go wrong!  If I could give it more than 5 stars I definitely would!", "verified": true, "helpfulness": "2/2", "author": "ahoffoss"}, {"rating": 5.0, "review": "I didn't know if I would really use the mirroring or second screen that much, but I do.  My husband is especially excited about it.  We have the NBC Sports app and can watch the extras that are not shown on tv.  Well, now, he is able to mirror the motocross practice and extras to the tv screen and watch just like it is on tv.  Also, able to access the HBO Go app and watch True Detective series and mirror to tv.  Looks just as good as if playing on tv.  Don't have to wait and hope the reruns come on tv.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]