[{"rating": 5.0, "review": "The remote was the thing that impressed me the most.  You don't need line of sight.  What that means is that you don't have to point the remote at the sensor on the device.The voice recognition also worked.First, push the button with the microphone icon on it, say what you want and release the button.  You can tell your voice is registering because it has a sound bar to let you know what is being picked up.  You then get a list of matches and you select the most relevant one.  I wanted Netflix and it sent me to download the Netflix App.  Netflix still searches the same old way, but at least you aren't stuck squinting to see if that letter registered when you clicked the button on the remote.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"kitsinu\""}, {"rating": 5.0, "review": "Have been using my new Fire TV for a few days now.  I've used it to watch movies, download TV episodes, etc.  Everything works great.  I love the voice search which has worked flawlessly and found each search term I've tried.Set-up was quick and easy too.Highly recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Tom Weiland \"tweiland\""}, {"rating": 5.0, "review": "So why all the 1 star reviews?  Especially since most of the reviews are from people that HAVEN\"T EVEN PURCHASED the product.I've had many streaming devices.  Blu-ray (locked up constantly streaming NetFlix), Playstation (I detest the remote), AppleTV (streaming speed has just declined as of late)Is this product perfect?  No.  But neither are any streaming devices.  Is there room for improvement?  Yes, as is with any electronic device.Does it stream quickly?  Anything from Amazon prime is almost instantaneous at this point.  The voice feature is great in my opinion.  I'm glad they didn't clutter it with commands to control menu options.  It searches movies, tv shows and actors lightning fast.  Setup was quick and easy.  The streaming speed from NetFlix shouldn't technically be quicker from what I am reading, but it is.  Darn near double my Apple TV that is connected wireless to an Apple AirPort Extreme.Am I getting rid of my other streaming devices?  No.  For me they all serve a purpose and each have their benefits.", "verified": true, "helpfulness": "3/3", "author": "Lawrence Colson"}, {"rating": 5.0, "review": "I've been playing around with this for the past four days and, for the most part, I love it.Coming from a Roku LT, it's stunning just how fast the hardware is. The image heavy UI is snappy. Every app, including Hulu, runs like butter. You can easily bounce around from apps to amazon video to games with no real wait time. No weird crashes or lock ups. Even voice, something I thought I'd never use, is usually spot on and a great way to select apps and navigate Amazon/VEVO's library.Another nice surprise was finding out that there's no separation between normal android apps from Amazon's store and Fire TV apps. A number of apps I grabbed from the 'free app of the day' promotion were already in my library. Sonic 1 & 2, Sonic CD, King Oddball, Gravity Guy, Buddy & Me, Quell, EVAC.It took a few days for ASAP (amazon's way of preloading videos) to catch on to my viewing habits. Now it instantly loads about 99% of the time on whatever I choose. Even when it doesn't, it still seems to load faster than my old Roku LT.But for all it can do today, there's (potentially) so much more it will be able to do six months from now.Miracast support, Amazon Cloud Player, Amazon Freetime, more apps like HBO GO/WWE Network.And Amazon left the barn doors wide open so who knows what the community is going to do with it. There's already the ability to sideload android apps and a Fire TV version of XBMC in development.As long as support from Amazon, other companies and the community keep coming, the Fire TV could turn into the box to have.", "verified": true, "helpfulness": "2/2", "author": "Charlie"}, {"rating": 5.0, "review": "Very happy. Voice search has worked every time. Movies start quick as. Games aren't for gamers but nice add on. Only grumbles are no HBO or Amazon music cloud player.", "verified": true, "helpfulness": "0/0", "author": "Pacman"}, {"rating": 5.0, "review": "I was able to set it up without any help. Yes, it did an update, but it certainly didn't take long. Before you know it, I was a streaming fiend. I love the size of it. you barely even notice it's there. I'm very happy with this purchase :)", "verified": true, "helpfulness": "0/0", "author": "Mizriajenn"}, {"rating": 5.0, "review": "The voice search alone makes this product. Navigation is very user friends, intuitive. Searching for titles is quick . I used the voice command and said \"John Hughes Movies\" and displayed in seconds. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Joanne"}, {"rating": 4.0, "review": "I like this device more than other reviews I'm reading in newspapers.  Physically, the device and packaging are perfect and obviously being sold at a loss.  The installation required no instruction, but you would probably proceed with more caution if you didn't already own other streamers.The voice recognition in the remote is just awesome and can only get better as it expands to support other content, such as Netflix.  Somehow, the overall speed of the device keeps me using the Fire over 6 other streamers.", "verified": true, "helpfulness": "1/1", "author": "Richard E. Newberry \"richinthenight\""}, {"rating": 5.0, "review": "Received my new Fire Tv equipment on Friday and hooked it up that night.  I even went out and bought a digital audio cable since I wanted to run the sound out to my surround sound system instead of the audio coming from just the TV.  Everything hooked up easily and instructions were so easy.  Took a bit for the unit to download the latest firmware and software updates even with the monster bandwidth I have but in the end it rebooted twice and then came up to the main menu.  I'm already an Amazon Prime customer so I didn't even need to go through any setups.  I did find the settings to change from audio via the HDMI to the Digital audio buried on the last screen menu option but it was easy to change once I found it.I've been watching the Battle Star Galaticca series and the Fire TV knew just where I had left off on the latest season and episode.  The graphics and audio output are amazing and the device did not ever stop to buffer any of the downloads.  I like that it already knew what was on my watchlist and I love how it recommends other tv/movies/shows that are close to the taste of what I already watch.  I've only had it for 3 days now and I'm completely sold on it.  Definitely worth the investment.", "verified": true, "helpfulness": "1/1", "author": "jeffrey p grey"}, {"rating": 5.0, "review": "This device streams fast. I will throw away the apple tv and roku. Cant wait for the cloud music streaming app.", "verified": true, "helpfulness": "1/1", "author": "Brent B."}]