[{"rating": 5.0, "review": "This thing is fast.  I love to watch amazon prime and Netflix.  The voice search makes it easy to find shows to watch.", "verified": true, "helpfulness": "0/0", "author": "W. FORD"}, {"rating": 5.0, "review": "If you enjoy movies or TV its a must have,This will be on my X-mas for all of my love one.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm not one for making reviews, but I'll make an exception this time.  I upgraded from my trusty old Roku XD (don't get me wrong, I loved it), so it's really nice to have Amazon Video and Netflix laid out in a more logical design.  I love how simple it is to use, everything is super fast to load, and the video quality is top notch.", "verified": true, "helpfulness": "1/1", "author": "K. Wight"}, {"rating": 5.0, "review": "My husband had me order this and now he can't leave it alone. The remote is pretty small but works great, has no trouble recognizing our voices. So far everything runs super fast. We use both Amazon prime and Netflix. Voice only seems to work with Amazon movies right now. We have downloaded an app to also use it as a media hub, for the price it's a good deal overall.", "verified": true, "helpfulness": "2/2", "author": "Shopper2012"}, {"rating": 5.0, "review": "This one functions a lot better than Apple TV does and obviously has the games and so forth to its advantage.  It's a much smoother device than Apple TV, and it pains me to say that because I love some Apple TV.", "verified": true, "helpfulness": "2/2", "author": "cap \"Cap\""}, {"rating": 5.0, "review": "Amazon is the real deal. Easy to install and use. I'm not into the mainstream TV programming so I like to ability to choose what I want to watch and when. It has the other similar brands beat hands down.", "verified": true, "helpfulness": "1/1", "author": "Larry G Darling"}, {"rating": 5.0, "review": "Amazon Fire TV is a must to have... Especially if you are paying  the high prices of Cable TV/On Demand .etc  I have cancelled those options & am enjoying most of those same features on Amazon Fire TV.Movies, TV weekly shows, music, games. View on TV screen \"all\" photos, etc that have been saved on my Amazon CloudLOVE IT....not going to pay the high prices of Cable TV again !Easy hook-up (10min) total.Love you Amazon!  Happy..Happy Customer. ;o)", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love this thing, its what I have been looking for in entertainment, its very fast and does gaming well but Amazon slipped up when they only gave this gem 8 gigs of storage space. This is a game changer for sure but it needs at the very least 128 gigs to fully enjoy Fire TV. Would have loved to give Fire TV 5 stars but 8 gigs is being cheap considering that most game titles are now 50 - 300 megs each.oh and one more thing, it needs googles play store so us Android users can use our paid games on this machine as well.", "verified": false, "helpfulness": "1/1", "author": "Jonelyne caruso"}, {"rating": 3.0, "review": "I like the box but I'm on a wired network and overnight it looses the connection so the next day I have to unplug the Fire TV box and let it reboot to find the network again. I called customer service and they said they would look into it and get back - well, they never got back to me and it has been over two weeks. I like it when it works but I hate having to reboot the thing every time I want to watch it.", "verified": true, "helpfulness": "3/4", "author": "wfojon"}, {"rating": 2.0, "review": "STICK WITH ROKU, SIMPLE AND EFFECTIVE. I WISH I COULD SEND THE FIRE TV BACK. TO OPERATE THE FIRE TV IS JUST A UNNECESSARY MESS. EVEN THE MIC COULD NOT FIND A PROGRAM ON FIRE TV (NETFLIX) THAT IS ON ROKU (NETFLIX).\" TO ME, I DON'T NEED ALL THE BS TO WATCH A PROGRAM\" \".I'LL GET ANOTHER ROKU AND BE HAPPY\".", "verified": true, "helpfulness": "4/13", "author": "hjhomee"}]