[{"rating": 5.0, "review": "Works great with Amazon Prime. It also works good with Youtube. I hooked this up very easily to my Samsung Smart TV, and instantly made my \"smart TV\" look very dumb.", "verified": true, "helpfulness": "0/0", "author": "Paperback Writer"}, {"rating": 4.0, "review": "I took off one star because the remote control is too small. It doesn't have enough functions to consider it user friendly, and the up/down button is also too close to the home button which makes it easy to make  mistakes.", "verified": true, "helpfulness": "0/0", "author": "Sleks \"Sam\""}, {"rating": 5.0, "review": "Awesome happy I got it. It works well", "verified": true, "helpfulness": "0/0", "author": "mary lall"}, {"rating": 5.0, "review": "Awesome product!!! Very easy to use and has endless options for entertainment! Very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Lisa M. Stratton"}, {"rating": 3.0, "review": "It is a good value for Amazon Prime members, it is easy to set up and use!  It is still necessary for me to have Netflix? the bad thing is something could be a charge on Amazon? but free on Netflix? so it takes a lot of checking around?? very time consuming? hope they get the glitches out!", "verified": true, "helpfulness": "0/0", "author": "christine s davis"}, {"rating": 5.0, "review": "Pleased", "verified": true, "helpfulness": "0/0", "author": "Lee Johnson"}, {"rating": 5.0, "review": "This is a great product. It is super fast and easy to use. I have had no problems with it. I would highly recommend. It is a great alternative to cable.", "verified": true, "helpfulness": "0/0", "author": "Jason W. Caswell"}, {"rating": 4.0, "review": "Works great, fills in when nothing good is on.", "verified": true, "helpfulness": "0/0", "author": "Janice"}, {"rating": 5.0, "review": "Pretty sweet. Better than netflix", "verified": true, "helpfulness": "0/0", "author": "Derek Blewett"}, {"rating": 5.0, "review": "Amazon is becoming a mammoth. These units are awesome and they have me hooked. The voice command is the best feature yet!", "verified": true, "helpfulness": "0/0", "author": "R. Johnson"}]