[{"rating": 4.0, "review": "Am still learning the fopes.", "verified": true, "helpfulness": "0/2", "author": "Candace Smith"}, {"rating": 3.0, "review": "Amazon should include an App for themselves! Then you could shop in your living room. Still awaiting the voice patch for the You Tube APP instead of manually searching for a song & the Google APP would also be a big improvement.", "verified": true, "helpfulness": "0/0", "author": "Barry F."}, {"rating": 5.0, "review": "Easy to install I was watching tv in 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "Rick C"}, {"rating": 2.0, "review": "It has potential but compared to the Roku 3 ... well there is no comparison!  It is almost IMPOSSIBLE to easily find  and separate free content from content you have to pay for. I might as well have cable for as much as you'd have to pay to view content. I know it's an Amazon product but EVERYTHING is shifted to buy/watch/rent through Amazon. I already paid $99 for the set .. why do I have to pay another $79 for Prime content? I smell bait and switch ...", "verified": false, "helpfulness": "0/3", "author": "Darrell Gary"}, {"rating": 4.0, "review": "thanks", "verified": true, "helpfulness": "0/2", "author": "Donnie"}, {"rating": 5.0, "review": "SO easy to set up! I am not tech savvy.  Very user friendly. A nice upgrade for streaming from the PS3.", "verified": true, "helpfulness": "1/1", "author": "Crystal"}, {"rating": 5.0, "review": "So glad to cut the cord from cable! I am saving a ton of money and there is programming for everybody in the house. I love this device.", "verified": true, "helpfulness": "1/1", "author": "Christine Lentz"}, {"rating": 5.0, "review": "It's heads and shoulders above my old Roku. The picture is clearer, I don't see the loading pauses I used to, and the icons, especially Netflix, now load completely and faster. I like the layout much better than my old Roku, and so far I can't find anything I watched with Roku that I can't with Fire TV. In fact, I see many more choices now.", "verified": true, "helpfulness": "1/1", "author": "Jack Z"}, {"rating": 5.0, "review": "works great...", "verified": true, "helpfulness": "1/1", "author": "JT"}, {"rating": 4.0, "review": "Nice streaming box.", "verified": true, "helpfulness": "0/0", "author": "Adriel R. Andino-Diaz"}]