[{"rating": 3.0, "review": "We really wanted to like this player but in its current generation it is lacking. It is great at streaming Amazon content. My only complaint with it streaming Amazon content is what many other reviewers have pointed out. There is no way to search Prime content separately. That was really annoying. However, its voice search option works fairly well. Really liked that feature. App content is really lacking at this time. The gaming option was pretty cool. Content from our Fire HDX transfers easily. Ran fast and smooth. Set up is a breeze and took no time at all. Warranty is good at 1 year plus the opportunity to expand it to 2 years for a little extra.This is a the great player for people who use primarily Amazon content, Netflix, and Hulu.However, there are a couple things the Roku 3 does better. On the Fire TV, the start screen is primarily Amazon content with a few of the other big players in the streaming market like Netflix, Hulu, Pandora, etc. The Roku start screen is modifiable to add or delete favorite channels for quick selection. Amazon Fire TV involves more searching. The Roku has many hundreds more channels to choose from than Amazon Fire TV. For example, my son loves Anime and discovered the channel Funimation that streams hundreds of Anime shows and movies (for a small monthly fee). It is an available channel on Roku but not Amazon Fire TV. Another thing the Roku does better is when searching for content Amazon Fire TV only pulls up its streaming content. The Roku presents you with every channel that streams that particular content. This allows you to select the best price or option as some movies can be only be bought from some channels while it can be rented from others.Both players are fast and easy to use.So it really depends on your own personal situation which player is best for you. The Amazon Five TV is superior at displaying and playing its own content. It is also a nifty little gaming player perfect for younger kids. The Roku has more streaming options at this time and is better at displaying streaming content.", "verified": true, "helpfulness": "0/0", "author": "jessica l"}, {"rating": 3.0, "review": "its ok. i have amazon prime and whenever i try to watch a movie theres no sound, its junk! it worked for 2 months and now its just crap. avoid this at all cost, the amazon fire tv is a joke! save your money and just buy the kindle fire hdx tablet, you'll love it!**update review 08/12/2014** Today i got an e-mail from Amazon customer service with step by step directions to help solve possible problems involving sound issues. Surprisingly, it fixed my problem of not having sound while watching movies. This made me very happy! Thanks Amazon. However there is a caveat! From day 1 when i first installed & setup this fire tv with an HDMI cable, everything worked & functioned perfectly for 2 months. Most of the settings were the default setting right out the box which was easy. 2 months later to the present time, all of a sudden no sound!?! WTF! I didn't change any settings, i left it exactly how it was on day 1. Did this fire tv just randomly change its setting on its own causing the \"no sound\" problem? Is this something I have to keep resetting every 2 months because this fire tv can't hold a setting? Maybe the software is so poor, it just randomly changes settings on its own? This sounds like a quality control problem to me. So why did i get sound the 1st two months, where as the e-mail made it sound like i shouldn't of had? I've updated my 1 star rating to 3 stars now. Everything is working now & thats a good thing! Only if new movies and tv shows came out faster on amazon prime. By the time fire tv gets the movie or tv show on amazon prime, its so damn old! This is what makes me want to throw this fire tv on the wall and buy a roku insted.", "verified": true, "helpfulness": "1/6", "author": "Constantine"}, {"rating": 5.0, "review": "Totally awesome - the only thing it lacks is the BBC TV programs that you get on Roku", "verified": true, "helpfulness": "1/1", "author": "sussex7 \"avid reader\""}, {"rating": 5.0, "review": "It's great, wouldn't be without it!!!", "verified": true, "helpfulness": "0/0", "author": "Virgil Doty"}, {"rating": 3.0, "review": "TOO HARD TO FIND FREE SHOWINGS-YOU INTIMATE THAT IT'S ALL FREE BUT THEN ONE HAS TO PONY UP MORE $ FOR ANYTHING DECENT!MOVIES OFFERED ARE NOT ANYTHING GREAT.MANY THINGS I WOULD LIKE NOT AVAILABLE(WONDER YEARS-FAVORITE STARS  ++++++++++++++++++++++++)NOT AT ALL HAPPY!DONNA BILL SMITH", "verified": false, "helpfulness": "0/3", "author": "Bill"}, {"rating": 5.0, "review": "Just got my Amazon Fire TV yesterday and I was surprise to say the least!  It's so small and cute!  I thought surely there was a mistake when my package arrived, but nope there wasn't. It was so easy to set up that I did it in less than 10 minutes. I found it every easy to use. So far this is the best streaming device I have found.  It doesn't stall out and have to load every 30 seconds.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Schwartzman"}, {"rating": 5.0, "review": "Love this machine! Better than cable by far! Can't wait for ABC family to be included!", "verified": true, "helpfulness": "0/0", "author": "tamyk14"}, {"rating": 5.0, "review": "So far I love this thing.  Very simple to set up and operate.  It has been functioning beautifully. Everything about it seams to say \"high quality\".  I have two TV's that have been used for streaming video using smart Blu-ray players.  One of the Blu-rays is a Sony and it functioned pretty well, but the fire is much better.  The other Blu-ray player is a Samsung and the Fire works infinitely better than that one. (I have nothing against Samsung, I have a Samsung TV and I think it's great.  However, all I know is that (with respect to streaming video) the Samsung Blu-ray player that I've been using is terrible)", "verified": true, "helpfulness": "0/0", "author": "mrliberty"}, {"rating": 5.0, "review": "Beautiful picture. Easy to operate.  Lots of free movies and shows.  What's not to like?", "verified": true, "helpfulness": "0/0", "author": "Denise  Miller"}, {"rating": 5.0, "review": "The best thing I ever bought it's just that awesome", "verified": true, "helpfulness": "0/0", "author": "brandon lawson"}]