[{"rating": 5.0, "review": "Absolutely amazing!", "verified": true, "helpfulness": "0/0", "author": "Josh D."}, {"rating": 5.0, "review": "We are new to streaming video and started out with a Samsung bluray/streaming combo by son gave me for my birthday. We had problems from the beginning with buffering and freezing. My nerd somn diagnosed the problem as my high speed internet. At 40mbps I should not have issues. Talked with internet customer service, gave up on them (they always have crappy customer service) and changed my speed to 20 mbps since 40 didn't work anyway. My Sansung was not compatible with Amazon Fire so I had not been using the service for the year and a half that I have been a Prime member. Thought I would give Fire a shot, I could return it if there was  no improvement.It was day and night! Fire streams Prime video and Netflix seamlessly. No buffering issues. No freezing. Great picture quality. Good selection.I couldn't be more pleased. Of course, as usual, service, price, and delivery were outstanding. I highly recommend Prime for all it offers and Fire for streaming video.", "verified": true, "helpfulness": "0/0", "author": "Gordon Dalton"}, {"rating": 5.0, "review": "I have had other set top boxes and I like this one the best! Plus allready being a prime member made it a no brained to get fire tv.", "verified": true, "helpfulness": "0/0", "author": "Brewmeister11"}, {"rating": 3.0, "review": "Question:  does Amazon Fire TV work in Mexico? I'm looking for a device that will not be blocked by International Laws the minute I connect to my wireless network down there. I've bought both Chromecast and Roku, neither work down there. Most likely this won't either??", "verified": false, "helpfulness": "0/0", "author": "Teena"}, {"rating": 5.0, "review": "The user experience is quick and exciting. Especially like the Android remote app.", "verified": true, "helpfulness": "0/0", "author": "Douglas Mallory"}, {"rating": 5.0, "review": "I love it faster than the others trade marks. I will recommend this to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Eduardo Colon"}, {"rating": 4.0, "review": "There are some lags and issues when toggling in Bluetooth mode. I had to restart the device to get the Lip sync in order. It takes a bit to getting used to. But is an awesome device non the less..", "verified": true, "helpfulness": "1/1", "author": "Bernard Sebahieh"}, {"rating": 5.0, "review": "Awesome product -- works out of the box with your Amazon content.  Haven't been impressed with any USB stick players by anyone.  Bought originally to stream a Tablo DVR which it does well.  It requires one setting change on the Fire to run the Tablo App.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "Decently fast, lots of available Apps, the voice search function is a somewhat adequate, if not limited, alternative to a keyboard, but it has a small USB slot in the back for a keyboard( I own) or controller( I don't, mainly due to pricing, and lack of interest in gaming on the fire tv)Do you already have prime membership or want it? I say get the fire tv. I think they should begin splitting the $99 prime into the shipping+tv, or regular tv though. I'm sure plenty of people would enjoy just the tv features alone..", "verified": true, "helpfulness": "0/0", "author": "Robert M"}, {"rating": 1.0, "review": "Great device for other stuff but lame it does NOT work with Comcast Xfinity. Boom! Apple TV is still the leader!", "verified": true, "helpfulness": "0/3", "author": "Kristoffer Koster \"Kristoffer Koster\""}]