[{"rating": 1.0, "review": "still not working properly.  so called cable issue.  extremely disappointed", "verified": true, "helpfulness": "0/3", "author": "Deacon \"ltw\""}, {"rating": 5.0, "review": "This thing is great.  All my TV's are dumb so this makes them smart TV's.  I even ordered the fire stick.", "verified": true, "helpfulness": "0/0", "author": "jefftheplummer"}, {"rating": 5.0, "review": "Bought this for my husband after he started watching Netflix on his tablet.  He loves it!  Crystal clear picture and easy to use.", "verified": true, "helpfulness": "0/0", "author": "H. Unger \"Interested Reader\""}, {"rating": 5.0, "review": "Indeed it did meet my expectation,", "verified": true, "helpfulness": "0/0", "author": "oussama aliah"}, {"rating": 5.0, "review": "This is a great item.  I love the availability of what it has to offer, and in your own home.", "verified": true, "helpfulness": "0/0", "author": "Thomasene S. Johnson"}, {"rating": 3.0, "review": "It's ok. The biggest drawback- the lack of channels. I initially bought for the overwhelming horsepower 'under the hood' and immediately regretted it after I saw the channel list - No Google Play services for those of us with non-Amazon phones who, therefore, may have music/movies also through Google Music and Movies. For now, I still recommend to friends and family, get the Roku 3. If Amazon ever releases Google Music/Movie support then I'll update my review.Note: I own 2 Roku devices (version 2 and version 1) and 1 Amazon Fire TV device.", "verified": true, "helpfulness": "0/0", "author": "J. Whiteley"}, {"rating": 4.0, "review": "Not as happy with it as I thought I would be.  I gave it 4 stars because I still need some time to learn about it.  I've been a prime member for sometime now, I just need to learn more about the prime movies.", "verified": true, "helpfulness": "0/0", "author": "JAL"}, {"rating": 4.0, "review": "The Amazon app on my smart TV is pretty stupid and crashes all the time, so I basically bought this to improve my Amazon Prime streaming experience. I really like the FireTV, and finally having closed caption and preview during fast forward and re-wind is very nice, seeing my watchlist etc. I would give this 5 stars if a few improvements were made. 1) it never goes to sleep unless I select Sleep from the system menu 2) You should not have to click so deep into the GUI to see the price of the movie or if the movie is even available yet, put all that info up front as you're browsing, you basically have to go 3 levels deep in the interface before you can even decide if you want (or can) watch the movie. Its frustrating to see a movie you'd like to watch, click again just to see \"Currently Unavailable\". In addition, improvements should be made to allow you to custom order your watchlist, see an indicator when you've already watched a movie (after a year you sometimes forget what you've watched) and add a sort feature based on user or IMBD ratings when browsing categories or genre. I understand Amazon probably does not want features that drive everyone towards the same highly rated content, but this is what people want. Other than these issues I love the FireTV, its fast and greatly improves the experience over smart TV apps.", "verified": true, "helpfulness": "0/0", "author": "J. Wickham"}, {"rating": 4.0, "review": "We love it. Best Christmas present ever.", "verified": true, "helpfulness": "0/0", "author": "Holli Thompson"}, {"rating": 5.0, "review": "Best $99 I ever spent...screw you Comcast cable!", "verified": true, "helpfulness": "0/0", "author": "Bret Harwood"}]