[{"rating": 5.0, "review": "Love it and all the features.  Able to watch ESPN and all the games.", "verified": true, "helpfulness": "0/0", "author": "Linda Miller"}, {"rating": 5.0, "review": "My wife loves this , one of her most liked presents this Christmas!", "verified": true, "helpfulness": "0/0", "author": "Steven W. Bruegge"}, {"rating": 3.0, "review": "This is a potential 5 star product given its horsepower and voice search, but there are a couple major issues that still need to be resolved.Pros:- RAW HORSE POWER means things like YouTube and Netflix launch faster than a movie stored on your DVR- Bluetooth controller lets me hide the box almost anywhere -- no line-of-site needed- Voice recognition tech is stellar-- Excellent photo & video sharing app that runs fast and works seamlessly with your smartphone.  Take a picture and its online and ready for viewing as fast as your data plan can upload it to Amazon's servers.  I found no other picture service to be as good as this one top-to-bottom and if you're a prime member it comes with unlimited photo storage and something like 5-10 GB of video storage.- While Roku definitely has MORE apps, Fire TV has all the major apps most people want.  It wasn't missing anything that I wanted or needed.Cons:- No HBO & Showtime apps for Comcast customers yet- Consistent push into Amazon media products that you may otherwise have for free on your other media apps like Netlfix, Hulu or HBO/Showtime(if you're not w/ Comcast)- Voice search ONLY searches Amazon productsAnnoyance:Interface needs tweaking.  It's not THAT bad and works fast, but the menu trees are awkward and I just ended up using a \"recent\" menu to start the apps I wanted.If you trust that Amazon will get the voice search working across all apps, tweak the GUI, work things out with Comcast for HBO & Showtime and will back-off a bit on pushing everything Amazon, this is a very solid media device that I'm enjoying every day.  As said above, Netflix and YouTube load faster than a movie on my Tivo and you really don't need to be a Prime member to use this as your everyday media player.", "verified": true, "helpfulness": "0/0", "author": "Martin Eastport \"Trust me\""}, {"rating": 2.0, "review": "I like the idea of Fire TV and it worked great for 2 days.  Now I can't get it to connect to my WiFi at all.  I am now on my 3rd unit, but still have the same issue.  All of my other devices link in great to my WiFi and have no issues.  When conducting the scan for available WiFi, it shows mine as very strong, but the connection keeps failing.  We even went so far as to place a TV next to the WiFi, then attempted to link and it still failed.  It works intermittently with an Ethernet cable, but I'm really considering going for a Roku to see if that will at least work.", "verified": false, "helpfulness": "0/1", "author": "Christopher Peters"}, {"rating": 2.0, "review": "I guess I didn't realize you can't mirror with an iPad. I'm bummed about that because that is why I bought it. I downloaded the app for my iPhone and iPad but when it searches for my device I find nothing.  Also I loose connectivity to the internet. Netflix took a while to connect. I like having prime and netflix together but I'm not sure how to use the voice remote with it. I'm mixed.  If someone at amazon could help me with the mirroring I'd be so happy.", "verified": true, "helpfulness": "0/3", "author": "Jennifer Rasmussen"}, {"rating": 5.0, "review": "I bought this for myself for Christmas and it is my new favorite thing ever.  Super easy to hook up and even easier to use!  Given that I have Amazon Prime, Netflix, and Hulu Plus, this little device makes everything a lot simpler!  (I had been hooking up my laptop to my tv using a mini-display port to HDMI cable, which worked, but was cumbersome).  I'm usually an Apple kind of girl, but in this case, I'm very very glad I went with the Fire TV.  Very, very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "glasshalffull"}, {"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/1", "author": "M. D. Morrissey \"mom4ever\""}, {"rating": 5.0, "review": "Love it, Love it, Love it!", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer \"MS OREO\""}, {"rating": 1.0, "review": "While the Fire TV may work on your personal home wifi, it offers no opportunity to connect in a hotel room.You cannot get to the typical internet screens that appear when you a registered guest and have access to a wireless connection that requires you to input certain data.This is a major flaw.", "verified": true, "helpfulness": "2/7", "author": "Mike maher"}, {"rating": 5.0, "review": "The Fire TV suffers from being made by Amazon. People have their biases against the company and how it might approach the user experience. But Fire TV is a streamlined, no frills experience that is absolutely the gold standard of dedicated streaming.I've been streaming for a long time. I was first on board when Netflix came to the Xbox 360, and spent years streaming with my PS3. I learned Apple TV from using the one in my girlfriend's apartment, and it made me really want to have a dedicated streamer of my own. Streaming has after all matured. Unless you have a really valid and specific reason, there's no need for cable anymore. The PS3 is a decent streamer that can handle Netflix and Plex. But streaming is at its best with the big four: Netflix, Amazon, Hulu and Plex, which can collectively be had for less than the price of cable TV a month. The only two big name streamers on the market that offer that are the Roku and Fire TV. A few months ago I stuck a Roku stick on my bedroom TV and love it, but getting the Fire TV and introducing it to the living room TV truly takes it to the next level.First off, if you can justify the price I would recommend this over any streaming stick (if you can't, I'd recommend the Roku stick as the most bang for your buck over the Fire TV stick). The Fire TV has the benefit of a zippy processor under the hood, which when paired with a good internet connection (ethernet if you can swing it) absolutely screams. It makes using my Roku stick or my girlfriend's Apple TV seem really sluggish. Its like it can't wait to get your streaming content on the screen. And speaking of which, the \"ASAP\" feature for Prime content is not just a gimmick. If you're watching through a season of a show, stop and resume later, it resumes virtually instantly.There are three valid complaints that are commonly associated with the Fire TV, and two of them can be easily debunked. First, the fact that the home screen is structured to push Amazon content above all else. Is this true? yeah. But other streamers don't push any content on you. Other streamers just give you access to your apps (except for Apple TV, which pushes Apple content). Fire TV makes it no less convenient to access your apps, and at the same time it provides a home screen loaded with content. That's not unwelcome. The second complaint is that the content is lacking for Fire TV. Yes, its true that the Roku has more apps than FIre TV, but less than five of them have any kind of usefulness at all. Its not a dealbreaker as long as the Fire carries the big 4, which already puts it in a league above the ultra-common Apple TV. The third, and by far most valid complaint is the search. Yes, the Roku searches for content over more apps than Fire TV does. There's no excuse why the Fire search doesn't include Netflix results. But then again, the voice search is a feature unique to the Fire, and it works so flawlessly that I'm almost apt to excuse the lack of Netflix results.The Fire TV is far from a \"walled garden\" as some might claim. I have yet to find content I can't push to it. I have yet to find a device I can't mirror to it. And as far as handling good old fashioned streaming, you will find no better dedicated box. People always say that what Amazon does best is deliver content. That's what streaming is after all, and with Fire TV they've proven that it is indeed their bread and butter.", "verified": true, "helpfulness": "2/3", "author": "Grey"}]