[{"rating": 5.0, "review": "I think Amazon Fire TV is awesome.  I also have a ROKU on another TV in my home and the Amazon Fire TV offers so much more.  My daughters love playing the music and games and even my seven year old can operate it without assistance.", "verified": true, "helpfulness": "1/1", "author": "Bradley Campbell"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Imcobra01"}, {"rating": 5.0, "review": "LOVE IT! Go with Prime Membership and the movies are endless!", "verified": true, "helpfulness": "0/0", "author": "Diane Gonzalez"}, {"rating": 5.0, "review": "it has been working excellently!  was very easy to install.  i would recommend to anyone who is looking to watch and/or listen to movies/music on tv instead of having to watch/listen on computer.", "verified": true, "helpfulness": "0/0", "author": "Marianne Messersmith"}, {"rating": 4.0, "review": "Really wish it had a sleep timer.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey G."}, {"rating": 4.0, "review": "Far better than the 1st Fire TV stick I bought at $39.00. which over heated and didn't work very well..", "verified": true, "helpfulness": "0/0", "author": "John D Wright Sr."}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Music Is Life\""}, {"rating": 5.0, "review": "I am actually asking a question or two - it says it works with sling tv - is that with or with slingtv equipment? We are trying DESPERATELY to get rid or satellite - college football is what is holding us back! We need ESPN ESPN 2 and 3 ! How do we get these channels without cable!?????", "verified": false, "helpfulness": "0/0", "author": "Anna Chappell \"Displaced Southern Belle\""}, {"rating": 4.0, "review": "Incredibly fast for viewing Amazon content. Average for other streaming services. And why the hell doesn't the voice search work for other providers? Seems like a deliberate crippling of a feature to drive people to use Amazon Prime. Not cool, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Wally Asti \"amazon\""}, {"rating": 5.0, "review": "Great product, better than the apple tv and any other product. Smooth remote and operating system. Too lazy to type your search? Not a big deal with the voice activation search. Great way to navigate through the dark night when you are on your bindge watching marathon.", "verified": true, "helpfulness": "0/0", "author": "Nick & Jessica"}]