[{"rating": 3.0, "review": "Not as responsive as expected and the search feature does not work for all streaming services just Amazon", "verified": true, "helpfulness": "0/0", "author": "Andy Patch"}, {"rating": 5.0, "review": "Flawless and simple setup, no clunky computer integration as with my old chromecast. Voice recognition is brilliant and accurate.", "verified": true, "helpfulness": "0/0", "author": "John T. Pryde \"6676\""}, {"rating": 5.0, "review": "i love the amazon TV. The Netflix interface and Plex interface are top notch.", "verified": true, "helpfulness": "0/0", "author": "Ben M."}, {"rating": 3.0, "review": "Need better selection of games.  This could be a great platform for not so serious gamers.  Otherwise it's the same thing as my playstation, chromcast , or roku.", "verified": true, "helpfulness": "0/0", "author": "P. R. Rambler"}, {"rating": 5.0, "review": "Simply amazing and blazing fast!!!", "verified": true, "helpfulness": "0/0", "author": "David hicks"}, {"rating": 2.0, "review": "I received this as a gift for Christmas. As the console is small and easy to operate there are quite a few flaws which leads me to returning it. The Netflix app is dated and I had issues with it working on a routine basis. There is no VUDU app. My family uses VUDU to digitally store and share our movies so this didn't make sense for us to continue to use. The HBO GO app will not work, as I'm not sure whether this is a Amazon or Comcast issue. Overall, it is a very nice piece of equipment; however, it did not fulfill ALL of our wants and we are returning this and getting a Roku3 instead.", "verified": false, "helpfulness": "0/3", "author": "gth1984"}, {"rating": 5.0, "review": "Best household new tech since the microwave !  Love it !!", "verified": true, "helpfulness": "0/0", "author": "Jacke M \"Jmax\""}, {"rating": 3.0, "review": "Won't allow for HBOGO", "verified": true, "helpfulness": "0/2", "author": "max birikov"}, {"rating": 5.0, "review": "For our purposes I found the unit to be easy to use and hook-up to the TV and wireless router. I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Robert V. Phelps"}, {"rating": 4.0, "review": "It's a great device I got rid of my Apple TV only cause apple refuses to have amazon prime. Only disappointment was that there isn't enough memory to support tons of games and there is no way of turning it off unless you unplug it.", "verified": true, "helpfulness": "0/0", "author": "anthony delacruz"}]