[{"rating": 3.0, "review": "It's the little things...I have to say, prime music from my tv was a selling point for me. However,Prime Music doesn't play from Amazon Fire tv. How can that be when it's an Amazon product and I play my prime music on most any other device?  Ok, that's a downer and perhaps at some point Amazon will get around to making it available. Before anyone gets around to telling me what's written and where let me point out that in their advertising Amazon states one can listen to their Amazon music from Amazon Fire tv. I don't expect to have to read the fine print to find out that Amazon was referring only to the music I've purchased.In my home we have more than one Amazon account. However, the Amazon Fire TV does not allow for access to another amazon account. This is a problem in that we cannot switch accounts and watch movies we've payed for on the other account. And no, I do not see the answer as purchasing another Amazon Fire tv device and plugging and unplugging every time we want to watch a movie on the other person's account.Netflix is also glitchy at times.I do like the ease of plug and watch.However, that is overshadowed at this point by the major points above. At this point, I'm not sure I would recommend this to a friend or family member.", "verified": true, "helpfulness": "3/5", "author": "Tessa"}, {"rating": 5.0, "review": "Really liking the Amazon Fire so far. The voice search is great for the Amazon library. I really like the Search for Amazon Prime too. Not sure that was there when I first purchased Fire TV. I don't game so I can't say anything about gaming but independent reviewers have given it high marks. Right now the only improvement I would like to see is Voice Search for Netflix and other apps.", "verified": true, "helpfulness": "0/0", "author": "Dean"}, {"rating": 5.0, "review": "It would be great to b able 2 adjust the fonts.  Some videos r 2 small 2 read. The remote is great for voice command. I.e. you can find any movie a favorite actor's in by just saying the name.", "verified": true, "helpfulness": "0/0", "author": "kimberly rohrke"}, {"rating": 5.0, "review": "I love the fire TV, I beats out the Roku in speed. And since I buy all my movies from amazon it works perfectly for my TV's. I have one of these now, and when my other 2 Roku go bad I will be replacing it with the Amazon fire. I have hundreds of movies and Tv series, using the voice search is perfect for sifting through them all", "verified": true, "helpfulness": "0/0", "author": "James C. Piggrem"}, {"rating": 1.0, "review": "I was so dispointed that i cant  use it in kuwait", "verified": true, "helpfulness": "2/8", "author": "Khaled Redha \"MR-Beretta\""}, {"rating": 5.0, "review": "Love this here gadget ... compact, well-designed, simple remote control (my TV remote, on the other hand, has 52 separate buttons!!). Beautiful hi-res sccreensaver pix make me want to leave the TV on even when I'm not watching it (but I don't, 'cuz I'm not ka-ra-zee ;-) ).Great for accessing Amazon Prime, and also smooths out my Netflix, which had been becoming unwatchably bad over Comcast (guess they didn't like it when I cancelled the TV & HBO subscriptions). There are also games & other apps, but I don't those features.Definitely worth the money -Get one!", "verified": true, "helpfulness": "0/1", "author": "ThisIsNotMy\"RealName(TM)\" \"Yeah, right\""}, {"rating": 5.0, "review": "I LOVE Amazon Fire TV!! I have looked for a way to avoid the outrageous fees my cable company charges for all their items and this is. I can watch previous shows without paying for the DVR. I can see the Prime movies without buying them because I'm a Prime member. It's so small it takes practically no room - it was simple to connect even for the technicallychallenged . I love it.", "verified": true, "helpfulness": "0/0", "author": "Harper Lee \"#1Tigger\""}, {"rating": 4.0, "review": "I had to get a converter for my analog tv, so it was a little more complicated hooking it up.  Once I finally got it connected, I love my fire tv!!!!", "verified": true, "helpfulness": "1/1", "author": "Liz Rooney"}, {"rating": 2.0, "review": "Easy to use and set up.  Has great potential.  However, the content is weak compared to Roku and Apple.  The only reason I'm keeping Fire TV is because I am a Prime member.  Content from CNBC and Fox Business would be nice -  to compliment the already included Bloomberg Stock Market TV.  I already have Netflix DVD.  Amazon should work on getting more recent movies and TV shows in their system - in a timely manner.  I have to wait too long on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Nick A. DiVirgilio"}, {"rating": 5.0, "review": "Amazon Fire TV is easy to set up, easy to use and beats the programming on satellite television these days.  Downgraded our satellite service to save money.  Amazon Fire TV well worth the $99.00.  If you are tired of paying for dozens of channels that you don't watch, this is a great alternative.", "verified": true, "helpfulness": "0/0", "author": "Earthenvesel"}]