[{"rating": 5.0, "review": "love it.", "verified": true, "helpfulness": "0/0", "author": "Scott M McCarthy"}, {"rating": 5.0, "review": "way better than roku or apple tv......The voice search works great!!!!  Also love interface for choosing new stuf to watch.the fast forward is the best. It is a small window which allows you to stop at the exact spot you'd like to be.", "verified": true, "helpfulness": "0/0", "author": "victoria fres"}, {"rating": 5.0, "review": "it has been a nice device so far", "verified": true, "helpfulness": "0/0", "author": "ghostly7"}, {"rating": 5.0, "review": "Works great as advertised.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Its great movies,tv and,radio", "verified": true, "helpfulness": "0/0", "author": "Kevin Allen"}, {"rating": 5.0, "review": "CONS:I have had Google TV for the past 2yrs or so, one thing that Google TV lets you do that FireTV does not is it lets you hook up your cable box to GoogleTV and you now have a single box for everything to with media. Forget the clunky cable box interface, Google TV organizes everything nicely. BUT FireTV DOES NOT interface with your cable box, and this is was a big disappointment for me. FireTV does not have GooglePlay, which means it does not have Google services like Google Music, maps, chrome, mail etc. Although you can root your device and sideload Google Play, but you have to be a little bit of a techie to do that. FireTV does not have spotify, Beats, or other popular music streaming service. At this time (Jul 2014) it does not even have Amazon's Prime music, so it is very thin on content provider selection.PROS;Very very high spec box, 2GM ram, 8GB storage, Optical audio out, Dolby sound, Fast processor makes this one the best hardware out there on the market. The interface is easy to use, but there are some inconsistencies for example if you hit the back button in pandora it does not exit the app but puts the app in background and plays music in background. To exit the app you have to hit the really small icon on the top corner and select quit. You would think that amazon paid attention to detail on featured apps... but I think as firmware updates roll out they might fix these inconsistencies. The instant play feature is really really awesome, I would buy this box just for that! When you click on the movie you want to watch there is no buffering, it starts to play instantly all other streaming boxes including GoogleTV boxes have to buffer and display \"loading ...\" which is very annoying because I know that it is technically possible to avoid that delay.. and amazon has done it. The remote is feels very nice in your palm, the buttons are very well designed and the layout is simple similar to roku, the voice search is awesome, it has not made any mistakes even with my heavy accent. But the voice search does not work for all apps, you cannot use voice search for netflix... I am sure amazon was not too keen to add that feature to a competing product... but I think it was is a cheap shot because Amazon prime video is a lot better than netflix anyways. I have my FireTV audio connected via optical out to a Cambridge Audio DAC and then to my NAD AMP, I get great quality sound to my speakers.A note on *other* GoogleTV devices, I have the Vizio co-star, at the time of the purchase it was the top of the line GoogleTV box on the market. Like I said before the best feature of Google TV box was that it allowed me to connect my cable HDMI out to the Google TV box giving me an awesome interface to my Cable Box, I really hate the interface on the cable TV boxes! That said, Google TV boxes are made very cheaply, the HW is under powered and the software is clunky, most of the feature kinda sorta works. I have to reset the box almost every week coz it hangs often. I have done a factory reset a number of times and set up everything again time and time again ... but the quality of the products out there are terrible and they suck.I wish amazon came up with a slingbox like setup and offered a amazon cloud based DVRs for existing cable boxes. May be a dongle like chrome cast that I can plug into the HDMI out of my cable box that talks directly to FireTV OTA. Or if Amazon could provide cable service over FireTV I would quickly cut my cable and switch to Amazon cable service.", "verified": true, "helpfulness": "0/1", "author": "manjo \"manjo\""}, {"rating": 2.0, "review": "The main problem I have with this is that the surround sound on this unit does not work. This should have been fixed before they started shipping out these units. I am very disappointed in this. My Plex movies only play in stereo and I did have the settings correctly in the sound settins. The main reason I got this is so that I can output the optical to my home theater amp and the HDMI can got to my TV. I had to switch it out with my Roku because everything works on the Roku. I went ahead and placed this on a TV that does not have a surround sound amp. I hope this fix this in the future otherwise I will only by Roku from now on.", "verified": true, "helpfulness": "1/2", "author": "Darth Hank"}, {"rating": 5.0, "review": "I really do love the Fire TV (just wish I knew Amazon was coming out with this BEFORE I bought Roku 1 - will have to sell the Roku). I am a Prime member, so can get more movies than I can watch for free. The Pandora option is great (and so easy to find with voice recognition (only 2 tries - first was Andora). Pandora does NOT keep asking if still listening like on computer, just keeps playing forever!. Also runs a slide show with some awesome pics. I purchased at Best Buy because I had $60 in points credit from buying $3200 in new appliances. Also has some cool free Aps from Amazon like Weather 4 US and AllCast. The slide show is available under screen savers on the home page.", "verified": true, "helpfulness": "0/0", "author": "RW D."}, {"rating": 1.0, "review": "DONT WORK OUT OF US", "verified": true, "helpfulness": "4/16", "author": "JC"}, {"rating": 3.0, "review": "need a way to extend memory or its totally useless", "verified": true, "helpfulness": "0/5", "author": "dequan"}]