[{"rating": 3.0, "review": "I  thought that there would be more free movies with Amazon Prime.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Could use at 16 GBP.", "verified": true, "helpfulness": "0/1", "author": "Tilman Saylor Jr"}, {"rating": 5.0, "review": "Amazing picture quality and lots of movie and tv options", "verified": true, "helpfulness": "0/0", "author": "Jessica L"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV for music streaming, old movie apps availability (free), HBO and Showtime Anytime. I also bought it with Amazon Prime in mind since I am a member. This being an Amazon device, the Amazon Prime features disappointed me, which is why I knocked it down one star. As other reviewers have pointed out, you cannot simply select an option like \"Prime\" to narrow down your search to Prime only selections. The Prime selections are mixed in the the fee based selections, which is certainly no oversight by Amazon since they want you to purchase movies. Now, when I want to watch Amazon Prime movies I'll do it from my Sony Blu-ray player (and not this device) and use it's Amazon Prime App, which does allow drilling down to Prime movies/TV selections only. In fairness, there are Amazon Prime options like Most Popular/Recent added Prime Movie or TV, but nothing like starting with a comprehensive \"Prime\" only button, then drill down.This device is plugged into my AV Receiver for surround audio and the Iheart and Pandora music services (classical) sound terrific. Living in the mountains in Southern California, my selections of over the air FM is limited so the Iheart music streaming for local and remote US stations alone is worth the  price of this device.Update 02/01/2015 : I'm changing my rating from 4 stars to 5! It now appears Amazon has made the separation of Prime for both TV shows and Movies from the pay stuff easier to separate. That is a plus.Also, the audio quality of Amazon Instant Video are of decent quality when feed into a quality AV Receiver to the get Dolby Digital Plus surround sound. However, this device still lacks the Vudu app.I have over 100+ movies on Ultraviolet and rely on Vudu to access these (forget the available Flixter app. No comparison). Vudu is still the choice of movie streaming for the best quality audio available (when streaming) so I still will use my Sony Blu Ray player to watch movies I own via Vudu / Ultraviolet.", "verified": true, "helpfulness": "2/2", "author": "Mark S. Detwiler"}, {"rating": 5.0, "review": "Love my fire tv!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This works way better than expected! It's very fast, easy to use, and the remote makes controlling it a breeze. Plus Amazon adds content to prime daily. I haven't tried the games but the controller looks pretty good.", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 3.0, "review": "The equiptment works fine - however I am not sure if Netflix is incl. in the free 30 day offer, or if I have to pay for it from the get go.It asks for my card number, something I am not prepared to do just yet. this should be made clearer by Amazon.", "verified": true, "helpfulness": "1/1", "author": "David L. Langill"}, {"rating": 5.0, "review": "I love Amazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "HR"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Debra"}, {"rating": 5.0, "review": "can this be used on a smart TV?", "verified": false, "helpfulness": "0/1", "author": "luvagoodread \"lilly B\""}]