[{"rating": 4.0, "review": "I like the layout and the ease of access. The clarity of the  movies is very good. I am able to find my favored radio stations as well. I am running this wireless so I do have a buffering issue with some movies.", "verified": true, "helpfulness": "0/0", "author": "Rensselaer D. Filkins \"filkins\""}, {"rating": 4.0, "review": "Love this device.  I live abroad, so I am not able to comment on the Amazon Prime TV and movie services.  I bought this box to install XBMC (Kodi), and it works amazing.  Short of a mini PC, this is the most powerful android XBMC box you'll get for the money.  Unfortunately, you have to sideload XBMC, but this procedure is well documented on the internet (http://kodi.wiki/view/Amazon_Fire_TV), and does not require Root access.  The procedure is well documented, and easy enough for a PC dummy with good intentions.The Amazon interface is not the most pleasant, but, I use this box mainly for XBMC/Kodi.  XBMC works smooth and super-fast on this device, whether streaming from the internet or from your LAN.  Ouya and Apple TV 2 with XBMC cannot come close.The most important thing is that the Fire TV has a massive user community, with forums for the device on XDA, aftvnews, and tvaddons which address many issues you may have. The large user base ensures your device will have a longer life.  There are developers working on a clean Cynagenmod Lollipop port for the Fire TV at the moment, this should be amazing.The only problem, as mentioned, is the interface.  It is not a clean interface, you do not have access to the google play store, and Amazon makes it difficult to root.  You can root new devices, but not after they received updates.  Hopefully someone will figure out how to root the updated device soon, so we can port Lopllipop when it becomes available.Suggestion: Aftvnews has a guide to rooting and disabling updates on your brand new fire tv.  Do this before anything else.  If you’re hesitant about rooting, at least block updates from your router (also detailed on aftvnews).  Once you connect to the internet, you will not be able to root.  And you will need a rooted device in order to flash Lollipop.", "verified": true, "helpfulness": "3/3", "author": "Pacman"}, {"rating": 4.0, "review": "Amazon has come closer than all the other devices in this (now pretty crowded) field to making a 'great' streaming device. By allowing the sideloading (with a little trickery) of non-Amazon apps, this little box is extremely usable.What I really don't like is this practice of tying a device to one user and automatically registering it before even shipping. Yes, I understand that devices can be 'de-registered' and 're-registered' to another user. But why? Marketing, of course. Marketing and advertising takes precedence over user experience. For technical users this is extremely frustrating. I bought one for my Mother as a Christmas present, and since I needed to prepare the device so that she could use it in the manner that I knew she needed (sorry, but it ain't plug n play when you live 1500 miles away) I had to register it. In her name. And guess what happened then? She got a nice email from Amazon 'welcoming' her to Fire TV! Christmas surprise ruined. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "MG \"MG\""}, {"rating": 5.0, "review": "Very easy to use!!", "verified": true, "helpfulness": "0/0", "author": "Denise Adkins"}, {"rating": 5.0, "review": "We love our Amazon Fire TV. Finally we got to the point of not being held hostage to our cable provider for the outrageous price of $200 per month for over a thousand stations in which we only really watch 10 of them! We scaled back to only having basic and have our Internet with them but now save $90 a month in charges. The problem with cable is the same shows run on the upgraded channels like HBO, Showtime, and others all month. Now when we want to see a movie we stream it from our Amazon Prime which is $9.99 a month versus $90, do the math it is much better.Thank you Amazon for putting us on the new wave of saving money while having an entertainment package for the whole household!", "verified": true, "helpfulness": "0/0", "author": "Ralph Moore"}, {"rating": 1.0, "review": "Doesn't work with WPS WiFi pushbutton setup. Pre-purchase, I was told by customer service person it did.Screens don't match instructions in start-up booklet or on Amazon website help pages for Fire TV.Tech support couldn't make it work on their setup. Had me try a bunch of stuff with random passwords to get into Advanced, but that just made you enter all your network's IP info & setting numbers, and a password.More than 3 hours with the box & on the phone, & I couldn't connect.And the stupid thing came with dead batteries for the remote!Going back. The manager I ended up with after Tech Support couldn't do it either is passing the info along to the development team for a future update, & to another team about the dead batteries. Well great, but that doesn't help me, does it? I demanded an extra refund, to match the $20 extra I spent on it because I was having surgery during the brief time they knocked the price down that much. $10 was the best he would do. Doesn't begin to cover frustration, time, lost use of that money while they had it, anger at being told totally incorrect info when I wouldn't have bought it if I'd known...Big sigh. Have to call Comcast & get back the regular programming package I had reduced to barest basics. Disappointed, to say the least.", "verified": true, "helpfulness": "1/3", "author": "Mindy Machanic \"Creativity Queen\""}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/1", "author": "Giedrius"}, {"rating": 4.0, "review": "After years of not using all my PRIME benefits I decided to make this purchase while on sale at Christmas time.... Very pleased with the box and the ease of using it!!!", "verified": true, "helpfulness": "0/0", "author": "David Minnich"}, {"rating": 5.0, "review": "Got rid of cable tv since I got the fire tv.  It is soooo easy to set up and use.  Highly recommended for people looking to get away from cable or satellite.", "verified": true, "helpfulness": "0/0", "author": "Joshchan"}, {"rating": 5.0, "review": "I just received my device and am already hooked! The packaging and contents are not intimidating, set up was a breeze and the menu is very user friendly. The picture is crystal clear and I love that it syncs my music and photos from my Kindle Fire. There are plenty of network apps that do not require an account so there is quite a bit of variety for free streaming. The only disappointment for me is that the HBOGO and SHOWTIME apps require accounts which means for Verizon FIOS I would need to upgrade to those premium channels which defeats the entire purpose of streaming for me....to lose my cable bill. But it is not that big of a deal becasse there are plenty of other free apps to watch shows on.", "verified": true, "helpfulness": "0/0", "author": "D Charles"}]