[{"rating": 4.0, "review": "Mixed feelings. Works fine (including the voice control), is tiny on the rack, has a nice simple control. My caveat is that I feel that Amazon is shoving its content down my throat. You don't have the same toolset with Netflix, and you have to move around menus to get to it. When you turn it on you get a long list of Amazon options. On the other hand, the new Amazon pricing that mimics Netflix pricing might make this less important.", "verified": true, "helpfulness": "0/0", "author": "Writer"}, {"rating": 4.0, "review": "As advertised!  Would like to see some updates on apps to increase programming options, like HBO GO", "verified": true, "helpfulness": "0/0", "author": "Grant Gehring"}, {"rating": 5.0, "review": "Works great, like all Amazon products.", "verified": true, "helpfulness": "0/0", "author": "emdee"}, {"rating": 4.0, "review": "Use it to access Amazon content, Netflix, and in conjunction with Plex Media Server which is the best part of it as far as I'm concerned.", "verified": true, "helpfulness": "0/0", "author": "Johanna"}, {"rating": 4.0, "review": "Some improving needed", "verified": true, "helpfulness": "0/1", "author": "Arthur"}, {"rating": 3.0, "review": "Good, but it's missing a Web browser😩", "verified": true, "helpfulness": "1/1", "author": "maurice nona"}, {"rating": 5.0, "review": "This was a real life saver! we recently cancel our cable and then I had a  illness that caused me to be home from work cooped up in the house. Compared to a huge cable bill, Amazon fire TV was worth a try. I was very happy it really helped me out. It's so easy to use, but if you do find yourself questioning or needing help their technicians are extremely knowledgeable and very patient.", "verified": false, "helpfulness": "0/0", "author": "valerie"}, {"rating": 1.0, "review": "Parental controls are worthless. On all of our other devices iPad, laptops, xbox, and kindles I can control the content level for movies or tv shows my kids watch on the amazon instant video app. Not on fire tv. It is all or nothing. I have to pin protect all ratings content G- R or no parental controls and all content is available.  I have called fire tv tech support about this and after over an hour on the phone they were not able to correct it. They said it should work, but it doesn't. They also said they would research it and call me back. It has been 30+ hours and no one has called me back. In the mean time I have to enter a pin code every time my kids want to watch Spongebob. Also another problem with pin code is it is very visible on the tv screen when you enter it. I have to make the kids leave the room so they won't see the code I am entering.  If tech support does not call back and correct this issue I will return this deviceUpdate tech support never called me back.  I called them after 3 weeks and was told that is how the parental controls work and maybe there will be a software update in the future to fix this.  For now it is all or nothing.", "verified": true, "helpfulness": "4/7", "author": "schmarvey"}, {"rating": 5.0, "review": "needs more apps including vudu, but i am enjoying it greatly", "verified": true, "helpfulness": "0/0", "author": "Gregory A. Davidson"}, {"rating": 4.0, "review": "Great streaming, but note the voice search only works on Amazon prime videos.For Netflix, you have to use the on-screen keyboard or just plug in a USB keyboard or wireless keyboard with a USB dongle.The old Sony Blueray box would stall out on Netflix.  The Fire TV box has never stalled and buffered.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]