[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Exceeded my expectations.  Great interface.  Fast performnce.  Great content.  I have an apple tv.  Fire tv is far superior in my opinion, due to more content and better performance.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Not worth replacing my Roku 3. I was mislead that this supported the DS Video app. There is only one game worth playing. Buy a Roku 3 if you don't have a Plex Media Server.", "verified": true, "helpfulness": "2/8", "author": "Brandon Foster"}, {"rating": 1.0, "review": "Not the same Amazon!I expected the box to find requested movies from multiple sources.  But no, only from Amazon Prime.  The ads are so misleading.  This from a  huge fan of Amazon.  What a letdown.", "verified": true, "helpfulness": "4/13", "author": "George D. Putnam"}, {"rating": 2.0, "review": "Disappointing.This is a very high standard device with very impressive quality.BUT,There are too many buts. The combination of all of them makes me recommend NOT buying the product. I'm going to return it tomorrow.Main issues:1. Activated prime without really asking. After I registered my account, I probably clicked a button saying I'm willing to buy Amazon Prime. Be careful of what you click on.2. Voice search only works with prime content. The Prime library is just not extensive enough, lacking a lot of content and a vast majority of premium quality movies (such as the IMDB top 250).3. The icon for differentiating between Free and Paid Prime content is tiny. I guess some people bought content without intending to do so.4. You cannot search or have displayed the free Prime content by itself. This makes voice search totally useless for me.5. Although Amazon published that the device has a USB input, there is absolutely nothing you can do with it. You CANOT connect an external HD and watch it. You have to upload your movies to the Amazon cloud and pay for their storage. Not good.6. HBO. I was very happy that the HBOGO app finally landed. Too bad it doesn't work for Comcast customers. I know this is not Amazon's fault but still, this makes this box just not good enough for me.7. The device supports Bluetooth but you CANNOT connect BT headphones to it and use them remotely. Even the Roku device (which supports no BT)  allows you to watch TV also while people are sleeping using the remote.To sum it up: Pairing with Prime is too aggressive, No HBO for Comcast customers, no ability to connect USB storage and no Bluetooth sound.Too Bad ;(", "verified": false, "helpfulness": "3/6", "author": "Itay M."}, {"rating": 5.0, "review": "Simple to install.  Easy to use.  Once turned on, gives animated instructing on how to operate.  Lots of free PRIME movies to watch.  Only had it for 3 months...hope they continue to add free movies.", "verified": true, "helpfulness": "1/1", "author": "RS \"RS\""}, {"rating": 5.0, "review": "I just got mine and let me tell you: OMG this fire TV IS fantastic. I got it going in just 5 minutes and it is so nice and great  Quality And Durable. I Love it", "verified": true, "helpfulness": "1/1", "author": "Ray"}, {"rating": 4.0, "review": "Fast delivery.Nice device.", "verified": true, "helpfulness": "1/1", "author": "Marat Gataullin"}, {"rating": 5.0, "review": "This was a birthday gift and it was the BEST gift I ever received!  I love it & have been telling everyone how great it is! I'm hooked on the many series that they offer, Falling Skies, Defiance, etc....It's simply awesome!!!!  No more paying for cable, there's so much to watch, I'll never be bored!!!", "verified": true, "helpfulness": "1/1", "author": "Donna"}, {"rating": 1.0, "review": "Thought we would have more movie options for Prime subscribers. Disappointed.", "verified": true, "helpfulness": "2/7", "author": "Jennifer Aultman"}]