[{"rating": 5.0, "review": "this was my first streaming device and I was worried it would be too complicated for me.  Holy Cow!!  It was a three step set up that a preschooler could do and then everything else was so simple....like a dream come true.  View old tv episodes, new movies, old movies...whatever you want.  It takes the mystery out of the selection and with voice recognition you cannot make a mistake.  I just love it and have already recommended it to about a dozen friends.  Terrific!!!!  Love It!!!!!  And, even have paired it with another tv and put the controls on my smartphone.  Thanks Amazon!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "sammiesmom"}, {"rating": 5.0, "review": "IT'S OK", "verified": true, "helpfulness": "0/0", "author": "James Loscalzo"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "JHan"}, {"rating": 3.0, "review": "Fire tv is ok. Need more movies and the ability to rent newer releases.", "verified": true, "helpfulness": "0/0", "author": "P Hearing"}, {"rating": 5.0, "review": "love it !!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "11"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Armando Espinosa, Jr."}, {"rating": 4.0, "review": "I bought Fire TV with the gaming package as a Christmas gift for the family. So far it's been a big hit. Between the movies, music, and games, there's been something for everyone. And it's very easy to set up and use. The only criticism I have is that the batteries that were supplied for the voice controlled remote went dead after only a couple of days. I'm guessing that the batteries were old to begin with.", "verified": true, "helpfulness": "0/0", "author": "brandon sternod"}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Beverly Guidry"}, {"rating": 5.0, "review": "I love this. It was easy to set up and I love the fact I can add movies to my cue from my computer.", "verified": true, "helpfulness": "0/0", "author": "T. D. 1500 \"Live, Laugh, Love\""}]