[{"rating": 5.0, "review": "Great Device.", "verified": true, "helpfulness": "0/0", "author": "William bechtold"}, {"rating": 4.0, "review": "Great way to cut down on your cable bill", "verified": true, "helpfulness": "0/0", "author": "patricia  chastant"}, {"rating": 5.0, "review": "So far everything bought from amazon has been in excellent condition and works just fine...a very satisfied customer...have only used amazon a couple of days ...so far so good  thank you", "verified": true, "helpfulness": "0/0", "author": "retta"}, {"rating": 5.0, "review": "I had been a frustrated Roku sufferer (UH, I mean user) for many years.  I was fed up with the glitches, freezes, etc.I started using Amazon Fire TV as of early 2015, and WOW...what a difference.  This thing is fairly rock-solid.  Yes, it's basically a little computer and once in a great while it will get slow. However, it's the best streaming box I've ever used.  During my frustrations with Roku, I tried WDTV and Boxee.  Neither even came close to the channels, features and ease-of-use as Roku, so I sent them back.  At a friend's place I tried AppleTV, and, well, \"Meh,\" is about all I could say about AppleTV.So, I continued to suffer with Roku.  Finally, when FireTV came out, I figured that if anyone had the resources to Get It Right, Amazon probably did.  I was right!  This thing is solid.I highly recommend Amazon FireTV - especially if you're a cord-cutter like we are!", "verified": true, "helpfulness": "1/1", "author": "George S."}, {"rating": 3.0, "review": "I thought that I would get TV programs and some free movies with it. In stead of having to rent or buy them. I can do that with my cable.", "verified": true, "helpfulness": "0/0", "author": "Barbara Shaver"}, {"rating": 1.0, "review": "I'm not a techno-phobe but after three days I gave up  attempting connect the \"Fire\" to my television.  I ultimately replaced it with a similar, Sony Blue Ray wireless system that successfully achieved full operation in less than an hour.  I plan to give the Amazon Fire away to someone willing to experiment with hooking it up.", "verified": true, "helpfulness": "1/1", "author": "Harold Saive \"Hsaive\""}, {"rating": 2.0, "review": "Can't turn it off. So it's wasting electricity when I'm not using it.", "verified": true, "helpfulness": "1/2", "author": "Amazon-Seattle-User"}, {"rating": 5.0, "review": "Wish we had started sooner!!!!!", "verified": true, "helpfulness": "1/1", "author": "Dennis Yeatts"}, {"rating": 1.0, "review": "Unfortunately I just can't recommend this product anymore.  We cannot stream Netflix 1080p content anymore without constant video stutter.  It's usually (mostly) resolved for a couple hours if we fully restart the box but something is not right.  To be clear, our internet speed is well over 150Mb/s.I've contacted Netflix and they've had me try everything.  Clearing the cache, flipping the HDMI cable, reinstalling the app and all of that.  They unfortunately have said that they are getting a lot of these complaints lately.  To me it feels like some sort of memory leak but it's just not a quality experience anymore.  :(Also unfortunately while there is a twitch.tv app, you cannot log into your account to watch streamers that you follow.  You would think that since Amazon bought twitch, they would have updated this immediately.Everything else about this device is great.  We use the optical audio out, ethernet cable, the remote feels really great in the hand, the apps are cute.  We just can't watch netflix with the video stuttering here and there. (enough where it's unwatchable)", "verified": true, "helpfulness": "0/2", "author": "C. Pantle \"likwidtek\""}, {"rating": 4.0, "review": "Like this so far", "verified": true, "helpfulness": "0/0", "author": "Derrick"}]