[{"rating": 4.0, "review": "While I realize that it's the only media streamer that uses voice activation, it almost always returns a result ending with a selection from Amazon instead of the other services.  The interface for Hulu Plus is fine but the interface for Netflix is not good--it's easier to use the one they have for the PC.  The one for the Amazon Fire box is insufficient and I have to do a lot of hunting around to find what I'm looking for.The equipment itself is absolutely perfect / flawless -- the quality is amazing and even the packaging is impressive.  I wish that it had a feature to help me locate the small, black, unobtrusive remote control (I lose it frequently).  Put a button on the box so that I can locate my remote control by sound -- THEN you'd have a perfect product!One last note -- I am not an expert on this type of device, but I must tell you that I returned the Roku 3 product because it did not provide any way to connect my home theater (which needs either RCA, Coax, or optical).  I would have kept it were it not for that problem alone -- not everyone on earth has audio equipment with HDMI built in -- many millions of people will have their home theater and/or stereo electronics for at least the next generation or two -- Roku made a corporate decision to abandon these folks I guess, but thankfully Amazon thought of us!", "verified": true, "helpfulness": "0/0", "author": "Russell \"Lyle & Russell Ichenberg\""}, {"rating": 3.0, "review": "I am not one to usually write reviews, but figured this might be helpful to those wire cutters on the fence in trying this new thing from Amazon. I have been a user and fan of Roku for a while now, but thought I would give this a try based on the voice search function and processing power. Here are my pros and cons:PROs: It is fast, aka responsive. It seems to load content I want quickly. The remote and menus move quickly, and i have not noticed any buffering (My Roku rarely buffers content, but the Fire does seem to load faster by a hair). The voice search is cool and works well (although only for Amazon content which I feel slightly duped because I initially expected that function to work across all apps and content such as Netflix which is not the case). It has a lot of game choices, but I am not in to that part of it much, so not much help there.CONs: There are not very many app choices (yet, hopefully). The Roku has literally thousands, but this only has a small number of them. So you can forget about History, Smithsonian, A&E; channels, etc. Only the main ones like Netflix and Hulu are available. Also, one of the main apps I like is Aereo for local channels and this is not available on the Fire so major Con for me there. Also, the menus are not as friendly to navigate, feel cluttered or something. just not as simple as roku menu's (maybe i am just used to roku though). Again, the voice search does not work for anything other than Amazon content.All in all, not a bad device. It has great speed and processing power, but lacks app choices and needs a menu overhaul. Gaming might be good on this, but you are on your own in this area. If I had to choose between having this or Roku3, I would hands down go with Roku3 right now. But the potential for this to be great someday is there, will keep an eye on it...", "verified": true, "helpfulness": "2/7", "author": "Ryan Adams"}, {"rating": 5.0, "review": "Love all 5 of my amazon fire tvs", "verified": true, "helpfulness": "0/0", "author": "rburton"}, {"rating": 5.0, "review": "I love the Fire.  It performs as described.  Would recommend to anyone who is looking for a device to stream Netflix, Amazon video and more.", "verified": true, "helpfulness": "0/0", "author": "Shirley A. Coshatt"}, {"rating": 5.0, "review": "so easy to use, Even for someone who is technically challenged. great way to get more out of my amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Burk"}, {"rating": 5.0, "review": "With all the streaming devices I currently have (blu ray players, Xbox 360, Xbox One, Nintendo Wii U) this little gem beats them all.  Fast, and high quality audio/video.  Only wish the voice prompt was not geared towards Amazon Prime alone.  Also Vudu HD would be a good addition, perhaps in time.  Great job Amazon.", "verified": true, "helpfulness": "1/1", "author": "Jennifer Case"}, {"rating": 5.0, "review": "Running to the video store in my rural area is not an option.  Watching a one-hour show that takes 2+ hours because of buffering is not that much fun.  Amazon Fire TV is the answer to my problems.  How does one little tiny box that is nothing to set up, do it?  Wait, don't tell me, I'm into mysteries.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I bought this because I heard that it would have USB support:“You know, it has a USB port on it,” said Larsen. “So we don’t have anything specifically to announce there, but it’s a pretty good idea. You could add a USB stick to it over time.”I haven't heard anything since this.Either than that, its a solid system and I would give it 5 stars. But until there is support for USB Sticks/external drives, I will give it a 3.", "verified": true, "helpfulness": "1/5", "author": "N. Stoker"}, {"rating": 2.0, "review": "i just have one question about this product.  do you have to have a subscription to Hulu or Netflix or any other thing that is on there?", "verified": false, "helpfulness": "2/8", "author": "octavio castro"}, {"rating": 5.0, "review": "does the USB port allow you to plug and play movies using your usb memory stick.? I currently have a Vizio box that almost does what this box does and if this amazon box allows me to play them then this box  kicks butt for all it can do and I will buy one today.", "verified": false, "helpfulness": "1/6", "author": "Brian Shepherd"}]