[{"rating": 5.0, "review": "Very user friendly.  Set up in no time at all.  Actually worked!!  I tried Chromecast but it would not connect to my WiFi.  Very frustrating.  In any event, this works as advertised.  I have not yet tried the voice command feature but I expect it will work as promised.If you want to access Amazon Prime as well as Netflix, this is for you!", "verified": true, "helpfulness": "0/1", "author": "C. Dunbar"}, {"rating": 5.0, "review": "Love amazon fire tv!!! No more cable bill every month, just $99 for the entire year.", "verified": true, "helpfulness": "1/3", "author": "Linda Dancy"}, {"rating": 5.0, "review": "My second media streaming box. Love the Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Randall R. Hummer \"RH\""}, {"rating": 4.0, "review": "Prime needs to offer more variety in movies and TV", "verified": true, "helpfulness": "0/2", "author": "AnnieMouse"}, {"rating": 4.0, "review": "Great product. However, I would like to see Amazon release a remote app for my smartphone.", "verified": true, "helpfulness": "1/1", "author": "jake"}, {"rating": 2.0, "review": "I truly wish I was paying for this monthly so I could have turned this back in already,  But no, I paid for a year and I have it even when I could go happily without it.  First, the \"easy\" installation took a couple of hours.  There are no instructions for how to install it if you have TiVo or a wifi, and the Amazon rep also didn't know how to do it.  It turned out being a simple connection.  So yes it WAS easy, once we knew what to do.  But then I was hoping there would be enough to choose from that I could get rid of my cable TV, but there isn't.  If you have Prime it's better, but still not all the movies are available and of the 20,000 titles that are available, most are pure crap..  And then there's the problem with losing connection.  Over and over.  I called tech support and was told there was nothing that could be done.  Love my Kindle, but have been totally underwhelmed with Amazon Fire TV.", "verified": true, "helpfulness": "1/5", "author": "Spurbob45"}, {"rating": 4.0, "review": "Awesome device.  Works great, just wish it had better free movies. Also would like to have a power switch on it. When I turn on my tv to do anything other than use the fire it will still turn on", "verified": true, "helpfulness": "0/0", "author": "John Wellman"}, {"rating": 5.0, "review": "Great streaming device!!!", "verified": true, "helpfulness": "1/1", "author": "Tim Morris"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Ronette Waddell"}, {"rating": 4.0, "review": "This Is A Great Device, The Best Andriod Device Out Right now", "verified": true, "helpfulness": "0/1", "author": "mike"}]