[{"rating": 5.0, "review": "This is great!!! Love that I can have all my online accounts logged in at one place and without difficulty. Very simple and easy remote, easy to use. User friendly.", "verified": true, "helpfulness": "0/0", "author": "Ktruong"}, {"rating": 1.0, "review": "I had some really bad luck with Amazon this year, I have spent thousands of dollars buying things from Amazon.  I was so excited to give this to my husband for Christmas, we have been watching Big Bang Theory reruns for months and I was really hoping that this would be a great source of entertainment,  Unfortunately, within hours of installing, it began to disconnect itself from the wifi and within a day, was completely unusable,  it would not do anything except display the Amazon logo.  SO, back it goes and I am getting a Roku 3.  Very unhappy and will not purchase any other Amazon electronics.", "verified": true, "helpfulness": "1/4", "author": "Bonnie S. Engelbrecht \"jamm4786\""}, {"rating": 5.0, "review": "Love it. I can bing my favorites", "verified": true, "helpfulness": "0/1", "author": "Dr. Merrill Ashcraft"}, {"rating": 3.0, "review": "I sent this as a gift to my nephew.  It did not include the HDMI cable needed to install it, and two days after I purchased it, the price was reduced.  I am sure it will work fine.  Still waiting on the controller to be shipped.", "verified": false, "helpfulness": "0/2", "author": "Tracey Lamport"}, {"rating": 4.0, "review": "highly recommended", "verified": true, "helpfulness": "0/1", "author": "Blanca"}, {"rating": 5.0, "review": "Got this to replace an older Apple TV that just had so many problems maintaining a wireless connection.  No such problems with the Fire TV.  Picture is beautiful and the smart buffering really works well.  So surprised how fast actual streaming starts.  And the box itself is incredibly quick.  Searches come up amazingly fast compared to the Apple TV.  Which brings me to our favorite part of the Fire.  Voice search is amazing.  Works virtually every time and eliminates the frustration of trying to enter searches with a remote.", "verified": true, "helpfulness": "0/0", "author": "gtcharlie"}, {"rating": 5.0, "review": "Works extremely well.  Has a spot next to my TV.", "verified": true, "helpfulness": "0/0", "author": "Bman"}, {"rating": 5.0, "review": "so easy to set up and use. have gone to antenna and internet tv as cable priced itself right out of my budget. your annual membership is less than one month of cable. please, please keep up the good work making it possible for the home bound stay up to date and smiling.", "verified": true, "helpfulness": "0/0", "author": "Anna M Dotson"}, {"rating": 5.0, "review": "Amazon Fire was my favorite gift. it was super simple to hook-up. Now I have become a couch potato, with some many options I wasn't using my television for, like music, surfing the net, games.", "verified": true, "helpfulness": "0/0", "author": "Tim Higgs"}, {"rating": 5.0, "review": "Awesome.  Easy to install,  great picture clarity compared to my previous Internet feed version of Netflix. Plus easy access to tons of content. A real wonder for us.", "verified": true, "helpfulness": "0/0", "author": "ParkerT"}]