[{"rating": 2.0, "review": "Pros:good build qualityeasy to work remoteOptical output for audioSimple setuppowerful chipsetCons:N wireless...not AC. This makes streaming from your NAS or servers or streaming Plex at even 2mb 720p a joke.Amazon's clusterf**k of a menu that can't be customized. Seriously, can't anyone just make a simple setup like Roku uses?locked and amazon updates can't be turned off.lack of browser.no access to google apps store.I really did like this at first. Even figured out how to install some apps outside of amazon that made it even better. But when I had to turn down the quality of videos simply because the wireless on this is crap, that was the deal breaker. I run AC wireless throughout the house and I can stream a full 1080p quality movie all over the house but this thing's wifi is seriously lame. Sure it's an N, but it's a low end N speed. I'm returning it and going for a Matricom G-box Q that comes with AC wireless built in and I can set what is in my menus instead of being bombarded with a bunch of Amazon stuff I never use.", "verified": true, "helpfulness": "1/3", "author": "T. Mason"}, {"rating": 4.0, "review": "I like it a lot", "verified": true, "helpfulness": "0/0", "author": "Celia Fulton"}, {"rating": 5.0, "review": "easy to use and many free movies and shows with prime membership!", "verified": true, "helpfulness": "0/0", "author": "Zeblives \"zeblives\""}, {"rating": 3.0, "review": "PLEASE forgive this intrusion. I can't write a review yet as I don't own this device as yet. I would very much like to try it. I need to know if there is any subscription price after purchasing the initial device. I understand that there are fees for some services offered through the device, BUT I am asking about fees associated with monthly use of the device itself. Please advise and assist. Once more, I apologize if I have done wrong by asking my questions in this particular forum. Thank you and may GOD guide and bless, Lloyd Thompson.", "verified": false, "helpfulness": "0/5", "author": "Lloyd Thompson"}, {"rating": 5.0, "review": "Such an awesome device. I use it all the time- I've had it up and running about 2 weeks now and haven't had any problems. I do recommend getting Amazon Prime- it does boost the features of this device immensely.", "verified": true, "helpfulness": "0/0", "author": "Kaitlin M."}, {"rating": 4.0, "review": "It met my expectations I was looking for an upgrade to the media player that I owned. I like the integration of apps on the Fire TV when searching for a movie or show to watch giving the user options, searching the various subscriptions I already have. I also like having the ability to download apps which was one of the reasons I replaced the media player I had. So far it has been a good choice.", "verified": true, "helpfulness": "0/0", "author": "Kent Petrie"}, {"rating": 5.0, "review": "It exceeded my expectations.  Being a Prime Member the selections are numerous.  Not having to pay for certain movies and programs is great.  I currently have DirectTV and can now delete some of those services and lower my satellite bill.  Also, we have a travel trailer and we hope to try this when we take it out and use WiFi.  Great product, glad I decided to buy. It took me two months to make the decision to buy.  Easy to hook up, user friendly and being able to speak into hand-held remote and order what we want to watch is great. Our DSL is usually slow and when we first turn on sometimes it will say that it will take awhile to load, but we disregard and within seconds we have the program or movie we selected.", "verified": true, "helpfulness": "0/0", "author": "Ginger Johnson"}, {"rating": 5.0, "review": "Best product I have bought in Years. Its a must have for everyone !", "verified": true, "helpfulness": "0/1", "author": "CAD"}, {"rating": 5.0, "review": "Works very well.", "verified": true, "helpfulness": "0/1", "author": "James J. Wilkins"}, {"rating": 5.0, "review": "Love it! It feels great to be free from cable TV", "verified": true, "helpfulness": "0/0", "author": "Erin Schmitt"}]