[{"rating": 5.0, "review": "Exceeds expectations, far superior to roku, smart tv, & apple tv", "verified": true, "helpfulness": "0/0", "author": "Sea Man"}, {"rating": 5.0, "review": "Great interface, easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "John M. Buffi Jr."}, {"rating": 4.0, "review": "A warning would have been nice. The product is easy to use and easy to set up but I was greatly disappointed that an HDMI cord was not included and I had to make a trip out to a store to get one before I could use this product. If I'd known, I'd have been prepared.", "verified": true, "helpfulness": "1/2", "author": "Deborah Olson"}, {"rating": 1.0, "review": "Don't bother! Very small selection of shows.  Once you find one that doesn't cost extra, the next time you want to watch it, they start charging you.", "verified": true, "helpfulness": "5/7", "author": "Anisha McCord"}, {"rating": 5.0, "review": "We have been so irritated with Direct Tv because it's linked in with our AT&T; service. Our bill kept going up and going up and finally, I discovered the Amazon Fire Tv. I told my husband about it and he started doing comparisons with other products like it. As soon as we got our taxes back we picked one up at our local Best Buy store and as soon as we got home we were floored by how amazing and wonderful our product is. This Sunday will make a week of watching our Amazon Fire Tv.We are so happy that we can access shows like Timmy Time for our daughter, as well as other shows that we like. We can access our Netflix account which has came in handy since my husband's PS3 needs to go to the shop to be fixed. I love how I can access music I have purchased or have listened to through Amazon Prime Music.There is NOTHING that I would change about this product. When we go on vacations we will take it with us that way we can watch what we wish to watch and not whats available on the tv within the hotel. Also I have a laptop and I'm sure I can hook it up through there to watch as well.This product has forever changed our lives. We are now considering downgrading our direct tv to a basic local channel and then when our contract is up, we will no longer be bound to a cable company.", "verified": true, "helpfulness": "0/0", "author": "Kristy Byous"}, {"rating": 5.0, "review": "This is an amazing device all you need is an internet connection and a TV that takes an HDMI cable. I can watch anything on amazon, connect my Netflix account HBo Show time and stream news, history, PBS, lifetime ect. Plus there are tons of free apps for music, cooking, live TV, kids, games or just turn my TV screen into a fire place or an aquarium :)", "verified": true, "helpfulness": "0/0", "author": "Lroy1984"}, {"rating": 5.0, "review": "Got this for my wife since I seldom watch TV anymore.  Once she learned her way around the interface, which did not take long, she really enjoyed it.", "verified": false, "helpfulness": "0/0", "author": "Dale King"}, {"rating": 4.0, "review": "The Amazon Fire TV unit was very easy to set up.  The on-screen menu and voice search both work well. Good selection of programs for Prime users.  Our only problem (and a major one) is that our so-called \"10.0M High Speed Internet\" service is undependable.  Most of the time we can watch a full-length movie without a problem and other times we totally give up viewing because the downloading \"magic circle\" appears every 15-20 seconds. Buyers should be aware that performance is totally based on the dependability and performance of their internet service.", "verified": true, "helpfulness": "2/2", "author": "Patricia Krakowski"}, {"rating": 5.0, "review": "Love this.  Very happy I traded in cable for Amazon fire.", "verified": true, "helpfulness": "0/0", "author": "Chelle"}, {"rating": 5.0, "review": "I am well pleased with this, especially the feature that allows you to speak to the remote and ask for the movie or TV show you're interested in seeing. (I hate having to key something in on a little screen composed of letters, which is time-consuming.) I would certainly recommend this to others who are interested in streaming.", "verified": true, "helpfulness": "0/0", "author": "Carolynn"}]