[{"rating": 4.0, "review": "If any one is having issues with Video playback on Netflix, Hulu, or prime, where they can play trailers but not watch movies it might just close the app and go back to the home screen or stay at a black screen, the issue is with the HDMI cable. Fire requires a Secure Connection with the TV i mean a Encrypted connection and some hdmi cables will not work properly with the fire, i had to try 3 different brands before i found one that would work, it was a old cable that worked. The new HDMI cable i purchase from amazon did not work, when i say it did not work, it showed all the apps, i could open up netflix and when i clicked on the show it would just crash. you can also try Unplugging and replugging back in might work for a day or so also. I had issue on my Sony 65in TV and my Vizio 42in TV. I love the speed and the apps on the Fire but really hate all the issues with HDMI cables not working. Best of luck!", "verified": false, "helpfulness": "0/1", "author": "N. Bernfeld \"Fix it\""}, {"rating": 5.0, "review": "Got this last week and we love it!", "verified": true, "helpfulness": "1/1", "author": "Happy Mommy"}, {"rating": 5.0, "review": "The fire tv is awesome. Very easy to use. The problem, very few amazon prime movies to watch that I\"m interested in. I didn't think to check that before buying it. Even the old movies you have to rent.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 4.0, "review": "Connection from another room via WiFi is quite spotty most of the time. Will have to look into a hardwired solution, unfortunately.", "verified": true, "helpfulness": "1/4", "author": "Thomas \"Everything is subjective.\""}, {"rating": 4.0, "review": "The kids love it and very easy to use", "verified": true, "helpfulness": "0/1", "author": "Gina Scarpinato"}, {"rating": 3.0, "review": "fine.", "verified": true, "helpfulness": "0/8", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a great box, and I use it everyday.", "verified": true, "helpfulness": "1/1", "author": "Eugenio"}, {"rating": 5.0, "review": "Simply awesome", "verified": true, "helpfulness": "1/1", "author": "Doug Hare"}, {"rating": 2.0, "review": "I have tried Amazon Fire TV - in many respects it works great and it has a fair price. But I sent my Amazon Fire TV back...! Why? Because I am tired of having to juggle ANOTHER remote to watch TV! I am tired of trying to \"type\" stuff using the remote and onscreen keyboard...! Why can Amazon not make their app work with other phones and/or tablets other than the Amazon phones and tablets...???!!! Google Chrome does. Roku does. Pretty soon the new Mozilla dongle thingy will... Sorry, being forced to use the remote for a keyboard is enough of a pain in the a$$ that I do not want to use the Amazon Fire TV any more!!! So back it went.", "verified": false, "helpfulness": "1/8", "author": "Cameron Ninham"}, {"rating": 5.0, "review": "This is a great device. Compact, sets-up easily. Has auto shutdown. Pretty easy to use but no written instructions.  Instruction are by video after set-up (or on the AMZ website) and could be a bit more complete, although it's pretty easy to figure out. I've had a few minor disappointments that content in which I'm interested carries a charge - in many cases far more than a DVD purchase would be but there is so much available for free with the Prime membership that the device is still an excellent value. I've already saved for later viewing more content than I'll get to in the next 6 months. If you take the time to explore you will find a lot of very interesting content that you never knew existed - at least I did.", "verified": true, "helpfulness": "1/1", "author": "Patrick \"PSW\""}]