[{"rating": 1.0, "review": "It worked for 2 days, and now has an error message that says: UNKNOWN ERROR.....that's all it says, I don't know who or how to contact Amazon to get this resolved..... Can any one out there help me?", "verified": true, "helpfulness": "1/2", "author": "Donna Marie Doane"}, {"rating": 5.0, "review": "RETURNED DIDNT NEED", "verified": true, "helpfulness": "0/1", "author": "M. Palmieri"}, {"rating": 4.0, "review": "Easy to set up and exactly what I wanted for my TV viewing. I need to learn more about all of the different ways I can use the box but I am eager to learn :)", "verified": true, "helpfulness": "0/0", "author": "amy bordynski"}, {"rating": 4.0, "review": "Really shopped around for a new home media player, and chose the Amazon Fire TV over them all. It was a toss up between the new Roku 3, or this, and after a lot of research, I chose this, and am very happy with my choice.The Fire TV is basically a computer, so it has a lot more that can be done with it, outside the standard media player. You can very much make it your own, with some tweaking, not to mention the available space, which is a big bonus.The only big thing that I wish it had is an ON/OFF button. If it wasn't for the lack oof the ON/OFF button, I would have rated it even better. If Amazon is reading these, this is really a must have standard feature to be added in the future ! Like any computer, it needs a reboot every now and again, to refresh the system, for updates, new add-ons, etc. Just going to sleep, upon non-use, really isn't good enough. Because of this, I have to unplug this at the end of each day.All in all though, I am VERY happy with my purchase of the Amazon Fire TV, and intend on getting another unit for my bedroom, to replace my bluray that is occupying that space right now.", "verified": true, "helpfulness": "0/0", "author": "Roxy"}, {"rating": 5.0, "review": "This fire TV is awesome!!!! I have turned off my cable and am strictly using Hulu. There is no turning back for me my cable days are over. The set up was easy and the picture is great. I set it up in my 6 year old son's room and he can work the remote himself. It is amazing, I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Gigideje"}, {"rating": 5.0, "review": "Have been through several similar products before finally deciding to try the Fire TV.This is by far the fastest device of its type that I have tried. If you don't have an Amazon Prime Sub, you may get annoyed since it focuses on content from Prime, but Apps for Netflix and Tune In Radio are pretty easily accessible.Very pleased with this unit, it does what I wanted and plenty more.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Appears to be very good, pleased with the purchase,,,,,,,,,", "verified": true, "helpfulness": "0/0", "author": "Gerald Ellison"}, {"rating": 5.0, "review": "More than satisfied!!", "verified": true, "helpfulness": "0/0", "author": "Josh Phelps"}, {"rating": 3.0, "review": "I would say the device itself IS meeting my expectations.  It was very easy to set up and is easy to use.  I love the voice search feature.  That is great!  The movies are organized very well.  BUT what I don't like is the  \"incredibly shrinking inventory\". There seems to be less Amazon movies to watch.  When I first signed up for Amazon Prime there were way more movies to watch with the Prime Membership.  Now there seems to be steerage to some of the other \"pay\" services like Netflix.  Come on Amazon don't mess up a good thing.  I've begun renting movies from the library.  You'd be surprised how far the library has come.  They are a force in the game now also.  And FREE!", "verified": true, "helpfulness": "1/1", "author": "Kimbella"}, {"rating": 4.0, "review": "Overall I like the concept of everything (Hulu, Netflix, etc.) being available to me all at a glance.  Saves me time. I also like the feature of being shown how I may can view a movie or show through an associated service.  What I do struggle with is the lack of current episodes on some of the more recent shows.  How To Get Away With Murder is a perfect example.  The new season is about to begin but I can only watch to episode 6 for free.  Episodes 7-9 (I think that's how many there are) I am being told I have to pay for.  I also believe the price for renting movies should be lower, probably more in line with RedBox.  One other note I'd like to add.  The service of Amazon Prime is awesome.  It's totally changed how I shop online.....", "verified": true, "helpfulness": "0/0", "author": "WolfPack"}]