[{"rating": 5.0, "review": "i love it, for the convience of watching movies , renting and buying without leaving my house even the most recent releases", "verified": true, "helpfulness": "0/0", "author": "kathy squires"}, {"rating": 5.0, "review": "We replaced an older, much slower streaming device.  The fire is so much faster and easier to navigate.  We love the voice search capability although we wish it worked for Netflix as well.", "verified": true, "helpfulness": "0/0", "author": "Carol Simon"}, {"rating": 5.0, "review": "Easy to install - zero thought, all you do is plug it in, switch the TVs HDMI input to the one you connected the Fire TV to and enter your wireless LAN password. It really is that simple.If you like watch free video that isn't YouTube trash, get this and a Prime Membership or a Netflix Membership, or both. It streams flawlessly from all the major services and really is HD in picture and sound quality. I've also used Roku and have to say, much as Roku is good, Fire TV is way better.The remote is wonderfully simple (like Roku's but perhaps a little more rational in its flow) and the voice search works perfectly (and I have a voice that is generally very hard for voice recognition software to deal with). I typically use voice now to find things instead of typing, though I must confess that I have not yet searched for Gary Busey ...", "verified": true, "helpfulness": "6/6", "author": "Biz \"biz\""}, {"rating": 5.0, "review": "We had cancelled our live content about 10 months ago with our satellite provider, and have been using Netflix only for 1.5 years.  Now with Amazon fire, we added Prime and Hulu, wow there is a lot to choose from.  We are a family of 3 with a 13 yr old and we all find something of interest, including family shows we can all agree on.The *only* thing that I see as lacking is a feature for different user profiles, similar to Netflix.  Everyone has to skip through each others shows or movies to see your own in each respective view or queue.", "verified": true, "helpfulness": "1/1", "author": "Mark T. Fay"}, {"rating": 4.0, "review": "i am waiting till amazon prime 30 day free trial expires to see if preformance declines. i love the voice activation for searching for movies and enct. i did not like the amazon prime video/movies. i never found one good movie that they did not charged fpr.", "verified": true, "helpfulness": "1/1", "author": "robert mccracken"}, {"rating": 2.0, "review": "I have high speed Internet but I can not get anything on it.  I will say it is very easy to set up, anyone can do it.", "verified": true, "helpfulness": "1/7", "author": "craftylady"}, {"rating": 3.0, "review": "I like the Fire, but it needs more development . The user interface could be improved. Not a bad start though.", "verified": true, "helpfulness": "0/0", "author": "BrewerBC"}, {"rating": 1.0, "review": "==The Good==* You can watch amazon prime, netflix, and many other streaming videos* You can buy plenty of digital movies on amazon* You can play some games, and I hope this gets better over time==The Bad and not so good==* NO USB - sorry, if you have a huge collection of digital movies, they won't play on this device* The game collection is pretty limited* Less than 5 GB of usable space, and many games over 1 GB... with no option of external storage! Does anyone see a problem here?? Why bother selling a game controller for a system that can only hold 2-3 real games? Even my freken cell phone can store more than this thing!* The search thing only works with Amazon apps and videos. Not netflix or anything else.If you have amazon prime and like buying digital videos from amazon, and don't give a hoot about gaming, this is a solid buy.If you want to get access to all of your video content + streaming from netflix, get a WDTV.... at least until external usb storage is available.", "verified": true, "helpfulness": "30/35", "author": "Ice cream samarai salami"}, {"rating": 3.0, "review": "I purchased the box the day it was released.  I recently became a \"cable-cutter\" and needed a box to replace my first generation Roku.  My main reason I went with the Fire TV vs. a Roku 3 was the promise of Free Time coming \"next month.\"  Well, it's now nearly June, and no Free Time for the Fire TV. Now you go out to the Amazon Fire TV Free Time section of their website and it says Free Time is \"Coming Soon.\"  So does that mean June, July, The First of Octember (it's a Dr Seuss book)?  I sent an e-mail asking about what \"premium\" content that would be offered for $2.99 a month (Disney, Nick Jr.?) - They can't say was their response. So it appears Free Time is a no-go.  I am also somewhat disappointed about the limited voice search only directing you to Amazon Content.  There has been comments from Amazon that this will eventually be \"fixed\" but no update yet.  In my humble opinion, it was released too soon.  The software is half-baked at best.  They should have perhaps held out for a summer release (July) with all the features that were promised.", "verified": true, "helpfulness": "6/6", "author": "El_roy"}, {"rating": 3.0, "review": "I do plan to check back in and provide additional scores and comments. I truely thought I was getting to elliminate the infomercials I pay for when I purchased cable TV - It kills me each month to write a check and there isn't anything on the cable TV channel but rerunts and infomercials for that I should receive a sample of everything.I am not a movie addict - occiasionally I rent a movie, I am not one ofr watchin series - I just like to occiaisionally sit and watch a good movie, NOt much of game player - I see where that would be 100 % great on here -Still checking other options out - I loved the music channels  -The price is great and I am gaining knowledge in all it provides yet I really purchased it ti get ride of cable and I am not able to.My bad for not fully understanding  but it wasn't my expectation", "verified": true, "helpfulness": "0/1", "author": "Ang Wyant"}]