[{"rating": 4.0, "review": "Very easy to set up!  Quick responses.", "verified": true, "helpfulness": "0/0", "author": "MeSue"}, {"rating": 5.0, "review": "Amazon Fire TV was easy to install and begin use.  Finding specific things in it can be somewhat challenging.  There are programs I would like to see available through Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Very quick response to commands. Voice command is really cool!", "verified": true, "helpfulness": "0/0", "author": "Philip B Tiffany"}, {"rating": 5.0, "review": "Great product especially when you use amazon for all your tv shows or movies. If you watch a lot on amazon then this is a must have.", "verified": true, "helpfulness": "0/0", "author": "Sean Miller"}, {"rating": 4.0, "review": "We love it! The only complaint I have isn't with the Fire TV it's self but with Amazon.  They need more prime movies!  That's why I only gave 4 stars!", "verified": true, "helpfulness": "0/0", "author": "great game teaches kids responsibility."}, {"rating": 5.0, "review": "love it ,so easy to hook up . Works great !!!!", "verified": true, "helpfulness": "0/0", "author": "mel oswalt"}, {"rating": 5.0, "review": "Wow. Best purchase I have made all year. Quick easy set up. Voice control search was fast and accurate. Perfect addition to my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Carol Yacko"}, {"rating": 5.0, "review": "Very simple to set up, and easy to use; excellent customer service to answer any questions you have. The  voice search is relatively accurate.  Fire TV allows you to access most of the streaming content on the web such as Youtube, netflix, and Amazon prime, seamlessly and at a reasonable cost.", "verified": true, "helpfulness": "0/0", "author": "Cking"}, {"rating": 5.0, "review": "Easy to install and navigate. Haven't used it much yet although there are lots of options. It remains to be seen if we use it or let it set for a decoration. I was a little disappointed in the availability of \"free\" movies in that many of the older movie classic are not free.", "verified": true, "helpfulness": "0/0", "author": "Ken F."}, {"rating": 5.0, "review": "Fast, rare lag with buffering, awesome HD graphics!", "verified": true, "helpfulness": "0/0", "author": "Mary Kelley"}]