[{"rating": 5.0, "review": "I have tried most of the interfaces between the WIFI and TV and this upgrade is the best.  The processor is fast, the voice command very accurate.  I would recommend this to anyone with a non WIFI equipped TV.", "verified": true, "helpfulness": "0/0", "author": "Marc W. DeBow"}, {"rating": 5.0, "review": "Much better than what I expected! I love the apps, Netflix and everything else that is included. Go get it!", "verified": true, "helpfulness": "1/2", "author": "Joel"}, {"rating": 5.0, "review": "Much better than the Apple TV, love the voice commands and the streaming,  the number of choices are much better.", "verified": true, "helpfulness": "2/3", "author": "Robert Hilsky"}, {"rating": 5.0, "review": "We love the amazon fire, all the movies and the pandora is great.  I like getting access to all the old tv shows, my son is in the process of watching every episode of Blue's Clues,", "verified": true, "helpfulness": "0/0", "author": "john macveigh"}, {"rating": 5.0, "review": "I have had the Fire TV for a week and absolutely love it. Wonderful for watching movies.  The set-up was easy,  already being a Prime member (well worth it over a year's time) and setting up for Netflix was easy too.  The voice-recognition--Amazon only-- works every time and is truly amazing.  It is so easy to browse movies, both in Amazon and in Netflix  (have to type-in letters with the remote controller when in Netflix tho). Using the little remote controller is easy and it also functions as the microphone for the voice-search function.  Way cool.  I am not a gamer so nothing to report on there, but for great movie watching and easy browsing, you won't be disappointed with this product, especially if you are already an Amazon Prime member.  It's so much easier to use than my laptop to access Prime and Netflix.  Try it and you will like it.", "verified": true, "helpfulness": "1/1", "author": "S. Drassler"}, {"rating": 5.0, "review": "So far the Fire TV seems to have solved my slow speed problem. Haven't had any buffering to date even with slow WiFi speeds", "verified": true, "helpfulness": "1/1", "author": "Floyd M. Lee \"Seeker\""}, {"rating": 5.0, "review": "The Amazon Fire TV is the best product I have purchased to access my Amazon Prime video products.  It is easy to use and install.  There are no additional monthly fees and the video streamed is clear and beautiful.  Just plug and play.", "verified": true, "helpfulness": "0/0", "author": "Phyllisoboyle"}, {"rating": 5.0, "review": "My Panasonic Blu-ray player wouldn't keep up with downloading after I moved to a new place where my Internet speed wasn't as good. Fire TV has no problem keeping up with HD movie streaming. I also really love the voice searching. It's fast and accurate. That's the way searching should work.I'm not much of a gamer, but have tried a few on the Fire TV. It seems to work well. Basically they are Android games and not the big action games, but that's fine with me.Highly recommended.", "verified": true, "helpfulness": "1/1", "author": "Clyde"}, {"rating": 5.0, "review": "I've had FireTV for 3 days now. I owned two Rokus over the last few years. The second was a Roku 3 that failed after three-and-a-half months (surprise, surprise, warranty is for 3 months-I got not service from customer service). Soon after that, my original Roku XD failed after a little more than two years.After an easy installation (that includes a brief product tour), FireTV outperformed both of my Rokus on all levels. It boots up faster, loads channels and videos faster, delivers better quality video, and it responds immediately to commands from the remote while Roku had a slight delay.FireTV automatically recognizes whether your connection is wireless or wired, while Roku needs to be adjusted manually. I ran it both ways and it did drop the signal while connected to wi-fi, but my wi-fi router is 5+ years old and I've experienced signal-drops while using my laptop recently so the router is more likely the problem. Once I connected the ethernet cable, the signal was flawless. Thinking I had to change the setting manually, I accessed FireTV's settings and found it automatically recognized the switch from wireless to wired.I will update this review if needed, but so far FireTV is a champ in my book.", "verified": true, "helpfulness": "2/3", "author": "Major Buttkraak"}, {"rating": 5.0, "review": "Haven't used this but a couple of times but it was so easy setting up and to use. Seems to pick up Wi-Fi better than the other I had. So far so good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]