[{"rating": 4.0, "review": "Recieved earlier than expected. Clear instructions and no problems in setting  fire tv.", "verified": true, "helpfulness": "0/0", "author": "melb1114"}, {"rating": 5.0, "review": "The Amazon Fire tv is great, love the apps, the free games for myself and my grandchildren. I loved the product so much that I purchase two more.", "verified": true, "helpfulness": "0/0", "author": "Betty Bryant"}, {"rating": 5.0, "review": "FireTV has opened up a whole new world of TV viewing for me.I've only had it a week and my Library is growing by Leaps&Bounds.;LOVE EVERYTHING ABOUT FireTV (except, maybe, the lack ofXena-Seasons 5 & 6.  I snagged the first 4- Didn't really want tohave to subscribe to Hulu For the last 2 Seasons.  Hopefully,Amazon will offer them soon.)Love the Voice Search.  Text Search is great, too...although, it doesn't seem to allow for Spaces...which put a bit of a krimp in the ONE and only timeI had to resort to it, after Voice Search couldn't findwhat I was looking for. (I did eventually find it... Bydoing a 1-Word Text Search.)FYI... the problem word was \"gut\".", "verified": true, "helpfulness": "1/1", "author": "D. Long"}, {"rating": 5.0, "review": "It works fine if you have a fast Internet connection. It's amazing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "BEWARE! You can only use the voice control on the main function to search. I though I would be able to click on YouTube and use the voice command. It DOES NOT WORK THAT WAY! You can only search using the voice command for PRIME.", "verified": true, "helpfulness": "1/1", "author": "baltimore gonzalez"}, {"rating": 5.0, "review": "Love love love my amazon Fire!! Works great and so many channels to choose from", "verified": true, "helpfulness": "0/0", "author": "Stacey"}, {"rating": 4.0, "review": "Good function. Easy setup. Grandson started playing games with the game controller right away.", "verified": true, "helpfulness": "0/0", "author": "Howard J. Roalson"}, {"rating": 5.0, "review": "Love this little device! We dropped our Directv service and haven't looked back. Lots of great shows, movies, apps, and games to keep us well entertained!", "verified": true, "helpfulness": "0/0", "author": "Nina"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "M. Scholl"}, {"rating": 4.0, "review": "Great price , wife loves it", "verified": true, "helpfulness": "0/0", "author": "patrick"}]