[{"rating": 5.0, "review": "I like seems to be a deal", "verified": true, "helpfulness": "0/0", "author": "tedf"}, {"rating": 5.0, "review": "Aside from the interface being super Amazon focused, it meets all my expectations. Obviously Netflix runs great, Pandora for party mixes and Plex for my media server. Can easily be recoded for Kodi... Highly recommend getting Amazon Prime to maximize its purpose.", "verified": true, "helpfulness": "0/0", "author": "Rogelio Reyes IV"}, {"rating": 5.0, "review": "As expected, the Amazon Fire TV is amazing. Very easy to connect and the remote works flawlessly. Sorry I didn't take advantage of this months ago.", "verified": true, "helpfulness": "0/0", "author": "Paul B. Wilson"}, {"rating": 2.0, "review": "When it works it is fine, but it does not work all the time.  Right now I cannot get it to work at all.", "verified": true, "helpfulness": "0/0", "author": "Vicki Davis"}, {"rating": 5.0, "review": "Absolutely great unit, especially if you put KODI on it. Compared to my Roku 3, this unit edges out the Roku with it's fluid and snappy interface. Only think about the Roku I still like is the headphone jack on the remote itself.If you are looking for a KODI/XBMC unit, look no further than the Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "Elvis V. Palombizio"}, {"rating": 4.0, "review": "This should be great. I do not quite understand all of the features but hopefully that will come.", "verified": true, "helpfulness": "0/0", "author": "William Harr"}, {"rating": 4.0, "review": "I bought this to use the second screen feature on my Kindle Fire HD, which works well. However if you have a slow internet connection, mine runs 2.8 mb/sec, streaming video is very poor. My Roku 3 does a much better job with the slow connection and would recommend that over the Fire TV if you are stuck with slow speeds.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 5.0, "review": "Excellenteeee.....!!!", "verified": true, "helpfulness": "0/0", "author": "anthony catelo"}, {"rating": 5.0, "review": "The Best!!!!", "verified": true, "helpfulness": "0/0", "author": "Steve D."}, {"rating": 4.0, "review": "It works fine.  I guess I was a little disappointed in what it actually provided.", "verified": true, "helpfulness": "0/0", "author": "John E. Allman"}]