[{"rating": 5.0, "review": "Installation and setup were uber-easy! The Amazon Fire TV works as advertised, providing plenty of apps and options to suit all our needs. We can even stream directly from our Apple and Droid devices. This was an added bonus we are very excited about. Great product and worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well. Surprisingly, the feature I didn't expect to notice but did was the screensaver. The screensaver set of photos is outstanding. Quite beautiful and varied.", "verified": true, "helpfulness": "0/0", "author": "James M. Stearns"}, {"rating": 5.0, "review": "Let me put this in perspective for you. This device has changed the way I process my entertainment! I was an Amazon Prime member before getting Fire TV. It was good before, now it is off the charts great!. I now have access to my files on my Amazon Cloud storage. That includes my photos taken with my phone (uploaded automatically with app). I can also access my music files from my TV which is connected to my surround sound system. So with a couple of clicks I can access artists, playlists and Prime Playlists that are in my files. And of course I have access to thousands of movies and TV programs from Prime! The picture (1080i) and surround sound are beautiful!  I started with a Fire TV Stick. That is on TV2 now. I then bought the Fire TV for my main TV. The vocal search feature works with music as well as video choices.There is no other system that give you this quality and selection. Get one and dive in! You will not regret it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great, easy to use and setup!", "verified": true, "helpfulness": "0/0", "author": "Johnnie Le"}, {"rating": 5.0, "review": "Works great, love the voice control!!", "verified": true, "helpfulness": "0/0", "author": "Donna M. Vann \"Donna Vann\""}, {"rating": 4.0, "review": "My kids love their shows.", "verified": true, "helpfulness": "0/0", "author": "Then Sien"}, {"rating": 4.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "Tony Bowker"}, {"rating": 4.0, "review": "It worked as well as I expected", "verified": true, "helpfulness": "0/0", "author": "Donald Cook"}, {"rating": 5.0, "review": "Great device! Besides streaming Amazon TV, it works also as XBMC player so can be used to play your stored video files.", "verified": true, "helpfulness": "0/0", "author": "Lola"}, {"rating": 5.0, "review": "I bought for wife and she absolutely loves it!!! We have been Prime members for years and now we are able to use our Prime video. Definitely recommended and should've bought one sooner!!", "verified": true, "helpfulness": "1/1", "author": "Dustin Dooley"}]