[{"rating": 5.0, "review": "Easy to setup and great choices. I also have an Apple TV and tried Chromecast , I would call it a tie but with Amazon you get free movies if you are a Zprime account", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to use and Fast Internet connection. Anyone can figure it out easily. Great for watching movies as well.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "This tiny, little box is fantastic.  I can't find anything negative to say about it.  Finally, someone built a technological item and thought of everything.  The voice activated feature is the best.  I fear though that those who do not enunciate their words properly and correctly may find some difficulty in using it but it far surpasses my old system of trying to type in each title.  Sometimes I'd get so frustrated I'd just turn the TV off.  The screen-saver was a sweet surprise.  Sometimes I just sit and watch the beautiful pictures as they roll by while listening to music.  The best feature is the ease in setting up the equipment.  One cable and you're done.  I should caution those who don't have fast, faster, fastest internet service.  It will hang up if you don't have all the updates.  It needs a 1080 system.  I think though that if you are considering the new UHDTV you will be okay.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer \"cartec\""}, {"rating": 5.0, "review": "This was my first venture into online TV and it is fabulous.  Finally, something so quick and easy.  I plugged it in and changed the input on my TV and it just started working.  Everything was so simple and there is so much content available it is mind boggling.  I took it to my vacation home over the weekend and it worked flawlessly.  It even remembered where I left off when I was at home and started the program in mid stream.  Highly recommend.", "verified": true, "helpfulness": "1/1", "author": "Earl Pritchard"}, {"rating": 5.0, "review": "I've only used it for a week, but it's been exceptionally easy to set up and use! All electronics should work this well!", "verified": true, "helpfulness": "1/1", "author": "P.R. Petrovich"}, {"rating": 5.0, "review": "Wow--pretty exciting to have this delivered in two days, then to find that it was as easy to install as the instructions claimed it would be, then to  find out that it was as easy to use as my Kindle--well done, Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Jo Ann Walker"}, {"rating": 5.0, "review": "Recently purchased this device and I must say, it was one of the easiest set ups around. All you do is plug it in and you're ready to start watching 1000's of hit Television shows, movies, documentaries or the latest sports and games. Would definitely recommend this product to anyone with a TV.", "verified": true, "helpfulness": "0/0", "author": "ali1972"}, {"rating": 4.0, "review": "The interface and functionality within the Amazon Fire TV is a real game changer when you consider other smart television options like Roku and Samsung Smart Hub. The menu transitions and loads (like loading a movie in Netflix) are just superior in terms of speed and user friendliness. My only complaints that cause this to get 4 stars instead of 5 are that at the very start I had to call customer service because downloading the main update at the beginning would not work over wireless. Apparently you need to plug into wired ethernet first. The update fixes the wireless. My second complaint is that some apps will not download properly to the device. I bought \"The Bard's Tale\" for example and the game only downloaded about 3 to 6% over wired or wireless. It would then no longer download making the game unplayable.", "verified": true, "helpfulness": "1/1", "author": "Vanessa \"Vanessa\""}, {"rating": 5.0, "review": "Wow, I love the Fire TV! I'm a prime member, hearing impaired and also a Netflix user. Netflix is slow to release the latest movies for streaming and I require closed captioning to enjoy what I watch. So far Fire TV has the best selection of recent movies/shows to stream and includes closed captioning. I love the feel of the remote and the system is fast, easy to use. Well done Amazon! Thank you!", "verified": true, "helpfulness": "1/1", "author": "MLAChicago"}, {"rating": 4.0, "review": "Easy to use and watch.  Streaming works well on Hulu and Amazon video, not so much on Netflix.I am not a big gamer and won’t play $400 for the latest gaming system. I do like to play occasionally so I am very happy it came with this capability.  It is not for the hard core gamer but for the cost of the games it has potential.Voice search works very well.  It only works on Amazon and not on other video provider’s apps.  You can click on the “More ways to watch” button in Amazon that allows you see if it is available on Hulu Plus.  This way you don’t have pay for something if it is available with another subscription.  I would like to see this expanded to include Netflix, Crackle, Tubi, etc.", "verified": true, "helpfulness": "1/1", "author": "K. Shook \"09er\""}]