[{"rating": 4.0, "review": "Need more free movies on Amazon Prime.  Even movies 20 years old you are charging $3.99.  A lot of newer releases are cheaper to rent at a video store.  For the cost though it is a great device.", "verified": true, "helpfulness": "0/0", "author": "Charles E. Brodeur"}, {"rating": 5.0, "review": "East setup and operation.  Works great", "verified": true, "helpfulness": "0/0", "author": "Cindy D. Holovach"}, {"rating": 4.0, "review": "It's not perfect, but it does a good job.", "verified": true, "helpfulness": "0/0", "author": "David Ouwenga"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "They charge me when I return make sure you really need it .", "verified": true, "helpfulness": "0/0", "author": "anquyen"}, {"rating": 5.0, "review": "Excellent streaming machine, fast and reliable. Love it", "verified": true, "helpfulness": "0/0", "author": "S. De Castro"}, {"rating": 4.0, "review": "The first one I received didn't work after one day.  However, Amazon did their normal great customer service and immediately shipped out a second one which has been working great ever since.  I'm still playing with it, but but have already rented and purchased movies from it and it worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Brian James"}, {"rating": 5.0, "review": "After asking for suggestions about controlling fire tv with a usb remote I tried it. The Logitech unifying usb reciever and mouse or keyboard mouse combination work great. I discovered that you can use the Fire tv controller,usb unifying mouse, and wireless keyboard with built in mouse all at once to make searching very easy. You need to turn off other Fire devices to do the install,then tun them back on.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "Easy to use it, we've been using it everyday ever since we bought it.", "verified": true, "helpfulness": "0/0", "author": "Shizuka Sun"}, {"rating": 3.0, "review": "It streams movies when I have enough data, but so do several other media players, most of which cost less.  I bought this thinking that the USB port would allow me to move movies that I own to a flash drive to have a library available when I get close to my monthly data cap.  Unfortunately, Amazon only wants you to be able to stream.  It's unbelievable that they would deliberately leave off a very simple feature that could make this device more versatile.  I'll never buy anything with any of Amazon's operating systems again.  It still gets three stars because it's faster than my Roku, and I can play a lot of free Amazon App Store games on it.  I really don't like rooting anything, but I'm going to give it a shot.  If I brick it, I'll just throw it away and buy a different media player.", "verified": true, "helpfulness": "0/0", "author": "zombilex"}]