[{"rating": 5.0, "review": "Worth the purchase.  This is a must buy.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "this device is easy to use.  The picture quality is great.  We are having fun with it so far!", "verified": true, "helpfulness": "1/2", "author": "Carlton Potts"}, {"rating": 5.0, "review": "Very useful/helpful with cable TV.", "verified": true, "helpfulness": "1/2", "author": "J J O"}, {"rating": 5.0, "review": "Easy set up! It does exactly what I need it to do!", "verified": true, "helpfulness": "0/1", "author": "Ana L. Fierro"}, {"rating": 5.0, "review": "If you follow online instructions to download xbmc makes it awesome", "verified": true, "helpfulness": "0/1", "author": "Blake Burton"}, {"rating": 5.0, "review": "We have not figured out how to purchase a movie on the Kindle and make it play on the TV. Any ideas?  But love it!", "verified": true, "helpfulness": "0/0", "author": "Dawn E. Pribis New \"cookie taylor\""}, {"rating": 3.0, "review": "Easy to install since it comes pre-loaded with your Amazon account info, and Prime if you have it. I also have a Roku, which I moved to another room and put the Fire in the living room. The picture quality is excellent and the remote is fairly easy to operate, although the circle directional button frequently jumps ahead to more than one selection. Annoying, but not fatal. Selecting the apps is not as easy as the Roku since the most frequently used ones are jumbled in with lots of others that I'm not interested in. I suspect this is a marketing decision to get people to see the game apps. Annoying. The remote is more comfortable to hold than the Roku remote and the back button is very useful. I got the box version rather than the stick so I would have the option of plugging in a USB stick. My Roku also has this feature. I will give it some time to see if it proves to be better and firmware updates fix some of the things I don't like.", "verified": true, "helpfulness": "1/1", "author": "Books 'n Music Forever"}, {"rating": 5.0, "review": "Works great!With prime and netflix who needs cable", "verified": true, "helpfulness": "1/1", "author": "Denise Trujillo"}, {"rating": 5.0, "review": "I absolutely love it! Love the voice recognition! I have an Apple TV, Roku, and Chromecast. This product is far superior to the others with the Apple TV a close second.", "verified": true, "helpfulness": "1/1", "author": "PW"}, {"rating": 5.0, "review": "Very nice. To use when nothing on local channels.", "verified": true, "helpfulness": "1/2", "author": "doug corley"}]