[{"rating": 4.0, "review": "It's just what I wanted.  A lot of fun.  I will take me a while to figure all of the things that I can do with it.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Juarez"}, {"rating": 4.0, "review": "Great addition to my entertainment choices. The voice remote is as good as advertised and is a great feature. I would deffinately recommend the fire tv and am actually ordering another for my camper. Now, if only I could access my sports, I could cut the cable!", "verified": true, "helpfulness": "0/0", "author": "KATHY P."}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/1", "author": "Jeffrey"}, {"rating": 5.0, "review": "Love it. Get it. Period.", "verified": false, "helpfulness": "0/1", "author": "David Spence"}, {"rating": 5.0, "review": "Love it.  Great picture quality, easy to use.  Able to watch stuff on my local media library (via: Plex).  For techies, you can sideload apps (XBMC!).", "verified": true, "helpfulness": "0/0", "author": "Lou Solomon"}, {"rating": 5.0, "review": "Easy to hook up and use. Meets every thing I thought it do.", "verified": true, "helpfulness": "2/2", "author": "Todd Porth"}, {"rating": 5.0, "review": "My family love's the Amazon fire tv. It is very fast and the voice recognition works extremely well. It has tons of apps available from music, games, tv shows, and movies .We continue to add more and more apps of which most are free. I was also pleasantly surprised to find out how small the unit is.", "verified": true, "helpfulness": "0/0", "author": "James L. West, III"}, {"rating": 5.0, "review": "One of the best entertainment systems that you can find, I am glad to get it", "verified": true, "helpfulness": "0/0", "author": "JCA"}, {"rating": 1.0, "review": "Didn't work with TIVO. Wish Amazon had been upfront with that. I was looking forward to using it.", "verified": true, "helpfulness": "1/5", "author": "Kirk E. Johnson"}, {"rating": 3.0, "review": "It's ok not quite what I expected but it's cool. You just have to subscribe to every thing you want and then it is cheaper to just gave cable", "verified": true, "helpfulness": "0/1", "author": "Daniel Luke"}]