[{"rating": 3.0, "review": "Nothing special, really.", "verified": true, "helpfulness": "0/0", "author": "Brian Gleeson"}, {"rating": 3.0, "review": "Does not steam Prime music.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "An excellent \"box\".  Interestingly much cleaner than the Apple TV.  Amazon's access to programming such as the HBO series available to Prime customers is also a great feature.", "verified": true, "helpfulness": "0/0", "author": "David G. Ballou"}, {"rating": 4.0, "review": "The reason I purchased this is for the free prime movies. I am pretty happy that I did. Glad to have another option to rent / buy movies than Apple it keeps companies interested in giving us consumers a deal.The only thing I don't like about this compared to apple TV is that when streaming, the movie buffers on a regular basis. We have an apple TV also and that streams seamlessly so its not the internet connection, it has to be the unit (at least in my mind), keep in mind this is connecting wirelessly. I love the voice activated search and the free prime movies. I will try and wire the device to internet and see if that fixes the issue, if so than this is a 5 star product. The design of the unit and remote (and packaging) are very appleesque feels good and works good, good to see another company presenting the product the way it should be done, happy there wasn't a gigantic plastic impossible to open clamshell packaging I hate those...", "verified": true, "helpfulness": "0/0", "author": "SBHIPPIE"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "david grimes"}, {"rating": 4.0, "review": "As good as the Apple TV. Only thing missing is iTunes (of course) and HBO GO. If you have a Prime account and access to Amazon ecosphere it's worth it to consider over Roku. I still like my Apple TV as well.", "verified": true, "helpfulness": "0/0", "author": "Bruce Carey"}, {"rating": 4.0, "review": "Love it kind of expensive but works great", "verified": true, "helpfulness": "0/0", "author": "Mike Little"}, {"rating": 5.0, "review": "Lowered my cable bill from $210 a month to $68 each month for basic and internet.  If you are the person that wants to watch a specific new person at the time it is released this may not be for you.  More movies and shows than I could ever imagine.", "verified": true, "helpfulness": "0/0", "author": "DLB"}, {"rating": 1.0, "review": "I bought the Amazon fire TV because customer service inform me that the Xfinity app would be available on the Amazon fire. Which I have come to find out it is not nor do any of Comcast Xfinity apps work on the Amazon fire I cannot watch HBOGO, Showtime or any of the other apps because my provider is Comcast I am not satisfied at all.", "verified": true, "helpfulness": "0/4", "author": "SKY"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "shirley a wainess"}]