[{"rating": 5.0, "review": "One the best for streaming,  I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "G.texas"}, {"rating": 5.0, "review": "I love being able to stream prime tv shows for my daughter.  She watches a lot of baby first TV and it is easy to access in my watch list.", "verified": true, "helpfulness": "1/1", "author": "Jess"}, {"rating": 5.0, "review": "Awesome.  With this, Hulu and Netflix, we are cable free!!!", "verified": true, "helpfulness": "1/1", "author": "UltimateCap"}, {"rating": 5.0, "review": "We love this device.  It was worth the investment.", "verified": true, "helpfulness": "1/1", "author": "pooh_girl"}, {"rating": 5.0, "review": "Great product, work fine right out of the box, games are fun, cool music features. Functions very smooth. Would have like though for it to come with an hdmi cable.", "verified": true, "helpfulness": "0/0", "author": "Leonard Loefstop"}, {"rating": 5.0, "review": "Especially when bundled with SlingTV, Amazon Fire TV beats standard cable and pricing by a long shot. Totally worth it!", "verified": true, "helpfulness": "0/0", "author": "Jessica Sanko"}, {"rating": 5.0, "review": "Ok so does it work? Yes it does everything u need and it saves a ton of cash on the cable bill, however could i have gotten pretty much the same experience with a smart bluray player? Yes. Either way its a pretty great product, no complaints.I guess the only thing that really bothers me is the lack of decent programming from prime. I have had prime for years for shipping and now that i am checking out more tv and movies on prime i realize the selection of \"prime\" free is awful. Netflix selecion is way better. Dont get me wrong, u can pretty much get anything u want on prime but u still gotta pay for it. Starting to wondr if prime is that geat of a deal...", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I had a composite video/audio TV or Legacy TV.In conjunction with the TV I had installed a Keedox HDMI to Composite RCA converter box.The audio was lost in the process. My laptop would work via the HDMI port but not the Fire TV boxAn exhausting week and Three support techs later it was finally unveiled to me the reason for no sound was that the Fire TV box has a built in defense ecumenism that when suspect of a possible recording device it will nullify the sound.  The only solution was to purchase an HDMI capable TV.So I did, and now everything works as it should.Some documentation to that effect would have been nice....", "verified": true, "helpfulness": "0/1", "author": "Mark"}, {"rating": 5.0, "review": "Outstanding  product!", "verified": true, "helpfulness": "0/0", "author": "Jody Davis"}, {"rating": 5.0, "review": "Thanks for Transparent, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Susana Flores"}]