[{"rating": 5.0, "review": "I love the Fire TV!", "verified": true, "helpfulness": "0/0", "author": "MzRiss126"}, {"rating": 5.0, "review": "It's great!!  Does exactly as advertised.  The voice recognition is incredibly good.  There is so much available with the Amazon Prime that I always have something to watch.  It has great little features that just make life easier, like when you hit any button it comes out of sleep mode and, at least on my TV, if its on but on another source setting (HDMI 2 or Cable box whatever) it switches it to the source you have the Fire TV connected on.  Recent firmware update made great little changes so I look forward to more improvements as time passes. Another little pus is that you can download the fire app on almost any device and you can use your cellphone or tablet as the remote control, including the voice search.", "verified": true, "helpfulness": "0/0", "author": "Lawgirl"}, {"rating": 5.0, "review": "Works as described  have a smart tv now", "verified": true, "helpfulness": "0/0", "author": "Andi Magyar"}, {"rating": 5.0, "review": "Great for movies etc... but they don't have NHL Game Center so I had to buy a Roku too.", "verified": true, "helpfulness": "0/0", "author": "JCNow \"JC Now\""}, {"rating": 5.0, "review": "VERY HAPPY. I am a cablecutter, and only watch a few things on TV, mostly Antenna. Things like Tennis Slams, NBA-Playoffs aren't over-the-air anymore. Got SlingTV for ESPNs, TNT/TBS, CNN, AMC. Just using the internet on your computer is pretty low quality. This Amazon-Box buffers this stuff up to where it is almost HD quality (still get 1 or 2 buffer-glitches/hour though). Lots of undocument tricks here. I use a wireless mouse, more often than I do the remote, ocassionally hook up a KB to the USB port ( it auto-recognized my Logitech unifying receiver instantly, and I could  use my wireless mouse & KB same time). One annoying 'feature' is that it keeps over-zooming my screen and I have to keep going in and resetting it, but only matters on certain programming.  Also, on History Channel, I was able to pull up several shows from earlier the same day, and sometimes if I tune in late, it lets me start from the beginning. Some Programming you can skip backwards, and occasionally you can even skip forward past commercials, (current program, that you restarted from the beginning).Very high quality product, fastest processor, and most memory of any media player out right now (Apr2015). I was doubtful before I bought it, very happy.", "verified": true, "helpfulness": "0/0", "author": "Z. G Zinzel \"zzinzel\""}, {"rating": 5.0, "review": "This is going to make cable almost obsolete", "verified": true, "helpfulness": "0/0", "author": "Lydia"}, {"rating": 4.0, "review": "Great device, but not enough memory.  Sev Zero and Asphalt 8 eat up the bulk of the storage, leaving room only for a handful of apps.", "verified": true, "helpfulness": "0/0", "author": "Mom2Boys"}, {"rating": 5.0, "review": "Works as expected quick and easy", "verified": true, "helpfulness": "0/0", "author": "Bill \"Love books, hate to read!!!\""}, {"rating": 5.0, "review": "Leaps and bounds from my Apple TV2.  Makes Apple TV2 look like MS-DOS", "verified": true, "helpfulness": "0/0", "author": "T. Conner"}, {"rating": 4.0, "review": "Still trying to learn it?", "verified": true, "helpfulness": "0/0", "author": "Chester Parrott"}]