[{"rating": 5.0, "review": "So far so good.", "verified": true, "helpfulness": "1/2", "author": "Nathaniel Myer"}, {"rating": 5.0, "review": "I love my firetv. My boyfriend has appletv and it just doesn't compare. Firetv is so much faster, and in my opinion, easy to use. Setup was pretty easy.Tip for future users: after set up, check for and install any updates. It took me a while to find out that I had to do this, but I was determined because I wanted to use Netflix on it already.", "verified": true, "helpfulness": "0/0", "author": "Anita Le"}, {"rating": 5.0, "review": "I watch a lot of Netflix and Amazon Prime on this, so many weeks when the TV shows are doing repeats, AGAIN. It gets a lot of use.", "verified": true, "helpfulness": "0/0", "author": "John Barradale"}, {"rating": 4.0, "review": "Kids love the fire TV as they can watch their favorite cartoons and show.  I was going to give 5 stars but the first fire TV we got didn't work so they send me another one.  The 2nd one works great with no issue.", "verified": true, "helpfulness": "0/0", "author": "Cj"}, {"rating": 5.0, "review": "We love this fire stick. We have watched many movies, TV shows, kids shows and the selection is good.", "verified": true, "helpfulness": "0/0", "author": "Nancy Alvord"}, {"rating": 5.0, "review": "Excellent purchase!", "verified": true, "helpfulness": "0/0", "author": "Bolt"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Derrell Saykally"}, {"rating": 2.0, "review": "Nothing new or different from the others nothing special although the navigation was easier to use", "verified": true, "helpfulness": "0/1", "author": "Cesar"}, {"rating": 3.0, "review": "I like the whole concept of the Fire TV, BUT I am not liking to have to change the batteries every time we want to use it... Is there not a \"off\" button or switch, the little light on the box is way too bright at night when all the lights are off (everything else). Both of these things are really annoying so much that my husband is wanting to get rid of it all together, but my daughter & I would like to keep it. Is there anything that can be done to fix this could we possibly have a faulty remote? Even though we purchased this in Dec 2014, we never hooked it up until Feb. 2015 & I can't tell you how many batteries we have really gone through.. When we left on a little vacation, we just unplugged the whole Fire TV all together. I am never able tnd any info that this is indeed normal or what could be helpful..", "verified": true, "helpfulness": "0/0", "author": "S. Danks"}, {"rating": 5.0, "review": "Just like new...and it makes using amazing instant video so much more rewarding to use. Worth every dollar", "verified": true, "helpfulness": "0/0", "author": "Brain Joshua Kidd"}]