[{"rating": 5.0, "review": "Great product that is very easy to use and comes ready to go!!!  I highly recommend it to anyone. 5 Stars playa!", "verified": true, "helpfulness": "0/0", "author": "Ryan Miller"}, {"rating": 5.0, "review": "Today I replaced my Roku 3 with Amazon Fire TV.  It was quick and easy. I'm impressed how Amazon offered a delightful \"unboxing\" experience, and very fast set-up.  It truly was \"plug and play\" and the fact that it was already set up with my account info was a nice touch.  I'll use this to watch Amazon Video and Netflix.  I set up Netflix in a couple of minutes, and the Netflix app was quick & snappy - as good or better than the Roku!  So - I'm a fan of Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Gamma"}, {"rating": 1.0, "review": "I have upgraded my wireless and I can start my apps (Hulu and Netflix) but the shows won't stream, to make matters more insulting, the effen tv commercials on Hulu will play crystal clear without streaming the show. What gives? I can even throw the laptop onto HDMI (quality HD) and it works fine.If you're going to roll out a new product you should at least have adequate customer service.  Y'all need to figure out the chat to phone transfer, the customer information should auto transfer or the peeps behind the scenes should transfer the information for a seamless transfer, even with \"different departments\", after all, you are one company!!!!!!!!", "verified": true, "helpfulness": "15/18", "author": "Harmony Wilson"}, {"rating": 5.0, "review": "this thing is amazing. I wish there was someplace you could go to see ALL the titles available on prime. everything I've seen shows a few here and a few there but this device is terrific!!! highly recommended", "verified": true, "helpfulness": "0/0", "author": "charles tanner"}, {"rating": 3.0, "review": "For starters, there are only a few of the free Prime shows listed. There should be a section where all of the prime shows are placed and easy to find. Shows should only be listed once and then after clicking the show artwork the seasons available. 150 shows are all spread out so it is annoying having to go through them all. Show seasons aren't even together. It is a mess that needs to be sorted. Yes, there is voice search but, if you don't know what Prime videos are available you could spend days trying to find something to watch...or, just give up and go to Netflix. I bought this because it sounded like it would be better than my Roku. I am not yet convinced it is, I know it is early in its release so, I will give the developer a little time to fix the problems. Main problem is lack of Prime videos and storage is limited so probably won't use it for games. I am on my second day of owning this box an already it is telling me there is a problem loading videos. The screen saver pictures are nice though. Also, we should be able to attach an external USB drive to download movies and music we buy. I have several movies we bought from Amazon but, they only allow downloading them to Windows PC. So Apple users are better served buying videos from ITunes until this policy changes.", "verified": true, "helpfulness": "1/1", "author": "cdmr9816"}, {"rating": 3.0, "review": "I really like the equipment. It is small and works well. The voice search feature is nice. Could have been a home run. Fire stars.However, not being able to down select to see just prime not so cool. Even the iPad app does that.... So one star for that. Go fix it! Update your software!", "verified": true, "helpfulness": "2/4", "author": "Tyler"}, {"rating": 5.0, "review": "Just setup my new FireTV ordered via my Amazon account and so far so good so fast. Setup time: 10 minutes.The good:1. NO setup to access Amazon content.I am already a Prime member so once I had my wifi setup the FireTV did a quick scan of the internet for updates before running the tutorial video. To my surprise once the tutorial was completed I was welcomed by web my Amazon username (\"Hello <insert name>!\")complete with my Watch List and Video Library. No additional steps needed to access my content. Cool and creepy at the same time. But, who am I kidding my electronic footprint is large.2. Super fast. The FireTV interface (content menu system) is quick and straightforward. It's a better faster interface than any of my other devices I own that streams Amazon content (PS3, XBOX <deprecated>, iPad, Vizio SmartTV, and wifi enabled BD player). I do not have a Netflix membership so I haven't tried it yet (Maybe there's a free trial attached, but will Amazon allow that?). I played a movie out of my Amazon Video Library and it started instantly. Missing is the \"your content is still loading\" delay. I am telling you the movie started immediately.3. PRIME content.  I read some comments that stated posters had trouble being able to easily identify PRIME content. I am not having the same problem. All PRIME content displays the blue PRIME banner in the upper left hand corner as it does on all the other devices mentioned above. So maybe there has been a software update since. Which means Amazon heard you.4. Power. I was concerned over the lack of a power button on the remote or FireTV unit itself which I thought meant the device would have to be manually disconnected from the power source. NOT SO! The device goes to sleep (no power LED activity) after a set period of time and is easily awaken by the press of a button on the remote. Perfect.The bad:1. Haven't found it yet.", "verified": true, "helpfulness": "2/2", "author": "GameWarden"}, {"rating": 3.0, "review": "I noticed within a week that some movies I had watched in the past on PRIME for FREE are NO longer on the Free list.  And where did all the Chick-Flick movies go?  we have to pay for each thing now?  still deciding if this is getting returned or not.  The equipment is awesome and set up was fast and so so easy, but I didn't purchase it to PAY for each and everything I want to watch. I love Amazon and shop all the time, but .... why take the movies off the FREE list for PRIME?", "verified": true, "helpfulness": "1/1", "author": "LKelly"}, {"rating": 5.0, "review": "the voice recognition makes finding content so easy, even worked with hulu+!I already had a mogo pro so I tried out the games and for a android console they are first rate!far better then oyua which i'm sorry to say i'll never use again.the tv and music content and menu's are very quick thanks to the very powerful hardware under the hood!overall I'm positive that this unit will kill roku and apple tveven google chromecast better be careful! (I own all these units so I speak from experience)", "verified": true, "helpfulness": "1/1", "author": "edwin miller"}, {"rating": 3.0, "review": "UPDATE 11/17/14: With some new issues I'm having with my FireTV I thought I should post an update.  I'm not sure the best way to put it but the FireTV is \"deauthorizing\" me from the streaming services.  It will work for a while then this happens again.  It still allows me to login and it looks as though I have access but I can't play videos, I always get an error message.  This happens on Hulu+, Netflix and even Amazon Prime VOD.I did all the basic troubelshooting myself - uninstall/reinstall the apps, power cycle the device.  It would work for a few days then crash again.  When I finally spoke to Amazon they ran me through the same steps, and I told them that it would work for a while and then crash again.  Basically I was told that if they could get it to work while they were on the phone that's all they could do and call back if I had the problem again.  As I told them, repeatedly, I'm having the problem again.  Probably 1-2x a week I will have to physically pull the power cord from the device and restart it.  I should not have to do this but Amazon won't do anything about it.I've always been a fan of Amazon but have to say this is disappointing.  Basically they don't seem to want to repair this, just keep putting a band-aid on it.-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------I've had my Fire TV about a month now land have used it almost daily, it's my main media device now.  I don't have cable and watch all my TV/movies over streaming devices.  This replaced a Roku 2.Overall this is a very good media device.  I had some issues with setup (Netflix wouldn't log in, video settings were messed up, Plex didn't work) but got them worked out in a couple days.  Moving from a Roku it took me a little while to get used to the interface, but it's pretty intuitive once you use it for a while.  The Fire TV is FAST, especially compared to my Roku 2.  It seems to multitask much the way an iPad does where it puts the application on hold, I noticed if I left a game and went back in a few minutes later it started instantly and in the same spot I left, rather than relaunching the app.  Streaming media loads quickly, it seems that some of the Amazon content may actually pre-load when you're viewing the details as many of the videos started playing instantly when I selected them, very nice.  The voice search feature is nice but only works with Amazon content, I did speak with Amazon and other providers are working now to integrate the voice search.It's worth noting that the navigation screen is (expectedly) very geared towards Amazon VOD content.  The TV and movies on the main screens are all Amazon content, you have to go into the others apps (Netflix, Hulu+) to see they're offerings.  On the Roku it would show on the sidebarThe games on the Fire TV are pretty impressive as well.  I've played quite a bit of Asphalt 8 and Dead Trigger 2 and they play just like on a console.  Graphics are very good, maybe not XB1 or PS4 good, but for a $99 media streamer they're pretty darn impressive.  I purchased the game controller as well and it works great.  I heard there were some issues with lag when playing games on the Fire TV but I have not had any issues there.The one major issue I see with the Fire TV is it's lack of memory.  In order to play various games on the device I have to uninstall and reinstall them as there's not enough room on the device to hold more than a couple games, especially the graphics intensive games like Asphalt 8.  I spoke with Amazon support and was told by the tech that he hopes they will add support for external storage in the future, there is a USB port on the device, but that had not been announced yet.  The ability to add more storage would be a huge improvement IMO.  A more minor issue is that the Amazon content is not filtered to show only Prime content so several of the movies/shows you want to play may require you to purchase them, I would really like the ability to filter and show only Prime content on the device.The Fire TV is a big improvement for me over the Roku 2.  It's fast, it has the content/apps that I watch and the gaming experience is pretty impressive for a device at this price point.  Some tweaks/upgrades to storage and voice search could make this even better but if you're looking for a streaming device I would recommend the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "T. Dennis"}]