[{"rating": 5.0, "review": "I have never had an easier installation.  Just great!", "verified": true, "helpfulness": "0/0", "author": "D Maurice Poyurs"}, {"rating": 4.0, "review": "Bought it for family, it did a bit of buffering when we first set it up, but then re-set the router and that seemed to help a bit. It's not running on super fast internet, so it's hard to tell how it would work on faster speeds.  I don't like that the voice search function only works in Amazon Prime and not Netflix or other programs.  The device really is made for Prime members!", "verified": true, "helpfulness": "0/0", "author": "laurstelli"}, {"rating": 5.0, "review": "Love my new Fire TV!  Great quality, easy setup, and love the easy access to Prime Instant Video and Netflix.  Also really love the Android app that I downloaded for free, which turns all of our phones into fully functional remotes including voice search.", "verified": true, "helpfulness": "0/0", "author": "Kurt"}, {"rating": 5.0, "review": "Worked right out of the box, easy to add my Netflix account. Image quality is great, and user interface quite decent for not having a keyboard.", "verified": true, "helpfulness": "0/0", "author": "M Roberson"}, {"rating": 5.0, "review": "Thank's for everithing now is great", "verified": true, "helpfulness": "0/0", "author": "Víctor Cano"}, {"rating": 5.0, "review": "Best purchase!  Easy to install and I love the parental controls.  Keeps anyone from purchasing movies without permission.", "verified": true, "helpfulness": "0/0", "author": "Belinda Glencoe"}, {"rating": 4.0, "review": "Works well and is easy to use.  Took over an hour to download, though.", "verified": true, "helpfulness": "0/0", "author": "Proud Liberal"}, {"rating": 2.0, "review": "You're asking the same price as a blu-ray yet no slot for a disc and the exact same functions that come with a blu-Ray player. This is just another way for Amazon to make a $1", "verified": false, "helpfulness": "0/2", "author": "Zachary Lehman"}, {"rating": 5.0, "review": "Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "just love the fire TV, convenient and lots of choices", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]