[{"rating": 3.0, "review": "I purchased the Fire TV for three reasons:1.  It can run plex2.  To try and roll up other streaming services (Netflix, Amazon Prime, etc) in one device.3.  Very nice hardware specifications compared to other streaming devices.While the hardware itself has turned out to very nice and high quality, unfortunately the Fire TV needs a lot of work on the software side.Plex:I'm coming to Plex on the Fire TV after running Plex on a dedicated HTPC.  Plex on the Fire TV is somewhat comparable, but it relies on the codecs that the Fire TV natively supports to play media.  Unfortunately, the Fire TV doesn't play nearly has many formats as Plex on an HTPC is, so in many cases, audio and video has to be transcoded by the Plex server to be displayed on the Fire TV, which can introduce problems.Other streaming services:Netflix, while functional on the Fire TV is old and not the \"normal\" Netflix experience that is widely available elsewhere.  While the Fire TV offers easy access to Amazon Prime streaming services, all the Amazon video content is jammed together in most situations, and just browsing through Prime streaming content is more difficult than on say, the Xbox 360.  Supposedly this is being worked on, but the date to fix that has come and gone, so I don't have a ton of faith in Amazon keeping this device up to date.I really wanted to love the Fire TV, but I suspect it's going to get returned, and I'll go back to an Xbox 360 for streaming services, and an HTPC for Plex. :(", "verified": true, "helpfulness": "0/0", "author": "Daniel Peterson"}, {"rating": 5.0, "review": "Amazon did well on this one.  Got this for my wife and she loves it.  I'm a techie and I love it.  Better than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Webhead"}, {"rating": 5.0, "review": "Very easy to set up, easy to use. Love the screen savers that are loaded onto the unit. I recommend Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amy Mathiason"}, {"rating": 2.0, "review": "I bought this for my parents who currently have satellite internet and only local channels. They are permitted a set amount of internet usage a day and the set up alone for this went over their daily limit. This is my fault for not researching the requirements for this device a bit more.", "verified": true, "helpfulness": "1/7", "author": "Kelli Brooks"}, {"rating": 4.0, "review": "Works well, disappointed in number of shows for purchase as opposed to free with prime membership, especially after getting hooked on free first series' of many newer tv shows and having to buy additional years.  The voice activation is good, very helpful when searching for specifics.", "verified": true, "helpfulness": "1/2", "author": "MIMI"}, {"rating": 5.0, "review": "good job, inexpensive and very capable device. very happy with functionality, performance and apps.I hope they continue good work in adding more apps.", "verified": true, "helpfulness": "0/0", "author": "boss"}, {"rating": 5.0, "review": "the voice activated remote is the best.  My husband has eye problems and has fussed he can't see the letters.  Now he is the happiest I have seen him in awhile.  Also great amount of choices.", "verified": true, "helpfulness": "0/0", "author": "Patricia Morrison \"nags head reader\""}, {"rating": 5.0, "review": "Set up is simple! Takes 5 minutes. The picture quality is amazing. The voice search works perfectly. I do wish there was a way to only show Prime content. I am impressed.", "verified": true, "helpfulness": "0/0", "author": "Brenda Ronsick"}, {"rating": 5.0, "review": "It was easy to hook up and easy to use and there is a great selection. say goodbye to high cable bills.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love my fire tv, fantastic product, very easy to use and love the mirroring capabilities with my kindle hdx! Also love the wide range of apps you can download as well!!", "verified": true, "helpfulness": "0/0", "author": "Mitchell Benson"}]