[{"rating": 4.0, "review": "I am a Prime member and this was very easy to set up. Plug it in, pick my AT&T; network, enter password.I got this to replace by Roku box which seems to be running slow. Additionally, I wanted to access my Amazon Music Library.The Good:  Speed and quality of picture excellent.  Voice control very cool; have to learn hot to better use itThe Bad:  Cannot access my Music Library  Extra channels (like Roku - TED and hundreds of others) are not available on Fire - only a handful. I will keep my Roku  to access those  Like others have stated - no indication if your selection is free \"Prime\" or pay per view. But it does have My List available.", "verified": true, "helpfulness": "2/2", "author": "Rick \"Oldman\""}, {"rating": 5.0, "review": "This thing blows Roku out of the water.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV makes streaming movies and TV shows effortless. The voice feature works very well.", "verified": true, "helpfulness": "1/1", "author": "MB"}, {"rating": 5.0, "review": "I previously owned a Roku player and was very satisfied. Decided to try the Kindke Fire Tv as an upgrade to the Roku, which I occasionally had buffering issues when streaming.  I've since ditched my cable company.  This player streams beautifully, the interface is intuitive, and I have access to prime video, Netflix, and hulu plus.  I highly recommend this player to anyone thinking of getting a streaming device.", "verified": true, "helpfulness": "1/1", "author": "Erika"}, {"rating": 5.0, "review": "WOW!  Over the past few years I have owned many of the Internet streaming devices including those made by Roku and Sony.  At the time I was completely satisfied with the performance and features of these devices.  But as a result of requiring another streaming device I decided to try the Amazon Fire TV.  As the old saying goes:  \"You don't know what you are missing until you try it\", well this streamer blew me away !!! The video quality is OUTSTANDING.  The audio quality is OUTSTANDING.  There is nothing on the market that compares to the features, video quality, and audio quality of the Amazon Fire TV.  If you are in the market for an Internet streaming device, this is the only one to buy.", "verified": true, "helpfulness": "3/3", "author": "Eliott Mendelson \"ele\""}, {"rating": 5.0, "review": "Love this product. Works better than Roku (which failed in 6 months) - very zippy, and the voice recognition works great. The only downside compared to Roku is fewer service provider. For example, Acorn is not available.", "verified": true, "helpfulness": "2/2", "author": "Rick Turner"}, {"rating": 4.0, "review": "I have had Fire TV for a couple of weeks now and all works great but I do have one complaint, NO MANUAL, which is necessary to navigate through a great many features.I would think one would be provided as Amazon usually does everything very well.Now I get an Email and you want to sell me one, that's wrong.Hope it is corrected soon.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Sooooo much better than Roku!", "verified": true, "helpfulness": "1/1", "author": "Katherine Bright \"Maverick\""}, {"rating": 4.0, "review": "So far so good, easy to set up. Already sync with Amazon account. Haven't got internet at my place but managed to use my iphone as a hot spot and streamed a movie with no glitches!!!!", "verified": true, "helpfulness": "1/1", "author": "Chris Willetts"}, {"rating": 5.0, "review": "The more I use this component the more enjoyment I get from it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]