[{"rating": 5.0, "review": "Amazon created the perfect interface for people tired of cable. The Amazon Fire is the perfect solution for people with less than perfect internet connections. Amazon Prime is terrific. But the Netflix connection is wonderfully designed and dependable too. And there are games, news apps, and new choices all the time. Thanks Amazon.", "verified": true, "helpfulness": "1/1", "author": "Judy A"}, {"rating": 4.0, "review": "I only wish there were more current movies with the prime membership. Oh, and I think siri could take lessons from the amazon fire tv, LOL! This voice activation is GREAT!", "verified": true, "helpfulness": "1/2", "author": "Lesa Wingate"}, {"rating": 5.0, "review": "i have the roku but this is the one the fire good hd and make it easy to fine movies.", "verified": true, "helpfulness": "0/0", "author": "Milton Woodie \"milee\""}, {"rating": 5.0, "review": "still really not understand it our how to use it some programs you just cant get on no guide books and if you dont watch it you will pay for movies you have not order its confusing as hell i guess they think every ones in to computers and all ready knows how to do it in all the a round what i said its still great jusy got to learn whats going on and how to do it", "verified": true, "helpfulness": "0/1", "author": "wizard2"}, {"rating": 1.0, "review": "I was impressed with the idea, but was turned off by the push to the titles that I have to pay $2.99 for.I was hoping it would be able to be set to search only the sites that I subscribe to but I had to constantly sift through the pay titles and not get to the ones that I subscribe to.Very Frustrated...", "verified": true, "helpfulness": "4/9", "author": "andrew Weisbrod"}, {"rating": 4.0, "review": "I have mainly positive points regarding Fire TV with one huge exception. Where is my MLB.TV? This can't be hard, nor difficult to negotiate.For me, Fire TV is incomplete until a good number of main stream apps are added. Until then, the Fire TV is on \"BETA\"I also agree with other reviewers who brilliantly present the idea of bundling the game controller with the Fire TV. It would have been a \"killing\" marketing strategy.", "verified": true, "helpfulness": "0/2", "author": "Max Gonzalez"}, {"rating": 4.0, "review": "So far I like the Amazon Fire TV. I am still exploring it. I guess my only complaint would be that some of the apps have way too many commercials for only marginal content. But I'm pleased with the Amazon content, and many of the other less commercialized apps.", "verified": true, "helpfulness": "0/0", "author": "pmaziii"}, {"rating": 4.0, "review": "I am delighted with the speed of this unit. I have an older Roku and the Fire TV is much better. I hope that the voice search is expanded to cover other apps. As of today I well pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I have another streaming unit which does everything that I want it to do. I bought the Amazon Fire TV as I thought that it would do everything my other unit does. The USB connection is a question as to what it does. I would like to be able to stream my own videos through a thumb drive which this apparently does not do. I do like the dual band wifi. The video and audio output is really nice. The interface is hard to navigate through.", "verified": true, "helpfulness": "1/3", "author": "Ken"}, {"rating": 3.0, "review": "I think so highly of Amazon products that perhaps I did not do my homework. The # 1 gripe that I have is the number of apps that are available. #2 Not being able to turn it off. #3 The voice command only works with the Amazon app. The Amazon and Neflix apps are great, the others I can do without. Where is HBOGO, PBS, MLB, Disney. C'mom AMAzon, I'm waiting....", "verified": true, "helpfulness": "1/4", "author": "Mara M"}]