[{"rating": 2.0, "review": "Needs HDMI JACK ON TV", "verified": true, "helpfulness": "1/8", "author": "George Pitard"}, {"rating": 3.0, "review": "I thought it would be great to take when traveling; being it is so small and easy to pack.  I have tried to use it in hotels but you can not get past the hotel Internet sign-in like you can if you were using a computer. It will connect but you can not check the hotels agreement page.  So still using a computer small screen for my movies when traveling. Also the voice commad takes so many attampts to process my voice it is quicker not to use it. The voice command only helps to find movies on Amazon and doesn't work with other companies like Netflicks or Pandora.  If you get Blue-ray player on sale you get a player and a net system for movies for about the same price or cheaper.", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer \"be well\""}, {"rating": 4.0, "review": "Still working to understand it", "verified": true, "helpfulness": "0/0", "author": "Robert W Yeager"}, {"rating": 5.0, "review": "This is easy to use and easy to set up.  We used a generic Roku for years before buying this and we will never go back.  The voice activated search is great.", "verified": true, "helpfulness": "0/0", "author": "Lisa Newlin"}, {"rating": 5.0, "review": "Excellent, I wasn't happy at the beginning. I had to contact customer service and I got issues solved, since then I like it vey much, I'd highly recommend this device.", "verified": true, "helpfulness": "0/0", "author": "Erick Hernandez Paredes"}, {"rating": 5.0, "review": "Arrived in two days - thanks Amazon!  Easy to hook up.  When nothing appeared on the screen I called Customer Service and all I had to do was unplug it and plug it again and voila it worked.  It's so easy to navigate - both by voice command and by scrolling.  Lots and lots of choices of free movies and tv programs with Amazon Prime.  When it stays idle it goes into screen saver mode displaying gorgeous landscapes - enjoyed looking at the scenes while thanking a friend for recommending Amazon Fire TV.  Highly recommend it.  Picture quality is excellent as well.", "verified": true, "helpfulness": "0/0", "author": "Sunny Gal"}, {"rating": 5.0, "review": "Free Movies that are available for this item are great.  The streaming is very smooth, even with my slower DSL equipment.  You can get a lot of good movies for free with Amazon Prime and you can also add other services for a small monthly fee to get even more movies.  It plugged right into our TV and the screens that show what is available are easy to navagate and are set up to show a variety of Genres so to speak.", "verified": true, "helpfulness": "1/1", "author": "Colorado Kid"}, {"rating": 4.0, "review": "Fire TV is not perfect (thus the four star rating), but, its noticeably better than all the rest...  I've owned a WD LIVE, and I still own a Roku... and I've played around with a friends Apple TV.First and foremost, speed.  This unit dominates speed-wise.  I loved the look of the WD Live, however, it was painfully slow.  The Roku is a bit faster, but not anywhere near the speed of Fire TV.Next... content.  The reason why I originally preferred my WD Live box was because it was really the only unit on the market that easily connected to your PC so that you could stream home movies (MPGs/AVIs/Etc.)... and, quite frankly, to this day the WD LIVE is still the best at that.  However, with the addition of Plex to the app choices on Fire TV, I have now organized my movie catalog... it's not quite a easy as the WD LIVE box was, but Plex looks WAY better; yes, Plex is also available on Roku, but again, Fire TV is way faster... I notice a load time difference between my Roku and Fire TV when using Plex on both devices - and the Roku will occasionally skip a beat here and there when watching a full length movie.As far as all of the other available apps (Netflix, Hulu, etc.) You can obviously get those on all the other players, so the main difference is speed/load time... Fire TV wins.  Obviously, Fire's Amazon app is far and away better than any other player (it's their box after all)... the voice search is spot on and incredibly easy to use when you want content from Amazon Prime... But, as many other people have noted, why can't you use the voice search in the other apps? That kind of sucks.Next, the interface.  I actually put the Fire TV last in this category.  It's not visually appealing to me, and, in some cases, a little clunky when you want to go through your different apps.  It's kind of cold... grey...black... dull.  You'll find everything you need, don't get me wrong... I'd just prefer a little more eye candy as I'm browsing around... more options to customize the layout. Etc.The last thing to mention is the remote control... Functionally, I'd put it in a tie for first with the Roku, they're about equal in terms of ease of use, and ease of remember the buttons (so you don't even have to look at the remote when you're using it).  Visually, the Fire wins... it's small, but not to small, it's slick and smooth, and looks really nice.The initial set up was insanely easy... there's a cute little cartoon video that walks you through the process as the box configures itself.If I had it all to do again, after owning all of the major media boxes, I'd buy the Fire TV.  It could be better, but right now it's easily the best.", "verified": true, "helpfulness": "0/0", "author": "Ronald E. Mahler"}, {"rating": 1.0, "review": "have to send it back, made calls for help, had drop call- call back got super. 1hr/30min. on phone total. working on this black box from h...+ 2 days back was 1hr on phone with my DVD palyer sony it did not work", "verified": true, "helpfulness": "1/14", "author": "Thomas D. Hill \"TDH\""}, {"rating": 5.0, "review": "Let me start by saying I'm a huge Apple fan, but I know even a company like them has their limitations. Amazon Fire TV has proven to be a far better product than Apple TV.The OS is a much better layout and more responsive. Apple I think just doesn't spend enough time improving on and designing their TV product. Bluetooth is a very nice option as well and I like the remote even though it's not metal and a little cheaper feel, but still a good remote. Plus I really like the voice search option, it works and saves time from searching through everything. Apple's remote just feels too slim and small in my hand.Gaming, well I'm a gamer so I love this! The only drawback is that Fire TV is limited on space and can't hold a lot of apps and games take up space, BUT there is a USB port on back of unit. Maybe in future updates there will be the option to add more space via the USB??? :)I already had the Prime account witch I enjoy for it's shipping options and Prime TV. Netflix is the past and just can't keep up with Prime TV's ever growing selection. Even though Amazon has raised their price for Prime it's still a better option over Netflix because I pay about the same price and I still get more.So overall I have every option Apple TV has and more. My biggest issue was load times, Apple TV is very slow to load a program especially Netflix, that I think is also in part of Netflix being a slow service as well. Prime TV will never be an option on Apple TV and you can only Airplay it from your iPhone or iPad, it degrades the quality and load times. Airplay needs work...big time!  Load times are almost nonexistent when you are playing a show on Prime through Fire TV, but Netflix however is still slow yet faster than Apple TV.I am still loyal to Apple for other reasons such as the iPhone and iPad which I believe are the best on the market. Apple is no fool, they know their market and will continue to crush the rest with their iOS and solid designs. Though I am curious to see how the new Amazon Fire Phone will fair in this market. It looks like it has potential. Even with Android based OS I think making the android their own for Fire TV/Phone will help them in the long run.Hope this helps and good luck with your decision.", "verified": true, "helpfulness": "0/0", "author": "msnfire79"}]