[{"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "GD"}, {"rating": 5.0, "review": "For the most part, the Amazon Fire delivers a perfect experience.  Only issue is actually with the SlingTV App and it freezing and not playing, but I will work with support through them.  Amazon Fire is the perfect cable alternative.", "verified": true, "helpfulness": "0/0", "author": "jrp0529 \"JRP\""}, {"rating": 4.0, "review": "Only 3 days in. So far so good!", "verified": true, "helpfulness": "0/0", "author": "Tracy Sanders"}, {"rating": 3.0, "review": "Very good compared to apple TV but now I need a larger TV because the print is to small", "verified": true, "helpfulness": "0/0", "author": "Donald Gravett"}, {"rating": 4.0, "review": "Works great for viewing videos online but I cannot connect to shared media on my network", "verified": true, "helpfulness": "0/0", "author": "mikel strickland"}, {"rating": 5.0, "review": "I love this product. I got rid of cable and saved me a lot of money", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 1.0, "review": "Item arrived and did not work! Very disappointed to receive a refurbished box \"certified to work like new\" and have it not work. My fire tv booted up but would get stuck/freeze on the home setup screen!Very disappointed with the lack of quality assurance on this product.", "verified": true, "helpfulness": "2/3", "author": "Jo Manda"}, {"rating": 5.0, "review": "So much faster than the Raspberry Pi it replaces!", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Works great.Pros:Voice CommandSleek and smallPrefer it over the Fire StickEasy to set upCons:Remote stopped working one time and because there are no buttons on the box it became essentially useless (I don't have the Smartphone apps.)", "verified": true, "helpfulness": "0/0", "author": "C. D. Koehler \"Koke\""}, {"rating": 5.0, "review": "So far so good.  Won't post much else here yet it's too early.  Out of the box it's working great and I like the functionality.  It is the main component in my cord cutting.  Amazon Fire TV plus Amazon Prime plus Sling TV has cut my monthly bill for TV entertainment nearly in half.  We went from $103 on our final cable bill to our monthly average will be $60ish (waiting for first cable bill with internet only).", "verified": true, "helpfulness": "0/0", "author": "Mike"}]