[{"rating": 5.0, "review": "Exceeded my expectations! The voice search is awesome..looking forward to more diverse content in Prime..", "verified": true, "helpfulness": "0/0", "author": "Rich"}, {"rating": 5.0, "review": "Perfect size perfect price", "verified": true, "helpfulness": "0/0", "author": "Carrie Smith"}, {"rating": 5.0, "review": "It works great I enjoy watching movies and playing games", "verified": true, "helpfulness": "0/0", "author": "manuel ruiz"}, {"rating": 5.0, "review": "Awesome, works great.", "verified": true, "helpfulness": "0/0", "author": "TechDealShopper"}, {"rating": 5.0, "review": "It is cookbook great", "verified": true, "helpfulness": "0/0", "author": "D. Gonzales"}, {"rating": 5.0, "review": "I am no sort of electronics geek.  I do not understand all the special language the younger folks use regarding this stuff.  That said I must give my highest recommendation to the Amazon Fire TV  and the support people associated with the machine.  This device installs simply and quick.  I did have an issue the second time I wanted to use it.  When I called support, they took me through the troubleshooting process (no more than 10 mins.). When they determined that there was something wrong that could not be fixed over the phone they sent me a new one over night.  I received the new one the next day and all has been well since. (about 2 months)  There is much to see and do with this device some free some not.  I recommend this for any one, old,young and all in between.", "verified": true, "helpfulness": "0/0", "author": "GF Raymond"}, {"rating": 5.0, "review": "I could not be happier!", "verified": true, "helpfulness": "0/0", "author": "Heather Carter"}, {"rating": 3.0, "review": "The Amazon fire TV is awesome for video. It's great having HBO GO, Netflix, and Amazon Prime all in one place without the need of searching two different devices for content. The biggest downfall of the Amazon fire TV is the music player. It currently is not self-sufficient whereas you must log into your mobile phone or computer to set up Amazon Prime playlists in order to play music from the music player. Secondly the Spotify app is not self-sufficient either, and requires a mobile device of some sort in order to play. Furthermore, I've tried multiple times on my network and can still not get this to work properly. In summary, I would totally recommend the Amazon fire TV to someone who is purely using this for video content, however, I would highly suggest someone that is very into music to take a second look before making a purchase.", "verified": true, "helpfulness": "0/0", "author": "J. Humphries \"Coolbreeze\""}, {"rating": 5.0, "review": "I like this fire tv a lot recommend highy", "verified": true, "helpfulness": "0/0", "author": "Big\"D\""}, {"rating": 5.0, "review": "Easy to install, works great", "verified": true, "helpfulness": "0/0", "author": "DANIEL F SCHULTZ"}]