[{"rating": 5.0, "review": "Great product. Especially like music", "verified": true, "helpfulness": "0/1", "author": "Scott L Provinzano"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/1", "author": "Luis Porto"}, {"rating": 5.0, "review": "It works great.  Once I figured out how to hook it up with all the other equipment I have, following the on screen instructions had it up and going in no time.", "verified": true, "helpfulness": "0/1", "author": "krisko559"}, {"rating": 4.0, "review": "Makes everything nice and neat all in one place and easy to navigate. Would like for more titles, shows and movies to be accessible.The selection at present are great, but some shows or movies are only accessible through another venue(hulu) I would rather have one service for all my needs. Otherwise Amazons Fire TV is one super package.", "verified": true, "helpfulness": "0/1", "author": "Joseph K"}, {"rating": 5.0, "review": "Would like Hill Street Blus free to Prime members!", "verified": true, "helpfulness": "0/1", "author": "DandiDog"}, {"rating": 5.0, "review": "Excellent voice search", "verified": true, "helpfulness": "0/1", "author": "Steve"}, {"rating": 3.0, "review": "The voice search gives results from Amazon library only, where most of the titles are paid, not Prime. With one click to buy implemented, it's easy to make a mistake. Setting PIN to use it before watching every single thing is inconvenient.So when I watch something on Netflix and give a search command, it gives me a result that I think is on Netflix, but it's not.Asking for \"Prime\" gives results with \"prime\" in the title.Another thing is that the box gets so hot, I had to put it on the piece of metal to help dissipate the heat.Other than that, the box works great, my wi-fi router shows 300 Mbps rate for it in 11n mode.", "verified": true, "helpfulness": "0/1", "author": "Surenot"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "Ceyda"}, {"rating": 1.0, "review": "when it worked it was great,but the problem I had was while streaming a movie it would freeze up and quit,would have to unplug it and reboot it then later it would do it again.Took the first one back and exchanged it then wound up returning the second one for the same reason.I'm going back to a marticom android box.", "verified": true, "helpfulness": "1/2", "author": "Ken A."}, {"rating": 5.0, "review": "I love my Amazon Fire TV. Good price, easy to set up, and simple to use. I love the voice search that actually works! It even found \"Backstrom\".", "verified": true, "helpfulness": "0/2", "author": "Darrel Hess"}]