[{"rating": 1.0, "review": "Was going to try one of these BUT.. almost 2000 1 Stars?  No thanks..", "verified": false, "helpfulness": "0/8", "author": "John T. Desantis"}, {"rating": 5.0, "review": "Love it. Still trying to figure it all out!!!", "verified": true, "helpfulness": "0/0", "author": "Jessica Gossage"}, {"rating": 1.0, "review": "It did the same thing any gaming system already does, provide apps. Waste of money", "verified": true, "helpfulness": "1/6", "author": "william monarrez"}, {"rating": 4.0, "review": "I loved the advanced features of the Amazon Fire TV like voice search. However, I was disappointed that it didn't offer HBO Now like the Apple TV. It only offers HBO Go. Apparently, they are two different things. Now I need to cancel my membership to HBO Now, since it only works on Apple devices or keep my Apple TV as well as my Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Maria B"}, {"rating": 5.0, "review": "NEVER GOING BACK TO CABLE AGAIN!! THIS IS THE GREATEST! the games and video quality is top notch for sure!", "verified": true, "helpfulness": "0/0", "author": "Joshua Bernstein"}, {"rating": 4.0, "review": "This is awesome!!", "verified": true, "helpfulness": "0/0", "author": "Herson"}, {"rating": 4.0, "review": "Its great to have and with sling TV I get what I want to watch without paying for all the extra I dont need.  My only con for the device is that after a bit of time it goes to sleep and I have to wake it up, maybe a patch is needed to alter the time the device goes to sleep.", "verified": true, "helpfulness": "0/0", "author": "David Wilson"}, {"rating": 4.0, "review": "Love all of it, the options are endless and it is so easy - even for someone who may not understand all the electronic gadgetry they once might have! I would recommend this for everyone at any age!", "verified": false, "helpfulness": "0/0", "author": "kalexrene"}, {"rating": 5.0, "review": "I have been a prime member for over twelve years.  For the first time EVER I am compelled to write a short and sweet review of the Amazon Fire TV.  In short, I LOVE IT!  BEST \"TOY\" EVER. The amount of joy this little box is giving to me by enabling me to use my big screen TV to view all of the content available through Amazon Prime for Free is incredible.  The best $99 I have spent in I don't remember when.  My sister who does not understand technology is actually considering buying a Kindle Fire and the Amazon Fire TV box so that she, too, can get all the TV joy imaginable.  There are not enough days in the month, the years and time I have left on this planet to view everything I want to see.  I am saddened to think of and to say this but it's true.  LOVE LOVE LOVE THIS as much as my Kindle Fire because of its capability to project my kindle content and  such an immense quantity of free content onto my big screen T.V.  I am one happy customer", "verified": true, "helpfulness": "1/1", "author": "amazonfan"}, {"rating": 5.0, "review": "I have had this for about a week, HDMI cables not included, and I like it. I use it for SlingTV and it works well, I have used the speech recognition portion and it works well. I do have to buffer from time to time but overall, I am pleased with my purchase. I would recommend it over my ROKU streaming stick any day.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]