[{"rating": 5.0, "review": "Nice product, lots of movies and aplications. With firetv i'm not renting movies any more", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Richard C. Smith"}, {"rating": 3.0, "review": "Returned it as I didn't need it after all.", "verified": true, "helpfulness": "0/1", "author": "Lindsey Goff"}, {"rating": 4.0, "review": "I've owned a lot of boxes.  The  first two Google TV boxes, Rokus, Chromecast, and now Amazon Fire.  I own three of them now.  I rate it 4 stars only because they force you to use their launcher.  I'd much prefer my choice of setup and to see side loaded applications in the menu.  Aside form that the box is top notch.  Excellent hardware, works well with all the big channels, Netflix, Hulu, and Plex.  Plus the baked in Amazon Prime video works well.  If you use Amazon Prime this is probably the best option out there.", "verified": true, "helpfulness": "1/1", "author": "M. Adams"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "papichino"}, {"rating": 5.0, "review": "Gives access to TV services for a very low price.", "verified": true, "helpfulness": "0/0", "author": "tgreaner"}, {"rating": 5.0, "review": "So much in a little box!", "verified": true, "helpfulness": "0/0", "author": "Jarred"}, {"rating": 5.0, "review": "Setup was quick and easy. Picture was clear and signal strong. Well worth the purchase.", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 3.0, "review": "Sometimes, the Amazon Fire TV (REMOTE) can not understand what is being asked. I'm not sure if I received a defective one \"or\" if the REMOTE is a bit off with determining the voice automation, etc.Well, I'll keep it. I'm sure it will get better as I continue to request shows along the way! :-D*P.S. The shows DO NOT show up immediately...you will still have to PRESS the BUTTON on the REMOTE CONTROL to ENTER your movie or game selection.  It will be highlighted in YELLOW. This is \"after\" you make your REQUEST.I believe the REASON for this is that it allows you to select how you want the movie or games to be played \"AND\" paid for (you get many choices-Hulu, NetFlex, Amazon Prime, etc.) YOU can RENT or PURCHASE...it's up to you!Amazon Prime Members get a selection of movies, etc. for FREE. Why? Because the PRIME MEMBER is already PAYING for a SUBSCRIPTION (Over $100 a year)...whether, you \"utilize\" the service or not!*If you already have a Hulu or Netflex account...you pretty much are \"coved\" for all your entertainment.  You'll need to ENTER your ACCOUNT INFORMATION to link it to Amazon Fire TV.  The set up is super easy!Unfortunately, I have a VUDU account...it's FREE, but every time I want to see a movie I have to RENT \"or\" PURCHASE it! :-OI selected VUDU to go along with my Amazon Prime...since the VUDU account is FREE, however, I recently learned that a lotthe Amazon Prime is pre-selected and very limited (I.e. the movies, television, music ).  I still have to use places like REDBOX & VUDU in order to see the most \"current\" movies! AwwwBut, if you like old movies, classics, etc. AMAZON PRIME is the best entertainment source for such!", "verified": true, "helpfulness": "1/1", "author": "AlwaysUseWisdom"}, {"rating": 1.0, "review": "It's fast, but that's about it. I have to reboot it about once a day because the audio quality degrades. Sounds like it drops to a low bit rate, and sounds really 'tinny'. The game controllers won't stay paired. The voice search is a gimmick and only works with amazon content. The interface is terrible for browsing my music library. I have to manually refresh my library when I buy new music. I should have waited for the nexus player.", "verified": true, "helpfulness": "1/2", "author": "A. Tusko"}]