[{"rating": 5.0, "review": "This the best media player I've ever seen.  It's easy to use & has a lot of content. It was simple to set up. If you don't have one, get one.", "verified": true, "helpfulness": "1/2", "author": "Harry Gray"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "1/2", "author": "Vannylim"}, {"rating": 1.0, "review": "I don't have the right t TV I need a now TV😩", "verified": true, "helpfulness": "2/25", "author": "anna sabath"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Glen"}, {"rating": 5.0, "review": "This produce works exactly as advertised and makes online streaming easy and enjoyable. Works right out of the box on my Vizio!!!! I tried the google product a while back and it did not work on my Vizio.  i recommend Amazon Fire TV without reservation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely love it.  And it is so portable!", "verified": true, "helpfulness": "0/0", "author": "Lit15"}, {"rating": 4.0, "review": "I would have given it 5 stars but without the ability to simply put a USB drive in to play a file it fails a very simple task. I and my wife enjoy the ease of use.Although great at some things like voice commands it shoots itself in the foot by only making voice control work the Amazon apps/Movies. For Prime Members like myself it is worthwhile but I will still have my Chromecast attached to my TV as the two complement each other well.", "verified": true, "helpfulness": "0/0", "author": "CaptSabre"}, {"rating": 1.0, "review": "I can't get it hooked up to the TV. I haven't contacted your Tech department", "verified": true, "helpfulness": "2/32", "author": "Daniel Ward"}, {"rating": 5.0, "review": "I've only had it a week but my first impression is very positive.  It provides easy access to my Prime instant video watch list which is the main reason I purchased it.  Some movies are cheaper than my Comcast OnDemand.  The remote is easy to use, very comfortable, and much better than my Apple TV remote.  I have mine hooked up to a cat7 cable so it's a pretty high speed connection and as expected the picture definition is really good and comparable to my cable signal.  The only annoying features so far are: the long video that you have to watch upon set up and there's no sleep button so I feel like I'm wasting energy.  If you didn't have cable this would be a must have!  We plan on taking it with us on vacation.", "verified": true, "helpfulness": "0/0", "author": "N. R. \"amazon shopper\""}, {"rating": 3.0, "review": "It is a good streaming device , but hangs too much", "verified": true, "helpfulness": "2/6", "author": "RSG"}]