[{"rating": 5.0, "review": "Great to watch older shows and movies", "verified": true, "helpfulness": "0/0", "author": "Victor L. Maduro"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Robert Baker"}, {"rating": 5.0, "review": "Amazon Fire TV is a wonderful invention between Prime and Netflex we don't need cable.", "verified": true, "helpfulness": "0/0", "author": "Terri Joy Holmes"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "mamahen"}, {"rating": 2.0, "review": "As others have stated this device has the potential to be a game changer as we move away from cable to I.P. tv but the software sideof this device is poor at best.  The apps are limited and of poor qulity.  See my review on the Show Anytime app.  Amazon needs to put quality first and this is in testing all apps and services first. Think Apple here folks.  I would pass on this device until Amazon focuses on the apps and streaming services for this device.  Get a top line Roku instead.", "verified": true, "helpfulness": "0/1", "author": "An  M.K. Fan"}, {"rating": 4.0, "review": "Really  like my amazon fire received it as a christmas gift. Easy to use", "verified": true, "helpfulness": "0/0", "author": "Donna Vilogi"}, {"rating": 5.0, "review": "So great I love it", "verified": true, "helpfulness": "0/0", "author": "katie"}, {"rating": 5.0, "review": "😄", "verified": true, "helpfulness": "0/0", "author": "jaycie carlson"}, {"rating": 4.0, "review": "Performs well.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 5.0, "review": "I am very pleased with the Amazon Fire TV.  It is everthing it is advertised to be.  It was really easy to install & there is an excellent selection of movies & TV with Amazon Prime.  I love the voice search, I really had doubts that it would work as well it was advertised, but it is very easy & efficient.  I have not tried any of the other services since I am so happy with the selections offered by Prime.  I may in the future but it will take me a long tiime to work my way through my watchlist with what I have currently chosen to watch.", "verified": true, "helpfulness": "1/1", "author": "J. K. Metzger"}]