[{"rating": 4.0, "review": "Missing VuDu otherwise great!", "verified": true, "helpfulness": "0/0", "author": "Debbe Noonan"}, {"rating": 5.0, "review": "I had a Fire Stick before I bought the Amazon Fire TV. The Fire Stick if a great product, but the Amazon Fire TV is an exceptional product. The streaming is flawless without any distortions. I like the voice command to find movies it works every time. I would highly recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Works exactly as advertised. Smooth and stable and accesses everything I need it to.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"davidzysk\""}, {"rating": 4.0, "review": "We absolutely love it, it's easyto use, fast and looks great. We get a lot of compliments on it from friends and family. We're still in the process of downloading all of the apps we won't for it but so far for Netflix it has been great. I only gave it four stars because we got the fire TV to replace our cable as cable is expensive and this was a cheaper route to go. The only problem is some of the apps still need a cable provider to function which is a bummer. Perhaps these apps will create a month to month version as well one day. Still very happy about to purchase though.", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 4.0, "review": "Four stars because I am unable to use HBOGO due to restrictions by my internet carrier, Charter communications. Do something about this Amazon!A really great product. New features being added all the time. I haven't figured out how to use it on other TVs without unplugging it and moving it.Everything worked well out of the box.", "verified": true, "helpfulness": "0/0", "author": "Carlos Malagueña"}, {"rating": 5.0, "review": "Another great product from Amazon. Really good value for the money. Easily beats Apple TV, Roku and all the rest. It helps me get the most of my Prime Membership. Thank you Amazon staff for putting so much effort into this wonderful product.", "verified": true, "helpfulness": "0/0", "author": "Eddix"}, {"rating": 5.0, "review": "It's really easy to set up and doesn't take up much space. Pretty great at streaming so far haven't actually tried any games on it yet. I've been using it almost daily and I like being able to start a YouTube video on my phone and finish it up on the Fire TV", "verified": true, "helpfulness": "0/0", "author": "John Shepard \"Shepard\""}, {"rating": 5.0, "review": "Easy to use & lots of options", "verified": true, "helpfulness": "0/0", "author": "Robert Bekesz"}, {"rating": 4.0, "review": "My husband and I do not use the other other apps except for Netflix and maybe Hulu. I do have Amazon prime and I thought getting this box would simplify looking for things to watch. We have had no issues with the box. The remote seems to stick on the down button and I have yet to call in for that. I really don't agree with having to call in for replacement parts. I can email all the info just as easy as saying them.", "verified": true, "helpfulness": "0/0", "author": "Kelsey \"-Kelsey Plugge, Awesome Inc\""}, {"rating": 5.0, "review": "Great product and very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Tanisha D."}]