[{"rating": 5.0, "review": "Great! Tons of shows and great variety.", "verified": true, "helpfulness": "0/0", "author": "egnat"}, {"rating": 5.0, "review": "Great device for the TV. Of course there could be some improvements to it but I would definitely buy it again. One of the main reasons I bought it was the ability for an app like VLC to play movies from USB stick and I can verify that it works. Just make sure you format correctly and keep files below 4gb.", "verified": true, "helpfulness": "0/0", "author": "NW"}, {"rating": 5.0, "review": "Loved it so much I bought another one!!! I even saved $50 a month on my Directv bill every month. I haven't \"cut the cord\" yet but if all goes as well as it has been I will in probably the next 6 months. I am waiting to install my HD Antenna from Amazon on one of the TV's first. Set up and installation is an absolute breeze. It's very small in size - much smaller than my Directv receiver - and doesn't look obtrusive. You can even mount it on the back of your TV if you wanted. Highly recommend this to anyone - and have!", "verified": true, "helpfulness": "1/1", "author": "Mom2Lilli"}, {"rating": 3.0, "review": "Disappointed that there were so many titles that were not free with Prime.", "verified": true, "helpfulness": "1/2", "author": "Alan Sussman"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Mario L."}, {"rating": 4.0, "review": "We love this product...definitely recommend this if you ate looking for ways to cut the cord.", "verified": true, "helpfulness": "0/0", "author": "eduardo lara"}, {"rating": 5.0, "review": "love it, but not too much time to watch it,", "verified": true, "helpfulness": "0/0", "author": "Beverly M. Schultz"}, {"rating": 5.0, "review": "Easy to install and use. Love the voice activated search feature.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Wellborn"}, {"rating": 4.0, "review": "The only problem we've had is with the remote.  It has a very sensitive touch when we try to enter search requests.  We haven't contacted Amazon about this problem yet.", "verified": true, "helpfulness": "0/0", "author": "Larry D. Wilson"}, {"rating": 5.0, "review": "I already have one and needed another for another room.  Love the Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Patty"}]