[{"rating": 5.0, "review": "This was about the easiest device to hook up and use of any I have tried.  The choices you get are terrific and love the voice search,I actually found Rocky Lane old western movies easily.  I use mine wired and speed is great.  Who put the wonderful landscapes as screen savers?  Simply beautiful.", "verified": true, "helpfulness": "0/0", "author": "Rosemary"}, {"rating": 4.0, "review": "I'm very happy with the performance of this product so far...", "verified": true, "helpfulness": "0/0", "author": "p l white"}, {"rating": 5.0, "review": "I am writing a five star review in advance of receiving the product. I have 3/4 TVs that are smart; chromecast (which hahas it's uses); on demand from Directv; a Sony ps3  that streams; 2 Sony bluray players that also stream but nothing compares to the speed of my 2 Roku 3s.  So now that Amazon has the same content like HBO2GO available, I purchased one on sale for $79 and used a $50 gift care also. So I took the plunge for $29.So with the speed and Performance of the Roku 3 with its much inferior hardware, I cannot what to hook up my new Amazon Fire TV to one of the super high speed HDMI ports on my new Vizio 50 inch Super HD television.  The Vizio TV actually increases the definition of almost all programs and the Ultra HD content that is streamed via Netflix is absolutely  phenomenal.I went from being amazed at seeing the different blades of grass on the football field to being able to tell who needs a facial to close large pores and individual whiskers so we will see if the Fire burns up the Super HD.I cannot see why anyone would complain about the number of prime movies and TV, what do you expect for $100 @ year, free two day shipping, a free paid android app a day, early access to lightning deals, music, even books for $8.50 @ month. Just the free shipping and the lowest price in the country on the Vizio TV and the very heavy combo loft bed and desk paid for itself.  Plus you add in subscribe and save at 15% off, Amazon is a Godsend for me on a fixed budget and son in college.I do have to admit I am addicted to series that are off course only available on HBO, Encore, Stars and Showtime.  I did have a lower channel package with 3 pay channels but when I looked at the top package it includes every channel and every pay service for $5 cheaper and I bunfl my ATT Uverse and save even more. But other than the occasional movie or Smithsonian and AHC, I find myself searching and streaming so maybe it is time to think about telling them I am considering removing satellite and see what they will give to get me to stay and if not, Prime and Amazon keep me happy.If you want all free watch Crackle or Hulu.  I also love the fact that if there is a movie I would like to own If I cannot find it on Amazon; it is usually for sale on vudu and I carry my video library with me everywhere with my login information and do not have to worry about scratched or even storing Blu rays.  Only draw back is if I get rid of Internet access then I lose access.This is the first time I have given a five star review before I receive an item AND IF IT DOES OR DOES NOT LIBERATED UP TO MY EXPECTATIONS I WILL PROMPTLY EDIT MY REVIEW AND POINT OUT MY DISSAPPOINTMENTS.I only have one so far, the Roku 3 remote works as your game controller and with fire you have to spend another $30. I do not play my ps3 to even conside the purchase.  I was even pleasantly surprised my unit will arrive on the 2nd versus the 22nd. So let's see what quad-core speed and more memory will do to amp thing up.", "verified": true, "helpfulness": "1/1", "author": "Robert Blais"}, {"rating": 2.0, "review": "This is my first time with Amazon Fire. Hooking it up was easy. My only problem is connecting to Netflik. I am already subscribed to it but I cannot connect to it without using Amazon Prime. Right now I have 30 days free and watching my Netflik thru their Prime.I want to know how to bypass the Amazon Prime and watch Netflik. There would be more stars on this review if my problem could be resolved.", "verified": true, "helpfulness": "1/2", "author": "J. Frey \"Johnnybama\""}, {"rating": 1.0, "review": "have to pay for shows even though pay for prime", "verified": true, "helpfulness": "2/10", "author": "sharon smith"}, {"rating": 3.0, "review": "is the fire tv compatible with a 2009 non hdtv samsung 42 in plasma tv? i need to know before i decide to buy one.", "verified": false, "helpfulness": "0/3", "author": "devern pinnock"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "2/3", "author": "MELONY G."}, {"rating": 3.0, "review": "There are a lot of movies and shows you need to rent or buy in addition to the prime membership.  I am not sure if there is enough free content to make me cut my cable.  I wish there was.", "verified": true, "helpfulness": "0/2", "author": "Doug Barnes"}, {"rating": 4.0, "review": "So the experience with the fire TV so far has been great.  We use the amazon prime video on a regular basis and it has been great to use.  I read some other reviews that stated that it was difficult to separate the prime video from that available for pur base, but so far we haven't had any difficulty.  There is a section to browse the prime video only, so the only place it really affects you is while doing a search for something specific and at that point it is pretty easy to decide whether it is worth paying for or not.  The apps have been great, though I was hoping to see more that was compatible with the fire TV.  The most useful apps for us have been YouTube and the Plex app, which have worked flawlessly. It is also great to be able to \"fling\" video from phone to the TV screen with the YouTube app.  I miss google play music and a few smaller apps, which state they are not compatible with the fire.  Hopefully they will become available soon.  Can of comment on the controller because we do not use it, but have used some gaming apps with remote and the game processing handles decently for a media device and I have been impressed by video and processing quality. The only complaint I have besides the few unavailable apps is the navigation.  All the amazon related content is front and center and organized well, but any other apps, which is one of the main reasons for purchasing, is all clumped in a single menu item, which makes it somewhat hard to navigate to. Wish it had a little better menu structure or at least made it customizable.  Other then that it has been great and I would recommend it to anyone.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "perfection in a box... seriously LOVE IT!!", "verified": true, "helpfulness": "1/1", "author": "Chad & Melynda"}]