[{"rating": 5.0, "review": "Very happy with purchase.  Downloads from Amazon and Netflix, et.al, much faster than BluRay players.  Very few, if any, pauses during playback.  Closed caption was a welcomed feature for our family.  Navigation thru apps, selection and downloading them very easy.  After watching an episode in a TV series, the next episode is already loaded and begans to play.  Have purchased a second Amazon Fire TV for use with a bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "LGBGH"}, {"rating": 5.0, "review": "I've only been using the Amazon Fire TV for about two weeks now.  It has been everything that I thought it would be.  I understand now why there wasn't an instruction booklet in the box.  All you have to do is complete a \"30 second hookup\" and speak into remote and it will appear.  I cut the cable cord about 10 years ago and started reading more and shopping the $5 barrel at Walmart for dvds.  I then went out and got a converter box and watched the shows that were offered without complaint because I worked many hours and really wasn't home.  So, when I saw what all was offered with the Fire TV, I thought it would be worth a try.  I got the bundle deal (always looking for a bargain!) and hooked up with.  IT WAS ON THEN!!!!!!  I have enjoyed these two weeks between working and watching into the night hours.  Christmas Day, I stayed home playing with my new toy.  I have no need for the HBO, Showtime, Hulu Plus apps at this time because there is so much being offered for free.  AGAIN, I love a bargain!  And Amazon Fire TV provides all the entertainment I can handle at this time. I'm thinking maybe 8 to 12 months from now, I may add Netflex just to provide more options.", "verified": true, "helpfulness": "1/1", "author": "Freddie \"Freddie\""}, {"rating": 5.0, "review": "Very nice application and plenty of movies, tv, etc. If a user needs access to these it is one of the best. Also nice menu and ease of use. I am very happy with this product.", "verified": true, "helpfulness": "1/1", "author": "W. Garrett \"Why are there so many poisons in the products sold for human usage? Maybe you should do some research into the products you consume daily.\""}, {"rating": 5.0, "review": "I may only be 35, but I'm clueless when it comes to technology. I have been able to use my Fire TV straight out of the box! Everything is self-explanatory. Furthermore, my ten and thirteen year olds love the games. Get the controllers, they are worth it. I never had Netflix before but I was able to set it up in a snap. I'm going to get an HD antenna (never knew there was such a thing until last week!) and give that money grubbing leech named Comcast the boot. Please keep adding content, Amazon. I don't know that it is worth it to have the fire TV without Prime as it unlocks a significant amount of content.", "verified": true, "helpfulness": "0/0", "author": "krispietreat"}, {"rating": 4.0, "review": "This was a great purchase. I bought it as a Christmas gift. Recipients  raved about how they have enjoyed using it. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "verna soga"}, {"rating": 1.0, "review": "Remote runs out of batteries ever couple days!", "verified": true, "helpfulness": "0/2", "author": "Carla M McIntyre"}, {"rating": 5.0, "review": "Just had it a few days now, but the features are great. Works well and apps are easy to find and install. Only issue is the voice search brings up a lot of videos that cost extra, even with a Prime membership. Have to figure out the kids control yet to keep grandkids from buying movies.", "verified": true, "helpfulness": "0/0", "author": "Timothy Banish \"Tim 0413\""}, {"rating": 5.0, "review": "This is geared more towards \"niche\" review as opposed to a general review. For general review I give Amazon Fire TV (AFTV) 5 stars because this works as promised: easy to install, fast streaming, voice search (only wish that it could voice-search other video databases like Netflix, for example, rather than just Amazon, but I can imagine the resistance from competitors), portability from room to room (the unit is small enough, dongles and all), offers Wi-Fi and WIRED options, and it totally replaces [BlueRay] DVD-streamer (not Player, of course) boxes.Before I made the purchase, I did a Google search for \"Amazon Fire TV + Bose Lifestyle + Harmony Remote\" because that's my setup (niche) and found nothing.  I took a chance anyway and got the unit hoping that there could be a way to marry them, even if I had to use 2 remotes instead of one. Realistically, there is no replacing super-Remote that could do voice-search; and in any case, Fire TV Remote is not IR which might have allowed its control with a super-Remote functioning on IR basis.Result: It worked!First, I connected AFTV to the Bose Lifestyle system, right out of the box. To do this, under \"add a device\", I picked the nearest option allowed: ROKU; Bose recognized and read out the unit correctly (AFTV). When it asked for input, I pressed the Home Button on AFTV Remote, and the AFTV configuration / installation proceeded without a hitch to completion. To use AFTV, just change the SOURCE on the Bose to \"ROKU\"; use the AFTV Remote for AFTV-specific functions, and voila!Next, I had to control everything with [Logitech] Harmony Remote. This was not difficult because that's how my original system is set up. Using Harmony Remote, I choose Bose as my Device, then drill down in Bose to \"SOURCE\", pick Roku, and switch to the AFTV Remote where I press the Home button. I can now use the AFTV Remote to control AFTV functions correctly and successfully. Volume and other control remain with Harmony. When done with AFTV, I use Harmony (last set to / still set on Bose device / SOURCE) to change the SOURCE back to DVR (the cable box) in Bose and the system is back to cable / TV; or whatever else you desire.The setup works for me even if it is tedious; I'm not looking to have everything. My suggestion to Amazon is to include AFTV on the options list on Bose; (Roku, as noted above, is there; as is Apple TV, BTW) and to work out a deal with other video-streamers to extend voice-search function therein. How? Lease or sell the technology to them or work out some win-win solution: the customer is already captive! (Although I can predict that each vendor will silo-in their own non-platform-crossing voice-search competing solution before we can have a truly universal platform-independent voice-search-from-remote functionality. Pity!)My final score for Amazon Fire TV is unequivocally 5 stars. If you are using Bose-centered home theater system (Lifestyle is what I worked with), this should work. If you use Harmony Remote as the master-control Remote in this configuration, this should work as long as you are willing to live with the fact that the AFTV Remote is irreplaceable in either configuration, or any other set-up, for that matter.Lastly, remember that AFTV is marketed as a standalone device to be connected directly to your TV. So, while Amazon may be interested on a different level in how AFTV can be integrated into a pre-existing, real-life media-world set-up out there, do not expect \"technical support\" should you have problems trying to accomplish this type of niche configuration--neither from Amazon nor Bose nor Logitech-Harmony nor Roku. You will be on your own. That said, it worked for me and I hope it works for you, too. The Force is with you!", "verified": true, "helpfulness": "0/0", "author": "OHYN"}, {"rating": 5.0, "review": "It had become such a hassle to spell out the title of a movie I wanted to watch, only to find out that it wasn't available or it cost more than I was willing to spend, so I had to move the light up and down, back and forth to spell out another movie.  It had gotten so that I almost stopped watching those movies. Now I just speak the name of a movie or the category of the movie into the little remote, and it appears. If I don't like what I see, I just ask for a new movie.  What a great toy. Thanks, Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Jean Strandlund"}, {"rating": 5.0, "review": "AWESOME", "verified": true, "helpfulness": "0/1", "author": "Nick Stelpflug"}]