[{"rating": 5.0, "review": "Worked as advertised. Easy to set up.I love it!!", "verified": true, "helpfulness": "0/0", "author": "Mike Birtchman"}, {"rating": 4.0, "review": "So For best streaming device, remote voice control work very good, I loved it.", "verified": true, "helpfulness": "0/0", "author": "margaret alleluia"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "alex Kalenian"}, {"rating": 5.0, "review": "Awesome product.  Displaced an Xbox that we only used for non gaming functions.  Very simple to install and use, and LOVE the compact design.  Also love that it can connect to a high speed wired connection that we have near our TV.  This product is a winner!", "verified": true, "helpfulness": "0/0", "author": "Jason M."}, {"rating": 5.0, "review": "I got this for my mom and her husband for Christmas. They are not tech savvy at all, so I was kind of scared that even though this seemed really simple to use they would still have issues. They have done fantastic!! My mom even hooked this up herself with a little coaching over the phone. They got a Netflix account, and I had made her a list of \"mom friendly\" movies and shows on Netflix. They are very happy with Fire TV and haven't had any problems or complaints. I want one now for me!!", "verified": true, "helpfulness": "0/0", "author": "Carrie Barker"}, {"rating": 3.0, "review": "Works good but I have found so far that the movie selection is all old.", "verified": true, "helpfulness": "0/0", "author": "Ray Paulk \"88GT\""}, {"rating": 5.0, "review": "I love this Fire TV, so easy to use! Basically, just plugged and play! Also, there are a lot of free contents and games, it's so good, I bought a Fire Stick for my bed room's TV. The only downside is, it runs a bit hot", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "No", "verified": true, "helpfulness": "0/0", "author": "Shewmkaker2000"}, {"rating": 5.0, "review": "Great product! Love it", "verified": true, "helpfulness": "0/0", "author": "Branden"}, {"rating": 5.0, "review": "Easy setup, simple controls.", "verified": true, "helpfulness": "0/0", "author": "Michelle Davis"}]