[{"rating": 5.0, "review": "Looking at some of the previous reviews, there isn't much that I can add to tell you how great it is.", "verified": true, "helpfulness": "0/0", "author": "Mystified"}, {"rating": 5.0, "review": "Does what Amazon describes, and has many intriguing options for viewing, from the apps to Amazon Prime selections in both tv and movies. Good feature of providing related titles to ones you like, most of which are dead-on.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I am sick and tried of having 500 cable channels and endless surfing only to find that nothing (worth watching) is \"ON\".  Was considering Apple TV, but explored Amazon Fire TV and ordered it up.This product actually does work as advertised.  Set up was a snap with not a glitch in sight.  Fire TV was instantly recognized by my WiFi and just a quickly logged on.  Fire fired up immediately and the voice recognition is amazingly good...we were watching movies in minutes of unpacking the box.Search and finding stuff you want is simple and very intuitive.I can see the day coming when we cut back our cable bill!!", "verified": true, "helpfulness": "0/0", "author": "Stick60"}, {"rating": 5.0, "review": "Have 2 Roku3's have moved them to the den and bedroom.  The Fire TV is now in the great room hooked to the main TV and Video projector.  Picture is excellent, load times for me are just as fast as the Rokus.  Do like the 5.1 audio output.  Seem to have more options for picture and sound.  Amazon Prime, Netflix and Hulu + all perform flawlessly  Another great product from Amazon.", "verified": true, "helpfulness": "1/1", "author": "GRC \"Gari R. Chandler\""}, {"rating": 2.0, "review": "I bought this to replace my \"Apple TV\" because it didn't pick up Amazon Prime Videos and it would occasionally go black while watching a movie or TV show (always at the most critical time it seems). So, I bought the Amazon Fire TV device. It was very easy to install, I must say that (but the Apple TV was also). I love the voice search, it seems to work very well, another plus for the Fire TV. BUT, where the Apple TV went black for a few seconds several times, the Fire TV goes black triple that time. Now, I'm sure it has something to do with bandwidth and other techie stuff, but the fact is that it goes out more than the Apple TV. Another thing that I haven't figured out is the Amazon \"Instant Watch\" situation. I loaded my \"List\" with Instant Prime movies and TV shows, but when I go to watch them they are either wanting me to rent them or they are not available for some reason. This happened to over 3/4ths of the ones I chose. I'm not sure what the disconnect might be, but it exists. Other times it wants me to watch a movie on Hulu + (which I'm not a member). To sum it up, I probably made a mistake by buying the Fire TV, it hasn't proven itself to be a useful device, I'm not sure where these 40,000 Instant Watch videos exist, but they aren't available on Fire TV!", "verified": true, "helpfulness": "1/5", "author": "Brian Voge"}, {"rating": 5.0, "review": "Love it. Will buy 2 more soon Cancel my direct kids enjoy watch Netflix and Hulu plus. I'm also a prime member no more cable or satellite tv", "verified": true, "helpfulness": "0/0", "author": "michael navarro"}, {"rating": 4.0, "review": "I would of gave it a 5, but it doesn't offer the ability for me to access by Amazon music. I don't like Pandora or I Heart radio.Amazon needs to let you be able to get to  your Amazon Mp3 music.When they make this change I will give it a 5.The video streaming works great. No waiting time for things to Buffer with a good internet connection.", "verified": true, "helpfulness": "0/0", "author": "Dale Koeneman"}, {"rating": 5.0, "review": "Best money can buy. The device does what Amazon say it can do. The device is easy to install and easy to cooperate.  Cable tv, watch out Amazon Fire T.V. can save you money.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Nice design. Works greatly. Very easy plug and play. Immediately recognizes who you are. Automatically sincs with your amazon account. Plus all movies and channels. Beats iTunes prices!!", "verified": true, "helpfulness": "0/0", "author": "Salvador Malenchini \"M0n0\""}, {"rating": 5.0, "review": "Got this for my mom she loves this thing easy to operate user friendly didn't have to explain much to her at all.", "verified": true, "helpfulness": "0/0", "author": "Fritz"}]