[{"rating": 5.0, "review": "This is a great toy! I love it.", "verified": true, "helpfulness": "0/0", "author": "Nacer Chahat"}, {"rating": 4.0, "review": "my roku went kaput only after a few months.  so far this is much easier and better than using my xbox for films/tv shows.", "verified": true, "helpfulness": "0/0", "author": "such a fan"}, {"rating": 5.0, "review": "works very well and easily, did not think i would like the voice option but it is great.", "verified": true, "helpfulness": "0/0", "author": "WARD"}, {"rating": 5.0, "review": "Works fabulously!!  One of the best things I've bought!!  Games, fun for a young kid if they don't have an xbox; controller works well, certainly not a replacement for a console or pc gaming, but movies - with a prime subscription &/or purchased items - snappiest, quickest, high a/v quality, I've known!!!  Also works well with Pandora, prime music for purchased only, nice if it hosted all the prime music available for free.  Hooked up through receiver, 5.1 stereo sound - seems like I'm just beginning to tap into the Amazon movie & music resource world!!", "verified": true, "helpfulness": "0/0", "author": "R Peterson"}, {"rating": 5.0, "review": "This thing out performs the roku and Apple tv in every category! It's easy to use and easy to install!!!", "verified": true, "helpfulness": "0/1", "author": "Michael S. Setser Jr. \"alkasetser\""}, {"rating": 5.0, "review": "Day 1 Review: excellent packaging, device looks great on my surround sound box. extremely easy to setup and start using. I have only used spotify and netflix on the device. I wish it had a native spotify app so i didn't have to open the app on my tablet first and play over WiFi. but it does play a nice screen saver on the TV while the music plays, and once its playing i can control the music with the fire TV remote. very responsive, and sound/video clarity are great.Well worth the price for what you get.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "Voice search is awesome! I bet it will spoil you :)", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It's alright. Kinda just like netflix. Old movies and tv shows. Easy installation and use though.", "verified": true, "helpfulness": "0/1", "author": "Jock D."}, {"rating": 5.0, "review": "This is awesome. LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "mark"}, {"rating": 5.0, "review": "I am playing on turning off my cable! I never watch regular tv anymore. Netflix and amazon prime both offer so much that between the two I just watch them constantly! I absolutely recommend buying this!", "verified": true, "helpfulness": "0/0", "author": "julie"}]