[{"rating": 5.0, "review": "Very easy to set up, use and great selection.", "verified": true, "helpfulness": "0/0", "author": "Leslie H. Brown"}, {"rating": 4.0, "review": "Good quality, easy to install, user friendly menus and excellent remote control.Amazon needs to improve the streaming quality and the content.", "verified": true, "helpfulness": "0/0", "author": "Andres De La Fuente \"Pollo 0821\""}, {"rating": 4.0, "review": "I am everything apple, but they won't support amazon prime which I think has much better tv than Netflix. So I bought this and I love it. Works great and fast.Only three concerns:1. Poor parental control options. Yes you can enable parental controls but all that does us require a pin code for each and every show even if it's rated G. Which is a pain for parents having to go over to the tv ever 30 minutes--dumb. Or if it's not on they can watch anything, even mature. It should not be an all or nothing situation. They desperately need rating options in parental control settings.2. They need to enable search for amazon prime only, like the iPad version, instead your search results show hundreds of pay for content.3. They need a smartphone app for a remote. You loose their tiny remote = no tv.", "verified": true, "helpfulness": "0/0", "author": "SFly"}, {"rating": 5.0, "review": "The Amazon Fire TV has been great. I'm usually an Apple person (I have a MacBook Pro and iPhone) and was thinking of the Apple TV but was a little disappointed that it hadn't been updated in awhile. I decided to give the Amazon Fire TV a try since it had more current hardware and have been extremely impressed. I've been able to stream Netflix and movies from Amazon Prime without any problems. The remote feels like it is made of high quality materials and has a seamless connection. I downloaded a few games as well and bought the Amazon Game Controller and am happy with it. Note though that I'm a very casual gamer so people looking for more game orientated systems will still need the Playstation, Xbox, Nintendo, etc. systems. Overall, I highly recommend the Fire TV if you're looking to stream Netflix and other movies through your TV.", "verified": true, "helpfulness": "0/0", "author": "Kurt K"}, {"rating": 5.0, "review": "Love Amazon Fire, just don't think I have enough time in a day to see everything it offers, I love it. Thanks for inventingthis amazing tool.", "verified": true, "helpfulness": "0/0", "author": "Deann Greenawalt"}, {"rating": 5.0, "review": "Overall, very good. Easy to use remote and game controller. It works very well.", "verified": true, "helpfulness": "0/0", "author": "Stephen Lynch"}, {"rating": 4.0, "review": "Love it - streams local and no-local content seamlessly. I used Plex to stream my local file from a local PC and the app and FireTV work great.Small footprint and super easy setup. I have an 'accent' and was pleasantly surprised just how good the voice search function is. It has caught all of my searches so far. By comparison, Apple's 'Siri' only understands me 50% of the time on my iPhone.1 star knocked off for lack of functionality to search 'free' Prime content only (results also include non-free titles) and also the lack of functionality to search third-party content providers such as Hulu or Crackle.All in all, I'm very pleased.", "verified": true, "helpfulness": "0/0", "author": "JME \"Magohnem\""}, {"rating": 5.0, "review": "Love the ability to speak to pull up what I want, without the hassle of using a keyboard.", "verified": true, "helpfulness": "0/0", "author": "San Diego \"Sara\""}, {"rating": 5.0, "review": "We love it! We really enjoy some of the old T.V. sitcoms. Especially Frasier and Everybody Loves Raymond that have been recently pulled by TV-Land and The Hallmark Channel  and replaced with garbage. Also, we now have had the extra-plus of seeing episodes that we have never seen before on T.V. syndication. When we can, we're going to drop our cable to the bare minimum since there really aren't that many channels we watch. The biggest problem we have with Verizon is that with the premium movie channels, it's so hard to find out exactly when and what movies are playing at a particular time. Scrolling down the screen to check all the movies is too much trouble. Now, we can watch what we want, when we want at a reasonable cost. Love the voice activation. Hope that Amazon can make a deal w/ Net-Flicks so that the voice activation would work w/ their catalog since we use both Amazon Prime and the Net-Flicks catalogs. Way to go Amazon!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "D+P"}, {"rating": 2.0, "review": "When it works, it works great but if the box is not positioned just right, we get a ton of pauses during a movie to \"reload\" the system.", "verified": true, "helpfulness": "0/0", "author": "Robert"}]