[{"rating": 5.0, "review": "WOW! This thing is WAY better than the Apple TV. The user interface is much easier to use. I never thought I'd like the voice feature on the remote (you can hold down the microphone button and say the name of the show you're looking for), but it work's perfectly. They're usually very slow and inaccurate (like Siri), but this thing is super fast and even gives you crazy options that sound like what you're saying....I tested it by looking for one of my son's favorite shows \"Caillou\" (pronounced \"kyoo\"), and it nailed it in less than a second.You can read up on the features and apps, but trust me. It's way better than Apple TV.", "verified": true, "helpfulness": "2/3", "author": "gringogigante"}, {"rating": 2.0, "review": "I bought this device to replace a Samsung Smart Blue-Ray DVD player that stopped streaming Netflix after one year of use.  I've had this device since April, and it worked well until recently.  Now, this device is unable to connect to Netflix, although it still streams Pandora, Youtube, and others.  I've been on the phone with Amazon's tech support and tried reloading and unplugging the machine and other fixes that Tech Support has suggested.  Tech Support informed me that others have the same problem and I've read revues of others saying the same.  It appears that the Fire TV is using an inferior App for Netflix, and I can't find any indication that they're trying to upgrade..  It seems that I've wasted my money on this machine, and I regret i bought it.", "verified": true, "helpfulness": "1/2", "author": "Michael L. Roberts"}, {"rating": 2.0, "review": "not near as good as roku the channel line up is just to small roku is loaded with channels i have more than 600 on both of my roku units including amazon prime as a matter of fact i bought another roku for my other tv and i am giving the fire tv to my son in law", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it to the ultimate. No problems with purchase. Item arrived on time and was as described.I will be purchasing  more for myself and as gifts for family members.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Beats Roku and boxy box that's for sure a++", "verified": true, "helpfulness": "1/1", "author": "Nicholas Leeuwen"}, {"rating": 1.0, "review": "If I had a dollar for every time it didn't work, I could buy an AppleTV. I love Amazon Instant Watch. I regularly buy shows and movies but I can never stream them on my Fire. Or anything else for that matter. Incredibly disappointing. Am I sure it's the Fire? Yeah, whenever it fails, I have no problems streaming on other devices.", "verified": true, "helpfulness": "4/5", "author": "Meg"}, {"rating": 4.0, "review": "Slow at down loading at times", "verified": true, "helpfulness": "0/0", "author": "Dpatty"}, {"rating": 1.0, "review": "Before I even received my first Fire TV I received a contact from Amazon Customer Services saying there was a mistake and the unit I had been shipped would not work.  The had already posted a new unit to me.  I received that unit and it also did not work, simply would not update the system and would not move beyond that initial screen.  Two units that cannot be plugged in and work.  Horrible product impression.  Returned.", "verified": true, "helpfulness": "3/4", "author": "Kindle Customer"}, {"rating": 5.0, "review": "We are really enjoying Amazon Fire. First of all, it's a tiny little box that you can hide away easily and not notice. To install it, you plug the power supply into the wall and plug the HDMI cable into your TV (You have to purchase the HDMI cable separately, but you just need a short one.) Of course, you need to sync it with your router, but this is pretty easy. There is an amazing amount of on demand video available including movies and TV series. We are members of Amazon Prime, so there are a wealth of free programs available to us. Those that aren't free are very reasonably priced compared to the competition. The interface is easy to navigate, and the remote control has a minimum of buttons (very refreshing.) Search is made easy by the feature that lets you speak into the remote. The TV screen shows what it thinks you said (it's very accurate) and you push the OK button. It's very handy, as I'm not good at typing with a remote.", "verified": true, "helpfulness": "2/2", "author": "T. Lassagne"}, {"rating": 4.0, "review": "Great once I got used to streaming. Sometimes the program will stop and will have to be restarted.", "verified": true, "helpfulness": "0/0", "author": "Rich W"}]