[{"rating": 5.0, "review": "Very easy to install. Very intuitive. The streaming is much faster than any Amazon app that is available with other devices. I'm quite happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "F. H. Williams"}, {"rating": 5.0, "review": "It's great. Thanks", "verified": true, "helpfulness": "0/0", "author": "Russ Achelpohl"}, {"rating": 5.0, "review": "Life is great with prime", "verified": true, "helpfulness": "0/0", "author": "El Guapo"}, {"rating": 5.0, "review": "It was effortless to hook up and connect.  Because I was an amazon prime member everything was already registered and set up for me.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Louise McCrea"}, {"rating": 5.0, "review": "It's everything I ever wanted!!! I am not disappointed!! I like how it syncs with my kindle. I also enjoy all of the free videos and movies that come with being a prime member.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It doesn't work. I've tried wireless and Ethernet and it won't load movies, either from Amazon's own content or Netflix. Also, no audio. Good idea, lousy follow through.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This is the biggest waste of money ever.  The product has a very limited selection of mostly old movies for free.  I have been unable to watch any PBS or History channel shows from those apps.  The buttons for these options just don't seem to work at all.  So much for easy access to free TV shows.  It is hard to find the netflix movies, since there is no search available.  This is just a gimic to encourage you to give Amazon more money.  The search works wonderfully for Amazon content, and that's it.  I can buy a Blue Ray Player for the same money and get access to Netflix and Hulu and also have a blue ray player!  This has to go.", "verified": true, "helpfulness": "2/4", "author": "Barbara Baughman"}, {"rating": 5.0, "review": "The smartest decision you will ever make for entertainment.", "verified": true, "helpfulness": "0/0", "author": "B. C."}, {"rating": 5.0, "review": "Easy to set up and easy to use", "verified": true, "helpfulness": "0/0", "author": "Gabe"}, {"rating": 5.0, "review": "It's a nice replacement for my home theater PC, except it lacks a Bluray player, which is fairly obvious.", "verified": true, "helpfulness": "0/0", "author": "DanG"}]