[{"rating": 4.0, "review": "so far very happy, Costs a bit of money though/", "verified": true, "helpfulness": "0/1", "author": "Deseree"}, {"rating": 4.0, "review": "We really liked the Fire TV, but we just returned it. Why? Because the remote is not backlit. Not sure why companies stopped doing that. But, this remote is too difficult to see in a darkened room. AND the layout on the remote is not incredibly intuitive. So we kept accidentally hitting the wrong thing. It also does not have the same search capability that the Roku has - that is what sold us to switch. Roku will show you which of your different services has the show you are looking for, so you can find the \"free\" version. After long thought, we think that we would have kept the Fire TV if we had it in the living room instead of the bedroom. Poor lighting in one room, better in the other. I hope that in the future the search feature is more fleshed out... Then it would be an AWESOME device.", "verified": true, "helpfulness": "0/2", "author": "M. Melanie Chevalier \"beegkitty\""}, {"rating": 5.0, "review": "Best money spent on entertainment in a while.", "verified": true, "helpfulness": "0/0", "author": "LieutenantColumbo"}, {"rating": 4.0, "review": "Roku is the best.", "verified": false, "helpfulness": "0/1", "author": "Carlos Otero Chavarria"}, {"rating": 5.0, "review": "Love it.  Easy to set up, easy to navigate, easy to use.  As a prime member, I have access to terrific movies and TV shows.  Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Deirdre Honner"}, {"rating": 3.0, "review": "I have mixed feelings about this device. It's my first IPTV device so I can't compare it to any others. Where I find it most lacking is in performance lag. It's advertised to be an 802.11n device, but when monitoring the device at the WAP I noticed the best performance I get is 105 Mbps, with an average speed of around 76Mbps.. This is with a signal strength of 100%. My 802.11n laptop runs at a steady speed of 130Mbps, so I don't believe it to be my equipment. This would not be an issue I feel but the FireTV device suffers from lag, and will produce the message from time to time that my internet speed is not fast enough. I end up shutting down pretty much everything else on my network (laptops, phones) in order to get a usable FireTV. I don't understand why the device has performance issues when I can be watching streaming movies and Youtube vids on multiple laptops simultaneously with no lag. Youtube is pretty much unusable on the device, which is unfortunate.I have loaded XBMC on the FireTV device and enjoy using that to play the large library of films I have downloaded and stored over the years on a network drive. I find XBMC to perform well on this device.I find the variety of entertainment sources available on the device to be quite satisfactory. I would just like to see better performance in streaming services. Perhaps my bandwidth to the internet needs to be increased, but really this is the only device in my home that has a problem with streaming performance.", "verified": true, "helpfulness": "1/1", "author": "Mark Shindler"}, {"rating": 5.0, "review": "This is a solidly built, easy to use product.  As other reviewers have stated, it is blazingly fast, the picture quality is very good, and the optical out feature makes the sound superb.  Comparing this to Apple TV, is a tortoise and hare proposition.  It also can use the 5 ghz wifi band.  I could only ask for two improvements:1.  When in one's video library, a differentiation between movies and tv, as one can on a Fire tablet for example, rather than having everything mixed together.2.  A video display option of 1080p 30 fps for up-converting to a UHD television.Apart from these minor quibbles, this is an excellent product.  I have already purchased two others for friends who both love it.", "verified": true, "helpfulness": "2/2", "author": "C. G. Wilson"}, {"rating": 5.0, "review": "Love it! No complaints.", "verified": true, "helpfulness": "0/0", "author": "rudy777 \"rudy777\""}, {"rating": 5.0, "review": "I love the multitude of options of available to view, easy to use", "verified": true, "helpfulness": "0/0", "author": "karen klauseger"}, {"rating": 5.0, "review": "So far I love it. This replaced my Roku 2 and it hasn't rebooted once when watching anything. The Roku 2 was constantly rebooting and so how disruptive is that when you're watching a movie. It's quite fast and I like the voice activation, especially on Netflix, not just Prime. One thing I like better on the Roku is the interface... seems easier to navigate & know what's Roku or something else. That part is not a deal breaker but I think it needs work on that front.", "verified": true, "helpfulness": "1/1", "author": "HP"}]