[{"rating": 5.0, "review": "99.00 is to much for me. Why why why why. I like prime do not under stand you thinking . Why", "verified": true, "helpfulness": "0/4", "author": "RICHARD J SCHOFIELD"}, {"rating": 4.0, "review": "I've been using Amazon FireTV regularly and found it easy to use and voice function is great when looking for different things that you have seen.  Would be nice to have more variety eg. showtime, starz, HBO.", "verified": true, "helpfulness": "0/0", "author": "Walter S."}, {"rating": 5.0, "review": "Super easy to use. Love it. I had been holding out hoping amazon would come out with a product to compete with Apple TV as I am an amazon prime customer and devoted amazon user and what do you know! Fire tv is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Lacey Lowber"}, {"rating": 4.0, "review": "With this, you don't have to start with your phone or tablet- just straight to the TV. It sometimes stops and loses the signal like cable tv first did. I'm assuming they will get that worked out. You can watch Amazon TV also. I also got the game controllerIt took me minutes from unpacking to having it up and running. Be sure to buy recommended cord with it. No cord comes with it.", "verified": true, "helpfulness": "0/0", "author": "chipmunk53"}, {"rating": 5.0, "review": "I love this thing, had access to every thing you need to cut the cable. The voice activation works fantastically, I just wish it worked for Netflix and Hulu. Very happy.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "The Fire TV is the greatest experience.  Our computer that we used for the TV bit the dust and we decided to try this while waiting for computer parts.  Now I'm not worried about the computer.  Amazon Fire TV does it all . . . and it is so easy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I can't get to turn off the box, anyone can help?  I've tried May things but can't find how to turn it off!", "verified": true, "helpfulness": "0/1", "author": "Carlos C."}, {"rating": 5.0, "review": "The hardest thing about setting this up was opening the box!  The reception is wonderful, beautiful picture and sound.  We live in a very remote area and will not deal with DISH or DIRECT, awful customer service.  We have never had a problem with Amazon.  But I digress, It is a joy to watch TV the way we want to and not how a company tells us to.  The quality is just wonderful, so far no problems with buffering as with  ROKU and I liked ROKU also but this is quite a step up.  Highly recommend.  Exceeded my expectations.  Worth every penny.", "verified": true, "helpfulness": "0/0", "author": "First Timer \"bj\""}, {"rating": 4.0, "review": "I bought the Amazon Fire for my husbands birthday gift. We were very interested in it since we are Prime members but we were skeptical...AppleTV, Roku, even Netflix through our BluRay player aren't really that cool, so how was Amazon Fire different?Plain and Simple, we LOVE the voice search and the ease of purchasing Amazon products with a little click. Its also VERY easy to use the keys on screen to sign in to Pandora etc... Much Much MUCH better, faster usability than AppleTV.I only give it 4 stars because, while Amazon Prime does include a lot of \"free\" content...its all stuff that no one really wants to watch, unless you're a 13 year old kid. You still have to pay additional service fees to Netflix, HBO etc. so you can't really cancel cable...its not a replacement for anything, its just a cool toy.", "verified": true, "helpfulness": "0/0", "author": "GRB"}, {"rating": 5.0, "review": "Love Fire TV!!! Love Fire TV!!! Love Fire TV!!! Love Fire TV!!! Love Fire TV!!! Love Fire TV!!! Love Fire TV!!! Love Fire TV!!!Very easy to use and I don't miss my Dish.", "verified": true, "helpfulness": "0/1", "author": "renee mcalpin"}]