[{"rating": 5.0, "review": "I own an Apple TV and every version of Roku made.  I like them all, but as I watch a lot of streaming video as a Prime member I thought I would get this as the reviews were excellent.  WOW!  So much faster and intuitive than the others...and while I thought I would never use the voice feature...well I was wrong, use it every time...and it never misses.  Buy it, you will be happy!", "verified": true, "helpfulness": "6/6", "author": "Jan L. \"Jan\""}, {"rating": 5.0, "review": "I had a Roku 2 for a few years, this is much faster and hasn't hung on me (yet).  Everything works, the only issue I have is when I'm scrolling through movie choices the control is touchy and wants to jump if held down more than just a quick hit.  They should program a delay for the fast-scroll of maybe .25 second and it would alleviate that annoyance.  Other than that it's good.", "verified": true, "helpfulness": "2/2", "author": "Steve \"TwoDogsLoving\""}, {"rating": 3.0, "review": "Love the device with ONE exception:  a lot of the videos we watch through Amazon Prime have HORRID sound quality.  If I recall correctly, it only occurs when we rent a non-HD movie.  In some instances, I wasn't able to finish the movie because of the sound.  It sounds like a filter has been improperly tuned-there's a weird high-pitched frequency noise that accompanies all the sounds.", "verified": true, "helpfulness": "2/2", "author": "CC"}, {"rating": 5.0, "review": "I've been an Amazon prime customer for a few years, but I rarely used the access to video content until I purchased this item. This item is very easy to setup and get running.  I'm impressed with the content that's available for free.  I recently downloaded and installed the YouTube feature for this, and I find this app very easy to use.Great job!!", "verified": true, "helpfulness": "1/1", "author": "Bill Baltas"}, {"rating": 5.0, "review": "Love this product, it has a lot of space for Movies, TV Shows, Music and Games. Gives you more space saving for you pc...", "verified": true, "helpfulness": "1/1", "author": "Sue"}, {"rating": 5.0, "review": "I enjoy it everyday it has so many movies many I saw when I was young  (am now 62) and recent ones.  I would recommend it to anyone who like watching movies at home.", "verified": true, "helpfulness": "1/1", "author": "Brenda"}, {"rating": 4.0, "review": "We have one issue with this, once you are in a grouping of movies it's difficult to maneuver to find a specific movie", "verified": true, "helpfulness": "2/2", "author": "peencho"}, {"rating": 3.0, "review": "We live out in the country and thought the continual freezing was because of our internet connection.  But then we hooked our laptop up directly to our TV and the netflix and huluplus freezing/reloading problems stopped.  We re-hooked up Amazon Fire and again experienced freezing problems.  Shows had to reload every few minutes which is extremely frustrating!  We decided to return it.  I think it will be a great product when they get the glitches out.", "verified": true, "helpfulness": "0/0", "author": "JMOM"}, {"rating": 4.0, "review": "As a huge fan of the Roku, but loyal Amazon customer, I was super excited to try out this little device. I won’t bore you with details about processing speeds and set up, I’m sure there are more “techy” people that can do that in other reviews. So I’ll sum that portion of the review up with this: it’s every bit as good as the Roku.HOWEVER, this device is clearly meant to steer you towards Amazon purchases. For example, the microphone feature works great, but it only directs you to things Amazon can offer you. For example, say I want to watch something with Hugh Jackman, when I say the name into the remote, it has no problem understanding me and will quickly bring up all things Hugh that Amazon has to offer…but only Amazon. It doesn’t mention anything Hulu, Netflix, etc can offer. (The Roku, incidentally does do this, but you have to manually type in dear Hugh’s name.)Also, I prefer the way the Roku displays its menu. The Fire TV isn’t difficult to navigate, but it’s also not as easy.It’s still a cool little device, and I don’t regret purchasing it, but when I buy a new device, I’ll be going back to the Roku.", "verified": true, "helpfulness": "2/2", "author": "KrazyKat"}, {"rating": 4.0, "review": "Fire TV has a great voice-response controller.  This is a great solution to program selection, which otherwise has slow up-down-sideways one-letter-at-a-time tedious typing.We've watched several movies and are delighted with the quality of video and sound.  I haven't quite figured how to search for only free content under my PRIME account, and ended up paying for two movies.  If this persists, it will reduce my delight.I believe we are barely fast enough using our DSL Internet connection, then Wi-Fi wireless bridge across the room to the Fire TV.  I say this because I once saw one of those spiraling circular symbols but it was only at the beginning of a search or something, never in the middle of anything I was viewing.", "verified": true, "helpfulness": "0/0", "author": "Chet Haibel"}]