[{"rating": 5.0, "review": "Easy setup, sharp image with no lags. Menus easy to use. Exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 5.0, "review": "I love our Amazon Fire TV. This is way better than our Roku 3 that we replaced with it. Much faster, faster buffering / streaming, better quality channels. Would recommend to anybody. Also, there are some really awesome multiplayer trivia type games for the family!", "verified": true, "helpfulness": "2/2", "author": "Travis"}, {"rating": 5.0, "review": "Bought the Fire TV through my Amazon Account.  Lo and Behold I just plugged it in.  Netflix is better than on my LG DVD player.  Just don't like the Just Do It approach.  Some basic info or do and don't would be nice.", "verified": true, "helpfulness": "0/1", "author": "John J Bartoszewicz"}, {"rating": 4.0, "review": "Love it. Better than roku2 in my opinion. Plays next episode automatically.  The only problem is it doesnt have a screensaver that comes on and stays on even after it shuts off.", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 4.0, "review": "This is by far the best streaming player out there. With the recent addition of HBOGo it is close to having all the entertainment apps I need, without all the useless fluff on the roku. The gaming apps are top shelf and could easily compete with any gaming system on the current market. The only thing that it lacks is memory and a way to increase memory (ex. SD card or usb pin drive). Some apps take so much memory that you have to put others in the cloud. Mainly this applies to the gaming apps. Regardless, it is still the best in the market today.", "verified": true, "helpfulness": "1/1", "author": "Miss J"}, {"rating": 5.0, "review": "So easy to use and a great selection now that hbo go is available.  The games are good too.", "verified": true, "helpfulness": "0/1", "author": "Karl M Larson"}, {"rating": 3.0, "review": "Works great but when I first hooked it up I didn't realize that I would need to go out and buy a HDMI cable before I could use it.", "verified": true, "helpfulness": "0/1", "author": "Randy Lower"}, {"rating": 5.0, "review": "Love the Amazon Fire TV. It works perfectly and was very easy to set up. The voice command works beautifully and it is sleek and small enough not to crowd my tv and the area.  Will look into giving this as a gift as some point.", "verified": true, "helpfulness": "1/1", "author": "Talo \"Tania\""}, {"rating": 5.0, "review": "Awesome product. Very responsive and does everything I need it to do. Love the voice search as well. I would recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "RedVRum"}, {"rating": 5.0, "review": "We placed it on the wall near our treadmill.  It makes the time on the treadmill go a lot faster!  Very happy with Amazon Fire TV and looking forward using it more!", "verified": true, "helpfulness": "0/1", "author": "sunshine33"}]