[{"rating": 5.0, "review": "I absolutely love this. The \"Free Time\" area where I put time control, password lock for purchases, and kid friendly interface for my four year old is GENIUS. I thought I was going to have to monitor him on this so he wouldn't accidentally buy anything on my account, but he can't even get out of the Free Time area without my password. Seriously - that alone I think is worth my purchase. It has so many options as far as kid friendly movies and tv shows (way more than Netflix and Hulu as far as content goes) for him, that for the most part we have only used the Amazon Prime available free content. As far as the adult side of everything, they clearly favor the Amazon content over everything else which makes sense since it's how they probably make more money but they clearly label the things that cost vs the things that are free. And I have yet to need to purchase anything between Amazon Prime free content, Hulu and Netflix apps on there as well, there's so much available to browse - I don't see the reason to ever need to buy cable channels. We've lived solely off Netflix for 4 years and with this purchase I don't see us buying anything else for our TV.", "verified": true, "helpfulness": "2/3", "author": "wanderwonderwoman"}, {"rating": 5.0, "review": "We are loving this product so far! It was easy to set up, it's very easy and intuitive to use, and we have instant access to so much stuff now! Sometimes the internet doesn't connect right away, but I am quite sure that is a problem with our wireless router, not with the Fire. I highly recommend this product, and am thrilled to get rid of our cable and DVR.", "verified": true, "helpfulness": "1/2", "author": "maya59"}, {"rating": 5.0, "review": "Great product! Many useful features and fantastic remote!", "verified": true, "helpfulness": "1/2", "author": "Rrbbc"}, {"rating": 5.0, "review": "This is the best media streaming device I own. I have Roku and apple TVs as well, The Fire TV just owns the apple TV I have put my apple TV devices out to pasture. While the Roku player still has more \"Channels\" 80% of those channels are useless to the average user there are some gems you will love but most the Roku channels are just fluff. I like the design functionality and interface of the fire TV. If you are using Plex or other media streaming apps the Fire TV handles them all no problem. Amazon fire remote is great there is no lag between the remote and the device.IMO the Fire TV or the Roku 3 are the only options for media streaming devices you need to consider.", "verified": true, "helpfulness": "2/3", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very responsive. Great picture quality. Lots of options.", "verified": true, "helpfulness": "1/2", "author": "K D"}, {"rating": 5.0, "review": "Love this device!", "verified": true, "helpfulness": "1/2", "author": "eugenio suarez"}, {"rating": 5.0, "review": "Amazon Prime Fire TV takes Smart TV to the next level with its speed and responsiveness. The capabilities of this box leaves the others in the dust. Also the openness of the program allows more apps and programs to be loaded by the user. I am very satisfied with this device and use it pretty regularly.", "verified": true, "helpfulness": "1/2", "author": "viper296"}, {"rating": 2.0, "review": "Not what we expected.  Picture is great but you have to pay extra for everything you watch.  That could get to be REALLY expensive. Was looking for something that would be less expensive than cable TV and this is definitely not it!", "verified": true, "helpfulness": "3/4", "author": "John R"}, {"rating": 5.0, "review": "This thing works great. Wasn't sure how it would work with my internet speed, 3 mbps, but it is great. Have watched about a dozen movies so far and no problems. Like it so much that I have ordered the Fire Stick for my other TV.", "verified": true, "helpfulness": "1/2", "author": "Brad79"}, {"rating": 5.0, "review": "Much more reliable and faster than Roku.  Still learning my way around the Fire TV but highly recommend it.", "verified": true, "helpfulness": "1/2", "author": "James R. Selinger"}]