[{"rating": 5.0, "review": "Amazingly easy to use", "verified": true, "helpfulness": "0/2", "author": "Tammie P. Wray"}, {"rating": 5.0, "review": "Excellent device, I really enjoy the features especially the voice command. Easy to set up and browse through apps and many other neat features. I highly recommend this product.", "verified": true, "helpfulness": "0/1", "author": "Tedson Estrellon"}, {"rating": 5.0, "review": "I absolutely love my amazon fire tv. I never watch my cable anymore. I've had it for over a year now and haven't had any issues with it.", "verified": true, "helpfulness": "0/1", "author": "kristie"}, {"rating": 5.0, "review": "My only disappointment is that I didn't buy it sooner!!!", "verified": true, "helpfulness": "0/2", "author": "Kenneth L."}, {"rating": 5.0, "review": "This is an amazing device.  I had been using an Apple TV for the past few years but I got tired of waiting for them to refresh their outdated box.  I'm glad I made the switch to Amazon Fire TV.  It not only plays Amazon content (lots of free movies and TV shows for Prime members) but it also plays Netflix content.  I also REALLY like the \"X-ray\" feature which allows you to pause any scene and find out who the actors are in that scene at that moment - VERY COOL", "verified": true, "helpfulness": "2/3", "author": "Jon Padfield \"President, Proffer Brainchild Inc\""}, {"rating": 4.0, "review": "Good purchase,  there are ways to make it great", "verified": true, "helpfulness": "0/2", "author": "Richard Villagrana"}, {"rating": 5.0, "review": "We are enjoying it!", "verified": true, "helpfulness": "0/2", "author": "Greta Bryan"}, {"rating": 3.0, "review": "Beware: If you are using this for sporting events (like Watch ESPN) save yourself some aggravation and buy Apple TV instead.  For some reason there are far more events on Watch ESPN (Apples app) than Watch ESPN on Fire TV.  Same content as the Fire Stick.  Very disappointed.  Was told by Amazon support that the issue is with ESPN since they apparently control the content for each.", "verified": true, "helpfulness": "0/1", "author": "Bruce L \"BLL\""}, {"rating": 5.0, "review": "Amazon fire Is extremely easy to set up. Best purchase I've made!", "verified": true, "helpfulness": "0/2", "author": "Stark"}, {"rating": 5.0, "review": "Easy to load but with enhanced DSL(about 1 meg) had to make sure had no other connections to internet due to slow to download updates. However after downloaded seem to work OK even with DSL. What a surprise since I know that 2+ megs are really needed to enjoy program content. I will get 50 meg internet service next week and expect faster service and no stutters. Still having fun checking out programs and services available on fire tv.", "verified": true, "helpfulness": "0/1", "author": "tennislaw"}]