[{"rating": 4.0, "review": "Great device and super streaming speed. I'd have given 5 stars if they would include voice search for YouTube and other applications", "verified": true, "helpfulness": "0/0", "author": "Danny S."}, {"rating": 1.0, "review": "Always buffering.", "verified": true, "helpfulness": "0/0", "author": "Juanita Bethers"}, {"rating": 5.0, "review": "Turned my regular HD tv into a smart tv!", "verified": true, "helpfulness": "0/0", "author": "R. Hopkins"}, {"rating": 5.0, "review": "Being a Prime member and installing the unit on my smart TV, it begin working a stated on the  package.  I beleive that this is the best purchase I have made this year.  Thank you for listening.", "verified": true, "helpfulness": "0/0", "author": "Rudolph"}, {"rating": 5.0, "review": "Excellent performance, have owned Apple TVs for a while, and I can say that the amazon fire tv surpasses it by far. Faster more memory, easy to use , way better remote.  I'm more than satisfied.", "verified": true, "helpfulness": "0/0", "author": "RAFAEL A."}, {"rating": 5.0, "review": "Love it.  Allows for more choices than regular TV", "verified": true, "helpfulness": "0/0", "author": "LaDonna P Haywood"}, {"rating": 4.0, "review": "Works as advertised. Easy to set up. My TV location(pocketed in a wall) made it very difficult to plug in the HDMI chord to the TV. Ended up using a mirror to see where it was supposed to go. Oh well.", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 4.0, "review": "Great little streamer. It runs quick and easy to use. The only down side is the lack of mirroring with an iOS devic.", "verified": true, "helpfulness": "0/0", "author": "Cesar"}, {"rating": 1.0, "review": "While this product seems well conceived and easy to use, it is not at all suitable for older HDTV sets, a fact that is not advertised clearly in the product information.  Do not buy this, for instance, if your only way of connecting is a DVI slot.  Even with an HDMI-DVI cable this product will not work properly, delivering exceptionally poor picture quality and nothing but interference for sound.  Amazon's technical support staff were candid that the Fire TV unit was not compatible with older TVs, but, again, this fact was not at all clear from the product information online.", "verified": true, "helpfulness": "2/2", "author": "Yasha Hartberg"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Barbara J. Sullivan"}]