[{"rating": 5.0, "review": "Completely satisfied,worked immediately out of the box with no problems.Used it with a MiFi card in my motor home.", "verified": true, "helpfulness": "0/0", "author": "Henry G. Shows Jr."}, {"rating": 5.0, "review": "Very easy set upOrdered from Amazon some features already set upWorks without a problemMakes listening to music enjoyableFive stars plusI will ENCOURAGE my friends to buy.", "verified": true, "helpfulness": "0/0", "author": "rver"}, {"rating": 5.0, "review": "Need one on every TV! Love it!", "verified": true, "helpfulness": "0/0", "author": "Walter P."}, {"rating": 1.0, "review": "I wanted to love the Amazon Fire Tv.  I got the fire tv, set up was easy and it worked great for about 3 days.  After that my remote and/or the fire tv completely stopped working. I couldn't get it to do anything.  I unplugged it, etc. and NOTHING.  I broke down and contacted Amazon and was put in touch with someone in customer service and was on the phone for over an hour trying various things....most of which I had ALREADY tried.  They finally agreed to send me a new fire tv.  I got the new fire tv and it works great, most of the time.  It is much faster than the 2 year old Roku I have for my other tv, BUT has a few major flaws.  1) It freezes from time to time, which means it has to be unplugged and plugged back in. This is a huge pain.  2) It forgets the login information to the apps - this is particularly an issue with Hulu Plus.  During times of heavy use I have had to log in twice in one day.  While this is not the end of the world it is pretty annoying, as you have to either use the arrows to manually enter your log in information and or get a computer out to enter the activation code.  After 2 years of having a Roku I have NEVER had to re -log in to any of the apps or had to unplug it due to freezing.  I called Amazon mulitple times with these issues and despite returning the device to factory settings, uninstalling the apps, reinstalling the apps, clearing downloads, etc - nothing worked.  I finally got fed up and bought a Roku 3.  So far, I have not had any issues with it and haven't noticed a speed difference between it and the Fire TV.Unfortunately the worst part of the owning the Fire TV was trying to return it. Between the two fire TVS, I had them for not quite 2 months when I decided to return them.  I contacted amaozn via chat and was sent a link to the refund policy that states Amazon will only provide a full refund if returned within 30 days.  We were allowed to return the device but only for 80% of what we paid for it.  So in essence, I am being PUNISHED for attempting to make this device work as I would have returned it much earlier if I had not spent weeks working through the issues.  We use Amazon for everything, love Amazon and even own some Amazon stock, so we are really disappointed with how this has been resolved.", "verified": true, "helpfulness": "6/8", "author": "AB"}, {"rating": 4.0, "review": "Convenient. Plug in and go.  The voice search only works on amazon video.", "verified": true, "helpfulness": "0/0", "author": "k"}, {"rating": 1.0, "review": "I guess I didn't review this enough before purchasing. It didn't offer me anything more than my blue-ray player and netflix/hulu accounts.", "verified": true, "helpfulness": "1/7", "author": "Jenifer J Ludwiczak"}, {"rating": 4.0, "review": "I like the voice search feature and the streaming speed.  The features that you see in the box exterior are really deceiving.  They show you all those applications, but, they are not built in.  You have to download the applications.  I consider that deceptive advertisement.  I am quite sure that if those applications are built-in then the competition will have a big problem in their hands.", "verified": true, "helpfulness": "0/0", "author": "jose"}, {"rating": 5.0, "review": "Works as advertised.  Contrary to one review you can surf Prime selections.", "verified": true, "helpfulness": "0/0", "author": "J. Carr"}, {"rating": 5.0, "review": "I purchased Amazon Fire TV recently as an early birthday gift for myself ! I immediately unpacked the Fire TV box and within 5 min or less, i was able to start browsing the vast library available to me..and as a Prime Member an additional selection. I found the box extremely easy to connect and the voice activated remote works just as perfect as explained. I am excited to spend my spare time filling my library with selections in between watching movies...Happy Birthday to me..a gift that will keep on giving to me and family.", "verified": true, "helpfulness": "0/0", "author": "Jim Yatman"}, {"rating": 5.0, "review": "VERY EASY TO USE I AM HAVING A LOT OF FUN WITH IT. I SHOULD SAY I AM 83 YRS YOUNG", "verified": true, "helpfulness": "1/1", "author": "Daniel C. Blicharz"}]