[{"rating": 5.0, "review": "We have an internet enabled DVD Player. However, it is two stories above our wireless router and it was prone to countless buffering when we used it. I just purchased the Amazon Fire Unit and this \"problem\" went away - seamless transmitting!  Further, the picture is really sharp. Thanks Jeff for a great product !", "verified": true, "helpfulness": "2/2", "author": "Dennis"}, {"rating": 5.0, "review": "I love listening to music with it, watching streamed movies with it. I tossed my PS-3; this is so much easier to work with...thinks more like me. I am quite eager for Amazon to add Slacker to the line-up of apps as there would be no skip limitations.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"For the honor & glory of God!\""}, {"rating": 4.0, "review": "This new toy is almost good, this is good just for the Amazon videos, but for the other APPs is too slow, when I try to launch NetFlix or Hulu it takes forever to load, sometimes it even kicks me out back to the homepage. I am sure there is a bug they have not figure out yet. I should've waited a little longer for this item.", "verified": true, "helpfulness": "1/2", "author": "Elpobre"}, {"rating": 5.0, "review": "I am not a big fan of 5 star reviews but I have not found anything wrong with this device.  I do use Amazon prime a lot and this has made watching prime very easy and fast. I was using a blue ray device before and it was slow and clunky. The Fire TV is so much better I could never go back to another device. I also have Roku and I do not have much bad to say about it but it is just slow and not as good as the Fire TV.  So if you watch a lot of TV with Amazon Prime this is a must.  We also use it for Pandora music and other apps and they all work faster and better with this device. I always like to find positive and negative with items I review but after many weeks of using this 3-8 hours a day (streaming Pandora music) I have nothing bad to say. Sorry but I give it 5 stars./", "verified": true, "helpfulness": "3/3", "author": "James F. Snider \"Jim\""}, {"rating": 5.0, "review": "My sweetheart bought this for me as a gift.  He knew I was excited when it was released for purchase.  I received my Amazon Fire TV on yesterday, went home, hooked it up and in 5 minutes it was movie time!  Loving the voice search - it even impressed my teenage niece and nephew.  My mother of 83 years is happy she can just say \"Tyler Perry\" and watch all his movies. I just convinced my friend/co-worker to purchase one.  Love it! Love it!  Get ready for the weekend baby!  Movies, popcorn and wine.", "verified": true, "helpfulness": "2/2", "author": "Brenda Jackson"}, {"rating": 5.0, "review": "Wow, over 2,600 reviews, hopefully I can make mine simple and persuasive on behalf of Amazon, as I just like dealing with Amazon!  If there is ever any doubt, we, the customers get the benefit of the doubt, their customer service is absolutely impeccable in every respect, but back to the review.  For me, this is absolutely a \"winner\" product.  I have been used to Sony and Samsung blu ray players and the sheer misery of continual long loading times and the never ending \"buffering\" which makes me so mad, I want to throw everything out the window, and I seriously cannot understand why these big manufacturers cannot provide a machine that can smoothing stream content without all the terrible buffering, and NO it's not my Internet connection, I proved that with the Fire TV!  Buffering problems is a thing of the past with the Fire TV.  I have used this for five days now, at least 10 movies at all times of the day, \"if that makes any difference\" and it's buffered ONE time, and it was so quick I almost did not even mention it.  The box and packing alone were just great engineering, and the unit itself is 4 1/2\" X 4 1/2 inches, tiny with a small light on the front that tells you when it's on and awake, the light pluses gently.  There is NO turn off, it does that for you.  The unit can be set to display the absolute most beautiful Slide Show you have ever seen, stunning high resolution photographs that I found myself actually watching for 15-20 minutes, wow, they are beautiful.  The menus and all features of this unit are wonderful, and I realize people say the voice activation is tailored to Amazon products, however, they will update that software, it's just a matter of time.  Not nearly enough has been said about the design of the remote control, it's small, and has a \"silky soft\" feel, like no remote I have ever held before, you want to hold it and play with it, because it feels so good to hold, crazy, I know, but when you get one, you will see what I am talking about.  The voice control is absolutely the very best, I use the heck out of it.  To be able to just pick up the remote and say Pandora, or whatever command, and it just goes there, puts the Fire TV in a class of it's own.  I did not think the voice control would be any big deal, but I can assure you it is!  I have never, and let me say that again, NEVER experienced such silky smooth, non interrupted streaming, pure quality, as I am experiencing with the Amazon Fire, it's wonderful, it works, I sit there and hold the remote control that is so ultimate user friendly and ponder, who could make such a cool looking, cool operating component and unlike the Roku, it has a GREAT optical audio out which I output right into my great little PS Audio Digital Link DAC, and  Pandora never sounded so good.  So, for me, it's Pandora during the day, and with one or two spoken words into the soft touchable remote, I'm watching flawless, great streaming Amazon Prime, Netflix or anything I want, it's just all soooooo good!  You will not be sorry you spent this $99 bucks, I can assure you!  I can only imagine how much fun I could have with the games and the controller, but I can buy that later, as I am really enjoying what this tiny box does correctly!!", "verified": false, "helpfulness": "3/3", "author": "LiteJazz"}, {"rating": 4.0, "review": "Let's see.  I have have the first apple tv, 2 later editions of apple tv and 2 roku boxes.  did I need to buy the fire TV?...no...but I did buy it and am enjoying it more than I had planned.  The fast processor and 2gb of ram make a huge difference.  The audio search function seems to work great (of course for only Amazon shows) and I love the algorithm that anticipates my viewing selection and starts programs much more quickly than any of the other streaming boxes.  I bought the game controlller and my kid has been using it on minecraft and I've been shooting aliens a bit, but it's not a priority for our family.If you have an apple TV I would go ahead and buy the Fire TV.  if you have roku...you already have a very capable box, so maybe Fire TV would be a waste of money.  If you don't have any streaming technology in the house...yeah...Fire TV is great.  In fact if you have little kids, it's a perfect addition to the tv they watch because of the parental controls availableI admit, I am kinda partial to Amazon and I like what they've done with Fire TV.  It's a way for them to have greater presence in the streaming game.", "verified": true, "helpfulness": "1/1", "author": "S. Still"}, {"rating": 4.0, "review": "We got this the day it came out and gave it to my boys for their room. They are enjoying it so far. I think not being able to shut it off is a little annoying but other then that it is great.", "verified": true, "helpfulness": "1/1", "author": "rockergirl15"}, {"rating": 3.0, "review": "My rating would go all the way up to 5 stars if it were easy to browse Prime content only.  I have the same issue with ROKU.  I've been a Prime member for years and consider it a great service, but the confused mixing of Prime content with paid content borders on bait and switch.", "verified": true, "helpfulness": "1/2", "author": "tom davis"}, {"rating": 2.0, "review": "I love my Prime subscription and immediately ordered the Fire and two controllers for the kids.  I hooked the Fire up last night effortlessly.  But there was a definite degradation in picture quality with computer (land line - not wifi) running into the fire instead of directly into the TV.  We get both Prime and Netflix and NF is treated as an App.  I had to sign in EM and PW each time.  I don't see anything it can do that my $500 LG TV can do better.  Will run past technical support ad update if they can advise.", "verified": true, "helpfulness": "3/6", "author": "G. Ross \"Library Mom\""}]