[{"rating": 2.0, "review": "I will be returning mine any moment now.This is the most overrated home TV device I have seen in years.  The interface is ugly and difficult to use - really, AppleTV does it better across the board, and Roku comes in after that.I have never been able to get the \"speak to search\" to work.  As soon as I try, it just cuts me off and tries to do a  search for NOTHING after it claims it listened to me.  This has been since Day One.  I gave up trying.The hardware specs are great here... but they do not matter if what you have is hard and ugly to use.  And FireTV's interface is both hard and ugly.Admittedly, I did not try any of the gaming, though I did hear great things about it.  I am not a gamer, so I just don't care.  I just wanted a TV streaming device that was easy to use.  I didn't get it, so I will stick with my AppleTV.It would have been better if Amazon didn't mix in the pay-per-view along with the Amazon Prime \"free\" video.  There should at least be a universal command limiting the display for Prime subscribers can see only what comes with Prime.The tile approach of the interface is ugly.  It is not very efficient except with the speed the interface zips along.  But given how it is designed, that means that you can very quickly see a whole bunch of things that you are not looking for.  The design of the search also disallows an easy search and search results.  Everything about the use of the FireTV was just annoying.", "verified": true, "helpfulness": "4/9", "author": "Christopher"}, {"rating": 1.0, "review": "Some of the really good channels found in Roku not found in this box.For example the popular Drama Fever channel which shows world famous Korean and other international drama / movies.", "verified": false, "helpfulness": "3/11", "author": "Sam"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "London"}, {"rating": 3.0, "review": "Starts off with a season, then want you to pay for the rest of the season.  Amazon fire works good, but the cost would be more than cable if you started paying for everything you wanted to watch on the system.", "verified": true, "helpfulness": "3/5", "author": "John Elya"}, {"rating": 5.0, "review": "i have had my fire tv for a while now, bought it when it first came out even when critics gave it some not so nice review/remarks. (most of the time if they said it sucks, its going to be good. not sure why they have a job as a critic when they are the once that suck.)i am able to go beyond what i thought this little box can do. took a lot of reading but at the end im very happy. with a few changes i was able to make it my own. i am glad to say i bought one more as the sale started. i thank amazon for a amazing box. may buy a 3rd one soon, price went back to $99, ill wait for it to go back on sale. love this little box.p.sA lot of guides out on the internet that help me change fire tv to be the way i like it.", "verified": false, "helpfulness": "0/0", "author": "Ezequiel Garcia"}, {"rating": 1.0, "review": "Enough advertising about this #$%$#t please,spamming the internet with it 24/7 is too much,i am not buying it.", "verified": false, "helpfulness": "1/19", "author": "A. abbass"}, {"rating": 5.0, "review": "This product is great and I have it. Amazon that chart need to be updated, Apple does have Showtime now...please fix.", "verified": true, "helpfulness": "1/1", "author": "H3li0$R@z3r"}, {"rating": 4.0, "review": "I have had a FireTV Stick for a while and recently picked up a FireTV box with the SlingTV offer. We stream TV and Movies with it. I don't play games on this device. My pros and cons:Pros:** Seems to run faster than my FireTV Stick and is a heck of a lot faster than the built-in apps on my Visio TV.** $50 with the SlingTV offer is a steal for what you get.** Optical out is a nice touch.** Comes with the voice search remote.Cons:** Voice search doesn't work well for me.** The device will not wake from sleep mode unlike my FireTV Stick.** Doesn't play media from a USB drive.** A QWERTY type keyboard might be nice.The only thing holding this device back from perfection is the ability to play media off of a USB source.", "verified": true, "helpfulness": "0/0", "author": "Doc1 \"doc\""}, {"rating": 1.0, "review": "Feel free to mark as \"not helpful\" if my concerns aren't your concerns, but I'm legitimately just using this review as a way to voice my distaste with their inability to provide HBOGO access. like... close but no cigar as this product would be absolutely pointless for me. It doesn't matter how 'fast or convenient' it is if it doesn't provide what it's competition does.", "verified": false, "helpfulness": "9/30", "author": "Thomas A. Wharton"}, {"rating": 4.0, "review": "Needs a headphone/earbud jack in the remote to be a total hit with me.", "verified": false, "helpfulness": "3/4", "author": "O. Dodge Jr. \"A Gamer.\""}]