[{"rating": 5.0, "review": "I own an Apple TV, Roku 3, Chromcast, and now the Amazon TV. Amazon is my go-to device now. It just seems faster and streams higher quality than the other devices.", "verified": true, "helpfulness": "0/0", "author": "M. Hincks"}, {"rating": 5.0, "review": "Love the Amazon Fire TV.  It has everything I want at the click of a button.  Best present ever.", "verified": true, "helpfulness": "0/0", "author": "Tabitha"}, {"rating": 3.0, "review": "It is confusing while ordering this item. It comes without a cable needed to hook it up to the TV in order for it to work. This should be evident when ordering.", "verified": true, "helpfulness": "0/0", "author": "Laura schmidt"}, {"rating": 3.0, "review": "I've found some movies that are fairly new but still behind what I anticipated.  I disconnected my movie channels on Directv so over time it will pay for itself.  Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Hess"}, {"rating": 5.0, "review": "Super fast! Netflix and Hulu typically had problems on our Wifi connection with the Wii. Shows would lag or stop, but after we installed the Fire TV we haven't had any issues.", "verified": true, "helpfulness": "0/0", "author": "John W Magee"}, {"rating": 4.0, "review": "Would like to have received printed instructions.", "verified": true, "helpfulness": "0/0", "author": "John C Schoppenhorst"}, {"rating": 5.0, "review": "Love this product. The voice option changed my life! No more frustrating search typing. And plenty of great movies free with Prime. Thank you AMAZON. Nice tutorial too.", "verified": true, "helpfulness": "0/0", "author": "Janet Simonson"}, {"rating": 5.0, "review": "Great Product. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Deborah S Schoengarth"}, {"rating": 5.0, "review": "I was getting bored with ordinary tv and was excited to find that Fire TV was available now that I have an HD TV.  I absolute love it.  It's easy to install and offers a whole new world of entertainment.  Thanks Amazon.  Again you're the best.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"rockymtnquilter\""}, {"rating": 2.0, "review": "The unit itself works great but I'm greatly disappointed by the lack of DLNA support.  My Western Digital TV Live played EVERYTHING I threw at it.  With this I have to use garbage apps like Plex that can barely play anything I throw at it.  But at the same time the WD unit has zero Prime support.  So I was hopping to be able to replace it with this.  Nope!  I have to use both.", "verified": true, "helpfulness": "1/4", "author": "J. Emlay"}]