[{"rating": 5.0, "review": "It was very easy to set up and use.  Husband likes the voice command option.  I think we will have many hours of entertainment.", "verified": true, "helpfulness": "1/1", "author": "Barbara J Van Loan"}, {"rating": 3.0, "review": "I have a question:  Can I watch Acorntv (a Brit streaming service of BBC and PBS productions)?  Does not appear so...thanks", "verified": false, "helpfulness": "1/2", "author": "Robb"}, {"rating": 5.0, "review": "Love it and all that it does. I've tried Apple TV in the past and the Amazon Fire TV is much faster!", "verified": true, "helpfulness": "1/1", "author": "AE"}, {"rating": 4.0, "review": "Heated towards prime, but other services are accessible", "verified": true, "helpfulness": "1/1", "author": "David M. Saalwaechter"}, {"rating": 5.0, "review": "Love it!!! You must have Amazon prime to get the best experience with this", "verified": true, "helpfulness": "1/1", "author": "Nikki"}, {"rating": 5.0, "review": "Bought this Dec 4th...  This was so, so ,so easy to set up & use.  I'm a prime member, which came already with my registration intact, & once signed in, my watch list was right there.  I  then downloaded Pandora & Tunein right away...  The talking into the remote worked like a charm which, again, is so eay to do & I was able to watch a movie in no time...  ~~All I needed was my cup of Hot Chocolate (with a marshmallow) and, I was ready for Christmas...", "verified": true, "helpfulness": "1/1", "author": "LMG"}, {"rating": 5.0, "review": "I would recommend this to all. I am cutting back on my cable/ satellite at the beginning of the year! The cost reduction will pay for Amazon in one month.", "verified": true, "helpfulness": "1/1", "author": "Brad R. Malugin \"BRM\""}, {"rating": 5.0, "review": "I am SO very happy with our Amazon Fire.  I paid extra for the voice controlled remote and I am glad I did!!  Sometimes you just don't know how to spell something, or you want to find it quickly.  I am surprised how well the voice recognition works!  With 3 kids it's hard to get everyone quiet in order to use it.  But a little bit of background noise seems to be OK.I didn't think we could be a family who could go without cable, but the Fire TV proves to me that we could.  With tons of apps we can watch just about anything.  The picture is crystal clear.  I love the Youtube app so we can watch videos as clearly as anything else on the Fire.I like that any movies I buy will forever be mine via Amazon.  Before the Fire TV we would buy movies on our cable's on demand service.  But it will all be wasted money when we leave our cable provider.  It also of course works perfectly with our Amazon Prime membership.  And if you think of all the free videos and shows from Prime, the monthly breakout of Prime's yearly cost is still cheaper than plans via Netflix or Hulu.  Definitely worth the investment.  Most of my Christmas shopping was done on Amazon.  I have friends whose packages still haven't arrived from major retailers despite \"arrive by\" guarantees.  ALL of my packages from Amazon Prime arrived in the 2 days.  Amazon, in my opinoin, is consistent and reliable.We love our Fire TV.  We plan to buy another for the TV in our bedroom because it will be way more beneficial than our cable's dvr in our room.  And much easier to use!", "verified": true, "helpfulness": "1/2", "author": "Mommygadgets \"Tricia S\""}, {"rating": 5.0, "review": "I like it!!!", "verified": true, "helpfulness": "1/1", "author": "Youssef boussalham"}, {"rating": 4.0, "review": "Easy set up and love the voice command. Would have like to see all my apps and games on there like my Kindle Fire HD 8.9. My Kindle version doesn't mirror and would enjoy the Fire TV more if it did wirelessly.", "verified": true, "helpfulness": "1/1", "author": "Stickman"}]