[{"rating": 5.0, "review": "Fantastic for finding new programing for kids (our #1 use is for the grandkids).  However, also provides movies and TV programing of all types, adult and for kids.  Easy to operate.  Works off our wifi signal.", "verified": true, "helpfulness": "0/0", "author": "L. Hornby"}, {"rating": 5.0, "review": "was a gift from my son. I have enjoyed it, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Charleah Day"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Roselyn I Heslep"}, {"rating": 5.0, "review": "What's not to like about it great picture, sound, love apps (sure they will expand with time) and a great price Amazon hits the nail on the head once again if you are a Prime member it's a must have!", "verified": true, "helpfulness": "0/0", "author": "MAD"}, {"rating": 5.0, "review": "Love it! Easy to set up and to use", "verified": true, "helpfulness": "0/0", "author": "Claudia Ackerman"}, {"rating": 4.0, "review": "Nice way to watch shows and movies i don't get", "verified": false, "helpfulness": "1/1", "author": "Dennis Doll"}, {"rating": 1.0, "review": "Half the time the remote doesn't work and I can't control the fire tv. I keep trying to restart it and I've tried putting new batteries in the remote and nothing works. I will have to get a new unit or go with a different brand", "verified": true, "helpfulness": "0/3", "author": "agg_12"}, {"rating": 5.0, "review": "I absolutely love my Fire TV. Works great I've had no problems at all with it. Hooking it up was a breeze and the voice search has worked flawless.", "verified": true, "helpfulness": "0/0", "author": "Darlene J. Moses \"Bargin hunter\""}, {"rating": 4.0, "review": "The Fire TV is so much faster than the Roku 3 I have. It may not have all of the same apps yet as a Roku, but it has the 2 most important, Netflix and Amazon Prime. Plus you can easily side load apps like Kodi/XBMC.", "verified": true, "helpfulness": "1/1", "author": "J. Bubb"}, {"rating": 5.0, "review": "Excellent. My family and I love it.", "verified": true, "helpfulness": "0/0", "author": "Gustavo Moran"}]