[{"rating": 4.0, "review": "Does it work outside the USA ?I'd like to buy one. The specs are amazing and the app are very good.Does any one know it ???", "verified": false, "helpfulness": "0/8", "author": "Andre Sousa Melo \"Andre Melo\""}, {"rating": 4.0, "review": "I don't even have one yet, as I have an older Roku 2XS that is fine for now, but I  MUST comment, after viewing the 'Comparison Chart', on the fact that Amazon Fire TV does not offer HBO GO with their gizmo! - That is a HUGE DealBreaker!!As many Billions of dollars all these tech companies have, I just wish they'd think of the Customers wishes, and quit fighting, & suing with each other! - JEEZE!! - This could be soooooo simple for us all, if they'd stop behaving like some kid who packs up his toys, goes home, and 'hoards' them so no one else can play without them being in control or involved directly!!", "verified": false, "helpfulness": "1/12", "author": "P. SHANE"}, {"rating": 3.0, "review": "I bought this to replace an aging Roku HD.  It is very sleek looking and the packaging is easy to open.  I was amazed when I first powered it on, because it was already configured for my Amazon Prime account.  Compared to Roku the Amazon Fire TV is biased towards Amazon Prime subscribers because its content is available from the home screen, but you need to install \"Apps\" to access other content such as Netflix or Crackle.  Roku was better this way because all content was installed as an \"App\" instead of giving any preference.  Roku's Netflix channel also \"looks\" better than Amazon Fire TV's Netflix channel, because the movie titles scale a lot bigger on the TV.I was disappointed that the Voice Search function only works for searching Amazon Apps or Prime content, but it doesn't work for other apps such as Netflix, it is text-only.  Another feature I would like is a menu for your favorite apps.  With all the apps you can install you really need a place to organize your favorite or most used apps, such as Netflix, Hulu and Crackle.  Without this all your apps look like an unorganized mess.Beware Amazon Fire TV doesn't replace an Xbox 360.  Xbox 360 also has installable apps (Netflix and Amazon Prime) and you can access most of them without an Xbox Live Gold account and it plays some great 3D next-gen games.  Amazon Fire TV games are comparable to using an android tablet with a quad-core CPU over an Xbox 360.  Think about this before you go diving head first into buying an Amazon Fire TV.", "verified": true, "helpfulness": "2/5", "author": "Dylan \"Dylan\""}, {"rating": 3.0, "review": "I just set up my Amazon Fire TV.  I needed it because Amazon streaming wouldn't work with my 3 year old Apple TV.The picture is great and I like the voice search feature.  Setting up was easy.One thing is missing from the Fire TV that is important in this day and age.  Fire TV doesn't have an on/off switch.  After 30 minutes of non use it goes into standby mode which is still a power using mode.  The only fix according to my Amazon phone rep is to unplug the power cord.This is a modern world we live in and Amazon has been in the vanguard of new products but they missed big time on this.To be fair to our environment we must use less power, yet  the Fire TV is always on.I unplugged my power cord since I don't use Fire TV on a daily basis but it's a primitive fix.SHAME ON AMAZON for not having a power switch on the remote.", "verified": true, "helpfulness": "2/5", "author": "Patrick Regan"}, {"rating": 2.0, "review": "The concept is great. Very few useful apps, and many of the apps won't work. We have Prime and the Fire will often times refuse to play videos that the computer has no issue playing. The search function is a great idea, but it doesn't work all that well. I absolutely regret purchasing this and I wish I would have gone with a Roku. Very disappointing!", "verified": true, "helpfulness": "2/4", "author": "Jeff Elston"}, {"rating": 3.0, "review": "this thing was very easy to set up and get going.  thats where easy stopped.  it came with no instructions  its a hunt peck try to find out how to operate it.  the voice command works well  but the one month free amazon prime is wasted because amazon prime is difficult to navigate because i like to look for the free movies and stuff and can't find them.  there should be a way to search them.  maybe there is and if there were instuctions you might find  a way to accomplish what i was wishing.  Add to the fact the week after i bought this amazon dropped the price 15 dollars  makes me an unhappy camper.", "verified": true, "helpfulness": "0/5", "author": "T. Hawkes"}, {"rating": 5.0, "review": "Great product, works as described.  I would buy again.  If you don't have an gaming console available, this is the next best thing to stream stuff. Prime, Netflix, Hulu, VEVO, etc all works like a dream.  Setup was a breeze and it just works.  One minor flaw, I hope they add HBO:GO to the available services.", "verified": true, "helpfulness": "3/3", "author": "bnb"}, {"rating": 2.0, "review": "Be careful this device will not provide content in Costa Rica. Prime free content is not avaliable due to geographic restrictions to Costa Rica. The Amazon customer service knew of no plan for the content to ever be avaliable in Costa Rica.", "verified": false, "helpfulness": "0/7", "author": "Robert Knight"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "1/3", "author": "R. G \"Spiralwave\""}, {"rating": 3.0, "review": "Pros:Fast quality hardwareSupports sideloadingSmall and discreet.Remote was smaller than I thoughtRemote is blue tooth. You don't have to aim at the box to use the remote.Cons:No way to play videos off USB. Not even support to have the USB drive seen in other programs.Home screen is cluttered with videos for you to purchase. It doesn't display your content, but more of a massive unorganized ad. Has way too many menus that show the same thing.Remote is smaller than I thoughtNo web browser (for hotels that require webpage login)If Amazon put out an update to support connecting USB storage, I would update my review to 4 starsIf Amazon updated to support USB storage, and put a simple web browser, 5 stars.", "verified": true, "helpfulness": "2/2", "author": "T. M. Hunt"}]