[{"rating": 5.0, "review": "Well, I am overall happy with my Fire TV. I don't have a Roku to compare it to but I do have an AppleTV and can say the overall quality beats the AppleTV.Set up was simple but of course there is the annoying updates which you have to take immediately, plus the doofy video at the beginning, telling you how to use the thing. After you get past this, the unit is very nice.I found the navigation to be easy to use but will agree with another reviewer that I wish there was an option to see all prime videos and TV shows.The video quality is excellent. It does load much faster than the other Amazon video offerings on the other platforms.Netflix ran well also, no problem there. Actually I felt it ran much better on the FireTV than on AppleTV.I saw no noticeable lag when switching screens or videos, the quad core processor is obviously pretty zippy. I can't comment on the music side of things as I have not used it for music. It did however find all my photos in the cloud and you can use them as your screensaver.Apps and game wise, I was impressed. I don't think the PS4 or One have anything to worry about, but that being said if you are just looking for some lighter games, nothing really hard core, it works fine. Asphalt 8 ran beautifully, and I am looking forward to getting my controller next week.The apps and games are supposed to increase in the coming weeks, so I will like to see what else comes out on the Fire TV. For those wanting a particular TV service (all you HBO people), I would bet this would be coming soon.Bottom line, I think it's a good little box. If I already had a Roku, would I need it? Not really. But if you are looking for a streamer for Amazon videos, I think this is the best you will find.", "verified": true, "helpfulness": "5/7", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I received my Fire TV a few hours ago.  If my opinions change, I'll update the review.o Packaging:  Not something I'd normally mention.  But, the packaging on the Fire TV was very nice & made a good first impression.o Setup:  Very fast & easy.  When the message came up that a software update was needed, I left the room for 5-10 minutes.  When I came back, it was done.  I don't know how long the update took, but no more than 10 minutes and that includes any introductory video that might have played.o Buffering:  There have been NO buffering messages.  So far, I've used Showtime Anytime, Amazon, and Netflix.  All started and played without delays.  The Fire TV is replacing a Roku 2 that had constant buffering delays on Netflix.  (Both the Roku 2 & Amazon TV are on a wireline connection.)o Home Screen:  Amazon is definitely front & center.  I thought this might bother me.  But, Netflix & Showtime are at the top of the screen.  There's no need to scroll through screens of Amazon content to bring them up.  So, I'm satisfied.o App Install:  Showtime Anytime had to be installed.  Installing and activating it took less than five minutes.  Not all cable providers are available (hopefully they'll be adding more!).  I'm a FiOS subscriber, and it's on the list.o Search:  I've done a few voice searches, and it worked great.  I do wish that search wasn't limited to Amazon content!  The show I searched for was available to rent on Amazon, but was included on Netflix.  So, the thing to do is search other content before purchasing/renting from Amazon.  It's unfortunate that this manual step is necessary.  When items are returned, Fire TV should at least make it clear that ONLY Amazon content was searched & displayed.o Content Display Speed:  It's at least as fast as the Roku (I have both a 2 & 3) when it comes to Netflix.  Maybe a bit faster.  When it comes to Amazon content, it is turbo charged!o Picture Quality:  I've got Fire TV on my bedroom TV for now.  It's a relatively old 37\" 720p Vizio.  The picture quality while streaming is excellent.  FAR superior to the Roku 2 that was on this TV.o Volume:  I've used some streaming devices where the volume came in very low.  Not so w/ Fire TV.  I'm using the TV speakers at about 25%.o Remote:  It's a nice little remote.  Good functionality & feel.  It'd be nice if the buttons were visible in the dark.  But, there are so few of them that it'll probably be easy to memorize them & operate by feel in a dark room.o Screensaver:  It's a minor thing.  But, I'd much rather have beautiful pictures come up in screensaver mode than the device name moving across the screen.  So, I like the screensaver on the Fire.I don't get where all the hate & bad reviews are coming from.  I've got two newer smart TVs, a couple of Tivo Premiers, a Roku 2, a Roku 3, and three blu ray players.  I've used all these devices for streaming, and they've all got their pros and cons.  (Well, except the blu ray players - no pros there!)  From my POV the Fire TV is the same class as the Roku 3.  If, like me, you're a Prime member who consumes Amazon Instant Video, the Fire TV is probably the better choice.  However, if I wasn't a Prime member, I'd go for the Roku 3.Even though I'm loving the Fire TV, it's going to stay with the bedroom TV (rather than one of the big screen TVs) due to the lack of HBO Go.  HBO Go is a miss on Amazon's part, and I hope they'll add it soon.  I knew it wasn't available on the device, so not complaining about it.I haven't tried any games on the Fire TV yet because none of the games currently offered appeal to me.", "verified": true, "helpfulness": "15/17", "author": "Nina \"nal001\""}, {"rating": 1.0, "review": "Doesn't include HDMI cable. Give me what I need to make it work out of the box. Ridiculous. Should have just went with the Roku.", "verified": true, "helpfulness": "15/91", "author": "The Mayor"}, {"rating": 5.0, "review": "My family has been streaming videos from Amazon for several years using a Sony Blu-ray player that had the Amazon instant video preloaded. Playing movies was a 4 step process that took an additional 30-45 seconds for movies to buffer prior to playing. We also have the newest Roku device, which is far better than the old Blu-Ray player, but doesn't hold a candle to the new Fire TV that we received today. This device is superbly designed and engineered - oozes quality!  It took me less than 5 minutes to set it up, is unbelievably fast, and super easy to use - absolutely perfect!", "verified": true, "helpfulness": "1/1", "author": "Michael D. Erwin"}, {"rating": 2.0, "review": "Pros:So far, the only benefits over the competition are the processor and memory.  It is an improvement over Smart TVs, the latest roku, apple TV, google chromecast, wii, ps3, and xbox360.  It is not however better than Wii U, PS4, or microsoft's latest gaming device.As you can merely plug in a computer into your TV, these devices are just a convenience.  Fire TV is of course cheaper than the alternatives that can match its specs, but it is also the latest addition to the market.Unfortunately for Amazon, Apple TV is still the best TV enhancing device on the market.  Apps and interaction with mobile devices is neat but none of these devices let you watch Hulu without subscribing to Hulu Plus or use countless computer features every device should support.  Apple's airplay and screen sharing is limited from PCs and mobile devices (ipad included) but with a Mac OS, the Apple TV can actually accomplish the tasks you can simply do by plugging your laptop into a TV including watch hulu, crunchyroll, and share any file your computer can handle.  I'm not an apple fan, but can't deny how much more useful those features are.It does have pandora.  You would need an apple device to airplay pandora music through apple TV.  Though music matters less as surround sound and sound bars can use bluetooth.This isn't xbox one and you don't have to pay $60 a year to watch netflix on top of your netflix subscription.Cons:Fire TV does not include google play or itunes music/moves but each company is exclusive against the competition.Plex is the only way to have any computer interaction.  (apple ecosystem where you buy lots of apple devices/using itunes or just plugging an hdmi chord to your computer are frustratingly the only alternatives)I understand that this is a device for convenience and those without computers/video game consoles or who can't use them well.  Everyone has a computer though so would grandparents be the market share this grows into? It is hard to imagine widespread use of netflix, amazon instant, google play, or apple itunes, but retirement homes did purchase the Nintendo Wii so anything is possible.  This fire tv, apple tv, or roku would be fine.  The voice search with only amazon results not limited to free prime shows does seem like a terrible hurdle though.  Half the battle is with Amazon instant which gives prime users headaches trying to figure out what is free.  It took me near a month to figure out how to use my Amazon Prime video streaming in a web browser!  Amazon Instant mixes netflix's subscription model with the Itunes rent/purchase model and does neither quite so well.  Streaming video can be frustrating when properly navigated with everything they do not have or require you to pay for.Google Chromecast and Amazon Fire TV appear a bit late to the party and in no way replace existing TV enhancing devices.  Most of them support 1080p already. Short of major software developments/improved computer interaction i expect both to be eclipsed by Apple TV's next version.  If you don't want to fork your money over to Apple, plug straight in with a computer.I guess Amazon Fire TV, PS4, or Wii U are the next best thing but if you're anything like me, their limitations will frustrate you beyond repair.", "verified": false, "helpfulness": "6/17", "author": "mugiwaraboushi"}, {"rating": 1.0, "review": "As soon as I plugged it in, it wanted to update it software.It sits for a couple of minutes doing lots of network traffic (I can see the lights on my Ethernet switch and DSL modem) then stops saying the update has failed and I should unplug it and try again.  So, I do.  Same thing. I'm on the 5th cycle, and the progress bar when it's downloading is about 10%. So, it gets a little and then gives up.What a piece of crap.", "verified": true, "helpfulness": "18/43", "author": "MBS"}, {"rating": 5.0, "review": "I'm surprised by all the negative reviews mentioning set up problems. I was able to plug it into the TV, download updates, install updates and watch the intro video in about 12-15 minutes time.  Maybe a better wi-fi connection will help anyone with a problem.  As for watching Prime videos or YouTube, etc., the little box was great and video was not choppy or lagging.  I moved my Chromecast to the living room and will keep the Amazon Fire TV in my bedroom where I watch the most TV.  The voice recognition is incredibly responsive and understood my mumbles without a hitch.  This is my new favorite toy!", "verified": true, "helpfulness": "2/2", "author": "M. SOLANO \"j.xavier's mom\""}, {"rating": 3.0, "review": "I have a Roku & Apple TV.  I am a Amazon Prime user and watch a lot of the Prime movies on Roku.  I also watch HBO GO and MLBTV everyday my team is playing.  Hardware upgrades are useless without the channel selection.", "verified": false, "helpfulness": "2/2", "author": "Steven Brown"}, {"rating": 5.0, "review": "I'm going to add onto this review but I just wanted to get a quick 2 cents in on some of the negative \"reviews.\"I've seen at least a third of the negative \"reviews\" are from people that haven't purchased one but are griping because it is not available in lower Ducktopia!Have you ever noticed that electronic devices such as cell phones, radios, TV's, computers, and on and on are not released everywhere at once?  The regulatory agencies in every country are different and have different requirements.  That is especially true of an item like this that has media from multiple other vendors that in themselves are subject to regulation.  The US is Amazon's largest market so of course they release here first.Unlike many of you I actually purchased the product and as I said I will have a full review soon but I have to scoot.  I've had mine for all of about two hours but I have found it easy to set up and use and for a product that was just released two days ago it has a terrific amount of programming.  And more on the way.  One huge surprise was that many of the apps offered on this were already in the \"my apps\" section because I own them for my Kindle Fire HDX.  They downloaded without any new charges and with no issues.  Pandora has the cleanest sound of any of my devices.More later.  Mirrorcast works excellently also!  I had fun playing a few minutes of Pants vs Zombies on both screens!", "verified": true, "helpfulness": "22/24", "author": "Artist formerly known as Amazon Customer \"gherman22\""}, {"rating": 5.0, "review": "I was really surprised as to the ease of use and set-up, Look out Apple, Amazon has a real winner", "verified": true, "helpfulness": "1/1", "author": "Alex J. Wilkas"}]