[{"rating": 4.0, "review": "It's a nearly perfect upgrade from our Roku3. Great in many ways such as the game options, services, and other features.My rating would be 5 stars if the voice search worked in each service instead of just for Amazon Video and if it was easier to search and find the Amazon Prime Instant Video. On the Roku, you can look at Prime only Instant Video without having to sort through TV and movies that have a rental or purchase fee. That would make it amazing. As it is, it's pretty great.", "verified": true, "helpfulness": "1/1", "author": "Brett \"Writer, actor, improviser, and family man working as a content writer/editor in a SaaS Marketing Department.\""}, {"rating": 1.0, "review": "As an Amazon Prime member and long-time cord cutter, I was really excited about Amazon entering the top set market. However, after two weeks of use, I'm pulling the plug on Fire TV and putting it up the old Roku 2 box.Pros:-Voice Search, but... (see cons)-Responsive interfaceCons:-Voice Search is very, very pushy about Amazon content-It is very hard to tell what is Amazon Prime (included content) and pay for content-Weird video/audio synchronization on Hulu Plus, Plex and Smithsonian channels-No access to Google Play store, I had to re-purchase Plex through Amazon store-No PBS channel (available for free on Roku, but many programs are for purchase through Amazon)", "verified": true, "helpfulness": "12/24", "author": "R. Ragan"}, {"rating": 3.0, "review": "I bought this device primarily to watch prime member video on my big screen.  Installation was seamless and the picture is great.  Unfortunately they chose to use blue tooth connectivity and that means the remote is not compatible with my Harmony 900 universal remote.  Not the best situation.  It seems as though Amazon could have cut a deal with Apple to add their functionality to Apple TV.  A device I already have.", "verified": true, "helpfulness": "0/5", "author": "Motonut"}, {"rating": 5.0, "review": "I brought one just out of curiosity. It is very easy to set up, just plug in two cables(one power cord, one HDMI to TV), turn on my TV and follow the instruction on the screen and key in my wireless internet key, and that's it. It directs me the my amazon instant video website and I start selecting and watching my favorite shows. It is very fast and pictures are in high definition. I have a google dongle and It took me quite some time to set up and slow, that is the major reason I stop using it. Things I don't like about Fire TV? I still have to pay to watch the show!!!", "verified": true, "helpfulness": "0/0", "author": "P. Lu \"micekiller\""}, {"rating": 5.0, "review": "I bought this to replace a Sony Blu ray which worked, but was slow to boot up, slow to load stuff, and super slow to FF or RR stuff.  The purpose of this box was to improve speed and functionality. The box is super small and light, and absolutely does it what says it will do in terms of speed. It either turns itself off or goes into a sleep mode, it wakes up instantly, and it loads video much faster than my old box. FF and RR are also much faster to load than my blu ray, yes, there is SOME delay, but it's a big improvement. Menus are nice.", "verified": true, "helpfulness": "0/0", "author": "The Kurgan"}, {"rating": 5.0, "review": "I like the picture quality and the speed. It is a little short on apps though. I think it makes a good companion to my Roku.  Hopefully it will replace the Roku but not yet. Because YouTube is not available on Roku and the movies I have watched on my Amazon Fire seem to be full High Depth I am happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "M.C.Edwards"}, {"rating": 5.0, "review": "The AmazonFire TV is just as great as advertised. Easy to set up and install. The only difficulty was getting to my surge protector to plug it in.The packaging is what I was mesmerized by. Elegant, simple and deserves an award all on its own. Lovely.", "verified": true, "helpfulness": "0/0", "author": "Jill Campbell"}, {"rating": 4.0, "review": "Most movies and shows I want to watch cost...and a lot of Netflix is not available streaming - only on dvd.", "verified": true, "helpfulness": "1/5", "author": "Mary Jo Brady"}, {"rating": 5.0, "review": "Simple to install and operate.  If you use an Android phone you can use the remote control.  The voice search is fantastic, so far it hasn't had a problem with any search.  My young daughter likes it because she doesn't have to figure out how to spell something in order to search for it.Out of the box it was configured to easily use Amazon Prime video.  Took a few minutes to install Netflix and HuluPlus and the interface is simple and seamless.  So far this makes my cable television pretty much redundant.The games are fun and the game controller works well.  Being Blue-Tooth controllers they work even is there is no line-of-site to the box, which is a nice feature.If you have Prime, you need Fire TV!!", "verified": true, "helpfulness": "0/0", "author": "George Neblina"}, {"rating": 3.0, "review": "Seems like most of the movies are needed to be either rented or bought which costs more money.It was easy to hook up.", "verified": true, "helpfulness": "1/4", "author": "Leron"}]