[{"rating": 5.0, "review": "I got this as a Christmas present for my husband. It is great for days like today where we iced in. No need to to travel to the redbox.", "verified": true, "helpfulness": "0/0", "author": "Elisha Abbott"}, {"rating": 4.0, "review": "Working out very well.  I've enjoyed it very much.", "verified": true, "helpfulness": "0/0", "author": "Kenneth R Lawrence"}, {"rating": 3.0, "review": "Lots of movies and TV show to watch but you have to pay for everything.  Can't find anything that is actually FREE like amazon advertises.  Not sure I'll keep the membership after my year is up.", "verified": true, "helpfulness": "0/2", "author": "JBA"}, {"rating": 5.0, "review": "For me, this is the beginning of the divorce--from cable and satellite, not to mention high fees. I'm already an Amazon Prime member, and that alone is huge. Add Netflix and a couple others at a minimal cost, and I've got nearly everything I need. I don't have a super-fast Internet connection--just DSL--but everything streams seamlessly and with perfect quality (at least as perfect as I need). Amazon Fire TV is a hit!", "verified": true, "helpfulness": "0/0", "author": "Crilly Butler"}, {"rating": 5.0, "review": "I'm canceling comcast...its that good.", "verified": true, "helpfulness": "0/0", "author": "Shiikit \"tshiiki\""}, {"rating": 5.0, "review": "Well, I had no idea we had to pay extra fees for the service on top of buying the unit.", "verified": true, "helpfulness": "0/0", "author": "Irene Rosendale"}, {"rating": 5.0, "review": "Easy to install..... Plenty to enjoy!", "verified": true, "helpfulness": "0/0", "author": "Christine Trubia"}, {"rating": 3.0, "review": "Its not so much about the product but the selection is limited and the movies to buy are expensive.", "verified": true, "helpfulness": "0/0", "author": "Miranda Kuper"}, {"rating": 4.0, "review": "I have multiple Rokus in use (from the newest to the oldest) and one Apple TV. The Fire surpasses Apple TV in ease of use and channel selection. (As far as I'm concerned, the only reason to have Apple TV is for AirPlay.) However, I find the remote control and the general \"flow\" of the Roku to be more intuitive. That MAY simply be because I'm more familiar with it.... There are fewer steps involved in getting me from one place to the next with Roku. (Apple is the worst.)  Another thing to consider: I was quite curious to try the voice command option on the Fire. Alas it only works with Amazon Prime—understandable—but if the show I want to watch isn't on Prime, it's a non-starter. And a lot of the shows I'm looking for are not on Prime.Would I recommend? Mostly yes. Unless you already have multiple streamers. It's a good solid machine with a couple of neat features, but it doesn't beat Roku. Yet.", "verified": true, "helpfulness": "1/1", "author": "MissQuotable"}, {"rating": 5.0, "review": "Best thing ever", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]