[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Janet Sieracki"}, {"rating": 5.0, "review": "It takes a lot of  band width to watch a show and I have trouble with my internet provider. So for me it not that great. Contacted tech support and they walked me thru some trouble shooting and so far it is working better.", "verified": true, "helpfulness": "0/0", "author": "Wayne Short"}, {"rating": 4.0, "review": "This is a very nice product.  Having used Apple TV for so many years, getting used to the different setup on Fire TV took a little time, but very much worth the effort.  I am still exploring some of the features but so far I am quite satisfied.", "verified": true, "helpfulness": "0/0", "author": "wsteps"}, {"rating": 4.0, "review": "We just received our Fire TV the other day and so far it works great.  The voice search feature is way beyond anything else I use.  I am somewhat disappointed that many of the movies I'd like to view comes with a price.  Something I didn't expect at all, but then again that isn't a problem with Fire TV is it?  Ha Ha  I will recommend Fire TV to friends.", "verified": true, "helpfulness": "0/0", "author": "Harry \"Harry Johnson\""}, {"rating": 5.0, "review": "After purchasing Amazon Prime, I found out my two year old Smart TV wasn't so smart.  It didn't have the Prime app. included.  I couldn't take full advantage of the Amazon Prime on my TV.  I was so looking forward to watching all the exciting movies and shows but nothing worked.  I was left with no other choice but to purchase the Amazon Fire TV.  I absolutely love it.  I'm glad I upgraded.  The Voice activation is a plus.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome !  Goodbye Apple TV .", "verified": true, "helpfulness": "0/0", "author": "Charlene Calise"}, {"rating": 5.0, "review": "thousands of movies to watch for a low price of amazon prime ...", "verified": true, "helpfulness": "0/0", "author": "D. Duke \"spencer\""}, {"rating": 1.0, "review": "Nothing on your TV I watch.  Sorry returned it.", "verified": true, "helpfulness": "1/4", "author": "Josiah"}, {"rating": 5.0, "review": "Better than I thought!", "verified": true, "helpfulness": "0/0", "author": "Marisa Bella"}]