[{"rating": 4.0, "review": "I love the Amazon Fire my only issue is the small size of the hard drive, if we the Amazon Fire had the capability to utilize an external harddrive or access to a network drive would make it perfect.", "verified": true, "helpfulness": "0/0", "author": "Michael Pollard"}, {"rating": 5.0, "review": "I can not believe how much you can do with this device. If you have any kids or adults you can do a lot of things.", "verified": true, "helpfulness": "0/0", "author": "Michael T Iocca"}, {"rating": 3.0, "review": "It's Really a nice machine, but I really dislike the fact that I can't connect with my NAS. To me that is the thing that keeps it from a 5 star product.", "verified": true, "helpfulness": "0/0", "author": "James W Terrell"}, {"rating": 2.0, "review": "I give it 2 stars only because I live in Trinidad and Tobago and cannot access the prime content along with other apps..I am only able to utilize Netflix. ..if I had known this/if the merchants from where I purchased the fire tv had told me this(telling myself they should of been aware of this)I would of gone with my first choice of a wifi bluray player. ..even after becoming a prime amazon trial holder..I am still not able to view movies because of geographical reasons...sooooI would not recommend for Caribbean folks..Now I see other boxes that apparently give more free content than the fire tv..Amazon...cant yall do anything about this...after paying so much..with high hopes of cutting my cable...now to be sooooooo sorely dissatisfied. ..and disappointed. .", "verified": true, "helpfulness": "0/0", "author": "keisha noel"}, {"rating": 4.0, "review": "Good device, really needs HBO Go though", "verified": false, "helpfulness": "0/0", "author": "Matthew Michels"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "IT-SolutionsNYC"}, {"rating": 4.0, "review": "Was easy to set up but should have instruction for resetting the system.  Other than that it works wonderfully and I am very glad I indulged myself!", "verified": true, "helpfulness": "0/0", "author": "Stacy A Sullivan"}, {"rating": 5.0, "review": "Super easy set up. Super easy to us. Great features. Great functionality. Couldn't love it more...", "verified": true, "helpfulness": "0/0", "author": "Diane Hooker"}, {"rating": 1.0, "review": "It's awesome, except it doesnt read hdd.", "verified": true, "helpfulness": "0/1", "author": "Lucas Riveros"}, {"rating": 1.0, "review": "No easy way to access side loaded apps!", "verified": true, "helpfulness": "0/1", "author": "Tuck"}]