[{"rating": 4.0, "review": "System works very well.  I  have found access to every movie i've searched for  but most recent movies are either for rent or sale.  Those on amazon instant video are free to view with Amazon Prime but they are primarily old movies.  Think I can still justify Netflix with the number of movies I would have to rent.The voice search is amazing and the wifi it added to my bedroom tv let me finally connect it to the net.  Strong wifi in an area that had been marginal connection previously.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Francis"}, {"rating": 5.0, "review": "Amazing voice search feature.", "verified": true, "helpfulness": "0/0", "author": "uccbill"}, {"rating": 5.0, "review": "Absolutely what I was looking for!  I also love that I have access to my amazon music on it too! Very easy to use, small and sleek so i don't feel like I have yet another piece of equipment cluttered by the Television.  I can't get enough of of it.", "verified": true, "helpfulness": "0/0", "author": "Jilda"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kathy carrillo"}, {"rating": 4.0, "review": "it did what it claimed it would without drama, brilliant", "verified": true, "helpfulness": "0/0", "author": "ksh"}, {"rating": 5.0, "review": "Best item I purchased in a while. Super easy to set up, gets great service / connection. I will be canceling all my pay cable channels soon, all the movies and TV choices you could ask for highly recommend. No issues no problems", "verified": true, "helpfulness": "0/0", "author": "2Big Mutts"}, {"rating": 4.0, "review": "Very easy to set up and learn how to use.  Everything I've tried so far works well.  The only issue I've had is that sometimes it can't find my tablet to display on the TV, but that may have more to do with my Wi-Fi signal.", "verified": true, "helpfulness": "0/1", "author": "J. Young"}, {"rating": 5.0, "review": "Quick play time is great , 5.1 output options optical out and the hdmi cable still provides sound to tv , Netflix works great . The voice search get most of what I'm looking for but always goes back to amazon .I've only had the box for about a weekRobert", "verified": true, "helpfulness": "0/0", "author": "Robert skinner"}, {"rating": 5.0, "review": "Going to stop my tv .....its that good", "verified": true, "helpfulness": "0/0", "author": "frank hamon"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Chris Snyder"}]