[{"rating": 5.0, "review": "Amazon Got It Right AGAIN!  I have been complaining about having to watch my Amazon Prime movies and TV on my laptop or pull out the HDMI cable to connect it to my TV.  Now life is much less complicated.  Thank goodness.  It was easy to set up and I LOVE the Voice Search feature.  If you don't already have an HDMI cable don't forget to purchase one from Amazon. They have an inhouse brand (Amazon Basics) in various sizes that work as good as any HDMI cable on the market for a much more reasonable price when compared to Best Buy, Wal-mart etc.You will not regret this purchase if you really are a heavy Prime Movie or TV viewing.  The search feature along makes it worth the price.", "verified": true, "helpfulness": "6/6", "author": "R. Patterson"}, {"rating": 5.0, "review": "More powerful than the ouya and has a pretty tight ecosystem for apps to go along with it.Really nice.", "verified": true, "helpfulness": "3/3", "author": "N. Golden \"Ngolden\""}, {"rating": 1.0, "review": "This is the most disappointing product I have ever ordered from Amazon.  First, they fail to tell you that you must purchase an additional HDMI cable to set the device up.  Second, it failed, unlike the Samsung Blue-Ray DVD player we use to stream Netflix on another TV, to maintain a constant signal.  A show or movie would display for 1-2 minutes, stop, and \"downloading\" would repeatedly appear on the screen.Finally, Amazon says it will issue a full refund if the device is returned within 30 days (I did so within 3), they don't mention that YOU are responsible for the expense....All in all, spend less on a DVD player that connects to your wireless router.  You also gain a Blue-Ray DVD player!TO'B", "verified": true, "helpfulness": "11/42", "author": "TO'B"}, {"rating": 4.0, "review": "Solid streamer so far... voice search excellent and Amazon Prime works perfectly.  No ability to search across Netflix, Hulu or Plex on the home screen.... so it just searches Amazon via voice search.  You can do traditional searches within the apps as you normally would.Netflix layout the same as all other streaming devices and no improvement in performance.  Runs just like a Roku.  Same for Hulu.  So a bit of a blah.  I'd like to have movies or shows started to pop up on the \"Recent\" section instead of just \"Netflix\" or the apps I used, actually show the Movie I was watching.Plex support is one of the reasons I rushed to buy the box.  However, it --incredibly-- can't handle some HD content that plays fine through my Samsung Smart TV plex app.  That's unbelievable really.  I expected more from the Plex app.  I will say it did find my Plex server right off the bat and functions like the Plex app on a tablet (which it is, for the most part).Some glaring omissions when it comes to apps:  NO MLB.tv.  No Slacker radio.  I always need: Amazon, Netflix, Hulu, Plex (or XBMC) and MLB for my TV.  So close but surprised about MLB.But a nice little box.  I hope the ability to sideload comes soon, as well as improvements on Plex (including 5.1 audio).  I would love to be able to load XBMC on it...", "verified": true, "helpfulness": "2/2", "author": "Steve-O"}, {"rating": 5.0, "review": "The Fire TV was simple and easy to setup up.  Once connected to the network it quickly upgraded the software, and worked without issue.  Streaming of movies was easy and the user interface very responsive.  The Sub Zero game that comes with the system was addictive.  My son and daughter have taken over the Fire TV playing Sub Zero.  He uses the controller while she supports from a Kindle Fire HD tablet.  They are having so much fun that they asked me to leave the Wii disconnected and leave the Fire TV connected in its place.They are really looking forward to other hybrid experiences where one used the tablet and the other the Fire TV to play together.  They really like the dual role experience that the Fire TV is giving them.  Instead of competing they are collaborating together and loving it.", "verified": true, "helpfulness": "2/2", "author": "Stephen"}, {"rating": 5.0, "review": "I have been using a Logitech Revue since it came out years ago. Of course Logitech stopped supporting this device, and it slowed down way too much to use. So it was time for a change!Now I'm on the Kindle Fire TV, and I love everything about it so far... Main thing is I just found out a way to make the Harmony Remote to be supported. See the information below!I found out a way to make the Harmony work with the Kindle Fire TV!! Only problem is it requires a separate purchase. Witch I am ok with. I am listing a link to the guide and the product. [...]Here is the product. Ortek Windows 7 Vista XP Media Center MCE PC Remote Control and Infrared Receiver for Home, Premium and Ultimate Edition", "verified": true, "helpfulness": "4/5", "author": "Nicholas A Young"}, {"rating": 5.0, "review": "So first thing that went wrong was that UPS delayed my delivery so I got it on Monday instead of on Friday. Bummer. Then it took me, I swear, fifteen minutes to get all the boxes and packaging stuff off it so I could actually get to use it. It took a couple minutes to get the remote open to put in the batteries.Then I plugged it in,hooked it up. Three updates that it ran through all by itself, with restarts in between. Then the animated start video. Goofy but to the point.I haven't had cable for years. I have an antenna for local shows and Amazon Prime for videos. Sometimes I subscribe to Netflix fo a month if I want to binge watch something. I have been looking for something easy to use. PS3 works pretty well. Chromecast I really didn't get into, not what I need. Sony BluRay player with apps is ok but not seamless.Kindle Fire TV is seamless, easy, everything that I wanted. The number of different places I can access content for free (Flixster, Crackle, YouTube,Plex) is pretty awesome. I find the remote really easy to use. Mirroring my Kindle fire HDX works so easily.I haven't used my HDX as a second screen yet because I haven't has time. I am really looking forward to being able to stream my Amazon Music when that comes available.This device is small enough to move back and forth between the TV in the living room and the one in the bedroom but I am tempted to just get a second one. I really love it.For the record, I am a 60 year old but not quite the granny type. More of a collector of gizmos and gadgets and fan of new technology.", "verified": true, "helpfulness": "3/3", "author": "Carry Moonbeam \"Ridin' on the Cookie Train\""}, {"rating": 4.0, "review": "So, I’ve decided to keep the FireTV.  Though I’m not in love with it, I do feel it adds value to my entertainment system.  I had a chance to play a few games last night, I got hooked on this stupid Stickman Downhill Motocross game.  The  gaming ability is why I bought it, and it is exactly why I found the FireTV unique.  I'm not a hardcore gamer.  I want to play a mindless game for 5 to 10 minutes, then move on.  This fits that bill.I find that it is the easiest way to watch Amazon Prime content to date.  What I had been doing is launching videos on my iPad, then sending them to Apple TV through AirPlay.  I have a Blu-Ray player that has the Amazon Prime app, as does my PS3, but I found the iPad AirPlay combo to be the easiest until now.  I’m still struggling with the idea that I’ll need to use a second remote, solely for the FireTV.  The thought of that is still a bit painful since I’m meticulous about my Harmony remote programming and the ease of having just a single remote.  It may singlehandedly be the biggest obstacle I’ll need to overcome in my adjustment.  I actually think the Bluetooth remote is the worse decision made by Amazon for the FireTV, more so than the 8GB disk limitation that I believe could be overcome with the USB port, although not ideal.  Sony made the same mistake with the PS3, and I believe the Bluetooth remote was partly to blame for it not gaining more traction as an entertainment hub for non-gamers.I still haven’t figured out how to actually turn the unit off, but I’ll Google it later today.  That little white LED on 24x7 will drive me mad.  The FireTV took the last of the 7 HDMI ports on my receiver, but when I get my next gadget, I don’t think it will be the first to go.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 2.0, "review": "I own 3 generations of Roku.  None will decode DD+ unless you go through HDMI since the newest generation has no audio out except for HDMI.  I tried an hdmi splitter that separates audio from video, but none will also decode DD+.I want a streaming box that can link to vudu which has high video quality and DD+ 7.1 sound on many movies.  Is vudu an available channel?There is nothing in the product information that indicates that vudu is an available channel.  vudu gets movies faster than amazon and netflix.  I am guessing the channel is not included because it competes too well with amazon?  I do stream many prime amazon movies and many many recent TV episodes.I don't see a question about section for this produce and no place to email amazon for an answer.", "verified": false, "helpfulness": "2/12", "author": "M. Shultz \"live music is better\""}, {"rating": 5.0, "review": "Bought the Fire last week and I am very impressed with it so far. I own a Roku and Apple TV. There is no question this device is superior. The hardware is much faster than the other two. The layout is terrific, the fast forwarding through movies is superb. I cannot say enough on how impressive this device is. I originally bought because after a few years my Roku kept locking up periodically.The other nice feature is that the device already knew about my amazon prime account when shipped, so there was zero set up.", "verified": true, "helpfulness": "2/4", "author": "G B"}]