[{"rating": 5.0, "review": "Am really enjoying everything I can do and since I haven't had it very long I am finding new contend every day. Being a prime member is really worthwhile since so much content is included. Loving this new way to enjoy tv.", "verified": true, "helpfulness": "0/0", "author": "Stephanie R. Behre"}, {"rating": 5.0, "review": "Love it!  Very easy to set up and use (even for a \"non-techie!\"!", "verified": true, "helpfulness": "0/0", "author": "Sharon Harms \"S. Harms\""}, {"rating": 4.0, "review": "K.....", "verified": true, "helpfulness": "0/2", "author": "tamas sr. ambrus"}, {"rating": 4.0, "review": "I have a Chromecast, Roku3, FireTV Stick, and now the Fire TV.  Performance-wise, the FireTV is the best of them all. Very snappy and never hangs up.  Sometimes my Roku3 is unresponsive, and it is not my internet connection.  All 3rd party apps (Netflix, Hulu Plus, etc) work flawlessly on the FireTV from my experience.Feature-wise, I would also rate the FireTV as tops.  The Dolby surround works great on my family room surround system.  The voice search really does work well.  I side-loaded Firefox Browser and Flash player.  With a Bluetooth keyboard, it will be nice to surf the web on my TV from the couch.  As I have my entire music collection stored on Amazon, it's great to play music through FireTV, and my daughter loves to see the lyrics on her favorite songs.  With Prime Photos, the interface and ability to (very easily) see all my photos is a nice bonus.My only complaint is the UI.  While I understand pushing the Amazon content front-and-center, I think it is over-done.  Navigating to other apps is inefficient, and you can only scroll horizontally across a single line of apps.  The UI for apps should be more like a Kindle Fire or smartphone, showing a matrix that you can more quickly navigate through.  A pretty easy and hopefully soon-to-come update.  The Amazon content itself, however, is laid out quite nicely, with several different ways to explore content.Lastly, Amazon, PLEASE add the NHL Gamecenter and VUDU apps!  Those are the only 2 reasons I still bought a Roku.If you are a Prime member, I would recommend Fire TV over any other streaming box.  Even if you are not, the performance of this box is excellent.  If you are new to these types of devices, FireTV is very simple and unintimidating to set up and use.", "verified": true, "helpfulness": "1/1", "author": "RWB2"}, {"rating": 5.0, "review": "Great Device, only which it had more hard drive capacity!", "verified": true, "helpfulness": "0/1", "author": "Eric"}, {"rating": 5.0, "review": "Works great! Fast little box.", "verified": true, "helpfulness": "0/0", "author": "Ramonrey"}, {"rating": 5.0, "review": "I love this thing.  I am going to go to an antenna also and get rid of these costly broadband and cable charges.", "verified": true, "helpfulness": "0/0", "author": "Grandma B"}, {"rating": 5.0, "review": "Needs global search functionality.  Today you can't use voice search to locate shows or movies across Netflix, Hulu, and Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Scott Anderson"}, {"rating": 5.0, "review": "Got this on sale for 79.99. The device is super fast (as it says). Especially compared to all the \"smart\" devices such as TVs and bluray players out there which, in my opinion should be left to doing what they were intended to do. Anyways, setup was a breeze. Applications load really quickly. I mainly run Netflix and Hulu plus.At first, I was required to put in my username/password each time I wanted to watch Netflix, but the more you watch (or use the application) the better it gets at caching your account. I can't remember the last time I had to input my account info for the apps I have registered. The remote on this thing is nice. Since its connected via Bluetooth, you don't need to point it at the device (which I still forget and end up pointing at the TV) and will work pretty much anywhere you are.", "verified": true, "helpfulness": "0/0", "author": "Chenyu F."}, {"rating": 5.0, "review": "best device ever .. thank you", "verified": true, "helpfulness": "0/0", "author": "Pierre Weightman"}]