[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "ted neimeyer"}, {"rating": 5.0, "review": "Love this! We recently cancelled our satellite and are just using streaming services including Amazon. This stick couldn't be easier to plug in and start using.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "I rather buy the original", "verified": true, "helpfulness": "0/0", "author": "Minghia"}, {"rating": 5.0, "review": "I have this, the kindle fire tv and the google chromecast.  I love this thing.  It has more channels than the fire tv,  it's really small and half the price.", "verified": false, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Very good item", "verified": true, "helpfulness": "0/0", "author": "Douglas Nowlin"}, {"rating": 5.0, "review": "Love this new streaming stick.  The radio control of the wand is easier to use that the infrared wands, since they don't have to point at the device to work in the room.  We bought three to use on different tvs in the house, and are very pleased.", "verified": true, "helpfulness": "0/0", "author": "Guy L. Richardson \"Always trying new products\""}, {"rating": 5.0, "review": "I bought this primarily to add Amazon streaming to my pre-smart TV Samsung.  It does a very nice job with minimal, reasonably intuitive controls.", "verified": true, "helpfulness": "0/0", "author": "Dan \"film obsessed\""}, {"rating": 4.0, "review": "I wanted to wait a few months before I did a review.  In general I like it.  I purchased it primarily to get the free channels that are offered that I cannot get by my antenna.  There are selected channels on the History channel we watch and Crackle has exclusive programs that are good too.  So for $50 it was worth it.  The only problem I had was getting the Roku set up and it took 2 evenings of 2 – 4 hours.  I think the initial problem was I missed some of the initial installation setup steps.  Also, it took a while to down load the program and I had to go through the process twice to make sure I had all the downloads.  So, be very patient and make sure you follow all the steps.", "verified": true, "helpfulness": "0/0", "author": "David \"David\""}, {"rating": 5.0, "review": "All the Roku awesomeness in a tiny package. My TV doesn't have powered HDMI so I have to use the USB cable.Note that if you plug the USB power cable into a USB port on your TV, it will likely power down your Roku when you turn off your TV. That is not ideal considering the boot up time of the Roku.", "verified": true, "helpfulness": "0/0", "author": "Wes"}, {"rating": 4.0, "review": "All you need for streaming", "verified": true, "helpfulness": "0/0", "author": "Kyle Mitchell"}]