[{"rating": 1.0, "review": "I purchased this and a Roku 2 with the faster processor, this stick is completely useless for me.  First off it doesn't even work with any of my TVs and its suppose to work with any HDMI set.  I tried it with a friends TV and it does indeed work so I know the unit itself is okay.  When I did use it the performance is just awful, the menu lag is simply unacceptable.  The original Roku years ago was faster than this.  Why they bother to sell such a thing is beyond me.  Plus, my intentions were to replace older AppleTVs and switch to Plex for all my media on my media server and this low powered stick wouldn't even play any of my true 1080p content in Plex or the other local media streaming apps.  Files that play wonderfully on the newer version of the Roku 2.  Don't waste your time on this and just spend a little more on a Roku 2 or 3 with the faster CPU, I promise you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "CynicalDooDad"}, {"rating": 3.0, "review": "I am a fan of ROKU.  That being said when we strep Netflix via this Certified Refurbished stick the video will stop intermittently while the subtitles continue to scroll.  I have to push pause and restart to clear the problem.  Frustrating for all when this starts up as we don't know what is causing it or how to correct it.", "verified": true, "helpfulness": "1/1", "author": "Itsmelt \"itsmelt\""}, {"rating": 5.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Ryan Smith"}, {"rating": 5.0, "review": "Excellent. Appreciated the deal.", "verified": true, "helpfulness": "0/0", "author": "C. Diane Stavrum \"Benedicus Domini\""}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Stephen Tremblay"}, {"rating": 5.0, "review": "Easy to set up, easy to use, even my technology challenged husband can use it. Have been using the Plex channel, steaming tv shows I missed. I recommend this to everyone.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "In a nutshell, if you are going to go with Roku, go for a Roku box or something on the upper end. The stick's response time is very slow and just ends up being irritating. It's great if you plan on moving the stick to different locations, but if not, it's just not worth it.", "verified": true, "helpfulness": "0/0", "author": "John M Abary"}, {"rating": 5.0, "review": "perfect addition to my roku items, perfect for my travel trailer", "verified": true, "helpfulness": "0/0", "author": "Dede Kay"}, {"rating": 4.0, "review": "This is my second Roku. I love 'em. I bought the stick because I've mounted the TV on the wall. The Roku works well.My trouble is with the remote. As it must be, it's a radio-frequency device (most remotes are infrared, requiring line of sight), but I live in a large apartment house and WiFi routers are everywhere. Occasionally, the remote can't find the stick due to strong interference from other WiFi's and stops working. I could change the channel that my router is using, but I'm planning to move in three days to an area where WiFi interference probably won't be as severe so the problem may go away. Meanwhile the app on my phone works as a remote just fine -- when my phone happens to be nearby.My point: If you live in a densely-populated area (there are over 200 apartments in my building), you may experience remote outages due to WiFi Interference.BTW: I learned of the WiFi interference thing (and got the suggestion to change the router's channel) from Roku support, which was quite good.", "verified": true, "helpfulness": "0/0", "author": "Tom in Portland"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Sandra"}]