[{"rating": 5.0, "review": "very good service  very happy with the purchase", "verified": false, "helpfulness": "0/0", "author": "Mr. Tom"}, {"rating": 5.0, "review": "This unit was easy to set up and use. I'm still experimenting with it. This is the first time I am using a media playerI would recommend a d buy again", "verified": true, "helpfulness": "0/0", "author": "randy wysocky"}, {"rating": 4.0, "review": "Works great when it works.  For some unknown reason it isnt always recognized.  We unplug it, plug it back in, and everything works great again.  We use it for pandora, netflix, and amazon prime", "verified": true, "helpfulness": "0/0", "author": "Julie P."}, {"rating": 5.0, "review": "Love the Roku streaming stick so much, I bought a second one!", "verified": true, "helpfulness": "0/0", "author": "Philip Budd"}, {"rating": 5.0, "review": "Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "fhamr"}, {"rating": 4.0, "review": "It says it has so many channels but some need you to have a local cable provider.  I found that there are some channels that they do not even show they have on the device or the web site.  It does have some good channels and is very usefull for streaming things from my computer to my spare screen or livingroom tv using plex.", "verified": true, "helpfulness": "0/0", "author": "Vishal"}, {"rating": 5.0, "review": "Great product.  Works well and well hidden", "verified": false, "helpfulness": "0/0", "author": "Neecey"}, {"rating": 5.0, "review": "It works perfectly. I have it on my bedroom TV and have a Roku 3 in the living room. Except for football and baseball, I don't need cable.", "verified": true, "helpfulness": "0/0", "author": "James Corkrum"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Bob H"}, {"rating": 5.0, "review": "At first I was worried because the remote doesn't work, but later I found the provided batteries were culprit.  A new pair of batteries and no problemas since!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]