[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "CARLITA JONES"}, {"rating": 5.0, "review": "This is our 3rd Roku. We love it. Cut cable over two years ago and never look back. We have over 1500.00 a year because of Roku. LOVE ROKU!!!!", "verified": true, "helpfulness": "0/0", "author": "David Swanson"}, {"rating": 2.0, "review": "Get the Roku 3 instead. Responsiveness to remote and menu loading are both as slow as molasses. Maddening, really. And, it didn't work with my apartment's moderately weak wifi signal. The Roku 3 is blazing fast and works fine with the same signal.", "verified": true, "helpfulness": "0/0", "author": "Mtn. Biker"}, {"rating": 5.0, "review": "The roku stick was an excellent choice in Internet streaming. It's a money saver I wish I known about it sooner", "verified": true, "helpfulness": "0/0", "author": "Premo"}, {"rating": 5.0, "review": "I watch movies on this more than I watch tv at weekends. It has  a lot of great movies and if you buy this make sure you add crackle to your program list aswell. Crackle gives you lots of un edited, uncut movies with only about 1 or 2 adverts occasionally you may get 3 and they do tend to be same ones each time in a movie but to me is worth it as movie starts back up exactly where it left of well, about a second before it left of lol.", "verified": true, "helpfulness": "0/0", "author": "Mrs. Shirley N. Dilday \"Sew Tech\""}, {"rating": 5.0, "review": "Wow! This is my first video streaming experience. And I fell madly in love right out of the box. Easy to set up. No biggie. It would help if you already have your home network set up and an active Netflix or Amazon Prime account. You'll be streaming movies in minutes.", "verified": true, "helpfulness": "0/0", "author": "CB Twelve"}, {"rating": 5.0, "review": "Performs every operation it is described to perform. Very easy to use. Will buy another.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 2.0, "review": "I couldn't decide between a Roku Streaming Stick or an Apple TV. Mind you, an Apple TV is about twice the price. Anyway, I ended up purchasing both...the Roku for my daughter's bedroom and an Apple TV for our living room. The setup for the Roku took roughly 3 hours because it wouldn't connect to Wifi and when it did the Roku wouldn't update. I waited to communicate with a Customer Service rep for approximately two hours. In the mean time, I set up the Apple TV within 10 minutes. We finally got Roku working only for Netflix and other channels to have buffering and connection issues. After 48 hours I decided to return it to Best Buy and purchase another Apple TV.", "verified": false, "helpfulness": "1/2", "author": "Roxie111"}, {"rating": 5.0, "review": "After cutting the cord almost a year ago, my husband and I just recently purchased this Roku as a 2nd device for another TV in our house. It works just as well as the box and I haven't had any of the connectivity concerns of others - plus - the price point is great!", "verified": true, "helpfulness": "1/1", "author": "Sarah Akers"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/2", "author": "Maya"}]