[{"rating": 3.0, "review": "The speed it slow and the remote control can be only use within one foot away. I guess I got a product with problem", "verified": true, "helpfulness": "1/1", "author": "Ruofan Tang"}, {"rating": 1.0, "review": "Controlling playback on this thing is like controlling the Mars rover.. I push a button and 30 seconds later it responds, but glitches out a/v sync the whole time. The area is well ventilated, tv is not wall mounted, it's on a 50mbps connection, and it's less than ten feet from the (one month old) router. Just a waste of $50 sadly, pay the extra for something with reasonable processing power..", "verified": true, "helpfulness": "0/0", "author": "gamerboy64"}, {"rating": 1.0, "review": "Never worked", "verified": true, "helpfulness": "0/0", "author": "Emile Abinader"}, {"rating": 4.0, "review": "This works well, unlike the chromecast it replaced.  It does amazon prime, too, which the cc didn't.  It's not as slick to use as the cc.  The remote, with a round back, is poorly designed - the first time I it next to the tub so as not to use my phone ap to control the stick, it rolled into the water and committed suicide.", "verified": true, "helpfulness": "0/0", "author": "Huw Powell"}, {"rating": 5.0, "review": "Works well if you don't need to get surround sound or any type of sound connection. Plug and play with any TV with a HDMI port.", "verified": true, "helpfulness": "0/0", "author": "S.R."}, {"rating": 5.0, "review": "Terrific - easy to set up, and fun to have access to internet on non-internet TVs.", "verified": true, "helpfulness": "0/0", "author": "purpleprose"}, {"rating": 5.0, "review": "Time saver...", "verified": true, "helpfulness": "0/0", "author": "joe b rivera"}, {"rating": 1.0, "review": "Would not work", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Do you Roku?", "verified": true, "helpfulness": "0/0", "author": "Tracey Benzenberg"}, {"rating": 5.0, "review": "I wish the remote was better no volume button, I have eye problem and it is to small for me to see up and down arrows are to small I shake real bad I am 75 years young and watch a lot of movies printing is way to small.thank Lorelei", "verified": true, "helpfulness": "0/0", "author": "lorelei kunz"}]