[{"rating": 1.0, "review": "I had a nightmare getting it installed. Support offered to install it remotely for 69.99. Will not recommend to others.", "verified": true, "helpfulness": "0/0", "author": "Kathryn J. Hartman"}, {"rating": 5.0, "review": "The best thing ever", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "The product did not work. The seller would not contact me.I was quite disappointed with the product's, and the seller's, non-performance.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Lapka \"Larry L. Colgems\""}, {"rating": 5.0, "review": "Love this Roku! I was a little hesitant to purchase it refurbished but I have been using it daily now with absolutely no issues! This has a nice selection of channels and is easy to navigate and set up. Some other reviewers have said that it is slow to load channels/shows but I don't consider waiting 3-5 seconds \"slow.\" If you want instantaneous then maybe you should look elsewhere. I, however, am VERY pleased with my purchase and highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Love the roku! We cancelled our cable and bought the roku stick and use it all the time. You can get so many free channels. We use it to watch Netflix and YouTube videos the most. There are paid channels as well but we don't need those with all the free options. Tons of workout channels, kids channels, food, nature, sports.....everything", "verified": true, "helpfulness": "0/0", "author": "Jennifer Albright"}, {"rating": 5.0, "review": "LOVE it! I bought this as a Christmas gift for my mom and we both LOVE it. She was wishing there was an easier way to watch her programs that she missed other than hooking my lap top up to her tv. And now we can! She also wanted a way to watch Acorn tv on her tv instead of on her computer and now she can! :) I definitely want one of my own!It was easy to set up and it's easy to use. The only minor, minor, minor thing I don't like dealing with is clicking through the alphabet letter by letter when I search things, but that is definitely not a deal breaker.", "verified": true, "helpfulness": "0/0", "author": "Alisa Cross"}, {"rating": 5.0, "review": "This device really does everything. The picture is clear and the wifi works great. I will definitely recommend to anyone looking for a streaming device.", "verified": true, "helpfulness": "0/0", "author": "Korey C."}, {"rating": 5.0, "review": "Works great almost as good as a full sized unit.", "verified": true, "helpfulness": "0/0", "author": "J. Scott-Monck \"Tool Fool\""}, {"rating": 5.0, "review": "works great for streaming vudu.  Make sure you have a fast internet connection for streaming though.", "verified": true, "helpfulness": "0/0", "author": "Flynhawaiian"}, {"rating": 1.0, "review": "Did not work. The remote would not sinc", "verified": true, "helpfulness": "0/0", "author": "Rebecca Levesque"}]