[{"rating": 4.0, "review": "It is wonderful", "verified": true, "helpfulness": "0/0", "author": "Tunde  Adenuga"}, {"rating": 4.0, "review": "Tiny device, loaded with tons of channels, 200 quality channels, rest is crap, a bit slower than the 3, but over all 4 stars, it's a must to have for not too intelligent LCD's or Plasma. I love it ...", "verified": false, "helpfulness": "0/0", "author": "AmrTaleb"}, {"rating": 5.0, "review": "I don't know why I never got a Roku.  I use my custom desktop as my all in one, but uses alot of power.  This thing should save me alot. since I have a tablet and a smart phone to do all my pc does.  My daughter loves it for the kids channels, there are a few channels I like also but could be better.  But this product has tons that I will never see as its not my taste but others will love.  If you like horror, westerns or old shows their may be a chance you will find your show here also.", "verified": false, "helpfulness": "0/0", "author": "G. Heredia"}, {"rating": 3.0, "review": "I cannot use this because I don't have an extra HDMI port on my TV so I can't even use it, what do I do ???", "verified": true, "helpfulness": "0/3", "author": "Andrea B. Rivera"}, {"rating": 5.0, "review": "I am so glad I bought this Roku Stick. We had no cable for a while and needed to have a little entertainment. I belong to Amazon Prime so I had quite a few movies to choose from. This is very reasonably priced and easy to use.", "verified": true, "helpfulness": "0/0", "author": "S. Pollock"}, {"rating": 5.0, "review": "Great. I've been a fan of Roku for nearly 3 years now.", "verified": false, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "So far we are loving our Roku.  We love British TV and are so grateful that we can get most of our favorites on Acorn.  We did have to upgrade our wireless speed to get a great HD picture, but it is worth it.  I'm a 78 year old grandmother and was able to figure out how to set up an account with Acorn, and get our accounts with Netflix and Amazon running on it, so anyone should be able to do it.  Oh, and did I mention that the service was great.", "verified": true, "helpfulness": "0/0", "author": "Sugarfoot1936 \"Carolyn Jones\""}, {"rating": 5.0, "review": "not very happy with I can get anything to come in and gets frustrating so disconnected", "verified": false, "helpfulness": "0/1", "author": "Nelda"}, {"rating": 4.0, "review": "I bought this at Wal-Mart recently and so far I like it.  The only thing that I didn't like was the set up.  It's not plug'n play for some.  I got the error 014 or something like that saying it couldn't connect to the network.  I was about to take it back and thought to give it a chance and look for advice online.  I spent way to much time on updating software and changing settings, Roku really needs to fix that. I read to many complants about that error.  In all about 2hours just because I was getting really frustrated.  I found a youtube video that helped me with one of the settings that I didn't understand.  It was the \"Disable Ping\" setting that you had to Enable.  Finally it worked.  As far as the user end it's great.  I bought Amazon Prime about a month ago and have been streaming video through my Wii.  The Wii is combersome and I wanted something a little more user friendly so that my wife and kids could easily use.  So far they have yet to use it while I'm not there but it is easier to use than the Wii.  I love the small size because I have alot of stuff on my table-top entertainment center.  Which includes house phone, Wii, speakers, modem, wireless router and decorations.  I didn't want another box up there.  I have a five year old Vizio LCD TV and it had an HDMI port and a USB port on the side which made installation (at least that part) easy.  The USB port said \"maintenance only\" but of course it has power so that wasn't an issue.  The USB cable does stick out just a little but not enough to really notice if you are focusing on what you are watching and of course it might be different for your TV.  The remote is simple, not many buttons and easy to use.There are lots of channels that I have yet to explore but it really makes it easy to find what you are looking for.  What's even better is the pairing feature.  I was wanting to look up Youtube videos.  It said that you can pair your phone, tablet or computer to the Roku and that makes it soooo much easier to find what you are looking for instead of having to search for each letter on the keyboard that's on the screen.  Really cool.The size, price and user friendlyness make this a pretty good choice when looking for something to stream videos or music.  I was looking at getting the Amazon Fire TV box but chose this just because it's small at half the price.  Later on I might hook this up to my TV in the bedroom and get a Fire TV box but for now this is a great way to turn your old flat screen TV into a Smart TV.  I have played on a smart TV before and this is the next best thing to it and way cheaper if you don't want to shell out the money for another TV.Updated: 12-22-14When you are watch something like a TV series and want to watch consetutive episodes you have to physically hit play on the remote it will not automatically play the next episode.  They have changed that and it is a million times better in my mind.  There latest updated firmware or software version allows the TV series that you are watching to continue play on to the next episode without having to physically hit anything on the remote.  Big improvement, still really like this unit.", "verified": false, "helpfulness": "0/0", "author": "J-Rod"}, {"rating": 5.0, "review": "Great product -- shipped quickly and arrived in perfect condition -- thanks so much!", "verified": true, "helpfulness": "0/0", "author": "Lina Fletcher"}]