[{"rating": 5.0, "review": "I have the Chromecast stick but not a smartphone......have to use my laptop to control it, abit annoying.  Roku's stick has a remote which makes all the difference for me.  This is my second Roku device, I have another unit (4 years old) which I have been very happy with.  Set up is easy, I did it!  Can't beat the price!", "verified": true, "helpfulness": "0/0", "author": "Marthary \"Martha's Attic\""}, {"rating": 5.0, "review": "Hi I live in trinidad I have a smart tv will the roku stick work in my country", "verified": false, "helpfulness": "0/0", "author": "debbiewashington"}, {"rating": 5.0, "review": "Easy to use and hook up. It does what I need it to do.", "verified": true, "helpfulness": "0/0", "author": "jodie"}, {"rating": 5.0, "review": "Bought for myself and giving as gifts", "verified": true, "helpfulness": "0/0", "author": "Sharron Bugbee"}, {"rating": 2.0, "review": "Not compatible with Optonline", "verified": true, "helpfulness": "0/0", "author": "ajaxtalk"}, {"rating": 4.0, "review": "Works just like the fire tv console. I love it.", "verified": true, "helpfulness": "0/0", "author": "mrjoeyman"}, {"rating": 1.0, "review": "TERRIBLE! From the product to the service.  Setup was a pain it kept trying to update the freeze up. I unplugged and restarted and it was ok. Then wanted me to register a credit card before I could use it. Waited 30 min for support to remove that. Worked for about an hour then won't connect to a network.  My Chromecast plugged in next to it works just fine. Will be returning tomorrow.", "verified": false, "helpfulness": "2/2", "author": "Randy"}, {"rating": 1.0, "review": "This item stinks!!!!! It never works and it shuts off and I have to reset over and over. Love roku. Hate this stick! Tried to return and it was too late.", "verified": true, "helpfulness": "0/0", "author": "Jesus"}, {"rating": 1.0, "review": "Buffers terribly. Can't watch a movie or anything without it buffering. I'm sending it back.", "verified": true, "helpfulness": "0/0", "author": "Daizi"}, {"rating": 1.0, "review": "Owned for all but 2 hours before sending back,  had major problems setting it up...wouldn't hold internet connection/kept resetting, and since from what I understand the support guy said,the remote is wifi based so I couldn't even control the menu or navigate.  When it decided to work, it would for a few seconds then stall out...like when a YouTube clip stalls out so it can load up.  Annoying.  Then the support guy suggests I switch channels on my router, which it wasn't patient enough to spend two more hours to try and figure out.  I'm sure it's great if you can get past all that though.", "verified": true, "helpfulness": "0/0", "author": "Joselito F Seldera"}]