[{"rating": 2.0, "review": "I started off really liking this device. It has a lot of channels, including a TED channel which is important to me. I especially like the fact that the remote operates via Bluetooth instead of IR. Additionally, the Android app works very well and greatly simplifies operation. The problem is when you wake it up from sleeping, it takes as long as five minutes to wake up. I wondered about that, so I contacted tech support first via telephone and got someone whose English was so bad that I couldn't understand her and she couldn't understand the problem with the device. Additionally, the quality of the connection was so bad that we could barely hear each other. I gave up and opened a chat session. The agent on the chat session told me that it's normal for the device to take so long to wake up, but he suggested I perform a software upgrade. The software was the current version, so he then asked me to remove the device from the back of the TV. I told him that the TV was mounted on the wall and that it takes two people take it down. He said that was required to do a reset, which involved shutting off the TV, removing the device, plugging the device back in, turning on the TV, and pressing the reset button on the device. It's a ridiculously convoluted procedure and perhaps I'll try it sometime when I have extra people here to hold the TV while I do it. I wish I could send it back, but the return window has expired.", "verified": true, "helpfulness": "1/2", "author": "Don"}, {"rating": 5.0, "review": "Best Roku yet!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For a user from outside the US (Philippines), heres best review I can give:Pros:-------- For $49.99 (Php 2,200), this is the cheapest way to having a Smart TV- Wifi capabale so no more need to do wiring to make it work-The Free channels are more than enough to entertain you- For a parent like me who monitors what his child is watching, there's no more need for me to painstakingly search and download new materials and screen if they are kids-friendly materials every now and then. The HappyKids channel is more than enough to supply my little one new and exciting shows everyday.- No more need to turn on my laptop on when I want to do an all-nighter tv series marathon- No hidden fees- Can play your own videos stored in your computer/laptop or your Network Attached Storage (NAS) device unlike Apple TV, ChromeCast, Amazon Fire TV, etc.- You have a Remote Control! For an old school couch potato, thats where all the POWER comes from -- the Remote Control!Cons:-------- Limited file format support - Roku cannot play AVI files. If you have AVI videos, you wont find it from the list of files it will play. Roku only supports media file in these formats: MKV (H.264), MP4 (H.264), AAC, MP3, JPG, and PNG.- Roku Stick only has HDMI so if you have an older TV that only has a Composite A/V cable (the red/white/yellow wire), you might want to consider Roku 1 for the same price $49.99 (in Amazon its much cheaper at $49.97) or the more expensive Roku 2. Here's a comparison of the different Roku models- Some heavy channels like Youtube or Netflix will take a little more time to load as per personal experience. Other reviews say, those channels open faster with other Roku models- M-Go, Netflix, Amazon and Blockbuster only works with IP addresses from US. Unless you know how to use VPN which makes you appear as if you're there, dont expect that these channels will work even if you paid for it.- Its a must to have a high speed internet connection -- I personally use Smart LTE that gives me an average of 10-20mbps connection, or else you'd be spending a lot of time seeing the loading screen- You will need a Wifi Router since Roku Stick is a wifi-only device- A strong Wifi Signal is also a must where your Roku Stick is going to be placed --  a strong wifi signal will be a determining factor if you will have a smooth loading video or more time seeing the loading screen. If Wifi Signal is low where your Roku Stick is located, consider relocating your router or get yourself a Wifi Repeater/Range Extender or a Powerline Adapter (if its within your budget)-Both Android and iOS apps is not available for outside US users (as per my experience)Verdict:Im giving it a 5/5 stars rating as the PROs outweighs the CONs for me.", "verified": false, "helpfulness": "1/1", "author": "Arjay Talosig"}, {"rating": 1.0, "review": "It is a wonderful thing when it works!  Unfortunately, it does not work most of the time!  I have called them a few times, I do as they instruct, which takes a long time!  They insist it is my internet provider that is causing the problem!  So I call my internet provider constantly, I had them come out to the house, only to find out that my signal is excellent,  and every other device in the house works fine!  I call RoKu once again, and  have to spend an hour on the phone, and being put through the paces, from someone who is reading from a manual! Then, when it won't work they tell me to provide my internet provider with a security mode they gave me!  To which, my internet provider snickers!  (I don't blame them).It is great idea, I just have not had any luck with it!  I really think my Roku device is bad and have requested a new one.  They just ignore that request!", "verified": true, "helpfulness": "2/2", "author": "Robert A. Schaper"}, {"rating": 5.0, "review": "Let me begin bye saying this is my 4th Roku device. (Roku 1,2,3). Out of the box it was a breeze to set up . connected to wifi and the remote just fine. My cheep element 22 inch TV has a usb connection in the back so no need for a extra plug in. The speed of navigation is a bit slower than my Roku 3 faster then the original though. Defiantly not a main box streamer but perfect the the sun room tv that we now us it for.", "verified": false, "helpfulness": "0/0", "author": "Bcon"}, {"rating": 4.0, "review": "arrived on time easy to set up.  Happy with purchace", "verified": true, "helpfulness": "0/0", "author": "4GETMEKNOT"}, {"rating": 4.0, "review": "Excellent device.  I am in New Zealand, so the main buttons on the controller (like Netflix) don't operate here (yet!).Relatively easy to set up, BUT I did have trouble getting it to see my WiFi SSID and had to reboot the Modem AND reset the Roku, three times before it settled down.Absolutely trouble free since then and excellent picture quality (I have a 4K TV that upscales anything below that, so all of the Roku channels look great).", "verified": true, "helpfulness": "0/0", "author": "Kotuku"}, {"rating": 5.0, "review": "Good product does all I want it to do. And better than paying the 89 buck for the roku 3. I have both and they do great just one is cheaper and one doesn't have the games. So for 45 bucks it's the way to go.", "verified": true, "helpfulness": "0/0", "author": "Jeff Ranes \"the man\""}, {"rating": 5.0, "review": "Much better way to use your TV.  I dumped cable TV, and kept the grossly overpriced internet service from Comcast.  Using this Roku, which plugs into a USB port, I stream most of what I watch on TV, although I sometimes watch the major network programs over the airwaves.  The local channels have free Hi Definition programming on most of their offerings.  I did have to purchase a new antenna for the local TV broadcasts.  Much of what I stream from Amazon is free, although some of the episodes are pay for view, at a very reasonable price.  I'll never go back!", "verified": true, "helpfulness": "0/0", "author": "Pfred"}, {"rating": 5.0, "review": "I bought a smart tv a few years back, and was excited about being able to use the Amazon Instant Watch, YouTube and Netflix apps. I was very disappointed to learn that the apps were very limited in how they could be used on the smart tv. The browsing sections were limited to about 10 movies, so it wasn't much of a browse. I bought Roku because I wanted something that I could browse a streaming services entire collection without having to get on a phone, tablet or computer and just be able to push play. This is that and more. I have access to almost anything. I watch YouTube videos, watch church sermons, listen to music, and I have even used it to show my family my vacation pictures instead of passing around a camera or a pile of photos. This is well worth it. I liked it so much that I ended up buying one for my aunt for Christmas, and one for my grandfather just because he's like a big kid. He watches the classic channels and the old western channels, so this is absolutely a product that all generations can use.", "verified": false, "helpfulness": "0/0", "author": "Maria"}]