[{"rating": 1.0, "review": "Great for the first month and a half. One day some Russian video popped up in YouTube. I thought that was odd, so I reset the device. Worked again for a few days and then went blank. Now completely useless. Have re-set and followed all troubleshooting guides to no avail. Meanwhile, my older roku box is still working great three years later.", "verified": true, "helpfulness": "0/0", "author": "Allison M. Sequera \"asequera\""}, {"rating": 5.0, "review": "This sure beats messing around with the app on my BluRay player. I use the Netflix, Amazon Prime and AOPA Live apps most!", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 4.0, "review": "great item... really enjoy it..", "verified": true, "helpfulness": "0/0", "author": "Lisa L. Brown"}, {"rating": 1.0, "review": "Will not stay connected to wireless.  It is in the same room.", "verified": false, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "YouTube app works painfully slow unless u pair it with another deviceEvery other app don't seem to be too bad just a tad slower than Roku 34 stars if paired with another device3 stars because too painfully slow while using u tube app", "verified": false, "helpfulness": "0/0", "author": "Samantha Kham"}, {"rating": 5.0, "review": "Works fine, just as expected. I needed a portable Roku option and this works for me.", "verified": true, "helpfulness": "0/0", "author": "Macy Cronkrite"}, {"rating": 2.0, "review": "The AAA  battery replacement is insane. Thinking of returning this item", "verified": true, "helpfulness": "0/3", "author": "Donnie Damon"}, {"rating": 5.0, "review": "We really enjoy this streaming device. Our specific reason for purchasing the Roku was to be able to stream JW Broadcasting to our  HDTV. It's great!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "It doesn't work outside de United States and the description didnt said so, so I lost my money.", "verified": true, "helpfulness": "0/0", "author": "Alicia Martinez"}, {"rating": 5.0, "review": "Perfect! Came prompt and as always Roku meets every expectation. Hooks everything into the back of the TV so there are no cords hanging everywhere.", "verified": true, "helpfulness": "0/0", "author": "Kevin Dunn"}]