[{"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "0/0", "author": "Tobias Josephson"}, {"rating": 4.0, "review": "Slightly misleading, as the \"stick\" is not wireless, and a smaller wire is required to plug into the back of the stick (and then then a wall outlet) in order to operate.  Otherwise, perfect operation--I have four other units in my house (Three roku HD's and one Roku 3) that I obviously love, and even prefer over Apple TV.  Highly recommend Rokus in general.", "verified": true, "helpfulness": "2/2", "author": "H. Bateman \"luv2read\""}, {"rating": 5.0, "review": "This is something that is well worth the buy. At the time I bought this there was a three month free trial of Hulu Plus which is amazing. It is small and fits right in the back of most tv's which have an HDMI port. There are plenty of free apps which can be applied to the device including hulu plus, Pandora, and Netflix. It doesn't come with a headphone port on the remote like  the Roku 3 does but it is easy to use and for $50.00 it is worth it.", "verified": true, "helpfulness": "0/0", "author": "zmikeranger"}, {"rating": 5.0, "review": "Plugged into the bedroom tv set, set up Netflix, Amazon Prime, Hulu and a few other free channels and haven't looked back. The stick loads channels slightly slower than the Roku 3 box, but not by any amount to cause agitation. I highly recommend for any tv in your home, would consider the Roku 3 box for the main tv.", "verified": true, "helpfulness": "0/0", "author": "Aeacus"}, {"rating": 1.0, "review": "Continually freezes. I also have a roku 3, and it does not have issues.", "verified": true, "helpfulness": "1/1", "author": "Ashley"}, {"rating": 4.0, "review": "Works great but i also have the roku 3 and is faster. If you want movility is Great.Advice if you can buy the roku 3, i think you should do that.", "verified": true, "helpfulness": "0/0", "author": "Kimera"}, {"rating": 5.0, "review": "The ROKU Streaming Stick arrived on time as expected. Installation was a snap. There is so little to do to that you are up and running in no time. This was the second ROKU device for me so I already had an account which made it even easier. I get the same excellent performance from the Stick as I did the ROKU 3. If you are looking to stream TV and movies at minimal cost you can't go wrong with this option.", "verified": true, "helpfulness": "0/0", "author": "J. D. Snyder"}, {"rating": 3.0, "review": "Though I cannot compare the streaming stick to older or lower cost Roku boxes (such as the 1, 2, LT, etc), having a Roku 3 I think that is really the best comparison I can give.  I ordered the Roku 3500R for a new 32\" Samsung TV I received as a Christmas gift that will be used in my bedroom.  Before ordering I read many of the reviews that others had posted, mainly in favorable reviews.  I thought \"well since it will be for my bedroom TV I won't likely be using it as much as I do my Roku 3\" which is in my living room on the HT system and bigger TV.  In one review I read someone say there is no difference between this and the Roku 3; I don't know about that and I will explain why below.First impressions -It is small. But this is convenient if you do not want too many extra cables, depending on what you already have set up.  When it arrived I plugged it in to an open HDMI port and though my TV does have a USB port, I decided against plugging it into the TV because I did not want to have to wait for it to boot every time I turned on the TV, so I opted to use the included wall adapter and just plugged it into a Surge strip so that it has power to it all the time and will be ready to go.  Set up does flow as nicely as the Roku 3 with, but getting connected was one of the problems I experienced, being the one exception.  The stick does not want to utilize the 5GHZ spectrum with my wireless which would be my preference, so after multiple reconnection attempts and resetting the router I finally had to settle for the 2.4 GHZ N spectrum.  Not a biggie, but still.  My Roku 3 can use the 5GHZ band, so why can't the stick? ..Especially considering it is a newer device.  Then even once it connected, it would get done downloading \"updates\" and then give me an error message that it could not connect? Huh? Then how on earth did it just download the updates?  Not an issue with my internet. Router is relatively new and my Cable connection with Cox is well over 100 Mbps and all my other wi-fi devices were connected just fine, so I knew at this point it was the device.  At this point, I unplugged the Roku and waited a few minutes and then plugged it back in. Voila, no more issues and the rest of set up went as expected (creating an account, etc).I then noticed the speed of the 3500R.  The remote seems to \"go to sleep\" and you have to press the select button a few times to get it to wake up.  The Roku popped up a message telling me to pair the remote, though I already did, but after a few buttons were pressed it began to work again.  Navigating around the device seems to be choppy compared to it's older brother, the Roku 3.  The speed of the cursor and screen transitions (loading movie titles and thumbnails) does not seem to flow as smooth and almost appears to get stuck or hesitate (best way I can describe it).  It's not so much that it's a huge huge deal, but it can be a little annoying when you know where you want to go or what you are looking for.  From what I can tell the things I have mentioned may be fixable with a firmware update, but for now I cannot be sure.  My overall impression is that, while it may be a value to some at $50, to me it just feels cheap and clunky.I do want to note however, that once you find what you want to watch (i.e. Netflix) the video quality seems to be very high quality.  There is no stuttering or pixeling and I have not experienced any freezing, at least not as of yet.  A few times the audio has started before the video, but I think this again may be a firmware issue, as I have never experienced it with the Roku 3.Conclusion; Depending on your needs and how often you think you will use it, the 3500R streaming stick may be fine for many and could be excellent if the bugs were completely worked out, but if you don't want to wait for longer app start up times, you want games, or a simply better UI experience with speed, you may want to get the Roku 3 which I overall would have to recommend over the streaming stick, just for the purpose of speed and response times.  The streaming stick I think will suit me fine until the release of Roku 4 (then I will upgrade) since I am using it for light watching overall, but if you plan to get heavy use, I would spend the $30 more and get the Roku 3 for now.", "verified": true, "helpfulness": "4/4", "author": "jadeddj81 \"jadeddj81\""}, {"rating": 5.0, "review": "Amazing product . More movies than I will ever have time to watch ! Lots of free channels !", "verified": true, "helpfulness": "0/0", "author": "Cindy Day"}, {"rating": 5.0, "review": "I bought this as a gift for a friend because of the JW Broadcasting app. This product is a thing of beauty. For someone who is not tech savvy, like my friend, it fells like a TV remote and so is easy for him to use.", "verified": true, "helpfulness": "0/0", "author": "MikeR1954"}]