[{"rating": 1.0, "review": "This item did not live up to expectation. I big waste cant work in countries outside the USA", "verified": true, "helpfulness": "1/2", "author": "Ricardo"}, {"rating": 5.0, "review": "Wow! It took several hours to review the available content & choose what I wanted! Video quality is better than I expected & the remote works well. I recommend it to anyone that wants to avoid the cost of cable TV!", "verified": true, "helpfulness": "0/0", "author": "Kansas Customer"}, {"rating": 5.0, "review": "Love my Roku! Now I can utilize my TV in my kitchen without renting (yet another) cable box. I've already seen some great movies via Netflix and HBO GO. The quality is amazing and it was so easy to set up. I also didn't mind paying a little more for this brand since it comes with a remote control.", "verified": true, "helpfulness": "0/0", "author": "Donna Johann"}, {"rating": 5.0, "review": "Love the Roku stick. It is a little slower than Roku 3 but it couldn't be any easier to setup.I own 2 Roku sticks & 3 Roku box type units.", "verified": true, "helpfulness": "0/0", "author": "Blue Skies"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Allison Callahan"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Tim Mooney"}, {"rating": 5.0, "review": "The Roku is easy to use and simple to set up. I have both this and the Roku 3 and have found little difference in speed and function. They are both great, however this one is a more affordable option. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "rose11"}, {"rating": 5.0, "review": "Love the simplicity of plugging into the back of my HD projector and having Netflix, Amazon, Spotify etc all in one place.", "verified": true, "helpfulness": "0/0", "author": "Pete Grizzles"}, {"rating": 4.0, "review": "Work as expected. Able to project ipad to TV:) however many channels content not too useful!", "verified": false, "helpfulness": "1/1", "author": "Gerald Ng"}, {"rating": 5.0, "review": "Love it but ck you GB data I have 300 a month and went over 40GB 10.00 extra on my xfinity plan", "verified": true, "helpfulness": "0/0", "author": "John H."}]