[{"rating": 5.0, "review": "roku is awesome! There are SOOOO many channels to watch!!! Cut your cable bill and get a roku! I love this. We will be getting a roku stick for every tv in the house.", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "Works awesome! Plug in and your ready to go. I had great customer service when I needed it too!", "verified": true, "helpfulness": "0/0", "author": "Beth Whelan"}, {"rating": 2.0, "review": "I did a lot of comparisons between roku and other streaming devices. Bought this item. It is almost impossible to attach if tv is on a stand and hdmi port is on the bottom of the tv so please double check dimensions. We received the usual \"purple screen of death\" twice in the last 2 months. We reset the roku the first time which was a huge mistake and lost all of our presents. The remote officially does not work anymore, it's only been 6 months since purchase. We had to download the app on our phones to use as a remote.", "verified": true, "helpfulness": "0/0", "author": "karin"}, {"rating": 4.0, "review": "Went from Apple TV to the Roku and the Apple navigation was so much easier and quicker. The Roku took a bit to get used to, but overall it does a good job.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "Just as described! Plugged right into TV, easy setup and excellent picture quality.", "verified": true, "helpfulness": "0/0", "author": "Dennise V Sauvage"}, {"rating": 5.0, "review": "Very nice addition to my regular TV.  It is now as smart as I needed without the super markup of having the smarts built-in.I use Netflix, Amazon Prime, Yahoo Screens and Youtube.  I may even try Hulu in the future.  This thing is great. The remote control makes it easier to use than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "J. Sanctus-Filius \"Johannes\""}, {"rating": 3.0, "review": "I was excited to get the Roku stick (I also bought the USB charging cable) so we could watch YouTube on the television, but watching videos on YouTube is easier on the iPad. Netflix works great on it and so do Amazon Prime movies. Once we figured it out we watched a bunch of movies. However, our television began having a long delay turning on, 5-8 seconds after pressing ON, so I unplugged the Roku Stick to see if that was causing a problem. We haven't had any issues with delay since I unplugged it. I'm not sure if it's a coincidence or if the Roku actually caused the delays. No harm to the TV but it is annoying to wait. Using the app on the iPad in place of using the Roku remote only works on one of our iPads so we still need the remote on the end table. I don't have any other subscriptions to channels like Hulu but I think when/if we ever do this little gadget will display it on my TV just fine.  It's worth the money. Anyone with more viewing requirements will probably want to upgrade to the bigger unit though.", "verified": true, "helpfulness": "0/0", "author": "Lisa S"}, {"rating": 5.0, "review": "I've been using a Roku box for 4 years now. No cable, no satellite. The box finally died and I replaced it with the stick. It fits nicely behind the screen of our TV and works great. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Candace Mathew"}, {"rating": 4.0, "review": "Works great, as described. Roku Stick is a godsend. I was getting so tired of watching on my laptop or hooking it up to the tv.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "its simple and it works as advertised", "verified": true, "helpfulness": "0/0", "author": "Mary Ann McCaffrey"}]