[{"rating": 5.0, "review": "I love my Roku Lite, but I really enjoy having one less box sitting on the tv stand. My TV is on a wall mount so this is perfect.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product and fast delivery. Could not be happier with the product.", "verified": true, "helpfulness": "0/0", "author": "V. Card"}, {"rating": 1.0, "review": "I hate this device... It is very slow and takes forever to load a movie. I like the kindle fire tv streaming device much better.", "verified": false, "helpfulness": "0/0", "author": "Lisa Fore"}, {"rating": 1.0, "review": "I've had the streaming stick for two months.  It worked great at first, but one day just stopped loading. It will try to load and then reset itself over and over and over again.  Tried the reset button and it still won't work.  Highly disappointed.", "verified": true, "helpfulness": "0/0", "author": "J.C."}, {"rating": 1.0, "review": "This product arrived with everything possible wrong with it. The cable did not work, and once I replaced it with my phone charger the Roku Stick turned on. The batteries included were dead, and had to be replaced to get the remote to work. Once I finally fixed these problems, the Stick did not send a signal to my tv. I tried it on several TV's, but to no avail. I used my laptop in the HDMI slot on my TV's, so I know that the HDMI slot works.", "verified": true, "helpfulness": "0/0", "author": "Neil Schlimgen"}, {"rating": 4.0, "review": "Overall I'd give this a 4 star rating.  It gets things done but it also is slow.  Bootup time is horrible and once the menu is visible there is still about a 30 - 60 second lag before it begins to read messages from the controller.The funniest part of this: the only service that does not stream smoothly is Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I'm happy with this streaming stick. It does everything my \"box\" roku 2 does but in a smaller form factor. The wifi antenna on this unit isn't as receptive as my chromecast, but signal is still strong enough my streaming needs. I stream 3mb 720p HD. Trying to do 5mp+ (1080p or high bitrate 720p) caused buffering even with signal in the \"good\" range per Rokus self rating on the network setup page. My routers are 802.11n with MIMO support, I do not have 802.11 a/cA few words of caution:Use the supplied USB power supply, not a TV usb port. My unit worked with the TV usb port but would do odd things like randomly reboot or not accept remote commands until I powered it with the wall plug.Attach your USB power first to the unit, then plug it into the TV. I found that once plugged in to the TV the HDMI head very easily bends, and when I tried to plug in the usb power the unit bent outward about 20-30 degrees which is obviously not a good thing. I pushed it back and it still works fine, but I doubt this is good for the unit nor your TV's HDMI port.", "verified": true, "helpfulness": "0/0", "author": "edrock \"edrock\""}, {"rating": 4.0, "review": "Pros: Great small device for connecting to online channels. Love the remote control. Color easy to locate :).Cons: Price could be a bit cheaper by at least $10. Should have come with an HDMI Extended cable (real tight squeeze on my TV). Stick could be more slimline (kinda bulky). Need instructions on how to connect with Hotel TV's, had difficulties connecting. It displayed connected and I could see the channels but I was never able to view any online channels. If I'm able to stream on my laptop in the hotel, I should be able to connect through the Roku stick. Perhaps a software update is needed for Roku.", "verified": false, "helpfulness": "0/0", "author": "Ybert \"Music Lover\""}, {"rating": 5.0, "review": "Easily set up, streams netflix for me with no problems at all.", "verified": true, "helpfulness": "0/0", "author": "Vic \"Vic\""}, {"rating": 5.0, "review": "I LOVE, LOVE, LOVE my new Roku. I have been a cord cutter for more than 8  years (no cable or internet), but I finally decided to join the 21st century and get internet at home. I invested in a Roku 3 for my living room and streaming stick for my bedroom, and I can't believe I waited so long to take the plunge. There are still many apps where you need a cable service provider to access shows, but lucky for me, I have friends who were willing to share theirs with me.", "verified": true, "helpfulness": "0/0", "author": "Kathy Russell"}]