[{"rating": 5.0, "review": "Everything I had expected.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "Great for adding quality programming for our kids.", "verified": true, "helpfulness": "0/0", "author": "Greg Blache"}, {"rating": 1.0, "review": "I wish I could give this product zero stars. It was defective right out of the box. It would not stay powered even with the power adapter plugged in. And then there's Roku customer service.... Horrible.", "verified": true, "helpfulness": "0/0", "author": "Tracy Price"}, {"rating": 4.0, "review": "When I tried it on a TV next to the wireless modem it would not work. I tried it on another TV in another room and it works great. I guess there was to much interference in the room with the modem.", "verified": true, "helpfulness": "0/0", "author": "Sockeye"}, {"rating": 1.0, "review": "Does not work! The frustrating part is we didn't use it until after the 30 days (it was a bday gift) and now we can't exchange it or get out money back.", "verified": true, "helpfulness": "0/0", "author": "mom2many \"mom2many\""}, {"rating": 5.0, "review": "Works good for now, also have a ROKU 3 on another tv in house, not much difference in performance. Locked up once, but that seems to be the nature of these devices if you mess around plugging and unplugging power on these. Like any solid state device unplugging  and plugging in again resets them", "verified": true, "helpfulness": "0/0", "author": "J. Rein \"Tape watcher\""}, {"rating": 5.0, "review": "The stick works great,  This is my second stick purchase and I can't imagine how I lived without one before purchasing my first Roku Stick.  Awesome product, plus its plug and play, so very simple to use for Netflix and Hulu, plus there are tons of free channels as well.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "D Baker"}, {"rating": 4.0, "review": "works perfectly.  Love ROKU", "verified": true, "helpfulness": "0/0", "author": "Maria Hollander"}, {"rating": 5.0, "review": "Love Roku, I do miss some live tv but am adjusting well to the available programs/movies and much less cost than a cable bill.  I don't see the need to get anything above the stick.  Highly recommend to anyone cutting the cable cord.", "verified": true, "helpfulness": "0/0", "author": "1Cash"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "NeNe"}]