[{"rating": 3.0, "review": "Not really wireless like I thought it would be. I have to plug in the wired battery for every use.", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 1.0, "review": "Apparently \"Certified Refurbished\" means completely defective. I would advise you to purchase the brand new model.", "verified": true, "helpfulness": "0/0", "author": "Michael A"}, {"rating": 2.0, "review": "This is a great idea, it just doesn't work well. I had two main problems: 1) It's PAINFULLY slow, and 2) the remote regularly \"falls asleep\", stops working, and I had to remove and reinstall the batteries to get it working again. This happened 5-6 times during the setup process alone. I returned it and bought a Roku 2.", "verified": true, "helpfulness": "0/0", "author": "Bryce Hales"}, {"rating": 5.0, "review": "Had to call Roku technical support because my TV was acting up.  Their support reps are very nice and got my stick working in no time.  I just connected it, so I haven't seen all the content available, but so far, looks like it has a lot of choices.  I will add to this comment after I test a few channels.", "verified": true, "helpfulness": "0/0", "author": "BlueMoon"}, {"rating": 2.0, "review": "It stopped working after a couple of months.  The remote is defective.", "verified": true, "helpfulness": "0/0", "author": "georgia bronson"}, {"rating": 5.0, "review": "Excellent product. Got it promptly and am very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Queenie \"WW1Hist\""}, {"rating": 5.0, "review": "Got this for a friend because we like our so much. It's easy to see why Roku is taking over the world.", "verified": true, "helpfulness": "0/0", "author": "Haynes Family"}, {"rating": 4.0, "review": "I get Nexflix just fine, but am trying to figure out if I need to remove it from the TV in order to watch just the TV.", "verified": true, "helpfulness": "0/0", "author": "Elaine Lapinoja"}, {"rating": 1.0, "review": "Roku Streaming Stick - Great If You Own Shares of DuracellWe have purchased and tested two Chromecast sticks, the Amazon stick, a single Roku 3, and just recently, the Roku streaming stick.All items function as expected, and out of all of them, our preference was the Roku streaming devices.....with one large caveat for the Roku streaming stick.  It seems we have to change out the batteries in the remote every 2-3 days, and we use it very little.  We tried different battery brands, and we even went to rechargeable batteries.  Then we did some research.It seems the Roku streaming stick remote operates differently than the other Roku devices.  The streaming stick remote uses wi-fi to connect to the streaming stick.  We can envision this as a better solution for controlling the stick, with the exception that the battery drain is horrendous.The remote for the Roku streaming stick will NOT function with the Roku 1, 2, or 3.Our Roku 3 is about a year old, and it still has the original batteries.  But the Roku 3 remote does NOT use wi-fi to connect to the Roku 3.This may be a defect in our unit only, but we have seen multiple postings regarding the extremely short battery life for the remote of the Roku streaming stick.We are taking our unit back for a refund/exchange, but if the new remote for the streaming stick shows the same issues, we will take the unit back, and write off this Roku unit, until the issue is fixed in the future.....but we will not go out of our way waiting/looking for resolution....if Roku wants our business, it will need to come looking for us...and send us a check for the last dozen batteries we wasted on this unit...and all the wasted time troubleshooting a vendor/manufacturer issue...Good luck...", "verified": false, "helpfulness": "0/0", "author": "E. T. Purtell \"Nitehawk\""}, {"rating": 2.0, "review": "Works, but the cable heats up, afraid it might start a fire. Always disconnect after an hour or two. Streaming pause often on some channel.  It uses a lot of your Internet gb.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]