[{"rating": 3.0, "review": "It's ok, I guess the one I purchased was refurbished. So the sound is kinda funky sometimes but a restart through the GUI makes it work!", "verified": true, "helpfulness": "0/0", "author": "Hurpa"}, {"rating": 5.0, "review": "Great for streaming and games", "verified": true, "helpfulness": "0/1", "author": "Erez A. Korn"}, {"rating": 5.0, "review": "Great item, works perfectly and I use it all the time.", "verified": true, "helpfulness": "0/1", "author": "L. C."}, {"rating": 2.0, "review": "Ugh, I hate this thing.We have a Roku LT and a Roku 3 that we've used for 2 years with no problems - they're just amazing. So when we bought another TV for the basement, we knew we'd go with Roku over Google or Apple. This time, we decided to get the stick.BIG mistake.The remote has a mind of it's own and is extremely testy. If you aren't aiming it at PRECISELY the right spot, it won't work. (With our other Roku players, you can use the remote from anywhere in the room.) The remote also takes off and scrolls on its own about 2-3 times per use. You'll be pressing the down arrow on Netflix and then it just starts SOARING through the menu. I have read this complaint from others about this particular model as well.Sometimes the menus don't even work. You'll push the up arrow to go up, but the menu will go down. Press the down arrow just to see, and it will still go down. The remote doesn't know its arse from a hole in the ground.I have changed the batteries in the remote several times, trying different brands each time, and NOTHING has made a difference. I don't know what Roku was thinking when they put this model through quality control, but it's a piece of crap. STAY AWAY!", "verified": false, "helpfulness": "0/0", "author": "Anya Wales"}, {"rating": 5.0, "review": "daughter love it", "verified": true, "helpfulness": "0/2", "author": "Teresa A."}, {"rating": 5.0, "review": "Exceeded my expectations", "verified": true, "helpfulness": "0/1", "author": "Rochelle McDonald"}, {"rating": 5.0, "review": "Easy transaction.  Received product in excellent condition. Works great and the family loves it.", "verified": true, "helpfulness": "0/0", "author": "rdgermany"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/1", "author": "JB"}, {"rating": 5.0, "review": "Have not hooked up this one yet, had one previously love it, sold it (mistake) and I'm sure I will love this one as well.", "verified": true, "helpfulness": "0/1", "author": "Brenda J Roberts"}, {"rating": 3.0, "review": "Thanks", "verified": true, "helpfulness": "0/1", "author": "tony tricollie"}]