[{"rating": 2.0, "review": "The streaming stick works well and was easy to set up.  I previously had a Roku 2 and was quite happy with it.  The reason I purchased the streaming stick is it supports screen mirroring from my phone and this is a neat feature for watching YouTube, etc.  The reason for the 2 star review is that the remote control does not work well at all.  It constantly looses it's connectivity.  I have found that I remove the battery cover, take out the batteries and re-install them it reconnects and functions fine...for about 30 minutes.  While watching TV through Roku I sometimes have to repeat this process 3-4 times and evening.  I called customer support and they walked me through the process (this took about 40 minutes on the phone) of disconnecting the remote and then pairing it again with the streaming stick.  I was excited...this seemed to work....for about a day.  Now I'm back again where I started.  I never had this problem with the Roku 2 remote.  Also the Roku 2 remote took 4 AAA batteries, had a jack for headphones and felt generally of better quality.  Why make such a poor remote for such an otherwise good device.  Bad! Bad! Remote....", "verified": true, "helpfulness": "1/2", "author": "Jeff Schmidt"}, {"rating": 5.0, "review": "An excellent product  Easy set up. Great remote response  love it", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "Ability to pick up wifi could be better. I tend to get laggy/slow loading videos unless it's in the same room as the router.", "verified": true, "helpfulness": "0/0", "author": "Tammy Carter"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Dman"}, {"rating": 5.0, "review": "I love it if you have excess to Wi-Fi, its super cool there is lots of free stuff on it you able to watch, I can recommend it to anyone who is looking for alternate to cable", "verified": true, "helpfulness": "0/0", "author": "zoltan kopa"}, {"rating": 3.0, "review": "I like the idea but the stick is kinda on the slow side.  takes longer to load apps than my other roku 2.  Freeze up a lot too when trying to load netflix", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome, works great, no issues at all.", "verified": true, "helpfulness": "0/0", "author": "Huntman"}, {"rating": 5.0, "review": "I love this!! It is so easy to set up and use. It is so much better then having a gaming system with all those cords. I am so pleased with this product.", "verified": true, "helpfulness": "0/0", "author": "Cassidy Nelson"}, {"rating": 3.0, "review": "Disappointed with the remote control. It did not work properly. I contacted ROKU directly and they were no help.Overall, streaming is GREAT! I love it. I recommend you purchase the Square Trade Warranty along with the product.", "verified": true, "helpfulness": "1/1", "author": "S. Hatfield \"Sheikstamps\""}, {"rating": 5.0, "review": "Love the Roku!", "verified": true, "helpfulness": "0/0", "author": "Ellie Lutovsky"}]