[{"rating": 1.0, "review": "Did not function right out of the box. So much for being refurbished.", "verified": true, "helpfulness": "0/1", "author": "James Hendrock"}, {"rating": 4.0, "review": "Start-up is a bit slow, but that is probably because the Roku Stick comes on with the TV (USB power source utilized). Other than that, I love my Roku. The remote is a bit slow as well, but it is nice that you don't have to point at the TV for it to work.", "verified": false, "helpfulness": "0/0", "author": "Stephie K"}, {"rating": 1.0, "review": "Quite simply this product sucks.  Roku is pretty awesome, but the technology for the stick just isn't there yet.  TWICE (I exchanged the first one) I had it plugged in for about a week when it started intermittently streaming in the middle of shows and would never pick up where it left off.  The navigation through the applications got slow and the graphics wouldn't load quickly.  Eventually, it quit working all together.  The stick itself was burning hot by the end of the week so I'm guessing something is burning out inside it.  Don't waste your like I did (I can no longer return it), go for Roku 4 and speak the extra $50.", "verified": true, "helpfulness": "0/0", "author": "Kacy Ray"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "DareDave"}, {"rating": 1.0, "review": "Do not buy! These products over heat and freeze with short periods of use. I called customer support with a 15 minute wait and spoke to some guy in India(?). I told him my product over heats and then freezes. After 20 minutes of giving him information he told me that if it happens again to call back. That's why I called in the first place! My product was only 2.5  months old. I had to keep unplugging my device to let it cool down. Note that I only use it a few hours a day or so, usually less, but it always freezes when over heated from watching videos; with some days it freezes about 3 times in under 2 hours.The worst customer support and horrible device design. As an IT guy it was apparent of the problem that they failed to replace. I do not recommend this product and will likely be switching to Amazon Fire TV.I bought this at Costco in July bundled with my 55\" inch LED JVC tv on sale.", "verified": false, "helpfulness": "1/2", "author": "Adam Herrera \"Adam Herrera\""}, {"rating": 4.0, "review": "We are using it for the free channels and some sports. Beware though NFL and college ball is limited on this to clips. There is occasionally a game that I can watch on NCAAF and it will show the whole game in some occasions but its not a true replacement for rabbit ears (local channels) and/or cable, and satellite. We use NETFLIX mainly with this and it has been great for the kids channels. Our bill is now 9.00 a month for NETFLIX and the channels this comes with are free. Satellite was 105 dollars a month plus. This is just a better entertainment value outside of live football games.", "verified": true, "helpfulness": "0/0", "author": "brandonrf"}, {"rating": 5.0, "review": "Love it. Much better than the other.", "verified": true, "helpfulness": "0/0", "author": "Anne Haller"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Johanna"}, {"rating": 2.0, "review": "If you want to stream you’re better off going with the Roku 3. The CPU power on the stick is lagging and 50% of the time non-responsive. Also, My Samsung television would not power the Stick through the USB port since the SS wanting to keep powering off and on. I had to use the Adapter that came with the product. Roku 3 is the best option. Stay away from the 3500R.", "verified": false, "helpfulness": "0/0", "author": "Rau Bruner"}, {"rating": 5.0, "review": "Turning my TV into a smart TV was as easy as plugging in a USB in the back of my TV. It works incredibly well and is an extremely inexpensive alternative to a smart TV. I recommend it to everyone. It even comes with a remote for easy access.", "verified": true, "helpfulness": "0/0", "author": "P. Izzo \"M.I.\""}]