[{"rating": 2.0, "review": "The remote doesn't pair with the tv consistently.", "verified": true, "helpfulness": "0/0", "author": "Farmer's Daughter"}, {"rating": 4.0, "review": "Could not find a connection until I got the free extension cable from Roku.", "verified": true, "helpfulness": "0/0", "author": "Mattsy"}, {"rating": 3.0, "review": "Do I have to have internet for this to work", "verified": false, "helpfulness": "2/4", "author": "Victor"}, {"rating": 5.0, "review": "this is a great product, works good, hundreds of free shows to watch,great packing. info was great too. good price,thks", "verified": true, "helpfulness": "0/0", "author": "Amira55"}, {"rating": 5.0, "review": "Works great!!  We stream so many channels on it, and we hardly ever watch regular TV anymore.  It is fabulous!", "verified": true, "helpfulness": "1/1", "author": "LM"}, {"rating": 4.0, "review": "I have two of these sticks now on two different tvs in different homes.  This is my second one, and for whatever reason it's not as good as the first one I bought.  Waking it up takes up to 5 minutes sometimes, and then once I do get it out of \"screen saver mode\" it takes another couple of minutes or a few too many frustrated taps of the arrow buttons on the remote to get things going.  Once it does, everything's fine.", "verified": true, "helpfulness": "1/1", "author": "AFV"}, {"rating": 5.0, "review": "Works perfectly.  This little gem has enabled us to get rid of our costly cable service.  Plus, there are many, many channel selections offered through Roku.  Highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Deana L Mahedy"}, {"rating": 4.0, "review": "I really like it but it sometimes disconnects on its own.  If you're setting up use your computer not a tablet.  Roku didn't recognize the setup code from a phone or tablet.  The on phone help sorted it out though. I have had to reset the remote twice now in just a few days.  Once it's connected it's great!", "verified": true, "helpfulness": "0/0", "author": "P. Strong"}, {"rating": 5.0, "review": "Quality product shipped real fast and it works great.  Time Warner App is the best!", "verified": true, "helpfulness": "0/0", "author": "Gary Brown \"K4GPB\""}, {"rating": 5.0, "review": "Second Roku purchase. getting one more for my room, I absolutely love it and wish I'd bought sooner! very easty to setup-just plug it in, turn to HDMI 1 and off you go. Goodbye huge cable bill!!!", "verified": true, "helpfulness": "0/0", "author": "Marybf61"}]