[{"rating": 5.0, "review": "I purchased on March 24, 2014 and have enjoyed it very much until the remote stopped working.  Yes, I checked and replaced the batteries.  Went to customer service chat and they had me up and running in minutes.  The remote had to be repaired with the stick device which is a simple procedure.", "verified": true, "helpfulness": "0/1", "author": "Big Tex"}, {"rating": 5.0, "review": "This Roku shipped on time and works like i thought it would. Cost less than my Roku3 and does everything i need it to do.", "verified": true, "helpfulness": "0/0", "author": "tina"}, {"rating": 1.0, "review": "This product lasted four months and then ceased to function. During this period of time I had to reset it several times a day. I would not recommend spending your money on this product. I am going to try Amazon Fire next.", "verified": true, "helpfulness": "0/1", "author": "John J. duffus"}, {"rating": 1.0, "review": "Read bad reviews and am too scared to buy this one.  After all I am not asking for trouble!  With my luck, freezing the tv is not what I am looking for and of course if customer service is a problem, why bother. Will continue to use amazon fire stick until I want to spend the money on a real smart tv.", "verified": false, "helpfulness": "0/11", "author": "T. KASPER \"casper\""}, {"rating": 5.0, "review": "This little gadget rocks!  Does everything I want and a whole lot more. Love being able to use it with my videos and photos thru Plex.", "verified": true, "helpfulness": "0/0", "author": "DeeGee"}, {"rating": 1.0, "review": "stopped working within less than half-an-hour...", "verified": true, "helpfulness": "0/3", "author": "West Hollywood"}, {"rating": 5.0, "review": "I have much more flexibility in choosing what I want to watch and when. Very satisfied with the ROKU Stick. It was easy to setup and start streaming with much ease.", "verified": true, "helpfulness": "2/2", "author": "Jerry Lynn Harrison \"Jerry Lynn Harrison\""}, {"rating": 4.0, "review": "excellent", "verified": true, "helpfulness": "1/2", "author": "Mack"}, {"rating": 4.0, "review": "very good Ruku very fasst I like this products", "verified": true, "helpfulness": "1/2", "author": "RODOLFO CACERES"}, {"rating": 5.0, "review": "I have only had the product for 1 1/2 weeks but am loving it so far, works well and was easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "Katya"}]