[{"rating": 5.0, "review": "I love love love this! It's way better than my Chromecast was. I can download a million more apps. It's more similar to my Apple TV but I wish I would have saved some bucks and bought the Roku before I spent $100 on Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Angela Thomas"}, {"rating": 5.0, "review": "Keeps my kids off of my television.  Just plug and connect to your wifi.", "verified": false, "helpfulness": "0/0", "author": "Keithw"}, {"rating": 1.0, "review": "A piece of JUNK, constantly searching, resetting and slow.  Do not waste your money.", "verified": true, "helpfulness": "0/0", "author": "Delland P Sinclair"}, {"rating": 4.0, "review": "It works fine.", "verified": true, "helpfulness": "0/0", "author": "James J. Spe"}, {"rating": 5.0, "review": "Easy set up, reliable and fast. No ugly boxes. Convenient RF remote control.", "verified": true, "helpfulness": "0/0", "author": "Michael Naranjo"}, {"rating": 5.0, "review": "Just awesome.  Very easy to use and has something for everyone.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Jared Mars"}, {"rating": 4.0, "review": "This stick is slower than a regular Roku but you also don't have to worry about cords or a device footprint.  The slowness is mainly during the start up process, so once it gets going there are no issues.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 1.0, "review": "The stick was purchased for my husband who works out of town and he can't understand, after trying to use the stick, why I am a fan of Roku.I have a Roku box that works beautifully so, for ease of use and esthetics, I decided to try the Roku stick (even though I read many negative reviews about the stick).It is slow to load but, not terrible.  The remote works intermittently.I saw reviews that concerned this problem (and then forgot about them, until the same thing happened with this stick) and ordered the stick so there is not a lot of clutter around the TV.It seems to work whenever it wants, being 15 feet from the modem, I don't find this acceptable.It constantly requires rebooting to pair with the remote, even changed the batteries twice to make sure it wasn't operator error.Some reviews said that if there was a line of sight between the stick and the remote it worked.  Not this one.  You can point the remote directly at the stick and it still won't work.The Roku boxes work great.  No explanation for the \"hit and miss\" stick.Very disappointed.Like others, I considered this a learning experience and elected not to return it.  Dealing with poor customer service on returns would be insult to injury.", "verified": true, "helpfulness": "0/0", "author": "kk"}, {"rating": 1.0, "review": "I tried numerous times to connect, unfortunately the unit was never able to connect to Roku service.  There is also no support phone numbers listed in the documentation included with the package.This is the first time I have had problems with Roku, I've purchased four units including this one and they have all be easy up to now.", "verified": true, "helpfulness": "0/0", "author": "Rose Collum \"Rose\""}, {"rating": 5.0, "review": "I wasn't sure if this would work out, my router is on the the second floor and the tv I'm using this on is in the basement, but i have not had any problems with it.", "verified": false, "helpfulness": "0/0", "author": "kneata"}]