[{"rating": 1.0, "review": "The remote doesn't connect to the stick and while using any app, if it ever connects, it takes FOREVER to load.", "verified": true, "helpfulness": "0/0", "author": "Rahm"}, {"rating": 5.0, "review": "Fantastic product and easy to use", "verified": true, "helpfulness": "0/0", "author": "Karen J. Robinson"}, {"rating": 5.0, "review": "The Roku has been great no problems at all since I have had it", "verified": true, "helpfulness": "0/0", "author": "rafe"}, {"rating": 5.0, "review": "I love Roku and up to now had the boxes.  This streaming stick is perfect and I am enjoying quality TV every day.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Mary E"}, {"rating": 5.0, "review": "There are not too many $50 gifts that will ever get as much use as this.  Everybody knows Roku is great, so I'll just shut up now.", "verified": true, "helpfulness": "0/0", "author": "Smack Adams"}, {"rating": 5.0, "review": "Once I got help with the remote (directly from Roku techies), the stick works great.  I had to change the channel of my wireless router to get the remote to work.  There was some other router adjustment they wanted me to make, but it was bogus.  I'll dig out the notes and fill in the info later.  We got Roku in order to access Acorn media, and it's been very nice -- have used the phone app also (instead of the remote) so that I can type in the search bar instead of the clunky on-screen typing method.", "verified": true, "helpfulness": "0/0", "author": "J. Straw"}, {"rating": 5.0, "review": "I really love my roku!  It was easy to set up and works like a charm!!", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "WOW The Roku has really expanded our TV viewing. More TV and movies for a lot less money.", "verified": true, "helpfulness": "0/0", "author": "Traditional Nana"}, {"rating": 5.0, "review": "I've never had a problem with the stream time. I use it mostly for Netflix and Amazon Prime so the quality is as good as my internet speed. I haven't used it for Hulu yet. Overall, I'm extremely happy with this. My roommate bought one for her room less than a week later.", "verified": true, "helpfulness": "0/0", "author": "Krystal S"}, {"rating": 4.0, "review": "The item was great, arrived quickly the only weird, weird thing that would have made me send this back had I been in a restaurant was the 2 foot long hair that was wrapped around the remote inside the box. That is not a reflection on the product, this roku feels like the best combination of the chromecast & apple tv all rolled into one (own both). Speed is a bit lacking, but can't complain for $40 (refurb price). The miracast/mirroring functionality isn't all that great, but the channels are good. Not quite as polished as on the Apple TV, start up time for the apps is slow I guess that's because of the CPU/RAM in the stick. I'll probably upgrade to a roku 3 before the end of the year, now that the new one is out. If you're deciding between this and the chromecast, get both. If you're deciding between this and apple tv, unless you want HBO Now, get this. If you're deciding between this and a higher end roku, go higher end, esp if you're paying full price for the roku stick.*updated* Maybe it's because I have the refurb version, but this AM the thing was \"stuck\" in an app. So I pulled the power and now it's stuck in a bouncing Roku loop. Goes for a bit, reboots, bounces for some more. reboots. Lather rinse repeat. I still love the software, worked great over the weekend for Game of Thrones and being able to use the TWC app on my TV that doesn't have a cable box was great. I think I'll be stepping up to the roku 2 sooner than later.", "verified": true, "helpfulness": "0/0", "author": "R. Li"}]