[{"rating": 4.0, "review": "I own this and the roku hd. This stick is easy set up, but not as smooth as the roku hd. I only  use  it  for  netflix and amazon prime. Good so far but only  issue is once initially set up, needed software update right away. Remote sometimes doesnt work, i had to google a fix for it during set up  but if used with galaxy s4 rroku remote app, its easier. Usb cord power cord to power it up as plugged into the tv is a bit short. Luckily mine are close together otherwise comes with a cord that can be plugged into an outlet.", "verified": true, "helpfulness": "0/0", "author": "Kate Ann \"Kate\""}, {"rating": 5.0, "review": "Refurbished stick works like new! Apps are really user friendly, great product!", "verified": true, "helpfulness": "0/0", "author": "Judy Beazer"}, {"rating": 2.0, "review": "I bought this device because it included a remote compared to the chromecast and its relatively small so I dont need to to have another box below the tv.  But, after trying if for some time, I would prefer having a more powerfull player instead of the stick, since the stick is just too slow for me.", "verified": true, "helpfulness": "0/0", "author": "jaime j. carreras"}, {"rating": 5.0, "review": "Awesome! There are so many channels to choose from and I love that I was able to download the remote onto my phone. Plus no wires is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Ashleigh"}, {"rating": 1.0, "review": "This product is not currently working only work for 1 month", "verified": false, "helpfulness": "0/2", "author": "Ken DeGourville"}, {"rating": 2.0, "review": "If I would have written a review in the first days of owning this I would have been more positive.  But at the 6 month period,  I wish I would have bought a regular Roku. I have owned  Roku 2 for a couple of years and been pleased.Con:Performance lags far behind older Roku systems.Remote is less responsive than other Roku systems.After 6 months, my Roku stick is a piece of junk that fails on Netflix and Amazon.Pro:It's small", "verified": true, "helpfulness": "0/0", "author": "Bruce \"BN\""}, {"rating": 4.0, "review": "Works better than I thought it would.  One thing that I found out is that if you use this with an extra TV USB port for the power, then it reboots everytime you turn your tv on and off so you have to wait sometimes.  Of course, you can always use the power adapter that comes with it.", "verified": true, "helpfulness": "0/0", "author": "Milt"}, {"rating": 5.0, "review": "I purchased this for my husband for Christmas and we LOVE it!! We stream our Netflix and HBO through through it.  We can find shows we love on YouTube as well and it plays from our phones to the TV.  I can't say enough great things about our Roku!", "verified": true, "helpfulness": "0/0", "author": "jmpaugh"}, {"rating": 5.0, "review": "I love this thing!! It has opened an entire new world to us.. a more flexible, cheaper and personalized option to cable TV", "verified": true, "helpfulness": "0/0", "author": "Kimberlee Volm"}, {"rating": 1.0, "review": "After days of trying to install this stick I am returning it.  Either the remote didn't work or it would work and it would complete the Roku installation but then gave me a code 011 message which was disconnect and reconnect the streaming stick and if that didn't work, disconnect and reconnect the stick and the modem and if that didn't work contact Roku support.  Too frustrating, I'm going to try the Amazon Fire Stick hopefully with better results.", "verified": true, "helpfulness": "2/2", "author": "Kathryn Lester"}]