[{"rating": 5.0, "review": "No wires no problems!", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 3.0, "review": "I like it.  It works but since entirely dependent on your wifi it does take too long to load and buffers too often. The one 15ft from my access point takes the longest. I purchased three of these because they are portable and easy to hookup.", "verified": true, "helpfulness": "0/0", "author": "slowbutsure"}, {"rating": 5.0, "review": "Great Product! Wish I found this a long time ago.", "verified": true, "helpfulness": "0/0", "author": "William Franz"}, {"rating": 5.0, "review": "Received item as expected, good packaging.", "verified": false, "helpfulness": "0/0", "author": "Alana"}, {"rating": 4.0, "review": "The user interface is a bit sluggish when compared to my Roku 3, but for it's size and cost it's still a great way to add streaming media to an alternate TV.  For your primary media center or TV, I would still recommend the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "CodingGorilla"}, {"rating": 2.0, "review": "It won't let you stream anything you are watching on your iOS device or laptops, so it can't replace an Apple TV, or even a Chromecast for that matter. Not worth it.", "verified": true, "helpfulness": "1/2", "author": "Don Tripper"}, {"rating": 5.0, "review": "Same performance as the Roku 3, but far less cost and no games. We didn't use the games on the Roku 3 that we had, so I bought one of these for a tv in a spare room. Terrific product - cut the cable!", "verified": true, "helpfulness": "0/0", "author": "rattmeis"}, {"rating": 2.0, "review": "The stick did not work in the portion of the home we needed it to as it would not connect to the Internet properly.  After a frustrating hour plus of trying to install it and reading troubleshooting web pages I came across a suggestion to try to install the stick on a tv physically closer to the internet router.  I thought this was strange since all my other devices access the wifi well from the location I wanted the stick to work in.  When I tried the suggestion it worked great, connected to the Internet and was able to be installed.  I then took it back to the tv in the location of the home I needed it and it failed again.  I returned the stick.", "verified": true, "helpfulness": "1/2", "author": "Nihilism"}, {"rating": 5.0, "review": "Great product. Thinking about using only a Roku and cutting cable.", "verified": true, "helpfulness": "0/0", "author": "Julie Shaw"}, {"rating": 3.0, "review": "Its slower that Roku 3/HD. It takes time to transmit the commands like play/pause etc.I have 50MBPS line and AirPort.", "verified": true, "helpfulness": "0/0", "author": "Vinant Pandey"}]