[{"rating": 2.0, "review": "I got this to cut corners and save some money rather than paying for cable. I am definitely not impressed with this as it lost audio for shows, which is the reason I got it. I learned long ago that you can not improve an original. I did not live by that phrase when I purchased this. 2 days with flawless streaming with audio. Now, nothing. I will be paying for cable which will work beautifully by the way! Technology is a sinking ship.", "verified": true, "helpfulness": "0/0", "author": "scmunks"}, {"rating": 5.0, "review": "less tech oriented? this the alternative the Chromecast for you. this thing is dummy-proof, very easy to use, has not flawed yet.", "verified": true, "helpfulness": "0/0", "author": "adam breznicky"}, {"rating": 4.0, "review": "So we've been using the Xbox to get to all these apps we use but we wanted something a little more convenient that would give us quicker access.. Decided to try the roku streaming stick out because it's small and just attaches to the TV.Easy set up and your apps are right there as soon as we turn the tv on. We chose roku over the chrome one because of the TWC app. Works great, just takes a while to load up apps.The only downside to it is that the stick itself has to be plugged into an external power source. Luckily my tv has a USB port but I initially thought you just plug the stick in and that's it. Not a big deal but the cord is really long. I've seen some modified cords online that are designed for a shorter distance between the roku and usb so I'll probably look into one of those, but I wish it just came with that from the start. Also, if you plug it into a wall the roku is constantly on, cause there is no on/off, which I don't really like. At least when it's plugged into the TV it goes on and off with the TV.And unfortunately we can't use this on one of our TV's because it won't fit. The stick alone will fit but it won't fit with the cord plugged in.. So make sure it'll fit (both stick and cord) before you buy it!", "verified": false, "helpfulness": "3/3", "author": "L. Slovin"}, {"rating": 2.0, "review": "It worked albeit spotty for less than year. Now it's frozen..not sure if the remote is the problem or if the stick is not completing a connection. Past the return date so seems I'm stuck. Guess I'll try their customer service ugh..", "verified": true, "helpfulness": "0/0", "author": "starr"}, {"rating": 5.0, "review": "Easy to install and up and running in minutes", "verified": true, "helpfulness": "0/0", "author": "Belinda Hunnicutt"}, {"rating": 5.0, "review": "How convenient that I can unplug and take to another room. And...you can download the app on your phone for a remote.", "verified": true, "helpfulness": "0/0", "author": "christina"}, {"rating": 5.0, "review": "Works great! Was easy to set up and start using. And I'm not technically inclined at all.  We stopped our cable service and will save close to $1300 a year on cable fees.  I use our $99 annual amazon prime account.", "verified": true, "helpfulness": "0/0", "author": "Karen J."}, {"rating": 5.0, "review": "Works great.  No complaints or issues.  This device can turn your high definition t.v. into a \"smart t.v.\".  Actually, it performs far better.", "verified": true, "helpfulness": "0/0", "author": "Dan Hawks"}, {"rating": 5.0, "review": "great price", "verified": true, "helpfulness": "0/0", "author": "tskywalker"}, {"rating": 5.0, "review": "Great little device. Cut cable and satellite. Access web easily Fast and comprehensive..", "verified": true, "helpfulness": "0/0", "author": "DanC"}]