[{"rating": 2.0, "review": "Working in mexico?", "verified": false, "helpfulness": "0/0", "author": "MARZOLLA G."}, {"rating": 5.0, "review": "Great for Netflix and Hulu!", "verified": true, "helpfulness": "0/0", "author": "Yesenia Vargas"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Scott Werthmann"}, {"rating": 2.0, "review": "Your remote sucks!! This would be an entertaining device, yet i'm only giving three stars. You wonder why? I think my first statement argues why. Every so often, meaning every time I reach for the remote, it does not register with the stick. Previous times I believed it was due to batteries. I would grab brand new batteries and put them, then the remote would work. Upon viewing other programs, I would notice the remote was not working again. At this point and it's been a few months, I now rotate the batteries in order for the remote to work. While watching a show, the remote can become unresponsive, so I have to rotate again. This is a pain in the bum, so keep this in mind prior to buying. If you are ok with this process, buy it, it's pretty cool aside from that super annoying process.", "verified": false, "helpfulness": "2/2", "author": "Tyrone Fain"}, {"rating": 5.0, "review": "I purchased this device and absolutely love it! I plugged it right into the television and it works perfectly. There is no box, wires or clutter. It has all of the features that I love about Roku. One of the features that I love the most is that it plays You Tube videos! This device is easy to use and affordable.", "verified": false, "helpfulness": "0/0", "author": "Jeanne Cervantes"}, {"rating": 5.0, "review": "less space and more great moives", "verified": true, "helpfulness": "0/0", "author": "Valerie Banks"}, {"rating": 5.0, "review": "Works great. My TV is now a smart tv practically", "verified": true, "helpfulness": "0/0", "author": "David M."}, {"rating": 5.0, "review": "nice and simple", "verified": true, "helpfulness": "0/0", "author": "Jahangir Eshrati"}, {"rating": 1.0, "review": "It is almost worthless outside the US. Even through a VPN connection is struggling. Buy Chromecast, Amazon or Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Fabio Ramos"}, {"rating": 5.0, "review": "quick set up", "verified": true, "helpfulness": "0/0", "author": "robert salazar"}]