[{"rating": 4.0, "review": "Great addition to your media - the streaming stick is an inexpensive buy that provides easy access to great programming (Netflix, Amazon Prime, ESPN are my go to channels) and has easy setup. Biggest downside is the onscreen interface - a lot of levels to navigate and cluttered. Overall, it's a good way to start trimming the cord", "verified": true, "helpfulness": "0/0", "author": "Tony F"}, {"rating": 5.0, "review": "We bought the Roku Streaming Stick for our new dumb TV. We have a Roku XD in our bedroom and it works pretty well, so we thought we would get the Streaming Stick for the new TV. Overall, I think the Streaming Stick is a big upgrade over the XD. It is faster, holds better connectivity to the wifi (even though the XD is 10 feet and one whole floor closer to the router), it has a prettier and more responsive interface, and it was the most affordable option at the time that we purchased it.My biggest surprise when opening the Streaming Stick was that it has to be plugged into the wall. It wasn't a problem, but I simply did not see that when purchasing the unit. It makes sense that it does, but just be aware that if you purchase this item, you will need to plug it into the wall (or, I believe, you can power it via the the USB port in your TV if you have one).Overall, great product. Love the fact that I can control both of my Rokus with an iOS app. Good stuff.", "verified": true, "helpfulness": "0/0", "author": "M. Martin"}, {"rating": 5.0, "review": "Bought this for my dad and his girlfriend for Christmas... They are obsessed with it! Easy to set up and use. I like the simplicity of the remote as well. Perfect for old people", "verified": true, "helpfulness": "0/0", "author": "Shelby"}, {"rating": 4.0, "review": "Nice unit, perfect in every way except one: the lengthy special offers aren't included since a refurb technically isn't new. For example:  The Hulu Plus offer dwindled to one free week compared to the three months offered with a brand new unit.  The trial periods are of great interest to me because I am looking at ultimately ditching my TV service, and Hulu Plus looks like an integral part of the process.  Sadly, the unit is going back.", "verified": true, "helpfulness": "0/0", "author": "CityGirl"}, {"rating": 5.0, "review": "Wonderful piece of equipment- far more superior than anticipated. This product is not only user friendly, but accessing desired cinamatic experiences allows viewers options like never before.", "verified": true, "helpfulness": "0/0", "author": "Alicia"}, {"rating": 5.0, "review": "The only thing that could make this product better is having the remote with integrated headphone jack included. But honestly, just buy it and ditch the cable company. Pair it with an RCA digital flat indoor HD antenna and you're set!", "verified": true, "helpfulness": "0/0", "author": "Michael Routen"}, {"rating": 1.0, "review": "It's as if it's in beta, the performance is terrible.  The last time I had to wait 5 seconds after clicking a button to see visual feedback was on my Windows 95 PC almost 10 years ago.  Seriously Roku, why did you even release this product?  I'm returning and grabbing a Roku 3.  Apparently I have to spend a full $80 to upgrade my Roku 2 just to get Netflix profiles.", "verified": true, "helpfulness": "1/1", "author": "Jozif"}, {"rating": 1.0, "review": "What a frustrating product.  Bought one of these for my mother-in-law for Christmas.  I never even got it fully set up.  I was able to connect it to the WiFi, it downloaded updates then promptly lost its connection with the remote and WiFi.  I then spent multiple frustrating hours searching forums and trying whatever random set of actions might fix it.  Being Christmas eve I had no expectation of raising support.  I finally just returned it to the place from which it came.  I have bought and configured many wifi devices without incident.  Will not buy another roku product again.", "verified": false, "helpfulness": "3/3", "author": "davesomebody \"Dave\""}, {"rating": 3.0, "review": "not sure what to expect but so far when it works its great, it at times is slow to respond or almost \"freezes\" not sure if this is the remote or the device its self.. for what it is I guess it does the job.. hope this problem does not get worse", "verified": true, "helpfulness": "0/0", "author": "ron"}, {"rating": 4.0, "review": "Works well for our Insignia TV. Easy to use Netflix with this.", "verified": true, "helpfulness": "0/0", "author": "JJT"}]