[{"rating": 5.0, "review": "works as advertised", "verified": true, "helpfulness": "0/0", "author": "norman"}, {"rating": 1.0, "review": "I am very disappointed with my Roku. It takes forever to load and barley ever works. I have had enough & wish I never even bought it to begin with.", "verified": false, "helpfulness": "0/0", "author": "brian stankus"}, {"rating": 1.0, "review": "I purchased this and problem started out of the box. The remote did not work correctly so I returned and exchanged for another one but the remote still having problem after 2 - 3 weeks!!! I owned Roku3 which was excellent but the Roku stick would be easier to carry around for travel. No, I would not recommend this item.", "verified": true, "helpfulness": "0/0", "author": "Split lane"}, {"rating": 1.0, "review": "First, the remote isn't infrared, it's some sort of wireless signal that is unable to penetrate the TV.  So if the dongle is behind the TV and you're in front, the remote doesn't work at all even if you're 1 inch away.  So I got an HDMI extension cable that lets the Roku dangle beneath the TV.  Now the remote works, but only within a 3 foot range.  You have to get out of your chair and get right up to the Roku for the remote to work.  And, assuming it's powered by your TV's usb, it takes a couple minutes to boot.  Then it takes another minute or so to start Netflix.  Then you have to walk right up to it to get the remote to work, and even then it takes several minutes to navigate because 90% of the time when you touch the arrow buttons nothing happens, and then suddenly the 'stick' and the pointer moves around on the screen way past what you want.  So you have to hit the arrow the other way about 10x before the pointer starts moving back, and repeat many, many times until you finally click what you want.Because of this screwy remote, it took about 15 minutes just to input my wifi ssid and password.  And don't even think about trying to type search results.On top of it, you cannot play local media.  I have vanilla h.264 files stored on my NAS.  I tried installing the plex media server on my Synology NAS (since there's an app for the player), but the Roku says every video file is an \"uncompatible file type\".  Then I installed some streaming software on my PC.  Same thing.  Roku can't play any of the video files.", "verified": true, "helpfulness": "0/0", "author": "Evodio Cruz"}, {"rating": 4.0, "review": "works great, easy setup....You just have to subscribe to services which can get pricey", "verified": true, "helpfulness": "1/1", "author": "Jim Briscoe"}, {"rating": 4.0, "review": "Had to cut the cord after comcast charged me WAY too much and claimed it was because my promotion ended.  Roku works well.  I mostly just watch netflix, and to be honest I don't miss crappy reality television at all", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Wasn't very sure when I ordered it, but since I have prime and also netflics I needed some way to watch it.  This product exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "Critterman \"John\""}, {"rating": 5.0, "review": "This replaced my Roku LT -- and is WAY better.  Not only does it have better output, but everything seems to work more smoothly.  In addition, I can mirror my laptop's screen and audio to my TV if I need to.  Nice bonus!", "verified": true, "helpfulness": "0/0", "author": "William Bliss"}, {"rating": 4.0, "review": "great item. Works good once within Wi-Fi zone", "verified": true, "helpfulness": "0/0", "author": "Lennox Jacob"}, {"rating": 5.0, "review": "awesome device, but make sure you have a subscription to a streaming video service, otherwise there isn't much to watch....although some tv networks are starting to make some channels, but you still need a cable/satellite subscription to view them\\i only gave it 4 stars because of the lack of content included (that you don't need to be subscribed to, and pay monthly for)", "verified": true, "helpfulness": "0/0", "author": "Matt \"M.A.R.\""}]