[{"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "makepeace247"}, {"rating": 4.0, "review": "This really is easy to setup and use. My Vizio TV has an HDMI port next to a USB port; so, the Roku and it's power source (via a USB  cable) connect without adding more wires behind the TV. The one thing that is missing is an Ethernet input. Connecting this device behind a TV may block its access to a WiFi signal and render it useless. I had to move an access point in order to connect.", "verified": true, "helpfulness": "0/0", "author": "Murph Sewall"}, {"rating": 5.0, "review": "Love the fact that it is wireless and discreetly hidden from view.", "verified": true, "helpfulness": "0/0", "author": "Familyman"}, {"rating": 4.0, "review": "Grate way to access apps to watch movies and tv shows", "verified": true, "helpfulness": "0/0", "author": "Eileen Wyatt \"Tweety\""}, {"rating": 5.0, "review": "Why pay cable prices when you can keep your money in your pocket.", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 3.0, "review": "The remote keeps disconnecting.  I feel like throwing it into the pool.  I push the buttons like my finger is going to go through the surface of the button and still nothing.  Have to reset it all the time.  I've defaulted to using my phone as the remote which is fine but often its dead by evening so it is on the charger.  The unit works great in our house, never buffers.  Build a better remote please.", "verified": true, "helpfulness": "0/0", "author": "Peter Keegan Jr."}, {"rating": 5.0, "review": "I have actually gotten 2 of these as gifts for other people. This was the first refurbished one and it works exactly like the new one I bought.I love the ROKU stick, you just have to understand what you're getting.  If your wireless internet isn't that great, then you may want to get a Roku that can hard-wire into Ethernet.  People who complain about not getting any \"bars\" must have wifi problems anyway.  This ROKU picks up wireless as well as my laptop and even better than my iphone sometimes.The other thing people complain about is this ROKU is slower than others.  Well it kind of is, sometimes. It takes forever to turn on. I recommend plugging the power into the wall, even though it seems cool and convenient to plus it into your TVs usb port (unless your usb port is powered even when you tv is turned off).  Otherwise the roku turns off every time your tv is turned off and on when it's turned on.  For every other ROKU they just recommend you leave it on all basically all the time.People also say that Netflix takes forever to load on the stick, which is also basically true.  The first time you load netflix after the roku is turned on Netflix will take a long time, like seriously maybe a minute to finally load.  But the good thing is once you've loaded it once it opens pretty much instantly (until of course you restart the roku which is another reason to plug it into the wall).The Netflix interface is just like the ROKU 3 and is much nicer than the older models, however, I believe this roku has pretty much the same processor as the old models so with the new Netflix interface things can sometimes be a little sluggish.  But I think it's worth it.  It really looks much nicer than the old ROKUs.  Every other channel loads in about the same time as an older model.If it's speed you're after there is no ROKU that will beat the 3, but this little guy is pretty awesome if you want to pay half the price and are a little more patient :)", "verified": true, "helpfulness": "5/6", "author": "Ryan Hitchell"}, {"rating": 5.0, "review": "One of the best items I purchased in a long time. I bought two of them and gave one to my mother who lives upstairs. She has no trouble at all streaming movies via WIFI. The connection is easy to make. Pretty much plug and play.I love it!", "verified": true, "helpfulness": "0/0", "author": "Ricardo G."}, {"rating": 5.0, "review": "I am a huge Roku fan - Because I use them with Simple TV to cut the cord - Roku are far ahead of just about everyone else in terms of apps and connectivity.  Use with Simple TV box to stream local HD TV content around your home.  Works so well!!  IF you are using wireless (only option with the stick) Try and be close to the router and if possible use a dual band with the 5 Gig network for best overall performance with Roku.", "verified": true, "helpfulness": "0/0", "author": "B. Morgan"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "Erin L. Carr \"E\""}]