[{"rating": 1.0, "review": "DO NOT BUY. What a letdown, Stick gets very hot,Controller is very buggy. Netflix is very slow compared to the ROKU 3. Sent it back yesterday and going to get an APPLE TV.", "verified": true, "helpfulness": "2/7", "author": "Larry J. Mcbeath"}, {"rating": 3.0, "review": "I bought one these because it has You Tube and is half the price of Roku 3.  I have an earlier version  of Roku which I've had for some time.  No problems with it and it loads many times faster than my Roku Streaming Stick (2014).  Seems like a step backward to me.  If  one isn't interested in You Tube I wouldn't recommend this over any other Roku unless the clutter of dangling cords is a real problem.  According an article I've read, You Tube will probably be picked by all Roku models in the future so maybe I gained nothing by buying the stick.Setup was really no more of a problem than my older Roku but either one was a bit of a pain.  If you don't have Roku and really want it I would suggest biting the bullet and going for another model.", "verified": true, "helpfulness": "1/2", "author": "burke \"RTB\""}, {"rating": 5.0, "review": "What can I say.  The product was as described and there were no issues at all.  Thank you very much!", "verified": true, "helpfulness": "0/0", "author": "Whiterock"}, {"rating": 5.0, "review": "I have a Roku2 a Roku stick, a wd network player and a chrome cast.The chrome cast got retired, because of its limiatations regarding formats it plays.The usability is good and fie for many things, but it can't play Amazon prime stuff and the usage isjust weird without a remote.The Roku 2 is great since the last update brought the Roku Media player that handles all kinds of files from my NAT (WD PASSPORT) it plays Netflix, Huluu and pretty much everything you throw at it.The stick, is pretty much the same as with teh Roku 2, works great and the foot print is really small, plus it has a remote, plays Amazon Prime, great little toy.My all time favorite is and will stay until something better turns up, the WD TV Live Plus. Plays everything I ever throw at it.....everything BUT Amazon Prime......Please ask if you have questions. I will do my best to answer them", "verified": true, "helpfulness": "1/1", "author": "The West got me \"no this isnt me...\""}, {"rating": 5.0, "review": "Love it buy it get rid of cable. All kinds of free shows to watch, plus many options like netflix. Well worth the money, you don't even see it on the TV. Takes a little bit to get setup at first with my home wifi, but never any problem after that. I own the Roku 1 for an old TV upstairs and it works great also.", "verified": true, "helpfulness": "0/0", "author": "Henry Spyker"}, {"rating": 5.0, "review": "I received the Roku stick on Wed Apr 2nd. I already own a Roku 3 & Appletv. Setup was quick, even easier than the Roku 3 i got a year earlier. I was a little worried about the lag time i was hearing about, but i don't see it. Even my Roku 3 drags sometime. I do have a fast connection (25mbps). I'am planning to buy family members a stick.I love the fact that no one comes close to how many channels the Roku has and free ones too, i like free, for me that seals the deal. I say buying a Roku 3 or Roku stick, you can't go wrong. You can also google, Roku private channels and get channels that are not on the Roku site. Great product!!!", "verified": true, "helpfulness": "0/0", "author": "RETUSAF"}, {"rating": 3.0, "review": "At least similar performance should have been priority one when making this stick. It is nice that it just goes in the back of the TV out of sight but the long wait time for NetFlix is very annoying. They should have at least made that load fast above all else. After loading, though, the performance is about the same. I don't plan on returning it but I'd probably go with the box if I needed another Roku.", "verified": false, "helpfulness": "5/5", "author": "Frank Z \"frankz00\""}, {"rating": 3.0, "review": "Get ready to give Roku all your personal information before they will let you use this thing.  Full name and address, credit card, telephone... or else they won't let you active the device.  I called support to try to get around this unnecessary collection of personal information.  After :45 min of arguing with their customer service they finally enabled it for me without a credit card.  My first impression is \"poor service\" and \"intrusive data mining\"... I haven't even tried using the device yet.  We shall see.", "verified": true, "helpfulness": "4/9", "author": "FitForLife"}, {"rating": 4.0, "review": "disclose: I did not buy the Roku from Amazon, I did a early order with Roku themselves. I have 2 of them now, one in my office and one on a 47\" LCD in my garage.So far, the only down side is that it does NOT have IR remote control capability. No IR receiver in the stick whatsoever. That means if you are a Logitech Harmony One user, you will wind up with 2 remotes to use. Not good. I got around this with the ROKU 3 buy buying their IR basic remote so I could get the codes needed to run the 3 with my Harmony One, enough of this...The Roku Streaming Stick is almost as good as a Roku 3 at half the price if you don't mind no games, no headphone support and a little slower processor. You can buy several of these and not break the bank.Competition; Chromecast doesn't even come close. Chromecast is controlled from a LCD IOS or Android touch screen. NOT the best controller for a home theater setup unless you like or don't mind looking at a very bright screen to control your system. May be nice for a while but it will get old when you constantly have to look at it for volume and input adjustments.All and all, with the included remote, the Roku Streaming Stick is THE BEST $50.00 streamer in the world today.", "verified": false, "helpfulness": "7/10", "author": "Ted Hartman \"Ted\""}, {"rating": 3.0, "review": "USB power- just sat there on the Roku screen and switched back and forth from 480p screen to 720p screen, and nevermade it to the main menu. I let it sit doing this all night long never stopped. Thought it might be loading something but no.So I plugged it into the wall and surprise it went to the main menu, dissapointed with that factor. Could be the TV USB port.Pretty much like the other Roku's as far as apps/menus. The remote; sometimes I would have to hit the button several times then when it finally worked it went way to far out of the menu, like it was remembering all the button presses then responding way slow and taking you way back. It was buffering shows from VUDU telling me I needed to change the video quality to play the video, so instead of HDX quality I tried HD quality and it started to play, no more than a few minutes into the movie it started bufferring. So that was the end of that, I went right to the PS3 and it played everything like a dream as usual.The other apps are what they are and have tried them on my other Roku, so not much change there. I did try a couple Netflix/Prime videos didnt buffer while watching them partial way through, I have a 23MB Comcast connectionso I dont know, I'll just have to mess with the movies more but it just seems so sluggish with the remote in the menus and the video performance seems lacking. It sure needs some R&D; to address and fix issues for everyone.I have the AppleTV-and Roku 3M projector and I dont have these issues. Of course the PS3 out does them as far as performance and glitches, never had any issues with any apps on the PS3.Would love to give a better rating, but I cant right now.", "verified": true, "helpfulness": "2/3", "author": "I 'am Post It \"Buyer\""}]