[{"rating": 5.0, "review": "AWESOME!!!! We love it!!! We live in a rural area that doesn't have great signal strength, poor reception, & limited local channels, but with the ROKU streaming stick we can watch tons of Internet tv channels, including You Tube, Netflix & others!!! It's great !!!😄😄😄", "verified": true, "helpfulness": "0/0", "author": "michellel l mack \"m. mack\""}, {"rating": 5.0, "review": "Really enjoy the Roku.  Added a Netgear two band to my system and now all is great.", "verified": true, "helpfulness": "0/0", "author": "cycle"}, {"rating": 5.0, "review": "The Roku Stick is amazing. Almost ready to cut the cord.", "verified": true, "helpfulness": "0/0", "author": "EZRON BELGRAVE"}, {"rating": 5.0, "review": "I love my Roku stick and the streaming options it offers.  I have an older Roku Box on my family room TV and this Roku Stick on my bedroom TV.  I like them both.  I'm really enjoying getting Amazon Prime Videos and HuluPlus.  It came with 3 months free of HuluPlus!  It also has Netflix and so many other options.  The remote takes a little getting used to but so far it's fine.", "verified": true, "helpfulness": "0/0", "author": "Chesapeake"}, {"rating": 5.0, "review": "Best yet, better than Chromecast by far.", "verified": true, "helpfulness": "0/0", "author": "William T."}, {"rating": 5.0, "review": "excellent iteam", "verified": true, "helpfulness": "1/1", "author": "tareq alawneh"}, {"rating": 4.0, "review": "Works as expected. One star missing because there's no headphone jack on the remote like Roku3", "verified": true, "helpfulness": "0/0", "author": "John Hoornbeck"}, {"rating": 5.0, "review": "Very happy with this purchase. Working as advertised. The supplier delivered fast and packaged very well. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Sylvester Q."}, {"rating": 1.0, "review": "Ordered it January 8, received it - one or two days later maybe?  Went to use it today and the remote won't work.  Tried over and over to sync the stick and the remote and it's clear that the remote is bad.  New batteries, nothing, no light comes on the remote, nothing happens.Went to return it today and it only had a 30 warranty.Thanks a lot Roku.", "verified": true, "helpfulness": "0/0", "author": "Jane from DeSoto, TX"}, {"rating": 5.0, "review": "It works flawlessly tucked away behind my HDTV mounted in my guest room. There are no cords and the remote doesn't necessitate line of sight because it doesn't utilize infrared. This is the third Roku product I have owned and I currently do not recommend another streaming device.", "verified": true, "helpfulness": "0/0", "author": "PharmerJ"}]