[{"rating": 4.0, "review": "My parents wanted a way to access services such as Netlfix and Hulu plus in their room, but they weren't ready to replace their perfectly good tv with a smart tv. I had been planning on getting them a Roku since I have one myself, but decided to wait for this little stick to be released before getting one for my parents. it barely takes up any room and since the tv it's plugged into has a powered USB port, it is able to power itself using the tv. Setup was a breeze and adding channels went through very smoothly. My parents can manage the UI just fine once I got all their favourite channels set up for them.Pros:- easy setup- small footprint barely takes up any room- remote is powered by bluetooth so you don't need a line of sight to the Roku- remote is straightforward to operateCons:- the loading screen sits there for ages before the Roku is finally ready to be used. It'll look like it's infinitely looping those \"dancing\" Roku letters, but it'll get there eventually. However once on the UI is smooth and fluidOther thoughts:- even though the stick it hidden behind the tv, I like the purple colour- I would've preferred that dedicated Blockbuster video button on the remote be replaced with something else- the remote is a bit fatter than I expected based on pictures, but it isn't by any means unwieldy", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "This is a great way to access extra content without paying the outrageous cable prices.  I urge everyone to consider this option.", "verified": true, "helpfulness": "0/0", "author": "Douglas Warren"}, {"rating": 3.0, "review": "I got this because I hate wires hanging everywhere but since my TV does not have a powered USB port you still have to plug this in.  At least there is no box to find a spot for.", "verified": true, "helpfulness": "0/0", "author": "Mark G"}, {"rating": 5.0, "review": "First time I heard about this product but someone told me about it so I bought it for my mom's TV for her to able to watch Netflix and is great product , easy to install, great price and it was deliver on time and great quality.", "verified": true, "helpfulness": "0/0", "author": "Alicia"}, {"rating": 5.0, "review": "This stick is very easy to use and set up.  the speed is great also. I bought 2 for my home and it compliments my MX2 box. I mostly use it for Amazon video streaming.", "verified": true, "helpfulness": "0/0", "author": "michael barnes"}, {"rating": 4.0, "review": "I need to use it more times in order to know how to get the most out of it. When I ordered it I was under the impression that more  programs/movies would be available at no charge. I look forward to trying the National Geographic channel...", "verified": true, "helpfulness": "0/0", "author": "william r. walter"}, {"rating": 5.0, "review": "Have a PS3 and a Chromecast, but wanted to see if this could fit into my life somehow. The PS3 is a little clunky with the controller and navigation. The Chromecast is a little too minimalist with no interface or controller. The Roku is the perfect marriage of everything. Interface is fantastic, really streamlines everything together. The remote is the killer feature here that makes it all worth it. All the apps are fun to explore and play around with. The Chromecast has gone on the bedroom TV. The Roku earns the spot for the main TV. We love it. Picture quality is great. To echo others, yes, it's a little slow, but not terribly so.", "verified": true, "helpfulness": "0/0", "author": "Anchovies"}, {"rating": 4.0, "review": "Would give it 5 except if the router is too far away (60ft to 70ft) it won't pick up at all.  But my old hd x did and it works just fine.  They need to fix that.  So I'm using it nearer to my other television.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Novel Ardor\""}, {"rating": 4.0, "review": "The Roku streaming stick is very easy to use and set up. Just plug it into your hdmi tv and you're good to go. Watch netflix, abc, and many more. Also cast youtube videos from your smart device. I would recommend the Roku stick, especially for the price.", "verified": true, "helpfulness": "1/1", "author": "Jreshow"}, {"rating": 4.0, "review": "Tried the Roku - it worked as advertised, but we found out that we really don't watch enough TV to justify the cost. It looks good for people who want to stop paying for high costs of cable or satellite.", "verified": true, "helpfulness": "0/0", "author": "Ron"}]