[{"rating": 5.0, "review": "Love it don't have to worry about all the wires.", "verified": true, "helpfulness": "0/0", "author": "CB \"Carmenbet\""}, {"rating": 4.0, "review": "works ok but not as good as my older one.", "verified": true, "helpfulness": "0/0", "author": "Jane  Nelson"}, {"rating": 5.0, "review": "Great supplement to your entertainment system!", "verified": true, "helpfulness": "0/0", "author": "Tim R. Katzmark"}, {"rating": 2.0, "review": "Stick with the regular Roku boxes, they are great.  This one just didn't seem to stream well at all.  It was always buffering.", "verified": true, "helpfulness": "0/0", "author": "C.Schmidt"}, {"rating": 5.0, "review": "Previous to buying the Roku Streaming Stick we were using our blu ray player to connect to Netflix and Amazon streaming. This is a significant improvement in functionality. There are a great number of channels available to choose from for a variety of prices. The Amazon interface is much better and recently had an update that made additional improvements. It's a great affordable way to access so many streaming options.", "verified": true, "helpfulness": "0/0", "author": "MHansen"}, {"rating": 2.0, "review": "It worked fine for about a week then all of a sudden couldn't get a signal.  Called the support line & couldn't understand the person & he couldn't get it to work & then ended up telling me that my internet & router wasn't strong enough, yet it had been the previous week!!  In the end of this hour long phone call he ended up telling me that I had to change the channel of my router & that by doing that I would lose my internet on my other devices & did I want him to do that?  I told him absolutely not!!  So, now my son will come over & move my router to the middle of the house & see if that will help.  Funny thing is, this week it's working again.....", "verified": true, "helpfulness": "0/0", "author": "Joy E Pennell"}, {"rating": 5.0, "review": "Huge Roku fans here, bought the stick for our bedroom tv and it does the job perfectly. It does load a tad slower at the beginning but we've never had any streaming issues. Can't beat it for the price and portability, we take this one with us on vacation too.", "verified": true, "helpfulness": "0/0", "author": "MommaMaven"}, {"rating": 4.0, "review": "This works great, but I would pay more if the Roku had an integrated browser, like my smart blue ray player, so I could take it on the road with me and use it in hotel rooms without also buying an internet router. Why make it so complicated? We can put a man on the moon......", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it, a little low here and there, but its a stick, and once its starts, its great :D like takes a bit to load the apps", "verified": true, "helpfulness": "0/0", "author": "Cusco"}, {"rating": 5.0, "review": "My new favorite thing! :)", "verified": true, "helpfulness": "0/0", "author": "Katie Tobia"}]