[{"rating": 5.0, "review": "good servervice", "verified": true, "helpfulness": "0/0", "author": "norverto"}, {"rating": 5.0, "review": "That shizz", "verified": true, "helpfulness": "0/0", "author": "Kenneth L. Gentry"}, {"rating": 5.0, "review": "Is great", "verified": true, "helpfulness": "0/0", "author": "Juan carlos salguero"}, {"rating": 5.0, "review": "The best streaming stick in my opinion. I prefer the option of using the standalone remote over the phone as the remote. Also many more options then chromecast or amazon fire stick", "verified": true, "helpfulness": "1/1", "author": "sean"}, {"rating": 4.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Lizette Jimenez"}, {"rating": 1.0, "review": "I am returning this lemon. Movies take forever to download and stop after a few minutes for relentless buffering. I have been on online chat with Roku 3 times in the last few days. Their representatives had me change all kinds of settings, update software, then finally told me I had to buy a WiFi extender, which I did. The same problem persists. After another wasted hour of my life this morning with a Roku rep having me do all kinds of dumb changes, then she finally said the thing was hopeless and I should send it back to be replaced. Not a chance. I'm going to try another brand. This is junk", "verified": false, "helpfulness": "1/2", "author": "TMG"}, {"rating": 5.0, "review": "Excellent product, Will continue to use!", "verified": true, "helpfulness": "0/0", "author": "l.a.lady"}, {"rating": 1.0, "review": "Tried for five hours and still could not connect to Roku to get software update. Connects perfectly with my home WIFI network, but over and over again, cannot connect to Roku. Keep getting Error Message 011. I searched Google and found hundreds of posts with the same problem, none of which have ever been resolved. My Roku 3 works great. This stick is as useful as a regular stick. This really is a piece of garbage. I listended tomthe Forum posts and tried disabling WiFi, a new DNS number, reset Roku unit - all without any luck. Going to return the unit, get my $$ back and buy an Amazon Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Slider \"Peace, Slider\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "EP"}, {"rating": 1.0, "review": "Well, i knew i was taking a chance buying a refurbished roku to save 10 bucks, but right out of the box and to the tv and it would only connect to wireless temporarily and kept giving me many connection errors... Continued to troubleshoot and couldn't get it connected after about an hour of messing around with modem security settings, ect.. Shorty speaking i'm no dummy in the computer world and came to the conclusion it just must be a defective device. So much for Certified refurbished right? Plus i'm pretty disappointed in the help pages and forums on roku as well. Might try a roku again someday, but as of right now i've strayed away and i think i'll be going with a fire stick.", "verified": true, "helpfulness": "0/0", "author": "Cody"}]