[{"rating": 5.0, "review": "it works perfectly and was a great price; thanks!", "verified": true, "helpfulness": "0/1", "author": "buyer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Carl M Schwarber"}, {"rating": 5.0, "review": "Great price and speedy delivery.", "verified": true, "helpfulness": "0/0", "author": "Thomas J. Odonnell Jr. \"Right Rev\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "George Riley"}, {"rating": 5.0, "review": "I love the Roku stick ! I don't like I brought one two weeks earlier and it was cheaper I don't see why it would go up soFast unless they are selling faster that I was disappointed in ... But it is a great stick ,I have gotten the Roku box at first love that the I got a stick for my daughter, the other daughter loved it so I got her one so I am very happy with them just disappointed that you raise the price so fast !!!", "verified": true, "helpfulness": "0/0", "author": "Lenore T Frey"}, {"rating": 3.0, "review": "I have had the streaming stick for over 6 months. Wish I could return it. It does not ever connect well with wifi, and the remote is not as responsive as the standard Roku boxes. I have 3 Roku units and I love the service, but the stick is not comparable with respect to quality of the standard boxes. I have just disconnected it because I am tired of it not working correctly. Definitely not worth my money.", "verified": true, "helpfulness": "0/0", "author": "happy customer"}, {"rating": 5.0, "review": "Great experience!", "verified": true, "helpfulness": "1/1", "author": "Jody B. Williams"}, {"rating": 5.0, "review": "Definitely work as advertised. Loved it so much, will get a second one...", "verified": true, "helpfulness": "0/0", "author": "Henk"}, {"rating": 1.0, "review": "I'm a big fan of the product . Just a word of warning don't enter your credit card I don't buy anything directly from Roku. The have been billing erroneously for months now and despite multiple calls still haven't reversed my charges. Such a pain and a waste if time.", "verified": true, "helpfulness": "1/1", "author": "Popo \"Popo\""}, {"rating": 2.0, "review": "Ok, I just got this afew days ago.  I will probably post a more detailed review later.  But I wanted to post my first impressions.  First, you need to know that I am a long-time google chromecast user.  So I can't help but compare the two.  I liked the idea of the roku stick (I would never buy the \"box\" version of roku, after using a chromecast) as opposed to the chromecast because of the included remote control (for roku) and the \"search\" function of roku.  For our CHILD, I think the Roku stick is a better fit than a chromecast.  It is (after being set up that is) easier to use than a chromecast is...for a child...But setup was a major headache!!!First, it took several tries to get the remote to \"pair\" with the roku stick.  Until that happened, I never got a Roku splash screen on the TV.  So at first, I thought the Roku stick was defective.Second, I had to activate the Roku stick using a *computer* with Internet access.  That was really odd.  The Roku is connected to the Internet, has it's own operating system and built-in onscreen keyboard...BUT IT REQUIRES ANOTHER COMPUTER TO ACTIVATE?!?!?!?!?!?And of course, I did not have a computer in the room where the Roku stick was.  So I had my step-son shouting activation codes to me from the other side of the house.  And I was trying hard to understand him...so I could type it right on the computer...The second huge shock was that Roku REQUIRES a CREDIT CARD to activate.  That's right, if you do not give up a credit card number...the ROKU stick will be dead / you won't be able to use it.It is totally RIDICULOUS that you have to give ROKU a credit card in order to watch free content...Yeah, I understand that there are various paid programs that you can order with the ROKU.  But the Roku also gives you the option to BLOCK such purchases.So, requiring the credit card just to activate ROKU makes ZERO sense...and it is dangerous.  Anybody who hacks your Roku account now has access to your credit card!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  Do you really want to take that risk?  I almost sent it back to Amazon, bluntly...OK, so it's activated.  Now you want to add channels to it.To add channels also requires another Computer.  I don't get it.  Why do they ship you a computer and then ask you to use YOUR OWN computer to activate and program the thing???If you have a household with several android smart phones, you are probably better off buying the google chromecast.  It's not as \"polished\" a product as the Roku stick is.  However, it is super simple to set up with no credit card required.  So the hassle factor is MUCH lower with the chromecast.I'd only suggest you try the roku stick if you want something for children to use...and do not mind handing over your credit card information to Roku for NO good reason...", "verified": false, "helpfulness": "10/11", "author": "D. Christensen"}]