[{"rating": 5.0, "review": "Awesome little device.  I needed to contact Roku and get the HDMI extension because the wifi signal was I guess being interfered with when the Roku was plugged directly into my TV, but once that arrived this little sucker has worked great.  Amazingly small and such a ton of content and functionality.  It's similar to the Chromecast in size and simplicity, but with a lot more functionality and most importantly:  a remote.  I have an Apple TV as well, and while I love the Apple TV, for the price this little Roku is really hard to beat.  Very impressed.", "verified": true, "helpfulness": "0/0", "author": "S. Hill \"Sean\""}, {"rating": 5.0, "review": "great product, I would recommend it to anyone", "verified": true, "helpfulness": "0/0", "author": "Jana E. Smith"}, {"rating": 3.0, "review": "Just OK.  Had issues out of the box with the remote, as the WiFi signal from the remote has interference with my WiFi network.  ROKU customer service was helpful.  Finally changed my WiFi channel and it was working.The stick is slow to respond.  I would not use this as a primary device.  I use it in my kitchen where it doe not get a lot of use.", "verified": true, "helpfulness": "0/0", "author": "Rey \"rremente\""}, {"rating": 3.0, "review": "Works okay. Slow processing.", "verified": true, "helpfulness": "0/0", "author": "Michael Heier"}, {"rating": 2.0, "review": "The remote does not nearly as well as on the 'hockey puck' Roku boxes. It often takes several clicks on the remote for the stick to 'wake-up' and acknowledge them.On the plus side, the stick allows it to be plugged into the USB slot on back of the TV. This works well for a TV on an articulating arm in the kitchen where there is not a good place to put a 'puck' device.I think I'd rather find a place for the 'puck' and have a better working remote however.", "verified": true, "helpfulness": "0/0", "author": "Grayson"}, {"rating": 4.0, "review": "I'm torn. I have a Google Chromecast as well as a Roku. Each have their advantages and disadvantages.The Chormecast is fast and simple. The Roku is slow and not simple. The Roku loses the wifi whereas the Google was rock steady. They don't play well together in the same house and the Roku can't contentd with the steady Google which constantly maintains the signal.My wife, however, prefers the myriad of choices the Roku offers, and can set aside her love of \"casting\" to the TV from something in a browser window in its favor . . . but with great reluctance. She must search on her ipad and then find what she wants and then find it again on Roku.", "verified": true, "helpfulness": "0/0", "author": "P. GIBSON"}, {"rating": 5.0, "review": "i love these products, this is my second unit and works great, we have it plugged in behind the tv set and no problems reading the remote. this product was key in helping us cut the cable cord. this will only work with a hdmi port on your set thou", "verified": true, "helpfulness": "0/0", "author": "E. Clauss \"santa\""}, {"rating": 3.0, "review": "The picture is great. I like the new menu, but during the movie it buffers continuously and the movie had to be you have to re start the movie.", "verified": false, "helpfulness": "0/0", "author": "Rickey R Sullivan"}, {"rating": 1.0, "review": "I love Roku but the stick was to long to fit behind my wall mounted TV. Returned for the Roku 2 which fit my needs better.", "verified": true, "helpfulness": "0/0", "author": "eddieworm"}, {"rating": 2.0, "review": "the setup is simple but i do not have access to all of the programs that i have on my laptop...  even when we search... some of our favorite programs are not there...", "verified": true, "helpfulness": "0/0", "author": "joy parker"}]