[{"rating": 5.0, "review": "Awesome!fast shipping", "verified": true, "helpfulness": "0/0", "author": "LEO N."}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "Roku streaming stick works great once I got it set up. Problem with the setup was that the instructions for pairing were different than the written instructions. Fortunately I was finally able to see that there was a teeny button on the outside of the remote that facilitated pairing. The written instructions had me pulling the batteries out and looking for a button in the battery compartment.", "verified": true, "helpfulness": "1/1", "author": "P. Vitale"}, {"rating": 5.0, "review": "slightly better than Amazon Fire but both great !", "verified": true, "helpfulness": "0/0", "author": "Mrs. Gay L. Mcguire"}, {"rating": 5.0, "review": "Works as advertised. Roku is the BEST!", "verified": true, "helpfulness": "1/1", "author": "John A. Levandowski"}, {"rating": 4.0, "review": "This is a very good streaming stick device.  I often purchase refurbished products with minimum issues.  This device was an ease to setup.  Plug it in and follow the step by step process on the TV screen.  The only down side is that Roku requires credit card number regardless if you are going to purchase anything from different streaming vendors.  Even if you already have an account with Netflix or Amazon Prime. I took one star off for freezing and locking up while switching between apps.  I had to turn it off and remove the batteries and restart the Roku.  This only happened once.  It's been over a week now and it's been doing well.  Overall, it's a great product.", "verified": true, "helpfulness": "0/0", "author": "Bobby C"}, {"rating": 5.0, "review": "The product looked brand new.It works better than Apple TV, chrome, and fire.Get roku before any of the others.", "verified": true, "helpfulness": "0/0", "author": "Camabisca"}, {"rating": 5.0, "review": "Exceeds my expectations. Works very well, and appears brand new.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "courtney bourne"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Raymond C."}]