[{"rating": 5.0, "review": "I have another Roku. This was incredibly easy to set up. I like the idea thta it is hidden behind the TV", "verified": true, "helpfulness": "0/0", "author": "Granite"}, {"rating": 1.0, "review": "I did't know how to use it. The instruction were not clear for me. Hope someone else will have better results.", "verified": true, "helpfulness": "0/5", "author": "Alesia Diggs"}, {"rating": 3.0, "review": "Roku requires credit card info to register so not my favorite product.  I have an old Sony SMP-N100 & do still enjoy it best.  Didn't require personal info to register the Sony device & still prefer their display method.  The RokuRoku 3500R Streaming Stick (HDMI) was purchased to receive a tv broadcast channel available free only through Roku. This stick is the best way to go in my opinion from among the Roku items available. Was cheaper, simple to set up & since I have limited plugins at this point I exchange my lap top's space for it. You never really shut off anything Roku unless you unplug it. I fixed that problem by plugging it into a switch device (some sold here on amazon such as GE or Leviton plug in switches) so I turn it off with the plug in switch.  Again, not needed with Sony. I noticed some seem to think it takes too long to come back to life when shut off completely, but doesn't seem that way to me. Over all good product, less expensive & simple to use.  Too bad Roku wants credit card info even when you won't be using it. I'm continuing to used my Amazon & Netflix video accounts through Sony who doesn't ask me for my credit card info.", "verified": true, "helpfulness": "2/3", "author": "Irish Lass"}, {"rating": 5.0, "review": "Looks and works like new.", "verified": true, "helpfulness": "0/0", "author": "roy dewalt"}, {"rating": 5.0, "review": "Great product!, Great Shipped!", "verified": true, "helpfulness": "0/0", "author": "Francisco Gamez"}, {"rating": 5.0, "review": "Delivered fast and worked perfectly. Looked brand-new.", "verified": true, "helpfulness": "0/0", "author": "Doug Domeck"}, {"rating": 3.0, "review": "The main reason I buy roku is to listen to Spotify. but unfortunately I can't do so in my country. disappointing...", "verified": true, "helpfulness": "0/1", "author": "asokthiagu"}, {"rating": 5.0, "review": "Worth it, great product.", "verified": true, "helpfulness": "0/0", "author": "Chris D. Smith"}, {"rating": 5.0, "review": "Very fast shipping. My grkids love playing the games, cats like watching the aquarium. Everyone happy.", "verified": true, "helpfulness": "0/0", "author": "3cats"}, {"rating": 1.0, "review": "Do not waste your money for this single on only", "verified": true, "helpfulness": "0/10", "author": "Gerry Fransen"}]