[{"rating": 5.0, "review": "This stuck is now not working!! I see from all over the web that this is commonplace. I received the first week of January 2015 and it is April 11, 2015 and it receives no signal. I have had 90 days and this is crap! Amazon should not carry products with this kind of bad rep as it reflects badly on them! If I cannot trust to buy electronics here, I will take business elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Deb"}, {"rating": 5.0, "review": "Great streaming device!Works great for streaming Plex, Netflix, Hulu, and Amazon. I am sure it works great for anything else you can stream, I just haven't tried yet.My only complaint is the slight lag it has. That can be avoided by purchasing the quicker, media player version.", "verified": true, "helpfulness": "0/0", "author": "Dustin Chase Pipkins"}, {"rating": 5.0, "review": "Perfect for our needs...", "verified": true, "helpfulness": "0/0", "author": "Avril"}, {"rating": 5.0, "review": "LIKE THE IDAEEA THAT I CAN WATCY IN 2 ROOMS W/O HAVING TO REMOVE THE ROKU3 (NOT THE STICK) FROM ONE TV AND MOVE TO THE OTHER.. PLUG AND PLAY...", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "Quick installation and set-up.  Very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "La Trice Norman"}, {"rating": 5.0, "review": "great item, did better then I expected.", "verified": true, "helpfulness": "0/0", "author": "evil taco"}, {"rating": 4.0, "review": "operates as advertised", "verified": true, "helpfulness": "0/0", "author": "william r. furnell"}, {"rating": 5.0, "review": "I have had a Roku box for several years. Installed easily; had a problem with activating Netflix, but they had a disruption the day before. Amazon setup was easy.", "verified": true, "helpfulness": "0/0", "author": "James Vugteveen"}, {"rating": 1.0, "review": "This device works about 50% of the time.  When it works, it's great, obviously.  There is no clear reason why half the time it doesn't work.  Internet connection will show as excellent, and I'll be able to get on Netflix, HBO GO etc just fine, yet none of the apps work via Roku.  This is after resetting Netflix on the Roku and resetting Roku itself.  I recently gave up and connected my laptop to my TV with an HDMI cable to watch Netflix.  THAT worked perfectly.  It's just cheap and unreliable and I would not recommend it to anyone.", "verified": false, "helpfulness": "0/0", "author": "tarad"}, {"rating": 5.0, "review": "Brought this for my daughter's television, and since installing it, she's been glued to her TV and I haven't seen her since!", "verified": true, "helpfulness": "0/0", "author": "iws"}]