[{"rating": 1.0, "review": "SCAM email from AMAZON PRIME said membership includes streaming... then when I declined to authorize one click payment (thought it was 'included') they tell me the device is not compatible.. hours of runaround for nothing.", "verified": true, "helpfulness": "1/4", "author": "Mark Swezy"}, {"rating": 5.0, "review": "Works great. Fast shipping", "verified": true, "helpfulness": "0/0", "author": "George B Williams"}, {"rating": 2.0, "review": "this is slower than my 15 year old blueray and it freezes more often an doesnt recover. way more choices when it does work", "verified": true, "helpfulness": "0/1", "author": "Cathy"}, {"rating": 5.0, "review": "This is an answer to our prayers. We are now able to watch videos from our favorite website.", "verified": true, "helpfulness": "0/0", "author": "S. JONES"}, {"rating": 5.0, "review": "Freakin' love this thing.  I have Prime and the Amazon Instant Video variety alone is awesome.  Plenty of channels to check out, anyone can find various things they like.  Bring up YouTube videos on your phone or tablet and send them to play on your Roku-connected TV through the same Wi-Fi connection.Tons of content, easy setup, user-friendly interface and functionality.", "verified": true, "helpfulness": "0/1", "author": "Alfonso"}, {"rating": 5.0, "review": "I have the Roku 2 on the big screen in family room, got this for my office TV.  Works great.", "verified": true, "helpfulness": "0/0", "author": "Michael Henderson \"Madmike\""}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Pam Ray"}, {"rating": 1.0, "review": "i HAD IT FOR TWO DAYS STOP WORKING I WILL NOT BUY ANYTHING FROM THIS COMPANY AGAIN", "verified": true, "helpfulness": "0/1", "author": "gary smallwood"}, {"rating": 4.0, "review": "We have been using Roku's various streaming devices for about 4 years now and have been very satisfied with all of them. We decided to try the \"stick\" out for the television in the master bedroom of our summer home. The installation was simple and quick with no hick-ups etc. and it was up and running in about 10 minutes. I opted to use the power adapter in order to keep the USB ports available on our Samsung LED television. Most of the time the \"stick\" is top notch in operation however periodically (twice in a bit more than 2 weeks so far) it requires rebooting (disconnecting its power supply momentarily). Usually the first symptom a reboot is needed is the momentary loss of sound during streaming which for us first appears while streaming video from Hulu and as the symptoms worsen the behavior is also observed while viewing Netflix as well. If the stick is not rebooted the quality continues to worsen and includes flickering and or lines flashing across the picture.", "verified": true, "helpfulness": "0/0", "author": "Mikwr"}, {"rating": 5.0, "review": "This is great.  Works well with my tv and takes up little to no space!", "verified": true, "helpfulness": "0/0", "author": "J. Black"}]