[{"rating": 1.0, "review": "Believe or not some of T.V is already installed this function. And also it is inconvenience to register and make payment. I recommend not to buy this product.", "verified": true, "helpfulness": "0/3", "author": "Moony"}, {"rating": 5.0, "review": "This is great--we can finally use our Amazon membership to it's fullest! Now we can watch all the Amazon Prime Video's right on our giant TV!", "verified": true, "helpfulness": "0/0", "author": "K. Patel"}, {"rating": 5.0, "review": "Small, hides behind TV - actually in my case, I attached it to the sound bar working with my TV.Starts fast, works well with no commercials no shopping channels and no more of those crazy cable fees.Way to go!", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 5.0, "review": "Couldn't be happier. I ditched my cable company to save money. I have my roku stick covering tv portion with netflix and amazon instant video. Kept internet trough cable company and switched my home phone to ooma telo. In the end my bill for 3 services dropped $140 a month", "verified": true, "helpfulness": "0/0", "author": "mustafa turan"}, {"rating": 5.0, "review": "Wow.  This is a great item.  I have both the 100 dlr one and the 50.  Most folks have more than one TV.  This just makes life easier and works perfectly.  No it does not have a headset jack or a place for a memory card but who cares.  It works and the price is right.", "verified": true, "helpfulness": "0/0", "author": "John Rogers \"JR\""}, {"rating": 5.0, "review": "I had the original version and got this for a different room.The speed on this is much faster and less wires to show. You get all the same great channels, but with a quicker download, so the picture is better on the TV.", "verified": false, "helpfulness": "0/0", "author": "MD5242"}, {"rating": 4.0, "review": "Steaming stick works great. Already own a Roku box, but his is even better. Can easily be moved from TV to TV. Little bit of trouble setting up, but once done works just fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "it has some problems and competes with the cable box causing streaming issues that required an expensive home visit from a geek who could figure it all out . I like streaming programs but it can be frustrating and it is always reloading so things are interrupted frequently.", "verified": true, "helpfulness": "1/2", "author": "debbie Ryniker"}, {"rating": 5.0, "review": "Exceptional product, steam with NO ISSUE.  Netfilx, Amazon, YouTube, NBA, you ask for it all is there.  And no mountain of wires, boxes, slips right into the USB port, NO ISSUE.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Linda D. Robinson \"The Queen\""}, {"rating": 5.0, "review": "I have to say, I'm loving this thing! I have a Roku box in my room, and just recently purchased the stick for the living room so my elderly mother can enjoy her nature and old tv shows on Netflix and Amazon. We also have a Sony dvd player with apps, but it failed to work the way I expected - I have *never* been able to get Netflix working on it, so it only works for one of the apps we needed - Amazon. I was on the phone and online with Netflix customer support for hours, with no luck at all getting it working, so basically, it's just a glorified DVD player now, which we will rarely use, because now we have the stick! :-)Loading time for the apps is a little slow, but I mean, seriously...what is 30-45 seconds out of your life? It's not that critical and the apps DO load, so that's all I care about. I'm sure if it was right on top of my wifi router, it might load faster, but being 2 rooms away, I don't think the load time is that bad.The only issue we've experienced is when Netflix goes down or screws up by removing programming (like they did last week), or my internet connection gets a little flaky, which it does on occasion for everyone, I'm sure.All in all, great experience with this device.  Super easy to install, no issues there, and really easy to use.", "verified": true, "helpfulness": "1/1", "author": "SueP"}]