[{"rating": 5.0, "review": "thanks alot", "verified": true, "helpfulness": "0/0", "author": "amazon customer"}, {"rating": 4.0, "review": "Get it", "verified": true, "helpfulness": "0/0", "author": "Lorenzo Taylor"}, {"rating": 4.0, "review": "Works as advertised. Can add apps, which is nice. Yes, there are times that the remote doesn't seem to send the signal, but I just push the button again, and PRESTO! It works. I've used the iPhone app for the remote, and it works too.  Would not say it is any better than the Amazon FireStick, because I have one of those, too.", "verified": true, "helpfulness": "0/0", "author": "Daniel Edgar"}, {"rating": 3.0, "review": "I am a big fan of the ROKU and have one on every TV. I don't really watch much regular tv anymore, just streaming these days because of these little boxes. The interface is very easy to get through, setup is simple and I have never had a problem. I got this for a bedroom TV and really wanted to like it. But the lag after hitting a button on the remote is too frustrating for me. So I replaced it with a ROKU 3 and this one is going to mom. She has more patience and moves slower then I do. So it may be good for her.", "verified": true, "helpfulness": "0/0", "author": "Tom Prasil"}, {"rating": 5.0, "review": "easy to use.  Lots of shows to watch!!!", "verified": true, "helpfulness": "0/0", "author": "Genevieve Pishev"}, {"rating": 4.0, "review": "I am very happy with this product I use it all time. My only complaint is that the remote sometimes doesn't work the first time you push the button, but this doesn't happen all that often", "verified": true, "helpfulness": "0/0", "author": "Rora"}, {"rating": 4.0, "review": "It works best when in the same room as the wireless router. It has some issues when there are a couple of walls between router and Roku stick.", "verified": true, "helpfulness": "0/0", "author": "l8blumer66"}, {"rating": 5.0, "review": "I love it, I've had mine for 2 months now and watch it all the time. Netflix, Hulu, YouTube, CBS All Access, I Heart Radio. Loads and loads of apps and channels. It's endless. I'm thinking of buying another for my other TV. Best part is that you can take i with you on trips and plug it into the TV in your hotel, hook it up to wifi and You can watch what you want :)", "verified": true, "helpfulness": "0/0", "author": "snowynight"}, {"rating": 2.0, "review": "You will need a VERY strong WiFi signal for this to work. I was getting a \"good\" signal but it kept reloading as I was watching a program. One time it just went to the main menu in the middle of a program. Very frustrating. Sent it back.", "verified": true, "helpfulness": "0/0", "author": "Gregory Montague"}, {"rating": 5.0, "review": "This review is for anyone whose having trouble deciding between a Chromecast and a Roku Streaming Stick as I currently own both.I purchased this Roku for my parents as a gift and it was simply because the Roku Streaming Stick comes with a built in user interface. Think of when you turn on an XBOX ONE or any console, you see the green light, then you are brought to a main menu. Roku is similar in this regard, once you've plugged the Roku into the USB port of your TV, you'll be brought to the main Roku screen where you will then sync the device to your internet connection.The Roku has some strong partnerships just like Chromecast and will allow you to watch Netflix, HBO GO, Hulu, Amazon Videos, etc. so from a content perspective the two are honestly very comparable.BOTTOMLINE: The Roku is a more polished and finished standalone product that most users will have less trouble with (especially those that are less tech savy). The Chromecast, like the Roku Streaming Stick, is a powerful streaming device that you will no regret purchasing. However, I would recommend that someone purchase a Roku over a Chromecast if they are looking for a much more straight forward experience. A Chromecast operates through native apps on your phone and/or desktop and then syncs to your TV / Chromecast. There really isn't a \"main screen\" or \"main menu\" to speak of which makes the learning curve much steeper for less tech savvy folks.If you're having trouble deciding between Roku and Chromecast, know that the Roku is a bit more expensive, but it also provides a far more straight forward approach to watching your favorite streaming shows and movies. I'd recommend the Roku over the Chromecast to anyone who struggles with technology. Having said that, you will get almost identical content and quality from either USB stick.. the user interfacing is the major difference in my book.", "verified": true, "helpfulness": "0/0", "author": "Rick Chrisos"}]