[{"rating": 4.0, "review": "Yes, when functioning correctly, the stock is great.  The remote did not function properly however requiring about two hours chatting with company tech support eventually they agreed to send me a replacement.  It now works normally.", "verified": true, "helpfulness": "0/0", "author": "Manuel Espinosa"}, {"rating": 3.0, "review": "I love the Roku and would give it a 5 star but the damn remote that came with it didn't work so I had to download an app on my phone before I enjoy it.", "verified": true, "helpfulness": "0/0", "author": "LeftyLucy"}, {"rating": 3.0, "review": "Very slow in processing. Else its good", "verified": true, "helpfulness": "0/0", "author": "Akash Deep Taluka"}, {"rating": 4.0, "review": "works as expected.", "verified": true, "helpfulness": "0/0", "author": "David Baldo"}, {"rating": 5.0, "review": "Woks perfectly", "verified": true, "helpfulness": "0/0", "author": "Joseph J. Rider"}, {"rating": 5.0, "review": "awesome, works great", "verified": true, "helpfulness": "0/0", "author": "tbadal09"}, {"rating": 4.0, "review": "Love this stick. Much more portable than the original ROKU. Reason for 4 stars is that the unit actually causes some interference with certain components around the TV.", "verified": true, "helpfulness": "0/0", "author": "Karen J Witte"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Alonzo Cureton"}, {"rating": 1.0, "review": "After using this for a month I found it often freezes and I have to e to take out the battery in order to restart it. The remote also continues scanning on its own at a high speed and I have to push the back arrow to stop it and back track to see titles again. I hope this is only a remote defect and I can be helped.", "verified": true, "helpfulness": "0/0", "author": "J. Chee \"I just got here\""}, {"rating": 1.0, "review": "Terrible. Never worked right. Was always losing connection with the remote. Never played anything without force restarting within 20-30 minutes of a movie or show starting", "verified": true, "helpfulness": "0/0", "author": "kristal"}]