[{"rating": 2.0, "review": "Had my Roku Stick for a few months and it worked fine.  I also own the Roku 3 and that device is well worth the money.  The stick does everything the Roku 3 does, just slower.  The stick will stream my Plex server content and runs the newest version of Netflix and Youtube.  I purchased the stick primarily to save money.  Bad decision!  Last week, the stick developed sync issues with the remote.  It also wouldn't sync with my Roku phone (remote control) apps.  After changing out the batteries on the remote and rebooting the stick, nothing seemed to work. It appeared to me that the stick itself was failing.  I'm now going to replace it with a better device.Pro's:Works as advertisedPlays everything including Youtube and the newest version of NetflixWhen it works, the remote control is easy to useCons:Slow.  Netflix takes 15-20 seconds longer to boot compared to my Roku 3May have quality control/build issues.  Mine no longer works", "verified": true, "helpfulness": "0/0", "author": "S. Bailey \"Chkyer6\""}, {"rating": 5.0, "review": "If you are like me and no longer subscribe to cable then nothing is better for the price. I own a chrome stick and does not compare to this. This is a full roku system with all the channels amazon, show time , hbo etc. everything works great and is reliable. Was a great purchase and plan to buy another one for my living room.", "verified": true, "helpfulness": "0/0", "author": "John Bilow"}, {"rating": 4.0, "review": "I am not always so tech savy, but the Roku Streaming Stick was very easy to set up.  I pluged it in and started downloading all  the channels that I enjoy watching (Netflix, Hulu, Amazon Prime, etc.) and received the codes to get started.  I was very impressed at what a short time it all took.  Now I have added some music channels and game channels as well as a few others.  I would recommend this to anyone wanting to do streaming.  If only we could get our local stations, then we wouldn't even have to keep Direct TV!", "verified": false, "helpfulness": "0/0", "author": "archi88"}, {"rating": 4.0, "review": "I like the less-cluttered look of my TV with the Roku stick out of the way on the back plugged directly into an HDMI socket - but - the stick seems slower to respond to its remote than my Roku 2. I moved the Roku 2 to another TV and plugged the stick into my main TV, so the comparison of the two units in the same TV receiver is a fair comparison. I'm a little disappointed in the Streaming Stick.", "verified": true, "helpfulness": "0/0", "author": "raybayonline \"Ray Baker\""}, {"rating": 5.0, "review": "After many months of discussing the option of getting rid of cable and doing some research on other options for keeping up with important programming like Bob's Burgers and Biggest Loser, we finally cut the cord and jumped into a Roku Stick.  Over a month now, and the stick has performed flawlessly.  Content loads quickly and streams smoothly.  It's super easy to stick the Stick into the HDMI port (seriously, I think my tech challenged mom could handle this without much stress), easy to set up an account (she might stumble a little here), and easy to scroll through a very long list of random channel options and set up personal channel guides (this would blow her mind).  I think it was about 11 minutes of account set-up, wi-fi connecting, and device synch before we were watching cheesy old flicks on one of the weird movie channels.We signed up for Hulu Plus to stay as up-to-date as we want with certain current programming.  That works well.  Amazon Instant and Netflix are available.  As far as finding other stuff to watch, if you're into documentaries, indie flicks, ridiculous horror schlock from every decade since the moving camera was invented, and exercise programs, you will never run out of things to make you lose entire days.  You may have to put up with short, repetitive commercial breaks on some channels; but they're not too long, so you may have to pause if your hallway to the bathroom is lengthy or your microwave pops popcorn slowly.  There is something for everyone on here. There are quite a few pay channel options that expand options, and there are plenty of movie rental channels that have some very current movies.  If you're not a slave to watching every show at the time it originally airs or actual live TV, Roku is pretty awesome.  The fact that we dumped over $100/month worth of cable bill but still get to watch things we like and some things we never knew existed is even better.We are avid sports fans, and I thought that we would miss having the cable sports tier and constant access to live Division III collegiate badminton matches would be too difficult to bear, but so far, not really a big deal.  There are some sports channel options, but unfortunately not the ones we really want, so we'll have to deal with that when the seasons start.  I would like to see more sports options, but I feel that will be handled in time.I really don't have any major complaints about this whole set-up.  Granted, I have never been a huge TV addict, but I would find myself sucked into a night of [insert show name here] marathons now and then.  It takes more effort to go through the guide and choose a show with Roku, so mindlessly flipping through the channels until 2am isn't as easy.  With Roku, I have found new hours in my day while still being able to keep up with pop culture references at the bar.  Thanks, Roku!It's easy, it's inexpensive (unless you add on 18 pay service channels), and it has so much content that indecisive people could potentially have breakdowns while browsing.  Basically, it's a no-brainer alternative to paying the cable monopoly a ridiculous amount of money every month for the six channels you actually watch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am a long time ROKU user... having one of the 1st generations ( still going strong).. and even though I have a Smart tv( 2 Samsungs INFACT). they do not compare to the ease of use of Roku.... so I have retired my previous version to the guest bedroom... and just got this New Speedy streaming stick.for the family room........WOW is all I can say.. such an improvement .. install is SMOOTH... and after pairing it with the ROKU.. the darn thing loaded all my OLD channels !!...........so it was up and running in less than 4 minutes.  Now what I can tell right away.. is something odd.. the SOUND.. is SOOOOOOOOO much better..!!!. even before I added it to my sound bar.....Also, it seems the shows I am watching are even clearer.....hmmm another nice bonus I wasn't expecting..Am I pleased with this little stick ??.. YOUR DARN TOOTIN'.............  I see lots of happy evenings watching all my favorite Roku Channels..  You can't beat the price and performance.. Nothing on the market can even come close ( sorry amazon ).to Roku... Happy, Happy, Happy..", "verified": true, "helpfulness": "0/0", "author": "Mocha's Mom"}, {"rating": 5.0, "review": "We have a Roku box but wanted to use it in 2 rooms.  This was the answer.  We love Roku!", "verified": true, "helpfulness": "0/0", "author": "dave downing"}, {"rating": 5.0, "review": "I have a Roku 3 in my livingroom that I love. Then, I recently mounted a tv on the wall in my bedroom and didn't really think that a Roku 3 was necessary for my bedroom. So I picked this stick up instead and I'm very happy with it. It's certainly not as fast navigating menus and whatnot, but I wouldn't expect it to be seeing as how it's a quarter the size of the Roku 3 and half the cost... It's exactly what I needed for the bedroom, couldn't be happier. I would not use this as my primary streamer in my livingroom though, perfect for a bedroom or even on the go at hotels and whatnot!", "verified": true, "helpfulness": "0/0", "author": "Hiram Yates"}, {"rating": 1.0, "review": "Very simple. This is a buggy device. I have a Roku box on one TV and I thought the Streaming Stick would be even better in terms of setup and use. I was wrong. Buffering is terrible. I have lots of delays and interruptions, in comparison to my other Roku device, which almost never stalls, and uses the same network. The radio frequency controls work sporadically. Worst of all, the Stick loses its connection every other time and has to be reset. I have a feeling that some enhanced circuit is missing because of the small size of the Stick. In short, simply buy a Roku box. So what if it's a little larger? It works.", "verified": true, "helpfulness": "73/82", "author": "B. Oneil"}, {"rating": 5.0, "review": "Worked perfectly.  Plugged it in and turned on the wifi and it worked with ease.  It was a good purchase.", "verified": true, "helpfulness": "0/0", "author": "Robin Strohmeyer"}]