[{"rating": 1.0, "review": "Had trouble maintaining the stream.  Traded up for Amazon Fire and it works like a champ.", "verified": true, "helpfulness": "0/0", "author": "GSB"}, {"rating": 2.0, "review": "I would not recommend the ROKU Stick. It constantly needs resetting and even then it doesn't always work. It interrupts your program by checking to see if you are still watching with an annoying frequency. Buy the box instead!", "verified": true, "helpfulness": "0/0", "author": "Stephnsea \"Stephanie PArker\""}, {"rating": 4.0, "review": "I love this little device.  It is portable, so I can take it with me from the living room to the bed room and watch my programs anywhere.  I was not expensive and has so many free apps available.  I will get another device for my teenage daughter's TV. Well worth it if you cannot spend the money for a smart TV!!!!", "verified": true, "helpfulness": "0/0", "author": "jaz1275esp"}, {"rating": 5.0, "review": "We have been Prime users and Netflix users for a couple of years to reduce our monthly TV bills.  We bought this to get additional programming that we wanted.  Works great!  We get free music streaming too!  Our roku get used daily and we are always moving it around the house to other TVs.  I guess it time to get another!", "verified": true, "helpfulness": "0/0", "author": "Michael A. Fogg"}, {"rating": 5.0, "review": "Couldn't live without it.", "verified": true, "helpfulness": "0/0", "author": "Charlotte"}, {"rating": 4.0, "review": "I like it very much, but don't like the fact that sometimes it has to be reset, then you have to go through all the set up again.", "verified": true, "helpfulness": "0/0", "author": "Sandra S. Mull \"ssm\""}, {"rating": 1.0, "review": "Very bad player.. Doesn't support UTF8 subtitlesI will not buy any product from roku in futureSwitch to chromecast better and cheaper", "verified": true, "helpfulness": "0/0", "author": "Ali AlManqur"}, {"rating": 1.0, "review": "The fact that the Streaming Stick can deliver 1080p resolution like the Roku 3 doesn't tell the whole story.  The Stick's slower processor causes on-screen action (broad movements, like an actor walking across a room) to look herky-jerky rather than smooth.  I compared the same movie side by side on the Roku 3 and the Streaming Stick and could only stand watching a few minutes via the Stick.  I tried the comparison on a 42\" TV as well as a 36\" and the jerky-looking action was less noticeable on the smaller screen, but still present. So the smaller the TV, the less annoying the defect might be.  But I chose to return mine as the slower processor killed the pleasure of watching movies for me.", "verified": false, "helpfulness": "2/2", "author": "jthomasfl"}, {"rating": 2.0, "review": "Like Roku 2, this has its very own, no one else can use it, Wifi signal, and it's on the same channel as my Wifi, limiting seriously the distance I can have the Roku away from my wireless router.  My old Roku, which is dying, could be much further away and still worked fine.", "verified": false, "helpfulness": "1/1", "author": "john b walter"}, {"rating": 2.0, "review": "For the price it's OK. But,  I would spend the extra for the original. The stick is really slow compared to the original.", "verified": true, "helpfulness": "0/0", "author": "Want Juice Box"}]