[{"rating": 3.0, "review": "good stuff.", "verified": true, "helpfulness": "0/0", "author": "Raul Torres"}, {"rating": 1.0, "review": "We liked the Roku player experience, Then we purchased the Roku Streaming Stick and when the remote didn't work right we were/are unable to get thru to customer service by any means. The phone line is an absolute joke with a zombieesk voice taking you in a frustrating circle with no resolution. We challenge any reader here to pick up the phone and attempt to speak with a live person in customer service BEFORE you buy this product. The live chat connection gets dropped and they haven't answered two e-mail inquiries. Then there's a long menu on their web site asking you to describe whats wrong like there's a perfect box to check that will make everything OK. Whats wrong is we need to talk to someone!!! But we do get endless email adds from them. We understand they've experienced phenomenal growth and could be behind the curve but no service is ridiculous. We are seriously reconsidering our content access philosophy based on this experience.  This review is strictly a service oriented failure.", "verified": true, "helpfulness": "1/1", "author": "Dorothy B."}, {"rating": 5.0, "review": "Just what I needed for our bedroom tv. No hassles with cables or wires. Easy to program and a large selection of channels.", "verified": true, "helpfulness": "0/0", "author": "Lee C"}, {"rating": 3.0, "review": "the roku is a pain to get working on any network not on 192.168.1.1  as a basic class C.  It  will not allow setting of a fixed IP and to get it to change IP from the factory set one if it does not agree with your network or router (note: a factory default  Airport Extreeme has MAJOR issues) takes a factory reset from the \"Magic Screen\" otherwise it gives the \"error 009\" forever.  I have a Asus Google Player, a Sybas Popcorn Hour, a AppleTV 1 2 and 3 and a Boxee Box as well as this Roku.  Of them, the Roku was the most tempermental to set up.  Most of its basic offers are adequate, but it has some issues with stutter (and I am on fiber).", "verified": true, "helpfulness": "0/0", "author": "pilgrimer"}, {"rating": 5.0, "review": "Works just like it should, no complaints", "verified": true, "helpfulness": "0/1", "author": "zombiefist"}, {"rating": 3.0, "review": "Most of the time it works as described, however it has frozen a couple times.", "verified": true, "helpfulness": "0/0", "author": "Silver"}, {"rating": 4.0, "review": "I find the device (the stick) was easy to connect.  But I am having problems with the remote.  It will work sometimes but there are times when I have to take the batteries (new) out and put them back in and it works again.  It is very sporadic.  I have called both Netflix (which I watch most of the time) and RoKu.  Neither could help me.  Roku suggested I find out Amazon's policy about just replacing the remote.  Haven't done that yet, but it is very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Mrs. Ralph"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Joseph Dorilio"}, {"rating": 5.0, "review": "Love it!. I don't know why it took me so long to get rid of cable TV. I made this one-time purchase.  Now I pay approximately $17.00 a month for netflix and hulu plus. I can watch what ever movies I want anytime I want.  Best part of all, NO MORE  Cable bills over $150.00. Roku has put Approximately $135.00 back in my pocket each month.", "verified": true, "helpfulness": "0/0", "author": "Glenda J. May"}, {"rating": 3.0, "review": "Remote didn't work with streaming stick but was able to download roku remote app", "verified": true, "helpfulness": "0/0", "author": "Genevieve Braido"}]