[{"rating": 5.0, "review": "Works well! This unit is easy for anyone to operate.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"max\""}, {"rating": 5.0, "review": "Five Stars", "verified": true, "helpfulness": "0/0", "author": "Victor H."}, {"rating": 4.0, "review": "Response time is a bit slower than the top model, but overall picture quality equal to anyone's stick type device.", "verified": true, "helpfulness": "0/0", "author": "Theodore Minnard \"Auldphart\""}, {"rating": 5.0, "review": "Works like a charm and was easy to install", "verified": true, "helpfulness": "0/0", "author": "Sue Leary"}, {"rating": 3.0, "review": "The Streaming Stick itself works well but the remote is extremely finicky.", "verified": true, "helpfulness": "1/1", "author": "Nick Woldorf"}, {"rating": 5.0, "review": "Better than I imagined!", "verified": true, "helpfulness": "0/0", "author": "D. Sanchez"}, {"rating": 3.0, "review": "This works well. My smart tv consistently crashed when streaming Amazon prime videos. No issues since I switch to roku. It's just slow to boot up.", "verified": true, "helpfulness": "0/0", "author": "Fuze \"DJ\""}, {"rating": 5.0, "review": "It was packed up as it if were brand new instead of refurbished & got here really fast.  I've had it about 4 wks now. It works perfectly and as expected after reading all the reviews.  Took a bit longer than I thought it would to set it up but I have the slowest internet connection on the planet. I don't use it much yet which is probably due to my still being in winter mode and catching up on series via DVDs from the library, but I was happy to see all the sci/tech, health, gardening & food channels that are available.  I've watched some already and a few seem to buffer a lot but others don't. I can easily avoid the buffering channels as there are so many other choices available.  I won't be able to cut the cable though, which is what I was hoping to use the Roku for, due to it not getting local & basic channels and my desire to see them at this time, but it'll be a fun library of interesting channels.  With the Roku and basic cable, I think we have a winner.If anything changes, I'll update.", "verified": true, "helpfulness": "0/0", "author": "Cape Coddess"}, {"rating": 1.0, "review": "Piece of crap!! Had it for a month and the the remote stopped working. Nothing helped. Not a great product", "verified": false, "helpfulness": "0/0", "author": "Timothy Ketts"}, {"rating": 4.0, "review": "Within its limits, it is a very fine device.  If you want it all, get the latest ROKU.  For the limited application intended for this particular portion of my household entertainment system, it was a beautiful addition!  I wish ROKU would be able to put the additional usability of 5G into a device like this one.  That would be the cat's meow!!", "verified": true, "helpfulness": "0/0", "author": "Howard L. Gault"}]