[{"rating": 5.0, "review": "Exactly what I needed. Easy setup!", "verified": true, "helpfulness": "0/0", "author": "Brandon Flanigan"}, {"rating": 5.0, "review": "Great and will be ordering another one  soon.", "verified": true, "helpfulness": "0/0", "author": "Denise Giazzon"}, {"rating": 5.0, "review": "WORKS WELL FOR THE MONEY", "verified": true, "helpfulness": "0/0", "author": "lori colosimo"}, {"rating": 5.0, "review": "awesome stick :)", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"CMF\""}, {"rating": 1.0, "review": "I bougth it to watch netflix, but when i connect it and search for the app, i got realized that the netflix app is not available forma muy country, and other importante apps like watch espn, pbs, crakle, etc.", "verified": true, "helpfulness": "0/0", "author": "Mario Samuel Soto Ayala"}, {"rating": 4.0, "review": "Now I don't have a cable bill.", "verified": true, "helpfulness": "0/0", "author": "tommy sands"}, {"rating": 5.0, "review": "This little device could not be any easier to install unless someone else did it for you. It simply plugs into an HDMI connection on the back of your TV. If you have an older TV without HDMI ports then you should not order this particular Roku product. You need the original Roku ( I have that one as well ) that comes with a separate box that sits outside the TV. Either one works equally as well to access the internet and provide you with many, many choices of what to watch, including Netflix, Hulu, Amazon prime and some TV shows as well. After following the Roku instructions for setup ( again very easy ) you should be watching your favorite shows in  about 10 minutes. If you like watching movies, this is the product for you. From older movies to new releases the choices are endless. Most of the content is free except for the aforementioned Netflix, Hulu, etc.  I would certainly recommend buying this Roku to anyone who enjoys watching TV.", "verified": true, "helpfulness": "0/0", "author": "George Burton"}, {"rating": 1.0, "review": "Stopped working after 1 month.", "verified": true, "helpfulness": "0/0", "author": "Kahn"}, {"rating": 1.0, "review": "Well wouldn't you know it this roku stick failed after I had it for 30 days and can't return it. I had an older roku HD and wanted to upgrade to 1080 and opted for this refurbished Roku stick instead of the Roku 3. The stick worked great out of the box for a few weeks and then it started to reset it's self every few hours.  I started to trouble shoot and didn't notice any thing wrong at first.I eventually noticed that the Hdmi connector became loose inside the stick. I was unable to fix the loose connection and now the stick does not function at all. I had used my Roku stick on a side hdmi port and believe the weight of the stick or the pull of the power cord possibly separated a soldering point near the hdmi. This could have been an issue based on the fact it was a refurbished unit. Was desperate enough to pull my old Roku HD out and ponder if I should splurge on the Roku 3 or switch to another media player. I have thought about trying to fix the stick. Only time will tell.", "verified": true, "helpfulness": "0/0", "author": "Lorena Beverly"}, {"rating": 5.0, "review": "5 stars speaks for itself......only problem sometimes you have to reset it because it looses signal", "verified": true, "helpfulness": "0/0", "author": "joe"}]