[{"rating": 5.0, "review": "I previously owned the Roku 3 box and decided to return and get this version. I don't regret it. It is cheaper, smaller, and works the same way (performance-wise). Only difference is that the streaming stick remote does not support headphones, but I can live without it. Love the 4 dedicated buttons in the remote.", "verified": true, "helpfulness": "0/0", "author": "YW"}, {"rating": 2.0, "review": "This Roku streaming stick wi-fi won't work unless it is very close to the router.  Don't order this if you aren't sure your wireless signal is strong enough.  Also is very slow.", "verified": true, "helpfulness": "0/0", "author": "Mitchell \"Mitch\""}, {"rating": 5.0, "review": "This device is awesome!  I have a Roku 3 for the upstairs bedroom and purchased this streaming stick for the living room.  I wish I’d gotten the stick for the bedroom; although the Roku 3 is small, this is practically invisible.The only negative is that I had to connect the power separately.  I know that some TVs can power it from their own USB port, but it would be nice to have this fact more prominent in the features/info, instead of just buried in the manual.  This negative, though, isn't enough to knock off a star.All in all, this performs perfectly well as a Roku device should.  Happily streaming Netflix, Hulu Plus, ESPN, etc. whenever I want.  With the Allcast app, I’m even able to stream what I have stored in my Note 3 to the TV.Great purchase, highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Ender Wiggin"}, {"rating": 2.0, "review": "Had to return, to many disconnects. Basically not stop buffering 10 feet from the router it was connected to.", "verified": true, "helpfulness": "0/0", "author": "amirightoramiright"}, {"rating": 5.0, "review": "The roku stick is perfect... It is a little slow in responsiveness but all in all it is on par with my other Roku devices and has better options than my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "net4gur"}, {"rating": 5.0, "review": "The stick is fine and works fast. I have a 4MB link at home and it streams seamlessly. I happen to live outside the US and don't get all the content, only drawback really.", "verified": true, "helpfulness": "0/0", "author": "K. Dupersoy \"Caribbean King\""}, {"rating": 5.0, "review": "Works nice", "verified": true, "helpfulness": "0/0", "author": "scott"}, {"rating": 5.0, "review": "Got this for a gift for my parents. They absolutely love it and it's very user friendly for people who aren't as savvy.", "verified": false, "helpfulness": "0/0", "author": "julietK \"JulietK\""}, {"rating": 5.0, "review": "EXCELLENT PRODUCT, FAST DELIVERY 100% RECOMENDED", "verified": true, "helpfulness": "0/0", "author": "Eduardo Zuloaga"}, {"rating": 5.0, "review": "Great product and quick delivery!!", "verified": true, "helpfulness": "0/0", "author": "Wisherman"}]