[{"rating": 4.0, "review": "I purchased the Roku Stick (Serial Number 2LA536126266) and it performed poorly in that the remote control would NOT work after using it for about 10-15 minutes.  This is my 3rd Roku device (I have Roku 1 & 3) and I know how to trouble shoot Roku issues: change router channels, press reset button in the remote's battery compartment to pair the remote with the Roku stick, and turned on/off the device by unplugging.  I also ensured that I had strong wi-fi (i.e., comcast broadband cable).On to my second disappointment.  I tried to contact Roku customer service and of course one cannot reach them by telephone.  I had to use Roku's \"Chat\" service.  Once I connected to the Roku chat service, I was customer \"number 73\" and had to wait 35 minutes!  Indeed, this is unacceptable customer service.My third disappointment is that when I finally reached a Roku representative and detailed all the things I did to trouble shoot my Roku Stick, the representative DISCONNECTED my chat line with him!  I waited over 30 minutes and got horrible Roku customer service.  Unacceptable!I am returning the Roku Stick.  Roku's customer service is very poor and needs to improve.Update: 21Aug2015After receiving an email response from Roku Customer Saervice ( included below so as to help others who may find the suggested Roku Stick fix helpful), I am keeping the Roku Stick and editing my one star rating to four stars ( one star deducted for elevating my blood pressure due to Roku installation stress).===========Thank you for contacting Roku customer service.I understand that your Roku remote does not work and I am sorry for the experience you had in our support.I apologize for the inconvenience caused to you due to delay in response.You need not worry, please follow the steps given below to resolve this issue.*Unplug the power supply from your Roku player.* Press and hold the A and B button on the Roku remote (or the Home and Down buttons, if your remote does not have A & B buttons) and then press the pairing button on the remote while still holding down the A and B buttons.* The remote pairing LED should flash. When it does, release the buttons.* You should see 3 more LED flashes. This will clear the remote.*Reconnect the power supply to the Roku player.*Put the remote into pairing mode by pressing the pair button on the back.*You will see the pairing message on screen and your Roku player will pair with the remote.*When the remote has been cleared press and hold the pairing button for 3 seconds or until you see the pairing LED begin to flash* The remote pairing dialog should appear on your TV screenCheck if issue persists, please follow the steps below if the issue still persists,1. Locate the reset button on your Roku stick, press and hold the reset button for 30 seconds2. Release the reset button after 30 seconds3. Open the battery case door and press the pairing button for 15 seconds to setup your Roku stick again4. Check if issue is resolvedNote: While doing the reset to your Roku stick, The Roku Must be turned ON and supplied with Power from a Power outlet through the Roku power adapter.Please write back to us for further assistance.Thank you for choosing Roku and have a great day.RegardsLeonardo de ChelliniRoku customer service", "verified": true, "helpfulness": "0/0", "author": "DancerCommander"}, {"rating": 3.0, "review": "Very unhappy with the remote...this is the second one, had to replace the first.  For some reason this one also stopped working after a day and I had to change the battery and then jiggle the back.  for some reason the batteries are not in secure enough. I am getting frustrated.", "verified": true, "helpfulness": "0/0", "author": "June"}, {"rating": 5.0, "review": "Getting used to it. Like it.", "verified": true, "helpfulness": "0/0", "author": "Richard Rivers"}, {"rating": 2.0, "review": "The refurbished Roku stick did not work on my TV.  However, the company was very polite and asked if I would like to try a replacement.  I choose not to.  I purchased a new one from the store and it worked perfectly.", "verified": true, "helpfulness": "0/0", "author": "CYNTHIA TAYLOR DUPREE"}, {"rating": 3.0, "review": "Pros:Sleak, small and plug and play.Cons:Different interfaces for the apps i.e. netflix, which are crappier experiences than my old Roku LT. This is the app developers fault...not roku, but be warned.Unnecessary shortcut buttons. I don't need pandora or rdio hot buttons. It's a waste of real estate -- they should be programmable.Connection is as reliable as an LT. I would go for an older device if I could.", "verified": true, "helpfulness": "0/0", "author": "NG"}, {"rating": 1.0, "review": "Should have known better purchasing a refurbished Roku. Worked less than 24 hours and had to send it back.", "verified": true, "helpfulness": "0/0", "author": "Mark Lebahn"}, {"rating": 5.0, "review": "Works very well. Certainly meets my expectations.", "verified": true, "helpfulness": "0/0", "author": "George1914"}, {"rating": 5.0, "review": "So easy to install that you can move it to a set where you currently are.", "verified": true, "helpfulness": "0/0", "author": "Judy Pharis"}, {"rating": 5.0, "review": "It`s awesome! Love this device. I recommend it to any one who who wants a clear hd effect with roku on a tv.", "verified": true, "helpfulness": "0/0", "author": "James Fazzini"}, {"rating": 2.0, "review": "Works okay as long as the wifi strength is strong enough (it needs a stronger signal than most wifi devices), but the remote is terrible. I had to resort to using the app on my phone as the remote because the remote stopped working after 3 days. Overall it's okay if you just want to watch netflix, but I wouldn't buy another one or recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Jay Weingardt"}]