[{"rating": 5.0, "review": "I have not had any problems. This is a great deal for the price.", "verified": false, "helpfulness": "0/0", "author": "John Hobbs"}, {"rating": 4.0, "review": "The Roku stick was easy to install and easy to use. I notice a delay when opening Netflix. Once it loads it seems to perform well. It offers a wide variety of channels. Streaming devices to it is not as easy as the other TV streaming system I have, but the price made it easy to justify to add it to a 2nd TV.", "verified": true, "helpfulness": "0/0", "author": "Jack B"}, {"rating": 5.0, "review": "I love this thing - for $49 I was able to drop several cable pay stations. I grew tired of seeing several of the big name subscription movie channels show the same old junk over and over and over while I was paying for services each month for multiple channels that had nothing but old has been movies. I'd rather pay for a movie I actually wanted to watch than to pay for lots of movies I cared nothing about. Not only that, but I can take this with me where ever I travel (I just need to reconfigure the networks settings which was super easy anyway). There is a great deal of free content on this, but the most desirable channels require a subscription (such as Amazon Prime Video)...bt if you have one already, then this is just great. That upfront $49 cost has already saved me twice that in just a few months...great buy and smart move.", "verified": false, "helpfulness": "0/0", "author": "Brian"}, {"rating": 2.0, "review": "Worked great, but burned out after the first several months, and shortly after the warranty ran out. I Googled the trouble I was having and saw that there were so many other people having the same trouble. The Roku logo would bounce, but could not watch any channel. Every single person said the same thing, they had to replace their unit.I have always used a standard Roku and they seem to last a long time. I would not get another Streaming Stick.", "verified": true, "helpfulness": "0/0", "author": "Jeff Launiere \"Tampa Realtor\""}, {"rating": 5.0, "review": "Yippee it worked it worked right off the bat--I have no antenna or cable connection in my bedroom and I wanted Roku in my bedroom. So I got the little stream stick--YES, YES, YES, it took a few minutes to get connected, as my wireless router is in my living room. I moved it just a bit so it could find the wireless connection and I was up and working and all my channels downloaded, software updated and now I have TV for the winter in my bedroom. I can watch all my favorite movies, tv shows--'cause I so HATE regular tv....and the fall 2015 season looks to be just --well- yuck! Thank you Roku!", "verified": true, "helpfulness": "0/0", "author": "LJ Minor \"LJM\""}, {"rating": 5.0, "review": "I love it.  Goes great with my Chromcast!  Thks", "verified": true, "helpfulness": "0/2", "author": "SP"}, {"rating": 5.0, "review": "Highly recommended !", "verified": true, "helpfulness": "0/0", "author": "Bill Toth"}, {"rating": 5.0, "review": "Works wonderfully I have two shipped fast", "verified": true, "helpfulness": "1/1", "author": "Frances"}, {"rating": 4.0, "review": "Not what I expected.  It will not help me CUT the cable.  Many of the channels are not HD and there are some strange ones out there.  It works, but I still want my cable for local channels and so much more.", "verified": true, "helpfulness": "1/1", "author": "Steve"}, {"rating": 4.0, "review": "I use it to see vimeo & youtube and it is fine.", "verified": true, "helpfulness": "0/0", "author": "carlos velazquez"}]