[{"rating": 1.0, "review": "Totally Useless and Awful outside US, UK and Ireland. You can not stream Netflix although you have a Netflix account.If you live outside US just buy other product and brand. I have Apple an no problem", "verified": false, "helpfulness": "0/0", "author": "Ariel Ejgenberg"}, {"rating": 5.0, "review": "Bought for my Granddaughter's TV. She loves it!  Arrived right on time", "verified": true, "helpfulness": "0/0", "author": "D. Harvey"}, {"rating": 3.0, "review": "Have to hold it just right for the power cord to work properly.", "verified": true, "helpfulness": "0/0", "author": "Larry Persons"}, {"rating": 5.0, "review": "This device has enhanced our tv watching.  Only complaint is the search mechanism and I'm not sure if that's a factor of the vendors like hulu and netflix or if it is roku.  It's a keyboard type entry and slow to use with directional keys.", "verified": true, "helpfulness": "0/0", "author": "Linda Blaize"}, {"rating": 3.0, "review": "I bought this in addition to my Chromecast because I really wanted to access Acorn TV.  Setting up was straightforward but time consuming when it came to authorizing channels such as HBO and ESPN.  The reason I cannot give this more than 3 stars is the remote.  Within a couple of weeks it would stop functioning and the only way to restart it seemed to be to remove and replace the batteries.  This could happen multiple times in the same viewing session. From research online many others have had similar problems.  Eventually the remote stopped working altogether.  I followed the troubleshooting steps from the Roku website - first self-guided and then walking through it in chat with the Roku tech support online.  The tech decided I needed an new remote which arrived in about 3 days and seemed to solve the problem (time will tell).  Unfortunately the troubleshooting process involves doing a factory reset so you lose connection to your WiFi and all your channel authorizations - and of course you cannot get that back up and running until you have a working remote.  Kudos to Roku for replacing the remote quickly (and for being available at midnight) but I think if this happens again I shall just use the remote app on my Android phone.", "verified": true, "helpfulness": "0/0", "author": "Edmund Hardy"}, {"rating": 5.0, "review": "It;s wonderful, but too hard to set up.would like one that you just plug in and it works without all the passwords and instructions!", "verified": true, "helpfulness": "0/0", "author": "Rudy's Mom"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Gricelda Cerda"}, {"rating": 3.0, "review": "I like the stick but the battery runs down in the remote control even while not in use. inspite of this problem I would stick buy another one.", "verified": true, "helpfulness": "0/0", "author": "pamela cameron"}, {"rating": 5.0, "review": "Love my Roku stick!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Rudy"}, {"rating": 1.0, "review": "This device is so maddening as it over heats and reboots within 2 minutes of watching a movie.  DO NO BUY this device as you wiil be so frustrated if you do.", "verified": true, "helpfulness": "0/0", "author": "paans"}]