[{"rating": 5.0, "review": "space saver", "verified": true, "helpfulness": "0/0", "author": "SM"}, {"rating": 5.0, "review": "This is a wonderful gadget everyone who loves movies must have. Simple and reliable. I especially like that it makes my You Tubes easy to play on the TV.", "verified": true, "helpfulness": "0/0", "author": "Setter Dog \"Jack\""}, {"rating": 4.0, "review": "I would have given this 5 stars, however, it is difficult for it to fit on one of my tv's because of its length.  In addition, it froze up on one occasion.  When I switched to the Roku device it was actually on Vudu (which I had not changed it to).  The remote control would not change the channel and I had to \"unplug\" it and then plug it back in.  I still have cable at this point as I have not moved permanently.  Once I move and get Internet only, I will be using Roku and over the air tv exclusively.  So far, when I use Roku, it is very easy to use.  When watching live shows it does lag about 5 minutes behind the scheduled time.  No biggie.", "verified": true, "helpfulness": "0/0", "author": "nola navy \"ikzdur\""}, {"rating": 5.0, "review": "Arrived sooner than expected and easy to set up and use. Very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "jonathan n. soler"}, {"rating": 4.0, "review": "the good:  Its Roku so you get a lot of services and they don't force you to use one service or the other.  Which is what makes their services and products so valuable.  Its small and connects quickly.The bad:  Wifi connectivity can bounce at times.", "verified": true, "helpfulness": "0/0", "author": "M. Viton \"go buckeyes!\""}, {"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Brent"}, {"rating": 5.0, "review": "This is my 3rd Roku (my 1st Roku stick). Like the others, it's a thing of beauty - hardware and software wise. It works exactly as advertised. It MAY be just a tad slower than the regular Rokus when working thru the menus, but when streaming I can't tell the difference. And its easily transportable...", "verified": true, "helpfulness": "0/0", "author": "Frodo9 \"NewYorkah\""}, {"rating": 5.0, "review": "This is the perfect substitute for cable if you're ready to cut the cord. It offers many of the same shows that you pay extra for on network cable channels. It's also extremely easy to use and practically no set-up involved. If you're afraid to cut the cord and go to free TV, don't be! Just buy this.", "verified": false, "helpfulness": "0/0", "author": "Salemgirl63 \"Ethan's Granma\""}, {"rating": 1.0, "review": "Horrible. Do Not Buy. Does not work at all. Takes over a minute to boot up and then immediately crashes. Can not even get past second screen of set up. There are better options out there. There are even better stick devises. Total junk. Returning less than an hour after purchase, it is so bad.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great! This will enable me to \"cut the cord\" aka get rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Joseph P. McNamara \"jpmcbooks\""}]