[{"rating": 3.0, "review": "had to ship it back after I got the blue screen. Roku 3 worked without a glitch", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Quick streaming, and no buffering even on Wifi. Good product.", "verified": true, "helpfulness": "1/1", "author": "SustainAbility Man"}, {"rating": 5.0, "review": "Five stars", "verified": false, "helpfulness": "1/1", "author": "Sara Bragg Gray"}, {"rating": 5.0, "review": "This is a great devise. Doesn't take up space on tv stand.", "verified": true, "helpfulness": "1/1", "author": "M. Enright \"hush\""}, {"rating": 4.0, "review": "great while it's working.  Has a sloppy fit with the HDMI connection at the TV and I had to reset it several times (tiny reset button on side & rear of the stick...hard to see)  I'm keeping my fingers crossed for the future..stay tuned...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "after two days the video quality was great but it kept losing sound! Without sound its useless", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "1/1", "author": "Hugo"}, {"rating": 4.0, "review": "We like it a lot. Hard to beat for the money. USE the external power supply. We only  subscribe to Netflix...and use Amazon in conjunction with Prime, so there are many things we cannot watch wIthout payING more, but there also are many things we can watch. The options are there. It's pretty easy to find what you are looking for and for the most part pricing info is available.", "verified": true, "helpfulness": "0/0", "author": "neast70"}, {"rating": 5.0, "review": "I'll make this short and sweet. I received the stick today from Amazon with Prime two-day shipping and installed it with absolutely no problems whatsoever. I followed all the prompts and each step went according to plan. It took about 15 minutes total including the updates which consumed about half the total time. The wifi connection operates a little slower than the box did but it is worth it to be rid of the extra cable and the box. The stick is connected very discreetly behind the TV and out of sight. Great for a wall-mounted TV. BTW this is my second stick and both are operating flawlessly.", "verified": true, "helpfulness": "1/1", "author": "ROYMAC \"roymac\""}, {"rating": 5.0, "review": "This little device is awesome.  Bought it for my mother so she could do Netflix and Amazon Prime without much headache.  Last I checked, there were 252 movie apps alone.  That is just crazy.  I never imagined there would be so much free content.  Only downside is 720p, but she is ok with that.  A lot more robust than ChromeCast but also more expensive ($15 more).", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer \"TehAsian\""}]