[{"rating": 5.0, "review": "Smartest move we've made in a long time. Buh Bye cable!!", "verified": true, "helpfulness": "0/0", "author": "Mary Dunn"}, {"rating": 5.0, "review": "I love this product, the only drawback is I have to purchase some of the other channels, the cost may get to costly.", "verified": true, "helpfulness": "0/0", "author": "Anya stewart"}, {"rating": 5.0, "review": "I absolutely love my Roku Stick! I mostly use it for Netflix, but the many other channels come in handy for something new.", "verified": true, "helpfulness": "0/0", "author": "Shady Katie"}, {"rating": 5.0, "review": "Great Device Works As Described No Problem Setting Up And Literally Streaming In Seconds.Would Recomend This Product, Lots Of ChannelsTo View Online Media Content In A Nice Compact Device That Resides Behind Your HDTV", "verified": true, "helpfulness": "0/0", "author": "Sherwin Braithwaite"}, {"rating": 5.0, "review": "Factory refurbished stick arrived quickly, and looked brand new in every way.  The stick has been a delight since we don't have cable, and can also be controlled with your smart phone via Google app.  Delighted with our purchase.", "verified": true, "helpfulness": "0/0", "author": "Elvin Lewis"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Patsy"}, {"rating": 5.0, "review": "I like this so mcuch better than the original Roku I have (wired version).  Don't have to worry about the wires or where you are going to place it to get the best reception.  If you have a TV that has the HDMI port don't hesitate to get this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"juniorlover8\""}, {"rating": 5.0, "review": "Awesome product. Way better than the fire stick or chrome cast", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome little product. Exactly what I wanted and now I can binge-watch Doctor Who all I want!", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 1.0, "review": "THis product keeps breaking.  I purchased 3 from Amazon.  Replaced one; and now the second one has stopped working.  I am sure the 3rd one will also have the same issues.  Remotes just stop working; replace the battery and still no luck.  Absolutely crap.", "verified": true, "helpfulness": "0/0", "author": "Ash Kapur"}]