[{"rating": 1.0, "review": "If the Roku stick worked the way it was supposed to I would LOVE it!!! But....... the remote only works half the time (with new batteries) even the app you download for your phone only recognizes the stick half the time. Half of the time I have to unplug the stick for half an hour or so to make it work. To bad we already canceled cable. I was hoping for more. To bad I don't have the money to replace.", "verified": true, "helpfulness": "1/2", "author": "PurrrpleKitty"}, {"rating": 2.0, "review": "Purchased this item from a local store to augment the retarded wireless card/vizio apps on my vizio tv (that don't work half the time).I thought I would have access to many more channels or the ability to pay for them as I do for Hulu/Netflix. There is no such option.Many of the \"channels\" listed for Roku devices require the subscriber to have a normal TV service (cable/satellite), through a provider that has an agreement with Roku. If you do not pay for regular tv or cable most of these channels are useless to you.Why Roku would not want to also offer these channels as a direct purchase is beyond me. Some people do not want \"regular tv\", will never want it and will never have it. Roku and tv networks miss out on an entire market with this strategy- and we all know why. Commercials. They cannot ram as many commercials down your throat on the internet and hence make less money through this avenue.Additionally the cool Roku android app that allows you to use your phone as remote control, simply does not work for me on either of my android phones. It does not find the Roku device on my wireless network. Roku's service tells me to power cycle everything, reinstall the app. They are useless.", "verified": false, "helpfulness": "2/3", "author": "C. Marriott"}, {"rating": 5.0, "review": "We own two Roku boxes and have to say this design is so much better!All the usual benefits of Roku in a much smaller, portable package.Only detractor is that it can be a tad slow to respond to the remote but this is a known issue.We will soon be purchasing another for yet another TV.", "verified": true, "helpfulness": "1/1", "author": "biglove"}, {"rating": 1.0, "review": "First one arrived with a broken remote.  Second one stopped working right after the return date past.  It was great when it worked, but if it cant last it is not worth buying", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I did not like, did not know that Mexico does not work 100%", "verified": true, "helpfulness": "0/1", "author": "horacio zamarripa"}, {"rating": 4.0, "review": "This is an amazingly inexpensive piece of great technology! The more I play with it the more I love it! The only problem is my hdmi ports are lokated in an inset on my tv. The inse is not big enough for the stick and the power cord so I have to use my Roku on a different tv than planned.", "verified": true, "helpfulness": "0/0", "author": "Chris Provance"}, {"rating": 5.0, "review": "I had been streaming internet viewing through my WII.  I attached this streaming stick and saw how crisp and clean my picture is now.. true HD.  Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Traveler"}, {"rating": 4.0, "review": "A little slow but works great.", "verified": true, "helpfulness": "0/0", "author": "pimpinhoes"}, {"rating": 4.0, "review": "We finally ditched everything but the basic cable box in our living room - and all because of this guy right here. Now, I started my Roku experience with a Roku 3, and I will say that this guy just can't complete with the 3's system speed (hence only 4 stars), but for something discrete that gives me access to my Plex server, Amazon Prime videos and the random thing on YouTube, I'm all set. Very happy with the purchase, and for a room that we don't view TV in as much as other rooms, it was half the cost for the same set of programs. Quite pleased.", "verified": true, "helpfulness": "0/0", "author": "Severard"}, {"rating": 5.0, "review": "Roku rocks!!!", "verified": true, "helpfulness": "0/0", "author": "Dakneek"}]