[{"rating": 4.0, "review": "This system easily connects to our television and allows up to watch Netflix streaming and shows off Hulu....very basic but small which is great for a television that is mounted on the wall.", "verified": true, "helpfulness": "0/1", "author": "Craig and Suzy Bruya"}, {"rating": 1.0, "review": "spent 1.5 hours trying to watch a 24 minute show. It could only stream or hold a connection for about 1-2 minutes at a time and would continuously disconnect to the remote. When it would stay connected, it would buffer every minute or so.  It is 20' from my router and the other 5 items I have connected to my router have no issues at all. Faulty product until they come out with a better connectivity interface to the remote and one that will hold a connection to the wifi longer than 2 minutes.", "verified": false, "helpfulness": "2/4", "author": "Marc Worthley"}, {"rating": 3.0, "review": "But you didn't ask yesterday and today the damn thing froze up.  Couldn't get it to move off the particular item that I was trying to find out about it.  So, I guess it's back to Google Chromecast.  Even though Chromecast was not as convenient to operate (only works with Google Play, Netflix or You Tube) it does work consistently well.  The hangup is that there is no remote and you need to your your iPhone or iPad to control it.  Roku should be good but it should NOT freeze up. I'll try it again in a few days but when you pay $50 for something it should work more than a couple of weeks, especially when it's only used maybe twice a week for an hour or two.", "verified": true, "helpfulness": "1/3", "author": "Bearister \"Bearister\""}, {"rating": 5.0, "review": "This is the first and only device I've have ever owned to stream. I have always been chained to my laptop to watch Amazon Prime and Netflix. This tiny little stick has completely revolutionized my television viewing experience. It was well worth the $49 for the basic functions I needed as a \"beginner\". It was easy and relatively quick to set up. I love that it cannot even be seen when plugged into the tv. It's a small device, kind of like a large thumb drive. And the wire comes out to plug into the USB on my tv. A monkey could figure out how to plug it in. The remote is basic and fits in hand very well. My ONLY qualm with the remote is the totally rounded bottom. It rolls around everywhere. But it's not that big a deal. All in all, I'm in love with this little thing. It's so easy to just binge watch all my favorite shows and movies right on my tv at the touch of a few buttons. I've already recommended it to so many people and I've only had it for a week.", "verified": true, "helpfulness": "0/0", "author": "Love You"}, {"rating": 5.0, "review": "I love the Roku 3500R Streaming Stick! It was a great price and works exactly as advertised. Just plug it in to a HDMI port on your TV and get it connected to your wireless network  and you're off and running. It automatically updates its software and then you're ready to set up whatever Roku channels you want to have. If you're familiar with the Roku box, this works very similarly. You can't \"cast\" to it like you're supposed to be able to do with Google's Chromecast stick -- that would really be a nice feature -- but I could never get the Chromecast stick to work properly with my TV, even after Google replaced it for me three times. I had no trouble whatsoever with the Roku 3500R Streaming Stick. If you like Roku, or would like to give it a try, I highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Neil Bergman"}, {"rating": 4.0, "review": "very good and nice and small.  only drawback is that the power cord is too short.  It should be twice the length", "verified": true, "helpfulness": "0/0", "author": "marshliving"}, {"rating": 5.0, "review": "Just graduated college and don't want to sign up for a cable account yet and this has been awesome.  I got a Netflix account and can watch so much great content for cheap.  I love this device.", "verified": false, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 5.0, "review": "Already had Roku XS. Really like it for streaming to my hdtv. Had another tv in another room so I ordered the stick. This works even better. It recognizes the 5gig side of my router and it can be set up without using a wall plug as long as your tv has a usb plugin. Great product!", "verified": true, "helpfulness": "0/0", "author": "BN"}, {"rating": 5.0, "review": "This product is great!!  I had my doubts at first if it would be able to talk to the remote from behind the TV where my HDMI input is located but it has been communicating perfectly!  I tried to see if the TV could power it like the instructions suggested trying but it kept shutting off so I then powered it from an outlet and have had ZERO issues with it.  The instructions said some TVs simply do not have the juice for it.  The set up was a breeze and I could not be happier with it.  I highly recommend this product and what a great price too!!  FIVE stars!!", "verified": false, "helpfulness": "0/0", "author": "Kimberly Tello"}, {"rating": 5.0, "review": "I'm very well pleased with your product and its timely shipment of it. It meets all of my current needs at this time and I would recommend it to other's.", "verified": true, "helpfulness": "0/0", "author": "Mike Tinder"}]