[{"rating": 5.0, "review": "Great product. Easy to set up and navigate.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 3.0, "review": "Works fine but interface is a bit clunky and not as intuitive as Apple TV.  remote does not have headphone output like other Roku hardware.", "verified": true, "helpfulness": "0/0", "author": "Manu"}, {"rating": 2.0, "review": "Hoped to use streaming stick in a bedroom but when plugged into the TV, it cannot access the wireless router located at the front of the house. My previous Sony blue-ray player with wireless built-in had no trouble accessing the router from the same location. Thought that the Roku stick would be smaller and more convenient. I verified that the Roku streaming stick was functioning by plugging it into a TV in the room directly across from the wireless router. Works fine when located close to the router. This is my first Roku product and I am very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Jamie M. Broadhead"}, {"rating": 3.0, "review": "I love roku and have two other roku's so was excited about trying the stick.  I did not realize it has to be plugged in.  I thought I would have to maybe charge it but it has to stay plugged in so that is not great.", "verified": true, "helpfulness": "0/0", "author": "Lu Cutlip"}, {"rating": 1.0, "review": "Can't get it to work on any of our TV's.  Even tried replacing the current Roku 3 but still wouldn't work.  The remote worked with the old 3 when it was plugged in though...... just not the stick itself.  Will be replacing it with another 3.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 1.0, "review": "Did  not work and was returned", "verified": true, "helpfulness": "0/1", "author": "Wyochipster"}, {"rating": 3.0, "review": "Now that I have a new TV with the Roku Program installed, I don't use the Roku Stick anymore. It is a good product for TV's that don't have the program built in.", "verified": true, "helpfulness": "0/0", "author": "Jo B. Geraldson"}, {"rating": 5.0, "review": "Great product. Have been a Roku owner for years. Using in conjunction with DroidTV and Allcast Apps is a perfect way to cut your cable.", "verified": true, "helpfulness": "0/0", "author": "Karen K \"Karen Kraus\""}, {"rating": 5.0, "review": "Received the Ruko 3500R for Christmas.  Installed in a matter of minutes.  If you have wifi this is a must have plus Amazon has the best price.  Channels available are awesome.", "verified": true, "helpfulness": "0/0", "author": "Richard J Sweany"}, {"rating": 5.0, "review": "Extremely fast delivery of quality product.", "verified": true, "helpfulness": "0/0", "author": "Belinda"}]