[{"rating": 1.0, "review": "It was broke-you have to take the battery out to restart it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "What a great product.  I use this in my bedroom to get Netflix, Amazon, etc on my TV.  I also have an older Roku in the guest bedroom.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth R. Gurley"}, {"rating": 1.0, "review": "I would give it zero stars, but it doesn't give me that option. I own 3 other Rokus (2 Roku 1s and a Roku 3) so when I saw the stick I thought \"hey, that'll work great\". I got it and plugged it right up to my TV thinking this'll be a breeze. Nope, I tried for 6 hours on the first day and all day off and on on the second. My husband and I did some research and we noticed a lot of people were having trouble with the DNS through Comcast and the stick. So, needless to say we are sending the stick and sticking with the Roku 1.", "verified": true, "helpfulness": "0/0", "author": "Sonia M. Maddox"}, {"rating": 5.0, "review": "The Roku Stick (Certified Refurbished) is awesome. Just like buying new and you can save about $15. It comes with the same remote as its bigger brother and has most of the same functions. You can't go wrong with the streaming stick. It's got more channels than Chromecast and Fire Stick and you can get the same applications as you can get on those platforms.", "verified": true, "helpfulness": "0/0", "author": "Matt Grimes \"Mustang Man\""}, {"rating": 5.0, "review": "I work at RadioShack so I already knew about this device. I really love it.", "verified": true, "helpfulness": "0/0", "author": "Lindsey Leonard"}, {"rating": 5.0, "review": "It works just fine,  no problems", "verified": true, "helpfulness": "0/0", "author": "LaTanya Watson"}, {"rating": 5.0, "review": "Decided to try this refurbished unit. Not so much the price but no idea what we would do with \"streaming\" programs. And with temporal loss of Fox news on Dish, wanted to look for options. Well, it works fine. Hook up was neat. Actually, signing up for Netflix was tricky, but their customer service was great. After a few days of Netflix I cancelled service and went with Amazon Prime. Yes, gotta get thru the rentals/purchase but overall better selection. Got PBS Downton Abby 4 seasons at no cost.  For new releases you will save at Red Box over Amazon, but I found better content with Amazon Prime (and lower cost & free shipping if you do a lot on Amazon). Future will be in streaming. Good product, as is the Fire Stick, but was available. Love Roku portability.", "verified": true, "helpfulness": "1/1", "author": "M. Tate \"Lincoln Reader\""}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Erin Nicole"}, {"rating": 5.0, "review": "easy to use.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Use as a cheap option instead of Apple TV for rooms we don't watch as much tv in. Much more limited then the Apple TV (no iTunes streaming from Mac) but great for Hulu, Netflix, and prime", "verified": true, "helpfulness": "0/0", "author": "Scratch!"}]