[{"rating": 5.0, "review": "I LOVE IT", "verified": true, "helpfulness": "0/0", "author": "w. green"}, {"rating": 2.0, "review": "Unit finally (after days of trying) linked up and went through its update process.  Actually started a movie from Amazon.  Much pausing, buffering, etc. Movie was unwatchable.  Acted a though it was slugish.  Speedtest of internet was better than 5mps.  Returned unit for credit.", "verified": true, "helpfulness": "3/4", "author": "owenr"}, {"rating": 5.0, "review": "We already had the original Roku and moved that one downstairs and bought the stick for the upstairs TV. We are planning on getting the projector next spring, so this was step one. We love the Roku and the wide variety of channels we get access too. When we bought this stick, the deal was to include two months of Huluplus.. which we kept. (they knew)...  Recently our cable/internet company (Comcast) had some lengthy issues and we were down for while. Shortly after coming back up we noticed problems with the Roku. Freezing. Slow stream. We troubleshootewith the other Roku and determined it was the stick. Since we are under warranty, we wanted a new stick. They asked us to first doing some troubleshooting with Comcast - asking them to change a DNS.. three hours and 20 points away from a stroke for my husband, he gave up.  We decided to give it few days..and start again. Today Roku emailed US..and asked if the problem was solved. OUTSTANDING CUSTOMER SERVICE action!!!.  When they were told that Comcast refused to change the DNS.. we were told \"you clearly have done everything you could, we are going to send you a new Stick.  MORE OUTSTANDING CUSTOMER SERVICE.  So my honey has a gazillion channels again, and it is nice to be able to say something good about a company (which I cannot say about Comcast)", "verified": false, "helpfulness": "1/1", "author": "Candyce C. Fleming \"Candyce\""}, {"rating": 2.0, "review": "Bought this for a friend and sorry to say it does not do well with Wifi....", "verified": true, "helpfulness": "0/0", "author": "John K Crowell"}, {"rating": 5.0, "review": "The set up took a bit longer than I expected due to several steps, but could have been shortened by not spending time reviewing the options of which apps to include during set up.  With that said, I do like that I had a choice of which apps to include instead of being stuck with dozens I'll never use having to scroll through those to get to the ones I do use.Overall, if you take a little extra time upfront to do all the options, this is a user friendly design, very simple to use & I'm now considering purchasing more to replace my expensive blu-ray players that seem to break after 6-12 months of use.", "verified": true, "helpfulness": "0/0", "author": "Kathy Chemacki"}, {"rating": 5.0, "review": "Love my Roku.  Super easy to install and I use it daily!", "verified": false, "helpfulness": "1/1", "author": "Iva Crawford"}, {"rating": 5.0, "review": "I also have an Apple TV. Love them both but the ease of moving the Roku from one TV to the other is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Vanessa Thomas"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "JRenaud11 \"jrenaud\""}, {"rating": 5.0, "review": "Directions were excellent.  No problem to get up and running. Excellent value.", "verified": true, "helpfulness": "0/0", "author": "Roger W. Chastain \"Retired\""}, {"rating": 1.0, "review": "Ordered it, waited a couple weeks to try it out as i have a newborn. tried to install and it doesnt work, the power connection (mini usb) is loose and falling out of the unit. Tried to return today and i am 6 days late on amazon's return policy. Thanks amazon", "verified": true, "helpfulness": "0/1", "author": "John Harth"}]