[{"rating": 5.0, "review": "This item works like Chromecast with much more apps to offer.  It is affordable if you don't want to spend on ROKU2 or ROKU3.  It works the same way.  I recommend this to everyone!  HD Streaming to the max!", "verified": true, "helpfulness": "0/0", "author": "ELECTRONICS CAGE"}, {"rating": 5.0, "review": "Better than the original box. Easier to navigate with. Only thing I wish the charger didn't stick out in the back of unit. If you are mounting TV on wall, this unit will stick out of TV because you can't really put it in HDMI port at back of TV because it won't fit. You instead need to plug into one of the side ports, which means it sticks out of the TV. This is probably not an issue with TVs that can provide sufficient power for the unit but my older one doesn't so this becomes a bit of an eyesore.", "verified": true, "helpfulness": "0/0", "author": "Quiet Review \"KTQ\""}, {"rating": 2.0, "review": "it lasted 5 months now nothing. remote still works. i still have the original roku box for years still works. now need replacement for stick", "verified": true, "helpfulness": "0/1", "author": "grandma bear"}, {"rating": 1.0, "review": "The wireless signal absolutely sucks!  I've had other Roku's and this is WEAK!And.... the processor is so minuscule, that it has delay, non-response, etc.  I almost threw it against the wall.", "verified": true, "helpfulness": "0/0", "author": "Brennan Patten \"Brennan\""}, {"rating": 5.0, "review": "Love it!!!  Love all the free streaming stuff for children.  Only minor drawback. If you turn TV while it is streaming, will take a second to reconnect wirelessly, but will just pause a second, and then restart where you left off.", "verified": true, "helpfulness": "0/0", "author": "SRS"}, {"rating": 5.0, "review": "I love it. I can watch what I want when I want.", "verified": true, "helpfulness": "0/0", "author": "Glenn Trotter"}, {"rating": 5.0, "review": "Have had a Roku 3 for a year on my big TV, but fancied a similar experience on the little wall-mounted TV in the kitchen.I was a little concerned that the stick would be slow or laggy, but it's a great little device, with little performance difference to the Roku 3 in the menus, and no noticeable difference when actually streaming.I've bought another of these sticks for the bedroom, and wouldn't hesitate to recommend this to anyone.My Chromecast is being used less and less these days...", "verified": true, "helpfulness": "0/0", "author": "Roy Santos"}, {"rating": 2.0, "review": "I love Roku, but not my experience with the streaming stick. I originally got it because I liked the feature of being able to plug the usb into the tv to have less cable to hide. However, not all tvs are supported and it wouldn't work with mine. I would hope that my unit was defective, as it was super slow (Way slower than a Roku HD), had issues connecting to wifi (I had to rescan almost 30 minutes before it picked up my wireless network. I am using a Docsis 3 Arris with a 50 down 5 up connection and no other devices in the apartment have this issue. Including my first gen ipod touch. The router was in the same room.) There were times it would drop connection, reboot on own, and was an overall headache. I do give kudos to Amazon for their awesome return policy. I ordered another Roku 3 and could not be happier.", "verified": true, "helpfulness": "1/2", "author": "B. Fowler"}, {"rating": 4.0, "review": "The reception isn't always great because of where my HDMI ports are on my TV but otherwise good prodcut", "verified": true, "helpfulness": "0/0", "author": "Jennifer Ford"}, {"rating": 5.0, "review": "Works as sold", "verified": true, "helpfulness": "0/0", "author": "Winston C. Weir"}]