[{"rating": 5.0, "review": "Love this and have on all my tvs", "verified": true, "helpfulness": "0/0", "author": "Lola M. Barnett \"L0la\""}, {"rating": 1.0, "review": "Terrible, compared to other Roku products. Laggy performance, remote control buttons have to be pressed multiple times to incite any kind of response. Software updates made it worse over time. Avoid!!!", "verified": false, "helpfulness": "1/1", "author": "James Whelan"}, {"rating": 4.0, "review": "Very Good Streamig Stick. Better than the other $39.99 one or $34.99 one. This one has way more apps that others cant seem to close deals with the media companies on such as hbo go, showtime anytime, watchespn, nba gametime, and nfl now.I MAJOR FLAW is that the Roku 2, Rokuw 3, and Amazon Fire Stick are all way faster than this processor. Very noticeable delays in watching videos and loading menus. I'd like to see more Ghz in the processor and hopefully be one of the first to test it !!??Solid 4 Stars", "verified": true, "helpfulness": "2/2", "author": "Concerned Customer"}, {"rating": 5.0, "review": "this was perfect.. now I don't have the clutter of cables and a roku device sitting around.. highly recommend", "verified": true, "helpfulness": "0/0", "author": "David R Thompson"}, {"rating": 5.0, "review": "Very easy to use. I am a total technical moron when it comes to these things and I was worried about lengthy technical calls to someone overseas reading from scrips but setup was super simple and uncomplicated and I got it going within 20 min. Streaming has been very good. I plug this into an Epson compatible projector and we have watched numerous movies on a large screen through the Amazon streaming service. The remote is straight forward and does not suffer from the 100-button syndrome. It would be nice if the remote had lighted keys for dark operation, but not a biggie.", "verified": true, "helpfulness": "1/1", "author": "Ivan W. Ong"}, {"rating": 5.0, "review": "Liked it enough we bought a 2nd one for upstairs.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Love"}, {"rating": 5.0, "review": "Excellent price for an excellent product.  I bought this for my daughter.  We have the regular Roku on the living room TV.  I'll be buying another of these if we add a second TV set in this house.", "verified": true, "helpfulness": "0/0", "author": "D. J. Taylor"}, {"rating": 2.0, "review": "This was our second Roku, the first being a Roku 2.  We purchased this one the first week of November and returned it about a week ago.  It began reloading over & over again about every 2 minutes and finally we just got a grey screen.  Amazon has amazing customer service and we only had to put it in a padded envelope & put it on the front porch for UPS to pick up.  We have had the Roku 2 for a couple of years now & it works like a charm.  We probably won't replace with another Stick, probably a Roku 3.", "verified": true, "helpfulness": "2/3", "author": "BeccaH \"Rebecca Ramey Hill\""}, {"rating": 5.0, "review": "I like this Roku alot.  It would have been very easy to get started if I had known how to set it up right.  Had everything in the right place but I kept setting it on Xfinity since that is my cable.  I didn't know and I was on the phone for the 3rd time with the cable company before I found I was setting it on the wrong thingy.  I'm not a wizard  I should have had one of the kids do it instead I had to wait for my son.  Waited a while.  Still need some directions about channels.", "verified": true, "helpfulness": "0/0", "author": "Mema Yvonne \"mema\""}, {"rating": 5.0, "review": "an amazing invention", "verified": true, "helpfulness": "0/0", "author": "carl"}]