[{"rating": 5.0, "review": "Excellent for the kids' rooms.", "verified": true, "helpfulness": "0/0", "author": "paramyst"}, {"rating": 5.0, "review": "Great super 👍👍", "verified": true, "helpfulness": "0/0", "author": "Jorge velazquez"}, {"rating": 5.0, "review": "I use this primarily for Netflix and Hulu and it works flawlessly. I like that the stick fits behind the TV and gets power from the TV USB port. I also like that the remote uses RF (radio) verses IR (infrared). This mean that you don't have to point the remote at the TV.If your TV is wall mounted you might want to look and see if the HMDI port(s) are facing to the back, or if they face to the side. If they face to the back make sure you have enough clearance between the HDMI jack and the wall to install the Roku stick. My TV had a side mounted HDMI port so I had no issues.The only criticism I can see is the stick does take about 30 seconds when switching from one service to another. But I cost is a concern I would recommend. If cost is not a concern you might want to purchase one of the other Roku boxes which cost a little more.", "verified": true, "helpfulness": "0/0", "author": "Steven Alpha"}, {"rating": 5.0, "review": "Great.  No problems, works fine.  Used USB port on TV for power and it works fine also.", "verified": true, "helpfulness": "0/0", "author": "MW"}, {"rating": 1.0, "review": "The stick literally fell apart after 14 mos. The hdmi port came right off the stick. And Roku will not replace.  Just beware that it may only last a yr or so", "verified": true, "helpfulness": "0/1", "author": "onafone"}, {"rating": 5.0, "review": "Was as I thought it would be. WE have older models and wanted the ease of the Stick. Works fine.", "verified": true, "helpfulness": "0/0", "author": "Chris Wells"}, {"rating": 2.0, "review": "I haven't really been able to get it working more than a few mins at a time.", "verified": true, "helpfulness": "0/1", "author": "Mergal"}, {"rating": 4.0, "review": "Great. It's in my kids room for her to watch kid tv. Had some problems with the install- but once resolved no further problems.", "verified": true, "helpfulness": "0/0", "author": "K. Joyce \"lost soul\""}, {"rating": 3.0, "review": "Decent streaming device. . Good reception fast and easy to use.  It comes with a remote control,  slick design.  Tons of applications you can add on to the roku box. I've owned the roku streaming stick, roku box 3, chromecast,  matricom g-box mx2, and the fire tv.  The design of this platform is better than the fire tv.  But the Amazon firetv is hands down the best streaming device on the market.  You still get some buffering.", "verified": true, "helpfulness": "0/0", "author": "kin137"}, {"rating": 5.0, "review": "Great device. Saving money with cable company by not paying for an extra cable box.", "verified": true, "helpfulness": "0/0", "author": "Jose A. River"}]