[{"rating": 2.0, "review": "From the beginning, nothing but trouble. It seems the unit will over-heat and just freeze up. You can't expect to pay this little and get something worthwhile. Processor's that run cool in small packages just cost too much to find at a price like this but it's what me daughter wanted for Christmas. She knows better now.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 2.0, "review": "Mine didn't work. Set it up and it would come on for a minute then go off. The unit was extremely warm. I tried it on a tv where we use an older model roku same thing.returned it for a refund. Amazon service is always good.", "verified": true, "helpfulness": "0/0", "author": "eddie moreland"}, {"rating": 5.0, "review": "easy to use and non-intrusive.", "verified": true, "helpfulness": "0/0", "author": "Camille Stutzman"}, {"rating": 1.0, "review": "Just got the Roku stick and tried to set it up today. Kept getting error 011. Went through suggested troubleshooting on Roku website: unplug power from Roku, unplug power from modem/router, reset Roku. None of this worked. Also, the remote stopped working with the Roku.  Tried text chat and was 97th in line with estimated 48 minute wait. Tried calling the 800 number while waiting for chat, but got a busy signal. Went back to the website to wait for live chat, but was disconnected after about 10 minutes. Called the 800 number again and this time was put on hold. Waited on hold for about 25 minutes, then finally was able to speak to a person. He told me that the Roku servers were down, but walked me through the setup process again to make sure the device was working. He instructed me on pairing the remote again, so at least that was working. However, nothing could be done to get this $50 piece of plastic working because supposedly the servers are down today. He informed me that they are working on it, and that I should try again tomorrow. Wow, what a wonderful experience trying out a new product. I have had an Apple TV box for the last 5 years and have NEVER had this issue. I thought the Roku stick would be a step up, but, boy, am I sorry I wasted that money now.  Even if the device works tomorrow, this experience has killed my trust in this company and I would not recommend Roku to anyone!", "verified": true, "helpfulness": "2/3", "author": "Hapa"}, {"rating": 1.0, "review": "I was very disappointed with this especially because it had a lot of good reviews. It took a long time to set up. I kept getting code error 011. I tried the suggestions that Roku has online. None of them worked. I called customer service several times, and nobody was able to help me. I had to return it.", "verified": true, "helpfulness": "1/4", "author": "Maria Garcia"}, {"rating": 1.0, "review": "Refurbished item was filthy! Had to clean remote with rubbing alcohol to disinfect, esp the gunky build-up around the arrow keypad. Not sure if this is typical of refurbished items which I thought were items that had been returned instead of 'used' but I will definitely never purchase again.", "verified": true, "helpfulness": "1/2", "author": "Jamie"}, {"rating": 4.0, "review": "the thing works perfect with dsl with good wiwi , and cable internet Check out the video https://www.youtube.com/watch?v=KfzMgO3wU_U", "verified": false, "helpfulness": "0/0", "author": "brsrafal"}, {"rating": 5.0, "review": "Works great and has more streaming channels than first imagined. The remote might be the best part of it though.", "verified": true, "helpfulness": "0/0", "author": "ajdoer75"}, {"rating": 1.0, "review": "Unable to connect with my wireless network. Installing the chromecast was way easier. I ll return it", "verified": true, "helpfulness": "1/3", "author": "Ever"}, {"rating": 3.0, "review": "I use a Roku 2 and have given several as gifts. They've worked flawlessly. I gave the Roku Stick as a gift because this model could be plugged right into the TV to hide some cords on their mounted TV. Also, because the remote seems to work really, really well from anywhere in their large living room, something the Roku 2s aren't able to do without turning the Roku box. However, every so often the Roku Stick freezes on the screensaver, or gets stuck on the loading bouncy screen for days until it's manually reset, or the remote loses it's connection to the Roku Stick and also has to be reset. The workarounds do the trick, but it has been frustrating to have to do this every few weeks out of the first three weeks of use... Everything else about it has been fine.", "verified": true, "helpfulness": "1/1", "author": "Lilycameron1"}]