[{"rating": 5.0, "review": "Works as I had hoped.  Excellent!", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 5.0, "review": "I was a little nervous at first that this was a refurbished product. In fact it is actually working just fine I am extremely happy with this product and the seller.", "verified": true, "helpfulness": "0/0", "author": "IG"}, {"rating": 5.0, "review": "Good value, love the item", "verified": true, "helpfulness": "0/0", "author": "Joanne"}, {"rating": 4.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "L. Eng"}, {"rating": 4.0, "review": "Originally, I was going to get My Aple TV until a friend of mine told me the Roku 3500 streaming stick would work for me and the types of movies/tv shows I want to see. He said My Apple TV is \"overkill\" for what I I wanted. Needless to say it was like $42.00 versus the Apple product for $99. The Roku lets me stream Net Flix, Amazon, and much, much, more.", "verified": false, "helpfulness": "0/0", "author": "tiffany"}, {"rating": 5.0, "review": "I just got the roku streaming stick about 3 days ago. And I'm noticing I get a random black screen. Blackscreen can appear when I'm watch qvc app, when I wake up in the morning etc. I would have to take out the electricity in order to get it back going. I chatting online at support, and then called the toll free number but no one know why I'm having this issue. Is anyone else having this problem with the streaming stick ?**** update ****So I figured out the problem with the black screen, it was my outlet that was the issue not the roku.Also I got in upgrade which dives me the ability to mirror my phone. Now I don't have to purchase a google Chromecast.Very happy now with the roku, after the update I can now mirror on my nexus 5 and have a few more channels I'm interested in now too.No hesitation with giving the roku streaming stick 5 stars.", "verified": false, "helpfulness": "0/0", "author": "Jennifer M."}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Kevin J. Burrill"}, {"rating": 5.0, "review": "I also have the 2 & this seams to be just as fast", "verified": true, "helpfulness": "0/0", "author": "Hoff"}, {"rating": 5.0, "review": "Unit works well in providing some television where cable is prohibitive and OTA signals non-existent.  However, the vast majority of the offerings are pay.Fortunately, with Amazon Prime, we're already paying - so, now we have movies where before there were none.", "verified": true, "helpfulness": "0/0", "author": "Ed H"}, {"rating": 5.0, "review": "I am very happy with my Roku. Great item", "verified": true, "helpfulness": "0/0", "author": "Leona"}]