[{"rating": 4.0, "review": "Nearly perfect!  Amazing how this little device works so well to make any TV a smart TV.  One of my favorite features is the search.  You search for a movie and it will tell you all the vendors who offer it and the price of it on each.  I was surprised to find differences and happy to save money choosing a provider I might not have considered.  If I could have one more feature, If it could be programmable to learn the volume buttons on the TV, it would be perfect.  As it is you need one remote to control the Roku stick and another to control the TV volume.", "verified": true, "helpfulness": "0/0", "author": "Joe Pires"}, {"rating": 5.0, "review": "Its amazing no problems so far", "verified": true, "helpfulness": "0/0", "author": "wishundrea mack"}, {"rating": 3.0, "review": "I purchased this for my parents when they moved because they couldn't find their Roku 3. It works, but the one problem they kept having was that the remote kept disconnecting from the Roku Stick. We tried all kinds of things to get it to stay paired, but it wouldn't. They found their Roku 3, and this went back in the box.", "verified": true, "helpfulness": "1/1", "author": "Roberto Taylor"}, {"rating": 2.0, "review": "Was a little disappointed in this Roku product and I have several others that I do like.I believe that the lack of memory causes problems with simple functionality as it locks up consistently", "verified": true, "helpfulness": "0/0", "author": "Reed Tarpley"}, {"rating": 5.0, "review": "We LOVE our ROKU Stick!! My husband is forever on Youtube and now he can watch it on the TV! Easy access to our  Netflix and Prime Videos! and Games for my grandson included! HIGHLY recommend", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I bought it and never used it. But when I decided to use, it did not work. Even if you press the remote, nothing happens. Now when I attempted to return it, they say it is no longer eligible. This is a junk. Please do not put your money into it. I will maintain my view till I get an explanation. This really upsets me.", "verified": true, "helpfulness": "0/0", "author": "Frantz Dornevil"}, {"rating": 4.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "Ronald Gannon"}, {"rating": 5.0, "review": "bought it as a gift, I currently own the roku 3. after playing with the streaming stick, I'm would not buy another roku 3 but would just buy the stick.", "verified": true, "helpfulness": "0/0", "author": "GeekDaddy"}, {"rating": 5.0, "review": "Perfect. Product came extremely fast. I will recommend this item.", "verified": true, "helpfulness": "0/0", "author": "cat"}, {"rating": 3.0, "review": "Definitely have some issues with picking up a decent wifi signal and the remote is \"iffy\" (google Roku Stick Remote and see what I'm talking about).", "verified": true, "helpfulness": "0/0", "author": "FreakingEthan \"-Ethan\""}]