[{"rating": 5.0, "review": "I have two of these now. That's how much I like them. I recently canceled my TV service (via satellite) because it was getting just too darned expensive. With the Roku stick I have access to every show I would have watched via satellite. Some are free, and some are via a service that requires a monthly or annual payment. It's still much cheaper than what I paid for my satellite service. I also have a Chromecast device, which is good, but not as good as the Roku, imho. With the Roku you don't need a phone or tablet to control the device.", "verified": true, "helpfulness": "0/0", "author": "Sue Eckhardt"}, {"rating": 4.0, "review": "I love this stick. It has a few quirks however  I would recommend it to my friends. I bought the stick because I did not want to have another box sitting on my tv stand. Also this stick had access to all the apps that I wanted Amazon vudu Hulu Netflix crackle crunchy roll etc...After using it for about a month the only down side that I have found is that sometimes if it's been on too long 6hrs or so I have to turn it off and back on.My favorite feature is by far that search function for tv shows and movies across all the apps.", "verified": true, "helpfulness": "0/0", "author": "Stephanie \"Sappho\""}, {"rating": 3.0, "review": "Its good, but so many issues came up, the biggest one is that it is SLOW, now I don't know if that is because some interference is happening between the remote and my TV, but it is a big issue if that can happen and you don't know until you plug it in.", "verified": true, "helpfulness": "0/0", "author": "Sean DL"}, {"rating": 4.0, "review": "Great! Love watching movies and having the opportunity to catch low priced movies to rent or own. The apps are amazing and I can add to them at any time!", "verified": true, "helpfulness": "0/0", "author": "Dirtyred61"}, {"rating": 3.0, "review": "I haven't used it but 1x.  I noticed it gets extremely HOT if left plugged in.  I seen an adaptor that allows it to keep charged through the TV, I am going to have to try that.", "verified": true, "helpfulness": "0/0", "author": "Vickie ThatsTMI"}, {"rating": 5.0, "review": "Love my little Roku stick.  Take this thing with us everywhere and it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Jack Barker"}, {"rating": 3.0, "review": "a could not get it to work in my house.", "verified": true, "helpfulness": "0/2", "author": "caring granddaughter"}, {"rating": 1.0, "review": "you have to have cable member ship if you need use this we try to use but all they asking about my cable comthey said its free but not free for didnt have cable com 케이블 멤버쉽이 없음 사용 못함 적어도 한순데 케이블 방송에 가입되어 있어야함", "verified": true, "helpfulness": "1/4", "author": "Jooran kim"}, {"rating": 3.0, "review": "Buyer beware, if you have a defective product and/or any issues, you're going to waste entirely too much time with a support team who speaks little/no English and is not enabled to make any decisions.", "verified": true, "helpfulness": "0/0", "author": "Brian G"}, {"rating": 4.0, "review": "This works fine at our house but I bought it for traveling. Taking it to a hotel is pointless. Since we have a roku at home, I'm trying to decide who gets the Toku stick for Christmas.", "verified": true, "helpfulness": "0/1", "author": "Carmen Haynes"}]