[{"rating": 3.0, "review": "As an Amazon Fire TV user, I wanted to get the Fire Stick for a small tv we are putting in our kitchen (without cable) but it was out of stock.  So I bought this to try.  Overall, it was adequate, but I returned it and got the Amazon Fire TV instead.Pros- Great channel selection (more than Amazon Fire TV, but we decided Amazon has all the channels we would want; we're not HBO Go people so lack of that didn't matter)- Better UI than Amazon Fire TV.  I like that you can select your channel favorites.  And the Amazon Fire TV UI carousel will have to change (I assume Amazon is working on that since a lot of people have complained about that)Cons- Remote isn't as elegant as Fire TV or Apple TV - after using both Fire and Apple remotes, this one feels like it's a decade behind in quality, comfort and ease of use- Sluggish performance.  The Fire TV has beefier specs, and it shows.  The boot time on Roku is slow and program loading is much slower that Fire TV.", "verified": true, "helpfulness": "2/2", "author": "juice_man"}, {"rating": 4.0, "review": "This device is awesome.  It was very simple to set up.  If you want more features like sd slot..you may want to invest in the Roku 3.I was even able to take it to a friends house and stream my channels via wifi.", "verified": true, "helpfulness": "0/0", "author": "Renee"}, {"rating": 2.0, "review": "Really like the roku (I have the roku2 as well) but it doesn't like my game center ice package for nhl.  I thought maybe my roku2 was just being dumb so I bought this and it freezes on it as well.  All the other apps work great.  The other issue is it takes a couple of minutes to wake up when you turn on the tv.  Otherwise it does its job", "verified": true, "helpfulness": "0/0", "author": "Tammy"}, {"rating": 1.0, "review": "First one we got worked for a day then it wouldn't power on. Second one worked well for a few days but the remote has issues connecting and we can't get the app to work. Roku really needs to work out the bugs because right now it's an expensive and ineffective paperweight.", "verified": false, "helpfulness": "0/0", "author": "Ian C"}, {"rating": 4.0, "review": "Fantastic device.  I live in the bush country of Alaska and this unit gives me the opportunity to have an occasional movie.  Since open network cable TV is very limited here and of terrible quality and satellite service is not available this is the only option other than having DVDs mailed to me.  Using a laptop connect card, a wifi adaptor, and this unit I can finally get decent movies streaming to my TV.  Excellent price for what you get and the set up was pretty straight forward and easy.  I like this unit and would recommend it to anyone, especially if you are mobile like I am and travel a good deal.  With this unit you just take it with you and plug it in at your next destination.  Recommended.", "verified": true, "helpfulness": "0/0", "author": "CHILKATEAGLE"}, {"rating": 5.0, "review": "Refurbished Roku arrived in perfect condition - not a scratch on it.  It works great, gets a ton of content.  Well worth it to make your dumb TV into a smart TV.", "verified": true, "helpfulness": "1/1", "author": "mschmidt123"}, {"rating": 3.0, "review": "Could not try it.  dongle is too long = did not fit my 24\" tv. went looking for a swiva; or right angle adapter - they run $20-$27 more.  Will have to return I guess.  I cancelled my firestick order because of the long wait previusly, Very disappointed wanted to avoid all the xmas repeats as i have broadcast tv only. Update the two prices were B&M; radio Shack and best Buy.  Also checked Target and Meijers nearby.  Oniine found that Lowes & home depot both have for $10 each.  Amazon show 2 & 3 packs for under $5 but need to pay shipping  or is an addon", "verified": true, "helpfulness": "0/0", "author": "jb \"jean\""}, {"rating": 5.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "Alicia Washington"}, {"rating": 1.0, "review": "Really doesnt work that often.. mostly stuck on the home screen.. irritating to say the least. Glad i came with free hulu for 3 months because that was about what we got out of it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Like the ability this gives me to watch movies from so many sites", "verified": true, "helpfulness": "1/1", "author": "Joan M Hall"}]