[{"rating": 5.0, "review": "Only wish I purchased  it before this LONG COLD WINTER", "verified": true, "helpfulness": "0/0", "author": "dwc"}, {"rating": 5.0, "review": "This is a great value for money streaming device. Own a couple of Roku 3's and in comparison the stick is a little bit sluggish, but there's not that much in it. It's does what it says it will do and streams perfectly, never seams to crash.. Unlike it's big brother doesn't chew up remote batteries as much, although the remote headphone jack is awesome and would be nice to have on the stickI'm in Australia and they are a bit of a pain to set up here with VPNs and fake Us addresses ( I am current living tax free in Delaware )Use it mainly for Plex .And with the improved Plex Rarflix which finds the trailers for your movies, it just gets betterThere are about 1000 channels of content, although a lot aren't that good I sure you'll find something to interest you. Obviously the main ones are there Netflix , Hulu  ,Amazon plays hardball with geoblocking so no Prime for us unfortunate Aussies.. Not that it interests me at all but there is a lot of Religious content available on the Roku.I've bought about 30 of these Streaming Sticks so yes I am a bit of a fan. I own numberous streaming devices but always am glad to get back to the simplicity of the Roku menu system. The search feature on the Roku is the killer feature, looks though all the apps not just Amazon ( like on the Fire TV).My Elderly Parents are comfortable using the Roku. I previously set them up with a WD live which , seemed like every week I had to reset the thing ( terrible product) and was nothing but trouble.The Wifi Range is excellent. You can power it of you tv's usb port , and have no wires at all to worry about on a wall mounted unit.The only thing I'm not really fond of is a third of the screen reserved for ads, and Mgo located in the side menuI'm about 12 month in on Roku ownership I run them hard, rarely turn them off, not one problem.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Andre"}, {"rating": 4.0, "review": "I bought this as a gift for my brother. Brother reports remote does not pair with device properly but he is happy using his phone to control the stick.", "verified": false, "helpfulness": "0/0", "author": "BD"}, {"rating": 1.0, "review": "I bought this stick, as my first step to cut the cord, but  I never got it working as it should, it continuously dropping the wifi connection, buffering, and sometimes just does not recognize the remote at all. Because I really wanted to make it work, I spent several days testing my internet  speed, checking my router, network configuration and trying all the possible solutions on the web, without any luck, including contacting Roku directly. I'm completely disappointed with this product and I won't recommended it to anybody.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 5.0, "review": "Works great no problems! Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mudal"}, {"rating": 5.0, "review": "Works great  so far!", "verified": true, "helpfulness": "0/0", "author": "C. Anderson \"Anderson\""}, {"rating": 4.0, "review": "Works great but a bit slow.", "verified": true, "helpfulness": "0/0", "author": "mona"}, {"rating": 4.0, "review": "Refurbisherd unit was as specified. Works really well, I have 20 GBs fiber opticnetwork & router is approx. 40' other end of house. Setup & account creation was not too complex. Streaming video is stable & clear. \"Free\" content not the greatest selections, may have to try a paid channel for movies.", "verified": true, "helpfulness": "0/0", "author": "GAGDAD"}, {"rating": 5.0, "review": "Thank you", "verified": true, "helpfulness": "0/0", "author": "Ryan K Herbert"}]