[{"rating": 5.0, "review": "I pre-ordered this and forgot about it till it came in. I loved my old ROKU, but it did not survive a lightening strike. This one seems to do just as good, just a little cheaper. I use it for PLEX and Mythtv. It saves from having seperate pc's at each tv.", "verified": true, "helpfulness": "2/2", "author": "Hicktacular \"Hicktacular\""}, {"rating": 5.0, "review": "I purchased 2 of these Roku 3500R streaming sticks (2014). Trying to do the set up with the remote that came with it is tasking. I downloaded the remote app for my phone and it worked great for adding my email info, etc. It takes a little bit of time to set up all the channels you selected (and you must do it for each Roku device - doesn't save the login information).But this device works great - no issues. (and will still keep my chromecast)", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like the dual-band functionality and ease of use. My only complaint would be space requirements on my HDTV. If you have an HDTV with HDMI ports facing downward, you may need some type of L adapter to insert the device.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Was sceptically about this little stick performing as well as roku 3 but it has done well. This stick hides well behind our Tv in the kitchen and is doing awesome. Have had no issues withbuffering or stalling stream is as good as roku3", "verified": true, "helpfulness": "2/2", "author": "Josh"}, {"rating": 2.0, "review": "This is the only Roku I've ever not liked.  It didn't pick up my wireless signal well, though it's a very strong signal.  I returned it and exchanged for the Roku 3 and I am supremely happy with that model.I think the Streaming Stick might be a good convenience for those who travel regularly though.", "verified": true, "helpfulness": "2/3", "author": "Equestriana"}, {"rating": 3.0, "review": "This is excellent on paper but after couple of weeks use the response is sluggish and the other big issue is that if you disconnect the power and reconnect it loses your settings.", "verified": true, "helpfulness": "1/1", "author": "Faruq W. Gilani \"Faruq Gilani\""}, {"rating": 5.0, "review": "I have bought Chromecast last year; but since they have not added much available channels to their lineup (especially the Amazon Video) I have to get the ROKU stick. I am very happy with the content although I think the Chromecast stick seems to give better performance (loading Netflix on the ROKU stick seems to be much slower than loading Netflix on the Chromecast).", "verified": true, "helpfulness": "3/3", "author": "Will S"}, {"rating": 5.0, "review": "we have two Roku 3's, one on family room TV and the other in bedroom, because we decided to do away with cable TV and go all internet.  My wife and I love the freedom of watching everything on demand and hate the high cable bills.  Needed another Roku for the kids TV in the loft.  They have been using a Blueray player that's internet connected but its clunky and slow.  Saw the Roku Streaming stick and the problem is solved.I would say it has the computing power of about a Roku 2, the price is right and it vanishes behind TV so that my 16 month old son doesn't have Roku box to tamper with like he does with everything else.  A great starter for anyone who is interested in either going all internet for entertainment or looking to add to there experience but if you are really looking to ditch those high cable bills get the Roku 3 for a much more pleasant experience.", "verified": true, "helpfulness": "2/2", "author": "E. Lee \"Vince Black\""}, {"rating": 5.0, "review": "I give this 5 stars with minor reservations. The set up is simple and essentially takes care of itself. The remote is nice (something the Google Chromecast doesn't have) but searching programs one button at a time can be fairly annoying. When you are logging into services like Hulu or HBOGo you have to have an internet connected device available for the first login. After that, the info is stored on the Roku device. When turning on the TV to use the Roku subsequently, it is very slow to load, but once loaded works fairly quickly. You have access to all the channels the larger Roku devices have access to. The differences between this and Chromecast are that Chromecast will cast anything on line when you are using the Google Chrome browser (but not Amazon prime videos) and you need to be connected through a computer to access the WIFI. Roku is a stand alone device. All in all, I am very happy with the Roku stick.", "verified": true, "helpfulness": "1/1", "author": "geas"}, {"rating": 3.0, "review": "The product itself is very slick and at $50 is good enough that I will hold onto it despite the fact that the #1 reason I purchased it - to stream HBO Go to our new Vizio - is not supported. The Vizio already had Amazon and Netflix built-in, but what I really wanted was to add HBO Go. I realize this is likely a Comcast issue, but Roku needs to get to the table with Comcast and HBO Go and get a deal done. The product is lacking without this feature.The improvement in Amazon and Netflix interface over the built in apps from Vizio is impressive. The TV guys really need to hang up trying to do this on their own. The only thing worse than the Vizio apps are the ones that Sony tries to do on their Blu-ray players.I will be happy to upgrade my review if they ever decide to get the Comcast / HBO Go issue resolved, but for me for now this is deserving of the 3 star review.", "verified": true, "helpfulness": "0/3", "author": "James Sherhart"}]