[{"rating": 5.0, "review": "I purchased this stick from my brother and his wife.  They love their Roku.  I have an Amazon Fire.  I like it, but I don't like the search feature on it.  It only searches Amazon for a movie selection whereas I understand the Roku's search function works across all the applications within its library.  Don't take my word for it.  I have never used the Roku.  But, if it works as advertised, Roku is what to buy.", "verified": true, "helpfulness": "0/0", "author": "Syl \"SDW\""}, {"rating": 5.0, "review": "Got for my sister and she lives it!", "verified": true, "helpfulness": "0/0", "author": "Warren Chapman"}, {"rating": 1.0, "review": "I don't even know what this thing does, but my husband said to order it for Plex.  Anyway, what a racket this s*** is.  When I went to the internet to put in the code it told me to, it prompted me to create an account, which is fine.  What is NOT fine is having to put in my credit card information when I'm not buying anything through this stupid stick.", "verified": true, "helpfulness": "0/4", "author": "Betty Ball"}, {"rating": 1.0, "review": "This device was defective", "verified": true, "helpfulness": "0/2", "author": "Melissa joned"}, {"rating": 5.0, "review": "Works as advertised, no issues with the TWC app and very limited buffering", "verified": true, "helpfulness": "0/0", "author": "victor bond"}, {"rating": 1.0, "review": "I bought this after Christmas 2014 and it is malfunctioning already. The problem is the latency of the connection and now there is no sound. I also have a Chromecast and Apple TV and they work beautifully. Amazon says I'm not eligible to return this item. If you're looking for something to cast or stream, Apple TV is the best by far. I'm so disappointed with Roku.", "verified": true, "helpfulness": "0/1", "author": "darryd"}, {"rating": 5.0, "review": "I previously had a Chromecast but the Roku blows that away. I can use the Roku without the aid of a computer, tablet or phone (Chromecast needs something to cast to it, but Roku does not). At the same time, if I choose to cast to the Roku device I can. Meaning I get the best of both worlds.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have the bookoo roku, too, and this one works as well as the big one but without the remote earphones, etc. well worth the money. Refurb works great. Kicks apple tv's butt! (Got one of them, too.)", "verified": true, "helpfulness": "0/0", "author": "Old Tom \"Tom\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Cynthia St-Pierre"}, {"rating": 3.0, "review": "First - this takes forever to turn on. It is powered by your TV and when you turn your TV off it turns off too.Second - this is far slower than other Rokus. If you're going to use it often, I would get a bigger Roku and mount it to the back of your TV.Third - the remote is a NIGHTMARE. The buttons on the bottom that are supposed \"easy access\" for Netflix, etc., are easily hit - I set the remote down and it switches apps. I hate it.I love Rokus, but this one is awful.", "verified": true, "helpfulness": "0/0", "author": "C. Engen"}]