[{"rating": 5.0, "review": "I've had quite a few Roku's, from the Roku 1 to the Roku 3 and most in-between.  I never really used some of the more advanced features of the roku 3 (gaming, audio port on the remote) so I will be sticking with this one going forward.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 4.0, "review": "So have the roku for the tv (I think the first or second generation). I think they both work as equally well. However, I was slightly disappointed to see that I had to plug in the stick. Makes my TV area look a bit messy now. :( But for the price I will try to make do and figure a way to hid it.", "verified": false, "helpfulness": "0/0", "author": "A. Durando \"adurando\""}, {"rating": 2.0, "review": "Not DLNA support even if advise on their site. Spend long time to try to figure out how to do it and never find how; then mention I need a software on the PC but why, Windows Media Player works with any other devise so why not this one.That was the only raison why I bought it and sound like it will remain in my drawer until they fix this issue.", "verified": true, "helpfulness": "0/1", "author": "Benoit Morneau"}, {"rating": 5.0, "review": "Had it set up in minutes. There's a lot of great content available. I love that I can stream from my phone or laptop through the Roku. I'm saying good bye to my $220 per month cable bill!", "verified": true, "helpfulness": "0/0", "author": "JJWVU"}, {"rating": 5.0, "review": "Easy setup, and it's working like a charm.  No issues with speed, etc. as reported by some reviewers.  It's actually faster than the older roku it's replacing.", "verified": true, "helpfulness": "0/0", "author": "Louise Bridges Kelley"}, {"rating": 5.0, "review": "This is the second one purchased, the first one did not work at all and it was shipped back to amazon. It's remote did not work with the stick. This one worked perfectly! Don't know what was wrong with the first one, but amazon made it right and quickly replaced it with another one.", "verified": true, "helpfulness": "0/0", "author": "Debbie Fowler"}, {"rating": 4.0, "review": "This was bought for my mom and it was a piece of cake to install and get up and running. Love it!", "verified": true, "helpfulness": "0/0", "author": "soleful \"cher hunter\""}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Paulo Rodrigues"}, {"rating": 4.0, "review": "This works same way as the other Roku models do. I would give it a 5 star, but not until Roku extends their warranty to a standard 1 year.", "verified": true, "helpfulness": "0/0", "author": "A iki Z"}, {"rating": 3.0, "review": "If your TV is mounted and there is no side panel HDMI ports, beware.You may need a 90 degree male/female HDMI adapter or a female/female adapter to attach your new Roku to an HDMI cable.Also,the Roku power plug attached to the rear end of the Roku which then adds length to the whole device.", "verified": true, "helpfulness": "0/1", "author": "Annie Gunn \"Annie Gunn\""}]