[{"rating": 5.0, "review": "good delivery works great", "verified": false, "helpfulness": "0/0", "author": "jim harris"}, {"rating": 4.0, "review": "This is my first streaming media player. I chose the streaming stick because I did not need the Roku 3 extras like the ability to play games. For half the price it seemed like a great deal! The streaming stick works really well most of the time.Pros- The streaming stick provides a great way to cut the cord without the gaming extras the Roku 3 offers.- Best priced streaming option.Cons- Some of the apps are a little glitchy. I have experienced issues with Netflix and Hulu apps. Sometimes they do not respond to the remote (but will always respond the the phone app remote). After contacting Roku customer support I was told to delete and re-add each app to resolve the problem. I was a little sad to be having any issues within 2 weeks of purchase.Overall I am extremely happy with my purchase and even happier I decided to cut the cord.", "verified": true, "helpfulness": "0/0", "author": "Palmetto"}, {"rating": 5.0, "review": "Originally, I was going to get My Aple TV until a friend of mine told me the Roku 3500 streaming stick would work for me and the types of movies/tv shows I want to see. He said My Apple TV is \"overkill\" for what I I wanted. Needless to say it was like $42.00 versus the Apple product for $99. The Roku lets me stream Net Flix, Amazon, and much, much, more.", "verified": true, "helpfulness": "0/0", "author": "Jenae arbuckle"}, {"rating": 1.0, "review": "Total Garbage... wasn't a good product to begin with, and it died 35 days after purchase and Roku said \"Too bad.\"  Will never buy anything with the ROKU name on it.", "verified": false, "helpfulness": "0/0", "author": "David Cooper"}, {"rating": 5.0, "review": "Amazingly compact and full of great content. I purchased this for my son's room so I can have control over what he watches and it's super simple to setup and use. It's very similar to the Apple TV only features a lot more channels and plugs directly into the HDMI port.I also have Google Chromecast and this makes that look like a toy. The Roku has built-in software and doesn't require a computer or smart phone/tablet to stream to. All you need is a WiFi connection and you're off and running.", "verified": true, "helpfulness": "0/0", "author": "Tim B."}, {"rating": 5.0, "review": "save the whales", "verified": false, "helpfulness": "0/0", "author": "Jay Carl Stewart"}, {"rating": 5.0, "review": "Great Item, Easy set up. Streams programs without any problems.", "verified": true, "helpfulness": "0/0", "author": "Ozzymac"}, {"rating": 1.0, "review": "This device worked for about 2 hours before having problems with connectivity. I had to ask Roku for a \"HDMI extender.\" Apparently this is a known issue that they have failed to address and only when a customer has the problem and contacts them do they offer this extender as a solution. Amazon should stop offering their products until they fix this in newer models or just send the extender with the initial sale.", "verified": true, "helpfulness": "1/1", "author": "Carol D. Edmondson"}, {"rating": 4.0, "review": "Our second Roku. The Roku 2xs we have has been wonderful. We bought a WIFI signal extender, an Amped Rec10 which works great (our internet signal is via ATT Uverse and they get zero stars!), has great range (6500 feet!, plugs into a regular outlet and tech assistance is exceptional) so we could have Roku on the second floor, opposite end of house as to first floor modem location. Be warned that some people experience Roku stick connection issues during set up but Roku actually has a page to allow you to request that they send you a free HDMI extender, about 4 inches long, that solved the problem. Apparently, the placement of some HDMI ports so close to other TV ports may cause interference. For some reason, plugging the Roku stick into the short extender resolved our issue and connections are fine. I would have given 5 stars if Roku placed this information in the box instead of my having to sleuth it out on the internet and even their chat tech didn't mention it, told me to edit IP addresses which didn't work at all. In attempting to figure out the source of the problem, the Amped techs went out of their way to call and email to assist. They will get 5 stars on my review!", "verified": false, "helpfulness": "2/2", "author": "Miarosa422"}, {"rating": 4.0, "review": "The wireless feature is great. I put this one on the kitchen TV and no extra network wires needed. I use primarily for Netflix and that works great. The wireless RF remote is excellent compared to IR remotes that suck. Easy to set up, got the Roku going in about 15 minutes.", "verified": true, "helpfulness": "0/0", "author": "J. Yamashita"}]