[{"rating": 5.0, "review": "This is our 3rd Roku device and we love it! My husband had some trouble getting it to hook up to our wifi (operator error) He called the number on the screen for help and some lady on the other line tried to tell him he needed to pay an activation fee SCAM so just be careful and know there are no activation fees!", "verified": true, "helpfulness": "1/1", "author": "Melissa"}, {"rating": 2.0, "review": "Not easy to navigate, one day just stopped working with our Uverse. Roku says its Uverse's fault and Uverse says its Roku's fault. So we are now stuck with no Roku.", "verified": true, "helpfulness": "0/0", "author": "Leecardosa"}, {"rating": 5.0, "review": "I bought this as a gift. I have an older Roku 3 and expected the stick to not be as good. I didn't see any difference. It seems as responsive and full featured as my Roku 3. I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Pam"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Darreld Daugherty"}, {"rating": 5.0, "review": "It is great !!!", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Works great and can't even be seen on the TV Love it :) This is my second one. I have a box and a stick. Both are excellent!", "verified": true, "helpfulness": "0/0", "author": "catchryder"}, {"rating": 3.0, "review": "Great Roku services without using counter space. Stick barely fit in TV, but works fine.", "verified": true, "helpfulness": "0/0", "author": "A. Frost"}, {"rating": 5.0, "review": "Just awesome.  We recently dropped cable and this has been a nice item to have to access multiple TV shows and movies.", "verified": true, "helpfulness": "0/0", "author": "AMart"}, {"rating": 5.0, "review": "bought to replace Blue Ray DVD, wich gave me access to Pandora, UTube, Netflix,etc.This has much more to access than blue ray did.relatively easy set up, works well. Price for rebuilt was factor vs. new Blue Ray. (i still can play DVD's, etc)my only issue is i have not figued out how to run Ruku through my surround sound, my issue, not Ruku!", "verified": true, "helpfulness": "0/0", "author": "Larry-C \"MiddleRoad\""}, {"rating": 3.0, "review": "Okay... had some issues....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]