[{"rating": 3.0, "review": "Poor", "verified": true, "helpfulness": "0/1", "author": "Brian Carbone"}, {"rating": 1.0, "review": "Had to send it back. It looked good, but remote didn't work.", "verified": true, "helpfulness": "0/0", "author": "Phenique29"}, {"rating": 1.0, "review": "I really like roku. It offers a lot of selections in programming.  However,  once it warms up, and has been playing for a while, it won't go to Netflix or Showtime anytime. It's very annoying.", "verified": true, "helpfulness": "0/0", "author": "Sandra Ivy"}, {"rating": 4.0, "review": "The only problem I have is when it's running for longer than 3 hours, the stick gets really hot & picture is blurry.", "verified": true, "helpfulness": "0/0", "author": "Tiffany McCullough"}, {"rating": 3.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "scott healey"}, {"rating": 5.0, "review": "We previously had a Chromecast in the Living Room. Our biggest issue with that is the phone would disconnect and we'd have to restart our phone to use it as a remote again. The Roku works much better for our needs, and for the times when we lose the remote in the couch it's nice to be able to use the phone as a remote as well.", "verified": true, "helpfulness": "1/1", "author": "Karole"}, {"rating": 5.0, "review": "Love it! Product in great condition and arrived quickly. Install was simple", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 3.0, "review": "Absolutely love the Roku.  I've been using different Rokus over the past several years.My main complain about the Streaming Stick is that the remote control is terrible.  It works about 50% of the time.  This is easiest way I've fixed this is taking out and putting back in the battery.  Not ideal, but it works.If you power this through USB to your TV, every time you turn your TV off it powers down the Roku.  Just know that it take about a minute to reboot the Roku and then you're good to go.  A minor annoyance, but not too bad.", "verified": true, "helpfulness": "0/0", "author": "emrw44"}, {"rating": 3.0, "review": "It does not work well overseas except for Netflix. For someone who travels as often as I do that really sucks....", "verified": true, "helpfulness": "0/1", "author": "Kahina Kunle"}, {"rating": 3.0, "review": "Setup was a breeze. Although many apps available, nothing ground-breaking available without additional charges. Rcast is a letdown with 10minute limit on video streaming", "verified": true, "helpfulness": "0/0", "author": "Kang Yong Chiang"}]