[{"rating": 4.0, "review": "Like It.", "verified": false, "helpfulness": "0/0", "author": "A. Nonomous"}, {"rating": 5.0, "review": "Great product especially for the WWE Network!!! 5 stars", "verified": true, "helpfulness": "0/0", "author": "d-ray"}, {"rating": 4.0, "review": "I got this primarily so I could watch Amazon Prime Instant Video in my bedroom and this works great. A lot of the other channels are subscription only or are channels I'll likely never watch. Sure you can \"install\" a lot of the other channels for free, but try to watch something without a credit card, it ain't happening! This device has locked up on me a few times when turning the TV off for 24 hours, leaving this device at, say, the screen showing all episodes for whatever show I was watching, then turning it back on to find this device frozen. Sometimes just hitting the Home button on the remote will take you to the home screen but once I had to unplug the power from this to get it to respond, this was a PITA on a 60\" DLP TV that has it's ports in the center of the TV and the TV was pushed against the wall on top of a dresser. Luckily this only has happened once so far. All in all this device is VERY responsive though there has been several times that it \"lost\" my Wi-Fi signal in the middle of the show. I don't think it's my brand new $200 router. It always reconnects, but sometimes I have to go to the home screen and go through the network setup again then go back to my show. Pretty annoying. I'm still pretty happy with it. Before this I bought a Chromecast and returned it the next day, but that'another story. ;o)", "verified": true, "helpfulness": "0/1", "author": "Dennis"}, {"rating": 4.0, "review": "originally purchased 3 Streaming Sticks, first one set up easy and worked immediately, 2 others would not recognize remotessent both back for refunds, but the one that is working is great.dont have an answer as to why??", "verified": true, "helpfulness": "0/0", "author": "Robert S. Perret"}, {"rating": 5.0, "review": "When I purchased my Samsung LCD over a year ago, I kicked myself for not purchasing a smart model. Some deemed these as unecessary but I prefer to keep my devices segmented for their intended usage. Game consoles, in my opinion, are meant solely for gaming. The same applies to blu-ray players. The roku media stick definitely amends this issue.Netflix, Hulu and Blockbluster are all included. Additional apps, such as Plex, can be purchased from the Roku store.  This device is nimble and small.  It can either be powered via an a/c adapter or a free usb on your tv or through your tv provider's stb. I only encountered two cons with this device:1. Heat: After about 20 or so minutes of usage, this device becomes rather hot. This is to be expected as this unit is compact and therefore has no integrated cooling mechanisms.2. Slow Start-Up: The initial start-up of this Roku takes approximately 30-45 seconds. This occurs whenever you're starting it for usage. The Roku splash screen is visible but no other warnings about loading are present.If you were like me and decided against a smart tv, this device will bridge that gap.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Lee"}, {"rating": 4.0, "review": "arrived timely-great service-ordered 4-one had defect-Roku easy to work with-Square Trade easy to work with. Appreciate good customer service.", "verified": true, "helpfulness": "0/0", "author": "Jlwcraftlover"}, {"rating": 1.0, "review": "Beware!!!!!!!! Product did not work the first TV, the second nor a third. Trying it today again on anew TV; error code 014 again, can't connect to wireless network. The other Roku boxes work quite well. Would not recommend. Would not even try to call support; time is money.", "verified": true, "helpfulness": "0/2", "author": "Patric G."}, {"rating": 5.0, "review": "I like this..great not to have $200 cable bill..need wireless internet tho..1 thing they need to have more free selection. The idea is to save money. Not purchase movies", "verified": true, "helpfulness": "0/2", "author": "orb"}, {"rating": 5.0, "review": "Easy set up, clear picture.", "verified": true, "helpfulness": "0/1", "author": "Granny"}, {"rating": 1.0, "review": "Remote works about 5% of the time...basically reduced to control by phone only.  Periodically freezes up if plugged into external poer and makes you sign in to services frequently if allowed to use TV power so that it restarts when TV powers on.", "verified": true, "helpfulness": "1/2", "author": "skitchens"}]