[{"rating": 1.0, "review": "I purchased this after purchasing the chromecast stick.  I returned it because I like the control the chromecast allows better.  If you have an android based device I feel it would be more beneficial to purchase the chromecast because not only are you able to watch Netflix, Hulu, Xfinity, HBOgo, etc. on it, you can also use your device to cast movies, music, pictures, and much more that's stored on the device.  Chromecast also has a list of games and apps that are available from the app store that you are able to play on your television via Chromecast individually or with a group.  It offers fun and flexibility!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Takes a little longer to boot than my stand alone device but it works well.", "verified": true, "helpfulness": "0/0", "author": "eklb192"}, {"rating": 5.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "c"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Hiya"}, {"rating": 5.0, "review": "Unbeatable!", "verified": true, "helpfulness": "0/0", "author": "Rex"}, {"rating": 4.0, "review": "Streams really well, although my wireless router is about 2 feet at most from it so that helps i'm sure.  Love the remote and that you don't have to point it. It responds well.  Only downside is that it seems to go offline every once in a while when I turn off the TV and then come back, say the next day, the screen is just black so I unplug the Roku from the AC power then it's back up.  Other than that, it works just fine.  Haven't really explored the free channels but that's why I bought it mainly.  Just using Hulu Plus and Amazon Prime time.", "verified": true, "helpfulness": "0/0", "author": "Arguelles \"BrainShower\""}, {"rating": 5.0, "review": "I have two boxes and the stick.. all work great!", "verified": true, "helpfulness": "0/0", "author": "Barry H."}, {"rating": 5.0, "review": "Perfect. Just the right size. Easy set up. Love it.", "verified": true, "helpfulness": "0/0", "author": "Sonja Wall"}, {"rating": 3.0, "review": "Badly needs some more processing power; very slow to boot, add or subtract channels, etc.Gets *very* (too) warm when in use; don't leave it plugged in.It works, but pun intended, is far from ready for prime time for cable cutters without some patience.Last, despite fairly speedy internet, it won't stream in HD from hulu + or netflix or any others.Additionally Last: loses wifi connectivity regularly though not really often; major bother.", "verified": false, "helpfulness": "0/0", "author": "JAFO"}, {"rating": 5.0, "review": "Got it for Christmas and I love it. I am not new to roku since I also have an earlier model. But the size and convenience of this one makes it a slam dunk.", "verified": true, "helpfulness": "0/0", "author": "K-Man"}]