[{"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Steena"}, {"rating": 5.0, "review": "Great product from a great Vendor. Quick Shipment was also Nice.", "verified": true, "helpfulness": "0/0", "author": "Keith Jones \"Keith Jones\""}, {"rating": 3.0, "review": "Wouldn't work with my tv, etc.  Our internet mbs is less than 4 and not enough to download anything.", "verified": true, "helpfulness": "1/1", "author": "goldiesebring"}, {"rating": 2.0, "review": "I bought it to watch Netflix outside the US, in a trip to Chile. Problems started when I created my Roku account outside US: no Netflix, No Amazon Prime, No almost any channel.After many forums in internet, I found a way to get Netflix and other channels using a US IP, buty only Netflix works in SouthAmerica.In fact, I bought it for Netflix, but I can't understand why you can't get the app in an easy way if the service is available in other countries: I have a chilean Netflix account and now works perfect, but it was too hard to make it works, so I disagree with the 'Roku dream' promised.And, by the way, you can't get the app for Apple/Android outside US either.", "verified": true, "helpfulness": "0/0", "author": "Sergio Valdes Hernandez \"Normal guy\""}, {"rating": 4.0, "review": "When Netflix is on, the screensaver doesn't work right. It just goes to Netflix or Netflix kids menu (lots of red). If you have LCD/LED you're good, but old fashioned tvs or plasma beware!Otherwise it's great!  Remote works even though I can't see it behind TV, which makes it perfect fit in my house.", "verified": true, "helpfulness": "0/0", "author": "AustenYanksFan \"IT Gal\""}, {"rating": 5.0, "review": "love it!!", "verified": true, "helpfulness": "0/0", "author": "donna"}, {"rating": 3.0, "review": "Samsung doesn't seem to recognize it.  Still need to try it on my Sony.  Looking forward to it working.", "verified": true, "helpfulness": "0/0", "author": "Nino Balducci \"Nino\""}, {"rating": 1.0, "review": "I am obliged to write a negative review on my dead Roku streaming stick. It was always slow to react, and finally froze and died after about 3 months. Neither Amazon nor Roku was able to replace or refund the item. I am disappointed that it froze and was no longer useful. But, I went ahead and bought a Roku 2, and it searches much faster than the Stick ever did. The Roku 2 is pretty slow to come up to speed, and I have to re-power it every time is has been \"off\". Not what I expected.", "verified": true, "helpfulness": "2/2", "author": "William H."}, {"rating": 4.0, "review": "I already have the Roku 3 and loved it so much I wanted one for my other room. Got the stick and It's all I really needed. I am very happy with it. Would have given it 5 stars, but haven't had it long enough to know for sure.", "verified": true, "helpfulness": "0/0", "author": "Letitia S."}]