[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Donald Edson Kincaid"}, {"rating": 2.0, "review": "I liked it very much, right up to the point the HDMI connector broke when it got slightly bumped. It is apparently very fragile on the end. When I checked with ROKU, they basically said too bad, so sad. Now I am out $50. I am going to attempt to return to the store I bought it from. If ROKU or the store I bought it from gives me credit or an exchange, I would raise my rating, but having used it one time and now stuck with a broken stick, I am not real impressed.", "verified": false, "helpfulness": "1/2", "author": "Dawn Ahonen"}, {"rating": 5.0, "review": "Love it. Do yourself a favor and get one.", "verified": true, "helpfulness": "0/0", "author": "Douglas Simpson"}, {"rating": 5.0, "review": "Brought it for my sister she loves it don't get suckered in to buying a smart tv this makes any tv with hdmi a smart tv you just have to have wifi the stick is small and its faster than the older roku's its a great buy great value hundreds of apps way more than apple tv, fire tv, and chromecast", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "very easy to move from one TV to another", "verified": true, "helpfulness": "0/0", "author": "bonnie trickett"}, {"rating": 2.0, "review": "I love my Rokus, but this one has HORRIBLE Wifi reception even with $300+ routers. If you're on a single story home or apartment, it'll be fine, but this thing doesn't work well in a house and is slow (CPU, not just network). Think about getting a Roku 2 for better reception or a Roku 3 for the best overall experience (much more snappy).This wouldn't work acceptably with the Netgear R8000 or Ubiquiti AP-AC.", "verified": true, "helpfulness": "0/0", "author": "Ian Jeffries"}, {"rating": 5.0, "review": "I love everything about my Roku Stick. They even listen to people complaints and make it better. Do anyone realize how fast Netflix loads now? About 2-3 seconds compared to the 1-2 minutes in the past. Check out this amazing site for Roku channels A-Z: http://mkvxstream.blogspot.com/2014/06/roku-channels-guide.html", "verified": true, "helpfulness": "0/0", "author": "Awesome792"}, {"rating": 3.0, "review": "I own 3 of these and 1 Roku 3. All of them work well when they are working. I believe that they all have heat issues, the streaming stick more so than the 3. I am constantly resetting the sticks because they will lock up, the screen gets fuzzy. They are exceptionally hot when I reset them. They do come back ok. The streaming stick is much slower in all aspects compared to the 3, which I also have to reset but not as often. I really believe these stick units get too hot and will eventually die. Tech support was not very helpful and after talking for 30 minutes going around in circles they agreed to replace one that I was having the most issues with, but I had to pay shipping. Didn't do it. If it were me I would avoid the stick and get the 3 and hope it doesn't overheat. By the way there are many post on the internet about the overheating and how to install heat sinks, which seems to fix any issues with the 3.", "verified": true, "helpfulness": "1/1", "author": "Mark C. Francis \"Georgiearie\""}, {"rating": 5.0, "review": "Works much better with n-class router than it did with g-class.  If it's slow it's probably your router, based on my experience.  I'm on the FIOS system and no issues with blocked or delayed download, tiling and the like, once we installed the n-class router.", "verified": true, "helpfulness": "0/0", "author": "Cato The Eldest \"CatotheEldest\""}, {"rating": 2.0, "review": "Requires really strong and really close wifi. Didn't work in hotel next to router and in back of the house. Functionality was nice but must have superman's level of Wifi to get a good experience. I returned it and went with Roku 3 refurbished and am very satisfied and impressed.", "verified": false, "helpfulness": "1/1", "author": "Joeyaz"}]