[{"rating": 5.0, "review": "good works fine", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Velez"}, {"rating": 4.0, "review": "I had as  have other people that I knowhad a terrible time connecting Hulu and internet and now that all is well with Hulu and I ,it seems that My kindle is having a time connecting to internet . I realize that an old timer such as myself am not up on these electrionic device ,it is bothersome depending on others to assist me .", "verified": true, "helpfulness": "0/0", "author": "Ronald E. Salazar"}, {"rating": 1.0, "review": "Don't waste your time with a Roku Stick, just grab a Fire Stick.I had problems with this stick just outside the 30 day exchange period, and Roku support was a complete joke. I wasted an entire hour of my lunch break trying to convince a customer service agent that the unit is clearly defective. Every morning, it is completely locked up, unresponsive. Customer service first tried getting rid of me by just offering a free HDMI extender and blamed the Wifi Signal. Then after I told him why it couldn't be wifi signal (I had a signal analytics app and had it in the same room at one point, and of course, my Kindle Fire Stick worked in the same location flawlessly), the agent then proceeded to try and convince me the issue was the batteries on the remote before finally hanging up on me at the 1 hour mark.The interface of the Roku stick sucks, the device is slow and laggy compared to the Fire Stick, the apps have a clunky and outdated look, the only real reason you'd own it is if you were really committed to having VUDU. It would have been maybe 3 stars had the company actually stood by their product.", "verified": true, "helpfulness": "1/1", "author": "Derik"}, {"rating": 1.0, "review": "The refurbished unit I purchased lasted exactly 33 days. This means, after the 30 day warranty expired, I now have a paperweight since it is passed the return/excange perdiod.I did purchase with the unit a Canopy protection plan, which I plan on using and hopefully will work.", "verified": true, "helpfulness": "0/0", "author": "Ari W"}, {"rating": 5.0, "review": "It was easy to install and is easy to use!  I'm not a techy type person, but this is to intuitive that I get it....easily!", "verified": true, "helpfulness": "0/0", "author": "Bunnydeb \"Deborah Ann Rogers\""}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Gladys Puerta"}, {"rating": 5.0, "review": "NO problems watching movies anymore!! No more rebuffering! This is awesome!", "verified": true, "helpfulness": "0/0", "author": "TheShopper"}, {"rating": 1.0, "review": "Had multiple freezes and then the final freeze that even attempts at resetting the device didn't resolve. Returned to amazon.", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 5.0, "review": "I love this Roku. Bought it to plug into the HDMI on my Xbox one so I could snap ESPN and Netflix and it works wonderfully.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "Exactly what I wanted and was what I expected.  My was refurbished....but looked totally new, down to the instructions and the box.", "verified": true, "helpfulness": "0/0", "author": "James Moses"}]