[{"rating": 5.0, "review": "This is my third Roku. I've even purchased 2 for gifts. If you want to get away from cable and watch what you want, I recommend getting the Roku. It's offers channels that allows you to stream what you want. Some have subscriptions and some are free.", "verified": true, "helpfulness": "0/0", "author": "Lilbkay"}, {"rating": 5.0, "review": "I'd been putting off buying one of these for a while, and I wish I had bought one sooner.  We typically watch Netflix, Amazon Instant Video, and stored media from my media server through the Xbox or PS3 in the living room, but in the bedroom, I didn't want to have the foot-print (or expense) of another Xbox... sooo, Roku to the rescue.  Hundreds of channels to chose from, and NOW, Roku has a free app which connects to my media server via Tversity (free also).  Now, I can watch anything, anytime :)Some people complain about the remote, but I like it just fine.  This unit was a factory reconditioned unit (purchased on gold-box deal for 1/2 retail), and I could tell no difference between this and a factory 1st, and it arrived in retail packaging, too.", "verified": true, "helpfulness": "0/0", "author": "Sam \"Eagle 85\""}, {"rating": 2.0, "review": "The device itself works fine, a bit laggy compared to our Roku 3 device, but not too bad. The main complaint is the remote is absolute junk. Every single day it freezes and no longer works. We have to open the battery case and press the little button under there to get it to sync again. The Android app works ok, but the remote issue is really annoying and has affected other users.As well as losing sync the remote also has a bunch of pre-defined crappy buttons for apps only two of which anyone will actually use.", "verified": true, "helpfulness": "1/2", "author": "CJS"}, {"rating": 3.0, "review": "The Roku Streaming Stick works just fine,But I'm having trouble with the remote that came with the Stick. I did a session on line with a service rep.and he walked me through an update on the remote. I'm still having trouble with the remote. It will like freeze and nothing will work. I changed batteries but that didn't help. When it freezes up I can take the batteries out and reinstall them and it starts operating properly until the next time it stops. It acts like that one or both of the batteries or not making good contact after I put the battery cover in place. I think I need a new remote but I can't seem to find a telephone number to speak with a Roku real person about my problem. I would have gave it a higher rating if the remote was working properly", "verified": true, "helpfulness": "0/0", "author": "Clarence Dover"}, {"rating": 5.0, "review": "This is my 3rd ROKU because I bought one for a friend who needs access to Hulu. I love, love, love my Roku and still have the original stick that has never given me any problems.", "verified": true, "helpfulness": "0/0", "author": "Ephrata Mom"}, {"rating": 4.0, "review": "Very easy to set up and love that you don't have to have another box on your entertainment center.", "verified": true, "helpfulness": "0/0", "author": "E. Hallberg"}, {"rating": 4.0, "review": "Never used one of these devices until now.  Works great! Easy set up & easy to use.", "verified": true, "helpfulness": "0/0", "author": "imanurse73"}, {"rating": 3.0, "review": "Works as advertised: it streams a ton of channels, thousands of shows, all the entertainment you could potentially want, yadda-yadda-yadda. In other words -- for all intents and purposes it works the same as any streaming device that has been on the market for the past several years: tablets, smart phones, smart TVs, game consoles, Blu-Ray players, etc. I don't find any advantages to the interface, or features that I would say are better than any other such device I've seen.On the other hand, my experience with the included remote has been less than acceptable. It stopped working after only 2 months of (minimal) use. I called customer support and with one of their techs, spent about an hour trying to hash out possible solutions via button-pressing combinations. Nothing worked and I was promised a free replacement remote in the mail, which as of several weeks later, still hasn't arrived. In the meantime they send me occasional \"thank you\" e-mails with a list of \"other\" similar solutions, that WERE actually tried during the support call. I can access the Roku stick via their app on my smart phone, but why should I have to keep my phone on me and waste battery life to use it as a remote?", "verified": false, "helpfulness": "1/1", "author": "Guy Greasyfinger"}, {"rating": 5.0, "review": "Purchased this for a third bedroom that does not have cable service. Works great, and allows kids to watch television.", "verified": true, "helpfulness": "0/0", "author": "John Novicki"}, {"rating": 5.0, "review": "The streaming stick is excellent for use with any TV and is especially perfect when pairing with wall-mounted sets.", "verified": true, "helpfulness": "0/0", "author": "KMaughan"}]