[{"rating": 4.0, "review": "Good so far!", "verified": true, "helpfulness": "0/0", "author": "Matthew G. Walker"}, {"rating": 5.0, "review": "ast delivery..product works fine", "verified": true, "helpfulness": "0/0", "author": "DAN"}, {"rating": 5.0, "review": "Tried the Amazon product and could not get it to work.  No help from Amazon.  Returned it and purchased the Roku.  Simple to install. Worked immediately.  Easy to use. I wouldn't be without it.  Now on every one of my TVs.", "verified": true, "helpfulness": "0/0", "author": "Alan H. Silverman"}, {"rating": 4.0, "review": "Works great for YouTube and NetFlix, which is exactly what I wanted.  Remote needed to be reset often at first, but seems OK now.", "verified": true, "helpfulness": "0/0", "author": "Mark W. steinbruch"}, {"rating": 5.0, "review": "Worked in every way anticipated.", "verified": false, "helpfulness": "0/0", "author": "Ryan G."}, {"rating": 5.0, "review": "Roku is the best of the best in streaming sticks.  We tried Chomecast and Fire, but Roku is the most reliable product and has great features.  The setup is very user friendly which is also important.  Love my Roku.", "verified": true, "helpfulness": "0/0", "author": "D Woods"}, {"rating": 5.0, "review": "I ended up buying 3 of these Roku sticks and gave them away to family members for Christmas.  They are easy to use and it has been hailed as the best Christmas gift ever to my grandfather who is almost impossible to please.  He's been streaming Netflix like there is no tomorrow.  Bravo, Roku!", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 3.0, "review": "Had some trouble with losing signal with this device... I also purchased the Amazon fire stick and like it much better!", "verified": true, "helpfulness": "0/0", "author": "kelly upton"}, {"rating": 5.0, "review": "We LOVE LOVE LOVE this!!  We just brought it on vacation with us so that we could have the kids use it at the hotel.  Makes life so much easier, they use it for amazon instant video as well as netflix, such a great gift to give as well, we've done it several times now!", "verified": true, "helpfulness": "0/0", "author": "Jill Brown"}, {"rating": 4.0, "review": "Nice alternative to DirecTV.  Easy set-up.", "verified": true, "helpfulness": "0/0", "author": "MasterCaster"}]