[{"rating": 4.0, "review": "So far so good, only been using it a few days. Only issue is i have to unplug it from its HDMI port after watching otherwise it scrambles my cable channels.. Love the size - easy to plug and unplug. Nice, easy menu system with a lot of apps. Definitely would recommend this streaming player.", "verified": true, "helpfulness": "0/0", "author": "Becky Hilgert"}, {"rating": 4.0, "review": "love it but remote quick working , but can use IPhone", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works fine on one TV. Will not work on older model TVs.  I was disappointed with \"free\" Roku  watching options but use Amazon and Netflix..", "verified": false, "helpfulness": "0/0", "author": "Donna Parker \"donna\""}, {"rating": 4.0, "review": "This is pretty cool , the menu could use some improvement , otherwise a good product. We were able to get rid of cable and just stream everything from the internet , saved us $150.00 a month", "verified": true, "helpfulness": "0/0", "author": "Louanne Cull"}, {"rating": 1.0, "review": "only 3 months warranty!!!  my Roku failed after 6 months......why don't they offer a one-year warranty?????  And go on their website, no warranty info at all.", "verified": false, "helpfulness": "1/1", "author": "Josh Baran \"HereNow\""}, {"rating": 5.0, "review": "Love this", "verified": true, "helpfulness": "0/0", "author": "Christie S."}, {"rating": 4.0, "review": "I really like my Roku streaming stick- it is discreet and I like that I can use my phone as a remote with the Roku app. I mostly use this for Netflix, Hulu Plus, Spotify, Amazon prime instant video and HBO GO. I have no problem with video quality or streaming interruptions (but I guess thats more attributable to my internet provider). We also have an apple TV, and the only advantage I see with the apple product is that I can mirror other internet content from my phone. For the price, and for those without other apple products, the Roku is definitely worth it!", "verified": true, "helpfulness": "0/0", "author": "Lauren A"}, {"rating": 5.0, "review": "The product itself works great. I bought this to replace my old Roku, one of the earliest Roku models made. I wanted to free up some of my crowded 2.4Ghz wifi by hooking up this Roku to my 5Ghz network (it works perfectly), while taking advantage of the no clutter look of the HDMI stick. This comes with the remote (Duracell batteries are included), the stick, and a mini USB-USB power adapter. If your TV supplies power through its USB port (I believe most do) you can power the Roku stick without using a wall power outlet. If your TV does not supply power, you will need to use a power outlet using the mini USB to USB power adapter included in the package. It shouldn't be a real issue for anyone. The remote is awesome, it has a Netflix, Amazon, Blockbuster, and one other shortcut button (I forget which one) to bring you to the most often used streaming channels.A few annoyances I experienced:If you are new to Roku, you have to apply for a Roku account and supply a credit card if you take the conventional route. I have no intention on making any purchases through my Roku, and do not want my credit card needlessly in some database, or having one of my idiot friends accidentally making a purchase. Roku seems to want to make it VERY difficult for you to get around giving them your credit card info. I called Roku and after waiting around 30 mins total, I spoke to a very pleasant, but hard to understand, Indian lady who walked me through signing up without using my credit card. The whole ordeal was a pain in the rear. Here is the link they send you to:owner.roku.com/signup-noccIf I ever have to call Roku again for anything, I may wind up coming back here and giving them 4 stars instead of 5.", "verified": true, "helpfulness": "5/5", "author": "D.Port"}, {"rating": 5.0, "review": "Very easy to install. It works great and opens up thousands of shows and movies that can be accessed immediately", "verified": true, "helpfulness": "0/0", "author": "William M. Ginther"}, {"rating": 5.0, "review": "very good, stealth roku device, you cant even see it, since it plugs into the back of the tv - I need another one.", "verified": true, "helpfulness": "0/0", "author": "CMJONES"}]