[{"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "1/1", "author": "Cheffe"}, {"rating": 5.0, "review": "Well worth the money.  No buffering & easy set up.", "verified": true, "helpfulness": "0/0", "author": "trooper87"}, {"rating": 5.0, "review": "Keep in mind if you purchase this device your internet modem has to be located in a central place in your home(not blocked by walls) or you have to have a very strong signal or the device will not work properly. I know because I spent hours on the phone with my internet provider and they could not figure out why my device was not getting a signal. However, the seller was more then patient with me although I was frustrated. Thanks Deal Fisher. The seller is great!", "verified": true, "helpfulness": "0/0", "author": "Shan't_Tell"}, {"rating": 1.0, "review": "Worked one time. Now every time I try to use it, it gets stuck on the screen with the word Roku just bouncing. Tried every troubleshooting idea I could find on google. Don't waste your money. Get a Roku 3 instead.", "verified": false, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 3.0, "review": "The stick is sluggishly slow. Same apps, same functionality as my roku3 but just really painfully slow. I have the chromecast stick and it is quick and responsive. I was shocked by how long it took for me to click the remote and for it to respond on screen.Otherwise, its as good as all other roku's. I love my roku over my chromecast.", "verified": false, "helpfulness": "0/0", "author": "Amanda Owens"}, {"rating": 5.0, "review": "This is much better than expected. We put this on a guest room HDTV, we have no cable, but so much to watch through  Netflix, amazon, & Hulu that family never miss it. Performance is just a touch slower than a roku 3 but really not bad at all. You real can't go wrong with this stick. Replaced our chromecast that was hardly ever used. Now that's stick is another story, way overhyped , well imo.  Take care", "verified": true, "helpfulness": "0/0", "author": "Patchman"}, {"rating": 1.0, "review": "piece of junk!", "verified": true, "helpfulness": "0/0", "author": "KP"}, {"rating": 5.0, "review": "Works well and is easy to install. Just make sure which version your TV requires. I say that as I have a TV that came Roku ready and ordered the stick and it was plug and play. I then tried it on another TV and it didn't work. I found out I had to have a different model for a TV that is not Roku ready. But none the less they both work well and deliver a good experience.", "verified": true, "helpfulness": "0/0", "author": "BigBen"}, {"rating": 5.0, "review": "Impressive streaming stick.  Have had it for a few months now and no complaints.  Planning to purchase another for additional TV.  Easy to use, very simple, plug into HDMI on TV, activate an account online, and you're ready to go.", "verified": true, "helpfulness": "0/0", "author": "Shawn Sekou Shaffer"}, {"rating": 4.0, "review": "Ultra portable and easy to use. I chose this over Google Chromecast since it had more apps and can connect to amazon prime.  We used this while on vacation to watch PBS and Disney channels.  It has a media player app that will play music and videos from a DLNA or NAS drive.  We had a wireless seagate HD that we used to watch our videos and listen to music.  This unit will be used on our spare TV when not traveling.  You have to setup wireless everytime you connect to a different network.  So far this is the only dislike.", "verified": true, "helpfulness": "0/0", "author": "dannyboy"}]