[{"rating": 5.0, "review": "I was a little skeptical about ordering a certified refurbished unit. But this thing has been strong so far. I only use it for Netflix and Amazon Prime videos, so I am not sure about the other features.", "verified": true, "helpfulness": "0/0", "author": "Daniel P"}, {"rating": 5.0, "review": "OMG! Love this thing! My only regret is not buying it sooner!", "verified": true, "helpfulness": "0/0", "author": "Tom Huben"}, {"rating": 5.0, "review": "Love this powerful little stick, I have been able to stream all my Fav's!!!", "verified": true, "helpfulness": "0/0", "author": "Said with Zig \"Mon-Said\""}, {"rating": 4.0, "review": "The Roku stick provides access to most popular streaming services on a portable and easy to setup device. The user interface are remote are intuitive and easy to use as well. As much as I like this device, I couldn't keep it and decided to return it for a second Roku 3. Due to the much smaller size and lower price, it should be expected that the stick would be less desirable than the Roku 3 but some of the shortcomings were simply intolerable for me after using a Roku 3 for six months.In most of the official pictures of the Roku stick, you never see the required power cable connected to the stick. The stick must be powered by a USB connector on the TV or by using a standard wall outlet with an adapter. The stick does come with the cable and adapter to for either option; however if you use the included 6' cable, you have a lot of excess wire to manage behind your TV. I decided to try the stick instead of another Roku 3 initially because it was going to be used on a wall mounted 32\" TV. This meant that the stick needed to connect to the HDMI port on the side of the TV in order to allow the TV to mount flush on the wall. All of that extra wire from the 6' cable was visible despite my best efforts to hide the excess. It would have been great if Roku had included a second 6-8\" cable for this setup scenario. There are some sellers on Amazon selling these for $4-$8.The second and more annoying issue for me with using the USB power option is that on my TV, the USB port does not provide power when the TV is turned off. This means that every time the TV is turned on, the Roku stick goes through a boot up process that takes approximately 60 seconds. That's not a terribly long time but a real annoyance for me. Another intermittent issue I had when powering the stick from the USB device is occasionally my TV would display a message that the device was not supported. The TV has a feature to allow for the viewing media directly from a flash drive and it seemed like that's what it was trying to do. The TV is brand new LG 32\" HDTV -- maybe some tinkering in the settings could have stopped this from happening but I didn't investigate it. As a note though, when this occurred, it never impacted the Roku stick. The message would disappear after a few seconds and the Roku was just fine. It only seemed to happen when I was switching between channels on the device and never during video streaming. Due to these issues, I decided to go with the all outlet power option. This also came with its own frustrations. Firstly, the adapter has the USB port forward facing, which meant that with the cable plugged in, the protrusion from the wall was about 3-4\". I found this to be unsightly and easy to be accidentally hit. An adapter with a side facing port would have been much better. My TV mount allowed for up to 20\" extension away from the wall. My best efforts at cable management left too little slack the first time and when I tested the extension of the TV from the wall, the power cable to the Roku stick pulled tight and slightly bent the device at the port.Something else I noticed right away when I picked up the remote for the stick is that compared to the Roku 3 remote is the feeling of an inferior product. Most notably was the feeling of the buttons themselves. The Roku stick remote felt like there was a softness or air gap between the buttons and the circuit board underneath. They also removed the lanyard on the Roku stick remote, which I know was due to the fact that it wasn’t meant to be used as a gaming controller like the Roku 3 but I really got used to picking up the remote by the lanyard. The 4 quick access buttons on the Roku stick are new in compared to the remote that came with my Roku 3. The quick access buttons are nice if you use those channels but useless if you don’t. The buttons cannot be reassigned to other channels. Even if you don’t have that channel installed, if you press the quick access button, you will be prompted to install the channel.Overall the slowness of the stick compared to the Roku 3 is very noticeable. This holiday season, the Roku 3 has been consistently going on sale; so it can often be got for just $30 more. I would strongly suggest spending the extra money. I exchanged mine and couldn't be happier. Either way, the Roku Company is making incredible products. It’s one of those situations where you get what you pay for.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very satisfied with Roku!", "verified": true, "helpfulness": "0/0", "author": "Charles C. Mayer \"ccm\""}, {"rating": 3.0, "review": "This Roku device was for a second room-already had/have the first Roku in another room. Although it is much closer to my router, the stick drops the signal a lot more often than my Roku much farther away. It isn't a problem with the location, because I checked the wifi signal picked up on my phone, and the phone wasn't having the same fluctuations as the new Roku device.  Disappointed. Wish I had just gotten another model.", "verified": true, "helpfulness": "0/0", "author": "Reux"}, {"rating": 5.0, "review": "This is my third Roku. I have two box sets but this is my first stick. I love it no wires and plug ins. I would definitely recommend to anybody looking to cut the cable. Convenient and easy to set up", "verified": true, "helpfulness": "0/0", "author": "Donnita"}, {"rating": 4.0, "review": "Roku totally out does Chromcast. My only problem is several times during episode or movie it says network is lost and I have to restart.  Can't figure out if it's Roku or Internet connection, don't remember same issue with Chromcast", "verified": true, "helpfulness": "0/0", "author": "v12"}, {"rating": 5.0, "review": "works great. easy. amazing technology.", "verified": true, "helpfulness": "0/0", "author": "Dr. Robert H. Pass MD \"Roberto223\""}, {"rating": 5.0, "review": "It works great!", "verified": true, "helpfulness": "0/0", "author": "luis conrado"}]