[{"rating": 2.0, "review": "i did not realize this was refurbished.bottom line, it was my mistake. it only works sometimes. often i need to press the remote many times for it to respond...wast of time and energy from my part.", "verified": true, "helpfulness": "0/0", "author": "Allan Schwartz"}, {"rating": 2.0, "review": "I loved it at first but had to keep replacing batteries in the remote and frequently 're adjusting the new ones to get it to work. Now we have had it for two and a half months and it just quit working. After about 1 minute it shuts off and the t.v. reads 'connection lost' only have two other devices connected with my WiFi and they work fine. Quite bummed!", "verified": true, "helpfulness": "0/0", "author": "C. Freihammer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Johnny"}, {"rating": 1.0, "review": "Not happy with the roku...after using it a couple times because we are not home much. We finally got a few channels download we liked. Such as John Hagee ministries so we can watch live on Sundays before church and a few old movie channels that are free and free tv shows.it now freezes up and you can not watch it. It only shows the logo or a black screen. One time it took it 1hr to come on and show our options. We have had it a @ little over 2 months. So we can not return it. We have learned our lesson ordering electronics on amazon. We will be purchasing in the store so we can return when we have a problem like this.i guess we will try the chromecast..or whatever it is called.", "verified": true, "helpfulness": "0/0", "author": "Tammie Gulley"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "drgreen19677"}, {"rating": 1.0, "review": "Super slow to start up, slower than other Roku boxes in use.", "verified": true, "helpfulness": "0/0", "author": "Chris H. Galbraith"}, {"rating": 4.0, "review": "Bought this for our daughter. We have the box Roku, but she loves this. Works well, easy to use and the right price.", "verified": true, "helpfulness": "0/0", "author": "Fiona Taylor"}, {"rating": 5.0, "review": "Great device and very mobile.", "verified": true, "helpfulness": "0/0", "author": "janinak"}, {"rating": 3.0, "review": "I've bought two of these. The first worked flawlessly but the second wouldn't configure and had to be returned. You take your chances with refurb products.", "verified": true, "helpfulness": "1/1", "author": "Centex Rancher \"Centex  Rancher\""}, {"rating": 4.0, "review": "The remote control makes all the difference with other hdmi keys! Would have like to get more live channels with IT.", "verified": true, "helpfulness": "0/0", "author": "fasolin"}]