[{"rating": 5.0, "review": "It works great! No interruptions when streaming. Not much of a delay when starting. Super easy to install. We love it and have already recommended it to family and friends.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 2.0, "review": "The solutions provided by Amazon Prime with streaming and my poor internet service on my Verizon hot spot,  left me with no option but to shut it off until I get back to Colorado.  I will then try it again with decent internet service and will let you know if it works.", "verified": true, "helpfulness": "0/0", "author": "LJJ"}, {"rating": 5.0, "review": "Product was easy to set up and works just like my other Roku (except for gaming capability, which I don't use anyway(. Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "DGA in Atlanta"}, {"rating": 5.0, "review": "Wow! I LOVE this ROKU!!  If you're even thinking about getting one you won't go wrong with this purchase.  When I bought it I wanted it for my Netflix subscription. I watch more Amazon Prime now than Netflix as I love all the TV shows Prime offers. I don't even miss my cable subscription or all the money Cable costs.  The Roku offers news clips so you can still keep up with current news events. I keep finding more that I like about having a Roku. Everyone should have one.", "verified": true, "helpfulness": "0/0", "author": "CeeJay"}, {"rating": 5.0, "review": "I own the Roku 3 and was looking to get another Roku for a second TV.  The streaming stick is basically the same as the Roku 3 (minus the headphones and gaming, two things I didn't need on the second TV), but with a less powerful processor.  You'll notice load times (e.g. bringing up Netflix) takes a little longer on the stick, but once you are watching your programming I didn't notice any difference.  The stick is great b/c it plugs directly into the HDMI port and can be powered by USB (if your TV has a USB port), so all wires can be concealed.Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Xan Nick"}, {"rating": 5.0, "review": "Works great and easy to set up. Almost invisible plugged into or TV mounted on the wall. The only issue we've had is that it can take up to several minutes for the device to wake up from sleep mode. I'm not sure if that's a common problem or if it's something I should exchange for but it's really a minor inconvenience so I haven't dug into it. Great device though overall.", "verified": true, "helpfulness": "0/0", "author": "Kevin Pierce"}, {"rating": 5.0, "review": "I own two older Rokus, and a Chromecast, several app-enabled TVs and four TiVos. I use this on my one non-app enabled TV. It Is great. Not only can I get all the streaming services including YouTube (Old Rokus didn't do YouTube), I can control it with a simple remote instead of my phone (Chromecast) plus not have to spend a fortune upgrading a perfectly  good TV or buying more TiVos and service! Best of all, it supports PLEX and I can stream all the media on my WHS to the set now.", "verified": true, "helpfulness": "0/0", "author": "John R. Fuda \"John\""}, {"rating": 5.0, "review": "Have the Roku box on another tv. Bought this for a wall mounted tv. It was plug-n-play.  Hadn't realized it had a power cord as well, but luckily had one accessible. You still have to reset up your channels--would be nicer if it knew what you had added on you other boxes. But, it's a great thing, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Shari"}, {"rating": 5.0, "review": "I bought one for myself and one as a gift, and let me tell you--I've rarely been so pleased with a purchase! This little Roku is quite a bargain since you can take it anywhere that has an HD TV,  the video streaming is on par with any regular device I've used for streaming such as a Wii, Playstation, or X-box.I do find that the wifi reception is very sensitive though. I have Verizon Fios,  excellent wifi access; however, if the router is covered then the Roku loses it's signal. But this is the case with many other streaming devices, and I tend to use a TV on the opposite end of the house from the router, which could factor in.Otherwise, I have had no problems with this device, and would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Old Whateley"}, {"rating": 3.0, "review": "I was a little disappointed in the remote. It is not the same as my other ROKU, the biggest difference is there is no game wand in it, and there is no earphone availability. The netflix and blockbuster buttons...who needs 'em.I would've spent the money on the more expensive unit if I did it over.", "verified": true, "helpfulness": "0/0", "author": "T Struewing"}]