[{"rating": 3.0, "review": "Would be great if I didn't have to pull the power plug out and reboot it so often.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great for streaming my addiction to Netflix.", "verified": true, "helpfulness": "0/0", "author": "TerTer"}, {"rating": 5.0, "review": "Perfect for those who want to stream Netflix or Hulu, but don't have a game console or blue-ray player. I love the inclusion of free channels. My son watches a lot of them. My favorite part is that I can stream Pandora. I use this more than my regular cable.", "verified": true, "helpfulness": "0/0", "author": "shyler"}, {"rating": 5.0, "review": "The Roku streaming stick was very easy to install and now I get shows from PBS, the History Channel, Smithsonian and many more free. I am enjoying having it very much.", "verified": true, "helpfulness": "0/0", "author": "Barbara Turner"}, {"rating": 3.0, "review": "Great video quality, *very* laggy interface", "verified": true, "helpfulness": "0/0", "author": "Jay Dey"}, {"rating": 5.0, "review": "Stick arrived on time and was easy to set up. All instructions were very clear. Once I got the code from the Roku TV setup and established a Roku internet site and entered the code everything went smoothly.After picking many channel choices I went ahead to view my selections. Extremely happy with this item. Would highly recommend it to others.", "verified": true, "helpfulness": "1/1", "author": "Stevens Rudd Jr."}, {"rating": 5.0, "review": "Great competition for the Google streaming stick. I also have one of those and a Roku 3. It gets all the channels that we use on our Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simple fun way to get onto all your favorite apps without a hassle ! 👍", "verified": true, "helpfulness": "0/0", "author": "Kyle Corbin"}, {"rating": 5.0, "review": "This is my goto gift for any friend that watches netflix. I love my roku. We also got one of these to take with us for when we travel and stay at airbnb places. We watch our huluplus, netflix, amazon prime, hbo go. I also like to leave on the fashiontv and runway tv when i'm doing chores OH and we watch our porn on here too! We are basically breaking up with our appletv thanks to you roku.OH I also just learned you can change screensavers now I have cool pics and visuals. LOVE!", "verified": true, "helpfulness": "0/0", "author": "shellz"}, {"rating": 5.0, "review": "This made my regular tv a smart tv for under $50!  It came in one day and was very easy to install and program to tv.  Great instructions in package and you can also go online for a tutorial.  Just a great product.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Granny D \"Darcy L Quarles\""}]