[{"rating": 4.0, "review": "I purchased this as a step in becoming a cable cutter. It worked fine on my primary TV but for some reason did not allow the Optical Audioin my sound bar to work. This was a deal beaker for the main TV so I moved it to an auxiliary TV in the bedroom. Works fine there.", "verified": true, "helpfulness": "0/0", "author": "Kevin O. Blackwell"}, {"rating": 5.0, "review": "Roku stick is great. It does everything it is advertised to do.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Whitfield"}, {"rating": 3.0, "review": "Good for netflix. other services cost $. Doesn't let you view internet on tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works well wish there were more free sights. Starts off slowly then runs great. Good deal", "verified": true, "helpfulness": "0/0", "author": "Donato"}, {"rating": 2.0, "review": "I have a Roku box which works well on my vacation home TV but the streaming stick doesn't measure up. It loses its connection to the remote regularly and the remote has to be within a foot or two from the stick even when it does have a connection. The streaming is good when all the above are solved.", "verified": true, "helpfulness": "0/0", "author": "ronnie"}, {"rating": 5.0, "review": "I have the older Roku and while it had 1020p, I didn't have access to some channels and the new menu. So this upgrade did help a lot. I have the newest channels and this streaming stick works much more swiftly and is easier to handle. I really like the Netflix button on the remote.  The price is better too.", "verified": true, "helpfulness": "0/0", "author": "Lynn Ellingwood \"The ESOL Teacher\""}, {"rating": 4.0, "review": "ProsHas a good selection of apps.Hides behind the TV well.Setup was fairly fast.Comes with a remote which is the main reason I did not pick up the Chromecast instead.Everything works as expected and easy to use.ConsSluggish. Noticeable load times when launching Netflix. Scrolling is not fluid on some app interfaces. Not unusable but noticeable, movies load fine though.Unsure if it is because of the above issue or because it hides behind the TV blocking line of sight but seems to miss about 1 of every 20 commands from the remote.Overall I am happy with it for the price. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "TL"}, {"rating": 1.0, "review": "Dont buy this product if you live in other country because the popular channels like netflix and amazon dont work, of course you have other but its not that i wanted.", "verified": true, "helpfulness": "0/0", "author": "monica"}, {"rating": 1.0, "review": "I bought this streaming stick as a presumably good way to turn our 4-year-old HD TV into a smart TV.  The Roku streaming stick did not work well and I returned it.  Although other items in the same room with this TV pick up the signal from our wireless router just fine, the Roku stick would not stay connected.  For the brief periods it was connected, the picture quality was very poor.  The only good thing I have to say is that Roku customer support worked with me extensively and they were very polite even though they couldn't solve the problem.  Thanks to Amazon for an easy return.", "verified": true, "helpfulness": "2/2", "author": "Roz"}, {"rating": 5.0, "review": "Product was as described. Excellent service. Would recommend.Excellent Vendor", "verified": true, "helpfulness": "0/0", "author": "M. Lavett \"Book Lover\""}]