[{"rating": 5.0, "review": "Flawless installation. I rarely recommend products.", "verified": true, "helpfulness": "0/0", "author": "M. Distefano"}, {"rating": 5.0, "review": "This is such a convenient device.  It's perfect for our kids play room, it can be powered by the included PSU or by being plugged into the TV that it's attached to (if the tv offers a usb/service port).  It is well hidden, but can stick out depending on where your HDMI ports are located.  Arrived on time and in new condition.", "verified": true, "helpfulness": "0/0", "author": "Dwayne Bayer"}, {"rating": 3.0, "review": "kinda slow compared to he table top version", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 5.0, "review": "Absolutely love it.  Very easy interface of popular streaming sites.  Also, easy access to JW Broadcasting, which we are huge fans of.  Nice when something does exactly what you had hoped it would do!!", "verified": true, "helpfulness": "0/0", "author": "Edie"}, {"rating": 5.0, "review": "Very useful!", "verified": true, "helpfulness": "0/0", "author": "MM \"American Made\""}, {"rating": 5.0, "review": "This stick is great.  You can take it with you when you travel and it works flawlessly.  In fact, the color and reception is better with the stick than with the Roku 3 box.  Only way to go.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey G. \"Say something about yourself!\""}, {"rating": 2.0, "review": "No cable.  No dish.  Very little over the air reception.  I bought this because it operates with IOS so I could dust off the iPad mini I won at a trade show and put it to use.  I was hoping I could get live streaming of local channels but it does that, I haven't figured it out yet.I have Amazon Prime as well as Netflix and it really doesn't add any value to the interface for them and in some ways,it's worse. I haven't tried making it like a 2nd monitor... which may be the solution to live streaming but it seems like i would have to start on ipad or laptop and then duplicate screens.The two big pluses compared to the options are this one plugs into USB to power itself if your TV has powered USB and unlike the Amazon product, it has ios now. (amazon promises ios in the future)I need to dink around with it a little more and hopefully I'll get some happy surprises.  Right now, the fact that it can't, or I haven't figured out how to, stream live broad cast TV is just a bummer.", "verified": true, "helpfulness": "0/1", "author": "amo"}, {"rating": 1.0, "review": "I don't know how the product works but I hate the company policy.To activate this device, your credit card information is required even if you're not purchasing subscription.With so many Hugh company who gotten hacked lately (Walmart, homedepot, Chase....), I find this hard to believe that activating a device requires a credit card.I already have Netflix, HBO, Showtime accounts, so there is no need to have a credit card on ROKU file/webserver.But if you're not worried about putting your important information at risk then ignore my review.In the box and ready for UPS.Don't really this devices that badly.", "verified": true, "helpfulness": "2/3", "author": "Maggie"}, {"rating": 1.0, "review": "Avoid the stick and \"stick\" with a Roku box. The stick does not have the power to sustain Netflix streaming (why we purchased it). It was fine for the first month or two and has just konked out after 6 months. Will not sustain an wireless signal of any kind (any channel) without crashing and producing an error message to try another time.  We're now using our blueray dvd player to stream Netflix, etc. Will try to return the Roku Streaming Stick purchased through Amazon, but want to warn prospective purchasers. Please see other reviews talking about the same issue (not enough power to stream Netflix).", "verified": true, "helpfulness": "0/0", "author": "N. Sims"}, {"rating": 3.0, "review": "Perfect substitute to a smart tv. Have some issues with Wifi, and the remote is sometimes unresponsive with no explanation. A little slow during boot up. USB cable should have a right angle at the Roku end for clearance purposes.", "verified": true, "helpfulness": "0/0", "author": "Rafael"}]