[{"rating": 3.0, "review": "not what i expected", "verified": true, "helpfulness": "0/0", "author": "jorge trista"}, {"rating": 4.0, "review": "I ended up returning it in favor of a refurbed Roku 3 for the headphones, this one had buttons that seemed unresponsive, and the headphones on the Roku 3 was too good of a deal to pass up.  I use the Roku 3 and the headphones a lot, especially when there's a sleeping child/spouse in the room.  This would be a great deal as an intro to streaming TV, a secondary TV, or for a kids room.", "verified": true, "helpfulness": "0/0", "author": "Miss Courtney"}, {"rating": 1.0, "review": "I ordered a new, not a refurbished Roku Streaming Stick. But I received an open-box unit. The seal on the box had been broken. Nothing in the box was in a  plastic bag and batteries were loose in the box. I had a hard time making the remote to work. I managed to connect the stick to my WiFi network. But the stick could not update its software. The remote stopped working altogether. It appears that I received an item that had been returned as defective by a previous customer as new. This is very disappointing.", "verified": true, "helpfulness": "0/0", "author": "Anthony K. Yokoyama"}, {"rating": 1.0, "review": "never got it to work", "verified": true, "helpfulness": "0/0", "author": "bill"}, {"rating": 4.0, "review": "it seems to work a tad slower than our roku 3 but for the most part I am very happy with it. Definitely like the apps and setup better than our samsung blu-ray player", "verified": true, "helpfulness": "0/0", "author": "BusyMomma \"Busy Shopper\""}, {"rating": 3.0, "review": "The first one I was sent kept shorting out, got a new one sent and the remote connected to it initially but now won't... I gave up and downloaded the app and use my phone for the remote.As for the roku program.. Love it!", "verified": true, "helpfulness": "0/0", "author": "sbalcom"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Cindy L Shafer"}, {"rating": 4.0, "review": "working well", "verified": true, "helpfulness": "0/0", "author": "James F Storey"}, {"rating": 5.0, "review": "Roku rocks, incredibly fast streaming stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Yes was good choice !", "verified": true, "helpfulness": "0/0", "author": "rodrigo"}]