[{"rating": 1.0, "review": "Our Roku experience has been a nightmare.  Everything got set up and worked well for a few weeks and we were very happy with the device.  A few weeks into our enjoyment, our remote stopped working.  The roku would still turn on, but the remote just had a green flashing light that wouldn't stop and would not interact with the TV at all.  We called the ROKU help line and waited quite a while for service.  Then, after an hour of speaking to a lady who had us turn it all on and off a million different times and ways: take the batteries out, turn it off, turn it on, reset, hold a button, push these buttons together, etc.  She finally blamed it on our internet provider and told us we must be on the wrong channel/line.  We called the internet and we were already on the \"channel\" she recommended.  We then called the ROKU help line again and for another hour heard the exact same things we heard the first time: turn it off, turn it on, take the batteries out, reset your wireless, etc. to no avail.  It's like the people at the help line have one solution to try and help you and no other options.  The player doesn't work, the remote won't connect, and we are out the 60 bucks we payed for a machine that worked for a few weeks and then quit.  The customer service is beyond awful- it's like talking to a computer with  recording set on repeat.I would never recommend this player to anyone.  I would say go for one of the other slingbox options.  ROKU is not worth it.  You might be lucky and get one that works for a while, but if you ever have an issue it won't be resolved with the ridiculous customer service.", "verified": false, "helpfulness": "0/0", "author": "Susan Riggs"}, {"rating": 5.0, "review": "Wonderful device. Watch my religious TV station on my own TV including interviews and videos. Easy to set up. Great price.", "verified": true, "helpfulness": "0/0", "author": "Childbride"}, {"rating": 5.0, "review": "This was my first experience with streaming movies and tv shows through the internet. Worked very well, set up was easy, and there is a large channel selection.", "verified": true, "helpfulness": "0/0", "author": "alex grantham"}, {"rating": 5.0, "review": "Simply excellent product no more cluttering of wires and best part cones with remote 😃", "verified": true, "helpfulness": "0/0", "author": "samrat bagchi"}, {"rating": 5.0, "review": "We love this for steaming to our TV.  We cut cable and haven't looked back.", "verified": true, "helpfulness": "0/0", "author": "plumcreekfarm"}, {"rating": 5.0, "review": "Son in Law totally happy with stick, saves him the cost of a cable box every month for upstairs TV!  A real bargain!  Uses TWC app to stream all the cable channels as well as other services.", "verified": true, "helpfulness": "0/0", "author": "Speltigi"}, {"rating": 4.0, "review": "Love it.  Every once and a while I have to reboot the stick.  It gets stuck.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works excellent , easy to install . I think I'll FIRE my cable company ... !!!", "verified": true, "helpfulness": "0/0", "author": "stacey welborn"}, {"rating": 5.0, "review": "Works very well and gives me the amazon prime access that I wanted on a non-smart tv", "verified": true, "helpfulness": "0/0", "author": "Mr Vette"}, {"rating": 1.0, "review": "Based on other reviews here, I purchased this stick. After trying for 3.5 hours to install it, I gave up. I waited 35 minutes for Roku support to help me, and we were chatting for over an hour. The support person finally wanted me to change the security settings on my Xfinity router and screw up all my other wifi device connections. (That connected quickly and easily, I might add) Roku is messed up if it can not just set up seamlessly with Comcadt high speed internet. Do not waste your time or money on this. I really wouldn't have given it one star, if I had thought my review would be posted without it.", "verified": true, "helpfulness": "0/0", "author": "Jean Cobb"}]