[{"rating": 5.0, "review": "This is a wonderful product! All my channels at the push of a button. If you buy one of these, you'll love it!", "verified": true, "helpfulness": "0/0", "author": "EricEVFan1 \"Eric Alonzo\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Arturo Lopez"}, {"rating": 2.0, "review": "I'm sorry to say that I've just about given up on Roku's products. The streaming stick being my latest purchase suffers from some of the same issues as other Roku's I've purchased. bad quality control!  While the stick works it's certainly much, much slower than a stand alone box. Its very sluggish and gets very hot which I suspect causes the problem I suffer from, when it gets hot it locks up requiring a cool down period and a hard reset. This is exactly the same problem the stand alone Roku suffered from in my TV room which I replaced with a Fire TV. I'm now in need of another streaming device to replace this less than 2 month old Roku 3500R, I love the Roku  search  and menu screens and almost pulled the trigger on a Roku 3 but enough is enough. I'll sit this round out, just can't give any more money to a company with such low quality/design standards. Your experience may be different, good luck.", "verified": false, "helpfulness": "0/0", "author": "Oldthor \"bluemax\""}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "katie"}, {"rating": 4.0, "review": "I had trouble with getting it to work in the beginning.  It took a couple of weeks of getting intermittent streaming, unsure whether it was my internet connection or Netflix.  Finally,  ROKU customer support offered me a free extension cord that connects the Roku  device to the tv and thus far, seemed to do the trick.", "verified": true, "helpfulness": "0/0", "author": "Beth Ungerleider"}, {"rating": 4.0, "review": "I have a 2XS with beaucoup channels so the setup for the Streaming Stick took about an hour as it recognized my ID.  On initial use it froze and required a reboot for some reason but on subsequent use it has performed flawlessly.  Quality of the HD picture is superb.  I am extremely satisfied with the product.", "verified": true, "helpfulness": "0/0", "author": "Alan_47"}, {"rating": 5.0, "review": "Cheap way to get more internet content on my TV. I program, so i hate to spend more hours hunched over my laptop viewing internet content. have used it mostly for Amazon Prime and Youtube. No way i can consume all the content it makes available for free!some things are a little klunky, like tabbing thru the alphabet to spell the name of items for search, but i don't mind. after all, i still have a flip phone.did not have to spend much time figuring out how to install and use. this is a major plus cuz i have to figure things out all day and really don't want to do it all over again at home.bought another one as Christmas present for my movie-obsessed BF.", "verified": true, "helpfulness": "0/0", "author": "middle aged nerd"}, {"rating": 4.0, "review": "Works quite well.  Just wish I could display web TV on it (the popular channel product I tried has no support and insisted my email address was bad).  This Roku set up quickly and painlessly.", "verified": true, "helpfulness": "0/0", "author": "J. Calhoun"}, {"rating": 5.0, "review": "Tiny little stick that does everything you want it to, and for cheap. Couldn't ask for more.", "verified": true, "helpfulness": "0/0", "author": "KEEGAN LEE RINEHART"}, {"rating": 4.0, "review": "I bought this ROKU stick in a hurray as I needed an extra and moved from the box to the stick since I wanted it in case I go to wall mount TV.  It fits well and keeps my console free of excess items, but it is the orginal ROKU and not the ROKU 3 that I now have. The price is very appropriate an I should have known that it is an older model with a different remote.............I think it is fine as a second roku.", "verified": true, "helpfulness": "0/0", "author": "Rhode Islander"}]