[{"rating": 5.0, "review": "Bought this as a gift and they love it as much as I love mine! Using stand alone internet and it works great,", "verified": true, "helpfulness": "0/0", "author": "Christine M. Stewart \"dreamweaver39\""}, {"rating": 4.0, "review": "I love the features it has. If I can't find the remote I can use the roku app on my iPhone as the remote. I can also view pics on the tv! Love it! I bought this after I cancelled my cable and I have no regrets.", "verified": true, "helpfulness": "0/0", "author": "Rebecca W."}, {"rating": 5.0, "review": "I love this product! I have been searching for a long time for this and it arrived at my doorstep today. It took about a half an hour to set up and plug in all of the passwords for my streaming channels. Its super easy to navigate and user friendly. With this cable is obsolete.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I didn't want to pay a monthly cable bill, after hearing about the Roku I decided to invest in it.. I was a little nervous at first but customer service was so friendly and patient with me. I couldn't have made a better choiceI really enjoy this little Port.....don't know a lot about it, but one thing I do know is that it works....", "verified": true, "helpfulness": "0/1", "author": "SWiggins"}, {"rating": 5.0, "review": "Just a part of my \"cut the cable cord\" effort.  Very nice that this easy to install device adds so many apps.", "verified": true, "helpfulness": "0/0", "author": "John A. Herzog"}, {"rating": 1.0, "review": "I ordered this product because I wanted netflix on a tv in the guest room and to my surprise after all he configuring on the tv and downloading a few apps I tried to get the netflix which in return tells me my location is not recognize , so i went on the site to query , I even called the customer service which they told me it doesnt work for my region . Now this is something I think they should of posted while they are selling so people would know what to expect and not think as the advertising does you will be watching netflix !", "verified": false, "helpfulness": "0/1", "author": "Dwayne Peters"}, {"rating": 5.0, "review": "Plugged in to the TV and was set up very quickly, hot buttons are a good feature, being a first time user there's a lot to explore, definitely enjoy more than satellite.", "verified": true, "helpfulness": "0/0", "author": "Errol Jung"}, {"rating": 1.0, "review": "I was so excited about this item. It was easy to install and seemed to work great. In reality the only time I used it was when I installed it. The next time I was going to watch a movie everything seemed to be fine, but when the movie began I could only hear sound. The screen was solid purple.I tried to return the item, and apparently I am unable to because I ordered it over 30 days ago. Complete bust! Very disappointed!", "verified": true, "helpfulness": "4/4", "author": "eva411"}, {"rating": 3.0, "review": "The product works fine but when it comes to content it's limited. Their website requires credit card to register your account which I didn't like as I have no intention to buy anything. I called customer service and they did register me without a credit card. They vaguely mention \"many free channels\" on their website but those are few and very well hidden. Even the ones listed under free sometimes turn out to be non free. They haven't provided a way to list / search all free ( and only free ) channels which makes it a pain. Another thing I don't like is that you can't remove Netflix etc. from MyChannel list just because Roku is hawking these services.", "verified": true, "helpfulness": "0/1", "author": "Mohammad K. Khan"}, {"rating": 4.0, "review": "...but not at a hotel.  Granted, I only tried it at one hotel, and read only later that this device doesn't tend to play well with hotel wifi.  I did my research after the fact (unfortunately) and all I really needed to watch Netflix and Amazon prime at my hotel was a cheap cable to connect my Kindle Fire HD to the TV.  I bought the Roku stick for a long work trip and wasn't able to use it, but I'm keeping it anyway because it's nice to have the remote control to use at home.", "verified": true, "helpfulness": "0/0", "author": "May"}]