[{"rating": 2.0, "review": "I purchased the Roku stick because a friend reccommended it.  Well I got to watch TWO  movies and then it stopped working!  Part of the problem is my Optimum internet service stinks.  The other part is this device has to be defective.Update:I'm changing my review. After several calls to Roku, the device may be working.  Trying to understand customer support is a challenge by itself.  So you may have to experiment yourself.It took 4 or 5 times of unplugging the Roku and plugging it back in again, along with resetting the remote over and over again to get the Roku working.  So far, it seems to be working the way it's suppose to be.I did find the Roku keeps you logged into ALL of your services,  such as, Netflix, Hulu Plus, ect.  So if you have to return it, you need to log out of all your accounts.  Otherwise, other people could gain access to your accounts.update:The remote stopped working again.  Actually, the remote loses my internet connection and it's not always simple to get it working.I'm not that impressed with the Roku.  I'm even less impressed with Roku customer support.  They called and left a message on my answering machine.  The ONLY word I was able to understand was \"Roku\", and that was after replaying the message a few times.  I hate dealing with people I can't understand.I really can't reccommend Roku.  I can watch shows on my tv using my tablet by connecting an HDMI wire which costs a lot less.", "verified": true, "helpfulness": "0/0", "author": "Wende"}, {"rating": 2.0, "review": "THE STICK GETS HOT AFTER 2 OR 3 SHOWS. I like all the channels BUT we shouldn't have to pay for most of them. And it would of been nice to be told about the $69. SET UP FEE TO EVEN START. Then", "verified": true, "helpfulness": "0/1", "author": "deanna"}, {"rating": 1.0, "review": "Bombed out multiple times on initial connection.  Returned to Amazon.", "verified": true, "helpfulness": "1/1", "author": "C"}, {"rating": 5.0, "review": "Out where we live there is no cable available and satellite is spotty at best--- This little device gives us access to all the features of cable and more! Really expanded our entertainment options; Netflix, HULU, Amazon Prime, etc.... at a fraction of the cost!!!!!", "verified": true, "helpfulness": "0/0", "author": "Wood Flute Maker \"John\""}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Bob Wright"}, {"rating": 1.0, "review": "Ive used an Apple TV for years and wanted to try out a roku because I'd heard about \"thousands of channels\" It is true, there is an almost overhauling amount of content to choose from, but I returned it within an hour of using it. Horrific user interface, slow response, and overall poor quality of content", "verified": true, "helpfulness": "1/1", "author": "Glen"}, {"rating": 2.0, "review": "Maybe it's my internet speed but I keep losing connectivity with Netflix and have to keep rebooting which wastes a lot of time.  Overall, I'm disappointed in the performance.", "verified": true, "helpfulness": "0/0", "author": "Joan Lionetti"}, {"rating": 2.0, "review": "Very slow compared to Roku3", "verified": true, "helpfulness": "0/0", "author": "Jeff Cushing"}, {"rating": 4.0, "review": "I am a big Roku fan.  I have had many of them going back several years.  Generally speaking they are great devices and I highly recommend them to everyone.  I got the little stick version as part of an Amazon promotion related to the purchase of a Netgear router.  In any case it arrived and I put it to use on my wireless network.  Set up is simple so in a few minutes I was able to watch Netflix, Amazon and all the other content.  This Roku lacks the earphone connection on the remote that the Roku 3 has and as well there are no games but neither of these features matter to me.  Otherwise it seems to be about the same as the Roku 3 it even has 5mhz wifi capability.  This version is a space saver and at a lower price than the full sized versions.", "verified": true, "helpfulness": "0/0", "author": "J. Barry Ryan"}, {"rating": 5.0, "review": "Works great I trav a lot and uses it all the time", "verified": true, "helpfulness": "0/0", "author": "Johnnie carmichael"}]