[{"rating": 5.0, "review": "The Roku streaming stick was the perfect choice for me and my family. Compared to the roku 2 the stick is a way better choice. The stick plugs in the back and you can't even see it. Unlike the the roku 2 where you can see the wires and had a lot of problems with it loading while watching movies.Never had a problem with the roku stick especially with our internet speed of 50mbps and the layout it much better.  I have 3 different TVs that we use the roku on.  A 60\" Sharp LCD, 46\" Samsung LCD, & 32\" Hisense LED tv.  No matter which tv we use the resolution is very clear and sharp.We currently use Hulu plus and Netflix.  What's really neat is that if you use your phone or tablet to find something on Netflix you can mirror it and it'll start playing it on your tv.I would highly recommend purchasing the roku stick.", "verified": false, "helpfulness": "0/0", "author": "J. Laos"}, {"rating": 1.0, "review": "We bought this as a gift for my parents but it would not work with their router. Apparently this is a common issue.", "verified": true, "helpfulness": "0/0", "author": "gingerkidette"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "fred green"}, {"rating": 5.0, "review": "Love it! I use this in my bedroom because my TV in there isn't a smart TV. I stream movies and shows almost every night and have never had one hiccup streaming (Netflix and Amazon Primarily). Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Nana was able to set this up on her own! It scores five starts in ease of use.  Streaming speed depends a lot on the speed of your internet. Ours was reasonably fast- no complaints. Great little product!", "verified": true, "helpfulness": "0/0", "author": "pamela"}, {"rating": 5.0, "review": "This is not my first Roku product.. They  make a great product,  Now if they would just make registering it easy, it would not cause all the frustration I have with them.. This is especially true when I move the unit from one of my homes to another.", "verified": true, "helpfulness": "0/0", "author": "James Pruett"}, {"rating": 5.0, "review": "Cool product easy set up love it...and easy to move around....like when you go camping", "verified": true, "helpfulness": "0/0", "author": "chris o"}, {"rating": 5.0, "review": "I enjoy it everyday that I turns it on.", "verified": true, "helpfulness": "0/0", "author": "Paula Gaither"}, {"rating": 3.0, "review": "The roku streaming stick, a smaller more compact version of the full size Roku Box. At the cost of compactness you lose a few features. THe roku stick has a slight lag while jumping from different channels, and has a slow boot up time, unless you use the wall adapter which leaves the stick on 24/7. The included roku remote is great! Controlling the roku through a bluetooth connection instead of the traditional infrared remotes like on TV remotes, can be pointed anywhere and the roku still controls! Very responsive remote.", "verified": true, "helpfulness": "0/0", "author": "matt ames"}, {"rating": 3.0, "review": "This is a nice streaming stick, but it does tend to be a bit slow. And the User Interface is a bit ... ugly and outdated looking.It also deluges you with ads in the sidebar, and for me at least, once I buy a product I don't also want to be forced to have it's ads right there in front of my face.When watching movies, I don't like how there are no thumbnails of where it's at and/or upcoming as I foast forward or rewind. I also don't like how when doing so it basically stops everything, then when you stop the FFW/RW it goes black while is reloads up to the point you selected. It should be much smoother of a FFW/RW experience.I'm also a Plex user, one of the main reason's I bought the stick, but the Plex app, and even the Plex clone that is supposed to be better, are both basically crap, and from all I've read it's due to the way Roku offers a crappy developer API. The Plex apps on Android devices are SO much better.Another big issue; I'm a Comcast/Xfinity subscriber, and Roku doesn't work things out with them ... this means NO HBO Go on the Roku, No Lifetime, No A&E;, and MANY other channels, because CC/XF blocks them form being shown on Rolu devices. This has apparently been a huge issue for YEARS, with thousands of complaints from customers of both, like myself, to no avail.Finally, while not \"too\" bad, it IS a touch slow to respond via the remote.I'd say the UI issues (mostly due to lack of developer support) and the blocking of major channels on it may eventually be the Roku's downfall if they don't hurry up and get that all together. If those were ironed out right this moment on this exact device, I'd give it a 4.5 stars, half a star off just for the slightly slow speed.", "verified": true, "helpfulness": "0/0", "author": "GeekDrop(.)com"}]