[{"rating": 4.0, "review": "This is an amazing feature to add to my bedroom TV!  Only one problem, the remote often doesn't work.  I have to constantly take the batteries out and put them back in.", "verified": true, "helpfulness": "0/0", "author": "RoseAnn M Ebben"}, {"rating": 5.0, "review": "Awesome, no words, I've tried every streaming sticks and this one is really the best of all. Thanks for this great product.", "verified": true, "helpfulness": "0/0", "author": "Xavier"}, {"rating": 4.0, "review": "Would've gave it 5 stars but it's pretty annoying that a month or so in the remote has already stopped working out the blue. Googled about it and I see it's a known problem. Don't really understand with today's technical capablitities how they can't get a remote to work properly. Thankfully they do have their app so technically I have a remote to still use. Other than the remote issue, the stick itself works fine and any problems I have have been through the app I was trying to watch ( like Showtime, ehem but I see they are doing something with Hulu which is a smart move seeing as their app sucks). Anyway back to Roku, great steaming stick for the money but just know your remote will most likely than not just stop working out the blue.", "verified": true, "helpfulness": "1/1", "author": "decbabe77 \"decbabe77\""}, {"rating": 5.0, "review": "I really like both the unit and concept behind streaming video.  This device was everything I wanted and having had it for awhile dependable as well.  Easy to hook up and use.  It was a great purchase that I use a lot.  It has paid for itself several times over in value.", "verified": true, "helpfulness": "0/0", "author": "Gary Hanamoto"}, {"rating": 5.0, "review": "Good gadget. Works perfectly fine. I have had no problems except that when my power is restored, I have to refind my network and turn the batteries in the remote to get it working again. It is great for a TV that doesn't have apps built in.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "Still using it today. It does a great job at streaming.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 1.0, "review": "We have had a perfect experience with a Roku box in the past.  When we got another TV, we decided to try the Roku stick.  The stick itself seems to work just fine, but we cannot get the remote to work.  Below is the transcript on the live chat I had with Roku support (I've removed the names).  The Roku tech person certainly seemed to try his/her hardest:PUZZLED CONSUMERHi. Having trouble with my remote. I'm trying to program the roku, the remote cuts out, and now after pressing the button on the back the green light won't stop flashing. Needless to say, it's not working at the moment. I've unplugged the roku and plugged it back in,I've reinserted the batteries, but the green light won't stop flashingROKU TECHBefore we proceed, may I have the following information?Serial Number of the Roku player (found underneath the device):Date and Place of Purchase of the Roku player:PUZZLED CONSUMERXxxxxxxxxxxx.  Purchased a few days ago from Amazon, just trying it out today for first time.ROKU TECHThank you, Please remove the batteries from the remote control and set it aside.Then, we also need to reboot the Roku player by removing the power cable at the back of the device, wait for about 2 minutes before plugging it back.Once it's on the Roku Menu Screen, please reinsert the batteries to the remote.PUZZLED CONSUMERi just tried thatROKU TECHTry a new set of batteries.PUZZLED CONSUMERTried that tooROKU TECHPress and hold that reset button on the side of the stick for 30 seconds.PUZZLED CONSUMEROkay. Did that and now have the bouncing rokuROKU TECHThen check if the remote is working.PUZZLED CONSUMERIt is trying to pair...ROKU TECHHow far is your Roku from your router?PUZZLED CONSUMERAbout 10 feet or soROKU TECHI see, Still not working?PUZZLED CONSUMERWell, it won't recognize the password for the router, and now the remote won't work again. I'm stuck on the error message for the wifi password, but the remote won't let me click on the \"Try again\" button on the screen.ROKU TECHPlease doublecheck the password of your network, Press again the reset button on the side of he stick for 30 seconds.PUZZLED CONSUMERReset accomplished, have the bouncing roku nowROKU TECHThen set it up again.PUZZLED CONSUMERRemote is re-pairing with rokuROKU TECHAlright.PUZZLED CONSUMEROkay, all reset and connected, but the remote won't let me press \"continue\" on the Get the latest software page. This is the 6th time I've tried to set this up, and I am ready to scream. Of all the times for the remote,to quit (again), I've finally gotten the wifi connected and I can't go any farther.ROKU TECHI see, Seems like there is interference, Before I advice you to move your Roku, Can you try another set of batteries?PUZZLED CONSUMERWill try. Will I have to re-pair?Plus, I can't really move the roku, became it is a roku stick and it can only go into the back of the TV.ROKU TECHYes. Do you have a different Tv where we can plug the player?PUZZLED CONSUMERNo.ROKU TECHI see, Try another set of batteries please.PUZZLED CONSUMERnew batteries in, nothing happensROKU TECHpress the reset button again for 30 seconds.PUZZLED CONSUMEROMGROKU TECHI'm sorry but we need to do possible steps that might resolve this issue.PUZZLED CONSUMEROk, reset. Re-pair?Trying to re-pair nowROKU TECHAlright. Then set it up again.PUZZLED CONSUMERConnected to Internet, stuck AGAIN on Get the latest software screen. Sob.ROKU TECHIs it stuck?PUZZLED CONSUMERWhat, the button? Nothing happens when I press the OK button. It's as though the TV isn't getting a signal from the remote.i can't go any further than the Get the latest software page, which is the page that comes up after one successfully connects to wifi.ROKU TECHI see, Seems like the remote keeps on disconnecting from the player, Please return that Roku player to Amazon, It is still under their warranty. It should stay connected after reset.PUZZLED CONSUMERokay, but fair warning: my experience will be going up on Amazon reviews. Thanks for trying. Wish Roku could have done better. We have a Roku box that has performed beautifully on a previous TV, but this is pretty unacceptable.ROKU TECHI understand, Roku 3 and streaming stick both uses Wifi-Direct to communicate with the remote, Thing that can cause this issue is interference from your router or its the device it self. And we are really sorry for this inconvenience. Rest assured that we have this documented on your account.", "verified": true, "helpfulness": "2/2", "author": "Borogove"}, {"rating": 5.0, "review": "Alittle slower than my Roku3 but it serves its purpose wonderfully!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Steven Mullins"}, {"rating": 4.0, "review": "the remote is terrible but the stick works great", "verified": true, "helpfulness": "0/0", "author": "Lacey_P \"Lacey Pagel\""}, {"rating": 2.0, "review": "It's was ok , really wish I would have got the Apple TV or at least the most current of program", "verified": true, "helpfulness": "0/0", "author": "allissa"}]