[{"rating": 1.0, "review": "What a rip-off! I bough this because I didn't want to waste loads of money on cable TV. Turns out that you can't use 9/10 channels without already having cable or paying an outrageous monthly fee. I'm returning this useless money-sucking marketing device. I am one very unhappy customer.", "verified": true, "helpfulness": "0/2", "author": "Mr. T"}, {"rating": 5.0, "review": "Works wonderfully better than the device, in addition to be a \"space saver\".  It's faster than my old ROKU device and I absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Sherron Lee Roberts"}, {"rating": 5.0, "review": "We love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Sheri Hyatt"}, {"rating": 5.0, "review": "Love it. Dropping time warner", "verified": true, "helpfulness": "0/0", "author": "kevin swallow"}, {"rating": 4.0, "review": "Better than the Fire. ...", "verified": true, "helpfulness": "0/0", "author": "Revondolyn DuBois"}, {"rating": 5.0, "review": "This has been a fantastic unit....  doing every thing I had hope for.", "verified": false, "helpfulness": "0/0", "author": "@JamieJournalism"}, {"rating": 5.0, "review": "Works great, used to have the larger version and this does the same and more. Love the gaiam and youtube options. Only complaint is the remote is less responsive than the last one and didn't automatically pair, but setup took less than 10 mins", "verified": true, "helpfulness": "0/0", "author": "Alyssa"}, {"rating": 5.0, "review": "I use this in the bedroom since I did not have easy wifi/internet access in there.  I also didn't want to add another box on top of my dresser, so the low profile of the stick was perfect for me.  It's been about a month and it works great.  The download/update time was super fast and it's pretty easy to navigate.  There is also an official app from Roku you can download on your phone which I think is a bit better than the remote.", "verified": true, "helpfulness": "0/0", "author": "Ben B"}, {"rating": 1.0, "review": "This was a great product until it stopped working entirely right when it hit its two months. It had been resetting itself at least every two weeks, irritating and time consuming to say the least. Product reviews show this happens a lot and Roku isn't very supportive.", "verified": false, "helpfulness": "0/0", "author": "SGM"}, {"rating": 5.0, "review": "Fast Shipping.  Gadget worked good. Easy setup. No problems at all.", "verified": true, "helpfulness": "0/0", "author": "tony"}]