[{"rating": 5.0, "review": "I have not had this long, but have enjoyed it very much on those rare days when I have free time to sit and relax.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I ENJOY, ENJOY, ENJOY, You have made a my home a place for entertainment 24/7 It's GREAT TO HAVE YOU ROKU", "verified": true, "helpfulness": "0/0", "author": "Vergie Fay Walker"}, {"rating": 4.0, "review": "Right now.  Stop what you're doing and buy this.  Especially if you're dedicated like I am to never having cable.  You don't need cable, you need this.  4 stars instead of 5 because I would like to see more apps with more content, and be able to arrange the apps on the home screen.  Everything else is great.", "verified": true, "helpfulness": "0/0", "author": "bounce"}, {"rating": 4.0, "review": "The lens hood was stuck,but after hour of effort,I got the filter off. Camera is real complicate but is beginning to work fine.", "verified": true, "helpfulness": "0/0", "author": "william jeu"}, {"rating": 2.0, "review": "Great concept. But the device doesn't work properly. It's too slow, it forgets the wifi network, the navigation is not user friendly.It's not worth more than $30.00.", "verified": true, "helpfulness": "0/1", "author": "SAMBA  B  SECK"}, {"rating": 5.0, "review": "I love my Roku stick because I left cable tv alone and now I'm able to stream movies and tv shows commercial-free and for a cheaper price. What's not to love about that.", "verified": true, "helpfulness": "0/0", "author": "Vicki Flannel"}, {"rating": 5.0, "review": "I have a few ROKU's now and this is really portable. You can take this to any TV without a lot of trouble.", "verified": true, "helpfulness": "0/0", "author": "Ricus"}, {"rating": 4.0, "review": "I love Roku. LOVE ROKU. But I couldn't use this stick where I wanted to. That was a bummer.Tech service was nice to work with. But again this stick wouldn't work on my main tv where I didn't want to fish a cord. Bummer.", "verified": true, "helpfulness": "0/0", "author": "jetladuke"}, {"rating": 5.0, "review": "Product works as described and easy transaction. Roku is awesome, the only thing that confused me was that there is a power cord, from the picture it looks like to plugs directly into the TV's USB port.", "verified": true, "helpfulness": "0/0", "author": "C Hopkins"}, {"rating": 5.0, "review": "My son has one and I was thinking about getting the Google one and he told me all that the Roku does and has a remote.  So I went for it and I am very happy with it.  Quick to set up and perfect quality .", "verified": true, "helpfulness": "0/0", "author": "Joyce M Hammons"}]