[{"rating": 1.0, "review": "Bought it based on a promotion for 3 months of free Hulu (still up on their blog).  That is simply not the case and I have yet to hear back from Roku's customer service.", "verified": true, "helpfulness": "0/0", "author": "James E Hudson"}, {"rating": 5.0, "review": "Works just as good as my brothers new HD TV!", "verified": true, "helpfulness": "0/0", "author": "Don O'Keefe"}, {"rating": 2.0, "review": "Set up was difficult. We returned and purchased an Amazon Fire Stick. It worked better for us and set up was a breeze.", "verified": true, "helpfulness": "1/1", "author": "Deidre B."}, {"rating": 1.0, "review": "Purchased this stick several months ago from another supplier. Worked great until recently. Tried a number of resets but all I got was a purple sceen with no video, only audio. Based on that result I can only say that this stick sucks. Called the company and could not help me.", "verified": false, "helpfulness": "0/0", "author": "Big Ben"}, {"rating": 5.0, "review": "I had the original Roku box before purchasing the stick and it has been a very nice upgrade. The fact that I can now finally stream YouTube on my TV makes it all worth it.", "verified": true, "helpfulness": "0/0", "author": "Seren"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "I have a few different roku devices from different years, I do love the divice over all. I just wish the software or whatever is developed to be more fast. but other than that, this is a great little device to plug right into my MHL slot on my LED tv. yay!", "verified": true, "helpfulness": "0/0", "author": "Eva"}, {"rating": 5.0, "review": "We love our Roku and we now love our new Roku stick. More channels and apps than anyone else in the game.", "verified": true, "helpfulness": "0/0", "author": "C. M. Hess \"Hesstro\""}, {"rating": 5.0, "review": "Between this and Netflix, we can watch anything we want. I bought it specifically for HBO Go.", "verified": true, "helpfulness": "0/0", "author": "A media junkie"}, {"rating": 5.0, "review": "OMG, why did I wait so long to buy this technology!", "verified": true, "helpfulness": "0/0", "author": "sac_tony"}]