[{"rating": 5.0, "review": "Surprisingly I can Chromecast to the stick - both You Tube and Netflix - so you can use a computer/hand held to search for content and start the program rather than the Roku interface - then usae the remote to control playback. Having a remote makes it easier to use than  Chrome stick that requires logging inti a phone or other compatible device to pause/restart etc.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Prime4Life\""}, {"rating": 5.0, "review": "GOODBYE CABLE! !!!!!I signed up for Huluplus and Netflix and I can see almost all of my favorite programs current season episodes the day after they air on tv. I also bought a digital tv antena for my local stations.I use to pay 150 a month for time warner cable and Internet and now....I pay 42 for internetservice and hulu and netflix subscriptions.The Roku streaming stick works great. Twice in a month it froze up but I just unplugged it and it worked fine.", "verified": true, "helpfulness": "1/1", "author": "Jim Sargent"}, {"rating": 4.0, "review": "good product, easy to use", "verified": true, "helpfulness": "0/0", "author": "Máximo Sánchez"}, {"rating": 4.0, "review": "Got this for when I travel for work.  Its incredibly slow (low-end processor), but once its up and running, plays video like a champ.", "verified": true, "helpfulness": "0/0", "author": "Kristian D. Guntzelman"}, {"rating": 5.0, "review": "I've had my Roku for about a month now.  I bought it so I can \"cut the cord\" and get rid of cable, though I haven't done it yet.  If your plan is to drop cable, it is a good option; I figure I will get about 80-90% of the programming I want for about 30% of the monthly cost (Netflix, Hulu and Amazon Prime give me almost everything I want to watch, buying the handful of cable shows I watch that I can't get free on these services will get me most of the rest).  If you want to buy it to supplement cable or FIOS, it makes your online streaming programming so easy to use that it is more than worth the cost.I have been happy with the ease of use.  The remote interface is easy and very intuitive to use.  I have the Streaming Stick in my bedroom, and I got the Roku 3 for my living room TV later because I liked the Stick so much (I had been leaning towards getting the Amazon Fire TV, but my experience with the Roku stick changed my mind).  Both the Stick and Roku 3 are quite small and unobtrusive, though, the stick is just so much more compact since it plugs into your HDMI slot, you plug in the power cord, and it takes absolutely no space on your TV stand.Picture is good, sound is good, not much to say there.  No complaints about streaming speed, it works as well as my cable (maybe better since I often have my cable temporarily die out on me).  The only complaint is Netflix loads up fairly slowly, but since it is the only app which is so slow I think that has more to do with Netflix than Roku.I love it so much, and it is user friendly enough, that I will be buying one for my 70 year old father for Chanukah along with a Major League Baseball TV subscription so he can use his Amazon Prime subscription on TV and also see all of the Pirates games next season.I will update this review in a few months after I've had the Roku devices longer (and I did pre-order the Amazon Fire TV Stick when it was available for $19 for Amazon Prime members so I will also be able to do a comparison then).", "verified": true, "helpfulness": "2/3", "author": "Jeff"}, {"rating": 3.0, "review": "Does not work as Roku says it does. All lame channels and if you want to watch anything decent you have to pay for it", "verified": true, "helpfulness": "0/2", "author": "metalman69"}, {"rating": 4.0, "review": "Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "BVM \"BVM\""}, {"rating": 4.0, "review": "I take away one star because there is a small lag between remote and roku stick.  The setup was easy.  worked great for the kitchen tv.  my current roku channels populated themselves.  I just had to log in to each on the new device.  I didn't realize that you need to power the roku stick.  It comes with a usb cord and ac adapter.  Worked out for me in as my ac was close and my tv didn't have an usb port as newer tvs seem to have.", "verified": true, "helpfulness": "0/0", "author": "old_tech"}, {"rating": 5.0, "review": "One of the few gadgets that performed very well.", "verified": true, "helpfulness": "0/0", "author": "VSMa \"pawisngtren\""}, {"rating": 5.0, "review": "Second Roku used for bedroom and travel.", "verified": true, "helpfulness": "0/0", "author": "IroniesInTheFire"}]