[{"rating": 5.0, "review": "just what the dr ordered", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Roku!", "verified": true, "helpfulness": "0/0", "author": "cheyenne"}, {"rating": 3.0, "review": "Just O.K.  Bad fast forward and backward.  Have too press a lot of buttons to search.", "verified": true, "helpfulness": "0/0", "author": "Terrance M Morrissey"}, {"rating": 5.0, "review": "This is our 2nd refurb unit and both are working as good as new", "verified": true, "helpfulness": "0/0", "author": "Becky B."}, {"rating": 4.0, "review": "Didn't think I would like this after using Apple TV but it works well.  My only complaint is the UI... Not as polished as the apple TV but it does allow adding of channels as you can find them.", "verified": true, "helpfulness": "0/0", "author": "Timothy Hillhouse \"Mountainshack\""}, {"rating": 2.0, "review": "Biggest POS I've ever gotten off of Amazon. I have Roku 3 and love it but after having two of these sent to me and each will pair with the remote then disconnect for no reason, I would never by one again.", "verified": true, "helpfulness": "0/0", "author": "JustMe"}, {"rating": 4.0, "review": "does job", "verified": true, "helpfulness": "0/0", "author": "donna hawks"}, {"rating": 4.0, "review": "Works well easy to use very happy", "verified": true, "helpfulness": "0/0", "author": "Russell Chenard"}, {"rating": 1.0, "review": "Still not working well.", "verified": true, "helpfulness": "0/0", "author": "kim"}, {"rating": 4.0, "review": "Well, its much cheaper than my local satellite providers monthly bill.  You're not going to be able to get your favorite channels live of course and some of the programs have ads.  However, those that do have ads are approx. a minute, more or less.  Big deal.  Its still better than 5, 6, or 7 minute ads four times within 30 minutes.  Most of the present TV programs are just mind dumbing so I don't miss them at all.  There is plenty of good content available with Roku.  Sports, travel, cooking, movies.  If you want to spend .99 cents you can bypass the ads or for a couple of bucks a month you can access your favorite shows.", "verified": true, "helpfulness": "0/0", "author": "Maddawg"}]