[{"rating": 3.0, "review": "The only issue I have with the device is that it's too wide at the sides, thus not able to use the HDMI port below it. A better design would be to make it thicker or longer if necessary. The current solution would be a TV with more space between the ports, but that's not a practical option.New issue: The stick does get hot and not sure of the cause, but connection to the services is sporadic and seems to be getting worse. I have it connected to the usb port so it's often necessary to turn off the TV to reboot and get a clean connection. Since I haven't seen any reviews with the same problem, I am assuming it's a local one or a flaw in the device  My Sony device tells me exactly what speeds I am connecting with, but this Roku doesn't. According to the reviews, tech support tends to blame speed, but once I get a clean connection, it's not an issue, soo, I 'm kind of at a loss.", "verified": true, "helpfulness": "0/0", "author": "BG"}, {"rating": 5.0, "review": "I was looking at buying the Chromecast and found the Roku SS while reading the Chromecast reviews on Amazon. I had no previous experience with streaming devices other than using the Netflix app on my blu-ray player. The Roku SS reviews just seemed more favorable than the CC ones. The Roku stick took all of a couple minutes to set up and it works flawlessly! Network access is solid with no lags and the channel choices are unbelievable! Yes, some you do have to pay for; but most of them are free. Thank you Roku for the great device! Don't think about it, just buy one! You won't be disappointed!", "verified": true, "helpfulness": "0/0", "author": "J. M. Piranio"}, {"rating": 4.0, "review": "None of the product shots reflect the fact that you MUST have a USB cable plugged in to give the unit power.  It would be nice if it were just plugged into an HDMI slot and ready to go.  It is really mis represented in photos because you have to have the supplied USB cable plugged into the end opposite the HDMI.  Many USB ports on TVs are not powerful enough so you have to plug it into a power outlet.  Once sorted out it works great but it is a little slow in response to the remote, but likely because it is plugged into the rear HDMI port of the TV and doesn't have good line of sight.", "verified": true, "helpfulness": "0/0", "author": "Brian Goulet"}, {"rating": 3.0, "review": "The good: Wifi remote is a good idea.  The bad: Often has a serious lag.The good: Pretty fast once up and running.  The bad: Long wait for Netflix to load.The good: Shouldn't need and HDMI cable.  The bad: I plugged it into the HDMI input on the back of my A/V receiver and it was erratic  to the point of being unusable despite a Wifi signal of \"good\" and an Apple TV in the port right next to it and working just fine.  I had to buy an HDMI extension cable to move the stick away from the rest of the electronics.  Then it worked fine.The good: Easy to add subtitles to Netflix (actually much easier than the Apple TV which is very clunky with this).  Also, Netflix has setting on the stick that can keep subtitles off, but show them just in response to hitting the \"back up a few seconds\" button.  Very nice feature!  The bad: Can't find any way to get subtitles with HBO Go.  I haven't tried yet with other channels.  I hope they remedy this in a future update.", "verified": true, "helpfulness": "0/0", "author": "EBO"}, {"rating": 2.0, "review": "I got this Streaming Stick to work fine on a Vizo TV, but could not get it to respond to the remote on a larger and more advanced Sharp TV.  I got a replacement unit from Roku, and the same thing happened.  I talked with a Roku technician and he thought that possibly the Sharp TV was producing  a frequency that was interfering with signal between the remote and the Streaming Stick.  We are still trying to solve the problem.", "verified": true, "helpfulness": "2/3", "author": "Peter Letchworth"}, {"rating": 5.0, "review": "This is my 4th Roku product. Was very easy to install and set up. Streaming is excellent. I'm using the USB port on my Samsung 32\" T.V. to power the Roku. The only con is turning off the T.V. powers down the USB and the Roku has to reboot upon power up. Streaming Netflix, Amazon Prime, PlayOn and more.", "verified": true, "helpfulness": "0/0", "author": "Turk85"}, {"rating": 4.0, "review": "Does exactly what it claims to.Without adding yet another set to box and wires to your setup.Good value for the price.", "verified": false, "helpfulness": "0/0", "author": "AMM \"adrian_m\""}, {"rating": 5.0, "review": "Everything I love about roku in an invisible tiny package.  Its powered by the USB port on my TV, so it doesn't even need a plug! The rf remote is bulky but works great. Love it!", "verified": true, "helpfulness": "0/0", "author": "Josh T. Nite"}, {"rating": 4.0, "review": "Works beautifully and has a great form factor -- it's very small and simply hides behind the TV.  The only reason I'm giving it 4 stars instead of 5 is that I was surprised that it had a separate power supply.  It's a nuisance to have a small wire which must go to a wall plug.  Doesn't an HDMI port supply power?", "verified": true, "helpfulness": "0/1", "author": "William I. Kipp \"Bill\""}, {"rating": 2.0, "review": "I live outside of USA. I have Netflix by cable on my Tv and by wi-fi on my laptop. But I needed the Netflix connection by wi-fi in other Tv sets. It didn't work", "verified": true, "helpfulness": "1/1", "author": "Hugo Arce"}]