[{"rating": 4.0, "review": "The thing worked fine and is currently providing all that I ever needs!!", "verified": true, "helpfulness": "0/0", "author": "khw177"}, {"rating": 5.0, "review": "Fantastic! An EXCELLENT product was shipped promptly and arrived quickly, a fabulous purchasing experience! Thank you", "verified": true, "helpfulness": "0/0", "author": "karren kissel"}, {"rating": 5.0, "review": "Love this ROKU!  Easy install, easy pairing of remote with the stick and all the same great channels!", "verified": true, "helpfulness": "0/0", "author": "Lorna McLaughlin"}, {"rating": 5.0, "review": "Works great.  A little slow at times but I guess that could be our Internet connection.  Work great with Sling TV.  High Def pictures look great.", "verified": false, "helpfulness": "0/0", "author": "DaveK"}, {"rating": 5.0, "review": "Shipped quickly very easy to install.  Love it 1", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The roku is great! I use it primarily for Amazon prime videos and Netflix. If you have a cable subscription you can link a lot of channels to watch shows \"on demand\" with the roku. The only issue I've had is that the streaming stick relies on wifi, and my apparently crappy wireless router drops my connection occasionally, and this interrupts your streaming and makes everything stop. Not roku's fault, but something to be aware of. You can download an app to your smart phone to use as an additional roku remote which is helpful.", "verified": true, "helpfulness": "0/0", "author": "Megan"}, {"rating": 5.0, "review": "easy install, streams great, i have 3 of them, no complaints", "verified": true, "helpfulness": "0/0", "author": "Evette Plata \"evette plata\""}, {"rating": 4.0, "review": "Streaming TV is amazing.  Buy this.  It does take a little bit to warm up at times.  I may trade in for the full sized version.", "verified": true, "helpfulness": "0/0", "author": "Marc Falcone"}, {"rating": 2.0, "review": "I had wrong TV", "verified": true, "helpfulness": "0/1", "author": "Sarah V Brown"}, {"rating": 1.0, "review": "In my home I have a roku stick, an amazon fire box, and chromecast. The roku stick is my least favorite of the 3. It freezes up a lot and takes a long time just to load the images for the different titles available. My amazon box loads the same information immediately using the same internet connection. When I scroll through the menu on the roku stick there is a 1 or 2 second delay every time I push a button, which gets really frustrating. The roku stick can only play 2 or 3 consecutive episodes before freezing up. I would never use the roku stick in my living room because it would be too embarrassing when company comes over. I keep it in the guest bedroom because it's rarely used. If you're thinking of buying one of these, don't do it. Chromecast or Amazon fire box are much, much better options.", "verified": false, "helpfulness": "13/13", "author": "dundre"}]