[{"rating": 2.0, "review": "maybe just me, but i found the roku interface a little annoying and clunky.  Response times could have been a little faster and the remove-to-receiver sensitivity was a bit lacking.  Very frustrating to have to overly \"aim\" to have a button press executed properly.I returned for an appleTV, which has much better functionality, responsiveness, especially for MLB.TV app (99% of my usage).appleTv 's mlb app allows for very simple inning skips.  I couldn't find simple inning skips on roku.", "verified": true, "helpfulness": "1/1", "author": "onetimer \"openmind\""}, {"rating": 1.0, "review": "Absolute garbage. Will not connect despite having the correct wifi password and a full signal. It says it's connected then fails to connect?? I had to go into my router and manually enter the roku ip to allow it to connect. As soon as I turn it off once it won't connect again. Buy anything else.", "verified": true, "helpfulness": "0/1", "author": "Pen Name"}, {"rating": 4.0, "review": "Great product but slow start-up. It takes around three to four minutes to get started. This is my only complaint. Otherwise EXCELLENT product.", "verified": true, "helpfulness": "0/0", "author": "Joshua D Grund"}, {"rating": 4.0, "review": "I'm very happy with this purchase and it does what I wanted and more.  I already owned a smart tv and this just expanded my viewing opportunities big-time......great product for sure.", "verified": true, "helpfulness": "0/1", "author": "David Gould"}, {"rating": 2.0, "review": "I have a Plasma TV and a Smart TV.  The Plasma TV is used in a family room close to my router.  The Smart TV is used in the basement, at a greater distance away from the router.I have a Roku 3, which I have used with the Plasma TV for approximately one year.  Connection time is quick, and reception is excellent on all my Roku channels.Two weeks ago, I purchased a Roku 3500R Streaming Stick to use with the Smart TV.  Although the Smart TV is located in the basement at some distance from the router, connection time is quick, and reception is excellent with all the built-in Smart TV channels (Netflix, Amazon Prime, HBO etc.).  However, I purchased the Roku stick in order to gain access to additional channels not included among the built-in Smart TV channels.  Unlike the excellent reception of Smart TV channels, the reception of Roku channels is extremely poor.  Netflix will connect, but the wait time is lengthy, and there is considerable buffering during play.  Amazon Prime will not connect at all.  That is not a problem, because I can watch Netflix and Amazon Prime as Smart TV channels with quick connection and excellent reception.  However, I purchased the Roku stick to gain access to other channels, available only through Roku, and I cannot access them.I tested my Roku 3 with the Smart TV in the basement, and reception is very good; although, as expected, not as good as with the Plasma TV in the family room, closer to the router.I then tested the Roku stick with my Plasma TV in the family room, and reception of Roku channels was acceptable, though markedly poorer than the reception of those channels using the Roku 3 with the Plasma TV.As a result of these tests, I have concluded that the Roku stick must be far less powerful than the Roku 3.  In any event, the Roku stick is useless to my family.  Since most of our viewing occurs in the family room, we need our best reception there, and so we will continue to use the Roku 3 in the family room.  We also watch television in the basement, but we must rely on the built-in Smart TV channels, rather than the Roku stick.  When we want to view Roku channels that are not built-in Smart TV channels, we must do so in the family room.I hope this review is useful to someone.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Nephi\""}, {"rating": 1.0, "review": "I can access netflix in the Caribbean and I can access Roku BUT I cannot access Netflex  on Roku which is why I bought it.  I can access Netflex on Chromcast or AppleTVSave your money if you don't live in the US buy Chromecast or AppleTV.", "verified": true, "helpfulness": "0/1", "author": "Mary Ann Green"}, {"rating": 2.0, "review": "i cannot watch netflix, it keeps cutting off and quality of picture is very bad i wish i could send it back", "verified": false, "helpfulness": "0/1", "author": "maria norris"}, {"rating": 5.0, "review": "I have this model and the Roku 3, they were both super easy to install! Its so nice to be able to choose the movie or TV shows that are of interest to you without having to channel surf! Amazon Prime allows you to view many free shows too! A great product! Thinking of getting rid of cable now!", "verified": true, "helpfulness": "0/0", "author": "L. Smith"}, {"rating": 5.0, "review": "It isInexpensivepower efficient and  extremely space efficientjust as functional as the more expensive roku models, save for silly games that everyone can already get on their phones.it's a roku. it's tiny. It's a good thing.", "verified": true, "helpfulness": "0/0", "author": "Woo"}, {"rating": 5.0, "review": "I would highly recommended this device. its small enough to hide behind your tv and its fast and very easy to use", "verified": true, "helpfulness": "0/0", "author": "bunnylover"}]