[{"rating": 5.0, "review": "I tried Chromecast and was very disappointed in the limited number of apps. And trying to use my cell or tablet as a remote was iffy. Usually it would work for a few minutes and then the connection between my tablet or cell and Chromecast would disappear and I'd have to sometimes re-install the app on my device. Love the Roku so much more. There are so many apps on the Roku and the streaming quality is excellent. I used to stream Netflix on my Sony Blu-Ray and I'd often drop my WiFi connection every 20 minutes or so. The Roku has been holding connections well since I got it. I can now watch Netflix movies all the way through without a drop (except for a rare occasional drop). Sound and picture are excellent. I plugged the Roku into my surround sound receiver instead of the TV. I like the Roku remote, but usually use my tablet because the Roku app on my iPad has a built in keyboard and I can see it in the dark. I always watch TV with the lights off. Roku should make the icons on it's remote glow in the dark.", "verified": true, "helpfulness": "0/0", "author": "Eddie \"Eddie\""}, {"rating": 1.0, "review": "I've had the old style ROKUs on three televisions for a long time and love them. I found the new stick is incompatible with the Comcast system. After failing to self install the stick I spent a lot of time with the ROKU customer service who said they had a \"work around\".  Instead of their solution crashed my entire network.  Comcast had to come out and completely reset my network.  They said if I tried to have the ROKU stick installed again and it crashed the system again I would have to pay 150.00 (US) for them to come out and reset the network again.  I unplugged the stick, hooked up the older ROKU and was back in business in minutes.  Now I'm stuck with a product that is incompatible with Comcast and is sitting in it's box.", "verified": true, "helpfulness": "0/0", "author": "S. G."}, {"rating": 5.0, "review": "Love my new Roku stick. The format has changed and I am still getting use to it, movie description is rather small for old eyes but other than that I would defiantly referee it to others thinking about it.", "verified": true, "helpfulness": "0/0", "author": "SandyP"}, {"rating": 4.0, "review": "My only surprise/disappointment is that the streaming stick actually needs to be plugged in to a power supply in addition to being plugged into the HDMI jack on the TV.  This wasn't shown in any of the pictures, and I must have overlooked it in the description, because now I have one stray cable hanging from my tv.", "verified": true, "helpfulness": "8/9", "author": "Josh Kusters"}, {"rating": 4.0, "review": "Easy to install and set up. Many programming choices, works well with other devices.  Only drawback is only using the remote to type searches (no keyboard)", "verified": true, "helpfulness": "0/0", "author": "John E. Ashburn \"Golf dude\""}, {"rating": 1.0, "review": "No worth the money if you live outside of the US, most of the attractive channels aren't available. Not recomended", "verified": true, "helpfulness": "1/3", "author": "Ari"}, {"rating": 1.0, "review": "Roku 3 ( 3500X) does not have real search option. It works only on certain predefined sites.For my initial purpose it is useless.", "verified": true, "helpfulness": "1/2", "author": "anatoliy"}, {"rating": 4.0, "review": "It took some time to get it set up correctly and a while to know how to use it and return to my regular TV news channels, etc...  But I'm getting the hang of it.  The only thing that really bothers  me when I'm watching a movie on Netflix is the the volume seems to change in some movies; meaning; I occasionally have to turn it up to hear the voices, or turn it down when the pictured changes to a different scene and becomes overwhelmingly loud.  Other than that, Roku is GREAT!!", "verified": true, "helpfulness": "0/0", "author": "Rick Bradley"}, {"rating": 5.0, "review": "We purchased this for our master bedroom. I love that it simply goes into one of the USB ports in our TV. I will probably buy another one for the family room!", "verified": true, "helpfulness": "0/0", "author": "Kris Jackson"}, {"rating": 5.0, "review": "Great product for the modern LED TV. It allows you to utilize many channels not covered with your local stations like Huhu, the Blaze TV and many others.", "verified": true, "helpfulness": "0/0", "author": "macaroon \"mbdsr\""}]