[{"rating": 4.0, "review": "Works really well even on the other side of the house to the router. Being able to sync with my phone makes searching so much easier.", "verified": true, "helpfulness": "0/0", "author": "Allan R. Mcdermott \"britlad\""}, {"rating": 5.0, "review": "Love this!  We got rid of cable and have not regretted our choice thanks to this little Roku stick.  Easy to use and move to other tv's as needed.  We even took it on a trip to a cabin/hotel and it worked there!", "verified": true, "helpfulness": "0/1", "author": "Bshoffst"}, {"rating": 1.0, "review": "I have purchased two Roku 2s and two Roku 3s. I should have waited longer before I made a second purchase. BEWARE! Roku does not back their warrants. Amazon replaced one 3 at their cost. If you want Roku to respond after business hours, it costs extra as well and you still will probably have no resolution to your problem.", "verified": false, "helpfulness": "1/2", "author": "Gary E.E."}, {"rating": 3.0, "review": "I am just incompletely happy with this, is made for US and I cannot run Netflix app", "verified": false, "helpfulness": "0/0", "author": "Fabian Mora Cyrman"}, {"rating": 4.0, "review": "gave this one to my brother and bough the roku 3  one hookup and thats hdmi", "verified": true, "helpfulness": "0/0", "author": "ronald hendy"}, {"rating": 3.0, "review": "Most channels can't be downloaded outside the US. Besides that, the Roku Streaming Stick works perfectly.", "verified": true, "helpfulness": "0/0", "author": "PD"}, {"rating": 5.0, "review": "Very easy set up, takes less than 10 min. Great product!", "verified": true, "helpfulness": "0/1", "author": "Claire H."}, {"rating": 5.0, "review": "Works great. Easy install.", "verified": true, "helpfulness": "0/0", "author": "Dennis Schumaker \"Shoes\""}, {"rating": 5.0, "review": "We have a B&B; and instead of placing and paying for cable boxes in every room.....we use these.  Our guests have access to HBOgo, and our other subscription channels, but they also get to watch their TV.  This allows them to log into their own Amazon Prime, You Tube, Netflix, BlockBuster, Pandora, and an array of other free channels.  These are awesome, because they let us have TV in anyroom at anytime without paying for a cable box.", "verified": true, "helpfulness": "0/1", "author": "Justagirl \"kimber0711\""}, {"rating": 5.0, "review": "This exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Bob Johns"}]