[{"rating": 4.0, "review": "Great device. I bought refurbished but its as good a s new.", "verified": true, "helpfulness": "0/0", "author": "G"}, {"rating": 5.0, "review": "a+ item", "verified": true, "helpfulness": "0/0", "author": "Brittney Patel"}, {"rating": 5.0, "review": "Great product.  I especially apreciate technical products which are simple to use, offer practical features and turn out better than expected.  Sometimes I wonder, how a such a small $49 device can bring the whole world (almost 1800 channels) to my living room. Perfect for retirees :-)", "verified": true, "helpfulness": "0/0", "author": "Moodus"}, {"rating": 4.0, "review": "My kids can easily navigate through all the features. We use Netflix, Amazon, and Hulu. This was definitely worth leaving cable.", "verified": true, "helpfulness": "0/0", "author": "Duanyelle Woods"}, {"rating": 5.0, "review": "Inexpensive and easy to set up. So far it has met our needs", "verified": true, "helpfulness": "0/0", "author": "Caitlin Pearson"}, {"rating": 5.0, "review": "I am enjoying many new show. I just wish more episodes were available with prime memberships.", "verified": true, "helpfulness": "0/0", "author": "SP"}, {"rating": 5.0, "review": "I already own a Roku 3 for the living room, and I decided I wanted one in the bedroom. Since where the TV is a small space I wanted something simple, without cables, that stayed hidden. This did the trick. It plugs into the HDMI port (and USB for power) and you're off. Just create a account (or sign in) and you're up and running. Very simple to use. I love the Roku experience in such a tiny device.", "verified": true, "helpfulness": "0/0", "author": "Marc B"}, {"rating": 4.0, "review": "good product. works well", "verified": false, "helpfulness": "0/0", "author": "Sabeen"}, {"rating": 5.0, "review": "A very handy item. Got rid of my satellite TV and wanted something so I can just watch streaming TV and this fits the bill. Was easy to install and is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Carla Glasper"}, {"rating": 5.0, "review": "Simple to setup and use.  Love the remote.  Much better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "D. Carlson \"dC\""}]