[{"rating": 5.0, "review": "This is my third Roku but the first as a stick.  Works perfectly for the wall mounted flat screen in my guest bedroom.  It is hard to tell that this was a refurbished product.", "verified": true, "helpfulness": "0/0", "author": "GPSoCal"}, {"rating": 5.0, "review": "so far, so good! We also bought the small connector wire to connect it right in the TV so we don't have to plug it into an outlet.", "verified": true, "helpfulness": "0/0", "author": "Katie Skiver"}, {"rating": 5.0, "review": "Great little product.  But, make sure you have a powered USB connection on the TV if you want to keep it 'hidden' behind the TV.  Otherwise, it has a rather short power cable.", "verified": true, "helpfulness": "0/0", "author": "MYeager"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "patrick weber"}, {"rating": 2.0, "review": "Bought this 1/29/2015. Arrived today (1/31/2015).Plugged in to a Samsung 46\" TV I bought back probably late 2010. Model UN46Bsomething.First starts up, has to update - no worries, that's expected. It updates fine, reboots, takes a while, but again that's to be expected.Add my Prime Video account, no problem.Get to the menu to watch Deadwood, get to s3e9, and POOF...remote loses connectivity.Fire up the Roku app on my Nexus 5, and I can connect...briefly...I make it about 2/3 of the way through the opening credits of Deadwood, and it freezes, then reboots.Tried again, didn't even get that far - freeze, reboot.Plucked it out, hooked the Chromecast up to that very same port, same USB cable - no issues. So it's not the cable, not the port, not the wifi, it's the stick.Googling around there are suggestions that it's a consequence of poor wifi, but uh, no. I won't sidetrack other than to say, this is about 5 feet from an Asus RT-N66U running AsusWRT-Merlin, and the wifi runs like a scalded ape humping a Singer sewing machine. So much so that, again, the Chromecast has no issues.This thing, however, freezes.When I pulled it out to replace with the Chromecast (which, doesn't do Prime Video, because apparently Amazon refuses to allow an Android app for this - is this their way of trying to force people onto the FireStick?), the Roku stick was *hot*. I'm about 30 minutes into a Netflix video on the Chromecast, and the heat is non-existent.I bought this specifically because I was disappointed that Chromecast lacked Prime Video. Rated 2 stars for the time being, with the 2nd only because there's the remote possibility I'm able to diagnose the problem and resolve it (if I do, I'll add a star, if it remains a paperweight, I'll subtract one). I don't know where the blame resides on this one frankly, but I'm at least passably-tech-savvy enough, if I'm having issues with this, someone else will as well - even if it's purely a result of shoddy QA meaning some sticks are fine and some aren't.Of note: I actually have *another* Roku stick that, for at least a while, was offered on Amazon with a small 3M projector. The Roku stick in *that* device never gave me any problems. Of course, that also wasn't HD video, so, who knows.", "verified": true, "helpfulness": "0/0", "author": "Chris H"}, {"rating": 4.0, "review": "I almost gave this product a bad review because apparently we got a dud - the remote stopped working after the first day (no biggie, we just used the phone app instead), then it started losing connectivity and we'd have to reset it every day, then it went into and endless reboot cycle. At this point  I exchanged it and I'm so glad I did!  The replacement Roku Stick works like a charm!  I'm actually considering cancelling my cable service because between Amazon Prime, Netflix, and YouTube, we really haven't been watching much else for the past month.  My only complaint is that there is a little big of lag as the stick loads the various apps. The Pandora app has been very useful for parties and housecleaning,too. I really love that there are no extra wires hanging down from the TV, too!", "verified": true, "helpfulness": "0/0", "author": "Sarah Hoskovec"}, {"rating": 1.0, "review": "Really a bad device. I bought it couple of days back and returning it back. Roku remote hangs all the time and does not respond. I am using my Smartphone Roku app to operate now.", "verified": true, "helpfulness": "0/0", "author": "preeti"}, {"rating": 4.0, "review": "It is OK.", "verified": true, "helpfulness": "0/1", "author": "James Smotherman"}, {"rating": 4.0, "review": "I hated this stick initially and was about to return it- continuously dropping programs, losing high def picture, and losing internet connection. I spent an hour on the phone with comcast and they could not help as the wireless modem and wifi connection on other devices was working fine. Then I came across this article that describes how to change the code on your modem so roku will recognize it. Voila, end of problem. http://www.scottallen.com/2013/04/how-to-fix-a-roku-that-wont-connect-to-the-internet/It worked perfectly. All of the above problems resolved. Now I am afraid I will never leave the couch. The array of programming is incredible.", "verified": true, "helpfulness": "1/1", "author": "reader"}, {"rating": 4.0, "review": "Excellent and so affordable. Chose this over the other sticks due to it having a remote.  Didn't want to be tied to my phone or laptop for another thing and the remote makes life easier.  Only downside is (like the Roku 3 we have downstairs) it does occasionally freeze up and need to be reset.  Unlike the 3, it is a little slow.  However, I LOVE having this in our bedroom and no longer having to go downstairs or watch laptop to stream.SUPER EASY.  HIGHLY RECOMMEND!", "verified": true, "helpfulness": "0/0", "author": "Cool Teacher"}]