[{"rating": 5.0, "review": "My wife and I were tired of paying high cable/sat monthly bills for the few tv programs we watched.  After researching, we opted for installing a digital tv antenna (Mohu Leaf 50) for local channels and buying a Roku to stream movies off of Netflix.  We went from paying $139 per month to $54.  We have a better variety of movies with Netflix @ $9 per month than were offered on the premium channels thru cable, don't have service interruptions and only pay for what we want to watch.  Wish we would have made the change a couple of years ago.  Ordered the Roku from Amazon, one time charge and it was easy to set up.  Goodbye high monthly cable/sat. bills!!", "verified": true, "helpfulness": "0/0", "author": "Packardrat"}, {"rating": 3.0, "review": "Of course, this works just fine as a Roku device, but consider these characteristics before choosing this model:1) Unlike the other models, this one cannot be controlled by a programmable or universal IR remote because it uses it's proprietary wireless remote.  I purchased this as a gift for an elderly woman, and the extra remote is a bit confusing to her.  It can also be controlled by a smart phone or tablet, but that does not solve the problem of creating a single remote.2) It still requires an external power adapter that is provided but not shown in product photographs.Also, for visually challenged users, it can be difficult to navigate the onscreen menus.  This had never occurred to me, This gift goes unused because the recipient cannot navigate the menus using the thumbnail icons and descriptive text.  When I called Roku, they suggested using the TV's \"zoom mode\" to temporarily magnify the screen. The problem with that solution--which is more Samsung's issue not Roku's--is that going into and out of zoom mode requires going through the TV's settings menu using several complicated steps and--yet again--another remote.  I tried reducing the screen resolution from 1080 to 720 thinking it might display fewer but larger icons, but instead it just understandably reduces the resolution of the menu displays.HEY ROKU!!!!  This should be an easy one to solve with the addition of an option that changes the number of items displayed on the control screens.", "verified": true, "helpfulness": "2/2", "author": "Mr. Picky"}, {"rating": 5.0, "review": "Roku 3500R Streaming Stick (HDMI) (2014)  works perfect.I love the Roku for streaming PBS stations and a PLEX server.Also good for Netflix and Amazon.", "verified": true, "helpfulness": "1/1", "author": "Budman"}, {"rating": 4.0, "review": "First, the good stuff. To my knowledge, the Roku 3500R is the least expensive streaming device on the market. Combine that with a huge selection of channels, and you have a real bargain. I got it originally to stream Amazon Prime, which it does admirably—and of course it offers the usual suspects: Netflix, HBOGo, Showtime Anytime, etc, as well as some pleasant surprises such as Acorn TV (British content) and Classical TV. Rhonda Shear even has a channel.Now the drawbacks. Performance is clunky, though I suppose you can't expect a Ferrari with a Chevy price tag. And the graphics are mediocre at best, Roku's designers need to study Apple TV for a lesson on how to manage HDTV screen space. Browsing doesn't have to be an endless slog through a single, seemingly endless line of titles one at a time.", "verified": true, "helpfulness": "1/1", "author": "J. Nielsen"}, {"rating": 3.0, "review": "I cut my cable about four months ago and currently have a Sony BueRay player with streaming hooked up to my LAN, but I wanted to use the WLAN (wi-fi) in another room.  I chose the Roku Stick because \"you just plug it in and start streaming.\"  I read a lot of reviews, and it still wasn't that clear how it hooks up to the TV. We have a wall mount TV with no cords showing, so when I opened the package and saw the AC adapter, I started to worry.  You have to use the AC adapter to power the stick unless you have a USB port.  Luckily I have 3 HDMI ports and 2 USBs on my 2 year old TV so I didn't have to use the AC power.  I had to plug in the USB male/female connection between the Stick and the USB port on my TV.Once you turn on the TV, you go through the basic wi-fi connection setup.  I have the longest, most difficult wi-fi password in the world, so I was pretty glad that it saved it during all of my failed attempts to connect.  Each time I tried to connect, it would cycle through \"connect to wi-fi>connect to local network>connect to the internet\" and I would only get the green light for connecting to wi-fi.  I tried the Roku site, forums for Error 014, and firewall troubleshooting.  After two hours, I still could not connect.  I consider myself a novice at reconfiguring router settings, etc.  I can follow directions, but once you get into changing DNS and adding channels, I'm sinking.  I am attributing the difficulty of setup to the awesome security settings of my local network, but since I have done nothing special other than have a secure network and basic antivirus, I wouldn't say I have anything that is more special than any other home network.  Finally I searched Roku Error 014 on YouTube.  A guy named Salud2 shows you how to turn off something called wi-fi PING.  The steps are also on the Roku site as Step 3, but the video was easier to follow and make sure I was doing the right steps.  Long story short, I got it to work.The interface is smooth and easy to use, and it has a \"clicking\" sound that sounds just like the iPad/iPhone keyboards (which I don't really like).  The remote is quick and the app is easy to install and use.  This is much nicer and more professional looking than the Sony player.  There is very little lag between choosing channels and opening the app.  Channel setup from my iPad was quick. If you haven't subscribed to a certain channel (like HBO Go), you can still skip the \"connect my device\" option and view what they have to offer. However, since I realized I only have a 1 device account for Netflix, I can't use it in both TV rooms at the same time.  This doesn't have anything to do with the Roku, but it is something to consider.Overall, I gave it 3 stars because the setup took way too long.  Once connected, you're good to go, but that's 98% of the battle.", "verified": true, "helpfulness": "1/1", "author": "jnoles54"}, {"rating": 5.0, "review": "This works great. I don't have a cable hookup in our guest bedroom and didn't put in a tv. Now I can put one in and just use this.", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "Bought the $99 version first.  Then tried the stick.  Since I don't play games, the stick was fine and less expensive.  Put one on each TV I have in different rooms.  Good selection of movie, tv, channel choices.", "verified": true, "helpfulness": "0/0", "author": "A. Martin"}, {"rating": 5.0, "review": "Great product and love the fact that it's a stick so you never see it and the streaming works very well.", "verified": true, "helpfulness": "1/1", "author": "Nadia Bobbi Chau Stone \"Nadia B C Stone\""}, {"rating": 3.0, "review": "Love the new interface and compactness of the stick. Occasionally though the tv screen blanks on me. Still haven't figured out why.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"shoup004\""}, {"rating": 1.0, "review": "I own one of each Roku. Unlike many of the reviews, I've owned this one for six months. It is SLOW. SLOW to load content. SLOW to respond to commands. You definitely pay for the convenience and cosmetics of cordless. Yes toRoku, No to this version.", "verified": false, "helpfulness": "3/4", "author": "myatuck"}]