[{"rating": 5.0, "review": "The best way to watch TV... NO MORE CABLE !!!  yee haa", "verified": true, "helpfulness": "0/0", "author": "michelle cotey"}, {"rating": 1.0, "review": "Don't waste your money. There are a lot of options for streaming TV, Roku it self is a lot of hype. The streaming stick is worthless, it's unresponsive. Channels take forever to load (if they load at all) My DVR is hooked up to the same TV right next to the Roku with no loading issues, I use a wireless laptop, tablet and phone in the same room. No issues. Roku is junk", "verified": false, "helpfulness": "0/0", "author": "Cat"}, {"rating": 4.0, "review": "No issues.", "verified": true, "helpfulness": "0/0", "author": "Brandi Davis"}, {"rating": 5.0, "review": "love not having tohave cable! this one is great!", "verified": true, "helpfulness": "0/0", "author": "Lily Lawrence"}, {"rating": 5.0, "review": "A+ good product.", "verified": true, "helpfulness": "0/0", "author": "Wesley David"}, {"rating": 4.0, "review": "This has been a lifesaver. Bought it as back up to my Fire TV. The Roku 3500R is now the only streaming media we use, as the Fire TV 'bricked' and Amazon has no advise for me other than urging me to purchase a new one. The stick sometimes slows down while loading menus. But has never failed to get us there.", "verified": true, "helpfulness": "0/0", "author": "Shek M. Jabbie \"software\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "lavender65"}, {"rating": 1.0, "review": "I was so excited about getting the Roku. I have a Google ChromeCast and thought this would be the perfect addition. Unfortunately I had a problem the second week, the remote would not work. Contacted customer service that took almost an hour to get it started again. Now today exactly 1 month since I have it, the screen suddenly turned purple, no picture just sound. I tried resetting and finally got it to the main screen, made my selection and lo and behold - black screen. :(  I don't intend to call customer service every day and will return this ASAP!", "verified": true, "helpfulness": "0/0", "author": "Diannz"}, {"rating": 5.0, "review": "love my rokus. easy streaming and reliable.", "verified": true, "helpfulness": "0/0", "author": "A N"}, {"rating": 5.0, "review": "Had this for about three weeks, and so far no problems. Just as good as the normal roku for sure.", "verified": true, "helpfulness": "0/0", "author": "J. R."}]