[{"rating": 5.0, "review": "We have 2 Roku 3's in my home. We purchased the stick for my parents. After using theirs; I'll be buying one for myself.", "verified": true, "helpfulness": "0/0", "author": "JJT"}, {"rating": 5.0, "review": "updated from google tv works well", "verified": true, "helpfulness": "0/0", "author": "Denise Wells"}, {"rating": 1.0, "review": "The roku stick functions as it should when it works.  The app selection and video players work well on it.  The loading time is a little slow, but that's what you get when buying the stick rather than the larger player with more speed and power.  The reason I am giving a one star is because of the company.  I called to get some help on my stick because it was resetting constantly.  I was immediately given a sales pitch to buy the extended warranty because I am a \"premium\" customer.  It was $19.99.  The guy on the phone wouldn't help me unless I paid this or a one time $10 fee for his service.  All of this because my warranty was out by 18 days.  I paid it, because it was cheaper than buying another streaming device.  Once I paid he then helped me.  And by doing something minor that I wouldn't have thought of, he fixed it.  All this is to say, if you are fine with paying $20 for customer service for the next 2 years then do so, otherwise I feel like I would go with another company with better ethics and customer service.", "verified": true, "helpfulness": "0/0", "author": "Nick Bigham"}, {"rating": 5.0, "review": "Love my Roku stick! I rarely watch regular tv anymore.", "verified": true, "helpfulness": "0/0", "author": "Heidi Cowley"}, {"rating": 5.0, "review": "Love this item.  Netflix works great as well as Pandora", "verified": true, "helpfulness": "0/0", "author": "michael owings"}, {"rating": 2.0, "review": "Pretty easy to start up.  The usb cable did not seat properly in the Roku Stick.  It kept falling out.  We unplugged the whole thing and when we plugged t back in we were  advised that we now has to pay for Netflix. (We had previously signed up for the 30 day free trial and had only had the Roku less than a week.)  Needless to say we returned this item.", "verified": true, "helpfulness": "0/0", "author": "Nancy Godown"}, {"rating": 1.0, "review": "I was ready to buy a Roku Streaming Stick, but after discovering that they DEMAND a credit card just to start the darn thing, I will find another product. Nope, not gonna' happen.", "verified": false, "helpfulness": "1/2", "author": "Jan S. Lautzenheiser"}, {"rating": 5.0, "review": "I received everything 👌", "verified": true, "helpfulness": "0/1", "author": "Denilson Ygor"}, {"rating": 5.0, "review": "exactly as described!", "verified": true, "helpfulness": "0/1", "author": "Katie T."}, {"rating": 4.0, "review": "So far for the  short time i have it , its GREAT!  A lot of free channels  and some games and cool stuff.  ROKU is good...", "verified": true, "helpfulness": "0/1", "author": "R"}]