[{"rating": 1.0, "review": "For the first 14 weeks that I had the Roku Streaming Stick, it was fantastic. Then, come week 15, it stopped working. In an 8 hour span, the stick stopped being able to receive a signal. I've done all of the suggested steps to fix, but nothing works. Looked at the warranty, the maximum is 90 days. I posted on the Roku forum, and someone else said he had the same problem as I did - after much haggling, he finally got someone to send him a new one. I'm not one to haggle, but I will warn the rest of you to be wary of this device and I've learned my lesson with purchasing a Roku product.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I have spent hours online with tech support trying to get it to work right. It gets real annoying when you can't see an entire picture on any source from beginning to end, and it took some more time with tech support to even get to the viewing stage. With all the time wasted getting it to work it would probably be more cost effective to buy a new smart tv.", "verified": true, "helpfulness": "0/1", "author": "H. Garth Beerman"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Matthew Blau"}, {"rating": 1.0, "review": "Bought it in May, worked fine for 3 months, now the remote won't pair with it and just before that happened every movie started buffering.  Now I get no response from it.  POS !  doesn't deserve 1 star.  Only 90 day warranty... beware.", "verified": true, "helpfulness": "1/1", "author": "young"}, {"rating": 3.0, "review": "The OK button constantly doesn't respond while the others are OK. So it's not the problem of signal, instead it's the quality itself that causes the problem", "verified": true, "helpfulness": "0/0", "author": "CECILE"}, {"rating": 3.0, "review": "Difficult to set up.", "verified": true, "helpfulness": "0/1", "author": "John J. Germek II"}, {"rating": 1.0, "review": "I am disappointed with this product. On pressing the netflix button it did not work, got no response. Also when casting photos or video from my Samsung Note 3 via all cast it is extremely slow.I would not recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "Farrell Christopher"}, {"rating": 2.0, "review": "It was GREAT for 4 months, then it stopped staying connected. I look at it as a total waste of money. My 1st generation roku boxes work better than this now. The pictures flashes on and off on the screen. You can't watch anything. VERY unhappy customer.", "verified": false, "helpfulness": "3/4", "author": "Emily"}, {"rating": 5.0, "review": "bought this a a birthday gift for a teenage girl.  they loved it so much they bought a second one.", "verified": true, "helpfulness": "0/0", "author": "S. Austin"}, {"rating": 4.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Marc L Iannatto"}]