[{"rating": 3.0, "review": "Have the Roku 3, but bought this for a new tv. Harder to set up, and does not receive our wifi signal as well as the larger unit. For the little amount we use it, though, I really have no complaints. Bought it mainly because of a ROKU pre-Christmas sale at Amazon.", "verified": true, "helpfulness": "0/0", "author": "George Snell"}, {"rating": 4.0, "review": "It worked great. I would recommend it. I got it to be able to see all of the 3ABN networks channels. They are GREAT!", "verified": true, "helpfulness": "0/0", "author": "Alice Eads"}, {"rating": 3.0, "review": "I live in Latin America and Netflix isn't included in the channels that Roku shows in my country. So I'm a little disappointed by this situation. If I have to talk only about the hardware, it worked OK. Setting it up was easy. It worked OK. The image quality an sound were OK.", "verified": true, "helpfulness": "0/0", "author": "Carlos Herrera"}, {"rating": 5.0, "review": "Added this to a TV in our home gym, nice that it can plug into the TV and not have to have an additional box. makes out wall mount LED TV just that much cleaner, all of our TV's in the house have ROKU's and I love them.", "verified": true, "helpfulness": "0/0", "author": "Kevin Higgins"}, {"rating": 5.0, "review": "I purchased this for my husband.  We have a Roku 2, and two Roku 3's.  We now have Roku's on all of our TV's. It is a little slower that the R3 in response but, overall for the price and size it is fabulous!", "verified": true, "helpfulness": "0/0", "author": "Nonnie"}, {"rating": 4.0, "review": "It does not accept private channel BRT.", "verified": true, "helpfulness": "0/0", "author": "Iosif Matlin"}, {"rating": 5.0, "review": "Roku is awesome.  Ends the need for cable.  Also very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Rebekah N."}, {"rating": 4.0, "review": "I have an older Roku box and this is nice since I don't have to have another power cord.  It does use a USB port on my TV, but that is not a problem for me.  The startup is a little slow if you want to use it right away after turning on the TV. I would give it 5 stars if it had parental controls.", "verified": true, "helpfulness": "0/0", "author": "frequent shopper"}, {"rating": 5.0, "review": "Couldn't be happier with the streaming stick.  All of the functionality of the larger Roku in a much smaller form factor.  The RF remote works great and the picture is great.", "verified": true, "helpfulness": "0/0", "author": "Mason"}, {"rating": 5.0, "review": "LOVE< LOVE LOVE it!", "verified": true, "helpfulness": "0/0", "author": "Traci Calais \"Traci Calais\""}]