[{"rating": 5.0, "review": "My kids are happy and so am I!!!", "verified": true, "helpfulness": "0/0", "author": "NEnewbie"}, {"rating": 5.0, "review": "I now have 2 Roku 3s and this device. I have returned Apple TVs, Chromecast, and Amazon Fire Stick. Nothing works as easily and as smoothly as a Roku. I'll never stray again. :-)Rokus just work. They have the best user interface and jive well with all of my services.", "verified": true, "helpfulness": "0/0", "author": "jagesso"}, {"rating": 3.0, "review": "Worked excellent for a few months. Now isn't connecting to my television at all. I am thinking it had something to do with the HDMI hookup. And not on my television. I have tried several ports and none of them read it. The light is blinking that it is powered and receiving data but not connecting to HDMI component. Awesome in theory but now I am past the 30 day return and stuck with this stick that won't hook up to anything. What a bummer. I really enjoyed it for a few months. Bought in January 2015, it's now April 2015.", "verified": true, "helpfulness": "1/1", "author": "A. Olson"}, {"rating": 2.0, "review": "I was so excited to get this but the micro USB cord is damaged. you have to hold ot or tape it in a certain position for the electricity to make contact. Considering  if I should return or go buy one", "verified": true, "helpfulness": "0/0", "author": "Vanessa Otero"}, {"rating": 1.0, "review": "I hate it.", "verified": true, "helpfulness": "0/1", "author": "Sweetneez \"Lee4956\""}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "j.m.blacklock sr"}, {"rating": 5.0, "review": "So far, so good.", "verified": true, "helpfulness": "0/0", "author": "Sunshine"}, {"rating": 5.0, "review": "was way better than what i thought i was getting very great would tell anyone to buy this", "verified": false, "helpfulness": "0/0", "author": "charlene"}, {"rating": 4.0, "review": "Love it!  But... the batteries wear out quickly because of the ear plug thing, and the sound isn't very good (so why bother?)", "verified": true, "helpfulness": "0/0", "author": "TerriL \"Terri J\""}, {"rating": 5.0, "review": "Easy to set up.  Very reliable.  This is a very good unit.  Perfect for Net Flix or other internet TV.  The remote is easy to use an the device has been very reliable over three months of use.  It is powered with an AC charger that connects to the USB port on the top.  You can get a USB cable to power it via the TV's HDMI port.  Both work equally well.  But when you use the HDMI port for power, the device has to restart whenever you turn the TV on.  Which takes about fifteen seconds.  Better to just plug it into the wall socket using the AC charger cord that comes with it..  I own four ROKU devices, and all work very well and have been simple and reliable to use", "verified": true, "helpfulness": "0/0", "author": "Ian Baines"}]