[{"rating": 5.0, "review": "This was a good price and we really like it!", "verified": true, "helpfulness": "0/0", "author": "Julie Manasco"}, {"rating": 1.0, "review": "Account set up was horrible, among many other issues, the \"Shift\" button was invisible on the virtual keyboard making it nearly impossible to enter in a capitol letter from my account password.Worse still was video quality, video was often grainy and pixalated. I returned this item after struggling with it for a couple of weeks.", "verified": true, "helpfulness": "0/0", "author": "G. Hogan"}, {"rating": 4.0, "review": "I really like the concept of this product, the ease of set-up/use and the options available. I bought refurbished and have had no problems related to that as far as I can tell, but there have been some speed and quality issues. Like other reviews I read, it can be slow, but typically once you get it going it is fine. The most annoying thing is the HD cutting in and out frequently. I have only used it for netfilx and amazon prime so far, so this may not be the case with other streaming channels. It also seems to happen more with TV shows than movies for some reason. I think it is time for an upgrade to my router and internet service, so I need to do that and see if maybe that is part of the slow streaming. For me, this works far better than chromecast, which wasn't set up for amazon, took a while to load and required the use of your computer or smart phone while viewing, thus using twice the technology and ultimately, electricity in your home. Overall, I'm satisfied, but I need to figure out this HD thing to be completely happy. The product did ship very quickly, and all components were included.", "verified": true, "helpfulness": "0/0", "author": "Stephani M."}, {"rating": 4.0, "review": "IT WAS RECEIVED PROMPTLY.  IT WAS NOT AS EASY TO GET IT SET UP AS THE ADS MADE IT SOUND.  IT TOOKNUMEROUS TRIES TO GET IT TO WORK. ALSO IT DOESN'T ALWAYS WORK SMOOTHLY,FREEZING UP ON THE SCREEN,BUT ALL IN ALL,I WOULD RECOMMEND IT.  I WOULD NOT REPLACE MY CABLE WITH IT THOUGH.", "verified": true, "helpfulness": "0/0", "author": "STEVEN A. LYONS"}, {"rating": 4.0, "review": "Great product.  Roku is the way to go on streaming. Greater selection of stations", "verified": true, "helpfulness": "0/0", "author": "M. Jagodowicz"}, {"rating": 1.0, "review": "Bought it and plugged in my Vizio TV and came out saying that there is no signal. Setting this up is a pain and I will not recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Shiv"}, {"rating": 5.0, "review": "I love it, easy set up, works perfect.", "verified": true, "helpfulness": "0/0", "author": "Nelson"}, {"rating": 5.0, "review": "Love Roku!  Refurbished is just as good as new!Edie", "verified": true, "helpfulness": "0/0", "author": "Edith Lott \"Ridgewalker Woman\""}, {"rating": 5.0, "review": "This is my first streaming stick so I don't have much in the way of experience but I can say that it works exactly as advertised. I found set up to be simple, it took less than 10 minutes. Streaming is very reliable with no buffering or excessive load times. The remote isn't the greatest but I use my phone or my iPad usually so its not a problem. Overall, I couldn't be more pleased with it. I would definitely recommend the Roku. Great product.", "verified": true, "helpfulness": "0/0", "author": "Pamela Dagostino"}, {"rating": 5.0, "review": "Easy to install. I just have to call the internet company to get my ssid to finish setting up.", "verified": false, "helpfulness": "0/0", "author": "lindee town"}]