[{"rating": 4.0, "review": "Easy to set-up, easy to use, great content.", "verified": true, "helpfulness": "0/0", "author": "Fozzie"}, {"rating": 4.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "W. Mueller"}, {"rating": 5.0, "review": "Before the Roku I was using a Wi as my platform. Nothing against the Wi but the Roku is faster, the picture is much clearer, the sound is not so muffled, and overall just a better operating and viewing experience. Great price too!", "verified": true, "helpfulness": "0/0", "author": "psandifer"}, {"rating": 1.0, "review": "Rocku not suport nothing out of USA. Even netflix at least in LatAm", "verified": true, "helpfulness": "0/0", "author": "Jorge Adum"}, {"rating": 5.0, "review": "I'll pay this the highest compliment -- I attached it, it works great, and I haven't had to think about it since.", "verified": true, "helpfulness": "0/0", "author": "Citysqwirl"}, {"rating": 2.0, "review": "works sporatically ?", "verified": true, "helpfulness": "1/1", "author": "LOUIS BONO"}, {"rating": 3.0, "review": "I've had problems off and on with this device.  When I've called Roku for customer service, the wait times often are an hour or more.  Tonight I had another problem when the device froze.  I was on hold for about 15 minutes.  When I finally got to the CS rep, he had me unplug the device both from the TV and then the power source.  Next I plugged it in again and it worked.Then he tried to sell me an extended warranty for another $20.  Why should I buy a warranty for a product that should last at least a year I would hope?  I'm angry about this and wonder if Amazon will back this product if it fails again.When it works, I'm very happy with it.  But I don't think I should have to spend another $20 on a warranty when the product is barely two months old!  This seems like a major gyp to me!!", "verified": true, "helpfulness": "2/2", "author": "Debbie Scott"}, {"rating": 2.0, "review": "I already own two Roku 3 boxes for home use and I bought this primarily to do presentations in my office TV as it has mirroring abilities from laptops as well as android and windows phones. However, unlike the Roku 3 which works well, the connection for the Roku stick is often not detected, and keeps getting cut off every few minutes, which is unacceptable.", "verified": true, "helpfulness": "0/0", "author": "ticktiak"}, {"rating": 5.0, "review": "I like it very much", "verified": true, "helpfulness": "0/0", "author": "Joanne"}, {"rating": 5.0, "review": "Love having the streaming stick that can be left in the tv's usb at all times. One less thing sitting on the shelf under the tv.", "verified": true, "helpfulness": "0/0", "author": "J"}]