[{"rating": 5.0, "review": "Does what it is supposed to do and arrived quickly.", "verified": true, "helpfulness": "0/0", "author": "AJA"}, {"rating": 3.0, "review": "I have cut the cable cord in my house and use both Rokus and Chromecasts.  Roku gives you a experience more like using a cable box whereas Chromecast is easier to cast video from the Chrome browser.  Both of them need companion software like Playon, Plex and others and there is a learning curve because none of them are as intuitive or have instructions that are as user friendly as one would expect.  Even the Roku setup requires a learning curve and casting to it using Playon or Plex are glitchy (Fox News, CNBC and other that use their own player especially).", "verified": true, "helpfulness": "2/2", "author": "VinceC"}, {"rating": 4.0, "review": "I already own a Roku3 and like it. I recently installed a Smart TV and was faced with either getting yet another Uverse receiver or a Roku3. After weighing the additional costs for yet another tv I only plan to use nominally, I nixed the add'l receiver and decided to go with another Roku. I went over to Best Buy and picked up the Roku3 when a fairly knowledgeable sales person began asking me some questions about our viewing habits and suggested the stick. It was an easy choice. This was going in our den. I didn't need a headset to stifle noise, I don't play games, the Roku stick accesses the stations I wanted, and would work well with a wall mounted tv. The Roku stick was half the price and I wouldn't be paying for features I wouldn't use or want.I went home and installed the stick myself. O.K. since I spent a lot of years working in IT and installation has become fairly easy. From a viewing standpoint, the image received is as good as Roku3 and just slightly less than my Uverse. This is a non-issue for someone who loves 1080 clarity from a viewing stand point.I get my NetFlix, History Channel, CNN, etc. and am quite happy. The only negative (and why this is product is being downgraded by  a star), is this takes longer to load. I'd describe it as sluggish. This can be irritating at times, but overall the Roku stick is a win/win for me. I like its thin profile. It is really perfect for a wall mount (which we are waiting to do), and the price is very reasonable.I've been 5* happy with the Roku3 and I am 4* happy with the Roku stick so far. My advice is go with Roku3 if you use a tv endlessly because the slower speed may be irritating, but the Roku Stick works well for an infrequently used set.", "verified": false, "helpfulness": "3/3", "author": "G.I Gurdjieff \"gurdjieff\""}, {"rating": 5.0, "review": "I'd heard raves about my friends Roku players but didn't take the leap until this HDMI with remote came out.  This little gizmo is fantastic!It uses my wifi to connect.  It's so nice to watch Netflix and other subscription programs on it.The remote is a fantastic addition that the Chrome Stick did not offer.  It does allow using an Android app as a remote too.Haven't had any problems or issues.Very pleased.", "verified": false, "helpfulness": "0/0", "author": "Joy Lovewell \"Pure Joy!\""}, {"rating": 3.0, "review": "I'm very disappointed that my Roku stick did not function well while connected to the USB port in back of my flat screen TV.  It took forever to boot up every time I turned on the television.  I was forced to plug it into the power strip on the floor leading to an additional wire running from the television which was something I wanted to avoid.  After that, it performed like it should.  I also own a Roku 2 and I think it is a far better product than the stick if you don't mind an additional device on your console table.", "verified": true, "helpfulness": "2/2", "author": "AlphaDog \"hka731\""}, {"rating": 5.0, "review": "I now own two of these.  I cut the cord and now am saving 100 bucks a month!!  I get all the content I could ever watch and I don't miss regular cable at all.  This is easy to set up and use, the online channels are great.  I take this with me on trips (be careful at hotels and their wireless having webpage registration).  Perfect!!", "verified": true, "helpfulness": "0/0", "author": "mnpilot"}, {"rating": 5.0, "review": "Loving it. Glad I went with this rather than the box. It is simple and meets my needs. Never going back to cable.", "verified": false, "helpfulness": "0/0", "author": "Jynxy or Jill, Nomad traveler \"Jynxgirl\""}, {"rating": 4.0, "review": "A hair slow to respond at times but otherwise a fantastic product for the size and price!", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "I ditched cable and only use the Roku now.  Went from $260 month bill to $75.  Never will I ever go back to cable.  Easy to install - just plug it in the TV and the wall...wa-la...done.  Pair your laptop with it - easy peasy.", "verified": true, "helpfulness": "0/0", "author": "bsimeon"}, {"rating": 5.0, "review": "Very nice and simple to use", "verified": true, "helpfulness": "0/0", "author": "Jorge Rotger"}]