[{"rating": 1.0, "review": "Remote quit working the first day. Worked for awhile, then quit. Using my ipad as remote.", "verified": true, "helpfulness": "0/0", "author": "John F Kearney"}, {"rating": 5.0, "review": "got this for travel... great", "verified": true, "helpfulness": "0/0", "author": "linda"}, {"rating": 5.0, "review": "Great way to avoid cable! Some many great channels. I love this product!!", "verified": true, "helpfulness": "0/0", "author": "D. M."}, {"rating": 1.0, "review": "Roku has not worked for me at all.  When I purchased it I wasn't told that certain cable carriers would prevent the Roku from working.  I am returning it.  I will buy a different streamer.", "verified": true, "helpfulness": "0/0", "author": "Laurelle Labrecque"}, {"rating": 1.0, "review": "The remote does not work", "verified": true, "helpfulness": "0/0", "author": "Rhiannon P Rosso"}, {"rating": 1.0, "review": "Pls be aware this item has 90 day hardware warranty only. After less than 6 months of use, the remote of 1 of the Roku sticks I brought has gone bad and does not work. I have not dropped the remote or anything. The device is so useless without the remote. I am forced to use the Roku app on my smartphone for the remote function but this is not as good as I have to look on the screen to operate the remote. The original remote provided with the device is much better to use compared to the smartphone app.", "verified": true, "helpfulness": "0/0", "author": "Rahul Punjabi"}, {"rating": 3.0, "review": "Sent first one back for defective remote.  Can't get geared up on the programming, though.  You have to pay extra for what you want to watch, and some stuff is just one long advertisement.  Like most tv programming, as an afterthought.", "verified": true, "helpfulness": "0/0", "author": "Bill Moore"}, {"rating": 2.0, "review": "I LOVE my Roku 3 and have never had a single problem with it, so bough this stick for a TV that I didn't need a big fancy remote for.  Well, it doesn't work. I spent an hour on support with Roku to try and get it running.  Evidently I need to now buy a new router/modem because there is a known issue with this streaming stick and the Xfinity Arris router/modem.  The fact this is a known issue (according to tech support) and for some reason was introduced to this particular product (again, my Roku 3 has no issues) just frustrates me.  I'd give it a one star for being a complete hunk-of-junk, except I know for a fact that Roku is awesome when it works.  If you have Xfinity, skip this.  Go with a Roku 3.", "verified": true, "helpfulness": "0/0", "author": "eyduck"}, {"rating": 5.0, "review": "Love it much better then the Original ROKU/ this one actual turns off when the TV goes off.( or so it seems)", "verified": true, "helpfulness": "0/0", "author": "Audrey B."}, {"rating": 2.0, "review": "I bought this to take the place of my Xbox one. It worked fine for about 2 hours till the remote stopped working. I tried every trick in the book and now I'm stuck using a App remote on my iPhone. It works fine but it's a little disappointing that I had to resort to using an app.Other than that the roku apps stream faster and look better than they did on my Xbox one for some reason.", "verified": true, "helpfulness": "0/0", "author": "michael r dahl"}]