[{"rating": 5.0, "review": "I am thoroughly enjoying my steaming stick. I had been told about it but did not take the opportunity of purchasing not only one but two. Should have done sooner. Thanks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great. No complaints. Came on time.", "verified": true, "helpfulness": "0/0", "author": "Mastiff's"}, {"rating": 5.0, "review": "We have one of these for our living room TV and it impressed our grandparents so we ordered one for them too. They are in their 90s and seem to be doing okay with it.", "verified": true, "helpfulness": "0/0", "author": "azmidiman"}, {"rating": 1.0, "review": "This product has so many glitches!  It will freeze or the volume will stop working at least once a day.  I am tired of having to unplug and reset the roku streaming stick.  I wish I had just bought the box because this product is horrible!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Easy setup with many nice functions.  Great product!", "verified": true, "helpfulness": "0/0", "author": "Robert J. Evers"}, {"rating": 5.0, "review": "I am slowly whittling down my cable bill.  I'm not ready to cut the cord yet, but this device is going to help.  I paid less than $30 for this (refurbished). My cable box is $11 a month. So, in less than three months it will have paid for itself.The Roku Streaming stick is a great way to connect to all your services like Hulu Plus, Amazon Instant Video (part of Amazon Prime), Netflix, etc.  The advantages it has over my Apple TV (and it makes me sad to say this) is I can run Time Warner's app on it and I can run Amazon Instant Video on it.Installation was a snap.  At first I guess I didn't have it plugged securely enough into the HDMI port and nothing was showing up on my screen, but I disconnected and reconnected it and voila!  It takes a credit card to set up an account with Roku.  No big deal, but something you should be aware of.  Then, it was a matter of adding the \"channels\" I wanted (like Netflix, Amazon Prime, Watch ESPN, etc) and I was off and running.  One pain (and this isn't Roku's fault) is it took several minutes to sign into Time Warner, Amazon Prime, Netflix, etc.  Hopefully, this is a one time thing.The interface is decent.  It would take some time to get used to Time Warner's App to tune into my television programs, but this is for a secondary TV. Since it doesn't have the capability to record shows, it won't replace my DVR.  What I really like is I can search for an artist or movie and it will show me all the ways I can get that movie (Amazon Instant Video or MGo or whatever).  It searches across all of your services/channels. So, for example, I wanted to know if the TV show \"Being Mary Jane\" was available and I searched for it and it showed me it was on Netflix.  This could be quite handy rather than having to search each individual source for programming or a movie.Another thing I love is there is a free app for my iOS (iPad and iPhone) that controls the Roku so if I lose the remote (which I almost surely will), I can control it from my phone.  That was even easier to pair than pairing the Roku remote to the Roku Streaming Stick.  Once my iPad was on the network and the Roku app downloaded, BAM!  there was the Roku Streaming Stick ready for pairing.Apple better step up their game.  I'm an Apple fanboy and have Apple TV, iPad, iPhone, iMac, etc.  Roku is superior to the Apple TV in every way I can think of except- streaming my photos and music from iTunes.  Oh and I just found out I cannot AirPlay iTunes movies to it.  But, I got it for about ¼ the price of a new Apple TV.  Even new it's half the price of an Apple TV.", "verified": false, "helpfulness": "0/0", "author": "Brian Smith \"Tough But Fair\""}, {"rating": 3.0, "review": "The majority of the channels and programs offered cost additional money, similar to Netflix and Hulu...and it's a pain to use the remote to enter any text, such as search terms, log-in info, etc.", "verified": true, "helpfulness": "0/0", "author": "Jesse Lattig"}, {"rating": 3.0, "review": "The roku came in great but the netflix and spottily channel are very wonky requiring the stick to to be taken out and reset frequently", "verified": true, "helpfulness": "0/0", "author": "mary"}, {"rating": 1.0, "review": "First cost is doubled by the one time activation fee; then you cannot get real time local news unless you live in Dallas, Raleigh, Seattle, NYC or Madison, WI....and forget watching a movie on one of the \"free channels\": we saw the same advertisement for the Windows Surface Pro I don't know how many times: the only reason I wouldn't flush this thing down my toilet is that it would probably clog it up.", "verified": false, "helpfulness": "0/1", "author": "Theodore Smith \"Born Again Skeptic\""}, {"rating": 5.0, "review": "Great little gizmo for the price.", "verified": true, "helpfulness": "0/0", "author": "Erich Schmidt"}]