[{"rating": 5.0, "review": "I bought this about three months back and I haven't had any majoy complaints. My only suggestion would be to not to use the USB slot in the back of your TV to power the device, it doesn't seem to get enough power that way and malfunctioned a lot. I now have it plugged into the wall and it is working like a charm.Great for people of all ages, my 60 year old mother uses it and loves it along with my little nice.", "verified": true, "helpfulness": "0/0", "author": "jean stevens"}, {"rating": 5.0, "review": "I bought this Roku to replace a much earlier vintage Roku that couldn't handle some of the newer Roku channel offerings. This unit is great! All the smarts are in a thumb drive that plugs into an HDMI slot on the back of the TV. Counter space isn't need for a box next to the TV because the remote doesn't use an infrared line -of-sight connection to control the unit. Very easy to set-up. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "value hunter"}, {"rating": 5.0, "review": "Very good product! I had some difficulties setting Roku up due to my internet connection in my home. After the connectivity issue was resolved I found this product to work wonderfully!", "verified": true, "helpfulness": "0/0", "author": "Kindle Custom"}, {"rating": 5.0, "review": "My first Roku.  I love it!  I'm trying to decide which I like best, Chromecast or Roku.  Both are great.", "verified": true, "helpfulness": "0/0", "author": "mje"}, {"rating": 5.0, "review": "As described", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Total piece of garbage.  We loved our Roku 2 and our Roku 3 but the stick is JUNK.  It is flimsy and unresponsive.  Had to push the buttons ten times to get it to respond and had to stand at different angles, etc.  Then it just stopped working entirely.  Really bad product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This is a good device, but mine quit working after 41 days. I finally got through to customer service where they walking me through repairing my remote. Now everything is good, but there is a hidden pairing button behind the battery cover you get no information about until this happens. I thanked support and we'll see how it goes, but a simple manual would have saved two weeks of hassle and ordering a Firestick as a replacement, which unfortunately is already here. I will update after I try the firestick. Bottom line: This is a decent streaming device with some hiccups and a lack of set up knowledge. I do hear humming from my bedroom tv Roku stick. The living room one is plugged into my receiver and sounds fine. I wish I would've done more research on this product, but overall it was a good buy. On the fence if I'd buy another one though, I had a handful of problems the first few weeks. I got this for the remote shortcuts to my streaming apps. For that I would recommend, if you have the $ I'd look for a box device. The sticks are NOT made for nonstop use. If it weren't for the remote pairing issue I would have rated 4 stars.", "verified": true, "helpfulness": "0/0", "author": "TomDaBomb"}, {"rating": 3.0, "review": "I'm a big fan of the Roku 3, its fast and has a ton of channels and is easy to program custom channels for.  I have the Roku 3 installed in my bedroom, and have the even faster and more powerful Fire TV installed in my living room.  I also had a Chromecast in the living room, which I hardly ever used, but hey it was cheap.  The Chromecast was plugged into the TV's one USB port, which doesn't give power when the TV is turned off, but it was no big deal since the Chromecast is so simple and boots so quickly.  So I got this Roku Streaming Stick to replace the Chromecast.  It has enough of the few Chromecast features I actually use sometimes (Youtube casting and Google Play movies) and adds several channels I can't currently get on Fire TV.  I didn't want a second bulky hockey puck (Roku 3) in the living room next to the FireTV, and the more modest price of the Roku Streaming Stick was nice.I installed the Roku Stick and set it up, updated software a couple of times, and noticed right away that the device takes an eternity to boot, and then several taps of the remote buttons before they start to register.  This was going to be a problem any time I wanted to turn the TV on and go straight to the Roku, since it would have to boot up first.  So I remembered that the FireTV has this essentially useless USB port on the back, so I figured it was worth a shot.  And it worked, the Roku Stick was able to draw power from the FireTV, which stays on all the time while you turn the TV on and off.  So now I didn't ever have to wait on the Roku to boot.  I thought I was clever.The interface of the Roku Streaming Stick is pretty much the same as my Roku 3, with all the same channels.  However the hardware is clearly much less powerful, as the interface was very laggy and responsiveness to pressing buttons on the remote was very slow.  The device also randomly rebooted on me a couple of times while streaming video, although this only happened when I was running the SlingTV channel, which is admittedly still in beta and has only just been made available on the Roku Streaming Stick (had it on Roku 3 for a couple weeks).After reading a few reviews here what I picked up on is that this device, for whatever reason, works better plugged into the included AC power adapter.  So I dug the power strip out from behind the TV and plugged in the adapter and connected the USB cable and booted up the Roku Stick again.  Bootup was not really any faster but the responsiveness of the device and interface overall is MUCH improved.  Not up to Roku 3 performance levels but certainly acceptable.  Even switching channels in SlingTV app was noticeably better.  The moral of the story is to plug this thing into the AC adapter if at all possible.  I don't know if the crashes/reboots are fully resolved, since I didn't have too many to begin with, but have not noticed any more of them so far on AC power.Once streaming is started the device does 1080p full HD video just fine with no lag or performance issues, so in this respect it is the equal of the Roku 3 and FireTV.  It has no issues with WiFi network performance on my Wireless N home network.  It gets pretty warm whether on USB or AC power, but so did the Chromecast.  The remote goes to sleep apparently and needs to wake up before it starts responding to button presses.  This is a little annoying, and I've never noticed this to be the case on the Roku 3 remote, so I don't really understand why it has to be this way with the Roku Streaming Stick remote.  However this device works with the Roku Android app just like the Roku 3 does, so that's one alternative to having another remote laying around.Overal I'm quite pleased with the Roku Streaming Stick as a solution to augment my living room TV.  For the things I can get on FireTV that is my preferred device, as it is much faster, smoother and more powerful, but the Roku Stick is perfectly adequate so far for the things it is adding to my living room entertainment.", "verified": true, "helpfulness": "0/0", "author": "Bradley Davis \"brad78\""}, {"rating": 5.0, "review": "What's not to like about Roku.  Get the internet including Netflix on your TV easily with this handy gadget.  It plugs into the HDMI section so you need a fairly new tv that has one if you dont have that just make sure you get the regular Roku 2  or 3 instead.  Great device and so quick to set up!", "verified": true, "helpfulness": "0/0", "author": "A. Brink"}, {"rating": 5.0, "review": "Very happy with this order.  The Roku works great and it got here a few days early.", "verified": true, "helpfulness": "0/0", "author": "susan wertz"}]