[{"rating": 5.0, "review": "When i first got it a day ago I was  really upset because netflix wasnt loading past 25% and i couldn't  change  accont profiles. I thought it was  a problem  with roku, but the issue was actually  with netflix.. its been working pretty good so far. I bought  it because  i live on my own and dont want to pay for cable. I used to plug my laptop into the t.v. through an hdmi cord before. Now i can surf the web and watch my favorite shows through  netflix,amazon etc  all at once!", "verified": true, "helpfulness": "0/0", "author": "Kimberly A. Alessio"}, {"rating": 5.0, "review": "I have owned all the Roku models from model 2 forward but this is what it should have been all along.  Although the remote response is not quite as fast as the non-usb model, everything else is there and you don't need a plug as long as your TV has a USB port.  You just plug it into the HDMI and USB port and you use it.  I bought this for the TV we mount outside and it is perfect.  Wireless TV with no additional power supply.  Roku has so much content also.  Cutting the cable is becoming very tempting.  This content and a good antenna and you've got 90% of what you really watch on cable or satellite for maybe $20 a month.  A person that has Amazon Prime, Netflix and Hulu Plus has it all pretty much on demand.  Watch TV your way on your schedule.", "verified": true, "helpfulness": "0/0", "author": "B. Waldron"}, {"rating": 3.0, "review": "Does what it's supposed to do. Works well. Very, VERY slow.  What one should expect for 40$.  The Roku3 and Amazon Fire, both for 100$, are probably better buys in the long run.", "verified": true, "helpfulness": "0/0", "author": "Warren Lisak"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "black"}, {"rating": 3.0, "review": "I purchased this product to use with a t.v. in my family room and coudn't get it to connect with my wireless network.  Ironically, it picked up two networks belonging to my neighbors but not mine.  I ended up trying it on a t.v. in my basement, which is closer to my wireless modem but initially had the same problem.  Once I managed to connect, I had repeated problems downloading the latest software.  Out of frustration I rebooted the device and finally was able to logon, complete the updates, and connect to my Roku account.  So far so good, but my initial experience with setting up the device was not favorable.Connecting my Roku with my Amazon and Netflix accounts was easy.  The Roku prompts you to enter a code on their respective websites and once you've done that you're good to go.  Not so much with my HBOGo account, however.  I followed the instructions to the letter on the HBO Go website, selected my cable provider (Verizon) and was prompted to logon with my userid and password.  No matter how many times I did that, I was never able to logon to my account on Verizon.  Perhaps it's a problem that's unique to Apple products or to Verizon's website but it's definitely not what I expected.", "verified": true, "helpfulness": "0/0", "author": "Chestoozo"}, {"rating": 4.0, "review": "Love watching what I want when I want but for some reason it kept interfering with my Wifi connection-even ordered the free extender but problem persisted. Ended up giving it to my sister...no problems with my internet since.", "verified": true, "helpfulness": "0/0", "author": "Tammy M. Scott"}, {"rating": 4.0, "review": "I love this, just disappointed that the power supply stopped working the first week.", "verified": true, "helpfulness": "0/0", "author": "ssraymond"}, {"rating": 1.0, "review": "Constant problem. Every time we stream a movie, router has to be rebooted", "verified": true, "helpfulness": "0/0", "author": "VICTORIA OAKLEY"}, {"rating": 3.0, "review": "It was nice while it worked. Granted it wasn't necessarily a manufacture problem more of made out of crappy material. Having it plugged into the back of my tv I liked because it wasn't another box that I had to deal with sitting somewhere. But one night when using it, it decided to crash and I couldn't get it to come back with the remote, I decided to pull it out of my tv and reset it. I pulled it straight out and plugged it straight back in. Nothing. Played with the remote to see if I could reset it, nothing. So I pulled it out again, only to notice that the metal part of the stick was wiggling. Yep, detached. So no I would not recommend it to someone because if it gets bumped the wrong way (and this was the first time I had ever taken out of the tv since I bought it.) it breaks easily. I'm out the money unfortunately. But I liked what it did.", "verified": true, "helpfulness": "0/0", "author": "Jessica Andres"}, {"rating": 4.0, "review": "I added an HDMI audio extractor (from wikson electronics) between the Roku and the TV so the sound is directed to an audio amplifier, works perfectly.Pros:- No bug found after 2 months of use- Simple interface- Plex app works fineCons:- missing features you can find on some more complete remotes (goto a specific time in a movie, adjust volume, ...)- 4 useless buttons for paid services (amazon, netflix, ...) on the remote, I'm using it only with Plex- the device cannot be switched off (except if you unplug it)", "verified": true, "helpfulness": "1/1", "author": "Alain Tésio"}]