[{"rating": 5.0, "review": "My husband bought this for me for Mother's Day. I originally binged watched on our Wii console, which is a very frustrating system. This is such an amazing product, I'm honestly mad for not getting it sooner. The resolution is amazing, the channel selection is phenomenal, the loading speed is fantastic. I especially love that there is no box cluttering up my entertainment center. The only issue I have, has nothing to do with the Roku. HBOGO wont work for me because I have Comcast, which is a Comcast problem (those greedy bastards!). I highly suggest getting this. It is truly wonderful.", "verified": true, "helpfulness": "0/0", "author": "Ty"}, {"rating": 5.0, "review": "I am a huge fan of the Roku.  I have 3 in my home & was so excited for the Roku stick.  It's so convenient & the set up was so easy.", "verified": true, "helpfulness": "0/0", "author": "Tam 💗 \"tambam722\""}, {"rating": 5.0, "review": "This was an upgrade from a Roku XS that is attached to the second TV. I cannot believe how much quicker this one operates. I use a modified Plex client to view movies and it is sluggish at loading listings and populating the screen. The screens all populate instantly with the Streaming Stick. I also like the fact that it is hidden behind the TV. I will be be upgrading my Roku XS to a Streaming Stick in the near future.", "verified": true, "helpfulness": "0/0", "author": "Michael Flemming"}, {"rating": 5.0, "review": "This product is definitely the best entertainment purchase I have made in a long time. The Streaming Stick took a little while to install (you have to get on a computer, phone, or tablet to create an account) but its features make up the difference. This tiny device has over 1,000 apps available in almost every category, a much bigger selection than the Chromecast or Apple TV. The included remote works very well and the mobile app is also very useful. Installing and using apps on this device is very easy and the \"Play on Roku\" feature of the mobile app lets you stream your music, photos, and videos from your phone to your Roku. I am very satisfied with this product and believe it is definitely worth the price. This streaming stick does not have a web browser like Google's Chromecast, but that was not a problem for me. The extra $15 you pay for this device over the Chromecast is absolutely worth it because Roku includes a physical remote and more apps to choose from. I would recommend this product to anyone looking for a streaming player for their TV that is cheap, easy to use, and packed with features.", "verified": true, "helpfulness": "1/1", "author": "Shelly Young"}, {"rating": 5.0, "review": "Works great and it is hidden behind the TV and receives power from the TV as well so no extra black spaghetti", "verified": true, "helpfulness": "0/0", "author": "familyocean2"}, {"rating": 5.0, "review": "I watch a lot of cable streaming and had some trouble using my Playstation for my streaming device.  It was always loading and losing my signal.  The streaming stick eliminates the need for that box and streams directly to my television in beautiful bright color.  The resolution is astounding and it gives you many channels to add to your list.  There is an automatic button on the remote that allows you to jump directly to Netflix, Amazon, MGO, and Blockbuster.  It's very easy to install.  Just put the stick into an HDMI port and plug the power source into it with the included ac cord and the other end goes into an electrical outlet or into a USB port on the TV.  I plugged it into an electrical strip and you are good to go.  You have to have your computer handy because you have to register each of the premium stations using activation codes that you see on your TV screen.  Have a pencil and paper handy and jot the codes down and work fast or the code will change and you have to start over.  It's really very easy and the result is fantastic.  It's very reasonable too.  As I say...I love this thing!", "verified": true, "helpfulness": "1/2", "author": "Scottie"}, {"rating": 5.0, "review": "I like the stick better than the other Roku  box that I own. I really like the features of the stick.", "verified": true, "helpfulness": "0/0", "author": "Jenny schafer"}, {"rating": 5.0, "review": "Very quick delivery and product exceeded my expectations.  Another Roku win!Would highly recommend this stick,  Easy to follow instructions and works great.", "verified": true, "helpfulness": "0/0", "author": "Ken Washburn"}, {"rating": 4.0, "review": "Which is why only 4 Stars versus 5. Roku, first of all, is my streaming product of choice. I have a Roku 3 hardlined into one TV and love the response and quick surfing capability. The Roku 3500R Streaming Stick takes some time to \"spin up\" due to it being wireless (although I am going to attempt a signal booster in the future in an attempt to resolve this issue).Basically, the streaming stick is awesome. The price is what will have me come back for the spare bedroom as I do not want to pay for another cable box. If you don't have an original Roku \"hardlined' into your tv and the \"Stick\" is your first experience, boost your signal or get a Roku 1,2, or 3 (double the cost, but worth it if you have a hardline). Loving the system, all of the Roku Systems. Worth every cent, especially when I am subscribed to Netflix and Amazon Prime. If I can find Sports Stations unlisted in the Roku Channels, I will be saying \"Good-Bye\" to cable all together by the end of the year.", "verified": true, "helpfulness": "0/0", "author": "Doc"}, {"rating": 5.0, "review": "I love the streaming stick.  It's small and unobtrusive.  Also very easy to set up. Roku opens up a world of entertainment possibilities. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "D. Grant \"Mystery lover\""}]