[{"rating": 5.0, "review": "This refurbished from DealFisher is working great. The Roku Streaming stick is great for my parents, who cut the cable last year, and are using an antenna for OTA broadcast channels. Now, they can get additional news from their favorite cable News content carriers without having to hook up a computer. They also enjoy some religious content, and some PBS shows, the content reminds them more like the History channel that they used to always watch. And finally, they enjoy the classic Westerns free movies. They like the weather channels, which replaces their old Weather Channel cable package. WeatherNation has Weather channel like feed along with a few I found on LiveStream.  The channels act more like smartphone apps, some requiring registration. I am impressed with the amount of free content that plays well even on the lowest of the high speed cable packages. They only receive 1 mb/s for basic internet.", "verified": true, "helpfulness": "0/0", "author": "Ken N. Wickham"}, {"rating": 1.0, "review": "Roku is great but if you like to watch shows in widescreen. DONT BUY THE STICK!!!  I own the roku LT and thought the stick would be a step up but IT IS NOT!  Widescreen is not available.", "verified": true, "helpfulness": "0/1", "author": "hansbandu \"hansbandu\""}, {"rating": 5.0, "review": "Absolutely love this product! So much better than the chrome cast which I replaced with the Roku", "verified": true, "helpfulness": "0/0", "author": "tmgremel"}, {"rating": 5.0, "review": "Easy to install, easy to use, easy to enjoy!", "verified": true, "helpfulness": "0/0", "author": "Kathleen P. Willis \"ocean spirit\""}, {"rating": 5.0, "review": "I didn't know the power of streaming until a year ago when I found out using my PS3 that there was an app or channel that I could install to watch my shows.  Come to a year later...and now streaming wirelessly?  This thing is a little bigger than a pack of gum and yet I'm able to get both free content as well as combining the selection I have from my Netflix and Amazon accounts.  If that doesn't make you ditch your cable service I don't know what will.  The controller is solid although if you use a tablet or even cellphone you can download an app that allows you to control the menus on the TV all the same.  Also, it's so small, it's portable and great to bring when you're traveling and have access to a TV with an HDMI input and also access to wifi.  I'm having fun exploring the various channels to see what content I can get.  Recommended.", "verified": false, "helpfulness": "0/0", "author": "DJ MinWah"}, {"rating": 5.0, "review": "WARNING: DANGEROUS PRODUCT... you may never leave your couch again!! I opted out of paying for a \"smart tv\" because I have a ps3 and blu ray player for streaming, but it always seemed like the streaming was choppy and would constantly buffer, despite having turbo internet. I was always hooking my laptop up to my tv for seamless playback, which was incredibly annoying.Now, I rarely even turn my cable box on anymore. I have access to everything instantly, with perfect HD streaming. I flip back and forth easily with Netflix, HBO Go, Showtime, Hulu Plus, and can even watch live tv with TWC.Excellent product. Goodbye social life.", "verified": true, "helpfulness": "0/0", "author": "Krista"}, {"rating": 5.0, "review": "Simple to install and allows easy access to all the channels", "verified": true, "helpfulness": "0/0", "author": "RES \"reubs\""}, {"rating": 5.0, "review": "This product is perfect for my media needs!", "verified": true, "helpfulness": "0/1", "author": "Patrick Holmes"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Daisy"}, {"rating": 5.0, "review": "Worth every dollar!!", "verified": true, "helpfulness": "0/0", "author": "James Redden"}]