[{"rating": 1.0, "review": "could not register it  on the internet could not find the  number of the link  I have not been able to use it", "verified": true, "helpfulness": "0/0", "author": "ginette tolentino"}, {"rating": 5.0, "review": "After doing research I'm so happy I chose the Roku over other streaming options. I love all the apps that are available and that it links to both my android phone and windows tablet.", "verified": true, "helpfulness": "0/0", "author": "Danielle Zimmerman"}, {"rating": 5.0, "review": "GREAT TO HAVE ON YOUR TV ENJOY PANDORA", "verified": true, "helpfulness": "0/0", "author": "linda"}, {"rating": 3.0, "review": "Bought this as a gift for myself and it worked well for 8 months. I watch YouTube with it. After 8 months, it will no longer automatically connect when I click on the YouTube icon. I have to uninstall YouTube, then reinstall it and get on line with a code to authorize. That is definitely a pain. I think I bought a service plan, but can't remember and will have to look it up. Also, I paid a lot less then, than what it is going for now.", "verified": true, "helpfulness": "0/0", "author": "Amanda Altman"}, {"rating": 5.0, "review": "very good product and time to deivering", "verified": true, "helpfulness": "0/0", "author": "Ernesto C."}, {"rating": 5.0, "review": "Best Roku yet. Allows constant playback of episodes for the kids so I don't have to keep turning on a show when they are watching toons. Easily portable, and faster than the Roku 2", "verified": true, "helpfulness": "0/0", "author": "Dan Oleary \"Danman\""}, {"rating": 1.0, "review": "Constant connection problems, would not recommend any Roku product. We were early adopters years ago when Roku first hit the market and again a product that just sometimes works and not very well. Very frustrating..", "verified": true, "helpfulness": "0/0", "author": "W. M."}, {"rating": 5.0, "review": "Works fine", "verified": true, "helpfulness": "0/0", "author": "June Eads"}, {"rating": 1.0, "review": "Completely useless product", "verified": true, "helpfulness": "0/0", "author": "Ilan Diamond"}, {"rating": 5.0, "review": "I just received my roku and I love it! I can't believe I've gone this long without one. The installation was easy and I've had no problem setting up my home page. I have two small kids and their are so many shows and channels for them. I'm seriously considering getting my brother and his family one because I love mine so much and they are missing out. I will never go back to cable or satellite again.", "verified": true, "helpfulness": "0/0", "author": "Ms. Moo"}]