[{"rating": 5.0, "review": "It does more than I originally thought. I use the screen mirroring for a lot of apps. That is my favorite feature. I can also access my Google play movies and TV shows and Amazon movies all in one. I like it better then the Chromecast I used before.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is my fourth Roku device, and I love them all. With a good wireless connection, this thing rocks.", "verified": true, "helpfulness": "0/0", "author": "Blue11"}, {"rating": 1.0, "review": "This little guy waited until the day after the return window ended to stop working. So now I'm stuck with a brick and I feel like I threw my money in the trash.", "verified": true, "helpfulness": "0/0", "author": "HappySkin"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 3.0, "review": "be great if remote was good", "verified": true, "helpfulness": "0/0", "author": "larry ramey"}, {"rating": 5.0, "review": "This is the way go if looking to cut the cord, many free stuff. Low cost for a certified recondtioned item. Deffently recommended", "verified": true, "helpfulness": "0/0", "author": "lio"}, {"rating": 4.0, "review": "Works great. Netflix is all I use it for, but I can imagine the other features are worth it.Only con is that when u leave Netflix playing, say after u fall asleep, the screen stays one one thing and could potentially burn the image on your screen.  But then again, that could be a Netflix issue", "verified": true, "helpfulness": "0/0", "author": "Carlin"}, {"rating": 5.0, "review": "After trying to decide between Apple TV and the Roku Stick, I'm so glad I decided on this one! I like that it's a lot easier to transport than the Apple TV and it's cheaper!", "verified": true, "helpfulness": "0/0", "author": "Brandi Miller"}, {"rating": 3.0, "review": "Item arrived as described, in the promised time, but the product it was bad (Slow, loading..) connecting to wifi", "verified": true, "helpfulness": "0/0", "author": "At"}, {"rating": 5.0, "review": "Don't know why I waited so long to get one!", "verified": true, "helpfulness": "0/0", "author": "Andrea B"}]