[{"rating": 2.0, "review": "It came with a bad USB cable.  Fortunately, I had a spare otherwise it would have cost me more.", "verified": true, "helpfulness": "0/0", "author": "June Fordham"}, {"rating": 5.0, "review": "I got this to replace my aging Roku HD. I was initially worried it would be slower but but it turns out the processor/gpu is slightly newer and it has twice the memory. I definitely have noticed an improvement in speed and fewer delays when changing menus or loading channels. What I like best is that it use the new radio frequency remote so you don't even need to aim it anymore. The remote is so much more responsive than the old infrared line-of-sight one. Best of all, it was snap to install. Plug it in the HDMI slot, plug in the included USB cord in the back of it, plug the other end into the TV (or the wall if your TV doesn't have a spare USB slot). Very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 4.0, "review": "The Roku lives up to my expectations as far as delivering excellent streaming. I have however found that the channels on offer are somewhat disappointing.", "verified": true, "helpfulness": "0/0", "author": "Phil Boonzaaier"}, {"rating": 4.0, "review": "froze on \"choose your language.' what the directions don't tell you is how to use the sync button that you will find in the battery compartment on the remote. it is a bit glitch , but still worth it I think.the wait for customer service was very long (45 minutes). but they were good once you finally got somebody.", "verified": false, "helpfulness": "0/0", "author": "jepuofa"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "melvin jennings"}, {"rating": 5.0, "review": "excellent buy", "verified": true, "helpfulness": "0/0", "author": "jagdeo petamar"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Caitlin Mack"}, {"rating": 5.0, "review": "Works great, a lot better than Samsung dongle.", "verified": true, "helpfulness": "0/0", "author": "Charles Marttala"}, {"rating": 2.0, "review": "IT Will work if you are going to use it in The U.S.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Garcia \"gatotico\""}, {"rating": 3.0, "review": "Has issues with sound! U have to manually switch the sound settings on most movies", "verified": true, "helpfulness": "0/0", "author": "Karl"}]