[{"rating": 5.0, "review": "Easy to use. No problems after 6 months", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 4.0, "review": "the stick works fine, the remote is another story. Each night i am using this I have to either change the batteries or open the back panel, remove them and put them back in to make it work. I have 2 of these and they are both the very same way.", "verified": true, "helpfulness": "0/0", "author": "scott"}, {"rating": 5.0, "review": "Absolutely love it!! It's super easy to use, has a ton of channels and works like a charm! I've used a chromecast and appleTV and I think the RokuStick is my favorite. AppleTV is my preferred for playing your iTunes or music, but I have a bluetooth speaker for that. Chrome I think is just prettier because they have really nice photography as their screen saver. But Roku is the best for me as far as replacing cable with this stick, mainly because of the remote, but I've also found it to be more consistent because it doesn't need to sync to a phone.", "verified": true, "helpfulness": "0/1", "author": "Lucy Momoh"}, {"rating": 1.0, "review": "Crap, over prize, arrived badly refurbiishd real riippoff", "verified": true, "helpfulness": "1/4", "author": "vb"}, {"rating": 4.0, "review": "It does what is supposed to do, not better than others!", "verified": true, "helpfulness": "1/1", "author": "Kahoe Fernandes"}, {"rating": 3.0, "review": "The remote control is problematic.  Amazon replaced my original purchase but am still having challenges. Sometimes it works, sometimes not.  I find if I open the back of the remote, pull out the batteries then put them back in it will work again, but who wants to keep doing that?  A bug needs to be worked out and hopefully soon.", "verified": true, "helpfulness": "0/0", "author": "Lisa Michelle"}, {"rating": 5.0, "review": "Works well and cheaper than the regular roku.", "verified": true, "helpfulness": "0/0", "author": "liz"}, {"rating": 2.0, "review": "I love what this stick can potentially do BUT mine keeps doing absolutely nothing.  For the first few days it worked great but now, off and on, it will act like the battery is dead.  So, I've changed the batteries, checked the back of the tv to make sure everything was connected and still the darn thing wont work.  The screen where I can choose netflix, amazon, etc is up but my stick wont do a thing.  Kinda bummed.", "verified": true, "helpfulness": "1/1", "author": "Tammy L. Arnold"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Jonathan Jimenez"}, {"rating": 3.0, "review": "A little glitchy at times, I guess that's why this one is half the price of the full Roku box.  We have the Roku box and it works wonderful.  The stick's remote sometimes \"freezes\" and you can't select anything.  It seems to be slow.", "verified": true, "helpfulness": "0/0", "author": "MBF"}]