[{"rating": 1.0, "review": "Nice looking device but set-up did not go smoothly. After connecting to my wifi, it downloaded software updates (takes a while) and once it was finished it gave me a type 11 error with no additional detail besides \"try again later\".  I connected to my wireless phone hotspot and got the same result. I went online and tried to instant chat with the Roku support line but the wait time was 60 minutes.  I'll keep trying but it may be easier to just return the Roku stick and try my luck with an Amazon Fire stick.", "verified": false, "helpfulness": "0/0", "author": "Ken Nelson"}, {"rating": 5.0, "review": "I'm enjoying the Roku interface so much better than the interface on our Vizio smart tv. Much faster and better designed.Did have one issue on 3rd day and had to do a factory restart. It was stuck on the opening Roku logo screen in a loop. Read online that this issue is common across all models.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 5.0, "review": "GREAT PRODUCT!", "verified": true, "helpfulness": "0/0", "author": "trixie"}, {"rating": 2.0, "review": "Device is fine, install  was easy, had issues with switching between cable and the streaming stick,  ROKU customer support is HORRIBLE, called twice and held for 20 mins, I was never serviced, sent an e-mail and was advised I would get a response in 2-days, they responded 5-days later. ...", "verified": true, "helpfulness": "1/1", "author": "LoveHandbags"}, {"rating": 2.0, "review": "I don't know! Netflix and Amazon films keep Pausing. Technician said that she has it and that it does'nt work well with HIFI. I could use help!", "verified": true, "helpfulness": "0/0", "author": "Leo J. Ryan \"Classics Lover\""}, {"rating": 4.0, "review": "Still navigating and deciding on what channels we will really watch; but overall pleased with the quality of the streaming and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "Easy to setup and use. Have two now!", "verified": true, "helpfulness": "0/0", "author": "grve"}, {"rating": 5.0, "review": "Works great! I will get a second one for the other TV. I had a Sony streaming device and roku us much better. I ordered a FireTv and returned it for the Roku. I love it!", "verified": false, "helpfulness": "0/0", "author": "Jeremy H."}, {"rating": 5.0, "review": "Processor is FAST! Simple to use and my remote does NOT have to be pointed at it! Great product!", "verified": true, "helpfulness": "0/0", "author": "D. Long \"DeAngelo\""}, {"rating": 5.0, "review": "Enjoying it greatly.", "verified": true, "helpfulness": "0/0", "author": "Kenny K."}]