[{"rating": 5.0, "review": "I love my rock you.", "verified": true, "helpfulness": "0/0", "author": "Yen4Truth \"Yen4Truth\""}, {"rating": 4.0, "review": "Streaming works pretty well. The stick was too long for one of my TV's so I had to buy an adapter and I can't have both HDMIs plugged in at once. On my other TV I can't keep the ROKU plugged in when I am using my cable TV because it makes the TV flash. I gave it 4 stars because it has nice options and it works pretty well.", "verified": true, "helpfulness": "0/0", "author": "Michelle Hamilton"}, {"rating": 5.0, "review": "Product worked great. No problems. Very good product.", "verified": true, "helpfulness": "0/0", "author": "Terri Ann Sherk"}, {"rating": 5.0, "review": "great so far. Have had about 2 weeks.", "verified": true, "helpfulness": "0/0", "author": "cec"}, {"rating": 5.0, "review": "Love this SMALL Roku Stick.  Installed on back of TV it is basically invisible, works perfectly and takes up no additional space on the shelf.  Makes a much cleaner appearance for the neatnick in me.Note of caution though... my TV only had one HDMI port.  As my cable box is wireless and my interface had to be HDMI, I had to buy a switch in order to add additional ports.  BUT.... once this was resolved...... perfect :)", "verified": true, "helpfulness": "0/0", "author": "Jewly Bug"}, {"rating": 5.0, "review": "love the item", "verified": true, "helpfulness": "0/0", "author": "marie schumacher"}, {"rating": 5.0, "review": "This product is so wonderful and works perfectly as described. I would recommend this product to any one looking to turn their TV into a smart TV for a low cost.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 4.0, "review": "IT WAS GOOD WHILE IT LASTED. I purchased my Roku streaming stick just about 1 year ago and it worked pretty good until last week. First it started to slow down and finally it stopped streaming content altogether. Time to get a new one...", "verified": true, "helpfulness": "0/0", "author": "Alyce"}, {"rating": 3.0, "review": "I have this and the stand alone box.  This streaming stick is way slower than the stand alone box and really has very limited range.", "verified": true, "helpfulness": "0/0", "author": "N. \"Nick\""}, {"rating": 5.0, "review": "I have not used it much but this unit, along with the USB charger cord (short) hook up and work perfectly.", "verified": true, "helpfulness": "0/0", "author": "ronnmax"}]