[{"rating": 2.0, "review": "The Roku streaming stick  would  be a good thing if it  would stay connected to the internet.  There are a lot of good tv shows with it but the internet continually goes out.  Have no problem with Netflix just Roku.  Genevieve Florez", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I absolutely LOVE this version of Roku. I've had the Roku 3 and really enjoyed that as well, so I wasn't sure how I would feel about this version of the Roku, but I absolutely LOVE it! I bought it for the smaller TV in my bedroom, because I didn't want another box and something else to plug in.I read the reviews before purchasing and saw that some complained that they had issues with the Roku dropping the wireless signal. However, I have not experienced that issue. I believe a more powerful wireless router with more range would probably help with that issue. Also, though it's supposed work with lower download speeds (3 mbps - I think), I would recommend a bit more. Keep in mind, THESE ARE MY PERSONAL OPINIONS in this paragraph. I work with a lot of technology and am only offering some possible solutions.Overall, I've enjoyed this device. I am doing the happy dance because I can now watch cable in my bedroom. We have Time Warner cable and there is an app on Roku for it, so there is no need for cable outlets in the bedrooms now. Our home is older and does not have cable outlets in the upstairs bedrooms. Roku saved me installation costs for more cable outlets, so I'm a happy camper. I've been searching for a solution for a while, so THANK YOU Roku! Now, the guide for the Time Warner app is not like as user friendly as the guide on the box set top - it could definitely use some tweaking. However, that's a Time Warner issue. It does what I need it to do so I'm happy.Be aware that the Roku stick DOES require a power source. You will either need to plug it into a USB powered port on your TV or use the included wall adapter. If you have an older TV with HDMI, this may be a consideration.Cons:Takes a bit of time to boot up (around a minute) when first turned on, but I'm patient - LOLHopefully, this review helps you in deciding whether to get a Roku stick. For now, I'm giving it two thumbs up! If that changes, I will amend my review...", "verified": false, "helpfulness": "0/0", "author": "Stormy"}, {"rating": 5.0, "review": "Works great, good distance from router to the room with the TV.Lots of free channels but I mostly use it for Netflix", "verified": true, "helpfulness": "0/0", "author": "Peter OLoughlin"}, {"rating": 5.0, "review": "I use it at my son's home while babysitting my 4 year old grandchild, and love that I can access some quality educational programming from England to go along with what's available here.  I've also used it to display family  photographs and videos on the tv to my dad, who is 96 years old.  It's great to be able to use Roku for that when the family is around, because a roomful of people can watch and comment or remember all at once.  I do find that it takes a while to load and the controls are not as intuitive as I might wish, but for the price it's still worth five stars.", "verified": true, "helpfulness": "0/0", "author": "Sue Moenius"}, {"rating": 1.0, "review": "I RECEIVED IT TODAY; IT'S GOING BACK TOMORROW.  AFTER 2 1/2 HOURS WITH TECH SUPPORT I FINALLY HAD IT UP .AND RUNNING.  YOU GET NOTHING FOR NOTHING.  EVERYTHING IS A TRIAL SUBSCRIPTION, THE REMOTE'S DIFFICULT TO USE (AND TIME CONSUMING) AND IT MESSED UP MY CABLE TV.  I NEEDED TO CALL MY CABLE COMPANY INORDER TO GET IT BACK!  \"FUGGEDABOUDIT!!", "verified": true, "helpfulness": "0/6", "author": "Frank Alexander"}, {"rating": 5.0, "review": "I bought the Roku box before I got this little guy and I don't really see any difference between the two.  This is smaller and more convenient, so if you're on the fence between getting this one or a more expensive model - get this one :)", "verified": true, "helpfulness": "0/0", "author": "Kathryn D. Logan"}, {"rating": 4.0, "review": "We have a pretty good internet connection 30mb up/5mb down, but even so streaming DirecTV movies sometimes lags out.  The video and audio quality and lack of lag on the Roku is really amazing.  So far we have only watched Amazon Prime Videos through the device.  Amazon Prime is the main reason I purchased this, as our TV is not supported by Amazon, and I'm not willing to pay XBOX annual fees just to stream Amazon videos.I think this device will be great if we ever get to a place to cut the cord on cable.  I partially purchased this to explore that possability.  Perhaps I'm being unfair to knock a star off because of the state of non-network TV, but that's probably why people are buying these products.  I have looked into private channels, and think there is some potential, and it will be more possible as time goes by.  For right now though, I think this is just a way to stream movies from the various pay sources.I travel a lot for work, and look forward to taking this with me on the road.  From the other reviews, I gather that the Roku can handle streaming through most broadband connections.  I'll update this review once I have a chance to test that out.", "verified": true, "helpfulness": "0/0", "author": "Scott Robinson"}, {"rating": 5.0, "review": "Easy to install in minutes. Love no need for a \"box\" unit that would take up space. Simple remote use.", "verified": true, "helpfulness": "0/0", "author": "Linda Bruner"}, {"rating": 5.0, "review": "It was very simple to install. Plug it in and follow onscreen instructions. I love the remote and the awesome search feature. You type in the search bar and it returns all possible channels the show is on. Pick which one you want and BAM! instant access.I had trouble with Netflix (the red screen would freeze), but went to Roku's website and online chatted with the a very helpful rep. It was most likely a Netflix or streaming problem, but unplugging, waiting, etc cleared it up. Definitely would suggest it to friends/family.", "verified": true, "helpfulness": "0/0", "author": "Texasann"}, {"rating": 2.0, "review": "I tried this because it's inexpensive and didn't require a power outlet, and it gave me what I wanted - access to Amazon Prime instant video, along with Netflix as these are the two main channels I stream. Setup was super easy and it's easy to operate, except the remote never worked properly. I'd press a button and nothing would happen. Finally, after 3-4 presses, it would respond. Trying to load and watch a movie was torture. Constant buffering made it annoying and frustrating. I returned it and paid a little more to get Amazon Fire TV which works great. No buffering and the voice remote is amazing.", "verified": true, "helpfulness": "0/0", "author": "Jan Dye"}]