[{"rating": 5.0, "review": "This Roku stick was easy to set up and works great.  The load times for apps and for video is consistent. It is not as fast as the set top version, but that was my expected trade-off for the convenience.  I would definitely by another if the need comes up.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Pretty easy plug in play a few passwords some cc info and I was watching anything I wanted very impressed for the amount of money I spent definitely will pass it along awesome service to !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Did not buy my roku stick from Amazon,  but thought a review would be helpful to some.  I am on my second stick in less than 3 months.  The first stick stopped working after 2 weeks and my current stick will not load netflix. To late to return to Target. I say buyer beware.", "verified": false, "helpfulness": "0/0", "author": "mbusch"}, {"rating": 3.0, "review": "one worked fine the other keeps restarting. The working one doe a good job but much slower than Roku 3", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"rlstamps\""}, {"rating": 5.0, "review": "Love it.  Works as expected.  Doesn't take much space either.", "verified": true, "helpfulness": "0/0", "author": "Sydnie Barcenas"}, {"rating": 5.0, "review": "This is a good streamer with a lot of apps including you tube, I heart radio, news apps etc..It has apps that were not available on Roku's previous product. My only complaint . Youhave to plug in the power cord before you connect it to the hdmi.", "verified": true, "helpfulness": "0/0", "author": "Pablo Rodriguez Jr. \"PAUL    RODRIGUEZ\""}, {"rating": 4.0, "review": "Good way to add streaming services to a TV without it. Added this to a bedroom set; being able to plug it into an HDMI port and power from a USB port is a very nice feature. As our main TV has limited app selections built in, I may add one to that set at some point. My only criticism is that it seems slow making connection with my wireless network, but once connected the response time is pretty good. The selection of apps is overwhelming!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Roku, and I use it pretty much everyday.  I've had it a month, and I needed to restart it once when it wasn't working properly but that was the only problem I've had with it.  It's a great way to watch Netflix on your TV, and also amazon video.  There's a neat feature where you put in a pin number to make a purchase (you can turn it off if you want) to prevent you and children from accidentally purchasing something.  There are a ton of free channels like Animal Planet and new stations.  The remote only has a few buttons making it good for using in the dark just by feel, or you can get a free app for your smart phone and use that as the remote, which is great when you're searching for something and can use a keyboard function on your phone.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great addition to our tv options", "verified": true, "helpfulness": "0/0", "author": "R. Cook \"AL author\""}, {"rating": 5.0, "review": "After struggling for 11 months to get a clear signal from Netflix, Roku finally came through with flying colors! If Roku didn't work the next step would have been paying Comcast to install a direct line from the TV to the Gateway device, and that would have been expensive.The LG TV geek squad recommended a dongle, which picks up wireless signals, but it was not consistent and I lost the HD feature most of the time.I would call Netflix because I wasn't able to get HD, they also recommended the dongle. Mostly they suggested calling Comcast. Finally a lovely girl at Netflix (to whom I will be forever grateful!) recommended Roku.I had some difficulty in starting up Roku and called the Vudu folks where a friendly tech expert patiently led me through each step. If it wasn't for my computer ignorance, it wouldn't have been difficult to set up Roku.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]