[{"rating": 2.0, "review": "So less than six months after buying it the Roku device seems to have stopped working entirely. What a bummer. Can I stll return it. Sadly, I just discarded the box about a week ago. Boo roku. Make your devices work longer than this.", "verified": true, "helpfulness": "1/1", "author": "Helen F. Gregory \"Helen G\""}, {"rating": 1.0, "review": "Stopped working about a week of use, had to return it.", "verified": true, "helpfulness": "0/0", "author": "Tomas Cruz"}, {"rating": 5.0, "review": "It's amazing even it being refurbished and I wish I would've gotten it sooner. I had some complications with the remote when I first got it but because of my excitement I overlooked the message stuck on the packaging hahaha!! Great product!", "verified": true, "helpfulness": "0/0", "author": "Mrs.Williams"}, {"rating": 5.0, "review": "ok so far.", "verified": true, "helpfulness": "0/0", "author": "Diz Busters"}, {"rating": 5.0, "review": "Works great....", "verified": true, "helpfulness": "0/0", "author": "K. Mehta"}, {"rating": 5.0, "review": "Extremely fast shipping, product as described, very satisfied!  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Finally got rid of our cable bill, saved well over 100.00 bucks a month... using the Roku with Hulu Plus and a few other sights to watch current stuff on. I am so happy with this little device, $8.00 a month for Hulu Plus and the little Roku also allows my windows 8 to project thru to the big screen, making a HDMI cable totally unnecessary. Finally i listen to youtube videos thru my surrond sound that is connected to the tv thru the roku and no wires.. i feel so technologically superiour now....LOL ...  since dropping cable, and getting my Ruku, also buying a little Magic Jack Plus, which hooks into my wi fi, i have dramatically saved on my monthly bills. ..no phone bill and now no cable bill.  in my opinion Ruku is the future, and cable and satellite companies will soon fade like the cassette tape or 8 track player. who needs em... when there are alternatives like this.. i am thinking of signing up for an amazon credit card so i can get a 30 buck amazon credit and use it to purchase a second Roku to give as a gift to my mother.", "verified": true, "helpfulness": "0/0", "author": "michael kiser"}, {"rating": 1.0, "review": "Cannot get stick to work most of the time.", "verified": true, "helpfulness": "1/1", "author": "john harvey"}, {"rating": 4.0, "review": "I have an older version of a Roku but I love that I can move it from TV to TV easily. The only thing I wish is when I travel I would love to use the Roku in the hotel room but most hotels have free wifi but you have to accept the terms on the Internet and you can't do that through the Roku so it will not connect to the Internet.", "verified": true, "helpfulness": "0/0", "author": "Amanda L. Smith"}, {"rating": 1.0, "review": "Update. Started out as a 5 star. Now its a one star.  SO exactly one day AFTER the return time allowed. the Roku Stick died. I think Roku is getting a big big in the head and they are now having quality issues.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Tom\""}]