[{"rating": 5.0, "review": "We bought a Fire TV box (that we ended up returning), an Apple TV box and an ActionTec streaming device to mirror the content from our phones and tablets to our TV. Then we got the Roku stick. We didn't NEED any of the others! The Roku stick does all of what we wanted, and does it better, for half the price of ONE of those other devices! It also allows us to tie our devices so that we can mirror them (at least we can with our Android devices) to our TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very exciting to use. Instructions are easy to follow. Have to get used to the remote but not difficult. And with downloading additional apps, and paying the monthly subscription I can watch all the cricket and rugby I want to watch. Best item I have bought in a while.", "verified": true, "helpfulness": "0/0", "author": "Anniek"}, {"rating": 5.0, "review": "Very easy to set up and it is easier to use than the Chromecast that I had at first. I like the remote and I like the multitude of selections.", "verified": true, "helpfulness": "0/0", "author": "Mark W"}, {"rating": 5.0, "review": "Very easy set up and found my wifi the first time. Will by another one for my bedroom soon.", "verified": true, "helpfulness": "0/0", "author": "lawrence leugoud"}, {"rating": 5.0, "review": "Prefect set up for streaming. Super easy to install.", "verified": true, "helpfulness": "0/0", "author": "Trevor Ryals"}, {"rating": 5.0, "review": "a great product from a great company at a great price", "verified": true, "helpfulness": "0/0", "author": "linda strausbaugh"}, {"rating": 5.0, "review": "Great product, but no headphones on this version.  Better than a smart tv", "verified": true, "helpfulness": "0/0", "author": "James W Tucker"}, {"rating": 5.0, "review": "Very happy with this Roku stick which I ordered through Amazon. I've already have a roku box which I set it up with a flat screen for my training home gym. But I missed having the roku box in my bedroom so that when I decided to order the roku stick. I am so glad I did because besides the roku stick being a great product, everything else was really well done. The packaging and delivery, excellent service.", "verified": true, "helpfulness": "0/0", "author": "J. Reyna"}, {"rating": 5.0, "review": "Bought this for my father when the Chromecast proved too difficult to use a tablet/phone as the remote. Easy to setup, easy to use and particularly good for the elderly. Takes up no room.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "works great, kids love they can watch their own shows. shipping was fast.", "verified": true, "helpfulness": "0/0", "author": "Tasha"}]