[{"rating": 2.0, "review": "I purchased roku stick almost 4 weeks ago. I've had nothing but problems. Extremely slow to boot up. Constantly freezing/locking up. Have to disconnect power when it locks up. I can't recommend based on problems I'm having. I'm returning roku stick.", "verified": true, "helpfulness": "0/0", "author": "AmazonCustomer"}, {"rating": 4.0, "review": "I was surprised on how effecient and clear.Great purchase.I'm looking to have it in every room.", "verified": true, "helpfulness": "0/0", "author": "George Aleman"}, {"rating": 5.0, "review": "So far it's a nice addition to my TV experience.", "verified": true, "helpfulness": "0/0", "author": "nbob"}, {"rating": 5.0, "review": "I love my Roku streaming stick. It is small, plugs right into the back of the TV, and is very easy to use. It's best platform I've used to watch Netflix and other of my favorite channels. I would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 3.0, "review": "Great idea, but loads way to slow can't get remote to work but remote on my cell works. Wish I would have bought box set.", "verified": true, "helpfulness": "0/0", "author": "Christine C. Briggs \"brig498\""}, {"rating": 3.0, "review": "it's ok, but you have to have internet service, a cable provider and/or pay for subscriptions to be able to watch movies, etc.", "verified": true, "helpfulness": "0/1", "author": "R.James"}, {"rating": 4.0, "review": "works great and easy to install", "verified": true, "helpfulness": "0/0", "author": "Roger Fox"}, {"rating": 1.0, "review": "What a big mistake! Shortly after I installed it, my tv took forever to turn on. Finally it stopped altogether! It was 7 year old flatscreen cost me $1500! Fried! Caused a power surge and destroyed my tv! Beware! Manager of a tech dept said she was aware of this issue!", "verified": false, "helpfulness": "0/0", "author": "Bonnie"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 2.0, "review": "Died after  six  months", "verified": true, "helpfulness": "0/0", "author": "Daryl Brown"}]