[{"rating": 5.0, "review": "I love my Roku streaming stick so very much. It came quickly, was extremely easy to set up, gives me so much to watch, most of the time i dont even watch anything because of it. I mostly listen to Pandora which is a great app on Roku. Some of the smaller personal channels dont load or the videos of some channels dont load, it has frozen twice when trying to use Netflix and it gives off a darker screen when i choose a movie on Netflix from anything but the channel itself. Other then those problems, which are not consistent since ive found the ways to get over thrm, the Roku streaming stick is perfect and im VERY thankful I bought it. Will buy it for the living room a roku as well.", "verified": false, "helpfulness": "0/0", "author": "Brie"}, {"rating": 5.0, "review": "Love it!  You need to join Amazon Prime to take full advantage.", "verified": true, "helpfulness": "0/0", "author": "GailBox"}, {"rating": 5.0, "review": "Great", "verified": false, "helpfulness": "0/0", "author": "Luis P."}, {"rating": 4.0, "review": "as a linux user, i had a hard time streaming my amazon prime to any devices - PC, android tablet, android phone...etc (not fair, amazon!). luckily this thing did the trick! incidentally i bought it for some of the other features, such as for pandora and other methods of streaming video (there are many)to use, you download \"channels\" to your roku as apps. then you can stream video, music, or pictures to your HDTV. if you're wondering if it's for you, then just google the capabilities and you'll see how versatile it is. as for me, i do not have any complaints.", "verified": true, "helpfulness": "0/0", "author": "G. Meyer \"garbagefile\""}, {"rating": 1.0, "review": "I really wanted this to work.  I was so optimistic about it but by the time I wasted 3 or more hours trying to get it setup and working I gave up. I started with the order from Amazon but my Roku wouldn't find the remote. It worked a couple times for a minute or two but then stopped. I restarted and re-paired the remote only to have it stop working again and again.  I finally went to Walmart and bought a new Roku because I didn't want to wait to see if I could get another one working. The second one got through the start up process and then guess what? The remote stops working. ... I have no idea why. I had tried to pair my smart phone with it as a remote and so I tried that again. Finally, I got the smartphone to have some control over the Roku, but every 2 min it can't find the Roku and gives me an error. When I did get the channel selected the content never started. I am taking the one back to WM and the other is being sent back to Amazon. I can accomplish what I want with Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Amy"}, {"rating": 3.0, "review": "Pros: internet TV! I mostly use it to access Netflix and it does a really good job of that most of the time. It has a nice user interface that is easy to navigate and wasn't too hard to set up the first time....Cons: the remote will occasionally stop working and has to be re-linked with the streaming stick. That gets frustrating the tenth time. Also, it sometimes refuses to use the wired or wireless network you choose (look up Error code 014, it is a prevalent problem). I've had to do a few \"back to factory\" resets and make changes in my wireless router settings to get the darn thing to work.  Even after it works for awhile, it will occasionally just refuse to stream video. (No it is not a low signal strength issue).Before buying this, I used my XBOX360 console to access apps like Netflix but I do really like the instant access the Roku stick has, just wish it worked more consistently.", "verified": true, "helpfulness": "2/2", "author": "M Chateau"}, {"rating": 4.0, "review": "I really love the Roku stick. I recently hung my flat screen on the wall. Since I have a media closet, I didn't want to add a shelf underneath just for the Roku. This stick provided the perfect solution. I don't even notice its there. The only fault with it is that there's a slight delay with the remote, but that could be because it doesn't have a direct line of site. Overall, this is a great product with great features and I really enjoy it. By the way, this is my third Roku device. I considered switching to Apple TV, but Roku offers more. I a die hard Apple person, but in this case, Roku wins out..... You won't be disappointed with the stick version. It is everything that Roku offers in almost all their other devices, just easier to hide behind a wall mounted TV without some aftermarket mount that hangs from the air vents of the TV.", "verified": true, "helpfulness": "0/0", "author": "FaeryKiss"}, {"rating": 5.0, "review": "Pro: Works great on the road, as long as the Wi-Fi is up to it.  I use my Verison hot-spot.I recommend getting the \"Cable Matters Combo, 270 Degree and 90 Degree HDMI Male to Female Adapter\" from Amazon You never know what you run into a hotels. This unit does not work with composit video units. (yes, that is a PRO)Works well for the small TVs in the RV.Con: It takes a long time to boot up.", "verified": true, "helpfulness": "0/0", "author": "Jim In MN"}, {"rating": 5.0, "review": "I got my first HDTV in April 2014, a Toshiba 40-Inch 1080p 60Hz LED TV. I was going to wait, but I got a Roku in May, less than two weeks later. I got it then for three reasons.First, Roku just came out with their Streaming Stick. It only cost $49, half of the cost of the Roku 3 Streaming Media Player I was planning on getting. The Roku Stick plugs directly into the HDTV's HDMI port, so no cable is required. And it is powered via the HDTV's USB port, so no need to plug it into an electrical outlet, which was nice as I had no outlets left on the two power strips I have in my home office/ TV room.Second, I signed up for Amazon Prime a long time ago for the free two day shipping, but somewhere along the way they added Instant Video to it, which has lots of free movies and TV shows available. Since I was already paying for it, I figured I might as well use it.Third, I never watched \"24,\" but with all the hoopla about it with the new season starting, I checked my cables' OnDemand service. And they had all 8 previous seasons available, but only the first episode of each season was free. It cost $20/ season for the rest. I watched the Pilot, and (as I'm sure many \"24\" fans will attest), it is a great adrenaline rush. So I checked Amazon, and sure enough, it had all episodes of all 8 seasons available for free. So that was the clincher.I ordered it on a Sunday, and got it on Tuesday. It was easy to set up the Roku and Instant Video, as long as you follow the instructions in the 4-page booklet and onscreen and you have your PC in the same room as the TV. It took about half an hour total. So I had a \"24\" marathon that night, watching the next 3 episodes.So between the 100+ HD channels on my cable service that I can record to my heart's content with my WD My Book AV DVR Expander and Instant Video via the Roku, I always have plenty to watch during the time I'm forced to rest. So that keeps me from complaining about lousy shows, as I can always find something worth watching. There is even free stuff you can find on the Roku, such as on the home page are links to general news and specialty news, such as health news. These are briefs taken from a variety of sources. You can click to play all of the items in a section, and it will play for about 30 minutes, all commercial free. It's updated about once a week.Also, I've noticed something interesting about my HDTV. When watching shows on my Roku, the picture and sound are significantly better than when watching shows on cable. The sound is not only louder but has the resounding bass of a movie theater. I would have thought it would be the opposite.However, when I change the input on my HDTV from cable to the Roku, it takes about a minute to read the Roku. Then it takes another minute to log onto Amazon, then another minute to load my Watchlist. So it does take a little patience as compared to watching cable, which is basically instantaneous. But in the over five months since I got the Roku, the only problem I've had with it was just recently when it \"lost\" my login info for Amazon, and I had to reenter it. But that was it. No problems otherwise.So I am very pleased with this Roku Streaming Stick, so I am giving it five stars.", "verified": true, "helpfulness": "1/1", "author": "Gary F. Zeolla \"Author of Christian and of fitness books, Web sites, and newsletters\""}, {"rating": 5.0, "review": "Already have a Roku 3 and am very happy with it.  Bought this for one of our other TVs which didn't really need the extra gaming features, plus I can't really resist a price of $39.  It's a little slower than the Roku 3 when navigating, but that's to be expected with the slower processor.  All of the streaming works exactly the same, and that's the important part.  Had to use the provided power supply, we had issues when powering from the TV's USB port but your TV may work fine.", "verified": true, "helpfulness": "0/0", "author": "Chris Horry"}]