[{"rating": 5.0, "review": "Love Roku", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "There is some lag between pushing the button and when something happens. It seems to take a while (a few seconds) load the different screens but Netflix plays like it should.", "verified": true, "helpfulness": "0/0", "author": "Part Time Gamer"}, {"rating": 5.0, "review": "Lifechanging product.", "verified": true, "helpfulness": "0/0", "author": "YamesBaskets"}, {"rating": 5.0, "review": "Good device,cheap and you have unlimited access to movies and TV shows", "verified": true, "helpfulness": "0/0", "author": "kindy trotsky"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Shon"}, {"rating": 5.0, "review": "I love this better than my roku box! Easy set-up.", "verified": true, "helpfulness": "0/0", "author": "J. Muller \"Crafty Massage Therapist\""}, {"rating": 5.0, "review": "I dumped my subscription to cable tv about 8 years ago, get good reception with over the air channels, and have been content to supplement it with a Roku player. The one cable channel I missed was ESPN. When I found out it was available without a cable subscription on Sling TV I tried to add it to my Roku HD (1st generation) and found out it wasn't supported by older Roku devices. So I upgraded to the Roku Stick about a month ago. It loads noticeably faster and provides a smoother experience than the device it replaces which is to be expected as it has a faster processor and twice as much memory. Sling TV works great with it. I use the supplied power adapter, haven't had any issues with the remote, and the Roku smartphone app also works perfectly with it.", "verified": true, "helpfulness": "0/0", "author": "JRB"}, {"rating": 5.0, "review": "Great product so far. Very easy to use and connect with, plugged in to the TV quickly and easily. Would definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Cochran Jr."}, {"rating": 5.0, "review": "Really quick shipping - it works great - I will recommend it to everyone!", "verified": true, "helpfulness": "0/0", "author": "Teresa Pico"}, {"rating": 5.0, "review": "Great way to turn your dumb TV into a Smart TV and save a lot of money.", "verified": true, "helpfulness": "0/0", "author": "J. Vandevender \"Cheeseman\""}]