[{"rating": 5.0, "review": "Love it!!! I bought a refurbished Roku Stick and it looked totally new and works like magic. Why didn't I get this sooner? Awesomeness ...", "verified": true, "helpfulness": "0/0", "author": "Felecia Townsend"}, {"rating": 3.0, "review": "I debated between the stick and Roku 3 for a few hours before I decided to save the $40 and reduce clutter on my TV stand. This was a mistake. While it does hide nicely, depending on where your HDMI ports are this could be a problem for remote interaction and WIFI connection. The delay between turning on the TV and the Roku being ready to go is between 45 and 60 seconds. I borrowed a friends 3 and the start up time is exponentially faster.I love the Roku, but for anyone even remotely on the fence between the stick and the 3, go with the 3. Also, when you start to think \"and I don't even really need the keyboard on the Roku 3 remote, I can just use the arrows on the basic remote that comes with the stick\" you're wrong - you need the keyboard. It sucks having to arrow through long movie titles.", "verified": true, "helpfulness": "2/2", "author": "Zach M"}, {"rating": 5.0, "review": "SO happy I finally bought this amazing device.  Now it works with SLINGBOX and I'm thrilled that I don't have to connect my computer to my tv anymore.  For $40 you cannot go wrong", "verified": true, "helpfulness": "1/1", "author": "ENP"}, {"rating": 5.0, "review": "What a great product; very reasonably priced; just plug it in the back of your flat screen and off you go.  So simple!", "verified": true, "helpfulness": "0/0", "author": "Kevin Anderson"}, {"rating": 5.0, "review": "awesome it works great!!!", "verified": true, "helpfulness": "0/0", "author": "Candice C."}, {"rating": 5.0, "review": "This is my second one. The firs one I bought at Best Buy. It is perfect for watching TV shows and movies. I am not sure about gaming because I don't play any games.", "verified": true, "helpfulness": "0/0", "author": "Amir Gal \"Neil G.\""}, {"rating": 4.0, "review": "This is fantastic...the only problem that i'm experiencing is once in a while the remote loses connection and I have to restart the roku.  This is very inconvenient when you pause a movie and you cannot restart it without rebooting your roku...only happens once in a blue moon though.", "verified": true, "helpfulness": "0/0", "author": "Bryan Waters \"-bryanw\""}, {"rating": 2.0, "review": "This had to be returned because they didn't say in the description that the HDMI port needed to be a side mount.  Mine was in the back of the TV and with the shape of the TV  backing the stick wouldn't not sit in the port without bending something.", "verified": true, "helpfulness": "0/0", "author": "cala lilly love"}, {"rating": 1.0, "review": "This worked for me the first two times I used it. Got it all set up and worked fine - twice. A week later I go to watch it again and I could not get past the bouncing ROKU screen. Did 3 hard resets. The first seemed to work and after I set everything up again it crashed and screen went black. 2nd and third time it didn't work at all. Maybe it's just mine that's faulty but I'm out $40. I have another ROKU that has worked fine for 2 years. I've wasted hours trying to troubleshoot this and nothing is working.", "verified": true, "helpfulness": "0/0", "author": "Abby Bromley"}, {"rating": 5.0, "review": "Love this stick.", "verified": false, "helpfulness": "0/0", "author": "Sally Mustacchia"}]