[{"rating": 2.0, "review": "I am only going to live in my apartment for less than 6 months while my husband is deployed so I thought that I would just get this instead of getting cable.  I have had it just over 4 months and I have never been happy with it.  It started acting up within a week which should have been a sign.  I am always having to reconnect the remote, even while I'm watching a tv show it will go out.  Then the Internet in the rest of the house will work fine but the roku will say it can't connect.  Well now no remotes will connect to it, then I made the mistake of resetting it so now I can't even control it with my phone.  Good news for Amazon though,  I'm about to go buy a fire tv stick, hope to get better results!", "verified": true, "helpfulness": "0/0", "author": "Mrs.perez"}, {"rating": 4.0, "review": "It was a gift. It arrived packaged beautifully. I have not heard from the recipient as to whether it works. But it  did arrive on time.", "verified": true, "helpfulness": "0/0", "author": "Carole Ames"}, {"rating": 5.0, "review": "works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Karen L. Mercer"}, {"rating": 4.0, "review": "The device itself is working well.  I did have a problem syncing it initially.  I had to restart the process 3 times before it finally synced.", "verified": true, "helpfulness": "0/0", "author": "craftman \"Tom\""}, {"rating": 5.0, "review": "Great...I love it worth every penny", "verified": true, "helpfulness": "0/0", "author": "carmen"}, {"rating": 5.0, "review": "Been using it in the bedroom for 6 months. As good as the larger one in my theater. Improved the picture quality... gets a bit warm and has to be reset occasionally, but that is the cable service usually.", "verified": true, "helpfulness": "0/0", "author": "James J. Marino"}, {"rating": 1.0, "review": "Didn't last 6 months!", "verified": true, "helpfulness": "0/0", "author": "Drenee"}, {"rating": 5.0, "review": "I already had three full-sized models.  This is my first Roku stick.  Outstanding -- does everything the full-sized models do (that I care about anyway).  And Roku beats Chromecast hands down in terms of reliability in streaming and available channels.Like the Chromecast, the stick looks a little ugly coming out the side of the TV, but you get over it.  And if you have easy access to additional HDMI inputs in the back of your TV, Amazon sells many variations of HDMI angle connectors that helps to hide the stick completely.If you have streaming built in to a DVD player like I do, you might get a couple apps that are worthwhile and there is no way to add more channels as they become available.  Roku solved that problem with new apps to add all the time.Fire your cable TV company and come into the 21st century.  I am 100 percent streaming.  And this little guy does the trick.", "verified": true, "helpfulness": "1/1", "author": "Joshua C. Delaney"}, {"rating": 5.0, "review": "Best internet streamer at a very reasonable price.  I have a Roku 2 and Roku 3 for home and the Roku 3500R is perfect when I travel.", "verified": true, "helpfulness": "0/0", "author": "Tommy"}, {"rating": 2.0, "review": "get the roku3.  this device does not work well with MLB TV app.  ROKU3 works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "steven"}]