[{"rating": 4.0, "review": "I give only three stars because it is difficult to use outside the united state", "verified": true, "helpfulness": "0/0", "author": "Jimmy Matamoros S."}, {"rating": 5.0, "review": "Love this do-hickey!!! I wish someone had told me long ago that I could do something other than pay xfinity $185 a month. Because of the Roku stick, I pay no cable bills, or phone bills. I use to have Magic jack, but Comcast was able to block that through their internet modem.Since getting the Roku I watch a lot of you-Tube and Netflix and I have my Magic Jack back that I pay $35 yearly for. I am in media-technology heaven!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Walker"}, {"rating": 5.0, "review": "i recieved my Roku on time ..it works great", "verified": true, "helpfulness": "0/0", "author": "therosis"}, {"rating": 4.0, "review": "Note: I've owned Roku 1 before this and most of my experience with Roku Stick is colored by it.First thing you will question is which freaking idiot decided to put OK button on a remote below directional buttons instead in middle of them as any other remote does? It completely destroys muscle memory and makes my thumb go in the positions which man relaxing in front of TV should not ever know. And let's not forget those MGO, Netflix, Amazon and Blockbuster buttons on it. I've never met anybody using all four of these services. They are just a waste of space.Setup process requires Roku user account and a credit card. Those using only subscription services (e.g. Netflix, Amazon Prime) and living in the house with kids will adore that one. Yes, you can turn on parental controls but isn't it easier just not to have credit card details with someone else? There is a way around it by using https://owner.roku.com/signup-nocc during setup but I still find it annoying that I had to google around to find it when simple \"Skip\" button during normal setup would do.As with Fire TV device I find 5 GHz range useless on this stick. It loses connection so often (even while sitting next to a router) that even advertising support for it borders on lying. More common 2.4 GHz range works fine though.I personally use Netflix application the most and I find it step backward compared to Roku 1. Whole interface is just slightly off and less thought-through that you'll find yourself changing stuff around by accident. Great example would be handling of Netflix profiles. It is fantastic (and primary reason I upgraded) that it supports multiple profiles but it is annoying how easy is to change it by accident. And you cannot hide some profiles to avoid accidents - you can only delete them completely. And don't let me get started about application startup times...This new Roku is still a great addition to the TV but there is no carefree comfort I've found to love with older version. I hope that firmware upgrades will make it better with time...PS: It is still better than Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Medo \"Josip Medved\""}, {"rating": 5.0, "review": "Love my Roku! Dont' remember what I did without it.", "verified": true, "helpfulness": "0/0", "author": "Rob B."}, {"rating": 5.0, "review": "The best!", "verified": true, "helpfulness": "0/0", "author": "Todd Nelson"}, {"rating": 5.0, "review": "enjoying it", "verified": true, "helpfulness": "0/0", "author": "Charles R Hobbs"}, {"rating": 5.0, "review": "More than I hoped for.  Had one of the boxes a couple of years agoand Yuk!  They improved or HDMI makes all the difference.Glad I took the chance.", "verified": true, "helpfulness": "0/0", "author": "wanderer"}, {"rating": 5.0, "review": "I have two and buy them as gifts. Easy to use and great service", "verified": true, "helpfulness": "0/0", "author": "Brian yuska"}, {"rating": 1.0, "review": "This worked just ok for 6 months.  I purchased it in June, and by the first week of December it is stuck in a boot loop.  I chatted with Roku support and they were not helpful.  They kept asking my to do things I had already done (unplug TV, unplug Roku, etc.).  So I guess my $50 was only good for six months.  The boot time is extremely slow compared to the Fire Stick.  I prefer to use the USB power to avoid extra cables and it needs to boot each time the TV turns on and it takes forever.  I am going to get another Fire Stick to replace the non-working Roku Stick.", "verified": false, "helpfulness": "0/0", "author": "D. Miller"}]