[{"rating": 5.0, "review": "love  it !! user friendly", "verified": true, "helpfulness": "0/0", "author": "Cindiva"}, {"rating": 4.0, "review": "To preface this review, I just wanted to state that I have the Roku 3 and I love it.  With that said, I got the Roku stick because we wanted to keep our living room TV as clutter free as possible.  It works just fine but there is a significant delay in finding a connection which results in a lag about 75% of the times I go to start up the roku.  Once it's working, honestly, it doesn't bother me that much.  Yes, it's a little sluggish compared to the Roku 3, but in return, I don't have to see wires and boxes.  So all in all, I give this 4 stars.", "verified": true, "helpfulness": "1/1", "author": "Angela"}, {"rating": 5.0, "review": "Great device super easy to use.", "verified": true, "helpfulness": "0/0", "author": "Teresa Ruiz"}, {"rating": 5.0, "review": "I bought a chromecast and it does what it is intended to do, but was not very user friendly by anymeans. To use the device your laptop had to be on, or you had to use your cell phone. Well when you are watching Netflix on your tv the last thing you want is having your laptop right beside you with the screen bright. If you use your phone to activate the chromecast it does not have auto play for Netflix. I struggled using with this awkward device until I just broke down and bought a Roku. Worth the money! It is so much better. My advice just buy a Roku. It has all the same functions as a chromecast but the user interface is just so much better!!! Plus the Roku uses a series of signalwaves that communicate in all directions so you don't have to point at anything to use the remote!", "verified": false, "helpfulness": "0/0", "author": "Rachel LeDat"}, {"rating": 4.0, "review": "It works great. Definitely needed to upgrade", "verified": true, "helpfulness": "0/0", "author": "Cassandra Dickson"}, {"rating": 4.0, "review": "Love the ROKU, but find the remote has a hard touch.", "verified": true, "helpfulness": "0/0", "author": "Carol Ward"}, {"rating": 1.0, "review": "If I could give zero stars I would. I bought this three weeks ago and it has been a disaster . The remote just simply does not work and pair with my TV. It's not a question of Wi-Fi as I have many other TVs and computers in the house and the Wi-Fi is strong. I've spoken to customer service three times and at the end they told me that the service is free now as I just bought product but I won't be in a few months and I should sign up for tech-support plan.  Yes they reboot it for me , but I should not have to go to customer service every time I want to use the product should I ? What a joke !! I used the Sony stick for years without a problem and most my friends have AppleTV which I stupidly should have bought instead of this piece of junk. I also do not like how they want your credit card when you're setting it us . I don't plan to buy programming .You can  bypass that but only if you ask the customer service how .", "verified": true, "helpfulness": "0/2", "author": "McLizzy \"Lizzie McLiz\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "william greene"}, {"rating": 5.0, "review": "We have used a roku since the very first one came out. We have always loved it and we were still satisfied with the over 6 year old model we had. But roku was sending us emails with coupons cause I guess they thought we should upgrade. Anyways I liked the prospect of having no bid and using out hd tv to its full potential. So far so good. Totally different lay out from the old system but it is certainly an upgrade!", "verified": true, "helpfulness": "0/0", "author": "E. Landon \"Bo Jones\""}, {"rating": 5.0, "review": "If you don't have one, buy one!  These are so easy to install and they give you so many options. It replaces my old Wii for streaming and is so much easier by comparison.  It also gives me almost unlimited channels, including completely free ones, like PBS and the Smithsonian. Love it.", "verified": true, "helpfulness": "0/0", "author": "Razz51"}]