[{"rating": 5.0, "review": "Works like a charm, bought the square trade with it so there's really no risk!", "verified": true, "helpfulness": "0/0", "author": "Maureen K. Kerfoot"}, {"rating": 2.0, "review": "Bought this in August, stopped working end of October.  Bought two, the other one not used frequently, still works. Amazon will not let me return the product, outside 'return policy' - seems a bit 'gippy' to me.  I'll let you know about the other stick. Have had a Roku 'box' since 2012.  Still works great. Maybe worth it to spend the money since they don't stand behind their cheaper solutions.", "verified": true, "helpfulness": "0/1", "author": "Kayku \"K\""}, {"rating": 1.0, "review": "(UPDATE) Knowing that Amazon would almost certainly be discounting New Roku Sticks for the Holidays, I waited and then bought a new one for less than what the refurbished units are going for.  As pretty much expected, the new unit worked flawlessly and is exactly what I expected in a Roku.  For right now at least, the is zero reason why one should be considering a refurb unit.****** Original Review ******Buying refurbished items always carries a risk but often you can get great deals.  Having 2 Roku 3's that I've been delighted with I wanted to get something inexpensive that could go in my travel bag and double as a wireless receiver for my Surface Pro 3.  At $39.00 this looked like a good deal for something that I expected to just use occasionally at work and on trips.However it was fairly obvious from the moment I plugged this up and tried to use it that whatever QA is being applied for refurbishing these units is cursory at best, as while mine would boot and give me a menu, nothing else worked.  Attempting to return the unit to the reseller just gets you redirected to Roku Technical Support, where the process has essentially stalled.$10.00 really isn't a whole lot extra to get something that is new, almost certainly more thoroughly tested, and would absolutely be easier to get returned/exchanged.  In this particular case the savings isn't really worth the potential hassles.", "verified": true, "helpfulness": "10/11", "author": "M. Kohlman"}, {"rating": 4.0, "review": "Works well and provides streaming access to Netflix, Pandora, Amazon Prime, and Netflix.  Definite upgrade", "verified": true, "helpfulness": "0/0", "author": "A.R. Floyd"}, {"rating": 5.0, "review": "Works great. Exactly as described. Would recommend for anyone looking for streaming device.This one plugs into our TV for its power source as well. Eliminates cords everywhere. Neat space saver.", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 5.0, "review": "Exvelent product", "verified": true, "helpfulness": "0/0", "author": "Luis Alonso Alvarenga"}, {"rating": 3.0, "review": "The device is functioning as expected. I didn't find any difference with refurbished product. Streaming seems to be slow at times. When you start a channel it takes few seconds to load. The device seems to be fragile. The HDMI portion of device and tip of power cable can bend very easily especially if you placing device in tight spot. I wont be surprised if it breaks.", "verified": true, "helpfulness": "0/0", "author": "Shankar"}, {"rating": 4.0, "review": "After figuring out you have to let your router have access to ping, it works took me a few tries and a bit of reading to figure that out. And every once in a while I have to re-enter user names and passwords for netflix and amazon (the main reason I am taking off 1 star) it works great do not expect this to be lightning fast and buy a 3 foot USB cable to go with it ( this takes away interference to device), also make sure you plug in the power adapter or it will just keep booting over and over. They could have done a bit better but I gave it 4 stars because I like the Roku interface. Works great even at 1080i.", "verified": true, "helpfulness": "0/0", "author": "Russell"}, {"rating": 1.0, "review": "Stick remote failed after only an hour of use. First it took 2 or 3 button pushes to select a function, then it stopped all together. Changed batteries to be sure, but it was unresponsive. I read it might need to be paired, but I was already done with it. The fact that it is usb powered sounds like a plus, but it powers up/down with the tv, this means waiting thru what seems like an excessively long boot up. During install, it took almost an hour to download the software updates. I am sending it back and will look at the other types.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "The Roku keeps dropping the wireless signal, and I have to reboot it at least 5 times a day to get it to even be half functionable. I'm very disappointed. Not even bothering to return it. Into the trash it goes.", "verified": true, "helpfulness": "0/0", "author": "Paul Powers"}]