[{"rating": 4.0, "review": "the stick is a great idea, however the TV we plugged it into has the HDMI port in a way that we had to bend the stick a little to make it fit right. I only hope that it doesn't damage it long term. Service is great, ROKU is a great option for lots of extra shows and movies.", "verified": true, "helpfulness": "0/1", "author": "Victoria Colgin"}, {"rating": 2.0, "review": "Love the roku 2, wish I could replace this one!!! The only reason I haven't is because of the cost & it's in a bedroom that doesn't get used everyday. It shuts down at least once a month & has to be reset, which means every code from the wireless network to each service-- about a half hour 45 minute task for no great reason! Plus it is cordless, but only if your tv can support it. Totally recommend the roku 2 instead of this one-- if you want the tiny black box hidden get some 3M picture hangers & stick it on the wall behind your tv-- about the same look & works so much better!!!!", "verified": true, "helpfulness": "0/0", "author": "heather"}, {"rating": 1.0, "review": "Doesn't Work for Colombia", "verified": true, "helpfulness": "0/2", "author": "Sandra Gómez"}, {"rating": 4.0, "review": "Works as advertised. Menus system is slow, so I pick my movies via the web and then search for it using the stick menus.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far impressed, got this to work with a LG 32 inch (non-smart) tv, and the load times, available channels, and HD resolution have all been very good. For a price that is well below the full Roku box or even other competitors, but that (at least from reviews) offers more channels than Google Chromecast I highly recommend this device. Also I can sync youtube videos from my smartphone or tablet to play on screen! Maybe doesn't have all the bell and whistles but so far more than enough to get the job done!", "verified": true, "helpfulness": "0/0", "author": "DJ Exquiz"}, {"rating": 1.0, "review": "I really wanted to like this item, but it is going back to Amazon. At first I thought the item was great. It set up quickly and I was easily watching an Prime video. But the next day it was slow, slow, slow and then I could not get four clicks into Netflix before it started looking for a connection. I think I will just use an HDMI cable from my tablet and stream my Amazon and Netflix movies. It has to be easier than this.", "verified": true, "helpfulness": "3/3", "author": "JDT \"reader1958\""}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "pardeep kaur"}, {"rating": 4.0, "review": "Great product. I love it. Four stars only because the remote is not equipped with the headphone jack. No worries, I used Roku 2 wi fi remote with it that has the jack.Correction (9/2/14): Even though I was able to use Roku 2 wi fi remote that has headphone jack with this device, it turned out the signal is not transmitted to headphones in this type of setup. So it is useless to use this remote with the unit: headphones will not work. Regretfully.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 3.0, "review": "It's missing support to others languages and countries.", "verified": true, "helpfulness": "0/0", "author": "Luiz"}, {"rating": 4.0, "review": "Old plasma Tv is smart now!  Reasonably fast on netflix, though my visio 29\" smart tv is way faster.  It does have a strange flicker when playing through this device.  Subtle but noticeable.", "verified": true, "helpfulness": "0/0", "author": "cousinDan"}]