[{"rating": 2.0, "review": "This was very difficult to set up and I ended up having to return it because it would not work on my tv. I contacted roku customer service and they were not able to help and directed me to my internet provider and instructed me to turn off my firewall, change the security settings, etc. Nothing was successful. I spent weeks trying to figure this out. I own the older version of the roku stick that only works with roku ready tvs and it works great but the hdmi version just doesn't function properly. I may try the google chromecast as an alternative.", "verified": true, "helpfulness": "1/2", "author": "meg"}, {"rating": 3.0, "review": "Works well except for some \"region\" issues I'm having linking it to my account as a US \"local\". Am having a few issues with new wifi router and the ROKU being able to see it. Will probably buy a chromecast for my other TV though.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 4.0, "review": "Worked perfect for our need. Another outstanding product made available by Roku!", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 4.0, "review": "This stick provides the identical user experience as the Roku boxes. This is both good and bad. Good, because Roku has tons of channels including the three best ones - Netflix, Hulu Plus and Amazon Prime. Bad, because it has the same software glitch as the Roku boxes. Depending on which apps you install, the device will crash fairly often. We suffer through a handful of crashes per week but still like the Roku since it includes Amazon while our Apple TV does not. If Roku can get developers to fix their crashy apps this thing would be a perfect 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Fred"}, {"rating": 5.0, "review": "I have the basic 1st Gen Roku in my room when it first came out. I loved it since it was here for my back surgery. Now with other new things on I wanted to watch in the living room, but not unhook my other one. So I got this streaming stick shipped overnight because I couldn't wait. talk about easy installation! I plugged it in to my TV and then plugged the USB power cored into the available port. I don't have to worry about it losing charge.The biggest thing that I have noticed is that when watching Hemlock Grove or another TV Series, is that it will automatically play the next episode. I wish my 1st gen would do that. But that is ok, I might get another streaming stick when I get a new TV in my room.", "verified": true, "helpfulness": "0/0", "author": "Jeni \"Jeni\""}, {"rating": 5.0, "review": "Got rid of cable and am watching TV almost exclusively through the ROKU. I am very satisfied with the content available through Netflix, Amazon Prime, and the Fox all (for current episodes of 24). I never want to watch a show when it actually airs so this is a great investment for me. And this remote and interface are way better than the one from the Wii box that I was using. I actually bought a second one for another room.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "AWESOME!!!!!.....$50 I can watch it all on my TV.  Netflix, Redbox instant.  Incredibly easy hookup and setup. Blows away all others.", "verified": true, "helpfulness": "0/0", "author": "Olliesmucker"}, {"rating": 5.0, "review": "We purchased this item for a spare non-smart TV in the family room so that we could all watch movies and shows direct from netflix. I love How easy this was to set up for first time use, just plug it in and 10 mins later you are done! This comes with a simple remote control that even my 5 year can easily navigate. We've not had any issues with this product. I would and have recommended this product.", "verified": false, "helpfulness": "0/0", "author": "Marissa K."}, {"rating": 1.0, "review": "Would never work with any tv i have in the  house RETURNED", "verified": true, "helpfulness": "0/3", "author": "harmonyblue"}, {"rating": 5.0, "review": "Live in a rural area ~ Use with CenturyLink with almost no problems ~ Use two in the house (only needed one Netflix & one HuluPlus Account)", "verified": true, "helpfulness": "0/0", "author": "kbeachbear"}]