[{"rating": 5.0, "review": "Great value for money", "verified": true, "helpfulness": "0/0", "author": "DAVID J GODDARD"}, {"rating": 5.0, "review": "i love my roku because i can see some of my shows that l really love to see. And if you love cooking you can get some great recipe too.", "verified": true, "helpfulness": "0/0", "author": "Tracie Powell"}, {"rating": 3.0, "review": "I really like our Roku, but I bought this to go with our living room Vizio TV and didn't realize that it wouldn't fit. The stick plugs into our HDMI just fine, but when you plug the cord into the bottom to give the stick power, it will no longer fit in the space provided, so we couldn't use it. We bought the Roku 3 for the TV, which I love, and are using the stick on our basement TV.", "verified": true, "helpfulness": "0/0", "author": "elb"}, {"rating": 5.0, "review": "The people that sold this to me are awesome. And Roku stick is awesome. I use this thing all the time, so much so I bought two of these mothers. and bought my bro the roku2 and he's computer illiterate and loves it too. I be watching Netflix all the time and Amazon prime. not too mention they put Google Play up on there. If they added some iTunes it would be complete, but who cares I don't use that crap anyway.", "verified": true, "helpfulness": "0/0", "author": "martin crowder"}, {"rating": 5.0, "review": "Works perfectly. Why buy new when a refurbished product looks and functions like new? Be sure you realize that the roku stick needs to be powered via usb. If you don't have a usb port on your tv that is capable of powering the device (not all tv usb's can be used for power), you'll have to run the charger from an outlet.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Davis"}, {"rating": 5.0, "review": "It works great.", "verified": true, "helpfulness": "0/0", "author": "Alice Demarco"}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "Kelly E Matthews"}, {"rating": 5.0, "review": "Works exactly as advertised.  I would have gotten the Amazon Stick -- but, apparently they are having trouble in getting them in stock.  I can't really tell if there is any difference in the two as far as how they display info or the convenience of the remotes. I didn't want to wait a month for the Amazon, and for the same price this fills the bill.  I'm glad I went ahead and got the Roku.", "verified": true, "helpfulness": "0/0", "author": "Barton Brothers \"Bartbros\""}, {"rating": 1.0, "review": "I bought this as a Christmas gift for my husband and the stick has already stopped working with less than a month's worth of usage.", "verified": true, "helpfulness": "0/0", "author": "Kathleen A Johnson"}, {"rating": 5.0, "review": "Love it!  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Barbara Prestridge"}]