[{"rating": 5.0, "review": "Great device.  Works pretty fast as well for being so small.", "verified": true, "helpfulness": "0/0", "author": "Brian Daerr"}, {"rating": 1.0, "review": "I purchased this today from Walmart, why would any dummy put this out on the open market if it must be rebooted 30 plus to get it to work!  My thoughts this is worst than whale poop, it won't work with my Router (new too) is within in 20 feet of source, signal is good, download speed 18.46 Mpbs and 3.2 Upload.  Whomever thinks this is a great invention wasn't around when television was first invented - NAFTA is why we are stuck with crap like Roku....I would not recommend wasting your time or money, I am returning tomorrow.", "verified": false, "helpfulness": "1/2", "author": "DAVID S."}, {"rating": 1.0, "review": "doesn't work Netflix in Argentina", "verified": true, "helpfulness": "0/1", "author": "Victoria Busto"}, {"rating": 1.0, "review": "\"Certified refurbished\" Roku Streaming Stick.Device worked fine for about 40 days, then failed. No longer qualifies to be returned to Amazon. Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A must have for Acorn TV.", "verified": true, "helpfulness": "1/1", "author": "Marc R. Feldesman \"\"photo and computer geek\"\""}, {"rating": 1.0, "review": "If you have satellite internet youay not be able to stream.", "verified": true, "helpfulness": "0/0", "author": "Sunny"}, {"rating": 3.0, "review": "Although a big improvement from previous Roku's, this still freezes and hangs occasionally, and in general, is just not as fast. I prefer our Amazon fire stick, it's simply leaps and bounds above this.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Roku is easy to install, and gives me and my roomates all we need and more for tv watching. It has saved me over $140.00 a month by getting rid of cable tv", "verified": true, "helpfulness": "0/0", "author": "Desdoolittle"}, {"rating": 5.0, "review": "I have a Sony flat screen (with an HDMI port), which is a few years old, so I wasn't sure how this was going to work with my older TV. I'm not too tech savvy and my husband is worse so he usually lets me do the tech troubleshooting, but he was able to set this up in less than 10 min. The quality and picture is clear and sharp. After briefly streaming a couple of channels to test, I thought to myself (how fun this is going to be), and I swear that as I was putting away the packaging and box, the Roku box has my same thought written on its box, This is gonna be fun.", "verified": false, "helpfulness": "0/0", "author": "M"}, {"rating": 5.0, "review": "A breeze to set-up, works excellent!", "verified": true, "helpfulness": "0/0", "author": "james m. raby"}]