[{"rating": 4.0, "review": "Works great. Great size. Great price :-)Only complaint is that the software is sometimes slow navigating though Netflix. Other than that, it's awesome", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 5.0, "review": "The Roku stick is awesome. I am in love with it. Got one for each of the 3 TVs in my apartment. Absolutely recommend!", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "Great for turning any normal tv into a smart tv. Simple and intuitive, and for a great price. I'd recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "I have to say everything works as expected and I'm impressed but the load times are very slow but at half the price what did I expect. Better than chromecast but not as quick and smooth.  With this stick you  you get so much more streaming content than with chromecast it makes up for the wait times.", "verified": false, "helpfulness": "0/0", "author": "W. bowman \"amazon addict\""}, {"rating": 3.0, "review": "I heve one roku box and now for my bedroom a stick. I still have problems. Most of the time I cannot load a stream, while later I try it with the box, there it will stream", "verified": true, "helpfulness": "0/0", "author": "Maria van Daalen"}, {"rating": 1.0, "review": "Not happy at all with this. It takes a very long time to connect to Roku, and each time I try to connect to a new channels, something \"internal\" happens and I'm kicked out. What's the point of offering multiple channels when you can only get a few to work over several weeks?", "verified": true, "helpfulness": "0/0", "author": "R. F."}, {"rating": 5.0, "review": "I love this little Roku, it rocks.", "verified": true, "helpfulness": "0/0", "author": "Jeff Lucas"}, {"rating": 5.0, "review": "A thousand Roku channels and pretty much nothing to watch, and that's why I pay a monthly Netflix fee. Still, this little gizmo works - not at blazing speed - but it works, and the price is right. Don't buy this for Roku's programming. Do buy this if you want access to pretty much every fee-based streaming service, you want to lose your HDMI cable, and you're willing to wait a bit for stuff to load.", "verified": false, "helpfulness": "0/0", "author": "Jackie R."}, {"rating": 3.0, "review": "After I purchased at Amazon, found it at many local retailers for same price. Was easy to set up and operate.", "verified": true, "helpfulness": "0/0", "author": "Steve Davis"}, {"rating": 1.0, "review": "I have purchased many items off Amazon over the years. Typically, I have not had any problems or complaints about the items I bought. This can not be said about the Roku Streaming Stick. I had intended to upgrade my Roku-2 to either a 3, or a streaming stick, which is half the price. I chose the stick. A very unfortunate and wrong decision for me. To make matters worse, by the time I was ready to send the streaming stick back, the 30 days were already over. (I had the stick for a little over a week when I had to go out of town for two weeks.) So that almost ate up all the time I had left to return it back to amazon. So now I am stuck with this piece of garbage. I will now give you a rundown of the problems I had experienced with the stick since it arrived:First off, I plugged the stick into my Ethernet port and it fired right up. That was good. I was off and running quickly, and was happy with my decision to choose it, instead of the Roku-3. (A very short lived happiness) I then used the remote, and noticed a very big lag between when you push a button, and the response time. Very slow. My gaming systems and DVD systems respond quicker, and they are not even a dedicated video streaming device. And NOTHING compared to my old Roku-2, or even the original Roku I had purchased back in 2009. So the lag was obvious, but still, I was not too disappointed. At this point, I was standing directly in front of my TV, tinkering with the new gadget. When I got to my couch, I noticed that the remote only worked half the time. I would have to stand up and walk closer to the TV in order for the remote to \"Find\" the stick plugged into the back of my TV. My couch sits about ten feet from the TV, and I have never had any remote that had a problem \"Finding\" it's device within that distance. I also have many blue-tooth items, and every one is good within ten feet. (For anyone who does not know, the stick's remote is blue-tooth, not Infra Red, like the traditional remotes.)So by the time I got back from my vacation, I had already had the stick for three weeks. The lag and the \"Finding\" issue were still there, but I tried to make the most of it. I had considered returning it, but I do not like going through the process of returning items unless I have a great amount of money invested into them. And 50 bucks is not worth the headache I would have to endure. So I dealt with it. Over time, the remote got more and more unresponsive. I had to get off the couch about 3/4 of the times to get the remote to work. Towards the end, I would have to unplug the stick from the TV, and reboot. When this did not fix the problem, I finally unplugged the stick for good and re-hooked up my old Roku-2.I still have the stick, but I will most likely give it away, or throw it in the garbage.So there you have it. Roku has been in the video streaming business since around 2008 or 2009. I have purchased many Roku's for myself and for gifts. I love the products and have been very trusting with the Roku name. But this streaming stick is total garbage. I can not understand why Roku would ever manufacture something so terrible. Maybe I got a defect, who knows. If I had the whole 30 days to experience the glitches, I might have sucked it up took it back. But I was out of town for half the window of opportunity for a return. I was also optimistic and hopeful that some software update would come along and fix all my problems. So far that has not been the case. So that's my review of the Roku Streaming Stick. I hope this review is helpful, and I thank you for your time in reading it.", "verified": true, "helpfulness": "49/61", "author": "John Josey"}]