[{"rating": 2.0, "review": "Never could complete the installation.  Had the same problem with ChromeCast device.", "verified": true, "helpfulness": "0/0", "author": "wlv-bill \"bill-wlv\""}, {"rating": 2.0, "review": "Promised a lot of fun, delivered a lot of frustration.I have a Roku 1 and have loved it for many years. Decided to upgrade so I could get the PBS channel. The stick did not work with my TV. Troubleshooting on the Roku site was minimal if your screen is blank. Unless you want to wait 34 minutes to chat with a representative, who never showed up.I spent multiple hours trying to get this to work, and finally googled the device name with my TV model, and found out through an independent Roku forum (not associated with the company) that this device would not work with my TV.I'm giving it two stars because of poor information, hours of wasted time, and poor customer service from Roku. Very disappointing. It gets two stars and not one because I like Roku in general.", "verified": true, "helpfulness": "0/0", "author": "A. Hollingsworth"}, {"rating": 3.0, "review": "Love it except it overheats and performance suffers. Unfortunately there is no way to turn off the power from the remote. My solution is to unplug it at least once per day. This is my first Roku and I really am impressed with its performance when not overheated.", "verified": true, "helpfulness": "3/3", "author": "Alison Arnold"}, {"rating": 5.0, "review": "Awesome product.  Amazingly convenient and small.  Love that it plugs right into HDMI slot so no need for an extra cable.  Only down-side is that it is a little slow in processing commands compared to the Roku 3, but at 1/2 the price, small form factor, and same video quality it is really pretty darn good!", "verified": false, "helpfulness": "0/0", "author": "Eric Arner"}, {"rating": 1.0, "review": "Took FOREVER to update and continued to update every time i tried running a program like netflix.  Also didn't receive signal from my wireless router on the second floor.  Could only get it to work with the tv's on the same floor as my router.", "verified": true, "helpfulness": "0/0", "author": "rich dibble"}, {"rating": 5.0, "review": "I dropped cable but wanted more options than just free TV.  None of the TVs in my home had a wireless connection. I did not want to be stuck to my cell phone watching Hulu and Netflix. I added this little device to my TV and was instantly connected to a variety of channels I now love but never knew existed. I also have a Roku LT but the streaming stick is better for the wall mounted TV. No wires hanging down since the power source is through the USB connection on my TV. Also this Roku is a better version from the LT because I can access the individual accounts set up on my Netflix account.  The LT model only lets you access your main Netflix account.", "verified": false, "helpfulness": "0/1", "author": "Sheila Lafrance"}, {"rating": 2.0, "review": "The remote barely works!!!!  I've had this about a week, and I actually DO like it.  I'm a linux user and I was fed up with the fact that none of the on demand internet video streaming services support Linux (and some of them actually go out of there way to break Linux compatability when it would otherwise work)...  so, I bought a Roku.  I love the fact that MIT OpenCourseware is on there... and I like the idea of what it should do...Unfortunately, I can only get it to work about half the time because the remote is absolutely useless.  I can't tell if it's defective or just poorly designed but it prevents my ability to actually use this thing.", "verified": true, "helpfulness": "0/0", "author": "Teri Pearlman"}, {"rating": 1.0, "review": "Remote stopped working for some time then the stick keep restarting itself. A hard reset fixed the problem and all is well again.Update as of 6/22/15 Roku stick doesn't work anymore. I keep getting a no signal message on my television this has been going on for several months now.", "verified": true, "helpfulness": "0/1", "author": "Luv2shop \"L.C.\""}, {"rating": 5.0, "review": "I had never heard of this before my son requested it.  I am seriously thinking about changing from cable to this.", "verified": true, "helpfulness": "0/0", "author": "becky buckley"}, {"rating": 1.0, "review": "This thing seemed like a great deal but the streaming quality was poor. Always disconnected or lost signal. Replaced with my Apple TV and the problems stopped.", "verified": true, "helpfulness": "0/1", "author": "Bfow"}]