[{"rating": 5.0, "review": "This ROKU streaming Stick was easy to install. Just plug it in and follow the instructions. The hardest part was keying in the information .", "verified": true, "helpfulness": "0/0", "author": "John Seltenrich"}, {"rating": 5.0, "review": "This latest version of the Roku is very portable and easy to setup and use!It also extends the life of my older TVs that do not have WiFi!", "verified": true, "helpfulness": "0/0", "author": "Awk.Doctor"}, {"rating": 4.0, "review": "My experience with roku 3 was so great I decided to buy another roku for the other tv in the house. I decided to try roku streaming stick. The setup was quick, there were some pre- bundled channels like blockbuster which prolonged setup time but anyway it's a one- time thing.Roku stick us as fast as roku 3, I primarily used plex and YouTube so can't speak for other channels. Very very pleased. Picture quality and sound quality great! App response as good as my roku 3.The initial concern I had was the remote. It was unresponsive after a few minutes and then I sort of have to point to the stick at back of the tv for it to work again. This would have been a deal breaker for me. I theN thought to connect to a different wifi range and that solved the remote problem. If you have both 2.4 and 5.0 ghz wifi, try connecting to 5.0. It fixed the responsiveness of the remote in my case. I guess less interference.I was lucky my router supported both ranges and have an option to choose the wifi to connect. For this reason I'm giving a 4 star instead of 5.", "verified": true, "helpfulness": "0/0", "author": "twinstar"}, {"rating": 3.0, "review": "The picture quality compared to an xbox 360 on the same TV isn't that great. I don't like how much room near my 3 hdmi ports it takes up. We are now only able to have 2 hdmi's in use at a time (RCA 46\" TV). We have decided to just take it back and get a Boxed type one with a regular HDMI cable.As a first-timer to roku I do really like the idea! We decided we no longer want our Xbox controllers to come up missing (2 kid's in the house). So we needed something like this with an actual remote. We looked into Chromecast but, decided against it because of the lack of a regular remote (must use smart device as controller). The best part about Roku's is if the kids loose the remote it's their own fault until they find it. We still have the option to download the app on our phones.", "verified": false, "helpfulness": "0/1", "author": "Amanda Zych"}, {"rating": 4.0, "review": "I got this to be able to replace my Roku 2 which needed an electrical outlet. The stick works fine on the back of my TV without wires. It seems to work at the same speed at the Roku 2 & has the same remote.", "verified": true, "helpfulness": "0/0", "author": "Marshaleigh"}, {"rating": 4.0, "review": "This is pretty much like every Roku gadget out there except for one thing, it's small size. This device is the size of your common thumb drive (well it is essentially a thumb drive with Wi-Fi capability). Plug it in your TV's HDMI port then connect it to a power source like your TV's USB (depending on your TV's model most modern Smart TV bought within the last year has a USB capable of supporting it) or a power socket with the included adaptor and you're good to go. Come with a remote control or you can control the streaming stick with your Roku app (download for free from your favorite Apple or Android apps store). I'm not sure how the local file streaming works but it probably works only for \"authorized\" content you buy from the Google store. I tried streaming my home made videos (AVI, XVID or DIVX, MP4 encoded format) but doesn't seem to work. If you want a portable Roku device you can take with you for travelling then this device is a must buy. If you already have a Roku device or Apple TV then this device does not offer anything new.", "verified": true, "helpfulness": "1/1", "author": "K. Te \"Gadget lover\""}, {"rating": 5.0, "review": "wtg roku!!!!!!!!! this is a winner. works great. plug it in, set it up, and off you go. love roku", "verified": true, "helpfulness": "0/0", "author": "steven lapham"}, {"rating": 1.0, "review": "I installed the Roku Stick and it worked for 5 weeks. Now it wipes out my information and reboots every five minutes. Tried to contact Roku \"support\" - waited on phone for 5 minutes then hung up. Tried to use Roku Live Chat - 10 minute wait. I am out $50 because the stick crapped out 5 days after return deadline and warranty deadline", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased this product for training purposes on the RE/MAX Channel. I was happy with the product and bought one for home use too.", "verified": true, "helpfulness": "0/0", "author": "Celia Chesno"}, {"rating": 5.0, "review": "Love it, don't even notice it's there. A little slower processor than my Roku 3, but at half the price and about 1/20th the size, I can deal with.", "verified": true, "helpfulness": "0/0", "author": "Michael D. Pabian \"chicagohusker\""}]