[{"rating": 4.0, "review": "Good enough for a secondary TV. I also have a roku 3 on my primary television and the remote and search functions are much better and faster on that device. Got it for my bedroom so I could get rid of my HD cable box which only worked half of the time. No problems hooking up or buffering with streaming.", "verified": false, "helpfulness": "0/0", "author": "jhawk booklover \"Dee\""}, {"rating": 1.0, "review": "I own a roku 3 and it works most of the time. And for the most part I am happy with its performance. I bought the streaming stick thinking it would work as well if not better. I spend 90% of the time trying to get it to connect to the wifi and when it finally does it almost immediately drops the connection. Don't waist your time or money on the steaming stick spend the extra $50 and get the 3. This device is frustrating and constantly not working. I am surprised roku let this one hit the market honestly. It's a giant step backward from the direction they wet heading in.", "verified": false, "helpfulness": "5/5", "author": "William Holton"}, {"rating": 2.0, "review": "I have not been happy with this at all but the time frame to return was apparently only one month. It is extremely slow. I remove the batteries and replace them all the time trying to get it to respond.", "verified": true, "helpfulness": "0/0", "author": "Ed Kayo"}, {"rating": 5.0, "review": "This is a great product! With good wifi and internet speed the stick works perfectly. No lag,etc. No need for the Roku 3. It is a great interface for watching Netfix (my main use) and there are lots of interesting channels to round out my viewing. However...I thought cutting off cable, I would be able to  watch my tv shows for free with internet tv and buy HBO, etc. Wrong! You have to have a network subscription through a carrier to watch even limited programming unless you want to buy episodes for $2-$4 each. You have to have a carrier before you can even buy HBO. This is not a cheaper way to watch tv and programming is very limited. That said, I am very happy to put it all behind me and just stream real movies with no commercials and that does save LOTS of money! I now get my \"fix\" with a movie or two and retire to actually read and better myself. Overall, I am very happy with this product and my new lifestyle...", "verified": true, "helpfulness": "0/0", "author": "Rick Peterson"}, {"rating": 1.0, "review": "I have yet to get it to work", "verified": true, "helpfulness": "0/0", "author": "Myron L Keller"}, {"rating": 5.0, "review": "It works flawlessly and I connected my iphone as an extra remote. You can even use it on several Roku devices which makes it superior to the Apple TV in regards to using the iOS devices as remotes. Worth the purchase and I plan in buying a few more to stream TWC on TVs in my other rooms! Worth it.", "verified": true, "helpfulness": "0/0", "author": "MusicDefines"}, {"rating": 5.0, "review": "working", "verified": true, "helpfulness": "0/0", "author": "Armando Garcia"}, {"rating": 5.0, "review": "Very easy to set up and use. Great!!", "verified": true, "helpfulness": "0/0", "author": "deborah b cook"}, {"rating": 5.0, "review": "Totally hooked on this device. I finally cut the cord except for Cable Internet. With OTA antenna, this Roku, and subscriptions to Hulu+ and Netflix, I have more shows than I can watch, including a lot of first run offerings. The only drawbacks I can find are that there's no good search function within the Netflix interface - you can search through the main screen, which searches all channels - and there's a delay loading the Netflix main page. I have a pretty fast Internet connection, but there is still a relatively long buffering period before the show starts. Hulu+ also has a bit of delay loading, but none of the others that I can tell. It's well worth the investment for anyone looking to cut the cord. My cable bill is going down from $136 a month - without any premium channels - to a little over $50 a month. Ray Charles can see the bargain!", "verified": true, "helpfulness": "0/0", "author": "IDIrishbiker"}, {"rating": 5.0, "review": "This is great.  almost use it every day.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Freeman"}]