[{"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Federico Blankleider"}, {"rating": 3.0, "review": "As most reviews have said it is slow streaming at times so if that's annoying get the upgraded version.", "verified": true, "helpfulness": "0/0", "author": "S Parker"}, {"rating": 5.0, "review": "This is my second roku and I love them both.", "verified": true, "helpfulness": "0/0", "author": "carolyn garbett"}, {"rating": 1.0, "review": "Like others, I have had nothing but problems with this.  Cannot get surround sound with this.  Major flaw.  Had to buy another regular Roku to replace this.  Do not recommend buying this!", "verified": true, "helpfulness": "0/0", "author": "J. Simpson \"grammyrocks\""}, {"rating": 2.0, "review": "The remote and stick frequently lock up, requiring you to remove the batteries in the remote and/or hit the reset button on the stick.  It's a bit slow but this is expected for such a scaled down device compared to a full blown Roku 3.  However once a stream has started it seems to work pretty well - especially on Netflix.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "1. There is a serious problem with the ROKU streaming stick mis-synchronizing the audio with the video image. The audio lags behind the image so much (perhaps as much as ~300 milliseconds) that it is unpleasant to watch, especially when people on screen are speaking. This is not a problem with the internet connection. Two other ROKUs, one older and another newer model, work normally when connected exactly the same way to the same television (50 Mb/sec internet, HDMI at 1080p, 2-channel stereo, latest ROKU system upgrade.) HD and SD program material exhibit the same synchronization problem. Cycling the power off and on--either briefly or for 15 minutes--does not solve the problem.2. The quality of some of the push buttons (especially the important DOWN rocker button) on the new remote control provided with the 3500R seems inferior compared with the other two ROKU remotes that have been used for more than a year without similar difficulty.3. Except for those problems, the 3500R offers more bang-for-the-buck than current competitors. The choices of available program material are extensive and continue to increase. The direct HDMI connection saves space and is potentially much neater than ROKU (or other) boxes with two or three cables attached. Unfortunately if the USB port on your TV powers off when the set is switched off, then you must wait for the ROKU to reboot each time you turn on the set, or otherwise use the provided ROKU AC power supply.Now if only the A/V sync problem can be solved...", "verified": true, "helpfulness": "0/0", "author": "Nemo54"}, {"rating": 5.0, "review": "Works great - easy to install - makes watching online series & Films on TV much simpler", "verified": true, "helpfulness": "0/0", "author": "Linda Wallace"}, {"rating": 5.0, "review": "I like it very much. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Virstine Wells"}, {"rating": 5.0, "review": "What can I say. I love movies, my Roku stick, and God.  But not necessarily in that order.  Well, I was in the hospital for a couple of months and on my back at home after surgery.", "verified": true, "helpfulness": "0/0", "author": "Sligitz"}, {"rating": 3.0, "review": "Love it!  Works perfectly as advertised.", "verified": true, "helpfulness": "0/0", "author": "Laura DePaul"}]