[{"rating": 1.0, "review": "Packaging was fine, took it from the box and followed all the instructions (5 times) and still couldn't get it to work.  I don't profess tobe a brain about computer problems, but I do somethings.Anyways, I couldn't get it to work. I know how to find the right channel and all that. Did the reset thing on the stick, nada. So to be honest I can't say for sure its not me, but I couldn't get it to work. Still looking for support, glad I didn't pay that much to start with.  ;)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This item does not work long term.  The positive reviews on here must be made early on after getting the item. This roku stops in the middle of my shows every time now and I have to do a factory reset. After going through the whole process to set it up, it encounters same problem and I start over. Now I have to factory reset in the middle of every episode. I looked it up and apparently a common problem. Look up \"roku loads to 25% only\" and you'll see what I mean. I'm tired of messing with it. Now it's too late too return it of course so I'm just stuck finding another means to watch my Netflix. Don't waste your time.", "verified": true, "helpfulness": "0/0", "author": "rachel"}, {"rating": 5.0, "review": "Fabulous.", "verified": true, "helpfulness": "0/0", "author": "CARLA BAKER"}, {"rating": 1.0, "review": "doesent work fully outside the USA", "verified": true, "helpfulness": "0/0", "author": "ALEJANDRO ITALIA"}, {"rating": 4.0, "review": "For a review on Apple TV vs Roku Stick | Which format will fit you best?https://youtu.be/SHmGVpLVTtI", "verified": false, "helpfulness": "0/0", "author": "Jade Studios"}, {"rating": 4.0, "review": "Granted I'm not th typical user of Roku, or telivision as I'm blind, however I have a Chromecast device that I can use with my phone, and so when I read reiews about using your smartphone as a remote, I got excited because Amaon doesn't allow casting on Chromecast, and there are a lot of videos that I like to, azon  Unfortunately, this only allows you to use your smartphone as a replacement remote.I still have respect for Roku, as there are a lot of features tha are offered that Chromecast doesn't, such as channels, so essentially buying a Roku is the same as buying a cablebox without th monthly plan, which is why I'm giving this to my sister to use instad of returning it, as I now itll get plenty of use.\"watch, on Am", "verified": true, "helpfulness": "0/0", "author": "J. Roberts"}, {"rating": 5.0, "review": "Great entertainment good price", "verified": true, "helpfulness": "0/0", "author": "J.  Biv"}, {"rating": 1.0, "review": "Can't get this to work. And everyone I  spoke with on-line for help wants to charge me 50-100 dollars. I thought buying this was all I needed besides a membership to Netflix,hulu...can't seem to get it working.", "verified": true, "helpfulness": "0/0", "author": "Sandra Taylor"}, {"rating": 4.0, "review": "Love my Roku. The streaming stick does perform much slower than the more expensive models. It sometimes hangs up and you have to wait for it to catch up. For this reason I think I would have been happier upgrading. If you do not mind 10 - 15 second periods were the Roku does not seen to respond then this model will work just fine for you. This issue just happens when navigating menues and does not effect the streaming experience. Videos stream smooth, great HD picture and sound.", "verified": true, "helpfulness": "0/0", "author": "PoorPauly"}, {"rating": 5.0, "review": "Great product and price. I was not disappointed!", "verified": true, "helpfulness": "0/0", "author": "Wayne M. Griffin"}]