[{"rating": 2.0, "review": "When watching Netflix it seems to work okay but some other apps seem to take forever to load the video. When using the build in Roku media player to play from DLNA sources or the Plex media player to play from my personal server the videos can play poorly due to network performance. Comparing it to my Chromecast it's network performance is poor.", "verified": true, "helpfulness": "0/0", "author": "Amos A"}, {"rating": 4.0, "review": "Very good I love it...", "verified": true, "helpfulness": "0/0", "author": "Carlo J."}, {"rating": 5.0, "review": "I don't have cable just internet , so  I got  the Roku to watch more programs and movies on my tv  most of the free movies are very old movies  or B movies  so I am trying Netflix that comes with Roku  but you have to pay for it  first month is free to try it... I got it in HD it is $8.99 a month , there are a lot of tv shows and movies even some newer ones and documentaries .  Roku had OPB public broadcasting , and cooking religion and sports, news , yoga and stuff for the kids,, all free, and  more . I was disappointed in the free movies though ,they do have better and newer movies  you can pay for . but I find it is cheaper in the long run  to get Netflix then to pay for just one movie at a time.or to pay for an app,  I would recommend the Roku stick was very easy to set up and stays on what whatching a movie  streams in very well , I have the Chromcast as well but I like the Roku much better Chromecast  stops on me when watching movies never get to watch the whole movie ..", "verified": true, "helpfulness": "2/3", "author": "tin"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Kathleen B."}, {"rating": 1.0, "review": "This product worked great for the 1st month.  Since then, the product has been glitchy and often times the controller doesn't work! Extremely frustrating.  I would definitely try Apple TV or Chromecast instead", "verified": true, "helpfulness": "0/0", "author": "jk93"}, {"rating": 4.0, "review": "Like it, but sucks you have to run a power cord to it", "verified": true, "helpfulness": "0/0", "author": "M&M"}, {"rating": 4.0, "review": "very cool, small size.  the older version seemed to work a bit faster though, especially hard wired.", "verified": true, "helpfulness": "0/0", "author": "MIC"}, {"rating": 4.0, "review": "Sometimes it will stream a video and then stop. Then it will load, play a few seconds, and then stop again. And then it will load and then play a few seconds... REPEAT. To fix this, I have to turn the product off and back on (unplug and plug back in). It happens about once or twice a week. Still worth the $50 though", "verified": true, "helpfulness": "0/0", "author": "J Ellis \"BigBuffBibleBoy\""}, {"rating": 3.0, "review": "does not work in hotel room tvs where you must connect to the WIFI through a browser portal unfortunately :(", "verified": true, "helpfulness": "0/0", "author": "Shay Bricker"}, {"rating": 5.0, "review": "The JW Broadcasting Tab works beautifully and the information is fantastic.  Also I appreciate the Amazon tab for movies. Thank you.", "verified": true, "helpfulness": "2/2", "author": "george anagnosti"}]