[{"rating": 5.0, "review": "Already have two other Roku devices. Purchased this one because of the portability. Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little guy is quite amazing. Great addition to our sun room television.", "verified": false, "helpfulness": "0/0", "author": "Nicholas"}, {"rating": 5.0, "review": "This is a great way to watch Streaming Videos", "verified": true, "helpfulness": "0/0", "author": "Ronald"}, {"rating": 5.0, "review": "I don't know why some consumers are stating it lags. We use verizon fios and the Roku is way faster than Xbox live. I honestly like it more than my dad's $200 Roku!", "verified": true, "helpfulness": "0/0", "author": "Kenzie Taff"}, {"rating": 5.0, "review": "Beats the chromecast on all fronts, love the remote, easy streaming, easy setup.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "We have a Roku 2, and we wanted to get one that could get the updated Netflix app, went with this one for 2 reasons 1) cost (obviously) and 2) no cords! What could be better?!Having something that works for more than a few months.  I can't give you an EXACT time frame,  it just started slowing down, but we blamed the internet (buffering!) Until somewhat suddenly- poof! Stopped. (Or rather started restarting itself repeatedly- never getting to the home screen- just the logo, bouncing and bouncing.) What we've noticed is Rokus (both our still kicking Roku 2 and the dearly departed streaming stick) get SUPER hot. So while we bought this because I use Netflix WAYYYYY more than I should and wanted convenience, we now have one Roku we move between rooms until we buy something new.Great idea for a product- lacking in execution- would be great if it didn't overheat.", "verified": false, "helpfulness": "3/4", "author": "J. S. Simm"}, {"rating": 4.0, "review": "Just a touch slower than a Roku 3 but great for bringing along on trips if your hotel allows you to use an open HDMI input.", "verified": false, "helpfulness": "0/0", "author": "Ron V"}, {"rating": 5.0, "review": "We had a Roku box before. This is MUCH better and worth the expense!", "verified": true, "helpfulness": "0/0", "author": "Christina Marie Hathaway \"C Hathaway\""}, {"rating": 4.0, "review": "excelent device!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"[C]oRtAdO\""}, {"rating": 5.0, "review": "ROCKING ROKU!So I bought one ROKU from the H**shopping guys because it was on Easy Pay and if it did not work u could return after 30 days, so I tried it, and was blown away with the results, my HDTV colors are even more vibrant , so been a Prime Member I got the second one from Amazon . I'm not sure why people are complaining and blaming the stick because they have a poor Wifi signal, if it is protruding in an area where u have high traffic- then move your TV elsewhere , don't take away a star from the Stick, because this has nothing to do with the stick, set up was fast for both sticks, I downloaded the ROKU app on my IPad & phone , so I can use that as a remote as well. I have the Prime and it was easy to register the two sticks and start streaming, no issues and I am using the USB. Lots if channels, just pay for what you want. Hello !!im cutting my $200 dollar a month cable bill, so I have already bought the Amazon Basic High Performance Antenna getting 25 HD channels so far. Awesome! Get off the fence and get a stick, it's worth every penny!! Also it so easy to cast from YouTube with no problems, I had my mini casting to TV , my son on his Ipad , and no glitches on the Stick", "verified": true, "helpfulness": "0/0", "author": "Liz M J"}]