[{"rating": 1.0, "review": "The remote control for this device would't sync up with it. I reset the whole thing a couple times, changed the battery, then contacted Roku customer service. The only way to do this is through online chat. I waited over an hour for a representative to be available. He helped me trouble shoot the device for about 10 minutes, then said he can't fix it, and told me to have a nice day. This whole thing was a serious waste of time, with no tech support available to speak of. Sending it back and ordering another Amazon Fire TV, which is incredible, and is backed by Amazon's amazing customer service.", "verified": true, "helpfulness": "1/2", "author": "TCA"}, {"rating": 5.0, "review": "This is a wonderful little device for streaming video from online services. We have it for our guest room so that our visitors can access Netflix and Hulu plus. It is easy enough for my parents to use and just plugs right in to the TV! Another great product from Roku.", "verified": true, "helpfulness": "0/0", "author": "RML"}, {"rating": 5.0, "review": "Plugged it in, programmed it and worked the first time.", "verified": true, "helpfulness": "0/0", "author": "Peter S Myers"}, {"rating": 5.0, "review": "I really love this little guy - my older Roku II had taken to freezing up and randomly rebooting itself, so I chose to upgrade to this one.  The small form factor rocks, and even though there is an optional wire, it's fairly unobtrusive on my setup.The new interface is clean and easy to navigate, and the tons of channels are a plus.Installation was truly plug and play, just plugged it in and waited for it to boot, then set up my Netflix and Amazon Prime accounts, got Plex setup and was off and running.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love ! Love ! Love it and kids love it . Easy set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "darlene dobbs"}, {"rating": 2.0, "review": "Purchased and returned it the same day. First problem was it has to be just in the right spot on HDMI port or TV wont recognize it. Had to be only partially in the port on mine. 2nd problem was setup, never could get it to work. 3rd problem was heat, within a few minutes it was extremely hot to the touch. I own a roku 2 and a roku 3. They work perfect. I'll stick with those.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is like having satelliteMany free channels and movies but you can also rent movies and subscribe to channels if you likeI watched Sleeping Beauty ballet the other night on the free PBS channel", "verified": true, "helpfulness": "0/0", "author": "artynolagirl"}, {"rating": 5.0, "review": "Bought this for my bedroom TV. Couldn't be happier!  I have a Smart TV.  Hated it.  Roku gives you more bang for your buck!", "verified": true, "helpfulness": "0/0", "author": "ca"}, {"rating": 4.0, "review": "wish it had game apps and perhaps a full feature remote", "verified": true, "helpfulness": "0/0", "author": "Ed R Martin"}, {"rating": 5.0, "review": "After the HuluPlus app on my Wii stopped streaming well, I needed another solution. After researching the many options out the (Apple TV, Amazon FireTV, Google Chromecast), I decided on the Roku stick. Like the Chromecast, the main benefit was that it plugs discreetly into the back of the TV and requires no space like a box does. What won out was that it comes with a remote and doesn't rely on using my phone. I know that some people will prefer the reverse, but this fit with our TV usage habits. It performs great, with smooth streaming over my home WiFi. It takes several minutes to bootup, but after that the navigation of the menus and apps is quick. There are many apps, and everything is customizable.", "verified": true, "helpfulness": "0/0", "author": "MICHAEL OSULLIVAN"}]