[{"rating": 4.0, "review": "Nice interface. Easy to use and set up. Only downfall is its a little slow. I have the Amazon fire TV stick and to me, the Amazon is a little better value. But u can't lose with either the Amazon or this Roku.", "verified": true, "helpfulness": "0/0", "author": "Duangdee Phommalee"}, {"rating": 5.0, "review": "Roku by far is the best product I have used for watching my everyday television. And the HDMI Streaming sticks make it even easier. 5 Star.", "verified": true, "helpfulness": "0/0", "author": "Air Force Vet \"Silenced\""}, {"rating": 5.0, "review": "Great item, provides excellent programming options.", "verified": true, "helpfulness": "0/0", "author": "rwscls"}, {"rating": 5.0, "review": "Every bit as useful as my Roku 3. For reference, our Roku stick is about 10 feet thru 1 wall to the wireless router. We have not had any lag or connection issues (like we did with chromecast) to speak of. We mainly use Netflix, ESPN, and Plex, all of which have worked seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 2.0, "review": "Worked pretty well for a while, though the Netflix app seems to be more than the little CPU can handle--lots of lag from remote, especially while playing. Other apps/channels seemed fine.After about 9 months, it started randomly falling off the wireless network and needing to be power-cycled. I moved the access point from the back of the house to the living room to see if it made a difference, but it kept happening. Now, a couple weeks later, it has completely lost its memory: every time I turn on my TV, I have to repeat the entire initial setup, including pairing the remote, entering the wireless password, and re-registering it with Netflix and Amazon. So I guess it's back to the PS3 for me. Not going to buy another Roku.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "We have a traditional roku in every room of our house, and we love them.  We decided to give the stick as a gift, and they love it! Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Kelso"}, {"rating": 5.0, "review": "Five stars, no question, based entirely on the quality of customer support. I had an issue with my Roku Stick and found it easy to get in touch with Roku, and real people kept in regular (and proactive) contact with me. The device itself is really, great, too!", "verified": true, "helpfulness": "0/0", "author": "Justin W Hurwitz"}, {"rating": 3.0, "review": "The stick takes a lot longer to load than the actual Roku device.  Overall since it is small and hides behind the tv its good. But it would be nice if it didn't take so long to load.", "verified": true, "helpfulness": "0/0", "author": "Melinda M. \"Melimine\""}, {"rating": 1.0, "review": "First Roku device I've ever hated.  Loved all the prior versions I had, and the tech support always rocked as well.  I even got my friends and family to buy Roku devices.  Double fail on product and support with latest streaming stick.  Latest device is slow and when it constantly had to be reset by unplugging/restarting, I was told to change my wifi IP address settings, then had to reconfigure the thing 3 times using hacks and secret screens that I googled myself.  **Incidentally, if you have to reset it to factory default as support will request, it will lose the update that fixes a bug preventing it from connecting to wifi in the first place.  That's a fun catch-22 to get around, and you would think support would warn you about it before requesting you to complete that 'troubleshooting step'.  After hours of my time, it's 'working' again but it's the slowest Roku device I've ever owned.  Tech support has clearly been outsourced and no longer empowered to replace faulty devices and/or heavily incentivized not to, or maybe Roku doesn't presently have a better device with which to replace it.  I'd go back to using my previous Roku, which was far better (stability and speed), except it doesn't support Netflix profiles, now a must have for my family.  :(  Chromecast here I come.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Haven't used this Roku yet but if like my other it will be a fantastic addition", "verified": true, "helpfulness": "0/3", "author": "flyboy"}]