[{"rating": 5.0, "review": "Excellent value in entertainment", "verified": true, "helpfulness": "0/1", "author": "Myles Jackson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love our Roku!!  So much more to offer", "verified": true, "helpfulness": "0/1", "author": "Dennis Hice"}, {"rating": 1.0, "review": "Worked great for a while but then would not connect.  Replaced it with a Fire Stick", "verified": true, "helpfulness": "1/1", "author": "Bill Esposito"}, {"rating": 4.0, "review": "given as gift", "verified": true, "helpfulness": "0/0", "author": "julie sloan"}, {"rating": 4.0, "review": "The Roku is a great product ,that puts everything available for quick access ,and i love there is no monthly fee .", "verified": true, "helpfulness": "0/1", "author": "tammy miller"}, {"rating": 5.0, "review": "Everything's fine", "verified": true, "helpfulness": "0/1", "author": "Roberto Alvidrez"}, {"rating": 5.0, "review": "Love, love, love it. Easy to set up. Works like a charm.", "verified": true, "helpfulness": "0/1", "author": "Suzanne Dickey"}, {"rating": 5.0, "review": "Works great!  Now I don't use cable and saved $170 a month.  I bought a new car(2013) with payments of $170 a month!  My favorite car, a Fiat 500!  See what happens when you lose cable and get Roku?Also, I have to take my tinier TV to live temporarily at my rented home out of state to get a new renter this summer.  I get to see TV without cable there.  I use a wireless device on my laptop for a few weeks.  Made in the Shade!And I don't have to deal with the ugly cable companies.  Also, HBO GO will be selling their shows directly to customers in April!  Great for customers. Bad for cable!", "verified": true, "helpfulness": "0/0", "author": "Lee J(Female) \"nvizhon\""}, {"rating": 2.0, "review": "After hearing of so many great things about Roku, I decided to buy one of these streaming sticks. Out of the box setup was lengthy, but nothing hard. Thought it was a little weird that credit card info was mandatory, but I can look past that (lots of companies do it these days, so I hardly fault them for it). Connected to my wireless signal (which was full strength, this is important later), downloaded the software updates and channels, and I was good to go. I open the Netflix app and get a connection issue - that's fine, I'll just try again. I attempt to reconnect and am able to watch Netflix, and get about two episodes in before I needed to leave the house. I came back to start it up again, and ever since then, I can't connect to the internet. I've changed the channel on my router to a less crowded one after reading that sometimes this can be a bandwidth issue, but that didn't work. It was able to connect to the wireless signal, but not the LAN, which I find odd because I don't have MAC address filtering enabled, so it's not like my router was blocking it. After a day of the same troubles, now it won't even find my connection's SSID. And when I manually enter it, it basically says it can't find a network by that name. I know it isn't my signal strength because I have at least 3 devices in the room and adjacent to the one the Roku that are connected to the internet at full strength. After two days of smashing my head against the wall, I've finally just unplugged it. I'm not going to return it just yet, because I like to fully make sure something doesn't work before I send it back in. I'll update when/if it decides to work again, because I really enjoyed that lovely 40 minutes I got out of it before it crapped out.", "verified": true, "helpfulness": "2/3", "author": "Keegan Johnson"}]