[{"rating": 1.0, "review": "I have an older Roku that I love... so when I ordered this, I'll admit I had high expectations. I expected this to... at the very least... work. It doesn't. Netflix is stuck on the same screen all of the time. I cannot browse or play anything. I cannot access my HBO go account. I am able to get on to Amazon, but the streaming freezes every thirty seconds. My internet speed is more than sufficient to accommodate streaming. To top it off: the remote sticks. So in the rare instance that I'm able to access an app, the remote speeds past any options I could possibly make.It's going in the trash.", "verified": true, "helpfulness": "0/0", "author": "mak85"}, {"rating": 5.0, "review": "if you need to by pass the credit card info none of the links out there works as of 7/9/15. I chatted with an agent and gave me this link. [...]Hope it works on by passing cc info to sign up.", "verified": false, "helpfulness": "0/1", "author": "badger"}, {"rating": 5.0, "review": "I wish I had purchased this a long time ago. I love the roku stick! Thank you for the fast shipping and a great product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Had to tape the powed cord in a way to get it to power up, remote doesn't work.", "verified": true, "helpfulness": "0/1", "author": "William"}, {"rating": 4.0, "review": "I recommend downloading the Roku app. The remote is garbage but the stick is awesome.", "verified": true, "helpfulness": "1/1", "author": "Maggie Fisher"}, {"rating": 5.0, "review": "It allows me to watch Netflix,  hulu plus, Showtime on the go, HBO in the go, Youtube and a lot more streaming sites.  It's small and you can take it  on the go, plus all you need to do is plug it into the tv and play. I love it and recommend  it.", "verified": true, "helpfulness": "0/0", "author": "Tamika"}, {"rating": 1.0, "review": "We just received this about a week ago and there has been a problem with the remote since the day we got it.  It seems like the batteries don't sit right in it.  Almost every time we use it we have to take the batteries out and put them back in for the remote to work (of course we put in new batteries).  Then it will work for a little while and then it will stop working until we fuss with the batteries again.  We actually put some thought/research into whether we were going to buy this or its competitor and, well, it didn't take long to learn we picked the wrong one.", "verified": true, "helpfulness": "0/0", "author": "R Wiler"}, {"rating": 5.0, "review": "Everything works like it was new. Great deal.", "verified": true, "helpfulness": "0/0", "author": "Michele DeCourten"}, {"rating": 5.0, "review": "Was a gift for a TV addict. Must be good, haven't seen her since", "verified": true, "helpfulness": "1/1", "author": "D. York \"Seeker\""}, {"rating": 3.0, "review": "Didn't work!! Seller very nice and replaced it. Waiting for the new one", "verified": true, "helpfulness": "0/0", "author": "pochie"}]