[{"rating": 5.0, "review": "The Roku Stick 3500 refurbished works like a charm.  Very easy to hookup, used my iPhone to activate it online.  I power it with Ian connection to HDTV.  It shuts on and off with the TV.  I get all the movies I want to watch on Netflix.  I cut back on my cable services, just to local news channels which I could get OTA if I wanted to.  I got the refurbished Roku Stick for $35 and now save $80 that I spent for TV channels I never used.  Roku Stick is great I have had it over a month now.  I set it up the once and it has been working ever since.  I read reviews that say it is slow loading for Netflix, no complaint here, I watch a lot of movies on Netflix with it.  It is a great buy.", "verified": true, "helpfulness": "0/0", "author": "Mary Lou"}, {"rating": 1.0, "review": "I could not get it set up, and the Roku people were not helpful.  I returned it and instead bought an Amazon Firestick, and it works great.", "verified": true, "helpfulness": "0/0", "author": "M E Palmer"}, {"rating": 1.0, "review": "I have had this product for about two weeks now it connected to my network once initially so I set up Pandora listened to a couple songs the I attempt to connect my Netflix, since then I have been having a connectivity issue during the various network checks the network seems fine and all my other devices work fine on the same network, I get all check marks when I update the system but cannot utilize this product for what I bought if for which was and extra streaming device for my bedroom, I am considering returning this device besides it is extremely slow throughout the loading of each channel", "verified": true, "helpfulness": "5/5", "author": "Damian K Tull"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Thomas C. Lewis"}, {"rating": 5.0, "review": "Very happy with the servise.", "verified": true, "helpfulness": "0/0", "author": "Stuart McGregor"}, {"rating": 5.0, "review": "Works really well.  Very satisfied", "verified": true, "helpfulness": "0/0", "author": "STEVEN D MAHONEY"}, {"rating": 3.0, "review": "A bit sluggish, and the interface could do with improvement. But overall it does what it is intended for.", "verified": true, "helpfulness": "0/0", "author": "Craig Bassett"}, {"rating": 5.0, "review": "Works wonderfully", "verified": true, "helpfulness": "0/0", "author": "A. K. Kozlowski"}, {"rating": 5.0, "review": "My favorite! I love the Roku get to watch my favorite apps on my tv and I love how you can choose a theme!", "verified": true, "helpfulness": "0/0", "author": "Adri"}, {"rating": 3.0, "review": "nothing bad...", "verified": true, "helpfulness": "0/0", "author": "Yongshik"}]