[{"rating": 3.0, "review": "I bought this to replace a Chromecast I lost while traveling for work.  There's some benefits and some drawbacks as compared to the Chromecast.Pro's:* Tons of \"channels\" to choose from - unfortunately, I only care about Netflix, Hulu and Amazon* Remote control and phone apps give you the best of both worldsCon's:* Comes with a USB cable and power adapter.  This is just a trap to lure meddlers!  The device won't actually work properly if you don't plug it into the wall.  I verified this with customer service.* Because it plugs into the wall, you have to remember to unplug it when you stop watching.  It won't shut-off automatically when you turn off the TV.* Doesn't seem to have the same range as the Chromecast* Takes FOREVER to load each \"channel\"Final Analysis - I bought another Chromecast.  Nuf said.", "verified": false, "helpfulness": "0/0", "author": "Zorro Oscuro \"To avenge the helpless, punish cruel politicians, and aid the oppressed.\""}, {"rating": 5.0, "review": "I love my Roku!", "verified": true, "helpfulness": "0/1", "author": "Dee"}, {"rating": 2.0, "review": "Sorry, but it was defaulty and I had to return it.", "verified": true, "helpfulness": "0/0", "author": "Jerry Satterfield"}, {"rating": 5.0, "review": "Works better than my smart tv, not freezing!", "verified": true, "helpfulness": "0/0", "author": "John A. Jauss"}, {"rating": 3.0, "review": "It's a great affordable product. But Dissapointing. It's sluggish and a little outdated for someone that has a better option. Ended up returning it.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Marques \"Jonathan M\""}, {"rating": 3.0, "review": "consistent connectivity issues in a room where I have no such issues on any other device.", "verified": true, "helpfulness": "0/0", "author": "joe carbone"}, {"rating": 5.0, "review": "I love the Roku Streaming Stick. It fits nicely into the HDMI port and is powered by the USB port built into my TV. So there are no unsightly wires. If your TV does not have a USB port, be aware that you will need to plug into an outlet.", "verified": false, "helpfulness": "0/0", "author": "Karen Tierney"}, {"rating": 5.0, "review": "Absolutely wonderful purchase. Using iphone makes searching very easy because you can type in search commands with their ap.", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 5.0, "review": "My second Roku. I love Roku and wanted the new version which has updated software and provides more options including YouTube. This Roku stick is wide, has to fit in your HDMI slot or you need an extender. You also need to be able to plug the cord into a USB port or a power source for the stick. If you haven't had a Roku before you will need to set up an account. It is most helpful to have internet access via computer, tablet or phone in the same room as the Roku during set up. You can move the Roku from tv to tv. I find it easier to deal with than the box.", "verified": true, "helpfulness": "1/1", "author": "beachgeek"}, {"rating": 5.0, "review": "Really loving the Roku stick so far. Everything a normal Roku does but in a nice portable package. I hadn't considered how easy it will be to travel with it, especially using the small USB cord for power and not the wall plug in.", "verified": true, "helpfulness": "0/0", "author": "WJCIV"}]