[{"rating": 5.0, "review": "Easy to set up, easy to program everything. I will probably purchase another one for the TV in my room.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Holterhaus"}, {"rating": 1.0, "review": "I bought this item on April 2015. It worked fine for one month but then started hanging every 2nd day. Sometime it is unresponsive and I need to restart again. I was hoping to get best of Roku as it is one of the leading provider on video streaming. Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Shailendra"}, {"rating": 2.0, "review": "A lot of tease - You scan 'channels' and load them to your library of channels.Go to watch a 'Free' one:(By the way, the free movies and shows - - you may have twenty movie / tv channels, and most of them have the very same titles).Start a movie / cartoon or show:An ad plays. (Most of the time you will see the SAME ad, repeatedly)another ad playsanother ad playsYour show/movie loadsjust as it is starting, another ad plays.another ad playsanother ad playsyour show starts! Yeah!in five minutes you will see the very same ads again.two minutes of ads and five minutes of your show / movie.For me, personally, it's painful. By the time the film starts, I'm out of the mood and have forgotten what I selected.Maybe the computer hooked to tv is better.", "verified": false, "helpfulness": "0/1", "author": "D. Sechrest \"bookdude\""}, {"rating": 4.0, "review": "It works great but it is a bit slow. Excellent picture and all the apps/channels you would expect from roku.", "verified": true, "helpfulness": "0/0", "author": "Rene Martinez"}, {"rating": 2.0, "review": "The ad I think misrepresents the product.  \"STREAMING MOVIES\".  Yea, if you pay up for each one. It appears to me that all the unit does is connect one to the various movie MOGULS like Amazon, HULU and the rest.  I can get those movies at my local movie rental without having to pay $50.00 +.", "verified": true, "helpfulness": "0/1", "author": "Manfred"}, {"rating": 5.0, "review": "This device is so easy to set up and use!  We love that we can get all of our favorite shows on our tv without cable.  Also, the stick allows us to mount the tv onto the wall and not worry about cables being all over the place, cluttering up the room.", "verified": true, "helpfulness": "0/0", "author": "fashionista student"}, {"rating": 5.0, "review": "Added the needed dimension to our tv.  Easy to instal and operate.it adds all the movie channels, sports and channels your not now aware of.  You can watch marathon tv shows!  Have fun with it,", "verified": true, "helpfulness": "0/0", "author": "CAROLE MOORHEAD"}, {"rating": 3.0, "review": "This APP is OK. The interface is a slower version of the Roku 3.For some reason, Netflix takes too long to load. Great for a portable device but if at home, I would prefer the Roku 3. Despite the price it is still a better device than the Google Chromecast because it gives you the dual band 2.4 mhz & 5.0 mhz. 5.0 mhz runs a better quality picture especially for streaming video. The only downside is the range so I have a wireless range extended in my house so that solves the problem. I would hope they upgrade the software to fix some of the bugs then maybe I would give it a better rating.", "verified": true, "helpfulness": "0/0", "author": "cruzmissle"}, {"rating": 3.0, "review": "I am disappointed by the average quality image and mediocre user friendliness. User interaction feels like has been designed a decade ago. Any other internet-enabled BD I use at home can play Amazon Prime or Netflix at better quality image and provide more interactive user experience.", "verified": true, "helpfulness": "0/0", "author": "CS"}, {"rating": 1.0, "review": "The stick has never worked. Have talked to Tech Support 3 times. The Roku jumps up and down and then the screen goes black,Warning.", "verified": true, "helpfulness": "1/2", "author": "Gail S. Rubino"}]