[{"rating": 4.0, "review": "Hoping it is what it is built up to do... It is a Mothers Day Gift", "verified": true, "helpfulness": "0/0", "author": "Beverly Williams \"Beverly\""}, {"rating": 2.0, "review": "Sorry to say that this did not work for our family, it was just not powerful enough to keep the internet signal even after the wireless router was moved into the same room as the Roku. We checked to make sure it was not an internet issue before making our choice and all was fine. The streaming stick just did not have enough power to stay connected to the internet and stream properly. We use it all the time since we do not have cable in the house and it was such a disappointment to us.On a postive note we just LOVE the new layout and added features of the newer Roku!  We are looking into the Roku 3. This issue would not stop us from using any Roku products.", "verified": true, "helpfulness": "0/0", "author": "DebraP"}, {"rating": 5.0, "review": "Got as a gift for my Dad, he put it in his spare room where I stayed for my visit. Great price and really fast upload, faster than my bluray player for watching Netflix. Also got to enjoy my Amazon movie library too. If you have more than one TV, this is the way to go, easy setup & install.", "verified": true, "helpfulness": "0/0", "author": "AKSHOPPER"}, {"rating": 5.0, "review": "Works great! Easy set up! Roku rocks!", "verified": true, "helpfulness": "0/0", "author": "Stephen A. Jr Wagner \"Steve Wagner\""}, {"rating": 2.0, "review": "Item works but cord to plug in item for it to work didn't. Lucky I had one that would work with it.", "verified": true, "helpfulness": "0/0", "author": "James Ward"}, {"rating": 5.0, "review": "Bought 1, Remote stopped working. Returned for Refund. Bought another one, same thing. Remote stopped working. Ordered new Remote from Mfg. New Remote works fine from Mfg. It is different than the one that ships with this package. I don't know what else to say. You decide where you want to buy the Streaming Stick from.", "verified": true, "helpfulness": "0/0", "author": "foxvalleyal"}, {"rating": 5.0, "review": "Works perfect.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This is the second one I purchased and it does not work at all just like the first.  No picture only blank purple screen when trying to watch any streaming episode.  Huge waste of time and energy.", "verified": true, "helpfulness": "0/0", "author": "GoddessReading"}, {"rating": 5.0, "review": "I love everything Apple, but I sold my Apple TV and replaced it with this. It works every time I want to use it and it doesn't randomly reboot.", "verified": true, "helpfulness": "0/0", "author": "E.Brown"}, {"rating": 5.0, "review": "Unit works great. Would recommend this to anyone.  have 2 of these on 2 TV's in the house and a ROKU 3 on another. They all work great. A very worthwhile purchase.", "verified": true, "helpfulness": "0/0", "author": "Steve"}]