[{"rating": 3.0, "review": "The verdict is still out on this for me. I absolutely love roku. We have the other one that is the step up (not the stick). That one is much faster. The stick is portable which would be great but we have not had much opportunity to use it outside our home. We use it on our extra tvs so it is fine and it is a good purchase for the price but I would use the other one for a main tv.", "verified": true, "helpfulness": "0/0", "author": "MommaX3"}, {"rating": 5.0, "review": "I really like the Roku Streaming Stick because I combined it with the mini USB cable for Roku Streaming Stick and it hides it from my 2 year old. My 2 year old was messing was drawn to the box Roku too much and all the cords and cables too much. The streaming stick will occasionally freeze but so do the boxes. It streams Netflix and all the other channels without problems most of the time. I highly recommend this because it hides it from kids and hides the equipment so you do not have to look at it.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 1.0, "review": "Never worked.", "verified": true, "helpfulness": "0/1", "author": "thiscrazywoman"}, {"rating": 5.0, "review": "Great device. I was torn between this one and the bigger Roku. Happy to go with this one. It was a cheaper price and I haven't noticed it being slow or needing to buffer. Great value for the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I should have spent a few more dollars and just purchased it new, instead of refurbished.  First, the power cable that came in the package was damaged and would not power the Roku, luckily I had an alternate cable and was able to get up and running. Unfortunately, within three weeks of light use, my refurbished Roku stick began rebooting itself every 5-10 minutes making it impossible to get through even a short show.When it was working the Roku stick was a great addition to my home.  I just wouldn't recommend buying it used.", "verified": true, "helpfulness": "0/1", "author": "gmomd"}, {"rating": 5.0, "review": "Love Roku!", "verified": true, "helpfulness": "1/2", "author": "Laura Imbach-Mills"}, {"rating": 5.0, "review": "The Roku streaming stick was small and did everything I needed", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Falco Fan\""}, {"rating": 1.0, "review": "Remote stopped working the day after I got it. I had to call customer service twice to get them to send me a new remote. Customer service was difficult to understand.", "verified": false, "helpfulness": "0/1", "author": "Melissa Hopson"}, {"rating": 1.0, "review": "Bought two of these for new wall tvs.  Neither would work Tv would not see'em or remote would not work.  Have 3 Roku 2 units running fine.The hdmi sticks are question at best.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/0", "author": "Red05127"}]