[{"rating": 3.0, "review": "This device was supposed to be new, but when I received it I could see that the package was not sealed. Everything seemed to be intact and present, as far as I could tell, so I began to set it up. After a few minutes it became clear that the unit already had an account set up on it. I performed a factory reset on it and from then on it seemed fine. I don't know what its history is, but it got used at least once by somebody before it was sold.", "verified": true, "helpfulness": "0/0", "author": "James D Noel"}, {"rating": 5.0, "review": "convenience at your hand", "verified": true, "helpfulness": "0/0", "author": "gf"}, {"rating": 5.0, "review": "Grate product. Delivery right on time.Very satisfied", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Torres"}, {"rating": 2.0, "review": "Prior to my purchase, I read some reviews and expected the device to be a bit slow at start up but not this slow and not this buggy.The remote is horrible. Will not connect and if it does, it’s brief. I continuously have to remove the back and reset or remove one of the batteries and try again. Good luck navigating the Roku screens if your phone/tablet doesn’t have the Roku app.Also, I am not sure if it’s Huluplus or the Roku software but they do not work well together. Autoplay on tv shows loads halfway then gives up altogether. If we happen to be binge watching anything, I have to exit Hulu via the home screen button and restart the channel; otherwise, the boxes that normally have the shows/movie’s picture and title are greyed out with a question mark.The device has potential but is currently very disappointing.", "verified": true, "helpfulness": "2/3", "author": "YvonneLynne"}, {"rating": 5.0, "review": "Parents love it. Easy set up, user-friendly. You do have to go online to create an account so if you're buying for someone that's non-techy, you might have to set up the account online.", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 5.0, "review": "Works great!! so nice to have Amazon Prime videos again", "verified": true, "helpfulness": "0/0", "author": "Carla S Bice"}, {"rating": 5.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "J. Carswell"}, {"rating": 1.0, "review": "Had a Roku 3500R Streaming Stick since April 2014. Easy to install or control. Liked it a lot. Recently it stopped working. So I called customer support. They asked for my name, phone number ant told me that technician will call me back in 10 min........ Still waiting. So just because of poor customer service and no info on line I would not recommend this product!", "verified": true, "helpfulness": "1/1", "author": "J. K"}, {"rating": 5.0, "review": "Mother's Day present...She loves it. I'm the favorite again....We will see how long that lasts.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is my second rook product. I also have a roku 3 that is on my main TV. I bought this for my outside tv. So far it has worked great with a few exceptions. The first is that the remote is really flimsy and cheap compared to my 3. Initially it lost pairing very easily and had to be reconnected with he stick. Not as much now honestly. It also does not have the private watching feature on the remote either, which I really love on the 3. And the connection/repsonse time is a little slower than the 3. It works fine but if I was to do it over again I would purchase another 3.", "verified": false, "helpfulness": "0/0", "author": "John M. Lahr"}]