[{"rating": 5.0, "review": "Espanol: muy bueno", "verified": true, "helpfulness": "0/0", "author": "unigvision"}, {"rating": 5.0, "review": "A great way to stream especially if you are an Amazon Prime subscriber. It supports all the major streaming services - which Google does not. I put a Roku device on every television in the house.", "verified": true, "helpfulness": "0/0", "author": "P. J. Preston"}, {"rating": 4.0, "review": "This is a really wonderful product. I'm getting it four stars because I had to return the first one I bought because the remote was totally broken and I read other reviews that said that there were issues with the remote. I purchased this primarily because I have a wall-mounted TV and there's no room for a cable box. The Time Warner TV app works beautifully. It's definitely worth the money", "verified": true, "helpfulness": "0/0", "author": "Dean M. Anselmo \"dma\""}, {"rating": 5.0, "review": "I got this so I could stream Netflix without hooking my CPU up to the TV. The Roku has exceeded my expectations with the amount of apps you can run. I love the Roku and us it every night.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "One of the best things I ever bought", "verified": true, "helpfulness": "0/0", "author": "Patti Thomas"}, {"rating": 5.0, "review": "I love the Roku. I am so happy to be able to watch my Amazon Prime movies, Netflix shows, listen to my favorite music and  talk radio with one device.", "verified": true, "helpfulness": "0/0", "author": "Susan Z, Edmond,  OK"}, {"rating": 1.0, "review": "Needs a booster", "verified": true, "helpfulness": "0/0", "author": "John Hardaway"}, {"rating": 4.0, "review": "It is good now but when I first got it i had a hard time learning how to use it.  My husband got it first and installed it and learned how to use it first.  So I finally told him to show me how to use itandnow it is great.", "verified": true, "helpfulness": "0/0", "author": "Windchime13"}, {"rating": 5.0, "review": "This is great.  I got it for my mom for a Christmas Gift.  I bought it b/c it has all the pros of the regular roku player (just not the extras).  Also, it's cheap, AND i didn't have to buy a $30 HDMI cable to connect it to the TV.  All around gReAt BUY!", "verified": true, "helpfulness": "0/0", "author": "cara"}, {"rating": 5.0, "review": "I Absolutely love this.  It gets all of my programing amazon prime, acorn tv - For British TV a must have!  hulu  plus more services than I could ever use.  They keep adding.  This has allowed me to ditch mysatellite provider as I can get better programming at 1/4 the cost.  The system is easy to use and it has an Ipad app so you don't have to hunt for the remote.  The app makes it so much easier when searching for a particular title as the keypad is so large.", "verified": false, "helpfulness": "0/0", "author": "leslie D"}]