[{"rating": 5.0, "review": "It has given me a lot of enjoyment .  No need for cable.  Can watch it on all my TV sets.  I now have one for each TV.", "verified": true, "helpfulness": "0/0", "author": "Brenda K. Miller"}, {"rating": 4.0, "review": "I really like this, and it sure beats the interface that we had to deal with going through the Blu-Ray player.The search that shows availability in every channel is great.One thing I don't like, though, is when going into Hulu Plus, or anything with a series, it doesn't show which episodes you've already watched. If it's been awhile and you don't remember the last episode you viewed, you have to take your best guess and watch the beginnings of however many episodes until you get it right. At least on the Blu-Ray, it showed the episode numbers grayed out so you knew where to start watching again.I love the app on my S3 that lets me control it through my phone. The fact the phone screen lights up makes it easier to use in low light conditions, but it also makes it much easier to search when you can just type or talk it into the phone.", "verified": true, "helpfulness": "0/0", "author": "Matthew J. Brock"}, {"rating": 4.0, "review": "Slow to startup when the tv is turned on, but then very useful and a great price. Does it all and is the best value.", "verified": true, "helpfulness": "0/0", "author": "Michael Jensen"}, {"rating": 5.0, "review": "The roku stick has so much content I've not been able to get through it all. I'd recommend this to anyone from 5-100 easy to use, simple set up. I like that it's not another box sitting around your house, its small, you won't even know you have one!", "verified": true, "helpfulness": "0/0", "author": "S McQuirk"}, {"rating": 5.0, "review": "Had some issues with my Roku 2, so I purchased this replacement. Two concerns that you should be aware of. First, if you have an HDMI connection that is very hard to get to then you may have trouble connecting this. I have a Vizio that has the HDMI connection face downwards and is very close to the stand of the TV. The Roku was not able to plug in due to this. Second, if the stick is plugged into the back of your TV and you sit 10 feet or more away from the TV it is sometimes hard for the remote to get a signal to the Stick. Overall I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 2.0, "review": "If you have a slow internet connection (such as satellite internet) this product does not work well.You will continuously get an on screen error msg and will then have to reload whatever you are watching - only to get the sameerror msg again (and again...).Roku technical support gave a variety of suggestions to correct this problem.  None worked.Its as if the Streaming Stick doesn't have enough buffer memory.", "verified": false, "helpfulness": "0/1", "author": "Aquest"}, {"rating": 5.0, "review": "Recieved order within a few days,installed in a few minutes.. Now happily enjoying stream T.V.... No more cable bill!... Hooray!", "verified": true, "helpfulness": "0/0", "author": "Israel V."}, {"rating": 5.0, "review": "I use this as a \"floater\" so that I can take it to a friends house to watch a movie or show. Not as fast as the Roku 3 but still pretty darn good.", "verified": true, "helpfulness": "0/0", "author": "Cliff Korth"}, {"rating": 3.0, "review": "This is a fine little streaming stick. However you get what you are paying for. The power is about the same as a roku 1, and to me it's just too slow. I also own a roku 3, and would absolutely recommend that device over this stick. It's just slow and hangs up. If you are reading this just know what you are purchasing before hand. I like that unlike chromecast it does run the apps on the stick, so it's better for travel than the chrome cast.", "verified": true, "helpfulness": "0/0", "author": "matt fuzzell"}, {"rating": 3.0, "review": "I BOUGHT THIS FOR SPARE BEDROOM.  THE REMOTE WAS VERY SLOW TO RESPOND TO BUTTON PUSHES.I BOUGHT AN HDMI EXTENSION CABLE AND PLACED THE STICK IN FRONT OF THE TV.  THEN IT WORKED GOOD.I ENDED UP GETTING A BRAND NEW ROKU 3 FOR LESS THAN I PAID FOR THIS.  SO I SOLD THIS ONE.", "verified": true, "helpfulness": "0/0", "author": "JUDY ANNE"}]