[{"rating": 4.0, "review": "It is great.  My grandchildren really like it.", "verified": true, "helpfulness": "0/0", "author": "joshag"}, {"rating": 1.0, "review": "the product it self hang and slow, the remote control is waaaaw more than horrible preformance  each use you have to remove the batteries and place them back to have the remote control work again ... i would not even think of buying this product again or even use what i have bought ... WAST of time and money.....", "verified": true, "helpfulness": "0/0", "author": "ABDULLAH AL-FALAH"}, {"rating": 4.0, "review": "Love my Roku stick. Bought it to stream Amazon prime and got so much more.", "verified": true, "helpfulness": "0/0", "author": "C. Walsh \"avid reader\""}, {"rating": 3.0, "review": "It is small, handy with all good features but its remote is not good. If you leave idle for some time, it stopped working.This device works best with Roku remote app.", "verified": true, "helpfulness": "0/0", "author": "Pranav Kumar"}, {"rating": 1.0, "review": "Remote drains brand new batteries in a day. Remote is useless and we need to use the phone app in order to utilize the streaming stick.", "verified": true, "helpfulness": "0/0", "author": "Elise H."}, {"rating": 4.0, "review": "I previously used a Chromecast streaming stick and the Roku has way more capability and is easier to use.  The performance while streaming is also much better than the Chromecast.  The biggest issue right now, is figuring out which channels to install as I don't want to have 100 apps to wade through.  I'm still figuring out if this device will enable us to ditch cable.  That would be awesome.", "verified": true, "helpfulness": "0/0", "author": "Michael Reich"}, {"rating": 1.0, "review": "This device was extremely disappointing. It hasn't worked yet since day one.  After trouble getting the device connected it finally connected but the main menus on the apps (Netflix, Amazon video, etc) don't load much more than 30%. The device is unusable and Roku has offered little to no help.  Unfortunately Roku only offers a 3 month warranty which show how little faith they have in their product.Now the Roku won't connect to wifi even after favored resets. $50 down the drain.", "verified": true, "helpfulness": "0/0", "author": "Revo"}, {"rating": 3.0, "review": "I've had the Roku Streaming Stick for 2 months. While the streaming stick itself works well, the remote only works intermittently. I have to reboot the Roku and pair the remote again almost every time I turn the television on. It's extremely frustrating. I'm working with Roku and have spent quite a bit of time on the phone with tech support (rebooting, updating the firmware, replacing batteries multiple times) and was finally told they would send me a new remote \"as a good will gesture\". To get that I had to argue that I would not wait a few days and call again to try all the updates as they wanted. Very disappointed that they would not automatically replace an item that is obviously defective. Haven't received the new remote yet but I'm hopeful.", "verified": true, "helpfulness": "0/0", "author": "skw"}, {"rating": 2.0, "review": "It works part of the time, I have to wiggle the cord around so the light stays on", "verified": true, "helpfulness": "0/0", "author": "Eugenia Brison"}, {"rating": 2.0, "review": "did'nt fit my TV had to buy abdapter, no clear trouble shooting,  resetting remote would'nt hook up with my wireless router, couldn't get computer to recognize. Now now my huband wont use it!", "verified": true, "helpfulness": "0/0", "author": "Penny Jo Brooks"}]