[{"rating": 2.0, "review": "Great product, easy to use .No problem hooking it up.", "verified": true, "helpfulness": "0/0", "author": "Joe Monroi"}, {"rating": 3.0, "review": "I've been using my Roku Streaming Stick for about a month.  It works well as long as I disconnect the power AND the remove it from the TV after each use.  If I don't, I have been unable to reconnect to WIFI.  The Stick gets very hot, which Roku Support said is normal.  They advised that it should be unplugged after each use, but I found that I had to disconnect it from the power it AND take it out of the TV in order to get a connection.", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "Very happy with delivery time and product, one of the easiest purchases I’ve had on amazon.  Happy customer", "verified": true, "helpfulness": "0/0", "author": "Cathy Romero"}, {"rating": 5.0, "review": "Great item easy transaction. Thats whats up...", "verified": true, "helpfulness": "0/0", "author": "kmack"}, {"rating": 5.0, "review": "Great device cut my entertainment price over half.", "verified": true, "helpfulness": "0/0", "author": "Connie Keener"}, {"rating": 1.0, "review": "Purchased less than a year ago from a store. Worked fine until now, where the hardware went bad and not receiving WiFi signals or connecting with remote. Contacted support who waste an hour of my life having me do the same troubleshooting steps over and over just to tell me that because the product was purchased before 4/9/2015 its only covered for 90days and mot 12 months. Why should a consumer trust a product that the company who makes it isn't confident enough in its durability to back for the first year of its useful life. Do yourself a favor and purchase a better brand with a better track record and better after sale support.", "verified": false, "helpfulness": "2/2", "author": "Melvon"}, {"rating": 1.0, "review": "The screen and sound keeps going out often. I have Netflix and other streaming apps on my ps4 that run fine but when I use this I ALWAYS have problems! Wouldn't use this even if it was free!", "verified": true, "helpfulness": "0/0", "author": "Bobby"}, {"rating": 1.0, "review": "I bought this because I did not need the games and thought I could save a little money.  I have had nothing but problems with this device. The remote disconnects multiple times and will rarely work.  The remote app works at times. I have worked with support and nothing helps.  Spend the extra money and get the box.", "verified": true, "helpfulness": "1/1", "author": "Teresa Westfall"}, {"rating": 3.0, "review": "I'd give it 5 stars but remote only works a few minutes before you replace batteries.  Eats them up!", "verified": true, "helpfulness": "0/0", "author": "K. S. Fox"}, {"rating": 4.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Littletree \"rimak\""}]