[{"rating": 2.0, "review": "Streams okay, but ONLY works if plugged into the wall outlet. Half the reason we got this was to be able to swap it from one TV to the other with ease.", "verified": false, "helpfulness": "1/1", "author": "Mark G."}, {"rating": 5.0, "review": "Working on cancelling cable and save, save, save...", "verified": true, "helpfulness": "0/0", "author": "Janeen Henley-Freeman"}, {"rating": 4.0, "review": "Have a few issues occasionally (freezing and remote batteries dying often) but the one time price beats paying monthly for cable.", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 5.0, "review": "Incredibly cool! The best streamer stick I've used or seen (even better than a couple stream boxes I've used). Cancelled my Fire Stick order due to the TWO and a HALF WEEK WAIT! Ordered this instead (would have waited another week for the Fire Stick) and man am I impressed. Hope they get more apps but really needed it for Amazon prime and Netflix. Surprised by the current amount of channels and apps. Hoping they get more prime-time networks and better news options. Maybe add Yahoo. PS- comes with the USB charger plug so dont worry even though its not clear in the description. Get one!", "verified": true, "helpfulness": "1/1", "author": "Charles"}, {"rating": 1.0, "review": "This thing worked for 30 minutes after connecting it to the TV and has not worked a lick since. It appears to be bricked. Should have purchased the Roku3", "verified": true, "helpfulness": "1/1", "author": "J David Thomas"}, {"rating": 4.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "I love my Roku Streaming Stick.  It was very easy to install and works great.  The shipping was quick.", "verified": true, "helpfulness": "0/0", "author": "Debs"}, {"rating": 5.0, "review": "excellent device.  Simple to install and use.Has all the services you would expect.", "verified": true, "helpfulness": "0/0", "author": "Russell E. Painton"}, {"rating": 4.0, "review": "It works well and have not had any problems. simple enough and small enough that my dad can't mess it up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "If I could give this zero stars I would.The player never worked, Roku tech support was absolutely ridiculous and went round and round with me, never reaching a solution. Finally they wouldn't offer me a refund, even though I was within warranty, because I did not purchase it from their website.Grateful to Amazon for honoring the warranty and a speedy return process.Will NEVER purchase anything made by Roku again. Save yourself time and irritation and pick another player, or pray that you never have any issues with your device.", "verified": true, "helpfulness": "1/1", "author": "jth678"}]