[{"rating": 4.0, "review": "I like the Roku stick, but I am on my third one since August 2014.  Stick #1 and #2 just quit working.  After the first one, I signed up for the insurance and was able to replace #2 free of charge. Highly recommend getting the insurance!!!", "verified": false, "helpfulness": "0/0", "author": "LG"}, {"rating": 5.0, "review": "Easy to set up and works well,", "verified": true, "helpfulness": "0/0", "author": "Linda Lee Anderson"}, {"rating": 3.0, "review": "It's ok. The remote doesn't work all the time. Needs to be improved.", "verified": true, "helpfulness": "0/0", "author": "tammy"}, {"rating": 5.0, "review": "Highly recommend as alternative to cable. Works like a charm !", "verified": true, "helpfulness": "0/0", "author": "Nolz939913"}, {"rating": 5.0, "review": "This is the best \"gadget\" ever!  I plugged it in and the whole world opened up!  Very simple to use and great quality.", "verified": true, "helpfulness": "0/0", "author": "Kimberly A. Scott"}, {"rating": 5.0, "review": "Works perfectly!  Fast delivery.", "verified": true, "helpfulness": "0/0", "author": "c wilkins"}, {"rating": 1.0, "review": "I have had nothing but trouble with this thing.  I have an apple tv in the living room streams great.  We are always on it well I didn't want to spend that much so thought I would get a Roku well I was so wrong I shouldn't have because it doesn't work 3/4 of the time.  It stops every five minutes to load and that is when it says its connected because most of the time it says its not connected but everything else in the house is and working just fine.  I have the elite internet with AT&T; so we can't say its the internet.", "verified": false, "helpfulness": "0/0", "author": "Christina / Niko"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "tommy"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "dan wielgus"}, {"rating": 5.0, "review": "Works great.  Used to stream Netflix, Amazon prime and HBOgo.  Had to reset the remote upon start up, but set up was easy.", "verified": true, "helpfulness": "0/0", "author": "Beakeagles"}]