[{"rating": 5.0, "review": "We love this We use it everyday & especially like that it can be taken easily from room to room.", "verified": true, "helpfulness": "0/0", "author": "jamie uliano"}, {"rating": 4.0, "review": "I was so excited over this roku stick. It met up to my expectations until I realized it wasn't completely wireless. The stick needs to be plugged in via outlet or via USB on your tv. Everything else is great but I'm not happy over it now being 100% witless. The box it came in said nothing about it having to be plugged in. I read that no several times before purchasing. Oh we'll at least it's 4 stars and awesome.", "verified": false, "helpfulness": "0/2", "author": "Victoria"}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/0", "author": "dana l."}, {"rating": 5.0, "review": "I like that it can be used completely hidden without any wire coming out.  I  currently use it to watch Amazon and Netflix.  I  highly recommended.  Thus far, I have had no problems.", "verified": true, "helpfulness": "0/1", "author": "Cristina"}, {"rating": 1.0, "review": "Totally and Completely Disappointed in this product and I find this company to be very dishonest. I bought this device solely for the purpose of using my Netflix account on it. I now receive it and Netflix is nowhere to be found and I cant install it from the web because it is not available in my region. I live in Jamaica and if they had stated that Netflix which I am legally paying for with my credit card would not work I would not have bought this crap.I would recommend no one to buy this just on this basis. Why the hell advertise that Netflix can be used you even have a Netflix button yet I cant get it on my device.Bunch of criminals.", "verified": true, "helpfulness": "0/2", "author": "Afterglow"}, {"rating": 4.0, "review": "Device works like a champ but I bought it hoping that I would be able to use it at hotels and not have someone hijack what I'm watching but it allows casting just like the Chromecast does and there's no option to disable this.", "verified": true, "helpfulness": "0/1", "author": "Stache"}, {"rating": 1.0, "review": "Just want to reiterate what others have already said. First device came with D.O. A. remote. Replacement device lasted about 7 hours then remote wouldn't sync any longer. Absolutely worthless product and terrible customer service from Roku itself. Save yourself the headache.", "verified": true, "helpfulness": "0/1", "author": "K. Quist"}, {"rating": 5.0, "review": "This thing is awsome!", "verified": true, "helpfulness": "0/0", "author": "Edward"}, {"rating": 4.0, "review": "Wasn't just plug and play easy.  Had to call Roku tech support because the setup webpage and FAQ's didn't discuss the issues I ran across.  Remote wouldn't pair with base, and also it would connect to my home network, and Wifi OK, but not to the Internet and everything else in the house was connected.  After a long wait on the phone with Roku to get a tech, the tech determined after about an hour that my WiFi router channel was conflicting with the Roku remote/base.  Had to change the Router channel then re-pair the remote and base.  After about 2 hours total time, it is up and working.  Once it was running, I like it. Plenty of channels to add for free (some have really limited content of course) but like the Netflix and Amazon fast access buttons.  Video quality is good.  I think I'll like this device now that it is up and running.", "verified": true, "helpfulness": "1/1", "author": "J. Crocetto \"Audio-man\""}, {"rating": 4.0, "review": "I've had Roku since the beginning of it's existence & this is my 7th. Not because they failed or wore out but because I upgrade to the newer models and give away my older ones to other family members. This model was the perfect solution for the limited space of our tiny upstairs bedroom & it streams just as well as any of the other Roku's I've owned. The only negative I can find, which is more of a slight annoyance than a negative, is that the remote is a little slow to respond leaving you clicking the button frantically & wondering if it froze up at first, however, you get used to it quickly & that issue does seem to be improving. Other than the \"Stick\" I currently have 2 Roku 3's. I havent cut the cord completely because I live in a rural valley where TV reception is virtually nonexistent but I have cut back to just basic cable for the local channels. I highly recommend ROKU of any flavor to everyone, especially if you're sick & tired of paying through the nose for 500+ channels you never even watch..*Update: I deducted a star. The stick mostly works great but occasionally loses network connection and will not reconnect on it's own due to \"Incorrect Network Security\". I have to manually go back through network setup to get it to reconnect. I do not have to actually re-enter any info, just click through the setup. Happens once or twice a week and is a bit annoying...", "verified": true, "helpfulness": "2/2", "author": "PC Guy \"Keith\""}]