[{"rating": 3.0, "review": "just want to try it out and see how is itI had try to play around for  about 2 weeks and just not as what I am expected.", "verified": true, "helpfulness": "0/0", "author": "Andy Chen"}, {"rating": 3.0, "review": "I came across two bugs during installation:1. I have a brand new Samsung PN51F5300 in our bedroom, and the Roku stick doesn't seem to work with HDMI Input #2 (DVI). HDMI Input #1 seems to work fine, so I swapped my cable box to HDMI #2.2. During the update process, the Roku stick would not generate an access code. I had to reset the unit to factory defaults THREE times before it worked properly.I'm hoping that it'll be smooth sailing from here on out, but the installation process was very frustrating for me, and I would consider myself \"tech savvy.\" I can assemble a desktop PC and install Windows, but the \"plug-n-play\" Roku stick had me fuming.", "verified": true, "helpfulness": "0/0", "author": "That Guy \"Joe\""}, {"rating": 5.0, "review": "This is the second Roku that we have had.  Our first one was beginning to give us a problem with the streaming of our favoriteTV program.  We upgraded to this one and have had no problem since.", "verified": true, "helpfulness": "0/0", "author": "Roberta B"}, {"rating": 1.0, "review": "Received this unit on a Saturday, and then for the next 3 days proceeded to try to get it to connect to my wireless network to no avail. Error code 14 over and over, ad nauseam. This same network has zero trouble connecting plenty of other devices, such as a smart TV, a PS3, an X360, a standalone Bluray player, two tablets, two phones, a printer - hell, my refrigerator can even connect to my network.I would like to believe that this was due to a faulty unit, but this problem occurred with two different Streaming Sticks (my roommate and I each purchased one). I even swapped out my wireless router in case there was a hardware conflict; no dice.I tried many of the suggestions on the [mostly user supported] Roku forums: using wireless channel 11 only; reserving the Stick's MAC on the router; sticking to WPA2/AES only; using b/g/n mode. The closest I got to getting this product to function was getting it connected long enough to download the software update. After the reboot, it was nothing but error code 14 again.Both units are being returned after 3 days of headaches. There are far too many products in this arena that work perfectly fine for anyone to be spending ~50 dollars on this piece of junk. The Roku 3, for example, works great; too bad it's twice as expensive, but then again I guess you get what you pay for.(It's also worth mentioning that after being plugged in for only ~30 minutes, this unit was already like a miniature hotplate. I can only speculate how hot it can get when plugged in for 24 hours a day.)", "verified": true, "helpfulness": "3/3", "author": "N. M. Ritchey"}, {"rating": 1.0, "review": "This wouldnt pick up internet, i dont know if it was broken or what but i returned it to buy a regular roku boox", "verified": true, "helpfulness": "1/1", "author": "Me"}, {"rating": 4.0, "review": "Roku makes one of the best interfaces for accessing streaming content.  The slim fit of this product is perfect for hiding behind a flat screen hung on a wall with no visible cables.  The biggest problem is the SLOW processor.  It takes about 1 minute for the Roku to boot up just to get to the main channel page.  Then if you select a large channel like Netflix, it takes another minute for that to load.  I know that seems like 1st world problems, but it's funny how quickly Netflix can load on a smartphone, iPad, or even on a smart TV.  The Roku is simply under-powered.  Outside of that small gripe, it's a quality product worth the money.", "verified": true, "helpfulness": "0/0", "author": "LS"}, {"rating": 3.0, "review": "Remote it came with does not work. Batteries are brand new and I have Hi-Speed wireless internet which is not the problem for the delay in accessing my Netflix. The ROKU stick gets extremely hot and I'm afraid it might catch on fire. There must be something better out in the market.", "verified": true, "helpfulness": "0/0", "author": "John Alvarado"}, {"rating": 1.0, "review": "The sound stopped working 5 days after the 30 day refund policy expired.  That was a complete waste of $50.", "verified": true, "helpfulness": "1/1", "author": "William D"}, {"rating": 5.0, "review": "This was recommended to me by a family member and I could not be happier.  Due to time constrictions. I was not able to do it sooner.  There is \"so much to watch\" now, I will never get bored from lack of choice.  Do not hesitate!", "verified": true, "helpfulness": "0/0", "author": "medoluvr"}, {"rating": 5.0, "review": "Added this stick as the 2nd Roku in the house for our bedroom TV and love the fact that it's small and compact.  Plugged into my LED TV's HDMI port and had it working in less than 5 minutes!", "verified": true, "helpfulness": "0/0", "author": "Steven A. Nickerson"}]