[{"rating": 5.0, "review": "I was able to install and program the item without any problems whatsoever and it has operated great every since!!!", "verified": true, "helpfulness": "0/0", "author": "Frederick  L. Stroud"}, {"rating": 5.0, "review": "It works great and set up was a breeze. I got it because I wanted to be able to use my Amazon Prime to watch movies and shows and it completely lives up to my expectations. Sometimes it takes a little while to buffer but I think that says more about my internet connection than the Roku.", "verified": true, "helpfulness": "0/0", "author": "Karl B."}, {"rating": 3.0, "review": "Runs a little slow. Had to upgrade our router to use it. Updates arent always automatic and you have to check for them. Other then that it works well for what we bought it for. It saved us from having to order another box for our sons room from Dish.", "verified": true, "helpfulness": "0/0", "author": "rebecca bourbeau"}, {"rating": 5.0, "review": "Bought this as a present for my dad, he loves it.  It was super easy to get him up and running.", "verified": true, "helpfulness": "0/0", "author": "Kristen"}, {"rating": 5.0, "review": "nice simple tool for bringing web content to the tv", "verified": true, "helpfulness": "0/0", "author": "H C Skinner"}, {"rating": 5.0, "review": "I don't know why anyone would pay $50 for a new Roku stick when these work just fine", "verified": true, "helpfulness": "1/1", "author": "brookie"}, {"rating": 5.0, "review": "Works better than expected.", "verified": true, "helpfulness": "1/1", "author": "Bruno J. Gallianp \"Bruno Galliano\""}, {"rating": 5.0, "review": "Works great.  Plug it into the TV, go through the setup to link it to your wireless network and you are in business.  I have a ROKU 3 for my mancave TV and this is on the upstairs TV.  No major difference in function or display.", "verified": true, "helpfulness": "0/0", "author": "BGord"}, {"rating": 4.0, "review": ":)", "verified": true, "helpfulness": "0/0", "author": "Sandra T."}, {"rating": 3.0, "review": "It broke after a couple months. Plus, it would get extremely hot.", "verified": true, "helpfulness": "1/1", "author": "Crstena"}]