[{"rating": 4.0, "review": "Everything I expected", "verified": true, "helpfulness": "0/0", "author": "Christian Boos"}, {"rating": 1.0, "review": "We have a Roku in every room of our house and have owned the Roku 1, 2, 3, and HD. Our Roku 1 broke so we decided to replace it with this Roku stick. The Roku 1 was annoying but this thing is just as bad if not worse! The remote just stops working pretty frequently and it constantly lags. If you're trying to scroll through titles on Netflix it'll just start flying through them on it's own. It's extremely frustrating. Seriously do not buy this. We have loved all of the other Rokus we've owned with the exception of the 1. If you can spend the extra money to go for the 3 go with that. The roku 2 and hd are solid options too. I'm not gonna even bother trying to call Roku because there are plenty of reviews on here saying their customer service is crap. Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "Works wonderfully.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Works great just has indicated", "verified": true, "helpfulness": "0/0", "author": "jbcarideo"}, {"rating": 5.0, "review": "Easy to set upRecommend it", "verified": true, "helpfulness": "0/0", "author": "doug bretzlaff"}, {"rating": 1.0, "review": "Is there anyone who can help me get the Roku streaming stick to work?  I can't get the remote to work at all.  I keep calling roku and they (depending on who you speak to) tells me to do different things.  I have tried it on both televisions and both are new and I haven't been able to resolve the issue.  I had AT&T; change the wireless channel, got a second remote, and I don't know where to go from here.", "verified": false, "helpfulness": "0/1", "author": "lucygirl7"}, {"rating": 4.0, "review": "I upgraded from a classic Roku. This was easy to set up and pretty easy to use. I like the channels I get with this.", "verified": true, "helpfulness": "0/0", "author": "K. Karjala"}, {"rating": 1.0, "review": "doesn't work", "verified": true, "helpfulness": "1/1", "author": "Jane Kircher \"Sammyann\""}, {"rating": 5.0, "review": "I use this on a TV without a cable box and love it (I have cable but only on a different TV).  I've had it about 1 month so far and use it mainly for Netflix, HBO GO, Pandora and Vevo.  I'd use it a lot more for some of the cable channels offered (Lifetime, History, A&E;, etc) but apparently Comcast refuses to get on board with it - if you have about any other cable provider you'll have wide access to lots of shows.I've had some struggles with the remote.  Initially it would work and then stop working, as if the batteries were dead.  I swapped them out but no change.  Then I changed my WiFi channel and it's worked smoothly since.  It seems like the remote stays on (green light on the remote stays lit up and flashes on/off) and I think this is draining the batteries quickly - seems it needs an off/on button or maybe I'll have to remove the batteries after each use?  Not sure about this.I also downloaded the Roku app to my iphone - works awesome!", "verified": false, "helpfulness": "0/0", "author": "Wallflower"}, {"rating": 5.0, "review": "So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Mishy"}]