[{"rating": 5.0, "review": "My husband who hates me spending money said of our Roku purchase, \"This is the best $40.00 you have ever spent.\" That should say enough. The Roku Stick is extremely easy to use and install. Turns you TV into a streaming machine. The best part so far is the YouTube channel. It plays our video play lists without the annoying commercials found on YouTube. And seeks out HD versions first. Pretty cool.", "verified": true, "helpfulness": "0/1", "author": "Michaeleen Newcomer"}, {"rating": 5.0, "review": "SERIOUSLY?? EVERYTHING streaming with this simple HDMI plugin for 50 bucks?? Here's the deal, I bought one of these as a gift for my roommate because I got rid of cable and he doesn't have a smart tv. Figured, eh, for $50 thats cheap enough to get a decent quality picture and hopefully good streaming from Netflix and Amazon. Uh, nope - blew my expectations away. Plugged it in and it quickly found my wireless n 5Ghz signal (not just the slower 2.4ghz). Connected, and all in all it took about 15-20 minutes to setup a ROKU account, add all the channels he wanted, and login to each. The navigation and controller setup is simple and intuitive. What really amazed me was the quality of the picture tho. The HD quality was perfect. I immediately bought 2 more. One for my girlfriend for the TV in her room and one for my HD projector. I got those yesterday and hooked up to the projector through my surround sound receiver - again, blown away because the picture quality was amazing and the surround sound was perfect!! Never expected the surround sound to be so good. I actually wish I had never bough a smart tv for my bedroom now. Instead, I would've just gotten a larger LCD and hooked up a roku. Incredible value for $50.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "awesome!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Philip Lilli"}, {"rating": 4.0, "review": "WORKED FINE", "verified": true, "helpfulness": "0/0", "author": "MARK WHEELER"}, {"rating": 5.0, "review": "The Roku is awesome.  Just what I expected.  I thought it might have a problem because the location is on the side but it works great.  I have the roku boxes but this is smaller and I like it", "verified": true, "helpfulness": "0/0", "author": "cherle stapleton"}, {"rating": 5.0, "review": "Portable, inexpensive entry into the WiFi streaming world. Plug it in and it updates itself and off you go. Enjoy.", "verified": true, "helpfulness": "0/0", "author": "Tjaye \"tjaye\""}, {"rating": 5.0, "review": "Really nice, responsive, and fast. Works as well as the roku 3 without the cable clutter. Plex, Crackle, Netflix, and Hulu in one little stick.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "So far it works great. I have used other Roku devices that would loose internet connection and I so far have had no issues with the stick. Great find!", "verified": true, "helpfulness": "0/0", "author": "Kristina hawkins"}, {"rating": 5.0, "review": "came on time good shape easy to hook up and use", "verified": true, "helpfulness": "0/0", "author": "Patricia Funk"}, {"rating": 3.0, "review": "The stick works well but I have to pair the remote monthly.", "verified": true, "helpfulness": "1/1", "author": "SnackThompkins \"Tell us about yourself!\""}]