[{"rating": 5.0, "review": "I have been a big ROKU fan for years and have had a couple of their 2XS & 3 models.  I used to carry a regular ROKU with me when I traveled for use in hotels and friends houses.  The ROKU 2 and 3 are compact and have a couple of features that the Stick does not have but the STICK takes up much less room in the suitcase. The ROKU is easier to set up than the other streamers I've tried and I do believe the ROKU has more available channels than any other streamer and they are constantly adding more.", "verified": true, "helpfulness": "0/0", "author": "Kimo"}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/0", "author": "Larry turner"}, {"rating": 3.0, "review": "Is has all the connections advertised, but the first concert I watch kept pausing to reload. Anything over ten minutes long has the same issue. I ended up upgrading to a box model.", "verified": true, "helpfulness": "0/0", "author": "IMOrganized"}, {"rating": 5.0, "review": "Enjoy it every day", "verified": true, "helpfulness": "0/0", "author": "John M Holewinski"}, {"rating": 1.0, "review": "BEWARE 90 day warranty and mine do not last more than 8 months. This is not the first one to break on me. When it works it is great but they do not last and I am a VERY angry customer. I cannot afford to spend $100 every few months on a new roku.After a few calls I asked for a supervisor and had to wait a while and he said just this once.. if I mail it in to them he will then mail me one out .. just this once. So, 2? 3? weeks with no tv.DON'T BUY A ROKU!!!edit: I got an Amazon Fire tv and am very happy with it and it has a 'normal' warranty and as a long time customer of Amazon I know they stand behind everything they sell.", "verified": false, "helpfulness": "5/6", "author": "LadyMMO"}, {"rating": 1.0, "review": "Would not work...waste of time and money...totally not as advertised.", "verified": true, "helpfulness": "0/0", "author": "john thomas"}, {"rating": 5.0, "review": "works great  installed easy p snd running", "verified": true, "helpfulness": "0/0", "author": "david byrne"}, {"rating": 4.0, "review": "Like others have previously stated, this items only downfall, compared to other models, is speed...  But really this isn't really a big problem.  It doesn't seem to freeze up, it just lags for a few seconds.", "verified": true, "helpfulness": "0/0", "author": "CaseyL1986"}, {"rating": 4.0, "review": "its nice, they added amazon instant on the remote. The boot process is slower than the regular ones.", "verified": true, "helpfulness": "0/0", "author": "Roj30"}, {"rating": 5.0, "review": "The product works great only problem is finding something worth watching", "verified": true, "helpfulness": "0/0", "author": "Jim D. Farmer"}]