[{"rating": 2.0, "review": "I wanted to love this stick but I couldn't, this is not the “real deal” by any means.After a month of usage I returned it and got the Amazon Fire Stick.Please note that this review will be in the format of Ruko stick vs. the Amazon Stick:Setup:Roku:Read the quick startPlug the stick to the powerPlug the stick to the HDMI port on the TVFollow the on-screen wizardSet-up the wireless networkDevice looking for updatesDevice downloading updatesError: device could complete update… Try againAfter 5 times I gave up and called Roku support45 minutes later I got an answer and went through the 7 stagesagain since we had to reset the device.Then you have  to register your device with RokuGo to Roku websiteCreate a Roku accountAnswer a bunch of questionsGo to your devices and get a registration codeEnter the registration codeDone? Not quite.if you have an Amazon Prime account then you’ll have to go through some more hopes inorder to register the device with your amazon account.Now ( after the evening is almost over) you can sit down, relax and fall asleep after all the hard work youput into setting the device.Note: I bought the stick so when I’m away, my wife can watch all the content we usually download and watchthrough our multimedia computer that connect to the TV since these devices are easier to operate comparingto a full blown computer. If she had to set it up her self she would really had hard time.The problem was that while I was away, the device stopped working so she had to go through the setup yet again!Needless to say, she wasn’t able to watch tv for few nights until she got enough time to go through the processwith Roku support.Amazon Fire Stick:No manual to read, Plug in to powerPlug into the HDMI on the TVConnect to your wireless networkwatch a short intro movieYou Are done, really done. my Amazon Prime membership was magically in placeall I had to do is sign into my Netflix and I’m all up and running. That was under 5 minutesincluding the intro movieWhat about content?The Roku has many content options, lots of channels to choose from if you know what you’re looking for,Otherwise it’s a crapshoot. Most people I know, including my wife, use Netflix and Amazon Prime formost of their viewing needs. and if that is your preferred sources, go for the Amazon stick, it will do a better job.If you’re really like to explore, stick with the Roku.Viewing Quality?I found the viewing quality to be pretty good and on par with other devices I used (Amazon Fire, Fire stick, Apple TV)still not as good as torrent downloads on my media center.Remote?The remote that comes with the Roku stick is simple and good has dedicated Netflix and Prime buttons on it.I still like the remote from Amazon that has voice search and makes life easier for finding content.Final WordAt this point, I don’t feel comfortable recommending the Roku stick for any one who’s in the market fora steaming stick. There are far better options out there both in ease of use and price.I think Roku have a chance of getting my vote, once they’ll manage to figure out a simple and straight forwardsetup process.For now i’ll stick with the Amazon stick, better price, better integration and just works.", "verified": true, "helpfulness": "0/0", "author": "Y. Lavy"}, {"rating": 4.0, "review": "Awesome Roku experience as the rest of their devices. Only issues is that for some reason, this thing would reboot every couple minutes. Come to find out that the USB port on TV was not supplying enough power. Switching to the wall outlet adapter fixed that. Only other weird issue is that the Amazon Video streaming app does not play any sound...not sure what's up with that. Everything else is typical Roku hotness.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "I love this little ting.  Works fine.", "verified": true, "helpfulness": "0/0", "author": "kerzen"}, {"rating": 5.0, "review": "Perfect!!!", "verified": true, "helpfulness": "0/0", "author": "Larissa Alvarez"}, {"rating": 5.0, "review": "As advertised and hooked up easily", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "i've tried apple tv, chromecast, and amazon fire tv but i still love the quality, price, and app availability of roku.", "verified": true, "helpfulness": "0/0", "author": "beeesstee"}, {"rating": 4.0, "review": "I only bought this so I can have access to Sling TV . It works as advertised . Netflix , and Hulu work as well . No problems so far.", "verified": true, "helpfulness": "0/0", "author": "LittleChat1222"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Vivian"}, {"rating": 1.0, "review": "They are great turns your TV into a smart TV", "verified": true, "helpfulness": "0/0", "author": "jill  miller"}, {"rating": 5.0, "review": "Very pleased.  It does take a little time to load.  Doesn't bother me but might bother some.", "verified": true, "helpfulness": "0/0", "author": "Liz Webber"}]