[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Ann M Brett"}, {"rating": 1.0, "review": "The user experience is quite poor compared to my Apple TV's exceptionally fluid experience.Advantages:+ Tiny in size+ Searches across multiple apps to find your movie/showOk:* The small size is good but it's a larg-ish, non-bendable stick, so it was sticking too far out (back ports) or sticking outside the edges (side ports). Fixed it by buying an small HDMI extension cable (3\") so it can be plugged behind but can flop down to lie flush with the TV back. That added 10% to my overall bill (just 5 bucks but watch out)Problems:- Terrible out of box experience! Couldn't get the remote to pair with the Roku. Worked on 3rd attempt. Then had to go through the entire setup process which should have been 5-10 minutes but was instead over 20 minutes. Roku, please learn from the Apple TV how to create a streamline out of box experience.- Forces you to signup for a Roku account. This is unnecessary and cumbersome. I have just one Roku, I don't care about any syncing etc. Force me to create an account when I buy my second Roku. I was almost going to put it back in the box when I saw this ...- Signup DEMANDS a credit card (really, why should I give you one?)- Boot times are 20x slower than my laptop (Takes me 2minute, 40 seconds from power on to using netflix or other apps). My Macbook boots off an encrypted drive in 8 seconds, I expect 'appliances' to start instantly (<2sec)- Keyboard input is awkward via remote (it's awkward across all such devices but especially awkward here despite having more physical buttons compared to, say, Apple TV. Even my semi-smart Panasonic TV has better virtual-keyboard input)- Official iOS Remote app can't send keyboard characters across. This is just plain stupid. I installed and connected the official iOS app to my Roku so I can easily type usernames/passwords. Well, the app can't even transmit simple strings without mangling it. (eg: copy-paste 'Password123' into the app, and you'll get 'Pasword1s32' ... like the rest of the experience, no polish, no finish)- Remote takes time to 'reconnect' with the Roku. If you're watching a show and left the remote idle next to you and now need to hit pause/stop, you need to plan this 5 seconds before you know you need to. Good luck with that.- Did I mention you need to signup for a Roku account? Well, I'm saying this again since the Roku kept nagging me multiple times with options limited to 'No, I need to create one' or 'Yes, I already have one'. What about 'No, and I don't give a ****!\"I'll be returning my unit back. Till Roku builds a solid all round product, I'll give my money to folks who deserve it.", "verified": false, "helpfulness": "10/10", "author": "Sid S"}, {"rating": 5.0, "review": "The Roku streaming stick works like magic.  We tried other options for streaming videos and Roku is the smallest and easiest to connect solution.  Plus, the streaming video quality is excellent and the cost is reasonable.", "verified": true, "helpfulness": "0/0", "author": "Jim C."}, {"rating": 5.0, "review": "This Roku streaming stick works great. It is a bit slower than my Roku 3, but this was to be expected. Not an issue for me!", "verified": false, "helpfulness": "0/0", "author": "stellar981"}, {"rating": 5.0, "review": "This is my 6th Roku and it is probably the best one so far. It fits fine into my plasma. I have no issues with long load times. I like being able to access my Amazon Music on here, which I cannot do on the older Roku versions. Roku continues to be the easiest way to stream video. I highly recommend this Stick.", "verified": true, "helpfulness": "1/1", "author": "Lisa"}, {"rating": 5.0, "review": "Roku will eventually replace my Direct TV and/or cable provider. This easy to use system gives you the ability to stream television shows. Get Netflix, it's a must. You can watch the WSJ channel, ESPN, and NFL network. You will have to pay extra monthly for the movie services, like HBO Go and Hulu Plus, but it is significantly less than Direct TV. Plus you only pay for the channels that you want. EG if you don't care about SEC football, why waste money on the channel?", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutly love! Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "H. Jensen"}, {"rating": 5.0, "review": "Great little unit.  We have been using this for a couple of months and absolutely love it.  We have had not problems at all.", "verified": true, "helpfulness": "0/0", "author": "biker29"}, {"rating": 1.0, "review": "This is supposed to \"plug in and start streaming\". Well I could not even get it plugged in. I have 3 HD TVs.  It won't fit into the port for the newest one (bought together) at all. there is a USB with a plug to power it. When you add the plug it does not fit at all. On another TV it barely fit-it was at an angle. It would fit the 3rd TV put then there is the power cord. It is only about 2 feet long so unless your TV is on the floor or you have a wall outlet you need and extension cord. Sending it back and getting another apple box even if it does cost more.", "verified": false, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The streaming stick had issues right out of the box. It failed to find my wi-fi 3 times before it connected. Then failed multiple times during the initial software update because it lost the connection. When I finally got connected and tried to watch content it buffered, or went to the loading screen, many times. The loading screen appeared constantly, sometimes as often as every 10 seconds, making it basically unusable. The remote was very unresponsive too. Very dissatisfied.I then bought the Roku 3. It was a vastly different experience.Buy the Roku 3. The streaming stick is not ready for prime time.", "verified": true, "helpfulness": "0/0", "author": "JStoltzfus"}]