[{"rating": 5.0, "review": "I love my roku stick. I heard about and it was what they said it would do.", "verified": true, "helpfulness": "0/0", "author": "Debbie Haskell"}, {"rating": 5.0, "review": "Great product!  Works a lot better, is faster, and has a ton more apps available then our wi-fi Samsung Blu-ray player.  The kiss love it!  Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Aaron J"}, {"rating": 5.0, "review": "We love our Roku streaming sticks. We have 3 in our house. Love the ease of set up and the many options for movies and shows.", "verified": true, "helpfulness": "0/0", "author": "Melissa J"}, {"rating": 5.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "CLK"}, {"rating": 5.0, "review": "Great little gadget for watching streaming Internet content on your tv. It hides behind my tv and i have a dedicated plug back therr too so no annoying wires showing. I no longer have to hook up my laptop, which was annoying, to the hdmi port on my tv. The roku works great and I haven't had any problems with lagging or choppyness like I do when I hook up my laptop. I have never had it lock up or needed to reboot it. It's easy to use and it's the only thing my 10 yr old grand daughter watches when she is here. I would recommend this to anyone who has a WWE subscription or a Netflix account. I bought is as a Christmas present for my husband and he has recommended to all his friends who watch WWE. One thing you might want to know is that the remote is rf instead of ir which means you don't have to point it at the tv to make it work. My grand daughter has sat on it many times and it is so sensitive, other that that I give it 5 stars for sure", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 4.0, "review": "I absolutely love my roku stick & I would of given it 5 stars but the remote that comes with it never works. I have to use the roku remote app on my phone. We have very slow internet & I was worried about buffering & not playing well but it does great. With all the apps available (some are not free) there is always something to watch.", "verified": true, "helpfulness": "0/0", "author": "KB"}, {"rating": 5.0, "review": "Works great. Also, connects to 5GHz channels supporting high-speed data transfer and no lag.", "verified": true, "helpfulness": "0/0", "author": "Debasis Goswami"}, {"rating": 1.0, "review": "Sadly, a good idea that it not yet a substitute for cable. Easy install, slow loading, awkward search format within the channels, commercials that you can't skip. Many channels are not properly organized for current episode viewing (dates are scrambled or they are badly edited clips). Okay for movies or TV, if you want to consolidate your Amazon Prime, Netflix Streaming and Hulu subscriptions. NOT for live news or sports. And, for delayed news or sports, NOT as good as streaming Internet and/or cable because of the poor channel delivery of shows. Returned, will try Chromecast next.", "verified": true, "helpfulness": "0/1", "author": "E. Randolph"}, {"rating": 4.0, "review": "Need a how to sent along with it. A lot of features I'm not sure about.", "verified": true, "helpfulness": "0/1", "author": "Candace Clayton"}, {"rating": 1.0, "review": "Needs external power. Never said it in description.", "verified": true, "helpfulness": "0/3", "author": "Andrew Smith"}]