[{"rating": 3.0, "review": "UI response kinda slow.", "verified": true, "helpfulness": "0/0", "author": "Qunfeng He"}, {"rating": 1.0, "review": "I bought a streaming stick 95 days ago.  I loved it at first...so easy to stream from multiple providers, picture quality was great, things loaded quickly.  Then about two weeks ago, the remote stopped working.  I tried to re-pair the remote with the stick multiple times, but it wouldn't work.  I had to do a complete reset/factory restore on the system, but I was eventually able to get the remote to pair with it again and everything worked normally for a little while.Then, about 2 days ago, the remote stopped working again, and the stick would not connect to my wireless network (my wireless router is in the same entertainment center my TV sits on, so it's no less than 5 feet from the router).  I unplugged the stick, let it sit for a day, and again tried to pair the remote with the stick. Didn't work.  Tried reset/factory restore, the remote worked for about 5 clicks, then stopped working altogether.  And the Roku would not connect to the internet (it would connect to my wireless network, but not go any further, even though the laptop I am typing this on is connected to the same wireless network and connects just fine).The significance of the 95 days since I bought this unit is that the warranty is 90 days.It's a shame that such a great idea is so unreliable.  The stick itself feels cheap, like it could easily break in half.  I'm guessing the electronics inside are just as cheap.", "verified": false, "helpfulness": "0/0", "author": "Brian Chojnowski"}, {"rating": 5.0, "review": "I love this thing!!!!", "verified": true, "helpfulness": "0/0", "author": "Millie"}, {"rating": 4.0, "review": "Great device for streaming TV and movies.  RF remote works well.", "verified": true, "helpfulness": "0/0", "author": "RJG1999"}, {"rating": 4.0, "review": "Spectacular!  I love my Roku!", "verified": false, "helpfulness": "0/0", "author": "B. L. Kliesen \"KSU ArchE\""}, {"rating": 3.0, "review": "It does the job but somewhat slowly.  I cannot seem to push the right buttons consistently to perform the task I need it to perform.  I am very happy with the idea and what I can now receive on my television.", "verified": true, "helpfulness": "0/0", "author": "Russ"}, {"rating": 3.0, "review": "Couldn't get it work with two different HDMI enabled TVs, it finally worked on my 2006 Old school Vizio.", "verified": true, "helpfulness": "0/1", "author": "jamesful80"}, {"rating": 5.0, "review": "Great item.", "verified": true, "helpfulness": "0/0", "author": "Edgar"}, {"rating": 4.0, "review": "Good device overall with a few issues.The Roku Streaming Stick is not nearly as fast as other streaming boxes like a roku 2 or 3 or the amazon TV. The device works well and is nice and small. It is good to take on trips and hook up to TVs in hotel rooms and cast content from a phone.I have a chromecast too and this is more convenient because of the remote and numerous channels.", "verified": true, "helpfulness": "0/0", "author": "JTownsIV"}, {"rating": 1.0, "review": "Fails to connect to my TV majority of the time, good concept but waste of money", "verified": false, "helpfulness": "0/1", "author": "Caroline Senne"}]