[{"rating": 2.0, "review": "The stick is fine, but I'm surprised that so few mention that the remote control rips into your wireless network causing all kinds of problems on the 2.4gHz band.  This is a well-known and well-documented issue with both the 3500R Streaming Stick and the Roku 3.  See the Roku forums.I liked the stick - I also have a Roku 3 - and I didn't see any of the lag or experience much difference in speeds between the two, but when I tried to connect a laptop to my network from a bedroom the signal would intermittently cut out.  I ran around for weeks trying to troubleshoot the router until I ran across the Roku forum posts... disconnected the two Roku devices and the network immediately came back and workd perfectly.  Hooked up the Roku 3 again, and the network went to trash.  Set the remote to stop pinging the network (recommended by Roku), and the network came back to life...But, the things reset themselves periodically, without havng been turned-off, and start pinging again.They're in their boxes for now.  Great streaming devices with a really silly design flaw in the remote.  If you have two routers - I can't configure two routers on my service - you can get around the issues with the remotes, but we shouldn't have to run a network dedicated to these devices.NOTE for all the reviewers saying that they cannot connect to their wireless network: the Roku Stick is picky about what channel it will connect to - and hold the connection.  Before giving up on the thing, try changing the channel on which your router broadcasts.", "verified": true, "helpfulness": "0/0", "author": "Tinker"}, {"rating": 5.0, "review": "Great. Cut your cable or satellite bill forever. I will never pay for cable or satellite again.", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 4.0, "review": "This works great. I only wish there was a Hulu app to stream the free content (it requires a paid Hulu+).The recent upgrades have improved the boot-up time and stability from previous versions. Note that if you don't opt-out they will push upgrades and content (like the Star Wars background). The worse is the remote. It eats a pair batteries in less than a month (even without earphones). We have been using the phone app lately which simplifies typing very much.", "verified": true, "helpfulness": "0/0", "author": "V."}, {"rating": 5.0, "review": "I think it is just fine !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this.  I especially love the buttons that take me directly to Netflix and Amazon.  I'm working to cut the cable and I think this is going to help do just that.", "verified": true, "helpfulness": "0/0", "author": "C. Zessin \"Dee\""}, {"rating": 5.0, "review": "This replaced my AppleTV2.  Love it.", "verified": true, "helpfulness": "0/0", "author": "R. Duran"}, {"rating": 5.0, "review": "I already had an older version of the roku in our tv room and I wanted one for my room. It took awhile to set up but I think it was because my internet doesn't reach that well upstairs. Great product!!", "verified": true, "helpfulness": "0/0", "author": "Shelby Christensen"}, {"rating": 5.0, "review": "Love the Roku stick that just plugs into the back of the TV. Does not take up counter space and does what I need it to do. Turns my television into a SMART TV. I don't play video games, so this was perfect for me. I LOVE it and wish I wasn't paying for satelite, but my husband still likes his whole house satelite programs. Great item. I have one in the master bedroom and one in our guest bedroom. Easy to set up and I get e-mail update on new programs available with Roku. LOVE, LOVE, LOVE my Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Tamara \"Tamara Judds\""}, {"rating": 5.0, "review": "works perfectly like new", "verified": true, "helpfulness": "0/0", "author": "E H Hernandez Soriano"}, {"rating": 5.0, "review": "So. so simple. Just plug it in and change your input source and you're ready to roll.", "verified": true, "helpfulness": "0/0", "author": "vegassuzi"}]