[{"rating": 2.0, "review": "Very slow! Sent it back after 2 weeks of freezing, pausing, and the longest start up time every single time you turn on TV!", "verified": true, "helpfulness": "0/0", "author": "Kevin Charles"}, {"rating": 1.0, "review": "Does NOT support using WPS-protected auto connection for using push-button network connection on routers. I contacted Roku and there is no way to connect using WPS anyhow, you have to use basic no-protection or other simple type-in PIN or password protected network setup to use this product. I was not about to redo a network that has notebook, printer, tablet and phone using it for wifi connections with internet, all working nice and smoothly, just because Roku didn't think to use the protocol that's been available for years. Had to send it back, will not be using Roku products anytime soon.", "verified": true, "helpfulness": "0/1", "author": "Mindy Machanic \"Creativity Queen\""}, {"rating": 4.0, "review": "I love this space saving alternative to the box but it is not compatible with all TVs!", "verified": true, "helpfulness": "0/0", "author": "Breena"}, {"rating": 5.0, "review": "This was a gift to my daughter. She says it is Awesome!", "verified": true, "helpfulness": "0/0", "author": "Jan S. Williams"}, {"rating": 3.0, "review": "Eh, it's ok. The range on it is horrible, so it only works if I am sitting on a certain couch. Sometimes it just freezes for no darn reason. Overall the pros outweigh the cons and I love having a Roku to stream Netflix and Pandora.", "verified": true, "helpfulness": "0/0", "author": "Joshua Folsom"}, {"rating": 5.0, "review": "This is a great product. Works like a charm and offers a great number of channels. Definitely worth the price.", "verified": true, "helpfulness": "0/0", "author": "Gene"}, {"rating": 5.0, "review": "Love this baby!!  I have a standard Roku and purchased 3 of these sticks for me and family.  We love these little things.", "verified": true, "helpfulness": "0/0", "author": "Christopher McNeil"}, {"rating": 5.0, "review": "Works well !", "verified": true, "helpfulness": "0/0", "author": "Leonard Caldwell"}, {"rating": 5.0, "review": "It takes a little while to learn how to install and use it but it's an excellent buy for the price and opens a new world of streaming videos.", "verified": true, "helpfulness": "0/0", "author": "Nirnie"}, {"rating": 5.0, "review": "Love my Roku. We hardly watch our cable any more. Just hoping for a couple more of my favorite shows to become available. Shows and channels are added all the time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"sweetie's mom\""}]