[{"rating": 5.0, "review": "LOVE IT!!!!!  Free yourself from cable TV; it's outrageous cost, and contracts!  Hands down THE BEST way to drastically save a bundle every month, AND- you get to watch YouTube on your regular TV!!!", "verified": true, "helpfulness": "0/0", "author": "Karl Becher"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Jonathan Brandon"}, {"rating": 5.0, "review": "I have 2 of these. One fit my tv perfectly. The other one I had to contact roku for an hdmi extender since the space on my tv was not wide enough to install the stick.roku sent the extender free of charge. Not all customer service reps know this so be sure to tell them to ask a supervisor. Otherwise all is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very convenient and inconspicuous", "verified": true, "helpfulness": "0/0", "author": "Frank Burian"}, {"rating": 5.0, "review": "This was a christmas gift for my sister and she is obsessed with it!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 2.0, "review": "I was very disappointed in the Roku Stick.  After receiving it I went through the setup, which is a little bit of a process but not to bad.  The first thing I noticed is that it runs quite slow.  I have been using my PS3 for streaming services but I don't expect it to be that fast.  The real issue came in with the rebooting.  It randomly restarts itself.  It has even gotten to the point of being unusable at time.  I couldn't even select a movie on netflix before it would restart.  It did this 4 times in a row before I gave up on it.  Very disappointed with the stability of the product.  Will probably get a chromecast now.  Maybe try amazon fire tv", "verified": true, "helpfulness": "0/0", "author": "andrew malone"}, {"rating": 3.0, "review": "Received earphones in package, but remote has no earphone jack!", "verified": true, "helpfulness": "0/0", "author": "D. Moore"}, {"rating": 5.0, "review": "It's awesome. Made my tv smart. Had a problem with stick not fitting in since hdmi port block in my tv didn't had length enough, however I managed to squeeze it in.", "verified": true, "helpfulness": "0/0", "author": "Soumya"}, {"rating": 2.0, "review": "For the first four months, it functioned as a Roku should, though with slow start-up, and I was really pleased with the small size. Then the remote completely died at the four month mark (yes, I swapped in fresh batteries) and Amazon refused an exchange request. I bought a new product as replacement--but not a Roku.", "verified": true, "helpfulness": "0/0", "author": "Richard J. Hanson"}, {"rating": 2.0, "review": "I love the Roku.  This is my second one,  I do love the product but if your trying to decide whether to buy the stick version.  I would not recommend it.  My first Roku was the Roku 2 and honestly, it works better than this stick I puchased.  On the same TV upstairs, the same distance away from the wifi the stick will not work, but the roku 2 is able to get reception to the wifi.  Also, the stick by design does not fit all Tvs.  While Roku will promptly ship you an adapter to fix the problem you should note that because that was one of my  driving reasons for choosing the stick.Love the Roku, just don't get the stick version.", "verified": true, "helpfulness": "2/3", "author": "Janet L Koblenzer"}]