[{"rating": 5.0, "review": "I had ChromeCast but it doesn't stream Amazon Prime and Roku does and it also streams your icloud music.  So I switched out the ChromeCast for Roku and doubled my options.", "verified": true, "helpfulness": "0/0", "author": "Michael Moore"}, {"rating": 5.0, "review": "was easy to install and set up, watch all the programs that i want not what cable allows me to watch", "verified": true, "helpfulness": "0/0", "author": "knutla"}, {"rating": 1.0, "review": "Sent this one back due to movies would not download and kept cutting out to buffer.  Bought the roku 3 instead.  3 way better!", "verified": true, "helpfulness": "1/1", "author": "John Foster"}, {"rating": 5.0, "review": "I love this product.  It was super easy to get started and I take advantage of watching so much more on TV, especially PBS.  This was worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Kathleen M. Osullivan"}, {"rating": 5.0, "review": "I went to internet streaming for cost savings over the cable and satellite programs and have been well satisfied with the Roku products.  I have the older version of the Roku device on another television, and it has worked just fine.  However, the older versions have more devices and wires that you have to hide.  I ordered this new stick to go on the television in the bedroom as it is a compact unit and easily hidden.", "verified": true, "helpfulness": "0/0", "author": "Tom Strawther \"Tom\""}, {"rating": 5.0, "review": "This is perfect and the remote makes it easy for he whole family to use.  It was easy to set up and start streaming.", "verified": true, "helpfulness": "0/0", "author": "Deborah N. Tonks"}, {"rating": 5.0, "review": "The HDMI connections on my TV obstructed the Stick, so I purchased a short HDMI cable and HDMI female connector to connect it.  This worked great and the following set up went seamlessly. The Roku Streaming Stick works great for watching Netflix and Amazon Prime shows and movies.", "verified": true, "helpfulness": "0/0", "author": "GR"}, {"rating": 5.0, "review": "Bought one of these sticks. amazing what can be done on something the size of a WiFi dongle. Can't really think of any downsides, it replaced my apple TV.", "verified": true, "helpfulness": "0/0", "author": "Gihan Ranatunga"}, {"rating": 5.0, "review": "The Roku was simple to install.  We have one on all three TVs.  Using the different apps is now a breeze with the included remote.  A must if you stream alot on the TV.", "verified": true, "helpfulness": "0/0", "author": "ran0368"}, {"rating": 5.0, "review": "Grreeeeeeeeeeeeaaaaaattttttt. So great. Real great. Not bad. Was it bad? no way -- just real nice. And real good. Real nice", "verified": true, "helpfulness": "0/0", "author": "Matt Fore"}]