[{"rating": 5.0, "review": "Mother loves it!", "verified": true, "helpfulness": "0/0", "author": "Janine Strauss"}, {"rating": 2.0, "review": "So unhappy with this product, it's always loosing connection, its very slow. I just stop using it all together.", "verified": true, "helpfulness": "1/1", "author": "Chyna"}, {"rating": 3.0, "review": "Did not work on my TV", "verified": true, "helpfulness": "1/2", "author": "onlineshopper \"pj reader\""}, {"rating": 5.0, "review": "Wonderful streaming sticking. I found channels I didn't know even existed. The cooking channels/apps on the Roku are awesome. My wife got a great recipe to cook a meal she didn't know how to make before, after I set up the stick.", "verified": true, "helpfulness": "0/0", "author": "Jacob S"}, {"rating": 5.0, "review": "I have a few of these now. I much prefer them to the \"smart TVs\" that we've had / used.  The interface is clear, no problems with network streaming, and the App support with smart phones and tablets makes this a much more user friendly and cost effective option than getting a smart phone and hoping the firmware updates include what you want.  Love that this supports so many of the channels that we want, and not just the few that the smart tv or other streaming device has negotiated with.have used other streaming devices, including western digital and chromecast.. .this replaces all of those.", "verified": true, "helpfulness": "0/0", "author": "Lakeside Customer \"Dan\""}, {"rating": 5.0, "review": "I bought this gift for a buddy of mine being that I already own a Roku 2. He absolutely loves it! He didn't realize all the different channels he was able to get. I LOVE ROKU!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Duane Harris"}, {"rating": 5.0, "review": "This is one of the best items you can have for your tv viewing.  We are getting more of these so that we can send a whole bunch of cable boxes back to AT&T; to avoid the monthly fees, particularly since these make your tv's into smart tv's. I am quite pleased with the variety of channels and the ease of installation. My wife and I have been catching up on Game of Thrones from the beginning, and that's impossible to do without a service like HBO Go, and you have to get that online, and this stick will do that for you.FYI, I saw a number of folks that complained about how long it took the unit to power up and show channels, but this is not a problem if you plug the stick into an outlet that doesn't get shut off when the tv is.  If you plug it in and leave it plugged in with the power on, there is no lag and the picture quality is very good.  I am impressed.", "verified": true, "helpfulness": "0/0", "author": "MHAbid"}, {"rating": 5.0, "review": "Arrived quickly. Works just like any other roku.", "verified": true, "helpfulness": "0/0", "author": "Don Simpson"}, {"rating": 1.0, "review": "My wifi's rated at 25 MBPS, and the router is less than 5 feet from where I plugged in this device.  Despite this, all I got was \"buffering\" screens for every service I attempted to use.HBO Go?  Buffering.  Hulu +?  Buffering.  Amazon?  Buffering.  Casting?  buffering.I literally spent more time looking at menus and \"buffering\" screens than I spent watching actual content.  No other wifi devices have trouble streaming in my house, yet Roku's streaming stick could do nothing for me....except make me wait...and wait....and wait....", "verified": false, "helpfulness": "1/1", "author": "Enrique Fernandez Roberts \"Stray Dog and commentator\""}, {"rating": 5.0, "review": "Such a great little thing! Does all I need and does it well. You need one of these!", "verified": true, "helpfulness": "0/0", "author": "Christopher Reynolds"}]