[{"rating": 3.0, "review": "I had hoped for streaming to work from my PC or tablet(apple device) but it does not.  It does display pictures, but not video.", "verified": true, "helpfulness": "0/0", "author": "Mike Moss"}, {"rating": 1.0, "review": "I've had two streaming sticks, neither one has worked. I returned the first, and Roku sent me a replacement. The second one doesn't work, either, and Roku won't let me return it.", "verified": true, "helpfulness": "0/0", "author": "William Hines"}, {"rating": 1.0, "review": "It works but slowly! After 1 day I couldn't deal with the slow load up of apps and painful latency. I just bought a Roku 3 instead and I love it.I also like that the Roku 3 has an Ethernet port.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "I love this device. Pretty much the reason to tell Time Warner to go to hell", "verified": true, "helpfulness": "0/0", "author": "Stephen Rifkin"}, {"rating": 4.0, "review": "It is great. But the remote doesn't always stay connected and freezes", "verified": true, "helpfulness": "0/0", "author": "Joy Love"}, {"rating": 1.0, "review": "So fed up with this little piece of crap. It's been hit and miss from the get-go. For weeks, the device shows as connected to my Wi-Fi, but I can't get any channels. Roku customer support tells me I need to call my router company and have them change the DNS on my router. I can only imagine the fall out from there – I'm sure other devices will start not working properly, etc. looks like I'm going to have to pursue other options for streaming.", "verified": true, "helpfulness": "0/0", "author": "Larissa Kosarych"}, {"rating": 5.0, "review": "Very easy to use, and I am a bit electronically challenged. Recommended this to my brother and sister in law and they also purchased one.", "verified": true, "helpfulness": "0/0", "author": "Susan O,Connor"}, {"rating": 2.0, "review": "Love the roku but the remote only works fifty percent of the time. Rendering it useless.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Second  Roku stick for me. This unit runs the same and is very adequate for needs. These sticks are inserted into the HDMI port and have had trouble with both getting into TV with the cable for other attachments being too wide to install both due to the stick width. I actually shaved the plastic on the cable next to the stick down to metal to gain clearance to plug in both.", "verified": true, "helpfulness": "0/0", "author": "elheffe52"}, {"rating": 5.0, "review": "Weaning myself from Uverse cable", "verified": true, "helpfulness": "0/0", "author": "db"}]