[{"rating": 5.0, "review": "I love this streaming stick.  The quality of the picture is flawless. I love that it is mobile.  I can begin watching a show in the bedroom and finish it over my mom's if I would like.  This is a steal.", "verified": true, "helpfulness": "0/0", "author": "Yolunda"}, {"rating": 4.0, "review": "Great price! All the same features as regular roku, but you save money. Works just as good as my roku.", "verified": true, "helpfulness": "0/0", "author": "Roy"}, {"rating": 5.0, "review": "I've got 3 of these going 24/7 in my house for about 6 months. All have been working great.Only issue we have is the occasional remote communication. A quick reboot while pressing the reset button on the remote (under the cover) fixes it.. otherwise we tend to use our android devices to control the Rokus (arguably better than the remote anyways).", "verified": true, "helpfulness": "0/0", "author": "Daniel C."}, {"rating": 1.0, "review": "I hate it it sucks will not connect to wifi", "verified": true, "helpfulness": "0/1", "author": "jacob mills"}, {"rating": 3.0, "review": "Good but slow to start up.", "verified": true, "helpfulness": "0/1", "author": "Brandon Montana \"deadsessy\""}, {"rating": 5.0, "review": "Works great to watch movies on Amazon and Netflix.  After speaking with friends who have Apple TV and Chromecast, we went with the Roku, and are glad we did. So easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "tricial"}, {"rating": 5.0, "review": "Got this for my wife for Christmas. We've been without cable for years just using an antenna for local channels. This opens up a whole new experience especially with a streaming Netflix account. It's got PBS kids which our 3 year old loves. The remote is easy to operate although my one gripe would be that it's too bad you can't program the four favorite channel buttons since two of the four we'll never use. Still a great product and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Devin Hannas"}, {"rating": 4.0, "review": "Thank You. Works great", "verified": true, "helpfulness": "0/0", "author": "janice moore"}, {"rating": 4.0, "review": "Easy to use, didn't like the fact that Roku forces you to register with credit card info just in case you want to make a purchase in the future.  If I want to make a purchase, I will offer my card info.", "verified": true, "helpfulness": "0/0", "author": "Susan B"}, {"rating": 1.0, "review": "Let me start off by saying that I am very technical savvy.  I can build a computer from scratch and routinely at work I have to deal with getting laptops and desktops to display over various monitors and projectors.  Getting things to display correctly has been part of my job in the past.Bought this for an older TV I wanted to hook into my home network.  It was a Broksonic 32 LED TV with two HDMI inputs.  Hooked up the Roku out of the box to TV, tried both the HDMI 1 and 2 inputs.  No picture.  Tried different settings on the TV but had no luck.  Just to make sure the ports were good, I hooked up my laptop to the TV and used the TV aas a second monitor.  The laptop easily worked with the TV on both HDMI ports with various settings.  Tried contacting Roku, to get on a chat line with them was over 45 minutes!!!  And this was well before the Christmas holiday.  Tried calling them and after sitting on the phone for over ten minutes (was told there was only a 7 minutte wait) gave up and sent an email.In the meantime decided to try the Roku on a newer TV.  It worked immediately on the newer TV, but since the newer TV was already streaming capable, don't really need it there.  Decided to get the stick working to see if I could modify settings on the stick.  At this point I found out had to input a credit card to get the stick activated online.  I had no desire to purchase anything but the Roku site would not let me get past the credit card screen to activate the account and Roku.  Went back to the Roku site again and still over a 40 minute wait to get a chat line going.  Apparently, you can put in your credit card during the application process then delete it.  I just didn't want to give out this information.  Decided to send another email asking about an account with a non credit card.  At this point, there was nothing I could do but wait.In less than 24 hours I got an email with a link I could use to create an account without a credit card.  Got the account active and was able to activate the Roku.  It was at this point that I noticed that while the Roku is booting up, it sends out information at 480 lines of resolution before settling on it's native 720 lines of resolution.  I tried setting the Roku to broadcast at both 720 and 1080 and then tried plugging the stick into the older TV at no point did I even see any type of output from the Roku on the older TV.  It just wouldn't put out anything this TV could display.The whole reason I bought this stick was to make my older TV a little smarter and allow me to stream from the internet or my home network to this TV.  I couldn't get this to work and I sent multiple emails to Roku that went COMPLETELY unanswered.  The only time they responded was to my credit card request and an orignal email stating how to troubleshoot the Roku frmo their website.  I had already found this information myself before I had even received any email from them and followed all their steps exactly as stated.  I was very polite in each of my emails even though I was getting very frustrated,  Roku was just unable to help me past the point of anything that is already part of their online faqs.I suspect whatever signal this Roku is putting out, my older TV has an issue with.  It's quite possible, the device I have is defective but I will never know.  Roku wouldn't give me any support so I have no idea what the real underlying problem is.  I did a lot of research before buying this stick and I was hoping it would be a good solution for me.One last thing I would like to add, one of the reasons I bought the stick was to hook it into my home network.  I have a Windows 7 machine I use as a DVR to record our TV and on Windows 8 I use XBMC for any media we burn to the computer from a DVD.  I use DLNA and it appears from first scanning the system, that Roku needs an app downloaded in order for me to stream from DLNA over my home network.  Since I did not get this system working, I'm not quite sure if this is the case but wanted to add this to this review for other who may be in my shoes.", "verified": false, "helpfulness": "2/3", "author": "R. Zuniga"}]