[{"rating": 5.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "SM \"SM\""}, {"rating": 4.0, "review": "This is a second for our home...for my son's room.  We use Roku so much we will likely cancel our cable.  It's easy to Navigate.  My 6 year old can work it proficiently.", "verified": true, "helpfulness": "0/0", "author": "Amie Albright"}, {"rating": 1.0, "review": "6 months after use the remote will not connect to the roku also I get an error that roku cant find a internet connection. Tried new batteries ,unplugging the roku\" 15 sec\" ,  relinking remote , total reset of system. None of these helped and roku support is a joke. Going to try fire tv.", "verified": true, "helpfulness": "1/1", "author": "C. Caldwell"}, {"rating": 5.0, "review": "Wonderful!  I was able to get rid of my cable box and DVD player and replaced it with this that takes up very little space!!!", "verified": true, "helpfulness": "0/0", "author": "Andrea"}, {"rating": 5.0, "review": "Love it! Bought this for my husband. Easy to set up, easy to use. What's not to like??", "verified": true, "helpfulness": "0/0", "author": "smurfette"}, {"rating": 5.0, "review": "Does everything I need it to. Roku is definitely the best streaming company. It's supported by pretty much everything. This stick performs great, no lag.", "verified": true, "helpfulness": "0/0", "author": "Jared"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "elaine hall"}, {"rating": 5.0, "review": "LOVE this Roku stick! So easy to set up, easy to use. LOVE the setup of Netflix on this. I don't know what more to say, I just am so happy with this purchase.I recently received a request to answer a question about what is included in the box to power the stick... some of the wrong answers astounded me! So let me set the record straight. This comes with a microUSB cable. One end is micro, the other is USB. The micro part goes into the stick...it MUST to get power. The other end can go into the usb outlet on your TV if you 1. have an outlet and 2. It provides enough power. Otherwise, also included with it is a power adapter similar to those you use for your smart phones and tablets. On end plugs into the outlet in the wall the other end accepts a USB cable. ALL IS INCLUDED in a new purchase. If you buy used I can't make any promises.", "verified": true, "helpfulness": "11/11", "author": "Amazon Customer \"Joey's Mommy\""}, {"rating": 1.0, "review": "Not good", "verified": true, "helpfulness": "1/2", "author": "penny creasy"}, {"rating": 4.0, "review": "The Roku stick was very nic", "verified": true, "helpfulness": "0/0", "author": "Barbara Allen"}]