[{"rating": 5.0, "review": "yep..love it. much easier to use then the boxes", "verified": true, "helpfulness": "0/0", "author": "Nancy F"}, {"rating": 5.0, "review": "I have 2 other roku boxes and bought the stick just because I like that it's hidden. Works great.  Short cut buttons are not really anything great but still the best streaming device!", "verified": true, "helpfulness": "1/1", "author": "Natalie"}, {"rating": 5.0, "review": "Excellent connectivity, easy to install and use.  Wonderful channel selection, user friendly remote interface a real improvement from the original.", "verified": true, "helpfulness": "1/1", "author": "Melanie Grossi"}, {"rating": 5.0, "review": "I love the small form factor and auto-pairing remote control.", "verified": true, "helpfulness": "0/0", "author": "Move Lover \"moviemovie\""}, {"rating": 5.0, "review": "Bought this for my technologically challenged father. He uses it often. He now likes to tell people about \"the youtubes.\" A little behind the times but he can use it and that is a major upgrade for that dinosaur.", "verified": true, "helpfulness": "0/0", "author": "TD"}, {"rating": 5.0, "review": "I've owned the original Roku box for years.  Back then, the concept of streaming video like from Netflix, was a revelation.  Recently, every device under the sun streams video.  But, if you don't have a tv or blu ray or video game console that offers streaming video, the Roku Stick is the best bang for your hard earned buck.  For less than $50, you get all the features and channels you can expect other (more expensive) streaming devices.Quick word of wisdom: plug the Roku Stick into a power outlet, not your tv's USB port.  Trust me, if your tv is anything like mine, there is a performance difference.", "verified": true, "helpfulness": "0/0", "author": "MyOtherShirtIsClean"}, {"rating": 4.0, "review": "Suprisingly easy to install and works well. It was a good gift.", "verified": true, "helpfulness": "0/0", "author": "Stuart Hershkowitz"}, {"rating": 5.0, "review": "Took me a while to adjust to ignoring the TV channels lineup, but now I'm in the groove and watch whole series, episode by episode.  Some reviewers have indicated thaey needed super fast internet speed, but I have found my moderate speed service works fine.  Sometimes I find that the sound runs but the picture is replaced by an orchid pink screen, but I figured out that it's because the modem needs to be reset -- usually after electrical interference during a storm.  Cut my cable bill drastically and enjoying my TV more than ever.", "verified": true, "helpfulness": "0/0", "author": "Ruth Ledesma \"Ruth Ledesma, Creative Strategist\""}, {"rating": 2.0, "review": "The remote constanly had to be paired to the device. In one session it had to be paired 6 times in 45 minutes... I have two other Rokus with no issues. Also noticeably slower than the Roku boxes. It is going back!", "verified": true, "helpfulness": "1/1", "author": "J-Bone \"JBone\""}, {"rating": 4.0, "review": "I think this one is a little slower loading than my Roku 3; but overall it works great and you can't beat the price.  I'm thinking of buying another for my parents.", "verified": false, "helpfulness": "0/0", "author": "Ed S"}]