[{"rating": 5.0, "review": "for me, the remote needs direct line of sight to control the streaming stick...I usually control via smartphone app.", "verified": true, "helpfulness": "0/0", "author": "Johnny"}, {"rating": 5.0, "review": "This is great!", "verified": true, "helpfulness": "0/0", "author": "Erin Wood"}, {"rating": 2.0, "review": "We bought this primarily to watch Netflix on the kid's TV.  The menus were easy enough for a 5 & 7 year old to navigate once in the Netflix application.The main problem we had with the device was that the remote control was constantly dropping connection.  We would have to take out the batteries and hold the button and wait for it to re-recognize.  Sometimes we would have to repeat the procedure for it to start working again or unplug the power to the stick itself.  This was at least a daily occurrence, we tried new batteries and keeping the remote close to the TV and nothing seemed to help.The second issue is that the device is s-l-o-w.  Waiting for things to load seemed to take forever.  We just bought a Fire TV stick to replace this and it is so much faster.  I would not recommend this to anyone until there is a new faster version and fixed remote.", "verified": false, "helpfulness": "0/0", "author": "M. Holmes"}, {"rating": 1.0, "review": "After the initial installation and software update I began to use the Roku only to be hugely disappointed.  Within minutes the screen locked up and I had to unplug the power to recover.  Then shortly after it happened again and I had to remove both the remote control batteries and cycle the system power.  The unit is plugged into AC power and has an excellent signal form the router so neither of those things are the issue.  It's going to be returned and I'm going to try the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 3.0, "review": "I would recommend buying a Roku 3 over the stick. The stick seems to loose the connection and is slower.", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 5.0, "review": "got it for my wife's home office TV and she loves using it for Pandora", "verified": true, "helpfulness": "1/1", "author": "Barfy"}, {"rating": 5.0, "review": "Wish I would have bought one sooner.", "verified": true, "helpfulness": "1/1", "author": "Randyfirchow"}, {"rating": 5.0, "review": "LOVE THIS THING! We got rid of cable. We stream youtube, pandora, disney junior, espn, nbc sports, slingtv, netflix, hulu, etc through this. its awesome!", "verified": true, "helpfulness": "0/0", "author": "E. Miske"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Guillermo"}, {"rating": 5.0, "review": "Works fine", "verified": true, "helpfulness": "0/0", "author": "JOhnnyMo"}]