[{"rating": 4.0, "review": "Takes a while to register from the remote to the device, and sometimes takes quite a while to actually load, but otherwise it's a great device.", "verified": true, "helpfulness": "0/0", "author": "Georgia huffman"}, {"rating": 4.0, "review": "Roku is awesome. Easiest device out there. Wifi remote. Runs off iPhone app. I have had to reset it every couple weeks and the stick, sticks straight out of the TV, so you may need a short pigtail extension of you have space issues.", "verified": true, "helpfulness": "0/0", "author": "Christopher C Thomson"}, {"rating": 5.0, "review": "Works great where you don't have an NIC. I have mine on a 5 GHZ wireless connect and it never hangs or pixelates and has HD quality output.", "verified": true, "helpfulness": "0/0", "author": "P. Daniel"}, {"rating": 5.0, "review": "A necessary part.", "verified": true, "helpfulness": "0/0", "author": "gerejamer"}, {"rating": 3.0, "review": "had extremely hard time registering it without giving my cc number, but it works fine.", "verified": true, "helpfulness": "1/1", "author": "del petitt"}, {"rating": 5.0, "review": "Very easy to use.  I bought several as Christmas presents.  They are a big hit with everyone I gave one to.", "verified": true, "helpfulness": "0/0", "author": "Michael W. Riley"}, {"rating": 4.0, "review": "I really like this stick. I have had it for months. I have a Vizio co-star, Roku 3, Fire TV, a couple of streaming bluray players. I love the interfaces on the Rokus. I just thought I would let you know that I am not ignorant on streaming devices. I have even recommended to a friend that was looking to buy a streaming led television, buy the TCL Television with the Roku interface, they are inexpensive.", "verified": true, "helpfulness": "1/1", "author": "Larry Finley"}, {"rating": 2.0, "review": "unable to set up. won't let me past the point of putting in my wifi password, keeps resetting. going to return.", "verified": true, "helpfulness": "0/0", "author": "Nikole Easter"}, {"rating": 5.0, "review": "Easy installation, great price", "verified": true, "helpfulness": "0/0", "author": "Manuel h araujo"}, {"rating": 4.0, "review": "I like it but I didn't know that the stick needed to be plugged into a USB port or thru an adapter that plugs into an outlet", "verified": true, "helpfulness": "0/0", "author": "Jenney"}]