[{"rating": 5.0, "review": "Excellent transaction. Product just as promised and shipped and received as promised!", "verified": true, "helpfulness": "0/0", "author": "Gene Bowser"}, {"rating": 5.0, "review": "User friendly and easy set up", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Whitlow"}, {"rating": 5.0, "review": "nice, it is in my opinion 1 up from chromecast and on par with the firestick.", "verified": true, "helpfulness": "0/0", "author": "Tuxydoh"}, {"rating": 4.0, "review": "I bought three and keep getting e-mails to buy moreWe all love it", "verified": true, "helpfulness": "0/0", "author": "gloria cardinal"}, {"rating": 1.0, "review": "Returned did not work like the awesome roku box I have 4 of those now", "verified": true, "helpfulness": "0/0", "author": "woodpenturner"}, {"rating": 5.0, "review": "This was way better than I expected.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 1.0, "review": "I got a defective Certified Refurbished unit, and it was a mistake because it was still defective!I got intermittent purple screen and  black screen while setting up and watching.For me, refurbished was a waste of time, and I do not want to inherit someone else's defective unit so I returned it and ordered a new unit.It was a mistake to try and save $8.I have Roku already, so I know it is good, and I would have given this five stars, so keep in mind that one star is for the still defective refurbished unit and I highly recommend Roku.", "verified": true, "helpfulness": "0/0", "author": "Guzman \"MemoryLOSS\""}, {"rating": 5.0, "review": "Love it!! My son has Roku 2, He wishes he bought the stick instead.  My granddaughter watches Netflex on it and Disney. i just wish they have app for Nick JR. They more TV apps", "verified": true, "helpfulness": "0/0", "author": "Tudorrose \"TerrieJ\""}, {"rating": 5.0, "review": "I never ever do reviews but I am so in love with this Roku stick. I have it in my sons room but at anytime I want to take it out of his TV and put it into any other TV in the house I can without reprogramming it. It has every app I need to either stream movies/tv shows or music. I am going to buy 2 more to put in other rooms in my house! I never have a buffering issue with it either. It works in every room in my house perfectly! BTW I purchased in Dec 2014", "verified": true, "helpfulness": "0/0", "author": "Dominique Sha Whitaker"}, {"rating": 5.0, "review": "love the roku stick. it's out the way,no more box to look at. it's hid behind the t.v. out of the way. tons of chanells great streaming. i'm totally stisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "edgar davila"}]