[{"rating": 5.0, "review": "Very Cool, it works and I save me money on my satellite bill.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "This is perfect for me! It's portable, convenient, and easy to use. I have thoroughly enjoyed it thus far and have experienced no major issues.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Roku streaming stick. So many streaming services in one device including Hulu, Netflix, and Google Play. I love having the convenience of a remote also. Only thing I'm not too thrilled about it having to plug it in to a power source while using it. Other than that, I'm very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "Ryann Richardson"}, {"rating": 4.0, "review": "The only problem was connecting it to my WiFi as i was having an issue with the password. I eventually resolved it myself and the stick downloaded successfully. Since I installed, I have no further issues when it is used by me or my wife.", "verified": true, "helpfulness": "0/0", "author": "Jamed McCarthy"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "LEANDRO LUIZ"}, {"rating": 5.0, "review": "Reall amazing!", "verified": true, "helpfulness": "0/0", "author": "Brian Copeland"}, {"rating": 5.0, "review": "No Way,  This was mentioned as referbished and looks like in original box and everything packed like they were untouched to me it looked like a Brand New Item.  Great deal and the shipment was very fast.  Attached to my TV and getting lots and lots of programs.  Get it, you will be a happy you did person", "verified": true, "helpfulness": "0/0", "author": "Marcel Melvin Dubois"}, {"rating": 5.0, "review": "Works very well.  No issues to date.", "verified": true, "helpfulness": "0/0", "author": "john lamerson"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Angela N."}, {"rating": 5.0, "review": "got it for my daughter and she loves it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]