[{"rating": 1.0, "review": "VERY SLOW!  We ended up selling this and purchasing a chromecast instead.", "verified": true, "helpfulness": "1/1", "author": "The Dodson Family"}, {"rating": 5.0, "review": "Exactly what I expected works great.", "verified": true, "helpfulness": "0/0", "author": "Mark Bunch"}, {"rating": 5.0, "review": "Easy setup, easy to use. Very happy with our purchase", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 3.0, "review": "When working, this product is awesome. Very, very easy to setup and use. However, It stopped working 8 months after purchase. Despite every suggestion on the internet on how to remedy the situation it still will not work.", "verified": true, "helpfulness": "0/0", "author": "Annie"}, {"rating": 5.0, "review": "Awesome product. I love it!", "verified": true, "helpfulness": "0/0", "author": "Julie Wahlen"}, {"rating": 1.0, "review": "Connected device, it fired up, found my network, took encryption password, tested network and internet connection fin and gave me the activation code with instructions to activate.  Went to the webpage, put in code and all information to create account, submitted and nothing just processed for 5 minutes before timing out.  Reset device, tried all again with same result so decided to call the tech support everyone is bragging about.  First guy wanted the admin user name and password to my cable modem to fix the issue... really?  Second guy said my network protection services were not running and that's why it wouldn't work, he offered to sell me one. He offered to sell me a Windows service,  wow.  I did check the service and verified it was running and figured maybe the third time would be a charm and called again.  \"Tech number 3\"  (they all sounded like the same guy) told me after analyzing my firewalled, encrypted network that it was full of viruses and malware.  He offered to sell me a virus checker at a discount because the trend micro I currently use is no good.  This device is a scam to sell you in-necessary software.  Stay clear and don't waste your time.  Go with a competing device if you want Miracast which is all I really wanted it for.", "verified": false, "helpfulness": "0/1", "author": "MasterBlaster"}, {"rating": 3.0, "review": "First of all, full disclosure - I bought our Roku stick at Radio Shack, not on Amazon.  I also purchased one for my inlaws and for my son and his wife  I got them all at Christmas.  We have had a Roku 3 for almost a year and a half and absolutely love it, so we thought the Roku stick would make great gifts and wanted one for our bedroom tv.  My in-law's Roku stick has been working perfectly since we got it for them last Christmas, as does the one we bought for son and wife;  however, ours is not responding anymore after almost six months of mild use.  I removed the stick from the back of the tv and not that it gets very hot.  The Roku screensaver comes up but there is no response from the Roku remote.  I checked the batteries, and they are good.  I can only assume we got a bad unit.  I am giving it 3 stars since the others we bought work well.  I guess there's a bad one in every batch!  The net one we get will be another Roku 3.", "verified": false, "helpfulness": "0/0", "author": "K Dean"}, {"rating": 4.0, "review": "Good product. Does what it says. Customer Service/ technical  issues are handled by folks for whom English is a second language which is never good when technical terms are being discussed. My questions where not answered by way of phone or live chat; the representative was obviously confused.  That being said penny for penny this little gadget is far better than cable t.v. I should have made the switch along time ago.", "verified": true, "helpfulness": "0/0", "author": "A.D. Jordan"}, {"rating": 5.0, "review": "We like it.", "verified": true, "helpfulness": "0/0", "author": "Barry Lawson"}, {"rating": 1.0, "review": "Cheaply made", "verified": true, "helpfulness": "0/1", "author": "Wendy"}]