[{"rating": 1.0, "review": "The remote does not work 30 days later. Sometimes it works, then it sporadically stops working.", "verified": true, "helpfulness": "0/0", "author": "lxelite"}, {"rating": 1.0, "review": "Horrible support, bad device. Roku Support is horrible, and the device does not work with Prime Videos in 5.1.I spoke today with Srinadh and Sam.  Both gave horrible support and were unable to solve the issue I was having.Both recommended as a troubleshooting step signing up for additional pay services to test additional features.  They refused to support the device after I stated I was not going to spend money signing up for additional services to test their device (I've tried the services they recommended in the past so no free trials).Here is a common sense idea: A Roku troubleshooting test channel that has videos they know for certain work with the various features of the device instead of telling people to sign-up for paid services (giving Roku a sign-up kickback) to test the device functionality.This device does not work with Amazon Prime Instant Video in 5.1 connected to Yamaha & Sony receivers connected to 2 different televisions.  In both cases no matter what settings were used only Stereo PCM output worked, any of the other options either resulted in working Stereo PCM output, or the device outputting in PCM with loud click when it was supposed to be sending DD/DD+/DTS (it never once sent a signal detected as DD/DD+/DTS to either receiver).Both of these receivers work with my Android Phone which has HDMI out and the Prime Video app (wish that worked on tablets).The whole point of using the Roku device was to remove the need to connect and disconnect my phone from the receiver.Roku's only support option for checking 5.1 is as I mentioned, sign up for additional paid services as they do not have any videos they know work from any of the free services and they do not have the common sense to have a test channel with videos they know work.As a side/final note, the device gets very hot to the touch when powered.EDIT: narrowed the issue to the Amazon channel without having to sign up for any paid services and without any help from Roku.  Test was by finding 5.1 on the free 2 minute previews offered via the Vudu channel.", "verified": true, "helpfulness": "2/2", "author": "Joe"}, {"rating": 3.0, "review": "Nice amount of channels but more difficult to use than chromecast and firestick. I own those as well. Response to remote is fairly slow.", "verified": false, "helpfulness": "0/0", "author": "steve"}, {"rating": 5.0, "review": "Satisfied customer.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "No problems, works just as good as the lady generation if not better", "verified": true, "helpfulness": "0/0", "author": "C. Powers"}, {"rating": 5.0, "review": "Easy to install, easy to use!", "verified": true, "helpfulness": "0/0", "author": "Julie Cashin"}, {"rating": 5.0, "review": "This is a great product which exceeds our expectations! We highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got this for the daughter....it works out pretty good...is slightly slower than the Roku III we got in the family room...but for about half price...a great deal.", "verified": true, "helpfulness": "0/0", "author": "Michael L"}, {"rating": 1.0, "review": "I have had this for several months. It now keeps losing sync with the remote, and also it keeps losing connection to the apps. The settings says there is excellent connection to my wifi, yet will keep buffering or netflix will say to check the internet connection. I moved my Roku XD into my living room to replace the streaming stick, and I now have no problem. Don't buy this. And of course the date to return this item has now expired. I love Roku product, I have 3 boxes. But this is a piece of Junk.", "verified": true, "helpfulness": "2/2", "author": "UKUSReader"}, {"rating": 1.0, "review": "this does not work. I thought it was the internet connection but it disconnects from netfix or amazon constantly.  junk", "verified": true, "helpfulness": "0/0", "author": "Louise la Plante"}]