[{"rating": 5.0, "review": "My family loves this device!!  Everyone wants one for their tv.  It is so easy to set up and begin using.", "verified": true, "helpfulness": "0/0", "author": "JMSS"}, {"rating": 5.0, "review": "We have converted the whole family to Roku. These are great streaming devices. Got this one for my wife and sister-in-law. Great little device, will mirror smartphone screen, easy to play videos from the phone for everyone to enjoy.", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "so far easy to set=up and easy to use.  I'm still learning", "verified": true, "helpfulness": "0/0", "author": "rabbit8672"}, {"rating": 5.0, "review": "This works as well as the Roku 3. It might be a bit slower to start streaming a program but it isn't a big amount of lag time and once it is streaming it doesn't hang.", "verified": true, "helpfulness": "1/1", "author": "tklamb64"}, {"rating": 2.0, "review": "I have other Roku units and I thought I was getting an upgrade.  NOT EVEN.  It is ridiculously SLOW.  That ROKU logo bounces forever.....  Selecting various apps like Netflix or Google Play results in nonresponsive button pushing....over and over and over.  I am DEEPLY disappointed in this unit.  I love my other units though but just be warned about this one.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer \"mzdee\""}, {"rating": 4.0, "review": "Roku works as expected.  You DON'T need a Roku ready TV to make this work.  Simply any TV with an HDMI connection will work with this.", "verified": true, "helpfulness": "0/0", "author": "DJ DEPTA"}, {"rating": 5.0, "review": "I get all the chanels I wanted. Set up was easy.", "verified": true, "helpfulness": "0/0", "author": "James W. Haase"}, {"rating": 5.0, "review": "as good as it gets", "verified": true, "helpfulness": "0/0", "author": "Marion Y."}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Carol D Alexander"}, {"rating": 2.0, "review": "Not sure if this thing doesn't have enough memory in it or if it's got a bad antenna, but I replaced my old Roku 1 with this stick and video was poor and choppy...used the FireTV Stick instead in the same room and got the best results ever.  I'm a new fan of the FireTV Stick", "verified": true, "helpfulness": "0/0", "author": "Peter Grizzaffi"}]