[{"rating": 2.0, "review": "Never could get it to work", "verified": true, "helpfulness": "0/0", "author": "darla stevens"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Darrick \"record collector\""}, {"rating": 1.0, "review": "We have had the Roku stick for about 3 months, the first 6weeks it worked well. Now it is consistently overheating and causing long buffering times. It is nearly impossible to watch anything for more than 5minutes without downloading interruptions. No amount of troubleshooting has resolved the issue.  I do not recommend this model although Roku in general has produced dependable streaming devices.", "verified": true, "helpfulness": "0/0", "author": "R. Phelps \"skeptical\""}, {"rating": 4.0, "review": "Have had the Roku Streaming Stick for a little over a month. Some of the other reviewers have mentioned that it takes forever to start up, and while it does take about a minute, I don't think it really takes away from the device. Totally an acceptable amount of time. I like that I am able to watch Amazon Prime with this device, as some other devices do not include this option.My only gripe is that I have had to log-in multiple times to Amazon Prime as well as Netflix. I don't really understand why it can't just keep me logged in? It hasn't been every single time I watch these 2 channels, but probably 3 or 4 times for each channel over the past few weeks.Overall, I would recommend purchasing the stick.", "verified": false, "helpfulness": "0/1", "author": "JRenee"}, {"rating": 1.0, "review": "quit working after a couple of months. stay away from this product. Unable to return it.", "verified": true, "helpfulness": "0/0", "author": "Graduate Student"}, {"rating": 3.0, "review": "The stick worked fine except for the fact that the Amazon Prime channel crashed every time I opened it. After dealing with Roku and Amazon support with not resolution I returned it. It doesn't matter if you have a plethora of channels if one of the top three streaming services doesn't work.", "verified": true, "helpfulness": "0/0", "author": "M. Beckett \"Boom.\""}, {"rating": 2.0, "review": "I had never owned a Roku before and was happy with it up until a week ago.  The device was great I was able to stream Netflix, Amazon, watch PBS, etc etc.  But after owning it for 7 months it quit working.  It loads up into the channel menu, but then 5 seconds later it reboots and the cycle starts over.  It'll load back into the menu and 5 seconds later, reboots.  I'm bummed about it because it was perfect.  Now I'm skeptical on buying another one because I don't want to be buying another device in 7 months.  I'm not sure if maybe mine was a dud, but it does make me skeptical in buying another Streaming Stick.I should also note, that I only used this device in the evenings before I went to bed.  I would say an hour or two, for 3-4 days out of the week.  I would definitely say I was not using this device in a overactive capacity.  That is why I'm giving it 2 stars.  2.5 stars would be more accurate, because it was great, but the 7 month lifespan for minimal usage is not that great.  If it continued to work it would definitely be a 5 star.", "verified": true, "helpfulness": "0/0", "author": "tages"}, {"rating": 4.0, "review": "More robust than Chromcast, but I can't give either of them a 5-star rating because neither of them do everything.  I purchased a Chromecast device so I could use it with my Slingbox.  That was over a year ago and Chromecast STILL cannot work with my Slingbox.  I bought my Roku because it does work with my Slingbox.  That said, it does not have all the features of a Chromecast either. So now I'm the proud owner of a Chromecast, a Roku Stick and an Apple TV and a whole bunch of remotes.  Technology, gotta love it!", "verified": true, "helpfulness": "0/0", "author": "R Luebke"}, {"rating": 1.0, "review": "We bought this in July, I was on the phone with tech support the day we received it.  After about 2 hours of troubleshooting we thought we had the device working.  Since then we have never been able to use it at all.  It's now October and things are settling down so I thought I would take another stab at it.  After 3 hours of tech support the other day, all they could come up with was that I had a bad remote control...lol.  Well I said humor me and send one out.  I received it today and to my surprise (sarcasm) that wasn't the issue.  I have done alot of research on the error codes that I am receiving and it seems that ALOT of people have ALOT of problems with this device.  I am really frustrated now...both that I waited so long that now I cannot return it; past amazons return period:  and I am also upset do to the fact that I wasted $50.  Just an FYI:  I tried to link it with two different routers; a netgear and lynksis.  So it's not that I haven't tried.", "verified": true, "helpfulness": "0/1", "author": "Kerreye Marcoux"}, {"rating": 5.0, "review": "This was a good buy. done what i wanted to do. Just  getting it hooked up.But don,t see any problem with them working just fine", "verified": true, "helpfulness": "0/0", "author": "Steve"}]