[{"rating": 5.0, "review": "After reading the other reviews, I decided to take a chance on this for my wall mounted HDMI tv in the bedroom, having the Roku 3 in the family room and wanting to add another one.  I was concerned, with it being half the price, and new on the market, etc...and some of the reviews saying there were problems installing and remote problems and all.First off, I'm just an average gal who had absolutely NO problems installing it.  Took me ten minutes. Piece of cake.  Secondly, there are no remote issues.  Actually, it works absolutely PERFECT.  The only tiny thing I was concerned about is the length of the power cord which plugs into the stick, as my tv is wall mounted, and it almost didn't reach, but I have a power bar and lifted it slightly.  I don't consider that an issue, they should have made a couple more feet in length is all.  So, don't waste your money on the Roku 3 unless you need the headset...this streams just as good and fast.  No issues.  Sincerely.", "verified": true, "helpfulness": "1/1", "author": "Kristyl N. Adams"}, {"rating": 5.0, "review": "For $50 less than the box version of Roku I'm pretty damn happy!  This was totally easy to install and is such a fun addition to my regular tv channels. :)", "verified": true, "helpfulness": "0/0", "author": "Minneapplemuffin \"Deals, Deals, Deals\""}, {"rating": 5.0, "review": "At first I couldn't figure out how to get this to show up on our TV, we have a Samsung 50\" that's about 5 years old. I made sure to press the input button on the TV. I was hoping it would work just using the HDMI port of our TV. For us we had to use the supplied A/C power cord. As soon as I plugged it into the wall the Roku name showed up on the screen. Nice of them to include the power cord and even batteries for the remote! Once everything powered up and updated it worked without any problems.We have the Roku 2 for our room TV, this linked right up and downloaded all the channels we already had. Nice to be able to use the supplied remote, my kindle, or my phone as a controller.Now we can stream prime videos from Amazon off of this TV too. Very nice! :-)", "verified": true, "helpfulness": "1/1", "author": "kg"}, {"rating": 5.0, "review": "We couldn't wait for these to arrive and were pleasantly surprised when they arrived two weeks ahead of the forecast delivery.  Install could not be easier, but you will need to be logged on to the ROKU website to complete the registration.  Once we were logged on, the stick was easily integrated into our account, although it did require several \"refresh\" cycles to show the new device. The streaming stick was great for our workout room.  We have a 27\" LCD on the wall and the stick does not require an additional shelf or hanger.  For our area, the remote has great reception.  Moving from one television to another is a simple matter of unplugging from the HDMI port, unplugging the power adapter and plugging in with the new television.  If your television has powered HDMI ports, you may not need the additional power adapter.Unfortunately, this remote does not have the earphone jack that some of the other ROKU models do, something that would be a great feature for a workout area.  Additionally, most televisions do not have sufficient power to their HDMI ports to run the unit without the separate power cord, which results in an additional cord hanging down from our wall mounted television.Overall, light weight, small, portable, and super easy to install.  This is our third ROKU unit and we now have units installed in three separate rooms.  We are thrilled with the service, and have traded out our expensive DISH service for a much more economical alternative that serves our limited viewing habits well.", "verified": true, "helpfulness": "0/0", "author": "E \"two peas in a pod\""}, {"rating": 2.0, "review": "This is not perfected yet.  I was so happy to see this and ordered one promptly.  I already have a Vizio Smart TV but the APPS on it are getting old and dated and Vizio hasn't done much to update them so I thought I'd add another Roku to my arsenal.  Well, definitely heed the warnings that others have said about the remote.  Once mine linked up, it simply didn't work right.  It just took way too long to navigate through anything - so much so that I actually went back to the Vizio APPS for Amazon and Netflix.  I'm hoping that ROKU perfects this because I'd love to replace my other 2 ROKU 1's with the stick.  In the meantime, it's going back to Amazon.", "verified": true, "helpfulness": "2/3", "author": "Michael"}, {"rating": 1.0, "review": "Some of the channels do not work outside US, like Netflix, Amazon and so one. I live in Brazil and the Roku customer support said nothing can be done. They should state it clear on the product specifications and features. My WDTV and Apple TV work perfect, including all channels.", "verified": true, "helpfulness": "1/6", "author": "Leandro"}, {"rating": 5.0, "review": "What do I love most about this?  No cords to deal with, nothing to find a place for on the desk under the television.  It is all just behind the tv,  This handy little streaming stick allowed me to move the Roku box to my son's room and ditch the Chromecast.  Unlike the Chromecast, I can stream from my computer, any of my devices, and of course use the remote that comes with it.  With Chromecast, there was no remote and you were stuck streaming from devices since the Google Chrome extension hardly worked.  Like many other companies, they would rather work on new features than fix features that were broken.  After many complaints I just moved on to the Roku Stick.  I'm not going to look back.  More features inside and if something doesn't work, you report it and they fix it!  If you are wanting to ditch cable, or just don't want to pay more fees to watch tv in a room that isn't cable ready...then I really recommend Roku. (For this to work you still have to have wireless internet.)", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have the Roku 3 and thought that this would be a great option for another tv that did not have a wifi adapter that I could find cheap. I plugged this into the back of my tv in the HDMI slot and was able to link it to my Roku account which immediately uploaded all of my selected channels. This Roku does not need to have a clear line of sight to work, so if it's in the back of your tv it's not a problem. I also bought one for my parents, both of whom hate technology! That said, the both love this because it's easy to use and the remote is very basic.I am hoping that in the near future more apps will be available for download. I know it won't be quite the same as cable in this the early stages of developement, but I'd love to cut the cord one day!I am not a super techy person, so I will try to answer some questions as best I can!", "verified": true, "helpfulness": "0/0", "author": "J.B."}, {"rating": 5.0, "review": "Works great; good price; easy setup; much better than Googles Chromecast stick; which this Roku replaced. Much better selection of programming with Roku.", "verified": true, "helpfulness": "0/0", "author": "Elsa"}, {"rating": 3.0, "review": "This is my first purchase of a roku, or any streaming box type device for that matter, and I am satisfied with it for now because it does it's job and does it well for the most part.The good: I found that setting up the roku was simple enough, for me at least. Although the roku has a lot of filler channels, it has the channels that matter to me. In all honesty, I'm probably just going to stop using cable and just stream anything I want from the roku. The User interface of the roku is easy for me to navigate and I'm sure anyone with moderate knowledge in today's technology, or just good old common sence can figure out how to use the stick. The remote for the roku is alright, but I find myself using the roku remote app on my iPhone most of the time. The stick is low profile. I can plug it in the hdmi port on the back of a tv and hook up the USB port to power it, but it also comes with a power adapter if you don't have a USB port on your tv. The stick is also great for someone who travels around a lot, too! You can hook it up to any tv that has an hdmi port and be able to watch your channels, as long as there's wifi.The bad: User beware, signal strength is extremely important. If you want to use this, be sure to have a strong signal connection for there are no Ethernet ports on this device. It works great while on my tv downstairs, mainly because my wireless router is right next to it, but when moving the steaming stick to a tv up on the second floor I started to have signal problems. The lack of a strong signal caused longer loading of shows and made the user interface a bit laggy. Another issue is the load time for some apps, and it's not due to signal. I mostly see the problem while loading up the YouTube app, but I don't real mind. Lastly, I find there to be a ton of mostly filler content. Really just a lot of channels I don't see my self using.", "verified": true, "helpfulness": "1/3", "author": "magaly noguera"}]