[{"rating": 5.0, "review": "Everything I could have asked for really.  Quite a bit of channels for the kids to enjoy (Disney may say it's free, but they only mean to install, you still have to have a cable bill).  The install was quick and easy, setup flawless, and had it working within 30min (lot of channels to go through).", "verified": true, "helpfulness": "0/0", "author": "Scott Bishop"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Jane Austin \"kam\""}, {"rating": 5.0, "review": "Great product. Love it!", "verified": true, "helpfulness": "0/0", "author": "B L Gardner"}, {"rating": 1.0, "review": "From the moment that I connected to my TV it was a pain to get it to connect to my wifi. I had to move my TV around my living room until it was basically right next to my router to get it to work. Never have I had so much trouble connecting a device to my wifi. When I finally got it to connect, it took forever to open up Netflix, and every other app. It's a waste of money, DO NOT GET!", "verified": true, "helpfulness": "0/1", "author": "Steven Vega Marrero \"Dark Lord\""}, {"rating": 5.0, "review": "Bought this as a gift for my parents. The love it so much they bought a 2nd one for their other TV.", "verified": true, "helpfulness": "0/0", "author": "marianne k ems"}, {"rating": 5.0, "review": "Perfect! Now I can enjoy streaming internet on my TV.", "verified": true, "helpfulness": "0/0", "author": "Patricia C."}, {"rating": 1.0, "review": "Bought two of these a Fry's Electronics because the first one didn't work. Both of them instantly synced the remote and began through the setup process only to require multiple attempts to find our network and then not accept the password multiple times. Eventually both of them did. The first one ran updates and then rebooted, the second one never got that far. Both of the remotes crapped out before I could even complete the setup. First one ran in an eternal loop of green blinking light while TV screen was stuck purple. The second one just shut off and won't turn on with a button reset or new batteries. Having set up over 50 devices (mp3, computers, router, printer, TV, cameras, GPS, phones) this is by far the most frustrated I have been getting a device to even begin functioning EVER. Tried to do online chat or send email to roku.com/support, NOTHING. Very sad, it looks pretty cool", "verified": false, "helpfulness": "0/0", "author": "L. Mills \"big red teacher\""}, {"rating": 5.0, "review": "This ROKU stick is much easier than the ROKU 3 which I also own.  I can easily move this from set to set with minimal effort.", "verified": true, "helpfulness": "0/0", "author": "HudMan"}, {"rating": 5.0, "review": "Works just as well as the larger box version at half the cost and space...", "verified": true, "helpfulness": "0/0", "author": "Colonel Michael Osos PhD"}, {"rating": 5.0, "review": "I am SUPER happy with my purchase, this is the best little gadget I have bought in a long time. I never enjoyed the hassle of watching from my laptop and now I have access to so many channels at the touch of a little remote. I am actually canceling my cable! Love love love it.", "verified": true, "helpfulness": "0/0", "author": "Kim"}]