[{"rating": 5.0, "review": "Wonderful and working well.  I already owned the same model but wanted it on a different television, so this refurbished one fit the bill.", "verified": true, "helpfulness": "0/0", "author": "Wendy R. Polsky \"book shopper\""}, {"rating": 5.0, "review": "Good buy", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well, runs a bit hot though", "verified": true, "helpfulness": "0/0", "author": "pan"}, {"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "renae french"}, {"rating": 5.0, "review": "This was a reluctant purchase because I dislike buying technology that serves a single purpose. I already have a Sony BluRay player but it doesn’t have all the things I want to watch… specifically Korean shows. I was watching them through a laptop connected to my TV but the quality wasn’t great and they buffered & pixilated even though the computer was hard wired to my router. We gave up entirely on Viki because it streamed so poorly and moved on to Drama-Fever which was somewhat of an improvement but not great. Since Drama-Fever streams only Roku we gave it a shot because it was on sale for just under 40-bucks and all I can say is WOW! What a difference in picture quality and having a remote that has some features is a real plus. It was an easy install once I found my router’s password. My only complaint is that I had to provide a credit card or PayPal before I could finish setting up the required Roku account. Watching Drama-Fever is now light years better than with the laptop… picture fills the screen and sub-titles are even larger… plus there’s a 7-second rewind now in case we don’t catch everything that was said. Haven’t done much with it so far but so far it’s great.", "verified": true, "helpfulness": "0/0", "author": "Todd M. \"On The High Desert\""}, {"rating": 5.0, "review": "works great, easy hookup!", "verified": true, "helpfulness": "0/0", "author": "John Maddox"}, {"rating": 3.0, "review": "Bought one before. Now ROKU cheapened the remote control on the latest one I bought. Had to send it back for replacement. It is ok now but is still a worse product than the first one. Why can't people just leave things alone ?", "verified": true, "helpfulness": "0/0", "author": "ranyo"}, {"rating": 5.0, "review": "I love it it's great", "verified": true, "helpfulness": "0/0", "author": "katrina"}, {"rating": 4.0, "review": "Great product for those on a budget! If that's not your case, go for roku 2 or 3 to get more processing speed.", "verified": true, "helpfulness": "0/0", "author": "Ed Ace"}, {"rating": 4.0, "review": "This works great, but the panel that covers the batteries on the back of the remote...well you could blink at it and it would fall off. That gets annoying. Also make sure to unplug the device from time to time to let it cool down.", "verified": true, "helpfulness": "0/0", "author": "T. Greene"}]