[{"rating": 5.0, "review": "Excellent.  Better the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Lousjazz"}, {"rating": 3.0, "review": "If you use your Roku a lot, then this stick is kind of annoying, it has to boot up every time you want to use it. The actual Roku players are just always on. That being said, it does work, but I replaced with an actual Roku player which had better speed.", "verified": true, "helpfulness": "0/0", "author": "Dylan J Thompson"}, {"rating": 5.0, "review": "Bought this for my mother for Christmas. She is somewhat tech savy, but not completely, so I figured I would have to come over and hook it up for her. Unbeknownst to me, she had hooked it up the next day and is currently completely addicted to the video streaming options!", "verified": true, "helpfulness": "0/0", "author": "andrew"}, {"rating": 5.0, "review": "Roku sticks work great faster than I thought it was going to be. Great product", "verified": true, "helpfulness": "0/0", "author": "Mark K Greve"}, {"rating": 1.0, "review": "Had problems with the Roku stick.  First off, the remote would not work correctly, no more than 3 commands and I'd have to take the batteries out and put back in (tried with 2 new sets of Duracells).  When I did get to the point of having the stick update, it never would.  Tried this for a couple of days, exchanged it for the Roku 1 box, which works perfectly.  Unless you HAVE to use a streaming stick, I wouldn't.", "verified": true, "helpfulness": "0/0", "author": "MarcW"}, {"rating": 5.0, "review": "Got this for my girlfriend and she loves it. I myself have a roku 2 xs, and love it as well so thats why I decided to get one for her for her house. There are sooo many channels to choose from so you cant really get bored.", "verified": true, "helpfulness": "0/0", "author": "Steven Santillan"}, {"rating": 2.0, "review": "The Roku streaming stick is a great little device while it is working. The biggest drawback is the 90 day warranty which is rediculous, we have had our stick for exactly one year and it has now gone bad. Do not buy this you may be relpacing it every year.", "verified": true, "helpfulness": "1/1", "author": "stan wentworth"}, {"rating": 5.0, "review": "Like the product. We already had a Roku in the family room needed to add the streaming stick for to our son's TV. We paired this to our roku we have and it is working great. We have watched a lot of movies. Our son can watch his cartoon's and we (husband and I ) can watch movies we like at the same time. GREAT product. please let go of your cable and discover ROKU.Cynthia B.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Booker"}, {"rating": 5.0, "review": "It works as expected. With little effort, it loaded from the WIFI quickly and hooked us up to our Prime account in just a few minutes. We also like the new menu arrangement and offerings from Netflix, we didn't know that stuff even existed. Try it!", "verified": true, "helpfulness": "0/0", "author": "Buel S."}, {"rating": 1.0, "review": "I purchased the Roku Streaming Stick because I also own the original Roku and am happy with it. I wanted another Roku for a different room and was hoping the Streaming Stick was the answer. However, I was very disappointed, it was so unusable and frustrating I just unplugged it and will try it again in a few months hoping they release some firmware updates to make it better.Cons: Remote Control - does not work well and many times I have to click a button for 30 seconds to a minute before it responds. Stability - freezes up frequently and must be rebooted, streaming will freeze up and buffer frequently and works fine from my older Roku and my PS3. Features - I know the screen mirroring is in Beta but it doesn't work well with Windows 8.", "verified": true, "helpfulness": "0/0", "author": "Fodidly"}]