[{"rating": 5.0, "review": "Every bit as good as my Roku 2 and a lot faster processor.  It's amazing how much the technology has evolved since I bought my Roku 2 several years ago.  There's no need for anything more than this.", "verified": true, "helpfulness": "0/0", "author": "docj"}, {"rating": 5.0, "review": "I love my roku saves a tone of money", "verified": true, "helpfulness": "0/0", "author": "youcanto"}, {"rating": 5.0, "review": "Love the product", "verified": true, "helpfulness": "0/0", "author": "Barbara Fratello"}, {"rating": 4.0, "review": "Very good alternative to the 300+ channels we don't use from our cable.", "verified": true, "helpfulness": "0/0", "author": "Shopping Time"}, {"rating": 5.0, "review": "great I  really don't need cable just great!!!!!'", "verified": true, "helpfulness": "0/0", "author": "Hope M."}, {"rating": 3.0, "review": "VERY SLOW TO LOAD AND RESPOND  I HAVE ROKU III AND STICK.  ROKU III MUCH FASTER.  CAN'T DECIDE YET IF STICK OR STICK REMOTE MAY BE DEFECTIVE ITS IS SO NON-RESPONSIVE", "verified": true, "helpfulness": "1/1", "author": "N. Sullivan"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/1", "author": "K. Ahlrich \"ahlrichmom002\""}, {"rating": 5.0, "review": "was kind of hard to set up to connect to the internet and update. had to contact roku customer support and they were very patient and helpful. other than that, i've been using it for about a month now and love it... use it everyday! quality of streaming is really good as well. love that it's a small little hdmi stick and since my tv is wall mounted, it is tucked away and hides. i use the usb port to keep the roku charged at all times.", "verified": true, "helpfulness": "0/1", "author": "monisha"}, {"rating": 1.0, "review": "received my refurbished streaming stick today and was extremely excited to use it as I cut my cable two days ago. After setting the streaming stick up the remote stopped working. Just to clear up any questions the remote worked fine after pairing and setting the device up, but as soon as it was ready to be used the remote appeared to not be paired anymore. I did download the roku app on my phone and could use it that way, but after trying as many things as I could think of and searching forums and the riku site I have decided to return the device. I suppose I will just purchase a new one as I like the size of the stick. However it is very disappointing that this item was refurbished and supposedly checked by the company or whoever does this work for them. I will try the new one, probably gonna just go to a big box store now instead of waiting another 2-3 days, and see if it is any better.", "verified": true, "helpfulness": "2/2", "author": "D.e"}, {"rating": 5.0, "review": "Best investment ever!", "verified": true, "helpfulness": "0/1", "author": "Deanna Hoendervanger \"txcutey\""}]