[{"rating": 1.0, "review": "You have to plug this thing in and the remote won't stop eating batteries.", "verified": true, "helpfulness": "0/1", "author": "tbennyt"}, {"rating": 1.0, "review": "Extremely slow loading content. Have to reload Hulu several times before half of the Hulu content will show.", "verified": false, "helpfulness": "0/1", "author": "Ragu80"}, {"rating": 3.0, "review": "I bought two of these. One worked great, it had the cable hook up to plug into an outlet and power the Roku. The second one . . had no power cable. Evidently, there are two versions of this item, some need an MHL port, some just a USB port . . unfortunately, I plugged in the useable version to my TV and then plugged in the NON USEABLE version (MHL) to the second TV about a month later . . and the seller wouldn't take a return. So I lost about 40 dollars on the second one, since it wont' work at all unless you have an MHL port, something I'd never heard of before. I will probably try to resell it, the seller wouldn't take it back. The useable Roku is great though.", "verified": true, "helpfulness": "0/0", "author": "Angelique"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Edwin fuentes"}, {"rating": 5.0, "review": "Great product, no box to hide, just like having a smart TV", "verified": true, "helpfulness": "1/1", "author": "RRamos"}, {"rating": 4.0, "review": "I like it, although I need to do some homework to see how to use it better.  There are several functions I would like and are probably there but I'm not sure how to do them, i.e., saving my place in a movie or TV show and returning to it later.", "verified": true, "helpfulness": "0/0", "author": "Karen J DeLorenzo"}, {"rating": 5.0, "review": "Replaced this for  chrome cast I previously had. This thing is awesome to say the least. Highly recommend it. So many things to do on Roku.", "verified": true, "helpfulness": "0/0", "author": "Samantha Giampietro"}, {"rating": 5.0, "review": "Previous to this we were using our Playstation 3 to connect to Netflix and HBO Go in our bedroom.  It was such a pain due to connection issues and the unit heating up and freezing with a couple of hours of use.  I wish we had gotten a Roku a long time ago because it has made watching Netflix and HBO so much easier.  I wasn't sure which model to get, but I'm glad I got the one with the remote.  Now we are debating whether to even get a cable/DVR box for the bedroom, because this plus the standard plug in cable is meeting our current TV watching needs.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "Love it!  Bought 2 of them so we can use on different TVs.  Makes streaming on my HDTV easy and turns it into a smart tv, without the cost of actually buying one.", "verified": true, "helpfulness": "0/0", "author": "Darcy Jaime"}, {"rating": 5.0, "review": "Love it!  Super easy to set up and lots of streaming channels", "verified": true, "helpfulness": "0/0", "author": "babs \"bjc\""}]