[{"rating": 1.0, "review": "Have a lot of connection problems. Wish I could return it. Worth spending 20.00 more for better roku", "verified": true, "helpfulness": "1/1", "author": "stacey moison"}, {"rating": 3.0, "review": "Works great. However the batteries that came with it were dead.", "verified": true, "helpfulness": "0/0", "author": "Joseph Rappa"}, {"rating": 5.0, "review": "I started off with a Roku 1st Gen XD years ago (7/6/2011) and they finally sent me an email that it was EOL. I decided that I wanted to get a new one long ago I was just waiting on the nail to be put into the coffin so to speak.I decided I wanted to try out the Streaming Stick because it was nice and small has a ton of apps and it is easy to use. I also have a Chromecast which is nice but I don't want to have to use my computer, phone, android, iDevice or whatever to control it. I bought this actually for the specific reason of replacing a cable box in my office so I don't have to pay TWC for a box I don't use very often. It worked out GREAT.I have read some other reviews that it was a little laggy compared to the Roku 3, which I also bought and will review too, but it is just as responsive as that box.Pros:The number of Channels(Apps) is awesome, to many to count.The number of \"private\" channels is equally impressive and you don't need to do anything special other than a code to get them.Has lots of free and pay channels.WiFi range is actually pretty good. I have it connecting to my wireless downstairs on the other end of the house and there is no problem streaming TWC TV app or Netflix.Unlike my cablebox, all of the TWC TV App channels stream in HD. So where I live the premiums only have one channel in HD the other secondary channels are not. But with the Roku and TWC TV App all of the channels are HD so I am actually getting a better viewing experience. Even better now that they have also added local broadcast channels to the app.Con's:The power cables are always on the end of these devices. I wish they would make them on the side so the cable didn't stick out from the back of my TV. Not a huge deal, but it is distracting to me even though it is coiled nicely.I don't have a problem with the lag on the stick itself but it does seem like remote lags and takes a couple of clicks to wake up.I was actually on the verge of buying the AppleTV and also already have a Chromecast. I am so much happier with this and actually expect to buy another one to replace another cable box in the house.", "verified": true, "helpfulness": "0/0", "author": "ItsNewToYou"}, {"rating": 2.0, "review": "I heard all of the raving about Roku so we purchased this after cutting the cord. The interface is very slow and seems under-powered. Also, certain channels have strange behavior of displaying a message and then buffering. Not a great experience.", "verified": true, "helpfulness": "0/0", "author": "William S. Rees"}, {"rating": 5.0, "review": "This is my second Roku device, but my first stick.  I initially purchased the very first wireless Roku device years ago so that I could watch Netflix in my bedroom.  I had a Blu-ray player that I used for the same purpose in my living room, but that was giving me trouble so I decided it was time for a new device.  I was going to buy a Roku media player, because I was hesitant that such a small device could provide all necessary services.  However, based on reviews and the fact that it was much, much cheaper than the player, I decided to take a chance on a stick.  Next I had to decide between Roku's stick and Amazon's stick.  Since Roku offered HBO Go, I went with it.  It also didn't hurt that besides some issues restarting over the past few years, my first Roku still worked fine. I've been using this streaming stick for about a week and couldn't be happier. I've watched Netflix, HBO Go, Showtime, Amazon Prime, and listened to Pandora with no issues.  It's quick and easy to navigate. Setup was a cinch. The remote has shortcut buttons for Amazon, Netflix, Google Play, and rdio.  I've only used the first two services, but it's a nice feature to have.  My TV has a USB port so technically I should be able to power this stick through my TV, but I have not tried that so I can't speak to that feature.  If so, that's nice since it frees up outlets and wire mess.", "verified": true, "helpfulness": "0/0", "author": "Choo-Choo-Kitty \"choo-choo_kitty\""}, {"rating": 1.0, "review": "Bought two of these for two different TVs, both crapped out a few days after the return window closed. One just doesn't work period (no video goes through regardless of which HDMI port is used), and the other is unable to access the netflix app despite a week's worth of troubleshooting, factory resetting, re-installing, etc.I love Roku products, but their quality is just awful. This makes my death total two Sticks, one Roku 3, and one Roku 1 all within a year of eachother and all less than two years old. C'mon Roku, that's terrible!", "verified": true, "helpfulness": "2/3", "author": "Tyler T"}, {"rating": 5.0, "review": "Great product , works as described", "verified": true, "helpfulness": "0/0", "author": "Santiago"}, {"rating": 1.0, "review": "Device lasted about 10 hours of viewing time.  Now dead.Poor workmanship.  Think about getting Hulu, Amazon Prime, or Netflix and use a Chromecast device.  Roku is junk.", "verified": false, "helpfulness": "1/2", "author": "BrianW"}, {"rating": 5.0, "review": "Bought this before I bought the fire stick. Wish I had bought another one of these instead.", "verified": true, "helpfulness": "0/0", "author": "Danny Hitchcox"}, {"rating": 1.0, "review": "Horrible product, remote stops working twice, even after replacement, now refuses to replace or return.DO NOT BUY", "verified": true, "helpfulness": "0/0", "author": "joseph l pilgrim"}]