[{"rating": 4.0, "review": "It is an amazing product but wastes a lot of internet.", "verified": true, "helpfulness": "0/0", "author": "Hector R."}, {"rating": 5.0, "review": "The Roku is a great product and everything was delivered on time and went well. As far as the canapy 2 year protection plan it said it would deliver to my email that i was emailed and ask to rate the purchase of I have never gotten it..", "verified": true, "helpfulness": "0/0", "author": "Scarlett"}, {"rating": 5.0, "review": "Easy to set up and use it almost everyday.", "verified": true, "helpfulness": "0/0", "author": "Danny R."}, {"rating": 5.0, "review": "Purchased these for work as a giveaway, the winners raved about them no complaints", "verified": true, "helpfulness": "0/0", "author": "justPINKY"}, {"rating": 5.0, "review": "Product was delivered in packaging like new. In great condition. Product worked as expected. Very satisfied with the refurbished purchase.", "verified": true, "helpfulness": "0/0", "author": "superd"}, {"rating": 5.0, "review": "i am so glad they came out with something like this instead of having to carry a box from room to room and it has a great picture and all the same features as the box does.", "verified": true, "helpfulness": "0/0", "author": "Tracie"}, {"rating": 1.0, "review": "It worked fine the first few days. Now it won't play anything. Buy new not refurbished.", "verified": true, "helpfulness": "0/0", "author": "Kelly Alderman"}, {"rating": 4.0, "review": "New(not refurbished)remote doesn't work. This is my 2nd ROKU stick, but 1st from this vendor. Luckily can use the app on my kindle or phone to serve as a remote, otherwise this would be worthless. Seems to be a common problem based on other reviews.", "verified": true, "helpfulness": "0/0", "author": "Lexi"}, {"rating": 3.0, "review": "I had a hard time getting it to connect to wifi. It takes a long time to load some times. It also stops during shows sometimes to reload. I also struggle some times to get the remote to respond.", "verified": true, "helpfulness": "0/0", "author": "Cindi Peeff \"cindi318\""}, {"rating": 2.0, "review": "Unlike the other Roku models, the Stick's remote doesn't always work, long delay and repeated pushing of buttons finally gets a response.  I thought our roku stick had been damaged in the recent move, so I bought a second one.  Same issue.  Terrible remote control performance. The roku service itself is awesome and I recommend it, but get the other models.", "verified": true, "helpfulness": "0/0", "author": "Patrick Von Raven \"von_raven\""}]