[{"rating": 5.0, "review": "I got this stick for another TV after having a box on my first TV for a year. For some reason, this works far better than my box AND I did not know that these were now coming with YOUTUBE as a channel. COOL!", "verified": true, "helpfulness": "0/0", "author": "Kegz"}, {"rating": 1.0, "review": "I have bought 2 Rokus - they have both broke. Buy Amazon's version", "verified": true, "helpfulness": "0/1", "author": "Hojo"}, {"rating": 3.0, "review": "I've had a roku before. I didn't realize this one still needed to be plugged into a power source, and where the HDMI plug in is on the back of my tv, the cord hangs over the edge of the TV just enough to notice it. I'm not sure if it's the internet provider, or the reception on the stick, but my previous roku seemed to have a stronger internet connection.", "verified": false, "helpfulness": "0/1", "author": "Natalie Hays"}, {"rating": 5.0, "review": "works well for the purpose I purchased it for jw broadcasting", "verified": true, "helpfulness": "0/0", "author": "Darrell Moffet"}, {"rating": 5.0, "review": "Works as anticipated.  Bought it for my boyfriend, who loves it.", "verified": true, "helpfulness": "0/0", "author": "Shilo"}, {"rating": 5.0, "review": "This is a great streaming device.  I travel for work, so I use this in the hotels I stay it.  This is a great product for travel.  Very small, and a dedicated remote which is very useful.  I used to have the Google Chromecast, which was a good product, but required the use of a smartphone or tablet to control the device, mine only lasted for about a year before it stopped working.  I have a Roku 3 at home so when my kids come with me the interface at the hotel is the same as the kids are used to at home.  I have netflix and hulu accounts and am able to stream shows just as easily on the road as at home.  Great product.", "verified": true, "helpfulness": "0/0", "author": "Tech&Fitness Customer"}, {"rating": 2.0, "review": "I had a lot of difficulty keeping this device connected to my wireless router.  I exchanged it for a Amazon Fire TV and I'm much happier now.  I'd pass up the Roku for a Fire TV even if it's a little more expensive.  Nothing is more frustrating than constantly seeing a loading bar because of a \"weak\" wireless signal.  The Fire TV didn't have that problem.", "verified": true, "helpfulness": "0/0", "author": "Droogs"}, {"rating": 4.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "david cam"}, {"rating": 4.0, "review": "WE enjoy this.  Make sure your tv has a HDMI port.  You also need to make sure you have a usb port for power.  If you don't you need to plug this into a wall outlet.", "verified": true, "helpfulness": "1/1", "author": "Bill Cranston"}, {"rating": 5.0, "review": "Love Love Love!", "verified": true, "helpfulness": "0/0", "author": "Sandra Rodriguez"}]