[{"rating": 5.0, "review": "Before I purchased my Roku Streaming Stick I was using a Sony BDP-S185 Blu Ray player to stream Netflix. Needless to say, I was constantly getting the \"loading...\" message during movies. It was impossible to watch anything. I assumed it was an issue between Netflix and Verizon FIOs. However, I purchased the Roku Streaming Stick and I'm so glad I did. Load times are very fast and I have no issues streaming any Netflix movies. So it appears the issue was the Sony.The Roku Streaming Stick was very easy to set up and it doesn't take up any space. The stick just plugs right into the HDMI port. The only thing you need to do is enter your WiFi password and Netflix account information. Very simple.", "verified": false, "helpfulness": "1/1", "author": "eRey"}, {"rating": 5.0, "review": "Great item, beats cable for a lot less", "verified": true, "helpfulness": "0/0", "author": "Byron Eriksen"}, {"rating": 5.0, "review": "LOVE the ROKU stick! It still requires a AC cord to plug into the outlet behing the TV but very compact design and works great! Hubby moved the Roku box we previously had to the bedroom", "verified": true, "helpfulness": "0/0", "author": "Texasrn"}, {"rating": 5.0, "review": "I love it so much!!! Three thing that makes my world go round.#1. All Amazon  prodicts#2. Roku #3. Google....just sayin'!", "verified": true, "helpfulness": "0/0", "author": "elizabeth nash"}, {"rating": 5.0, "review": "Absolutely love this thing!  I tried the chromecast first, and it was really really sloooow.  The Roku however is extremely fast, and tons of app options.  Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "AAW"}, {"rating": 4.0, "review": "I got this to replace the bulky PS3 which no longer lives near the bedroom TV. Pretty much all I've used that TV for is Netflix or Amazon Prime, so for that I'm perfectly happy with the little Roku stick. It was effortless to set up, and I'm really pleased with the way it can be powered by using a usb port on the TV, one little out-of-the-way package that doesn't need a thought even if I move the TV. I expect this will be fun for hotel travel too - no more Animal Planet marathons while away on business - WOOOHOOO!A lot of content to explore - though it seems so far that many of the free channels are full of short clips and lots of chopped up content. The Smithsonian channel is a great example, with so many clips and just a few full length pieces, which seem to be the origins of the clips. Also it could be easier to tell what you are getting into for some channels. At first I was afraid to load any channels, because there's nothing to reassure you that you won't be charged for something through your Roku user account. If things were better labeled (ie. free, paid, subscription required, etc.) in the menus, it would be easier to explore with confidence. After a little poking around, it does seem that most things would very clearly alert you before charging anything, but hey, sue me for being a little gunshy. Communication goes a long way.I'm giving just 4 stars because it's a bit slow. It takes almost 2 mins to load the Roku home screen, and the remote sometimes requires multiple presses of a button before it 'takes'. On those occasions when I want to just put something on in the background while doing chores, it is a chore in itself to spend 10 minutes waiting and setting up something to play. If the user experience was a little snappier, I'd give 5 stars without reservation.Lastly, I recommend anyone who uses this to download the remote app for your smartphone which has a soft-keyboard that allows easier text entry than the physical remote for searching & entering usernames/passwords. This is especially great for setting up your paid accounts at the beginning. There is an official Roku app, and a few comparable alternatives which have a much smaller download size, for those who are trying to conserve precious megabytes on their outdated iphone 4's. :)", "verified": true, "helpfulness": "0/0", "author": "Alicia \"vforvintage\""}, {"rating": 1.0, "review": "These are awful. I currently own AppleTV, Chromecast, FireTV.  I was looking for a device similar to Chromecast for kids rooms bet needed a remote.  The have a slow interface and terrible time connecting to the wireless and staying connected.", "verified": false, "helpfulness": "0/0", "author": "Michael"}, {"rating": 1.0, "review": "Roku known issue - does not work with some Sharp (and other) HDTVs.Even though it didn't work on my targeted TV, I wouldn't have bothered to write this review if I was able to return the device.  I bought directly through Roku (mistake #1),  Their tech support said that Sharp has a software update for my specific TV, and contact them.  So, I contacted Sharp who (surprisingly) replied over the weekend, and said that unfortunately they were unaware of any compatibility issue, but no software update is possible.Emailed Roku asking to return based on their 30 day money back guarantee.Emailed againand againand again.Called customer service, got hung up on.Called customer service again - gave up after 40 minutes on holdEmailed againCalled customer service - spend 22 minutes on phone with someone who could not understand slowly spoken english.  Had to keep putting me on hold to discuss with supervisor;  It's a simple return!Tried online chat.  Finally, after 7 chat sessions and 2.5 hours (note, each chat person supports at least 5 simultaneous chats) I think that maybe I'm going to get to ship it back.  They told me that sales tax would not be refunded, because it was already sent to the tax authority.Found a duplicate charge on my credit card from Roku;  Not sure what for, and when I tried to chat again, the reps ignore my questions and tell me the return is still being processed....All in all, the stick may be a great product, but I would never (ever!) purchase anything from Roku again, or even a TV with Roku included, since I never want to have to deal with their terrible customer service again.FInal thought - I'd rather call AT&T; or Comcast than think about Roku again.", "verified": false, "helpfulness": "92/108", "author": "California Mike \"Mike\""}, {"rating": 3.0, "review": "Great device but company requires you give them a credit card or paypal account in order to use it in spite of the fact you may only be interested in using Amazon Prime of Netflix. The account is one thing as you have to load the various media providers but requiring personal finance information which is stored seems a bit fishy to me as this type of information has become a target for expert criminal enterprise throughout the world. Remember Target !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you're on the fence to ditch cable, go for it!  I have the Streaming Stick for one television and another Roku with a USB drive for my other television.  You can sync it up to a smartphone as a remote (works well when you can't find the actual remote).  Absolutely love this!", "verified": true, "helpfulness": "0/0", "author": "LB"}]