[{"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this roku, I think this was the best and smartest decision I made when I purchased this. I truly recommend this roku", "verified": true, "helpfulness": "0/0", "author": "Brandy Moseley"}, {"rating": 5.0, "review": "This device is so easy to setup and use.  For the Windows phone and tablet users Roku has not forgotten us and they have built remote apps for the Windows 8.1 ecosystem.  The only downside and this isn't because of Roku is Comcast...If you are a Comcast customer you will not be able to use HBO Go.  Comcast has chosen to not play with Roku even though they do allow Apple TV and a few other streaming video devices to access HBO Go.  Comcast really needs to play with everyone.  Other than that the Roku device is superior to many others in it's design and set up.  Love this product!", "verified": true, "helpfulness": "0/0", "author": "Kim D. \"Avid Reader\""}, {"rating": 5.0, "review": "Great product fast shipping", "verified": true, "helpfulness": "0/0", "author": "Francis C. Davis"}, {"rating": 2.0, "review": "If you don't live in the US most of the content won't show up. No Netflix, no HBO, no Blockbuster, so you end up with a Youtube machine, and a very expensive one at that at $50, not worth it", "verified": true, "helpfulness": "0/0", "author": "German R."}, {"rating": 5.0, "review": "There are a lot of reviews on this device already that are written by people that certainly exceed my experience with similar devices, so I only want to make a quick comparison to one device. This is not a Chromecast. It seems as though because they share a similar form factor, some consumers are assuming they are basically the same device. To me, at least, my Chromecast has a different purpose which is usually to cast my computer screen or YouTube from my computer. My Roku Stick, however, is for Netflix/Hulu and whatnot. The minimalist approach this device takes is perfect for me; I don't want to play games on my streaming device, nor do I want to look at Facebook. One more thing: I love the remote for this device. It is small, quick, easy to use and does not require line-of-sight. The missing headphone out is its only flaw.", "verified": false, "helpfulness": "1/1", "author": "Jesse Gilmore"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Woman"}, {"rating": 5.0, "review": "I have been very impressed.  It's tiny (the sized of a USB thumb drive)!  Set up was pretty easy.  It needed an immediate software update (which I expected).  That only took a few minutes and was painless.  I connected my roku to my online account and thought the channel set up was pretty easy.  you do need to go thru each different service to set it up.  But since you can use a computer with a web browser and keyboard, it doesn't take very long.  A great feature that roku got right was the ability to add/remove channels.  since roku has 1000s of channels, this is really important.  You only need to see and scroll thru the ones you have (or use).  The only slight issue with the stick is to get sound out to your surround sound, you need to either plug the stick into your stereo or use the audio out on your TV.  You only have to set up the audio once.  The wifi is solid (I'd prefer hardwired ethernet, but that's just me).", "verified": false, "helpfulness": "1/1", "author": "cbstevek"}, {"rating": 4.0, "review": "did all it said it would do", "verified": true, "helpfulness": "0/0", "author": "Michael Meeks"}, {"rating": 5.0, "review": "My husband and I are so glad that we purchased this. We used to use our PS3 for all our streaming media but this has been way more user friendly and reliable.  The number of channels that are free that you can choose from are amazing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]