[{"rating": 5.0, "review": "This might be the greatest invention EVER! Popping it in any TV around the house, binge watching your favorite shows in your jammies is just heaven! The only problems I had was when switching to a different TV, sometimes I had to re-do it because it wouldnt load. Oh, and searching on YouTube is a pain without a keyboard but other than that.....I love this.Get you one!", "verified": true, "helpfulness": "0/0", "author": "Brenda \"I buy too much stuff....\""}, {"rating": 5.0, "review": "Wonderful product! We love it!", "verified": false, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "Junk. Don't waste your money. Streaming is a long painful process. I have very fast wifi connection. Movies buffer and pause until you get frustrated and move on.", "verified": false, "helpfulness": "0/0", "author": "Bangzoom39"}, {"rating": 5.0, "review": "Gift for my hubby who is not tech savvy at all. Easy to install and easy to use. Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Maryann"}, {"rating": 1.0, "review": "First couldn't connect to the wifi, searched online to find a solution and was finally able to connect but continued to receive error codes saying there was a network error and to check the connection.Tried setup process for over 4 hours, searched the Internet and one hour of which was with online customer service with no success.Customer service wanted me to change the DNS of my router, which aparently isn't possible.So much for quick and easy setup. Very disappointing. Returning tomorrow.", "verified": true, "helpfulness": "17/18", "author": "Andrea Nowlan"}, {"rating": 1.0, "review": "I've used a Chromecast for about 6 months now and while happy enough thought about trying the Roku stick for my other TV as most reviews were in favor of the Roku system. I've tried to use the Roku now for almost a week and still can't add Netflix nor any other paid subscription service I have. I travel a lot and like to take these sticks with me so I can see my favorite programs. Turns out the Roku won't allow you to even find most of the popular channels when outside the US, even if you have paid subscriptions! Chromecast is way better in that sense. I can't even mirror the screen in my cellphone as every time I try I get an error message. I take the Chromecast and mirror without problem. I tried the support options and nothing... Seems like returning this Roku is the only option... way to have wasted my time", "verified": true, "helpfulness": "2/3", "author": "Paul \"drpluz\""}, {"rating": 1.0, "review": "I got this with my JVC TV, it is very cheaply made, and software is buggy. first time setup with wifi fails, because the device cannot find my wifi, after a rebooting from the \"secret menu\", it worked.basic functions are OK, but issues are frequent, if you leave the TV unattended it goes to sleep automatically, but when you wake it up, half of time the roku cannot wake and have to be reboot, streaming is a hit or miss experience, in the youtube app, I can pair my computer with roku, which is a great function, but that works only occasionally, every a few days re-pairing is needed.I did n't have chance to experience more of it, because this stick worked for 2 weeks and stopped working, keeps rebooting itself. Customer service of roku is terrible, they do not return emails despite that they promised to reply within 2 business days. the online chat is useless, I wasted one hour with the SM to reset and power cycle the stick for nothing, just to reach the conclusion that it is the TV that' s having issue, and I need to \"upgrade firmware\", come on, the TV is not even a smart TV and there is no firmware to upgrade. I would never try anything from roku agan.", "verified": false, "helpfulness": "0/0", "author": "K. Wang \"kewiu\""}, {"rating": 2.0, "review": "I've bought three of these.  Two consistently didn't work - they would freeze and become unresponsive, needing to be unpluged and rebooted to come back to normal.  I'm sending two back and will try my luck with the Roku 2.  These are too buggy.", "verified": true, "helpfulness": "0/0", "author": "Andrew S. Clark \"Sherman\""}, {"rating": 4.0, "review": "Takes long to load but other than that it is great", "verified": true, "helpfulness": "0/0", "author": "Gregory J. Claus \"chef claus\""}, {"rating": 5.0, "review": "So far so good !! I was concerned that I would have to get the Roku box because my HDMI plug is located on the back of my TV so I was scared the remote wouldn't work. Happy to report everything works great", "verified": true, "helpfulness": "0/0", "author": "Danielle"}]