[{"rating": 2.0, "review": "This stick is not very good , it does not produce anything close to HD picture quality , I have the fastest internet connection possible, and it skips , is very slow and just stops at times .for another $50 I would get the roku 3 , this is not a very good product , I will be returning", "verified": true, "helpfulness": "0/0", "author": "Borimami B."}, {"rating": 5.0, "review": "Great way to watch TV.Wonderful free apps such as Watch ESPN.", "verified": true, "helpfulness": "0/0", "author": "Kimia Menhaji"}, {"rating": 5.0, "review": "LOVE IT!!! Got rid of cable and I don't miss it all!!! The clarity is awesome and no buffing.  WOW!!! Plan to grab another soon.", "verified": false, "helpfulness": "0/0", "author": "LaShawn Leitzsey"}, {"rating": 4.0, "review": "Works great, Plex worked the first time I tried it.  Heavy usage seems to kill my new Asus wifi router.", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "This Roku is really great.  Easily fits on the back of your TV without taking up any real estate at all. It works very smoothly and captures the WiFi signal from upstairs perfectly.  The remote control makes everything work easily and is a much better concept than the Google Chomecast solution.  I have the Google Chromecast which at first glance seems cool because it works with your Iphone or Ipad or Android.  But you quickly learn that is more of a hindrance than a blessing, because mobile devices turn off to save battery.  So a standard remote control like the one that comes with this Roku is a much better solution.On the Chromecast, half the time, there is a hicup in getting it to work correctly.  You are left to close apps, open apps, unplug the Chromecast, plug it back in and hope it finally connects.  But with the Roku, it has worked perfectly every time...never a hicup...never a frustrating moment.Plus the Roku has way more Channels than the competition.  So you get Amazon and Netflix, and HBO and PBS and a zillion other channels.  In comparison, Chromecast has very few channels.We hooked up our Roku on the back of the kitchen television set.  So space was a premium.  This Roku fit the bill.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Gadget Man \"Gadget Man\""}, {"rating": 5.0, "review": "I have had no problems with this device. It works great! I bought it as a gift for a friend and she loves it. The price is great and it works better that my smart TV. I would never pay more for a smart TV because of the roku 3500R. It is very easy to set up and streams quickly on my 30mbps wifi connection.", "verified": false, "helpfulness": "0/0", "author": "Anthony Sordini"}, {"rating": 5.0, "review": "One day my smart TV stopped streaming Netflix and Prime and the internet company couldnt figure it out.  A friend suggested Roku.  It's awesome! so incredibly easy to instal and to use.  Very user friendly and is actually easier to use than my SmartHub!", "verified": true, "helpfulness": "0/0", "author": "Miranda Kelly"}, {"rating": 5.0, "review": "So far I have pretty much used this for MLB Tv, but I like the portability of the item as this is very easy to bring to TVS in different homes.  Unlike the slow smart TV i have, the menu moves pretty fast and general navigation is solid.  For $50, if use this for a few of their apps you cant go wrong. the selling point for me on this over others was the remote control that comes with it- i think its stupid to have to use your iphone/ipad as a remote to drain the battery. this is ideal", "verified": true, "helpfulness": "0/0", "author": "Dave S"}, {"rating": 5.0, "review": "love this thing , money well spent", "verified": true, "helpfulness": "0/0", "author": "Gary Resmondo Jr"}, {"rating": 4.0, "review": "Takes up very little space, ez to assemble, plugs right into the hdmi and easily powered by the tv USB port a real space saver and easy on the eyes no cords dangling out of place", "verified": true, "helpfulness": "0/0", "author": "Andrew Arthurton"}]