[{"rating": 5.0, "review": "Best tv investment so I ditched my cable bill!", "verified": true, "helpfulness": "0/0", "author": "Tiffany Hooks"}, {"rating": 1.0, "review": "(NOTE: see update at end)I originally purchased this to use in my hotel room while working away from home for a month. Apparently, to use a the Internet at most hotels, you must first login through a splash screen (e.g. when using your computer or iPad). That cannot be done when using the stick. There is no way to click on the 'Connect' button. I believe there are other ways to get around that, but I didn't feel like putting further effort or money into it. I should still find it useful as it will be connected to my tv/wifi at home. This unit accepts a password but for some reason just cannot communicate with hotel's no-password-needed wifi. That may not be the case if you try one of the other Ruku hard-wired devices but that is beyond my experience. I'll give it four stars but may change that once I see how it works at home.UPDATE:  I tried to connect this device directly to two different late-model TVs.  In BOTH cases,the included AC power was connected directly to wall, the unit powers up, appears to connect to wifi after I provided password and it showed \"excellent\" strength, but then after multiple attempts, freezes up when trying to load a show.  This being said, my PS3 pulls it in and plays the same shows on the same wifi with no hesitation.  I was out of state when I originally purchased the stick so had to wait til I was home to troubleshoot.  After determining that the device appeared to be faulty, I went to return it through Amazon site.  I find that now, my \"window\" to return has expired.  This is the 1st Amazon Prime purchase that I have been extremely disappointed in.  Right now, I have a new \"refurbished\" $39.99 paperweight...NOT HAPPY.  :(", "verified": true, "helpfulness": "1/1", "author": "C Marwood"}, {"rating": 5.0, "review": "it is absolutely a wonderful device. I would recommend it to anyone. Easy to install and setup.", "verified": true, "helpfulness": "1/1", "author": "denise"}, {"rating": 3.0, "review": "Only supports a few codes, totally bummed that I didnt notice this before purchase.", "verified": true, "helpfulness": "1/1", "author": "MR ADAM M MANGAN"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "1/1", "author": "Willie Sam"}, {"rating": 3.0, "review": "I've been using a Roku for years now and decided to try the stick out. Unless you keep it plugged into an outlet (rather than relying on power from the USB port on the TV) it takes a substantial amount of time to power on. It also tends to be sluggish and doesn't always respond right away to the remote. It's not a bad device and works well most of the time. I would just recommend buying the actual Roku box for a smoother user experience.", "verified": true, "helpfulness": "2/2", "author": "Taylor"}, {"rating": 4.0, "review": "I started off with the Roku 3 which we love but now that we have a TV mounted to the wall we decided to move it to the bedroom TV and get the streaming stick for the living room. It's a great design, I love that it just plugs straight into the HDMI out. My biggest beef with it is that it is much, much slower than the Roku 3. If it were quicker to respond, I would've given it all 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as good as new. Like many reviewers, the USB port in my TV didn't provide enough current to support the Roku so I had to power it off my Xbox 360 (or the included AC adaptor). If yours acts funny, change power sources!", "verified": true, "helpfulness": "0/0", "author": "Not Your Grease Monkey Down the Street"}, {"rating": 2.0, "review": "This is a very quirky and slow device.  It takes quite a while to boot up, and I have to cycle power on it once every couple weeks because it starts wigging out and flashing/popping (on screen).", "verified": true, "helpfulness": "0/0", "author": "Brad M."}, {"rating": 3.0, "review": "programs go in and out.", "verified": false, "helpfulness": "0/0", "author": "Ganny"}]