[{"rating": 2.0, "review": "It would be a great product BUT the remote is the weakest and most failure prone part and you cannot configure the device without it or configure it if you reset the roku.  We've had to reset all of our rokus a few times. I now have 3 of these rokus and ALL the remotes are by far the most unreliable remotes in 30 years of using 100s of remotes.  Button presses are very inconsistent.  Sometimes it decides that you are holding the arrow key down causing all kinds of issues.  The select key works less than 50% of the time and requires a repress.  Batteries get used up quickly even if the remote is hardly used.  (A smart phone roku app has saved us a few times as it was needed to stop automatic playback of each episode of a series.)  One day they will get an effective fast forward and rewind (30 second skip etc.) but for now, each channel does it's own thing and it's a crap shoot if you even get close to where you want to be; and slow slow slow slow.  We've had 3 devices all streaming HD at the same time without problems but then the broadband speed tests at 60 Mbps all the time.  Also have a chromcast to compare it too - which has no remote - but sometimes seems to give a much more convenient experience but with chromcast loading all the apps associated with each channel is a privacy nightmare as they all want access to all private info you have on your phone, as much as they can get.  Hence, we use the Rokus for now.  If you have to reset the roku, you need to re-setup every single account you have - Netflix, Hulu, HBO Go, whatever.", "verified": true, "helpfulness": "0/0", "author": "Charles Heath"}, {"rating": 4.0, "review": "Could 've given it a four star but had issues with the remote control,  don't respond sometimes.", "verified": true, "helpfulness": "0/0", "author": "tj"}, {"rating": 5.0, "review": "I purchased this along with the Roku 3.  I'm weaning myself off of cable which costs me a whopping $167/month, just for basic!  I'm using the stick in the bedroom and the Roku 3 in the living room.  I set up the stick and it took all of 5 min to setup, it probably wouldn't have taken that long, but I had to power down and power back up to get the remote to sync up.  I am extremely happy with this.  The speed is amazing and the choices of what to watch are endless.  I was like a kid in the candy shop, I didn't know where to begin.  I've purchased a CBS All Access, Netflix, Hulu Plus, and Amazon Prime accounts.  With all of that, plus the amortized cost of the Roku and my internet connection, I am saving $60 a month!  Not bad.  I would recommend this to anyone who is sick of watching their cable bill costs climb up and up and up for a large majority of stations I don't even watch!", "verified": true, "helpfulness": "0/0", "author": "Javagirl"}, {"rating": 5.0, "review": "Works just as advertised.", "verified": true, "helpfulness": "0/0", "author": "William E."}, {"rating": 1.0, "review": "First, the instructions for set up do not tell you that you have to go online and set up an account with Roku before you can complete your installation, and second and most importantly, once it was installed, when on the Amazon screen, it kept freezing up so I could not even search the movies. I never got it to do otherwise and the return instructions and conditions are so restrictive it is ridiculous.  It is a total waste of money and now I am searching for another streaming device that works well with Amazon Prime or I will need to cancel my Amazon Prime subscription.", "verified": true, "helpfulness": "1/3", "author": "vanferrian"}, {"rating": 5.0, "review": "This was part of a gift to my elderly father. It was delivered quickly and he found it simple to set up for use. He is very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 5.0, "review": "The remote didn't work, but I sent it back and got a full refund. Very easy and quick. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Romney Simpson"}, {"rating": 1.0, "review": "I had trouble with searching as it kept spinning.  Many calls to their call and getting the run around as it didn't help so searched to see if others had the same problems and found people had the same problem with their call center so I am returning it.", "verified": true, "helpfulness": "1/2", "author": "dumbcruiser"}, {"rating": 4.0, "review": "This streaming stick is better than the google chrome cast, it has a wider selection of games and channels to choose from and it's a great price, if you want to turn your tv into a smart tv it's worth it being able to access many apps.", "verified": false, "helpfulness": "0/0", "author": "Benjamin"}, {"rating": 3.0, "review": "Works nice but remote stops working randomly and has the need for one to take out batteries and put them back in.", "verified": true, "helpfulness": "1/1", "author": "Roderick Lowe \"Rod\""}]