[{"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Donna Swartzendruber"}, {"rating": 5.0, "review": "Bought three it worked so well.", "verified": true, "helpfulness": "0/0", "author": "Craig L Johnson"}, {"rating": 5.0, "review": "Works really well! For someone who casually watches TV, there is no discernible difference between this and a roku box. It is an amazing cost effective item.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got the Roku 3500R Streaming stick about 4 months ago for my office and it's been working great. It's fast, and the available contents to choose from is incredible. Totally worth the price, and I would most definitely recommend to anyone looking for a streaming stick.", "verified": true, "helpfulness": "0/0", "author": "RC111"}, {"rating": 4.0, "review": "The only problem that I have observed is that the remote keeps loosing connection with the streaming stick. I installed an app on my phone to overcome that problem. If it wasn't for that problem I would have given 5 stars", "verified": true, "helpfulness": "0/0", "author": "Clarence Mills"}, {"rating": 3.0, "review": "Roku is awesome.. The remote is garbage. I downloaded the remote app on my phone, works much better", "verified": true, "helpfulness": "0/0", "author": "Melanie"}, {"rating": 4.0, "review": "My only complaint is that there seems to be some lag between pressing the remote control buttons, and the action taking place. This leads to me occasionally pressing the wrong option on a Menu, etc.", "verified": true, "helpfulness": "0/0", "author": "JOAQUIN M LAGO GONZALEZ"}, {"rating": 5.0, "review": "this is a great entertainment device. Using mobile apps you can actually cast videos/pictures on your TV", "verified": true, "helpfulness": "0/0", "author": "Vishal Mandvekar"}, {"rating": 2.0, "review": "This device freeze alot. Not happy with it. Always have to unplug it to reset and start it up.", "verified": true, "helpfulness": "0/0", "author": "Elena Lewis-Suber"}, {"rating": 1.0, "review": "Could not get this Roku to work on my tv. Contacted support and still could not get it to work. Sending it back. Spent too much time trying to get this item to work.", "verified": true, "helpfulness": "0/0", "author": "K. Wanner"}]