[{"rating": 5.0, "review": "works great with high speed Wifi, I have now cut the cable TV cord, saving bundles of money.", "verified": true, "helpfulness": "0/0", "author": "Wayne Floyd"}, {"rating": 1.0, "review": "I live in Argentina and I work in Brazil. Roku don't works on Brazil nor Argentina. I am a Netflix user. I use it on Apple TV, on iPad and on PC. Roku says that I can't use it. I bought Roku to use it in my frequents trips to other country because of its good reviews. I make a mistake buying Roku. Only works the free channels.", "verified": true, "helpfulness": "0/0", "author": "mafarias"}, {"rating": 5.0, "review": "Easy and works as expected", "verified": true, "helpfulness": "0/0", "author": "LJK \"LJK\""}, {"rating": 1.0, "review": "BewareI get this to use Netflix and SpotifyBut becouse a want to use it out side the US, it doesn't support does channels.I already have Netflix and Spotify, that I use with other device, I don't know why Roku Block them out the US", "verified": true, "helpfulness": "0/0", "author": "Edwing Roberto Sagastume \"shumes\""}, {"rating": 1.0, "review": "Very disappointed with this.  I may have received a bad unit.  I have had both the HD and the Lite versions of the box for about 3 years, and absolutely love them.  I really liked the idea of the stick for a wall mounted tv  From the start up, this unit had problems.  I've tried it in all the HDMI ports on the tv and it's still  not functioning right.  The unit goes to an unresponsive state quickly and often...like in the middle of searching for a show.  The remote works sporadically.  Maybe 3-5 clicks and then it bonks out.  Either that or the lag is really long.  I've tried using my iphone as a remote with this unit and that is better, but not great.  Overall, disappointed.  When the unit works, it's ok...when it doesn't it's SO frustrating.  I'll be sending it back.", "verified": true, "helpfulness": "0/0", "author": "BTS34 \"BTS34\""}, {"rating": 1.0, "review": "Its broke spilled water on remote", "verified": true, "helpfulness": "0/3", "author": "Trina Butler"}, {"rating": 4.0, "review": "Much more convenient to use than the Roku 3 if (like me) the area around your TV is already something of a digital debris field.It's a bit sleepier than the Roku 3 (thanks to the Stick's its slower processor), but streaming itself works fine. Set up is easy and I love that adding new channels via my computer pushes the additions to all my linked Roku devices (you can make this happen immediately by running a \"System Update\" on each devices; otherwise the new apps generally arrive within 12 hours).Customizing the app interface--moving things I use to the top and things I use less frequently to the bottom--is also super-easy.I have a couple of Rokus, Apple TVs, Chromecasts and a Fire TV dongle. Roku kicks all the other devices butts--so much more flexible and much greater selection.", "verified": true, "helpfulness": "0/0", "author": "Mr. John Egan \"andragogue\""}, {"rating": 5.0, "review": "LOVE the Roku! use daily!!!", "verified": true, "helpfulness": "0/0", "author": "Shannon Howell"}, {"rating": 5.0, "review": "This is just wonderful. Setup was a breeze, my 11 year old son did most of the setup ( except for the credit card and pin ). Then we fought about who was going to watch what and compromised on Ted Talks. I'm very happy with  my purchase.", "verified": true, "helpfulness": "0/0", "author": "Adrienne Boswell \"arbpen\""}, {"rating": 5.0, "review": "Too Small I keep losing it", "verified": true, "helpfulness": "0/0", "author": "Mark D Bergquist"}]