[{"rating": 3.0, "review": "It didn't work for my intended use.  I wanted to use this device in my master bedroom with a wall mounted TV, but after an hour of trouble shooting determined that the antenna didn't have the strength to access my wi-fi over that distance.  I moved my old Roku 2 to my bedroom, which didn't have any signal strength problems, and this one to the family room, where it works fine, but not how I wanted to set it up.", "verified": true, "helpfulness": "2/2", "author": "Cori"}, {"rating": 5.0, "review": "THIS IS THE BEST INVENTION EVER!", "verified": true, "helpfulness": "0/0", "author": "Dennis Saffer"}, {"rating": 5.0, "review": "I am enjoying the Netflix and Amazon Prime Instant Videos", "verified": true, "helpfulness": "0/0", "author": "Elaine Moody"}, {"rating": 5.0, "review": "I bought the Roku over another streaming stick because at the time, it was the only stick that had Netflix, Amazon Prime TV, and HBO Go. Not sure if any of the others have caught up, but I am very happy with my Roku! It does everything I needed and more, and it much faster than a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Acouple4MO"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Keri Heskett"}, {"rating": 2.0, "review": "Wouldn't connect to my local network, and no easy solutions to resolve the problem.  Not nearly as seamless as my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Erik"}, {"rating": 5.0, "review": "Item as described, good shipping time frame.", "verified": true, "helpfulness": "0/0", "author": "Michael Kelley"}, {"rating": 5.0, "review": "Awesome!!!!!!!! It works too.", "verified": true, "helpfulness": "0/0", "author": "C. Martin"}, {"rating": 3.0, "review": "Cannot get it to connect to TV but still trying", "verified": true, "helpfulness": "0/0", "author": "amy russell"}, {"rating": 5.0, "review": "Product works exactly as expected. Actually looks like new. No sign of any previous use.", "verified": true, "helpfulness": "0/0", "author": "Nancy J"}]