[{"rating": 5.0, "review": "I love this little device", "verified": true, "helpfulness": "0/0", "author": "Sue-Alton Kearn"}, {"rating": 1.0, "review": "cant do no stars, too bad.  Piece of crap & I returned it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Disappointing when compared to Roku3. The Roku stick is unacceptably slow. Once it becomes unresponsive, the only option is to shut it down and watch the Roku logo jump on the screen while is powers up. It is very slow from power on be able to watch anything.  When it freezes, the iOS app also becomes useless just like its remote. The remote, itself doesn't work all the time, it's erratic.I got this because Chromecast just stopped connecting to my network. The difference in speed in these two devices unbelievable. Will be returning this.", "verified": true, "helpfulness": "2/2", "author": "Salil Bhatnagar"}, {"rating": 4.0, "review": "Television is one of my favorite pastimes. So, anything that can enhance my viewing capabilities is great in my book. Roku’s Streaming Stick does exactly that. It’s no secret that I am an Apple fan. That being said, Roku really knocked this one out of the park. It’s great for every room of the house, but I found it most useful on trips because of its portability and ease of setup.From the moment of unboxing I was shocked at just how incredibly small the Streaming Stick really is. It’s not much bigger than a standard jump drive. There really isn’t much to it at first glance. Installing is ridiculously easy. In fact, the hardest part was going thru the usual tangle of wires and cables behind the TV. The one downside I found is that it’s externally powered by a USB cord. You can plug the USB directly into your TV’s USB port or with the included power brick (I found that the brick is then best method due to start up time).Roku’s Streaming Stick has just about every streaming app that you can imagine along with a few new ones that I discovered from just browsing the Channel Store. The remote that comes with the Streaming Stick makes navigating pretty simple with out a bunch of unnecessary extras. I found that I use the free iOS/Android remote app most often, especially the keyboard function when logging into multiple accounts. After only a little while of use you can really see that the Streaming Stick really looked at all of the streaming devices on the market and got rid of all of the bloat so that we can get back to enjoying our favorite shows, movies, and music.\"This product was received at a free or discounted price in exchange for my review. I am a technology journalist and pride myself on providing fair and honest reviews. Please feel free to ask any questions you might have.\"", "verified": false, "helpfulness": "7/8", "author": "Nicholas Calderone \"Senior Editor, Co-Founder of MacSources\""}, {"rating": 2.0, "review": "Don't work outside US but no information before buy it.", "verified": true, "helpfulness": "0/1", "author": "Marcelo Rubim"}, {"rating": 5.0, "review": "This is excellent.", "verified": true, "helpfulness": "0/0", "author": "Tara"}, {"rating": 4.0, "review": "I got one for my  birthday a few months ago to replace an the original roku box in my family room,and loved the changes in the newer ones. I bought this one to replace another older one I used in my bedroom.", "verified": true, "helpfulness": "0/0", "author": "NELL OF RIVERDALE"}, {"rating": 5.0, "review": "We love using this.", "verified": true, "helpfulness": "0/0", "author": "reader"}, {"rating": 5.0, "review": "Awesome Product.  Really enjoying our Roku stick.  Excellent quality and value.", "verified": true, "helpfulness": "0/0", "author": "Autumnb \"Steveb\""}, {"rating": 5.0, "review": "Amazing. Bought one for myself and my dad!", "verified": true, "helpfulness": "0/0", "author": "Yvonne"}]