[{"rating": 5.0, "review": "My kids love this thing. I love it too. This is a great option for those who don't necessarily want cable. The only downside is having to purchase subscriptions to a lot of the apps. But there are free ones.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow!  Talk about easy.  Connected quickly and easily to my existing Amazon Prime and Netflix accounts and has fewer problems streaming content than I had when I was trying to stream through my laptop - which was a major hassle with a lot of time wasted waiting for the buffer to catch up.", "verified": true, "helpfulness": "0/0", "author": "A A Stone"}, {"rating": 4.0, "review": "Seems to need the occasional restart when it stops responding to the remote (unplug it, the plug it in again), but otherwise works fine.", "verified": true, "helpfulness": "0/0", "author": "Timothy Wayne Newton"}, {"rating": 4.0, "review": "It is a compact unit.  It plugs into an HDMI port but has to be powered through a USB port.  The unit comes with a wall adapter so you can have continuous power.  I tried using the TV USB port but it does not have power when the TV is turned off.  That requires the Streaming Stick to reconnect each time you start the TV.  The unit arrived in a very timely manner and I am very satisfied with the seller.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "I purchased the 3500R for my grandparents so they could get in on some of the Roku channels we enjoy.Pros :Easy setup (after the firmware upgrade, see Cons)Minimal footprint, easily hidden behind the TVExcellent price for the entertainment you will enjoy!Remote works well, no issues since it uses wifi direct to control.Dual band wireless!Cons :Compared to my Roku 3 you can feel the slower CPU, launching channels are slower (Netflix, etc)Setup was miserable until the firmware update, but that happens early in the process (had some issues with connecting to wireless).Remote has pre-defined buttons for some channels, I do not like this as sometimes they are pressed and jump to the channel when we don't want it to happen.Overall this is a great value for the money!", "verified": true, "helpfulness": "0/0", "author": "Jarred Sutherland"}, {"rating": 2.0, "review": "Item works but found will not work on certain TV's even if they have a HDMI, had a lot of trouble setting up only to find out it was the tv. . Careful when purchasing!", "verified": true, "helpfulness": "0/0", "author": "John Pothier"}, {"rating": 5.0, "review": "Great addition to your entertainment , especially in a room without cable box.", "verified": true, "helpfulness": "0/0", "author": "alberto"}, {"rating": 1.0, "review": "I have a Roku 3 and assumed this would have the same Roku quality. It doesn't.I plugged everything in and turned on the TV and started going through the setup. Once I got to the screen to enter my wireless password, I found out that the right arrow key on the remote didn't work! Well, sometimes it did but mostly it didn't. Pressing right sent it down most of the time but every so often it would actually go to the right. I spent over 10 minutes trying to enter my password.I knew I would be sending it back but I felt challenged by this stupid remote and was bound and determined to get my password completed! However, my effort was not rewarded because I was unable to connect to my router as well.I really like my Roku 3 but this stick was a disappointment.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Johnson"}, {"rating": 5.0, "review": "Works great on my TV -lots of stations easy to use-only problem is I registered it on the tv and when I try to log in with my kindle it will not allow me to do so, wonder if this is because I ordered it from Amazon-but still product deserves 5 stars", "verified": true, "helpfulness": "0/0", "author": "Alberta Kliem"}, {"rating": 5.0, "review": "The Roku Streaming Stick is the best,  the best I tells ya.", "verified": false, "helpfulness": "0/0", "author": "THOMAS MCCAULEY"}]