[{"rating": 5.0, "review": "Love it.  Have had the Roku lite for awhile, but this is smaller and with more user names.  Picks up the WiFi better than the smart TV reception, so not as likely to get kicked out of the show when the WiFi hicups, and reconnects more quickly when it does.", "verified": true, "helpfulness": "0/0", "author": "Honeybucket \"Island in the sun\""}, {"rating": 5.0, "review": "For a one time expenditure I've found plenty of things to watch and still am not saddled with an excessive cable bill.", "verified": true, "helpfulness": "0/0", "author": "James A. Holmes"}, {"rating": 5.0, "review": "Definitively a great product, and a great seller. A+++++", "verified": true, "helpfulness": "0/0", "author": "M. Garza Jr. \"M. Garza jr\""}, {"rating": 5.0, "review": "I am very happy with this purchase thus far. Roku customer service has been awesome. Love the wide  channel pool available.", "verified": true, "helpfulness": "0/0", "author": "Jahpickney"}, {"rating": 5.0, "review": "This thing is great. I don't watch much TV but when we do....this is great to have.", "verified": true, "helpfulness": "0/0", "author": "Hugh"}, {"rating": 5.0, "review": "Works great. The remote is useless. Just use your smartphone to operate and your life will be much easier.", "verified": true, "helpfulness": "0/0", "author": "Kaori S. Iverson \"kaoriivy1\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Mike Wallan"}, {"rating": 5.0, "review": "works really good so far I am a satisfied customer thanks I needed this", "verified": true, "helpfulness": "0/0", "author": "hezekiah campbell"}, {"rating": 5.0, "review": "This works great and adds so many more options of things to watch for those of us who refuse to pay the crazy cable prices!", "verified": true, "helpfulness": "1/1", "author": "TaleeTx"}, {"rating": 1.0, "review": "Returning since the remote control didn't work. When I added the channels realized most of them are $$ not free. The free channels are for old shows that I can't remember,  same with movies and I'm not saying classics.  Granted few channels were good but very few.  Is a closed system not an open system which makes a big difference.", "verified": true, "helpfulness": "0/0", "author": "AdiAri"}]