[{"rating": 5.0, "review": "I previously purchased chromecast and wasn't very impressed with it. In fact I gave it to one of my Daughters. I received this and connected it, programmed my channels and began watching. I love it. I really really love it. I would still however like to get the new fire tv stick but didn't want to wait so long. Still may get it later, but , highly recommend this to others.", "verified": true, "helpfulness": "0/0", "author": "Penny"}, {"rating": 5.0, "review": "Easy to install, no box sitting on stand.", "verified": true, "helpfulness": "0/0", "author": "D. McPhee"}, {"rating": 5.0, "review": "Great media player..", "verified": true, "helpfulness": "0/0", "author": "Ja.R"}, {"rating": 5.0, "review": "Everything I expected. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "A. Covington"}, {"rating": 5.0, "review": "It is slow to start up and Netflix is slow to start but using the streaming stick beats plugging in the computer via an HDMI connection where you have to fiddle with the sound and screen resolution.  This just works.  I ended up buying a second one.  Roku now has a beta version of the stick's software that allows you to put on your TV what you see on your Android device, in my case one Android device froze after a minute and the other one was not registering at all but this new feature will make the streaming stick even more valuable once they get the bugs out.", "verified": true, "helpfulness": "0/0", "author": "Donald R. Tveter"}, {"rating": 2.0, "review": "With all positive reviews I am shocked why I could not get my Roku to work. I spent upwards of 3 hours working with a Roku Technical person and my own internet provider. It was just not worth spending more time to configure this by having my internet provider change so many settings. They already made DNS and wireless id changes and it still did not work. so sorry, but I would not recommend this to anyone.", "verified": true, "helpfulness": "2/3", "author": "Happy Guy"}, {"rating": 5.0, "review": "Hands down THE BEST investment you can make. Downgraded my cable after getting my Roku.", "verified": true, "helpfulness": "0/0", "author": "Brigida S Bernardo"}, {"rating": 5.0, "review": "I ordered this for our bedroom TV because I didn't want the box taking up space on my dresser. It was super easy to install, just plugged it in and followed the on screen instructions to connect to my existing account. One thing I wish the Roku remotes had was a button to light them up, hard to see in the dark. And with the stick version the remote is not the same as the box version so it's hard to remember where the buttons are located. Overall I am very satisfied though.", "verified": true, "helpfulness": "1/1", "author": "Stacy Tilton"}, {"rating": 5.0, "review": "It is exactly as expected.", "verified": true, "helpfulness": "0/0", "author": "Georgette Fridman"}, {"rating": 5.0, "review": "This is the best device ever invented. I couldn't get my Samsung TV to work with Amazon Prime Instant Video. Hooked up my Roku and viola' streaming not only my Amazon but all my other accounts. It's so much quicker and easier to use than the TV's built in access.", "verified": true, "helpfulness": "0/0", "author": "Alyse C Biondi"}]