[{"rating": 5.0, "review": "Works great. Has media player channel which streams from my dnla server which was a pleasant surprise.  Doesn't support many types of video files like my wd live but at least I didn't need to use a plex server.", "verified": true, "helpfulness": "0/0", "author": "Andrew Dunn"}, {"rating": 4.0, "review": "Works well most of the time. Occasionally shows will buffer frequently.  Not sure if the issue is the Roku or internet bandwidth but I have very high speed U-Verse internet and the TV is right next to the router.", "verified": true, "helpfulness": "0/0", "author": "Bagladiator"}, {"rating": 5.0, "review": "So I purchased the Roku stick on Tuesday and hooked it up by myself and I am a severely techno challenged senior woman! It was quite simply easier than turning on my food processor! So far I love all it offers but will admit to having withdrawersls from not seeing some of my favorite shows for weeks now ever since cable priced itself out of my reach and I had to disconnect it after 35 years! Is there any way I can get the Hallmark channel on the Roku stick and get to watch my old favorites like NCIS and Criminal Minds? If anyone knows could you explain it to me in simple terms please......as I said I am a techno challenged se ior here! Thanks! Love my Roku!", "verified": false, "helpfulness": "0/0", "author": "Mattie \"Mattie\""}, {"rating": 4.0, "review": "I ordered the Roku Streaming Stick as a birthday gift for myself. At the time of arrival My husband and I had a 37\" Panasonic flat screen tv in the living room an all was working great. A few weeks went by and we then purchased a 50\" Emerson flat screen for the living room and put the Panasonic in the bedroom. Things did not go well between the Roku stick and the Emerson tv. For a few weeks I tried the using the Roku on the new tv and the Roku would not load properly and stay streaming. I contacted the Roku website via live chat and they wanted me to call my internet provider to change the DNS of the router. Not realizing my tv was the problem I upgraded my internet but of course to no avail. The loading was faster but still when I tried to watch a show, it took an hour to watch the same first 2 minutes 3 times. Contacted Roku site again, they wanted the internet channel changed. Called my internet provider where the person helping me had found in the Roku forums other complaints about other Emerson tv's and the Rokus not working together. The internet channel was changed and the Roku stick was unable to connect at all. I gave up on trying to get this thing working on the Emerson tv, took it into my bedroom where I reconnected it to my Panasonic and it worked perfectly right away without having to do any more than plug it in. I am now at a loss for my livingroom tv because that is where I watch it late at night while my husband sleeps.", "verified": true, "helpfulness": "0/1", "author": "Karin Harmon"}, {"rating": 5.0, "review": "I love it! great stick! the remote is a plus smooth and high quality the signal strength is amazing. I love the feautures and all the apps available on it this is much better than the Google chromecast.", "verified": false, "helpfulness": "0/0", "author": "YimYorm"}, {"rating": 5.0, "review": "Love this little device.  Fast delivery.  I would recommend this product just as great as the Apple TV, but cheaper!", "verified": true, "helpfulness": "0/0", "author": "Lizz"}, {"rating": 5.0, "review": "I haven't had cable/satellite for 20 years, never could afford it.  Several friends had acquired the Roku and raved about it.  So, I broke downand bought the streaming stick.  Love It!  I am enjoying it so much.  Lots to see.  Bought one for my sis 'cause she loved mine.Instead of paying the high price for cable or satellite I'm paying $16 a month for Netflix and Amazon, plus all the free channels.  Yippee!", "verified": true, "helpfulness": "0/0", "author": "JRR"}, {"rating": 3.0, "review": "I like it, but the only issue that I have is that the remote does not always work. I sit there and click and click and click it and nothing happens. Usually when this happens, it will start to work again after a few minutes, but one time it would not work for about 2 days, so I called customer service. They reset something, but they told me that the next time I called they would have to charge me because my warranty had expired. (I just bought in back in February) and they said that I could purchase an extended warranty right then and there. I was told that this offer was only good at this time. Seemed like a racket to me. But so far it is still working. Most of the channels charge you per movie or program that you watch, so I mostly watch Netflix and Hulu Plus as they charge only a monthly fee.", "verified": true, "helpfulness": "0/0", "author": "Famous \"Famous\""}, {"rating": 1.0, "review": "if you are purchase any Roku products and own a samsung device be forewarned that you WILL NOT ABLE TO STREAM MOVIES  ONLY MUSIC AND PHOTOS. Im not sure if because of where i live but I bought this streaming device thinking that I would be able to stream whatever i wanted from my tablet; I  travel alot and in addition the stick was also on sale for a good price. When i downloaded the app to my device however (I  own a galaxy note 8) I found that i was unable to stream movies, and when i got in touch with the customer service rep I was told that on  samsung devices  the app only functioned as a music player, picture viewer, and a remote while streaming movies via stick to tv: it wasnt mentioned anywhere within the products descrption that movie streaming is exclusive to certain devices.I dont like being ripped off.", "verified": false, "helpfulness": "0/1", "author": "Oh Please"}, {"rating": 5.0, "review": "much smoother than our older v.1 roku box, a definite improvement.", "verified": true, "helpfulness": "0/0", "author": "perry gower"}]