[{"rating": 4.0, "review": "Product was ok at first. It supports most of the same applications as the standard Roku box. It was though signicantly slower and lagged terribly. Even the remote was slow to respond. The roku remote app also constantly had issues connecting to the device. Now, after four months of use, the device has stopped functioning and is stuck on the loading screen. I will be buying a Fire TV stick to replace this device. At least the Fire TV device has an android based operating system which may allow for customization. Now, if the Fire TV devices would just support HBO go.", "verified": true, "helpfulness": "1/1", "author": "Ron G"}, {"rating": 5.0, "review": "Can I say LOVEEEE! I absolutely love my ROKU stick. I cancelled my service with DirecTV just so that I could open accounts with HULU and Netflix and really get the full use of my ROKU Stick. This thing has traveled with me to the hospital when I was in labor, to Jamaica when we were on a family vacation, to Maryland to visit my parents, amongst other places. I have been a huge advocate for the ROKU stick and saving money that my sister and my parents both have a ROKU now. This device is a huge money saver. My daughter has access to 24 hours of cartoons but also educational kids apps that help her learn her A-B-C's, shapes, etc. I think she may be a bigger fan than I am.", "verified": true, "helpfulness": "1/1", "author": "Savage"}, {"rating": 5.0, "review": "Has changed the way I watch TV", "verified": true, "helpfulness": "0/0", "author": "Jennifer Maxwell"}, {"rating": 5.0, "review": "Great device.  We took it out, plugged it in, and it worked.  We had one of those all in one blue ray players hooked up and it just wasn't cutting it.  This new device is much more user friendly and intuitive.", "verified": true, "helpfulness": "0/0", "author": "BenK"}, {"rating": 3.0, "review": "Like this.  Works pretty well, but the remote is a bit flakey on one (I bought 2).  I also have a Roku 3 and prefer it because it's remote lets you put headphones in it and listen while others may be sleeping.  Good cheap option for your \"dumb\" tv.", "verified": true, "helpfulness": "0/0", "author": "justadude"}, {"rating": 4.0, "review": "I love the roku but mine didn't work!", "verified": true, "helpfulness": "0/0", "author": "Ashley Centers"}, {"rating": 5.0, "review": "this new roku setup is the only way to go it is so awesome", "verified": true, "helpfulness": "1/1", "author": "John Tabor"}, {"rating": 3.0, "review": "Too slow to boot to be powered from the TV USB port.", "verified": true, "helpfulness": "0/0", "author": "GrendelT \"GrendelT\""}, {"rating": 2.0, "review": "Have been unable to get this unit to work.Already had an IE person in .Problem seems to be with acceptingmy wireless pass word", "verified": true, "helpfulness": "0/0", "author": "Louis Hirbour"}, {"rating": 5.0, "review": "Super simple easy innovation to use in any room with an hd tv.", "verified": true, "helpfulness": "0/0", "author": "Byrdcrest"}]