[{"rating": 1.0, "review": "I hardly ever write reviews but I felt compelled to for this product. I want to love the Roku streaming stick, however I just can't. I want to throw the remote though my tv on a nightly basis. It is a constant struggle to get to remote to pair with the unit. I will spend days trying to get the remote to work only to have it quit working a day or two later. Yes I know there is an app that you can use to control it from your phone or tablet but it is really a pain to have to do so. Also recently Netflix started acting up with the sound. I know it's not Netflix as I can watch the same show/episode on our 2nd tv via the netflix app on the Amazon fire stick with no issues. So sad as I really prefer the Roku interface over others but the remote ruins it all for me. My niece also received this as a Christmas gift from her parents and tonight I had to show them how to try and re-pair the remote. After only 3 weeks of use! Incredibly frustrating for both children and adults. Buyer beware!", "verified": true, "helpfulness": "0/0", "author": "screedy"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "sherie poore"}, {"rating": 5.0, "review": "Loved the first one so much had to buy a second one for the bedroom!", "verified": true, "helpfulness": "0/0", "author": "Ashley Graham"}, {"rating": 2.0, "review": "I am very disappointed  with item . The company tries to get your credit  card information", "verified": true, "helpfulness": "0/0", "author": "C. Rogers"}, {"rating": 5.0, "review": "Works great just what i wanted.", "verified": true, "helpfulness": "0/0", "author": "j"}, {"rating": 5.0, "review": "Easy to setup and operate.  I bought it for my parents and with a little explanation and demontration they were able to operate it with little difficulty.", "verified": true, "helpfulness": "0/0", "author": "Howard Orr"}, {"rating": 4.0, "review": "Been very happy with this. However, if the firestick stay at the same price point... I think it's a better piece of hardware. There are more channels on the Roku, and I like that Roku searches more than Prime... But unless you're buying a Roku 3... I'd say skip this and buy the firestick.", "verified": true, "helpfulness": "0/0", "author": "Kris Hamilton"}, {"rating": 5.0, "review": "Love this product", "verified": true, "helpfulness": "0/0", "author": "Megan Munns"}, {"rating": 5.0, "review": "Great device. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Mark M Achitei"}, {"rating": 5.0, "review": "Much faster than chromecast, more options than chromecast.  Easy to use remote or download the Roku remote app on your smart phone.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Dream70"}]