[{"rating": 1.0, "review": "I'm really, really disappointed with this device.  What a waste of money.  First, we took it with us to a hotel, like it says you can do.  However, nothing had been set up at home first, so after hooking it up to the TV, we couldn't use it.  Then tried to hook it up at home.  Had so much trouble we had to call customer support and wait on the line forever to speak with someone we could barely understand.  Then, he told us to do several things, which we did, and he said that we would be all set.  Let him off the line.....never should have!  The minute we hung up, an error  message on the TV came up.  Never could figure it out and haven't had the time to try again.", "verified": true, "helpfulness": "0/0", "author": "Sassy"}, {"rating": 4.0, "review": "Bought this for my 83 year old mother.  It has been working for her and she seems to be able to use it with a minimum of instruction.  The Roku was installed by me but was very easy to do.", "verified": true, "helpfulness": "0/0", "author": "Jill Wallace"}, {"rating": 4.0, "review": "It does not have to option to plug in headphones :(Otherwise works great!", "verified": true, "helpfulness": "0/0", "author": "Do"}, {"rating": 5.0, "review": "Highly recommend  This is my third ROKU device addition to our home setup. The other two are the small cabled boxes so I'm excited to eliminate lengthy cables (and additional work to hide) with this \"almost\" wireless stick. Upgraded remote provides one touch buttons for quick, direct access to our most popular streaming media providers (Netflix, Amazon, etc.). Ease of portability, elimination of lengthy cables, and effortless setup makes this a winner. My older models will be soon upgraded to/replaced by the stick.", "verified": true, "helpfulness": "0/0", "author": "idpackfan"}, {"rating": 5.0, "review": "Great itm for our second tv. Did not have to buy another streaming Blu-Ray player.", "verified": true, "helpfulness": "0/0", "author": "John A. Kella"}, {"rating": 4.0, "review": "I had originally purchased a Roku 3 at a local Best Buy, but realized when I got home that my TV had only one HDMI input. Called Roku tech support who told me nothing could be done and that I shouldn't use a switcher. Returned the 3. Decided to try a switcher anyway, and along with the Roku Streaming Stick it all works like a charm. Roku Stick-5 Stars, Roku Tech support-1 Star.", "verified": true, "helpfulness": "0/0", "author": "Bill & Janis Corsair \"He: Former Drummer, DJ, TV Co-Host and Jazz Devotee & She: Actress, Producer, and \"Community Organizer\"\""}, {"rating": 5.0, "review": "great product thank you AAAAA+++++", "verified": false, "helpfulness": "0/0", "author": "Luis Manuel Barbosa Borunda"}, {"rating": 1.0, "review": "very limited channels in Germany.  Designed mainly for the US.", "verified": true, "helpfulness": "0/0", "author": "Imam El-danasouri"}, {"rating": 4.0, "review": "The Roku Stick seems to works better than the Chrome cast for streaming TV and Movies, streaming from your tablet or phone isn't as good, but not having to have a table or phone to control it is nice, and the remote is simple to use. The ability to access Amazon Prime  instant videos is a big plus. Takes a bit to boot up, but works well after", "verified": true, "helpfulness": "0/0", "author": "Jeremy D. Learned"}, {"rating": 5.0, "review": "Love all the movies it opens up to viewing on my schedule.", "verified": true, "helpfulness": "0/0", "author": "Donald T."}]