[{"rating": 5.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "MNowicki"}, {"rating": 3.0, "review": "Not as good as the fire stick but still works good. Had some trouble with losing signal with this device and it would disconnect from my TV and I would have to restart and reconnect which was a big hassle. Also the lag after hitting a button on the remote is too frustrating for me sometimes especially since I am an impatient person.", "verified": false, "helpfulness": "1/1", "author": "Janis Johnsrud"}, {"rating": 5.0, "review": "I got mine today and it was simple and easy to set up. I have a Roku 3, as well as 2 Apple TVs. I primarily use my Roku 3, and now having the Streaming Stick, it will be nice to have when traveling. It's a simple and easy interface. I also have a Chromecast, and right now, Roku has a leg up because it has a great deal of apps available. It's a good.Simple, easy to use and easy setup! Roku is the dark horse company that is giving Google and Apple a reason to be quite nervous!", "verified": false, "helpfulness": "0/0", "author": "crystal oleary"}, {"rating": 4.0, "review": "We cancelled DirecTV a few months ago and have been using a Roku 3 with great success.  This little streaming stick was bought for the bedroom and has been so useful.  It is a bit slower to load than the Roku 3, but it's not really an issue.  The remote does not have the plugin for headphones, which I do miss very much.  Otherwise, this is a good, less expensive alternative to the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "sfl89"}, {"rating": 5.0, "review": "Kick cable television to the curb, buy this and save money. Will pay for itself the first month out of the package.", "verified": true, "helpfulness": "0/0", "author": "PFJnze"}, {"rating": 1.0, "review": "The remote stops working intermittently. You can get it to work by resetting the streaming stick every so often, but after a while it becomes insufferable to use. I've tried going to Roku's support website, but apparently it doesn't like to load either. If you have time on your hands to troubleshoot then I suppose it's a good value, but otherwise I'd look elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Frederick C Lam"}, {"rating": 5.0, "review": "Best entertainment purchase we've made in years. The Roku Streaming Stick delivered what our Vizio smart TV promised.", "verified": true, "helpfulness": "0/0", "author": "Dexter L. Alexander"}, {"rating": 5.0, "review": "Works as expected.", "verified": true, "helpfulness": "0/0", "author": "Fred Gilbert"}, {"rating": 3.0, "review": "no comment", "verified": true, "helpfulness": "0/3", "author": "killcase"}, {"rating": 5.0, "review": "The Roku Streaming Stick is the best media streaming device I have used.  Great for anyone who needs a streaming device or would like a BETTER steamer than is pretty much built into any TV, or other device.  I originally bought this device to stream Netflix and HBO Go to my 7 year old Panasonic HDTV in my bedroom which did not have streaming capabilities.  I wanted to upgrade to a larger TV so I just bought a new Samsung 4K \"smart\" TV (best 40\" model they had) for my bedroom this week and was a little disappointed that the smart TV functions and access to streaming services such as Netflix and HBO Go were considerably slower than accessing them thru Roku.  I decided to use the Roku streaming stick for my streaming needs on my new TV in my bedroom.  The device is very easy to set-up, it just plugs into an open HDMI connection on your TV, connect a USB power cable to the device (which can be powered by most USB connections on TVs that have them or thru an included adapter) and you connect it to your wireless network and your ready to go.  The Roku online menu system is easy to navigate and user friendly.  The service and device is FAST!  As stated streaming thru the Roku Streaming Stick is faster than thru my new TV and faster than thru my TiVo 4 XL unit I have in my living room.  I did try an Amazon FireTV stick streamer a friend of mine let me borrow while he was gone for two weeks on vacation but I think the menu system on the Roku is more fluid, easier to use and navigate, and as I already stated, its FASTER.  Roku has 3 other versions of their streaming devices available (the Roku 1, 2, and 3).  You can check out the other versions which offer other features such as voice search, faster processors, motion control for games, etc.  This one is the best value and the least expensive.  The Roku 1 actually has fewer features but it is the only one that will work thru a connection other HDMI and is your only option if you have an older set without an HDMI connection.  This particular version of the Roku streaming device comes with a small remote (the remove is a non IR remote so it does not have to be in line of sight of the TV or Roku device to operate (Please note, only this version and the Roku 4 have a point anywhere remote, the other two versions us IR remotes).  The remote has 4 preset service buttons on it (Netflix, Amazon, Radio, Vudu) along with the navigation buttons, etc.", "verified": false, "helpfulness": "0/0", "author": "imccubbin"}]