[{"rating": 4.0, "review": "This is a great little product. I had problems getting everything set up so that it worked properly but I think that was the installer!  There are good instructions on line that really helped me.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 1.0, "review": "I purchased two of these units directly from Roku 12/14/14.  I immediately set about installation as soon as I received the units.  I could not get the unit to log into the internet.  It would connect with my WiFi, but could not get through the modem.  After HOURS online and trying to get through to ROKU's nonexistent help line I gave up.  I started working to get RGA's to return the two units.  Many tries on the phone and on their website yielded frustration and no results.  I finally talked with the ROKU customer assistance in Bangalore, India today 1/27/15!  The first time they said they would have to call me back after a 25 min wait to talk with someone.  The second time I got a response after waiting 10 minutes on que.  The answer was that I could not return the units because their 40 day time was over.  Buy an Apple TV instead.  Anyone can connect them in minutes.", "verified": false, "helpfulness": "0/0", "author": "D. Carlson"}, {"rating": 4.0, "review": "It came right on time and so far has worked so well.  Trying to figure out what all it can do.", "verified": true, "helpfulness": "0/0", "author": "Classic \"movie lover\""}, {"rating": 4.0, "review": "This almost didn't fit in the back of the tv we bought it for.", "verified": true, "helpfulness": "0/0", "author": "Joy Bishop"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "carol caputo"}, {"rating": 5.0, "review": "This is much better than the Panasonic WiFi stick it replaced on our Panasonic HDTV.", "verified": true, "helpfulness": "0/0", "author": "Greg Geisler \"GreG\""}, {"rating": 5.0, "review": "I have a sony tv with similar built in apps, this device interface is much nicer than Sony's.  Easy to search and if you are watching series, it has auto launch of the next episode.", "verified": true, "helpfulness": "0/0", "author": "Spooky"}, {"rating": 3.0, "review": "This is probably not a fair review as I returned it for reasons not related to it's value.  I called before I ordered it to make sure I could receive FoxNews during the time Dish has cancelled the program.  I was told it was included.  Well, it was, but only on some shows that had already aired.  I was not interested in anything else it can do.  I did go through all the setup and found it was probably worth it for those that wanted all thoese features but I just didn't need them.", "verified": true, "helpfulness": "0/0", "author": "H. Ray"}, {"rating": 5.0, "review": "Love my Roku! Great Streaming system for my Netflix. I haven't had any problems thus far.", "verified": true, "helpfulness": "0/0", "author": "Kasey"}, {"rating": 5.0, "review": "Stunning video performace. A must have device.", "verified": true, "helpfulness": "0/0", "author": "Dehivi A"}]