[{"rating": 5.0, "review": "I love roku! I get so many channels! Hours of entertainment!", "verified": true, "helpfulness": "0/0", "author": "Tommy J McFerin"}, {"rating": 5.0, "review": "Cannot  live without.  It was my number one Christmas gift to family and friends with out a Smart TV", "verified": true, "helpfulness": "0/0", "author": "Rachel Howard"}, {"rating": 5.0, "review": "Solid.  Delivered on time/quickly in the xmas shipping season and works fine does what it should.Something that might be helpful: I saw that a lot of people were buying a USB cable for this and I wasn't sure what it was going to arrive with.  It came with a standard USB(TV/plug side) to micro USB(for the ROKU side)with an electrical outlet end for the USB just like a phone/tablet/kindle/etc.  My particular TV fired up the USB but only briefly then it powered back down and I had to use the wall outlet. I see no reason that people would be buying an additional USB cable other than to avoid tying it up in a short loop to manage the excess.", "verified": true, "helpfulness": "0/0", "author": "Stephen Dalton"}, {"rating": 5.0, "review": "Great little accessory for the TV....Opens up quite a few more viewing options. Easy to install. Happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "LJP"}, {"rating": 5.0, "review": "i really like Roku, but recently experiencing losing sound very often, not sure why. Have to plug out and plug in or switch HDMI ports to make it work again.", "verified": true, "helpfulness": "0/0", "author": "jinginmagic2005"}, {"rating": 5.0, "review": "Works wonderful in laces where full cable reception is problematic", "verified": true, "helpfulness": "0/0", "author": "Audri Badman-Chasteen"}, {"rating": 1.0, "review": "When I first bought it I was going with the idea that I would be able to use this device to turn a dumb tv into a smart one, that being said I was already aware of the product region blocking certain channels as I live outside the United States this was one of the drawbacks but what I mainly wanted this product for was Netflix which is not region blocked, but to my surprise it is on Roku might I add that Roku is blocking something that shouldn't be region blocked and on top of that the product description said that certain/some channels would be block due to location NOT that over HALF the channels would be blocked this is a total waste of money for anyone living outside the United States and I would not recommend buying it if you do not live there.", "verified": true, "helpfulness": "0/0", "author": "Victor62"}, {"rating": 1.0, "review": "The stick broke after a week", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it, it's like having your on video store using with amazon prime. Great product.", "verified": true, "helpfulness": "0/0", "author": "G L Sutton"}, {"rating": 1.0, "review": "It is slow and picture not as good as other Roku's.", "verified": false, "helpfulness": "0/0", "author": "steve galloway"}]