[{"rating": 5.0, "review": "Quick and easy install and did not take any time at all to set up!  I wish everything electronic were this easy!", "verified": true, "helpfulness": "0/0", "author": "Carol Rapp"}, {"rating": 3.0, "review": "I really like watching youtube videos when bored, but it constantly is buffering for me when using this.  Have no issues with Netflix, and those are the only two things I got it for.  So for now I stick to youtube on my PC and Netflix on the TV.", "verified": true, "helpfulness": "0/0", "author": "John Davis"}, {"rating": 5.0, "review": "I had been using an old playstation to access my Netflix but needed something for a second TV.  My daughter suggested this.  I got the cheapest one and have no problem.  All you need is wireless and you can easily access all your favorites i.e. netflix, AmazonPrime, HULU etc.  You can also access many TV stations for free i.e. PBS.  Excellent support.  On a Monday night I had trouble with the Netflix site and got a tech on line from ROKU immediately and she stayed with me for 20 minutes trying to figure it out.  It was not a ROKU issue but she helped me anyway and stayed with me until it worked (wireless issues that she helped me through).  I strongly recommend this product.  Playstation would never have helped me with my problem.", "verified": true, "helpfulness": "0/0", "author": "vicali"}, {"rating": 2.0, "review": "For the first month, the Roku worked great.  Was exactly what I was looking for.  Now, after 3 months, it is hit or miss whether it works.  When it does, I find it often reloading and or the remote doesn't work (with new batteries).  My internet connection is fine.  I can walk to my desktop computer or tablet and watch Amazon Prime without any issues.  I have friends who also report a similar situation with their Roku.  I'm convinced it is on the Roku side of things.The real insult to injury was that Amazon Fire TV came out shortly after my Roku purchase.Buyer beware.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey D."}, {"rating": 1.0, "review": "First this was  a pain to set up, although in fairness to Roku my TV is wall mounted making it more difficult to set up new things.  After you plug in the charging cord it really is sort of bulky and sticks out from the side of my TV.  Also not really their fault since I could have measured.The reason I give it 1 star is two fold…  its fussy about my wifi and struggling with the streaming.  I know its not my network since I have both apple TV and a bluray player set up in the living room.  Anyway…  Its annoying when your shows stoop in the middle and you have to reset it.  Someone else mentioned that you best have a STRONG network and I would echo that.  Mine hasn't ever had issues until Roku.Secondly and more importantly- I bought this over Apple TV because I wanted to be able to stream from my Amazon Prime account (and still have a remote).  I thought about going to a different DVD player and using that to stream, but figured this would be easier. They don't widely advertise this pre-purchase but you have to set up an account with them to use this.  I really have absolutely ZERO appreciation that in order to use this gadget I have to give them all my information including credit card info.  This really should be optional.  So here I have yet another company to lose my cc info.  ugh.", "verified": true, "helpfulness": "0/0", "author": "SandraP"}, {"rating": 5.0, "review": "Thanks to my Roku, HULU, and my flat HD antenna, I am officially off of the grid!  This was simple to install and operate!", "verified": true, "helpfulness": "0/0", "author": "Pilow"}, {"rating": 4.0, "review": "This is my families first streaming device for any of our TVs. I purchased this because I have been wanting a smart TV, but I do not want to pay for one yet. So I chose to try this for now. Over the last 2 weeks we have used it a lot and overall we are satisfied. The setup process was easy, it took awhile, but I did not have any issues. The first movie I tried to play was awful picture quality, but I believe it was an internet connection problem. I have not had anymore major problems with picture quality since then.But this is what is frustrating:1. The remote does not always work. The batteries were supposed to be new, but the remote goes dead a lot. I have to reinsert the batteries to get it going again. I will replace the batteries to see if it helps, but I think I may need a new remote.2. Navigation to/through the different channels can be a slow. Then once you finally get to the channel and pick what you want to watch then the process of loading can be slower depending on wireless connection. I don't mind waiting for a movie to load, but I do want the Netflix or Prime channel to come up as soon as I press the button...not 2 minutes later.Despite being frustrated with it at times, I am pleased with my decision to purchase. I have enjoyed watching shows on my TV, I really like my Kindle Fire, but a bigger screen to watch Prime stuff on has been great. Honestly I do not think I will watch the free channels much, but it is worth the price to have access to Prime, Netflix, and Redbox Instant.", "verified": false, "helpfulness": "1/2", "author": "jellybean"}, {"rating": 5.0, "review": "We love it!  Easy to setup and use.  We'd recommend to anyone looking to stream their Netflix, Hulu, or Amazon.", "verified": true, "helpfulness": "0/0", "author": "dave carter \"www.TheStationMusic.com\""}, {"rating": 5.0, "review": "Love this product and it works great. I purchased the roku to watch Netflix. It's Easy to install..  Highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Marilyn  Benitez"}, {"rating": 4.0, "review": "Setting up was a breeze.Found the response a bit slow and lagging but does not affect overall performance.For that price, it is pretty good.", "verified": true, "helpfulness": "0/0", "author": "Steven"}]