[{"rating": 1.0, "review": "The roku l purchased is not working!", "verified": true, "helpfulness": "0/0", "author": "Daniel Adeyemi"}, {"rating": 5.0, "review": "Love Roku 3500R Streaming Stick which I've now been using for over six months. Was very easy to set up my Roku account (you do have to log in online with your computer first before you can set up the stick in order to get your customer number and pin number). I use it daily to watch my TV shows on Hulu after cord cutting and the quality has been excellent: HD TV picture quality on my HD set. Only wish they had a dedicated button for Hulu on their remote since I use Hulu all the time but that really is quibbling. Give you access to paid services and networks (Hulu, CBS, Netflix, HBO, Amazon Prime, Blockbuster, National Geographic, etc.) as well as a lot of free channels (Smithsonian Channel, Lifetime, PBS, Fandango movie trailers, Moviefone trailers, History Channel and H2 channels, WeatherNation, NBC News, etc.)", "verified": true, "helpfulness": "0/0", "author": "Ravyn"}, {"rating": 4.0, "review": "This stick works just fine but I cannot complete setting up an online management account without paying Roku $69.95 to \"reset\" the account, wiping out the previous owner's profile so that I can get a new\" link\" code.  I can get along without it, but I only saved a few dollars by buying used, so I should have just bought a new one.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Bembry"}, {"rating": 5.0, "review": "This is my second Roku and i love it", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I bought this to replace my old wired version which died.  I also have an Amazon Fire TV that is much faster than the Roku, but the Roku does have more content.", "verified": true, "helpfulness": "0/0", "author": "Gary A Okula"}, {"rating": 5.0, "review": "My parents love it, it is easy to use and have a plenty online channels", "verified": true, "helpfulness": "0/0", "author": "Tatiana D."}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "jUDY mOORE"}, {"rating": 4.0, "review": "I started with a Roku 1 and then picked up a Fire TV stick during the launch promo.  I appreciated how the Fire Stick was quicker, but the interface left much to be desired.  I am even an Amazon Prime member and missed the simplicity of the Roku menus and channels.  I probably would have just stayed with it if it wasn't for the Sling TV promo to get a free Roku stick.  Now that I've picked one up, I have both sticks plugged into my TV and I favor the Roku for the following reasons:-Menu Layout-Ability to search all channels at one time (Fire Stick only searches Amazon)-Number of available channels-Has a \"non-clicky\" remote (Fire Stick remote clicks with every press, this one makes no noise)-No HDCP errors (Fire Stick would occasionally give me a blue screen and lock out picture due to older non-HDCP compliant TV)Advantages of Fire Stick:-Quicker operation-Quick access to Prime media-Ability to use in hotel rooms with WIFI browser loginThe speed of the Fire Stick is a big plus, but if I can put up with the delays and load times, I'll keep using the Roku stick more often and just take the Fire Stick with me when traveling.", "verified": false, "helpfulness": "0/0", "author": "Chilehead Craig \"Captured Moments are the Spice of Life\""}, {"rating": 5.0, "review": "This is the worst item I ever bought from this site. I got the package and opened it up to what appeared to be a new unit. Not something I was expecting from a refurbished model. No scratches, everything functions correctly, I'm very appalled at how new the unit looks.And now to get to the really bad part. I have lost nights of sleep since I purchased this item. The unit has been installed with software that instantly transfers media to your screen. How absurd it was to have unlimited entertainment at my fingertips. I once recall staying up until 3am trying figure out how to get more seasons of the show I just watched for 8 hours....but with no luck. It's almost as if I exhausted all the episodes or something.Bottom line, if you want a product that will be a higher quality than you expect. And if you want to lose hours of your life on easily accessible entertainment. Then this is the product for you.Not to mention, the seller was not what I was expecting. How can you provide a consumer with their product they ordered faster than they expect the delivery to be?", "verified": true, "helpfulness": "0/0", "author": "Michael R Fitzgerald"}, {"rating": 5.0, "review": "Great streaming product", "verified": true, "helpfulness": "0/0", "author": "D  R"}]