[{"rating": 5.0, "review": "We got our Roku Streaming Stick in the mail and within 15 minutes, we were up and running and had even signed up for a Roku account. We are very happy with the product. It's a perfect fit for our family.", "verified": false, "helpfulness": "0/1", "author": "Dana Harrel"}, {"rating": 5.0, "review": "nice to go along with your apple tv ...makes your non smart tv smart! Even works well with not so fast internet service", "verified": true, "helpfulness": "1/2", "author": "MJH"}, {"rating": 3.0, "review": "I bought this for my bedroom HDTV and thought it would be easy.  Turns out that when I plug the streaming stick into my HDMI port on this HDTV(http://smile.amazon.com/Sharp-AQUOS-LC19DV28UT-19-Inch-Combo/dp/B003TXH75G/ref=sr_1_1?ie=UTF8&qid;=1396480969&sr;=8-1&keywords;=Sharp+AQUOS+LC19DV28UT)(The TV Specks listed on the Amazon page) I only get a black screen and clicking sounds.  I verified the device actually works on my living room HDTV.Second problem I discovered is that having your HDTV route audio to surround sound does not count as actual surround sound for the device.  I'll find a use for it, because in the end I still like the Roku brand, but beware HDTV doesn't mean all HDTVs and surround sound is relative.", "verified": true, "helpfulness": "2/3", "author": "Michael Lehofer-Chavez"}, {"rating": 5.0, "review": "The 3500 is my third Roku purchase. For the past two and a half years, I've been using the Roku 1 XD and the Roku 2 HD.My experience with the Roku apps and interface keeps getting better each year. Back in 2011, when I bought my Roku 1, it crashed fairly often. The Roku 2 almost never crashes. So I think Roku has figured out the bugs that were in their earlier models and is continuing to improve the software. Roku updates over the air like a smartphone. So you usually don't need to buy a new device to get the latest software.I love the stick design because my TV is mounted to a wall. Less wires is always a plus. (I have a USB connection on my TV. If you don't have a USB connection, you'll need to plug the stick power cord into the wall).The remote is pretty nice. It isn't as cheap looking as remotes for older Roku models.I've seen a lot of people mention a lag with the responsiveness of the remote. I think since it's a wifi remote, the lag time probably depends on the speed of your network connection. I have a pretty good connection and haven't noticed any response time difference between the stick and my older Roku models.I really can't think of anything bad about the stick. At $49.99 it's a great deal.", "verified": true, "helpfulness": "2/3", "author": "L. HODGES"}, {"rating": 4.0, "review": "Preordered so have had this about a week. This is my first streaming device of any kind, other than a smart tv or bluray player. Overall, I would say this is very good. I agree with some of the other users on a couple of points. Setup took longer than it should have. Would not connect to my wifi initially, eventually did after several attempts and I have not any problems since. It does take a long time to \"boot up\" and some of the content is slow to load, especially netflix. I do have it plugged in to the USB port on the tv, so maybe I will try plugging it in to an outlet and see if that improves performance. I got this to watch amazon prime on the tv and it works great for that. Some reviewers have commented on the remote. I have not had any issues with it, works well and is not \"line of sight\" as the stick is behind the tv. One reviewer commented on the time to enter text with the standard remote. That is true, but just download the roku app and use the keyboard on your phone or tablet. The app works great for that and just as a remote, too, very responsive. All in all a good purchase, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "JMB"}, {"rating": 5.0, "review": "I was impressed with this as soon as I took it out of the box! Not only is the streaming stick very small and inconspicuous once I plug it into my TV's HDMI port, but the actual set up process is incredibly easy. I was able to very quickly link my Netflix, Amazon and MLB.TV accounts with the Roku and begin streaming.I've heard complaints about loading speed, but honestly I didn't really notice a problem at all. Some channels loaded more slowly than others, but only by a few seconds. It seems silly to me to complain about having to wait 20 seconds to have access to all of the streaming media that this product does. I'm glad that I purchased this for my household, and it's already well worth it.", "verified": true, "helpfulness": "1/2", "author": "Lois F."}, {"rating": 3.0, "review": "I'm not a big TV or movie watcher. I recently signed up for Amazon Prime and enjoyed watching the free instant videos. I considered buying the Roku 2, then the Roku 3 when they became available. But the $99 price point was too much for me to spend on watching TV. But when Roku announced a HDMI streaming stick for $50 with a remote, I was sold. I didn't need the gaming capability or earphone plug offered on the Roku 3. So I pre-ordered this product, the Roku Streaming Stick and it arrived the day it was announced. I've had it for about a week now and do enjoy the access to internet TV. However, the interface doesn't make use of the space on my TV. It's a modest 27\" LCD model but when the Roku interface loads (which takes a minute or three…), I find that it doesn't use the maximum space. I find it clumsy to type on the keyboard by pointing the arrow onscreen. I could and have used the Roku app on my Android phone or tablet for typing. Overall, the experience is satisfactory for the price paid. However, I'm returning this product and investing in the new Amazon Fire TV. Their interface looks great and looks like it fills the screen to the max. The voice search feature on the remote sounds awesome. With that type of technology, Roku and other companies should take note.", "verified": true, "helpfulness": "4/5", "author": "Prime time.Dot"}, {"rating": 5.0, "review": "A lot of exploring required. The remote control app for the iPad works great. Enjoy the \"private\" channels which allow you to get extras like CNN International.", "verified": true, "helpfulness": "1/2", "author": "JustinHoca"}, {"rating": 3.0, "review": "Works as advertised after some annoying setup requirements keeping you next to your computer.But the interface SUCKS.Just try putting in the name of a movie you want to watch...if you have a half hour.  THIS THING WILL DRIVE YOU NUTS.Begging for a mouse/keyboard interface, and mebbe they'll come out with another expensive 'upgrade'.But, as it is, it's a MAJOR PAIN.And...the quality of video is someone variable.  A lot of blockiness.", "verified": true, "helpfulness": "3/5", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Up and running in minutes, works great, fast and responsive, easy to setup apps, kids can work remote.  Would recommend to others wanting to stream online services.", "verified": true, "helpfulness": "2/2", "author": "Joshua Peluso"}]