[{"rating": 5.0, "review": "I got this for my 85 year old father to stream movies.  It was easy to set up.  It works great with his TV and his wifi network.  He was able to figure out the menus and remote.  He is very  happy with his ROKU stick. I do not get any calls from him to come and fix it for him so It must be functioning fine.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 1.0, "review": "I bought this \"certified refurbished\" unit because it saved a few dollars.  The case and connector came loose within a week, the unit stopped working and I had to return it.  On the plus side, Amazon's warranty return process made the return as painless as possible.  I went with a top-of-the-line Roku unit from a local big box retailer and have never regretted it.", "verified": true, "helpfulness": "0/0", "author": "Lou Geezer"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "J Steven Lane"}, {"rating": 3.0, "review": "The Roku is ok.  I have a few others like this that work better. Seller though was prompt and kit was in great condition.", "verified": true, "helpfulness": "0/0", "author": "t"}, {"rating": 1.0, "review": "We tried to use this product to stream Netflix, but could not get it to work.  I contacted Roku on their support site on my computer and got into a terrible situation.  I was transferred to a company called vTECH who took over my computer and put $735 on my credit card all the while I was protesting and asking for control of my computer. My credit card company called me and told me I was probably involved in a big scam and deleted the charge.  I think Roku should provide reliable, honest support for their product.  I had to cancel my credit card, report this scam to my local police department, the state Attorney General, the Consumer Protection agency, the credit reporting agencies and now I have to change my payment schedules on many accounts...all because I had faith in a company called Roku.  AND after all that, I returned the Roku streaming stick and we still do not have Netflix!", "verified": false, "helpfulness": "2/3", "author": "J. Wutt"}, {"rating": 1.0, "review": "I was thinking about giving my father a device where he could watch netflix. He isn't good with tecnology so Google's Chromecast was not a option because of how you need to use it. I needed something which brought its own remote, no using a smartphone app that could get him confused. I found out that Roku Streaming Stick and Amazon Fire TV Stick could do the job done. The Fire TV was my first option but was out of stock until February 15th and his birthday was Feb-4th. And the end I chose the Roku.Before Buying it, I noticed that it said that some channels were not available for all the countries. I decided to check in their website if there were more information about the channels available for my country (Dominican Republic) and found nothing. Then, I sign up to see if I can add netflix to my account but it didn't work. Every channels I tried to add the web said \"We're sorry. At this time, we don't support adding channels from the web for your region.\", which left me at the same point that I started.I start thinking that I am already subscribed to netflix using a credit card issued here (Dom. Rep.), Netflix is one of the channels that they (Roku) promote the most even it is in the remote by default. I decided to buy it. As you may imagine, it was a bad idea. Not only Netflix is not available, not even a single recognized channels is.This might be pretty good for USA residents but it shouldn't be sold to outsiders, it's just a waste of money. I would have preferred buying a Chromecast and dealing with weeks of teaching (my father). And yes, it says \"Not all content is available in all countries\" but even if you ask, you won't find out if it works for you until it is too late.", "verified": true, "helpfulness": "4/4", "author": "A. Peña"}, {"rating": 5.0, "review": "There were a few glitches and I had to re-install/re-boot, but now it is working great without buffering.", "verified": true, "helpfulness": "0/0", "author": "pamela f chesher"}, {"rating": 1.0, "review": "It's junk. I have had it 3 days and it's already not working. It was fine the first time I used it, then it was losing internet connectivity (though still connected to our network, and our computers were still on the internet), it was freezing, requiring us to unplug and restart everything, then it completely stopped working with one of the HDMI ports and I had to switch it to the other. I think it bears repeating that it's been THREE DAYS. Another case of you get what you pay for.", "verified": true, "helpfulness": "2/2", "author": "EmKay"}, {"rating": 4.0, "review": "I am very happy that I purchased the Roku 3500R Streaming Stick (HDMI), and I have already recommended it to family. In fact, my family and I like it so much, I have plans to purchase a more advanced Roku devise at a later time.", "verified": true, "helpfulness": "0/0", "author": "Denise Y. Brown"}, {"rating": 5.0, "review": "Received timely and works great", "verified": true, "helpfulness": "0/0", "author": "ARS"}]