[{"rating": 4.0, "review": "I absolutely love Roku, and would have given this one five stars except that the remote kept coming unpaired. They did offer to replace it when I contacted amazon, and I probably should have, but I didn't want to go through the set-up again, and since I use a universal remote with the one in the living room, I just paired up my roku 2 remote to work with the roku stick in the bedroom.", "verified": true, "helpfulness": "0/0", "author": "christie smith"}, {"rating": 5.0, "review": "Works fine so far, only had it for a few weeks. I already had a Netflix account I just signed in on Roku and presto there's our profiles. This Roku stick is doing what it's suppose to do; save money. Good bye cable.**Super easy set up. With paid Hulu 7.99 per month; I watch my favorite shows when I want to watch.", "verified": true, "helpfulness": "0/0", "author": "Frugmom67"}, {"rating": 4.0, "review": "Works great. Still cannot replace regular tv for me but its a good interface if you know what you are expecting from streaming tv.", "verified": true, "helpfulness": "0/0", "author": "Pcuch"}, {"rating": 3.0, "review": "It works just like the other Roku products. The reason I did not rate it higher is because starting up the device easily takes 1-2 minutes. My chromecast boots up in under 30. Also, the remote takes an extra 30 seconds to pair with the device so even after the screens pop up, you have to wait some more for the remote to kick in. Once booted, everything is smooth but getting to that point takes longer than expected", "verified": true, "helpfulness": "0/0", "author": "hockeyplayah"}, {"rating": 4.0, "review": "Excellent !!", "verified": true, "helpfulness": "0/0", "author": "Denise J"}, {"rating": 5.0, "review": "Excellent I almost forgot it was refurbished.", "verified": true, "helpfulness": "0/0", "author": "emontilla"}, {"rating": 5.0, "review": "I have six Roku devices in my house.  The Roku stick is one of the best values.  I do not like the remotes that come with the lower cost Roku boxes. They rubber covers don't hold up well and the buttons are too small for my fingers.  The Streaming Stick is the lowest priced Roku streaming product that comes with the better blue tooth controller.  The downside is that there is no IR so you won't be able to use most universal remotes which use IR with this device.The Roku stick performs just like any other Roku device. It plugs directly into the HDMI port.  I have a Google Chromecaster.  I like the Roku Stick better. It has more viewing choices and you don't need to have your phone charged at all times to use it.  I have a Slingbox which works with Roku devices.  Once you start streaming your Slingbox content to the Roku stick,  you can turn off your phone.", "verified": true, "helpfulness": "0/0", "author": "NorhLoudspeaker"}, {"rating": 5.0, "review": "I prefer using the Roku to access streaming services over using my smart tv.  It's super easy to set up and I've had zero problems since I began using it about a month ago.  This unit appears to be brand new with absolutely no indication that it has been refurbished.  Very happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "KAC"}, {"rating": 5.0, "review": "Another great product from Roku.  Easy to use and easy to setup.  Remote is RF since line of site isn't possible.  A nice bonus is that this version of the Roku also has the newer version of the Netflix app.  It is much nicer to user and functional than the old Netflix App.  Works as well as any of the more expensive Rokus.  Also, I have this plugged into an HDMI switch, and it works great.", "verified": true, "helpfulness": "1/1", "author": "Justin Morabito"}, {"rating": 5.0, "review": "Very simple to set up", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]