[{"rating": 5.0, "review": "easy to use,even having never streamed tv before. we gave up cable cold turkey and were able to figure this out with no problems. we got amazon prime and hulu plus and the variety of programs and movies more than suits our needs. purchased one to be sure we liked it and now buying another for the other tv in the house! we are a small family witg two little ones so were not needing anything with games or headphone jacks or tons if memory....if that sounds like you...i highly recommend it....ditch cable, just pay for internet and stream all your favorite shows and movies!", "verified": true, "helpfulness": "0/0", "author": "liz"}, {"rating": 5.0, "review": "I have been using the earlier ROKU with compolete satisfaction, but the stick got rid of the clutter.  I performs superbly, just like he old one.  I have been a ROKU user for a few years and would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Viking"}, {"rating": 1.0, "review": "Keeps hanging even though it has excellent signal. Has to unplug most times I tried to use it, because it just does not respond.  I have an older version, which is about 4 years or older, and which is placed further than the roku stick, which works perfect.", "verified": true, "helpfulness": "0/1", "author": "Charmaine Beckford"}, {"rating": 4.0, "review": "Purchased this item in order to stream television and movie content to my TV and it works fantastic! Setup was a breeze, synced with my Amazon Prime and Pandora accounts and now I'm watching free shows and streaming music. Made it possible for me to utilize my older Yamaha stereo system, connected to my TV, in order to enjoy commercial free Pandora music on a system that had no computer interface. Definitely worth the price and getting me closer to allow my escape from cable!!", "verified": true, "helpfulness": "0/0", "author": "Mike EE"}, {"rating": 5.0, "review": "Originally had 2 Roku 3's before I bought this one. I love the Roku's. Easy to set up, works flawlessly, convenient. I use it for Amazon Instant Video, Hulu, YouTube, Netflix, Aereo, HBO, and many others. This streaming stick is perfect for anyone who wants basic video streaming without games or the ability to plug in usb hard drives. You plug the power cord, plug in the device to an HDMI slot on the TV, and follow the eas on screen prompts. I Highly recommend this and any other Roku devices.", "verified": true, "helpfulness": "0/0", "author": "Mongoose"}, {"rating": 3.0, "review": "After finding that my wifi was too weak for the back bedroom (where the Roku was going), I had to buy a wifi extender to go with my great router. Now, I have superb wifi throughout the house, and this still loses connection. Will continue to fiddle with it, but it does not work as described or hoped.However, when plugged into a TV very close to the router, this seems to work great and fast. I just don't need it in that TV.", "verified": true, "helpfulness": "0/0", "author": "Linda \"Linda\""}, {"rating": 1.0, "review": "first i buy this roku for viewing netflix at mexico and it doesn't allow me to use my mexican account.second, the screen was all blue, with sound but not image.very dissapoint product. cheap but workless....", "verified": true, "helpfulness": "0/3", "author": "Gerardo garza"}, {"rating": 3.0, "review": "i also own a chrome cast, to me, i just think it's significantly more useful. i end up using it a lot more since it's so well integrated with the apps on my phone / tablet.", "verified": true, "helpfulness": "0/0", "author": "Grosman Haim"}, {"rating": 5.0, "review": "love this streaming stick. Its the only thing I utilize for my shows on tv and I don't ever want to be with out it lol", "verified": true, "helpfulness": "0/0", "author": "Betsy"}, {"rating": 5.0, "review": "A friend recommended it to me, he researches gadgets and he ended up buying one then the rest of his family wanted one, so he thought I should try it. I really think it's a great tool for streaming movies on the TV.", "verified": true, "helpfulness": "0/0", "author": "dancin39"}]