[{"rating": 1.0, "review": "did not work returned item", "verified": true, "helpfulness": "0/0", "author": "billy hicks"}, {"rating": 3.0, "review": "So many things on this device could have been improved, it is like the 1st protocol was just thrown on the market. On perusing  selections the images are too small to read or see clearly so you have to get up ! The remote causes stalls and there is very little option to find where you left off or start from the beginning if you fell asleep 1/2 way thru.. Almost makes me want to go back to cable...but not quite yet.  Fix This!", "verified": true, "helpfulness": "0/0", "author": "lynne@fox"}, {"rating": 1.0, "review": "Stick was defecctive and had to return it. Technical support was weaker than circus lemonade", "verified": true, "helpfulness": "0/0", "author": "Edwin guthrie"}, {"rating": 5.0, "review": "The product works great and is easy to install.  The processor is noticeably slower than my roku 3 but the roku stick is fast enough and a great value. The seller delivered it earlier than expected.", "verified": true, "helpfulness": "0/0", "author": "Ian O."}, {"rating": 1.0, "review": "Nice concept, but fails to deliver. I own a Roku 2 (okay, but not that great) and a Roku 3, which is by far the most superior model made. This \"Stick\" is a worthless piece of garbage and I know, because I used the exact same wireless connection for the \"Stick\" and Roku 3; the Stick would barely load a video for 5 seconds and constantly buffered. Long story short... Save yourself some frustration and spend the extra dollar for the Roku 3. It is by far the better model they make and out performs everything out there.", "verified": true, "helpfulness": "0/0", "author": "Liz H."}, {"rating": 1.0, "review": "I've had this ROKU for 2 months and the signal from the device keeps dropping because the power cord to the device doesn't keep it turned on.  The power flickers constantly on and off.  I can't return it.  The first one we had I was able to replace because we had problems with that one.  I was charged $8.00 return fee for the privilege of ordering another one.  So disappointed and frustrated with the product.  We spent $53 for something that isn't reliable.  Maybe others have had better luck, not this household.", "verified": true, "helpfulness": "0/0", "author": "Caroline"}, {"rating": 2.0, "review": "Very disappointed in this purchase.  The remote has been a problem the entire time.  At first, I would have to change the batteries about once a month to keep it working but now it just doesn't work at all.  And, obviously, if the remote isn't working, the product is useless.  I only give it two stars instead of one because of the couple of months I was able to actually use this product.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 2.0, "review": "The setup process is terrible. Unlike a WD TV Live, you need a computer to do the setup. Super lame, you should really be able to pick the channels from the device itself. The roku will prompt you to go to the website and enter a code; then it'll do something .. and reboot, forcing you to enter another code. No indication why, or how many more reboots required.Also, you need to give it payment information to set up your roku account, even if you never intend to purchase content. There are of course ways around that...But wait! You can't use your computer to enter your credentials for streaming services! Oh no, you need to use the terrible little on-screen keyboard. Again, super lame.Once you do get it all set up, it can't even stream from a local NAS. I'll give it a week or two, but I'm probably gonna send this piece of junk back and just build something on a raspberry pi.", "verified": true, "helpfulness": "0/0", "author": "ckuethe"}, {"rating": 5.0, "review": "I have TWC and their digital boxes are just horrible. The service guy recommended I get a Roku and install the TWC app on it. I opted for the Stick and couldn't be happier. The TV channels work great via the streaming app, I installed Plex on it as well. It works great, simple, fast. VERY happy.", "verified": true, "helpfulness": "0/0", "author": "Elan k"}, {"rating": 5.0, "review": "Love the small size, works very well, no issues. Only downside is that a wall adapter is still required to power the unit (I thought it would draw power from the USB port).", "verified": true, "helpfulness": "0/0", "author": "dsvmusic"}]