[{"rating": 3.0, "review": "I am still learning how to use it. I was surprised that so many shows cost as much as they do. Guess I should expect to pay for a season of shows that I missed, but I am rationing my purchases because I still am on full satellite billing from DISH.", "verified": true, "helpfulness": "0/0", "author": "akboy"}, {"rating": 2.0, "review": "Worked ok, but is very slow. Even experienced some video lag. I returned it and got the Roku 3, which is amazing. Spend the extra and you wont have any issues.", "verified": true, "helpfulness": "3/4", "author": "MARK SLEPSKI"}, {"rating": 5.0, "review": "Great USB stick where you don't have access to a LAN wire but do have access to wireless.", "verified": true, "helpfulness": "0/0", "author": "Spartan"}, {"rating": 5.0, "review": "I use it on a small screen TV in my Gym room. It works very well.", "verified": true, "helpfulness": "0/0", "author": "amazon reader \"Eliad\""}, {"rating": 5.0, "review": "Roku, in my opinion, is the best streaming media device on the market and at a great price. I have the Roku 2 and the Roku streaming stick and there is no discernible difference. I use Roku to watch MLB, Netflix, Amazon Prime, HBO Plus, Vevo, Youtube, Hulu Plus, ESPN and Slingbox. The Roku stick allows you to cut back on your cable or satellite services. For services like HBO Plus, Slingbox and ESPN, you need either cable or satellite to use. The other services all you need is internet and a Roku. For anyone who is considering getting into a good streaming media device, a Roku streaming stick is your best bet. There is a remote control and full access to all of the apps that the full size Roku devices have. For those who are intimidated by any technology, this is for you. It is simple to set up and simple to use. I highly recommend this device.", "verified": true, "helpfulness": "1/1", "author": "Don"}, {"rating": 4.0, "review": "Have not used it much yet but the convenience is great.  I already have a roku unit on another t.v.and I want to use this one for mobile purposes between places so I expect the portability will work great.", "verified": true, "helpfulness": "0/0", "author": "Bluesboy \"Bluesboy\""}, {"rating": 3.0, "review": "Just doesn't compare to the Roku box. Its much slower than I expected, so much so, I got annoyed and returned it for the Roku 3 (which I love).Im an avid Apple fan and still prefer the Roku over the Apple TV. Each box has its place and demographic. The Roku offers way more channels than the Apple TV, including Amazon VOD, which the Apple TV doesn't have.The response of the UI is slow and laggy.The remote doesn't always respond since the stick is behind the TV. I will have to move around with the remote to get it to work, very annoying.", "verified": true, "helpfulness": "2/2", "author": "Orlando"}, {"rating": 5.0, "review": "Works great. Easy to set up and use and works as well at the Roku 3 using wireless. But I recently hard wired my Roku 3 to the Internet and now it is much faster. If you only have wireless the streaming stick works well.", "verified": true, "helpfulness": "0/0", "author": "Merv"}, {"rating": 2.0, "review": "I bought a Roku stick recently. It's easy to use and all but it's quite limited compared to Google's chromecastFor Netflix it's ok but if you want a more advanced device, go for Chromecast !", "verified": false, "helpfulness": "0/0", "author": "sel2mer"}, {"rating": 5.0, "review": "Easy set up. Plug and play!", "verified": true, "helpfulness": "0/0", "author": "BL"}]