[{"rating": 5.0, "review": "This is our 2nd one, for our second TV.  We are now officially on our way to cutting the cord from our cable provider, and only getting internet.", "verified": true, "helpfulness": "0/1", "author": "Michigan SEO \"Detroit Website Devel0per\""}, {"rating": 4.0, "review": "I would give it 5 stars, except for a few simple issues.The device is great.  Simple and easy access to netflix and amazon prime.I don't like how the unit has ZERO indication of a loss of wifi signal.  You just have to \"guess\" that the reason it's acting up is due to this.  Also, if left on for a few hours straight, it will overheat.  Requires a reset.If not for netflix and amazon prime access - the content you can get via roku is not worth the purchase price.  hopefully this will expand as time goes on.5 star concept - with a few lingering issues to work out.", "verified": true, "helpfulness": "1/1", "author": "David B. Bennett \"daburba\""}, {"rating": 4.0, "review": "Very easy to set up and use. Only thing is the remote freezes up sometimes. Recommend getting roku remote app for phone or mobile device....it is MUCH easier to use.", "verified": true, "helpfulness": "1/1", "author": "Mini Mouse"}, {"rating": 4.0, "review": "Works as advertised, easy setup, credit card required.", "verified": true, "helpfulness": "0/1", "author": "mlm"}, {"rating": 5.0, "review": "Works better than the older Roku I had, certainly the networking. The older version, they no longer sell at stores, every time unplugged, it forgot the network settings, really sucked. As I had to unplug the router, etc. to re-establish the network. This one, have unplugged many times, no problem at all! Much better.", "verified": true, "helpfulness": "2/2", "author": "Jon"}, {"rating": 3.0, "review": "Bought both a Roku stick and a Fire TV stick. The Roku stick is slow as shtanka.  Netflix takes close to 4 minutes to launch. The Fire stick is instantaneous. Plex on the Roku gives only one thumb in a series at a time. Fire TV shows a screenful with synopsis. No synopsis on the Roku. Roku search searches all services (but not Plex). Fire TV only searches Amazon Prime Video. Even so; Amazon for the win.", "verified": false, "helpfulness": "2/3", "author": "Michael Alessio \"Travel Addict\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "1/1", "author": "Art"}, {"rating": 5.0, "review": "I love it. I matched it with Hulu Plus and Amazon Prime. I still can't get Disney Jr., which is quite unfortunate. For the money for this and the two streaming subscriptions, it is fantastic!", "verified": true, "helpfulness": "1/1", "author": "Kristen"}, {"rating": 3.0, "review": "Does what is stated on the box but slow to boot up and offline when TV off, Roku 3 is the way to go.", "verified": true, "helpfulness": "0/1", "author": "MR K."}, {"rating": 4.0, "review": "Great product! Does what I hoped for, but it does lose its pairing with the remote and seems to need being reset about weekly.  It also goes through batteries unlike any remote I have ever had before. The technical glitches should be a priority to work out of this product by Roku for future models. I like that the streaming stick is small and is hidden from view with my unit hanging with a wall mounted application.", "verified": true, "helpfulness": "1/1", "author": "craigpierce"}]