[{"rating": 4.0, "review": "Great streaming device, the only thing that sucks is that I can't watch netflix on Mexico because the device doesn't got the app in any posible way", "verified": true, "helpfulness": "0/0", "author": "Paulo Hernández larracochea"}, {"rating": 5.0, "review": "If I could give this another 5 stars I would! We have an expensive cable plan and we barely use any of the channels. with this little guy we are streaming the Netflix and a lot of our 'On Demand' channels We are contemplating dropping the big cable package and just going with the ROKU Streaming. I was tasked with finding a way to do the Netflix streaming. We were tired of waiting for the discs and missing out on great shows just because they aren't available on discs. I started my sears with Amazon TV Fire stick and then quickly found the ROKU line of products. They were inexpensive so I thought I found the wrong thing. Nope They are exactly what we needed. and $45 (the Streaming Stick was $40 and the little USB power cord was $5) and a week later I was watching this Netflix's Bloodline! (Great show! BTW)  During set up it offered a wide variety of other channels and options for various programs. We have not explored all of that yet but I am so happy to of found such an inexpensive way of streaming. Life Is Good Today!", "verified": true, "helpfulness": "0/0", "author": "Rachel Burke"}, {"rating": 1.0, "review": "The only good thing about this is that setup was easy. Everything else is a waste. It is incredibly slow, freezes all of the time, and I think I got a faulty remote. Every 10-15 times I push the buttons, I have to remove the batteries because the remote dies. At least I figured out I can just pop the batteries out and put them back in after I went through four sets in the first week.", "verified": false, "helpfulness": "1/1", "author": "biddie"}, {"rating": 2.0, "review": "Not happy. I think we have a bad remote. Nearly every time I use it we have to fiddle with the batteries. Annoying!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it so far. Very easy installation and the main thing is that it works. I have a very good reception on my new TV without Tv being connected to the cable box.", "verified": true, "helpfulness": "0/0", "author": "Customer"}, {"rating": 3.0, "review": "Got it loved it but switched to Fire Stick because of connection and remote problems", "verified": false, "helpfulness": "0/0", "author": "Trevor Johnson"}, {"rating": 2.0, "review": "We love the apps, quick jump buttons, and all that.... It has been great, until about 5 months ago when we needed to start unplugging it to make it reset. It wasn't a big deal at first. But about 2 weeks ago, we started to have to do it almost every day. Today, it is now cutting out and the HDMI port keeps losing the signal. It is cutting out and the screen will go rainbow static, then white lines, then show, then .... well you get it. It has also stopped modulating the sound properly where as before there were no problems with quiet/loud.  I was hoping for a bit more longevity than 15 months. I don't think that is asking for too much. I don't know if we will replace with another Roku....", "verified": true, "helpfulness": "0/0", "author": "C. Spain-temple \"Teaching Mama\""}, {"rating": 5.0, "review": "love my roku- now I can watch more than what is just on the cable channels and do catch up on one that I missed", "verified": true, "helpfulness": "0/0", "author": "suzie"}, {"rating": 5.0, "review": "Netflix, Hulu, Amazon Prime and NASA TV and like 2500 Apps.", "verified": true, "helpfulness": "0/0", "author": "Scott St. John"}, {"rating": 5.0, "review": "Super", "verified": true, "helpfulness": "0/0", "author": "Alejandro Salazar Mora"}]