[{"rating": 5.0, "review": "Great addition to my already stellar Roku lineup.  Small and easy to install. Way better than a Chromecast with so much more features.  Costs a little more than one but definitely well worth it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Simple does not work. Cuts out after 10 min, takes forever to load home screen, reboots for no apparent reason, slow to respond to remote....if at all. I have two other Roku players and my suggestion is you avoid the stick.", "verified": true, "helpfulness": "0/0", "author": "Robert F Sheeran"}, {"rating": 5.0, "review": "This is a great option and WAY cheaper than getting a smart TV and has WAY more channels than a smart TV.", "verified": true, "helpfulness": "1/1", "author": "WAmom"}, {"rating": 4.0, "review": "Works very well for our needs. Streams Netflix,  prime, hbo go ect with no problems.  A little sluggish but it's not a big deal. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Mm622"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "majorway"}, {"rating": 2.0, "review": "I have 3 Roku boxes and bought this Roku stick. it worked fine at first, but i noticed it has really cheap connectors and hangs down under it's own weight. now 3 month later it does not work. i would definitely recommend buying the Roku 3 box not the stick. it's just a very flimsy design. I recommended the roku stick to a friend shortly after i bought it and his is broke too. Do not buy this unless you want to replace it in less than 3 months.", "verified": true, "helpfulness": "0/0", "author": "LM 123"}, {"rating": 5.0, "review": "So enjoyable, always something to watch, what ever your interest", "verified": true, "helpfulness": "0/0", "author": "Ashley Carlins"}, {"rating": 5.0, "review": "Great product! simple and easy to use.", "verified": false, "helpfulness": "0/0", "author": "Derek Lawson"}, {"rating": 5.0, "review": "Love this product", "verified": true, "helpfulness": "0/0", "author": "Richard Ward"}, {"rating": 2.0, "review": "A lot of content just doesn't work. Even plex from my own local storage (where my smart tv has no issue) is jerky.", "verified": true, "helpfulness": "0/0", "author": "Walter Klomp"}]