[{"rating": 4.0, "review": "This thing works as claimed.  The setup is easy, you just need an HDMI port and a free USB port. If you don't want to waste a USB port you can use the included power supply.  The HD picture quality, wireless link, and rf remote all are perfect - no problems whatsoever.  My only issue is that registration is required on the Roku website and a valid credit card is required to open an account there.  Now that my registration is completed I will go back to the Roku website and try to delete my credit card.  If I can't delete my credit card I will cancel my account.  If any of these actions results in my registration being canceled and my Roku not working I will be back with a one star rating.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Wharton"}, {"rating": 3.0, "review": "...not very easy to use and most channels are not free, thus a subscription is necessary. It is nowhere near similar others such as Apple TV or Netflix and more, but covers a relative range of channels, some for free but most by subscription.", "verified": true, "helpfulness": "0/1", "author": "Andre Neufeld \"Brazilian Neufeld\""}, {"rating": 5.0, "review": "Easy to setup, tons of contend. My kids love it. I going to buy 2 more unit to setup one in my bedroom and to my son room...", "verified": true, "helpfulness": "0/0", "author": "Arnoldo Figueroa"}, {"rating": 5.0, "review": "I am pleased with the stick. However, the set up was not as simple as stated. I would consider purchasing another stick or 2 with competitive pricing.", "verified": true, "helpfulness": "0/0", "author": "karen newsome"}, {"rating": 4.0, "review": "the stick is out of the way, no hockey puck or cords visible and even the power cord goes directly into the flat screen.  The only issue is search... it still uses a qwerty format making search time consuming and too intense; but definitely preferable to the hockey puck versions", "verified": true, "helpfulness": "0/0", "author": "K. Willliamson"}, {"rating": 5.0, "review": "definitely worth the money.  small, easily plugs into tv, and can stream channels.  has easy setup for navigation.  excellent product.", "verified": true, "helpfulness": "0/0", "author": "Robert Sohl"}, {"rating": 5.0, "review": "I had a first generation roku so I was unable to access some newer features. I decided to upgrade and am thrilled with the new display and content. I only wish the remote was purple too, since it is my favorite color.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Tell us about yourself!\""}, {"rating": 5.0, "review": "Easy to set-up, great to use. I bought it for travel and it has worked well, even with somewhat weak hotel WiFi. I am not saying that it works without WiFi or very poor WiFi but have used it very successfully in a wide variety of \"so-so\" hotel WiFi networks. Interface is dead simple, just like the \"full-size\" Roku boxes.", "verified": true, "helpfulness": "0/0", "author": "Winfield S Arnott"}, {"rating": 5.0, "review": "Worth the price.Wifi is strong enough to handle data rates upto 10Mb/sec but struggles beyond that.Overall good performance for the price.", "verified": true, "helpfulness": "0/0", "author": "Raj"}, {"rating": 2.0, "review": "The stick is very slow in booting up and responding.  Overall i think it is not worth even $10.  I will be selling mine.", "verified": true, "helpfulness": "0/1", "author": "Gregory A. Gagnon"}]