[{"rating": 2.0, "review": "A waste of money. Notr a good selection of movies to chose from.", "verified": true, "helpfulness": "0/0", "author": "Sarah Carter \"Sarahjanecarter\""}, {"rating": 1.0, "review": "Arrived fine but was never able to watch a channel for more than one minute. Reset wasn't an option since the screen went  back and doesnt come on at all now.", "verified": true, "helpfulness": "0/0", "author": "Snowedin"}, {"rating": 1.0, "review": "this is a horrible device don't buy one i'm returning this one as soon as I can for a full refund. It took one whole  day to figure out how to set it up which included router code as well as technical support from Roku  that was terrible and never worked, somebody else wanted wanted money to help turns out there is a problem between Roku and Netflex, I've tired of this bs what ever happened to plug and play Amazon shouldn't junk that doesn't work", "verified": true, "helpfulness": "0/0", "author": "reginald Goodman"}, {"rating": 1.0, "review": "it stoped working right after return window closed !", "verified": true, "helpfulness": "0/0", "author": "eroll"}, {"rating": 5.0, "review": "The refurbished Roku works as expected came with everything needed.  I am very happy with my purchase.  I have a Roku 3 as well and this seems to be just about a fast.  Only missing the remote headphone connection but for the price it is a worthy sacrifice.", "verified": true, "helpfulness": "0/0", "author": "Nathan P. Gobeli"}, {"rating": 1.0, "review": "I bought this Roku streaming stick and was pleased until about 15 minutes into the first use of it.  The stick works fine, but the remote just stops after a few minutes of use.  I had to remove and replace the batteries, and that was good for another five minutes of use.  Bought new batteries.  Same issue.  Called Roku tech support, and they offered to sell me another remote with a warranty and more tech support for $19.95.  That wasn't happening!  When they couldn't resolve the problem (after an hour of going through their scripts) from India, they suggested I contact the seller.  Amazon was so helpful and sent a replacement within two days.  Dang if the replacement didn't have the same problem!  The remotes on these things just don't work!  Roku tech support can't help.  Don't buy it.  I'm going back to my older Roku, which has never had a problem.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "We own two AppleTVs, Two Amazon TVs and an Amazon Firestick. Was interested in Roku due to large selection of channels available. Set up has been a nightmare. Roku website (which is required for registration) crashed multiple times while trying to register. The site only continued on when I used a Paypal account instead of a credit card for registration.  Once I selected my channels the Roku froze. Nothing will unfreeze it. Multiple resets attempts have not worked. Now the website will not work. Three hours into installation and am stuck. Setup for Apple and Amazon TV products was smooth. Shipping this back. Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "MarcM"}, {"rating": 1.0, "review": "I purchased this on June 21st, it has worked only one time since I bought it.  I have called Roku support 3 times to try to fix it.  I have a Roku 2 that has worked perfectly ever since I bought it over a year ago.  I should have spent an extra $20 for a decent device.Update: I have not received a response from Roku and Amazon will not let me return it.  Total waste of money.", "verified": true, "helpfulness": "0/0", "author": "k1313"}, {"rating": 2.0, "review": "Roku stick alone works fine, my issue is the remote, it only worked for a few days later it stopped working (drained batteries) put in new batteries and worked again for another day-two, tried new batteries didn't work, tried reseting as I found on a couple forums online and still not working, really bad quality on the remote.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Gamez"}, {"rating": 2.0, "review": "Remote control is terrible..... I had to return because remote control didn't work properly and I received new Roku unit and Still, I have to use my phone as the controller because of this.If I could I would return and get the Roku 3 which I have on a different TV. ......", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]