[{"rating": 4.0, "review": "Works great since the moment that I plugged it in. Easy set up and connecting it to my wifi. For all of the extra channels that I get with it for me it was the $15 more that it costs than Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 4.0, "review": "Roku stick works great! ......... If you have good wifi! It's not the roku sticks fault but it has a hard time connecting with my wifi! Other than that no complaints! Just wish I could use it more often. Also great delivery, and great price!", "verified": true, "helpfulness": "1/1", "author": "Kimy Patzy"}, {"rating": 5.0, "review": "i love it", "verified": false, "helpfulness": "1/1", "author": "David Chochla"}, {"rating": 4.0, "review": "What a great little device.  We used our Xbox for Netflix and Amazon Prime Movies.  The hard drive on our Xbox went out.  I was looking to find an alternative, My husband told me about this new Roku device that is small.  I read reviews and decided to purchase.  We placed this little HDMI stick to the back of our TV and followed the instructions.  Quality is good.  Amount of apps are great.  I've only found 2 irritating problems.  One is that I have to unplug the power every time I don't use the Roku.  It is the only way to turn off Roku.  The other irritating problem is that Roku interferes with our other wireless devices.  We have 3 computers.  Every time Roku is on, all 3 computers lose their wireless connection.", "verified": true, "helpfulness": "1/1", "author": "Lilliput"}, {"rating": 4.0, "review": "I really like this device. It runs smooth and there really isn't a whole lot of differences between it and the other units other than the removal of games which wasn't an issue for me. The big disappointment to me was the remote. Poor button placement seems like a small issue until you use it. The remote is also much larger than its counterparts, but that is due to the fact that for the stick remote uses RF frequency vs the other units which are IR remotes, so I get that. Overall it's a good buy", "verified": true, "helpfulness": "0/0", "author": "will"}, {"rating": 5.0, "review": "The unit works perfectly and is convenient as you can transfer from TV to another location with the convenience of a memory stick and no HDMI cables are necessary. The advertisement correctly describes the Stick.", "verified": true, "helpfulness": "1/1", "author": "Stanley Hollenbeck"}, {"rating": 5.0, "review": "I just purchased a Roku stick after trying the Google Chromecast. For roughly $15 extra dollars here's what you get:1. Over a thousand streaming channels organized into topics and easily assigned to your favorites list.2. A remote. After tapping around to get on, say, Netflix on Chromecast, you just hit a button on the Roku remote and there you are. Much easier to navigate.3. If you're a WWE fan, the WWE Network is enabled on Roku, not on Chromecast.4. The video presentation is much better on Roku, crisp, HD images, not always the case when you're casting from your Chromecast app to your TV.Bottom line, if all you want to do is stream something like Netflix or YouTube, then go with the Google Chromecast. However, if you want an idea of what the choices can be on a real streaming \"network,\" then go with the Roku. I'm glad I bought mine, the cable companies need to be VERY concerned!", "verified": true, "helpfulness": "2/2", "author": "Ed Williams"}, {"rating": 5.0, "review": "Got this for my dad. It works great and was very easy to set up and use. Definitely recommended.", "verified": false, "helpfulness": "1/1", "author": "Cherrificus \"Ayatollah of Rock n Rollah\""}, {"rating": 5.0, "review": "Only had this for one day and so far I am impressed.  Installation very simple, device very user friendly. Remote response time is great.", "verified": true, "helpfulness": "1/1", "author": "KaolinKuntry"}, {"rating": 5.0, "review": "I have the Roku 2 and bought one of these for my dad.  I would have bought it for myself but it didn't have an earphone jack.  I messed up and should have gotten this for myself and given my dad the roku 2.  I love my roku but the stick is so far the best.", "verified": true, "helpfulness": "0/0", "author": "Travis"}]