[{"rating": 5.0, "review": "THIS STREAMING STICK ,so far is great ,i can watch hulu and other channels with it constant rebooting and all over wi-fi.it's the future now ! they only draw back is the rest are paid prevew channels or subscription", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"WALKINGMAN\""}, {"rating": 4.0, "review": "I received two Roku Streaming Stick that I pre-order several weeks ago. The Roku stick must have power from an USB port or an AC outlet. I don't have a spare AC outlet behind my televisions so I put it into one of the USB ports. I installed one Roku stick in the large 70\" television in the living room and the other Roku stick in the smaller 42\" television in the other room. Both Roku units are plug into an USB port. The Roku stick plugs into a HDMI port. Because the USB ports on my television don't have power to them until the television is turned on, the Roku stick units will boot every time the televisions are turned on. That is a positive feature for me as I had to reboot the Roku 3 units every now and then. The Roku stick respond slowly to its' remote. The Roku 3 respond very quickly to its' remote. The video color on the television screen is just amazing. It looks a lot better that video from the Roku 3 unit. Both of the Roku Streaming Sticks performs great with the exception of the remote command slowness. Because of its' remote command lag, I gave it four starts, otherwise I would have given it five starts. Recommended.", "verified": true, "helpfulness": "0/0", "author": "Stephen Kovac Jr."}, {"rating": 2.0, "review": "I've had a Roku 3 for a few weeks while I waited for the Streaming Stick (which I ordered from Best Buy).  It arrived yesterday.  Setup was easy, though slow.  It took two tries to find my my wifi.  The stick updated its software and loaded my fav channels (I already had an account since I have a Roku 3).  That process took about 10-15 minutes.I fired up a TED.com video and, after a few minutes, it stopped to load/buffer.  A few minutes later, the same thing.  That is when I decided to keep the Roku 3 and spend the extra $50.  My wifi is 40Mkps and the router is 4 feet from my HDTV.In the Stick's favor, I would say it is small and unobtrusive.  The remote is OK but I use the iOS app.", "verified": false, "helpfulness": "2/3", "author": "Hot Guitar \"Hot Guitar\""}, {"rating": 5.0, "review": "i am enjoying the Stick very much, simple too work, many many choices, a very good price, and nothing is complicated, delivery was swift, and the packaging was very secure..", "verified": true, "helpfulness": "0/0", "author": "pap"}, {"rating": 5.0, "review": "This little stick does everything you would want a streaming box to do.  The price is less, the size is less, the content is amazing.  The remote works well.  You have access to everything on the Roku channel shop, setup is simple.  I can't say enough about this little device.  I do have a small warning, for those with a tv mounted on the wall and has HDMI ports in the back, this stick is a couple of inches long, and you may have the issue of it not fitting into the space like I did.  You can buy right angle adaptors to correct this issue, and they are rather inexpensive.", "verified": true, "helpfulness": "0/0", "author": "L. Drees \"word-a-holic\""}, {"rating": 5.0, "review": "Received the Roku and was very excited to get started.  I plugged the HDMI into the TV and the power chord into the wall.  The Roku powered right up and I began setting up.  Once everything was set, I was ready to roll.  I upgraded to the Roku streaming stick from an older PS3.  The quality is 100x better with the Roku.  HBO Go is in full HD and never blurry; MLB.tv is live and clear rather than blurry and 5-10 minutes delayed.Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Ryan M. Saucier \"ryansaucier\""}, {"rating": 4.0, "review": "I've owned a Roku 3 for over a year and have watched a ton of content on it. I needed an additional device for my family room, and the Streaming Stick was perfect for the job. It provides 99% of the functionality of the 3, but most importantly, the picture and sound quality are the same. Movies in full HD with 5.1 surround stream flawlessly even though this device is connected via WiFi as opposed to my 3 which is wired. I highly recommend this device to anyone looking to add low-cost, easy to set up, streaming to their media center.", "verified": false, "helpfulness": "1/1", "author": "Darin D."}, {"rating": 2.0, "review": "I already own both the Roku 2 and 3 and LOVE them both. The main difference between the two, in my opinion, is that the Roku 3 allows you to stream YouTube. I got excited when I saw that this Roku stick also streams YouTube, plus the reviews were good on it. So I ordered it and two days later I got the biggest disappointment ever! I'm giving it two stars for quick and easy setup and deducting three stars for lag, buffering, and black screen of death. I was trying to watch QVC on my Roku and this p.o.s. froze on me but the sound was still going and then the screen turned pitch black. I had to unplug it just to reset it. It's going back tomorrow and I'm ordering another Roku 3 for my lower level family room. Blah! Huge disappointment!!", "verified": true, "helpfulness": "0/1", "author": "yaya007"}, {"rating": 5.0, "review": "I ordered this in the end of March and I was waiting to use it for a few days before posting a review. For the price, number of channels and a remote for navigation it's extremely worth it. Much better than the Chromecast. Hands down.What takes time is setting up all your accounts on Hulu, Netflix, Amazon prime etc., The reason it takes so long is you have to select each letter using the joystick buttons on the Roku remote. I strongly suggest getting the Android/iPhone Roku App so you can get a QWERTY keyboard for navigation. It works pretty flawlessly and would save you the headache of typing long email ids/passwords.Another \"not so happy thing\" was it was unable to connect to my Plex server. My tablets were able to pick up the connection and stream but the roku would just never connect. Unfortunately, I think that is due to have a wifi apartment complex with no access to the router so there maybe some permission issues. I'm sure this has nothing to do with Roku, but if you don't have a personal router setup the plex server may not fire up even after manually typing in the IP address.Loading streaming channels like Netflix do take some time to load i.e., going from the splash screen to home screen/lists. It takes about 10-20 seconds. I'm on a 30+Mbps network so I think it's a bit slow if it takes that long.Overall, it's the best bang for your (50) buck(s)! I'd still give it 5 stars for the sheer upgrade in entertainment value.", "verified": true, "helpfulness": "2/2", "author": "Nupul"}, {"rating": 5.0, "review": "Really, this thing was easy to set up and use.  Love the assortment of channels.  I got rid of my DirectTV which was a money suck and used an OTA and this Roku.  I can get everything and much more.  Why go back?  Love the kids channels and sporting events.Cable and Satellite are money pits.  Cut the cord, get this and never look back.", "verified": true, "helpfulness": "1/1", "author": "mnpilot"}]