[{"rating": 5.0, "review": "Really great!", "verified": true, "helpfulness": "0/0", "author": "A. Nicol \"AWN\""}, {"rating": 5.0, "review": "Love my Roku. I get so  many movies I'm in heaven. It was easy to install and easy to operate", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Swanlady\""}, {"rating": 4.0, "review": "love it, but needs a strong signal from wireless router to work properly.  I needed to install an additional router in the room I wanted to use this in.  now it works great!", "verified": true, "helpfulness": "0/0", "author": "Bonnie M. Parks"}, {"rating": 4.0, "review": "The only thing I do not like : it starts too slow, the roku logo animation run for a minute,then you can see the app list", "verified": false, "helpfulness": "0/0", "author": "Qiu Ping"}, {"rating": 1.0, "review": "junk broke after a few times", "verified": true, "helpfulness": "0/0", "author": "Dan Surf \"hvac man\""}, {"rating": 5.0, "review": "Great value.  Convenient to throw in your travel bag to use in hotel rooms.", "verified": true, "helpfulness": "1/1", "author": "Charles Eglinton"}, {"rating": 1.0, "review": "DON'T WASTE YOUR MONEY!!!We have owned several Roku units, from the original device to the Roku 3.  All have functioned well.  The Roku Streaming Stick, however, is a defective device.  Both units we purchased are junk.  As many others have noted, the streaming stick repeatedly drops its signal.  When Roku tech assistance was contacted they insisted the problem was not with their device, despite the fact that our Roku 3 works fine when positioned in place of the streaming stick.I forwarded Roku tech support reviews of the streaming stick (reviews I wish I had read prior to purchases) which clearly noted this frequent signal drop problem.  Some reviews even mentioned contacting Roku and being told they were aware of the problem and would send a dongle which would solve the matter.  Further, reviewers were informed by Roku that they would supply dongles free of charge to customers who were experiencing this problem.Apparently you have to be a reviewer to receive such service as the only discernible interest Roku tech support had in the case of our non-functioning streaming sticks was to continually assign responsibility elsewhere.Why Roku would take this approach is beyond me.  You would think an inexpensive dongle is not as costly as the long-term damage this policy will do to their reputation and eventually to their bottom line.", "verified": false, "helpfulness": "12/12", "author": "SLS"}, {"rating": 2.0, "review": "It comes with a 90 day warranty from Roku. Great. Except that 30 days after the warranty expired, it stopped working correctly. It kept rebooting. I called Roku and got no help from their \"tech\" people. I had already done everything they told me to do before I even called them. Didn't help. After a very long time on the phone I was able to get them to send me a replacement. It just arrived today, and after setup, I discovered that to my surprise, it did not work. It did not work on either of my TV sets. It took another 90 minute call with Roku to get them to send me a replacement for the replacement, because they refused to admit that there was a problem with the device. It was someone else's fault, not theirs. I love Roku. I have an original device that still works, albeit  a lot slower than the newer ones, and it won't get all the channels in that the new ones do, but it works.  I expected better from this company, to be honest...", "verified": true, "helpfulness": "2/3", "author": "RonnieDog1973"}, {"rating": 2.0, "review": "If your TV has its HDMI ports close to the edge of the set, dont't  buy this. It will stick out past the edge of the TV, and will defeat the purpose of buying the Streaming Stick instead of a regular Roku box. Who wants to see a piece sticking out from the side of a TV?", "verified": true, "helpfulness": "0/1", "author": "suski35 \"suski35\""}, {"rating": 1.0, "review": "Have had a Roku XD for years. Works great.This stick can't seem to stay connected to the Wi-Fi, even though it's within 10 feet of the wireless router with only one wall between. Virtually every time I go to watch the Streaming Stick, it tells me I'm not connected and I have to run through its network setup procedure.It also took a very long time to set up initially, but that was only a one-time deal, so I can forgive it that.Went back to my aged Roku XD on the same input in the same location and it works fine.Bottom line, the streaming stick seems to have a poor antenna. Perhaps if you are in the same room as your Wi-Fi router, you'll get better results, but for me I'm looking elsewhere. Waste of $50.", "verified": true, "helpfulness": "0/0", "author": "Daniel A. Koblosh"}]