[{"rating": 5.0, "review": "If you cant afford the Roku 2 or 3, then this is your best option. Beware that just like any streaming device that is wireless, it will be slow, sometimes laggy and such. Thats why i would always recommend going with the wired Roku 2 or 3 (the extra processing power inside helps too).As for deciding between Roku, Apple, Amazon and just about every company jumping into this, would recommend Roku. Great interface, easy controls and no issues", "verified": true, "helpfulness": "0/0", "author": "MJK \"mikeklement.com\""}, {"rating": 5.0, "review": "LOVE IT !!!! I CAN EVEN CONNECT TO MY TIME WARNER ACCOUNT AND WATCH MY SHOWS WHEN THEY ARE AIRED. I CAN ALSO MIRROR MY SAMSUNG GALXY MOVIES FROM SHOWBOX TO MY ROKU. LOVE IT LOVE IT ! MUCH BETTER THAN CHROMECAST AND ITS DUAL BAND !!!!", "verified": true, "helpfulness": "0/0", "author": "LaurenJulie"}, {"rating": 5.0, "review": "Roku stick  was very easy  to install. as well  is very simple to  access  my amazon streaming.", "verified": true, "helpfulness": "0/0", "author": "Maristela"}, {"rating": 2.0, "review": "I was so excited when I first got my roku streaming stick. I worked great up until a week ago. My channels started getting error codes and it resets ALL the time. I wish I would have saved my money and stuck with my Google Chromecast. customer Service is great but they weren't able to resolve my issue with it restarting all the time. And of course I can't return it to Amazon. Roku wants to charge me additional money to cover customer support. So frustrated.", "verified": true, "helpfulness": "0/0", "author": "Sheri C"}, {"rating": 5.0, "review": "Superb product!  Wouldn't use anything else!", "verified": true, "helpfulness": "0/0", "author": "Gordon's Books & Mags"}, {"rating": 5.0, "review": "Works awesome it's now movie nite at my house every night", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it great", "verified": true, "helpfulness": "0/0", "author": "Kyle Waggonwe"}, {"rating": 5.0, "review": "I don't know how we ever lived without this thing!!! So many apps, even crucial ones like Netflix, Hulu, Amazon Prime, Google Play Movies & TV, and so much more. Radio stations, lots of different app categories... use it every day; even if it's just to listen to the radio!", "verified": true, "helpfulness": "0/0", "author": "MindyChelle"}, {"rating": 5.0, "review": "LOVE IT . PORTABLE - great gift too for anyone who doesn't have a Smart TV. You can take it when you travel and is super easy to use", "verified": true, "helpfulness": "0/0", "author": "Raquel Hirsch"}, {"rating": 5.0, "review": "Excellent, so easy to use, and so adaptable for our needs.", "verified": true, "helpfulness": "0/0", "author": "Kendra Deans"}]