[{"rating": 5.0, "review": "love it. Does everything is says it would do. compact and easy to set up and easy to use. great buy.", "verified": true, "helpfulness": "0/0", "author": "Deric"}, {"rating": 5.0, "review": "I needed a 2nd ROKU and this product has meet my needs 100%...  Provides the same functionality as my ROKU3 except for headset jack that I didn't need anyway.  In my opinion, it blows the Chromcast away.", "verified": true, "helpfulness": "0/0", "author": "Doug Henning"}, {"rating": 3.0, "review": "We have a Roku 3 and the stick. The Roku 3 is by far the faster and holds twice the content. But remember using 2 Roku's at the same time also doubles the bandwidth used.", "verified": true, "helpfulness": "0/0", "author": "raymond wayne rector"}, {"rating": 5.0, "review": "with the help of Amazon free tech support was able to install in a few minutes and it has worked perfectly. Best purchase we've made in a long time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was expecting something slow due to its price and size... I was pleasantly surprised. The boot up takes time but once it's active the device is very responsive.", "verified": true, "helpfulness": "0/0", "author": "Shane Johnson"}, {"rating": 5.0, "review": "Well, maybe only regret I have is not purchasing the Roku sooner.  I watch movies every night and cannot think of a more cost effective way to do so.  By minimizing my contribution to my local cable company, I am able to spend more money on my family while saving more at the same time.Keep it plugged into a wall outlet as opposed to plugging into the TVs USB input so that there is not boot time and the Roku is ready to watch as soon as you turn on the TV.  Otherwise, with it plugged into the USB port of the TV, you need to wait 3-4 minutes each time you turn on the TV for the Roku to boot up.  It consumes very little power so leaving it plugged into the wall should not be noticeable on the power bill.The free channels need a little better content and quality but overall it's a great investment.", "verified": true, "helpfulness": "0/0", "author": "Benjamin \"Benjamin\""}, {"rating": 1.0, "review": "To me it's an OK product, if you dont have a smart TV then it good, else it just wAist of $$", "verified": true, "helpfulness": "0/3", "author": "Le Hoan"}, {"rating": 5.0, "review": "I bought this unit so I could stop using my BluRay player as my \"smart TV\".My player would lag terribly and I wasn't sure if it was my internet connection or not. After buying this, it was clearly the BluRay player that was not meant to stream movies. I've experienced no lag or connection drops at all!! AND I love using the iPhone app! I use that because the keyboard is easier to type with than the remote control. So much easier typing passwords or searching for movies/actors.", "verified": true, "helpfulness": "0/0", "author": "Judeebug"}, {"rating": 5.0, "review": "With a $50 Roku Stick you no longer need cable.  Full 1080p HDTV resolution, support for separate Netflix profiles and lots of free channels with programs from cable stations.  Supports Amazon Prime Streaming Video, unlike Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Thomas Adams"}, {"rating": 5.0, "review": "Got it a few weeks ago but waited to make sure I was happy with its performance.  This is awesome!  Like it much more than the boxes.  Setup was a breeze and streaming was flawless.  I plan on changing out the box in the family room next......and for those who have a smart tv with the yahoo app thing you are gonna want one of these! ( those tv's are really not so smart) Then you can get all the channels you want not the ones they think you  want. Did I say I love the small size...can't see it and takes up no space the remote is a plus!", "verified": true, "helpfulness": "0/0", "author": "Marie"}]