[{"rating": 5.0, "review": "good sale price, no problem in the set up", "verified": true, "helpfulness": "0/0", "author": "lois"}, {"rating": 5.0, "review": "Love it.  The streaming stick came quickly and it great shape.  Easy to hook up and now able to enjoy Netflix and Amazon in the family room.", "verified": true, "helpfulness": "0/0", "author": "Joyce McGarry"}, {"rating": 5.0, "review": "Pretty easy to install and brings in  a good picture.  As a member of Prime, I can get a number of movies at no charge which is great.  I like that I can also get old episodes of tv programs.  It is great when there is nothing on tv you want to watch.", "verified": true, "helpfulness": "0/1", "author": "Net shopper"}, {"rating": 2.0, "review": "THIS PRODUCT WAS NOT GOOD AT ALL. i SENT IT BACK BECAUSE THE SHOWS KEPT FLASHING AND ALSO YOU COULD NOT HEAR THE VOLUME ON SOME PLAYBACKS.", "verified": true, "helpfulness": "0/1", "author": "TatorTot"}, {"rating": 1.0, "review": "The USB version is not worth it, get a regular Roku! It has to be plugged in a jack the entire time. This USB version gets bad reception compared to the other Roku boxes that we currently use and love.", "verified": true, "helpfulness": "0/1", "author": "Dena Mayo"}, {"rating": 5.0, "review": "I have had the ROKU 2 and ROKU 3.  This is very comparable to a ROKU 2.  It is a little slower than the ROKU 3, but works just fine without the added bulk of a box.  Highly recommended as an alternative to the ROKU 3 and ROKU 2", "verified": true, "helpfulness": "0/0", "author": "Patrick Fish"}, {"rating": 5.0, "review": "I love this product, I recommend it 100 %", "verified": true, "helpfulness": "0/1", "author": "Paola"}, {"rating": 3.0, "review": "The only thing keeping me from giving this five stars is the fact that you can't join it to hotel WiFi.  Most hotel WiFis require you to sign in and there is no browser capability to support that.  As someone who travels a lot, they could have made this device10 times better by including that functionality.", "verified": true, "helpfulness": "2/2", "author": "Scott B"}, {"rating": 5.0, "review": "love this thing.  plugged into wall for 4 days of heavy use and not getting hot at all... no issues!  Strongly recommend.", "verified": true, "helpfulness": "0/0", "author": "Stephanie L. Boyd"}, {"rating": 2.0, "review": "Can't use my netflix account in Colombia because Roku's limitations instead Netflix's limits.The support team respond ¨We would like to inform you that currently Roku is marketed only in US, UK, Canada and Ireland. Although most channels may work outside the above countries, premium channels like Netflix, Amazon, Hulu plus and others currently may restrict access from geographies outside¨", "verified": true, "helpfulness": "1/1", "author": "Luis Villegas R."}]