[{"rating": 5.0, "review": "Roku arrived on time packing perfect on this refurbished item. Set up was quick unit updated itself movies up and running.", "verified": true, "helpfulness": "0/0", "author": "GK"}, {"rating": 5.0, "review": "This streaming stick works great I got this for my sons tv it would not fit I had to give him my roku LT  And I took the streaming stick so just be sure you have plenty of room at your tv's hdmi input because the streaming stick is so long some brands of tv's it will not fit a 19'' element from walmart but it will fit a 22'' tv  The streaming stick needs a good 4 inches of clearance in front of the hdmi port.  But other than that I love it I use it everyday it can be powered by your tv or u can plug it in the wall outlet  I stream netflix and youtube. Thanks", "verified": true, "helpfulness": "0/0", "author": "Curtis Robinett"}, {"rating": 5.0, "review": "Amazing! This was indeed worth the prize.", "verified": true, "helpfulness": "1/1", "author": "Samuel Ameyaw"}, {"rating": 2.0, "review": "I live in Mexico and this device can not be used hereI can only access youtube because the roku service it is not availableI am selling it to recover my moneyI recommend the apple TV better as this work in mexicoprobably for USA is OK, but here, it is a waste of money", "verified": true, "helpfulness": "0/0", "author": "Arturo Sobreyra"}, {"rating": 5.0, "review": "I bought this because the fire stick was unavailable. It's fantastic! It's so small it hides behind the tv.  No cords, no little black box to rest anywhere. We have a wii that we were getting Netflix, Hulu, and Amazon Prime through. I had no idea what we were missing. I bought a DVD through amazon that included a digital version on UV through Flixster. Flixster is a channel on Roku, so now the movie is available on my tv WITHOUT A DVD PLAYER! I love it!! I will probably buy an Amazon Fire Stick for my other TV, so I can have one of each.", "verified": true, "helpfulness": "1/1", "author": "Terra"}, {"rating": 5.0, "review": "Very pleased with this product.", "verified": true, "helpfulness": "0/0", "author": "Chay B \"Generous in Spirit\""}, {"rating": 1.0, "review": "Got a Roku Player for my parents a few years ago and it always worked well.  Got the streaming stick for the tv in their bedroom and never could even get it connected to the wireless network.  Support at Roku gave me some BS reason about wireless interference from our neighbors (my parents closest neighbor is over 1000 feet away) and of course just tried to blame the wireless router (even though wireless was currently connected successfully to both my phone and laptop).  Not happy with this product.  If you go with Roku, just stick with the boxes.", "verified": true, "helpfulness": "0/0", "author": "A. Brown"}, {"rating": 5.0, "review": "So convenient and portable. We took this with us during a recent trip and while the Direct TV at the mountain cabin where we spent the holidays repeatedly dropped off, the Roku stick saved the day(s).", "verified": true, "helpfulness": "0/0", "author": "W. P. \"Otter Pilot\""}, {"rating": 1.0, "review": "I bought it and took it to Argentina. Netflix, Blockbuster and Amazon Video are blocked. Just youtube and a few custom channels work.I wrote to support about a week ago and nobody replied. Bad product and bad service support.", "verified": true, "helpfulness": "0/0", "author": "Pablo V."}, {"rating": 5.0, "review": "Does what its supposed to do. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Felicia Wright"}]