[{"rating": 3.0, "review": "it works for what it is intended, good for on the go, but sooooooooo slowwwwwww. If your on a budget its fine but if you have the money go for a groupon.com or woot.com special on the roku 2 or 3. I have this in the guest bedroom and they are appreciative when they want to watch tv.", "verified": true, "helpfulness": "0/0", "author": "Ca scott"}, {"rating": 5.0, "review": "Product was received in a timely manner and it looked brand new. Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Mike M."}, {"rating": 5.0, "review": "Great Product. Im very satisfied", "verified": true, "helpfulness": "0/0", "author": "fabricio di bartolomeo"}, {"rating": 5.0, "review": "WORKS GREAT, I HAVE BEEN WATCHING NET FLIX EVERY DAY SINCE.  I SHOPPED EVERYWHERE AND FOUND THE BEST DEAL AT AMAZON.  YES, I LOVE AMAZON", "verified": true, "helpfulness": "0/0", "author": "Doris L. Robinson"}, {"rating": 5.0, "review": "Delivered promptly and condition was as described. Thank you. Best device ever. Love this. Very simple to set up.", "verified": true, "helpfulness": "0/0", "author": "tarav"}, {"rating": 5.0, "review": "Easy to install and set up was a breeze! - I will likely be purchasing a second in the near future.", "verified": true, "helpfulness": "0/0", "author": "Nykademus1"}, {"rating": 5.0, "review": "Item worked but make sure you can use it in a hotel.  It requires access to the hotels network", "verified": true, "helpfulness": "0/0", "author": "Yalonda D Walker"}, {"rating": 4.0, "review": "Love love love getting away from expensive cable! Easy install and set up that includes the app for my smart phone. Tons of choices. Only negative is the finicky remote. I've had it freeze many times and the reset process using/calling Roku customer service is...frustrating...to say the least. I use my smart phone as the remote when the one provided goes wonky.", "verified": true, "helpfulness": "0/0", "author": "S.K.Gray"}, {"rating": 5.0, "review": "Received in 2 days. This is my 4th Roku and it couldn't have been any easier to set up. It works perfectly and I think I like it better than my other Roku's, you don't have to be careful where you aim it.", "verified": true, "helpfulness": "0/0", "author": "L. Denson"}, {"rating": 4.0, "review": "I have a Roku 3, which was the first Roku I purchased. It revolutionized my TV watching experience, and I would buy it again and again. I still use the Roku on our big TV in the family room. However we got a wall-mounted TV in the bedroom, and I decided to go with the stick to reduce clutter.The layout and overall feel of the Roku stick is the same as the Roku 3. However, if you want to have it be plug-free as I did, then you have to plug the power source into the USB of the TV. This means that when you turn on the TV, you have to wait for the Roku to boot up too. This takes maybe 60 seconds. A minor complaint.However the Roku stick is much slower than the Roku 3. It will take a few clicks on the remote before it actually registers, and screens take longer to load. I also feel like the shows occasionally stop and show the loading percentage, which does not happen on the Roku 3.The stick also does not have the headphone jack in the remote, which is a feature I use heavily on the Roku 3 as I work night shift and my boyfriend does not, so when I am up and about I can watch TV without bothering him. However we didn't really need this feature in the bedroom so that didn't matter too much.Overall, it works fine for a TV that we use less often, however if you were going to use this as your main device I would recommend the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "K.A.S."}]