[{"rating": 3.0, "review": "goes through battery's every week! works ok but not great. i think the battery life should be a little longer wouldn't you think. but it does the job", "verified": true, "helpfulness": "0/0", "author": "Kevin Dunning"}, {"rating": 3.0, "review": "I was initially going to purchase the Fire stick, but after watching the wait-time go from first 1-month to 2-months, I decided to go with the Roku and get it now. I may feel that this gets a 4-star rating after today; right now the pain of spending my entire evening trying to get it set up and working is still fresh, so 3 stars. From the reviews, I don't seem to be the only one who had a bit of a tricky experience getting it up and running. My router is good and it was connecting to my network and the Internet right from the start, but the device did not want to download the software from Roku despite four attempts. I got on the phone with Roku and within 20 minutes or so it was downloaded and working. I watched for about an hour, then discovered I couldn't see my Netflix \"list\" from the TV. I shut everything off and rebooted several times and finally got this working. Then the audio stopped. To be fair, I'm not sure if this was the TV or the Roku device. Again, I tried redoing all the audio settings both from the Roku system menu and my TV, rebooted, no luck. Repeated all these steps 3 times with no luck. At this point, I was having to strongly resist the urge to put my foot through the screen and/or throw the whole setup off the balcony. I finally unplugged EVERYTHING--router, TV, Roku device--then I reset the TV to the factory settings, then I rebooted each device yet again. Finally I seem to have audio again. Keeping my fingers crossed that I'm done with tech trouble-shooting. I swear everything has been rebooted at least a dozen times this evening. Now that the device is working, I'm fairly satisfied. It's not the quickest device I've used, but for the money (I didn't have much to spend), it's fine. There can sometimes be a slight delay when you hit the remote, but not terrible. If the device has a good life with little (or hopefully no) fuss, I could give it 4 stars.", "verified": true, "helpfulness": "0/0", "author": "Lori C."}, {"rating": 1.0, "review": "Arrived on time. Will be returning this as the remote quit working  during setup !", "verified": true, "helpfulness": "0/0", "author": "Carol G."}, {"rating": 3.0, "review": "The stick works fine but the power cord was garbage. I had to purchase another cord for it to work, so what I thought I was going to save I actually ended up spending more for one that was re-manufactured then I would have for a brand new one. So buyer beware", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "Love our Roku  streams all the channels we used to get on cable. I got Netflix and Hulu plus and after adding those I am still paying 50.00 less a month. Dropped ours to basis so I could still get espn and foxnow.My Daughter loves Hulu plus watches anime and all her favorite shows.", "verified": true, "helpfulness": "0/0", "author": "James E."}, {"rating": 5.0, "review": "This item coming with the usb connector?", "verified": false, "helpfulness": "0/1", "author": "Adrian Ruiz"}, {"rating": 4.0, "review": "Good to have. Love it.", "verified": true, "helpfulness": "0/0", "author": "Onika Harvey"}, {"rating": 5.0, "review": "Works Great! Love it!", "verified": true, "helpfulness": "0/0", "author": "S. Whitlow"}, {"rating": 5.0, "review": "Works just fine and it's a great value.", "verified": true, "helpfulness": "0/0", "author": "K. R. Mudgeon \"Kerr Mudgeon\""}, {"rating": 1.0, "review": "Didn't work with my comcast router. Big mistake with what's supposed to be a universal device.", "verified": true, "helpfulness": "0/0", "author": "Marian"}]