[{"rating": 1.0, "review": "Worthless piece of c**p. Whenever I try to turn it on, it says  don't have a connection or that my password is incorrect. Yet, I can connect on my laptop in the same room and my Blu-Ray has no problem going right to Netflix. I know my connection is strong enough and my password IS correct. I used their customer service when I had their minimal warranty and the suggestion is to disconnect it for 20-30 seconds, then try again. Now even that isn't working and I can't get connected at all. Stay away from this junk and get one of the other devices.", "verified": false, "helpfulness": "0/0", "author": "Carol Bailey"}, {"rating": 5.0, "review": "Love it.  I didn't expect it to perform this well.  I have an older Roku and this worked Streaming Stick works perfectly; even better than my original Roku.  It was easy to set up. It's faster and very responsive.  I love that I can plug the power into the USB port on the back of the TV.", "verified": true, "helpfulness": "0/0", "author": "Dennis Barker"}, {"rating": 2.0, "review": "The graphics are really bad, and the worst part is... Netflix is only available on US and Canada, so it is useless for me.", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Gelos"}, {"rating": 5.0, "review": "Put this in my kids play room, worked like a charm. They love it. Setup was a snap, had it up and running in less than 20 minutes.", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 5.0, "review": "great item. works very well.", "verified": true, "helpfulness": "0/0", "author": "kenneth knittel"}, {"rating": 5.0, "review": "It's awesome.  I was a little aggravated at first because i had it plugged in with the USB to my TV.  So when i turned off my television the Roku stick would have to reboot every time i turned off the tv.  And the power cord was too short to reach the outlet.  So - i got a cheap little extension cord and it's worked out perfect since.  The interface is wonderful.  The remote is very user friendly.  Although i do agree with a previous review about adding the Blockbuster 'hot key' to the remote.  That's pretty much useless to me.  Why not Vudu?Regardless - it's a great buy at a great price.", "verified": true, "helpfulness": "0/0", "author": "Laura L. Howell \"gadget geek\""}, {"rating": 2.0, "review": "It functions fine, not being able to access itunes is disappointing. I was attracted by it's size and price. Purchased the Roku Stick for travel so I could access my Netflix, Hulu and other accounts when staying in a hotel. Trying it out on a trip last week, was able to switch the input on the TV to HDMI, and while the Roku stick did connect to the hotel WiFi and displayed the channel icons, it would NOT allow access to any of the accounts. Calling tech support was told that the Roku stick will only operate on a secure wireless network and that hotels have an open network and it will not work on them.For standard home use, I've had an Apple TV box for years and would recommend it over Roku. Spoke with Apple support when I returned home and was told of two ways an Apple TV box would most likely work in the hotel situation described above.  Looks like another Apple TV box in my future.", "verified": true, "helpfulness": "0/0", "author": "David Whitaker Sound Desgin"}, {"rating": 3.0, "review": "It's great to be able to have it plugged in unassumingly behind the TV.  I was initially under the impression that it was powered by the HDMI port. Unfortunately, it uses a bighead plug.  That's not really a big deal unless the outlet you have your TV plugged in is already full and/or the next closest outlet is too far away.  In such case, it's getter to go with a box unit with a long HDMI cable.  That way you can place the box closer to an available plug and not have to move your TV to a new location.We have been having an issue with the remote not working a lot.  We have to take one of the batteries out then put it back in to \"wake up\" the remote if it's been sitting for more than a few minutes.  That's very annoying and impractical if you like to watch TV in bed at night.  Thank goodness for the Roku remote app!This is our third Roku device in our home.  It came bundled with a router, but we were going to buy one anyway to use when we go on vacations.  This will be a nice little space saver versus having to take along one of the box units with an HDMI cable like we've been doing.  Would I recommend this to a friend?  Only for travel/portability reasons.  For a unit that will remain in the house attached to the same TV all the time, I'd recommend a box instead.", "verified": true, "helpfulness": "0/0", "author": "D. Taylor"}, {"rating": 5.0, "review": "Installed quickly in the HDMI slot on back of TV. Still learning all the channels but impressed with all the programs.", "verified": true, "helpfulness": "0/0", "author": "IndianaPaul"}, {"rating": 5.0, "review": "Just love Roku", "verified": true, "helpfulness": "0/0", "author": "Bruno LoPresti"}]