[{"rating": 3.0, "review": "Very easy to hook up and use.  It works fabulously as well.  The reason for 3 stars is the credit card requirement.  There is no reason for it at all, and it's unacceptably intrusive, IMO.", "verified": true, "helpfulness": "0/0", "author": "gsdlady"}, {"rating": 5.0, "review": "Excellant", "verified": true, "helpfulness": "0/0", "author": "joseph r ribikowski"}, {"rating": 5.0, "review": "Bought for MIL. She loves it and thinks it is great! Said it was very easy to set up and works exactly as it should.", "verified": true, "helpfulness": "0/0", "author": "Cierra Mercer"}, {"rating": 3.0, "review": "NOT AS GOOD AS FIRE STICK", "verified": true, "helpfulness": "0/0", "author": "ASE1950"}, {"rating": 3.0, "review": "A bit slower in navigating compared to the MHL edition. Still a great addition to your entertainment arsenal.", "verified": true, "helpfulness": "0/0", "author": "Shon lantych"}, {"rating": 5.0, "review": "Took my Roku on vacation t the Caribbean and was able to catch up on all my Amazon Prime favorites during the rainy days. I was really glad to have it!", "verified": true, "helpfulness": "0/0", "author": "RR NYC"}, {"rating": 1.0, "review": "I have two other Roku, both Roku 2, great products, the stick was terrible, inconsistent, very slow, and wound freeze  up when trying to open a show.  I returned the product", "verified": true, "helpfulness": "0/0", "author": "ABear"}, {"rating": 5.0, "review": "I love roku devices. I had to order an internet device for my new non-smart TV, and Roku was an obvious choice.", "verified": true, "helpfulness": "0/0", "author": "duggym122"}, {"rating": 5.0, "review": "Fantastic product!  Super-easy to install!  I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "CCG \"CCG\""}, {"rating": 5.0, "review": "This is my second Roku.  The more I use it the more I love it.  No more searching for something interesting on TV.", "verified": true, "helpfulness": "0/0", "author": "LC Newberry"}]