[{"rating": 4.0, "review": "Very easy to set up...using the android app to control as my audio receiver is upstairs...works great", "verified": true, "helpfulness": "0/0", "author": "Jeff johnson"}, {"rating": 5.0, "review": "Love this stick, just plugs into the tv no need to plug in and/or have another box sitting in front of my TV. Highly recommend!!", "verified": true, "helpfulness": "0/0", "author": "Kristen DeMay"}, {"rating": 5.0, "review": "This has been a great investment,  we love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Ron Britton"}, {"rating": 1.0, "review": "It caught my hdmi port on fire! Not happy at all!", "verified": true, "helpfulness": "0/0", "author": "Brien Duncan"}, {"rating": 5.0, "review": "Makes your TV smarter than the smartest Smart RV", "verified": true, "helpfulness": "0/0", "author": "Ron Jackson"}, {"rating": 5.0, "review": "Bought it for the TV in the spare bed room. I have Uverse and did not want to get another converter box. My guests are happy just watching all the many programs they can receive on this. Totally cable disconnect.", "verified": true, "helpfulness": "0/0", "author": "DaHunk"}, {"rating": 5.0, "review": "I wish I hadn't put off buying this for so long.It took about 3 minutes to set up and start watching.The only thing that takes time is looking through the menu to see what channels and movies and shows are listed. You can watch from the pilot episodes or see ones you missed,", "verified": true, "helpfulness": "0/0", "author": "Shannon Johnson"}, {"rating": 4.0, "review": "My wife and I recently cut our cable, and we don't miss it at all thanks to this device.  Installation was VERY trying, as it would not connect to our Wi-Fi.  As it turns out, if you have Comcast High Speed Internet, the security protocol used on the router by default would not let the Roku connect to it.  You would have to configure your modem by going to  http://10.0.0.1 and go to Connection/Wi-Fi and edit your connection settings.  I changed my security protocol to \"WPAPSK-TKIP\" and it works fine now.  This took hours to figure out on my own, so Roku, you lose one star for my trouble.  Also, every other wireless device in our house had to be reconnected, but it works wonderfully in both of our HDMI TV's and looks much better than it does through the Nintendo Wii.", "verified": true, "helpfulness": "0/0", "author": "gargamel314"}, {"rating": 5.0, "review": "Fast shipping and I love this thing. Tons of apps and movies forForrest if you have a WiFi connection", "verified": true, "helpfulness": "0/0", "author": "AAA+++"}, {"rating": 3.0, "review": "This does what we wanted it to, get movies from Amazon and Netflix, so I guess that is a plus.  We have our TV mounted on the wall so we bought this thinking it was wireless (no cords at all, guess we should have researched more).  The electrical plug in for this unit sticks out from the wall approx 3 inches so make sure you have enough clearance if you plan on plugging in behind the TV.  Cord is not very long, so I have to use an extension cord to plug the unit in, something I don't like since I have small grandchildren.", "verified": false, "helpfulness": "0/0", "author": "Paula Burris"}]