[{"rating": 5.0, "review": "Showed up quickly, looks like new, even in a new box. I had purchased this as a Remanufactured item, I'm impressed.  Unfortunately I haven't been able to try it.  The HDMI ports on my TV won't except the Roku Streaming Stick because of its size. The HDMI ports on my TV are in an indented area, which is to short for the Rokus length.  I've had to order a short HDMI extension cable, standard HDMI cable doesn't have a female end. Hopefully it'll work when that shows up.After I received my HDMI extension I was able to use the Roku Streaming Stick. It worked great. I had purchase this as a replacement of an much older Roku, I think it's their original. It was still working great, just won't do YouTubes Videos. One thing I hadn't considered about the Streaming Stick, there's no Audio outputs. I do like to stream Pandora thru my Boise Radio, I guess I have to keep the old Roku to do that.", "verified": true, "helpfulness": "0/0", "author": "Grumpytoo"}, {"rating": 5.0, "review": "So far I've had no issues with this product. It was delivered on time. Well packaged.  Installation was easy. And so far is working great.", "verified": true, "helpfulness": "0/0", "author": "DBrown"}, {"rating": 4.0, "review": "Highly recommended! I'm satisfied how it performs. Easy to operate and install.", "verified": true, "helpfulness": "0/0", "author": "jc"}, {"rating": 3.0, "review": "Have to keep unplugged when not in use cause it seems to get really warm.", "verified": true, "helpfulness": "0/0", "author": "Keith Johnson"}, {"rating": 5.0, "review": "best invention ever... so long cable...", "verified": true, "helpfulness": "0/0", "author": "Heather Wolverton"}, {"rating": 5.0, "review": "Works perfectly. Great value. No problems - just plug and play.", "verified": true, "helpfulness": "0/0", "author": "Gene Quist \"Habu\""}, {"rating": 4.0, "review": "Stick is great and much better than the earlier versions of Roku.  The only Roku product that I would say I prefer over the Streaming Stick is Roku 3.  I have both the straming stick and Roku 3 now and both are fast and work nearly flawlessly.  Occasionally I have to unplug my Streaming Stick and occasionally it doesn't pick up my weak wifi as good in the far bedroom, but it is a great value and I am overall very impressed with this product", "verified": true, "helpfulness": "0/0", "author": "abfarris"}, {"rating": 4.0, "review": "An excellent way to turn your regular TV into a smart TV without any extra bulky equipment or cables clogging up the place.  I put it in to HDMI port in the back of my TV and it is completely invisible.  If you are considering purchasing this I have several recommendations.  If your TV is on the wall you may need to purchase a 90 or 270 degree HDMI adaptor so this will point up or down rather than stick straight back since there is probable not enough room behind your TV if it is on the wall.  These only cost a couple of bucks and can be purchased on Amazon.  Also the power cable it comes with must be plugged into a 120V outlet, so if you really want no additional wire runs you need to purchase the adaptor to allow this to plug into a USB port on your TV.  These items together will run you only about $10 and are well worth it.", "verified": true, "helpfulness": "0/0", "author": "John M."}, {"rating": 1.0, "review": "Bought this for my dad for Christmas and it freezes all the time. Rarely works. Disappointed. Christmas it ruined :( .. We tried everything to get it to work. Our connections were great to the internet, just the way the Roku is built, sucks.", "verified": true, "helpfulness": "0/0", "author": "Joey"}, {"rating": 1.0, "review": "The biggest piece of garbage I have ever purchased. In the amount of time it takes to load a movie you could go to the video store, rent a DVDs, and then get a pizza. Worse $$$ I have ever spent.", "verified": false, "helpfulness": "0/0", "author": "J. Pohl \"electro geek\""}]