[{"rating": 3.0, "review": "Wasn't aware that it would only work if wifi was no more than 20 feet from unit.  Now need a wifi extender but worried that may not be the trick.", "verified": true, "helpfulness": "0/0", "author": "Joseph Bianco"}, {"rating": 5.0, "review": "Very pleased with product.", "verified": false, "helpfulness": "0/0", "author": "Michelle Fontenot"}, {"rating": 5.0, "review": "All my old  and some new programs I can watch at a much reasonable price.  Who needs cable !", "verified": true, "helpfulness": "0/0", "author": "Brwnsgr"}, {"rating": 4.0, "review": "would get a 5 star but in the contents it doesnt say anything about the power cable, so i bought the power supply that was usually purchased with the roku stick. Well come to find out... you dont need it. got screwed by the contents page. as for the roku stick itself, its awesome. no problems with it at all.", "verified": true, "helpfulness": "0/0", "author": "Ron M."}, {"rating": 5.0, "review": "It's perfect for steaming all of our favorite television apps. You can even get on pandora and Facebook and so much more! Love it!", "verified": true, "helpfulness": "0/0", "author": "Emily Ruputz"}, {"rating": 2.0, "review": "Never worked.  Got the Amazon Fire stick and that works just awesomely!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The first two we received were defective, each time we wanted to use them we had to open the back and take the battery out and put it back in, quite inconvenient.  After spending way too much time with Roku on the phone it was determined that they were faulty and they should be replaced, which meant we had to go to Amazon (the seller).  Amazon was great within 5 minutes they said that they would send out replacements within 2 days.  They arrived as promised.............however, it wasn't just the remotes it was the entire package.In order to use the new remotes we had to undo the first remotes and reinstall the second.  This took 1 hour and 36 minutes.  The technician was very patient and explained each and every step.  When he and my husband were done he thanked us and my husband said, hold it, we have another remote with the same problem and so they were able to go through the process more quickly than the first.So far the new remotes work well (we did have to remove one battery once).We are really enjoying Net Flix so I guess it was worth the many hours spent correcting the problem.", "verified": true, "helpfulness": "0/0", "author": "shelby"}, {"rating": 5.0, "review": "Excellent Product!", "verified": true, "helpfulness": "0/0", "author": "Jay Tomison"}, {"rating": 5.0, "review": "So easy to use. I had it up and running in minutes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Seems to work well.  my lously internet I think is to blame", "verified": true, "helpfulness": "0/0", "author": "George Betteridge"}]