[{"rating": 5.0, "review": "Very functional. I am able to view Netflix all the in Guyana. I enjoy using same .", "verified": true, "helpfulness": "0/0", "author": "GERUTH"}, {"rating": 3.0, "review": "I had to get a 3 HDMI adaptor to connect my Roku because my tv only had one HDMI port. My problem is I cannot switch back and forth from cable to Roku using the remote(s). I have to physically remove the Roku cable to watch cable tv. I also have to use my tv speakers for the Roku instead of my stereo. This may be because of my own ignorance of the connection so if anyone has an answer for my dilemma, I would appreciate it.", "verified": true, "helpfulness": "0/0", "author": "Gift Card Recipient"}, {"rating": 5.0, "review": "everything 1 needs in a small package", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 4.0, "review": "Met all expectations...much easier to use and faster to move around with this remote than the one that came with my wireless blu ray player.", "verified": true, "helpfulness": "0/0", "author": "Geri Buffaloe"}, {"rating": 5.0, "review": "Ordered this for my Dad for Christmas. Set up was a bit difficult, but I think that had more to do with my parents' DSL connection than the Roku. My parents are reporting that they love it and have already started catching up on shows that they haven't had time to watch on regular television. Plus they learned about and are loving the Pandora channel.", "verified": true, "helpfulness": "0/0", "author": "JakeInGeorgia"}, {"rating": 1.0, "review": "I can't seem to make it work and trying to call the help line is useless.  The wait time is always at least 25 minutes.", "verified": true, "helpfulness": "0/0", "author": "Fran"}, {"rating": 1.0, "review": "It works but it runs very very slow. Not better than the  box and takes forever to load. Not worth the money in my eyes.", "verified": true, "helpfulness": "0/0", "author": "Shontae H."}, {"rating": 5.0, "review": "Purchased as a gift for my father, and to turn out living room tv into a smart tv, and it definitely delivers! It even has multiple apps that can perform as a dlna network receiver and media player through our home network which is a super big plus.", "verified": true, "helpfulness": "0/0", "author": "Sariel62"}, {"rating": 5.0, "review": "Bought this for my (tween) son for Xmas.  So far, he LOVES it.  If you are an apple snob, then you would definitely rather have an Apple TV, but aside from seamless interaction with i-anything, this little device can do everything the Apple TV can do and more.", "verified": true, "helpfulness": "0/0", "author": "bpe"}, {"rating": 1.0, "review": "You'll find out this is as cryptic as a 1960s computer. That is after they load you up with about a dozen subscription channels you don't want and can't opt out of. ROKU is code for SHAM.", "verified": false, "helpfulness": "1/1", "author": "texexnv"}]