[{"rating": 4.0, "review": "Love the Roku Stick.  Easy to install, easy to use.  Great way to get streaming on my TV.  Still need to explore all of the features.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ZunG\""}, {"rating": 5.0, "review": "It was a gift for my parents and they love it.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "Besides the set up headache, it has worked perfectly.", "verified": true, "helpfulness": "0/0", "author": "Naiomi Ohlhausen"}, {"rating": 5.0, "review": "Wonderful item works great", "verified": true, "helpfulness": "0/0", "author": "Brian Arnold \"Cub\""}, {"rating": 5.0, "review": "Amazing, works exactly how I wanted and was easy to setup and install! I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Leroy"}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/0", "author": "Roshonda"}, {"rating": 5.0, "review": "I bought this primarily for my parents!  My wife, sister and I all have Xbox's, but we don't expect our parents to understand how those work.. Haha!  This is super-easy to set up with a very simple remote and a simple-to-navigate interface.  So long as you have a good wireless connection, you're set!I had first thought of getting my parents the Google Chromecast because I love Google!!  However, once I had learned that there is no remote for it (as you just use your phone) I'd figured that would be galaxies over my parents heads.  Thus: Roku!!", "verified": true, "helpfulness": "0/0", "author": "Luke Onstott"}, {"rating": 2.0, "review": "Nice features and menu, having the physical remote is preferable in my opinion to having to use a smartphone app.  Does not pull as strong of a wifi signal as our Chromecast or other equipment so we had to rearrange things to put it in the room closest to the router.  Also is often frustratingly slow to load.", "verified": true, "helpfulness": "0/0", "author": "Phillip Schuppert"}, {"rating": 5.0, "review": "great addition to tv choices", "verified": true, "helpfulness": "0/0", "author": "craig suttles"}, {"rating": 5.0, "review": "Love it! We use it every day & we're saving quiet a bit of money cutting back on satellite.", "verified": true, "helpfulness": "0/0", "author": "Shades"}]