[{"rating": 5.0, "review": "Great and easy to use. Fast internet is key to smooth streaming, otherwise downloads will be delayed and intermittent. Enjoy", "verified": true, "helpfulness": "0/0", "author": "Gary T"}, {"rating": 5.0, "review": "I absolutely love the Roku player!  The stick was easy to setup, the remote is simple and basic with it's controls. I'm buying another one for my other tv!", "verified": true, "helpfulness": "0/0", "author": "imbanter"}, {"rating": 5.0, "review": "I only need to turn on the computer to download new stuff from YouTube or get the programs out of PLEX - I haven't been able to download anything using the HDMI stick.", "verified": true, "helpfulness": "0/1", "author": "Terry Draper"}, {"rating": 5.0, "review": "This new, tiny thingy seems to do everything the larger, more expensive Roku 3 can do. Got both, along with a Roku 2, which has only one flaw -- doesn't get YouTube. Interesting marketing by Roku -- a product that costs about half of his most recent full-size product but seems to be indistinguishable in performance. The only pbm so far is that not all smaller-screen HDTVs have limited space for a USB-sized device being plugged into the back. I simply changed out some TVs, but something to at least know about.", "verified": true, "helpfulness": "1/1", "author": "RodLefty"}, {"rating": 5.0, "review": "Years ago I bought the first Roku box for $99 and have been a convert ever since.  When I found out about the streaming stick for only $50, I immediately pre-ordered it.  It's great.  The navigation interface is much better than my old Roku box and the channels seem limitless, although I stick to about 10.  My first Roku still works, so I just put it on my upstairs television so I can enjoy my Netflix on both my TVs.  Thus, I am confident that Roku's products are built to last and adapt with the times.  If you have not cut the cable cord yet, let this little stick be your motivation.", "verified": true, "helpfulness": "0/0", "author": "Amused"}, {"rating": 1.0, "review": "I've gone through 3 rounds of email with their tech support and they don't seem to have any idea.  It's like the bad old phone support days:\"Reboot it and get back to us\": no change\"Download and install the latest version of the software and get back to us\": no change....I'm giving up and returning it.", "verified": true, "helpfulness": "1/3", "author": "Erik Krumrey"}, {"rating": 5.0, "review": "This is a fine alterative to cable.  The only expense is to buy the Roku device, if you have wifi!", "verified": true, "helpfulness": "0/0", "author": "Patty"}, {"rating": 5.0, "review": "Really great. HD defination for ESPN3,... installed Chinese TV app... a lot more. Like it very much, use it very often.", "verified": true, "helpfulness": "0/0", "author": "FlyingMountain"}, {"rating": 5.0, "review": "Exactly what I wanted at a great price. I watch all the MLB games on my TV in High Definition.", "verified": true, "helpfulness": "0/0", "author": "Robert A. Frye \"RAF\""}, {"rating": 5.0, "review": "This is a simple, clutter-free solution for streaming movies and other media to your TV. Prompts made set-up relatively easy and fool-proof, and it works faster and smoother than other devices I've tried.", "verified": true, "helpfulness": "0/0", "author": "Zo"}]