[{"rating": 5.0, "review": "So glad I got this...wish I had purchased it sooner! It was very easy to set up. My only complaint is that there's a little lag time between the remote and the stick. Sometimes I'll press a button several times before the system responds. It would also be better if the remote had an illuminated display.", "verified": true, "helpfulness": "0/0", "author": "savannah.221b"}, {"rating": 5.0, "review": "As a person who has decided to hold out for cable, I love the Roku Stick because it lets me watch all my streaming services. It took me a while to decide which steaming device to go with. I rent a home so I can't run cables as I please through a WWII era house. Our wifi modem was installed on the upper right hand side corner bedroom while our TV was literally diagonally the opposite in the first floor living room.We used my dvd player to connect to netflix, that wasn't fun. We depended more on our tablets and computers for Netflix, Amazon Prime and Hulu.The Roku stick has a much stronger built in antenna that hides behind your tv, you literally just point the remote or your phone towards the tv. I love the versatility I have of being able to take this small stick along with its power adaptor from the living room to the bedroom. For me this is the best streaming device.I previously had a sony streaming thing until it fell and broke while moving, I've used a samsung dvd player but none have given me so many option:hulu, netflix, amazon instant video, youtube, pandora, spotify, tune in, amazon cloud player, target ticket, and much more.", "verified": false, "helpfulness": "0/0", "author": "EML"}, {"rating": 3.0, "review": "Too few Spanish videos, programs, movies, Christian programs . Don't good for me", "verified": true, "helpfulness": "0/1", "author": "luis"}, {"rating": 1.0, "review": "Failed after 4 months, with a 3 months manufacturer warranty.When I approached Roku - they told me tough luck.Has intermittent issue with static in the video, even at bootup screen. Usually occurs after device has been on a while.Also has intermittent issue with audio - sounds like a people talking through a kazoo", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 4.0, "review": "I give the Roku Stick, 4 stars because it is a little slower then the Roku 3, but it gets the job done you just have to have this one a little bet closer to your Wifi router espeacialy if your an AT&T; Uverse subscriber, you guys that have AT&T; you probualy know what I mean.", "verified": true, "helpfulness": "0/0", "author": "david n."}, {"rating": 3.0, "review": "get a roku 3 instead of the stick. the stick is much slower and the wifi also lags a bit. However the roku 3 is just great. So get the roku 3!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Rene"}, {"rating": 4.0, "review": "This is a very good compact unit that competes handily with Chromecast. However, many  HDMI ports on TV's are close together and the unit will not fit as delivered. Roku will supply an HDMI pigtail to correct the problem and you can order it for free from the Roku website. They require your unit serial number to order it. This is an inconvenience that you shouldn't have to endure.  The short adapter cable ships standard with Chromecast, but not with the Roku stick. This should be standard as well with the Roku stick as it is needed more often than not to properly fit most TV HDMI ports properly.", "verified": false, "helpfulness": "0/0", "author": "Boater Bob"}, {"rating": 5.0, "review": "I just wanted to get netflix in my room.  It has done that and more!!", "verified": true, "helpfulness": "0/0", "author": "Lorraine G. Sutherland"}, {"rating": 5.0, "review": "I use it mainly to watch Amazon Prime movies and TV shows and it works great.", "verified": true, "helpfulness": "0/0", "author": "HRH"}, {"rating": 4.0, "review": "It has many channels ... great many pay or commercially interrupted.** WIRELESS CABLE ROUTER REQUIRED", "verified": true, "helpfulness": "0/0", "author": "B. Schauerte \"Floridian\""}]