[{"rating": 1.0, "review": "This is a surprisingly bad offering (given that Roku's old box was quite decent). I booted up after a few days of not using, and received the dreaded '014' message (Roku can't find internet). After trying this from some hacker forums (http://rokuhowto.blogspot.com/2013/05/the-dreaded-error-code-014-solution-3.html), I now receive the dreaded '011' message. For a consumer device, this behavior is unacceptable.", "verified": true, "helpfulness": "29/31", "author": "Venugapal Vasudevan"}, {"rating": 5.0, "review": "This thing is a lifesaver for Netflix! I had been using my hideous old Nintendo Wii for ages to stream Netflix to my tv and then I found this sweet little piece of heaven. Just plugs right into an HDMI port on your tv and boom! You're ready to go! No more bulky ugly Wii cords all over the place! Plus it has a remote smartphone app which is great when you lose the physical remote in the vast depths of the couch cushions.", "verified": false, "helpfulness": "0/0", "author": "Madison Almeda"}, {"rating": 4.0, "review": "I would probably give it 5 stars if I didn't compare it to the roku 3 (which I own and love).  There is a lag in the remote which is annoying and the set-up process took much longer than setting up the roku 3.  I also had difficulty linking it to the internet.  Now if you've hadn't had experience with the roku 3, then this is a great product.  It does everything you'd expect it to.Note: The remote lag seems to smooth out once the setup is complete.I would buy this product again because the $50 savings is worth the frustration with the set up.  If forking out an extra $50 is no big deal to you...get the roku 3 instead.", "verified": true, "helpfulness": "0/0", "author": "drew bartlowe"}, {"rating": 5.0, "review": "I love this thing really easy to use and video quality is great. Might want to buy an HDMI L shape adapter if your TV inputs are tight. Luckily my TV has an HDMI input on the side.Note: you have to put in some type of bank card in order to use it. They don't charge you though only if you buy or rent something.", "verified": true, "helpfulness": "0/0", "author": "Jose Castillo"}, {"rating": 5.0, "review": "Great alternative to the ROKU 3,  priced right and works well, you will need an open HDMI port on your TV tho as the Purple dongle has to plug directly into an open HDMI port, so it wont work on older tv's that only have A/V inputs, its wireless router connectivity only! ,so no Ethernet connection available either if you prefer hardwired over wireless  but so far no complaints except for ROKU's cumbersome setup and registration process, its time consuming and the ROKU site sucks in my opinion, but once youre up and connected it works flawlessly,", "verified": false, "helpfulness": "0/0", "author": "Kurt  Yochum"}, {"rating": 5.0, "review": "Got this hooked up and it works great.  I mainly bought it for Amazon Prime films and so far that is all I have watched.  Recommend for anyone who wants to enhance their TV watching. I have had no problems with it.", "verified": true, "helpfulness": "0/0", "author": "M. Gregg \"mysfre\""}, {"rating": 4.0, "review": "A slick stick!!  I could not get Netflix on my dvr player without a lot of stops and starts.  This little device cured that.  Works great", "verified": true, "helpfulness": "0/0", "author": "Arldon Brown"}, {"rating": 4.0, "review": "We really enjoy it and watch shows we wouldn't otherwise because we don't have premium cable.  We just wish we could stream live shows free", "verified": true, "helpfulness": "0/0", "author": "Melissa Hernandez"}, {"rating": 5.0, "review": "😲Absolutely and definitely met my expectations. I am using this device in my bedroom TV. This is my second Roku device (first generation) which is in my living room. Love love it!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Aida R. Samson"}, {"rating": 2.0, "review": "I was stunned by how underwhelming it is. I have an Apple TV 2, which seems kind of pokey at times, and I know the Roku Stick is not considered fast, but I didn't expect it to be this slow. I mean, painfully slow. Has the thing frozen up slow. Takes so long to start that I leave it powered on so it won't have to power up ever again slow.The reason I got it was solely to watch Amazon Instant easily, since I was going through what I thought was the bother of airplaying Amazon shows from my iPhone to the ATV. I figured it was worth the cost to save me that much hassle.Well it's not. Along with being so slow that I could get my iPhone up and running in less time, the Roku also broadcasts a public, local WIFI network that interferes with my regular, hidden WIFI network. My server will find and try to hook up to the Roku network instead of hooking up to the regular hidden network, knocking the server (headless) off the regular network and requiring me to hook up a monitor and mouse to fix it. I could just have the Roku turn itself off with the TV, so it does not broadcast itself normally, but then it has to start up any time I want to use it.And it is sllllooooooooowwwww at doing that.So why did I give it 2 stars? Well, it did make my iPhone hassle seem a whole lot less a hassle. I do appreciate that.Anyway, returned it.", "verified": true, "helpfulness": "0/1", "author": "Joniz \"Joniz\""}]