[{"rating": 1.0, "review": "This is a piece of junk. I have spent hours with tech support, they have sent out a new remote (which seems to be the problem) and it still doesn't work. Don't waste your money on this, I sure wish I had not.", "verified": true, "helpfulness": "0/0", "author": "Jenifer A Herzberg"}, {"rating": 5.0, "review": "I wanted to try out my amazon prime tv subscription. Roku did the trick. Watching Downtown Abby.  Its getting really good.  On Season 2", "verified": true, "helpfulness": "0/0", "author": "Jewlz"}, {"rating": 5.0, "review": "Excellent streaming stick does exactly what it promises. Safe to say that this is the best streaming stick for IPTV. Large amount of channels available.", "verified": true, "helpfulness": "0/0", "author": "Kenny"}, {"rating": 5.0, "review": "This is a life changing product! Have had it for a few months now, don't really know how I ever lived without it. Had the Chromecast, if was fun, Roku Stick will do everything and much more. I love the remote too!", "verified": true, "helpfulness": "0/0", "author": "Karla Hocker"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Charles Grove"}, {"rating": 5.0, "review": "So glad I bought the Roku.  I watch or listen to music everyday.  Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Jeannine Bessey"}, {"rating": 5.0, "review": "Very easy to set up, streaming video in minutes.", "verified": true, "helpfulness": "0/0", "author": "Dlhussier"}, {"rating": 5.0, "review": "Great worked so well that i gave it to a friend to use... for his kids...", "verified": true, "helpfulness": "0/0", "author": "Robert Gard"}, {"rating": 5.0, "review": "Bought this to replace an old blu-ray player that broke down. This Roku is faster and more dependable than the blu-ray player ever was. No need to worry about where to place the box and the device still easily reads the remote from behind the TV.", "verified": false, "helpfulness": "0/0", "author": "Jay S"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "romuald bocage"}]