[{"rating": 5.0, "review": "Just keeps getting better. My second roku. This one is a bit slow but so much better. I like the remote now that it's not line of sight.", "verified": true, "helpfulness": "0/0", "author": "Oeda B."}, {"rating": 4.0, "review": "Lots to watch. Plus you can use it to screen mirror from your phone.", "verified": true, "helpfulness": "0/0", "author": "Orlando Barajas"}, {"rating": 1.0, "review": "This item did not work.", "verified": true, "helpfulness": "0/0", "author": "MIchael A. Nelms"}, {"rating": 1.0, "review": "Doesn't pick up wireless in the next room which is 25 feet from the router..", "verified": true, "helpfulness": "0/0", "author": "avry rose"}, {"rating": 2.0, "review": "I was looking forward to having this product work for me but could not get the remote to pair with Roku....I contacted Roku support but they could  not get it tomwork as well. They suggested that I return the item...which I did.", "verified": true, "helpfulness": "0/0", "author": "George C."}, {"rating": 5.0, "review": "Love this I use it more than my Cable", "verified": true, "helpfulness": "0/0", "author": "Mz.Cakez"}, {"rating": 5.0, "review": "My husband LOVES this. Easily move it to whichever tv you want to watch.", "verified": true, "helpfulness": "0/0", "author": "Michelle O'Toole"}, {"rating": 1.0, "review": "I purchased the Roku 3500 thinking it would be a nice experience, but turned in to a really bad experience, since Netflix works all over latin america, but this device does not support it, I keep trying, even ask technical support, but the guy told me it was a matter of rights or licensing, but at the end just don't work, the experience with Apple TV it's a complete different story no wonder Apple rules...I really don't know how it works in the US but out would be a waste of money....you better consider get the Apple TV instead.", "verified": true, "helpfulness": "1/1", "author": "Castellanos"}, {"rating": 1.0, "review": "didnt work for our roku but did for a friend's.", "verified": true, "helpfulness": "0/0", "author": "Cary R Nunnally"}, {"rating": 3.0, "review": "a few little bugs on how it works but plays movies once started", "verified": true, "helpfulness": "0/0", "author": "linda brown"}]