[{"rating": 3.0, "review": "I've had some issues with getting it to pick up the remote, both the remote that comes with the streaming stick and with the Roku app. It's not the internet or TV because we switched it out with an older Roku box that was in another room and didn't have any more trouble. I will be buying the boxes from now on, especially because my TV isn't wall mounted, so I don't particularly need it.", "verified": true, "helpfulness": "0/1", "author": "Sarah"}, {"rating": 2.0, "review": "I bought this through dealfisher here on amazon. It was \"referbished\". I think what they meant was it was a broken item returned to them. When i got it, the remote batteries were dead. There were scratches on the remote. With new batteries it seemed to work ok. But then i noticed the batteries would die quickly. After jot using it about a week, i would go back and the batteries were dead. After a few weeks, it started freezing a lot. Now, the remote pairs to it for a few seconds, then just stops working. And when i try to use the roku remote app on my iphone, it works. But then when i launch youtube, the roku freezes. Bottom line, it is unusable now.", "verified": true, "helpfulness": "0/0", "author": "Robert Carrasco"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "William Seol"}, {"rating": 2.0, "review": "I think this Roku device is faulty. Since it was a gift, I've only just recently found out that it wasn't working correctly from the beginning. My return period is now expired. When trying to load an app on the device, it will get frozen until the device is reset. The only other way to unfreeze it is to push the back arrow. When the back arrow is pushed while it's frozen, it will wait about 30 seconds, then open the app that was originally selected. Now, as if that's not enough, the remote is no longer working either. The light doesn't turn on at all, and despite brand new batteries and attempting to reconnect it, the remote is dead. Overall, the person I gave this to got 2 months of annoying use from this device, until the remote broke. A new remote for the device is 20-30 dollars. Not an investment my friend and I are willing to make for something of such terrible quality that it broke within 2 months, and was faulty from the beginning. I don't recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Ashley L."}, {"rating": 5.0, "review": "Adds value to my viewing experience.  Some buy it because they cannot afford cable or do not want to pay the cable prices and deal with the cable companies customer service and incessant overbilling.  I bought it to see if my viewing habits could be handled with Roku and no Comcast.  So far I am still a bit skeptical.  I may change my mind.  For others who watch a lot of movies and content created by Amazon, Netflix, Google. etc. Roku may be answer.One hint on installation is that you must change the HDMI port on your TV settings to match where you connect the Roku.  In other words, if you have your cable box on HDMI 1 and plug the Roku in HDMI 2 you need to use your TV remote to change the settings to HDMI 2 to see the Roku.  Then change back to HDMI 1 see the cable broadcast.  You can find Android apps for some TVs that will allow you to control your TV from your smartphone.  My Samsung TV has a nice android app that includes the infra-red signal support.  I don't need to use the large physical TV remote.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"DPM\""}, {"rating": 5.0, "review": "love this", "verified": true, "helpfulness": "0/0", "author": "Cecelia  Lauerman"}, {"rating": 1.0, "review": "Product did not connect to Netflix most of the time.  I also bought insurance from Square Trade.  I explained the problem I was having,i.e., it would not connect to Netflix most of the times.  They informed me that my complaint did not qualify for any adjustment.  I estimate that Roku fails about 90 percent of the time.", "verified": true, "helpfulness": "0/0", "author": "Thomas N."}, {"rating": 2.0, "review": "This review is for a Roku Streaming Stick HDMI version; info on box shows the following: 3500X-BDL1.  First, let me say, I have set up three of these, all of which came from Sam's Club.  My sister, my mother-in-law, and then finally my own.  I set mine up with a remote that barely worked right out of the box.  I purchased new batteries on three different occasions, as the remote would work fine for one or two episodes, then if I placed it pause or even went back to the home screen, it would not work unless I took at least one battery out and then reinserted it.  Finally I called Roku, got a man I could barely understand.  Gave him all the information he requested.  Finally he said they would send out another remote.  He also informed me that phone calls were $10 per call, but if I purchased the extended warranty for $20, I could call as much as I wanted.  So, like a fool, I purchased the warranty.  The remote arrived in three days and did not work at all.  If the man I spoke with had not told me about the free app which allowed me to control my Roku with my Smart Phone, I would not have been able to watch anything.  I never bothered to call back for a replacement remote.  To be fair, when the stick works, it is just fine, but I have to unplug it several times a day or it gets to 25% loading and stays there.  Our local cable company has upgraded their system for a faster internet.  Before the upgrade, I was getting 16-20 Mbps download, but the tech told me I needed a new cable modem with DOCSIS 3.0, so I purchased a  new Arris/Motorola cable modem, then went out and got a new Netgear Wi-Fi router, but even with all of that, I still have to unplug the stick to reset it.  To be totally fair, my mother in law and sister have not had a problem.  My sister said she has only had to reset her stick one time and my mother in law, not at all.  I thought that going from my older WD Live TV to the Roku stick would be an upgrade, but I must have purchased a bad stick.  I think I will try the Amazon Fire stick next.Addendum:  Severa weeks ago I e-mailed Roku asking for a replacement remote for the replacement they sent.  On 08/27/2015 a gentleman from Roku called me.  He said he was sorry that it took so long to get back to me and wanted to know if I had received the replacement remote.  I said I had, but it did not work when it arrived.  However, to be fair in this matter, I did not pair the remote with the stick, as the first person I spoke with did not tell me to do so.  I finally got a call and that person asked me to pair the remote.  I did and it worked to a point.  Someone did a follow up call that evening and I explained the remote was working at that point, however, I was still having to unplug and wait and then replug the stick.  Then everything would work fine for a few hours.  The remote was working fine this morning, but just quit.  Then I got a follow up call to the follow up call, which was kind of Roku, however, none of the folks I spoke with could really be understood..  To make a long story shorter, they agreed to send me a whole new package and a free shipping label to return the old stick and remote.  I must give them credit, they are at least making an effort to keep this customer happy.  They could do more by helping to keep jobs in America.  But that is just my personal opinion.  I will write another addendum to say how the replacement works out.", "verified": false, "helpfulness": "0/0", "author": "OldSarge \"mijou1\""}, {"rating": 4.0, "review": "Only issue I have is the remote tends to die pretty quick, but other wise both this and the Roku 3 are great!", "verified": true, "helpfulness": "0/0", "author": "charis29"}, {"rating": 5.0, "review": "This is actually the third Roku streaming stick that I have purchased.  This brand has been very reliable and a quick, inexpensive way to access streaming video/materials.  Cost comparison, these are $5 - to $15 (depending on sales, etc.) higher.  For the money, it's worth it.  In the past, we tried an off brand, and was completely frustrated with it.  Bottom line, your sanity is worth the money.  Go for the Roku.", "verified": true, "helpfulness": "0/0", "author": "mike"}]