[{"rating": 5.0, "review": "I have never owned any other Roku products, so I can't compare the stick to the box.  I bought this for snowbird living (2 month vacations).I have used the stick every day for the past 10 days.  Compared to my 3 year old Vizio smart tv, this stick is faster at loading.  So I would not complain about the speed.  I had my Kindle Fire HDX handy for setup, and felt like setup was easy.I have had to reset the stick by powering down a few times, but have had mostly trouble free streaming.  If I could give partial stars, I would give this product 4.5 stars.  It may not be perfect, but I feel like I got my monies' worth.", "verified": true, "helpfulness": "0/0", "author": "LeeZ06"}, {"rating": 5.0, "review": "a great product at a great price", "verified": false, "helpfulness": "0/0", "author": "Thomas Strausbaugh"}, {"rating": 1.0, "review": "the reason I hate it was it did not work right out of the box. I tried everything to get it too work but no good news.", "verified": true, "helpfulness": "0/0", "author": "rod  howard"}, {"rating": 5.0, "review": "Works exactly as advertised..Excellent quality, no issues at all.", "verified": true, "helpfulness": "0/0", "author": "Cory Barron"}, {"rating": 5.0, "review": "Love everything about the Roku! Streams, mirrors my phone. Very user friendly. Nothing bad about it at all. It even has a Netflix and a Amazon button right on the remote.", "verified": true, "helpfulness": "0/0", "author": "Holly"}, {"rating": 1.0, "review": "Too small", "verified": true, "helpfulness": "0/1", "author": "Suzanne G. Sherman"}, {"rating": 2.0, "review": "I personally think this is over rated and only because it uses so much internet to run it that it will suck up your internet like a little kid with a sugar drink.I suppose it's good if you have a Very Very good internet connection then it's acceptable, Everything about it runs on your wifi, Even the remote constantly runs on wifi!!! Yes it works the correct way and my family loves it but, I Don't!", "verified": true, "helpfulness": "0/1", "author": "shane"}, {"rating": 3.0, "review": "I'm not sure what certified refurbished means but mine showed up with a non-functioning controller so I'll just pay the little extra and get a new one now.", "verified": true, "helpfulness": "1/1", "author": "Jared M. Zerbini"}, {"rating": 4.0, "review": "It is very nice production. However, it took quite long time for me to download updates. I am not sure what caused it.", "verified": true, "helpfulness": "0/0", "author": "B. Zhu"}, {"rating": 5.0, "review": "Easy to use and excellent quality. Works very well-I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]