[{"rating": 5.0, "review": "Works  great .... wish it came out before I bought a smart tv, would have saved a couple hundred of dollars.I have roku 3 and this stream just as good, yeah set up channels is a pain, but once pass that part it's right there with the roku 3 ...really would have gotten 2 of these rather then the roku 3 for the same price", "verified": true, "helpfulness": "7/9", "author": "mastro"}, {"rating": 5.0, "review": "It sure has a lot of free things on it. I'm not much for paying, but after searching for a bit I've discovered plenty of sites with lots of offerings. There are sites that charge money, but if there are also many free sites. The only negative thing I would have to say is I don't know if it would replace cable tv for most folks. I've been told the law requires local channels to put out a digital signal, so it 'should' be possible to buy an antenna and get all of your local stations for free through the antenna. Most regular cable sitcoms 'law and order' for example, cost money to view. BUT, the free sites such as - The History Channel, PBS, Vimeo, etc. - more than make of for those shows in my opinion. Get it, what the heck, it only costs $50!!!!! Wow!!!!!", "verified": true, "helpfulness": "0/0", "author": "James \"Jim\""}, {"rating": 5.0, "review": "For most things I am a huge apple fan. But for streaming boxes I use a PS3 and several Roku boxes around the house. I bought a chromecast when it first came out but sold it. Seemed a bit limited compared to the Roku's and it didnt stream well which could be due to my TV being mounted very close to the wall.However, the Roku is performing flawlessly and I like that it comes with a remote that has short cut buttons on it for Netflix and Amazon. Netflix does load a bit slow but I cant help but think an update will fix that.I really like the portability of the stick and that it can be powered by a USB port on the TV. You really cant go wrong with any Roku product but I really do like the stick version. I also have an HD and XS.", "verified": true, "helpfulness": "3/3", "author": "Robert Smith"}, {"rating": 5.0, "review": "I've had my Roku Streaming stick for a week and really love it. My TV is located in a tight space that would not easily permit exposing a separate set-top type box to receive the remote's signal. This problem was easily solved by the compact Streaming stick which plugs directly into the TV's backside HDMI port. Since the remote communicates with the streaming stick over wifi, it works perfectly behind the TV.I was also worried about wifi communications between the Streaming Stick and my wifi router because the TV is located in an out building from the main house's router. No problem. The install went smoothly and I was enjoying a Netflix HD movie in short order.", "verified": false, "helpfulness": "3/4", "author": "K S"}, {"rating": 5.0, "review": "I received my Roku stick just today. I know just enough about computers and such things to be able to somehow limp through the set up procedures, but this device is just plain easy. Just followed the step by step instructions and in no time we were watching TV. We are on DSL, so I wasn't sure just how well the streaming would work, but no problems at all. Might have been a 1 or 2 second wait while a show is loading, but then it just simply flows. Picture and audio is very sharp and clear.", "verified": true, "helpfulness": "3/4", "author": "Frugal \"DIYer\""}, {"rating": 5.0, "review": "I have a Chromecast, which was a gift, and now I've purchased and received the streaming stick.  I have an LG blu-ray player that also plays some of the same apps that the Roku does, and the Chromecast can 'cast.  So, with that in mind, my review takes into account my usage of all three.The LG is a few years old by this point, and the three apps I tend to use on it are Hulu, Amazon, and Netflix.  It's been my go-to for watching movies and series, but of course, the biggest problem was A: I had to turn it on, wait for everything to load (at least two menus worth before even loading an app), and then slowly work my way through said apps. Chromecast, on the other hand, was a bit of a slow load at the beginning, but for the apps it worked with, they loaded fairly fast.But the Roku is somewhere in-between.  And that's not bad.  There are other reviews that complain about how long it takes to load some things, but really, these are First World Problems in a nutshell: once everything gets going, there's no real loading problems unless your internet or router is having a fit.  If your TV doesn't turn off the power to the dongle, or you plug directly into an outlet, the Roku doesn't take the time to load everytime you switch to it to watch something; if you do use the USB and it turns off, your loading time is perhaps 40 seconds at most, at least in my experience.  So what?  I'm in no rush.  And again, if the loading time bugs you, you can plug it into the wall, and it won't turn off.Once the Roku is on, it's like a slimmer, faster version of my LG.  I can use the remote or my phone to navigate; it's not like the Chromecast which requires you to be on the same wireless network to 'cast the app you want to play.  If you didn't have a smartphone or a tablet, the Roku still works, whereas the Chromecast is basically useless.  (Yes, you can pull out a computer, but since that's buggy and requires the Chrome browser as well, what's the point?)  Some apps do load slowly, most notably Netflix, but again, I'm in no hurry to go anywhere, and I've been long used to a different player taking even longer to load.  But again, once it's loaded, they're ready to go.  Really, the only reason the Chromecast can load faster is that the dongle itself is basically just a mini-router; there's really nothing loaded on it before you send the signal from your phone/tablet/computer.Unlike the Chromecast and the LG, the Roku is also customizable: visually, and content-wise.  Channels can be removed or added.  The background can be changed.  That's actually pretty nice, considering the Chromecast won't (yet) let you even change the start screen.  And the apps that work with it, while growing, do not include everything the Roku can play (most obviously Amazon).  Because the Roku has all three apps I was using on the LG, that makes it vastly more useful for me.And there's also the fact--however minor to some--that the Netflix and Hulu smartphone apps do not seem to work with the \"play next episode automatically\" feature when using the Chromecast, which is insanely annoying.  When using my tablet, I was constantly needing to lean over and press play after every episode.  Guess what?  The Roku has no problem with that feature.  That makes me extremely happy, even if Netflix insists on asking me every couple of episodes if I'm still watching.Overall, for an extra $15 over the Chromecast, the Roku is much more useful for me.  Maybe I'll spend the extra $50 later on for a Roku 3 and the faster processor, but for right now, this is working brilliantly. It's plugged in right below a router, so my signal is excellent, even though I do prefer ethernet.  Really, the only complaint I have is of my own make; I can't get 5.1 audio because I have no more ports open on my Pioneer receiver, and I have to plug it in to my TV straight.For me, this is definitely the better choice of streaming dongles.EDIT APRIL 9: So I've been using it pretty much daily since receiving it, and I have a few more things to add about my experience with the stick.First off, the remote does suck.  I mean, it really, really does suck.  Whoever designed it clearly has never seen another remote made in the last decade or so, because otherwise, they wouldn't have placed the OK button below the crossbar button.  Nor would they have forgotten to include A STOP BUTTON.  If you have the Roku plugged into the wall, using \"pause\" is the only way to basically stop whatever you're watching, or pressing the Home button to leave the app and go back to the main menu, before you turn off your TV.  If the Roku is plugged into the USB port, the stick itself turns off, and this is not such a big deal, but otherwise, you're basically constantly pausing things and letting them sit for hours (days?) paused until you decide to watch again.  That's a bit stupid considering.......this thing can get really warm.  It does seem to cool off when you're not actively watching anything, even if it's eternally paused, but it's definitely a hot body.  That worries me just a tad.Also, it sucks I can't replace the remote with my Harmony, but since that would require both IR and line of sight, the latter of which basically defeats the purpose of the dongle, I can see why it won't work.  The phone app is a decent substitute (and the keyboard makes it vastly easier to sign in [except Hulu for some reason, it refused to recognize the keyboard] and to search, instead of tapping each letter one by one), but I still wish I could use my universal remote.  The stock remote is basically nine buttons and four dedicated advertising slots, wasting what could have been actual useful space for MGo, Amazon, Netflix, and Blockbuster (seriously!?) logos.  Programmable buttons would have been better.  Supposedly the Roku 3's remote can be paired and used instead, but I haven't looked into it yet.Youtube's app has a nice feature where you can basically 'cast videos from your computer to watch, instead of having to use the app's search function.  Once you link it up, you can just go to Youtube on your computer, and send the video to your TV to watch.  Don't even need to keep the tab or window open on your computer once it starts playing, either.  It also doesn't require a specific browser like the Chromecast does.  I'm currently watching MSTK3's \"Manos: The Hands of Fate\" and considering the quality of Youtube in general, it actually looks and plays great.Really, the biggest problem I see with this stick is the remote.  It definitely needs to go back to the drawing board.  Otherwise, this is still (for me) the superior TV dongle, and is far more worth the money to me than the Chromecast would be.", "verified": true, "helpfulness": "9/10", "author": "Sokudo Ningyou \"Devious Lark\""}, {"rating": 4.0, "review": "I've never owned a Roku.  Do have an Apple TV as well as a chromecast.  I do see the hype about Roku though!  Tons of channels, really lots of options and almost impossible to sample it all!  The price point is right for sure!  For $15 over a chromecast, you get a handy remote that really makes the whole experience that much better.  It streams very well.  The dual band aspect to the wifi really shines!  I've had this for 3 weeks now and I've only buffered a Netflix video once!  The only minor downside (my 4 star rating vs 5) is the interface is a bit slow.  Button presses on the remote take a second to register, and some apps (namely Netflix) take 2+ minutes to load up!  I've read the hardware capability is about on par with the Roku 1, not the newer 3 that apparently flies.  Altogether though, this is a purchase I'm thrilled with.  Hides behind my wall mounted TV perfectly, and once you get going, streams content extremely well!  I recommend!", "verified": true, "helpfulness": "0/0", "author": "DJ Dan"}, {"rating": 1.0, "review": "I would give it 2 stars because the hardware and software design is nice, but ON TOP of being frustrated with getting a broken product, I was disappointed by the requirement of divulging my credit card or PayPal information before being able to do anything with it.When it works it is sleek enough as long as you are patient. It is pretty slow to boot up. The YouTube channel takes a very long time to load and is very slow and jerky when it does, although it is attractive and intuitive. Streaming is nice. The video and audio quality is great.Setup went smoothly until I tried to sign in to Hulu. Keep in mind i am all of about 10 minutes into my first Roku experience. As I was typing my credentials the interface froze. I tried taking out the batteries with no luck so I pulled the plug and rebooted the 3500r to continue. I have had to unplug and replug the device once a day EVERY day I've used it (4 days)And now it won't even display the Roku startup screen. I tried pushing the reset button for varying amounts of time with no luck. It is completely non responsive.I'm sending it back.", "verified": true, "helpfulness": "3/7", "author": "Adam Miller \"millad\""}, {"rating": 4.0, "review": "Open Box Experience:Seemed easy to get into the box, though surprised to see it had a power cable. For some reason I assumed it was powered by HDMI. Perhaps this is something they can do later or my TV doesn't support the right version of HDMI for power.I had to look at the manual to figure out how it turns on. As I was looking, it eventually showed up on my TV. There was a slight delay before it showed the ROKU logo.First Impressions:The remote control seemed very simple and light. With most remotes it felt very light and the plastic case feels a little cheap. The buttons however feel like they will hold up over time. I kept wanting to press the directional pad as the OK button, so I'll have to train my fingers to locate the button below the d-pad.The remote takes a minute to connect to the screen menu which felt a bit glitchy and not fluid. I was already in some setup menu and it went back to another screen to add the remote. No issue though...just threw me off a bit.Watching the start up animation was cool. It's always neat to see something turn on with animation instead of a static screen. It required me to use my PC to activate it which was kinda weird. I thought you could have done this through the device. Maybe I did something wrong. I also had to enter a credit card number which I didn't really like. I wish I could have just start using it immediately.Playing for a while:Right side feels like advertisement where the news is...would have rather that have been an option to add during setup. I would rather not have it. This interface is so fast which is awesome. Probably the best part about ROKU. Interface seems straight forward though not sure how it will react to adding a bunch of channels. Hoping it won't slow down and feel laggy.I'll update more progress as I use it. I was a little sad I couldn't use Comcast Xfinity on here. Looks like Time Warner is there. This is a perfect device for a bedroom TV that doesn't have (smart TV inside) or back room. I was hoping this would give me an option over paying 10 bucks a month for a generic cable box. So far, its been fun and seems to work well.", "verified": false, "helpfulness": "1/1", "author": "JamesT \"James T\""}, {"rating": 4.0, "review": "Pretty nice.  Works well.  Wish it had ir remote too so I could use it with my harmony.  Also no support for dlma video server on my asus wifi router.  Works great for prepaid services and pay per view.", "verified": true, "helpfulness": "0/1", "author": "Christian Fredrickson"}]