[{"rating": 5.0, "review": "Very great product. Bought as an add on to my roku 3 box for my son's room. Works great. Will by another for my patio tv.", "verified": true, "helpfulness": "0/0", "author": "nathan downing"}, {"rating": 5.0, "review": "The was one of the best buys I've made within memory.  It was a great leap forward in entertainment technology for me.", "verified": true, "helpfulness": "0/0", "author": "PackerNut"}, {"rating": 5.0, "review": "Excellent product - easy to set up and use. Worked as expected right out of the box. Have been particularly enjoying HBO, ESPN and Sirius XM on this device. While most folks may plug this into their TV, I was able to route it through my amplifier to take advantage of better sound.", "verified": true, "helpfulness": "0/0", "author": "SnarkMark"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Teresa"}, {"rating": 5.0, "review": "this is a great purchase and does everything it states it does. I am very happy and it was really easy to set up!", "verified": true, "helpfulness": "0/0", "author": "murrie"}, {"rating": 5.0, "review": "I've been using this since it came out.  It's fun to a point.  Of course, it does not free you from having an ISP or Cable TV (optional).  You still need an internet connection.  And, if you want to watch anything meaningful, like recent movies or cable channel content, you need to have a cable TV subscription or a Hulu Plus or Netflix subscription.  This can get very costly, very quickly.  Soon you are paying the same amount that you would pay for regular cable TV or more. I've been using it for watching the free D-grade movies that are available, but usually I quit before the movie ends. They are mostly pathetic.  \"Newsy\" is Roku's compilation of the daily news, and can be interesting. But, then I watch the same thing on nightly news broadcasts, so it has limited utility. Roku's product itself is good; it just doesn't have as much practical use as one might like.", "verified": true, "helpfulness": "0/1", "author": "TechiStan55 \"tech nickel\""}, {"rating": 5.0, "review": "I can watch what I want when I want with limited or no commercials for the price of internet plus $15 a month for Hulu and Netflix. Also mirrorcasting is possible with the Roku.", "verified": true, "helpfulness": "0/0", "author": "zac"}, {"rating": 3.0, "review": "I was quite excited to get this device to replace my aging Wii I was using to play Netflix (sadly, that's all it's used for anymore.) I bought a certified refurb and could see it had been used. No damage, no big deal. What I was alarmed about was the fact Roku required a credit card in order to set this up. Additionally, Spotify is nowhere to be found on its list of services although it is listed as available. I have not even tried watching anything on the Roku and so far, I'm wishing I had just gone with the Amazon Fire stick. The online reviews raved about the Roku but so far, I am not convinced. I will try using it for what it was made for (watching media) and will follow up later to let you know if I've returned it. I bought a Roku box several years ago when they first came out. I returned that one due to a gross failure to meet expectations. I'm starting to worry Roku and I just aren't meant to be... We shall see! Stay tuned.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 1.0, "review": "I've had a Roku 3 since it came out. Wanted another unit for my bedroom. Went through 2 of these (brand new units) with Amazon. The first one quit working after just a few days. The second could not find any wireless networks (about 5 very high strength signals present). Pieces of trash. Makes me doubt my Roku 3, but it's been a peach since it came out of the box more than a year ago....", "verified": true, "helpfulness": "0/0", "author": "paul arthur"}, {"rating": 5.0, "review": "i am different now. it is because of this device.", "verified": true, "helpfulness": "0/0", "author": "Matthew Z"}]