[{"rating": 5.0, "review": "I really love that I can stream my Netflix and other channels as much as I want. I used to use my computer with an HDMI cord but then my computer word go to sleep every few minutes and kept having to get up to fix it. I'm really happy I now have access to all the streaming I need without some clunky device cramping up my tv stand.", "verified": true, "helpfulness": "0/0", "author": "Isabella"}, {"rating": 1.0, "review": "Didn't work right starting the first time we plugged it into the HDMI port. It wouldn't start up using the remote at all requiring us to keep switching HDMI ports until it would decide to work. After about a month and a half, there are even more problems with it. Now it freezes immediately when it gets to the home page and  no amounting of resetting and switching ports fixes the problem. Oh, and this product is constantly hot to the touch. Who knows, that might be causing the problem. I'm returning it and buying one of the box models. I've had a Roku box 1 for over 6 months with absolutely no problems and it's cheaper than the stick.", "verified": true, "helpfulness": "0/0", "author": "S"}, {"rating": 3.0, "review": "Having some technical issues. Internet connectivity must be clear and strong. Have to reset everytime there is a break in internet connectivity.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Hoyle"}, {"rating": 5.0, "review": "Now have 5 rokus and love them all", "verified": true, "helpfulness": "0/0", "author": "William J. Daub"}, {"rating": 5.0, "review": "Easy setup, works great, lot of channel options, although we primarily watch Netflix. Great buy, wouldn't hesitate again to buy the refurbished one and save $10.", "verified": true, "helpfulness": "0/0", "author": "Marty Warren"}, {"rating": 5.0, "review": "great reception even though it is completely blocked by TV", "verified": true, "helpfulness": "0/0", "author": "Dave \"Dave\""}, {"rating": 2.0, "review": "I own and operate 5 rokus - 3 at my house and 2 at relatives - and have found the boxes to be an easy to use, great entertainment tool. When my first generation roku died recently I decided to the stick a try. Unfortunately, it's a lame product.1. I liked the idea of the remote not requiring line of sight to use. However, the remote is frustrating to use because it does not respond well. Even after several weeks of use it seems to be sticky - sometimes it doesn't respond when a button is pressed and sometimes it repeats the command multiple times.2. Netflix loads slow.3. This was the first roku that did not launch successfully, requiring a phone call to tech support.4. The 3 months of free HuluPlus offer is dependent on you not having a hulu account.I am returning this unit and purchasing an Amazon Fire stick.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "The roku stick is awesome. It was a great choice.", "verified": true, "helpfulness": "0/0", "author": "nan nan"}, {"rating": 5.0, "review": "This little thing is amazing. It has more channels than I thought it would. I don't think I'll ever pay for cable or satellite again.", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 4.0, "review": "I have been a Roku user ever since the old Roku XS. I got this Roku  streaming stick for a secondary tv. My primary tv has the Roku 3 Box so the question your probably asking is this Roku Streaming Stick a product you should buy or something you should skip. I think you should buy this. If you compare this to other streaming sticks on the market it is kinda pricy but considering Roku has over 2000+ channels and growing its a good price for what you get .In the box you get a remote the Roku Stick and a usb wall adapter. This stick runs on usb power from the included adapter or usb port on your tv. The setup process is very simple but you will need a Roku account to use this. If you already have a roku account you can sign into it and it will add all the channels you already have on another Roku. One Roku account can have up to 3 Roku boxes  assigned to it  maybe more but cant confirm that. What the roku box allows you to do is watch online content like Youtube, Netflix, Hulu, Movies, Tv, News, Music etc. to your Tv If you are wondering Roku only streams content there are live channels like watch espn, watch disney but thats about it nothing else there all on damand channels. There is free content and paid content on Roku allot is free but its hit and miss on the free content . I think most people who are buying a product like this most likely have a paid sub. to Netflix, Hulu etc. The performance on the Roku stick is pretty good. all the Roku devices use the same Interface(Home Screen)  Since this is Roku's Low end device  it actually performed better then I expected. I only own 3 other Roku devices Roku 3 players and a Chromecast what I can say for 50 dollars its not bad of course its not as fast as the Roku 3 to be very honest once in a while with the stick you can notice lag or delay with the home screen interface but its not bad enough were you would get mad at least not for me. All the apps channels run very smooth on this the loading takes about 4 to 5 secs for most channels. I can say some of the more popular channels like Youtube, Netflix, Hulu, takes longer then some of the other content 20 to 35 secends dont know why but it may be do to the more  heavier  skin those apps have  that may be a deal braker for some people but its not for me because like I said its not my main Roku Device. this does have most features that the Roku 3 has besides the slower proceser  and it doesn't have  the headphone jack on the remote you will need the 3 for that. Over all this is a very good device and im very happy to have one but if you have the cash I would get a roku 3 hands down its much faster and the headphone jack for private listening is worth it but be pre-paired to pay double 99$ for Roku 3. Let me put it this way it really depends on how much you watch online content if you watch it once in a while or about 2 or 3 times a week just get the streaming stick if you think 50$ is pricy you can get the Chromecast which is about  35$. One thing though It has no remote on Chromecast  so the Chromecast is not a stan alone device you will need a tablet smartphone to stream  the content to the tv but it has your basic channels like Youtube, Netflix, Hulu,  but Roku streaming stick you can use on its own because it has a remote you dont need to beam stuff with another device. I have not checked out the Amazon fire Tv Apple Tv, Amazon Fire stick I know those are pretty solid devices as well so check those out. Over all Roku stick is very good only reason for 4 stars is the \"Kinda\" slow loading on Youtube, Netflix, Hulu, Note I have not used every app so I dont know if there all pretty fast but those 3 are the ones I have found to be slower then most of the other apps 20 to 35 sec to load. Dont secend guess your self get your streaming on today!!! P.S Roku products are ment to stay on at all times no on-off switch  they consume less power then a night light  I have had allot of Roku products and they all get  slightly hot and thats normal so dont worry about that I have never had a Roku to this day fail on me. Chromecast, Roku 3, Roku Stick all alow Screen Mirroring from a tablet or smart phone I only tried Android so I dont know if Iphone ios, Windows phone  is support but for screen mirroring on andorid  you do need Android 4.4.2 Android KitKat.  Those are the only 2 Rokus that I can confirm work with Screen Mirroring. You can cast \"ANYTHING\" your doing on your smart phone or tablet to your big screen. I have tride mirroring games on Roku 3 , Stick, Chromecast and on all three its not good experance so do not buy any of these to play Android games on your big screen.I have only tride 3 games so maybe other games are playable.", "verified": false, "helpfulness": "1/1", "author": "Wayne"}]