[{"rating": 2.0, "review": "The Streaming Stick is OK; the remote does not work at all and never has from the day I took it out of the box. You can get an app for free for your iPhone that is a great remote but will only work on 4,5 and 6; iPhone 3 does not have proper operating system to work with it. Many times the Roku will just simply lockup without cause. It could be the WiFi but when it locks up the WiFi on my iPhone still works and I am sitting in the same room. It was a bear to setup and install - took me 3 hours. Problem was DHCP IP address from Time Warner Cable. You have to manually set the MAC address to make it work. Their tech support phone help did not know this; they were worthless. I researched it on Google to figure it out.", "verified": true, "helpfulness": "0/0", "author": "Paul Rigsbee"}, {"rating": 1.0, "review": "Old technology with to much interference spend a little more money & get the Roku 2 or 3.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Amazing little device. Super fast and easy to setup", "verified": true, "helpfulness": "0/0", "author": "Chirayu Brahmbhatt (Max)"}, {"rating": 5.0, "review": "this is my second roku. i am pleased with this model , because it's out of sight and doe's not fall off the cabinet.", "verified": true, "helpfulness": "0/0", "author": "Donald Rezendes"}, {"rating": 5.0, "review": "Love it, but disappointed that it doesn't support Amazon Prime/Lovefilm in the UK. Really wanted to get the Amazon stick, but they were out of stock before Christmas. A really brilliant gadget, but would be even better if it supported Lovefilm.", "verified": true, "helpfulness": "0/0", "author": "Roger Jones"}, {"rating": 5.0, "review": "Good product and price, fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Leondis J. Redwine II"}, {"rating": 2.0, "review": "the remote control doesn't really work too good", "verified": true, "helpfulness": "0/0", "author": "R. Ridley"}, {"rating": 5.0, "review": "Works great so far.  Set up was fast and easy", "verified": true, "helpfulness": "0/0", "author": "Artie M."}, {"rating": 1.0, "review": "Its never really worked well since the day I installed it.  I have a previous Roku 2 that has pretty much been flawless since day one.  I wanted something for a second TV and thought the stick would be perfect.  Unfortunately, its far, far from perfect.  It pauses and buffers a lot and its on the same network as the Roku 2 which works perfectly.  It freezes up and must be reset, which is not that easy due to it being tucked away behind the wall mounted TV.  The remote is terribly unresponsive, and many times simply doesn't work at all.  The Amazon video application frequently just goes out to lunch, flashing strange colors on the screen and going back to the Roku home screen.  Once it goes in to the weeks, the Roku must be reset before it works again.Quite simply, its been terrible and I wish I had never bought it.  Do yourself a favor, buy something else.  If you must have a Roku, buy one of the regular streaming players, not the stick.", "verified": true, "helpfulness": "0/0", "author": "F1 Fan"}, {"rating": 3.0, "review": "The roku itself is a great product and has been working great with no faults but I cannot say the same for the remote, it has been faulty since day one and I have struggled to keep it working for longer than 20 minutes. I am dissapointed to say the least. But I have been using my phone as a remote and that has been working great.", "verified": true, "helpfulness": "0/0", "author": "David Quintana"}]