[{"rating": 2.0, "review": "I love Roku, but the stick won't respond to either the remote app on my phone or the remote that came with it. Very frustrating.", "verified": true, "helpfulness": "0/0", "author": "putaqueso"}, {"rating": 3.0, "review": "Everything works in the beginning and then the remote stopped working. So I use my phone to control the roku", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 4.0, "review": "Great addition to my TV, easy to install and activate. Love all the free movie channels, but most of the free movies are older or never heard of. The control is also very annoying to use when trying to type in order to search, otherwise great product.", "verified": true, "helpfulness": "0/0", "author": "Arn"}, {"rating": 5.0, "review": "Awesome...Had Google Chromcast stick for about a year...but after purchasing this I can't go back.  So many channels that can be accessed directly from your TV.  The remote makes this my best buy of the year.  Highly Recommended!!!!", "verified": true, "helpfulness": "0/0", "author": "rymar945"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "tinlizy"}, {"rating": 5.0, "review": "Good Stick and works really well.", "verified": true, "helpfulness": "0/0", "author": "Avery Tidlund"}, {"rating": 4.0, "review": "sorry about last review the control does work, but for some reason it ate my batteries!I had to connected with the roku stick 2 times to make it work!", "verified": true, "helpfulness": "0/0", "author": "pat 69"}, {"rating": 4.0, "review": "I've used this quite a bit, mainly for Netflix, and I like it but have had some problems.It's definitely a little slow/laggy which is not really a big deal, but I'm sure the more expensive Rokus would be snappier.I've had a lot of problems with wifi interference with the remote.  For awhile the remote basically wouldn't work at all and I thought the whole thing was broken, but after talking to tech support, I changed the broadcast channel on my wireless router and it has improved.  I still have issues with commands not going though even though the remote and stick are not far apart.There is also no easy way to do desktop mirroring as far as I know on the Roku stick.While this has been a pretty good option for me, if I was buying again, I'd look into other options.", "verified": true, "helpfulness": "0/0", "author": "Paige"}, {"rating": 3.0, "review": "Not very far from my router, yet sometimes the shows buffer as I watch them...I do have enough internet speed too.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "The Roku 3500XB is a wonderful device to consolidate your TV subscriptions and much more. With HBO, Sling TV, The Blaze, Netflix, Amazon, and Google Play you can have all your high end cable TV style shows in one unit. Roku also has thousands of additional channel's you can download. The Roku streaming stick is great while traveling or taking to another home or cottage, all you need is a wifi connection to access all the content. Depending on your TV setup I would recommend getting a 90 degree adapter to keep the Streaming Stick from protruding from the side or the back of your TV, especially if your TV is wall mounted.The Roku stick requires a power supply which can be either a USB attached to the TV or by a wall plug. If you choose to use and if your TV is capable I recommend the USB connection. However, every time the TV is turned off the Roku will need to restart every time the TV is turned on and can take up to 3 minutes to restart. If this is a problem, then I recommend the wall plug that comes with the device.The remote is well laid out, however the back button and home button are positioned next to each other which can result in accidentally  leaving the program or application you are on. Besides that small issue the remote always keeps a connection to the Streaming stick even while in other rooms.I recommend the Roku stick over other devices. because of the lower price you still get a great product with few downsides compared to the larger Roku devises.", "verified": true, "helpfulness": "0/1", "author": "Sean"}]