[{"rating": 5.0, "review": "Very useful and practical,thanks", "verified": true, "helpfulness": "0/0", "author": "riqui"}, {"rating": 2.0, "review": "We have to take the batteries out and put them back in to make it start working again.", "verified": true, "helpfulness": "0/0", "author": "Dawn Angulo"}, {"rating": 2.0, "review": "Overheats and loses connection. Remote works when it wants to.", "verified": true, "helpfulness": "1/1", "author": "BCDrummin"}, {"rating": 5.0, "review": "No surprises here", "verified": true, "helpfulness": "0/0", "author": "Roxanne Coffey"}, {"rating": 5.0, "review": "Delivered quickly and exactly as represented. Works great", "verified": true, "helpfulness": "0/0", "author": "Dana"}, {"rating": 3.0, "review": "The Roku I bought has a terrible time connecting to my wireless network. There is little information telling you to carefully select the wireless channel on your existing wireless network. This thing only really works well on channel 11 for me. I have a lot of neighbors as I live in a neighborhood of townhouses with many networks. The channels that this device operates at is a busy one in my neighborhood. I constantly have issues with other devices using this channel in my house, which includes multiple phones, tablets, computers and gaming devices. I pretty much gave up on this and gave it away to a friend who didn't have anything better. I would suggest if you are planning on purchasing one of these devices, that you use a wireless channel analyzer to see if your neighbors networks will be interfering with your connection upon setting up your network to work with this device. The main reason I purchased this was for the Spotify app which my PS4 didn't have when I bought this, which it now has. My playstation has no issues at all with different channels.", "verified": true, "helpfulness": "0/0", "author": "Christopher Steven Morris"}, {"rating": 5.0, "review": "Love it. You can't go wrong with Roku. I have two! And am sorry I was tempted to buy Apple TV.", "verified": true, "helpfulness": "0/0", "author": "mosaicmuse"}, {"rating": 4.0, "review": "The Roku stick works just fine. Plugged into tv usb power makes it take some time to boot every time you turn on the tv, but it's not as bad as some reviews led me to believe.Beta screen cast from my LG G3 didn't work well when I tried it, but regular Roku channels work fine.Sometimes the remote seems to become unpaired from the stick, and I have to take the batteries out of the remote to get it to reset.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Really enjoing it, even though most of the content not available in my country (Israel). It gives DTS and Dolby Digital sound, which is something the Chromcast didn't have. Too bad I can't get the android app (not available in my country for some reason).", "verified": true, "helpfulness": "0/0", "author": "Yonatan"}, {"rating": 5.0, "review": "Does as advertised,very happy with product at fair price.", "verified": true, "helpfulness": "0/0", "author": "marcreardon"}]