[{"rating": 5.0, "review": "I have a Roku 2 Player for my living room TV and it is lightning fast with turning on, connecting to channels, etc. But, there is the small box, the bulky wires and an electric plug-in adapter with the Player units. So, I decided to go with the Stick for my bedroom TV, as I wanted something compact with the least amount of visible wires.PROS: The Stick is a great little gadget. I am able to plug  the USB power connector right into my TV, thus eliminating the need for another cord strung across the floor to an electrical outlet. (Per the user manual: Not all TVs have enough power to do this, or may not even have a USB hub on the TV, so double-check your TV if it's important to have the simplest hook-up option for the Stick.) Also, it doesn't extend very far from the back of the TV, it's small and I'm pretty happy with it. Once it cycles after being turned on, it connects quickly to whatever channel you want to watch.CONS: A bit sluggish and slower to connect after first turning on compared to the larger Player devices. I called Roku about this, and as I  suspected, the internal processor is not as quick to initially activate each time you turn it on as the Players, due to the fact the Stick is a smaller, more compact unit. So, you will give up a little wait-time - maybe only a minute maximum, for the processor to connect. I can live with this as again, the compact size and minimal wiring is a plus in my bedroom's hook-up situation.CONS -LITTLE TEMPERAMENTAL with Slingbox app connection: Another issue is that the Stick has trouble recognizing and connecting to my Slingbox app if I have been watching it on my living room TV. Like tonight ... even though I've pretty much figured out the idiosyncrasies of switching between my living room TV, and then my bedroom TV if watching my Slingbox, the Stick can be temperamental in recognizing and connecting to the Slingbox channel. I have learned to wait about 5 minutes between switching from one TV to the other (again if viewing something on my Slingbox). But even with waiting, sometimes I have to log into, then log out of my Slingbox account a couple of times via my android device (there are only 2 ways to link a Slingbox with Roku - through an iPad or iPod, or an android phone at this point in time - check out the Slingbox website for full info on this - and you have to purchase the Slingbox app in order to connect via a Roku device) to finally get the Stick to recognize that it is supposed to connect. Bothersome, yes, but it does teach one to be patient! LOLBut all-in-all, I do recommend the Stick if \"small and simple\" and/or a little lower price is what you're looking for.", "verified": true, "helpfulness": "0/0", "author": "BizzyEnuf"}, {"rating": 5.0, "review": "Great addition", "verified": true, "helpfulness": "0/0", "author": "Diane B Andersen"}, {"rating": 5.0, "review": "Does more than expected.  It's great to be free of pay TV.", "verified": true, "helpfulness": "0/0", "author": "Carole Calle"}, {"rating": 5.0, "review": "Mistakenly bought a flat screen that fooled me into thinking it was a Smart TV from its packaging.  Much more careful now.  Roku rescued me.", "verified": true, "helpfulness": "0/0", "author": "Marion L. Carroll \"MBC doc\""}, {"rating": 2.0, "review": "Had to send back- kept freezing on a daily basis. I upgraded to the Roku 3 and have had no problems!", "verified": true, "helpfulness": "0/0", "author": "Alaina Williams"}, {"rating": 5.0, "review": "Just what I wanted", "verified": true, "helpfulness": "0/0", "author": "ECW"}, {"rating": 2.0, "review": "Roku sticks remote keeps locking up.", "verified": false, "helpfulness": "1/1", "author": "Debra J. Schoonover \"Book worm\""}, {"rating": 4.0, "review": "The streaming is wonderful. It was easy to set up with my hulu, neflix, amazon accounts. I had some trouble initially, but, that was because I had a malfunctioning modem with only 1-5 Mbps on a good day! I can't give this 5 stars because the remote is terrible. I have to constantly re-set it, take the batteries out, or re-synch it to make it work. It's not a huge issue. But, it is a hassle that detracts from the experience.", "verified": true, "helpfulness": "1/1", "author": "Charmaine C"}, {"rating": 5.0, "review": "It works as advertised!", "verified": true, "helpfulness": "0/0", "author": "Peter Davis"}, {"rating": 4.0, "review": "these were gifts so I don't know if they are any good. But I love my Roku", "verified": true, "helpfulness": "1/1", "author": "palmcoaster"}]