[{"rating": 4.0, "review": "It would easily be a five star review, if not for the slow interface. YouTube is painfully slow transitioning between submenus. The main interface is slow, too. That said, a brilliant little device that has been the perfect (well a faster one preferred) solution.", "verified": true, "helpfulness": "0/0", "author": "Ben Carpenter"}, {"rating": 5.0, "review": "Love Roku.  I am an Apple fan but Roku has it all over Apple TV's. This is probable the way things will go in the future. So many channels to chose from.  The only difference between this and the Roku 3 is there is no games and no earphone in the remote.  You can like Apple TV download the app on smartphone to use your phone as a remote", "verified": true, "helpfulness": "1/1", "author": "Regina Harwell"}, {"rating": 4.0, "review": "Good enough.", "verified": false, "helpfulness": "0/0", "author": "Daniel Claudio"}, {"rating": 4.0, "review": "Seems to work well and is certainly easy to install. Quality or rather reliability seems to depend on the quality of the WIFI network.", "verified": true, "helpfulness": "0/0", "author": "inger easton \"peace monger\""}, {"rating": 5.0, "review": "Streaming Stick is one of the best gifts ever received says my giftee.", "verified": true, "helpfulness": "0/0", "author": "jean e frick"}, {"rating": 5.0, "review": "great features", "verified": false, "helpfulness": "0/0", "author": "ajs"}, {"rating": 5.0, "review": "A little slower that my Rodu 3, but works nicely.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Extremely easy to use and set up. I like this better than my smart tv. Easier interface.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "The best entertainment decision we have made. We will never go back to cable TV. My only regret is that we didn't switch to Roku sooner. I've cut my bill by 85% thanks to this device. It arrived on time and in perfect condition. 5 stars easily.", "verified": true, "helpfulness": "0/0", "author": "OmegaThaMajestik \"Mega\""}, {"rating": 5.0, "review": "Love it-very easy to set up'", "verified": true, "helpfulness": "1/1", "author": "Kathy D Mills"}]