[{"rating": 3.0, "review": "I've had this for a little over a month now and here are some of the issues I have ran into.Let me start off by saying I love Roku and have had Roku boxes almost from the start.I have this and a Roku 2.The Roku stick is hooked to the TV in my bedroom and my Roku 2 is on the front room TV.I have had over the years 6 Roku devices.Now on to the issues.1) The remote stops working for no reason, i've replaced the batteries several times but still have the issue.2) I will watch a show on Hulu and then try to watch something on Netflix and it will set at 25% loading.Only fix I have found for this is to restart the Roku.3) Hate the remote I enjoy the remote on my Roku 2.Love Roku but this was a miss.The only thing I can think of why I have issues switching between services is memory, if there was a microSD card slot to boost the memory it might help.What I would love to see in the future:Better remote.More memory or at the very least a microSD card slot.", "verified": true, "helpfulness": "0/0", "author": "Thöm Frost"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Lucy \"lynn\""}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Louie"}, {"rating": 4.0, "review": "worked ok but the power seems to cut out alot", "verified": true, "helpfulness": "0/0", "author": "Kim C."}, {"rating": 5.0, "review": "I've watched the first 9 seasons of Grey's Anatomy on my big screen in 1 week. Roku is the best thing that's ever happened to me. I keep losing the stupid little remote and it's a tragedy that it doesn't control volume, but otherwise this little buddy is a miracle.", "verified": true, "helpfulness": "0/0", "author": "J. Wilkinson \"J Wilk\""}, {"rating": 5.0, "review": "No problems at all!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 3.0, "review": "For the price, it is convenient, easy to use and set up.  However, it \"freezes up\" often when selecting movies, tv programs and browsing.  I have to completely pull the batteries out of the remote and reinsert them which fixes the problem and reconnects the remote with the roku stick until the next time it freezes.  Since the steaming stick goes on the back of the tv and is not visible, I am wondering if the tv is blocking the remote from \"seeing\" the streaming stick and causes connection problems.  Maybe this is not a problem with other Roku devices that are more like modems.", "verified": true, "helpfulness": "0/0", "author": "chris p"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "PASQUALE DISCENZA"}, {"rating": 5.0, "review": "I love this! Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Luca"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Ann Ellis"}]