[{"rating": 5.0, "review": "Easy set up.  It also lets you screencast samsung galaxy products which it pretty cool!", "verified": true, "helpfulness": "0/0", "author": "David D"}, {"rating": 2.0, "review": "Very slow and kept dropping the internet connection. I'll stick with the boxes. Much better imo.", "verified": true, "helpfulness": "0/0", "author": "Bountyhunter"}, {"rating": 5.0, "review": "this is a excellent product I recommend it 100%", "verified": true, "helpfulness": "0/0", "author": "Niller"}, {"rating": 4.0, "review": "My previous experience with Roku players are the Roku SD and the Roku 1. Both are relatively stable and I've only had to reset them intermittently. I purchased this streaming stick specifically for use with my projector that I travel a lot with so I didn't have to use a seperate power adapter. In almost all cases, this unit DOES require beyond what is provided from HDMI. It has a mini-USB plug but with the projector I have USB ports so I can just use that. It is mildly annoying to have an extra wire hanging from it. In a permanent installation behind a TV, you would probably never see it. Connecting this unit to a USB port on your TV will result in the unit turning completely off when you shut off your TV and taking 30-45 seconds to boot up. Again, nothing bad but just something to know before you buy. I was used to the \"it never really shuts off\" mode of my Roku boxes so having to watch a boot screen was new to me. And of course don't forget that this unit uses it's own proprietary bluetooth remote so until universal bluetooth remotes are common, you're stuck with the factory remote. Overall it functions in almost identical fashion to a Roku box and would clear some clutter from an entertainment center. For my money, if I was installing this on a TV; I would just go with a Roku 1.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Love it works great", "verified": true, "helpfulness": "0/0", "author": "Rosa Rodriguez"}, {"rating": 3.0, "review": "It was bought for my husband as a gift...I haven't given it to him yet. I will do a review next week after I give it to him.Thank you....Sheila Zimmer", "verified": true, "helpfulness": "1/1", "author": "Scottishgirl1"}, {"rating": 5.0, "review": "So far so good!", "verified": true, "helpfulness": "0/0", "author": "Jo Anne"}, {"rating": 5.0, "review": "Works beautifully on our smart TV.", "verified": true, "helpfulness": "0/0", "author": "Angela"}, {"rating": 4.0, "review": "I thought I was going to have to return it during set up, it seemed really glitchy and quite broken. Had it set up for a couple weeks and its been great. Very happy I got one.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "It great. My only regret is waiting so long to get it. One time fee of $40 + $8/month forhuluplus and all the tv shows and movies I can possibly watch. Its great. There is also an app for my android so I don't have to use the remote, my phone can function as the remote, way convenient some times.", "verified": true, "helpfulness": "0/0", "author": "Smoovee \"Smoovgee\""}]