[{"rating": 1.0, "review": "Unfortunately, after I purchased this stick, I found out that it can only be used for a TV screen not a laptop.  Like I thought I could connect to my hdmi port on my laptop.  I then tried to connect the stick to my brother-in-laws monitor to active and then received an error code.  Before I send an email for support to Roku, I had already tried the information they provided on the email they sent.It would be nice if on the advertising it would state that the stick is not to be used on a laptop directly and instead state that the stick be connected only to a TV screen for activation and use.", "verified": true, "helpfulness": "0/2", "author": "alice heydt"}, {"rating": 5.0, "review": "Delivered on time and in condition advertised.  Unit was refurbished but looks like new. easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good price and quick delivery.  Roko stick works as advertised.  We are still experimenting and figuring it all out.  A little annoying to need to go to a website to sign up for many channels, but I guess that is understandable.  Some of the channel websites are not as easy to navigate as you would hope.  We haven't cut back on cable yet, but I can see how that will be the next step once we get more familiar with what is available here.", "verified": true, "helpfulness": "0/0", "author": "Christine Billings"}, {"rating": 1.0, "review": "Only worked for one week!", "verified": true, "helpfulness": "0/0", "author": "David Mazzant"}, {"rating": 5.0, "review": "Been watching shows from Plex daily! Love it!", "verified": true, "helpfulness": "0/0", "author": "miltongoh"}, {"rating": 1.0, "review": "Horrible!Stay away from this piece of junkOnly connects through wifi-I have 40 mb wifi in room and it refues to connect properly-It says the wifi connection is excellent but won't load any content-Super long wait time for help and my problem was never fixedNow past the return period and I'm out $50- with a non functioning stick-", "verified": true, "helpfulness": "0/1", "author": "Pen Name"}, {"rating": 4.0, "review": "Takes a while for it to start up. Overall, it has changed how I watch TV. Only 4* because it doesn't allow internet browsing capabilities.", "verified": true, "helpfulness": "0/0", "author": "Nate N."}, {"rating": 2.0, "review": "This device worked great for the first two weeks. There was no lag, no constant buffering, no problem. After that it suddenly began degrading in video quality. I thought it was my router connection, but I have no problems with the connectivity on my phone or laptop, and my house has people frequently accessing the Wi-Fi, but none of them had a problem either. My only guess is that it must be the Roku device itself and I have no idea what would have caused this. I have messed around a bit with my router but to no avail. This roku device now gathers dust on my desk till I can decide what to do with it.", "verified": true, "helpfulness": "0/0", "author": "Hunter K. Link"}, {"rating": 1.0, "review": "the stick is great, but there is something with the remote it has, as I have to reset it every single time I use it, thats not good and a very headacke, not sure if this remoe is damage or if is always like this for every single stick", "verified": true, "helpfulness": "0/0", "author": "Victor Vasquez"}, {"rating": 3.0, "review": "Heat fails when plugged into HEMI on rear of  my 50 in. Led.. Had  to run HEMI extension and female to female adapter to place it away from the heat of the screen.", "verified": true, "helpfulness": "0/0", "author": "Todd"}]