[{"rating": 5.0, "review": "Love this, works great!", "verified": true, "helpfulness": "0/0", "author": "C. Schmidt"}, {"rating": 2.0, "review": "After having bought 4 'normal' Roku's, I bought this 'stick' version because I recently mounted my TV on the wall, there's nothing under the TV to sit the Roku box on, and I didn't want to sit the Roku on the floor and have that wire running up the wall. The stick version has the same features that the normal version has, but it has one SERIOUS drawback -- the remote. The stick's remote must be 'paired' with the stick itself, but what I found (and what many other people have commented on) is that the pairing gets screwed up. For me this is almost with EVERY USE of the Roku. At some point the remote just stops working. And don't be fooled by the standard instructions on how to remedy this, i.e. just open the back and push the pairing button. Sometimes that works, but usually it does not. Even powering the Roku totally off and removing the batteries from the remote does not help. For me, usually the only thing that helps is to fire up the Roku app on my smartphone, go into settings, and tell the Roku to re-pair with the remote. This fixes it for a while but it'll stop working later -- guaranteed. Some people say this is due to radio interference, but I've had this happen to me when there is absolutely nothing else in the room except the TV and the remote.The other drawback of the stick version is that it is powered by the TV's USB via a cable. When I turn the TV off, the power to the Roku goes off as well, which means that the next time the TV is turned on, I must wait 2-3 minutes for the Roku to finish init'ing before it's ready to use. My Windows computer boots up quicker that this Roku. I don't understand why the Roku takes so freaking long to get itself ready to use. Yes, they say that you can power the Roku from an adapter plugged into the wall, but that would just mean that I'd have wires running down the wall and this defeats the purpose I just stated for getting the stick.I can't see how Roku let millions of these things go to stores given the persistent problems with the remotes. I'll keep the unit since I've now learned to live with it, but sooner or later I suspect that I'll throw the remote against the wall out of sheer frustration and then be forced to use the Roku phone app to control it, which is not nearly as convenient has having a remote sitting right there on the coffee table.", "verified": false, "helpfulness": "0/0", "author": "jwl80303"}, {"rating": 2.0, "review": "I received this for Xmas and finally installed it to replace my older Roku box. I like the newer interface and that I can now get subtitles when I watch BUT the connection to WiFi is terrible compared to my older box. Must be that they can not get a decent antenna in the little stick? Also the remote is touchy. Biggest issue is that with poor connectivity it seems to default to a very low resolution picture without providing any feedback regarding the poor connection. You will also experience constant buffering and delays making programs essentially unwatchable! It may be fine if you are close to the wireless router but if you're any distance away, you'll have issues.", "verified": false, "helpfulness": "2/3", "author": "Amazon Addict \"Amazon addict\""}, {"rating": 4.0, "review": "This was a gift to my sister. SHe says that it is working well !", "verified": true, "helpfulness": "0/0", "author": "Cheryl Hinton \"Consuelo\""}, {"rating": 5.0, "review": "Got this for my mother-in-law. I myself have a Roku 3 but honestly this one may be better for 1 simple reason. 5ghz wireless. If you live in an apartment it will make a world of difference. On my 50mb internet I can download 11mb on 2.4ghz and 50 on 5ghz. Due to this, the only reason the Roku 3 is superior is because you can plug in an external HDD and play games.", "verified": true, "helpfulness": "0/0", "author": "Sunshine"}, {"rating": 5.0, "review": "Worked perfectly!", "verified": true, "helpfulness": "0/0", "author": "brass70065"}, {"rating": 5.0, "review": "Fabulous product!", "verified": true, "helpfulness": "0/0", "author": "Ben B."}, {"rating": 5.0, "review": "Easy to set-up and use! Cost effective", "verified": true, "helpfulness": "0/0", "author": "Jmanman"}, {"rating": 4.0, "review": "Very good and useful item! I mainly use it for Netflix and Amazon prime; however, the number of functions available is excellent. The only reason why do not give it five stars is because it still can't do certain features that ChromeCast can do but it does surpass ChromeCast in various ways!", "verified": true, "helpfulness": "0/0", "author": "Warwrecker"}, {"rating": 5.0, "review": "Goodbye Cable.......", "verified": true, "helpfulness": "0/0", "author": "Dale"}]