[{"rating": 5.0, "review": "Easy instructions to follow! Love it!", "verified": true, "helpfulness": "0/1", "author": "Branda Jo Gray"}, {"rating": 5.0, "review": "Love it! I bought it for my mother so we can watch the JW Broadcasting together as a family. But now we can listen to music add movie channels and everything.", "verified": true, "helpfulness": "0/1", "author": "SHANTE FOLEY"}, {"rating": 4.0, "review": "I love my roku.  they are easy to use easy to set up.  and I have one on every tv in my home and I also travel with it.", "verified": true, "helpfulness": "0/1", "author": "karon johnson"}, {"rating": 3.0, "review": "I was a little nervous because of this being a refurbished unit, but it worked great.  The only reason I rated this a 3 stars, I have a Roku 3 and I love it a tad more.  The interface is way better and much more fluid.  But I plan on using a Roku Stick on one of my other tvs and using it to travel with.  it is very convenient and easy to use.  I love Roku.  I have canceled my Dish Network (which I did love until it was 90.00 a month)", "verified": true, "helpfulness": "1/1", "author": "Me"}, {"rating": 1.0, "review": "This product arrived damaged. The cord for the Roku was not properly manufactured.", "verified": true, "helpfulness": "0/0", "author": "cheyhene miller"}, {"rating": 4.0, "review": "Like the concept, has worked for over a year, I wish you could turn it off.  Every now and again it feels and you have to unplug and reset", "verified": true, "helpfulness": "0/0", "author": "mc"}, {"rating": 5.0, "review": "Awesome little device that lets you pick up all the applications you need and want for your entertainment purposes!", "verified": true, "helpfulness": "0/1", "author": "therock3283"}, {"rating": 1.0, "review": "Waste of your money.I bought it when i really needed a rook. my family has Roku 3 in living room and i needed one in my room TV. I thought this wireless one will work fine.IT KEEPS DISCONNECTING FROM WIRELESS ALL THE TIME. I hate it when it happens in the middle of a movie on Netflix. I keep rebooting, as the roku help suggest, but over and over again, it fails to stay connected.The sucking part is that when i go in settings to check my network connectivity, it shows \"Excellent connection\" but never can stream anything.my laptop uses the same wifi, my phone uses wifi in-house, they are always connected, no disruption.IF YOU WANT A ROKU, BUY THE STREAMING VERSION WITH ETHERNET CABLE, INSTEAD OF WIRELESS. Rook needs to step up their wireless game.Note: I don't usually do reviews, I do them when i extremely satisfied or extremely UNHAPPY with a product.", "verified": true, "helpfulness": "2/2", "author": "Paulin Hakizimana \"Ez-p\""}, {"rating": 5.0, "review": "Love this little thing, easy to use and works awesome with our set up!", "verified": true, "helpfulness": "0/1", "author": "Bethany"}, {"rating": 1.0, "review": "This by far the worst peice of electronic garbage I have ever bought. The remote doesn't wrok properly half the time. It forgets the wifi connection and you have to reset up the entire system daily. I finally decided to quit useing the damn thing.", "verified": true, "helpfulness": "1/2", "author": "brandon"}]