[{"rating": 5.0, "review": "I purchased this to use amazon instant video on my bedroom sony tv which does't have inter web capability. Was easy to connect to the tv and my wireless, and works great. I downloaded a 2 hr 10 min movie to watch and it downloaded in under 10 seconds. Granted, that probably has a lot to do with my wireless and cable connection speed, but just thought I'd put that out there.At the same time I purchased a samsung linkstick for my living room tv, (which has inter web compatibility), only to find out samsung doesn't support amazon instant video. Fortunately, roku can be easily and quickly transferred between multiple tv's! Yay Roku!I'm pleased with this purchase and think you will be too.", "verified": true, "helpfulness": "0/0", "author": "Winsum"}, {"rating": 1.0, "review": "This was a terrible purchase! I bought it because my Apple TV has a limited number of channels; however, the Roku crashes and/or reboots so often I typically never have a chance to use it and end up switching back to the Apple TV just so I can actually watch something. As an example, just trying to access Netflix will typically cause at least 4 crashes of the Roku, assuming you get it to work at all. The remote is slow to respond. Overall a big disappointment that I would not recommend to a friend or an enemy.", "verified": true, "helpfulness": "0/0", "author": "R. D. Bates \"House of Drama\""}, {"rating": 2.0, "review": "Update:  just for clarification, I bought this from a big box retailer and the review is solely on the device and not Amazon.This is my third Roku device and I love Roku. This stick worked great for 4 months and then it started constantly rebooting. It tried it on another tv just to make sure the problem was with to stick and not the tv and still have the same issue. This stick only has a 3 month warranty so I'm out of luck. Spend a few extra bucks and get a Roku 2 or 3 instead of this thing.", "verified": false, "helpfulness": "0/0", "author": "Darren S."}, {"rating": 5.0, "review": "Excellent gadget for the price", "verified": true, "helpfulness": "0/0", "author": "Napoleon  Q. Elizondo"}, {"rating": 5.0, "review": "We got rid of cable in favor of our roku.  With netflix and hulu and a few other apps, we get all the programs that we need.  And it is much cheaper than our old cable bill!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Daydremes\""}, {"rating": 2.0, "review": "I bought the Roku Streaming Stick as soon as it was available, in March of this year.  This week (almost exactly 6 months later) it died.  Looking through the other reviews now (there were very few at the time) I see that this is not an unusual event.  It is a shame, since it offered access to a wide range of channels, and reasonably good reception with very little lagging.  Setup was fairly easy.  The remote is wi-fi based and there were no pairing or interference problems.  So what happened?  The stick got VERY hot one evening, and that was that.  Having run through all the suggested remedies by customer support and online advice, it appears something burned out.  At 6 months, the 30 day return policy by Amazon, and 90 day warrantee from Roku are long gone.  But, $50 every 6 months seems like a lot to pay.  Caveat emptor.", "verified": true, "helpfulness": "0/0", "author": "Dr. D."}, {"rating": 5.0, "review": "I love it. Between this and a digital tv antenna I will never need cable again!", "verified": true, "helpfulness": "0/0", "author": "E. Ziegler \"darn college kid\""}, {"rating": 5.0, "review": "the stick still needs to be plugged into the wall.  i like the new short cut buttons on the remote.", "verified": true, "helpfulness": "0/0", "author": "karen frances ulrich"}, {"rating": 5.0, "review": "I am a single mom and set it up by myself in a very short period of time with no issue! My 5 1/2 son uses it for Netflix with ease! We could not be happier with it! Great value!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Bell \"Kissthechef\""}, {"rating": 4.0, "review": "A full Roku in a tiny package. My only complaint are the annoying buttons for specific services (mostly ones I don’t use) on the remote, which my Roku puck remote thankfully lacks. This remote also lacks a headphone jack like the regular Roku remote, which can be handy. But I got the Stick for a room where the headphone jack wouldn’t be useful as often.", "verified": false, "helpfulness": "0/0", "author": "Robert Fisher"}]