[{"rating": 4.0, "review": "I bought this for the convenience of being able to take it anywhere without the added bulk.  It fits perfectly in my carry on even with the adapter.  The only problem I have is that I have to pair the remote and stick about once a week.", "verified": true, "helpfulness": "0/0", "author": "DG"}, {"rating": 5.0, "review": "Very happy thank you", "verified": true, "helpfulness": "0/0", "author": "Liz Deery"}, {"rating": 1.0, "review": "Terrible Product...Do not buy!", "verified": true, "helpfulness": "1/2", "author": "Timothy D Turnmire"}, {"rating": 5.0, "review": "Love it !", "verified": true, "helpfulness": "0/0", "author": "Virginia L. Cook"}, {"rating": 4.0, "review": "Love the Roku. I have the Roku 3 in my livijng room. It's a little slow on delay, but otherwise great product. Just wish it would keep my passwords when I have the two paired up.", "verified": true, "helpfulness": "0/0", "author": "Beach Queen"}, {"rating": 5.0, "review": "It has been one of my best inversion in entertainment, I bought it from Panamá and now I'm washing US channels  movies in Netflix ( a lot of movies and series).Easy to configure, and portable.", "verified": true, "helpfulness": "0/0", "author": "Jose A"}, {"rating": 5.0, "review": "I love the Roku Stick!  It's way cheaper than cable or satellite!  It does so much.", "verified": true, "helpfulness": "0/0", "author": "Robin Marie Feuti"}, {"rating": 5.0, "review": "Nice product although I am liking the Roku 2 and especially the 3 but if you can't afford them then the stick is a great alternative and very portable. I love my Rokus", "verified": true, "helpfulness": "0/1", "author": "Cynthia Johnson"}, {"rating": 4.0, "review": "The product came as expected in great condition for a factory refurb.  Would have gotten 5 stars if the batteries they sent with the remote weren't dead!", "verified": true, "helpfulness": "0/0", "author": "firez037"}, {"rating": 5.0, "review": "Exactly what we wanted! Came in an official roku box and everything was there. On time delivery!", "verified": true, "helpfulness": "0/0", "author": "Bethany Kocmich"}]