[{"rating": 5.0, "review": "Worked perfectly!!!", "verified": true, "helpfulness": "0/0", "author": "Shannon Wiech"}, {"rating": 1.0, "review": "I received the Roku Stick as a gift this Christmas. Given the competition in streaming devices, I expected setup to a breeze, boy was I wrong.. For the first 10 minutes, we were unable to connect to our home's wireless network.. we connect to the same network with our phones/ipads from the same room with no issues. We looked online for a solution and discovered its not an altogether uncommon occurrence. So we followed the directions, went into a 'secret' setup screen, turned off network pings.. still didn't work. We then reset the whole thing, and that's when the remote stopped working completely. I know it's the thought that counts but I kinda wish I had just gotten a $50 gift card or something, this thing is now in the trash.", "verified": false, "helpfulness": "0/1", "author": "Janos Audron"}, {"rating": 5.0, "review": "Might be to wide and block adjacent HDMI inputs", "verified": true, "helpfulness": "0/0", "author": "Michael E. Dennis"}, {"rating": 1.0, "review": "It was the worst purchase I ever made from Amazon.  The product stated all I needed for this to work was: high speed internet, wireless router, and a TV with HDMI port and start streaming.  Met all requirements and was never able to get it to work even when trying to configure using the \"secret\" screens.  It was definitely not easy or plug and play.  I recommend staying away from this product unless you want to be frustrated and unsatisfied.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Loads often but when it wants to it works well.", "verified": true, "helpfulness": "0/0", "author": "Shanelle D. james"}, {"rating": 2.0, "review": "I purchased this for my father's TV, in hopes that he could use it to watch Netflix.  However, after spending over an hour trying to set it up, and having issues left and right, I ended up returning it.  If I'm going to have issues with it, there's no way my father (with very little technical capabilities) is going to be able to use it.OK, so what went wrong?  1) I couldn't even complete the set up.  It would connect to the wireless network (Linksys WRT160N), and get to the point of downloading the update, and then fail right at the end of download.  Apparently, this device is quite particular about the network it's connected on.  I do not have any problems with my father's wireless router otherwise.  We have many devices, including laptops, tablets, phones, and other TV streaming devices connected, and they all work fine.  I was able to get past this issue after resetting everything (cable modem, router, and Roku).  2) Once I got into the system, it would freeze up every so often while navigating through Netflix.  I could not tell what was causing this issue, but sometimes would freeze up long enough that I would have to unplug the Roku and plug it back in.  3) Every time I went to check for the latest update, it would give me an error.  Again, something about not being able to connect to the network (even though it was clearly connected since I was able to navigate Netflix).  Then it would lock up.I purchased the Roku at Target and was able to return it the next day.  I am going to give the Fire TV stick a try next.", "verified": false, "helpfulness": "0/0", "author": "D. Khoo"}, {"rating": 5.0, "review": "Worked as expected. This was my second Roku Stick. Love it.", "verified": true, "helpfulness": "0/0", "author": "tony r."}, {"rating": 5.0, "review": "I have had great luck with this product so far. Bought it to replace my cable service. I usually use Netflix or Amazon Prime to watch shows and movies with it. Easy enough for my 4 year old daughter to turn her own shows on. Was easy to set up.", "verified": true, "helpfulness": "1/1", "author": "kati marcotte"}, {"rating": 5.0, "review": "works really wellmy daughters both have the Roku and are very happysuper easy to set up and was able to use right away", "verified": true, "helpfulness": "0/0", "author": "kim"}, {"rating": 5.0, "review": "BEST ROKU YET!", "verified": true, "helpfulness": "0/0", "author": "RGiese"}]