[{"rating": 5.0, "review": "This is awesome.", "verified": true, "helpfulness": "0/0", "author": "Winnie"}, {"rating": 1.0, "review": "you should let people know before purchasing that the stick is huge and may not fit in some  TV's I ordered this waiting for over a week for it and now there isn't room for me to plug it in to my tv", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Marshall"}, {"rating": 5.0, "review": "Great price!", "verified": true, "helpfulness": "0/0", "author": "Geneva Barbour"}, {"rating": 1.0, "review": "Save yourself a lot of disappointment.  Sign up for Netflix for $7.99 per month.  Also, consider running a HDMI cable from your laptop to your smart TV. Then you can watch full tennis matches, and bunches of other programming easily without the Roku headaches and $$advertisements.", "verified": true, "helpfulness": "0/0", "author": "Jot"}, {"rating": 1.0, "review": "I own 2 other Roku's. This one however would not pick up the wireless signal. I worked with phone company and changed channels on the wireless as suggested but that did not work either.", "verified": true, "helpfulness": "0/0", "author": "Halmahera \"Thomas A Burgess Sr\""}, {"rating": 2.0, "review": "Very unresponsive, when it works at all. I \"upgraded\" from an older 2100x but I'm sending this new one back. It reports network problems when there are none: I put it side-by-side with the 2100x on the same wi-fi to verify. (Yes, I restarted, rebooted, reset, restored everything several times.) The remote typically quits working after a minute or two. Then, I have to pull out a battery, wait a second, and put it back in to get a few more useful clicks out of it. I am able to get my phone app to talk to the Roku stick... occasionally.  Most of the time though, I get a \"not found\" message, even when I enter the IP address manually. The box says \"This is gonna be fun,\" but I've had more fun in traffic court.", "verified": true, "helpfulness": "0/0", "author": "Kirk R. Anderson"}, {"rating": 3.0, "review": "very slow compared to my other unit that is not a stick.", "verified": true, "helpfulness": "0/0", "author": "Michael T Urban"}, {"rating": 2.0, "review": "meh. Sometimes Netflix doesnt work, and the remote crapped out over a month, so I have to use the app's remote control. Amazon video is really awful on it, it buffers, plays, buffers, plays, etc. I dont have that problem on my xbox", "verified": true, "helpfulness": "0/0", "author": "Avery Jessup \"homebody and proud of it\""}, {"rating": 1.0, "review": "I was very disappointed with the speed of the streaming stick, very slow.  I decided to return it.", "verified": true, "helpfulness": "0/0", "author": "Frederick Cyr"}, {"rating": 5.0, "review": "Absolutely Love! I decided to try something new and go out and get the Roku stick. I have heard about it from friends and colleagues but I really didn't know the depth of what all this stick is capable of. I was with Dish Network and have recently canceled my service and I am strictly using the Roku stick. I have memberships to Netflix and Hulu, but even without the paid memberships, this offers so many free options,During my research I did not find a big difference in the stick versus the Roku 1,2 or 3. The stick is hidden behind the tv and the speed is nothing less than fast. There are over 1,200 apps available, including Netflix, Amazon Instant, HBO Go, Hulu Plus, Pandora, MLB.TV, Amazon Cloud Player, Vudu, and Showtime Anytime. There's also a cross-platform search function that combs through several major TV and movie services to find content.  I would definitely recommend this to anyone! But be aware, You will not want to get up from the couch!", "verified": false, "helpfulness": "0/0", "author": "EricaN"}]