[{"rating": 1.0, "review": "Worked the fist couple months now unable to connect to network most of the time. I also have a roku 2 and it works fine. Of course I am now out of the return timeframe.", "verified": true, "helpfulness": "1/1", "author": "Dave"}, {"rating": 5.0, "review": "have 3 roku devices...", "verified": true, "helpfulness": "0/0", "author": "lynn cole"}, {"rating": 4.0, "review": "We use this a lot...works just fine.", "verified": true, "helpfulness": "0/0", "author": "Robert Johnston \"Ewok\""}, {"rating": 4.0, "review": "Still don't know what the catch is. How do they do it? Someone's loosing their shirt in syndicated TV out there but this remains legal for the moment. I buy these as gifts, $49 you can't go wrong. Thousands of programs, don't even have time to watch a fraction of what's available here. You do need that internet connection though.", "verified": true, "helpfulness": "0/0", "author": "Joshua Lutz \"JML\""}, {"rating": 5.0, "review": "Great unit for watching online material.  Cant beat the price and performance.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "It met my needs and was fairly easy to install. I would recommend it as a buy. I couldn't find a device that  would work on my Samsung TV for the same price in order to use the wireless WiFi at home so this was a good alternative.", "verified": true, "helpfulness": "0/0", "author": "carrier"}, {"rating": 5.0, "review": "Very easy to install, works great", "verified": true, "helpfulness": "0/0", "author": "mc"}, {"rating": 5.0, "review": "I have a Roku 3 on the tv in the family room and liked it so much I wanted to get another device for the living room and bedroom. After reading reviews I decided on the stick since it is easier to move around and it doesn't have to have somewhere to sit. Since I cut the cable cord I signed up for Netflix and Hulu Plus while also being an Amazon Prime member and having the Roku makes it easy. I like that the remote has some of those buttons on it making navigation easier.  The only thing that I didn't like was how hot the stick gets when it's being used.", "verified": true, "helpfulness": "0/0", "author": "Mnewt"}, {"rating": 1.0, "review": "DOES NOT WORK. Customer Service Horrible. Returned and ordered an Apple TV! Apple costs more, but worth it.", "verified": true, "helpfulness": "1/1", "author": "Kelly W."}, {"rating": 5.0, "review": "Gotta love the roku. No more $80 TV bills.", "verified": true, "helpfulness": "0/0", "author": "Mark"}]