[{"rating": 4.0, "review": "works like it should.", "verified": true, "helpfulness": "0/0", "author": "Michael L. Corentin"}, {"rating": 3.0, "review": "Works fine with limited channels in Malaysia", "verified": true, "helpfulness": "0/0", "author": "Zulkarnain Abas"}, {"rating": 3.0, "review": "Sometimes my streaming gets interrupted, my mode is getting old about 10 years old.", "verified": true, "helpfulness": "0/0", "author": "Robert L."}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "WILLIAM DUBOIS"}, {"rating": 1.0, "review": "After a lot of trial and error (with this and competing streaming products) I can say with all honestly it is worth it to purchase the Roku 3, the performance on this just does not stand up.  A few dollars more and you will be thrilled with the Roku 3 I promise!", "verified": true, "helpfulness": "0/0", "author": "Robert S. \"sham\""}, {"rating": 2.0, "review": "While the Roku stick seems to work well enough, I am trying to get my 3rd remote as the other 2 I had quit working shortly after I received them.  Customer service is not great and I have to sit on the phone FOREVER waiting to talk to someone. When I get someone they have had a heavy foreign accent and are difficult to understand.  While I can access Ruko thru my phone it is not always convenient. No problems with chromecast. So frustrating. Still on hold after 25 minutes.", "verified": true, "helpfulness": "0/0", "author": "Kathy Bohlen"}, {"rating": 1.0, "review": "Ordered new Roku and received unsealed box, missing batteries and dirty.", "verified": true, "helpfulness": "0/1", "author": "Mollie"}, {"rating": 5.0, "review": "love love love this thing!", "verified": true, "helpfulness": "0/0", "author": "griggs \"geriggser\""}, {"rating": 2.0, "review": "Love the roku overall but the remote I got stops working after a few minutes. (Taking battery out and outing it back in briefly gets it working again.) The phone app remote works reliably, but it's way less convenient than the remote on the coffee table, and not something my dad can quickly pull up.Calls to support proved useless, and I know other people whose reviews died. Wish they stuck with a simple, dependable IR remote if they can't get the WiFi remotes to work well.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 3.0, "review": "Roku works well, but have several break on me within one year.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]