[{"rating": 5.0, "review": "Works fine. A good investment.", "verified": false, "helpfulness": "0/0", "author": "John D. McGregor"}, {"rating": 4.0, "review": "My Roku arrived promptly undamaged. The installation was easy. I got memberships in all the places I needed fairly easily. I followed the instructions to get the Roku connected to my WIFI and the Roku responded well. The first thing I realized when I started using the Roku was the limited amount of movies and TV shows I could get for free. It seemed that every time I selected something I needed to pay extra for it. The second thing was there was no ‘’ SEARCH’’ in the menu as indicated in the brochures I had read.I then got into a chat with someone at Roku and asked all my questions. It took about one hour in order to get all my answers which turned out to be only one answer: you can only get all you want if you live in the USA including the ‘’SEARCH’’ feature.I then proceeded to obtain and install new USA memberships, a new IP for USA (cost of $4.31/month), and reconnected my Roku to this new USA IP and voila I had my ‘’SEARCH’’ in the menu and hundreds more opportunities for movies and TV shows.The only thing is that after all that I still have to pay extra in most cases for what I am interested in.Overall the Roku works very well technically but in real life it does not improve my viewing unless I am willing to pay extra for LULU, NETFLIX, AMAZON, etc..", "verified": true, "helpfulness": "0/0", "author": "cervotel"}, {"rating": 1.0, "review": "Poor!! This was my second Roku (had a Roku 3). Remote linking issues every time I wanted to use it. Called Roku Customer Service, they blamed my router. Funny how I have no issues with any other device including my Roku 3. I have since returned this product and purchased another Roku 3 (no issues).", "verified": false, "helpfulness": "0/0", "author": "Thomas Albanese"}, {"rating": 5.0, "review": "Easy...Peasy..so easy to get started. Crisp clear, as if I'm watching broadcast television. Quick, precise. HIGH QUALITY!  Easy to cast from my phone to the roku stick just click one button. No sync, no buffering, no having to scan to find the roku. LITERALLY just click 1 button. This is the most exciting thing I've bought in a long time.", "verified": true, "helpfulness": "1/1", "author": "Sonia walker"}, {"rating": 5.0, "review": "Love watching amazon prime on this", "verified": true, "helpfulness": "1/1", "author": "Rebecca S."}, {"rating": 3.0, "review": "The streaming is slow and it gets VERY hot. Needless to say that concerned me and called customer service. I guess they're very busy in Manila or where ever the call center is because it  took them a while and all they said, \"that was normal.\"", "verified": true, "helpfulness": "0/0", "author": "Florcandela \"Florcandela\""}, {"rating": 5.0, "review": "Great, great product! Easy to set up. As a family we have loved it!", "verified": true, "helpfulness": "0/0", "author": "Vicki Eden"}, {"rating": 5.0, "review": "Love ! Really great devise !", "verified": true, "helpfulness": "0/0", "author": "Megan Boehm"}, {"rating": 5.0, "review": "awesome!!", "verified": true, "helpfulness": "0/0", "author": "Joanz \"Myra J. Coats\""}, {"rating": 5.0, "review": "Great Item would highly recommend!!!", "verified": true, "helpfulness": "0/0", "author": "chris lafoy"}]