[{"rating": 5.0, "review": "YEA no more cable.  I was so sick of cable prices,  now with Roku I can get dozens of channels and pay for what I want.  Roku was easy to install and works well.  The streaming stick was easy to install and not another cord to trip over.  I would defiantly recommend this to anyone who wants to take contraol of what they watch and what they pay for.", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "It worked as expected. It was easy to set up and it works using my IPhone as a remote. I can use it on any of my TVs that have an HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Joe G"}, {"rating": 5.0, "review": "very convenient high picture quality", "verified": true, "helpfulness": "0/0", "author": "J. malone"}, {"rating": 5.0, "review": "If you have a strong internet signal (wireless) then this is a great bargain: fast,1080p picture,easy to install and steady connection.", "verified": true, "helpfulness": "1/1", "author": "Jacena \"johnny\""}, {"rating": 2.0, "review": "I have 2 older Rokus  and they work great in my house.  The Streaming stick has a very hard time connecting, and is not worth the effort.", "verified": true, "helpfulness": "0/0", "author": "Paula B."}, {"rating": 5.0, "review": "This is great, I love it because it's easy to take with you on travel and instant media!!!", "verified": true, "helpfulness": "0/0", "author": "Simon Hancock \"Scifientist\""}, {"rating": 4.0, "review": "I'm still trying to get used to it but so far so good", "verified": true, "helpfulness": "0/0", "author": "Namow"}, {"rating": 2.0, "review": "No where near as good as the larger Roku offerings.  In the same location that works fine for the Roku 4, the stick seems to have trouble getting good wifi reception.  Perhaps its internal antenna is too small?  It often stops to re-buffer which is quite distracting when watching a program, and in some rooms just can't seem to load a program even though it says it is connected and my phone says that there are 4 out of 5 bars wifi signal strength.", "verified": true, "helpfulness": "0/0", "author": "N. W. Jaffe"}, {"rating": 5.0, "review": "Got this for second TV absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Loreli McMullen"}, {"rating": 5.0, "review": "Easy to install and set up.  Clear instructions that guided me (a non-tech-head) through in a flash.  I love it.", "verified": true, "helpfulness": "0/0", "author": "carol brandon"}]