[{"rating": 1.0, "review": "Constantly restarts itself, cannot maintain internet connection, very slow and sluggish. This Roku is unusable, and I had to return it. My Roku 2 worked great so I thought I'd try this one, but that was a mistake. Save yourself the trouble and avoid this item.", "verified": true, "helpfulness": "8/9", "author": "tac-nine"}, {"rating": 5.0, "review": "We love it! We've used OTA broadcast for the past tree years, but this adds more options without having to get cheated by the cable company..", "verified": true, "helpfulness": "0/0", "author": "Vickie M Harrell"}, {"rating": 5.0, "review": "This is my first time experiencing streaming media through Roku and so far its been great. I have all my favorite shows and plenty of channels, and services to pick from. I initially bought a Samsung SmartTV but quickly returned it because of its bulky UI and issues with connectivity to my wifi. The Roku was easy to setup and was able to find and connect to my 2ghz/5ghz networks with no issues, the UI is also easy/simple to navigate. Another plus is being able to control the Roku from my phone or tablet. I considered buying the Chromecast but the Roku won me over with its features and channels. I would definitely recommend and buy another one.", "verified": true, "helpfulness": "0/0", "author": "C. Villanueva"}, {"rating": 5.0, "review": "The set up was easy breazy. The remote is nice. It steams just fine with amazon, etc., EXCEPT YouTube. With the app Twonky you can stream from YouTube, but I can't get through an entire movie without getting booted off. UPDATE MAY 10, 2014 There is now a direct link on Roku channels to YouTube. AWESOME", "verified": true, "helpfulness": "0/0", "author": "SouthTexasGal"}, {"rating": 5.0, "review": "It does everything the bigger Roku boxes do well.  The only improvement I would make for version two, have a slot in the remote to keep the dongle if not in use or when traveling.", "verified": true, "helpfulness": "0/0", "author": "David M. Harrison \"dharr18\""}, {"rating": 5.0, "review": "We love our Roku stick ! Very easy to install, just plug into the HDMI port on the TV & plug into the outlet, switch the remote to tv & change it to the hdmi port. Your internet router must be compatble, ours was a Netgear N300, it works ! I havent hooked it up to the surround sound since I also take it into the bedroom tv to use. Its pretty cool for not having a smart tv but able to get movies !", "verified": true, "helpfulness": "0/0", "author": "Cheryl S"}, {"rating": 5.0, "review": "Fast shipping!  bought to replace an older version, and also ordered a 2nd one to give as a gift!  Would definitely purchase again!", "verified": true, "helpfulness": "0/0", "author": "amanda"}, {"rating": 1.0, "review": "I liked everything about the Roku Streaming Stick except the heavy interference it caused on channels I get through an antenna.  Those channels were unwatchable, so long as the stick was plugged in.  Roku's tech support suggested leaving the Roku unplugged except when in use.  I wasn't willing to put up with that hassle and returned my Roku to Amazon.  I was also concerned that the HDMI connector might not stand up to that kind of use long term.", "verified": true, "helpfulness": "8/10", "author": "BobP"}, {"rating": 1.0, "review": "I bought this item thinking I could use it and take my computer off the TV.  It kept losing the signal from my router on initial setup took about an hour to get it to finally connect and finish the setup.  Once that was complete setup the stick to stream from my Plex box on the network and it kept buffering all of the time and losing connection.  I am returning the stick as the router was only about 10 feet from the TV with no major obstructions or interference in the way.  The stick always showed a strong signal.", "verified": false, "helpfulness": "2/4", "author": "TAiNiUM"}, {"rating": 4.0, "review": "I would give it five stars, but for the hesitation between pressing the remote button and the time it actually start processing the request. I have the Roku 2 and the Roku 3 and the reaction time is faster. Apart from that, it works like a charm.", "verified": true, "helpfulness": "0/0", "author": "P. Kral \"mama java\""}]