[{"rating": 5.0, "review": "We are new to the cord-cutting world and so far the Roku has been great. We use it to watch SlingTV and Netflix.", "verified": true, "helpfulness": "0/0", "author": "HappyJacks"}, {"rating": 5.0, "review": "Love it! Love it! Great replacement in case something happens to my Blu-Ray!", "verified": true, "helpfulness": "0/0", "author": "Diamond Udasaki-Taylor"}, {"rating": 5.0, "review": "Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Ewa Garstecki"}, {"rating": 4.0, "review": "I really like the stick and it's functionality.  I only gave a 4 because I had trouble setting up.  As it turned out when I got help from their tech support, they had me replace the batteries.  That took care of the problem and then followed the procedures for setting up with my wifi.", "verified": true, "helpfulness": "0/0", "author": "William Wickliffe"}, {"rating": 4.0, "review": "It was good best thing i  bought just the remote like to disconnect from it", "verified": true, "helpfulness": "0/0", "author": "Maya"}, {"rating": 5.0, "review": "This works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Martin Gerard Duffy"}, {"rating": 5.0, "review": "So far so good. It's something new and I have to get use to adding a channel before I can watch it. I think the product itself is really cool, and amazing how these newer TV'S works.", "verified": true, "helpfulness": "0/0", "author": "Belinda Jones"}, {"rating": 5.0, "review": "We bought this for the kid's room, we didn't want to pay for another Time Warner Cable box.  This thing works great, my wife and I actually stole it from her a few times until we got our own.", "verified": true, "helpfulness": "0/0", "author": "Ronnie \"RjSD\""}, {"rating": 5.0, "review": "Loving it!  Simple to use, love the PBS app", "verified": true, "helpfulness": "0/0", "author": "ACR"}, {"rating": 5.0, "review": "I purchased this as a gift and have not yet plugged it in to try it, but all my friends are raving about theirs.", "verified": true, "helpfulness": "0/0", "author": "WritingIrish \"LM Killian\""}]