[{"rating": 5.0, "review": "Very user friendly! Thank you", "verified": true, "helpfulness": "0/0", "author": "mary l farlee"}, {"rating": 5.0, "review": "Fantastic item. Easy to set up & use. Works great on our sailboat using my iPhone hotspot.", "verified": true, "helpfulness": "0/0", "author": "swimmer"}, {"rating": 5.0, "review": "The Roku stick is a nice alternative to cable and satellite TV. No monthly bills, and lots of free channels. Plus it comes with a remote control, so you don't have to play with your cell phone.", "verified": true, "helpfulness": "0/0", "author": "Blacktree"}, {"rating": 4.0, "review": "My friend has this toy at her house, I used it when house sitting & baby sitting, love the access to TV shows and movies they have on there, so I got my own.I have the wireless network set up in my home, I don't have wires running from room to room like my dad did when I was a teen, everything talks to the router in the living room, even the desk top is wireless, so I got the Roku stick for the one room in the house that does not have a video game system hooked to it.Well it is a great toy, I can watch Netflix of Amazon video, and YouTube on it, only catch is you have to add a credit card to continue, I refuse to do that so unless I get a throw away card, one of those visa gift cards or something, I will not be continuing the set up of my stick, which is too bad, I was looking forward to getting it all set up, it is a great toy.I only wanted this for Netflix, Amazon video and YouTube, so why should I need a credit card unless I am actually buying a channel?", "verified": true, "helpfulness": "0/0", "author": "Ronafish79 \"Ronafish\""}, {"rating": 5.0, "review": "Good Product", "verified": true, "helpfulness": "0/0", "author": "Antonello Caruggi"}, {"rating": 5.0, "review": "nice price, works well.  have 3 Roku streamers and this works just as well as the brand new ones for much less.", "verified": true, "helpfulness": "0/0", "author": "Tamara Belden"}, {"rating": 2.0, "review": "Roku Stick is worth EVERY PENNY. This was a great investment in my entertainment. In my leisure time, I enoy watching Netflix. Watching Netflix on my tablet was good but not great. Now being able to watch Netflix on my flat screen TV is great. The only issue that I am experiencing is the remote keeps acting up. It will stop working all of a sudden. This forces me to stop what I am doing and remove the batteries from the roku remote. This is disrupting my viewing experience. Everything else works perfectly and I am extremely satisfied with my purchase. I would like a replacement remote. Hopefully that would fix the remote issue that I'm having.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 1.0, "review": "Updated 8/15/15:I received my new stick a few days ago (Thanks for the fast turnaround, Amazon) and had the same issue as I did with the original one...the remote just won't stay in sync with the stick.  I bought an HDMI extender to isolate the stick from the television, performed all system updates that I could find and even changed the frequency on my access points...all to no avail.I'm a great fan of Roku, but this product needs work...too many folks are having this issue for Roku to ignore it.=====================================Original Review:I have 7 different Roku boxes (2s and 3s) installed at home and at our vacation rental property...all have worked flawlessly.  This is my first Roku stick.Like some other folks who have posted negative reviews, I also had problems with the remote staying connected to the stick.  It would lose its sync after about 2 minutes of use.  Removing and replacing the batteries solved the issue for another 2 minutes.I tried using fresh batteries, but that didn't help.  I've submitted a replacement request from Amazon...if the new unit works better, I'll adjust my rating.  Until then, I can't recommend this to anyone.", "verified": true, "helpfulness": "1/2", "author": "NoExpert"}, {"rating": 4.0, "review": "Overall it works pretty good. Has some issues occasionally streaming the picture. A quick unplug and plug back in usually fixes things. So it works but can just be annoying at times.", "verified": true, "helpfulness": "0/0", "author": "Jennifer \"Jennifer KRantz\""}, {"rating": 5.0, "review": "bye bye Direct TV, Roku works great", "verified": true, "helpfulness": "0/0", "author": "nineball"}]