[{"rating": 4.0, "review": "This is the interface most cable companies probably SHOULD have to access their streaming content.  I have a smart TV, however the SHARP has a limited channel selection, (hulu, netflix, you tube etc) which is fine and works well to flawless with those clients.  However there are some that are not loaded, (amazon, hbogo) and some titles that is, again, very limited with the very annoying \"on demand\" service my cable provider has.This is a better interface to get what you want.  My only caution for set up is you may want a swivel male /female hdmi adapter if your panel is recessed.  The stick is longer than the hdmi plug, and if your tv is not flat to the edge where your plugs are, you will not be able to plug it in.", "verified": false, "helpfulness": "0/0", "author": "Maris Stella"}, {"rating": 5.0, "review": "Very convenient and easy to use.  Love the streaming service.  Would not hesitate to purchase again.  Has been great thus far.", "verified": true, "helpfulness": "0/0", "author": "tba"}, {"rating": 5.0, "review": "I have three of these in my house - Its really changed the way I watch TV. highly RECEOMMEND IT TO ANYONE.", "verified": true, "helpfulness": "0/0", "author": "Mike Hill"}, {"rating": 4.0, "review": "Easy to install, takes up less space, no need for a power outlet. We have an older roku, and it works just as well. The software looks a little different. Great little device.", "verified": true, "helpfulness": "0/0", "author": "Henry S."}, {"rating": 1.0, "review": "it is not working well. had to do \"factory reset\" a few times. the RF remote works worse then a regular IR remote - half of the times it doesn't register the key press.all of the \"free\" channels are not free, netflix is not working in 1080p - I also have the chromeCast and the quality is not comparable (on the same internet connection, and same wifi access point - i've checked them side by side).sending it back ...", "verified": true, "helpfulness": "13/14", "author": "Inbal"}, {"rating": 5.0, "review": "Excellent product, works perfectly and is much more elegant than the competition, we like the size and ease of operation, very smart way to connect to whatever you want, buy it!", "verified": true, "helpfulness": "0/0", "author": "JVF"}, {"rating": 5.0, "review": "I purchased the Roku 1 after my Chromecast began malfunctioning. I love that the system is operated via remote that has shortcut buttons for Netflix, Amazon Prime and Blockbuster (LOL). I have never had any issues with streaming speed and setting it up was a breeze.We also have a Roku 3 in my house, this system is EXACTLY the same quality. I believe the Roku 3 has some games? And the remote is equipped with a headphone jack, which isn't a compelling reason to spend an extra $100, in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Danielle"}, {"rating": 5.0, "review": "Roku stick is amazing! If your tv isnt close to the wall you will be fine. If your tv is mounted on the wall....BUY adapters to make the 90 degree turn so that it is either up or down. I recommend swivel adapters because 90 degrees might not be enough, this thing is long!", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 5.0, "review": "As long as you have wifi and a tv to accept the HDMI connection, you have Roku. Exactly what I needed for the tv in the master bedroom.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Leugers"}, {"rating": 5.0, "review": "This is not my first Roku, I have Roku 2.  No complaints.  I feel it is the best thing for televisions.  Easy to install and operate.  Very glad I cut the cable.  This is a good saving.  I enjoy  everything I watch.  I recommend this highly to everyone.  You will not regret it.  The price was great for all the added features you will receive.", "verified": true, "helpfulness": "0/0", "author": "Mary Alycee \"Mary Alycee\""}]