[{"rating": 1.0, "review": "IN SETTING UP MY ROKU, ERROR 014 KEPT POPPING UP. I SOLVED THAT MUCH, NOW I GET ERROR 011. THE PROBLEM I SEE IS THEMANUAL DOES NOT SHOW WHAT THESE CODES MEAN. I FOUND A WEBSITE THAT IS SUPPOSED TO HELP WITH SETUP PROBLEMSWITH ROKU. I PAID $36.00 FOR THIER HELP, WHICH TURNED OUT TO BE NO HELP AT ALL. THIS HAS GONE ON FOR 3 TO 4 WEEKS.THE SETUP SCREEN SHOWED THAT THE SETUP COULD BE DONE IN 3 EASY STEPS. REALLY? ARE YOU KIDDING ME????. IF ANYBODYCAN HELP PLEASE EMAIL frankbartlett42 @gmail.com  THANK YOU", "verified": true, "helpfulness": "0/1", "author": "FRANK BARTLETT"}, {"rating": 3.0, "review": "You have to have really fast internet to keep up with it.", "verified": true, "helpfulness": "0/0", "author": "1964"}, {"rating": 5.0, "review": "Great great device. I have bought as many for myself as I have others. They loved the simple set up, use and happiness, money savings, they encountered.", "verified": true, "helpfulness": "0/0", "author": "D on Movies"}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "christopher pascocello"}, {"rating": 5.0, "review": "Really enjoy the Roku.  Great price and the refurbished item is perfect.", "verified": true, "helpfulness": "0/0", "author": "Bob D"}, {"rating": 2.0, "review": "Bought the refurb but it didn't work.  All I got was a solid purple screen.  Returned for a new Roku 2 and am very happy with the new purchase.  I gave it 2 stars because the return and refund process was super easy!", "verified": true, "helpfulness": "0/0", "author": "C. B. King"}, {"rating": 1.0, "review": "I hate this stupid product its always crashing...and I am always having to reset remote ....I sometimes have to wait forever for it to load and then it will let me do one thing and then stall or crash....I thought this was ideal.... I purchased 2 and gave one as a xmas president...im so ashamed for giving this piece of crap as a gift....thinking of returning it but don't know if I can it is useless to me ....I only bought it because the fire stick was out of stock...and I needed a xmas present I should have been patient and just waited......bottom line I have very high speed internet so that is not the problem this is just a piece of useless crap to me that I regret buying ...i hate it.... I hate it..... I hate it.... I don't use it and I don't want it I want my money back....will be contacting amazon soon......", "verified": true, "helpfulness": "0/0", "author": "irene"}, {"rating": 4.0, "review": "It works great for what i need it to. great way to transform any television with an HDMI port to a \"Smart TV\". There is still a need to have sign in to your service provider to get access to all of the apps on the streaming stick, but this is not unique to the Roku as I have the same issue with a Apple TV. Over all a good device and would consider repurchasing for other TV sets I own.", "verified": true, "helpfulness": "0/0", "author": "ABSTUBB"}, {"rating": 5.0, "review": "Have had no problem with this model ROKU", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the Roku streaming stick. I have one already and bought this one as a gift", "verified": true, "helpfulness": "0/0", "author": "Faye L."}]