[{"rating": 5.0, "review": "One of the better buys I have made in a while. Gives you smart tv internet choices without paying extra for a smart tv. Additionally the choices/flexibility of this item is great", "verified": true, "helpfulness": "0/0", "author": "Ken Macklin"}, {"rating": 1.0, "review": "Do not buy if you plan on using outside of the USA. Specifically, Roku does not have licensing agreements in many international regions for channels like Netflix and Hulu - arguably the whole point of buying this - so be aware if you want those channels, you should look into buying another product.Also, the few things we were able to watch had long load times and glitchy playback", "verified": true, "helpfulness": "1/2", "author": "VA BOUCHER"}, {"rating": 5.0, "review": "Shipped quickly, works great. Pleased with purchase.", "verified": true, "helpfulness": "0/0", "author": "Anne"}, {"rating": 1.0, "review": "Returned it and replaced it with a Roku 2.  The Streaming Stick is slow and worst of all the remote will intermittently stop working and it's necessary to pull the batteries to get it working again.  Or some times the remote will have a mind of it's own and start scrolling down or up through a menu as if I had pressed the same button repeatedly.  The \"point anywhere\" remote seems to have unresolved bugs so I'm switching to the Roku 2 with it's good old fashioned, reliable IR remote.  From doing some research, it sounds like I'm not the only one that has had remote problems and life is to short to deal with buggy hardware.", "verified": false, "helpfulness": "1/1", "author": "TCB"}, {"rating": 5.0, "review": "This is my second Roku purchase and I am very happy with both! The first was the regular box, and after loving that, I bought this stick. They are both extremely easy to set up and easy to use. I stream Netflix, Hulu Plus, Amazon Instant Video, Sling TV and Pandora.Ease of use is the greatest plus. The stick goes into the back of the TV instead of the box out in the open. Both of my Roku purchases were refurbished. I chose the refurbished to reduce cost, and have not had any issues.", "verified": true, "helpfulness": "0/0", "author": "Kalee"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "edwin r. lamboy"}, {"rating": 2.0, "review": "This did not connect to my internet easily. Every day I had to reconnect. This consisted of reset, unplugging, restarting.  After three days I was tired if reconnecting every day.Returning the item was easy and pleasant. However, I did not clear my information from the roku before I shipped it back. I received an email from the guy who purchased the item after my return.  It opened up to my Netflix account.  He found my email address before the stock froze up on him.  He returned the item as well, but was kind enough to send me an email so that I knew to change my password. Thankfully I didn't use it long enough to set up any other accounts.", "verified": true, "helpfulness": "0/0", "author": "Cassie"}, {"rating": 4.0, "review": "I like the stick quite a bit.  The Roku channels have much to be desired.  It's a good value and it works more times than not.  Wish it was a little easier to watch some of the channels without having to suffer through commercials every 3 minutes.  Other than that it's definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "C. Lange \"VoiceofReason\""}, {"rating": 4.0, "review": "Takes some time to load but works great once it is connected.  Perfect for our second TV when we didn't want to buy the Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Andrew Bullock"}, {"rating": 2.0, "review": "While I appreciate the device's ability to turn my \"stupid TV\" into a \"smart TV,\" this thing really couldn't be more of a pain in the youknowwhat to use. First of all, it is very slow. This may be because of our wifi, but it sits literally about 2 feet away from the router. Typing a search term using the remote into a search box in an app (YouTube, for example), takes FOREVER (last time I checked, the Roku app for this device did not have a keyboard option). Second of all, it requires updates at random and thus stops working at random (ie in the middle of a program you are watching), and the screen just turns purple. I had to look up the issue online to figure out that it even needed updates (because it doesn't tell you that anywhere), which is why it wasn't working. Third, it will randomly freeze and you have to restart it, which takes an abundant amount of time. Fourth, it's not user friendly. I am a tech-savvy Millenial--ease of use is normally not an issue for me. I can't remember EVER reading instructions to use a piece of electronic equipment. Enter this thing, and I'm looking up directions on my phone constantly to figure out why it's not working. Fifth and finally, I honestly can't find anything worth watching other than some British shows I like that are only available on YouTube. The rest of the apps are only good with paid subscriptions (ie Netflix, Hulu, Amazon Prime), or just \"junk\" television.I don't like this device and I would not recommend it to those of you out there seeking a similar solution for your older flat-screen televisions. My husband and I both get so frustrated using it that we often decline to do so at all anymore. If not for Come Dine With Me, we would probably have taken it off the tv and discarded it.", "verified": true, "helpfulness": "5/6", "author": "BWheels83"}]