[{"rating": 4.0, "review": "I've had it over a month now.  Easy to install...only wish it was a bit sturdier.  The connection seems a bit tentative; however, I've not had a issue thus far.  Love being free from cable provider!", "verified": true, "helpfulness": "0/0", "author": "GA now TN Girl"}, {"rating": 5.0, "review": "I had purchased this Roku Streaming Stick and while using they device was not always getting the power it needed. When it worked it is a great product, but if the cord moved it would shut off the Roku. I contacted the business it was sold from and they were very nice and sent out a new power cord that day for me. They were great to work with.", "verified": true, "helpfulness": "0/0", "author": "Holly Q. Decker"}, {"rating": 5.0, "review": "Awesome toy !!! Easy hookup and setup. New channels every month, tons of free content plus all the pay services.", "verified": true, "helpfulness": "0/0", "author": "Average Joe"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "GERARDO TORRES SANTOS"}, {"rating": 5.0, "review": "Love it! Easy to set up. I use the Roku 90 % of the time. Highly recommended !", "verified": true, "helpfulness": "0/0", "author": "Janie"}, {"rating": 2.0, "review": "I have been using the Apple TV 3 for years since it first launched. And I just purchased the Roku stick to try out. The menus looks de-coloured and washed out compared to the Apple TV's menu. In fact I am pretty sure the menu graphics is not 1080p though I have switched to Full HD in settings. The response is slow. And watching the same movie in Netflix, the quality given by the Apple TV is better. The Roku stick is really a let down interns of response and graphics and video quality. Comparatively Apple TV is way better. Ironically I had bought the Roku to help stream Amazon Instant Video and since the stick is not dong a good job streaming and Amazon Instant Video, I have just ended the trial for Amazon Instant Video. I should have tried the Fire Stick instead. Having said that, Roku has many channels and its search function is very good as it can search across all its channels. All in all, not top notch. But versatile.", "verified": true, "helpfulness": "0/0", "author": "Isaac C."}, {"rating": 1.0, "review": "I purchased the roku (not at Amazon) when it was advertised as coming with two months free Hulu Plus for new customers if activated before 10/31/14. I followed all of the instructions, but was only offered seven days free Hulu Plus. When I contacted Roku, they said I needed to activate sometime in Sept, however, they still sent an email with the 2 months of Hulu Plus IN October and both the advertisement when I bought and the email said 10/31/14. Customer service was very hard to get ahold of, and when I got through on live chat, would take 10-15 min between some responses. Since my issue wasn't resolved they had someone call me - at 1am! Then they never did the follow up call the next day and my issue is still not resolved.", "verified": false, "helpfulness": "0/0", "author": "SBK"}, {"rating": 4.0, "review": "Nice product!", "verified": true, "helpfulness": "0/0", "author": "cleanmachine59"}, {"rating": 4.0, "review": "It takes way to long to start up.  Other than that, it worked really well and it's really compact.  I also like the fact that it takes everybody's online content.  I have Netflix and Amazon Prime.  The major competitors like Google Chrome does not want to let you see their competitor's programs.", "verified": true, "helpfulness": "0/0", "author": "Long"}, {"rating": 5.0, "review": "GREAT!!!!!!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Dan S"}]