[{"rating": 5.0, "review": "PERFECT", "verified": true, "helpfulness": "0/0", "author": "joseph amaya"}, {"rating": 5.0, "review": "I love Roku. Got my first one in 2006. This stick has a nice visual interface compared to older models. But I HAVE NOT been able to connect it to my cell phone (Android)...not even by hand-entering the IP address.  Apparently, I'm not alone on this.", "verified": false, "helpfulness": "0/0", "author": "djtim102"}, {"rating": 2.0, "review": "Nothing wrong with the product, however, this does not work in Australia, so I would have to return it or resell and that is too much trouble for a busy person!", "verified": true, "helpfulness": "0/0", "author": "Les Whyte"}, {"rating": 5.0, "review": "works great. would buy again", "verified": true, "helpfulness": "0/0", "author": "kasy"}, {"rating": 3.0, "review": "A bit slow and not so convenient when typing the title with the remote", "verified": true, "helpfulness": "0/0", "author": "Benny Y.P. Siahaan"}, {"rating": 5.0, "review": "I have a Chromecast but got this for my mom because I thought she'd prefer to have an actual remote control and menu option (something you don't get with Chromecast). After setting it up and seeing all the apps that Roku offers and all the news and tv channels (some of them free, some of them require a cable subscription), I decided to get one myself. I have to say I use this WAY more than my Chromecast now...it's just easier to navigate through apps with a remote and menu versus doing everything on your phone or tablet with a Chromecast.", "verified": false, "helpfulness": "1/1", "author": "R. Gama"}, {"rating": 5.0, "review": "I loved it!! I'm getting a new apartment soon & don't want to mess with cable prices this allows me to save $$ by just getting WIFI! & it works like a dream!", "verified": true, "helpfulness": "1/1", "author": "Caitlyn"}, {"rating": 1.0, "review": "POOR DIRECTIONS", "verified": true, "helpfulness": "0/1", "author": "david smith"}, {"rating": 5.0, "review": "Very happy about it. Not extremely tech savvy, but was able to navigate the instructions even though it was made much harder without the use of the remote that came with the TV set. Did everything by hand. Glad I did! Haven't yet moved TV away from Roku mode since.", "verified": true, "helpfulness": "0/0", "author": "alyce bond"}, {"rating": 5.0, "review": "Super", "verified": true, "helpfulness": "0/0", "author": "Ana Paola Alonso Rugilo"}]