[{"rating": 5.0, "review": "So I was waiting to pull the trigger on a Roku for a while...But my tv is wall mounted and i have my sources in an AV closet. Im lazy to connect another 16ft HDMI cable snaked through the walls.  Enter this Gem.  Just like a chrome cast it's HDMI Dongle that plugs into your HDMI port on your HDTV.  All you need is a USB port as well to power it.  Not to worry if you don't have the USB it comes with a power adapter.  In seconds i was linked to my Wifi..and all my streaming accounts Netfix.. Hulu..and best of all Amazon Prime.  To tell you the truth I've had a prime membership and have never taken advantage of the instant video portion for 2 yrs.  I finally can take advantage of this service ive been paying for.  Pros...easy to install...small package plug and play operation.  RF remote no need to point it to the tv. Cons...none really!  So all in all this is a great buy and only 50 bucks.  This is why i like My HDTV dumb not smart.  If you add this product its a better easier way to get your fav apps and streaming.  Go..do it! buy it.  You will be happy like me.", "verified": true, "helpfulness": "2/3", "author": "Ryan"}, {"rating": 5.0, "review": "Started up pretty quick and had one issue of power which I was able to resolve with their customer support within minutes via chat online. I dropped Comcast and never looked back!", "verified": true, "helpfulness": "1/2", "author": "Barbara"}, {"rating": 5.0, "review": "I just received the Roku stick,and I do love it,it's easy to set up, a real no brainer! And it works great.I like it so much I just ordered my second one to put in the other bedroom.", "verified": true, "helpfulness": "0/1", "author": "Carol Williamson"}, {"rating": 4.0, "review": "I have a Smart TV from Samsung, but I wanted to be able to have all my HD tvs be \"smart.\"  So I bought this.  One advantage I have found over the Samsung package of apps is that you can get Showtime Anytime with Roku, which is not available from Samsung.  Of course, if you're not a Showtime subscriber, this doesn't mean much, But if you are, it's nice to have.  Complete seasons of many Showtime shows and boxing, etc.  Really analogous to HBO to go.  Overall, a very well spent $50.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"pm\""}, {"rating": 3.0, "review": "It is not blazing fast as Roku3 but better than older Roku's. Fits nicely and fortunately my computer has a USB port so was able to draw power from it instead of using an adapter. I have a wall mounted TV and no wires are showing up with this setup. The only thing i noticed is that the powerup, channel download is a bit slow but that doesn't have to be done often so its is not a big deal. Good price for the functionality.Downgrading to 3-star after few days of use - When powered by TV USB, this ROKU seem to require lengthy startup when turning on TV,  not happy with the lazy wakeup.", "verified": true, "helpfulness": "10/13", "author": "Love to read \"Love to read\""}, {"rating": 5.0, "review": "Working great so far! Setup work flawlessly (whew!). Love the remote, makes dealing with everything so much easier than going through an online account!  Worth the little bit more!", "verified": true, "helpfulness": "1/2", "author": "I call them as I see em."}, {"rating": 2.0, "review": "DISCLOSURE:  I also own a chromecast.The remote on the roku is fantasitc, and the UI is superb.  Its nice to cycle through content on the screen, IF YOU HAVE THE TIME. This thing is SLOW.  Netflix takes much longer to load than on the chromecast. Also, I think the WIFI antenna or something about the WIFI is lacking.  Granted, I am using the 2.5 ghz band because of the distance form my TV to my router; proabbaly farther than is desireable. However, the chromecast is able to run HD video from the same HDMI port behind my Smasung tv, with a fraction of the load time, and no dropouts.The roku paused to buffer on multiple occasions, and completely lost the wifi connection within 5 minutes of playing a video on multiple occasions.  Then , I had to go and \"rechoose\" the wifi.  This has never happened to me with the chromecast on the same tv, same HDMI port, same 2.5 ghz band.  I even tried using the HDMI extender that came with the chromecast with the ROKU stick, to no avail.Maybe I have a bad unit, but I think the WIFI on this is not as good as the chromecast.  I've returned the ROKU.", "verified": true, "helpfulness": "10/16", "author": "GeoTony"}, {"rating": 5.0, "review": "LOVE IT! My \"smart\" TV never updated or added any apps, and hooking up my laptop with an HDMI cable to watch NHL, MLB, and Amazon Prime, was a P-I-T-A!This new little Roku stick solved those problems and more.At first I thought I'd have no use for the remote, I was quickly using it more than the app. The interface is that simple.The search capabilities through multiple databases to find anything without prejudice is the real magic.The CEO of Roku is right, \"People don't want to DVR programs, they want to be able to watch anything EVER made, at the push of a button\".Right on!", "verified": true, "helpfulness": "30/39", "author": "Jtallafuss"}, {"rating": 5.0, "review": "Simply put the Roku Streaming Stick is the best $50 you can spend. Roku has well over 1000 channels compared to the handful that Chromecast has. The Roku is easy to set up and activate. Be advised though, when setting up an account you will be required to enter a credit card. However, if you don't have one you can call customer support and they will bypass the credit card info for you.All in all a very good device and is well worth the extra $15 over the price of a Chromecast.", "verified": true, "helpfulness": "7/11", "author": "Chris Miller"}, {"rating": 3.0, "review": "I just got the Roku Streaming Stick and I already installed to see what is going on with this device...First I tried to plug in the new tv that I got from amazon for my bedroom and..surprise !! IT didn't fit...I don't have enough between the slot for  the HDMI and the edge of the tv..so I took the Roku and plug it in a bigger tv and I had to pull and push to get in for the same reason !!! so not happy with that ...you have to have a tv with the HDMI slot exactly on the edge of your tv so you will not run in the same problem like me....Another thing...YEAH YOU HAVE A LOT OF CHANNELS BUT , Actually YOU DON'T !! they are some free but for the other ( most of them ) you have to pay so in the end if you want some sport channels, some internationals and some movie channels you will pay almost like you will pay for cable ...For some free programs you still have to have a cable provider so means that you still have to pay/keep your cable!!! And because I have a smart tv I was able to take the amazon prime before the roku and I saw that I can get some other channels from roku just with my tv ...SO IF YOU HAVE A SMART TV A ROKU DOESN'T MAKE ANY SENSE ...!!! So yeah...I will return the roku !! and get another hopper/joey for my bedroom tv so I can watch my favorite shows when I want !!", "verified": true, "helpfulness": "1/15", "author": "amalia"}]