[{"rating": 4.0, "review": "I have a Samsung TV and it did not fit in the HDMI slot on the back so I had to spend a few bucks on an adapter and I couldn't find the Roku remote codes so I have yet another remote laying around but it works as advertized and is a good deal for the price.", "verified": true, "helpfulness": "0/0", "author": "P. Mulloy"}, {"rating": 5.0, "review": "Absolutely LOVE this stick! We live in the country with not so great internet. We have a Google Chromecast that we streamed to our TV through our Surface Pro, and it constantly had problems connecting and streaming, we could hardly watch anything. So we thought we'd try this Roku stick since it was a good price, etc. We LOVE it!!! It's been excellent. Super fast, no connection problems or streaming problems at all, and we use our iphone 6 for a remote which is awesome. Great price too on the refurbished one. Also, it has so many different, unique channels you can watch, etc. We have been watching shows through Amazon with our Amazon Prime for free. Best purchase in a long time.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Taylor"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Can be a little slow at times, but overall it offers an amazing browsing experience on the major platforms.", "verified": true, "helpfulness": "0/0", "author": "Beau Sizemore"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Jeannie Scott"}, {"rating": 5.0, "review": "Great product, I use it for plex!!!", "verified": false, "helpfulness": "0/0", "author": "Halight"}, {"rating": 4.0, "review": "Well....it works.  I used to use my Playstation to stream netflix but got tired of trying to protect it from my toddlers.  I went with the Roku stick over the box version for the space-saving.  There are plenty of \"channels\" to select from and it streams just fine.  The only gripe I have is the slow loading times.  I guess this is due to it being a stick and not having built in memory or something.  Other than that, it does the job I need it to.", "verified": true, "helpfulness": "0/0", "author": "The Penny Pincher"}, {"rating": 5.0, "review": "Love them I bought 2", "verified": true, "helpfulness": "0/0", "author": "Katherine K."}, {"rating": 3.0, "review": "We bought two Roku sticks and have owned a Roku box for years.The Roku box is much better. The loading on The sticks is noticeably slower. We plugged one of them into the wall instead of the tv and that improved the function a bit. But overall not recommended. We bought because the idea of a hidden Roku is nice. But this item needs work. We have this one purchased here and the newer version Roku stick purchased at Wal-Mart. Neither are as good as the Roku box.", "verified": true, "helpfulness": "2/2", "author": "Jal11"}, {"rating": 5.0, "review": "Refurbished?  Except for the lower price, I couldn't tell the difference from new.  My old streaming \"smart TV\" service on my DVD stopped supporting YouTube, and was never very good at YouTube anyway.  This Roku device uses YouTube in \"native\" mode, and will support HD streaming on any of its apps.  I esp. like the PBS TV app.", "verified": true, "helpfulness": "0/0", "author": "Donald Klos"}]