[{"rating": 2.0, "review": "This ROKU Is A Joke of a unit ... We tried two of these on our TV's, home & shop ...VERY Slow to LoadVERY Slow to functionVERY Poor buffersTakes Forever to lock into HDWe then hooked up a couple of WD units and They Blew The Stupid ROKU Units Off The MapSure wish we could return our two Junk ROKU Sticks :-(", "verified": true, "helpfulness": "0/1", "author": "Timothy S. Shropshire \"'rangsmith\""}, {"rating": 5.0, "review": "To start off, I want tosay that I hav enot had cable in over 5 years, and with devices such as these, I will never go back. This is my first Roku, previously I was using my Xbox 360 to stream Netflix, Hulu, and the others.  I decided I did not want to pay the $10.65/month to have Xbox anymore and bounght this instead.  I have several friends that have one and they all agreed that this was the way to go, especially if you don't do any gaming. Which I don't.Packaging is simple and clever, and easy to navigate. Setup was a bit of a chore, I recommend you have your laptop up and running in front of you, along with all of the usernames and passwords of your various accounts.  The Roku is going to send you a confirmation code that you are going to need to enter in to a page on their site, i think it was www.roku.com/register.  This was also the case with HBO Go, Showtime, and a few others.  They do this to register the devise.  After reading several reviews, expecially that parts about the setup, I agree that it takes a little while, but this is completely dependent on how many services you have and how many you want.The remote feels well made, and i do like the hot keys on the bottom, though I am a little confused how Blockbuster made it to the list to be added with a special button.  The navigation can be slow some times, but that is only if you are zipping along, backing out of bages, and generally treating the device like a quad core PC.  It's a small, streaming stick and is not going to perform like a DVR Box.  I think that is where people are getting frustrated and overall shaming the device for. I did not fault it for doing what it is supposed to do at the capacity at which it was made.This is a great devise, I recommend it to anyone thinking of cutting cable.  I have my antenna hooked up to for loacl TV, so with that I cannot see spending over $150 a month ever again for cable.", "verified": true, "helpfulness": "0/0", "author": "Michael Perkins"}, {"rating": 3.0, "review": "The a Roku works great!!! I love the format and the remote is more comfortable to hold. But this new Roku is a broadband hog!!! We have an older model Roku and we loved it too. We purchased an additional Roku for another room. But when the new one us on, it basically shuts down access to our Wifi from any other device. Quite aggrivating. So I give it a three star rating because of that.", "verified": false, "helpfulness": "1/1", "author": "Ketura McCall"}, {"rating": 5.0, "review": "Carry it everywhere in my backpack for quick connections to TVs in my classrooms, church or friends' homes.", "verified": true, "helpfulness": "0/0", "author": "FisherFarm"}, {"rating": 5.0, "review": "Works great. Every now and again, it will freeze up. Unplugging the unit from the tv and electricity for a bit fixes this.", "verified": true, "helpfulness": "0/0", "author": "pleased customer"}, {"rating": 5.0, "review": "Love love love this. So many apps to download with this device. Quality of movies and shows awesome. So many thing to choose from to watch. We unloaded our cable high end channels instead opting for the streaming stick.", "verified": true, "helpfulness": "0/0", "author": "leah harmon"}, {"rating": 5.0, "review": "Works wonderfully! Used this to replace my Xbox after it required us to pay for Xbox Live.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I just wanted to mention that everyone having lag issues, wifi issues etc. It very possibly is your USB port on your tv just doesn't supply enough power to make this work properly. If this is the case it does defeat the convienance of this stick for some but is not a roku issue. Just wanted to mention this as I see alot of negative reviews concerning this.", "verified": true, "helpfulness": "2/3", "author": "Mark Dodge"}, {"rating": 5.0, "review": "LOVE IT!!!! no more cable TV prices for me!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 4.0, "review": "I have 2 of these and neither one will stream Netflix well.", "verified": true, "helpfulness": "0/0", "author": "lance luth"}]