[{"rating": 4.0, "review": "I would give this stick five stars, but for a minor problem. I've had it for about 3 months. I cannot believe ho many channels etc. it receives. It was very easy to hook up and operate. The only problem I've had is the remote keeps losing contact with the stick. I've changed batteries, moved it up higher than where I was keeping it. Anyway, I just called the seller and they are sending out a new remot right away. No muss no fuss. I am thinking about getting these for my kids homes for Xmas! Enjoy", "verified": true, "helpfulness": "1/2", "author": "donald e. beason"}, {"rating": 5.0, "review": "the roku works but the power insert where the power cord plugs into is loose and it keeps falling out.  I have to use tape to stop it from falling out.  But other than that it does work.", "verified": true, "helpfulness": "0/1", "author": "DeeEl"}, {"rating": 5.0, "review": "does very well, no need to worry about weather changes stopping our tv watching... It has lots of choices to pick from for channels,,,,", "verified": true, "helpfulness": "0/1", "author": "wudoktr"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "drn7332"}, {"rating": 5.0, "review": "I've owned two Roku models before this one.  It really is faster than my Roku 2 and has performed exactly like I expected.  My favorite feature is the fact that it is USB-powered, and most modern TV's have a USB port.  The Roku is an invisible add-on.  One funny thing, I still find myself \"aiming\" the remote at the TV, even though you don't have to (it's Bluetooth)", "verified": true, "helpfulness": "0/0", "author": "Robert Gamble"}, {"rating": 4.0, "review": "This takes a very long time to load. I think I read 30 seconds but mine probably takes between 45 & 60. Regardless, I love the menu functionality and dedicated Netflix, Amazon Video buttons!  Worth the $$ in my opinion rather than buying a smart tv or wifi enabled dvd player.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love this.  We use it all the time!!", "verified": true, "helpfulness": "0/1", "author": "Aspiring Yogini"}, {"rating": 2.0, "review": "The device works well ...when it works.  The stick overheats and must be unplugged to cool if it freezes up.  I have a Roku 3 that never malfunctions and does not get as warm during use.  The stick's small size IMO does not allow normal heat to dissipate well.  Plus you cannot upgrade storage with an external memory card like you can with the Roku 3.  Plus you will have to add power from another outlet.  I believe most folks will be happier with the standalone versions that connect with a standard HDMI cable instead of the stick.", "verified": true, "helpfulness": "3/4", "author": "William E."}, {"rating": 3.0, "review": "Holy crap does this thing suck down the batteries.", "verified": true, "helpfulness": "1/2", "author": "Chris W."}, {"rating": 2.0, "review": "I am a certified Roku Mega Fan.  This is my 5th device and for the most part I have had absolutely no issues, but this time is different and the trouble started right out of the box.  The remote control does not work.  It is DOA and consequently I am unable to complete the setup so who knows if there will be any more issues.  All I can say is that I am very disappointed with this experience.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Robert\""}]