[{"rating": 1.0, "review": "Horrible!  This worked fine for about a month.  Then it stopped working.  I spent half an hour waiting for customer support, then an hour doing every troubleshoot known to man.  Finally, they told me that I had to reset my DNS numbers on my router.  It reached a point of being ridiculous.  They don't produce a good product, and don't stand by it in case of trouble.  It ended up in the trash.", "verified": true, "helpfulness": "0/1", "author": "Candice Conway \"Dessertcrazy\""}, {"rating": 1.0, "review": "The product stopped completely responding", "verified": true, "helpfulness": "0/1", "author": "Venu gopal"}, {"rating": 1.0, "review": "This product quit working a little over a month after ordering it.  Of course the return window is now closed and I am unable to contact the seller.  I would not recommend.", "verified": true, "helpfulness": "0/0", "author": "Sara Alexander"}, {"rating": 1.0, "review": "It froze and would not restart and remote control did not work", "verified": true, "helpfulness": "0/1", "author": "John Mangum"}, {"rating": 5.0, "review": "works as described I am very pleased with the results I am able to watch many more channels than I had before", "verified": true, "helpfulness": "0/0", "author": "bettypoo"}, {"rating": 4.0, "review": "This thing is great if you don't want to spend the money on cable. The only two things that are a little annoying are that it takes a minute or two to warm up, and you can't stream your music from your phone on iTunes. But there is an app for spotify and pandora, so it's not the worst thing.", "verified": true, "helpfulness": "0/0", "author": "Cassandra E"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "robert t dantzler"}, {"rating": 4.0, "review": "First one was a dud -- returned and got second.  Second one worked.", "verified": true, "helpfulness": "0/0", "author": "Danyel Areff"}, {"rating": 5.0, "review": "Received quicker than expected.  Included everything I needed to for easy and fast set up.  I love it!", "verified": true, "helpfulness": "0/0", "author": "cari moreland"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "dave halvorson"}]