[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "dino jimenez"}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "gary burbrink"}, {"rating": 2.0, "review": "I received my unit in record time. However, I was not informed nor did I find in the description of the product did I see that I had to have internet access. When I called roku tech support they tried to charge me to activate the unit. I had already did that. I needed to know how to get a hotspot password and set up for access. They hung up on me twice. I am still very angry for this treatment. I called Amazon cust. service. and the rep I spoke with was very understanding, but my cell phone had a defect and I was not able to complete my complaint. Trying to address that issue today. Will call from a relative's phone to follow up. Thanks. R. Baker 404 -453-8417", "verified": false, "helpfulness": "0/1", "author": "myrna myrick"}, {"rating": 1.0, "review": "My item was faultyThe remote didnt work as expected", "verified": true, "helpfulness": "1/1", "author": "Gaurav Rana"}, {"rating": 5.0, "review": "Great deal! I received this item in 2 days! It wors great!", "verified": true, "helpfulness": "0/0", "author": "John Hesch"}, {"rating": 5.0, "review": "Love this! I was a little skeptical to buy the refurbished model, but I do not regret it at all. It looks brand new and works like a charm. Would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Lindsey"}, {"rating": 1.0, "review": "Absolutely horrendous. The stick will turn on and off and it takes forever to connect the remote. DO NOT BUY THIS PIECE OF CRAP.", "verified": false, "helpfulness": "0/0", "author": "Richard J Kinsella"}, {"rating": 5.0, "review": "works amazing, and fast set up. Very comparable to a sony box i have, but much more updated, love the small sleek size also", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "I love this. It's our second RoKu and the other has a small box that has a long cord.  This just plugs in the back of the tv out of sight and works great.", "verified": true, "helpfulness": "0/0", "author": "K&T;"}, {"rating": 1.0, "review": "it did not find any wifi and this stick got so hot after a few minutes of being plugged on (without any actual streaming service) customer support refused to help me to process refund, online return request form does not work. Online chat took forever to discuss refund. Big and huge headache. Still did not refund it. :(  Waist of time and money.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"No surprises\""}]