[{"rating": 1.0, "review": "Maybe it's because it was certified refurbished, but despite having to reset it numerous times to get it to unfreeze, it never stayed connected after multiple scans to get it to recognize our wifi (chatting with technical support during most of set up).  Once it finally set up, we were not able to open any of channels because it would not stay connected to our wifi.  On top of that, the remote kept un-pairing with the device.  We are waiting for our claim to go through, but we plan on purchasing a new one and hope to have a better experience.", "verified": true, "helpfulness": "0/0", "author": "Erin Brophy"}, {"rating": 1.0, "review": "It has problems with the remote locking up and the only way to unlock it is to remove and re-install the batteries in the remote.  I went through  a maddening troubleshooting session with exefril q at Roku and  he suggested that other wifi appliances can cause a failure.  I was asked to turn off the ipad, iphone, ps3, and laptop. Even this did not work.  I left the troubleshooting session when it was suggested to try on another tv.  I am not going to buy another $800 in the hopes that I can get a $49 Roku to work.  I am not thrilled with the customer service there as I was expecting them to say lets try a new remote and see it that works.  I think they wanted to wait out the warranty with silly troubleshooting request.", "verified": true, "helpfulness": "2/2", "author": "Dean Ketcherside"}, {"rating": 5.0, "review": "we already have 2 roku 2s and this one is better than those. I expected the small size meant that the product was not as good, but that was not the case. More games and apps are available for this unit and many of the apps are more sophisticated.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "Love it, use it daily.", "verified": true, "helpfulness": "0/0", "author": "DiAnn Thompson"}, {"rating": 5.0, "review": "Cool device. Works well.", "verified": true, "helpfulness": "0/0", "author": "Gary D. Simon"}, {"rating": 3.0, "review": "Amazing but we are still learning how to use it .Cant get TBS that's a negative.", "verified": true, "helpfulness": "0/0", "author": "Carita A. Warner"}, {"rating": 5.0, "review": "love love love it!!!", "verified": true, "helpfulness": "0/0", "author": "tgirl21791"}, {"rating": 5.0, "review": "A great alternative to satellite tv. With an HD antenna and this, you get most programming that is available at a far less cost. Great device!", "verified": true, "helpfulness": "0/0", "author": "Charles P."}, {"rating": 5.0, "review": "It works great. Even better is that you can just plug it into the TV HDMI to power it so there is less wires running to and from your TV. The only downside to that is you have to wait for about 20 seconds after the TV is turned on for it to boot up, but that is not bad. And if you lose your remote, download one for your phone.", "verified": true, "helpfulness": "0/0", "author": "Raymond T Kaline II"}, {"rating": 1.0, "review": "Go with the Roku 3. I bought this, returned. Bought the Roku 2, returned, and spent the money on the Roku 3. I already owned 2 Roku 3's but was trying to get minimal functionality for minimal spending. Bad idea. The Roku SS and Roku 2 have some defecits that make paying the little bit extra, well worth the money.", "verified": true, "helpfulness": "0/0", "author": "E. Zatko"}]