[{"rating": 3.0, "review": "Sometimes it runs through the menus out of control.  Very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Rodney W"}, {"rating": 1.0, "review": "Piece of useless garbage. I got it on Sunday, it would not connect. Did a restart on Monday and it finally did. Today  it has crashed multiple times and now it can't  even find the remote. I hate useless technology!", "verified": true, "helpfulness": "0/0", "author": "jbjammin"}, {"rating": 5.0, "review": "This thing is incredible.  It is SO SO SO much better than cable.  It allows me to take charge of my TV watching, rather then the cable company leading me by the nose as to what and when I get to watch things.  I am on a variable schedule at work, never know when I will be able to do things for myself.  Now I not only can watch what shows I want when I want, I can stop it, and continue the show or movie at a later date. Its much better than a DVR.  Also, I can play music through the Roku with the Roku app right through my phone, and while it is playing the music, I can put pictures from my phone up on the TV as a slide show or just one at a time.  Its great.  Have friends over, play some cool music, and without having to use a small monitor on the computer, or print pictures and waste all the paper and ink, I can just put up huge pictures on my wide screen TV.  AWESOME.  I suggest it you are older, join and pay for Hulu.  It has all the cool old shows, not like the crap that is on Cable.  I have hundreds of cable channels, and will sit and go through them unable to find anything to watch.  With Roku, and Hulu, and Amazon Prime, I have so many favorites that I don't even use favorites much, I simply go to the channels in either Hulu or Amazon Prime and there are so many shows or movies I want to watch, I need to retire to watch them all.  This thing is simply AWESOME.  I am ordering one of the table models now, probably the #3 one, I don't want the voice activated one, as I have read about how some Flat Screen Smart TV's with voice command built in, allows companies to listen in on your daily conversations in your home.  Read Consumer Reports recent issue on it.  Get a Roku and Amazon Prime, you wont be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Commander-RR"}, {"rating": 5.0, "review": "Love the Roku stick ! Works great !", "verified": true, "helpfulness": "0/0", "author": "DREW"}, {"rating": 3.0, "review": "It's nice to be able to plug in the Roku stick directly into the TV but you give up significant processing power that results in noticible slowness compared to the box model.", "verified": true, "helpfulness": "0/0", "author": "RWS"}, {"rating": 4.0, "review": "Purchased item serves our streaming select video websites requirements", "verified": true, "helpfulness": "0/0", "author": "Jim Penn"}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Rae"}, {"rating": 2.0, "review": "I love Roku.  I have a Roku3 that is the most used device in the house.  But the Roku Stick is an awful piece of Roku tech.  It's slow.  Soooooooooooooooo sloooooooooooooooooooooooooooooooooooow.  The remote forgets about the stick every time you turn off the TV.  Do you have any idea how hard it is to interact with a Roku when you don't have a working remote?  And it's not nearly as easy to pair the remote to the stick as it was to the Roku3.  Word of advice - get a USB power plug and leave the stick powered on all the time.  Save yourself a lot of time and trouble with the remote being forgotten.  And don't buy this POS.  Pay the extra money and spring for the Roku3.  I'm so disappointed in this thing.  I'm glad it's on a secondary TV that I rarely use.", "verified": true, "helpfulness": "0/0", "author": "J. Chang"}, {"rating": 4.0, "review": "My streaming stick works fine.  It's just ATT I have a problem with.  My service comes and goes!", "verified": true, "helpfulness": "0/0", "author": "Marge"}, {"rating": 4.0, "review": "it works fine i had no problems", "verified": true, "helpfulness": "0/0", "author": "Wilbert Edwards"}]