[{"rating": 5.0, "review": "I love this.  Our family has been a Roku fan since we \"cut the cord\" back in 2010.  We have had the little Roku boxes with mixed successes, but the boxes have gotten better.  We even have had WiFi enabled Blu-ray and purchased a Chromecast that somehow we were the only ones who used for my parents.  But this is my favorite.  Why is this better than the Chromecast?  Because it has the remote, HANDS down.  And yes, it is totally worth it.  I have kids, I don't want them messing with apps and learning how to cast Netflix and Amazon from tablets or PCs as preschoolers to watch their precious 30 minutes of Kipper or Blue's Clues.  They are, however, perfectly capable of using this very user-friendly remote.Next great thing?  Not having the little box.  I was a little concerned because I have become so accustomed to having that little box around, but it really is a convenience not having to have a little spot for that little thing to sit.  You do, however, still need a power source, so don't forget that.The price tag is perhaps a small negative compared to the Chromecast if you are really on a tight budget.  If you are really hurting and absolutely need something?  Go for the chromecast and such up the inconvenience if you absolutely just need something to run your Netflix.  HOWEVER, the major thing for us being Roku fans is that it supports Amazon Instant video from which we actually have purchased movies and TV series that we do want to watch with good quality video that at this time you cannot get from the other.The final plus for this is the portability.  It may not seem like a huge deal to have, but for someone who doesn't have cable, that nearly always has access to WiFi when they travel?  This is really handy to have.  The husband has to travel with work from time to time and has access to free WiFi with his travel, and always stays at nicer hotels that, while they often don't have a great cable selection, they still have a nicer TV that he can hook this up to.", "verified": true, "helpfulness": "0/0", "author": "MrsK"}, {"rating": 5.0, "review": "JUST GREAT", "verified": false, "helpfulness": "0/0", "author": "Michael Jeffrey Pirrung"}, {"rating": 1.0, "review": "If you are not In these countries dont buy it, top channels like netflix, amazon instante vídeo, etc can not be added. Now i got an useless hdmi stick.", "verified": true, "helpfulness": "0/0", "author": "Gustavo Pefaur"}, {"rating": 1.0, "review": "Just didn't work with our Samsung TV. It would freeze. Tried going to the boards to find solutions but nothing worked. Returned it back to Amazon. Thanks Amazon for your great customer service!", "verified": true, "helpfulness": "0/0", "author": "Sushimixy2k \"kermity2k\""}, {"rating": 5.0, "review": "This thing is neat. The best part it's portable.", "verified": false, "helpfulness": "0/0", "author": "Greg"}, {"rating": 3.0, "review": "Free Hulu Plus for two months does not apply if you already have Hulu!  For me, that meant that when I hooked up free service for a one week trial on my Roku 3, I was no longer a new customer.  8 days later I recieved my 3500R stick, and I am not eligible for 2 months free.Knowing that, I might have bought a similar used unit, or a new one from another source.  I feel like it should be on the main page, not three pages deep in fine print.Visit :  roku.com/hulu-offer for the most accurate details.  The stick itself is much like the other Roku products, and works the same.  Wireless was easy to set up, and it downloaded all the same channels that my other unit had, since I connected it to the same Roku account.  That made setup much faster.It is noticeably slower than my roku 3, however I have a wall mounted TV in my bedroom with the wires going through the wall.  So this was a clean and easy way to add Roku without dismounting my TV and running wires.Another consideration that I haven't read from others is the power source.  The USB adapter for power goes into a port on the end of the roku, extending the overall length by another inch or two, which could make it more noticeable or easier to hit on accident.  Also, I plugged the usb adapter into my tv's port instead of using the wall AC base.  This means that the Roku doesn't get power until the television is turned on.  That's mostly a plus, but also means that the Roku takes a minute to get fired up after you turn on your tv.  If you're impatient, run the AC base and adapter cord to the TV and have the power on all the time.I'd give this unit 3 1/2 to 4 stars, except for the freebie issue.", "verified": true, "helpfulness": "3/3", "author": "DIYGuy"}, {"rating": 4.0, "review": "Pros:Small and doesn't take space.Inexpensive.Builtin HDMI doesn't require buying an expensive cable.Cons:The Netflix application is not as good as my Roku 1 for whatever reason.The remote isn't as responsive as my Roku 1.I had to buy a right angle adapter for my TV to use this.Conclusion: It's a good buy. But I still prefer the Roku 1.", "verified": true, "helpfulness": "0/0", "author": "Woodie"}, {"rating": 5.0, "review": "Very good product ... my flat screen is 'smart' but I use this instead of the smart functions on the tv, this Roku makes my smart functions look dumb, this is much more flexible.", "verified": true, "helpfulness": "0/0", "author": "Willis W Hines Sr"}, {"rating": 2.0, "review": "Having this plugged into the usb port on my TV meant it didn't have constant power. It took forever to load once I turned on the TV. After just a few days, it wasn't holding a solid connection to my WIFI or to the remote. Maybe it was just a bad device, but I returned it for a Roku 2 and that works much better.", "verified": true, "helpfulness": "0/0", "author": "Mary E. Thayer \"geminidreamz\""}, {"rating": 5.0, "review": "works like magic. love my roku", "verified": true, "helpfulness": "0/0", "author": "KWADWO ANANE"}]