[{"rating": 5.0, "review": "High quality and good price", "verified": true, "helpfulness": "0/0", "author": "Monte Rathbun"}, {"rating": 3.0, "review": "It didn't work on my TV because it has an electrical cord to be plugged in and I was out of outlets in my surge protector and there wasn't another plug available within reach so I had to return it. But that's just me. We have Roku on other TVs and it works fine.", "verified": true, "helpfulness": "0/0", "author": "Cindy Bulens \"Cindy B\""}, {"rating": 5.0, "review": "Excellent, easy to use even for old folks..", "verified": true, "helpfulness": "0/0", "author": "Keith K."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kystal Saulsbury"}, {"rating": 3.0, "review": "I like the USB plug in so there's one less AC cord to cause an eyesore, but that's about the only perk over a standard Roku LT. I've been using Roku boxes since generation 1 and currently have LT's in the house with the exception of this stick.The remote not needing line of sight would be nice if it worked consistently. Unfortunately the remote functionality is choppy and inconsistent. The interface itself is not as reliable as the standard Roku either. Much more prone to freezing up, and the bummer is the rebooting process on the stick requires either turning the TV off or unplugging the tiny cord from the stick or USB port on the back of your TV (if the stick is powered from the TV's USB input). Next time I'll just get a regular Roku and deal with the cords...", "verified": true, "helpfulness": "0/0", "author": "Chad Miller"}, {"rating": 4.0, "review": "The Roku streaming stick is awesome! Had a little trouble with getting it activated but I heard from others that the problem was with Comcast Internet not Roku!", "verified": true, "helpfulness": "0/0", "author": "Charles Getz"}, {"rating": 1.0, "review": "fantastic except for the fact that connecting to the HDMI port on your TV will likely result in the failure of the terminal (male) end of this device thus rendering it totally useless!  Dear Roku, This is an inherent engineering design defect (with no apparent workaround?)", "verified": true, "helpfulness": "0/1", "author": "aeromedicstat"}, {"rating": 5.0, "review": "Roku is the best, and the price is right", "verified": true, "helpfulness": "0/0", "author": "Agustin Diaz \"Hommo Erectus\""}, {"rating": 5.0, "review": "You will love this!!!😄😄", "verified": true, "helpfulness": "0/0", "author": "Mark A. Mordecai"}, {"rating": 5.0, "review": "Yes, it was easy to connect and it works great with my wireless connection!", "verified": true, "helpfulness": "0/0", "author": "Nichole"}]