[{"rating": 5.0, "review": "very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Constance Lane"}, {"rating": 5.0, "review": "To day I can not live without roku! and this one ( my second) I can take it with me, when I travel,or spend time in my vacation home!.", "verified": true, "helpfulness": "0/0", "author": "baxpress"}, {"rating": 5.0, "review": "Perfect I love it, now all wires are hidden behind the TV", "verified": true, "helpfulness": "0/0", "author": "Larry Hayes"}, {"rating": 2.0, "review": "I got one for a Christmas present, don't have the sales receipt, and the box is long gone.  It was great for the three weeks it worked.  Watching YouTube videos on your TV and controlling them from your cellphone is really neat!  Look, these things are very cheaply constructed.  They're hard to plug into your set, and the slightest little miscue can damage the stick, irreparably.  I don't know for sure how it happened, but mine stopped displaying the video.  The audio is fine, but all I get is a purple screen.  Googling the problem led me to believe that the copy protection between my TV and the Roku stick is not \"handshaking.\"  Rebooting seems to have solved some users problem but not mine.  So, I guess I'm out fifty plus bucks if I want to replace it, which I haven't decided on yet.  Bottom line:  be careful with the flimsy little thing . . .", "verified": false, "helpfulness": "2/3", "author": "jackflash"}, {"rating": 1.0, "review": "Worked less than 1 day", "verified": true, "helpfulness": "0/0", "author": "kevin jones"}, {"rating": 5.0, "review": "This is an excellent product. If your tired of high cable bills, this is the product to buy. I like the fact it has a constant power supply (plug into wall, with AC power, as if you only power through HDMI port, each time you shut off TV, Roku stick reboots) The included (came with batteries) is a bit cheesy, but is an RF remote (good) The array of free channels is great. I went with Hulu+ (3 free months included) & Amazon Prime as my paid channels. With Amazon Prime (already had), you have access to a ton of movies & TV shows, plus free shipping & 2 day delivery. I have a 25 MBPS connection and have no issues with buffering. You can go with a DSL connection as for SD (480p) you only need 1-3 MBPS to stream & can get HD  (720p or 1080p) at 7-15 MBPS. For your broadcast channels, use an antenna or wait a day or two and watch them on either paid app. Right out of the box you can start saving big dollars. The Roku interface is easy to get used to. It's like using an iPhone, click on the app (channel) you want to watch and enjoy. So for me, I have an internet connection & a cell phone and all is good.I'm very satisfied.", "verified": false, "helpfulness": "0/0", "author": "Mark Tosi"}, {"rating": 5.0, "review": "Such a fun product. If you have to choose between getting an internet connection and getting cable, pick up a Roku and get rid of your cable TV bill. There are apps like Plex which basically make your cable service pointless. For the on demand generation, Roku has won me over with this product. I got it for cheaper than the Chromecast and any other competitors over the Holiday.", "verified": true, "helpfulness": "0/0", "author": "Rob Kaufman"}, {"rating": 4.0, "review": "A friend sent this to me and I love it!  I'm having great fun exploring all the channels and watching many movies.  TV cable? What's that?I've almost forgotten.  While  buffering or freezing is rare, it has happened a couple of times so that's why I can't give it a full 5 stars.  I'm wondering if that has to do with weak wifi signals sometimes.  What are the best specs for a wireless router to give excellent streaming performance?Besides the occasional interruption, this Roku stick is absolutely awesome!  I love it!Hint: On free movie channels, sometimes the screen will go blank.  Don't reset.  There is nothing wrong.  These are just holder spaces where a commercial is supposed to be.  Just hold on and the movie will come back...eventually.Hint to advertisers.  Showing your commercial twice won't influence me to buy your product anymore.  In fact, doing so is annoying and a turnoff to whatever you are selling.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I read many, many reviews trying to decide on buying a Stick or a Roku 3 media center.  From what I read it seemed that the stick would suit my needs perfectly, mostly streaming Amazon prime and Nextflix, so I bought the stick. I have it connected to my TV via HDMI with an HDMI and Optical cable connecting to my surround sound receiver.Once I started trying to watch a movie on Netflix I noticed that the dialog sounded very muddled so I did some research.  I found the following forum post in response to other people experiencing this problem \"You'll probably need to make sure Netflix is set to stereo mode. Netflix uses Dolby Digital Plus for its 5.1 audio, which can't be passed via optical or coax cable, so it's unlikely your TV is able to pass it through to your receiver...\"So I would not recommend going with the Stick if you use an optical cable to connect the sound signal to your TV if you are planning to watch Netflix, unless you don't mind losing the surround sound.The forum I found this on is > http://forums.roku.com/viewtopic.php?p=436298&sid;=b3931483cf32b9bc33a3b4cd400077dc", "verified": true, "helpfulness": "0/0", "author": "Brandon Tidwell"}, {"rating": 5.0, "review": "I am very happy with the Roku streaming stick. I wanted something simple and inexpensive to play Netflix, Amazon Prime, etc. on my TV without having to connect my laptop and this works great. Setup could be a little annoying for certain channels but not difficult. Once set up, it is extremely easy to use. It is a little slow to load up certain channels; I read that many others had the same complaint, and it is definitely a minor one. Once the content is loaded up it plays seamlessly, no problems. To me that's way more important than having Netflix load up 30 seconds faster. Content is also easily streaming from a computer using Plex, even MKV files. The Roku channel lineup is huge, and the interface is simple and very easy to navigate. Overall, I think this is a great device. Inexpensive, very compact/easy to travel with, easy to use, great quality.", "verified": true, "helpfulness": "1/1", "author": "RyanS93"}]