[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "A. Seu"}, {"rating": 1.0, "review": "Not what I expected, some channel apps you need to purchase or you needs to be subscribed like HBO, Time Warner etc. Yes some are free but if your idea is to save money, you need to preview it yourself.  The set up is very easy, the connection is very easy as we'll.", "verified": true, "helpfulness": "0/2", "author": "wilfredo diaz"}, {"rating": 3.0, "review": "I can't get it to work. Probably something that I am doing wrong.", "verified": true, "helpfulness": "0/1", "author": "Dale 73"}, {"rating": 5.0, "review": "GREAT", "verified": false, "helpfulness": "0/0", "author": "Destiny"}, {"rating": 5.0, "review": "I love this !  After having boycotting the money-hungry cable company for three years, this brings me everything I need .Such easy install, too", "verified": false, "helpfulness": "0/0", "author": "Barb in galveston"}, {"rating": 5.0, "review": "Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Nadisar \"Knowledge Seeker\""}, {"rating": 5.0, "review": "Everything I expected and more would recommend everyone get one", "verified": true, "helpfulness": "0/0", "author": "Thomas E. Brewer"}, {"rating": 5.0, "review": "bought one first to see how it worked, we ended up ungrading the internet and buying them for all four tvs and getting rid of cable, it doesnt have local news, or day time show like cable but with the right research and app you can find easy replacements for them", "verified": true, "helpfulness": "0/0", "author": "Chris Prause"}, {"rating": 1.0, "review": "Freezes constantly now won't respond at all change batteries twice not batteries just doesn't work", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"Nina\""}, {"rating": 1.0, "review": "Seriously. I purchased this last week. I have been sitting on the start up boot screen since then. One it starts and connects to wifi and updates, it boots continuously forever. What gives? I didn't want to pay $50 for it to bounce roku letters on my screen. Paperweight.", "verified": true, "helpfulness": "0/1", "author": "Kailey"}]