[{"rating": 5.0, "review": "Perfect condition", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works great no problems", "verified": true, "helpfulness": "0/0", "author": "Jeremy miller"}, {"rating": 5.0, "review": "Work great", "verified": true, "helpfulness": "0/0", "author": "Poyson"}, {"rating": 1.0, "review": "One of several different manufacturers.  Worked well for a few days then quit.  Absolutely the worst service I have ever encountered.  They refuse to exchange for a replacement.  All they did was make promises but did not do anything to help me.  I had nothing.  I spent way too much time trying to replace my piece of junk.  Ended up purchasing another competitors.  Do not buy anything from them unless you are aware of no service and no warranty.  Buyer beware.", "verified": true, "helpfulness": "0/0", "author": "Razor Ray"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Enzo Ferrari"}, {"rating": 5.0, "review": "very good thank you !!!", "verified": false, "helpfulness": "0/0", "author": "altagracia diaz"}, {"rating": 5.0, "review": "everything and more than I expected", "verified": true, "helpfulness": "0/0", "author": "Gary Steele"}, {"rating": 5.0, "review": "This is the best way to stream ever!!!!!  I got rid of my cable about two years ago and just started streaming Netflix.  First I started streaming with my xbox which frankly was a pain since you first have to get on xbox live then get on Netflix, it took forever!  Then I went to streaming it through my blu-ray player which again you have to turn everything on and wait then connect to the internet and then onto Netflix.  A coworker of mine told me about the Roku when I said there was something not working right with my blu-ray while streaming.  It had started to kick me off Netflix right in the middle of a movie.  So anyway she told me all about the Roku stick and I was practically sold already.  When I got it which was super quick from Amazon I just plugged it into my tv and set up my profile and there was Netflix just like that.  Now I just turn on my tv and Roku menu comes up and I hit the Netflix button right on the Roku remote and before I can even move my hand up the remote to the \"ok\" button Netflix is up and going, it is that fast!!!!  I am so thrilled with it I've been telling everyone about it!!!!  Been using it for several months now and everyday I go to watch Netflix and it never fails me, sooooo happy!!!!", "verified": true, "helpfulness": "0/0", "author": "Emilee Bailey"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Visa"}, {"rating": 5.0, "review": "The Roku 3500XB is the exact same thing as the 3500R, just refurbished.  Came wit everything you need and was easy to setup.  Fantastic Roku device.  Upgraded from the old Roku XD and this was a huge improvement.  Much faster menu system.  The remote is almost a lot more responsive and being able to use my cell phone as a remote is a nice bonus.  Mirror from my phone is something the old model couldn't do and adds a lot of new functions I didn't have before.  With dual-band wi-fi the streaming is very fast and high quality.", "verified": true, "helpfulness": "0/0", "author": "Paul C."}]