[{"rating": 2.0, "review": "I was very disappointed with this device for several reasons. The description is somewhat misleading. It doesn't tell you that you have to be a paying customer of a satellite or cable TV provider in order to access the vast majority of the content. There is only a tiny amount of free content, and they force you to watch the same commercials over and over again during the free programs. I knew I wasn't going to get a free TV service with the latest shows on the Roku, but I thought there would at least be enough older stuff available for free to keep me entertained. Not the case!Second, its very slow to boot up and respond to remote input. Worst, it didn't work at all if it wasn't on a TV right next to my WiFi router. I put it in a bedroom about 40 feet from the router and it constantly froze up to the point that it was unusable. I did a speed test on my phone through WiFi at the same location and I had almost 16mb/s, which is way more than needed for 1080P streaming. Its now just as useful in the landfill as it was on my TV. I gave it 2 stars only because it would be OK for Netflix or other paid services as long as it was right next to a strong WiFi signal.", "verified": true, "helpfulness": "0/3", "author": "SKRX"}, {"rating": 4.0, "review": "Well, I got this because my Apple TV keeps having issues with the controller.  Got this - it does not function as well as an Apple TV - the Roku is definitely slower, and the Roku interface and screen savers are not as aesthetically pleasing to my tastes.That said, this works, if somewhat clunkilly - AND I do find I use this for my Amazon Prime videos.  AP has some nice series these days, like John Adams, and the Sopranos - making it worth getting access to Amazon Prime on the big screen.But I still find I like the Apple TV better for Netflix and Hulu Plus.But what's the deal with the Blockbuster button?!?!", "verified": true, "helpfulness": "0/0", "author": "James T. Barringer \"Just the facts, Ma'm\""}, {"rating": 2.0, "review": "As an owner of a Roku HD, Chromecast and Apple TV, I think I have a pretty good idea of what a streaming media player should be able to handle.After purchasing a new TV for my bedroom, I decided to save a little money and buy this stick due to the good reviews and the fact that I didn't want to hide an additional power plug and HDMI cord in my bedroom. Big mistake.This device is extremely under powered. Upon turning my TV on, it takes 2-3 minutes for this device to boot up. A bouncing \"Roku\" label is on the screen and you just wonder when the damn thing is going to be usable. Once you get in, each app takes another 30 sec to a min to open up and start running. I'm sorry but in this day and age, that is just unacceptable loading time.Finally I have to agree with many other reviewers that the remote is very weak. I consistently have to hit a button two or three times before the device reacts.Overall it is a frustrating and disappointing product. If I had not already thrown out the box I would have definitely returned it.", "verified": true, "helpfulness": "2/3", "author": "TheCompostMan"}, {"rating": 5.0, "review": "Roku is great.  This is our 3rd Roku...1st streaming stick.  Would recommend Roku and Amazon Prime!!!", "verified": true, "helpfulness": "0/0", "author": "J. Claypool \"LadyBug\""}, {"rating": 5.0, "review": "I've read some reviews regarding power source for this roku. I just plugged mine into an existing usb port on the television and it's working just fine. This is a great product if you don't want to replace a good \"non smart\" tv. This basically turns your TV into a \"smart tv\". I would highly recommend.", "verified": true, "helpfulness": "0/1", "author": "Joshua M Jarvis"}, {"rating": 5.0, "review": "The Roku Streaming Stick works exactly as advertised, even on my relatively weak wireless network set up. The complaints I've read regarding the Streaming Stick are:- It is slow to load (takes about 1 minute to cold start)- Netflix/Amazon channels take too long to load (again about 1 minute)- The streaming stick does not work with their old/non-MHL TV (works fine on my \"old\" 2008 Insignia non-MHL TV)- Lastly, that the streaming stick does not fit into the space right outside their HDMI slot on their TV due to lack of room because of the design of the TV (this actually is an issue with one of my TVs--a Sony TV, as the HDMI pocket space behind the TV and below the HDMI slot, does not allow for the streaming stick to fit). I fixed this issue be purchasing the Aurum Ultra Series HDMI Extension Cable.So for me the only legitimate complaint is that one of my two TVs has a design which does not allow placement of the Streaming Stick. However, I have purchased an inexpensive female/male HDMI cable which allows me to extend out HDMI port, and now all works well.I mainly use my Roku Streaming Stick for Amazon and Netflix, as well as with a Dell Venue Pro 8 tablet and Plex Media Server to stream downloaded videos at 720P (the highest resolution on my TVs) from my tablet's hard drive. No complaints here regarding streaming quality.Would highly recommend this to anyone who wants to use the Amazon/Netflix channels, or who wants to stream videos from their computer/tablet/phone, but it will require coupling with the Plex Media Server (and then accessing Plex channel on Roku) to do that.Great value for the price, and if it doesn't fit in your TV due to the design of your HDMI ports, just buy an female/male extender and you should be fine.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Lopez Jr"}, {"rating": 3.0, "review": "Seems to take a long time to load and the stick gets very warm if the TV is on. Once I had to unplug it and let it cool before it would work. Called Roku and they told me to \"unplug\" it from the TV when not in use which is kind of a pain as many TV's are in a built-in cabinet. My gut tells me the have a issue and there having the customer do the work around.", "verified": true, "helpfulness": "0/0", "author": "double d"}, {"rating": 5.0, "review": "Love my Roku stick!  It's the most compact, simple way to stream Internet content to my TV. Saves me the cost of an expensive cable or satellite monthly bill. Perfect since I only watch occasional movies (Prime) or listen to music or watch Youtube videos (which now work on the Roku!)  Great buy.", "verified": true, "helpfulness": "0/0", "author": "Argan Luxury Owner \"Customer Service\""}, {"rating": 1.0, "review": "doesn't work outside the usa, crappy divice", "verified": true, "helpfulness": "0/0", "author": "Ariel Gomez"}, {"rating": 1.0, "review": "My Roku stick stopped streaming Netflix 6 weeks after purchase.  Of course, this is past the one month warranty and past the window to return to Amazon.  Roku customer service has been unresponsive.  Ours is not an isolated case, either - many users are experiencing the same thing (see Roku forums, Netflix forums, service provider forums, etc.) within a month to several months after purchasing.  After checking for connectivity (no issues, Netflx works fine on the PC), resetting to factory settings, and still waiting for a response from Roku, there seems to be no fix.  I am beyond disappointed.  I cannot recommend this product and regret purchasing it.", "verified": true, "helpfulness": "1/2", "author": "swankyankee"}]