[{"rating": 1.0, "review": "I spent way too many hours trying to get this to work. I was on customer support several different times for up to 1.5 hours.  I had high hopes that have been crushed.", "verified": true, "helpfulness": "0/0", "author": "SV"}, {"rating": 5.0, "review": "Great for using pay internet TV services, and now my cable company app on Roku actually allows me to see all the channels we are paying for (HD channels w/o the monthly vampire charge + tax for a cable box).Nothing fancy, but gets the job done.Only issues are related to the 'high speed' internet from cable provider.", "verified": true, "helpfulness": "1/1", "author": "JwS"}, {"rating": 5.0, "review": "I was told about this awesome \"gadget\" by a family member and I absolutely LOVE IT!!  I get to see ALL my favorite tv shows and old movies too!", "verified": true, "helpfulness": "0/0", "author": "Mary Barrasa"}, {"rating": 5.0, "review": "I cancelled my cable subscription because I own this. No more Dish Network. I am excited to buy another one.", "verified": false, "helpfulness": "1/1", "author": "Michael J."}, {"rating": 1.0, "review": "Set up was fine, but it would take FOREVER to load something or keep stopping and reloading multiple time during a show. Exchanged for the Roku 3 whick works great.", "verified": true, "helpfulness": "1/2", "author": "Jeff Damboise"}, {"rating": 5.0, "review": "Excellent product.  Although my 11 year old granddaughter got it running it was only because she wouldn't let me do it.  A snap to set up!", "verified": true, "helpfulness": "0/0", "author": "Stephen M. Flatow"}, {"rating": 4.0, "review": "OK. But haven't tried it out fully yet.", "verified": true, "helpfulness": "0/2", "author": "Colin Crawford"}, {"rating": 5.0, "review": "The roku streaming stick is SO easy to install and set up. Idiot proof. Also relatively quick. Less than five minutes to set mine up. Comes with the stick, remote, batteries, usb power cable, and wall outlet power cable. It isn't necessary to get power to your roku using the wall outlet cable as long as you have a free USB port on your hdtv close to the roku stick... BUT the manual does say that not every television will emit enough power thru the USB port to keep the roku running. Mine is plugged into the usb and has been working fine.You customize your homepage to include \"channels\" like netflix, amazon prime, hulu, etc. What's great is you can also add hbogo and showtime anything which is cool because not all the streaming device work for both of these subscriptions. The only pain was that in adding both those apps you have to sign into your cable account on the roku, then you have to sign into your cable account on the hbogo website and the showtime website to get your activation code to enter into the roku. The showtime anytime website said it could not set up activation from the mobile website and that a computer was needed to activate. So that was kind of annoying... On a better note, you can also have your cable provider app which allows you to watch on demand content. If other Time Warner Cable users have noticed that the on demand is frequently missing a bunch of items and takes forever to add recent content, you'll be happy to know that the TWC app has EVERYTHING uploaded immediately! So no more waiting for your favorite tv show's latest episode to be put on demand.ALSO big perks! The roku includes a bunch of free trial subscriptions - free movie rentals from various movie streaming apps, free trial hulu plus, free trial amazon prime streaming.A couple minor flaws that other users mention: - when starting up the roku, it is a little slow to load and go to the main roku screen. You just get to watch a bouncing roku logo until its ready.- is also slow when first entering the netflix app and the red screen with the netflix logo seems to last a little too long. the first time I wondered if maybe the app froze.Just like when streaming on your computer, the video quality may appear grainy at first, but after a few seconds it clears up and has great quality. On my 720p LG HDTV, the quality is GREAT.I did encounter one issue with the roku on the first day - I'm not sure if the roku froze or if my remote suddenly stopped working, but I got stuck on the main screen of the roku and remote didn't do anything, so I had to unplug roku for 30 seconds and plug back in. It has been fine ever since.Ultimately it's a great streaming device for a reasonable price (especially compared to wifi bluray players and gaming systems) and it doesn't take up any space on your tv stand.", "verified": true, "helpfulness": "6/7", "author": "skye"}, {"rating": 2.0, "review": "This was my third try at a streaming device. Obviously if I'm on my third one the first two had problems.Try 1: Smart DVD Player - closed captions don't work with streaming, interface is clunky and slow.Try 2: Google Chrome - doesn't work with Amazon Prime.Try 3: Roku Streaming Stick - worked great at first, closed captions, Prime and Netflix work. After two weeks Netflix freezes the system. Also, device is so long that it didn't fit in one of my tv's, obvious design flaw.Try 4: Fire TV - No closed captions on Prime. No way to restart system without unplugging.I'm trying to decide if I should keep both the Roku and the Fire so I can have a combination of Netflix and Prime, but it seems silly that I should need two devices that do the same thing.Another detraction from both the Fire and Roku is that they need external power. The Roku is so long that the power cannot be plugged in when plugged into the HDMI port on one of my tv's thus rendering it useless. A plus for the Chrome was that it drew power from the TV. Neither have a restart button either which would be helpful for network freezes.I have done trouble shooting for all devices and can't get the above problems fixed.I suppose I will wait for the next streaming device to be released and hope that it actually does what it is supposed to.", "verified": true, "helpfulness": "0/1", "author": "J. Berky \"Self-Proclaimed Nerd\""}, {"rating": 5.0, "review": "Works really good. You will not be disappointed with this Roku", "verified": true, "helpfulness": "0/0", "author": "Gene"}]