[{"rating": 4.0, "review": "Improved", "verified": true, "helpfulness": "0/0", "author": "Neil"}, {"rating": 2.0, "review": "My expectation was that  I may set up my own channels to see them not only the pre-seted ones. As it seems to by not possible to have other chanels than the pre-seted ones for me is useless.", "verified": false, "helpfulness": "0/2", "author": "Anton Popovici"}, {"rating": 4.0, "review": "We already owned the Roku 3, which is a fantastic device. We wanted another for a different TV which is mounted on the wall - reason why I bought this one. The Roku stick is nearly as good, just a tad slower with the interface/menu. Also, I really like how it can be usb powered, everything is tucked neatly behind the TV.", "verified": true, "helpfulness": "0/0", "author": "Alex Snowden"}, {"rating": 1.0, "review": "I own Roku LT which I like it so much that I decided to give Roku streaming stick a try.  What a mistake!  I plugged the stick into three TVs and couldn't anything to display, I double checked the HDMI ports to make sure I was using the right ports.  Disappointed and I had to return it..", "verified": true, "helpfulness": "0/1", "author": "Ochen"}, {"rating": 1.0, "review": "Day 1-6: Worked perfect, loved it! Day 7: Started freezing, did a reboot and it was perfect again, well for a few hours anyway. This was also the day the stick became very hot! Just one week old and this was the cycle every few hours,  Freeze, reboot, repeat. Day 8: It died, dead. Day 9: Returned it and got a full refund. Day 10: That's today and admittedly, while short, I miss the good old days with my Roku streaming stick. I'm currently researching and looking to find an upgraded replacement. I'll be relying a lot on reviews, which is why I wrote this one...don't waste your time or money on this useless hot stick!", "verified": false, "helpfulness": "54/64", "author": "Ali M."}, {"rating": 2.0, "review": "I have ordered 5 of these in the last 4 months. 2 have already quit working. One I was able to exchange. I would not recommend them", "verified": true, "helpfulness": "0/1", "author": "K"}, {"rating": 5.0, "review": "Love it, recommended for my family and friends, only wish I knew how to turn it off lol", "verified": true, "helpfulness": "0/0", "author": "Matthew P."}, {"rating": 5.0, "review": "As part of our cable cutting effort this was added to my wife's office/spare bedroom TV so we can ditch the useless DTA box from the cable company.  Have installed an outdoor antenna to get local channels on that TV and another one in my office.  And we used an HDMI splitter to share one HD cable box with two other TVs.  So altogether we will be saving $15+ per month that we will not be sending to the cable company.If you have a HD TV the streaming stick appears to work quite well.  It is not quite as snappy as our Roku 3 box but it is a good solution for where we are using it.", "verified": true, "helpfulness": "0/0", "author": "Burt Bicksler"}, {"rating": 5.0, "review": "Simply amazing.  We installed this on a wall-mounted HD TV in our bedroom.  Setup was seamless, and our bedtime viewing habits changed -- literally -- overnight.", "verified": true, "helpfulness": "0/0", "author": "gingersnap642"}, {"rating": 5.0, "review": "We gave up cable, love this. So much fun to just pick what you or your family want to watch.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}]