[{"rating": 5.0, "review": "Said goodbye to cable!  We absolutely LOVE our Roku--however we will need cable during football season, GO HAWKS", "verified": true, "helpfulness": "0/0", "author": "sunkissedmom"}, {"rating": 5.0, "review": "Works great. Keep in mind not a lot of apps you can access without having cable or satellite too. Plug into outlet instead of usb and it will work faster.", "verified": true, "helpfulness": "0/0", "author": "Haley R"}, {"rating": 5.0, "review": "It's nice deal and product is working perfect, no issues found yet.", "verified": true, "helpfulness": "0/0", "author": "jo"}, {"rating": 5.0, "review": "Great value for features and sleek user interface! I have been a Roku fan for many years and purchased over 8 units--this $49 version is great and the RF remote is a sweet feature.", "verified": true, "helpfulness": "0/0", "author": "MNgeek \"Matthew J. Jeske\""}, {"rating": 5.0, "review": "Works great!  We got a Roku stick at a lower price than buying new. Funny thing is that it still has the Blockbuster button.", "verified": true, "helpfulness": "0/0", "author": "PW"}, {"rating": 5.0, "review": "Excellent Condition", "verified": true, "helpfulness": "0/0", "author": "Ivan Ledezma"}, {"rating": 5.0, "review": "Took me a while to get used to it but it's a lot of fun.", "verified": true, "helpfulness": "0/0", "author": "Stace"}, {"rating": 5.0, "review": "Purchased for a relative.  They love it!  Freed them from expensive cable tv that gave them little choice in their programming selection.  Combined with an HD antenna hanging in the attic, gives them all the local channels to go with it.", "verified": true, "helpfulness": "0/0", "author": "Kay Harmon"}, {"rating": 4.0, "review": "We dumped our TV service from the cable company - and are using Netflix and Hulu instead over wireless.  This is the perfect way to go since you just plug it into the USB port of the TV.Start up is a bit slow, about 1-2 minutes before you can access Netflix, Hulu, or other apps.  They have a PBS app which is free and that is great!Only a few issues:If you don't use the TV often enough, it will not keep the stick charged - so you will have to plug it into an outlet to keep it working.If you reset the Roku you need to activate it again on the web site - and that is a bit of a pain...If the remote stops working - don't reset the Roku first- try pairing the remote with the Roku again; that seems to work.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The Roku streams video very smoothly but the remote has a tendency to stop working every so often.  There is a fairly simple process to reset it but it is an unnecessary PIA.  There are smart phone apps however to replace the remote that work very well.", "verified": true, "helpfulness": "0/0", "author": "Paul"}]