[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "jesse guzman"}, {"rating": 4.0, "review": "It didn't come with the latest software update and wouldn't connect to my WiFi. Had to get tech support from Amazon, which is no small task, and update the software. Once that was done....no issues. I rate it a 4 star for the product, Service is only a 2 star.Amazon...get on the stick and provide better tech support capability.", "verified": true, "helpfulness": "0/0", "author": "Mackie Shiflett"}, {"rating": 5.0, "review": "You can't ask for more. It works as advertised. My favorite thing about the Fire TV Stick is that I get the Watch ESPN app.", "verified": true, "helpfulness": "0/0", "author": "Bryan Ramirez"}, {"rating": 5.0, "review": "great better and google chrome specially with amazon prime", "verified": true, "helpfulness": "0/0", "author": "jyciano"}, {"rating": 5.0, "review": "Love it. Loaded XBMC on it and made it the best and cheapest android media player.", "verified": true, "helpfulness": "0/0", "author": "bill_le"}, {"rating": 5.0, "review": "I already owned a Chromecast (in fact, I own 2), but the Amazon Fire Stick is a substantial improvement in terms of usability, thanks in large part to the dedicated remote. No more waiting for my iPhone to reconnect to the Chromecast so that I can pause or rewind my movie! I'm keeping my Chromecast for the various apps I have that connect well to it, including the one that lets me cast from my browser, but I will be using the Fire most of the time.", "verified": true, "helpfulness": "0/0", "author": "Scott Eldridge"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "Vitaly Klyarfeld"}, {"rating": 5.0, "review": "Easy install and works great.", "verified": true, "helpfulness": "0/0", "author": "Russell Esau"}, {"rating": 4.0, "review": "Works great! - Love it!", "verified": true, "helpfulness": "0/0", "author": "John Dempsey"}, {"rating": 5.0, "review": "Love love love it!! Super easy to set up upon purchase; does have to be updated upon first use so it took a little but longer than I would like. We watch prime videos and Netflix, primarily. I find it very easy to navigate to what I want (we do not have the voice upgrade.) My children are able to use it no problem, (ages 10, 8, 4) and it has parent guard so they cannot purchase anything. We have used it for about six weeks now. Streaming is fast unless watching during prime streaming hours (when it will be slow on any device so it is not fire stick related.) I only experienced one technical issue and I was able to resolve it by unplugging and trying again.  Love it and recommend to anyone who heavily streams from Netflix like our family does!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]