[{"rating": 1.0, "review": "Hulu freezes and does not stream correctly.  I have an old roku player that plays fine", "verified": false, "helpfulness": "1/1", "author": "Stefanie \"stuffy9911\""}, {"rating": 2.0, "review": "Drops my wi-fi constantly.  The router is 6 ft away...  apps freeze.  Netflix won't connect. Then it connects and drops.  A test says my connection is fine. By the way, the stick runs very hot. Very hot.  I've now played with it for 2 days and don't want to play anymore.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"pop top\""}, {"rating": 5.0, "review": "My son said this works great on his TV and very easy to use, we are going to get one for ourselves now.", "verified": true, "helpfulness": "0/0", "author": "Cleo"}, {"rating": 4.0, "review": "It does get a warm and overheats occasionally. Don't leave it plugged in.", "verified": true, "helpfulness": "1/1", "author": "Joe Hummel \"Comicsrus\""}, {"rating": 5.0, "review": "Love it...", "verified": true, "helpfulness": "0/0", "author": "Guadalupe O'Neill"}, {"rating": 5.0, "review": "Easy installation. Remote control easy to use. Much better than streaming thru video game box. Great purchase at a good price.", "verified": true, "helpfulness": "0/0", "author": "Mashie"}, {"rating": 3.0, "review": "This fire stick is better than the competition  especially if  the tv doesn't have apps  Like  the smart TV by. Philips the remote is great.,set up is easy.  Also become an Amazon prime member it is worth it.  You don't have to but it's worth it.", "verified": true, "helpfulness": "0/0", "author": "k"}, {"rating": 5.0, "review": "It works great", "verified": true, "helpfulness": "0/0", "author": "John Ventura"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Fawziyyah Muhammad"}, {"rating": 4.0, "review": "Love it, but just days after I bought it I saw a prime members-only sale on it! :/ Just my luck, I had been waiting to buy this, and once I finally did, it went on sale immediately afterward. Otherwise, very happy with my purchase-it solved my problem without having to spend too much money. I do wish it had a web browser, and the miracast/screen mirroring does not work well AT ALL (which I am hoping they will be updating to fix it soon or something), but other than that, I am generally satisfied with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "LanneyG"}]