[{"rating": 5.0, "review": "Really like it", "verified": true, "helpfulness": "0/0", "author": "Bobby Rawls"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I had the Chrome Cast which I also like...But I Love the way this one works..BIG TIME !!  Easy to use and easy to install...Hooked up to TV followed directions...Love the fact I have access to Prime Movies..", "verified": true, "helpfulness": "0/0", "author": "A. ARAGON"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Roberto"}, {"rating": 5.0, "review": "Easy to use and a great way to get more uses out of my Prime membership!", "verified": true, "helpfulness": "0/0", "author": "Charlene Rouse"}, {"rating": 5.0, "review": "LOVE THIS THING!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kerry Cummings"}, {"rating": 5.0, "review": "So far, so good! I have only used it a couple of times, but I would say that I really like it. It is quick to load and the picture quality is very good.", "verified": true, "helpfulness": "0/0", "author": "Tim Rossow"}, {"rating": 3.0, "review": "I can not make it work on on our main living room TV ( a Sony 40\" Bravia ) it does work on our small kitchen set, but not the best. We live in the country and the only internet service we can get is basic DSL.  I have always been well satisfied with anything I have bought from Amazon, but not so much with this.Roger", "verified": true, "helpfulness": "0/0", "author": "Roger"}, {"rating": 4.0, "review": "I went from a Roku to the fire stick already owning a FireTV and so far so good.  Had some issues at first, The first TV i plugged into everything would work but as soon as I went to the Disney JR Channel on the slingtv app the device just shutdown needing the be powered down and back on again. I then moved it to another TV where I had nothing but issues, after some searching I found that you MUST use the power supply that came with the stick and my TV's USB port did not have enough power.  The interface is just like its big brother the FireTV and 100 times better than the Roku.  My biggest concern and its the same for the FireTV they offer apps and games and no means of external storage.  With a few big games(Walking dead and Grand Theft) you run out of room very quickly.With the SlingTV app, netflix and plex I have been able to remove my cable service and I have never been happier.  This is a good product but if you can fit it I would suggest the FireTV", "verified": true, "helpfulness": "0/0", "author": "YMB"}, {"rating": 3.0, "review": "Worked fine and was simple to set up.  I deducted one star given that it was not made clear before my purchase that the device needed to be plugged in a separate outlet and not just USB power.  With a wall mounted TV this means visible wires.", "verified": true, "helpfulness": "0/0", "author": "lowpe@aol.com"}]