[{"rating": 5.0, "review": "This is the best media streaming device.", "verified": true, "helpfulness": "0/0", "author": "anon"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Rebecca Kellogg"}, {"rating": 5.0, "review": "I have summer property.  I don't want to get satellite because I don't watch much tv there and don't want the monthly bill.  This is great.  I turn on the WiFi on my phone and get to watch movies when I want.", "verified": true, "helpfulness": "0/0", "author": "TTW"}, {"rating": 5.0, "review": "Like it a little more than chromecast.and its better if you have prime", "verified": true, "helpfulness": "0/0", "author": "kruecial"}, {"rating": 1.0, "review": "Returned I will eventually buy the Box", "verified": true, "helpfulness": "0/0", "author": "Mama Chelle"}, {"rating": 5.0, "review": "Excellent.", "verified": false, "helpfulness": "0/0", "author": "MD"}, {"rating": 5.0, "review": "Great addition our TV options.", "verified": true, "helpfulness": "0/0", "author": "Rex Gore"}, {"rating": 5.0, "review": "Love the fire stick great to be able to watch Prime and Netflix.", "verified": false, "helpfulness": "0/0", "author": "sjtrosclair"}, {"rating": 5.0, "review": "amazing", "verified": true, "helpfulness": "0/0", "author": "TRISHXOO1"}, {"rating": 1.0, "review": "I really wanted to like the Fire TV Stick, but there were too many issues.  For one, it didn't work well with my Westinghouse HDTV.  The TV would display the picture, but only when the stick went into 480p mode.  Trying to put it into 720p or 1080p resulted in constant flickering and flashing of static.  Even in 480p, however, the Stick is fairly poor compared to other streaming devices.  The app selection is poor compared to Roku (although Starzplay is a plus), and the game selection is miserable given how large the selection of Amazon apps is for phones, tablets, etc.  What's more, the controller (which I purchased separately) has a terrible feel and is incredibly unresponsive.  Lastly, the stick froze three times during the first day of use.  Needless to say, I was pretty disappointed, as I am usually impressed by the quality of Amazon products.", "verified": true, "helpfulness": "1/1", "author": "M. Kaplan"}]