[{"rating": 5.0, "review": "Very happy works great good for making a regular tv into a smart tv the phone app works really good with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Javier"}, {"rating": 5.0, "review": "I caught this when it was $19. It is worth way more!!!  I LOVE IT!  It does everything it says!", "verified": true, "helpfulness": "0/0", "author": "A.Panaia"}, {"rating": 1.0, "review": "Don't be fooled by how easy it is to set up this piece of crap. My Fire TV stick worked perfectly for ONE WHOLE DAY after installing it. Since then, my device won't stay connected to my network. A seashell would've been more interesting to look at instead of an error message. I'm returning this for a full refund. I should've gone with my first instinct to buy Google Chromecast! I'm not happy with the quality of this product. There's a reason why it's so cheap--poorly made and doesn't work beyond the first day. What a letdown! :(", "verified": true, "helpfulness": "0/0", "author": "Stephanie \"StephLovesBooks\""}, {"rating": 5.0, "review": "I just installed my fire stick!  Love it, so easy to install.  I did it myself.  Usually my husband does all the technical stuff.  But I did it and I love it.  The graphics are amazing.  One happy customer.", "verified": true, "helpfulness": "0/0", "author": "Monica Daniel"}, {"rating": 3.0, "review": "I like the fire TV stick very much.  The only complaint I have is the sound.  The voices are too quiet and need to be turned up but when the music and sound effects come on it is blasting loud.  I have to constantly adjust the volume.  This is very hard on the ears.", "verified": true, "helpfulness": "0/1", "author": "cjr"}, {"rating": 1.0, "review": "I'm very disappointed in the green that keeps coming up on the screen.", "verified": true, "helpfulness": "1/1", "author": "Kim Abenroth"}, {"rating": 3.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Mother of Two"}, {"rating": 5.0, "review": "freezes up every so often, but other than that its the best!", "verified": true, "helpfulness": "0/0", "author": "lisa smith"}, {"rating": 5.0, "review": "I pre-ordered The Fire TV Stick because I was so anxious to try it.  I have enjoyed many movies and shows on Amazon Prime on my laptop and now I am thrilled to be able to watch them on my tv.  The installation was effortless and the navigation is a breeze.  Thanks for such a great product!", "verified": true, "helpfulness": "0/0", "author": "Barbara Cummins"}, {"rating": 4.0, "review": "Lets us watch prime videos. It works well and is reliable. I wish we could use it to watch other video services, as well.", "verified": true, "helpfulness": "0/0", "author": "sandl"}]