[{"rating": 5.0, "review": "Look good!  Much better & faster than the Chromecast that I purchased a few months ago.  I love the bonus of HDMI male-female adapter and Remote Control included with Fire TV Stick of Amazon which were not included with Chromecast at all.  Recommended to All searching for Wifi AV streaming stick for standard HDTV.  Thanks.", "verified": true, "helpfulness": "0/1", "author": "deals2bid \"John Doe\""}, {"rating": 5.0, "review": "I purchased this when it was on sale for Prime members for $20 - but would buy it for $39 if I needed another one. This is a very nice device. I got it up and streaming Amazon Prime Video & Netflix in just a few minutes. The streaming is very good - no lags or outages for the 4 hours I've used it so far. A very nice touch is that the unit came with batteries for the remote & it came with an HDMI extender cable (which I needed for my TV because the stick itself was a bit too long to fit in the area behind). Also - the remote is small (in a good way) & very responsive.", "verified": true, "helpfulness": "0/0", "author": "PocoLover"}, {"rating": 4.0, "review": "Stuff I like:* Very fast with Amazon Prime.* High quality video* No buffering mid movie on Amazon* Lots of choicesStuff I don't like:* Non Prime videos are much, much slower with periodic buffering* Paid content is mixed in with free content when searching and browsing, so you get disappointed when you realize what you found must be purchased.* Netflix lost connection so often I had to stop using it. Fortunately, the shows I was watching were also on Prime.* Connection to my WiFi went out, periodically, even though my phone showed a solid signal.* Streaming video from your cloud account is limited to just 20 minutes per video. So, I can't load my recorded tv shows and stream.Overall, I'm reasonably happy with it.", "verified": true, "helpfulness": "0/0", "author": "Keith Price"}, {"rating": 5.0, "review": "I AM NEW TO IT ..... BUT IT HAS REPLACED \"SLICED BREAD\" as the greatest invention ever.I am a techo-backwards-child (almost 50 yrs, and I understand tech less and less as time goes by)Plug it in.  Ta Da!Great for NETFLIX and Prime Video (but that would be like buying a rolls and taking it to church once a week)This device can connect/stream ...... I can't even begin to explain .... and I just got started.LOVE LOVE LOVE IT", "verified": true, "helpfulness": "0/1", "author": "Jon"}, {"rating": 1.0, "review": "Very Glitchy set up. Tried set up on 1st TV.....couldn't get it to see the Amazon network. I moved it to a second TV where I was able to advance to the software update...then it wouldn't load \"Home\". Finally after about 3 hours was able to load all content. Sounds like I'm good right? Kind of....The rest of this review I will compare to the ROKU 3.Picture Quality-Not even close to the Roku 3. This stick would be suitable for your children as they wouldn't even notice. I'm guessing that streaming wirelessly is the culprit here. Fire TV states that my network connection is \"Very Good\" so that's not it.Dolby Digital-Somehow the software has disabled plain old Dolby Digital as it prioritizes Dolby Digital Plus. Like most people who haven't upgraded their receiver in the last 3 years, I can't do Dolby Digital Plus. The best I can do with the Fire stick for Amazon content is (2.0). The Roku 3 at least allows plain old Dolby Digital for Amazon content. Netflix is a problem for both devices in that it streams only in DD+. (Damn you Netflix) The Fire stick software needs to allow for plain old Dolby Digital as well as Dolby Digital +. Future Update?Interface-The Roku 3 is much cleaner & easy. The Fire Stick is confusing & irritating.In closing, I'm really surprised that something coming from Amazon is so inferior given the top notch experience on their website.Hopefully this device will continue to be updated to address some of these issues. I'd love to hear from others if they are able to stream plain old Dolby Digital as it could be my set up....don't know??", "verified": true, "helpfulness": "1/4", "author": "Bumpa Rodriguez"}, {"rating": 5.0, "review": "Amazing product love streaming tv music and anything else. Also games run smoothly on it and I could not be happier. Only issue I have had and this isnt an issue with the streamer is Netflix does not always store the password so I usually have to re enter the info. but still perfect product", "verified": true, "helpfulness": "0/0", "author": "jose carlos zamora"}, {"rating": 4.0, "review": "Great for anyone who doesnt have a smart tv. Fast and responsive", "verified": true, "helpfulness": "0/0", "author": "pickrell"}, {"rating": 5.0, "review": "Love it! So easy to setup. They even include a cute animated setup video. Very happy with this purchase. Goodbye Comcast!", "verified": true, "helpfulness": "0/0", "author": "Kathryn Sawa"}, {"rating": 3.0, "review": "I get why Amazon created the Fire TV and Fire TV Stick.  It's a device that helps facilitate offerings on Amazon.  It works well and if you have Amazon Prime, this is probably the best way you can view Prime Movies and TV Shows.  The game capabilities seems a little silly to me, but I guess it works for some.  That being said, I primarily bought it because I wanted to take advantage of Amazon Prime Movies and TV shows.  Outside of this, it's use is relatively narrow for me.Essentially, if you consider that many products help push your multimedia to your TV, whether from the cloud or from a network drive, or even mirroring or sending content from a smartphone or tablet, they pretty much do the same thing.  The problem is, they don't support each others back-end stores.  Because of this, you have to have both to have the best experience with each service.I mentioned \"narrow\", because I already have an AppleTV, which Amazon doesn't support (and vice versa).  The AppleTV simply does everything better.  From interface to features, the AppleTV is just a better experience.  Things are simply \"built-in\" with little or no configurations required.  Because Apple's ecosystem and interface is much better, I would primarily use the AppleTV over the Fire TV Stick for everything outside of the watching Prime content.  (It's important you consider this when reading my review.  I already have a similar product that I'm essentially comparing this to.)If you don't already have a product like the AppleTV, Chromecast, Roku, or any other similar device, this may have some real value to you.  That being said, the interface is a bit limited for those that are not technically savvy.  (Ex:  My wife and kid figured out the AppleTV with almost no instructions.)  If you want to get the best value, you really need to know how to install apps and network this device.  There was a lot of configuring and installing to really take advantage of all it's capabilities.Ultimately, I give this a 2-Star rating simply because it can't compare with the AppleTV.  However, it does get me my media from Prime wonderfully, but still is limited or cumbersome to use for everything else.  Also included with my 2-Stars is the value.  I bought two for $19.95 each, one from Amazon and one at Staples (look around, you'll find them).  Lastly, I added an additional star, because Amazon has made it very easy to open this device up and install your own apps, like XMBC (unlike the closed ecosystem for an AppleTV).  The specs are also doubled compared to the Chromecast.If you're into rooting and installing apps to get to your multimedia, this may have a higher value to you.  Because this was relatively inexpensive (compared to $99 for an AppleTV), it was worth it to me to purchase it, knowing it will be used primarily just to watch Amazon content.  If you're tech savvy, I would recommend this product, because you can do a lot with this if you know how.  If you want ease of use, I would suggest something else.  If you're an Apple user, iTunes, Mac, iPhone, iPad, I would suggest you get an AppleTV as your primary device and only get the Fire TV Stick for Amazon content.Pros:InexpensiveBest way to get Amazon contentSmall footprintPlenty of room to add additional appsCan easily install non-standard appsLots of room to customize this device if you have the knowledgeCons:Interface is primitive compared to other productsRequires tech knowledge to get the best out of this productWi-Fi Only (May have issues if your TV has a weak signal)", "verified": true, "helpfulness": "0/1", "author": "Arnell"}, {"rating": 5.0, "review": "Just received this in the mail today and I'm loving it. TV episodes continue on their own in Prime, which is a big bonus over my iPad because I have to click next on each episode. Access to my music on Amazon and Prime is great through this as well. The casting feature works great with my Nexus 4 running Lollipop. Still exploring, but I haven't noticed any issues this far.", "verified": true, "helpfulness": "0/0", "author": "Standard Nerd"}]