[{"rating": 5.0, "review": "Love my Fire TV Stick!  Easy to hook up and great variety!", "verified": true, "helpfulness": "0/0", "author": "Debbie \"kddonnelly\""}, {"rating": 5.0, "review": "It was perfect, just as advertised. Single to install and set up. Wish I would have known about it long ago", "verified": true, "helpfulness": "0/0", "author": "Duane Adamson"}, {"rating": 4.0, "review": "It works well, but the interface for finding different shows/channels/movies is a bit cumbersome.", "verified": true, "helpfulness": "0/0", "author": "PC"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "TODD A. GORDNER"}, {"rating": 5.0, "review": "I love this - works great, easy set up and with the App for the Iphone, it is very easy to use.  Highly recommended, especially with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Suzanne M. Post \"REVSMP\""}, {"rating": 3.0, "review": "It works as discribed but there is no access to the internet.  Its kind of like having a Fire Tablet (which I love).  I also own a Chomecast, that is a little more powerful.  Good product but a little limiting.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This stick with xbmc flawless its the best short and simple", "verified": true, "helpfulness": "0/0", "author": "Mikel Bledsoe"}, {"rating": 4.0, "review": "I have used Roku, Google TV and Chromecaster.  I like the First TV stick for many reasons.  The first is the remote. The remote is much higher quality than what comes with the base Roku devices.  I like the interface and particularly the control I have over kids.  The device has some very interesting game options and the remote works well with them.  I would give this five stars but doesn't support HBO  Go and some other services.", "verified": true, "helpfulness": "0/0", "author": "NorhLoudspeaker"}, {"rating": 2.0, "review": "I've used the Roku, Apple TV, and Android TV (Nexus Player).  This works as well as any of them, it's just the interface is a complete mess.  From the downloading of apps to the launching of apps, this product is so Amazon-centric that it's a hinderance to use any other service.  I like either Roku or Android TV better.  Apple TV is the worst of the bunch.  It is a complete mess.", "verified": true, "helpfulness": "0/0", "author": "A. Davies \"adogg\""}, {"rating": 5.0, "review": "OK, I probably didn't need another gadget to plug in (had to buy another HDMI switch), but the lure of Amazon Prime movies, etc. was too great.  So far I have been very pleased.  It worked right out of the box (my Amazon account was pre-loaded), and the interface is pretty straightforward. The remote works just fine and the content on Amazon Prime is excellent.  Wish it had a VUDU app since I have some things located there, but I can use my Apple TV for that.If you have Amazon Prime, I'd highly recommend this purchase.  It's well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Bill Gehring"}]