[{"rating": 5.0, "review": "Worth it!", "verified": true, "helpfulness": "0/0", "author": "Anngyc"}, {"rating": 5.0, "review": "Perfect addition to our TV!", "verified": true, "helpfulness": "0/0", "author": "T. Good"}, {"rating": 2.0, "review": "not that impressed. have to pay for too much of the contents", "verified": true, "helpfulness": "0/0", "author": "jim krenn"}, {"rating": 5.0, "review": "Awesome! Keeps my family entertained", "verified": true, "helpfulness": "0/0", "author": "Joanna Rincon"}, {"rating": 5.0, "review": "Awesome for streaming!", "verified": true, "helpfulness": "0/0", "author": "Matt Davidson"}, {"rating": 5.0, "review": "I purchased this after returning a Chromecast that would not allow me to connect to hotel wi-fi, and I am really glad now that it did not work.  The Firestick is an excellent value.  I have only had this for two days, but I am already really enjoying it.  It was extremely easy to set up, it only took a few minutes.  After downloading a few additonal apps, I was watching tv and catching up on the shows I have missed.  The included remote is fantastic, and, although it is not a voice remote, it is still easy to click through apps and programs.  The onscreen tutorial was also very well done and easy to follow.", "verified": true, "helpfulness": "0/0", "author": "TimFromWimberley"}, {"rating": 4.0, "review": "easy to understand instructions.", "verified": true, "helpfulness": "0/0", "author": "Horst Motz"}, {"rating": 4.0, "review": "Easy to use, once you get used to the menu", "verified": true, "helpfulness": "0/0", "author": "Kurt Hathaway"}, {"rating": 5.0, "review": "Be sure you have bandwidth sufficient to download movies before trying to use this.  We thought we had that but discovered that the internet provider we were using did not provide enough bandwidth to our area (it wasn't even a matter of upgrading our account, the service was just not available).  After changing to another provider, the Firestick worked perfect. We did buy one first time user ebook, but found that the installation was easy for my husband to figure out without help.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Williams"}, {"rating": 5.0, "review": "So simple to use! The price was great. Truly enhances the media experience!", "verified": true, "helpfulness": "0/0", "author": "Rebecca (Gray) Arkenberg"}]