[{"rating": 3.0, "review": "Interface is good, but performance is a little lacking. Streaming over wifi not smooth on my network (Comcast 105gbps wired, but wifi considerably slower).  Does not rival my TiVo Premier, which has all the same features. I bought this half price as an experiment. I will keep it, but probably not use it much.", "verified": true, "helpfulness": "2/2", "author": "R. Jones \"R.Jones\""}, {"rating": 2.0, "review": "I had lots of connection issues and it was very slow to setup as opposed to the Chromecast and AppleTV which was a breeze to setup and start watching.", "verified": true, "helpfulness": "0/0", "author": "Dat Tan Nguyen"}, {"rating": 4.0, "review": "Great for amazon instant video. Video looked great and started very quickly.Ok for netflix. Started at a lower encoding and improved after some buffering.", "verified": true, "helpfulness": "0/0", "author": "A. Varner \"TJ\""}, {"rating": 3.0, "review": "Pretty nice device, except for having to plug it in for power. Similar channel line up as Chromecast.", "verified": true, "helpfulness": "1/1", "author": "ORA"}, {"rating": 4.0, "review": "Remote a bit unresponsive at times. Other than that, it is much more user friendly than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great item, have been using a Roku and Apple TV for several years now. For the price this is much better! So glad I picked up 2 of them!!", "verified": true, "helpfulness": "0/0", "author": "Maria Eugenia Valdez \"M Valdez\""}, {"rating": 4.0, "review": "This is my 2nd day using it. I found wifi strength of this device weak. My router is next to my TV, streaming isn't that smooth sometimes. Otherwise its all good, can't complain more.", "verified": true, "helpfulness": "0/0", "author": "Kunchok"}, {"rating": 5.0, "review": "Worked like a charm! Very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "laura patzer"}, {"rating": 5.0, "review": "There are a number of streaming stick options, but given that I mostly needed it to view Prime content, I'm extremely pleased.  Would love to see HBOGo availability but otherwise very happy with the streaming quality and user interface. It was also delivered more than a week before I expected to receive it.", "verified": true, "helpfulness": "0/0", "author": "Steve-O G"}, {"rating": 5.0, "review": "Works exactly as advertised.  Easy to install and setup and offers a great variety of functions.  Also a great price.", "verified": true, "helpfulness": "0/0", "author": "CWStephens"}]