[{"rating": 5.0, "review": "The Fire TV Stick was easy to install and use. I am very satisfied with the ease of using it to view Amazon Prime shows and Netflix. I have not tried anything else.", "verified": true, "helpfulness": "0/0", "author": "Betsy Moore \"B. Moore\""}, {"rating": 4.0, "review": "OK, it's working, but there is a learning curve. I had also ordered two digital books on using the Stick to supplement the meager instructions that come with, and they have been very helpful. One thing that I did learn was that when I ordered my HDX Kindle Fire, to replace my first LCD one, it was specifically because the product info told me that it would wirelessly \"fling\" video content to my Samsung TV - and it turned out that my TV was one year too old to be flung to, so the stick was my next option. BUT it also turned out that when i thought I was ordering HDX for my second fire, what I actually got was HD (with no X), and the Stick works with HDX, not HD. Bummed again. But there ARE ways to compensate. While I could not \"mirror< from my Kindle Fire, I can from both my laptop as well as another tablet device that has an Android OS. Only after accomplishing that, I realized that mirroring is, for me, not as satisfactory as \"pairing\" my device, which does not require that the displays on the device and the TV screens to be tied together for the duration. Eventually I stumbled across the Fire TV Stick Remote App, which I DID download to my merely HD (not X) Kindle Fire, and THAT is the best solution of all - the actual remote that comes with the stick does not have voice control (although I believe you could order one separately), but since my Kindle Fire HD (not X) also has a camera and the microphone that goes with it, the app turns my Kindle Fire into a Fire Stick remote WITH voice control - and if you want to search by typing, the keyboard on your Fire is a hundred times better than selecting one letter at a time on your TV screen with the small Stick remote.SPEAKING of the remote, it is really cute, but too small, which makes it (1) easy to lose and (2) hard to use if you have big hands, fat fingers, or arthritis. I made a removable, padded \"pant\" with foam rubber and duct tape that addresses both issues (picture attached). Also, regarding the remote, iras VERY difficult for me to remove the back cover in order to install the batteries included in the  box -- SOLUTION for that - go to YouTube and search fire stick remote batteries, where you will find a video showing you exactly how to get into the dang thing. Seriously, I was on the verge of grabbing a hammer and smashing it like a nut, it was that exasperating.OK, so on now to the \"one concern\" referenced in the subject line. If you order your Stick from amazon (as opposed to getting it third hand or at a local retailer), it will come preloaded with viewing suggestions based on your amazon order history and, as you use it, it is supposed to refine its idea of things you might like to see. I just have to wonder how sophisticated this learning process is. It would be wonderful it it would distinguish things that you watch and enjoy from things that you start watching and find too horrible to continue. The QUESTION therefore is: does it imprint on things you SELECT, assuming that just because you selected it you would enjoy seeing similar things -- or can it learn to disregard things that you watch for a few minutes before determining it's not your cuppa tea. Part B of the same question -- is it possible to TEACH the device what to ignore but deleting things you did not like from your viewing history?", "verified": true, "helpfulness": "4/4", "author": "V. Schmidt \"blue9112\""}, {"rating": 5.0, "review": "It is amazing! I have Amazon Fire TV in my family room and loved it so much, I bought the Fire TV Stick for my master bedroom. I had been watching on my Kindle Fire HD 8\" sitting on my nightstand, or hooking it up to my large screen in the bedroom, but having to get up to change channels or shows is a pain, and at $30 plus dollars, the Stick is an inexpensive, wonderful alternative. Plus it frees my Kindle Fire for simultaneous web surfing or reading!  The Amazon Original Series are all top notch too. I can't say enough good things about everything Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Linda M. Sarnecki"}, {"rating": 5.0, "review": "Easy to install.  Have it plugged into electricity, as advised, and usually have good reception.  Turned TV into a smart TV, just as advertised.", "verified": true, "helpfulness": "0/0", "author": "GrandmafromTX"}, {"rating": 5.0, "review": "This gadget is a must have..picture quality is amazing...I've had this product since Feb. 3rd and absolutely cannot believe I was living without it...Love Love Love it..", "verified": true, "helpfulness": "0/0", "author": "Sonia N. Dorsey \"sneaker fetish\""}, {"rating": 5.0, "review": "To give a background I have 2 Amazon tablets, 1 high end reader, 2 Fire TV (Box and Stick), Prime, Kids FreeTime for 4 kiddos, and Kindle Unlimited.  Personally I think while the Kids FreeTime is a decent attempt at isolating kids from non age appropriate content I feel as though it is not fully what I was expecting.  So back to the Fire TV stick, as for functionality I like it a lot.  BUT... What parental controls are lame.  I would rather not have my kiddos seeing certain genre movie covers let alone not being able to set a PIN for amazon prime content for PG13+ especially for R and MA content.  Sure you can put a PIN on everything, but then they can't watch a G Prime Movie without me entering the room.  Telling all of them to not look at the screen while I enter in my PIN (how long before they know the PIN anyway knowing as a kid I'd be peering thru my fingers to catch it, wouldn't you?).Edit - Looks like Amazon added another option so you no longer have to see the PIN on the screen.  Instead it can be a series of buttons sequences.  Changing from 3 to 5 stars as I've been pretty happy with itAnyway yes it is pretty decent for what it does, just wish you had better level of parental control (and why the difference between the Fire Tablet and the Fire TV?)  As you can tell to amazon to lock content above PG13 on Tablet, but not on the Fire TV?  I personally expect a bit more in this area...Maybe over time there will be improvements, but as of this review it is a bit lacking.", "verified": true, "helpfulness": "0/0", "author": "Chad V Aberle"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 2.0, "review": "no happy with the product.  thought i could stream from pc or non kindle tablet.  not able to.  spent a lot of time trying to figure this out.  support suggested i purchase a kindle to mirror.  good idea, but would have been an addition $134.00.  i will stick with the chromecast. thank you.", "verified": true, "helpfulness": "0/0", "author": "clm"}, {"rating": 4.0, "review": "I love this device! I also have a Chromecast on another TV, but this also gives you a remote in addition to be able to use a smart phone as the remote. Also another advantage over the Chromecast is that you can watch Amazon Steaming video on it! It has a huge amount of additional content including games! This is going to be given to all our family and friends for Christmas/Hanukah next year. Best of all, it's so easy to install even my parents could do it!", "verified": true, "helpfulness": "0/0", "author": "Michelle Wyman"}, {"rating": 2.0, "review": "We were looking forward to this new source of digital content, however we could not make the device work with out system.  So it is possible that it was a hardware issue on our end but our router (Apple Airport Extreme) and wireless network work quickly and flawlessly with numerous other devices.  We did get a connection of sorts, but there was an error message \"connected with problems\" and were completely unable to stream any content at all.  And I have to mention the remote; getting the back cover off for batter installation was incredibly frustrating.  So much force had to be applied I was sure it would break.  When we got this item the packaging and presentation was clearly mimicking Apple; the big difference was that nothing worked nearly as well as Apple products!", "verified": true, "helpfulness": "0/0", "author": "bonedoc"}]