[{"rating": 3.0, "review": "So far so good. Have had this for a couple of weeks now. What I notice is that intermittently the video will randomly pause. Also, the video will also come up scrambled for a short time. Other than that it works pretty well.", "verified": true, "helpfulness": "0/0", "author": "Jason Frantz"}, {"rating": 5.0, "review": "The Fire TV stick is fantastic!!  I LOVE IT. I highly recommend it.. Easy step by step instructions..", "verified": true, "helpfulness": "0/0", "author": "ME :)"}, {"rating": 5.0, "review": "Love The fire stick. Has video games, music, lots of apps and movies. I will be getting rid of some of my cable boxes and replacing them with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "harold raye"}, {"rating": 5.0, "review": "This is awesome!", "verified": true, "helpfulness": "0/0", "author": "Brandi D."}, {"rating": 3.0, "review": "I would love the fire stick, if it worked better. I have owned it since it came out. I don't mind the layout at all, bought it knowing it would be Amazon heavy. The problems I have are poor wifi reception, I can have it 4 feet from my router and it will say it has poor internet. I have a smart tv that it's connected to and when the stick continually buffers or doesn't work I watch on the tv app with no issues. Also the farther into a movie I get, the farther the sound looses sync with the video, doesn't seem to matter what app I'm watching, Amazon, Netflix, Hulu plus, ect.I was excited to get an email from Amazon telling me I could hook up bluetooth headphones, only to find out it was a mistake. I was hoping to connect my bluetooth speaker/headphones to see if it would fix my sync problem.The Fire stick seems to have it's software throttled as to not steal sales from the fire tv. To bad, I really would like the headphone connection.I would like it better than my roku and chromecast if not for these 2 problems that show up quite often, and the scaled back abilities.", "verified": true, "helpfulness": "1/1", "author": "YnotMe"}, {"rating": 4.0, "review": "I love it and so does my son. It's perfect for traveling around in the motor home.", "verified": true, "helpfulness": "0/0", "author": "Mike Tarrant"}, {"rating": 1.0, "review": "Sucked Big Promotion to buy Amazon Prime and their stuff. They should pay consumers to use this product.", "verified": true, "helpfulness": "0/1", "author": "Dan Morgan"}, {"rating": 5.0, "review": "I've only used this for netflix so far, but so far, so good! Easy setup and easy to use. I would recommend.", "verified": true, "helpfulness": "0/0", "author": "Em78"}, {"rating": 5.0, "review": "Worked great. We had to update this out of the box but after that it worked recently when we stayed at a hotel. It allows you to accept the \"internet user agreement\" from the hotel and then it allows you to use this stick with the wireless internet.", "verified": true, "helpfulness": "0/0", "author": "fishnewton"}, {"rating": 4.0, "review": "Easy install, works good!", "verified": true, "helpfulness": "0/0", "author": "Neil A Kane"}]