[{"rating": 2.0, "review": "Needs to have HBO 2 GO to be worthwhile.Constantly stops working and you have to go back into the app, very annoying", "verified": true, "helpfulness": "0/0", "author": "Matthew Richard Elston"}, {"rating": 5.0, "review": "Waited almost 30 days for it to ship but set up was easy and works as expected!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We have a Roku on one TV, and bought this for our second TV.The Fire TV Stick was very easy to set up and works flawlessly. We are able to watch Netflix, Hulu, and Amazon Prime which makes cable TV obsolete for us!There are only two minor complaints. One is that I didn't know it needed it's own power supply and in an old house plug-ins are at a premium. So taking up space for this is a little irritating. The second is that I feel the interface is not as intuitive as the Roku.Overall, neither is a big deal, and the Fire Stick is worth the price.", "verified": true, "helpfulness": "0/0", "author": "J.Z."}, {"rating": 4.0, "review": "When I first received the product, the WiFi connection made it lag and buffer a lot, but it wasn't until I called customer service and the rep advised me to use the HDMI extension cord an it started to work perfectly.", "verified": true, "helpfulness": "0/0", "author": "nick"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "S. Sutton"}, {"rating": 1.0, "review": "Horrible.  Wouldn't even come up on my TV to get the install started and my TV isn't old.  I bought the Google Chromecast and it's amazing!", "verified": true, "helpfulness": "1/1", "author": "jmc628"}, {"rating": 5.0, "review": "I love this product. Watching a movie is instant. No more waiting for a movie to download.... I just search, choose and watch! Best product ever!", "verified": true, "helpfulness": "0/0", "author": "samiam"}, {"rating": 3.0, "review": "the Firestick seems to perform as advertised , however Amazon customer service dropped the ball as far as I am concerned. I tried to reactivate my suspended free 30 day trial that I suspended while waiting for the firestick to arrive, and was told that I had cancelled it and there was nothing they could do. What I cancelled was a $106 charge to enroll in Prime that was charged when I attempted to restart my trial period", "verified": true, "helpfulness": "0/0", "author": "william thompson"}, {"rating": 5.0, "review": "A well designed UI and access to tons of content make this a very useful tool for the cord-cutter.", "verified": true, "helpfulness": "0/0", "author": "Carl"}, {"rating": 5.0, "review": "Love it and the options.  Use over my Roku 2.  Works great on my TV and the choices are good.", "verified": true, "helpfulness": "0/0", "author": "David  the Techie \"Dave\""}]