[{"rating": 4.0, "review": "terrific...we already have access to amazon prime and netflix, etc through our blu ray player. we purchased the fire stick just to use for travel. we just got back and used it at a holiday inn. and it worked just perfectly.", "verified": true, "helpfulness": "0/1", "author": "stewart adlowitz"}, {"rating": 5.0, "review": "Plug in, connect to wifi, stream prime content or netflix.  Easy and simple.used on multiple TV's with no problems.  It does need power to work well, but it is very intuitive and easy to use and simple to move to a different room or TV.", "verified": true, "helpfulness": "0/1", "author": "Mark B \"Mark\""}, {"rating": 5.0, "review": "It worked very well.  Using it is intuitive and my husband likes it a lot better than the chrome stick.", "verified": true, "helpfulness": "0/1", "author": "Debbi Orthman"}, {"rating": 5.0, "review": "This was a present. I had know idea what it was. After using for the first time I thought it was awesome, still think that way. It is great.", "verified": true, "helpfulness": "1/2", "author": "Robert Mitchell"}, {"rating": 5.0, "review": "Better than expected, easy set up, great content.", "verified": true, "helpfulness": "1/2", "author": "Roameo no"}, {"rating": 5.0, "review": "Excellent product. A heck of a lot cheaper than buying a new smart TV!", "verified": true, "helpfulness": "1/2", "author": "Alfred Adams"}, {"rating": 5.0, "review": "Great, my entire fam enjoys it! Thinking about buying another one for my room, since the kids took over it (have it in our living room)", "verified": true, "helpfulness": "0/1", "author": "katie franco"}, {"rating": 4.0, "review": "I bought this for my daughters play room since we don't have cable, she loves being able to watch play-doh videos off youtube while she plays.", "verified": true, "helpfulness": "1/2", "author": "Kristina"}, {"rating": 4.0, "review": "I was a little tricky to get started but once I had it installed it is great", "verified": true, "helpfulness": "0/1", "author": "mika Raja"}, {"rating": 5.0, "review": "I LOVE my firestick! A great deal for entertainment !", "verified": true, "helpfulness": "0/1", "author": "cindy baker"}]