[{"rating": 4.0, "review": "We use our Amazon Fire TV Sticks for listening to music a lot. Great for putting on a playlist as we clean or just sit around the house. The only problem I seem to have is when I create a new playlist, add Prime Music to my cloud and purchase new albums. They don't show up in my music lists on Amazon Fire TV Stick. I am sure there is a solution to this problem; I will keep trying to figure it out. Watching Amazon Prime Instant Video is easy and works well.", "verified": true, "helpfulness": "0/0", "author": "Barry Ammons"}, {"rating": 5.0, "review": "Easy to install & use. Remote takes a lot of getting used to. Could have more extensive user manual included.", "verified": true, "helpfulness": "0/0", "author": "axylotyl"}, {"rating": 5.0, "review": "Better than Apple TV.  That was hard for me to say!", "verified": true, "helpfulness": "1/1", "author": "Andrew Nicholes"}, {"rating": 1.0, "review": "When I first used it, it appeared to work quite well, but when I used it the second time to watch Netflix, it buffered to the point I couldn't watch the program and the picture quality was very poor.", "verified": true, "helpfulness": "1/2", "author": "Tricia"}, {"rating": 4.0, "review": "Does everything the Amazon Fire does except search by voice. This is a great product.", "verified": true, "helpfulness": "1/1", "author": "wires"}, {"rating": 5.0, "review": "works well, had to call customer support as the stick came with German as the default language.", "verified": true, "helpfulness": "0/0", "author": "rob morgan"}, {"rating": 3.0, "review": "Great apps but remote only works when standing right next to it.", "verified": true, "helpfulness": "0/1", "author": "Amanda"}, {"rating": 5.0, "review": "Had no idea about it until my daughter bought it for me. It's great, I'm not home a lot so I don't have cable, I honestly don't know why anyone would pay so much for TV.", "verified": true, "helpfulness": "1/1", "author": "Rita Fahse"}, {"rating": 2.0, "review": "Its just OK", "verified": true, "helpfulness": "0/0", "author": "Michelle Hall"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "1/1", "author": "sir"}]