[{"rating": 3.0, "review": "It's a good device, sometimes a little sluggish. Can't really knock it to bad for that because it is just a small stick. Lack of Vudu and HBOgo are a big problem for me. Overall I like the layout and search capabilities of my Roku better.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The one flaw is the remote cover.(In one of the reviews, the Firestick was sent back because the purchaser could not open it, another stated a screwdriver was used to open it, thus damaging the remote cover)We had a similar problem, tried countless times to slide the remote open, no luck.Finally. kind of stuck my thumb nail where the separation was and after 10 or 12 attempts, it opened.2 ruined thumb nails later, it's up and running.  Seems okay, so far.Don't think we should have to work that hard to get the remote open.Not a huge problem, but very frustrating.Perhaps Amazon should revisit this issue, and purchasers could return the defective, hard to open remotes, and get easy-to-slide- open remote replacements.", "verified": true, "helpfulness": "2/2", "author": "Irma R. \"irmarob\""}, {"rating": 4.0, "review": "The hardware (stick and remote) are awesome.The price was awesome.Using the Amazon application, navigation mostly, adequate", "verified": true, "helpfulness": "0/0", "author": "Kelly Hysell \"khysell\""}, {"rating": 5.0, "review": "So far I love it!works great.Love everything about it.like it better then any other streaming device I've ever owned or used.So glad I got a few extra to give as Christmas presents.well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "As others have mentioned, it runs VERY hot and crashes after 20-30 minutes when streaming HD content from my local PLEX server. The two issues seem to be related as turning down the resolution lets it work for longer periods. However.. when it works, it works quite well. Both 720p and 1080 stream reliably without pausing--- until it crashes (requiring pulling the power). BTW, my win 8 tablet will play wirelessly at the same time: it's not the network or the server (I made sure to check).Don't know if a firmware upgrade would fix this as some have questioned- wouldn't think they could make it run cooler by changing the firmware.My Setup: Netgear Wireless N Router, Win 8.1 HTPC Plex server, LG 48\" Tv", "verified": true, "helpfulness": "2/2", "author": "Mark in SD"}, {"rating": 4.0, "review": "Only giving 4 stars since I'm still evaluating. From a set-up standpoint it's great! very easy to connect and everything you need (including batteries) is included in the box. So far I've been disappointed in a few things. I was very interested in using the mobile app to control the Fire Stick but it's not very easy to use. I'm still trying to get the hang if it and more often than not I end up using the remote. The second disappointment so far is that not all of the content on simple things like YouTube won't work on the device. There were a couple of videos I wanted to play on the TV and I received a \"content not compatible\" error message. I do really like having my Amazon Prime video and my Netflix in one place tho! For that reason alone I feel it was worth the price. I just ordered Chromecast and plan to evaluate these two side-by-side.", "verified": true, "helpfulness": "0/0", "author": "vevans"}, {"rating": 2.0, "review": "I really want to like this. However there are some issues that cannot be overlooked. The advertised capabilities are great, however, the reality is that this device has serious bugs. The set up process is flawed. It should be a plug and play, having just hit the market, but, the first thing it does is try to \"download the most recent software\". This process tries to execute and fails many, many times. Took anywhere between 40 minutes and an hour to get past the setup.  Finally got it working and for three days or so, just loved it. Love that my Prime watchlist shows up and loving having this functionality over Apple TV and Chromecast.  Today however, it keeps dropping my network. At times it shows that it CONNECTED to the network and it still will not work. The remote is also acting weird, all of the actions are very delayed and then they execute all at once. I cannot get it to go to the home screen or any screen because it says it is not connected. I finally had to just unplug it and put in my Chomecast, which is working fine, no issues at all. I had high hopes for the Fire TV Stick, but I'm disappointed and I might have to return it.", "verified": true, "helpfulness": "3/4", "author": "deedeeg \"deedeeg\""}, {"rating": 5.0, "review": "Streaming starts faster than my Roku. Video quality is perfect. Easy to navigate. You'll love it.", "verified": true, "helpfulness": "0/0", "author": "DAVID K COINCON"}, {"rating": 4.0, "review": "Pros: Very neat interface; remote works like a charm.Con: Doesn't have a Youtube app.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "plugged into the back of my westinghouse and away i went", "verified": true, "helpfulness": "0/0", "author": "John F. Ockert"}]