[{"rating": 5.0, "review": "I'll keep it simple, a five star device. A great device that has everything you need.", "verified": true, "helpfulness": "0/0", "author": "Chris Denault"}, {"rating": 5.0, "review": "I absolutely love it!! No buffering or anything! Small and doesn't take up any room! Will do anything a computer will do!", "verified": true, "helpfulness": "0/0", "author": "Jenifer N."}, {"rating": 3.0, "review": "i really like the fire tv stick but it took forever to arrive about a monthother than that it works perfectly", "verified": true, "helpfulness": "0/0", "author": "kristi"}, {"rating": 5.0, "review": "Exactly what I expected", "verified": true, "helpfulness": "0/0", "author": "Freda Mills \"Gracie\""}, {"rating": 5.0, "review": "Love the ease of watching movies and tv.", "verified": true, "helpfulness": "0/0", "author": "anne hughes"}, {"rating": 5.0, "review": "Great product! I love it!", "verified": true, "helpfulness": "0/0", "author": "tissyaz"}, {"rating": 4.0, "review": "Seems OK, time will tell.  I was perplexed that as I browsed movies etc., some said \"Watch Now\", others said, \"Add to watch List\". I wondered why I couldn't watch some \"Now\".  I think it's because they are not free, i.e., if I want to watch now, I need to pay.  Hmmm.  Gotta love Amazon, they really know how to separate you from your $ painlessly. Great company to have stock in. If you don't have any, I recommend you buy some.", "verified": true, "helpfulness": "0/0", "author": "makatak"}, {"rating": 3.0, "review": "I like the interface fine. I do not like the shows were one or two episodes are free then you get to the next one and you have to pay to watch. The selection looks great til you see how many fall under this category. I will keep prime for the year I have paid for but unless something changes I will drop it next year. To bad - I really do like the fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Kevin Gray"}, {"rating": 5.0, "review": "Outstanding product!  Had it up and running in under 5 minutes.  One small problem: had to pry open the back of remote to install batteries; did not break anything and it works fine now.", "verified": true, "helpfulness": "0/0", "author": "greg hitchcock"}, {"rating": 5.0, "review": "Love it! So easy to use and just one more reason to have a prime membership!", "verified": true, "helpfulness": "0/0", "author": "Jeff Merrifield"}]