[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "countryw12"}, {"rating": 5.0, "review": "easy to use and high fidelity", "verified": true, "helpfulness": "0/0", "author": "Thomas G. Sampson"}, {"rating": 5.0, "review": "I put it in my bedroom and my wireless router is in the living room and works great. So great I ordered another one for the living room!", "verified": true, "helpfulness": "0/0", "author": "daina moseley"}, {"rating": 5.0, "review": "Love the fire stick.  Can't say enough good things about it.", "verified": true, "helpfulness": "0/0", "author": "Gray Matter"}, {"rating": 5.0, "review": "Admittedly,  there a couple complaints like absence of a real cast to screen and google play compatibility. Amazon likes to blur the lines between the paid content and what you get with Prime.  I have  the Roku stick as well.  Overall the Amazon Fire Stick is better interface,  more enjoyable interaction.  Love it,  especially at $39.(but I got it for $19 when it first came out,  even better).", "verified": true, "helpfulness": "0/0", "author": "AllofUs"}, {"rating": 5.0, "review": "We had Amazon videos from our DVD player on the home theater, but we didn't have it in the family room. We added a Fire TV Stick and I must say, we like it even better. The menus are simple and it plays TV shows back to back. On the DVD player we have to manually start each episode.It's more then just Amazon, it turns any TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "MikeReedKS"}, {"rating": 5.0, "review": "Bought this for my mom for Christmas and she loves it", "verified": true, "helpfulness": "0/0", "author": "Sharkey"}, {"rating": 5.0, "review": "The best in its class.", "verified": true, "helpfulness": "0/0", "author": "Mehran Sedaghatpour \"Mehran Sedaghatpour\""}, {"rating": 2.0, "review": "Very slow always trying to load!", "verified": true, "helpfulness": "0/0", "author": "Ami Whitley"}, {"rating": 5.0, "review": "this is incredible. Hubby and I can watch Netflix on our TV without using anything but our Fire TV Stick. We can also watch Prime on TV instead of just on our computers. It's amazing ^_^ Thank you Amazon ^_^", "verified": true, "helpfulness": "0/0", "author": "Park City Nana"}]