[{"rating": 5.0, "review": "The Fire TV Stick is friendly to use.", "verified": true, "helpfulness": "0/0", "author": "wordy"}, {"rating": 2.0, "review": "Will not stay connected to WiFi", "verified": true, "helpfulness": "1/1", "author": "Skylar Thomas"}, {"rating": 5.0, "review": "I love my Amazon fire! I even bought the game controller to play video games. This is so much better than Apple TV! I canceled my cable and I just watch Amazon Prime during my free time, listen to the Pandora Ap on the television, and play videos games! This thing is an Entertainment Mecca! Who needs cable? I am saving a boatload and this device was a third of the price of my Apple TV which I never use because you have to pay for everything- (I belong to Amazon Prime which isn't even available on Apple TV).- Also a lot of these video games are free!", "verified": true, "helpfulness": "0/0", "author": "Mister \"E\""}, {"rating": 1.0, "review": "Not powerful enough. Freezes, sound at times,  but no picture.  Sent it back.  Got the Amazon Fire TV box instead and it is great.", "verified": true, "helpfulness": "1/1", "author": "maxdemax"}, {"rating": 5.0, "review": "The only problem I had was opening the back of the remote to insert the batteries! I hope the batteries last a long time!!! Should you redesign the remote would you be willing to send the new one free of charge to those of us who have this one?", "verified": true, "helpfulness": "0/0", "author": "Pat Arthur"}, {"rating": 3.0, "review": "For the $19.99 that these cost when they came out, they're pretty cool.  However, it doesn't screen mirror with other Android devices, only screen mirrors with the Fire HDX about 50% of the time, occasionally freezes and needs to be power cycled, and doesn't have HBO Go.  HBO Go is available on other Amazon devices, so it doesn't make sense that it's not on the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Slick7759"}, {"rating": 1.0, "review": "Nothing wrong with product unless you have slow wi-fi internet.  It did not work for us.", "verified": true, "helpfulness": "0/0", "author": "Susanne D Clement"}, {"rating": 3.0, "review": "Overall, it's a really good product to watch Prime and Instant videos on, though it has a very annoying shortfall, at least in my home theater setup. Essentially it will not function when plugged into my LG 60\" plasma screen's side HDMI ports UNLESS you plug in the power adapter. This is a real pain because there isnt a nearby power outlet and it just looks bad with that cord hanging off the wall. My solution is to keep it plugged into an HDMI switcher in the cabinet, though it has an impact on the wifi reception.Easy to rent movies and watch prime.A pain to listen to Amazon prime music because you have to setup playlists,etc from a web browserPretty good responsiveness and picture quality.Hard to beat from $19", "verified": true, "helpfulness": "1/1", "author": "G. Grosse"}, {"rating": 2.0, "review": "I cant get past the signup process on mine. The remote wont let me enter in my wifi password. Every time that i go to select a letter and hit enter it jumps to another letter on the screen. I cant control what the remote does/", "verified": true, "helpfulness": "1/1", "author": "Freshlife"}, {"rating": 4.0, "review": "I use it to run XBMC, it is so much better then Chromecast.  It can be a little sluggish sometimes, but it is the stick and not the full box, so that can be expected.", "verified": true, "helpfulness": "0/0", "author": "Amar N. Shah \"xamarshahx\""}]