[{"rating": 1.0, "review": "Have not had enough time to go through the device.", "verified": true, "helpfulness": "0/0", "author": "Daniel Chintersingh"}, {"rating": 5.0, "review": "Great deal I will buy one for each room. The family loves it", "verified": true, "helpfulness": "0/0", "author": "pdj"}, {"rating": 4.0, "review": "Great little device. Cannot play a lot of the good games w/o buying the controller for $35.", "verified": true, "helpfulness": "0/0", "author": "C. Pounds"}, {"rating": 1.0, "review": "I was very disappointed in the amazon fire stick. In fact I really had planned to return it but so far I haven't had the chance to get it to the post office. I have tried several movies but every one of them will stop and get the spinning symbol and then say that it is not connected to the internet when there is a perfectly good signal. I also put on the app for my ipad and experienced the same problems from there. I finally had to watch the end of the movie on my ipad since I could not get it to be reliable on the fire stick connected to my TV. I had read on the forum about the same problem happening to others with the fire stick. I tried the same solutions that they had tried but did not have success. I also was upset that the price of this item was on sale for $10 less a few weeks after I had purchased it. As a prime member I think some type of price protection especially for amazon produced items should be given. I will probably try google chromecast to replace the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Christine Mitchell"}, {"rating": 5.0, "review": "I love the fire stick!  Lots of options to choose from.", "verified": true, "helpfulness": "0/0", "author": "BL"}, {"rating": 5.0, "review": "Cable TV?", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 4.0, "review": "I like it.", "verified": true, "helpfulness": "0/0", "author": "Michael Minelli"}, {"rating": 5.0, "review": "Worked flawlessly right out of the box.  Not as fast as the Fire TV, which we also have, but the Fire TV Stick is much cheaper.  This unit was added to our second TV, and it works fine.", "verified": true, "helpfulness": "0/0", "author": "Randy S. Kautz"}, {"rating": 4.0, "review": "A lot of time is spent buffering.  I have actually turned off the tv and watched from my computer to get better reception.  if this continues, I'll return the Stick.", "verified": true, "helpfulness": "0/0", "author": "Jolie Lindley"}, {"rating": 5.0, "review": "Easy to set up and use! Excellent viewing, great selection of APPs, movies and music!", "verified": true, "helpfulness": "0/0", "author": "DaniC"}]