[{"rating": 4.0, "review": "Does what I need it to do", "verified": true, "helpfulness": "0/0", "author": "reidwam666"}, {"rating": 5.0, "review": "I love the fire stick.  You simply plug it in to the TV, plug in the power and you're up and running.  They connect it to your amazon account when it ships so you don't even have to login.  Setup was easy and once connected to the wifi I was browsing amazon prime, netflix, and pandora.  This thing is great and my family and I watch it every day.", "verified": true, "helpfulness": "0/0", "author": "Justin LeCheminant"}, {"rating": 5.0, "review": "So far, so good. I've received it as part of sling promo. Sling works well there.Image quality is really good", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Way better than purchasing a new smart tv.Have only used Netflix and prime.  But just those two are well worth the price.If you have a perfectly good tv that is not smart, try the fire stick.", "verified": true, "helpfulness": "0/0", "author": "jp"}, {"rating": 5.0, "review": "I love, love, love my fire stick.......and....being a prime time member, hope I can always be one !!!!", "verified": true, "helpfulness": "0/0", "author": "M. Romao \"MARGEE\""}, {"rating": 5.0, "review": "Best thing since sliced bread!!", "verified": true, "helpfulness": "0/0", "author": "Dottie King"}, {"rating": 5.0, "review": "Just what I needed.....so.much easier then using that big clunky Xbox game system to watch Netflix...plus it has soooooo much more. I LOVE IT! It little its so simple to use.  Thank you technology!", "verified": true, "helpfulness": "0/0", "author": "Eliblythe"}, {"rating": 3.0, "review": "Works great whenever it works. Plex and Netflix app are awesome.I can go days working wonderfully with the device, but some days it just cannot connect.Even though I'm 15 feet away from a 105Mbps down wireless connection I still get network errors. No other WiFi device I have gives me problems but this. I am hoping an update will help resolve the issues I have. Due to the issues I have now, I will not be purchasing another one, even though it works great when it works, I don't like dealing with the problems that occur sometimes.", "verified": true, "helpfulness": "0/1", "author": "Billy P."}, {"rating": 5.0, "review": "Fire TV Stick was easy to install and immediately worked properly. I have no complaints about this product.", "verified": true, "helpfulness": "0/0", "author": "YoSa \"Blurry eyes\""}, {"rating": 5.0, "review": "It's everything I was looking for real simple,easy to set up I love it", "verified": true, "helpfulness": "0/0", "author": "ronald williams"}]