[{"rating": 4.0, "review": "Lots of titles to choose from easy to use  definitely  worth it", "verified": true, "helpfulness": "0/0", "author": "crusher"}, {"rating": 3.0, "review": "Having a lot of trouble during the movies. It stops during the movie to upload yet I have a strong single from my wi-fi. Frustrating when the movie stops to load every minute.", "verified": true, "helpfulness": "0/0", "author": "Gloria \"Van Davison\""}, {"rating": 5.0, "review": "Easy to use!  I love it and may order another.  It is portable but I think it would be easier to have two.  The grand kids are playing games and I'm getting more use from Amazon Instant Video!", "verified": true, "helpfulness": "0/0", "author": "Just Suze"}, {"rating": 1.0, "review": "I have a chrome cast and very happy with the product.Bought a fire stick and seems like Im very fortunate that it is broken.I just get the amazon logo and nothing happens.Contacted support and they will send a replacement.Not very happy with the product.", "verified": true, "helpfulness": "0/0", "author": "K. Vindas Leiton"}, {"rating": 5.0, "review": "Need more show and movues", "verified": true, "helpfulness": "0/0", "author": "dj levy"}, {"rating": 1.0, "review": "Remote auto scrolls all the way to the end of the list. Hit back and it auto scrolls to the front. Difficult to get a movie selection in the middle. Have to barely, ever so lightly push the over button to get to the next movie selection. If you give the remote a normal push it goes all the way to the end.Also remote is ultra mini. Same length as my iPhone 4 and 1/2 the width. Will go missing. Guaranteed.", "verified": true, "helpfulness": "1/1", "author": "DaveB"}, {"rating": 5.0, "review": "i love it, its simple to install and to use. The little control make everything easy and you can also download the app and use your phone as a control. you won't be disappointed unless your one of those people that just over thinks everything.", "verified": true, "helpfulness": "0/0", "author": "Raymond"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Todd Kenny"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Horst"}, {"rating": 2.0, "review": "Not what I expected, also not really user friendly", "verified": true, "helpfulness": "1/1", "author": "Peter T. CAron"}]