[{"rating": 5.0, "review": "Love this, very easy to use, and can watch many movies!", "verified": true, "helpfulness": "0/0", "author": "Wolfie"}, {"rating": 5.0, "review": "Love it I got one for a gift also and have it on another TV . Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Pamela J. Traverse \"Pam\""}, {"rating": 5.0, "review": "I love it! I waited for over 6 months to get it and finally I am enjoying it to the fullest....", "verified": true, "helpfulness": "0/0", "author": "Ofelia Rodriguez \"oleofe\""}, {"rating": 5.0, "review": "Easy to install. Love it! Much simpler and better than Apple TV .", "verified": true, "helpfulness": "0/0", "author": "S. Foster"}, {"rating": 5.0, "review": "Gave everyone access to lots of great shows after cutting cable.  Easy set up.  Stays plugged in all of the time but have switched it from TV to TV very easily.", "verified": true, "helpfulness": "0/0", "author": "Cold Stone"}, {"rating": 5.0, "review": "My daughter is super happy. She loves see Disney Jr, Hulu, Netflix and PBS kids. It was the best I buy it.", "verified": true, "helpfulness": "0/0", "author": "Solymar"}, {"rating": 4.0, "review": "Amazing! A little bit laggy sometimes, but a great product.", "verified": true, "helpfulness": "0/0", "author": "Martin Epelde"}, {"rating": 4.0, "review": "This is as awesome as I thought it would be. Ended up downloading an app to my phone and tablet to use as a remote control too and they both work great. I think the only improvement I could suggest is an on/off switch. Why have it run all the time? And I certainly don't want to have to plug and unplug it with every use.", "verified": true, "helpfulness": "0/0", "author": "Tim Schoenbeck"}, {"rating": 4.0, "review": "Product is great.  My roku arrives a week beforey firestick arrived. Love the games all the movies music extra is great with prime memberships", "verified": true, "helpfulness": "0/0", "author": "Michael Mills"}, {"rating": 5.0, "review": "This is a happy addition to my house. I have the Amazon Fire TV in my living room and the Fire TV Stick in my bedroom. I am very pleased with the Stick and I find it to be fast and easy to use. Very easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "Susan K"}]