[{"rating": 2.0, "review": "I love the idea of the Fire TV Stick, and the price. But the remote that comes with it needs a lot of improvement - the buttons don't work well. Sometimes they don't select at all, then they rapid select all the times you've pressed, and then some. Rework the remote, add $5.00 if you have to, and present a better product!!", "verified": true, "helpfulness": "2/2", "author": "AbbeyOMy"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Christina Lane"}, {"rating": 1.0, "review": "I love the shows just not happy with the fact that it can't seem to stay connected. I I cannot get cable or fios  so I was excited about the fire stick and in the end it was a big disappointment", "verified": true, "helpfulness": "1/1", "author": "Cathie Frey"}, {"rating": 4.0, "review": "Love it. The picture quality is great and the whole set up was very simple and easy.", "verified": true, "helpfulness": "0/0", "author": "Dee Wharen"}, {"rating": 5.0, "review": "i recommend amazon fire tv 100% is a good invest for the family.", "verified": true, "helpfulness": "0/0", "author": "Roberto aguilar"}, {"rating": 5.0, "review": "Very nice device", "verified": true, "helpfulness": "0/0", "author": "Panchito jr"}, {"rating": 1.0, "review": "If you are looking for a device that plays movies using plex; look elsewhere.  I have tried a myriad of setting in order to get the Fire  TV stick to play movies trough plex without pausing and or crashing and nothing has helped.  I regret the purchase, love the remote and the idea behind the product.", "verified": true, "helpfulness": "0/1", "author": "Brian Smith"}, {"rating": 5.0, "review": "Love it. Is an awesome device.  Basrd on an open platform you are able to customize the channels you need and desire to watch. You even can habe Kodi on it if you want.", "verified": true, "helpfulness": "0/1", "author": "AdiAri"}, {"rating": 1.0, "review": "Don't waste your money, just go for a roku. Functionally, this brings you nothing extra. Sped is very slow and delayed, home screen is clumsy and functionally has no direction", "verified": true, "helpfulness": "0/1", "author": "Urbanite1985"}, {"rating": 4.0, "review": "great device for such a reasonable price", "verified": true, "helpfulness": "0/1", "author": "john"}]