[{"rating": 5.0, "review": "No problems.. works very well with Plex and is small enough to be easy to conceal behind my TV.", "verified": true, "helpfulness": "0/0", "author": "P. SOO"}, {"rating": 1.0, "review": "At first I absolutely loved it. Then while watching a show it paused for 85 seconds for an ad. Later during another show same thing happened. I bought this so I could stream stuff without ads! This frustrates me to no end!! I am considering returning it and getting something else!!", "verified": true, "helpfulness": "0/0", "author": "Panda_12 \"To improve is to change; to be perfect is to change often -Churchill\""}, {"rating": 5.0, "review": "Excellent. Work perfect and it is very easy to follow the instructions. It take only few minutes to install it.", "verified": true, "helpfulness": "0/0", "author": "Alex Djuro"}, {"rating": 2.0, "review": "One extra star for Miracast, which makes the dongle worth the money.  I guess as a Miracast dongle it is well worth the money, and if the screen casting worked smoothly I'd be tempted to give it more stars just for that.  But it is very flaky and doesn't like to connect to most of my devices the first time.  Probably because of the flaky WiFi...speaking of which, the WiFi connection is horrible.  Some times it drops every few seconds.  No other devices, including Smart TVs, phones, laptops, tablets, etc. have any problems.  It will be showing Very Good signal strength one second and drop the connection the next. I have to reboot it when it gets bad, which sometimes helps. Also probably explains why movies keep dropping into low resolution.  I mean LOW resolution!  As in FUZZY.  I gave up on the first movie I tried to watch and haven't tried again.  Music is not too bad.  Apps are lame.  No Web Browser, so you could not use this with a WiFi that requires a web page to activate.  No mail client.  Can't pair BlueTooth keyboards, etc.  LAME LAME LAME", "verified": true, "helpfulness": "0/0", "author": "DrHenley"}, {"rating": 5.0, "review": "Has everything I needed.", "verified": true, "helpfulness": "0/0", "author": "Marisela Díaz"}, {"rating": 5.0, "review": "easy setup cancelled the movie channels on fire stick now", "verified": true, "helpfulness": "0/0", "author": "Clarolopez"}, {"rating": 5.0, "review": "we love it so far. start up was simple and it's easy to use.", "verified": true, "helpfulness": "0/0", "author": "Tyla Berger"}, {"rating": 4.0, "review": "It works well.  Would give it 5 starts but I have to reboot it sometime to get it to connect to wireless.", "verified": true, "helpfulness": "0/0", "author": "useless"}, {"rating": 5.0, "review": "Easy to use.  I like the remote that came with it.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Mims"}, {"rating": 4.0, "review": "An amazing piece of technology.  I will be so relieved when I can get rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Loretta A. Estrella"}]