[{"rating": 4.0, "review": "When cable got ridiculously expensive, I opted for the Fire Stick. We had a few issues getting a clear wifi signal, but once we did, setup was easy. Works great... But a word of caution. If your wifi is overloaded with devices, you may have issues.", "verified": true, "helpfulness": "0/0", "author": "DJ Lowery"}, {"rating": 4.0, "review": "The feature that allows you to login at a hotel did not quite work, but still a great product.", "verified": true, "helpfulness": "0/0", "author": "J. Humphries \"Coolbreeze\""}, {"rating": 5.0, "review": "Works great, able to view just about anything !", "verified": true, "helpfulness": "0/0", "author": "Hoyt Allen"}, {"rating": 1.0, "review": "I ordered this Fire Stick for our Colorado mountain retreat.  However, it will not stream. I'm thinking it may be our service is not strong enough (we have to endure Century Link UGH) so I will be taking it back to Texas and hopefully it will work there.", "verified": true, "helpfulness": "0/0", "author": "Carole H. Elmore \"waterboy\""}, {"rating": 3.0, "review": "need more buttons with better shortcuts", "verified": true, "helpfulness": "0/0", "author": "RWturtle"}, {"rating": 4.0, "review": "Easy set up, better functionality than Google Chromecast. Only drawback is no easy way to cast YouTube.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Robert Greene"}, {"rating": 5.0, "review": "We now have two of these in our house and want to get a third. They are so convenient and great for people who rent/buy a lot of movies via Amazon Instant Video like our family. We have had some problems with it dropping the internet connection and having to unplug the fire stick and replug it back it. But other than that we love them!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "Great product for our family", "verified": true, "helpfulness": "0/0", "author": "Ron S."}, {"rating": 5.0, "review": "Providing a quick method to access all the wireless goodies now available on my big screen TV. Easy to use, just point and click.", "verified": true, "helpfulness": "0/0", "author": "Constance J. Hunt \"Happy Reader\""}]