[{"rating": 5.0, "review": "This is a fantastic tool for watching HBO GO, Netflix and Twitch.tvEverything is working great and I love that I can carry this around and have all my accounts available as long as there is a power outlet, hdmi, and wifi available. I recommend this to everyone I know.", "verified": true, "helpfulness": "0/0", "author": "frenzical"}, {"rating": 5.0, "review": "i love it its work well for me", "verified": true, "helpfulness": "0/0", "author": "rene jones"}, {"rating": 4.0, "review": "I do like the product but I had to return it because the video streaming is restricted outside the United States.", "verified": true, "helpfulness": "0/0", "author": "John K. Jablonsky \"sadisticsurfer\""}, {"rating": 5.0, "review": "Good, cheap streamer for Prime.  The latest update seems to fix any issues with it.We use Amazon for most of our purchases and I update my reviews if anything changes with the products. I do this so other Amazon users can get a real feel for the life of the product.  I am not associated with any company and all opinions are my very own.", "verified": true, "helpfulness": "0/0", "author": "Stu Redman"}, {"rating": 1.0, "review": "I should of trusted all the other bad reviews regarding network connectivity problems with this device.  I could NOT get it to connect to my wifi router, and gave up after about an hour.  All my other devices could connect/re-connect without issue (xbox, smart blue ray player, phones, tablets, laptop, all connect without issue during my troubleshooting period).  Checking my router logs, I did not even see the device talking to my router (as all my other device activity were being logged).  It appears the wifi chip was dead on arrival.  The device gets VERY hot, so wonder if perhaps it caused the sodering to expand and loose connectivity with the wifi chip?  Anyway, Just printed up the receipt to do a return for full refund.  Going with my 2nd choice and getting a Roku device.  Heed the bad reviews regarding the network connectivity > they are accurate and still not resolved.", "verified": true, "helpfulness": "0/0", "author": "dc doc"}, {"rating": 5.0, "review": "Works great, easy to set up.  I use it in my little Airstream.  Turn on my hotspot, set up my fire stick and watch Game of Thrones or Deadwood when I don't feel like reading", "verified": true, "helpfulness": "0/0", "author": "bebelee"}, {"rating": 5.0, "review": "My husband and I absolutely ADORE the Fire Stick! Couldn't have been easier to set up,  love the navigation,  love love love the remote app.  We intend to finally get rid of cable/satellite!", "verified": true, "helpfulness": "0/0", "author": "soonermitzi"}, {"rating": 4.0, "review": "so far we rented one movie and it work well, We sometime watch free movies", "verified": true, "helpfulness": "0/0", "author": "Geralyn Ewing"}, {"rating": 4.0, "review": "Seems like a well made product have not had a  opportunity to use much it is in use in my bedroom seems a little glitchy at times but overall a good product takes some getting use too as I have used a roku for so long.", "verified": true, "helpfulness": "0/0", "author": "mark p"}, {"rating": 4.0, "review": "I purchased the Firestick through Amazon's pre-release sale for $20 not expecting much. I was going to upgrade to this and give my Roku 2 to my mother since she's used to the Roku interface. I personally like lists, so before giving the the Pros & Cons you should know that the stick is only really useful if you already have a Netflix, HBO GO, Sling TV and/or a Prime Membership. I just so happen to have Netflix and Prime membership. Having both services really gives you a wide range of variety when it comes to viewing choices.Pros:1-The fact that it is a stick really makes a difference when you're used to using boxes.2-The interface is very slick and very user friendly. It makes the Roku menu system seem juvenile/kiddish. Everything is perfectly organized and you can always get back to your recent apps/channels without having to scroll through lists of stuff.3-Although many people have complained about having to plug into a power source I plugged into my TV's USB port (i have an old Olevia from 2008)  and although I received the \"low power\" warning it works fine.4- The Netflix app for the stick is miles ahead of the the Roku box. First off, it allows you to switch between profiles in Netflix which to me is huge. You never realize how essential this is until you share your Netflix account with other people. I haven't had my roku for a while so I don't know if the latest Roku update provides this. The whole netflix experience on the stick reminds me of the kind of menus you typically get on a gaming system likeSony PS4 or Xbox. Everything is beautifully, simply arranged with tailored recommendations at the very top. If you watch TV shows it automatically plays all the episodes in a given season.5-Prime Instant Video- I have an HTPC set up in the livingroom and I personally hate the browser interface that Amazon has for instant video.For all the money they've invested I personally feel this is one of the its shortcomings as far as competing with Netflix's livingroom browser watching experience. However, since Prime Instant Video is cooked into the internal DNA of the Firestick it makes recommendations and the watching experience quite enjoyable and on par with Netflix.6-Pandora- The pandora app will play music in the background which is a feature I never had on the Roku. This means you can scroll through other stuff while music is playing. And if you turn off the TV the music will pause and continue playing from where it left off when you turn the TV back on.7- Plex- I'm a big plex fan and the Firestick works beautifully with this app to stream everything I have downloaded on my HTPC drive.ConsCONNECTIVITY- This is by far the Firestick's Achilles' heel. Recently, this has become more of an issue with my Plex than Netflix/Prime Video. Lately it has gotten really bad and I have just stopped streaming my videos out of frustration.I The wifi adaptor in the stick is definitely inferior to that of a Roku or other streaming set top box probably because of its compact nature. I just ordered a more powerful router since I am connecting more devices wirelessly so I am hopeful this improve the connection issues. Definitely only get the Firestick if you have your router in the same room or if you have a powerful router (aka with external antennas) or else you may get inconsistent connection problems.", "verified": true, "helpfulness": "0/0", "author": "IlloquentGent"}]