[{"rating": 5.0, "review": "I have two of these.  They are great.", "verified": true, "helpfulness": "0/0", "author": "Omar Rubio"}, {"rating": 5.0, "review": "Bought for my wife and it seems to be working fine and as advertised. My problem I have is you ask for reviews before I've had a chance to use product long enough to get a better feel for how it does work and how well I like it. This is meant for all reviews, not just the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Buff46 8"}, {"rating": 5.0, "review": "This is so great.  It's easy to install, easy to use, and with Prime gives me a world of entertainment at no additional cost - or at occasional low cost for special things like Net-Flex offerings.  All this on my great big LED TV. Now I only use broadcast television with my Internet.  With this Stick I don't have any use for cable TV. This saves me a lot of money and gives me more and better choices for entertainment.", "verified": true, "helpfulness": "0/0", "author": "Bill McLean \"As I See It!\""}, {"rating": 5.0, "review": "Very quick setup, works great!  Can not wait to add more services to it.  Buy it you will be happy you did!", "verified": true, "helpfulness": "0/0", "author": "robin weisberger"}, {"rating": 5.0, "review": "Absolutely love this device. It does everything it's advertised to do quickly. I have an Apple TV as well, but I think I would prefer using the Fire Stick over it. Plus, you can't beat the price and small size of the device. No regrets at all!", "verified": true, "helpfulness": "0/0", "author": "Ben Danecki"}, {"rating": 5.0, "review": "I think it works great and with amazon constantly adding new content it gets better and better. Since you can access Netflix through the Fire TV Stick there is literally too much to watch. Obviously there are lots of programs and movies you cannot watch through either of these services which  is why this is a great product and not a perfect product. The included remote is not needed since you can use your smart phone but I always use it because it is simple and works great. But when I do lose the remote I'm glad I can use my phone.", "verified": true, "helpfulness": "0/0", "author": "Eddie Rodriguez"}, {"rating": 5.0, "review": "Love the fire stick so far. Easy to set up and navigate. Already watched movies and shows. Lot of options for entertainment. My only problem is whether or not I should have gotten the fire TV.", "verified": true, "helpfulness": "0/0", "author": "Jay_Yoon"}, {"rating": 2.0, "review": "Still haven't gotten it to work.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 1.0, "review": "Kept stopping, had to jump through hoops to get it to work and it didn't, took it back the next day and bought a Roku which works very well.  Certainly not worth it at all.", "verified": true, "helpfulness": "0/0", "author": "Rosalind Biggs"}, {"rating": 5.0, "review": "This thing put my Apple TV to shame and I love Apple products. Now I can actually watch prime on my TV. If I want to take it with me when I travel for work, not a problem. The only bummer is it needs a power cord instead of running off the HDMI input.", "verified": true, "helpfulness": "0/0", "author": "Bme"}]