[{"rating": 1.0, "review": "Beware! Don't purchase if you have an AARIS router!!! I loved the device when it was working however, after many issues, trouble shooting and phone calls I was finally told that the fire TV stick isn't compatible with my router. Amazon said there is nothing they can do about this and did allow me a no hassle return. I am extremely disappointed but it looks like I am being forced to switch to a Roku!", "verified": true, "helpfulness": "0/1", "author": "Treasa H."}, {"rating": 2.0, "review": "I was really excited to get this, currently we use our PS3 for streaming Netflix, Amazon prime, etc in the living room, and my computer (hooked up to the TV via HDMI) in the bedroom. I'm a student, and I need my computer for schoolwork in the evening when my husband usually likes to watch Netflix in the bedroom. So I bought this, thinking I could plug it in to my bedroom TV so that I can use my computer for class. Nope. The wifi won't connect from in the bedroom, at least I assume that's the problem because it kept losing connection and refusing my passwords even though I KNOW they were correct. By the way, I live in a rather small apartment, the router is in our living room, maybe 20 feet away from the bedroom. So it's not like it was terribly far.Also, this may have been obvious to everyone else, but personally I didn't get that the stick has to be plugged into the wall at pretty much all times. From the description and pictures, I got the idea that you simply plug the stick in and start. This was also a let-down since the cord isn't particularly long, so if you have quite a distance between your HDMI port and wall outlet, that may be a problem.Anyway, I was super disappointed, since the whole reason I bought the thing was to use in in the bedroom, and I can't even do that. I ended up returning it.", "verified": true, "helpfulness": "0/0", "author": "Rachel C"}, {"rating": 3.0, "review": "It's ok", "verified": true, "helpfulness": "0/0", "author": "John Nooney"}, {"rating": 5.0, "review": "Exactly what I wanted and delivered right on time!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "It is great and was so easy to install and operate.", "verified": true, "helpfulness": "0/0", "author": "ANGIE"}, {"rating": 3.0, "review": "My apps and interface all run slow even after repeated reboots and resets.", "verified": true, "helpfulness": "0/0", "author": "Ryan Cordero"}, {"rating": 5.0, "review": "My family loves this and the selection of movies. It was very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Nellie W"}, {"rating": 5.0, "review": "5 stars", "verified": true, "helpfulness": "0/0", "author": "Cynthia K. Cooper \"Coops\""}, {"rating": 4.0, "review": "We use this a lot.  Must have Amazon Prime (we are running out of things we want to watch)", "verified": true, "helpfulness": "0/0", "author": "LJ"}, {"rating": 5.0, "review": "Cant beleive I survived with out it.", "verified": true, "helpfulness": "0/0", "author": "Rosa Patten Boyles \"rpb74\""}]