[{"rating": 5.0, "review": "Seems to b great!!!", "verified": true, "helpfulness": "0/0", "author": "Janet Lynn \"luv2read\""}, {"rating": 3.0, "review": "cannot get subtitles", "verified": true, "helpfulness": "0/0", "author": "Marcia Shainsky"}, {"rating": 4.0, "review": "Didn't know what to expect, the price was right, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Frederick Bloemker"}, {"rating": 3.0, "review": "Learning the buttons on the remote is difficult.  Also, when I try to find information about how high  the high speed internet connections needs to be there was no information on it.  My internet connection must be boarder line because in the evenings the connection slows because of bandwidth, I presume.  this of course causes frequent buffering pauses.  I wish when it was advertised there had to be something along the lines  of minimum megabites to avoid this.", "verified": true, "helpfulness": "0/0", "author": "Michael Perry \"bowpuller\""}, {"rating": 5.0, "review": "I had a few problems with getting this to work, but a little troubleshooting and I was up and running with no trouble. First, if you have WiFi, I'm sure you know your password. I can't believe how many people don't. I have it recorded in my cell phone as a \"contact.\" I had to hook this up to my television in my bedroom, because my Sharp HD in the living room doesn't have the necessary connector.At first I couldn't get it to work; only the word \"Amazon\" was showing on the screen. But when I used the included extender connector, everything worked fine. It was easy peazy from then on out. I made some popcorn, settled in and watched 6 episodes of Penny Dreadful, something I've been waiting to do since I lost it on my DVR in September.I love the fact that the instructions that come with the unit are extremely non-daunting and simple, and that everything you'll need, including the batteries, is in the package.Just keep that \"No Fear\" attitude and you should be enjoying another great product from Amazon in no time.", "verified": true, "helpfulness": "0/0", "author": "Annabelle"}, {"rating": 5.0, "review": "Very simple and just works.", "verified": true, "helpfulness": "0/0", "author": "LOL"}, {"rating": 5.0, "review": "Love it!  Works great and has a lot of great options of Prime videos and tv shows!", "verified": true, "helpfulness": "0/0", "author": "lauren ackerman"}, {"rating": 4.0, "review": "Love it. Voice control is very helpful. The only thing I am upset about is now Amazonhas basically the same thing for $39.00.", "verified": true, "helpfulness": "0/0", "author": "Mark Rhodes \"Memphis1231\""}, {"rating": 1.0, "review": "possibly the worst piece of total garbage on the planet.  I also have an Apple tv, amazingly different experience.1)  Drops network connection CONSTANTLY.2)  Won't allow me to watch R rated shows on HuluPlus even though I have set parental controls to OFF and HuluPlus does not even have a parental control setting!  Unbelievable.3)  Didn't even come with HuluPlus downloaded - I had to download the app then set it up.  With Apple TV I just clicked on it and registered the device - everything worked fine.This is the sorriest piece of garbage and I am pretty sure I\"ll never actually use it after spending about an hour this morning trying to get around it's clunky interface.  Avoid it like the plague.", "verified": true, "helpfulness": "2/3", "author": "Pete"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/1", "author": "Dark knight"}]