[{"rating": 5.0, "review": "I love it!  With options like these, I believe we will see an end to cable TV as we know it.  This is a much better deal!", "verified": true, "helpfulness": "0/0", "author": "Christine J. Blakeman"}, {"rating": 1.0, "review": "This took three customer service people and over an hour to get to work and another hour to get everything else in my home back working.  Since then it has only worked some of the time.", "verified": true, "helpfulness": "1/1", "author": "leah h detellis"}, {"rating": 5.0, "review": "Easy peezy to get up and running. it came pre configured so all I had to do was plug it in. Added a whole new dimension to our TV viewing.", "verified": true, "helpfulness": "0/0", "author": "Fritz The Cat"}, {"rating": 4.0, "review": "No surround sound capabilities. This needs to be addressed. Otherwise, easy to use and navigate with no buffering issues.", "verified": true, "helpfulness": "0/0", "author": "Steven Forbes"}, {"rating": 1.0, "review": "Can't get it to work", "verified": true, "helpfulness": "0/1", "author": "HBoot"}, {"rating": 5.0, "review": "The setup was easy, and the Fire Stick is making our streaming so much easier, at least so far! The price is a bargain for what it does.", "verified": true, "helpfulness": "0/0", "author": "mooncat"}, {"rating": 2.0, "review": "I am disappointed in the picture quality of the broadcast. I have watched programs on Netflix and the picture quality looks like Standard Definition, on the same flat screen tv when I watch the same program using my PS3 the quality is High Definition.", "verified": true, "helpfulness": "0/0", "author": "Walter Kohl"}, {"rating": 5.0, "review": "We have a Roku Stick and this Fire Stick. The Fire Stick is way faster at loading. The remotes are about the same but the quickness is VERY noticeable. Definitely would have gone with 2 of these has we known.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Koch Hurry"}, {"rating": 4.0, "review": "I initially had an issue with buffering like crazy.  I read the instructions again and instead of plugging into a surge protector, I plugged the unit directly in the wall and it has been great.", "verified": true, "helpfulness": "0/0", "author": "MissAmazon"}, {"rating": 5.0, "review": "No complaints, works great and the idea of saving money on cable and accessing other viewing options is wonderful.", "verified": true, "helpfulness": "0/0", "author": "JenRN"}]