[{"rating": 1.0, "review": "It turns off  all of the time and reboots, seems like it has a memory leak or something, normal after watching a movie or something long. hope next version is better", "verified": true, "helpfulness": "0/0", "author": "andrew schulz"}, {"rating": 4.0, "review": "It was a little difficult to install on the TV- not thehardware but the instructions were in German.  Once installed, had to reconfigure the wifi extender. Still, the reception cuts out and pauses at times. Not sure why. Very easy to use remote. Good selection of programs to watch on Amazon Prime.  I don't watch TV much but it is nice not to have so many commercial interruptions", "verified": true, "helpfulness": "0/0", "author": "Deborah K \"Sandra R\""}, {"rating": 5.0, "review": "I love the Firestick.", "verified": true, "helpfulness": "0/0", "author": "dotty"}, {"rating": 5.0, "review": "Best investment we've made in awhile. I love Amazon , but love it even more now!! You can honestly cut your cable bill and just have internet and this stick..", "verified": true, "helpfulness": "0/0", "author": "Prettyinink \"Pretty In Ink\""}, {"rating": 3.0, "review": "Ive not had a chance to really experience. I will get back to you at a later date.", "verified": true, "helpfulness": "0/0", "author": "mybflat"}, {"rating": 3.0, "review": "How can i make the subtitles of netflix bigger?", "verified": true, "helpfulness": "0/0", "author": "Monica Cavero-Egusquiza"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Dixie Terry"}, {"rating": 3.0, "review": "It's alright. Glad it was only $40.", "verified": true, "helpfulness": "0/0", "author": "Rebekah"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Rodney Graham"}, {"rating": 3.0, "review": "Had a lot of apps but where missing some I was hoping for. The search was nice but would try to push Amazon content instead of showing you the free or cheapest way first. Had some performance/speed issues and had to restart the stick a few times after apps would not open or crash.", "verified": true, "helpfulness": "0/0", "author": "trevor burch"}]