[{"rating": 5.0, "review": "Fabulous. You get your moneys' worth.", "verified": true, "helpfulness": "0/0", "author": "Phil Creore"}, {"rating": 5.0, "review": "Best $20 I've spent in a long time!", "verified": true, "helpfulness": "0/0", "author": "FVZ"}, {"rating": 5.0, "review": "I was skeptical of the Fire TV stick when I ordered it. But it was on sale for prime members, so I figured I would give it a shot, and I am very glad I did. It works perfectly. Yes, sometimes it needs to buffer, but that is very rare and when it does it is only for a few seconds at most. I have been very, very pleased. I even got one for my in-laws. Great value for a great product.", "verified": true, "helpfulness": "0/0", "author": "Evan"}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "sharon brown"}, {"rating": 5.0, "review": "Great value for the money. Great companion to Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "william s."}, {"rating": 5.0, "review": "It is awesome.  I especially love that I can view YouTube on it so I can see tutorials easier.  I love all the free apps but don't like that many of the items on the Fire tv are paid subscriptions.  My husband is having fun with the comedy and science apps and Netflix movies.", "verified": true, "helpfulness": "0/0", "author": "Rosemary Albers"}, {"rating": 5.0, "review": "I absolutely love this!!  It is a great addition to my fire TV!!!", "verified": true, "helpfulness": "0/0", "author": "DAWN HEGLEY"}, {"rating": 5.0, "review": "Everyone needs a Fire TV Stick.  My daughter loves it to put on her children's smart TV.  They are able to watch Netflix and Prime Videos.", "verified": true, "helpfulness": "0/0", "author": "Christy J. Wrenn \"Academic Book Lady\""}, {"rating": 1.0, "review": "TV commercial makes it appear as if no power cord is needed. I should have done better research so it's partially my fault. I don't see how this is any different than a box sitting next to the TV. The price is nice I suppose.", "verified": true, "helpfulness": "1/1", "author": "KS"}, {"rating": 5.0, "review": "i bought mine on preorder for plex and netflix don't like the plex app if u buying for plex don't buy the ui sucks", "verified": true, "helpfulness": "0/0", "author": "Johnathan Denson"}]