[{"rating": 5.0, "review": "This is an awesome device!!", "verified": true, "helpfulness": "0/0", "author": "Cammzzzz"}, {"rating": 5.0, "review": "I ordered this primarily for the office television that doesn't have access to movies otherwise so the kids could access Netflix and Amazon Prime from the tv they share in that room.  However, it will be convenient for traveling with as well.  This was well worth purchasing.", "verified": true, "helpfulness": "0/0", "author": "Amanda Johnson"}, {"rating": 5.0, "review": "This is the third one I have bought. My young kids love watching their shows in their own room. Great parental controls. Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Sam Irwin"}, {"rating": 4.0, "review": "Definitely do not regret cancelling cable and purchasing this! Super easy to install and set up, but getting the remote open to put in the batteries was a huge pain. Other than that we are completely satisfied.", "verified": true, "helpfulness": "0/0", "author": "Brooke DeBauche"}, {"rating": 5.0, "review": "great item! fast service!", "verified": true, "helpfulness": "0/0", "author": "Joshua Hetheriton"}, {"rating": 5.0, "review": "Thank you so much for out fire stick, we bought Roku first, what a nightmare. The Fire stick is so easy to work. We have been streaming movies since we got it. Again thank you.", "verified": true, "helpfulness": "0/0", "author": "Lloyd Smith Jr."}, {"rating": 4.0, "review": "Still lrarning how to use it", "verified": true, "helpfulness": "0/0", "author": "Bank of America"}, {"rating": 5.0, "review": "Love the Fire TV stick. Now I can watch all my favorites from Amazon, Netflix, and much more on TV in any room. it's portable too, so I can take it with me anywhere. Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Kitty Mama \"Kitty Mama\""}, {"rating": 5.0, "review": "Very cool, Very Fun !!", "verified": true, "helpfulness": "0/0", "author": "jtm692"}, {"rating": 4.0, "review": "Had difficulty getting the stick to connect the the network but once the connection was made I haven't experienced any problems.", "verified": true, "helpfulness": "0/0", "author": "Wendy Gladden"}]