[{"rating": 4.0, "review": "Great buy. I love it.", "verified": true, "helpfulness": "0/0", "author": "melody brown"}, {"rating": 4.0, "review": "Easy to install.  Connected to my wireless within minutes and we began streaming.  Looking forward to expanding the capabilities.Uploaded 185 photos of a vacation into Amozon Cloud and played them on the TV with no trouble.", "verified": true, "helpfulness": "0/0", "author": "James J. Dasey"}, {"rating": 1.0, "review": "Didn't meet my expectations. Poor quality. The control not working properly. Freezes. Can't mirror from any apple device. But you can with fire Tv. Don't know why this is not possible. Any other stick works with iPhone or iPad.", "verified": true, "helpfulness": "0/0", "author": "Besnik"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "jjduece"}, {"rating": 3.0, "review": "GoodMenu could have been made more clean and fluidRemote hard to handle in working mans type hand", "verified": true, "helpfulness": "0/0", "author": "Chris Brooks"}, {"rating": 5.0, "review": "Best thing I've ever bought!!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Easy set up. Easy to use, vibrant colors, HD.  Can watch Netflix, Hulu, Amazon Prime, etc.", "verified": true, "helpfulness": "0/0", "author": "cashley84"}, {"rating": 5.0, "review": "This Firestick is a good alternative to Roku. I have both of them and often use the firestick and it just keeps on streaming and streaming and working as intended. If you are already an Amaxon Prime member then this is for you. And at a pretty good price too. You only insert your email and password one time and that's it. Amazon remembers you each time. What's not to like?", "verified": true, "helpfulness": "0/0", "author": "David Roberts \"Marketing Guy\""}, {"rating": 5.0, "review": "Great purchase, it works great and am enjoying the movies.", "verified": true, "helpfulness": "0/0", "author": "Mike popolillo"}, {"rating": 5.0, "review": "LOVE IT!!!! I am having a wonderful time watching lots of shows & movies!", "verified": true, "helpfulness": "0/0", "author": "Martha"}]