[{"rating": 3.0, "review": "The ad talked about mirroring and led me to believe I would be able to use the internet on my tablet and mirror to my TV.  NOT!I am not a movie watcher so 95% of the functions & content are useless to me.  Free to download apps but then you must pay a monthly fee to watch movies.  I already pay for an internet cable package.  I am glad to access YouTube but again disappointed that none of the apps on my tablet work on my TV with the Fire Stick & there is no browser app available.  So for me it is the Amazon YouTube stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great!!!!", "verified": true, "helpfulness": "0/0", "author": "Vera Samuel"}, {"rating": 5.0, "review": "I love the Fire Stick.  I already owned a Roku and bought the fire stick on a two day sale for 19 bucks a few months ago just in case my Roku failed.  I just hooked it up this weekend out of boredom (snowed in) and my family just loves it.  I read the reviews on cnet and youtube and just figured the two were about the same, only difference Roku had more channels according to reviewers. Wrong, as a prime member I wish I had this thing hooked up months ago.  If you are a prime member I feel this is a must.  All the channels we watched on Roku are on the Fire Stick and the navigation is simple.  We are cord cutters from way back and mainly watch Netflix, Amazon Prime, Crackle, PBS, PBS KIDS, A&E; and History and we listen to Pandora alot.  All of these work great on Fire Stick.  My daughter enjoys playing games on it.  I love listening to my music that I have purchased from amazon over the years and the free music available through my prime membership.  Many of the songs we play on the TV using the Fire Stick show the lyrics so its kinda like karaoke.  Only complaint is that there is not an app to make my old 1st gen Kindle Fire a +remote.  Oddly enough there is a remote app for the Roku that works great on my 1st gen Kindle Fire .  I guess this is Amazon's way of making loyal customers buy the latest Kindle Fire.  Not me, I got a great app from the Apple app store that makes my Ipad a voice remote.  I know alot of reviewers would deduct a star for this but I understand it is just business.  Not good business since there are so many ways around the remote issue like using a different tablet, or an android or an Apple phone and installing a free app.  But that means a loyal customer of yours has put down your product and picked up someone else's.", "verified": true, "helpfulness": "0/0", "author": "Ted Mayes"}, {"rating": 3.0, "review": "lots of apps and streaming available, except NO HBO GO.  Unfortunately, most video sources skip and hang constantly, requires Reeboot to fix . My chromecast is smooth as silk so it is not my connection.", "verified": true, "helpfulness": "0/0", "author": "Mikey"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Adam Gallagher"}, {"rating": 5.0, "review": "I like this gadget for several reasons, it's compact and has 8 gig memory on board for games and apps. I've had it a couple of months and it's never given me a problem.", "verified": true, "helpfulness": "0/0", "author": "Donald"}, {"rating": 5.0, "review": "Much better than Ruko..", "verified": true, "helpfulness": "0/0", "author": "Raymond S."}, {"rating": 5.0, "review": "Loves it! Mom can watch all her movies on her tv now. No need for renting anymore.", "verified": true, "helpfulness": "0/0", "author": "Mario P."}, {"rating": 3.0, "review": "I preordered the fire stick as soon as amazon sent me an email about it. We had been using cromecast, and needed another stick for our second tv. I feel like I have been able to watch the progression of the programming,  and I am hoping to see more improvements as time goes on.The stick is nice in that it consolidates my streaming apps, and has its own remote. The navigation is smooth and it is so easy to rent a movie when I cannot find it on Netflix or hulu.ButI feel that the stick does not play well with my wifi at times. Hours can go by without issue, but then it never fails in the heat of a scene the screen will freeze while the sound goes on. Sometimes I can rewind a few moments and hit play again to get things going, other times I have to exit and completely restart to get things going again. This is one thing our cromecast stick has not displayed as an issue with, otherwise I would blame the ISP.With all the improvement I have seen so far, I have no doubt that this little glitch is already being addressed.", "verified": true, "helpfulness": "0/0", "author": "Zia"}, {"rating": 5.0, "review": "WORKS GREAT", "verified": true, "helpfulness": "0/0", "author": "GARY SCHROEDER"}]