[{"rating": 2.0, "review": "I hate this thing.  It looses the connection to my wifi all the time, then is unable to reconnect or even find the network.  This despite the fact that I'm writing this review on that same network.  Streaming is choppy on this but great on my other devices.  I'd really hoped this could replace my cable subscription,  but it's simply too junky to trust.", "verified": false, "helpfulness": "0/0", "author": "BNKabel"}, {"rating": 5.0, "review": "Exceeds all my expectations.", "verified": true, "helpfulness": "0/0", "author": "James H Jones"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Laurie Krager"}, {"rating": 4.0, "review": "Love love love ! Once in awhile my Hulu will freeze up but besides that I will recommend this to anyone !", "verified": true, "helpfulness": "0/0", "author": "Suleika"}, {"rating": 5.0, "review": "I love this thing!  I had a Roku-type box previously, but the Fire TV Stick is much smaller, and works just as expected.  I don't get into the games - I mostly just use it to watch TV.  It's smooth, intuitive, and looks great.", "verified": true, "helpfulness": "0/0", "author": "Jackie F"}, {"rating": 5.0, "review": "I tried the Chromecast device first, and then the Firestick. The Firestick is much more better, easier to use, interface is simple. If you use your account to buy it on Amazon, it's already registered with your info, so setup is extremely easy. Access to Prime member features, music, photos and more! Beats Chromecast hands down, you won't regret it! Glad I bought it", "verified": true, "helpfulness": "0/0", "author": "Michael bell"}, {"rating": 1.0, "review": "There is very little movies and TV shows available for free that I am interested in. Every time I find something my family and I want to watch, it is only available for purchase or rent. I am very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Tracy L. Mathews \"healthy reader\""}, {"rating": 5.0, "review": "I have replaced my 150.00 a month Satelite Bill! I only use Satelite for local channels now! I love my fire stick. It is very easy to use. And streams without buffering", "verified": true, "helpfulness": "0/0", "author": "SHANNON BOEHM"}, {"rating": 4.0, "review": "Great device for the price. I just wish it didnt have to be plugged into an outlet.", "verified": true, "helpfulness": "0/0", "author": "miketmartin"}, {"rating": 4.0, "review": "Does well with Netflix and Flixster.  I use Amazon Prime but only as a trial.  It does sometimes disconnect from the wireless router.  And sometimes it does have to buffer during a movie or show but I will need to adjust the router.  Still, it's better than what I had before.  It has many apps to use but I wish it had a VUDU app.  I'm not liking Amazon Prime and it looks like Amazon makes it apparent that you should use it.  But it is pretty limited in terms of movies.  I also wish it didn't have to be plugged into the wall.  I also like that it works with my kindle fire especially for the voice recognition.  Overall I am happy with it but just wish Amazon Prime wasn't so \"in your face\".", "verified": true, "helpfulness": "0/0", "author": "TRFB"}]