[{"rating": 5.0, "review": "This is the perfect, flexible streaming device. It is so simple to use that my three-year-old knows how to find his shows. I love Prime, and I like the options for other apps. Great price and product.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Shepp"}, {"rating": 3.0, "review": "Not good app for music like Google music or Spotify. .the full version not te mirror", "verified": true, "helpfulness": "0/0", "author": "fer"}, {"rating": 5.0, "review": "It works great and small so you don't have to worry about big boxes and components", "verified": true, "helpfulness": "0/0", "author": "juan munoz"}, {"rating": 2.0, "review": "I'm disappointed.  I was told it would connect to my smart phone and laptop.  Only to figure I had to spend more", "verified": true, "helpfulness": "1/1", "author": "Richard"}, {"rating": 5.0, "review": "I ordered it when it first went on sale at the $19.99 price to use on one of my TVs that doesn't have built in apps so I could watch Amazon Prime Video and Netflix. I got it today, and had it set up in 2 minutes.  The picture is good, sound is good and took only a second or two for video playback to start.  I have not had any experience with Fire TV before, but I do have an Apple TV on another set.  I must say this on par with that, and much cheaper. I am very pleased with my purchase! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Samuel B."}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Kms0387 \"I can so easily be lost to the world in a good book.\""}, {"rating": 5.0, "review": "Works perfectly with 1080p streams via Plex. For $19 nothing else comes close. It's awesome that it comes with a remote instead of using just a phone/ipad.", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 5.0, "review": "The Fire TV Stick is almost perfect. Easy setup and use. Don't especially care for the on-screen interface but it's not horrible. Going to install Kodi then it will be sweet. Life is good.", "verified": true, "helpfulness": "0/0", "author": "Herman P."}, {"rating": 4.0, "review": "As a prime member, I had the option to get this so cheap that I couldn't resist. To put it into perspective: I have an htpc and quad core android mini pc already, but I still bought one of these.Initial impressions are good. The stick seems solid, and it boots and updates pretty quickly. Wifi performance has been good as well. The controller is pretty cheap, and doesn't feel like it would survive too many drops onto a hard floor though. The included batteries for it were a nice though though!The app selection, while not massive, is decent. Netflix, Hulu, and Plex are pretty much all I need, but I hope at some point XBMC is available.The UI is a bit cluttered, and I'm not a huge fan of the carousel design, but it works pretty well. Everything is fluid, I didn't notice any real slow downs or lag. I'd say this is the perfect little device for a small area, or a person who wants the absolute simplest solution (parents, grandparents, etc). Navigation and setup are easy, and before long you are watching content.", "verified": true, "helpfulness": "0/0", "author": "Benjamin C Jones \"Ben J\""}, {"rating": 4.0, "review": "So far I like it; it works great. It would be nice if I were to watch stuff from the Internet with it. There are web based training videos that I watch on my laptop or iPhone that would be nice to see on a TV.", "verified": true, "helpfulness": "0/0", "author": "A. Gail Luther"}]