[{"rating": 5.0, "review": "Its so easy to use and fits into the TV.. Love it", "verified": true, "helpfulness": "0/0", "author": "Nadiya"}, {"rating": 2.0, "review": "On paper, great product. But just like Betamax vs VHS, it lacks content.  I have an old  Roku and it is far superior since it has many more channels and, importantly, live content. Since day one TV was about live content. Roku provides it but not FireTV.", "verified": true, "helpfulness": "1/2", "author": "Fantomfears"}, {"rating": 5.0, "review": "Good product does what is claimed", "verified": true, "helpfulness": "0/0", "author": "Usn"}, {"rating": 5.0, "review": "It was relatively simple to install (once we synced to our wireless) and everything after that was easy.  We have quickly started to use despite being sceptical at first.  I'd recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "Jeffery S. Petrich \"J Petrich\""}, {"rating": 5.0, "review": "best thing i ever bought !!!!", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "Excellent!  I switched out my Ruku because the Fire Stick works so much easier.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pretty view and much more apps. And can watch oldest movies for my mom. I am thinking about buy another one for mom when it is on sale again like only 20 bucks! Loved it!", "verified": true, "helpfulness": "0/0", "author": "Libby L. Singleton"}, {"rating": 2.0, "review": "Why do we get HBO Go in the spring when the Fire TV box gets it now?", "verified": true, "helpfulness": "0/1", "author": "thezky"}, {"rating": 5.0, "review": "Love it, If you are a Prime member, this is even better!  Great for streaming music and fast too. Highly recommend. I got google chromecast when it first cam out and waited thru all the updates, but this stick comes with it all ready to go, except ability to manipulate your music from here. Have to log in on computer or Ipad", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 3.0, "review": "Fire stick is great but remote control is not sufficient and must be replacedby a more user friendly one.", "verified": true, "helpfulness": "0/0", "author": "KR @ Home"}]