[{"rating": 5.0, "review": "Works just as good as roku.  Set up is easy and streaming fast and picture good.  I have used it mostly with netflix content and have had no problems.  I would diffidently recommend to anyone who is tired of broadcast networks with so many ads.  Amazon prime has many, many tv shows/movies available and none have commercials.  Just enjoy pure, uninterrupted entertainment with this little stick.", "verified": true, "helpfulness": "0/0", "author": "CAROL"}, {"rating": 5.0, "review": "I have purchased a lot of products from Amazon, but none has given me greater pleasure than the Fire Stick. As soon as I  found the Closed Caption directions, I was delighted because I am deaf.  Then I began to use it for streaming and it was smooth operations all the way. I bought it for $19 but it is worth  many times more. Thank you.Rosemary", "verified": true, "helpfulness": "1/1", "author": "Rosemary T Bodley"}, {"rating": 4.0, "review": "I've had it for 1 day so this is a \"first-look\" review. One thing that I can't understand is the logic behind the Parental Controls. I have a 7 year old who has ordered pay-per-view movies on TV in the past so I've needed to setup controls to make it more difficult. Using the included remote, there is no way to input your PIN without it showing which numbers you selected. Any child who can remember his/her phone number will soon know the Parental Controls PIN. I guess I need to hide the remote.Now, with that out of the way, this seems like a pretty handy device. I've watched a Prime movie and listened to Pandora and Amazon Music. All have worked like they should. Except for the weirdness of the Parental Controls.", "verified": true, "helpfulness": "1/1", "author": "Scott Abbott"}, {"rating": 5.0, "review": "Leagues ahead of the competition, a breeze to set up and get running. Comes preprogrammed with your account information, so no fumbling with usernames and passwords. More than worth the promotional $19 and even the $39 regular price tag. Superfast browsing and idiot-proof remote. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Idreece Ahmad \"arshah\""}, {"rating": 5.0, "review": "Cant beat the price...  ( 19$) prime, and it works", "verified": true, "helpfulness": "0/0", "author": "Picasso"}, {"rating": 1.0, "review": "I am not a big fan of Amazon Prime service because of old TV contents. The only reason I purchased this device was to mirroring internet my Samsung Galaxy Tab S(wifi) or Note4(Verizon) screen onto the Fire TV Stick. I was tried mirror screening on my devices, but mirroring failed continuously. I am not sure, Amazon will update resolving this issue soon. I will return this product soon if they don't have any fixing plan. Chromcast is the best product, if you use mirroring service like me.", "verified": true, "helpfulness": "2/2", "author": "Charles KIM"}, {"rating": 3.0, "review": "I bought this as a replacement for my aging jailbroken Apple TV. On that, I used Netflix, Hulu Plus, Amazon Instant Video, and XBMC for streaming media off my NAS.I was rather disheartened when I discovered this product DOES NOT have a standalone solution for streaming media from media servers.It has the Plex client, which isn't standalone as it requires Plex Media Server. There are other options you can buy, but I didn't want to keep shooting in the dark to find a media player that can do this EXTREMELY BASIC functionality. Finally, I found a solution to \"sideload\" XBMC onto the stick, which works like a charm.The final irritation that there is no solution for is that to access my sideloaded XBMC, I have to venture into settings>applications> manage installed applications in order to launch it. There's no way to create a shortcut so its accessible from the home screen.Overall a neat piece of tech that has one glaring feature omission. I can live the hacky way I've installed XBMC, but it's far from ideal and highlights this shortcoming every time I want to watch a movie.", "verified": true, "helpfulness": "0/0", "author": "N. Bryant \"babyblu\""}, {"rating": 2.0, "review": "It's okay. It works very well and it is easy to set up etc. The menu has some issues for me because it prefers Amazon so if you primarily watch Netflix for example you have a few scrolls to get there instead of on other devices it is all equal. I have come to like that about Roku vs this and apple tv. BUT the two features that are total deal breakers for me are 1. There is no app for the remote and the remote is small and really easy to loose and there are five people in my house. Basically it's lost half the time :( I feel like such a smart device should be able to be operated from my iPhone 6 or iPad or kindle fire! etc. The Roku has a larger remote with a purple leash and it can be operated by an smart device. 2. Maybe there is something I haven't figured out but if i set it to need a password for purchases it also means i have to put the password in everytime i watch anything on prime at all. So all free stuff on my prime account needs a passcode which is annoying with the remote (no keypad like if there was an app) and impossible for my kids. I might put this in my bedroom but it isn't going to work for us as a main device because of these two reasons. Keep coming back to Roku even though I love the resolution of the apple TV and that I can access my music or somewhat anyway BUT  it won't play amazon grrr. If you combined all three you'd have the perfect device! Until then.. I guess Roku is my recommendation.", "verified": true, "helpfulness": "0/0", "author": "C. Lane \"lit teach\""}, {"rating": 5.0, "review": "Works great.  Hooked it up to the HMDI on the back of my surround sound system, I've got full Dolby B, clear picture, fast access.  I like this much better than my $80.00 Roku 2.", "verified": true, "helpfulness": "0/0", "author": "John Van Walsum \"Frequent flyer extrodinaire\""}, {"rating": 1.0, "review": "I ***REALLY*** wanted to like this product.  Currently we have 2 Apple TV's hooked up to 2 different televisions and a networked HTPC that we use for music, DVR, Skype, etc on the big tv and are pleased with all three of these as well as the OTA antenna for local channels (we cut the cable).  This was ordered to go on the small gaming tv in the kid cave.  But so far it has failed to impress and will most likely be returned for a refund in the morning.PROS:Sexy packagingLoaded with Apps with the ability to download more (unlike the Apple TV)Cloud StorageCONS:Kept dropping my home network while only feet away from the WAP (our router is so hot we can pick up a usable signal 1/4 away)S - L - O - WTerrible picture and sound qualityDid I mention S  -  L  -  O  -  W  ?  ?  ?Spent the extra dough and get something that works (I like Apple TV) and have also tried Roku with good results.  This thing is a nightmare.", "verified": true, "helpfulness": "2/3", "author": "Heath Sellers"}]