[{"rating": 5.0, "review": "Very easy to install. more than I expected. great value. Would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "John Williams"}, {"rating": 5.0, "review": "I love it. So easy to hook up amd use", "verified": true, "helpfulness": "0/0", "author": "Denise Scott"}, {"rating": 5.0, "review": "I love it. Much more refined and cleaner interface that the roku streaming stick. Cheaper too!", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "its simple", "verified": true, "helpfulness": "0/0", "author": "sean j casey"}, {"rating": 5.0, "review": "Loving it to the ending of time. Simple setup quality better than expected. Bye bye cable", "verified": true, "helpfulness": "0/0", "author": "Marvin Jerome Blackwood \"WOMB RAIDER\""}, {"rating": 5.0, "review": "Nothing not to like here, Amazon did a great job.", "verified": true, "helpfulness": "0/0", "author": "thomas tarantola"}, {"rating": 5.0, "review": "Once you buy it, you'll wonder how you ever got by without it. Not kidding.", "verified": true, "helpfulness": "0/0", "author": "Jeff F."}, {"rating": 3.0, "review": "I bought the Fire TV Stick mainly because I saw it had Plex as one of the apps. My \"smart\" TV has Amazon Prime but did not have Plex. What I did not know was that the Plex app would cost me another $4.99 just for the Fire TV Stick activation. Limited trial period only plays 1 minute of a movie or music track - even your own files sitting on your home network. Worse yet, Plex on the Fire TV stick suffers from buffering problems on my system. The Fire TV stick does not suffer buffering problems when I stream Amazon Prime movies or TV, so I am thinking the Plex app needs more work to run better on the Fire TV stick. For example, I can find no option in Plex for the Fire TV stick to increase the buffer size despite the Fire TV stick having about 4GB of memory free. Plex has been a big disappointment for me on the Fire TV stick, and that is the main reason I ordered the Fire TV stick. Although I don't usually mark down a product for the failure of third party apps, it was the advertisement I saw that said Plex was now on the Fire TV stick that sold me to order the Fire TV stick. I am very disappointed in the Plex app on the Fire TV stick and may end up returning this purchase.", "verified": true, "helpfulness": "0/0", "author": "George K. Taus"}, {"rating": 5.0, "review": "Works great no issues. My son loves it.", "verified": true, "helpfulness": "0/0", "author": "J. Calia"}, {"rating": 5.0, "review": "It was definitely way better than I expected. I love it way more than apples.", "verified": true, "helpfulness": "0/0", "author": "Sheyenne morvant"}]