[{"rating": 5.0, "review": "Very easy to set up and convenient to use!!!", "verified": true, "helpfulness": "0/1", "author": "Donna Wheelock"}, {"rating": 5.0, "review": "Really happy with Fire - really works great and easy to connect to Prime video and Netflicks. Certainly worth the small cost", "verified": true, "helpfulness": "0/1", "author": "Andrew Shannon \"Andy\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "jimmyboofet"}, {"rating": 4.0, "review": "Excellent price (on sale). Device is small and portable. Easy to set up. Works well for me, very intuitive. One star off because the interface is not as sexy and easy for kids to operate as some other streaming devices.  However, very reliable & a good bargain.  I will admit that I bought it because of the price, and as such, sort of expected it to disappoint. I have been pleasantly surprised and even used it on a whim when we went on vacation.", "verified": true, "helpfulness": "0/1", "author": "Quacktor"}, {"rating": 4.0, "review": "I have a Samsung Smart TV.  I've had a Roku.  And now I have a Fire stick.  Over all, I like the Fire stick best, but with TWO issues that limit me from a full 5 star review.GOOD:1) You can access HBO Go, Netflix, Hulu, Showtime Anytime, and Starz Play.  (Plus many others, obviously, as well as Amazon.)  Showtime Anytime and Starz Play are not available on my Samsung Smart TV.  Starz Play is not available on the Roku.2) AMAZING video quality.  And I mean that.  Listen, video quality looked okay on my Roku (2 -- so maybe they're better now).  They looked great on my Samsung TV, which was a 2013 model.  But on the Fire stick?  Movies play with that quality that's so clear it looks like you're watching a sitcom until you get used to it.  It's almost \"too\" clear.3) Easy to use.  Just plugs in, and I've had no trouble getting my wifi to find it.  Though I DO suggest plugging it into a wall outlet and not your TV USB for power.  The reason for that is, if you turn your TV off at night, it powers down the Fire stick.  That's fine of course... but when I turn my TV on in the morning, the TV loads faster than the Fire stick, so once the Fire stick is powering up it changes the input on the TV to the Fire Stick, so I have to change it BACK.  Not a major thing, but could be weird if you have a guest.BAD:1) Unlike the Roku, the Fire stick does NOT have a universal search function to allow you to search for a movie across Netflix, Amazon and Hulu (or wherever else) so you can find if it's a part of a subscription.  Sure, yeah, I get it, Amazon wants you to buy the stuff from them.  But come on, all they're doing is angering people if they end up paying for a movie on Amazon when it's already free with their Netflix subscription.  Be a pal, Amazon.2) This isn't a huge thing, and may not bother many people... but I don't like it that I have to log into the box using my email address and password.  I don't want the Fire stick to have THAT close of an association with my Amazon account and purchasing ability.  Yes, you can turn on PIN protection for purchases, which I do.  But my email address is still on there, with my password.  It would be better if you could activate the Fire stick using an activation code like you do with any other device you're activating Amazon Video on.ADDITIONAL:This goes under the \"kinda a drag\" topic:  My Harmony remote won't connect with the Fire stick.  So, I have to keep that remote handy.  And the remote is TOUCHY.  I'm not a fan of the Fire remote at all.", "verified": true, "helpfulness": "2/3", "author": "Jacqui"}, {"rating": 5.0, "review": "It arrived.  I unpacked it.  I followed the directions for connecting the pieces. I wrote down my house internet numbers. I played with the tv until I found the right button.  I pushed it and entered my internet numbers. AND I have a fantastic amount of TV, Videos, Movies all available through my Prime membership, which in retrospect was hardly used compared to the past two weeks!  I have finally found out how wonderful binge TV can be if you are hooked on a series or type of movie!  Everything without commercial interruption!  It has been wonderful. While I still enjoy my PBS station over the weekend, my weeknight watching has been severely curtailed while I focus on what else I can watch -- without commercials!  I bought it on sale and determined in advance that if it worked then I would be happy and if it didn't I would also not worry about the loss as I have only ever had rabbit ear TV as I don't believe in paying huge sums for such entertainment. Thank you so much for such a generous product!", "verified": true, "helpfulness": "0/1", "author": "V. J. Hurley"}, {"rating": 5.0, "review": "great size, works well.", "verified": true, "helpfulness": "0/1", "author": "John S. St Genis"}, {"rating": 3.0, "review": "i bough the stick when it first came out and recently the buttons have gotten stuck scrolling forever to different directions.  At times it feel like i am playing Netflix roulette trying to start a movie.  I've switched to using Netflix on my smart TV for now until i decide to get a remote replacement.I also don't know how the remote broke, we don't have any kids to toss it around and we keep all the remotes next to the nightstand for easy access.", "verified": true, "helpfulness": "0/1", "author": "Marie \":D\""}, {"rating": 5.0, "review": "A perfect complement for my Amazon Prime account.  I can (and have) access to so many shows, movies and games!  All with no additional charges thanks to my Prime membership.  I would highly recommend this product and service to any Prime Member.  I have found no drawbacks to this amazing little device.", "verified": true, "helpfulness": "0/1", "author": "Daniel Honaker"}, {"rating": 5.0, "review": "LOVE IT.  NOW I NEED TO BUY ONE FOR MY DAUGHTER!", "verified": true, "helpfulness": "0/1", "author": "kristi duenne"}]