[{"rating": 5.0, "review": "works as suggested and is easy to install", "verified": true, "helpfulness": "0/0", "author": "James T."}, {"rating": 3.0, "review": "very disappointed in the small amount of free items to view. Everything was very expensive just to watch. Charging for TV shows that had run on tv was poor. quality and speed was excellent. just wish there was more I could enjoy. Sorry, but Charter pay per view is cheaper than you are per movie. This is below my wishes as I wanted a way to get away from charter. My son has a competitive brand and gets many more apps than I can, I hope this is temporary and will get better.", "verified": true, "helpfulness": "0/0", "author": "Robert E. White"}, {"rating": 5.0, "review": "i'm not a big electronics person and i hooked this up to my t.v. no problem.  it's been a life saver over this long N.E. winter.  i bought another one for the bedroom.  so much better than watching my Netflix and Amazon Prime videos on my laptop!", "verified": true, "helpfulness": "0/0", "author": "debbie m"}, {"rating": 1.0, "review": "While watching a movie, it would just stop, and not work for a few days. I thought it was our connection until it wouldn't even turn on. Glad I only spent $20 on it.", "verified": true, "helpfulness": "0/0", "author": "M. Ferras-arguelles \"Book Reader\""}, {"rating": 5.0, "review": "BUY IT ! TODAY! YOU WILL LOVE IT, YOUR KIDS WILL LOVE IT AND YOU WILL BE ABLE TO TELL YOUR CABLE PROVIDER WHERE TO GO! Netflix, Hulu Plus, and Sling $36.00 a month and a one time purchase that will change your life and your cable bill.", "verified": true, "helpfulness": "0/0", "author": "Todd B."}, {"rating": 2.0, "review": "Not very pleased that most of the deliverable content is locked down. You are forced to be an amazon prime member to unlock. Roku has much more available for the same price!", "verified": true, "helpfulness": "0/0", "author": "richard j sarkis"}, {"rating": 5.0, "review": "I got this for my kids game room instead of cable. They love it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use, picks up my wi-fi well and access to numerous apps, shows & videos.", "verified": true, "helpfulness": "0/0", "author": "jcrangel81"}, {"rating": 5.0, "review": "Amazed at how well it buffers. Little to no lag time.", "verified": true, "helpfulness": "0/0", "author": "Anastasia Turner"}, {"rating": 5.0, "review": "I love it, your tv will never be the same Amazing.", "verified": true, "helpfulness": "0/0", "author": "Keith Borden"}]