[{"rating": 1.0, "review": "I placed the order in late October and have been anxiously waiting for the product to arrive since it was going to be a gift... I have to say I am very disappointed... I own quite a few electronic devices (including the Chromecast)  and none of them have given me as many connectivity problems as the firestick.The router is only 10-15ft away from the device yet  It constantly drops the wifi signal . When it does work (which is for a few minutes) the video quality is horrible due to the \"poor connection.\" My Chromecast which is located in a room further away from the router works perfectly fine as do my other devices ( tablets, laptops, cell phone, etc).Ive tried using the HDMI extension, restarting the router, restarting the fire stick, disconnecting other devices from wifi, repositioning my router but Ive had no luck so far.. There are several discussion boards in which customers complain of the same problem. I was surprised that the fire stick which costs more and has much better specs than the Chromecast has such poor performance... I guess I might have just received a defective item?As a Prime member, their are many benefits of the fire stick that you do not get from the chromecast which is why I was really looking forward to using it. I will keep it for a few more days and see if there are any improvements.. hopefully and update addressing the issue is released...", "verified": true, "helpfulness": "0/1", "author": "Jen"}, {"rating": 4.0, "review": "Got this during the pre-order sale for $20 or $25 (can't recall off the top of my head). Been using it for almost a month and so far I'm very happy with it. Setup was easy breezy. Navigation is relatively simple, although I'm not a huge fan of the way Amazon's flavor of Android organizes content. The categories don't distinguish between free (with Prime) and paid content, and on more than one occasion I've almost accidentally purchased shows when I was clicking over ambitiously.The OS is smooth enough 80% of the time, but there are lags when switching between applications on occasion. And browsing titles is sometimes jerky or laggy. When I first connected it to the rear of my TV, the remote had major interference issues for some reason so the remote didn't register clicks or it would think a button was being held down. I moved it to a side port and haven't had issues since. It also comes with a short HDMI extension cable that is supposed to help if you encounter issues with the remote.For the price, this thing is fantastic, especially compared to other similar devices at higher price points. I use it to stream plex from my computer and I'm able to watch 1080p at maximum bitrate (no-conversion) on-the-fly without problems. Netflix and Amazon Prime video both work fine, although I prefer the built-in Netflix app on my TV since it works with a qwerty remote. I tried out the Fire TV box before this, and functionally they're nearly identical as far as my usage goes (didn't use the voice commands). This is slightly slower than the box version, but it's a fraction of the price and totally worth it. I haven't really played any games, but I assume they probably work well enough if you are willing to buy the gamepad.The Android Fire Remote app on the phone kind of sucks. I wish it had keyboard support and a simple directional pad since I find the swipe pad really annoying to use. But this isn't a review about the app, and I digress.", "verified": true, "helpfulness": "0/0", "author": "km"}, {"rating": 5.0, "review": "AWESOME bit of home entertainment.... great addition to my choices.", "verified": true, "helpfulness": "0/0", "author": "Gerry Linsangan"}, {"rating": 4.0, "review": "Fire TV Stick + TVMC is a very capable and impressive piece of kit. It's not perfect, WiFi could be a bit stronger, I would love some way to connect USB and the remote feels kinda cheap. That being said I've bought four of these so far, 2 for my home and 2 for family. I got the first one through Prime for $19 and the others during Black Friday week for $25 and at that price point you'd be silly to pass on it. At $39 it's still a pretty solid deal but I'd like to see a price drop in the future to make it a no-brainer.", "verified": true, "helpfulness": "0/0", "author": "GrandFacilitator"}, {"rating": 5.0, "review": "Really amazing. Better than Chromecast by far. Very fast and easy to use", "verified": true, "helpfulness": "0/0", "author": "Jason Harrold"}, {"rating": 5.0, "review": "Very cool. Works great for access to my prime content. Downloaded the remote app for my phone. Great price since I was a prime customer. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Edly"}, {"rating": 5.0, "review": "I am beyond happy with the fire stick. It is awesome", "verified": true, "helpfulness": "0/0", "author": "Donna Collard"}, {"rating": 5.0, "review": "Plugged it in on the weekend. It took us longer to find the password for the wifi then to get going on the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "G. Muenster"}, {"rating": 5.0, "review": "Came swiftly, super easy to install. Just wish Amazon would offer more than the first season of the HBO shows!", "verified": true, "helpfulness": "0/0", "author": "CL"}, {"rating": 4.0, "review": "Not bad, but no HBOgo, Encore, Starz, ABC, etcDoes have Showtime anytime though.The Fire TV has HBOgo, unfortunately, nothing for Fire TV Stick until at least next year.Other than that, this is pretty good and responsive.", "verified": true, "helpfulness": "0/0", "author": "Tofu King Good \"cchen\""}]