[{"rating": 5.0, "review": "Does the job it's supposed to do for a great price. Recommend!", "verified": true, "helpfulness": "0/0", "author": "Sabrina Booth"}, {"rating": 1.0, "review": "TERRIBLE!!!  We had this for a month (and unfortunately missed the return window by 2 days) or I would return it today.  The FireTV Stick EATS through data at an INCREDIBLE rate.  Normal usage for our family before the fire stick is under 100 GB for 2 laptops, 3 ipads, 2 iphones and occasional use of a ROKU, and I even work from home, so I am always on the internet.  Once we added in the Fire TV Stick, our usage maxed out our 300 GB home internet plan.  Completely ridiculous and now not even an option.  Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Toddler Mom"}, {"rating": 4.0, "review": "Got it at the introductory / launch price of $20. At that price, it's worth trying. We're not huge TV or movie watchers, but I like the device. We're using is on a 9 year old Sony LCD TV that only has one HDMI port and pre-dates Smart TVs. So, the Fire Stick makes a relatively dumb TV...\"Smart!\" Used it to watch a couple things on Netflix and a couple Youtube videos now and then. Initially, I had some installation issues. There was a glitch when pressing buttons to type the name of a program in the search field. Letters would repeat rapidly or backspace would erase the whole word. I didn't know how to resolve. Spent ~30 min getting in touch with a warm body at Amazon. Eventually, they suggested I discount and restart it. (I know, I should have tried this on my own. I certainly hear it enough from the corporate IT department at work.) No issues since then. Using it for 10 months now.", "verified": true, "helpfulness": "0/0", "author": "LiveSimply"}, {"rating": 5.0, "review": "I love my Fire TV Stick!  I was looking for a device that I could use to view my prime content, plus Netflix and so much more!", "verified": true, "helpfulness": "0/0", "author": "Jennife L. McClure"}, {"rating": 4.0, "review": "It was just as good as my other Fire TV but more convenient for the tv.", "verified": true, "helpfulness": "0/0", "author": "Lori J. Schooler"}, {"rating": 5.0, "review": "Very cool device. I  don't have a smart tv and was connecting my pc to my tv for many of the fire stick options. The  convenience of it along with the remote has been a welcomed upgrade to my old option.", "verified": true, "helpfulness": "0/0", "author": "daniel birmingham"}, {"rating": 5.0, "review": "I love it I haven't had no problems with it", "verified": true, "helpfulness": "0/0", "author": "giannina"}, {"rating": 5.0, "review": "Fantastic!!!!  We have two Samsung Smart TV's and are using this instead for Netflix streaming.  It does pretty much everything faster - cache, fast forward/rewind/scroll, etc.  I highly recommend getting one of these, we couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Matt L."}, {"rating": 5.0, "review": "easy to use and the Amazon prime exclusives are really good", "verified": true, "helpfulness": "0/0", "author": "Eileen Rae"}, {"rating": 5.0, "review": "Love it. Greatest product I ever used !!! Beats all other devices in the market. I Highly recommend it AAA+++", "verified": true, "helpfulness": "0/0", "author": "Jack naj"}]