[{"rating": 5.0, "review": "I love it  but how do you get a full screen", "verified": true, "helpfulness": "0/0", "author": "Randy A. Lentz"}, {"rating": 5.0, "review": "We are really enjoying this!", "verified": true, "helpfulness": "0/0", "author": "Joan Tinsey"}, {"rating": 5.0, "review": "It is just great! Easy to install, easy to use and lots to choose from.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Drew"}, {"rating": 5.0, "review": "Great Product for the money!  Has 10x the functionality of other streaming devices.", "verified": true, "helpfulness": "0/0", "author": "Mrmopar6"}, {"rating": 5.0, "review": "Works great with our Internet service and I would recommend to a friend", "verified": true, "helpfulness": "0/0", "author": "nathan page"}, {"rating": 5.0, "review": "Easy to use and it is now adding to my viewing pleasure.", "verified": true, "helpfulness": "0/0", "author": "Katharine Burnette"}, {"rating": 5.0, "review": "Love it!!!!It beats paying for cable services.", "verified": true, "helpfulness": "0/0", "author": "J.M.S"}, {"rating": 5.0, "review": "Never had a problem", "verified": true, "helpfulness": "0/0", "author": "Livi0459"}, {"rating": 5.0, "review": "I really like the fire stick for TV. I can enjoy the movies on Prime TV now on the big screen now (v.s. on the computer monitor). I can invite friends to watch the Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Joan Loke \"hula cook\""}, {"rating": 3.0, "review": "I previously had a Chromecast, and was going to buy another one when I saw the Fire TV Stick.  It plays Spotify, gives me my Amazon Prime video, and the usual Netflix, et al.  It looked too good to be true.Sadly, it was.  It does* play all of the things that it says, and I really only have two complaints with it.1) When I'm casting Spotify or other things from my phone/tablet, it doesn't change my TV over to the correct input (which Chromecast does). Annoying, but I can deal with it.2) This one is huge.  Amazon has failed to get an agreement with Comcast for HBO Go.  This means that you can't play HBO Go on your Fire TV Stick if you have Comcast.  It seems like EVERY other cable company subscriber can watch HBO Go on their Fire Stick, but if you're stuck with the LARGEST cable provider in the country, you're screwed.  Fix this, Amazon.  I'm almost certainly going to return one of the two that I bought, and I'm seriously considering returning the second one, too.", "verified": true, "helpfulness": "0/0", "author": "David Raabe"}]