[{"rating": 5.0, "review": "Great little device, love the small form factor and that it delivers on every feature it claims to have. Very responsive controller, overall very happy with purchasing this product.", "verified": true, "helpfulness": "1/1", "author": "Omega"}, {"rating": 5.0, "review": "Easy set up and works great", "verified": true, "helpfulness": "0/0", "author": "Janice Burdick"}, {"rating": 5.0, "review": "Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Stephani K Valencia"}, {"rating": 3.0, "review": "I wish I knew how to find all the channels.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "I truly love this. We watched all the new shows that Amazon has debut. Since we have prime we are never without a movie on a friday or Saturday night.", "verified": true, "helpfulness": "0/0", "author": "Waynetango \"Waynetango\""}, {"rating": 5.0, "review": "Plug and Play setup very easy", "verified": true, "helpfulness": "0/0", "author": "smmmcblack"}, {"rating": 3.0, "review": "My review will be in direct comparison to the full size Fire TV unit, rather than a standalone.Since I've owned the Fire TV, I've been hoping for a smaller, lower cost version that would be perfect for watching media on but not playing games. It's a nice feature to have, to be able to play games from the amazon appstore from time to time, but not my primary focus. And on that front, it's also a bit annoying to have to pull apks and adb air push them up to the fire tv if they were something you bought from the google play store. Obviously there are limitations and licensing issues, and amazon prefers to push their own aap environment, but I know this is a common feature desired by amazon device users across their range of android devices.In the setup department, I found the TV Stick very simple. My one complaint is that, as a person who already owns a Fire TV, I was required to sit through the annoying intro video (3-4 minutes?) rather than just plugging it in, joining wifi, and using it right away. I realize this is a minor complaint, but I think we've all experienced that excitement of opening a cool new item and then having to wait to use it. It's sort of like Christmas as a little kid, where you have to wait, hold up your gift, show it around, and smile for a picture when you just want to rip it open and start playing.For my primary purpose, the fire tv stick works well for streaming media both from web based services, and from local media servers using Plex. Where the fire tv definitely falls short of its big brother is in raw performance. If you have used the very smooth, responsive Fire TV, you will find the TV Stick is sluggish in comparison. It does not respond with the same speed or navigate through menus as quickly as the Fire TV. This is to be expected to some degree as it is lesser hardware and much cheaper. However, I suppose I just expected that there would be some optimization done to ensure a smooth experience. Of note, this responsive issue is actually more pronounced in the amazon menus for app and media spotlights, and less pronounced in apps such as Netflix and Plex. Those are actually very smooth and pleasant, though noticeably a little slower than on the full size Fire TV.In continuation of the weaker hardware, I have also experienced some skipping and stuttering of media from multiple sources, such as Hulu, Netflix, Youtube, Plex. Watching a video in my collection on Plex that I have watched several times, recently, on the Fire TV, had several moments when it stuttered for several seconds on the TV Stick. It does not happen so often as to make things unwatchable, but it is annoying, and it does not occur on the brawnier hardware of the Fire TV.I am hopeful that the slightly underwhelming experience is something that can be managed through software updates to increase efficiency, and think the device is still well worth getting. It is, in my opinion, the best device in its price range, though if you're capable of splurging a bit more for its big brother, I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Neojaql"}, {"rating": 5.0, "review": "Replaced our Chromecast with this. Love the remote control - makes finding movies, TV shows and music much easier.", "verified": true, "helpfulness": "0/0", "author": "sobryan"}, {"rating": 1.0, "review": "I didn't like the fact that nowhere did it identify that if I was a comcast user there would be issues activating the service such as showtime. This is the largest cable company and fire stick doesn't work with it. Had I known I never would have purchased it b", "verified": true, "helpfulness": "0/0", "author": "Edward J. McHugh"}, {"rating": 2.0, "review": "I was really hoping this item would've been an improvement on an already inspired ROKU stick...Instead you have a clunky (needs to be plugged into an outlet power source as well) uninspired streamer—nothing new or exciting to report.Actually, one \"wonderful\" feature is that this stick sometimes forgets your credentials and you have to log back in and watch that stupid cartoon \"how to\" video that takes 15 minutes (I'm not kidding). Seriously, Amazon, add a bypass button for this video...Luckily the price is cheap... But I recommend the ROKU stick over this junk any day.", "verified": true, "helpfulness": "1/1", "author": "JMD \"Minnesota Nice\""}]