[{"rating": 5.0, "review": "Great device.  The interface is very user-friendly and the images are excellent and clear.  I love being able to get to my Amazon Prime catalog.", "verified": true, "helpfulness": "0/0", "author": "Jason Fischer"}, {"rating": 5.0, "review": "We actually canceled our Mediacom service and signed up for Amazon Prime and Netflix and purchased the Amazon Fire TV Stick. We LOVE it!  And, it is SOOOO much cheaper and we can pick what we want to watch, when we want to watch it!  My kids love that they can pause their shows (because chores must be done sometime!).  I would definitely recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "Suzanna Lynn"}, {"rating": 4.0, "review": "Pros: Nice package, compact design, works well.Con: No Browser.", "verified": true, "helpfulness": "0/0", "author": "FishStew"}, {"rating": 5.0, "review": "I have 2 roku's and 2 chromecasts and this tops them both for 1/2 the price as a prime member.", "verified": true, "helpfulness": "0/0", "author": "Lance E Meiners"}, {"rating": 1.0, "review": "I have multiple products like this, and very powerful internet.  This is terrible.  The premise is really good...but when a 7-year old Wii can load and play Amazon Prime Video without having to stall every 2-3 minutes and this can't...then it's not worth the money.  I've tried multiple apps...from Pandora to Netflix to Disney Jr and cannot play anything for more than a few minutes without it having to buffer.  Then, after doing this 2 or 3 times in a ten minute period, the stick just re-starts itself!  It's awful!", "verified": true, "helpfulness": "0/0", "author": "Danielle Logan"}, {"rating": 5.0, "review": "I love this toy!!!bye-bye cable", "verified": true, "helpfulness": "0/0", "author": "steve jarrett"}, {"rating": 5.0, "review": "They could be more clear with the instructions....had to go to youtube to figure it out.  But once you're able to hook it up it's awesome!", "verified": true, "helpfulness": "0/1", "author": "Kelly Solano"}, {"rating": 5.0, "review": "Could not be easier in install. I have no tech skills.First 2 nights of viewing kept me up way too late. This could be a problem.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "having difficulty", "verified": true, "helpfulness": "0/2", "author": "ANNA WADE"}, {"rating": 4.0, "review": "This little stick is great. I just wish it didn't need a whole power adapter to power it.", "verified": true, "helpfulness": "0/0", "author": "nycnic"}]