[{"rating": 5.0, "review": "Love it. Better than cable", "verified": true, "helpfulness": "0/1", "author": "K. Harris \"brown suga\""}, {"rating": 4.0, "review": "Works fine no more c", "verified": true, "helpfulness": "0/1", "author": "Isaac Chanthapaseuth"}, {"rating": 5.0, "review": "Great. Very easy to use and set up.", "verified": true, "helpfulness": "0/1", "author": "Debbie"}, {"rating": 4.0, "review": "The Amazon Fire TV Stick does what it is supposed to do.  The instructions were not good, or clear, for a non-tech person such as myself.  I only got so far with the set-up and couldn't figure out how to get my TV to be \"connected\" to my Wifi.  I was hoping as soon as I connected the Amazon Fire TV Stick it would work, but it did not and it was not clear to me what to do next!  Thankfully my son and daughter-in-law stopped by to get it running and all is good!  Now I hope to check out what is available through Amazon so I can determine if it is worth the money I have to pay in addition to the exorbitant fee that I pay to Comcast for cable TV!", "verified": true, "helpfulness": "0/1", "author": "S. Boucher"}, {"rating": 4.0, "review": "I bought it only for Kodi and it is good device and connects very fast. Only problem I have noticed it is there is no way to exit from Fire stick. Push Play/Pause button for 15 sec is not working and it does not exit the device.", "verified": true, "helpfulness": "0/1", "author": "Ritesh"}, {"rating": 5.0, "review": "Since I received my Fire TV Stick, I've only watched regular television one time. I'm finding myself hurrying through work so I can get back to see what's happened to Mr. Selfridge and while I am working in my house, I can play the music from my playlist so that it's heard all over. This is one of the best items I've purchased in a long long time and I'm eager to continue to discover what all it can do. I've just scratched the surface.", "verified": true, "helpfulness": "0/1", "author": "Southern Lady \"Cheryl\""}, {"rating": 4.0, "review": "We're very pleased with the Fire TV stick and Amazon's library of content. We're considering purchasing another one for our living room TV.", "verified": true, "helpfulness": "0/1", "author": "Pen Name"}, {"rating": 5.0, "review": "Awesome gift to a non tech person", "verified": true, "helpfulness": "0/1", "author": "Lu topher Lu"}, {"rating": 4.0, "review": "I would have given this product a 5-star review, but there was a problem that I have been encountering. First, the connection continuously drops and, in turn causes you to not be able to use it.", "verified": true, "helpfulness": "0/1", "author": "jared"}, {"rating": 5.0, "review": "This is great for any TV that doesn't have wifi connections to movie sources.  We use Fire sticks in guest bedrooms that do not have cable hooked up.", "verified": true, "helpfulness": "0/1", "author": "Jerra Dooley \"jerradoo\""}]