[{"rating": 1.0, "review": "Price is right and it is easy to hookup, but statement: \"Fire TV Stick connects to your TV's HDMI port. It's an easy way to enjoy over 250,000 TV episodes and movies on Netflix, Amazon Instant Video, HBO GO, and Hulu Plus, plus games, music, and more\" - is not finished. Should sadd: \"if you pay 3 to 10 times more than renting at other rental outlets (like Safeway). There is no single movie you can watch for free, always have to either register for monthly payment to Netflix, HBO, Hulu etc.or pay for individual movies. I'm totally disappointed.", "verified": true, "helpfulness": "0/0", "author": "Andrzej K."}, {"rating": 5.0, "review": "Awesome product!!!! Works great. Definitely would recommend!!", "verified": true, "helpfulness": "0/0", "author": "Melissa Judd"}, {"rating": 5.0, "review": "This was easy to set up so we can enjoy watching movies anywhere. I even took the fire stick on vacation and easily hooked it up to the TV there.", "verified": true, "helpfulness": "0/0", "author": "Always Mommy"}, {"rating": 5.0, "review": "It does everything I needed it to do! Access to Prime, Netflix, and Hulu are easy. Just plug it into the tv and go. I do keep the stick plugged into the wall for power as I watch. I've had a couple times where it will pause for a moment, but that may just be my internet.", "verified": true, "helpfulness": "0/0", "author": "Tetra"}, {"rating": 4.0, "review": "I use this in my RV.  It works great wherever we have a wireless internet connection.  Happy I gave it a shot during Amazon's July black-Friday thing (even if most of the deals were lame...this deal worked out!)  If you don't have a smart TV with integrated Netflix or Amazon Prime or a host of other aps....this will work for you.  I haven't seen the Google or Apple products...so can't compare.  But for $25, I'm a happy camper.  *Get it?  I use it in my RV...happy camper.  Get it?Not five stars because the MLB ap doesn't work very good...if Amazon can get MLB to fix that ap, I'd be an ecstatic camper.", "verified": true, "helpfulness": "0/0", "author": "Nate Flint"}, {"rating": 4.0, "review": "Have 2 plus a full blow fire.  Can't beat it. Just needs to add HBO NOW support. -1 star for that.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "My second fire stick.I no longer pay for cable.", "verified": true, "helpfulness": "0/0", "author": "Star"}, {"rating": 5.0, "review": "This was a great get!!!  Very easy to set up, very easy to control.  I like the parental controls a great deal - very easy to understand and adjust!  The major streaming options (netflix, hulu, etc) are  included with the device, and the connection to WiFi is very reliable and stable.  The MirraCast worked perfectly, which makes in-home classes easier, because my laptop identifies it as a second monitor... so does my phone, which makes showing presentations using it easier also.  My phone's aspect ratio translates to the monitor, so it knows if my phone is in landscape or portrait mode, and adjusts correctly.This has been a great addition to our media set-up.  The thing that I'd add to it?  It doesn't connect to bluetooth speakers, which I think is sort of an oversight on Amazon's part.I'd recommend one of these to anyone... we REALLY have enjoyed it!!!", "verified": true, "helpfulness": "0/0", "author": "Jim Besso"}, {"rating": 5.0, "review": "I love Fire TV. I can watch what I want and don't have to deal with commercials.", "verified": true, "helpfulness": "0/0", "author": "Tammy"}, {"rating": 1.0, "review": "it isn't working--it's \"been loading home\" for the past hour", "verified": true, "helpfulness": "0/0", "author": "Mary Panfil"}]