[{"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "Shamu"}, {"rating": 5.0, "review": "Great!!!!", "verified": true, "helpfulness": "0/0", "author": "Chengiz"}, {"rating": 5.0, "review": "easy set up, functions beautifully, very reliable viewing", "verified": true, "helpfulness": "0/0", "author": "S. Hansford"}, {"rating": 5.0, "review": "Easy installation, performs well.  Appreciate not having another box sitting around.", "verified": true, "helpfulness": "0/0", "author": "BillTX \"BillTX\""}, {"rating": 5.0, "review": "I am completely satisfied with my fire sticks", "verified": true, "helpfulness": "0/0", "author": "Stephen Barone"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like the ease of use and have used it in every room.  What I don't like is that unless I have it close to the router, it tends to stall out (buffering).  After waiting a couple of years and finally purchasing it to find out it stalls is a let down,  Other than that its ok... good for rainy days and I'm sure it will be good for snow days as well.", "verified": true, "helpfulness": "0/0", "author": "Helen Rice \"mzrice\""}, {"rating": 5.0, "review": "Excellent product.  Excellent value.", "verified": true, "helpfulness": "0/0", "author": "Moon"}, {"rating": 2.0, "review": "On paper, this device should work like a champ.  In practice, not so much.Unfortunately, FIRMWARE bugs and CHEAP BUILD quality seem to be causing OVERHEATING and CONNECTIVITY issues for many users.CONS:-Screen mirroring is clunky to set up and prone to failure.-Constant connectivity issues for both WiFi and Tablets/Smartphones.-Operating temp. of over 110F seems way too hot, (while room temp. is only 75F).-Requires AC vs USB power supply (USB okay w/Chomecast).-No internet browser  (Casting and browsing okay with Chromecast extension or $99 Fire TV set-top box).-Requires Fire Stick remote for data input (Data input via phone/tablet okay w/ Chromecast).-Laggy delay while Mira-casting makes live gaming (auto racing, RPG) impossible.-UNDER-whelming media search...should include IMDB-style links for quickly finding related content, (actor, genre, etc.).-Overlap in Amazon Prime video sections makes other content cumbersome to find.PROS:TONS of free content for Prime members.Miracasting available via Kindle tablets...until Fire Stick overheats 15 min. later.Complete connectivity to all your Prime media...sort of.The \"media ecosystem\" you're using, (Apple, Amazon, etc.), will help decide which Media Stick is right for you.An abundance of bugs indicates this device was rushed to market.  So far I have additional out-of-pocket expenses for a Wi-Fi extender plus an HDMI coupler and cable.Fortunately, Tech Support team has offered a replacement stick...So, we'll see.", "verified": true, "helpfulness": "0/0", "author": "Michae! \"Michae!\""}, {"rating": 5.0, "review": "Love Fire TV Stick!  Has worked well from the moment I took it out of the box!", "verified": true, "helpfulness": "0/0", "author": "Felicia Davis"}]