[{"rating": 5.0, "review": "Great little stick, plugged right in to the open hdmi port I had open setup was a no brainer I mean 0 brains required", "verified": true, "helpfulness": "0/0", "author": "Jaspervan"}, {"rating": 5.0, "review": "You'll need a fast internet connection, a free HDMI port and a power outlet.We \"cut the cord\" 14 months ago and regretted losing access to some programming.The FireStick TV has removed all regret. We will never go back to cable and those  $120 per month bills.If you are a cord cutter or just seeking alternate sources of programming, this little device is a giant leap in the right direction.", "verified": true, "helpfulness": "0/0", "author": "M. Sanders"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Holli Keith"}, {"rating": 5.0, "review": "The Fire TV Stick is very simple to install and very simple to use.  The HDMI extension cord works very well as a WiFi antenna, i.e. you save yourself money because you don't need any HDMI cord.  I like to see Amazon have more FREE apps for the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Bill Lee"}, {"rating": 5.0, "review": "High quality product. Very fun, I enjoy that. I have a lot of options.", "verified": true, "helpfulness": "0/1", "author": "João Wagner Lopes de Oliveira"}, {"rating": 5.0, "review": "Just great!", "verified": true, "helpfulness": "0/0", "author": "jeremy register"}, {"rating": 5.0, "review": "Fantastic,works great and lots of movies ......", "verified": true, "helpfulness": "0/0", "author": "Bill K."}, {"rating": 5.0, "review": "I absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Brieanna Wimmer"}, {"rating": 5.0, "review": "Amazing! I was able to set it up within 5 minutes and have had no problems yet. It makes streaming and downloading my favorite movies and TV shows so easy! I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "ABN"}, {"rating": 5.0, "review": "The game apps are lacking, so for now, I would not bother with the extra game pad. But I personally don't play games on it, so no big deal to me.It does work very well with Sling TV though and was my main reason for the purchase.", "verified": true, "helpfulness": "0/0", "author": "Dennis R."}]