[{"rating": 4.0, "review": "Honestly I have a crappy ISP. Without the ability to lower the quality of the amazon prime streaming I pretty much stick to Netflix. The ability to listen to my prime music is a plus.", "verified": true, "helpfulness": "0/0", "author": "Troy Blatchford"}, {"rating": 5.0, "review": "Works great . Easy to use", "verified": true, "helpfulness": "0/0", "author": "PIERRE SOELCH"}, {"rating": 5.0, "review": "Seems to work great !!!  And Amazon bent over backwards to help when there was a problem with shipping !!!", "verified": true, "helpfulness": "0/0", "author": "Norm Brooks"}, {"rating": 5.0, "review": "I love this Fire stick I already had prime and was watching movies on my iPad the movies are great on my 46 in TV so easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Jen \"Jen\""}, {"rating": 3.0, "review": "Love that it is the same price as the google chrome but comes with a remote. The only reason I gave it three stars is because mine loses internet connection a lot (and no its not my internet). Dont know if maybe i got a defective one.", "verified": true, "helpfulness": "0/0", "author": "Kyle C."}, {"rating": 4.0, "review": "Fire Stick gives me the assess I was looking for and is easy to install and use:  however, I am not am not satisfied with the operation of the remote.  I find it more difficult to go forward or back and stop on or near the right place than it is with other remotes.  I have not found a reasonably-priced remote with which to replace it.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Sooooo easy to use and set up! Love how the apps make it even better. I have both the Chromecast and this Fire TV Stick, I much prefer the Fire TV Stick! You can still cast from your device, but you do not have to!!!! You can use the apps available through the Fire TV Stick and do not have to tie up your phone at all! Netflix, story apps, Photos and sooooo much more! Love the remote that came with it! It even has an app for your phone that can be used to control it! So happy with this purchase! And my husband has admitted that he likes it better than his Chromecast! If you are debating between them, I recommend the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Day"}, {"rating": 3.0, "review": "Despite having a cleaner GUI than the Chromecast, I've experienced video playback issues with Netflix and Hulu Plus. Random intermittent gray screen for a few seconds has been annoying. Problem are not resolved by plugging directly into TV, I'm lucky that it works through my receiver. Additionally, I have not been able to fully experience the full range of audio with the device's limited functionality with receivers.", "verified": true, "helpfulness": "0/0", "author": "Jacob B Gardner"}, {"rating": 1.0, "review": "what a pile of crap.  i have both the fire tv and the fire tv stick and the firetv stick is total junk.  after  installing it and connecting it to my network and downloading and installing the update it will no longer connect to my wireless network.  amazon you have one pile of s*** here.", "verified": true, "helpfulness": "0/0", "author": "pap"}, {"rating": 2.0, "review": "It worked 2 times then nothing!", "verified": true, "helpfulness": "0/0", "author": "Smilin Jack"}]