[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "James Brooks"}, {"rating": 4.0, "review": "A great device for those who do not have a smart tv and are tired of watching movies on just the iPad!", "verified": true, "helpfulness": "0/0", "author": "C. Vincent \"Beagle60\""}, {"rating": 5.0, "review": "Works great!  We used to use a Chromecast and and android tablet, but this is faster and easier to navigate and especially pause the show.", "verified": true, "helpfulness": "0/0", "author": "Roy Child"}, {"rating": 5.0, "review": "I absolutely love the Fire stick and I'm thinking about dumping my cable company now. It was so easy to install and has endless things to watch on TV. Unlike the cable company that either plays the same movies all the time or old movies I wouldn't want to see after the original screening.", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Gorman \"Patti\""}, {"rating": 5.0, "review": "Love it!  Getting another one to put in the guest room. Better and cheaper than oaying for minthly service when the room is empty most of the time.", "verified": true, "helpfulness": "0/0", "author": "tkl"}, {"rating": 1.0, "review": "I was disappointed.  the streaming is fine but picture is blurry or fuzzy on my HD TV.  I have tried everything.  No help from Amazon to resolve this- they seem not to recognize this as a problem but it seems others also have encountered it.", "verified": true, "helpfulness": "0/1", "author": "Leslie L. Cooney"}, {"rating": 4.0, "review": "I would have enjoyed the voice remote as standard with the fire stick.  I realize you can buy it separately, but standard would have been a better option.", "verified": true, "helpfulness": "0/0", "author": "Krisla Peterman"}, {"rating": 5.0, "review": "it was very easy to install. works as advertised. i cant bbelieve i waited so long to get the fire tv stick.", "verified": true, "helpfulness": "0/0", "author": "harley g newton"}, {"rating": 5.0, "review": "Worth every penny!", "verified": false, "helpfulness": "0/0", "author": "Vincent"}, {"rating": 5.0, "review": "Easy to intall", "verified": true, "helpfulness": "0/0", "author": "Dona Edens"}]