[{"rating": 4.0, "review": "for the price of 20$ it is decent enough, need better youtube integration and search functions", "verified": true, "helpfulness": "0/0", "author": "spark"}, {"rating": 5.0, "review": "Excellent and much more affordable than competitors.  Highly recommend the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Jilly"}, {"rating": 4.0, "review": "The only reason I am giving it four stars is because Amazon will not sell this device to me for some crazy reason. I got Chromecast and Roku stick without problems at all from Amazon, how can Amazon refuse to sell their own product? The firestick is superior to all those,no matter I paid overpriced to a reseller. I have popcorn hour, wd live, chromecast and roku.I will like to have another one from Amazon.", "verified": false, "helpfulness": "0/0", "author": "Velderve"}, {"rating": 4.0, "review": "Versatile and easy to use. But a bit lagy seeming underpowered.", "verified": true, "helpfulness": "0/0", "author": "Vic"}, {"rating": 5.0, "review": "ABSOLUTELY THE BEST STREAMING STICK AVAILble", "verified": false, "helpfulness": "0/0", "author": "Steven Macias"}, {"rating": 4.0, "review": "Really good.", "verified": true, "helpfulness": "0/0", "author": "Bee Her"}, {"rating": 2.0, "review": "Poor picture quality", "verified": false, "helpfulness": "0/0", "author": "yichi xu"}, {"rating": 5.0, "review": "This device is incredibly smooth and fast for a stick device and in addition to having all the wonderful amazon apps and additional content you can even side load other android apps on it as well.", "verified": true, "helpfulness": "0/0", "author": "Brosh"}, {"rating": 4.0, "review": "So far so good! I love this thing. I have access to Netflix, crackle, prime, and so much more right on my TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I never go around to finding a cable to hook my kindle fire tablet to my television, so I was left watching shows on my kindle (only good for one person) or thru the wii (which wasn't good quality and would pause).  This works so much better.  No trouble at all installing and registering my Fire TV Stick.  Very easy to use and the video quality is very good.", "verified": true, "helpfulness": "0/0", "author": "J. M. Ziegler"}]