[{"rating": 5.0, "review": "So awesome having so much streaming capabilities at my fingertips", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 2.0, "review": "Love it exept alot pf yimes it dont want to connect to wifi. Weak pitcure.", "verified": true, "helpfulness": "0/0", "author": "johnny mccarter"}, {"rating": 5.0, "review": "I love this device. It make watching TV so much nicer!", "verified": true, "helpfulness": "0/0", "author": "Cassie Asako"}, {"rating": 4.0, "review": "Product is okay. Exactly as advertised.", "verified": true, "helpfulness": "0/0", "author": "Dean"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy set up and easy to use. Been working great since I bought it.", "verified": true, "helpfulness": "0/0", "author": "Richard I. Dimick \"Ian\""}, {"rating": 5.0, "review": "The FireTV Stick is great! It is ideal for Prime members and cord cutters!", "verified": true, "helpfulness": "0/0", "author": "A.J. Kowalewski"}, {"rating": 4.0, "review": "I like it but the searching for movies  could be improved. I think it will get better as Amazon has more access to more movies. The access to series is pretty  good though.", "verified": true, "helpfulness": "0/0", "author": "CLM \"far away daughter\""}, {"rating": 5.0, "review": "Simply, amazing. Perhaps the best 39 dollars I've ever spent. Only complaint is that some apps do lag a bit from time to time, but that can be easily fixed when I upgrade to fire tv soon.", "verified": true, "helpfulness": "0/0", "author": "DL"}, {"rating": 4.0, "review": "This is a great device to have in your household if you are looking to move away from cable. With the Sling TV app, you get a very good selection of major cable stations plus news and the ability to watch HBO. I'm also a Prime member so I have easy access to TV shows with the Fire TV. It easily buffers what it thinks you are going to watch so you have instant access to you video. I took one star off because it can be easy to accidentally press the wrong button while watching something and end the video. Also, if you are streaming Sling TV for a few hours, it will go to sleep on you and can be a slight hassle getting back to your channel. Don't buy the Roku when you can get this for less and have virtually the same apps and videos plus its more powerful in hardware.  Easy $40 i ever spent without any regrets. Can't wait to try it out in a hotel!", "verified": true, "helpfulness": "0/0", "author": "Eric J. Holland \"bokeypunk\""}]