[{"rating": 5.0, "review": "Nice purchase got free when ordered sling tv", "verified": true, "helpfulness": "0/0", "author": "chuck blackmon"}, {"rating": 5.0, "review": "I absolutely love it.  I've been watching movies since I received it.  The only one small thing is I was surprised that it has to be connected electronically.  I've not seen a USB that needs to use an electrical socket.  I had to connect it to an extension cord.  That's my only, only thought. Other than that, I recommend the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Brenda J. Spicer"}, {"rating": 5.0, "review": "well worth the purchase", "verified": true, "helpfulness": "0/0", "author": "kim"}, {"rating": 4.0, "review": "I like the stick because it doesn't take up much room. We have both the stick and fire tv. My complaint is that it freezes up alot. This happens with both the stick and tv so it's not just an issue with one. Its nice to have though.", "verified": true, "helpfulness": "0/0", "author": "D. Blackburn \"Dawn B.\""}, {"rating": 5.0, "review": "We enjoy it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm in love with it! It was also a breeze to install!", "verified": true, "helpfulness": "0/0", "author": "Julia Freeman"}, {"rating": 5.0, "review": "Great product. Fast response", "verified": true, "helpfulness": "0/0", "author": "mauricio parodi"}, {"rating": 4.0, "review": "I like this a lot. Just wish that it could be controlled by Amazon Echo. There are times when it acts funny and videos just stop at 2 seconds and the main menu opens. This happens several times in a row then eventually stops. I don't know what the cause is and it is not very common, but can be annoying. I like that when searching for a video that Hulu is included in the results as well as Amazon offerings. That is nice. Video quality is very good too. I still have chromecast for google play videos, ultraviolet, and casting of my laptop screen. Thankfully I have enough HDMI ports.", "verified": true, "helpfulness": "0/0", "author": "Jim Raynor \"Vaio CW guy\""}, {"rating": 5.0, "review": "I love it..", "verified": true, "helpfulness": "0/0", "author": "Donna McElroy"}, {"rating": 5.0, "review": "This device relegates Chromecast to the dust bin of history.  You no longer need to run TV apps through your phone.  People can access a TON of TV shows, movies, music, etc. directly from the stick.  You can take your phone with you while folks at your home can watch TV.  Also, with the stick, there is virtually no reason to continue to spend $75/mo on satellite or cable TV.  I love the stick!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Cloudcroft Girl"}]