[{"rating": 5.0, "review": "Still in the learing stage, so far ok. Lot to learn about web sight", "verified": true, "helpfulness": "0/0", "author": "Paul M. Huffines"}, {"rating": 5.0, "review": "I was hesitant to buy a wireless video device for my master bedroom but the fire tv stick was a piece of cake to setup and it found my wireless network the first time. Now I can stream netflix to my master bedroom or just about anything for that matter. If you have an extra tv setup in a bedroom don't add a cable box and pay the cable company more money just add a fire stick and give guests something different to watch.", "verified": true, "helpfulness": "0/0", "author": "Michael Asher"}, {"rating": 2.0, "review": "Sadly, VERY sadly disappointed.  We live in a rural area with very low download speed (about 1.5 Mb per second.)  Movies or TV episodes constantly buffering, and it does no good to pause and try to build up time that way (a trick that works on our Apple TV.)  I called Amazon, a pleasant enough experience, but was told that Amazon prime requires a minimum of 2 Mb per second.  Most people would have no trouble with that but we live in a remote area and are lucky to have even this slow DSL connection.  I was told if we turn off the WiFi to our tablet and to our computer that may help.  Will be trying that, but relying on Apple TV for now.", "verified": true, "helpfulness": "1/1", "author": "T. Janke"}, {"rating": 2.0, "review": "As of right now, I am disappointed but hopeful.  I was so excited to start using the Fire Stick but I hooked it up (super easy), tuned to the correct input on my TV (a little harder but easy enough to figure out), and then.... Nothing.  Just an Amazon logo that flashed and went away.  Tech support was super helpful and efficient and they are sending a new Fire Stick.  My experience dealing with Amazon has been awesome but the bottom line is that the product didn't work when I received it.  But I am hopeful that once it does work it will be great.  We'll see....", "verified": true, "helpfulness": "0/0", "author": "Stephanie Franek"}, {"rating": 5.0, "review": "Easy to operate", "verified": true, "helpfulness": "0/0", "author": "Carole C. Pilgrim \"Mrs. P:)\""}, {"rating": 1.0, "review": "When it works, the Fire Stick is fantastic. However, it is designed to go into sleep mode after 30 minutes of inactivity. That's fine with me, especially since my children never turn anything off. The major problem is that the Fire Stick won't wake back up. I spend each time I want to watch my shows troubleshooting and getting frustrated because it won't wake up. If Amazon can fix this problem or put an on/off switch on it, the product will be great. As it is, I can't even use it.", "verified": true, "helpfulness": "1/1", "author": "Jason Russell"}, {"rating": 5.0, "review": "LOVE IT! Use my fire stick frequently. Have a smart TV that is constantly rebuffing, use the Fire Stick in place of the Smart TV and have no problems. I bought 2 extra for gifts and the recipients are pleased with their Fire Sticks as well.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "What a piece of s***. I got it, set it up, watched 2 movies, and the remote went to hell. Won't accept commands, and when it does decide to work, the cursor just bounces around the screen. I'll be returning this waste of money- Don't waste your time. I'll check out Chromecast to see if i have better luck.", "verified": true, "helpfulness": "1/1", "author": "Chesley White"}, {"rating": 5.0, "review": "beautiful design and easy to use.", "verified": true, "helpfulness": "0/0", "author": "mikem"}, {"rating": 5.0, "review": "WOW!!!! Great Product... now I don't need cable.. Thank You Amazon", "verified": true, "helpfulness": "0/0", "author": "Patty R"}]