[{"rating": 5.0, "review": "I love this Five TV Stick", "verified": true, "helpfulness": "1/1", "author": "T. Vo \"tvo\""}, {"rating": 4.0, "review": "Easy to set up, I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Ro"}, {"rating": 2.0, "review": "The feature are quite nice for the price, especially since I got it for the introductory price when it was $19. It worked fairly well when I got it but that didn't last long. At first button presses would move in a direction long after I let go. So I couldn't tell if that was a problem with the remote or the device. Recently, it has a problem either keeping connection or has to buffer often. Other times, the picture is grainy.Before anyone asks if it could be my internet connection, it isn't. Right at this moment while watching Netflix, I was annoyed by the buffering and freezing, I turned it off and switched to my Xbox 360 and the same show is playing fine. I also have another TV that is a smart TV along with an Xbox One and all play/work great. The same is true of my computer and phone running off the same Wi-Fi connection.I can't be too upset since I didn't pay much and when it works occasionally, it's nice and I like the Prime music app on there. However, even for the fairly low price of $39, if it has the same issues as mine, I couldn't recommend it.", "verified": true, "helpfulness": "0/0", "author": "coasterlove"}, {"rating": 4.0, "review": "Easy to use and set up. If I can set it up anyone can! I like the parental control that it has on it so that my daughter doesn't \"accidentally\" pay for something without me knowing. I got this to replace cable. So far so good. We like it.", "verified": true, "helpfulness": "0/0", "author": "Valerie"}, {"rating": 5.0, "review": "So great! Love it!", "verified": true, "helpfulness": "0/0", "author": "MamaB"}, {"rating": 3.0, "review": "doesn't work without more bandwidth....", "verified": true, "helpfulness": "0/0", "author": "Brenda Heyward"}, {"rating": 5.0, "review": "love!", "verified": true, "helpfulness": "0/0", "author": "Evelyn, NY"}, {"rating": 1.0, "review": "I hate this thing.  I have the fastest internet offered to residential customers by my cable company and all other devices work fine on my WiFi including the Fire box, but not the stick.  Everything I watch \"stutters\" multiple times throughout.  All selections made take a while to go through and you can press the home button, get up and go to the bathroom, and it will just be coming up when you return.  Maybe some are faster, but for us this thing is more of a headache than anything else.", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 5.0, "review": "I am thrilled. Thank you again Amazon. Can't wait to get the game remote so I can play my game from the big screen.", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "Works great - son loves it.  Easy to set up and use.  Also makes it very easy to purchase movies on Amazon prime if you aren't careful (which is why we gave it to our son as I knew I'd end up spending too much on movies so we went back to using just net flix :)", "verified": true, "helpfulness": "0/0", "author": "country girl"}]