[{"rating": 5.0, "review": "We love this!  Setup was a breeze, and it works like a charm, exactly as described.  It's far, FAR better than Chromecast in every way.  About to buy another right now!", "verified": true, "helpfulness": "0/0", "author": "William T. Prince \"William T. Prince\""}, {"rating": 3.0, "review": "Pros:Easy to setup...check. Took longer to enter my wifi security then setting it up. Walks you through the setup once connected very simply.Nice interface..check. Especially with the free Android apps for remote with Voice search. also a much better Netflix interface than I have on my TV and BluRay player.Selection on Prime...good. Makes nice balance between Netflix and Prime. Being able to rent streamable movies is definitely  nice plus over NetflixCaveat,:Takes a lot of your bandwidth. When I called support, they recommended I bump up my speed with my ISP, which is 12 Mbps already.You will need a power outlet to use. I knew this, but for folk with a wall mounted TV, good to know.Cons:After watching for a few hours, I consistently get  message that there's no internet. Having been a net admin, I know what to check, and the stick is the only thing in my network that an't connect to wifi. I'm currently running a 2.5Ghz 11N network. Support recommended a 5ghz network, which I'm going to try out with some spare  equipment, segregating the stick to the 5ghz spectrum, but that'll be later this week. Support aid they'd call back after they walked me through resetting the stick (it was pre-configured when I got it) to see of it helped with the dropouts, but it and they didn't. To get the internet  back, I have to unplug the power to the stick, wait a few seconds and plug back in. Doing nothing too the network, it connects right back up. i'm wondering if it's a memory issue or hardware. The TV is a three year old Samsung, and haven't had problem with it on any other plugins, Internet's stable, and have had zero issues with connections or speed at all. and Prime video works flawless;y on all our pcs.If the network drops can get resolved, I'll bump the rating up to a 5 star as that's the only real problem I have with it. Everything else about the product is incredible.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"O'Boise\""}, {"rating": 1.0, "review": "Didn't work for me, everything I want to watch I can get over the internet.Haven't  got the refund yet even though my account detail says I have.", "verified": true, "helpfulness": "0/1", "author": "Bruce Pettersen"}, {"rating": 5.0, "review": "No complaints at all. Love it. Works great with Netflix, but really great for Prime users.", "verified": true, "helpfulness": "0/0", "author": "NortheStar \"Out of the Clear Blue Sky\""}, {"rating": 4.0, "review": "Works pretty well. Previously, I had used my blue ray player with Wi-Fi to get connected to my favorite movies & TV shows online.  However, most of the time I would repeatedly experience interruptions when the program paused to buffer (FYI, I use Verizon Fios).  It was very annoying.  The Fire TV stick cut back on these interruptions by 90 to 95 percent.  The only slight negative discovered to date is when I plug in the Fire TV stick, I must unplug my TV antenna's electrical booster.  This is not a serious problem because I only need the TV antenna to receive digital signals from the air to watch TV and when I am finished watching online I simply unplug the Fire TV stick and plug in the TV antenna booster.", "verified": true, "helpfulness": "0/0", "author": "Michael S. \"Michael S.\""}, {"rating": 5.0, "review": "This is perfect if you have no cable. You can see all of the current tv shows as well as movies and it has Netflix. The UI is very smooth too. The Voice function is a bit hanky but I'm sure Amazon will refine that with time. I don't use the voice feature anyway.", "verified": true, "helpfulness": "0/0", "author": "J. GODFREY"}, {"rating": 4.0, "review": "The Fire TV stick is really neat, I like that i can listen to my amazon music through my TV and they have it set up to where you can read the lyrics to the song as well. It is really easy to use too. The only downside is it doesn't load the movies/tv shows very fast. some days it's great, and some days it buffers every few seconds. This could be because of my internet connection but then I use my laptop and it has better connection. So unless your internet connection is perfect, maybe go for the Fire TV box instead.", "verified": true, "helpfulness": "0/0", "author": "Lia"}, {"rating": 3.0, "review": "At times when it's been on for awhile it seems to cut out or pause.  I have the fire box as well and it doesn't do that at all.", "verified": true, "helpfulness": "0/0", "author": "Heather Ricketts"}, {"rating": 5.0, "review": "The fire stick is great. It is very easy to use with the remote control and makes watching Amazon Videos a breeze.", "verified": true, "helpfulness": "0/0", "author": "canonphotos"}, {"rating": 3.0, "review": "I have no idea why this seeminly simple device is so poorly developed. Ostensibly this is a competitor to the Chromecast. It's just amazing how much more horrible a product it is. The remote control", "verified": true, "helpfulness": "0/1", "author": "Rob Dillon"}]