[{"rating": 5.0, "review": "I love this device.", "verified": true, "helpfulness": "0/0", "author": "B. Fisk"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Michele Burton"}, {"rating": 1.0, "review": "It overheats and is constantly buffering. A 30 min show takes an hour and a half to watch", "verified": true, "helpfulness": "1/1", "author": "sara studer"}, {"rating": 5.0, "review": "Great. Fast remote. I used it to see my favorite Arabic channels through kodi.", "verified": true, "helpfulness": "0/0", "author": "Almuthanna"}, {"rating": 5.0, "review": "Raved review", "verified": true, "helpfulness": "0/0", "author": "Famous Smith"}, {"rating": 3.0, "review": "Limited to the supported apps and a bit slow to response after running for awhile.if I didn't get it for free, I probably wouldn't have bothered with it, still happy with using my chrome cast instead", "verified": true, "helpfulness": "0/0", "author": "Josh85JC"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Juan Carlos Vazquez"}, {"rating": 5.0, "review": "I have this on my bedroom tvs and it is smaller but just as good as the living room Amazon fire.  And you don't need the voice remote because you can put an app on your phone and Control the fire and sticks", "verified": true, "helpfulness": "0/0", "author": "Cathy"}, {"rating": 4.0, "review": "I really like using this product. It's so much easier than trying to stream Netflix, YouTube, etc. from my computer through the HDMI cables. It's a nifty little gadget. Makes my life easier. The streaming quailty is comparable to using a computer (just make sure your internet connnection is up to speed). Can't beat the price too. I would reccomend for anyone that wants to stream movies, tv shows, music, etc. for a resonable price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was exactly what was promised worth the price and some and the seller was very helpful providing his contact info if I had questions or help overall great buy!!", "verified": true, "helpfulness": "0/0", "author": "mounir belrhitri"}]