[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "samuel masaniai"}, {"rating": 5.0, "review": "Love this fire stick! I like that I can watch cable channels and I'm not stuck to a contract with a cable or satellite company and I cancel when I want, and still have the luxury of Netflix and the Internet all in one little piece that I can move from room to room when I want to!", "verified": true, "helpfulness": "0/0", "author": "Shantel"}, {"rating": 5.0, "review": "Great item. Should have gotten one months ago. Very happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "ELAINE HOM"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Barry Spates"}, {"rating": 5.0, "review": "I love this thing. I only had to call Amazon help desk once to get it working correctly (I am quite illiterate when it comes to electronics and they were super helpful). We can play games, access our Netflix and HBO Go, as well as Amazon Prime choices. We NEVER use our cable anymore!!! The DVR has become a lonely screen that we only look at when its a season premier.I HIGHLY recommend. We are taking it in our camper for Memoral Day and will try to use it at the campground!", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 4.0, "review": "I have only had for a couple week, thus the 4 and not 5 star rating....I am still getting used to it and who knows the rating might change to 5 stars!", "verified": true, "helpfulness": "0/1", "author": "Olenge"}, {"rating": 5.0, "review": "I love it so much, I even brought a 2nd one for my mom's", "verified": true, "helpfulness": "0/1", "author": "Bi-'Shella Sheppard"}, {"rating": 3.0, "review": "remote should be like a pointer, not conventional .", "verified": true, "helpfulness": "0/1", "author": "vvk"}, {"rating": 5.0, "review": "easy to use and provides access to many forms of entertainment", "verified": true, "helpfulness": "0/0", "author": "Frank Hildebrand"}, {"rating": 5.0, "review": "works amazing well.", "verified": true, "helpfulness": "0/0", "author": "J. Sun"}]