[{"rating": 4.0, "review": "It has worked perfectly since we got it", "verified": true, "helpfulness": "0/0", "author": "Len Rothenberger"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Lara A. Steelman \"Lara Steelman\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Robin F."}, {"rating": 4.0, "review": "Love my fire tv stick!Got a student prime membership but I expected alot more free movies, bust most are just rentals.plus it hasn't conceited to my WiFi lately and every other device in my house doesn't have any trouble. But I recommend  this device", "verified": true, "helpfulness": "0/0", "author": "Chalin Lockhart"}, {"rating": 5.0, "review": "We received the Fire TV Stick a few days ago...Very user friendly/easy to hook up.  We haven't used it for very long yet, but so far we are very impressed!  I feel that you do need to subscribe to Amazon Prime to get full benefits.  We have Netflix and Prime and so the possibilities seem endless.", "verified": true, "helpfulness": "0/0", "author": "susan darnell"}, {"rating": 5.0, "review": "Affordable alternative for people like myself who are tired of the extortionate fees charged by cable and satellite companies. Menu is easy to navigate and has plenty of choices.", "verified": true, "helpfulness": "0/0", "author": "Adam D."}, {"rating": 1.0, "review": "Returned to store after a week. Most channels require a cable provider. I personally bought the amazon to avoid cable. My household uses hulu and netflix for tv shows. During each 20 minute show it would skip at least once. Also, the controller would go crazy while searching or navigating the menu. It seemed to get stuck in one position.", "verified": true, "helpfulness": "0/0", "author": "Pamela Ochoa"}, {"rating": 5.0, "review": "Combined with apps such as Netflix and Sling, this makes for a perfect replacement for cable at a fraction of the cost. Connection speed hasn't been an issue at all. I love this thing and won't be going back to cable anytime soon.", "verified": true, "helpfulness": "0/0", "author": "Anand Kanwar"}, {"rating": 4.0, "review": "This is an excellent product that is worth the $39 it costs. There is one big problem with it, however, that makes it almost a 5 and not a 5. The problem is that Amazon's services are treated as a first class citizen on the device, but to play content from a competing service such as Netflix requires locating an app in a menu that is not well organized and then selecting it. It would be better if they could have some mechanism for either manually organizing apps by type or by allowing all content from all services that the customer is subscribed to appear in the various categories. That is, I'd like to see Netflix and Hulu programs intermixed with Amazon programs. I really don't care where my content comes from as long as I can play it.As for the positives, the remote is nice. Being able to control the device from the phone is nice. It can play a wide range of content and even some games. All in all, I'd recommend it, but hope that Amazon can fix the UX.", "verified": true, "helpfulness": "0/0", "author": "Jason W. Thompson"}, {"rating": 4.0, "review": "works fine", "verified": true, "helpfulness": "0/0", "author": "Robert Maneer"}]