[{"rating": 5.0, "review": "The Amazon Fire Stick found Me!  Always get the emails and advertisments that are catered to my buying, and this one got me.  Had never heard of the product.  Was somewhat dismayed  with Amazon prime because it was not compatible with Apple TV and was told I needed to purchase a ROKU player thru amazon in order to stream any movies thru my television.  I said \"Heck with that\".  Low and behold I wait a year and a half and Amazon comes out with The \"Fire Stick\".  Lucky enough for me I had a Best Buy gift card that I had to use up, but when I got to best buy and asked the tech what he thought about the Fire Stick.....He raved about it........I figured I had nothing to lose...I bought it.  To say that it was a snap to set it up is an understatement.  This thing Rocks!  Rocks I say!  Easy set up and start watching movies with full surround sound.  If you don't have one...Get it now!", "verified": true, "helpfulness": "0/0", "author": "joy"}, {"rating": 1.0, "review": "I'm sure it would be great if I had Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Christie"}, {"rating": 5.0, "review": "Works great.  Finally able to watch movies in s room that has poor wireless connection due to a brick exterior wall in our game room.  Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Ljport"}, {"rating": 5.0, "review": "Love it! So easy to set up😄", "verified": true, "helpfulness": "0/0", "author": "Patticake"}, {"rating": 5.0, "review": "Great product! I have both chromcast and Fire stick and I like the fire stick better. There are more options of things to use with it over chromcast.", "verified": true, "helpfulness": "0/0", "author": "Jason kelechi"}, {"rating": 5.0, "review": "This little stick is amazing!  $39 for what it does? I got it for our living room tv. I had a Roku box.  With Roku Netflix was always interrupted.  You still do get some buffering from time to time on the Fire Stick, but nothing like the Roku and the Fire stick recovers A LOT faster!  I got both my daughters Roku sticks for their bedrooms before this purchase and I wished I got them the fire stick.  The roku sticks were more $$$ and not as good!  Amazing product, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Victoria Flynn"}, {"rating": 3.0, "review": "It is constantly buffering and it takes way too long! It is very annoying.", "verified": true, "helpfulness": "0/0", "author": "Joan ONeil"}, {"rating": 1.0, "review": "Worked great for a week, now Hulu and hbo go are glitchy, and the games randomly stop working", "verified": true, "helpfulness": "0/0", "author": "James gleckner"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Lilian"}, {"rating": 5.0, "review": "Love it in every way!", "verified": false, "helpfulness": "0/0", "author": "Arthur Barnes"}]