[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Felix Baham Jr"}, {"rating": 5.0, "review": "AWESOME PRODUCT!", "verified": true, "helpfulness": "0/0", "author": "Chance"}, {"rating": 5.0, "review": "Love this thing. I have Amazon Prime, so there are lots of free movies to watch. Haven't even started on the tv shows available.", "verified": true, "helpfulness": "0/0", "author": "Lauren Cook"}, {"rating": 5.0, "review": "Love it. Super easy and exactly what I needed it. Made my not smartTV a smartTV!", "verified": true, "helpfulness": "0/0", "author": "Claudiab"}, {"rating": 3.0, "review": "I've had an older Roku 2, (passed that on to my girlfriend) I also own a chromecast and a PS3  The fire tv stick is pretty great. however...Pro'squickeasy to use slick interface (except for new apps search ::see below::)Small and portable... was able to just throw it in my bag to take it with me when visiting familyLove that it includes a remote (unlike the chromecast) So i don't have to have my phone around to use it.Con's  (fix these issues and 5 stars all the way)Searching for new apps is not intuitive.  They have a featured apps section and a new section.. but i just want a list of apps in alphabetical order so i can see what you have, maybe a \"by catergory\" section as well.  Did i miss something? because i had trouble finding some of the apps that are listed in the advertisement.Youtube app \"casting\" from phones, computers, tablets .. does NOT work.  it pops up a youtube symbol like all my other devices as if it's about to load (the device casting thinks it's playing or about to play on the fire tv) but it just doesn't.  It goes back to the regular youtube screen.  For now my work around is to play the item in question for a few seconds on the first device and then reload the history section on the fire tv so I can play it on the tv.  Annoying ... all my other devices work beautifully for that.  I love being able to throw stuff on the tv when showing it to friends. And they can do the same so long as they are logged on the same network. Now only I can do it with my work around as both the fire tv and your other device has to be logged into the same youtube account.No HBO Go ... prolly would still give it 5 stars without this.. def 4 stars if they fix the other two.  I know i know.. spring.. but come on!", "verified": true, "helpfulness": "0/0", "author": "Daniel R. Gonzalez"}, {"rating": 5.0, "review": "We love our Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 3.0, "review": "Choppy streaming and not as much content as expected.However easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Henry Swain"}, {"rating": 3.0, "review": "Still having issues of the picture on the VIZIO TV my daughter purchased for me for Christmas, pulsating when there is words on the screen.  I do not have any pulsating issues on the Samsung TV's at all.", "verified": true, "helpfulness": "0/0", "author": "Jennice L. White"}, {"rating": 5.0, "review": "Arrived in the mail yesterday - took less than 10 minutes to open the package & plug into TV.  Super easy set up & since I am a faithful Amazon Prime user, this is the best way to get shows/movies to stream to your TV rather than just on your mobile device.  For the price, you cant go wrong.", "verified": true, "helpfulness": "0/0", "author": "tlv15"}, {"rating": 5.0, "review": "VERY NICE PRODUCT", "verified": true, "helpfulness": "0/0", "author": "STEVE"}]