[{"rating": 5.0, "review": "Great little stick.  The setup was a breeze and it works well with the services I'm subscribed to.", "verified": true, "helpfulness": "0/0", "author": "Miss"}, {"rating": 5.0, "review": "I was able to purchase one of these very early.  It's been in use a few weeks now and everyone in the house loves the new Fire TV Stick.  They actually fight over the remote. Poor cable box is not as popular anymore...I hate commercials while watching a series or movie....now...No more commercials! Set up was easy and using it even easier.  The picture quality is great with Prime, rented movies and Netflix is smooth, clear and perfect (haven't tried anything else).Amazon did a great job on it's design and interface. The only problem I have had is it lost connection with the internet once. I did a \"reboot\" (unplug then plug back into the TV) and the wifi reconnected. Not sure if it was the stick or the internet provider. Who cares, it happened once and the fix was as simple as getting another helping of popcorn.There is nothing I don't like about it.  If something reveals itself, I'll update this review while being fair and logical.Overall, turned my \"dumb\" TV into a real \"smart\" one for a fraction of the cost. So...I feel a bit smarter having purchased it.  The Fire TV Stick is worth every penny.", "verified": true, "helpfulness": "0/0", "author": "OneOfTheAncients \"EA\""}, {"rating": 5.0, "review": "Not much to add to the other 6,000 or so more detailed reviews other than to say that I love it.Easy, intuitive set up makes streaming a breeze for novices and pros alike.", "verified": true, "helpfulness": "0/0", "author": "AmazonFan"}, {"rating": 4.0, "review": "This is a great item.  Very similar to Google ChromeCast.  Only difference is that all the apps are within Fire TV stick vs. for the chromecast, you would need to start movie from individual apps and you would send it to chromecast.  The Fire TV stick is very integrated into Amazon's eco-system. If you purchase the game pad, you can download 1000's of game apps from Amazon and play it right from the TV.  I didn't get the joystick, since I have the PS4 but it is a nice option to have.  Fire TV stick is very easy to setup and the fact that it comes with its own remote control is plus.  I have both Chromcast and the Fire TV stick.  Both has it's pros and cons.  Obviously, one of the strong selling point is having the prime media contents streamed to your TV using Fire TV.  However, one of the missing content that I use a lot on Choromcast is Viki TV, which is not yet available in Fire TV. I have Chromcast in the living room and Fire TV stick setup in the master bedroom.  They both support PLEX so I have no problem streaming my movie collection to either device. Btw, the voice search using Fire TV remote on your android is very nice.  I am now waiting for the same remote app to be published in the iPhone as well.  Job well done.. Amazon!", "verified": true, "helpfulness": "1/1", "author": "D. Jung"}, {"rating": 5.0, "review": "Chromecast doesn't hold a candle to this", "verified": true, "helpfulness": "0/1", "author": "mattbrad2"}, {"rating": 2.0, "review": "Plex does not work. But after reading a bit I found you can side load xbmc and use lama to launch xbmc from the home screen.I am not getting my Plex experience.I am able to stream my content now.Please make xbmx/KODI an app in the store!", "verified": false, "helpfulness": "0/2", "author": "MrJRussell"}, {"rating": 5.0, "review": "Love it!  I've had the Amazon Fire TV for over 6 months and I loved it so much that I decided to try the Fire TV Stick during their promo.  They are both easy to set up and use and they are much faster than my Samsung Smart TV.  In fact I got the Fire TV Stick so I could use that instead of the Samsung's Smart TV features.  The Smart TV was tooooo slow.  So far, I see very little difference in the speed of the Fire TV box and Fire TV Stick, but it might be different if you use it for different things.  Our primary use is for Netflix, Hulu, Amazon Prime, etc.", "verified": true, "helpfulness": "3/3", "author": "UPNorthMom"}, {"rating": 5.0, "review": "Definately worth the $19! Even worth the $40. One big question I had, which I never saw addressed in any of the reviews: Does this work like a Chromecast, where you have to use a laptop or tablet to operate the device? If you are still wondering the same thing, the answer is mostly NO. It works as a standalone device for Netflix, Hulu, etc.", "verified": true, "helpfulness": "3/4", "author": "Beth Ann"}, {"rating": 5.0, "review": "Got this an hour ago and thought I'd set it up before wrapping it to give to my child.  I'm hooked! I loooooooove this compared to my Roku stick.  It's fast, simple, and very easy to set up.  I'm buying a few more for myself and for my friends who I've not shopped for yet this season. Did I say I love it?", "verified": true, "helpfulness": "0/0", "author": "THE Amazon"}, {"rating": 3.0, "review": "Easy to install and use; however, not all the apps I intended to use are available.  It is very disappointing as well that I can only mirror or fling from an Android or Amazon/Kindle device.  Chromecast or Roku is a better choice as of December 2014.", "verified": true, "helpfulness": "0/0", "author": "J. Benzl"}]