[{"rating": 3.0, "review": "Works at the house, but cannot take it on trips and use it at hotels.  This is one reason we purchased it.", "verified": true, "helpfulness": "0/0", "author": "Bruce Hamner"}, {"rating": 5.0, "review": "Perfect!  Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Clint fowler"}, {"rating": 5.0, "review": "The Fire TV stick was easy to install and makes \"renting\" movies so much easier!", "verified": true, "helpfulness": "0/0", "author": "Sharlene Narvaez"}, {"rating": 5.0, "review": "Very cool product. Easy to use. Works very well.", "verified": true, "helpfulness": "0/0", "author": "Brett Renfrow"}, {"rating": 5.0, "review": "I love this thing. It took me a moment to properly use it (When the \"connect to network\" option came up on the screen I was trying to select it using the play/pause button, because I forgot that the navigation/enter buttons were in the circle) but once I did it was great. Easy to use, easy to set up as long as you already have your Wi-Fi network set up in the house.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Bradley"}, {"rating": 5.0, "review": "Thank you! It's exactly what I was hoping for!", "verified": true, "helpfulness": "0/0", "author": "K. Shields \"Kim Shields\""}, {"rating": 5.0, "review": "This streaming stick went way above my expectations. Especially if you have prime then you have access to tons of new and original AND good series plus games, apps, movies and much more. Completely blows apple tv out of the water in my opinion.", "verified": true, "helpfulness": "0/0", "author": "thrifTmama"}, {"rating": 3.0, "review": "Disappointed that DirecTV isn't supported by many of the apps, Showtime, A&E;, Disney, ABC....  Also many fewer apps than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Kevin Brown"}, {"rating": 5.0, "review": "VERY easy to install and use.  Great product!", "verified": true, "helpfulness": "0/0", "author": "James B."}, {"rating": 5.0, "review": "I luv my firestick. Gives a very clear picture and easy to use", "verified": true, "helpfulness": "0/0", "author": "Chesny L.Vargas"}]