[{"rating": 5.0, "review": "excellent product", "verified": true, "helpfulness": "0/0", "author": "Jose M Penichet"}, {"rating": 4.0, "review": "very happy now we just have to keep the net neutral and not let big cabel tell us what can or cannot stream", "verified": true, "helpfulness": "0/0", "author": "andre coleman"}, {"rating": 3.0, "review": "great when it works. I keep getting something saying \"connected with problems\"- it will show a strong signal, and we try everything recommended (reconnecting, turning on and off, unplugging, re-entering passwords) and no luck. Sometimes works sometimes not. Very frustrating", "verified": true, "helpfulness": "0/0", "author": "Sydney Mckenna \"artist\""}, {"rating": 5.0, "review": "I had a chromecast before and switched because you can't stream Amazon prime on Chromcast.  This is better by far.  You don't need to run the app on your phone and the little remote is super handy.", "verified": true, "helpfulness": "0/0", "author": "Katie H."}, {"rating": 5.0, "review": "Had a little trouble loading the batteries in the remote. Otherwise fantastic item. Don't know why I didn't do this sooner. Super easy to hook up. Great item.", "verified": true, "helpfulness": "0/0", "author": "Richard J. Bork Jr. \"Gatorman\""}, {"rating": 5.0, "review": "Love the new fire stick and also the mobile app providing the ability to use any mobile device as a remote control.  The voice option is also great.  No streaming issues at all.  High Def and the games are a very cool options for the kids as well.  This is a great upgrade rather than spending the extra money for the \"limited\" smart tv options.  For just $40 you get way more than a smart tv and save hundreds.  The only thing you will need to know is the fire stick does have to be plugged in to an outlet work.  I thought originally it was powered by the TV but it does need to be plugged in an outlet for power.  So you will need to make sure you have an extra outlet nearby.  Other than that this thing is great!", "verified": true, "helpfulness": "0/0", "author": "Adam M."}, {"rating": 4.0, "review": "Its okay but I definitely will not be getting rid of Netflix", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I bought this for my wife. She loves it. She can watch a show on her Kindle Fire HD7, pause it, and then continue to watch it on out TV. Now we are getting more use out of our Prime membership.I set up the Fire TV Stick for my wife. It was quick and painless. Pay attention to the on-screen prompts and you will have no problems.", "verified": true, "helpfulness": "0/0", "author": "Michael Besket"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "julie"}, {"rating": 5.0, "review": "I love this and it was very easy to setup compared to the fifty steps for a chrome stick. Works every time I want to use it again unlike googles piece of crap.", "verified": true, "helpfulness": "0/0", "author": "Leslie Wilson"}]