[{"rating": 5.0, "review": "For the price this is an excellent device to make your TV samrt.", "verified": true, "helpfulness": "0/0", "author": "Jim VanDyke"}, {"rating": 4.0, "review": "Works pretty good....setup was easy...only negative is the standard remote...the circle control on top would better if replaced with buttons....remote is a little small for an adult male hand...print/captions on selection screens kinda small.... would buy again..", "verified": true, "helpfulness": "0/0", "author": "dave badger"}, {"rating": 5.0, "review": "It is great to have this Fire TV Stick to have access to watch Amazon Instant! I feel great not having to connect my laptop to the TV to always watch movies with the family!!!! Hassle free and easy set up! I am surprised to not have lost the remote for it being so small since I always misplace my iPhone 6 Plus!!!", "verified": true, "helpfulness": "0/0", "author": "Sophoeun"}, {"rating": 5.0, "review": "I've owned my Fire TV Stick now for about two weeks and I'm really not sure why reviewers are giving this thing any less than 5 stars for what they're getting. $40 gets you 8GB of memory, 1GB of RAM, a VideoCore4 GPU as well as a power adapter that improves function of the device, a free android app with voice search (avoid paying $30 extra for the voice search remote) and an included remote control (without voice search capability)! That's awesome for this little thing! I mean, it puts out 1080p HD and from what I've seen the quality is outstanding. The images are very clear and the only noticeable lag I've seen after viewing probably 20 shows/movies was when my internet service wasn't working because of ISP issues. The only image quality issue I have with it is that every time a video reaches a part in the movie/show where the lighting is low, it can be hard to see the video. Most of the time the image can still be seen but sometimes not so much. This does not happen frequently enough that I think it reduces its value or is something worth complaining about especially if you are one of the ones (like myself) who only paid $20 for this fancy little gadget! If I were comparing it to some of the HD channels that I've watched on Xfinity or DirecTV well the quality is lacking in comparison to those but that's because these TV services provide significantly larger viewing boxes with far more capability than the Fire TV Stick. So, it's not a very fair comparison. If you look at the comparison chart that Amazon provides on their Fire TV Stick page, you'll see that Fire TV Stick has many of the same apps (YouTube, Pandora, Hulu Plus, Netflix, etc) as Chromcast and Roku Streaming Stick only the competitor's streaming sticks are less powerful. I have used both Pandora and YouTube successfully and they work great through this device! I haven't personally owned either one of the competitor's streaming sticks but I can tell you that, after owning the Fire TV Stick, I really don't care. I personally love the simplicity of the main menu that, tho simple, I actually find visually appealing. Navigation from the main menu screen to any movie, show, game or settings page is very quick and loading of movies and TV shows is also very quick. If you're a fan of Amazon Prime movie/TV show streaming, buy this and you won't be disappointed. If you also like Hulu Plus, Netfilx, YouTube and Pandora then I HIGHLY recommend this. What's more is with an android device that's Miracast capable (you can most likely find this where your Bluetooth settings are) you make the Fire TV Stick mirror whatever is on your android device. I learned this last night, set it up and it worked perfectly! Thought that was a fun little feature. There really are several other features about the Fire TV Stick that are fun and convenient but just buy it and you can learn for yourself. It's more fun that way anyhow.", "verified": true, "helpfulness": "1/1", "author": "Joe"}, {"rating": 4.0, "review": "Love it! Gives me so many options..movies & TVPrograms..and I can download my music while watching my photos I've downloaded!! It's great!", "verified": true, "helpfulness": "0/0", "author": "Brenda Barcaly"}, {"rating": 5.0, "review": "Seems to work great.  As a prime member, I have enjoyed all the free movies and shows.  I hardly get around to watching the network channels anymore.  I have had no problems at all.", "verified": true, "helpfulness": "0/0", "author": "Steve Long"}, {"rating": 5.0, "review": "Great Option to using a game console. I was using a wii this runs much smoother! I love the pandora app! Great product I would buy as a gift!!", "verified": true, "helpfulness": "0/0", "author": "curiousgreeneyes"}, {"rating": 5.0, "review": "My family uses this all of the time.  Its small, doesn't take up space and gives us the access to streaming videos, music and other stuff that we like. We don't subscribe to cable, only internet.  For the price of one month of cable service, we bought this and use it daily.  Saves us a lot of money.  I have recommend it to friends and will continue to do so.Pros:- Its small. The remote is nicely designed, minimal buttons but you can do a lot with them.  There's not a bunch of cords, only the power cord.- Gives you access to a ton of apps. Movies, music, games, your pictures, slideshows, etc-  Its super portable.  Just unplug it, take it to the next TV and plug it in.Cons:-  It has to be plugged into the wall... a power cord goes from the USB stick to the wall.  If your TV is mounted up on the wall, this can be a bit of a stretch, depending on how high it is.-  There's no way to turn it off, other than to unplug it.  You can put it to \"sleep\" but to access the sleep option, you have to scroll down through the menu, to the bottom, enter the settings and then hit sleep.  My kids are either too lazy or too young to be able to use this feature.  It gets left on a lot.- For some reason, I don't know why, every once in a while, my accounts will get signed out, specifically Netflix, at least once a week I have to sign back in.-  You can't plug an Ethernet cable directly into it, it only works on Wifi.", "verified": true, "helpfulness": "1/1", "author": "TripleTB"}, {"rating": 1.0, "review": "Wireless option only", "verified": true, "helpfulness": "1/4", "author": "Cheri Thompson"}, {"rating": 5.0, "review": "LOVE IT. now I really feel like I have a living room. actually I have redone my living room since August 2014. and I have an apple TV. however, when I use my mac with the apple tv, it no doubt skips and shuts off 100% of the time so I got frustrated and have been just watching from my tiny mac.now I can use the big screen and watch straight from the screen. Just love it. if it ever goes on sale, I might get one more for a separate room.", "verified": true, "helpfulness": "0/0", "author": "sour melon"}]