[{"rating": 5.0, "review": "It is easy to work and the choices are plentiful.", "verified": true, "helpfulness": "0/0", "author": "barbara a. wilford"}, {"rating": 4.0, "review": "I too bought this on the first day it was availed for pre order. I got this nice little device for $19 but would have bought it for the listed price. We still use our kindle fires to watch movies most of the time but being able to put it on the big screen sometimes is ju", "verified": true, "helpfulness": "0/0", "author": "Laurel McFarland"}, {"rating": 3.0, "review": "I felt like there was some false advertisement. You actually have to hook it to a power source, which NONE of the ads show. If I had known that, I wouldn't have bothered ordering it. It is mostly exactly the same as my ROKU, except it is smaller.I'm not blown away by any means.", "verified": true, "helpfulness": "0/0", "author": "E. A. Lee \"\"I cannot live without books.\"\""}, {"rating": 5.0, "review": "Very fast compared to the roku stick. Very satisfied. Interface could use a little bit of work but overall very good especially if you got at $20 price.", "verified": true, "helpfulness": "0/0", "author": "Tedla"}, {"rating": 5.0, "review": "Great product, easy to set up and convenient to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Disapointed with Kodak\""}, {"rating": 4.0, "review": "My only complaint is the remote control cover was hard to remove to install the batteries. Otherwise love it. No issues. Took less than 5m to hookup.", "verified": true, "helpfulness": "0/0", "author": "Happy"}, {"rating": 5.0, "review": "My daughter loves this, they don't have cable so it was the perfect solution and easy to use.  I plan on buying another one for my husband.", "verified": true, "helpfulness": "0/0", "author": "L. Prince"}, {"rating": 4.0, "review": "Fast while scrolling and streams content quickly. The only problem is that it tiles every once in a while throughout a long movie.", "verified": true, "helpfulness": "0/0", "author": "Zilcho"}, {"rating": 5.0, "review": "LOVE this! We use mostly apple products in our house and I wondered if Amazon could have possibly mastered this as well as the Kindle. They most certainly have! I not only like it, I love it! Works amazing! So glad I purchased it!", "verified": true, "helpfulness": "0/0", "author": "T. Howard"}, {"rating": 1.0, "review": "Junk, hours trying to get it to read my wifi and I am returning it.", "verified": true, "helpfulness": "0/0", "author": "Thomas Clary"}]