[{"rating": 5.0, "review": "Works as anticipated.  Just another option ..very quick and responsive.", "verified": true, "helpfulness": "1/1", "author": "Ray D. Devolld"}, {"rating": 3.0, "review": "3 stars because even though it has some issues and annoyances, you can't really expect a ton for $25.  With that said, if any one of the 'cons' are deal-breakers for you, the price won't matter and you will be better off w/ a Roku or Android TV.Pros:super cheap.Seems snappy enough.  There was some sluggishness early on, but it's been smooth ever since.Better Amazon Prime interface than on the Roku.  The AP Roku app hasn't been updated in what seems like years, and it's slow, cumbersome, and dated as a result.  The Fire TV Stick is much better.A decent number of games.The remote is nice and small and easy to use.Cons:The wi-fi seems to be tempermental.  It wouldn't detect my router (even though over a dozen other devices of all types never have issues).  I had to go into my router config screen and change the channel.The remote doesn't appear to be IR, so you'd think it doesn't need line-of-sight, but I just covered it with my hand and it wouldn't work.  Oddly enough, the second I removed my hand, all the button pressed were sent to the stick at once.  Seems like the remote is listening for a confirmation that the stick received the signals, and if it doesn't get it, it keeps sending 'em.  Either way...Roku 3 has a better remote that doesn't require line of sight.Buying the same apps again for the Amazon ecosystem is kinda lame.  This is more of an issue w/ Plex, but it could still help determine if you want to purchase this device.Many of the TV show tiles show up as seasons.  You can  jump through seasons after clicking the tile, but why display as seasons?  In some areas, Workaholics season 3 and season 4 were a few tiles apart.  That's clutter.  Show me one icon for each show and lemme pick the season on the info screen.The REW and FFW buttons do not skip through pages of tiles like they would in virtually every app on the Roku 3.No Youtube or HBO Go app.  Roku has both.Amazon, for some unknown reason, accepted then didn't accept, then once again accepted my new credit card, but the Plex app still says there was a problem with the purchasing method every time I attempt to go download it again.  This kind of stuff needs to be ironed out if they want to be taken seriously.As a Prime member, I thought I was getting a sweet deal with a pre-ordered a stick for $19 back in early November.  To my surprise, the device isn't scheduled to ship until December 12th even though Best Buy had an entire display full of sticks for only $25 in stores today.  Making Prime members who are early adopters wait because Amazon wants to fill a retailers orders is a horrible way to treat your most loyal customers.  They may have gotten my dollars this time, but I will surely remember this experience in the future, and will be less likely to jump so early.All in all, with some time to tweak the interface and systems and get more apps, this could be a very solid streaming option.  When it comes to streaming hardware, the lack of one key app or feature will be a deal breaker.  Get Youtube, HBO Go, and various sports streaming apps (BTN2Go, Fox Sports Go, CBS Sports, etc.) and they will have a winner.", "verified": true, "helpfulness": "5/6", "author": "Speerdo"}, {"rating": 5.0, "review": "Fast as heck!  Way faster than Samsung smarthub.  Android phone app is really cool and works terrific.", "verified": true, "helpfulness": "1/1", "author": "DR_pdx"}, {"rating": 4.0, "review": "With Amazon's backend help, was able to register the product. It's great to be able to access my Prime content on my TV. I haven't noticed any drop in wifi connection, or problems streaming. seems faster than my chromecast. The remote is small, though, and can get easily lost. Well worth the money, just dropped one star because the remote is easily lost.", "verified": true, "helpfulness": "6/11", "author": "Susan Garcia"}, {"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "1/1", "author": "J. Morgado \"Aten\""}, {"rating": 5.0, "review": "This is awesome! We love our Amazon Fire Stick! We've been watching Netflix, Amazon, and Hulu shows nonstop and thoroughly appreciate that each app provides captioning. It's a great price and a great buy for everything it offers!", "verified": true, "helpfulness": "1/1", "author": "Erika Cordero"}, {"rating": 3.0, "review": "It doesn't load as good as the Roku", "verified": true, "helpfulness": "1/2", "author": "Bruce Price"}, {"rating": 5.0, "review": "Setup was easy. Remote works great. No issues.", "verified": true, "helpfulness": "1/1", "author": "marvster"}, {"rating": 3.0, "review": "The reason I am giving this a 3 star is not because of the stick itself, it's more of the included remote. In order for the remote to function, you must be able to point it at the stick, and within 5 feet of the stick. If your HDMI connection is behind the TV, like 99% of all TV's out there, you're out of luck. The remote must be in direct line of sight of the stick for it to work properly. It was very frustrating to see clicks on the remote not being registered or suddenly you see the \"pages\" move all the way to the right or left. (Delayed responses.) To remedy that, I have to use the firetv remote control APP on my phone to control the stick, the APP works great, but the physical remote is reason I picked this over the Chromecast.Pros:- Great interface, good variety of APPs- Very good price if getting yours for <$25. (Prime member discount or other store specials)Cons:- The included remote does not work well- Stick gets burning hot after few minutes of running- No option to turn the stick off if you're plugged into the power source (wall jack or power strip etc), other than unplugging it, no off button. (It goes into screen saver mode)It would be nice to have an option on settings to power the stick off when the TV goes off. (If you're plugged into the USB on the TV, it does that, but not if you're plugged into a non-TV power source.)", "verified": true, "helpfulness": "1/3", "author": "W.J"}, {"rating": 4.0, "review": "The Amazon Fire Stick is very impressive.  I am able to access my Amazon music collection, as well as all Amazon Prime video and movie selections.  Video is displayed in phenomenal HD.  Set up is easy and using the mobile app for your Android device enables voice search and easy control of the stick.I haven't yes explored all of the available options, but this little stick has better specs than my Apple TV and gives it a run for its money.My only complaint would be a sporadic glitch in the audio every once in a while.  Akin to a CD getting stuck in one spot.  These occurrences are rare and really no big deal.  As a matter of fact, if this is my only complaint, I'd say that Amazon has done a great job.  One feature out of Amazon's hands is the fact that this stick has to have a power cable.  HDMI does not have the power to run this stick, unlike some USB devices and their respective ports.The fast-play feature works very well for movies.  I sat the kids down to watch 'Barnyard' and the movie didn't buffer or require loading time at all.As a Prime member, this stick is definitely worth the price.  I can't imagine enjoying it as much if I wasn't a Prime member, however.", "verified": true, "helpfulness": "1/1", "author": "D. Park \"palanark\""}]