[{"rating": 1.0, "review": "HORRIBLE purchase.... Right out of the box and does not work at all. Connected to my wifi (which is very fast and very reliable on every other device I own) and the Fire Stick kept saying that the connection was lost. It would reconnect for a few seconds, then lose connection again. I finally got it to play a TV show that I commonly watch on another device that I use to stream Amazon Prime, and the picture was literally so blurry that I could hardly see what was going on. I do not have HD so I'm not just seeing some difference between HD and normal definition.... This was beyond anything I've ever seen. Maybe I got a defective device?? Be sure to open yours right away so you can test it and return if needed. I'm really shocked, considering how much I love Amazon. I never even take the time to write reviews for anything but this takes the cake.... Worst purchase ever. I unplugged it and put it back into the box to return it after an hour and a half of frustration.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Proctor"}, {"rating": 5.0, "review": "I am pleasantly surprised by the capabilities of this little stick. The Fire Stick can stream a 1080P video over WIFI connection without any problems. The sound quality is very good too. I am looking forward to seeing a second generation AFS.", "verified": true, "helpfulness": "0/0", "author": "Arrak"}, {"rating": 5.0, "review": "A must for every household!! It's the new \"cable TV\", but better...listening to FREE prime music as I am typing this.  Also, I must add that I have two fire sticks.  One for our main TV and one for the basement.  My boys love playing the FREE games.", "verified": true, "helpfulness": "0/0", "author": "Ann Hodges \"book maven\""}, {"rating": 2.0, "review": "Options are great, however it seems I have to reenter my wifi password every 2 days or so.", "verified": true, "helpfulness": "0/0", "author": "andre Sinclair"}, {"rating": 4.0, "review": "Really easy to install.  Customer service very helpful.", "verified": true, "helpfulness": "0/0", "author": "Sue Schilling"}, {"rating": 3.0, "review": "I really like the idea of the Fire TV Stick but consistent network issues with this device (and only this device on my entire network) has left a sour taste in my mouth. You can only get grainy/poor quality Netflix with random buffering for so long. I'll try the FireTV instead I suppose...", "verified": true, "helpfulness": "0/0", "author": "Zach Loeber"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "joshua blackwell"}, {"rating": 5.0, "review": "Recommended by a friend - wish I would have bought this when Amazon offered it for $20.  We don't have cable and I had an extra flat screen I did not want to have to buy an antenna for to get 'free tv' which I hardly watch. BUT...this gives me internet connection on that TV and I can watch my Amazon Prime, Hulu Plus, Net Flix and you tube shows.  This was extremely simple.  I did not even cuss one time.  Buying another one for the travel trailer.", "verified": true, "helpfulness": "0/0", "author": "Nelle"}, {"rating": 5.0, "review": "Awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "James Cottrell"}, {"rating": 5.0, "review": "Inexpensive and works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Stephen Gregg"}]