[{"rating": 5.0, "review": "Awesome and I'm so Happy no longer do I have a computer hooked up to my TV so I can watch Netflix", "verified": true, "helpfulness": "0/0", "author": "Margaret Kelly"}, {"rating": 4.0, "review": "GOOd Gift", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very surprised by it. IMO better than the Chromecast (I have both)", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 5.0, "review": "Awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "Maxine"}, {"rating": 2.0, "review": "I was very disappointed in the performance of the Amazon fire stick. Every other streaming device in my home was able to catch the signal off my Wi-Fi and run flawlessly. The fire stick constantly Lost the signal and if it happened to catch the signal it was constant buffering and stoppages.", "verified": true, "helpfulness": "0/0", "author": "Jared Sam"}, {"rating": 5.0, "review": "great little device", "verified": true, "helpfulness": "0/0", "author": "rwritz"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Nancy Forrest"}, {"rating": 1.0, "review": "Didn't work for us.  Connectivity was very bad.", "verified": true, "helpfulness": "0/0", "author": "Maryanne Woods"}, {"rating": 5.0, "review": "I've been using the fire tv stick as my primary streaming device for three months now and I've been happy with it. Make sure to plug the USB into an outlet, though. When I had it plugged into the tv's USB port I kept having to re-login to Netflix if I hadn't used it in a while. Plugging the stick into permanent power seems to have solved that problem.", "verified": true, "helpfulness": "0/0", "author": "Geoff Toy"}, {"rating": 1.0, "review": "The phone app is poor. UI has a lot to be desired. Doesn't support HULU. May be better if amazon prime had a monthly plan. I am just not willing to dump 100 dollars to see if I like their content. Chromecast is light years ahead in regards to interface. I do realize there is a thirty day trial, but apparently I used that 3 years ago and they won't allow me a trial period again.", "verified": true, "helpfulness": "0/0", "author": "Jedi Yorkies"}]