[{"rating": 4.0, "review": "Junk....marketeers forced it to market way too soon. Won't pick up router without extender, freezes and won't load apps and video. I bought 4 tried two with same results....marketeer driven junk. ...and I am a loyal, but very disappointed, Amazonian.I am updating my review. There is no warning anywhere indicating so, but I had a several year old Belkin router that worked great with everything but the Firestick. I just got the $20 TP Link 300Mbps N Router from Amazon and the Firestick works great. Much better than my several year old Roku. Don't know whether to apologize to Amazon or be pissed because they didn't indicate that my router could be a problem.....", "verified": true, "helpfulness": "2/4", "author": "Anders Tornberg"}, {"rating": 5.0, "review": "Works good easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "sandra stephens"}, {"rating": 2.0, "review": "This device is really disappointing. The UI is nice, the speed between apps is a welcome change to the Roku, but it simply does not work. It buzzes, it stutters, it freezes, it plays the audio with a black screen and it sometimes freezes and won't do anything. I wanted to like it. I wanted to use it, but it is far too frustrating.I spoke with the tech support and they told me to use the HDMI extender which did nothing to help. He also suggested I restart my wifi router. The router sits about a foot from the Fire Stick and has never been a problem with my Chromecast, Roku, TV, Kindle, Nexus 7, phone or the other Roku that is in another room 30 feet away. The only consolation is that I bought it at the intro $19 price. I may hang on to it to see of there is a software update to correct the problems. Until then I will stick with my somewhat clunky but dependable Roku.", "verified": true, "helpfulness": "2/2", "author": "Matt S."}, {"rating": 5.0, "review": "Definitely easy to use and works great.", "verified": true, "helpfulness": "0/0", "author": "Ray Plaza"}, {"rating": 5.0, "review": "I love the easy use and setup. Comes with a remote, so no haggling for a device to cast it.", "verified": true, "helpfulness": "0/0", "author": "Sri99"}, {"rating": 1.0, "review": "very slow every restart.", "verified": true, "helpfulness": "0/1", "author": "Ni Ni Win"}, {"rating": 5.0, "review": "Amazing! So much better than the chromecast. great price, great product. Works wonderfully! Very user friendly, lots of content. Awesome.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "I'm very happy with this little item. I wish I had bought two when they were on sale.", "verified": true, "helpfulness": "0/0", "author": "jsaen"}, {"rating": 5.0, "review": "Love the Fire TV Stick.  Its very easy to use and install.  And the movie selection is AWESOME.", "verified": true, "helpfulness": "0/0", "author": "durranfelton"}, {"rating": 1.0, "review": "Terrible product!  Released 1/2 baked.  I really wanted to use it for Amazon Prime which I cannot get on my Apple TV.  I had very high hopes... The packaging is fantastic...  The remote and the device is clean and even the power \"brick\" is really well thought out...  They even loaded in my prime data which was a very nice touch!!  ... but when it comes to using it... it falls well short of any reasonable expectation.  I'm not being picky... it's really bad.  I hope the rest of the \"fire\" line is better than this device.Issues:The fire stick suffers from huge delays.  I'm not talking about 1-2 seconds...  Press the button to scroll down 3 movies and it just sits there... then all of a sudden it will start hopping all over the place.  Cold rebooted and started pushing the button's slower...  ALLOT slower and it still got stuck.  I have the A/C plugged in...  It's either a really slow processor or lousy firmware/software.  My guess is that it's the software since any basic processor can scroll etc...  The system was not doing anything else at the time..I finally got it to play a video...  Video on Amazon prime is very blurry when compared to netflix or youtube or anything else that's \"HD\" on the Apple TV.  Checked the internet connection and it was \"very good\".  Router is 20' from the device with a clear line of sight.  seriously blurry like netflix was 10 years ago...  I played \"catching fire\" *(Ironic...)  on a 2 year old Apple TV and the Fire and the difference was dramatic.The Parental controls are horrible.  I just don't want anyone buying movies without a password.  You can't just enable that.  It becomes a huge hassle to use the device if you turn on parental controls...Update this AM:Restarted the fire TV and it can't find any internet connection.  It's stuck there not able to find any connection even though every other device is connected and working..  Apple TV, Chromebook, Phone, PS3.Don't buy this product... at least not yet.  It has allot of hope but this generation is a bust.", "verified": true, "helpfulness": "1/1", "author": "Ben"}]