[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "D. Huntley"}, {"rating": 5.0, "review": "Great little device! Even if you don't get Amazon prime, it's great for other apps as well like Netflix in my case. Sure I have an Xbox and Wii, but it's a pain to switch them to different TVs when you wanna watch something, especially larger ones that are super hard and heavy to turn. Still, it makes thing nice and convenient. Now all major TVs have easy access to the internet and apps. And if I go anywhere it's a lot easier to take the Fire Stick, than try to safely pack up a system. A lot cheaper too!", "verified": true, "helpfulness": "0/0", "author": "Virginia P Harris"}, {"rating": 1.0, "review": "Keeps reloading", "verified": true, "helpfulness": "0/1", "author": "JESSIE SIEKIERSKI"}, {"rating": 5.0, "review": "I recieved the amazon fire stick as a gift and didn't know what to expect.  It turns out that it was a completely awesome buy.  Normally I use my kindle fire as a way to watch netflicks and hulu on my TV but with the stick I can bypass that now and watch everything from the kindle straight from the plug in.  I also have the potential of using various other apps if I chose.", "verified": true, "helpfulness": "0/0", "author": "Drooling Buffoon"}, {"rating": 5.0, "review": "After moving this Fire TV Stick to my primary TV, I've really started to use this regularly and I live the interface & picture quality & speed.In full disclosure I've got a Logitech Revue, Samsung Google TV GS7, and a HuluHD, also.I like the interface for youtube & sling better than the other players. Movies on both netflix & Amazon Prime stream better. The remote is handy & intuitive.I've downloaded the FireTV app on google play & that works great on my Nexus tab & Samsung Note. I have a Fire tab, but I've yet to use that to control the Fire Stick (I'll update.)I'm no tech geek at all - more tech challenged than anything, and this was super easy to set up. I've got a number of internet boxes to try to eventually cut the cord. With FireTV & Sling - and where the other boxes weren't cutting it - I am just about there.If I had one suggestion - and this would get me to upgrade to the box - it would be great of you could integrate a coaxil signal so I didn't have to switch between HDMI & TV.", "verified": true, "helpfulness": "0/0", "author": "Cathie Burkland"}, {"rating": 4.0, "review": "We are on vacation and wanted a TV in bedroom.  Our landlord graciously provided, however, the cable has yet to be connected.  The firestick allowed us to watch some of our favorite programs without the need of a cable connection.  Love the portability of it.  As long as you have Wi-Fi, you can watch anywhere.  We'll bring home and use it in our bedroom as well and when we travel it is so easy to throw in your bag.  Great idea!", "verified": true, "helpfulness": "0/0", "author": "NorahS"}, {"rating": 5.0, "review": "This turned my wonderful 65 inch TV into a 65 inch Smart TV.  I don't play games or anything of that sort.  I just wanted the basics and this gives me everything and more.Thank you for a wonderful product.", "verified": true, "helpfulness": "0/0", "author": "Eddie Robbins"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Justin Tidball"}, {"rating": 3.0, "review": "It's great for Amazon Prime and it's definitely faster than the Roku stick, but it's absolutely atrocious with Netflix. The video stutters like crazy, despite the thing showing an excellent wifi signal and there being no other traffic on my 5 GHz band. Uninstalling Netflix, removing from my \"cloud\" & re-installing it didn't fix the problems, either. Bottom line, if you use it for Amazon Prime video only it's a spectacular deal; however, if you do Netflix, too, then you're better off finding a good deal on a Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Jeff R."}, {"rating": 1.0, "review": "it works great on my kindle-does not work on my galaxy s5 or my verizon tablet, can't find any phone numbers for help-might return", "verified": true, "helpfulness": "0/1", "author": "joseph musso"}]