[{"rating": 2.0, "review": "Not sure if it is the internet or the fire tv stick but the show hesitates and freezes.", "verified": true, "helpfulness": "0/0", "author": "Bobbie Jo Davis"}, {"rating": 4.0, "review": "Very easy to use and gives me a lot of choices.", "verified": true, "helpfulness": "0/0", "author": "Wilbur Roby"}, {"rating": 5.0, "review": "Love the Prime Music!", "verified": true, "helpfulness": "0/0", "author": "D. Mitchell"}, {"rating": 4.0, "review": "Works better than Chromecast; easier to get and stay linked.", "verified": true, "helpfulness": "0/0", "author": "Ken Jones"}, {"rating": 5.0, "review": "The fire tv stick save me a lot money.... Love it😍😍😍😍😍😍 ordering another one of my other TV...", "verified": true, "helpfulness": "0/0", "author": "KIM"}, {"rating": 4.0, "review": "Amazona design, easy to Manager!", "verified": true, "helpfulness": "0/0", "author": "Alejandro A. Breton"}, {"rating": 5.0, "review": "Rre eally enjoy it.  Can play Hillclimb Racing on 50 inch TV now", "verified": true, "helpfulness": "0/0", "author": "Curtis Loader"}, {"rating": 5.0, "review": "It arrived ready to plug in and use. I was pleasantly surprised that Amazon had pre-programmed the device with my Prime account information, saving me the bother of entering account numbers, passwords and the like before I got started. Ten minutes after I received it, it was plugged in and working; and that includes unpacking it. There's a vast library of free Amazon Prime programs to watch and the fact that this device is seamlessly linked to them is perhaps its greatest selling point. I also have a Roku box, but I haven't turned it on since I received the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Pep"}, {"rating": 1.0, "review": "i was excited to get the Fire TV stick as part of the Sling TV promotion, but the reality of the product has left a bad taste in my mouth. The Fire TV was going to be attached to a 20\" wall mounted TV in my dining room. The initial set up is super easy. But the device kept dropping wifi connection when trying to connect to HULU plus or Netflix. And when the connection failed the device would do a quick reboot then back to the home screen. I restored the device to factory. Rebooted the device several times. Same issue. Over and over. After a chat with tech support I was told that I HAVE to use the included HDMI extender because the TV was blocking my wifi signal. What? There is no documentation stating this. And I have never had this issue with any other streaming product. Using the extender means that the device dangles below the TV and defeats the purpose of wall mounting a TV and using cable housing to hide the cables. Meaning the product can be seen at all times just hanging there. So I tried it for a little bit. Guess what? The issue was still the same. A little better. But still kept dropping signal. More chat with tech. Support and they decided to send a replacement unit. That unit arrived and was even worse than the first one. Same issues. Dropping connection. Rebooting. Tech support again told me the extender was designed to improve the signal. There are other streaming sticks that do not have this issue. So. I have now paid $68.41 for the Sling TV promotion and have a free defective product. Sling won't give me my money back and I can't exchange this for the ROKU stick. So I am out of the money paid and have to return this product because I refuse to use such a poorly designed device. Get the Roku stick instead. Fire TV stick is not ready for primetime yet. Some might have better luck. And just a little background. My home network has multiple devices all connected and not having any connectivity issues seen with this product. Go to the fire TV support pages. Tons of people have the same problems I had. Amazon needs to fix this ASAP.", "verified": true, "helpfulness": "1/2", "author": "Matt Ficarelli"}, {"rating": 5.0, "review": "Great product and so inexpensive.  My son got it for his 7th birthday, and it's so easy to use.  He loves the games that come with it.", "verified": true, "helpfulness": "1/1", "author": "Jennifer"}]