[{"rating": 5.0, "review": "i just love amazons products because they are trustable", "verified": true, "helpfulness": "0/0", "author": "ADEEL MAJEED"}, {"rating": 5.0, "review": "I love it! I don't have a game console for my Netflix or Amazon prime network so the fire tv stick is a hit.", "verified": true, "helpfulness": "0/0", "author": "Cynthia D Eriks"}, {"rating": 1.0, "review": "This is a great concept but it's not ready for primetime. The hardware has too many issues. I can stream Prime movies from my laptop with no problems at all, but when I use the FireStick it has to buffer about every minute and then eventually says that there is no network connection. I know it has to be the device because everything else works throughout my house perfectly for streaming: Windows 7 desktop, Apple TV, Macbook Pro, Motorola Moto G, iPad Air, KindleFire etc. This is the only device that doesn't stream. The problem is probably with data throughput due to encryption processing. The FireStick is 6ft line of sight from the router and there are no walls or other obstructions. No other devices were hitting the network at the time either. It will stream movies that are old and no one is going to steal so they require no encryption thus encryption handling seems most likely. Hopefully they'll have a solution soon.", "verified": true, "helpfulness": "1/1", "author": "P. Shockley"}, {"rating": 5.0, "review": "The Fire TV Stick is a great step up for me.  I was previously catching up on past seasons of Scandal and House of Cards on my laptop.  Now I can easily watch shows from Netflix and Amazon on the larger screen.  This was a great purchase.", "verified": true, "helpfulness": "0/0", "author": "A. Mora"}, {"rating": 5.0, "review": "Excellent it met all expectations plus more", "verified": true, "helpfulness": "0/0", "author": "donald atchison"}, {"rating": 3.0, "review": "Im only about 5 days into using it and if it wouldnt buffer so much at night then it would score a 5 star from me. Id like to rerate later when I have more time to explore it completely", "verified": true, "helpfulness": "1/1", "author": "rachel"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "orlando d."}, {"rating": 5.0, "review": "Received as a gift and LOVE it!  It serves it purpose and I can move it between TVs and everyone in the house is enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Eleanor"}, {"rating": 5.0, "review": "This \" stick \" is capable of the unimaginable!  So much to view and even play... No need to EVER pay for cable again !!!-", "verified": true, "helpfulness": "0/0", "author": "Aaron Huth"}, {"rating": 5.0, "review": "Love it ....I bought it for my husband smart TV for more apps he loves it ... better than roku n Google chrome... Easy hook up", "verified": true, "helpfulness": "0/0", "author": "s graham"}]