[{"rating": 5.0, "review": "Easy to use, portable, tons of options!", "verified": true, "helpfulness": "0/0", "author": "tea junkie"}, {"rating": 5.0, "review": "Very nice device if you ever figure out how to install kodi on it like i did. I never have to pay for cable again thanks to this. Its cheaper and more reliable than those Android TV boxes because its a Amazon device for christ sakes (Amazon customer service is second to none in my book). It shipped in perfect condition and arrived exactly when they said it would. Its a simple device that works as its intended.", "verified": true, "helpfulness": "0/0", "author": "Keron Coward"}, {"rating": 5.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Vanussa M."}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "lynne adams"}, {"rating": 3.0, "review": "It works!  Only trouble is it won't pick up our wireless signal from our cable router in each room.  Don't know if we don't have enough broadband or its the stick.", "verified": true, "helpfulness": "0/0", "author": "ammonite"}, {"rating": 5.0, "review": "I am really enjoying the Fire TV Stick. With the combination of Amazon Prime, Hulu, and Netflix I was able to cancel my satellite programming. It would be great to see a NEWS option from the sidebar menu. Many of the news apps are quirky to get to what you want to see--should be standard to progress to the next feed. Not always the case.", "verified": true, "helpfulness": "0/0", "author": "S. Beans \"Technology Integration\""}, {"rating": 5.0, "review": "just got mine yesterday.. Extremely happy thus far. Works better than I imagined. Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Nathan Sansing"}, {"rating": 3.0, "review": "Good but stopped working after only a few hours.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is Slick! I will be purchasing another as well. Now I can dump the movies channels from my satellite and save 50 dollars a month. Dont be in doubt, Check it out!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great fast device, easy to customize", "verified": true, "helpfulness": "0/0", "author": "Who am I to know?"}]