[{"rating": 2.0, "review": "It works pretty much like the Roku I have and all that so that's fine and the quality is HD for sure. Speed is pretty good as well. But I am giving it 2 stars because when I received it there was a mini USB cable in the box. Well, in all the commercials and all the other advertising Amazon gives one the impression that you just plug the stick and ago. No. Not all all you plug it then you have to plug the power cable into it. This is, in my opinion, deceptive. Unless you go to the page that showcases the stick and you delve into the way it works you automatically think, oh all you need to do is plug into the TV. Well, no. For this I give it 2**.", "verified": true, "helpfulness": "0/2", "author": "Francois Elmaleh"}, {"rating": 2.0, "review": "The fireTV stick requires USB power (at least with my TV), which is annoying for a wall mounted TV which may not have an outlet present.  I tried to be clever and use the USB port on my TV (Sharp Aquos LED) and it appeared to work!  However, I found that when navigating side-to-side in the menus withing the fireTV stick, the device would crash and restart.  To troubleshoot I tried plugging into the provided power adapter and the crashes went away.I'd consider this a bug: with the USB power; the device should either power on and work consistently, or not power on if the USB power source is inadequate.  Strangely, streaming an HD video it works fine, only when navigating the menus (especially scrolling side-to-side).  I hope this is something they can fix in a software/firmware update so that users don't have to run a separate power cord to the back of their TV when most TVs these days have USB ports.", "verified": true, "helpfulness": "1/1", "author": "GearTraveller \"world traveller\""}, {"rating": 2.0, "review": "Is anyone else having problems with it constantly pausing? Not sure what is going on, but ever few minutes, the stick pauses and i have to hit play again in order for it to work. Note that this is not a streaming issue, in that the streaming circle does not appear, rather, whatever we are watching, it randomly flickers and then pauses the show.I have updated the firmware too.", "verified": true, "helpfulness": "5/5", "author": "snowcow"}, {"rating": 3.0, "review": "This product could be awesome if the workout the fickleness of program settings. Not being able to YouTube sync as easy as roku or Playstation", "verified": true, "helpfulness": "0/0", "author": "AFwestPunk \"2>4\""}, {"rating": 5.0, "review": "Love this stick... much better than Google Chromecast.Installed XBMC... with combination of XBMC and PLEX.... its a great addition.Picture quality is excellent.", "verified": true, "helpfulness": "0/0", "author": "PP \"PP\""}, {"rating": 5.0, "review": "Easy setup. It is even registered to you when you get it so there is almost nothing to do but plug it in, put in your router password and sit back and enjoy. I'm looking forward to a remote app to come out for the iPad so I can browse by voice. The only problem was a difficult to open remote to load batteries.", "verified": true, "helpfulness": "1/1", "author": "J. Phillips"}, {"rating": 5.0, "review": "Does the stick or the prime tv box replace cable", "verified": false, "helpfulness": "0/0", "author": "Misti Anderson"}, {"rating": 5.0, "review": "Love it; great for use on TV in guest room.", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 5.0, "review": "Love this!!!", "verified": true, "helpfulness": "0/0", "author": "Jill Laurello"}, {"rating": 5.0, "review": "Prefer the Fire Stick over the Amazon Prime app on my Sony TV. This plugs right in and works great. No buffering for me and the interface is simple and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Simon \"SR\""}]