[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "andrew w garcia"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "steve d england"}, {"rating": 3.0, "review": "Still a little buggy, I imagine many issues get resolved in the near future. Sometimes it attempts to start playing a video and then fails until I security wipe it. Seems like a common issue that needs to get cleared up soon. I feel that most people aren't going to know how to resolve the issue easily and, because of this, I feel the Fire TV Stick should incorporate more reliable automated clean-up tasks.Amazon's advice: http://www.amazon.com/gp/help/customer/display.html?nodeId=201612210", "verified": true, "helpfulness": "0/0", "author": "Chris Gates"}, {"rating": 5.0, "review": "Love the fire stick. Awesome selection!!!!", "verified": true, "helpfulness": "0/0", "author": "Miguel"}, {"rating": 3.0, "review": "While it provides us with many new options for viewing, the keypad is way too sensitive.It \"jumps\" over categories, making it almost impossible to find what I want to watch on the \"first shot\".Trying to set up ancient for free Netflix and just spent 20 minutes - still no luck. The keypad keeps duplicates letters and doesn't navigate to the next screen well.If it were not for the trouble that I am having with the keypad - I would rate this product much higher.", "verified": true, "helpfulness": "0/0", "author": "George Ritchie"}, {"rating": 5.0, "review": "It is much easier to watch movies now that I don't have to hook up my computer to the tv to watch a movie. Just push a button and it is on", "verified": true, "helpfulness": "1/1", "author": "Shirle J. Gerwig"}, {"rating": 5.0, "review": "I enjoy the fire stick very much", "verified": true, "helpfulness": "0/0", "author": "pete millard"}, {"rating": 5.0, "review": "At first didn't know how to work it but so far very good buy, would purchase again", "verified": true, "helpfulness": "0/0", "author": "alvina hunt"}, {"rating": 5.0, "review": "Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I love this item in many ways.  It freezes and the audio continues.  Often.", "verified": true, "helpfulness": "0/0", "author": "Daniel S. Hermes"}]