[{"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/1", "author": "Dennis"}, {"rating": 1.0, "review": "Cannot watch a movie without it stopping and buffering throughout movie. I have broadband internet and modem is within 10 feet of TV. Got on a Amazon help line and did what they suggested but with no luck. Wish they had better tech support! Amy suggestions?", "verified": true, "helpfulness": "1/1", "author": "Jack H."}, {"rating": 4.0, "review": "It is easy set-up and to use and I easily set-up my iPhone as a remote control. Content is not as good as on Apple TV. I got the Fire TV Stick mainly to gain access to Amazon Prime video content. The Amazon site could be better at filtering TV Stick-only applications. I ended up downloading applications that did not work with the TV Stick even though the Amazon filter indicated the applications would work.", "verified": true, "helpfulness": "1/1", "author": "The Stache"}, {"rating": 5.0, "review": "Easy to install (aka no installation needed) and easy to use! Have everything you could possible want in regards to TV and movies, at your finger prints!", "verified": true, "helpfulness": "0/0", "author": "Marissa Kaplan"}, {"rating": 4.0, "review": "love it.", "verified": true, "helpfulness": "0/1", "author": "Boonluer T. Pratt"}, {"rating": 5.0, "review": "When I got my Fire TV Stick, I couldn't wait to set it up and explore.  Getting started was very easy.  There are tons of free apps to download to keep everyone entertained.  I do not have cable, which is fine for me, but inconvenient when family or friends come to stay.  That is one of the main reasons why I bought this was for my guests when they are in my home.  The very next weekend after receiving this, my cousin, her husband, and 2 girls came to stay with me and they really made good use out of this.  It's also so incredibly nice to have my Netflix and other apps right on my TV for watching movies and TV episodes.  I no longer need to hook up my laptop with an HDMI cable.  I even downloaded some backgrounds like a cozy fire, scenes of snow, rain, and the ocean.  Some of them play relaxing music and this is ideal when I'm doing homework and want something on in the background that won't distract me.", "verified": true, "helpfulness": "0/0", "author": "Nikole A."}, {"rating": 5.0, "review": "Love the product! Was using laptop hooked to TV but this is so much better. I noticed several bad reviews concerning the Hulu and Netflix apps not working but after inputting my account info, I was steaming in less than 5 min. Would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Phil Micucci"}, {"rating": 5.0, "review": "This is awesome!! I so totally love it! I got it for Christmas and haven't stopped using it ever since.", "verified": true, "helpfulness": "0/1", "author": "Megan Delgado"}, {"rating": 1.0, "review": "Maybe we just got a defective one but this little device had lots of problems.  Worked well for about 2 weeks then began to drop signal even though all other devices in the house worked fine.  When it wasn't dropping signal, it would just freeze up and stop streaming. We had to unplug it to get it to start again.  If that happens once I can understand it but this happened time and time again.  The unit also seemed to get unusually warm.  I ended up taking it back to Best Buy for a refund.  I think the Stick is good in theory but the execution is poor.  We have no trouble streaming Amazon videos with our Roku or WiiU so I have to say it is the Stick. Save your money and buy a Roku or other streaming device.", "verified": false, "helpfulness": "1/2", "author": "Steven M. Brodsky"}, {"rating": 5.0, "review": "Easy to use and well organized.", "verified": true, "helpfulness": "0/0", "author": "rdmjazzy"}]