[{"rating": 5.0, "review": "I've had the amazon fire tv for less than a month and I love it. It has all the shows my 2 year old loves and I enjoy watching new shows that I normally don't see on tv and no commercials!", "verified": true, "helpfulness": "0/0", "author": "Adrianna"}, {"rating": 5.0, "review": "love this best thing ever to go with my amazon prime membership", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!! Can't believe how reasonably priced it is. Definitely worth it!!", "verified": true, "helpfulness": "0/0", "author": "Monica Holguin"}, {"rating": 1.0, "review": "I bought this solely for the app PLEX, for which I have on a server and wanted to stream to my TV.  What a disappointment that I would be required to pay $4.99 for the PLEX app to be loaded when the advertisement shows PLEX installed, alluding that it's pre-installed.  This tool is ALL ABOUT PRIME.  It streams info from your Amazon account but only after you have to endure the cheesy video start and no way to skip it.The only cool feature is the packaging -- professionally packaged.I will be returning mine immediately.** Added **Amazon, FireTV, and affiliate company employees, family or friends -- please refrain from dumb or snarky comments.  If the box says PLEX on it and there's nothing online OR ON THE BOX that says, not all apps are FREE or INCLUDED, then AMAZON has committed FALSE ADVERTISING.  I have a smartTV.  It has everything but PLEX.  I thought I bought the BEST after thoroughly researching the various devices.  I failed to identify fraudulent advertising practices and now I have learned.  The solution is simple.  I'll attach my netbook and stream my PLEX server offsite to my TV through the netbook's HDMI output.Geeks find solutions.", "verified": true, "helpfulness": "1/1", "author": "Majkboy"}, {"rating": 1.0, "review": "Doesn't work with direct tv or comcast cable....worthless", "verified": true, "helpfulness": "1/2", "author": "Robert"}, {"rating": 5.0, "review": "When I saw them for pre-sale I figured \"Eh, 20 bucks, I'll give it a shot\" I'm definitely glad I did.  Since I bought this for myself the setup was a breeze.  Had my info ready for me so it was really just a simple as connecting it to my wireless network.  I have a Chromecast and find this to be far more versatile.  Prime, Netflix, and Pandora are what I use it for and it's really easy to set up.  The remote is nice and simple to use.  Plus having the Fire TV app on my phone gives another choice for remote.", "verified": true, "helpfulness": "0/0", "author": "Matt Smith"}, {"rating": 5.0, "review": "I'm so glad I purchased this! Definitely would advise everyone to get. Easy to use and my kids love it!", "verified": true, "helpfulness": "0/0", "author": "Yvette A. Herrera"}, {"rating": 5.0, "review": "Fantastic! I love it! It runs very smoothly and has lots of great apps and games. Great buy.", "verified": true, "helpfulness": "0/0", "author": "Jamie Sellers"}, {"rating": 5.0, "review": "We love it. Cancelling comcast!", "verified": true, "helpfulness": "0/0", "author": "Zilla"}, {"rating": 5.0, "review": "love them", "verified": true, "helpfulness": "0/0", "author": "boyd mckinney sr."}]