[{"rating": 1.0, "review": "This product is not working on my Sharp tv (model LC-26SB24U).  The initial amazon screen appears then goes away as if the device were disconnected. My chromecast works just fine in the same HDMI port which shows that it is a problem with the fire stick, and not my TV.I was able to get it working on a friend's Sony TV (I don't have the model number) and it's actually pretty nice.  However, if they don't fix the compatibility issue, I will have to return it.  I would rate the product at least 4 stars if there wasn't compatibility issues.", "verified": true, "helpfulness": "2/4", "author": "Scott"}, {"rating": 5.0, "review": "Loving my stick!  Very easy to set up and use. Got it with the special $19.99 and my only regret is that I didn't take full advantage and bought two.", "verified": true, "helpfulness": "1/2", "author": "L. Komidar \"Lisa\""}, {"rating": 1.0, "review": "I really wanted to like this. But I can't even get it to work. Either it can't connect to my wifi, which I get a 30 Mbps so it should connect. Or if I can get it to connect the screen turns a bright green and flips. We are giving it one more day of trying to troubleshoot and then if no success it will be returned.", "verified": true, "helpfulness": "13/21", "author": "Kelly"}, {"rating": 2.0, "review": "If only it would update. WTF out of the box it needs an update and won't work I have two and I wish I could see how well it works ;(", "verified": true, "helpfulness": "3/6", "author": "Thomas J Meehan"}, {"rating": 1.0, "review": "Disappointed with what this device all about. I thought it will beat the chromecast and ordered couple one for friend and myself. It is leased 14 months after chromecast and feel like old technology. The only good thing it is different from Chromecast is that you can watch amazon instant old movies you have watched when you where in little only if you are prime member.Pros: This device make me thankful and appreciate chromecast.Cons: 1: You have to log in to your subscriptions on the fireTv Stick (Stink/stuck).  2: Only powers up from wall power adapter - chromecast from my TV usb port  3: I paid half but if you are getting at full price, the cost is 4 times than it should be.  4: Logging into your subscriptions on the fire TV STINK is not fun. For chromcast you log in on your tablet/smart phone/ computer and just throw to your TV.  5: The doggle is long stick out on the side of TV.I don't know if I need for it since I don't watch prime videos anyhow.", "verified": true, "helpfulness": "0/12", "author": "Abba Firaa"}, {"rating": 2.0, "review": "So far this thing won't work.  It just sites there... seemingly attempting to update.  I'm looking at my WAP and watching traffic go out to Amazon to try to get the update that it SHOULDN'T EVEN NEED out of the box.So since it doesn't work, I can't give it a score above crap.UPDATEDI'm moving the score up to a 2/5.  After two days of fighting with updates (35 individual tries) it finally connected and downloaded the update.  It took quite a few more tries to get it to connect to both Netflix and Hulu.  The device randomly drops its wireless connection regardless of which service or app I'm using.  None of my other wireless devices demonstrate this... quality...  Including my Chromecast which operated flawlessly for months (I removed it so that interference would not be an issue).  Being a network engineer, I did some research on my WAP (Cisco 1140) and found that data is getting transmitted to the Fire Stick, so the problem is most likely that its radios aren't working or that it just doesn't like my WAP.", "verified": true, "helpfulness": "3/14", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Do you have Amazon Prime? If yes then buy this thing. I'm being several (eventually four), one to replace each aging Roku that I have for each TV. It's slim, elegant, fast, true HD, great sound, all the apps you'd expect. I guess the only con at this point, which is not a Fire Stick problem, but an Amazon Prime Instant problem, is I'd like a different watchlist for my wife, but I guess her light sitcoms and musicals won't cootie up my documentaries!", "verified": true, "helpfulness": "1/2", "author": "Prof Wombat \"Prof Wombat\""}, {"rating": 4.0, "review": "Great little product, but a couple of small issues that knocked it down a star. I'm sure by now you saw all the things it can do and I have noting to add, so I'll just stick to the cons:The product is brand new, so I was surprised when I initially plugged it in and it took 10 minutes to download updated software. The time it took was on my end, but this thing was just released, so having to do an immediate update was annoying.The app on the phone has a quirk: the swipe action isn't a swipe. If you swipe up, it's actually like hitting the up button. A swipe up action typically moves something like menus or lists downward.One pro I would like to add: if your TV has a USB service port on it, IT WILL power the device just fine. My TV is wall mounted so I had no way to run another cable up. It gave me a warning, but I saw no issue after using it for the day.", "verified": true, "helpfulness": "1/2", "author": "FadiTara"}, {"rating": 2.0, "review": "So I am editing my review and seriously dropping it's rating after a couple days of use. Out of the box this thing seemed like a gift unto the world. The setup was quick and easy, the horsepower seemed pretty stout, and the apps seemed endless. That is all well and good, but upon trying to watch Netflix video the first night it would stall and try reloading and fail. Being just one time I figured it was just a fluke and maybe my WiFi signal dropped out.Cutscene to 2 days later and my \"Fire TV experience\" has been riddled with loading errors and stall outs, both on Netflix and Amazon video (like I cannot make it through a single 22 minute TV show without it stalling out). Of course, I didn't want to blame my beautiful brand new device, so I checked the wireless ability on my other streaming devices and everything else in the household streams absolutely fine, so I can rule out issues with Netflix and Amazon servers at this point. Next I figured maybe the Fire TV Stick was not close enough to my wireless hub (it is the closest device to the hub in the house), so I checked the wireless signal at the Fire TV Stick and found the signal was at full strength there... So now I can rule out my wireless hub. That leaves one culprit left, MY BRAND NEW HIGHLY ANTICIPATED AMAZON FIRE TV STICK! The thing just doesn't work!This is such a fundamental device issue that it should not have made it past the beta testing phase for this device. Bad Amazon, bad!You owe me some answers Amazon!", "verified": true, "helpfulness": "0/3", "author": "Joshua Van Raden \"Joshua C.\""}, {"rating": 5.0, "review": "...The headline was hard for me to say. Up until now- I've considered the AppleTV to be the best streamer available. Roku is 'meh' (I just don't like their interface), and I completely gave up on Chromecast, which I could never get to work consistently. I bought this on a whim when it was on sale for Prime subscribers. I honestly wasn't expecting much more than Chromecast with a remote. I'm very-very impressed. It took about 15 minutes to set up because I had to find a way to plug it in and it had to download updates, but once it was online and I made it through the intro video- I was amazed at the ease of use and performance of this little stick. So far- I've only used it for streaming Prime movies and Netflix, but both load incredibly fast and stream beautifully with Dolby Digital surround. There is almost no buffering time, it doesn't lock up when fast forwarding or rewinding (as AppleTV seems to do frequently). The remote and user interface is intuitive and easy to use. All-in-all- it is an incredible bargain.If you aren't heavily invested in Apple's ecosystem (as-in don't have a ton of movies and TV in iTunes), I very highly recommend this, or it's big brother. Even if you are- this is great as a secondary streamer or for other TVs around your house.My only complaint is actually the power. It is recommended in several places to use the power adapter, so I'm assuming the fast processor and memory in it are a bit too much for the USB plug on the back of many TVs. The power adapter itself is small overall, but was a bit too fat for me to plug into a power strip next to another plug. I would have preferred a more standard power brick with a smaller footprint on the plug side, and a longer cord. I had to add another extension cord to plug it in (I'll come up with something better later). I'd prefer to be able to run it from the TV's USB, but also want a good experience from it. In any case- it's a minor annoyance that isn't worth removing a star.So- if you are new to streaming or looking for an alternative, especially to Chromecast or Roku, but also perhaps AppleTV- definitely consider FireTV (I'm assuming the full-size one has similar performance).", "verified": true, "helpfulness": "1/2", "author": "Wolf I. Butler"}]