[{"rating": 3.0, "review": "Promising and low cost, but it isn't ready yet. Constant crashing and limited apps make it not ready to oust my chromecast yet.", "verified": true, "helpfulness": "2/2", "author": "Michael Delaney"}, {"rating": 1.0, "review": "The stick doesn't hav a good enough receiver to log into our wifi in the bedroom where we wanted to use it. Our kindle fires, iPhones and laptops have no trouble getting signal in that same room. Stuck can find our wifi, but not connect to it.  They may send a replacement. If that works I will update the review but given how extensive their suggestions are for improving reception, I'm not too hopeful.", "verified": true, "helpfulness": "1/1", "author": "Prime buyer DC"}, {"rating": 5.0, "review": "For what you pay, this is a really good product.", "verified": true, "helpfulness": "0/0", "author": "M. McKay \"weimaraner dog owner\""}, {"rating": 3.0, "review": "I assumed that I could share my screen from my computer or project apps from my iphone to the FireTV but neither are true (as of 11/28/2014). Hopefully they'll be able to get this functionality added soon, otherwise this really is just a way to watch amazon prime content.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Less lagging and Much better than chromecast", "verified": true, "helpfulness": "0/0", "author": "nick"}, {"rating": 5.0, "review": "This is GREAT!!! I have always run with a home theater PC and picked this up to replace the HTPC in my family room. With Plex installed this does everything I needed the HTPC for and saves a ton of space.", "verified": true, "helpfulness": "0/0", "author": "osness"}, {"rating": 2.0, "review": "It's ok. But why can't I download things that are not pre installed? How the heck can I download other apps like Facebook?  I'm returning it to the store if I can't download anything but what's already on there.", "verified": true, "helpfulness": "1/2", "author": "Tlg78"}, {"rating": 4.0, "review": "It didn't work at first, my connection wasn't strong enough.  I think it would work fine with cable.", "verified": true, "helpfulness": "1/3", "author": "BSnow"}, {"rating": 5.0, "review": "Bought for my disabled mother. Its the easiest thing ever for her to use.. thanks", "verified": true, "helpfulness": "0/0", "author": "Autumn Adams"}, {"rating": 3.0, "review": "Setting up was pretty easy. Very similar to my roku. Biggest downfall is the music. Can only play Amazon music. And getting that set up is a pain. No pandora, slacker, iheartradio, etc.Update: Found Pandora, iheartradio, etc.  They are listed under apps.  Not categorized under music.  So, while I do have access to them, it's not intuitive to find.", "verified": true, "helpfulness": "0/0", "author": "ladydi2196"}]