[{"rating": 1.0, "review": "Never ordered this item", "verified": true, "helpfulness": "0/3", "author": "Ellen Matza"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "pamela w."}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "David stitt"}, {"rating": 5.0, "review": "Decided to try the Fire TV Stick to stream Netflix. Very easy setup, only took about 3 minutes! I was concerned it wouldn't work well since our Internet service is a bit flaky, but I've been using it about a week and so far it works great! I haven't used it for Netflix yet, because I have Amazon Prime and there are plenty of movies and other things to watch. I would highly recommend this product!", "verified": true, "helpfulness": "0/1", "author": "Linda"}, {"rating": 5.0, "review": "Yes. Saving me tons a year on cable!", "verified": true, "helpfulness": "0/1", "author": "Terri Elliott"}, {"rating": 4.0, "review": "Good, so far.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customary"}, {"rating": 2.0, "review": "My chromecast streams faster", "verified": true, "helpfulness": "0/1", "author": "michael swan"}, {"rating": 4.0, "review": "Easy to setup and use. Content fair. It seems to be on par with netflix. They need to step it up with movies and specials from HBO, etc...", "verified": true, "helpfulness": "0/1", "author": "Dan nicholas"}, {"rating": 5.0, "review": "Extremely easy to use.", "verified": true, "helpfulness": "0/1", "author": "Irene Rodriguez"}, {"rating": 4.0, "review": "LOVE IT!  So easy to install. So excited also about HBO Now & Showtime Anytime you can purchase and access on Fire Stick through Hulu! Slowly but surely saying GOOD BYE to high dollar big box cable corporations!!! Yeah!!!! Big Box I am currently with charges $10 each for these but now I pay $7.99 each, it all adds up!  Already saving big bucks by cancelling all those channels I don't use.  One kind of strange thing however, I also purchased a 2nd Fire Stick and when I tried to pair that remote with the 2nd T.V. it wouldn't work.  So I took that 2nd remote out to the 1st t.v. and tried to pair it there and it worked then.  THEN the next time I got around to watching the first t.v. that remote would not work and the 2nd one still was.  How strange is that?  I had to delete the Fire Stick from the first t.v. and reinstall it and then it was fine. The one and only reason I did not give these Fire Sticks a 5-star rating is the fact you cannot \"surf\" the web with it like co-Star (Vizio) can do.", "verified": true, "helpfulness": "0/1", "author": "Celeste Costello \"Pacchiraku\""}]