[{"rating": 5.0, "review": "This product works just fine with my entertainment system and I am to access Netflix online with no problems.", "verified": true, "helpfulness": "0/0", "author": "E D WILFORD-SAID"}, {"rating": 5.0, "review": "Works fine, only had it a short time so far.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "it took me a little longer than expected to set up the Fire stick but it worked out.", "verified": true, "helpfulness": "0/0", "author": "Margaret Hylant"}, {"rating": 1.0, "review": "Video skips frames constantly. Tested on multiple devices and configurations, with verified high bandwidth. Tried 2 different Fire TV sticks, exact same issue with both.", "verified": true, "helpfulness": "0/0", "author": "thereviewer"}, {"rating": 1.0, "review": "The fire stick looses connection.  It seems like it overheats and I have to unplug and leave it alone for several hours.  I bought one for a frien too and th", "verified": true, "helpfulness": "0/0", "author": "Regina Burke"}, {"rating": 5.0, "review": "I have really enjoyed the Fire Stick. I have tried various products (Roku, Chromecast, WD TV) and this is my favorite so far. It plays shows nicely. Is quite fast at processing clicks and it is fun that there are games!", "verified": true, "helpfulness": "0/0", "author": "Jessica H"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Antonio green"}, {"rating": 5.0, "review": "Absolutely love it! Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "ssantos"}, {"rating": 5.0, "review": "I love this stick and it is great for streaming services. Most benefits come from using it in conjunction with an Amazon Prime account. I just wish that the stick was able to pair to bluetooth headphones. Besides that, this device is great.", "verified": true, "helpfulness": "0/0", "author": "Catherine"}, {"rating": 5.0, "review": "Works great. Easy setup. It made a good birthday gift for my friends.", "verified": true, "helpfulness": "0/0", "author": "Hillary Buck"}]