[{"rating": 4.0, "review": "I think I love it, but not as many shows are free as originally suggested. Example, Insidious was free, but we have to pay for the rest, most old TV series we have to buy or subscribe to Hulu, etc. when I already subscribed to Prime.. not fair.", "verified": true, "helpfulness": "0/0", "author": "Slackers4"}, {"rating": 5.0, "review": "Fantastic product. Quick streaming with lots of options.", "verified": true, "helpfulness": "0/0", "author": "Kathy Davidson"}, {"rating": 5.0, "review": "So far this is working great. I got this to replace the messed up RUKU and it has been ten times better. It loads fast and has a great picture. Great for the price", "verified": true, "helpfulness": "0/0", "author": "Denise Dameron"}, {"rating": 5.0, "review": "The order was at the door within 2-days.  Easy to hook up and use.", "verified": true, "helpfulness": "0/0", "author": "A. Purpura"}, {"rating": 5.0, "review": "Just what I needed in my kitchen so I don't have to watch cartoons!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this because Amazon sent me an email saying hey look at me I'm on sale and super cheap. And all I can say to that now is thank you Amazon. I like the fire stick better than my Roku 3. I have less issues with connectivity on my fire stick than my roku, and my roku is hardwired to the modem. The roku is more prone to crashing than the stick. The stick is farther away from the router and can be laggish but for the must part is super easy to use. And they updated the search. I can search and be told to watch a program on Hulu. I may need to replace Roku.", "verified": true, "helpfulness": "0/0", "author": "truelorax \"tru\""}, {"rating": 5.0, "review": "This is the easiest device you will ever set up!I was watching Amazon Prime TV in just over 60 seconds!I highly recommend the Fire TV Stick over the Google Chrome cast device.", "verified": true, "helpfulness": "0/0", "author": "shopping sid"}, {"rating": 1.0, "review": "Not user friendly..", "verified": true, "helpfulness": "0/0", "author": "Princesslaya \"Princesslaya\""}, {"rating": 5.0, "review": "My Samsung \"smart\" TV does not have the Amazon Prime application and it is not even searchable  in the Samsung apps! I really wasn't utilizing my Amazon Prime account to its fullest because of this.  I really don't like to watch movies or TV shows on my laptop. So the Fire TV Stick was the answer. It is so easy to use. Just plug it into the HDMI on the TV and plug in the included power chord. It was already registered and I got a \"Hi, Linda\" greeting right away. No other installation of any electronic device has been so easy to set up. I began exploring right away. I don't know why I waited so long to do this. I always have something to watch now and I love the original programming too. Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "LC McDEE"}, {"rating": 5.0, "review": "😎😎😎😎😎", "verified": true, "helpfulness": "0/0", "author": "ricardo zuloaga sanchez"}]