[{"rating": 1.0, "review": "Twitch app is terrible. Seems to only support low quality streaming, not 1080p hi-def. No search functionality. No favoriting or user login. No chat.I would have expected more from the Amazon-owned Twitch and their own TV streaming stick.", "verified": true, "helpfulness": "1/3", "author": "Anonymous Amazon Review"}, {"rating": 5.0, "review": "Super Simple to use - my only complaint would be it doesn't come with the voice remote (I hate typing out the search on screen).  I had a Roku and a Blue Ray player that I used to use for Netflix, etc.  and this is much faster and much easier than both.  I highly recommend it.", "verified": false, "helpfulness": "0/0", "author": "tracy gamboa"}, {"rating": 5.0, "review": "Works great. Bought it for netflix and Hulu, both load fast.", "verified": true, "helpfulness": "0/0", "author": "JennM"}, {"rating": 5.0, "review": "Wow, way better than the Chromecast in my opinion.  I bought this after the chromecast broke.  Im glad i did, once the 10-15 min update went through its been running flawless.  The menus are very easy to understand.  The only minor gripe is that it would be cool if Google could've included the voice remote (I know you can buy it for extra).", "verified": true, "helpfulness": "0/0", "author": "quackslayer"}, {"rating": 5.0, "review": "I love my amazon strick!! Perfect for movies and movie night", "verified": true, "helpfulness": "0/0", "author": "Stephanie Goins"}, {"rating": 5.0, "review": "IT WAS QUITE EASY TO SET UP - PROVIDING THAT:  YOU HAVE WI-FI; YOU REALIZE THAT IT'S THE WI-FI PASSWORD BEING ASKED FOR ON THE SCREEN; AND THAT THE HDMI EXTENSION IS NOT OPTIONAL - YOU MUST USE IT!  ONCE ALL THAT IS REALIZED, IT WORKS GREAT.  I ALREADY WATCHED 7 HOURS OF THE HBO SERIES ABOUT JOHN ADAMS WITHOUT ANY PROBLEMS.  ALSO - THE REMOTE, WHILE TINY, WORKS BETTER FOR FAST-FORWARD, PAUSE, ETC. THAN THE BIGGER REMOTE FOR MY SMART TV.  I'M GLAD I BOUGHT IT AND WILL PROBABLY GET ONE FOR MY DAUGHTER.", "verified": true, "helpfulness": "1/1", "author": "SASSY"}, {"rating": 2.0, "review": "I finally got the Fire Stick and I was very excited. But now I am having problems where the thing freezes up either while you are browsing or just watching netflix. The only way to fix this, is to unplug it from the power cord and plug it back in. I bought this thing for two reasons, one, because my girlfriend don't know how to use my playstation 3 and she likes to watch her shows on the bedroom, so I was going to get the Roku stick. Instead, I decided to give this a try. Second, it was the promotional prize for being a prime member, so for $20 can't go wrong. I am looking to return this Fire Stick soon. Not sure if there is a fix for this or anyone else is having the same problem.", "verified": true, "helpfulness": "0/0", "author": "Cris0911"}, {"rating": 5.0, "review": "Super fast streaming. Recommend to any amazing prime users.", "verified": true, "helpfulness": "0/0", "author": "Caleb Abeyta"}, {"rating": 5.0, "review": "Easy to use. great solution for a \"non\" smart TV.", "verified": true, "helpfulness": "0/0", "author": "green girl"}, {"rating": 5.0, "review": "It's working great and has a fast processor.", "verified": true, "helpfulness": "0/0", "author": "robert"}]