[{"rating": 5.0, "review": "OMG this is awesome to have!! It might get me in trouble though.When im suppose to be working im playing games or looking for shows or movies.It was delivered sooner than they said it was suppose to and that was awesome!!Thank you amazon for having such a good website to shop from!!!The cost was not bad at all for everything you get on it!!Thank you again!!", "verified": true, "helpfulness": "0/0", "author": "trooper"}, {"rating": 5.0, "review": "I've bought several smart TV boxes, and this is the best I've ever used. Apps are awesome, response is great and fluid, and the usability is excellent. It has everything I need!", "verified": true, "helpfulness": "0/0", "author": "Joshua Dulac"}, {"rating": 5.0, "review": "This stick is lightning fast! Wayyy faster than our roku. FIRESTICK is the way to go! Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Frances Forget"}, {"rating": 4.0, "review": "The device is great with Amazon items (TV/Movies, music, photos), not very convenient with any of the other apps.  I don't have a Fire TV to compare to, but compared to Roku and Apple TV its not nearly as responsive or fast, but then its a lot smaller and cheaper.  The stick is great when you want to keep wiring to a minimum.", "verified": true, "helpfulness": "0/1", "author": "M. Dembski"}, {"rating": 5.0, "review": "Only complaint is that the included remote is terrible. Install the Fire TV app on your smartphone and you'll have a much better experience.", "verified": true, "helpfulness": "0/1", "author": "Nick"}, {"rating": 5.0, "review": "works quicker that all of my other devices ps3,xbox 360, nintendo wii.... a+++", "verified": true, "helpfulness": "0/1", "author": "Eric Montambo"}, {"rating": 4.0, "review": "Note that you do need to have \"subscriptions\", typically via a cable or satellite company account number, to content providers (HBO, ESPN, etc.) in order to get full access to their content via this device.  I have also found that the Stick will not provide access to US content when in Europe.  However, it will work in most US hotels that have WiFi and where the TVs have a HDMI port.", "verified": true, "helpfulness": "1/1", "author": "Ricardo Cabeza \"R. Cabeza\""}, {"rating": 4.0, "review": "I only have 1 HDMI slot available on my tv. So I have to switch it out with Direc tv.Otherwise, it's great.", "verified": true, "helpfulness": "0/0", "author": "Phil Baker"}, {"rating": 5.0, "review": "Far better quality than having had the Chromecast....WELL WORTH IT and customizable too!!", "verified": true, "helpfulness": "0/0", "author": "Cj"}, {"rating": 3.0, "review": "When it can stay connected to the wifi network, the Fire TV stick works great.", "verified": true, "helpfulness": "0/0", "author": "Lindsey deMont"}]