[{"rating": 5.0, "review": "We love it!!", "verified": true, "helpfulness": "0/0", "author": "Lynn Norton"}, {"rating": 5.0, "review": "Easy set up and works great!", "verified": true, "helpfulness": "0/0", "author": "Curtis Gillespie"}, {"rating": 5.0, "review": "So easy! Catching up on all my favorite shows on Prime and Netflix. Takes up no space!", "verified": true, "helpfulness": "0/0", "author": "lorrie klimoski"}, {"rating": 5.0, "review": "We are enjoying it!!!", "verified": true, "helpfulness": "0/0", "author": "Mck2318 \"Tori Teacher\""}, {"rating": 5.0, "review": "Works perfect! Easy to set up and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Shawn Stroud"}, {"rating": 5.0, "review": "Worked exactly as advertised.", "verified": true, "helpfulness": "0/0", "author": "Gene"}, {"rating": 5.0, "review": "I love my Fire Stick! It does exactly what I needed it to do and works great!", "verified": true, "helpfulness": "0/0", "author": "Kylie Krick"}, {"rating": 4.0, "review": "I love this thing. The only downfall is that even with a prime account you are required to pay for shows that are free on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 5.0, "review": "I love the Fire Stick! We were looking for a resolution to get rid of our cable which kept going up in price month after month.  The Fire Sticker has been our savior!  It's extremely easy to use, connect and navigate.  I watched two complet seasons of the Amazon prime shows in one week- Transparent and Black Orphan.  Love the Fire Stick...waiting for them to come back in stock so I can get another one for one of my other TVs!!", "verified": true, "helpfulness": "0/0", "author": "Melanie M."}, {"rating": 5.0, "review": "Works exactly as described. The remote interface is excellent and responsive.My TV is built-in so I had to get a range extender (NETGEAR N300 Wi-Fi Range Extender) for my wireless network in order to connect.I strongly recommend using the web site to browse the offerings and create your \"favorites\" list.The TV browse doesn't have the real estate to do it well.", "verified": true, "helpfulness": "0/0", "author": "P. Hampel"}]