[{"rating": 5.0, "review": "I have the fire tv, which I've owned since its release, Roku 2  and now the stick.  I  can not see the difference as of now between the the fire tv and stick.  They both connect easily and responsiveness of the stick is solid.  The Roku stands out with many more apps, but I find the majority of the apps useless.  If you mainly use Netflix, Amazon instant, and Hulu I would recommend the stick.  I am starting to grow a library of purchased videos from Amazon and the stick also streams  them with no lag time at all.  Amazon is slowly getting me hooked on its ecosystem and its works well for my family.  No more lost or scratched dvd's and movies are always just a click away.", "verified": true, "helpfulness": "0/0", "author": "TODD"}, {"rating": 5.0, "review": "I followed instructions to the letter and in 5 to10 minutes it was up and running. I just sat back and watched it do it's thing.Once it was finished there was a small tutorial on how to get a round.Very easy to install and it works great. I even was able to get my kindle fire he to mirror up to the tv. Used kindle fires free app and everything on tablet now on tv. Movies music youtube,whatever you wanted to put up on your screen. Only thing you have to do is change your tv to hdmi 2 as that is where you put the fire stick to begin with. Just awesome , going to the movies now. My best MR.T", "verified": true, "helpfulness": "0/1", "author": "Robert R. Tiffany"}, {"rating": 1.0, "review": "First time I have written a review on any product and I make many purchases a week from Amazon. I purchased two of these devices and neither will set up correctly. Tech support tells me it's a wifi issue while my Apple TV is connected to the same tv and running normally. Wanted this to be able to view prime content on my tv easier. Extremely frustrated with this", "verified": true, "helpfulness": "1/2", "author": "Michael D Cisney"}, {"rating": 5.0, "review": "Super easy to install, love the music and gaming options.", "verified": true, "helpfulness": "1/1", "author": "traveling guru \"european traveler\""}, {"rating": 1.0, "review": "Got this as a gift. Connects to the internet wireless router in a snap, but gets really scary hot, will not update, and therefore will not work. It is going back. No more sticks. I'm getting a Roku 3, not the stick. I was really looking forward to it working. The website support was no help whatsoever. They gave support for the box, not the stick. The thing just doesn't have the reach. Too bad. Too hot to handle.", "verified": true, "helpfulness": "2/3", "author": "A. Mangini"}, {"rating": 3.0, "review": "ChromeCast users beware, you can't \"cast\" to this unless you have a Fire phone/tablet.  Disappointing amazon is holding out on this kind of functionality and claims they support Amazon Video where CC doesn't when it's completely their doing.Basically a Roku like device, not comparable to ChromeCast.", "verified": true, "helpfulness": "7/8", "author": "Shane McDaniel"}, {"rating": 4.0, "review": "Here's my first impression of the Fire TV stick after being one of the first to order and receive it. It arrived well ahead of the promised date by Amazon which was nice. At first glance, it is well packaged, trying to imitate Apple in some ways. It comes with its own USB power adapter, an HDMI extender cable about 4\" long, a remote control with batteries, and a small booklet to get you started.Connecting it was quite simple, just connect it to an available HDMI port on your TV or AV receiver, and connect the USB power adapter. One word of caution, you are not going to get away with using another power source, you NEED to use the included power adapter (or some USB adapter with sufficient power output) since standard USB ports on most devices do not provide adequate power for the Fire stick to boot up. This is unlike the Chromecast which will work using power from any USB port, but let's remember that the Fire Stick has more processing power and more memory, so it does consume a bit more power.One problem I had was trying to open the remote control to insert the batteries. The battery cover is insanely difficult to remove. They really need to fix that. Other than that, the remote is very comfortable to use with controls for Play/Pause, Fast Fwd/Rewind, Home, Back and Menu buttons, in addition to the usual Up, Down, Left, Right and OK controls. It is an RF-based control (not infrared) which means you don't have to point it at the TV to use it. This is nice because it means you can hide the Fire stick and not have operational problems with the wireless commands reaching the stick, but it also means you cannot program your universal remotes, like Logitech or other unifier control systems, to control the Fire stick.Another thing that was a bit of a problem for me was the mini-USB power port is located on the side of the stick. If your TV or AV receiver has HDMI ports aligned next to each other, this might be an issue if you connect something on the next available HDMI port, as the USB connector on the side interferes with the placement of something else next to it and won't fit quite well. If that's the case, you might end up having to use the included HDMI extender so the connectors are out of the way. The Chromecast, on the other hand, solved this by placing the mini-USB power connector on the end of the stick instead of the side.Under the hood, the stick runs a modified version of the mobile Android OS, and it boots very quickly once powered up. It only takes a few seconds. Upon your first start, it will walk you through connecting it to your WiFi network. After that's out of the way, it will ensure you have the latest firmware and will download it if necessary. You will spend a few minutes waiting for this to complete. Once done, it greets you with a welcome video that gives you a demo on how to use it. If you are new to these types of devices, I recommend you spend a few minutes watching it. You do need to register your stick with Amazon so that it connects to your Amazon account. I was surprised that mine already knew who I was so apparently, they had already pre-registered it to my Amazon account at the factory.The Fire Stick has an Android phone/tablet app that works quite well. It is useful to enter text when you are searching for videos, or if you want to use voice commands. Unfortunately, no app for the iPhone/iPad yet, but they say that's coming soon.Browsing the Fire stick menu interface is easy. It is well polished and easy to follow. I did find it would lag sometimes, but its overall response was very good. I found that you can play Pandora or iHeartRadio music while browsing other apps or menus, however, this kind of multitasking slows down menu navigation. It is not as snappy as the Apple TV, but like the Chromecast, the Fire stick has a screensaver.The Chromecast is just a casting stick so you need to rely on your smartphone and use its battery to watch or listen to anything because the Chromecast has no menus or interface that you can navigate. Since the Fire Stick has its own interface, you can browse and stream content independently from your phone. On the downside, you cannot cast anything reliably from your phone Android or iOS to the Fire stick. Don't count on casting anything from your iPhone, it ain't gonna work. However, there is some functionality for casting what you have on your Android phone or tablet to the Fire stick, but it looks like it is in beta stage as it doesn't work quite well. During my test from a Samsung Galaxy S4, sometimes video would freeze, was choppy and colors got distorted. On the Chromecast, casting from your phone works so much better. There are some apps on the Amazon app store that you can buy and install to the Fire stick to get casting functionality, but as I said earlier, they are poor in performance.One good thing about the Fire stick is that you can download and install apps and games, something you cannot do on Apple TV. However, I was disappointed that there is no HBO GO app for the Fire Stick, although it is available for the Fire TV and other platforms like Chromecast and Apple TV. Maybe it is too early and this will be available in the future, but this is only a guess. For the most part, the availability of apps on the Amazon store is pretty lacking compared to the competition, but this is to be expected from any new product in this game. Amazon is fairly new to this. One of the best apps I saw is the Plex app for the Fire stick. I happen to have a Plex account and a server and I found the interface very nice and responsive. It makes for a nice media center experience. Too bad the Plex app is not free. The possibility of having 3rd party apps for the Fire stick will be a huge advantage over the Apple TV in the future. It does come with the Pandora, iHeart, Hulu Plus, and TuneIn apps already installed plus a few others, but you can explore and download other apps to enhance the stick's functionality. Aside from this, if you are an Amazon Prime member, you get nice perks. You can watch all of your Prime content and rent content as well.If you are concerned about your passwords, keep in mind that when typing in password fields in the Fire Stick, they are not shieled from view like just about any password field you encounter in any computer or device, so anyone watching the screen when you are typing your Pandora password will be able to see your password. Although not a big issue, I found this very odd and I hope they fix this in a future firmware update.The settings menu is very rich in features and you can control many aspects of the stick, from account registration, to sound and video settings, to parental controls, and even to close apps running in background memory or uninstall them. I was surprised that there seems to be no command to reboot the stick. If it ever starts misbehaving like any modern device does every now and then, it is good to be able to reboot it. I was forced to just unplug it in order to reboot it. It has a command to put it in sleep mode, although it will go to sleep on its own after 30 minutes of inactivity.I am not sure if this is Amazon's network fault, but I found that streaming Amazon Prime content was slow and had poor quality at least at the beginning. It did not look HD at all, although the video clears up about a minute of watching. It is possible that when I tested this Amazon servers were bit slow, but I thought that was odd since I have a 50 mbps connection and I am able to stream videos from other sources quite well in HD.Overall, I find the Fire stick a more powerful stick than the Chromecast, but it lacks in its casting abilities. It's navigation performance and response are quite good and it is more flexible than the Apple TV. I like the fact that it has a built-in interface and allows you to access all your Amazon-purchased content, plus all the content you are entitled with the Prime membership, plus 3rd party apps. I find it is too early to judge the Fire stick as far as app functionality, but overall, it has great potential.", "verified": true, "helpfulness": "11/11", "author": "Mario"}, {"rating": 2.0, "review": "It will not load an entire show from amazon prime without stopping and buffing. I have put my own PC on the same wireless network and had no issues with streaming services. I don't know if its do to all the wireless networks around me that it does not like but all my other devices work and play just fine.", "verified": true, "helpfulness": "0/1", "author": "Michael Lacey"}, {"rating": 3.0, "review": "Miracast not working on the 2 devices I tried until that's fixed it's no better that Chromecast from what I can tell.Another shortcoming is that it doesn't allow you to ignore the EDID coming back from the TV and simply pass through Dolby 5.1 or Dolby Plus so I can get my playbar to play it. I know the TV is capable of passing it through because my comcast RNG110 does it just fine when I set it from default to do pass through and this is despite samsung advertising EDID that it only supports 2 channel. So it can be done..Hopefully they can update firmware to support both of these features properly.", "verified": true, "helpfulness": "0/0", "author": "K. Boyce"}, {"rating": 2.0, "review": "Disappointed that Netflix isn't working right.  Lots of complaints inside the actual Netflix app page on Fire so I'm not sure if this is a Fire Stick issue or just an issue with the app.  Prime runs just fine and ESPN works fine. ESPN availability is what gives this an extra star.  There aren't many apps which might change down the road.The other reason I am giving it so few stars is that my Moto X won't connect with the Fire Stick. Two big frustrations and it's back in the box. I'll give it another try in a couple of months. Keeping my hopes low.", "verified": true, "helpfulness": "1/2", "author": "Mike Rohrig"}]