[{"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Keith J WAGNER"}, {"rating": 5.0, "review": "Love it. Easy to use. I was concerned about \"buffering\" issues but there are none. So happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy set up & very easy operation. If you can maneuver through the regular Amazon site then you can easily fumble your way through the fire stick. Also there is an app for your phone which you can control the stick.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 4.0, "review": "Exelent !!", "verified": true, "helpfulness": "0/0", "author": "Silvina Veronica Lopez"}, {"rating": 5.0, "review": "Works great..", "verified": true, "helpfulness": "0/0", "author": "Mickey Cohen"}, {"rating": 5.0, "review": "This thing is amazing. So happy with it, because I was worried it wouldn't meet my expectations. Perfect for watching Netflix and Amazon Prime.Only thing I wish it did was actually turn off!", "verified": true, "helpfulness": "0/0", "author": "Katey5678"}, {"rating": 4.0, "review": "I have only had the Amazon Fire TV stick for about a week now, but so far so good.  It was super easy to set up and it works just as good as my smart TV.", "verified": true, "helpfulness": "0/0", "author": "Poetry"}, {"rating": 3.0, "review": "Does not have as good of an interface as its competitors. Layout is nice, but hard to find things on Netflix. Lacks programming options of Roku or Apple. Roku still leads the way.", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 4.0, "review": "Overall, I am quite satisfied.  However, did not like that it said I would have a free trial of Prime, but when I went to activate it, it actually charged me a year's subscription right out of the gate.  I am also wishing could find more movies with Prime services, but seems most movies need to be 'rented' and paid for.  Also noticing Hulu movies stutter on this stick.  Not sure if a Fire Stick issue or a Hulu issue.  Overall, still happy with the access and would recommend.", "verified": true, "helpfulness": "0/0", "author": "Christina Zrust"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Chris Buescher"}]