[{"rating": 4.0, "review": "I would love to give this a 5, unfortunately given the staggering problems with the wifi giving it a 4 is being generous. It's a fantastic device but almost unusable with out steady wifi.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "This is great.....makes it easy to watch Netflix on our older TV that is not a Smart TV.  Very reasonable price and simple hookup.", "verified": true, "helpfulness": "0/0", "author": "Hope M LaRocque"}, {"rating": 1.0, "review": "I did not see any where that I had to paid for every movie and TV show. Your advertisements make it sound that the fire stick was all you needed. Greatly disappointed. I have a Smart Flat Screen with Netflix and Hulu included for $17 a month. Your movies would cost a more a month. Fire Stick is no bargain, if it sound to good to be true then it's probably not. NOT", "verified": true, "helpfulness": "0/1", "author": "William A. Tyler"}, {"rating": 5.0, "review": "Love it just wish you could surf the web on it as well.", "verified": true, "helpfulness": "0/0", "author": "Brittney"}, {"rating": 4.0, "review": "Would be 5 stars if this were like a flashdrive and were wireless.", "verified": true, "helpfulness": "0/0", "author": "John OBrien"}, {"rating": 3.0, "review": "should open the options for latin america as they have other devices that would guarantee them a greater acceptance for this market , your device is good only lacks this to be excellent", "verified": true, "helpfulness": "0/0", "author": "ezequiel montero"}, {"rating": 5.0, "review": "IT IS GREAT!  USE IT DAILY", "verified": true, "helpfulness": "0/0", "author": "DWE"}, {"rating": 5.0, "review": "Great device, my tv is smart now", "verified": true, "helpfulness": "0/0", "author": "ART LIGGINS"}, {"rating": 4.0, "review": "Works great Evan with the slow internet speed I have.", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "Everyone in the family loves it", "verified": true, "helpfulness": "0/0", "author": "terry johnston"}]