[{"rating": 2.0, "review": "At this point I am not sure...", "verified": true, "helpfulness": "0/0", "author": "Sue Ducato Sarno"}, {"rating": 5.0, "review": "Very easy to install and use even for the technology illiterate like myself!", "verified": true, "helpfulness": "0/0", "author": "Wanda S. Sokolowski"}, {"rating": 5.0, "review": "As much as I like my chromecast, I might like this better. Its fast, the video quality is good, and having built in apps is a big plus. There seems to be less lag time, and a dedicated remote is more responsive that using an iphone/ipad like you do with chromecast. Support for HBO Go would be the only improvement!", "verified": true, "helpfulness": "0/0", "author": "Katie G"}, {"rating": 5.0, "review": "Love it:)", "verified": true, "helpfulness": "0/0", "author": "Julie Wineman"}, {"rating": 5.0, "review": "I preordered the Fire TV Stick when it was released, mostly because of the attractive price.  It's currently installed on my bedroom TV and gives me access to everything I need (especially Amazon content) with my now smart TV.It's also small and portable enough for me to travel with.  You never know when a hotel you're staying at doesn't have access to good content on the TV.", "verified": true, "helpfulness": "0/0", "author": "NYC Reader"}, {"rating": 3.0, "review": "I love the small size and being out of sight convenience, with all cluttering around my tv. However, it is such a pain trying to watch Netflix videos. Amazon videos/movies streams seamlessly but watching a Netflix video is test of patience. It hangs constantly and gives multiple error messages before I can completely watch one movie. I have best of Internet speed and I doubt it is my wifi. I have multiple gadgets hooked to the wifi and all works without a hitch. I d/c all those gadgets from my home wifi and had only fire stick on, but still the issues with Netflix persists. On the otherhand, prime videos works just fine. Will look out for subsequent and better version but I am returning this.", "verified": true, "helpfulness": "0/0", "author": "Dechoe"}, {"rating": 5.0, "review": "I've been using it for almost a week. Set-up was extremely easy and the actual device is very user-friendly. The only minor area of improvement I'd suggest is that the volume stay consistent; different than my DVD player or other plug-in device, the play-back volume during movies can be fine during regular talking but very loud during action scenes. My settings are the same as when using other devices, so think it's specific to the Fire Stick (maybe it's a good thing with surround sound or additional technology?). Overall, 100% worth the low cost if you have an Amazon Prime account (although I'm disappointed that I couldn't buy/didn't get the offer to buy it for $19, since I've been a prime customer for 3 or 4 years, not sure how Amaxon selected people). Recommend buying.", "verified": true, "helpfulness": "0/0", "author": "FLColt"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Patrick D Jorgensen"}, {"rating": 1.0, "review": "Says Miracast Certified (which I guess is true) but Miracast will NOT work (at least yet) with Windows devices.  Just beware.  This was a primary reason I bought this.  I returned my fire stick and bought a Roku stick which does work (even though it doesn't say 'Certified').", "verified": true, "helpfulness": "1/1", "author": "Casey Lewis"}, {"rating": 5.0, "review": "Love this!! Can't even describe how much, it's just awesome!!love that I can see movies and shows and that I have such a wide variety,plus I can take it when I travel! Awesome all around!", "verified": true, "helpfulness": "1/1", "author": "redsoxgirl1016"}]