[{"rating": 5.0, "review": "Very good for tv control and my family loves it", "verified": true, "helpfulness": "0/0", "author": "ISAMU DORSEY"}, {"rating": 4.0, "review": "Had it just a week so far, but it has basically converted my older, \"dumb\" flat screen TV into a \"smart\" TV.", "verified": true, "helpfulness": "0/0", "author": "Michael I."}, {"rating": 5.0, "review": "Easy to setup. Great", "verified": true, "helpfulness": "0/0", "author": "Thomas Peck"}, {"rating": 4.0, "review": "Great, doesn't take up any room. Only downside is the prime music hasn't loaded for us.", "verified": true, "helpfulness": "0/0", "author": "Ange_T"}, {"rating": 2.0, "review": "Slow", "verified": true, "helpfulness": "0/0", "author": "Chris Johnson"}, {"rating": 5.0, "review": "Very good for Netflix and Youtube. I don't have amazon prime but it seems like a no-brainer to get this if you do have prime and watch tv/movies with it often. The Fire tv keeps a solid internet connection which is more than I can say for my chromecast. The up,down,left,right controls on the remote creak and feel cheap but it works. I am glad though that at least there is a remote included. The only really negative thing to say about this is that the Twitch app is garbage. You cannot log in or search which makes it virtually useless. Twitch is owned by Amazon now so this should be fixed asap. Otherwise I would definitely recommend this product. At $40 it's a pretty good deal but if you can get it for ~$25 it's a steal. Also you can power this via usb on your tv. Not recommended but it does work.", "verified": true, "helpfulness": "0/0", "author": "Starburner"}, {"rating": 5.0, "review": "Only used it for one night so far but im already happier with my experience than with my Roku Streaming Stick. Now only if i'd get accepted to purchase a Echo.", "verified": true, "helpfulness": "0/0", "author": "Zarren Nebel"}, {"rating": 4.0, "review": "The Fire TV Stick was fairly easy to set up. My only complaint is that I had to input my wi-fi password multiple times during setup. My guess is that the software updates wiped out anything that had been entered previously, necessitating the re-entry of the wi-fi password. Having to do it four times was a bit much, thoughOther than that, the Fire TV Stick works fantastically well! I wish searching included non-Amazon sources, but maybe that will come later.It is definitely worth the money!P.S. Make sure you have a spare outlet for the USB power adapter near your TV. Better yet, use a surge protector for your TV and the Fire TV Stick. ;-)", "verified": true, "helpfulness": "0/0", "author": "Don S. \"Hardcore Techie\""}, {"rating": 3.0, "review": "This device works okay.  My kids use it to watch Netflix.  However, I have  A few issues.  First off it is noticeably slower to load Netflix than some of my other devices (ps3, wii etc).  It seems to struggle a bit from time to time and even cuts out and requires us to start Netflix over.  I have had to power cycle is several times already especially on the 5g network. The remote is just too small for my man hands.  Fine for my little kids.  The device feesl crippled for anything non amazon and since I really just wanted a good device for Netflix and to rent the occasional movie this may not be a good fit.  I may return it to get a full fledged device.", "verified": true, "helpfulness": "0/0", "author": "Todd M. Wood"}, {"rating": 5.0, "review": "Easy to install...Love it.  Now I'm even more addicted to Amazon TV and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Bob"}]