[{"rating": 5.0, "review": "This offers way more functionality than the Chromecast and for the same price. I wish the voice controller was included, but understandable that it was not. Amazon needed to cut the costs somewhere. Also, if you have the application for your either your phone or tablet, then you can use the voice search functionality through that medium. Overall, this is an exceptional buy. Amazon has a gem on their hands with this one. The only downside I see is that search functionality is still only for amazon related content and not system wide. Once this changes, it will be a game changer for this little device. Roku already has this, now it’s time for the Fire TV Stick to follow suit. My recommendation is buy, buy, buy.", "verified": true, "helpfulness": "1/1", "author": "James Garland"}, {"rating": 5.0, "review": "I have been using a Roku stick on our main TV in the living room for over a year. It has worked very well for us. I thought I would give the Fire TV Stick a try and I am glad I did. I am using the Fire tv Stick in our bedroom with my Sony Bravia TV. I am a Prime member so it works well with all that prime has to offer Movies,TV show's ,Music.  It is very easy to set up and use. I feel like the HD image is better streaming from the Fire Stick than the Roku. I will be buying one for my mother for the New Year!", "verified": true, "helpfulness": "5/5", "author": "Starrider seven"}, {"rating": 5.0, "review": "I travel a lot and this little device packs away as easily as a thumb drive.  I have access to all things good (and some bad).  Love this.  Thanks for producing this.", "verified": true, "helpfulness": "0/0", "author": "Patti Bergerhofer"}, {"rating": 5.0, "review": "Nice and compact. Does the job. Installed on two different TVs and both work well.", "verified": true, "helpfulness": "1/1", "author": "Charles R. Myers, Sr"}, {"rating": 2.0, "review": "It's a great concept, but I've been having technical issues since I first took it out of the box, and support only gave me very generic restart-your-modem kinda answers, even though the problems have nothing to do with the connection. My main issue is with the Hulu application, which starts truncating the video when I watch it for long periods of time. It only truncates video, not audio, so it seems to be memory-related. Also, yesterday, out of the blue, buttons on the remote started malfunctioning too, and each click would correspond to something between 2 and 15 clicks, randomly.My recommendation: wait and see if they will be able to deliver a more stable product in the next few months. If you need something right now, a Roku box is definitely a safer pick.", "verified": true, "helpfulness": "1/3", "author": "Julio"}, {"rating": 4.0, "review": "Love that Amazon has this product.  It is great for us Prime Members!  The interface is good (not as good as the apple tv) and is really geared towards the Amazon Prime content more than the apps.  I with that the home screen had a dedicated \"apps\" section that allowed you to pin frequently used apps.It is just as fast, if not faster, to connect to content over wifi as my Apple TV.  And about a millions times fast than my Xbox and SonyBD units.Works as advertised.  Originally had the unit plugged directly into my tv, but because it sat to close to my cooling vents for my TV it overheated and would not work.  After 5 minute cool down, I reconnected with the extension cable to give it more \"breathing room\"  It has worked perfect since.  So watch that you don't let it get to hot!", "verified": true, "helpfulness": "0/0", "author": "C. Guido \"gweedoe\""}, {"rating": 5.0, "review": "hoodked it up myself, it was pretty easy.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Diane Shipley"}, {"rating": 5.0, "review": "Awesome.  Beats my chromecast by a mile.", "verified": true, "helpfulness": "0/0", "author": "John Powers"}, {"rating": 4.0, "review": "It's small and compact. I love how you can connect it anywhere on any smart tv or HDTVs !", "verified": true, "helpfulness": "0/0", "author": "Fernando Uraga"}, {"rating": 2.0, "review": "Some of the features did not work as advertised.", "verified": true, "helpfulness": "1/1", "author": "Dr. Gactjens Saint-Hilaire"}]