[{"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Traci Henry"}, {"rating": 3.0, "review": "Locked up a few times. Unplug power and  plug back in and it works", "verified": true, "helpfulness": "1/1", "author": "Greg Weber"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "John Johnston"}, {"rating": 5.0, "review": "great product, easy to install. only dont like to have to \"pay\" to stream so many programs, while am a member of prime. not totally 'free' streaming.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great product at a fair price", "verified": true, "helpfulness": "0/0", "author": "D. Dunigan \"Smokin'\""}, {"rating": 5.0, "review": "Great WiFi reception, great variety of shows", "verified": true, "helpfulness": "0/0", "author": "eak8807"}, {"rating": 3.0, "review": "The Fire TV Stick works identically as the Firebox on the television.  However, I was very disappointed with the extreme difficulty I had trying to remove the back cover of the remote to install the batteries. My husband was able to the following day when he returned home... I had to postpone my excitement until then. Another disappointment is not having the 'voice activation' for searching.  It has a very small 'toy-like' size and has a strange, light feel to it.", "verified": true, "helpfulness": "0/0", "author": "Barbara P"}, {"rating": 5.0, "review": "With Amazon prime membership we had the fire stick in less than two days. Plugged it in and connected to our wifi and in 2 minutes we were watching a movie. Great little device.", "verified": true, "helpfulness": "0/0", "author": "AHose"}, {"rating": 5.0, "review": "Awesome!  Now we can watch our movies, ect., on our big screen.  ( We were all using different medias separately.). Very easy setup.  Very easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Sherri L. Vieira \"sherrisarge\""}, {"rating": 5.0, "review": "very happy with all the items available right in our living room!!!!", "verified": true, "helpfulness": "0/0", "author": "crazy lady"}]