[{"rating": 5.0, "review": "Very easy to use and set up, especially for a technically challenged person as I am.", "verified": true, "helpfulness": "1/1", "author": "Detra Grey"}, {"rating": 5.0, "review": "We love our Amazon stick! No complaints", "verified": true, "helpfulness": "0/0", "author": "Nikki Morrison"}, {"rating": 5.0, "review": "A great gift, easier to use than a roku.", "verified": true, "helpfulness": "0/0", "author": "William R. Redmaster"}, {"rating": 1.0, "review": "I tried to get the Fire TV Stick to work on my spare television and it did not work. Amazon sent me a replacement device which worked on a television, but not the one I purchased the product for. The spare television has an HDMI input and should accept any HDMI device. I am returning the product.", "verified": true, "helpfulness": "0/1", "author": "Student and Worker \"Aspiring Follower of Jesus\""}, {"rating": 1.0, "review": "It worked for a week. I'm sorry but it's not a very good product. I have had Roku for years and years. And they still work.", "verified": false, "helpfulness": "1/1", "author": "David"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Lukasz Turolski"}, {"rating": 5.0, "review": "I Love this,so simple to install and BAM your on! I only wish you would have made it possible to preorder more than 1. I would have brought 3 more for christmas! Well I'll save for next year, My family will LOVE this !This is a must have! My only concern is the stick does get very hot,solution unplug when not in use!", "verified": true, "helpfulness": "0/0", "author": "patti knauff"}, {"rating": 5.0, "review": "It's fantastic!", "verified": true, "helpfulness": "0/0", "author": "E Prince"}, {"rating": 5.0, "review": "Set up was very easy.  System started right away and there have been no issues.  Have watched something every day since we received the stick.  Added a few games but I'm not really a gamer.  Been wanting a fish tank so I now have one from Amazon. Like the selection for TV and Movies and the picture and sound quality are very good.  Extremely happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I haven't used it much. But it was easy to hook up", "verified": true, "helpfulness": "0/0", "author": "Mary Tschirhart"}]