[{"rating": 5.0, "review": "Maybe the cheapest and most compact ways to get netflix and other streaming to your TV. We really love this. It was easy to set up and easy to use.", "verified": true, "helpfulness": "1/1", "author": "dfm24"}, {"rating": 4.0, "review": "Functions well on both TV and iPad. Movie selection could use improvement. \"Recently added\" section always seems to show the same movies indicating not very many new movies are added. The Fire Stick will give me the opportunity to view some movies which I would not have spent the money to rent. I am not totaly familiar with the Fire Stick yet - Amazon is as always looking for a review before I get a chance to use the Stick enough to develope an informed opinion about it.", "verified": true, "helpfulness": "0/0", "author": "William Marshall"}, {"rating": 2.0, "review": "Enjoy the music part. But the mivies and tv as advertised is cost..This was not apparent in viewing the product..Would not do again.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is so much better than the Chrome Cast.  I love being able to add apps to it for specific channels.  Easy access to Prime media, and all the other online media services like Netflix.  I am going to buy another one of these to replace my Chrome Cast in the bedroom.Update.  I have since purchased the Fire TV which is about the same, but with a few more bells and whistles.  One thing I have noticed about the Fire TV Stick, is that it quite often loses my Netflix account information, requiring me to log in quite often.  This is very annoying trying to type in a full email address and password without a keyboard.  I still love the Fire TV products, but I'm considering purchasing another Fire TV to replace my Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Cebob"}, {"rating": 5.0, "review": "I don't know how I lived without this item! So simple to set up! I normally take a forever reading and setting up electronics, this took me 10 mins tops, and that's cause I read the instrutions completely before touching anything! So many options, with a prime membership. Instant videos, music, u can also get apps, to play games! Access to netflix if your interested! I might down grade my cable package cause I have everything here!", "verified": true, "helpfulness": "0/0", "author": "jennifer cohen"}, {"rating": 5.0, "review": "I love this so much I bought 3 of them.", "verified": true, "helpfulness": "0/0", "author": "Gilpin Army"}, {"rating": 5.0, "review": "The quality of streaming is wonderful, and love the viewing selections", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Awesome device !!!", "verified": true, "helpfulness": "0/0", "author": "Henry Tejada"}, {"rating": 4.0, "review": "Had a issue with my first one but customer service sent me a new unit in just 2 days. This fire stick works great. i knew there were going to be defectives out there o well. But this fire stick is a nice public viewer when you dont have a smart tv. Will be buying another one again for family. highly recommend", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 3.0, "review": "This is definitely set up best for Prime members. Most of the content that it directs you to requires Prime or to be purchased from Amazon. There is free programming but it takes time to find and you have to download several apps and then \"activate\" them on a browser. It's a frustrating process. I use it mostly for Netflix and Youtube and it works well for that.", "verified": true, "helpfulness": "0/0", "author": "sneezye"}]