[{"rating": 5.0, "review": "This is a clever,  easy to use device that allows me to enjoy my prime movies and TV shows  on my ld tv .  Thank you,  who ever made this beauty", "verified": true, "helpfulness": "1/1", "author": "Linda S. Cosma"}, {"rating": 4.0, "review": "The stick works great and was easy to set up. It came in at a reasonable time. The packaging was fine and so was the price. It seems like it would be way better if I had a prime account, about the only benefit is using sling TV though I do have to pay for it each month just like all the other apps on the stick, I already have a Google TV with access to the internet.", "verified": true, "helpfulness": "0/0", "author": "savsan4"}, {"rating": 2.0, "review": "It's unable to add Vudu app which is very disappointing.", "verified": true, "helpfulness": "0/0", "author": "Mary Queen-Rogers"}, {"rating": 5.0, "review": "This item does everything it is supposed to do, had an easy setup process, is extremely user friendly, and works flawlessly! Needless to say it is my new obsession!!", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 5.0, "review": "Great piece of gear and reliable.", "verified": true, "helpfulness": "0/0", "author": "Matthew Olson"}, {"rating": 5.0, "review": "Great product , easy to set up and easy to use .", "verified": true, "helpfulness": "0/0", "author": "Johnny Bravo"}, {"rating": 2.0, "review": "It's ok.  Comcast is not on the list as a supported cable co for some apps. I do like that i can now stream Netflix on another tv... it is cool to have so many choices for something to watch.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "Yes", "verified": true, "helpfulness": "0/0", "author": "jesse l brown"}, {"rating": 2.0, "review": "Locks up while using YouTube and locks up navigating other apps sometimes requiring returning to the home screen and starting over.Prime music isn't really user friendly on this device and does not allow any type of search for music only a browse of playlist or music that has been added by a different device.", "verified": true, "helpfulness": "0/0", "author": "812b4"}, {"rating": 5.0, "review": "Works perfect easy set up!!", "verified": true, "helpfulness": "0/0", "author": "frank salcido"}]