[{"rating": 5.0, "review": "In response to the question, \"did the Fire TV Stick meet my expectations?\" I must truthfully answer no. It almost completely shattered my expectations. The menu and various other navigational controlls are exceptionally intuitive. I enjoy Netflix, hulu, and my Amazon prime accounts and have no complaints to date.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Does what it says and what I want.", "verified": true, "helpfulness": "0/0", "author": "Jerzon"}, {"rating": 5.0, "review": "It loads all the content quick and it works fine without any problems", "verified": true, "helpfulness": "0/0", "author": "kim martinez"}, {"rating": 2.0, "review": "The Fire TV Stick is okay.When it works well, it does everything that I want it to do. The inclusion of Prime videos is kind of disjointed. There's no real rhyme or reason to what it throws at you in terms of suggestions. Amazon could learn a lesson from Netflix in that way.But my primary complaint is that the device has a horrible time staying connected to wifi. I have a dual band router that the fire TV stick is no more than 2 feet away from. It won't stay connected to the 5 GHz signal at all, and it will go periods of time where it constantly connects, disconnects, and reconnects to the 2.4 GHz signal over and over and over. Obviously any streaming content is useless with this happening. All the while, none of the other devices on my network are having this problem. My Chromecast performs much better.Ultimately, I bought this device for Sling TV and have enjoyed easier access to the Prime instant video collection, and for those two uses, it's nice. But it doesn't work as well as I'd like, and as soon as my Chromecast gets Sling TV support, I will be moving on from this device.", "verified": true, "helpfulness": "0/0", "author": "rkharris"}, {"rating": 5.0, "review": "We have the Fire Stick on a tv rarely used and we didn't want to pay for a cable box for the set.  Works great.", "verified": true, "helpfulness": "0/0", "author": "Cheryl S"}, {"rating": 5.0, "review": "So far so good!  It has lived up to just what I wanted and what I thought.  Love having my Amazon prime, Netflix and others right at the tip of my fingers.  Searching is easy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to use and works as well as expected.", "verified": true, "helpfulness": "0/0", "author": "Gimp Daddy"}, {"rating": 5.0, "review": "Satisfied", "verified": true, "helpfulness": "0/0", "author": "Perry"}, {"rating": 4.0, "review": "Works great except for Netflix. I can't get it to take my password no matter how many times I try. Any help would be appreciated. I love the remote and the ease of use.", "verified": true, "helpfulness": "0/0", "author": "tmac"}, {"rating": 4.0, "review": "Product is great, easy to install, fast response time between screens. I can get all my paid sites here except iTunes and any movies on Harddrive. If I could get my movies from my HD then I would have given this a 5 star.", "verified": true, "helpfulness": "0/0", "author": "Lonnie Carpenter"}]