[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Gary T."}, {"rating": 5.0, "review": "Like Fire TV Stick. Works great. Would like to see new movies for free since I am a prime member.", "verified": true, "helpfulness": "0/0", "author": "Chris Hansen"}, {"rating": 3.0, "review": "When I first bought this, back when it first came out, I loved it. Everything was working properly and I was recommending it to everyone I knew. Now a few month laters I wish I hadn't said anything. First of all, the main reason I bought it was so I could watch Netflix's. I have Prime as well but I do not like to watch movies and TV shows without subtitles because at times it can be very noisy in my house and I don't want to miss anything in my shows. Anyone, slowly at first it would give me a hard time to connect to the internet or would freeze but I figured out how to reset it and everything worked fine once I did that. But now for the past month, it won't let me use the Netflix's app. It's beyond irritating and I just want to throw the damn thing out. Everything else works ok but it keeps saying \"We're having trouble playing this title right now...\" no matter what I do, the app just won't work.I guess if you don't use Netflix's this will be good for you but I expect in the upcoming months this device will slowly stop working all together. I should've just gotten the Apple TV but they tempted me with the price. I love all things Amazon but I think the only electronics I'll be buying from them are there Kindles.", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Ivan Pitts"}, {"rating": 4.0, "review": "lots of fun movies and great TV shows", "verified": true, "helpfulness": "0/0", "author": "Bruce Josefson"}, {"rating": 5.0, "review": "Better than Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Benjamin Peek"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jeri DeMoss"}, {"rating": 5.0, "review": "This really work great. I do recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Melquiades V. Pedroso"}, {"rating": 4.0, "review": "A great replacement for the increasingly expensive cable costs. My only reason for 4 stars instead of 5 all the great shows/movies on Amazon prime still costs extra. On a fixed income that's why I gave up cable.", "verified": false, "helpfulness": "0/0", "author": "sasha simmonds"}, {"rating": 3.0, "review": "I use the Fire TV stick on a TV that is only WIFI ready and I didn't have a way to sign onto Netflix or Prime easy. Easy to set up and the shows play without delay. It signs on to the internet very fast and without delay. If I had one complaint it would be that I don't like how the prime is set up. It is so much easier to use the button that is on my TV in my living room  for Netflix. It is easier to look for shows and see how many seasons there are etc. But my TV in the bedroom doesn't have this option. One other problem I had was that it doesn't recognize my Netflix any more for some reason and I haven't figured out why that is. We have the Amazon Fire TV in our living room and I had no problem with it. I am not sure what the problem with the Fire TV stick is Prime works just fine, just Netflix doesn't work any more.", "verified": true, "helpfulness": "0/0", "author": "C. Ragels"}]