[{"rating": 5.0, "review": "Absolutely love this. I'm a Twilight Zone and Alfred Hitchcock fan and I can see all the episodes, in order. Haven't explored all the other possibilities yet. but am very happy so far. For $40!", "verified": true, "helpfulness": "0/0", "author": "david gibson"}, {"rating": 1.0, "review": "Hit and miss on connecting to the internet. Watched 2 movies and one tv program in the 5 days since we received the fire stick. It keeps disconnecting.", "verified": true, "helpfulness": "1/1", "author": "Gloria Rathke"}, {"rating": 1.0, "review": "We were very disappointed in the Firestick.  We have the fastest internet available in our area, but it is not fast enough to stream anything from Amazon.  We are able to use it for Netflix because their streaming is better than Amazon's.  We are very disappointed.", "verified": true, "helpfulness": "1/1", "author": "Sue R."}, {"rating": 5.0, "review": "I really like it and it's very easy to use.. It's more than worth the money. I was captivated by the nature scenes when it goes to standby.", "verified": true, "helpfulness": "0/0", "author": "Dorothy Caryter-Tate"}, {"rating": 4.0, "review": "Easy to get going. Was fun to see all different things I could watch or experiment with. Lot of entertainment for the price. Can't beat it for the price.", "verified": true, "helpfulness": "0/0", "author": "Jim Darnall \"slim dude\""}, {"rating": 1.0, "review": "Will not connect to my network!", "verified": true, "helpfulness": "0/0", "author": "Snyderman"}, {"rating": 5.0, "review": "I love my fire stick, I loved it so much, I bought a second one after I returned the Roku... Roku, seem so budget compared to the Amazon Fire stick.  I would recommend every one to get the Fire.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Needed it for accessing WWW Network. It works fine and has a lot of additional viewing options.", "verified": true, "helpfulness": "0/0", "author": "James R."}, {"rating": 5.0, "review": "Love my fire tv stick. Complement my kindle HDX .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Was not aware of having to purchase virtually everything I want to watch.", "verified": true, "helpfulness": "0/0", "author": "Ross Winn"}]