[{"rating": 4.0, "review": "My family is enjoying the use of this unit while we figure out all the components if offers.  I like the Sling tv app and Amazon Prime availability.  It's so much better than trying to watch a movie on the laptop.  I haven't had any connectivity issues at all.  The movies stream perfectly, so far.  I have Verizon FiOS 50/50, so some other reviewers may have an internet problem, not the Fire Stick's issue.", "verified": true, "helpfulness": "0/0", "author": "Katie H."}, {"rating": 4.0, "review": "I like the Fire Stick and so do my kids. I do have Amazon Prime but not Hulu or Netflix. I still get a decent variety of entertainment. I would've rated this as a five if it separated the \"free\" from the \"pay\" better. I have played a few games and have been debating on getting the controller. If games are important to you it will be a necessity.", "verified": true, "helpfulness": "0/0", "author": "K. Houston"}, {"rating": 1.0, "review": "Piece of crap. Would not connect to WiFi. Tried every thing. Would not waste your money.", "verified": true, "helpfulness": "0/0", "author": "Edna M Boggs"}, {"rating": 2.0, "review": "We returned it as it hung up frequently while being used.", "verified": true, "helpfulness": "0/0", "author": "Andrew P. White"}, {"rating": 2.0, "review": "Wow, what a disappointment. Positives.....accessing Amaon programming is more user friendly than the Amazon app on my tv and I can access my Amazon music thru my tv. Positives end there. The stick constantly loses connection and the programming you want access to still requires having paid suscriptions.  I wished I'd have save. my money.", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 2.0, "review": "can't get it to work. Sorry. Had high hopes", "verified": true, "helpfulness": "0/0", "author": "gretchen nicol"}, {"rating": 5.0, "review": "Easy to setup and use!", "verified": true, "helpfulness": "0/0", "author": "C. Harris"}, {"rating": 5.0, "review": "Works great and was effortless to install. I was watching Netflix within minutes of plugging it in first time!  Now it is always ready,even if I plug it I to a different TV!! Love it!!", "verified": true, "helpfulness": "0/0", "author": "jeanne a smith"}, {"rating": 5.0, "review": "The Fire TV Stick is easy to install and easy to use.  It's helpful to be an Amazon Prime member since this allows you to access tons of movies and TV shows.  The picture quality is great.  The Fire Stick is a good value.", "verified": true, "helpfulness": "0/0", "author": "M"}, {"rating": 5.0, "review": "Very useful", "verified": true, "helpfulness": "0/0", "author": "Rudy Gracia"}]