[{"rating": 5.0, "review": "very good product. plays netflix hulu plus. and many different Apps. I am Very pleased by this purchase.", "verified": true, "helpfulness": "0/0", "author": "mark racine"}, {"rating": 5.0, "review": "I already have an Apple TV and a chromecast. I have to say the Fire TV Stick was easier to set up than either of the others. I also love how easy it is to rent a movie on the spot and how much easier it is to play than an itunes movie rented ove Apple TV. So far so good and I am considering buying another.", "verified": true, "helpfulness": "0/0", "author": "Teresa F. Boardman"}, {"rating": 5.0, "review": "Installing was the easy like accessibility & steaming", "verified": true, "helpfulness": "0/0", "author": "Sharon Koch"}, {"rating": 4.0, "review": "I like it more & more", "verified": true, "helpfulness": "0/0", "author": "Joseph J. Lore"}, {"rating": 3.0, "review": "I bought this to use with Netflix. Despite trying several fixes that were suggested, I continue to have interruptions for buffering issues. Netflix blames Amazon, who blames Comcast Cable, who blames Netflix.", "verified": true, "helpfulness": "0/0", "author": "Denise Augsburger"}, {"rating": 5.0, "review": "It is working perfectly", "verified": true, "helpfulness": "0/0", "author": "leandro"}, {"rating": 5.0, "review": "We absolutely love this.Very easy set up and so convenient.", "verified": true, "helpfulness": "0/0", "author": "Kristina M."}, {"rating": 2.0, "review": "It's fine but can't handle 1080i feeds well. I would suggest the full Fire TV - more power.", "verified": true, "helpfulness": "0/0", "author": "Jesse Phelps"}, {"rating": 5.0, "review": "The fire stick was very easy for me to set up an use.", "verified": true, "helpfulness": "0/0", "author": "Stacy Bedford"}, {"rating": 2.0, "review": "The Fire Stick itself works fine, but there is one problem.  When I am not watching Prime and watching normal channels on Direct, my TV screen goes black for a few moments every few minutes.  The only way to stop this from happening is to unplug the Fire Stick every time we are done watching a Prime video.  This doesn't appear to be a big problem, except the TV it's plugged into is eight feet from the floor.  I don't want to have to go through that scenario every time.  I will be glad to change my rating when this problem is solved.", "verified": true, "helpfulness": "0/0", "author": "J. McDonough"}]