[{"rating": 5.0, "review": "I have only used it a couple times since I got it, but so far I think it's great.  I had a Chromecast for several years, which I used all the time.  I lost it when I brought it out of town so I had to replace it.  The main reason I wanted to switch to the fire stick was to get access to the Amazon Prime video library, but now that we have it I think it is better than the Chromecast was.  It has a menu that is easy to navigate, and it has games that seem pretty fun so far.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Katherine H."}, {"rating": 5.0, "review": "Amazing I have both this and the Chrome and this exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "AMG \"AMG\""}, {"rating": 5.0, "review": "Fire tv stick is the best invention ever made! So wasy to use and it adds suxh demesion to what your tv is able to do. Great buy!", "verified": true, "helpfulness": "0/0", "author": "Edward Albert"}, {"rating": 5.0, "review": "SO pleased to have bought this and now am able to stream Amazon Prime videos to my tv!", "verified": true, "helpfulness": "0/0", "author": "Lori Palmer"}, {"rating": 5.0, "review": "So easy to connect.  With the App on Kindle Fire, it makes it even easier.  So glad I have it.", "verified": true, "helpfulness": "0/0", "author": "Cris Peterson \"curious\""}, {"rating": 4.0, "review": "Not as versitile as I had hoped, but that is in part due to my lack of understanding of its capabilities.", "verified": true, "helpfulness": "0/0", "author": "Shane Johnson"}, {"rating": 4.0, "review": "Fire Stick is a solid device. The specs are impressive especially considering the price.Would have given it 5 stars but the remote control app does not work with my BB10 phone, so typing is a huge pain only being able to use the TV's keyboard and the remote's arrows.", "verified": true, "helpfulness": "0/0", "author": "watson023"}, {"rating": 3.0, "review": "Works pretty much as expected. The interface and remote are a little quirky. Not very intuitive. Over all we like it.", "verified": true, "helpfulness": "1/1", "author": "Jan-Arden Petersen"}, {"rating": 4.0, "review": "works for me.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Hawley"}]