[{"rating": 5.0, "review": "Love every bit of it.  So reasonably priced!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"hellcatzach\""}, {"rating": 1.0, "review": "I've been a roku user for years, and recently got a chromecast.  Both work well, although I prefer the roku.First on the hardware, there's a couple of annoying features.  The ring at the top of the remote.... can't be used as a dial.  It's just hiding 4 buttons... which you'll be pushing often.... very often.  I'll explain later.  Actually it's 5 buttons, 4 under the ring, and 1 in the center.  Seems like they could put some indication that there's a button there.The stick itself is ok, but strangely it plugs the power in from the side.  So it actually blocks two slots because the power cable sticks out to the side.  Not only that but it's fairly power hungry, so it doesn't work with standard USB power, at least the one my samsung TV provides.  So you need a wall wart... which of course blocks more than one power outlet.  Sure there is a dongle included for HDMI, but still seems silly.  My chromecast fits in a single HDMI socket, doesn't need a dongle, and doesn't need a wall wart.The UI seems glitchy.  Sometimes it just goes back to home.  Scrolling through long lists to browser new movies for example is rather annoying.  You either have to hold the button down and often undershoot/overshoot, or hit the button 100 times to get through 100 movies.  Quite strange when they display 6-8 movies at a time.  Why not allow one of the bottoms to slide 6-8 movies over?The UI often seems to get hung in a loop.  Often the pause/play button gets stuck.  So I hit it pause/play and it displays the series, episode title, and position.  If hit it again it goes away... but doesn't start playback.  Similar for the hidden button in the center of the ring.  Even if I hit back to the episode selection and click on \"resume playback\", it starts a frame or two... then pauses.  Then I'm stuck in a loop again.Generally seems almost workable, I suspect there will be a software update soon.  But generally I'd say it's more general purpose than a chromecast which is best used with a tablet/phone/desktop.  But not NEARLY as nice to use as a roku.", "verified": true, "helpfulness": "0/3", "author": "Bill B \"bike\""}, {"rating": 5.0, "review": "Works flawlessly, easy price, easy setup. Streams all my Prime movies, music flawlessly. Instant access to all my photos (stored for free in Amazon cloud storage) and my friends are amazed seeing the pics in glorious high def. on my 60\" HDTV. While doing chores around the house I just cue up my music (get to try out new artists and albums with FREE streaming of so many different selections).", "verified": true, "helpfulness": "0/0", "author": "Lologuy \"cracked PDA\""}, {"rating": 5.0, "review": "Amazing quality video no more buffering or freezeups. great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! I use it in my bedroom, so while I don't use it a lot it was the perfect choice. Once(if) they sync with vudu or add on vudu as an app it will be perfect. Still, best option available for its size.", "verified": true, "helpfulness": "0/0", "author": "Nena Hug"}, {"rating": 5.0, "review": "I bought this product to replace using my xbox 360 all the time, I didn't have a high expectancy or anything fancy of it, as I also own a chromecast. While the chromecast is good this is fantastic in comparison. I absolutely love that it has a remote which was my primary buying point, it looks fantastic, plays netflix well and is tiny and doesn't require a block that sits next to my tv! I am absolutely in love with it.My only complaint is the video at the beginning you're forced to watch, my recommendation if you are okay with figuring out devices on your own, just walk away go make a sandwich, cup of tea or something else.", "verified": true, "helpfulness": "0/0", "author": "David Fletcher"}, {"rating": 4.0, "review": "Excellent product. I have two fire tv consoles and this works as well as they do (which is awesome).", "verified": true, "helpfulness": "0/0", "author": "mrjoeyman"}, {"rating": 2.0, "review": "Can't stay connected to Wi-Fi.  When it started up, it readily found my network (I have been running my own home/office networks since there were done on coax cable, so I know how to make Wi-Fi work, how to test it, etc.).  The signal at the Fire TV stick is moderately strong, rated \"very good\" by the Stick.However, it would not connect using my password.  After many tries, I rebooted the Stick.  It hung up during the restart.  Third time, I got connected, just like it was supposed to.Then when going to \"Home\" it said \"Home is not available\" and it shows no connection.  After a time, the connection is back.  On and off.I haven't tried to stream yet.  I tried to connect the AllCast program, downloaded to the Stick and to my Android phone directly from Amazon.  I got a picture on the screen, then it hung and when I went to Home, once again I was not connected.As I said, I am disappointed.  I can stream to my Sony surround to the TV with no problem via the same Wi-Fi and with the antenna in the same location with no drops.This thing just seems like it has a serious software issue.  Hopefully with probably a million of them shipping early, Amazon sorts it out quickly, but if I hadn't been able to buy it at half price a few months ago, I don't think I would get it right now.  It needs work.It is impossible to troubleshoot or find help.  Amazon has a beautiful box to ship this thing in, but there is no effective help on their website when something doesn't work.  This is the opposite of other companies that push customer support rather than sales.I suppose I'll get a switchable cord so that rebooting is easier and just keep rebooting, but this is getting old.  This may end up being another tech trinket that ends up never being used.", "verified": true, "helpfulness": "0/1", "author": "Ronald Holland \"HollandLaw\""}, {"rating": 4.0, "review": "My daily driver to watch pretty much all my media.  I enjoy entertainment via Amazon Prime videos, Netflix, personal movies via Plex, Photos via Amazon Cloud Drive (my phone automatically uploads all the pictures I take via the app).  I was even able to install XBMC and many other apps from Google's Play store.  I own an Apple TV, Chromecast, Roku, and PS3.  They are all plugged into my TV via an HDMI switcher.  I use all of these devices but prefer this Fire TV Stick over the others as of this review.  We'll see if it stays on top.  As long as Amazon keeps supporting this device, I'll be happy for quite some time!", "verified": true, "helpfulness": "0/0", "author": "Daniel Cho"}, {"rating": 1.0, "review": "As a prime member I was so exited about this product, but now I'm just disappointed.  Netflix and all the video streaming keeps freezing and i have to restart the stick and router, it works only for little while.  I have a smart tv, Netflix works great with my tv, so is not my internet connection.  I bought it for my bedroom tv because is not a smart.  So frustrating when I try to watch  something...worthless.  Should have bought the Roku.", "verified": true, "helpfulness": "0/1", "author": "Betzaida"}]