[{"rating": 5.0, "review": "Easy, simple, inexpensive, and accesses everything I need. Sorry Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Christopher Zaglifa"}, {"rating": 5.0, "review": "It works great", "verified": true, "helpfulness": "0/0", "author": "Nikki Campbell"}, {"rating": 5.0, "review": "This devise is great,if you have an hdmi plug in,it will turn your tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "cantsleep41"}, {"rating": 5.0, "review": "Awesome feature with Prime", "verified": true, "helpfulness": "0/0", "author": "Bradley W Wilkinson"}, {"rating": 1.0, "review": "It's now working well and best buy will not take it back.", "verified": true, "helpfulness": "0/0", "author": "Nick Nardello"}, {"rating": 5.0, "review": "works much better than I expected.", "verified": true, "helpfulness": "0/0", "author": "michael shea"}, {"rating": 5.0, "review": "An absolute marvel! Easy to install and the remote is practical and convenient to use.  Best of all you get all the prime videos and Netflix with one remote. My wifi medialink router is 40 ft. from my tv and so far no problem in receiving the streaming content.  If you have a tv with an hdmi outlet and you want access to streaming videos from Amazon and Netflix the fire stick is a must. The only problem I'm having is tearing myself away from the tv because of the easy access to so many videos.", "verified": true, "helpfulness": "0/0", "author": "rmgza"}, {"rating": 1.0, "review": "Originally reviewed product as 5 stars and compared it to Apple TV. Now, after owning the device for a few weeks I'm very upset. The Fire TV Stick will no longer work with my wifi router. I've tried a PLETHORA of things and read countless online forums and articles to try to fix it but it just will NOT connect. The internet connection is working fine for every single other device in the house; gaming systems, computers, phones, tablets, etc. Tried disconnecting them to see if the router couldn't handle all of it but Fire TV Stick still wouldn't work. I've even tried messing with the security settings on my router. As it turns out, there are many other people that have the same issue as I do... if you have a Netgear router it is very possible you'll run into issues when using the Fire TV Stick.Loved this product before it stopped working.... but it will not work at all now so I've dropped from 5 stars to 1.", "verified": true, "helpfulness": "0/0", "author": "Danielle Keathley"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "andrew kress"}, {"rating": 4.0, "review": "Gave me everything that was promised..Love It!!!", "verified": true, "helpfulness": "0/0", "author": "James A Dean"}]