[{"rating": 5.0, "review": "This little package works very well. I really only bought it for Netflix so I'm not the best test but still well worth $20.", "verified": true, "helpfulness": "0/0", "author": "Christopher"}, {"rating": 5.0, "review": "A little timely to download the software", "verified": true, "helpfulness": "0/0", "author": "Chad Nelson"}, {"rating": 5.0, "review": "Pretty awesome. Watch prime on it and are adding Netflix. Remote is better than expected. Very happy with it. Sync'd with my music is a very nice feature also. If I could find out how to install a slingplayer app it would be my all in one solution.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Lacks features to make it unique.", "verified": true, "helpfulness": "0/1", "author": "Bryan Terrazas"}, {"rating": 5.0, "review": "I love this device.  So many different choices to choose from.. Amazon you out did yourselves this time. I may orders another Stick", "verified": true, "helpfulness": "0/0", "author": "Tanya Meade"}, {"rating": 5.0, "review": "This little device rocks its fast and has a great interface easy to use . FYI I also have Chromecast and roku stick . This one is my favorite", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fantastic device for the money", "verified": true, "helpfulness": "0/0", "author": "Victor Price"}, {"rating": 4.0, "review": "So far so good.  It does what they say it'll do, and I haven't had any problems yet.  Makes binge watching a TV series easier as it rolls right into the next episode.  The interface is smooth and responsive, and the whole unit's small profile makes it virtually invisible in my home entertainment setup.  The only thing I'd suggest for future versions is they move the USB/power port to the other side of the device.  If you're hanging it off of the side of your TV the port is on the top of the unit, so the cord has to loop downward.", "verified": true, "helpfulness": "0/0", "author": "Kenn Baynard"}, {"rating": 5.0, "review": "Plugged it in. Changed to the correct input on the TV, punched in my internet code. Took a while to format but ever since it has been working without any loss of signal, which happens so often on my computer connection to the net!! Very happy with this tool.", "verified": true, "helpfulness": "0/0", "author": "Daniel J. McGrath"}, {"rating": 5.0, "review": "Extremely easy to set up and use. Very nice interface as well. Definitely worth the money and it's nice to have access to amazon prime, as well as netflix etc.", "verified": true, "helpfulness": "0/0", "author": "john dean"}]