[{"rating": 4.0, "review": "I love the fire stick. It's more responsive than my Roku and more powerful than the Chromecast. It looses one star due to the lack of free applications available for it (Expect to spend a bit on apps to make it fully functional).", "verified": true, "helpfulness": "0/0", "author": "Jaypoc"}, {"rating": 5.0, "review": "It's awsome I love it!", "verified": true, "helpfulness": "0/0", "author": "Dawn Reed"}, {"rating": 5.0, "review": "Never going back to cable! Saved $130 a month. ❤️ This is an awesome find!", "verified": true, "helpfulness": "0/0", "author": "Lexeous"}, {"rating": 1.0, "review": "Can't get it to work", "verified": true, "helpfulness": "0/0", "author": "CHRISTINE A .JONES"}, {"rating": 5.0, "review": "one more reason i love shoping at amzon 5 mins to set up and your watching tv", "verified": true, "helpfulness": "0/0", "author": "William F Racine"}, {"rating": 5.0, "review": "Awesome speed. Money well spent!", "verified": true, "helpfulness": "0/0", "author": "Senthil Kumar"}, {"rating": 5.0, "review": "Just got our Fire TV stick two days ago. It was late in the night when I finally finished work and I decided to attempt hooking it us (against the protests from my girlfriend). Within three minutes I had it hooked up, and when I turned it on it already knew it was me. All I had to do was put in our wifi password and we were off and running. The streaming was instant. We have Netflix on our TV through Apple TV and there is always a short delay. Not with the fire TV Stick. It was instant and the picture was crystal clear.", "verified": true, "helpfulness": "1/1", "author": "Barbara J  Hawk"}, {"rating": 1.0, "review": "I meant five stars. It works great. I get netflix and pandora radio on my tv.", "verified": true, "helpfulness": "0/0", "author": "Tod Harris"}, {"rating": 5.0, "review": "Easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "Bought this on pre-order sale but would pay the full retail to buy again. This works great and is easy to set up. No voice command on the remote but does everything in our life have to be? I was very pleased with the signal and lack of buffering. You can't tell you are using this, as the picture is identical to your TV. No buffering, no digital camo. Great for travel to take your Prime on the road with you!", "verified": true, "helpfulness": "0/0", "author": "BluePnut"}]