[{"rating": 1.0, "review": "Very poor for streaming", "verified": false, "helpfulness": "0/0", "author": "COCOA"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "FamOnTheGo"}, {"rating": 5.0, "review": "Performs as expected!", "verified": true, "helpfulness": "0/0", "author": "M. Faulkner \"my signature\""}, {"rating": 3.0, "review": "It's hard to adjust to. I'm used to the Roku. The Roku is dummy proof. There are so many rows and columns on this that I feel like it's difficult to use. We've had our Fire Sticks for two weeks now...with time, I'm sure I will adjust better. I bought them when they were on the promo price of 18$ each (which is the only reason I didn't get more Roku devices.). The fire seems to work fine. It just isn't super easy to use.", "verified": true, "helpfulness": "0/0", "author": "Sara Davis"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Randy Padilla Mederos"}, {"rating": 3.0, "review": "I'm overall pleased with the Fire TV Stick; the stream quality is clear and at a speed comparable to my other devices. I find no problems with the remote not being picked up from all over the room, and the power cable is long enough for you to plug in most places.  For the price point, I was amazed at how much it felt like an Apple TV.I think many of my complaints will be addressed with software updates, so I still recommend a purchase. Right now, the menu feels very busy and can be distracting to find what you want. The \"Play/Pause\" button seems to only work within a show - you can hit play to launch from the menu. Overall, the interface just feels clunky. It seems to always be working to pull up your show, the screen just flips to a grey background with text when you select a show to load, the cards on the menu move rigidly, and the fast-forward/rewind doesn't feel natural and is hard to control.All of this is said from a stance of being satisfied with the product. The price point is incredible and the stream quality - the part that matters - is excellent. The rest of my suggestions are more on the user experience side of things. I'm excited to see what Amazon has in store!", "verified": true, "helpfulness": "0/0", "author": "Vincent Kelly"}, {"rating": 4.0, "review": "I was pleasantly surprised at how functional the Amazon FireTV Stick is compared to the Roku 2 I had previously been using. The interface is great, especially if you subscribe to Prime. They have really made it much easier to browse Prime content.My only complaint is that certain third-party apps have been crashing for me occasionally. I'm not sure who is at fault there, but it's really just a minor inconvenience.", "verified": true, "helpfulness": "0/0", "author": "Datura"}, {"rating": 1.0, "review": "Does not connect well (or at all) with the wifi, even though all my other devices can connect to the wifi from the same room as the FireTV Stick. Thinking about returning it for a different product.", "verified": true, "helpfulness": "0/0", "author": "Kimber Blair"}, {"rating": 4.0, "review": "Fantastic Streamer at a great price! Slightly laggy but the voice control fixes all of that.", "verified": true, "helpfulness": "0/0", "author": "Mike Delisi"}, {"rating": 5.0, "review": "The best device for under $20 (during the promo).  Glad I got it.", "verified": true, "helpfulness": "0/0", "author": "J. Carlos"}]