[{"rating": 5.0, "review": "It is great so far!", "verified": true, "helpfulness": "0/0", "author": "Bobbie"}, {"rating": 5.0, "review": "Beats cable", "verified": true, "helpfulness": "0/0", "author": "JR Petrella"}, {"rating": 5.0, "review": "Excellent! Easy to connect and use immediately!", "verified": true, "helpfulness": "0/0", "author": "Marsha R."}, {"rating": 4.0, "review": "This is amazing.  My family loves to watch movies without commercials.  This is the best", "verified": true, "helpfulness": "0/0", "author": "Irene Nester"}, {"rating": 5.0, "review": "works great, get all the shows I wanted.the fire box would not work on my tv set????  changed out box, still would not work, changed out hdmi cables twice, still would not work, but the stick plugged right in and started right up.perfect, works fine.", "verified": true, "helpfulness": "1/1", "author": "Lenny"}, {"rating": 5.0, "review": "I highly recommend the fire stick. As stated by many others setup is easy and simple control buttons are uncomplicated. Movie streaming has been flawless. Only improvement I'd like to see is the watch list. If I could categorize my list it would be easier to find movies in my list. Haven't try music or games. On another note it'easy to switch over my uverse from hdmi 1 to hdmi2 to watch.", "verified": true, "helpfulness": "0/0", "author": "francesro"}, {"rating": 4.0, "review": "Great alternative. The Fire Stick is pretty cool, offers a lot of TV shows and movies.  It would be great if it had a larger selection of current movies.. but can't complain for not having a monthly fee. Weird how it syncs with my google account... I wasn't expecting that.", "verified": true, "helpfulness": "0/0", "author": "Andrea F"}, {"rating": 4.0, "review": "it good.", "verified": true, "helpfulness": "0/0", "author": "Eddie Pressley"}, {"rating": 1.0, "review": "I got this on the $19 deal. Worst purchase I have ever made. Just does not work. I have a strong wifi signal and my wifi works for all other streaming devices in my home. The Fire TV Stick just keeps freezing. I reboot reset and still has same issue. This is just an under powered device. I am glad I only spent $19. No wonder the fire phone was DOA if this the best Amazon can do. I have an Echo on order. If it is as bad as this it will go back.", "verified": true, "helpfulness": "0/0", "author": "brieck"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Stephanie cisneros"}]