[{"rating": 4.0, "review": "Great device but I couldn't get kodi icon on the home screen", "verified": true, "helpfulness": "0/0", "author": "Dan Jordan \"dan\""}, {"rating": 5.0, "review": "Unbelievably easy to use.  I was a little concerned because our WIFI is a good 30 feet away and beaming through 3 walls and a bathroom.  Plugged the Stick into an HDMI slot, plugged in the power adaptor.  Turned on the TV and selected that HDMI input slot and \"we were on Fire (stick that is).Watch the tutorial video...maybe 5 minutes of your life...Navigate around.  Search a favorite show (we are Masterpiece Mystery-aholics).  Searched \"Grantchester\" and settled in to watch.  Whole process Box to show less than 30 minutes.If I had to gripe about anything it is the way Amazon lists a series.  For example, Grantchester episode 1 is really the series preview.  Episode 2 is the REAL episode 1.  Annoying, critiqued it on a feedback, but once you break the code it's no big deal.Now to go buy Amazon stock-these folks have their act together!", "verified": true, "helpfulness": "0/0", "author": "R. B. Thompson"}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/0", "author": "Oleadys"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "David A Webster"}, {"rating": 5.0, "review": "I love my Amazon Fire stick. It is so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jean Mewbourn"}, {"rating": 4.0, "review": "Just had the opportunity to try the mirroring function on a Netflix Show - Very pleased, the show ran without interruption, good to great picture & sound.  Will use again.", "verified": true, "helpfulness": "0/0", "author": "Dean E. Turner"}, {"rating": 4.0, "review": "Performed as I expected. Which very easy to install and I am enjoying its use now.", "verified": true, "helpfulness": "0/0", "author": "Dennis nishida"}, {"rating": 5.0, "review": "Awesome!! Wish I had bought it sooner and for only $39 it's way cheaper than upgrading to a smart tv when mine works fine. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Gabriella Herrera"}, {"rating": 4.0, "review": "Finally cut the cord ans happy. Netflix and Hulu are an easy download and Amazon Prime offers lots of content.", "verified": true, "helpfulness": "0/0", "author": "Charlene"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Shereece merrill"}]