[{"rating": 5.0, "review": "Love it.  Easy set up. Must buy especially if you have Prime Access.", "verified": true, "helpfulness": "0/0", "author": "David Smith"}, {"rating": 5.0, "review": "Does everything it's supposed to.  Straightforward, easy to operate.  Adds value to a simple TV setup (no cable, just local, plus Netflix).", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Freein08\""}, {"rating": 5.0, "review": "Much nicer than the Chromecast I have. Makes watching movies as easy as turning on the TV.", "verified": true, "helpfulness": "0/0", "author": "James A. Webb"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Juan Carlos Artiga"}, {"rating": 4.0, "review": "Great streaming device, but no voice search, which I have on my Amazon Fire Tv box on another tv and use a lot.", "verified": true, "helpfulness": "0/0", "author": "John Bowman"}, {"rating": 2.0, "review": "First off, you need to hook the stick up to a power cord. Then, the supplied cord is only 3 feet long. The stick needs a very good WiFi connection to play movies. Finding movies on the menue is a hassle. I now have a HDMI cable running from my TV to the computer and watch movies that way", "verified": true, "helpfulness": "0/0", "author": "Marco"}, {"rating": 5.0, "review": "So far so good we like it", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 4.0, "review": "Only used this for a few days but overall, for the price, it's a really nice value. Set up was pretty easy. Navigation is not too hard either. Only minor complaint is that it seems like on some items, it's not clear whether it is free with your Prime Membership or whether you must pay a fee. You don't know for sure until you click on it and start down the path to view it.I'm happy with it. Was worried there would be lots of buffering issues since my Verizon FIOS network is less \"speedy\" than they tell you is. However, haven't yet run into any problems so far.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Collins"}, {"rating": 1.0, "review": "Did not work!!!  Even after adding bandwidth & having a service tech come out, kept buffering after less than a minute.", "verified": true, "helpfulness": "0/0", "author": "J.A. WOODCOCK"}, {"rating": 3.0, "review": "SOME TIMES FAILE THE SIGNAL", "verified": true, "helpfulness": "0/0", "author": "Mario E."}]