[{"rating": 1.0, "review": "Found and connected to U-Verse WIFI, but wouldn't stream with itReturned and replaced with ROKU which worked perfectly.", "verified": true, "helpfulness": "0/0", "author": "critic"}, {"rating": 5.0, "review": "Super way to view movies", "verified": true, "helpfulness": "0/0", "author": "Carlo"}, {"rating": 3.0, "review": "NOT THE BEST WITH CONNECTIVITY, MY GOOGLE CHROMCAST WORKS MUCH BETTER. MY SHOWS ARE CONSTANTLY STOPPING AND BUFFERING AND I HAVE GREAT INTERNET AND IT ONLY HAPPENS WITH THE FIRE TV NOT W CHROMECAST OR STREAMING VIA INTERNET", "verified": true, "helpfulness": "0/1", "author": "NoRo"}, {"rating": 5.0, "review": "Love it.  Easy set up.  Item as described.  Timely shipment. Great packaging.", "verified": true, "helpfulness": "0/0", "author": "Laura A. Bonner"}, {"rating": 4.0, "review": "Very nice product, it is faster than google chromecast as reviews say, there are two aspects that are lacking, first the stick mostly needs to be connected to a power outlet instead of the usb port from tv on most cases, and second, a big downside is that if you're planning to use it outside US, there aren't many viewing choices due to region restrictions, this issue should be display in advance so no one feels dissapointed, otherwise this is a great product.", "verified": true, "helpfulness": "0/0", "author": "Rudolph Glen"}, {"rating": 5.0, "review": "Am enjoying my firesticks", "verified": true, "helpfulness": "0/0", "author": "Desi"}, {"rating": 5.0, "review": "I was getting so agitated with the long process of loading and hang-ups from Chromecast that I didn't want to use it.  I ordered the Fire Stick and was shocked at its speed.  Goodbye Chromecast, you slow poke and jammer!", "verified": true, "helpfulness": "0/0", "author": "Beverly Gunter"}, {"rating": 5.0, "review": "Great PriceEasy to useCompact (was able to bring it on vacation and it plugged in easily to the TV in our rental home)Use mostly with Netflix, Amazon Video, and YouTube with easy to use interface.", "verified": true, "helpfulness": "0/0", "author": "Amy C"}, {"rating": 1.0, "review": "The fire stick was completely worthless.  It worked fine for about a month.  Then, it stopped working.  I did all the 'fixes' I could find on the Internet and on Amazon, still nothing.  I contacted customer service and they were not helpful at all.  I wasted my money on this and was beyond the 30 day window when it stopped working.  It makes me angry that I spent money on something that does not work at all.  I noticed when trying to figure this out, that many, many people have had the same 'connection' issues with the Fire Stick.  Amazon, if you are going to sell something like this, fix the glitches.  It's obvious from a quick search on the Internet that there are so many people that have connection issues, so fix it.", "verified": true, "helpfulness": "0/0", "author": "Alison M."}, {"rating": 5.0, "review": "I had to use the plug to get it to work but after setup, it has been smooth sailing. The remote is pretty convenient as I had my roommates chromecast which i always needed my phone and would slow my phone down if I wanted to do other things on it while I watched a show. Hopeing for HBO Now soon", "verified": true, "helpfulness": "0/0", "author": "s. bern"}]