[{"rating": 3.0, "review": "Glad I only paid 20 bux for it. I have a one year old Asus memo HD 7 android 4.2.2 with miracast. The android recognizes the stick but fails to connect. YouTube plays fine over the android, so what's up with no miracast?Although this stick is geared toward having apps that require further memberships,I found some very fun things for free. The best being a large selection of local and national PBS shows with their app. There are other free movie and documentary apps too. But have many commercials.Another great thing is having pay per view movies available in both HD and SD. I found that one can stream those pay per view movies with only a 1.5 wi wi connection, but not the rest. So at least a 3.0 is a must. I just upgraded and wow, works really well!  For miracasting, I had to get a separate Asus dongle. Picked up a used one for around 50 dollars. It's nice to use to stream video from sources that the fire stick doesn't have apps for.So out of respect, felt the need to update.I would recommend this product solely for the availabilities stated above.Really? I have to buy an Amazon Fire Tablet? Or get prime?They then should hand these out for free!That's one big reason I got this thing. Downloaded the Allcast app and all thatdid was mirror locally stored content, then damaged some photos and totally screwed up my photo gallery. Took hours to get it back but had to delete 13damaged images.So far, after 12 hours, have a screen full of Amazon pay apps, no mirroring although my tablet is 4.2.2", "verified": true, "helpfulness": "2/3", "author": "darmuck"}, {"rating": 1.0, "review": "As a Prime member I got this for half off, and I've been using it every day for the past 10 days. It works well, but I'm not all that impressed. Some reviews seemed to imply it would be better than a Roku; in my opinion it's not.Physically, it's power cable connects to one side which, with the way my Panasonic is built, means the power cord is vertical, putting stress on it.The remote is nice but sometimes when I push the navigation button, instead of moving one spot to the next icon/image, it sometimes moves 2, 3, or 4 spots. In keeping with that, the Roku 3 remote has the ability to click the navigation button fast forward button and the cursor moves one screen, thus making it faster to scroll through programming.I do like the Amazon Prime Video user interface better using the Fire TV Stick than the Roku because when I pause a program the image is clear, with no \"phantom page,\" that is, a darkened screen with programming info that interferes with whatever is on the screen that caused me to pause it.Amazon changed the Roku UI from a clear screen to the darkened screen, and it's a nuisance. It's now difficult to distinguish those tidbits of programming info that could once be seen.Also, since I watch mostly stuff on my watch list, it's annoying to have to scroll down to it when on the home screen. My watch list should be at the top of the home screen.Edit: This addition will also be placed under my review of the Amazon Prime Video, and in an email to Amazon.The device freezes, requiring me to reset it too often. Further, now that there are ads through this device, it'll be put back in the box and put away.The TV Stick user interface seems to be getting worse. Recently I went to watch an Amazon show pilot, and was greeted with a screen that said the show was brought to me by Geico. I backtracked out of the show and didn't watch it. I don't do ads, and my Prime subscription is not supposed to include ads.Then last night I was going to watch an old Doctor Who episode, and when I clicked on the episode's icon I was urged to install Vudu and watch it on Vudu. Initially I thought Amazon must have changed the season to pay-per-view, but I was wrong. The Vudu ad was simply an icon placed before the regular Prime icon, so I had to just scroll over to the next icon.I noticed that every other icon was for Vudu. Again an ad.Fortunately, this has not (yet) been the case using the Roku 3, but Amazon has already messed up the Roku interface as well, just not with ads (yet).", "verified": true, "helpfulness": "0/0", "author": "rudyy"}, {"rating": 1.0, "review": "Amazon Prime TV is wonderful. I've owned it for several months and I see it is on sale on for $20 off. If you have room for the smallish box, you may want to think about it. It's features are as advertised. As for the Stick, I really cannot give as much feedback as I'd like. I bought it on December9th as a Christmas present to add to one of the extra TVs. Amazon, despite advertising the product heavily over the holiday season (I thought for Christmas), informed me they were unable to deliver the Stick until January 9. So, I hope it is as good as Prime TV, which, as I say, I love (and I hope better than Chrome - which I took back), Unfortunately, Amazon was unable to follow through and thus the low star. I will update you as I get a chance to use it.", "verified": true, "helpfulness": "0/3", "author": "Robert F. Spaulding \"rfslaw\""}, {"rating": 3.0, "review": "It has connection issues and the you tube app is not installing and it doesn't have HBO go", "verified": true, "helpfulness": "0/0", "author": "lawrence bouchelle"}, {"rating": 5.0, "review": "Works better than expected! So happy to have this to watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "mgrabert"}, {"rating": 5.0, "review": "Very fast. I use it mainly to run XBMC [KODI]. It is super fast and the included remote is also nice.", "verified": true, "helpfulness": "0/0", "author": "Raghu"}, {"rating": 2.0, "review": "In my opinion, Amazon has gone out of their way to display this stick like a flash drive, however it does in fact, have a cord. One more device to be plugged in, in a tangle of stiff cords behind the tv. The cord comes awkwardly out of the side of the stick, so it could not be plugged directly into my television along side my directv hdmi input without rearranging the plugs. The power supply cord that it comes with is a black square with the amazon logo that does not fit on a standard power strip. All this disappointment and I haven't even turned it on yet ...", "verified": true, "helpfulness": "0/2", "author": "Scott Bazzett"}, {"rating": 4.0, "review": "Generally I like it and didn't want to give it just 3 stars because we did get it when it was offered for just twenty dollars definitely making it a great value. BUT, there are several cons we've found in the two weeks since it arrived. We have had serious connectivity issues and finally had to use the included HDMI extender because the WiFi connectivity was junk when it was connected straight into the TV (I guess the TV blocked the signal some - it is a wall mounted TV and we used the side input), now the connectivity is fine but the stick hangs out and is sloppy looking, which we could have just kept the computer connected if we wanted things hanging out the side of the television. If it had cost us full price I probably would have sent it back for this reason alone. We also dislike that there isn't an HBO app so we still have to hook up the computer (although we did know that when we purchased it).As far as pros, it is nice that it frees the up the computer, has HuluPlus and Netflix and the Netflix app is a more recent version than the one on our old bluray player that doesn't allow for more than one user. We don't use any of the games so I can't attest to that, and the remote TV app for my phone makes navigation nearly as easy as on a computer. The remote app on the phone will not wake up the stick however so the remote can't be put away which is another nuisance.For $20, it was a great deal, but it doesn't have great connectivity (despite being dual-band), it does keep us from having to replace a still functioning bluray player with one that has updated apps, and I am interested in seeing how it works when hooked into the stereo receiver instead of the TV if we ever get that set back up.", "verified": true, "helpfulness": "0/0", "author": "AlySun_22"}, {"rating": 5.0, "review": "This is awesome! totally makes the prime membership worth it. Just the free television alone is amazing. gret selection including most HBO stuff.Set up was super easy, and it all runs very quick.super simple interface so you can find anything you want very quick. Rent single shows or entire seasons worth of stuff all at a reasonable price.I wish there was an app for the iphone to be able to use it as a remote and to share my screen but hopefully one day.", "verified": true, "helpfulness": "0/0", "author": "l m"}, {"rating": 5.0, "review": "Time to cancel DirecTv. Thank you", "verified": true, "helpfulness": "0/0", "author": "thomas j brooks"}]