[{"rating": 5.0, "review": "Love it! Like better than Google Chromecast because of remote.", "verified": true, "helpfulness": "0/0", "author": "Loretta M. Polisso"}, {"rating": 4.0, "review": "I had to buy an extension HDMI cable to bring it out of the cabinet so that the wifi functioned properly.  After that everything works fine.", "verified": true, "helpfulness": "0/0", "author": "Eric Phillips"}, {"rating": 3.0, "review": "Missed the mark as far as watching TV channels, all are \"pay\" channels - why would I do that when I can get them on cable for far less?", "verified": true, "helpfulness": "0/0", "author": "Janice K Rubel"}, {"rating": 5.0, "review": "I own a Sony NSZ-GS8, Google Chromecast, AppleTV and now the Amazon Fire Stick. The Amazon Fire Stick is my hands down favorite.", "verified": true, "helpfulness": "0/0", "author": "James Kimble"}, {"rating": 5.0, "review": "Beautiful display.  My TV has never looked better.  I can access everything.  Games, Netflix, Amazon movies and music.  Simple set-up.  Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "JMHO"}, {"rating": 5.0, "review": "neat lil device. I plugged into my TV, and at first set up was a lil hesitant. had to reset thru remote after unplugging and plugging back into outlet twice, but after all updates were done, setting up was a breeze. I took it over to my Mom's, and my nephew \"stole\" it for his TV, so I will have to order another one (-:", "verified": true, "helpfulness": "0/0", "author": "Lanigi \"gadget lover\""}, {"rating": 5.0, "review": "Love it!!! Simple installation process, although I had to try it twice .  A lot of Apps options to choose from. Beautiful interface. Performance is good.  I have (2) Apple TVs, (2) ROKUs and the (1) Fire TV Stick.  So far, this is been my best experience.  Totally recommend it!!!", "verified": true, "helpfulness": "49/52", "author": "Orlando Soto"}, {"rating": 5.0, "review": "Great product which was difficult to install with my television. After a call to customer support who told us to turn off tv and restart installation it started updating.  This occurs each time you use Fire TV and it works great.  It is worth $25.00 paid at Best Buy.", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 4.0, "review": "I've got the full spread of streaming devices - AppleTV, Roku Stick, Chromecast and now Fire TV stick.  I've also got a Samsung TV with SmartHUB  (I'll eventually get a GoogleTV to compare)  Why all this madness?  Trying to find the one unit that will cover everything that I need to do, the CPU horsepower to handle some encoding and with an excellent easy to use UI.It can be a little confusing on how to add extra apps to the list, but once there, everything else fits rather seamlessly together.  Search can be a bit confusing and it's not cross app like it is in SmartHUB or ROKU, it only returns results from Prime.  Within an app like Netflix, you can't use the voice search, it tosses you out back to the primary Amazon search.Basically at this time, I would say this is the best device for folks living in the Amazon ecosphere - their integration for Prime subscribers is top notch.  The UI for their playback system is great and watching a TV series it will move through a season for you automatically reducing the amount of steps you may have to go through.  The interface is snappy, and though I have not tried any games yet, it is one of the selling points.This has been the most capable in terms of compatibility for minimizing the need for transcoding streams with PLEX.I do recommend plugging in the USB power supply, it will prevent any start-up pause as the stick initializes.  On my TV, when this happens the TV switches the input to it, which is annoying.", "verified": true, "helpfulness": "0/0", "author": "NewJerseyDan"}, {"rating": 5.0, "review": "I got a good deal and it works really well. For the price it is definitely worth it if you're looking for something simple to run Netflix and Hulu. The only gripe I have is the text on the user interface is a bit small. I have a hard time seeing it from across the room and I don't wear glasses. I think older people would have a problem with that unless they have a big TV.", "verified": true, "helpfulness": "0/0", "author": "J. Leopold"}]