[{"rating": 4.0, "review": "Overall a great device. I had some problems with the network connection initially before I used the extender - this is somewhat understandable as our wireless Ethernet is quite far away from our TV. What could have been much better though is the error message we received - \"Connected with Problems\" is not the least actionable! Instead there should have been instructions telling us about the extender and how to \"reboot\" the device.", "verified": true, "helpfulness": "0/0", "author": "Mikael Horal"}, {"rating": 5.0, "review": "I picked up 2 of these during the pre-order sale. THEY ARE AMAZING!Instant access to Hulu, Netflix and obviously all the great media Prime has to offer.Not to mention all the apps you can install on this little thing. I have my plex running perfectly on it.I will never play games on it, so i can't comment on that, but the option is there.Roku is to slow and Chromecast doesn't even compare.i don't think you can beat this thing for $40. let alone the $19 i paid for them.", "verified": true, "helpfulness": "0/0", "author": "JW"}, {"rating": 5.0, "review": "Dual-core CPU and excellent software makes the Fire TV Stick the best of the 3 sticks being sold today.Better than the Roku stick, and Google's Chromecast.", "verified": true, "helpfulness": "0/0", "author": "zonker"}, {"rating": 1.0, "review": "so far...  this hasn't worked for me.  Our TV setup is a Samsung 51\" Plasma but it cannot connect to the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "monk"}, {"rating": 5.0, "review": "Turned my old TV into a smart TV . works great !!!!cool!!! features!!!!!", "verified": true, "helpfulness": "0/1", "author": "scott sutherland"}, {"rating": 5.0, "review": "Awesome, totally worth it! Great AMAZON shows too!", "verified": true, "helpfulness": "0/0", "author": "Nando"}, {"rating": 5.0, "review": "Love it. It's better than Roku or a Blu-ray player. easy to set up.", "verified": true, "helpfulness": "0/0", "author": "K. Fox"}, {"rating": 5.0, "review": "Works surpisingly well for such a small device, it is definitely set up for Prime members but Netflix and several other streaming services can be installed.", "verified": true, "helpfulness": "0/0", "author": "nothingness"}, {"rating": 5.0, "review": "love it......", "verified": true, "helpfulness": "0/0", "author": "AM SCOTTI"}, {"rating": 5.0, "review": "Love it. Easy set up as well.", "verified": true, "helpfulness": "0/0", "author": "Happy pet owner!"}]