[{"rating": 4.0, "review": "few problems yet", "verified": true, "helpfulness": "0/0", "author": "shirley  cooper"}, {"rating": 5.0, "review": "Buy this product! You can take it anywhere with you, easy to use, be a prime member and get all the goodies.  Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Tl Indy"}, {"rating": 5.0, "review": "Quick and easy to set up. Wish all devices were that easy.", "verified": true, "helpfulness": "0/0", "author": "JustSayin"}, {"rating": 5.0, "review": "I ordered this before it came out, and didn't try using it until I bought a new \"smart\" TV today. I spent a very frustrating 30 minutes trying to use the built-in wi-fi on the TV to stream video from Prime and Netflix, then got disgusted and got out my Fire TV Stick. I plugged it in and was using it within minutes. It's fun and easy to use. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "geeky1"}, {"rating": 1.0, "review": "I had high hopes for this product. Truthfully it works great. Unfortunately I did not like the confusing interface. I sent it back to Amazon and bought a Roku Stick.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 4.0, "review": "It is nice to use when there is nothing on TV to watch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow, so much easier to use than DVD player - lots of options and easy to set up.  I have already recommended Fire Stick to several of my friends and they have already purchased them...got several phone calls saying that I am a hero!  Great product.", "verified": true, "helpfulness": "0/0", "author": "W.B"}, {"rating": 2.0, "review": "I bought it trying to get special sports like mountain west network and other sports. So much for that.", "verified": true, "helpfulness": "0/0", "author": "Rodney Eicke"}, {"rating": 5.0, "review": "i really enjoy this for my tv.", "verified": true, "helpfulness": "0/0", "author": "john, I am \"john s\""}, {"rating": 5.0, "review": "My daughter got the Amazon Fire TV Stick for me as a gift. So far, I love it. I haven't had it long but it's easy to use and gives me access to a number of shows and movies, plus other options.", "verified": true, "helpfulness": "0/0", "author": "lriddle"}]