[{"rating": 3.0, "review": "Not a good idea to add a large number of apps because all of them are strung together in a single line. I added about 75-80 apps the time to go through them all is EXCRUCIATING. Why can't they be grouped by category? Many of the apps do not tell you up front that a cable tv service is required for viewing. Waste of time!I have an iOS device, iPod touch 5th generation. The app for this device does not pair. I am an all Apple household with an older Apple wifi router which, apparently, does not support \"multi-something or other\" which prevents the app from pairing with the Fire TV Stick, so I cannot use its unique capabilities to voice search or use the apps keyboard to type. FRUSTRATING.The ONLY thing that make this device better than the Apple TV, which I have, is its larger storage and RAM capacity and speed. It also has a better choice of apps, most of which I can access on my iMac and just \"mirror\" to my Apple TV. The Fire TV Stick DOES have faster wifi access however which makes it easier to stream videos to but besides that, I would have been better off not making the purchase for this device.", "verified": true, "helpfulness": "0/0", "author": "Jerry Sundberg"}, {"rating": 5.0, "review": "For the price this is such an amazing product. Amazon has done a spectacular job offering a great price with such a fill featured device. This one is a must have, its also perfect for a gift.", "verified": true, "helpfulness": "0/0", "author": "Bobby"}, {"rating": 5.0, "review": "This product was so easy to set up, and it's worked perfectly from the very beginning.  I'd really like to buy another one for our main television, as it's nice not to have a big box sitting near the TV!", "verified": true, "helpfulness": "0/0", "author": "Kristi Audette"}, {"rating": 3.0, "review": "Lost wifi connection several times with no reason, and I need to pull the USB cable out and in, in order to get it back connected.", "verified": true, "helpfulness": "0/0", "author": "Xiaotao Liang"}, {"rating": 4.0, "review": "Very disappointing you still have to have a cable provider", "verified": true, "helpfulness": "0/0", "author": "Doniel Brisby"}, {"rating": 4.0, "review": "Great product and simple to use.", "verified": true, "helpfulness": "0/0", "author": "Dan Motley"}, {"rating": 4.0, "review": "Fire Stick was Great.,but the regular Fire TV has more power", "verified": false, "helpfulness": "0/0", "author": "ipodman2"}, {"rating": 4.0, "review": "amazon prime is amazing. we find more and more benefits all the time.  the fire stick is sleek and small.  the only drawback i have found is having to use 2 remotes and pressing the buttons on it are noisy, clicking sound.  but we are breaking away from directv and these are things we are getting used to.  will probably be getting another fire stick in the future.  also have a chromecast and find with the remote and paired with prime it is a better combination.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Way better than Roku stick!", "verified": true, "helpfulness": "0/0", "author": "norma lujan"}, {"rating": 5.0, "review": "Very pleased with product!", "verified": true, "helpfulness": "0/0", "author": "Branden"}]