[{"rating": 5.0, "review": "Works great. Works great with Netflix's", "verified": true, "helpfulness": "0/0", "author": "kevin slunecka"}, {"rating": 5.0, "review": "I really, really like.  So much better than trying to stream over a Wii or XBox.", "verified": true, "helpfulness": "0/0", "author": "Bull Sheriff"}, {"rating": 5.0, "review": "I received mine earlier today and I'm addicted.I don't understand why there are so many 1 star reviews.  This is so easy to set up and use.  Now I want to be the whole day watching tv.  Thanks Amazon for this amazing product!", "verified": true, "helpfulness": "0/0", "author": "Jonathan Santiago"}, {"rating": 2.0, "review": "Can it be use on any tv", "verified": false, "helpfulness": "0/1", "author": "Christina Cooper"}, {"rating": 5.0, "review": "Easy to use, I recommend it fully", "verified": true, "helpfulness": "0/0", "author": "omar"}, {"rating": 5.0, "review": "Words can hardly express how much I love this little devise!!  It is just about one of the coolest inventions ever!! It was so easy to set up that even a child could have done it.  It is even more amazing that (through the app) I can even use my phone as a remote control for the Fire Stick!  One of the best purchases I have ever made!", "verified": true, "helpfulness": "0/0", "author": "Debra Slaughter"}, {"rating": 5.0, "review": "After my research on AmazOn Fire, Apple Tv, and Chromecast I decided to buy the Fire stick and Im glad I did. Works great out of the box and is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Babak B."}, {"rating": 4.0, "review": "Why are you charging for some shows that were formerly free of charge with Prime, as in the case of 'Everybody Loves Raymond' and others?  I'm very disappointed that Amazon would pull a \"bait and switch\" ploy.", "verified": true, "helpfulness": "0/0", "author": "R. Barnes \"Rupie-Ally's Mom\""}, {"rating": 2.0, "review": "I love the idea of the Fire TV Stick, and the price. But the remote that comes with it needs a lot of improvement - the buttons don't work well. Sometimes they don't select at all, then they rapid select all the times you've pressed, and then some. Rework the remote, add $5.00 if you have to, and present a better product!!", "verified": true, "helpfulness": "2/2", "author": "AbbeyOMy"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Christina Lane"}]