[{"rating": 5.0, "review": "Easily watching all of our families favorite television shows....Continual play from one episode to the next.Sort of addicting, but definitely getting the best out of our time for the television we actually want to watch with no commercials.No monthly fees.Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Julia B. Nagorski \"julez4u\""}, {"rating": 5.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "Mary Brink"}, {"rating": 5.0, "review": "Great product, haven't had any problems so far!", "verified": true, "helpfulness": "0/0", "author": "Justin Poskus \"Jposk\""}, {"rating": 4.0, "review": "It's ok so far, the only dislike about it is that it's limited to my Windows phone. I can't get all the apps to work with it.", "verified": true, "helpfulness": "0/0", "author": "Nilo Batimana"}, {"rating": 5.0, "review": "Had hardware problem with first unit. After a bit of a frustrating month, Amazon shipped the replacement unit quickly. The new Stick works great. What a terrific little gizmo. Picture quality is surprisingly good.", "verified": true, "helpfulness": "0/0", "author": "PDejean"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Teresa Maile"}, {"rating": 5.0, "review": "Love being able to watch all our tv apps on the actual tv all in one place! Super easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "sondrablck"}, {"rating": 4.0, "review": "The only problem with this system is that movies and shows are not organized according to genera.", "verified": true, "helpfulness": "0/0", "author": "Lisa G."}, {"rating": 5.0, "review": "Great little device.  Have a Fire TV and Roku 3 on other TV's and this Fire Stick compares favorably with them as far as basic performance is concerned.  It does not have the usb or Ethernet ports like the others.  Nor does it have the number of apps/channels of the Roku 3 or the ear buds and lacks voice recognition on the remote like the Fire TV.  However, it has the same apps/channels as the Fire TV.  It does not load as fast as the Fire TV but about as fast as the Roku other than that it works just as well as the others, out putting great picture quality and good sound.  A great value if one is only going to be watching TV programming.  Would order another and have recommend it to friends.", "verified": true, "helpfulness": "0/0", "author": "rnldlbl \"weber cook\""}, {"rating": 4.0, "review": "It took a little longer than expected for the item to arrive.  It was easy to set up and watch movies.  The hardest thing was opening the remote case to install the batteries.  Apparently my internet may be too slow because one of the movies I tried to watch kept buffering.", "verified": true, "helpfulness": "0/0", "author": "Joseph C. Guillot"}]