[{"rating": 4.0, "review": "Just received 2 days ago. Plugged it in, followed prompts and it worked flawlessly. The big test will be when it goes on vacation with me to Puerto Rico. We have wifi there so I don't anticipate a problem.", "verified": true, "helpfulness": "0/0", "author": "goldrush"}, {"rating": 5.0, "review": "Works well. Does just what it says it will do. I can control it with my phone. I like it.", "verified": true, "helpfulness": "0/0", "author": "Dan R"}, {"rating": 3.0, "review": "Great for a second tv. Doesn't work perfectly though, the image freezes often especially on Hulu", "verified": true, "helpfulness": "0/0", "author": "Alexandra Ramniceanu"}, {"rating": 5.0, "review": "Love it so much, I'm ordering another!", "verified": true, "helpfulness": "0/0", "author": "Rebecca Thomson"}, {"rating": 5.0, "review": "The Fire Stick is all it is advertised to do. It was easy to set up and easy to maneuver. I am still learning the menu but, as anything, takes familiarity. I certainly like not having another box to have on the table. I also have the Roku on another TV and I think the features of the Fire is better so far.", "verified": true, "helpfulness": "0/0", "author": "Lindside"}, {"rating": 5.0, "review": "This Amazon fire stick is great. The only thing that would have made it better is if it could have been powered by the TV itself.", "verified": true, "helpfulness": "0/0", "author": "Jerry Withrow"}, {"rating": 5.0, "review": "I got this for my toddler so we could access the movies and shows she normally watches on her kindle and it is perfect for that. The Fire TV stick plugs into the HDMI port on the back of the TV so my child can't access it and when the remote is put away, she has no way to watch television since her TV isn't connected to cable. The menu is pretty easy to navigate and the parental controls make it easy to prevent any unauthorized purchases. I actually like it better than our Apple TV since we can access our prime video content as well as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Niomi"}, {"rating": 5.0, "review": "I love this thing. Very easy to use and it does not need to use my kindle or computer to work.", "verified": true, "helpfulness": "0/0", "author": "Jody Baron"}, {"rating": 5.0, "review": "This was a Christmas gift from our daughter.  At first it seemed it wouldn't work at our house because of slow internet but have learned to use when demand is low.  Works great once we have a good connection. Great gift.", "verified": true, "helpfulness": "0/0", "author": "lmk"}, {"rating": 5.0, "review": "Its superb", "verified": true, "helpfulness": "0/0", "author": "MYESIA"}]