[{"rating": 3.0, "review": "The fire tv stick works pretty well, though it is designed to push out Amazon content. You have to go to the apps section to find Netflix, HBOgo, etc.  The main issue I have and the reason I only gave it 3 stars is it is not supported by all cable companies. I happen to have charter cable here in the Midwest and my roku worked perfectly until it had a housekeeping mishap. So I replaced it with the fire tv stick because I figured it would do the same thing as my roku but$10 cheaper. Well, that was a mistake. I tried to install hbo go and a couple of others and they are not supported by charter cable. It just recommends contacting your cable company.  Well we all know how that's going to end. So if you want to watch hbo go or sho anytime, make sure your cable company supports it before you order. Or, just order a roku.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Never was deliver  and  they wouldnt replace it, so no review. .", "verified": true, "helpfulness": "1/3", "author": "Robert Smith"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Henry W."}, {"rating": 5.0, "review": "Cheaper than Roku and seems to be just as good.", "verified": true, "helpfulness": "0/0", "author": "Barbara Wallace"}, {"rating": 4.0, "review": "Hi,Can anyone please let me know if I will be able to see videos from my ipad in the fire tv using any app? If so, how? Also will this stick be supported in VIZIO LCD tvs? Thanks in advance,Abhijnan", "verified": false, "helpfulness": "0/1", "author": "Abhijnan K."}, {"rating": 5.0, "review": "I needed something to cast my videos from my desktop to my main television when desktop installed media servers such as UMS and Servillo began to fail to deliver AVI and H.264 packaged material to a Sony BDP-780 due to Sony incompatibility issues after Sony software updates.  I went to Best Buy and purchased Google Chromecast and the Fire TV Stick with the intention of trying them both and returning one to Best Buy.  I returned the Chromecast without breaking the seal of the box since the Fire TV Stick ticked all the boxes with the help of the Plex app.July 7, 2015 update:  I am currently watching the latest episode of Corrie on STV.  Enjoyed Glastonbury two weekends ago on the BBC iPlayer - brilliant.Plex has been great for watching content on my PC on the Sony LED TV.Fire TV Stick + Smart DNS = Great Device", "verified": true, "helpfulness": "0/0", "author": "Allon"}, {"rating": 1.0, "review": "Doesn't get along with comcast for hbo", "verified": true, "helpfulness": "1/1", "author": "Ashley Kooiker"}, {"rating": 5.0, "review": "Providing you have a minimum amount of experience with electronics, installation and setup are a snap. I had it up and running in 5 minutes but I had to add a 6' HDMI cable with female-female connector to reach my power source. I didn't measure it but the power unit and cord with extender, that comes with the unit, only measure about 5'. You need to know your WiFi signal code to connect to your network and can avail yourself of the 30 day free trial period of Amazon Prime or if you are a prime member it recognizes you. Of course it runs many other streaming apps other than Prime but I only needed it for Prime because of the older TV I have.  A PLEA TO ALL MANUFACTURERS, COULD YOU PLEASE MAKE YOUR REMOTES A BRIGHT COLOR THAT WOULD BE EASY TO FIND. Black remotes seem to be the only convention that electronics firms adhere to.", "verified": true, "helpfulness": "0/1", "author": "Mike"}, {"rating": 4.0, "review": "Got it a good deal. Works fine as stated. Just another device for me to use since I have Amazon Prime already.", "verified": true, "helpfulness": "0/1", "author": "Manny Traveler \"Bargain Hunter\""}, {"rating": 5.0, "review": "It's good - even though my new TV has AP as an APP the stick still comes in handy onother TV's or when traveling", "verified": true, "helpfulness": "0/0", "author": "The IT Guru"}]