[{"rating": 5.0, "review": "Extra  TV not connected to cable, works great.", "verified": true, "helpfulness": "0/0", "author": "Carol Sundqvist"}, {"rating": 4.0, "review": "I really enjoy the fire stick. I can watch all of my favorite shows. The only reason didn't give 5 stars is because you need an active cable subscription with username and password to get apps like HBOgo and Starz etc. Otherwise, the fire stick is great! It updates often with new show and movies and is linked directly to my amazon account. Highly recommend for those who do not want to pay an obscene amount per month for cable.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Shilly Shalley"}, {"rating": 5.0, "review": "This thing is awesome! I stream prime videos all the time now !", "verified": true, "helpfulness": "0/0", "author": "brent lawson"}, {"rating": 5.0, "review": "I have an Apple TV and I owned a roku I like this better", "verified": true, "helpfulness": "0/0", "author": "Francisco M. Matos"}, {"rating": 5.0, "review": "Instructions were like 3 steps, plus an automated 3-5 minute instructional video that tells you EVERYTHING you need to know, in a user friendly manner.Has remote, or you can connect to your smart phone to use as a remote, keyboard and voice control. Pretty cool!Was paying 10$ a month just to use my xbox live, when this is a $40 one time payment and EASY AS HELL to use. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 3.0, "review": "I have two Roku devices, so my comments are based on a comparison between the Fire TV Stick and the Roku. I figure that there are many other people like me out there that want to know how this measures up.It's cheaper. It has a dual band (which the stick model of roku doesn't have) which is supposed to allow for better wifi reception. I can't say it's better than the single banded stick, because my roku stick is in the bedroom next to the modem. What I CAN say is that from the living room, my dual banded Roku 2 gets WAY better wifi reception than the Fire TV Stick. I actually bought the Fire TV stick for my aunt, who is in a nursing home. Dual banded or not, the Fire TV stick will not keep a wifi signal long enough to even get a movie loaded, even though the Wifi server is only about 150 feet down the hall, at most. I'll be giving this to one of my kids for Christmas. It's useless for what I bought it for.Both Roku and Fire TV allow pretty much \"plug and play\" capability with any TV that has an HDMI port. Both have remote controls, and both have remote control apps that you can download to your phone for even easier use.Fire TV has a very limited number of apps, or \"channels\" to select from. Most of the favorites are there (Netflix, Hulu, Pandora, etc) but it is definitely missing some that I can't live without... such as Vudu or any other movie network that you can stream your digital and ultraviolet copies from. Understandably so, I guess, since Amazon is naturally going to be proprietary. But Amazon doesn't allow you to link up to a UV library of films that you own, and until they do, Amazon's movie streaming is going to always be less desirable in my opinion. And that means that their Fire TV stick is going to be a distant second to Roku. Same goes for cloud based playlists. Amazon's Fire TV Stick will let you run Pandora, but you're screwed if you want to listen to a Spotify playlist that you pay a monthly fee to have access to.The Fire TV stick also loads the channels much slower than Roku.So there ya have it. Make your own choice. My choice will continue to be Roku.", "verified": true, "helpfulness": "1/1", "author": "christie smith"}, {"rating": 4.0, "review": "great speed. really enjoy although buffering on some things aggravating.", "verified": true, "helpfulness": "0/0", "author": "Steve Shropshier"}, {"rating": 5.0, "review": "I got the firestick \"free\" with a three month subscription to Sling TV.  While I think the Sling service works well, I was really impressed with the Firestick and think it's more than worth the $40 purchase price.  Menus are fast and it is easy to navigate.  If you have Netflix and/or Amazon Prime it's all the entertainment you will ever need.  Free apps like the PBS Kids App are awesome if you have little kids.  Fast and easy to set up.  I was logging onto Netflix within 5 minutes of opening the box.", "verified": true, "helpfulness": "0/0", "author": "Wesley G Gunst"}, {"rating": 5.0, "review": "I was very upset when I bought my new TV, because it did not have the Amazon app on it. as a Prime member I was used to the benefits that Amazon Prime offered. The Fire Stick gave me back my ability to use my Amazon Prime TV. I love the convenience of accessing my prime  movies, and video library. A plus is the ability to control it all from my cell phone remote  app.", "verified": true, "helpfulness": "0/0", "author": "Melanie Davis"}, {"rating": 5.0, "review": "Great functionality in a small package, allcast works well also. Not quite as snappy as the full size Fire TV, but still good enough. Perfect for portable/mobile flat panel or a bedroom/office.  Personally, I wouldn't use it for a home theatre setup... but you could I guess.", "verified": true, "helpfulness": "0/0", "author": "Brad&May"}]