[{"rating": 5.0, "review": "Amazing. Got rid of cable! Works really well. Buffers sometimes but nothing that gets annoying.", "verified": true, "helpfulness": "0/0", "author": "Jamie L Ambrose"}, {"rating": 4.0, "review": "Is very good.", "verified": true, "helpfulness": "0/0", "author": "Lazaro Madrigal Perez"}, {"rating": 4.0, "review": "Very glitchy. Other than that I'm happy with it.", "verified": true, "helpfulness": "0/0", "author": "Ryan Joel Sims"}, {"rating": 2.0, "review": "can't get to work i must be doing something wrong it;s probably me", "verified": true, "helpfulness": "0/0", "author": "phil230"}, {"rating": 5.0, "review": "My Kids enjoy playing games on it and watching movies.  Thanks Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "jerson"}, {"rating": 1.0, "review": "I bought my first Fire TV Stick when they were offered to Prime Members.  It has had terrible problems streaming Netflix and Hulu, it pauses and makes a loud noise every so often, but it works for Amazon Prime content, so I continued to use it.  I recently bought a second one for my son, and it worked great for a few weeks, then started causing the TV to flash and/or freeze.  Tried the AppleTV and Tivo in the HDMI port, and no problem, definitely the Fire Stick causing the issue.  It has been a NIGHTMARE trying to get Amazon to replace the defective Stick.  I finally received a new Fire Stick today WITH NO POWER SUPPLY.  I sent back the old power supply when I returned the defective Stick (not entirely sure which part was defective).  E-mailed support, told to live chat, live chat told me I needed to talk to Fire TV support - all to get the replacement power supply they should have sent in the first place.  I'm done with Fire TV.  Bought my son an AppleTV...", "verified": true, "helpfulness": "0/0", "author": "Kalo"}, {"rating": 4.0, "review": "I watched a few movies and not bad. My computer is a little slow.", "verified": true, "helpfulness": "0/0", "author": "daniel ockington"}, {"rating": 5.0, "review": "use this in my bed room. like it alot so far. almost as much as my apple tv but not quite. easy interface", "verified": true, "helpfulness": "0/0", "author": "Bret J."}, {"rating": 5.0, "review": "Saw this product at my brother's home and was amazed at what it could do. Ordered my own, brought it to our seasonal home in Santa Fe where we have internet, but not much else. Followed the simple directions and...what do you know...we have unbelievable television viewing. Not the network channels, of course, but everything else, including Netflix!Can't say enough about this simple, effective product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So much nicer to be able to view my Prime movies and TV shows on the big screen vs my laptop. Not sure why I didn't get this earlier.  Also, Amazon does have a really decent catalog of pay-to-rent/own movies, both new and old, so I use this as a supplement to my PPV, Netflix and Hulu accounts.", "verified": true, "helpfulness": "0/0", "author": "Lola's Mom"}]