[{"rating": 5.0, "review": "Mainly used it to display Netflix on my family TV, but love how much more can be done with it. Best investment I've made!", "verified": true, "helpfulness": "0/0", "author": "Liladysigner"}, {"rating": 4.0, "review": "Sometimes laggy and not sure I understand the whole needing a wall adapter... but other than that a great product. Love that I can use my phone as a remote.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Smoyer"}, {"rating": 1.0, "review": "I have not been able to use it fully because of three major issues.The only time I used, I had hell lot of streaming issues. Though internet was connected it kept on saying no internet connection and I got irritated of it and left it there.Display is a major issue. I have 40 inch HD samsung tv but the display either does not fit properly. If I set auto I am not seeing the picture full screen if I make it fit to screen I am seeing atleast 2 -3 inches from all 4 sides being cut. I tried scale but it didnot help.The home page is crazy and the UI flow is so confusing. I probably comparing to ther streaming players I am using but I dont like this flow.", "verified": true, "helpfulness": "0/0", "author": "Abinash"}, {"rating": 5.0, "review": "Got my new Fire TV Stick and it works great.  Netflix comes up faster on the stick than my DVD player that has an Ethernet connection.  All of the apps are easy to find and the menu system works well considering all the items you can search through.", "verified": true, "helpfulness": "0/0", "author": "lfh"}, {"rating": 4.0, "review": "Having a good time with it. I thought it would be more free movies", "verified": true, "helpfulness": "0/0", "author": "Rev Mike Carrow"}, {"rating": 2.0, "review": "having a difficult time with the stick skipping and pausing. got new internet and still has a habit of doing it. has limitations to the internet", "verified": true, "helpfulness": "0/0", "author": "Lisa L Owen"}, {"rating": 5.0, "review": "Wworks great!", "verified": true, "helpfulness": "0/0", "author": "michael alves"}, {"rating": 5.0, "review": "Works Great!!", "verified": true, "helpfulness": "0/0", "author": "Ronald Ames"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome! It does what it's suppose to... and loads really quick! Has alot of content on it! Love it!", "verified": true, "helpfulness": "0/0", "author": "Jessica R"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Thomas Lanoie"}]