[{"rating": 5.0, "review": "This little stick does all that I hoped it would do which is provided easy access to Amazon Prime videos and Netflix. I know it does more like games and such but I couldn't be happier with how I've be able to use it in this past week since hooking it up to my SONY TV! I highly recommend it.", "verified": true, "helpfulness": "0/1", "author": "nmiller"}, {"rating": 4.0, "review": "Order was on B/O for a while, but it was shipped as soon as it was in.", "verified": true, "helpfulness": "0/0", "author": "Mary Tataryan"}, {"rating": 4.0, "review": "It still has to download maybe 2 times during a 1 hr show, even with the wireless router in the same room, but it's still better then when I was using a blue-ray dvd player.", "verified": true, "helpfulness": "0/0", "author": "ed miller"}, {"rating": 5.0, "review": "Fast n Easy hookup great product", "verified": true, "helpfulness": "0/0", "author": "Randy Lee Amrein \"Red\""}, {"rating": 5.0, "review": "I find it very easy to use, however the remote could be a little larger for larger hands.", "verified": true, "helpfulness": "0/0", "author": "Ruth Habich"}, {"rating": 5.0, "review": "Thank you AMAZON. Use my fire stick a lot. Y'all are the best...", "verified": true, "helpfulness": "0/0", "author": "Vicky Clayton \"Vicky C\""}, {"rating": 5.0, "review": "Works Great! Just make sure you're aware you still need to plug it in to the HDMI AND a wall or usb outlet", "verified": true, "helpfulness": "0/0", "author": "Tyler Conlin"}, {"rating": 1.0, "review": "Firestick is very disappointing!  It keeps buffering!  It will buffer several times while viewing shows or movies. It it not my internet provider as I hooked up a RoKu to the same TV and internet connection and have had NO problems at all with the RoKu.", "verified": true, "helpfulness": "1/2", "author": "Sandy L \"Sock-it-to-me\""}, {"rating": 5.0, "review": "I'm debating selling my apple tv to get one of these. The interface is smooth and i like how the home screen is integrated. Buy it the price is too good.", "verified": true, "helpfulness": "0/0", "author": "Claudio Villani"}, {"rating": 5.0, "review": "We love it and we ARE NOT techno-geeks.  The only disappointing thing was that we didn't realize you have to have a preferred provider for the Watch ESPN program.  Direct TV, OF COURSE, is not on the list.  So if you are trying to get rid of Direct TV (which we are) you will have to \"borrow\" friend or family id from other provider (U-verse, TWC, etc.).  We have family members with U-verse who were willing to provide their info.  It's not the same as satellite quality....there are a few blips..when watching shows, but it's way worth it for us.  We were around when TV was free and we could choose what we wanted to watch.  This was our answer for affordable TV series, movies, and ESPN.  Be bold!! Cut the cable/satellite cord and go ALA carte!", "verified": true, "helpfulness": "0/0", "author": "Kelly Szalanski"}]