[{"rating": 5.0, "review": "Everything worked fine and easy to install.", "verified": true, "helpfulness": "0/1", "author": "pianokay"}, {"rating": 5.0, "review": "Works.", "verified": true, "helpfulness": "0/0", "author": "Richard Schnatterly"}, {"rating": 5.0, "review": "Its our second Amazon Fire stick - we keep adding them to our tvs.  Absolutely awesome", "verified": true, "helpfulness": "0/0", "author": "Toddd L. Tomlinson \"Todd Tomlinson, Author\""}, {"rating": 5.0, "review": "Good price.  Arrived on time. Easy to connect. I am only using it for NetFlix and Pandora so far and am very happy.", "verified": true, "helpfulness": "0/0", "author": "Wally S. Smith \"wacowally\""}, {"rating": 2.0, "review": "not really crazy about it. seems like im always having trouble doing something. just wasn't as simple as it was supposed to be", "verified": true, "helpfulness": "0/0", "author": "michael a. frangipane"}, {"rating": 2.0, "review": "I prefer my Fire TV box. It isn't as fast as the box.", "verified": true, "helpfulness": "0/0", "author": "Meghan May"}, {"rating": 4.0, "review": "The Fire TV Stick works very well. I have used it for about two months now and have had no problems with it. Love Prime TV.", "verified": true, "helpfulness": "0/0", "author": "M. Rainis"}, {"rating": 1.0, "review": "Very slow, with long loading times.  I already had an Apple TV on my upstairs TV so I thought I would give the Fire TV Stick a try for my basement TV.  I was not impressed, the load times took for ever and I had constant buffering issues.  I think this may have to do with the fact that the unit has no hard drive and is simply a flash drive.  I thought that maybe the issue was that my router was too far from the TV, so I moved my signal booster to the basement.  This did not fix the issue, it still loaded slowly and needed to buffer every few minutes. I returned this unit and spent the additional $20 for another Apple TV and have had no issues with it.As a side note (because the photos, nor the TV ads show this):  the fire stick (flash drive) needs to connect to your TV via a wired cable (which is not very long).  If you are not expecting this, you might have to deal with covering up the wire behind your TV for aesthetic purposes.", "verified": true, "helpfulness": "0/0", "author": "Scott A. Larson \"Ti99er\""}, {"rating": 5.0, "review": "I first bought Chromecast but once I read all the features of the Fire TV Stick, I had to check it out and boy am I glad I did.  It blows Chromecast out of the water!", "verified": true, "helpfulness": "0/0", "author": "Lindsay Reilly"}, {"rating": 5.0, "review": "Great product. I have another device that is similar to this, but the Fire Stick's interface is easier to use.", "verified": true, "helpfulness": "0/0", "author": "Regniers"}]