[{"rating": 5.0, "review": "So far so good! Set up was easy; was able to start watching shows within 10 minutes of opening the box.", "verified": true, "helpfulness": "0/0", "author": "gep25nla"}, {"rating": 5.0, "review": "Let me say that I am very impressed by what Amazon has done with this gizmo.  We have 2 rokus and 3 Chromecasts.  I added this to a new 50 inch LG TV that we placed in the bedroom.  I actually like this better than the Chromecast and the Roku!  Why?....because of the remote control and remote voice search android application.  They will be adding a remote application for IOS soon.  I also like the fact that you can play some games on it.  The menus are good enough and the free prime movies are clearly indicated on the movie thumbnails.  I also think that the streaming works better than my Roku and if you go to the home screen and leave for awhile it reverts to displaying beautiful photos on my TV that are much nicer than the Chromecast photos.  I'd like to see them add more apps to it like TED.", "verified": true, "helpfulness": "0/1", "author": "FrankK"}, {"rating": 5.0, "review": "This is the perfect companion to any HDMI pug and a smart TV along with its Chromecast buddy plugged next to it! I love its UI and its ease of set up. Very inexpensive means of entertainment! Well done Amazon!!", "verified": true, "helpfulness": "0/1", "author": "brian s thomas"}, {"rating": 3.0, "review": "Overall it works well, especially for the price.  But I am knocking off two stars until Amazon supports Mira-cast fully (as it advertises it does).  Mira-Cast works form my Android devices, but it doesn't support Windows 8.  True Mira-cast is not platform specific.  It should work across any devices that claim to be certified.  Google it for more information.  Amazon, please fix this!", "verified": true, "helpfulness": "0/0", "author": "Brent"}, {"rating": 4.0, "review": "Works good and it is fast when moving thru the menus.", "verified": true, "helpfulness": "0/0", "author": "Moby"}, {"rating": 5.0, "review": "The Fire Stick is even more than I expected. We love it. Have been amazed at how well it ties in with my Kindle and Fire Phone. Very easy to move from one TV to another, we even took it to the beach with us. Only problem we experienced was with our large TV which is attached to a speaker system and a cable box. It took us a while to figure out that you should only have the TV turned on and not the total system or you will not get sound.We could not be more pleased", "verified": true, "helpfulness": "0/0", "author": "Gin"}, {"rating": 1.0, "review": "NETFLIX DOESN'T WORK ANY MORE WITH THE NEW SOFTWARE! Plus the selection of movies on Prime is terrible!", "verified": true, "helpfulness": "0/0", "author": "Lucy's Mom"}, {"rating": 5.0, "review": "I absolutely love this! My kids enjoy this better than the roku.....it takes a little while to get use to the interface and layout use because it's different than the roku. I love that you can watch prime tv shows....this device offers so much more than any other ones! I just recently purchased the voice remote and works great with the fire stick! And I love the size of the remote compared to the one that comes with the fire stick! I definitely recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Amy Gevens"}, {"rating": 4.0, "review": "The fire stick works great my only suggestion is to make a section on the home screen that has all tv channels like discovery and national geo", "verified": true, "helpfulness": "0/0", "author": "Jason brown"}, {"rating": 5.0, "review": "Easy to set up, remote very handy.", "verified": true, "helpfulness": "0/0", "author": "Joyce Ornelas"}]