[{"rating": 3.0, "review": "I gave it 3 stars because it hasn't been a year, it's been maybe 6 months and now it won't work. It started off great, I loved it. I don't have basic cable I have hulu, netflix, prime, and others online networks so it was perfect. But now it won't link up with my WiFi all my other devices are doing just fine with it but the fire tv stick won't I have tried several things to try and get it to work but it just won't!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Robert H."}, {"rating": 5.0, "review": "I love it!  I don't have much time to watch TV and this is convenient for me to catch up on series that I have neglected to watch.", "verified": true, "helpfulness": "0/0", "author": "Mary Elizabeth Williams"}, {"rating": 4.0, "review": "I would give this 5 stars, but it really doesn't replace the need for cable yet. You need an amazon prime, hulu plus, netflix, and xfinity/cable subscription to get the most out of this. The prime movie selection is pretty weak. I don't have hulu plus (since we already spend a ton on cable). I feel like my options are a bit limited. The games you can play in groups are fun for get-togethers with family (e.g. You Don't Know Jack). But mostly I use this to watch old ocean documentaries from Prime or MST3K on the Pluto TV app as I go to sleep. It has eliminated the need for us to have a cable line hooked up to our bedroom TV, but not the need to have cable altogether because we still need college football in our living room. If Amazon could sell us shark week and all the college football broadcasts we need we'd get rid of Comcast yesterday. C'mon Amazon! You're almost there!!", "verified": true, "helpfulness": "1/1", "author": "Turanga Leela"}, {"rating": 5.0, "review": "Love it so much!!", "verified": true, "helpfulness": "0/0", "author": "Bridget D."}, {"rating": 5.0, "review": "I don't have a smart tv & it gives me all of the functions of a smart tv. I love it!", "verified": true, "helpfulness": "0/0", "author": "Kayla George"}, {"rating": 5.0, "review": "I view everything I want, have watched a variety of genres, and the buffering is short. I'm sold.", "verified": true, "helpfulness": "0/0", "author": "Lianna \"Walking, Adventure, Learning, Doing, Becoming, Strength and Faith in my Lord and Savior is all about me.\""}, {"rating": 5.0, "review": "Functioned as expected. I bought it to access Netflix - it was easy to install", "verified": true, "helpfulness": "0/0", "author": "K. Cole"}, {"rating": 5.0, "review": "Works as advertised. Gave it to my daughter who loves its portability.", "verified": true, "helpfulness": "0/0", "author": "Michael E. Lewis"}, {"rating": 1.0, "review": "unable to make it work.  Called for help on two occasions without resolution.  Donald E Martin", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]