[{"rating": 5.0, "review": "The unit was easy to install and easy to use. It totally met my expectations, and I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Stew"}, {"rating": 5.0, "review": "Wish I can rate is ten stars..", "verified": true, "helpfulness": "0/0", "author": "Christine Tunison"}, {"rating": 3.0, "review": "like it better than google chrome  would like them to offer other pay per view like encore western channel or stars.doesn't work very well with hulu", "verified": true, "helpfulness": "0/0", "author": "GEORGE LAIRD"}, {"rating": 4.0, "review": "So far we love it. Just wonder if we can all get one in each bedroom so we can all catch up on our shows and connect to wifi without interruption!", "verified": true, "helpfulness": "0/0", "author": "kerry williams"}, {"rating": 3.0, "review": "i like it but it take awhile to exit", "verified": true, "helpfulness": "0/0", "author": "alexis mitchell radford sr"}, {"rating": 5.0, "review": "Works really well.", "verified": true, "helpfulness": "0/0", "author": "Hangtown Frosty"}, {"rating": 3.0, "review": "It does everything it sets out to do fantastically! However, they are lacking in a few apps that I, personally, almost require. The apps are CrunchyRoll, and The Mormon Channel. I traded out my old Roku device for this, and am thinking I may plug the roku back in just to get my channels back. I am well aware i'm outside the majority of customers with this complaint, but for me they are very important (as important as TV can be ahah).", "verified": true, "helpfulness": "0/0", "author": "Dustin"}, {"rating": 5.0, "review": "Works great allot better than the Roku Streaming stick 3400m I was using", "verified": true, "helpfulness": "0/0", "author": "William Fairbourne"}, {"rating": 5.0, "review": "Great gadget.", "verified": true, "helpfulness": "0/0", "author": "gail labrosse"}, {"rating": 5.0, "review": "Fire stick is very easy to use, had a google crome cast first but much prefer the fire stick. The remote is the best part compared to crome cast where you have to yous other devices. Also seems that the fire stick is a bit faster with less freezing", "verified": true, "helpfulness": "0/0", "author": "brandon"}]