[{"rating": 4.0, "review": "I like the fire stick because it is very easy to install and operate.  On mine it will let me watch a few episodes and then it freezes.  I am going to call Amazon and see if this is normal.  Maybe I am not doing something correctly.  I do love it and watching shows is easy.", "verified": true, "helpfulness": "0/0", "author": "Donna Montgomery"}, {"rating": 4.0, "review": "very unclear about what is free and what is not free.", "verified": true, "helpfulness": "0/0", "author": "edith marshall"}, {"rating": 5.0, "review": "Great way to get Amazon Prime video on your TV. Easy to set up and use. I would have liked to be able to have the features of a competitor that I could get internet streamed also.", "verified": true, "helpfulness": "0/0", "author": "Kirk Kloeppel"}, {"rating": 5.0, "review": "This is so easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "loretta"}, {"rating": 2.0, "review": "Needed some printed directions with the stick.....could not get CC connected for movies.......called customer service.....they couldn't help....said that they would call back within 24 hrs....still waiting", "verified": true, "helpfulness": "0/0", "author": "Catherine Kangas"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Rachel Limpus"}, {"rating": 5.0, "review": "The Fire stick met our expectations and more. We are able to use Netflix and Amazon Prime along with other TV and movie sites. It was easy to install and it is easy to navigate. We are very excited to have this new resource savailable for our TV viewing.", "verified": true, "helpfulness": "0/0", "author": "Merry G"}, {"rating": 5.0, "review": "GREAT as PROMISED!  Received yesterday, opened and installed easily.  Works on all TVs in home without need to login after initial set up was done in order to connect to one's WiFi.  Needed to use recommended adapter (which is included) and everything worked quickly and easily on first try.  Much better product than Google Chromecast.  Very satisfied and recommend fully!  Ron", "verified": true, "helpfulness": "0/0", "author": "Ron Gregory"}, {"rating": 5.0, "review": "Fun and very easy to set up and use!!!!", "verified": true, "helpfulness": "0/0", "author": "Thomas A. Regan"}, {"rating": 5.0, "review": "I am obsessed with the Fire Sticks! I have three in my household and now I'm buying them for family as gifts. :) They make it soooo easy to manage all of my TV subscriptions and Im seriously considering cancelling my cable. With two teens and a hubby who watch all different shows, and me working from home, these sticks get a workout! If you have netflix and hulu or amazon prime or another subscription, you definitely need one of these. It allows you to search for a TV show or actor across all of the platforms at once. This is so awesome! I used to have to login to netflix, hulu plus, amazon instant video, HBO GO, etc every time I was looking for something. Now its so simple! I cant give it high enough stars, I wish I could give it 10! :D;", "verified": true, "helpfulness": "0/0", "author": "Queen Bee Designs"}]