[{"rating": 5.0, "review": "Exceeded expectations. Easy to use, much better performance than the built in apps in the TV", "verified": true, "helpfulness": "0/0", "author": "Steven D. Doyle"}, {"rating": 5.0, "review": "So easy to install and use. Can not wait till more drama series are out from Amazon.", "verified": true, "helpfulness": "0/0", "author": "get your colonoscopy!"}, {"rating": 4.0, "review": "we are happy with it since we got a prime membership we have access to many shows.", "verified": true, "helpfulness": "0/0", "author": "G"}, {"rating": 5.0, "review": "This is the easiest, most entertaining, least inexpensive way to enjoy the thousands and thousands of movies, tv shows and games....got to tell you I love it. What a great idea!!!!", "verified": true, "helpfulness": "0/0", "author": "William Cornell \"A Real Copywriter\""}, {"rating": 5.0, "review": "I love the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Weasely"}, {"rating": 2.0, "review": "I was very disappointed in this product.  NOt having anything else to compare it with I did expect it to be what the what the advertisement on television represented by Gary Busey.  Everything costs money, naturally.  I just thought I would get more free movies (160 and many of them really old) and other options.And, to be honest, we are in our late 60's and too tired to figure all this technical stuff out along with it all.", "verified": true, "helpfulness": "0/0", "author": "H. Reiner \"crazy over T\""}, {"rating": 5.0, "review": "I have Google Chromecast and Fire TV Stick. The Fire TV Stick works great and gave me everything I need. It is worth the extra $4 vs Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Laura Parten"}, {"rating": 5.0, "review": "So far so good! Got it this afternoon, had it up and running in 5 minutes. Very easy browsing for content. We travel a few times a year and stay in hotels. Some of the best hotels have awful TV reception so this will keep my husband happy.", "verified": true, "helpfulness": "0/0", "author": "Bevy \"Nunyoz\""}, {"rating": 5.0, "review": "Packaged nicely, very easy set up, had no problem at all hooking up to my WiFi. Currently happy with it.", "verified": true, "helpfulness": "0/0", "author": "Patrick Ecklund"}]