[{"rating": 5.0, "review": "I ordered this around black Friday last year for $20. The fire tv stick is awesome! I can stream all of my media on an hdmi tv anywhere I go. Great product.", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "Awesome!! This thing is just the best. LOVE it!!!", "verified": true, "helpfulness": "0/0", "author": "curtis elam"}, {"rating": 5.0, "review": "Beyond expectations. What a marvel. I just canceled some cable services. I recommend this device for everyone. Will be purchasing additional units for my other tv's.I just added Netflix and while I know this is super bowl Sunday it keeps buffering which is not such an issue with Amazon.We'll see", "verified": true, "helpfulness": "0/0", "author": "PATCHMAN"}, {"rating": 1.0, "review": "I'm interested in purchasing these items, but I'm curious about if there's any hidden fees, and how it works. I'm just looking for over all information on the whole set up. Requirements and all.. Any information would be greatly appreciated!!", "verified": false, "helpfulness": "0/5", "author": "Kristie Boreham"}, {"rating": 4.0, "review": "Product works as described, however one thing you WONT see in commercials is that it needs to be plugged in 100% of the time to the wall outlet. No just sticking it into the TV. Otherwise great", "verified": false, "helpfulness": "0/0", "author": "Trevor"}, {"rating": 5.0, "review": "GREAT picture, simple easy to use remote.  Any issues with signal just use the extender! Piece of cake!", "verified": true, "helpfulness": "0/0", "author": "ROBERT CORDOVA"}, {"rating": 5.0, "review": "Absolutely great!!!  Can't complain about it.  It's so much better than hooking my laptop up to the tv to view netflix and you tube. Also the picture is fuller and better looking when using the firestick than when i am just using my laptop. Also I already have netflix and am going to keep the amazon prime as well, it has many movies and tv shows that netflix doesnt have.  Will keep them both.", "verified": true, "helpfulness": "0/0", "author": "charles underhile"}, {"rating": 5.0, "review": "these work great", "verified": true, "helpfulness": "0/0", "author": "William Graveley"}, {"rating": 5.0, "review": "I am so happy to be a prime member, I am enjoying all the old T.V. shows. It will take a long  time until I see the movies. The price is very in expensive for what  you get. It is also very easy to install, even a man can do it LOL !!!", "verified": true, "helpfulness": "0/1", "author": "CHEVY LOVER"}, {"rating": 5.0, "review": "Works like a chromecast and is a good value. Not very expensive.", "verified": false, "helpfulness": "0/0", "author": "daniel campbell"}]