[{"rating": 5.0, "review": "Need to learn more but think I am going to like it a lot", "verified": true, "helpfulness": "0/0", "author": "Ginny Carson"}, {"rating": 5.0, "review": "Awesome device. Simple, great to use and lots of content, especially with Amazon Prime. Just wished that we would've bought it at a lesser price during their Black Friday in July sale.", "verified": true, "helpfulness": "0/0", "author": "Officer Flossy"}, {"rating": 5.0, "review": "Easy setup.", "verified": true, "helpfulness": "0/1", "author": "Jan"}, {"rating": 4.0, "review": "The amazon fire is pretty awesome, good app variety, great streaming and it's a  perfectly portable product, fifty times better then my smart tv which was capable of instant streaming about once every two weeks. Glad I made the purchase & am now just waiting to see how the fire stick handles the test of time.", "verified": true, "helpfulness": "0/0", "author": "joyce robles"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 1.0, "review": "I am on my second replacement and it still doesn't work.  I am about ready to just send it back and get my money back.", "verified": true, "helpfulness": "0/0", "author": "Jane"}, {"rating": 5.0, "review": "Love love love it", "verified": true, "helpfulness": "0/0", "author": "Anna Gillard"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Mohamed Bah"}, {"rating": 5.0, "review": "I was surprised! About 7 months ago I ordered a Google Chromecast and spent an entire day trying to figure it out. Finally, out of total frustration; I gave it away and decided to keep my cable service. Then I saw the reviews on the Fire Stick. Reluctantly, I ordered it and to my absolute surprise, it took less than 3 minutes to hook up, sign in and start using..I love it and will be getting more for other tvs in the house. As an added bonus, eventually we are cancelling the extended cable.Now if we can figure out how to download and play games..ugh.", "verified": true, "helpfulness": "1/1", "author": "CATHI"}, {"rating": 5.0, "review": "Does just what it says it will Thanks", "verified": true, "helpfulness": "0/0", "author": "Elmer Haberman \"Elmo\""}]