[{"rating": 3.0, "review": "I have a Roku 2 and the Fire TV Stick both attached to my TV. I find the Roku is still the preferred device for most of what I want to use it for. The biggest complaint I have about it is the fact that all screens are full of movies and shows that I don't want to watch. I mostly use Plex and occasionaly Prime TV and Movies.", "verified": true, "helpfulness": "0/0", "author": "G. Peterson"}, {"rating": 5.0, "review": "seriosly, best purchase I've made in a while. I used to stream all my videos from my laptop to my tv through an HDMI cable. It was nice, but still a hassle to start up and shut off. I saw that stupid commercial with Gary B. And thought, what kind of idiot would buy suck a thing. This idiot did, and I effing love it. The remote that comes with it is pretty slick, but not as slick as the touch smart free phone app remote, of which kicks mucho ass-ee-blay. I want to punt this little bastard out the window of a moving vehicle just so I can buy a mother one to relive the awesomeness of unboxing and setting up.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Nunez"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "William Rodriguez \"likes toys\""}, {"rating": 5.0, "review": "We've only been using this for about 3 weeks now, but can tell a huge difference with download speeds.  Netflix hasn't rebuffered the entire time we've used it.  We were using our blu-ray player for netflix for 4 years now and it rebuffers even though we have 15mb per second internet; it was worse during storms.  It's also nice that we can move it to the living room or bed room anytime we want without major setting up.", "verified": true, "helpfulness": "0/0", "author": "Kevin Price \"half price\""}, {"rating": 5.0, "review": "my son uses this away at school on his NON smart tv. he really likes it.", "verified": true, "helpfulness": "0/0", "author": "mark a turik"}, {"rating": 5.0, "review": "Rellly enjoy have music, movies and TV ,photos all one place at a decent price.", "verified": true, "helpfulness": "0/0", "author": "Greg Copeland"}, {"rating": 5.0, "review": "I love it! I am a night owl and now I can choose to watch what I want without all the stupid commrcials!", "verified": true, "helpfulness": "0/0", "author": "Jeanne Leary"}, {"rating": 5.0, "review": "This really helps you make the most of Amazon Prime.  I've found most of the series I'd missed andthere's always a good movie to check out.", "verified": true, "helpfulness": "0/0", "author": "Memphisbelle"}, {"rating": 5.0, "review": "Awesomr", "verified": true, "helpfulness": "0/0", "author": "Karyl white"}, {"rating": 5.0, "review": "love my fire stick.", "verified": true, "helpfulness": "0/0", "author": "diane miller"}]