[{"rating": 1.0, "review": "We have gigabit fiber Internet and capable routers, yet we still have to buffer through half the episode? It's very slow and lots of glitches like randomly quitting out of apps", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 4.0, "review": "unfortunately it does not support PBS", "verified": true, "helpfulness": "0/0", "author": "jeannine mayer"}, {"rating": 5.0, "review": "It's easy to use and gives us many more options than cable.", "verified": true, "helpfulness": "0/0", "author": "KJ \"Kathryn Johal\""}, {"rating": 5.0, "review": "Fire stick over the chromecast all day!! Gotta have the remote!", "verified": true, "helpfulness": "0/0", "author": "Jay \"Mr.J\""}, {"rating": 5.0, "review": "Worked well, no issues", "verified": true, "helpfulness": "0/0", "author": "Matt Wallis"}, {"rating": 5.0, "review": "its Awesome", "verified": true, "helpfulness": "0/0", "author": "Lauren McKown"}, {"rating": 5.0, "review": "Love!! Don't know how we ever lived without it. Whole family is enjoying immensely.", "verified": true, "helpfulness": "0/0", "author": "Katie S."}, {"rating": 1.0, "review": "I purchased this about nine months ago from Best Buy and was absolutely delighted with it initially.  But suddenly it stopped working.  There is nothing wrong with my NetFlix account; it works perfectly on this computer as well as on our Smart TV.I can get to NetFlix, it shows a menu of shows but when I select a show I get the same message \"we are currently experiencing problems with this program.  Try back later.\"That is the message that comes up with every show I try.  I performed a test which showed all the NetFlix servers to be working as well as the network connection being at full strength.I have unplugged everything to try to see if it would reboot but nothing changed.  This was two days ago and I am still not able to access NetFlix through this Fire Stick which is really too bad.", "verified": true, "helpfulness": "0/0", "author": "Midnight Dancer"}, {"rating": 3.0, "review": "When the Fire Stick works, it is great.  However, I have it connected to the tv in my bedroom, which is maybe 40-50 from our internet router.  Whenever I try to use the Fire Stick it is constantly buffering--even though it says my wifi strength is \"very good.\"  Also, I can easily watch netflix, or stream music in my room via my laptop, so I am not entirely sure where the disconnection is happening, but it is extremely frustrating.", "verified": true, "helpfulness": "0/0", "author": "Caitlin McNulty"}, {"rating": 5.0, "review": "Arrived on time and worked as stated.", "verified": true, "helpfulness": "0/1", "author": "William Wallace"}]