[{"rating": 2.0, "review": "It's a great idea, and when it works it's awesome, but it constantly drops the wireless signal, even though my router is right on the other side of the living room (and I have the upgraded comcast internet speed.) I'm going to buy the $99 plug-in model instead, to see if that doesn't get rid of the constant buffering and dropped signals.If not for the constant wireless issues, I'd give it 4 stars. Prime content needs to be a little better. It seems like 60% of their Prime content is infomerical and B-movie garbage. Not bad enough for 3 stars, but not good enough for 5, certainly.", "verified": true, "helpfulness": "0/0", "author": "David Monteith"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "happienlife"}, {"rating": 5.0, "review": "I am very very pleased with this. It supports everything that I watch streaming and already pre setup for my Amazon account! I only wish it were HARDER for little hands to purchase content. When easy is too easy. I wish it came with the better remote, oh well. I don't play games so I cant comment on how well it performs in that aspect.", "verified": true, "helpfulness": "0/0", "author": "RomanST"}, {"rating": 5.0, "review": "Great addition to media library. Easy to use,great for viewing pictures and playing games.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Missed Justified, but seasons 1 - 5 on Amazon Prime Video", "verified": true, "helpfulness": "0/0", "author": "Val Richardson"}, {"rating": 3.0, "review": "Very misleading on some of the program's you can get, even if you subscribe .", "verified": true, "helpfulness": "0/0", "author": "mike lewis"}, {"rating": 5.0, "review": "Very eas y to install.  We were watching movies in minutes.  It gave us access to much more than I expected. Well worth it!", "verified": true, "helpfulness": "0/0", "author": "John Pereira"}, {"rating": 4.0, "review": "Is easy to use. Works great.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Kid friendly!", "verified": true, "helpfulness": "0/0", "author": "Rhonda Whye"}, {"rating": 5.0, "review": "1 week ago we cancelled cable.  I had a Chromecast but we also have Amazon Prime so we figured we needed another device to stream from.  We purchased this product for our living room and LOVE it!!! It's Even easier than the Chromecast because u don't even need your phone to stream to the TV thanks to the simple remote it comes with!! We have Hulu Plus, Netflix and Prime and with this product it makes it so simple to navigate between apps and the picture quality is clear.  Really happy yet again with another Amazon product!!!  Set up was extremely easy!!! I was plugged in, up and running with all accounts linked in under 10 minutes!!!  Who needs cable when you have a FireStick?  Not us!!", "verified": true, "helpfulness": "1/1", "author": "Bighen"}]