[{"rating": 1.0, "review": "If you're getting this for use with Plex save your time and money. Months later the Fire TV stick still has countless issues with Plex, from not being able to play back certain audio types to completely freezing and crashing. I've switched to Roku and haven't looked back since.", "verified": true, "helpfulness": "0/0", "author": "Christopher Wiseman"}, {"rating": 5.0, "review": "Works like a charm, never crashes,love the remote, easy set up, low price, I love this TV Stick!  The menu screen could be a bit more user friendly, but it works okay, so I give this 5 gold stars!!!!!!!!!!", "verified": true, "helpfulness": "1/1", "author": "CharGar"}, {"rating": 1.0, "review": "The review is for Amazon tech support.  I received my fire stick timely, but the Netflix application was not working correctly. The on screen keyboard to log in was not displaying correctly. After 2 chats and an hour phone call I was told I would be getting a new Fire Stick the next day.  I am disabled and I had to take the old one to a UPS location which was not convenient but I am a good sport.  The next day I got my new stick and it did the same thing.  I figured my own way around the issue after a half hour of deciphering the cryptic on screen keyboard. The technician I spoke with on the phone told me he would be escalating my issue to the development team.  So I emailed support asking if they had found anything yet. I got canned response after canned response from outsourced level 1 helpdesk people who didn't even take the time to read my email .  I tried repeatedly, replying to the email from the technician I spoke with on the phone but got a response from a different person each time.  And it was evident these people did not have a clear command of the English language.  This is the first time I have written a review of something I have purchased here.  I have been buying since 1998 with no problems, and my Kindle and Echo perform well.  But this time they dropped the ball.  I would recommend getting the Roku stick, as I have one for another TV and it performed well without any issues at all.", "verified": true, "helpfulness": "4/4", "author": "ChAd McCoy"}, {"rating": 1.0, "review": "These item freezes to much and then I couid not get a refund for this item the Amazon Fire Tv is better.", "verified": true, "helpfulness": "0/0", "author": "Richard Daniel Perez"}, {"rating": 5.0, "review": "Amazing !! works great and love the features !!", "verified": true, "helpfulness": "0/0", "author": "Thomas Doss"}, {"rating": 5.0, "review": "Love it! I have ordered two of these now. It has taken me sometime to get on the whole streaming tv bandwagon. I finally removed cable from my house and just use Amazon Prime TV. I plan on ordering a couple more for my children's rooms.", "verified": true, "helpfulness": "0/0", "author": "jennifermichael3"}, {"rating": 5.0, "review": "Love my Amazon Fire TV Stick! We don't rely on it too much, as we have smart TVs, but we are using it with an old flatscreen that we put in our daughter's playroom.  We stream music and the occasional TV show to keep her entertained while she is playing.  It has been the only way that I can sneak away for 10-15 min to get something productive done around the house!  We are considering getting rid of the cable box in that room, as the Fire TV Stick is being used almost ALL of the time! We have been Prime members for years, and I just don't know what took us so long to try this out!", "verified": true, "helpfulness": "2/2", "author": "Derik Navarro"}, {"rating": 5.0, "review": "Great! Love it!", "verified": true, "helpfulness": "0/0", "author": "Starla Griffith"}, {"rating": 5.0, "review": "I purchased the Fire TV Stick as soon as it was available for purchase for Prime members. I've had it for a few months and i just love it. Runs faster than a Roku 1 and it is easier to use. I just purchase my second Fire TV Stick yesterday on Prime day and i would recommend it to any one looking for a low cost streaming device. I believe that at that price there is no better device out there.", "verified": true, "helpfulness": "0/0", "author": "Daniel Gandia"}, {"rating": 5.0, "review": "This is by far everything I wanted and more. This is a great alternative to having cable or satellite tv. The only time my TV stick messes up is when my wifi is acting crazy. I've had my TV stick for almost two weeks now and I am very happy I made the purchase.", "verified": true, "helpfulness": "0/0", "author": "NOLA_CHCK"}]