[{"rating": 1.0, "review": "Upon receiving the unit, it requited an update that stopped half way through and made the unit freeze up.  From there I had to unplug the power, plug it back in and start the update over again.  However, once the update was done, the unit continued to freeze up through out the first week of using it.  Random apps do not work properly or freeze up, then the system just locks requiring you to reboot the unit by unplugging it and plugging it back in.  What a complete crap shoot of a product.  BTW, my Fire Stick was literally 1 foot away from my WiFi router that has 100/50 up down load speeds, so there is no excuse for Netflix, Amazon prime and more apps to have to buffer randomly through out the movies or shows.  Dont even try to use live tv like ESPN or Disney, thats a waste of time as well.", "verified": true, "helpfulness": "2/4", "author": "kim"}, {"rating": 5.0, "review": "I just received this a few days ago, so I don't have too much experience with it yet. However, it was very easy to set up and get running in just a few minutes. The remote is pretty intuitive as far as function, it's kind of small so I've already stuck some Velcro on it so I can keep track of it. The interface is pretty easy to follow, easy enough to set up your Netflix and Hulu accounts. It comes pre-registered to your Amazon Prime account if you've got one. That brings up my only concern so far, and it's more with Prime than this Fire Stick. There are an awful lot of the movies that not only require my membership but also a separate purchase of the movie or show. I kind of get that for brand new stuff, but not as much as I've found. That's just a bit disappointing.", "verified": true, "helpfulness": "0/0", "author": "Janine Hansen"}, {"rating": 5.0, "review": "Made my media use much easier. Plug in installation; now I have multiple choices, price was right as a Prime member.", "verified": true, "helpfulness": "0/0", "author": "Buck"}, {"rating": 5.0, "review": "I needed to plug it in, let the software download fail, unplug for at least 30 minutes (multiple short disconnects didn't help), and then register. I have a Chromecast also. I think I am going to like this one more.", "verified": true, "helpfulness": "0/0", "author": "Reston, VA"}, {"rating": 5.0, "review": "Easy to navigate and add applications.  Very pleased with the device.  Like the ability to add photos and videos from other mobile devices to the Amazon cloud and then view them from the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Gregory Jackson"}, {"rating": 1.0, "review": "Slow and not enough  apps...save your money and buy a roku", "verified": true, "helpfulness": "0/2", "author": "Bob"}, {"rating": 1.0, "review": "The remote included with the stick did not function properly. It was either non-functional or would cycle through the menus at lightning speed. I replaced the batteries just in case but still having the same issues. I suspect a button may be stuck. I contacted Amazon support and they agreed to send a replacement however, I would not be able to receive it until mid January when they are expected to be back in stock. I will update my review then if anything changes.", "verified": true, "helpfulness": "3/3", "author": "James R. Stauble Jr."}, {"rating": 5.0, "review": "its quick its fast but all the app which work on Kindle i.e sho and starz don't work yet for all provider but for amazon content its best though few of my friends are complaining about netflix and youtube has issue but that's it its a solid item", "verified": true, "helpfulness": "0/0", "author": "Raghav Swami"}, {"rating": 4.0, "review": "it worked quiet well. However, I was hoping to Stick would allow me to download the Viewster App, if it does I haven't found it. Over all the Fire TV Stick was worth my purchase. I purchased two, I intend to give one to a fried as a Christmas present.", "verified": true, "helpfulness": "0/0", "author": "jlggfn"}, {"rating": 4.0, "review": "Easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "Donald L Alexander"}]