[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jena Davis"}, {"rating": 3.0, "review": "But i only gave it 3 stars because of not being able to stream premium cable due to Fire TV not being support by Charter. Aside from that its pretty cool and Netflix works great.", "verified": true, "helpfulness": "0/0", "author": "Dache B."}, {"rating": 5.0, "review": "I love the Amazon Fire TV Stick! Not being a techie, I was afraid I'd have to find a 7 year old to help me install this, but it was so easy to do that it wasn't necessary! Instructions were simple and installation was simple as well. It's very easy to figure out the remote and I'm enjoying the movies and shows that I've been streaming.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Neifeld"}, {"rating": 3.0, "review": "It loses internet connection, requiring a restart of the device often. This is frustrating. No other device in my house loses internet connection.Otherwise, the programming that it offers is good for my wife and I. Could the available prime movies be better? Yes, certainly. But we like the PBS stuff a lot.", "verified": true, "helpfulness": "0/0", "author": "GhostTown"}, {"rating": 3.0, "review": "Im a cord cutter since 2009, I have two of these, decent range, video quality on prime video is very good, Sometimes there is lagging on Netflix and YouTube, using my other devices to browse and then cast the show to my TV does not work, its available in netflix, youtube but never works, the fire tv hulu interface doesnt have this feature. you can still watch them but you have to browse on the more cumbersome TV menu using the remote. (the whole interface with other devices, using phones or tablets as remotes could be greatly improved with a simple update, hopefully the good people at amazon will get around to it soon)Good quality device at a good price, not as easy to use as chromecast, the reasons id recommend over chromecast is that it does have a better wifi range and most importantly it works with PRIME VIDEO.", "verified": true, "helpfulness": "0/0", "author": "Jose E. Gonzalez"}, {"rating": 5.0, "review": "Had this for about 2 weeks and I love it for all the reason it was said to do and it does it well..would recommend to everybody", "verified": true, "helpfulness": "0/0", "author": "saverio rimi"}, {"rating": 5.0, "review": "Plugged it in, works great.  What more is there to say.  Actually bought a second one!", "verified": true, "helpfulness": "0/0", "author": "SRK \"Happy in Cal\""}, {"rating": 5.0, "review": "Wanted Netflix and YouTube on my TV which does not have options like smart TVs have now a days. Worked well !", "verified": true, "helpfulness": "0/0", "author": "Sourabh K."}, {"rating": 4.0, "review": "The Amazon Fire TV Stick was given to me as a gift. It is easy to install and operate but occasionally it loses connection and service is interrupted for a short period.", "verified": true, "helpfulness": "0/0", "author": "John E."}, {"rating": 1.0, "review": "Definitely not up to my expectations bad connection hard to follow", "verified": true, "helpfulness": "0/0", "author": "Sara"}]