[{"rating": 5.0, "review": "Good deal", "verified": true, "helpfulness": "0/0", "author": "Dante"}, {"rating": 5.0, "review": "Works as advertised. Kodi runs great. great wireless connection. easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE MY AMAZON FIRESTICK!", "verified": true, "helpfulness": "0/0", "author": "G. Allen \"dragonfly\""}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Dawn Horrighs \"mamad\""}, {"rating": 2.0, "review": "An update on my Amazon Firestick. I was happy with it in the beginning, set up with no problem, connected to my internet instantly.Now I am constantly getting the message \"Home is Currently Unavailable\"  Go to network settings. When I check my network it shows signal strength \"Very Good\" and that I'm connected. So why am I losing the shows I'm watching, what does it mean that Home is unavailable? I have unplugged the Firestick, I am using the adapter, this is getting very frustrating.", "verified": true, "helpfulness": "0/0", "author": "infoplease"}, {"rating": 5.0, "review": "So easy to use---it works perfectly for my daughter", "verified": true, "helpfulness": "0/0", "author": "donald  autin"}, {"rating": 5.0, "review": "Love love love it! Had Roku stick before and only worked on occasion (older versions are good though)Super simple set up and works all the time.", "verified": true, "helpfulness": "0/0", "author": "Zmama"}, {"rating": 4.0, "review": "Pretty happy with what the device offers. Not a fan of the interface at all.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Amazon Fire TV Stick is very good if you are in USA,I sent this as a gift for my family but they live in Central America, and they can't use all the potencial of this device, because the location.", "verified": true, "helpfulness": "0/1", "author": "Angelica Vega (Mishi Courier)"}, {"rating": 2.0, "review": "We had high hopes for the Fire Stick but found the interface is very confusing to a point my wife stopped using it. Other than the confusing interface we found this does not like to play nice with Netflix and would constantly fail to load or keep pausing. After two months I gave up and went back to the Apple TV.", "verified": true, "helpfulness": "0/1", "author": "David Woods"}]