[{"rating": 2.0, "review": "I only purchased it because of the Amazon instant video", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "khalid osmani"}, {"rating": 5.0, "review": "Great device for what I use it for !!!", "verified": true, "helpfulness": "0/0", "author": "Melvin"}, {"rating": 5.0, "review": "My only regret is that I should have ordered 2 when I had the chance at the sale price.Fast setup, Prime videos plays quick and smoothly!  Better then my PS3.Too bad no ios support or streaming. But that's what the Apple TV is for!", "verified": true, "helpfulness": "0/0", "author": "J.M. Torres"}, {"rating": 4.0, "review": "Ive had to reboot the device sevaral times because it freezes.", "verified": true, "helpfulness": "0/0", "author": "Wellington Camejo"}, {"rating": 5.0, "review": "Best steaming stick available. Tried them all. This has TONS of potential, if amazon can continue to deliver on the apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Amazing speed and very easy to use. Extremely fast when compared to Chromecast. With Amazon Prime videos subscription, its the best thing to have. Must buy for all movie/TV buffs.The only thing I miss is the fact that they could have provided voice supported remote with the device. Buying that separately makes the existing one redundant..!!", "verified": true, "helpfulness": "0/0", "author": "Sudarshan"}, {"rating": 5.0, "review": "Great productLoads content very quickly", "verified": true, "helpfulness": "0/0", "author": "LAZARO FRANCISCO OLAYON"}, {"rating": 5.0, "review": "So far, so good with Fire TV sticks throughout the house.  The only issue has been that they need an \"update\" out of the box before they work, and you need to be very close for the router for some reason for it to work.  Once updated, everything works great.  I own a couple Roku's and WD TV Live devices, and this certainly seems to be the best all around device as it offers all of the common apps that are lacking with other devices.  We use Netflix, Amazon Instant Video, and Hulu, and everything loads extremely fast and looks great.  I was able to get 2 of these for $20 each with the Prime member offer, but it is certainly worth the $40 price if you have a TV with an HDMI port and decent wifi.  Be aware that these sticks do require an external power supply which is included in the box.  The remote is simple and easy to use, and young kids have no trouble navigating with it.  I'd recommend this to anyone looking for an alternative to expensive cable or satellite packages!", "verified": true, "helpfulness": "0/0", "author": "Chris W."}, {"rating": 5.0, "review": "Awesome entertainment for kids and adults, amazing charity, easy to install and operate, the entire family enjoy it so much", "verified": false, "helpfulness": "0/0", "author": "Marina"}]