[{"rating": 4.0, "review": "i love it!!", "verified": true, "helpfulness": "0/0", "author": "lashing tunstall"}, {"rating": 4.0, "review": "Love it - works great.  Now you can NEVER say you can't find anything to watch on TV! Especially if you have Netflix and HULU apps with the Fire TV :)", "verified": true, "helpfulness": "0/0", "author": "Belinda McNeely"}, {"rating": 5.0, "review": "Very nice! I love it.", "verified": true, "helpfulness": "0/0", "author": "Younggi Song"}, {"rating": 4.0, "review": "I first got the Roku and liked that.  There was loads of selection and easy layout.  However, after awhile it started doing wierd things like non-stop scrolling and taking over other devices in the home.  It was as if it was possessed and my housemates weren't pleased.  The only way I could get it to stop was to unplug the stick AND take the batteries out of the remote.  So instead of paying for an exorcist, I put it in the preverbial cage and bought a FireStick instead.  It arrived fast to save the day from possessed Roku.  Taking a cue from the reviews, I attached the HDMI extender which I'll call it's super hero cape because, the Amazon Fire Stick is working wonders!Thus far I am very pleased with its performance.  Here are some things I like.* It somehow makes the picture and sound better.* It organizes my Prime content well.* I can play one of my favorite games on it.* I can play Amazon music on it and it almost sounds better than a stereo.And most important,* It doesn't mess with my housemate's devices and slow other stuff down.Some things that could be improved:- Occasionally it lags and buffers movies.  Not much, but it's annoying when it does.- I'd like to see the ability to add more channels (including private) EASILY.- I'd like to eventually see a movement-based game controller like Wii has.  Using the remote can be awkward and too slow.When these things are taken care of, I'll give it a full five stars.There is one more thing I would like to comment on.  Firestick is geared around Amazon products and Prime.  That's fine.  I'm using and enjoying many things that Prime has to offer.  I appreciate the fast and free Prime delivery service.  I also like the music playlists that can be played on my phone and the TV.As far as Amazon Prime movies are concerned, however, I'd like to see better content.  Most of the movies are old or of terrible quality.  As we are paying a monthly payment that works out to more than what Hulu and Netflix charge, I'd like to see at least comparable quality with good CURRENT movies INCLUDED in Prime (NOT extra) that one can get on those pay channels or on cable on Demand.  Please step up the movie quality on Prime.  Then the Amazon Firestick with quality Prime content will totally Rock.* It doesn't mess", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Even better than I expected!", "verified": true, "helpfulness": "0/0", "author": "MarkC-NJ"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "phong xiong"}, {"rating": 5.0, "review": "Great item. Better than streaming through Blu-ray.", "verified": true, "helpfulness": "0/0", "author": "Lmartens"}, {"rating": 5.0, "review": "Awesome Product - works as promised & even better.", "verified": true, "helpfulness": "0/0", "author": "Bob Davies"}, {"rating": 5.0, "review": "Easy to use and customize, a great product.", "verified": true, "helpfulness": "0/0", "author": "Clarence Clarke"}, {"rating": 5.0, "review": "Very fast for the price", "verified": true, "helpfulness": "0/0", "author": "primetime"}]