[{"rating": 1.0, "review": "We would have loved to love this thing but just too many connection issues for us.  We're Comcast users with download speeds at just under 120 mbps.  We went through over an hour of tech support doing resets, app testing etc but the fix was only temporary and withing 48 hours the Stick could not maintain any usable connection.  All the support people were great as well as the customer service agent who immediately processed out return.  Fix this thing Amazon...We really want it to work!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is great!  I got it for my wife to use in the bedroom as a Christmas gift.  I have it installed and it's so small and unobtrusive that she hasn't even noticed.  I wrapped the remote but I have been using it with the Android app on my smart phone (which works really well)  It is easy to use and I know she will love it!", "verified": true, "helpfulness": "0/0", "author": "Ronald L. Parks"}, {"rating": 5.0, "review": "fantastic.  Much better than a chromecast because of the remote.", "verified": true, "helpfulness": "0/0", "author": "Kevin Hollingsworth"}, {"rating": 1.0, "review": "Very disappointing, I love Amazon but this product should of been in beta longer.  Delivery was quicker than expected and at $19 it was hard to pass up.  Setup was super easy and relatively quick (some updates are downloaded initially ).  What drives me crazy is the latency between the remote and Unit.  Since it at times so slow, it feels like its not responding at all, so naturally you press the button again.  Well eventually ( in 10-30 seconds) the unit catches up and follows those commands except that now you have managed to click 2 or 3 times and now You have to go back and wait again.  On two instances I found myself waiting in excess of 5min for the system to respond and I finally unplugged it to cut the power to it and reconnected it just to get it working again.  Amazon streaming works great but the search results aren't always accurate.  I searched for \"jake and The never land pirates\" and two results popped up, one was 100% match while the other added the word \"free\" at the end.  Naturally I clicked on that however all the choices there were season 1-3 and were all pay per view choices, very misleading especially if parental controls are not enabled to block such a purchase even though the search clearly indicated it was free.  But that wasn't the big issue as we also subsribe to Netflix and they offer that title free.  So I press back, goto Netflix, choose launch app, and after a few seconds (a little slower than on my iOS devices) I get into Netflix.  I choose The show, it starts to buffer and the goes into a blue and white screen of death.  If I didn't know any better I thought they stole that right out of a Microsoft play book.  But this screen of death is not as bad as the music is playing and the image on the screen reads \"hdcp unauthorized content disabled\". I googled it and it's a known issue on roku devices but there isn't much in the way of information on Amazon tv stick.  Will update the review when it's less frustrating to use.", "verified": true, "helpfulness": "2/3", "author": "Rebel"}, {"rating": 5.0, "review": "Replaced my Roku with this. Much more convenient with my Amazon Prime account.", "verified": false, "helpfulness": "1/1", "author": "Anthony Jefferson"}, {"rating": 5.0, "review": "I can't believe how much I enjoy this device. It was worth every penny of the $19 promotional price. (And now that I have it it would have been worth every penny of the regular $39 price) ESPECIALLY if you are an Amazon Prime subscriber.With Prime you get access to a ton of free movies. If you are a regular movie watcher, that will pay for itself pretty quick. There are a good number of free TV shows available as well, but not nearly to the extent that moves are available.As for the operation of the device it's VERY smooth and responsive. There is no lad when clicking buttons. The on screen menu keeps up with your clicks on the remote as fast as you can press the button. (Some similar devices have a small lag) And when you select a video it plays very quickly. No waiting for the content to buffer. Of course that's with mine being very close to my wifi router so it's optimized for a good connection.I found I didn't need the wall plug as was strongly recommended. (Comes with the FireStick) Plugging the device into the USB port on my TV gave it all the power it needs to run well. Note: the device plugs into the HDMI port. A USB connection is required to give it power to run.The remote is very small and simple. It easily hides in a drawer when not in use. Or you can also set up the device to run off your TV remote (or a Universal Remote like the Logitech Harmony series) if your TV is CEC capable. That means the device can be controlled through the HDMI connection using your TV's inferred sensor. I was pleasantly surprised to find that feature worked right away right out of the box.One important note....it comes pre loaded with your Amazon.com account info on it. So if you are giving it as a gift, open it and delete your account info first.", "verified": true, "helpfulness": "2/2", "author": "Skipjacks"}, {"rating": 1.0, "review": "I've had the Fire TV Stick for five days now, and for five days I have tried, and failed, at watching anything all the way through. I'm lucky to get one solid minute of watching in between buffering. The device is plugged into a TV that's no more that forty feet from the router. My computer, phone, and tablet all work perfectly in the same room for streaming TV.What a disappointment this device is. It's not even worth the $19 I paid. I'm hoping mine is defective and can be replaced.", "verified": true, "helpfulness": "1/2", "author": "Susan C. Lyell"}, {"rating": 5.0, "review": "I do not understand why this has so many one stars.  I got mine in today way before amazon promised.  I connected it to the Hdmi outlet into my  tv and the screen popped right up.  Easy to install easy to follow ON SCREEN DIRECTIONS. Short program that told you about the fire sick and what it offers.  Bonus BIG bonus.  My husband and I both downloaded the Fire Stick TV remote app through the Google plus store So since I wanted to try the voice remote I now can have that option through the phone app .  I love that it's portable and yes I tried it granted it was in the same house but just to a different TV.  This will be added to future out of town trips.  BEST BUY EVER!!!!", "verified": true, "helpfulness": "138/148", "author": "Stephanie Lopez"}, {"rating": 5.0, "review": "Exelent! we love it", "verified": true, "helpfulness": "1/2", "author": "Marina E. Carvalho"}, {"rating": 5.0, "review": "Lost of fun. Works great. Super fast", "verified": true, "helpfulness": "1/2", "author": "IGNACIO KLEIMAN"}]