[{"rating": 5.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "Lee Martinez"}, {"rating": 5.0, "review": "Yes, love it", "verified": true, "helpfulness": "0/0", "author": "mary wanda perry"}, {"rating": 5.0, "review": "Very easy to install.  Took less than 5 minutes. The speed is very fast. I love the cell phone app with the voice search. Makes finding a movie faster and easier than typing the name.  Don't delay ... and purchase it!", "verified": true, "helpfulness": "0/0", "author": "TW"}, {"rating": 1.0, "review": "Tv stick the fire must have been pre-registered when send it to me as happened to other customers who acquired and are outside the United States and it is not .... I lost my money AMAZON neglect.", "verified": true, "helpfulness": "0/0", "author": "Reniel Cabrera"}, {"rating": 5.0, "review": "I'm a fan. So much so we are dropping Direct TV when our contract expires and using Amazon exclusively.", "verified": true, "helpfulness": "0/0", "author": "Bonita S."}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "kathy06"}, {"rating": 5.0, "review": "I love this little device.  Easy install, and the app to use your phone as a remote is great.  I am one of those that refuses to purchase cable TV, so the fact I can use this for Netflix and Amazon Prime without having to connect my laptop to my TV's is awesome, and all the additional apps available are great.  Well worth the price for me.", "verified": true, "helpfulness": "0/0", "author": "Yvonne W."}, {"rating": 5.0, "review": "love the firestick. I am watching all new shows that I never got to see on regular cable. worth the &40.00 investment.", "verified": true, "helpfulness": "0/0", "author": "fini"}, {"rating": 3.0, "review": "I was so excited to get this because I only have a Roku upstairs and not for downstairs. This Fire Stick was an easy concept that doesn't take up any space. I was all ready to dive into a movie binge but the quality was shockingly terrible. The movie will stop and try and load frequently, interrupting your movie. It is so frustrating! Also, not all of the movies are in HD and when the movie freezes because it has to continue to load, it comes out of focus. I wish this was as good as my Roku but unless anyone has a suggestion to prevent this issue, I give it a thumbs down.", "verified": true, "helpfulness": "0/0", "author": "Alyssa"}, {"rating": 1.0, "review": "This things stinks! It doesn't come with pre loaded apps, you need to download netflixs and it must be within eye shot of the router or it wouldn't work. Complete disappointment.", "verified": true, "helpfulness": "0/0", "author": "Rodney Hines"}]