[{"rating": 1.0, "review": "I find this hard to work", "verified": true, "helpfulness": "0/0", "author": "Lorna"}, {"rating": 5.0, "review": "I really like it, its easy to use. But sometimes I will be watching a show and it just stops and takes me back to the home page, that may not be the stick, it could be the app.", "verified": true, "helpfulness": "0/0", "author": "Kristin L"}, {"rating": 2.0, "review": "It was easy to setup, just plugin and answer a few questions. Streaming video or music it was very poor. My connection speed download is 30mb/s and the fire tv stick had all the bars and described the connection as Very Good. My Kindle FiireHDX plays thru it using the mirror mode without a flaw.  But just using the stick, it's buffer and more buffer every 2 or 3 minutes.", "verified": true, "helpfulness": "0/0", "author": "Richard HOpe"}, {"rating": 4.0, "review": "The device is working fine and overall I am happy with it.I took one star down because right after receiving the Fire TV Stick, it has been advertised for sale at $34, while few days before I did buy paying $39.Isn't there is a kind of \"price guarantee\" formula or something like that?From the usual Amazon high quality standard I would have expected more care to the customers that like myself buy staff few days before that those items go on sale.", "verified": true, "helpfulness": "0/0", "author": "gibaga"}, {"rating": 1.0, "review": "Expect more from this device. I think this device would be better if there were more popular shows or movies available with prime membership. Definitely can understand new movies not being free, but older popular movies and shows should be free.", "verified": true, "helpfulness": "0/0", "author": "Pete Rampersad"}, {"rating": 5.0, "review": "I have satellite television on two of the TVs in my house but wanted something for the TV in the rec room, which only has an outdoor antenna connected. The only Internet TV service that I have at this time is Amazon Prime, but so far that has proven to be more than adequate. It takes a bit of maneuvering and navigating through various menus to find the programs that you want to watch but once you have found them they pop up on the top \"recently watched\" line which makes it easier to allow you to continue watching programs in the same TV series. I was wondering how easy it would be to search for specific titles given the limited number of buttons on the remote control. But it has really turned out to not be that difficult since the fire stick pops up a list of possible titles as you navigate through the on-screen keyboard with the up/down, side-to-side arrows and usually you don't have to type more than 3 or 4 letters until the program you are looking for comes up on the list. The fire stick combined with Amazon Prime has turned out to be a good investment. Everything I have managed to find to watch is included with Amazon Prime so I have not had to pay additional fees for other services or pay per view. By adding Hulu, Sling or other streaming services you could greatly expand your choices even further.", "verified": true, "helpfulness": "0/0", "author": "Famous Dave \"dog daddy\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Angie Mccullough"}, {"rating": 5.0, "review": "I love the stick, has done all it said it could do.", "verified": true, "helpfulness": "0/0", "author": "Jeff Carlton"}, {"rating": 1.0, "review": "Don't waste your money, by the fire tv. it works great.", "verified": true, "helpfulness": "0/0", "author": "Donald N Russell"}, {"rating": 5.0, "review": "This tiny little thing packs a punch!Here's what I like:1. Remote is not IR. Works great even without a line-of-sight. This is perfect for when the stick is behind the TV or (as I experienced) when the stick is lying under the seat in the car - the remote still controls all of it.2. The device syncs video state with other devices (Kindle, etc.) but also maintains its own recommendation list (while still being influenced as part of the account)... :)3. Clear and crisp video and audio output4. Good Wi-Fi reception (I ran it off of a tethered WiFi from a cell phone on LTE)Here's what I would like improved:1. Not all apps (even from Amazon's market place) are supported. I would like Google+/Picassa pictures to be a source of pictures for display2. Allow local network sources for pictures, music and video", "verified": true, "helpfulness": "1/1", "author": "Sujit Vasudev"}]