[{"rating": 5.0, "review": "I'm very happy with this item. I'm a woman of \"age\" and not all that great with electronics and I was able to connect and get this working easily. I still have challenges with the remote and the app for the remote but in sure more use will help that.", "verified": true, "helpfulness": "0/0", "author": "Barbara Jenness"}, {"rating": 5.0, "review": "easy to set=up and use!", "verified": true, "helpfulness": "0/0", "author": "craigfnfa"}, {"rating": 5.0, "review": "Very Happy Customers. Great Variety of Movies.", "verified": true, "helpfulness": "0/0", "author": "Charles B Flannery"}, {"rating": 4.0, "review": "Love my firetick. Would have given it a 5 if I could switch it to SD to save my data.", "verified": true, "helpfulness": "0/0", "author": "Donna Smith"}, {"rating": 1.0, "review": "No as described", "verified": true, "helpfulness": "0/1", "author": "Mehreen Khan \"Mehreen Khan\""}, {"rating": 2.0, "review": "For me the fire stick is not the end all product I'd hoped for. Took me two days to figure out how to get access to Wifi and connected the selection of movies and shows offered wasn't any different than what I get through my cable provider and once I finish signing up for the different services I will wind up paying almost the same amount as my cable services.  So for those who are enjoying the product, great for you.  I would recommend person considering it weigh it out for themselves to establish whether or not this is the product for them.  The concept is great, but just not for me, will be returning item.", "verified": true, "helpfulness": "0/1", "author": "Linda Mansfield"}, {"rating": 5.0, "review": "Met in every way and ht e sideload capabilities was teriffic", "verified": true, "helpfulness": "0/0", "author": "Lee M Lannert \"Lee\""}, {"rating": 5.0, "review": "Best Thing Ever. I may get rid of my satellite dish now.", "verified": true, "helpfulness": "0/0", "author": "Ken White"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "William Beck"}, {"rating": 5.0, "review": "Love this device.  So nice to watch missed shows from television and movies in my time.  Received as a gift.", "verified": true, "helpfulness": "0/0", "author": "So.Calif.Grandma"}]