[{"rating": 5.0, "review": "Works great.  Easy setup.  Bought two of them and will replace my roku's with these on my other tv's when they die.  One small gripe.  I wish you could skip the introductory video on the first install.  Was repetitive when installing multiples.", "verified": true, "helpfulness": "0/0", "author": "Daniel A Paulovich"}, {"rating": 5.0, "review": "Works good.  Can download an app on your phone for voice commands/an extra remote.  Certainly makes watching Netflix easier than streaming thru our Blue Ray.  Watching Youtube on the big screen is good.  The kids like the download & play games too.  Was bummed it took 2+ weeks to receive.", "verified": true, "helpfulness": "0/0", "author": "NC"}, {"rating": 4.0, "review": "Its nice but wireless signal is a bit weak! Bought it as a gift for my parents and their bedroom was upstairs directly above the room with internet modem, and it would not connect at all. Luckily I already owned a Roku device which worked just fine, but I am still on the fence about it. Overall its beautifully designed, and as weird as it sounds I love the high definition screen savers!", "verified": true, "helpfulness": "0/0", "author": "Bookworm1984"}, {"rating": 1.0, "review": "Can't get it to work.  Customer support is terrible.", "verified": false, "helpfulness": "1/1", "author": "Alan Jensen"}, {"rating": 5.0, "review": "Love the firestick.  You can watch so many shows and I have love the music you can download. I have recommended it to everyone I talk to", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 5.0, "review": "AWESOME product!", "verified": true, "helpfulness": "0/0", "author": "PH"}, {"rating": 5.0, "review": "It's amazing and so easy to use. I love it!", "verified": true, "helpfulness": "0/0", "author": "Vicki M. Davis"}, {"rating": 4.0, "review": "I deal with a lot of tech, software, etc. I was given this for Christmas. I had somewhat of a skeptical view of it as we already had Netflix and other options and wasn't sure how it would fit in everything. I was surprised how easy it was to setup and use. I use it routinely now and I have found the navigation to be simple and the interface rather handy. The best part of course it is already tied to my Amazon Prime account and there was a surprising amount of free content as well as a good selection of content to rent or purchase.", "verified": true, "helpfulness": "0/0", "author": "Barry McDarby"}, {"rating": 5.0, "review": "i haven't had it very long, but when we used it it worked very well", "verified": true, "helpfulness": "0/0", "author": "Barry Blaine"}, {"rating": 1.0, "review": "What crappy wireless network in this thing. always gets disconnected from WiFi. I not going recommend to friends or family.", "verified": true, "helpfulness": "0/0", "author": "SA"}]