[{"rating": 5.0, "review": "quick delivery met all expectations", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "Best Price, Straight to your house", "verified": true, "helpfulness": "0/0", "author": "123 Stores"}, {"rating": 5.0, "review": "Just got my Fire Stick in the mail and i love it!!  Very easy to set up and was watching Netflix and Prime videos within minutes.  This is my first experience with streaming videos and i was worried that it would constantly be \"buffering\" but I didn't have any problems!Definitely recommend", "verified": true, "helpfulness": "0/0", "author": "Amanda W \"AW\""}, {"rating": 4.0, "review": "Love it so far. The remote is simple and easy to navigate. Will be using this mostly for Netflix. I don't think there is a YouTube app, but hopefully that'll change soon. Then it'll be really awesome!", "verified": true, "helpfulness": "0/0", "author": "J. Cain"}, {"rating": 1.0, "review": "Will not connect to my wifi.  I have tried two different Fire Sticks (I returned the first when I had trouble, and got a replacement).  Neither was able to connect to my wifi.I really wanted this to work.  So i spent a lot of time following the online troubleshooting steps, and working with phone and email tech support guidance.  Given that various other devices (both mine and those of houseguests) connect easily to my wifi, I conclude that a design flaw exists that prevents the Fire Stick from connecting with certain wifi networks.So, probably a great product if it works with your wifi; useless if it does not.", "verified": true, "helpfulness": "0/0", "author": "BinSeattle"}, {"rating": 5.0, "review": "I have roku 3 and the fire tv stick. Can not go wrong with either one but this is more than half the price.", "verified": true, "helpfulness": "0/0", "author": "Tammy Parmer"}, {"rating": 5.0, "review": "As described", "verified": true, "helpfulness": "0/0", "author": "Tracy Mills"}, {"rating": 5.0, "review": "Best purchase I have made in a long time! Very easy setup, I loved how it walked you through everything since I'm not very tech-savy. The fact that it bundles all of your accounts is even better. Great selection too!", "verified": true, "helpfulness": "0/0", "author": "Taylor"}, {"rating": 5.0, "review": "It works like I hope, the difficult thing was how to open the remote in order to insert the batteries,finally, going on Google, I saw by using a glasses mini screwdriver it was possible.i hope this will help with the remote control.Viviane", "verified": true, "helpfulness": "0/0", "author": "viviane  chriqui du levant"}, {"rating": 4.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "RKE"}]