[{"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Pamela Fleming"}, {"rating": 1.0, "review": "Absolute Garbage, I wish I could give it ZERO STARS!  Having owned several Roku boxes that have worked perfect for the past three years I assumed that Amazon would have made a decent product, I was wrong!  The USB Fire TV stick overheats as it is super HOT to the touch and the video is constantly freezing although the audio continues to play.  If I start TV show on HULU I only get to see the first two minutes and the screen either freezes or goes black but sound keeps playing so you are only able to hear the show and not watch it.  For the extra $60 I will buy another Roku box because the Amazon Fire TV Stick is a total piece of junk.", "verified": true, "helpfulness": "0/0", "author": "Janet L. Breda"}, {"rating": 5.0, "review": "Purchased this  in June after my older model Blu-ray was having problems streaming Netflix, Hula, etc.  The FIRE Stick works really well.  It's easy to set up and the picture quality is excellent.  Good buy!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "neato, amazon content anywhere!", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "I have a tv antenna which gives free but limited tv.  The stick gives us so much more.  We are happy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This was recommended to me by the associate of the store I bought it at - I went in with a problem with my Chromecast, just expecting to get a new Chromecast. This Fire Stick seemed to have some cool channel options and a cool remote interface. Well, the channels I thought would be cool had no actual feature worthy content and the regular apps I wanted to use, along with the non worthy channel's content, wouldn't even run! Infinite buffering - the Chromecast worked way better than this. Returned it, got a chromecast, voila it works.", "verified": true, "helpfulness": "0/0", "author": "Cameron laxton"}, {"rating": 1.0, "review": "It worked for a couple of days and then it stopped. It has connection issues, for real. Every device in my house works perfectly on wifi and this thing always says \"connected with problems\" no matter what I do. Its in range of the wifi. I even bought a $40 wifi extender to help with no luck. I think Amazon released this a little prematurely. It definitely needs an update.", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Has issues with WiFi sometimes. Other than that, great.", "verified": true, "helpfulness": "0/0", "author": "Z. Queal \"~Zach\""}, {"rating": 2.0, "review": "The product did not work until about a week later.  When you first plug it in it requires your Amazon login to do anything, you can't watch Netflix or have access to any of the apps until you pass this screen, but my login did not work.  So although I was using the right passwords it wasn't updated on amazons side.  I sent them an email, no response but it started working about a week later.", "verified": true, "helpfulness": "0/0", "author": "nathan"}]