[{"rating": 5.0, "review": "Awesome and a great value.  I'm now a former cable user.", "verified": true, "helpfulness": "0/0", "author": "DebraErsch"}, {"rating": 5.0, "review": "Performs better than expected. Very easy to setup. Was able to add multiple services with no problem. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "William C. Gibson"}, {"rating": 5.0, "review": "Legitness", "verified": true, "helpfulness": "0/0", "author": "Ricky"}, {"rating": 3.0, "review": "Disappointed. Before I purchased this Fire Stick, I chatted with Amazon to see if I would be able to mirror my MacBook Air to my tv and they said yes. After I received it, I found out that I can't use it that way. It only supports Fire phone and Tablets. Boooo Amazon. Luckily, I still have my Apple TV. Amazon, if your gonna compete, you need to step it up.", "verified": true, "helpfulness": "0/0", "author": "Enjoy Shopping!"}, {"rating": 5.0, "review": "I have apple - roku & hulu nothing compares to Amazon Fire Stick - easy to use very responsive to command.", "verified": true, "helpfulness": "0/0", "author": "RENNY ABRAMS"}, {"rating": 5.0, "review": "I would consider myself an electronically challenged person even tho' I hate to admit to it. Anyway, this firestick is so easy to install and use!! I love it and am so happy that I did purchase. I haven't even scratched the surface of the possibilities!! Amazon you are way cool!!", "verified": true, "helpfulness": "0/0", "author": "country granny \"country granny\""}, {"rating": 5.0, "review": "Very nice!! Easy to install and now I have TV MY WAY!!!!", "verified": true, "helpfulness": "0/0", "author": "Sara R. Cuenin"}, {"rating": 3.0, "review": "a lot of the movies we want to watch cost additional. Its always uploading when watching a show. Don't use it to much", "verified": true, "helpfulness": "0/0", "author": "Connie J. Atwood \"cja\""}, {"rating": 5.0, "review": "Amazing little USB style media device. It works very well for me. I really like the fact I can put movies into my Amazon watch list then view them on my TV with the Fire Stick. For the price you simple can not beat it IMO.", "verified": true, "helpfulness": "0/0", "author": "Bill in Vero \"BillC\""}, {"rating": 5.0, "review": "Very good programing, the best if you want to get out of paying high cable bills.", "verified": true, "helpfulness": "0/0", "author": "Annys"}]