[{"rating": 5.0, "review": "Love this device! Everything about it!", "verified": true, "helpfulness": "0/0", "author": "Krista"}, {"rating": 5.0, "review": "Very reasonable way to turn an older TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Thomas H. Whitt"}, {"rating": 4.0, "review": "Very good product except it is very difficult to open case to put in new battery.  That is why onlygave 4 stars", "verified": true, "helpfulness": "0/0", "author": "Barbara A., Mintz \"Babsie\""}, {"rating": 5.0, "review": "Love the fire stick. Very glad I got it.", "verified": true, "helpfulness": "0/0", "author": "kevin"}, {"rating": 4.0, "review": "Love it!  I did struggle a bit to find a FAQ section on Amazon as the Fire TV Stick was not finding my WiFi.  Once I found it - and my question was at the top of the FAQs - it was easy going.  I do not like that it has to be plugged in to get good performance, I was hoping for more flexible plug and play.  Also, I did struggle a bit with getting access to some apps as the log-in is my husbands email and not mine.  Not sure if this is a Fire TV issue or those apps - but there seemed to be a linkage since through my computer I could get access just fine.  Finally I would love to see Amazon get a better movie selection - especially for their prime users.  All in all great product.", "verified": true, "helpfulness": "0/0", "author": "Jenna S."}, {"rating": 5.0, "review": "Was definitely worth the wait. We got 2 of them. Easy to install and have worked very well. Amazon prime is a must with these. Lots of great movies and tv shows on demand.", "verified": true, "helpfulness": "0/0", "author": "gary"}, {"rating": 5.0, "review": "Great device worked great!", "verified": true, "helpfulness": "0/0", "author": "SamuelDuke"}, {"rating": 3.0, "review": "I wanted to love the Fire TV stick but continued to have issues. The price and concept are great but I always had trouble getting a solid internet connection. I intended to use this primarily for Netflix, Prime Instant Video and Pandora/Spotify. Watching Netflix was always the most difficult - audio and video never matched, I can't stand that! It would constantly go out in the middle of a show and I would have to wait for it to load again. It always got stuck at 25% and held there for a minute or so before fully loading. Then it would happen all over again in 5-10 minutes. I switched to watch Netflix on our Blu-Ray player and never had an issue so I know it wasn't an internet problem. Also had trouble with Pandora. It would take forever to load the app and start playing music. Once playing it typically worked fine but at times I would experience a long pause between songs.I decided to purchase this instead of a Roku or AppleTV because of all of the great reviews. So maybe I just got a faulty device but I sadly had to return it.", "verified": false, "helpfulness": "0/0", "author": "wisso47"}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 5.0, "review": "Love  it", "verified": true, "helpfulness": "0/0", "author": "Quentin"}]