[{"rating": 5.0, "review": "As with any new product it always involves a few glitches before you get it going.  I was having trouble getting a signal to the TV.  I tried several things but what seemed to work was switching the power source the other direction in the power strip. You wouldn't think that would make a difference but it got it working.  The only other glitch was an address conflict on my Amazon account when I tried to activate the Netflix ap.  Once I took care of that everything worked fine.  We watched a movie on Netflix that evening & it worked amazingly great.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Wolfe"}, {"rating": 4.0, "review": "some problems trying to use iphone as a controller instead of the included controller", "verified": true, "helpfulness": "0/0", "author": "Amadeo A. Juarez \"andijtx\""}, {"rating": 3.0, "review": "Frankly I was disappointed in the fire stick as it doesn't  really provide anything more than my BLUE RAY player.  Sure with Amazon prime you get access to outdated movies the same as cable and music which Pandora provides for free as well. The pay services which you can sign up for with the fire stick are the same as on a blue ray. Though it works fine it's just a duplicate of other services and not really worth the $39.", "verified": true, "helpfulness": "0/0", "author": "Rasputin"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "James B."}, {"rating": 3.0, "review": "I say it's okay only because I haven't figured out how to use it yet.  It's in the correct slot on the tv and I have cable. Unable to setup the way it states in the instructions.", "verified": true, "helpfulness": "0/0", "author": "The Novice"}, {"rating": 5.0, "review": "Love it! Easy to use and out of the way!", "verified": false, "helpfulness": "0/0", "author": "Deidre Ogram"}, {"rating": 5.0, "review": "Great product.  We would definitely recommend to any getting away from cable.", "verified": true, "helpfulness": "0/0", "author": "Jerry Ward"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Lisa.W"}, {"rating": 1.0, "review": "Good idea still needs work", "verified": true, "helpfulness": "0/0", "author": "C Puebla-Kmon"}, {"rating": 5.0, "review": "This thing is awesome. It amazes me how something so small can do so much..........cool.", "verified": true, "helpfulness": "0/0", "author": "Rick"}]