[{"rating": 5.0, "review": "Love this product", "verified": true, "helpfulness": "0/0", "author": "Claudia"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Javier"}, {"rating": 3.0, "review": "Pros- Inexpensive- Responsive- Simple remote- Able to sideload Kodi (XBMC), ES File Explorer, and VLCCons- Plagued with WiFi issues, one of my Sticks disconnects daily and the others 2-3 times a week. Requires reboot to restore WiFi. Tip, hold the select (round button in center) button and play/pause button down together for 10 seconds to reboot to avoid having to unplug all the time.- Remote buttons are clicky and louder than Fire TV remote, so much so that it tends to wake the wife up if I don't soften the sound with pillow.- No Vudu app, if you have a sizable Ultraviolet collection you can't access it with Vudu, you can access some of it with Flixter app but it has terrible picture/audio quality compared to Vudu's HDX format.", "verified": true, "helpfulness": "1/1", "author": "G. Avila"}, {"rating": 5.0, "review": "Bought this on Black Friday for $25. Have to say it runs Kodi/SPMC without a hitch. Performance is adequate. Love the integration of prime video. Also runs pandora, Netflix , and crackle well. Will update with Slingbox performance once I have tested it.  No regrets at all. ouya is now collecting dust. If you want an XBMC machine look no further.", "verified": true, "helpfulness": "0/0", "author": "Austin R."}, {"rating": 5.0, "review": "Have a PS4 and so didn't really *need* this add on, but I really, really like it for the convenience factor--startup is super quick for accessing everything and the remote is fun to use.  I also like that I can get other products that I can't get on Sony's platform (Pandora, etc).  My father-in-law has a Smart Blu Ray player and a Smart TV and still prefers to use this stick!", "verified": true, "helpfulness": "0/0", "author": "Jack Sparrow"}, {"rating": 1.0, "review": "I started watching Amazon videos a month or two ago, streaming them on my computers, my XBox One, etc.  I got tired of having to go to those dedicated devices to watch things, and wanted a simple way to watch the same content on a TV.  The Fire stick seemed the obvious answer - my needs were small, so was the price, so I went for it.Even though I routinely streamed full HD video through each of my other devices, the Fire stick was unable to go for more than 10 seconds of low quality video before having to buffer.  After under a minute of video it made the claim that my internet connection was too slow for streaming.  Really? Because the XBox it is sitting right next to doesn't seem to have a problem... even as I switch between the two of them.  And the XBox is doing HD.  All I can surmise is that whatever wireless stuff it is doing is inferior to what I do elsewhere with my tablet (Surface Pro), which streams fine as I walk around the house.I didn't go after this device for fancy features, integration into a home network, games, etc.  All I wanted was a simple device to watch Amazon videos with.  In that, I can say 'it has failed me for the last time.'Pro:- It is small.- Setup was relatively easy.- The black exterior matches the black of the back of the TV it is hidden behind, and blends in well with the shadows.Con:- It doesn't work for streaming video.  (Wasn't that the whole point of this silly thing?)", "verified": true, "helpfulness": "1/1", "author": "Alan"}, {"rating": 5.0, "review": "Works great.  Bought this for my daughter and now I'm going to get one for myself", "verified": true, "helpfulness": "0/0", "author": "Pam C"}, {"rating": 5.0, "review": "No problems... great product!!! :-)", "verified": true, "helpfulness": "0/0", "author": "Lorraine M. Berg"}, {"rating": 3.0, "review": "I expected more from this streaming stick, it plays Amazon Prime content just fine but when I use the Plex app to stream media from my server the playback is unreliable. Sometimes I can watch a show with no issues, sometimes playback is choppy and othertimes playback stops. I can use Plex on my Kindle Fire HDX just fine so it is definitely an issue with the Fire TV Stick.A one dimensional streaming stick, performance is lackluster.", "verified": true, "helpfulness": "0/0", "author": "Miles D"}, {"rating": 5.0, "review": "I love this gadget.  We are exploring ways to reduce our satellite bill and this will help. I can't believe the low price.", "verified": true, "helpfulness": "0/0", "author": "Sandilou"}]