[{"rating": 5.0, "review": "Its pretty awesome!", "verified": true, "helpfulness": "0/0", "author": "Francisco Lopez"}, {"rating": 5.0, "review": "The Fire TV Stick is a small, easy to use device that does precisely what it advertises. Setup is also simple and quick. If having issues connecting to wifi I suggest using the 5 GHz band if you have a dual band router. Most devices connect to 2.4 GHz but Amazon products seem to work more efficiently with the 5. Between shopping, prime instant video and prime music, Amazon is fully integrated in to my life and I wouldn't have it any other way.", "verified": true, "helpfulness": "0/0", "author": "troydg84"}, {"rating": 5.0, "review": "Works Great.", "verified": true, "helpfulness": "0/0", "author": "Jol"}, {"rating": 2.0, "review": "I paid for the sticker. After that I have to pay for everything. I have this device already . I should return it !!!!", "verified": true, "helpfulness": "0/0", "author": "Jonathan khieu"}, {"rating": 3.0, "review": "I got the fire TV stick for free with a subscription to Sling TV (great promo amazon!). I've converted to using this exclusively over my chromecast because it's simpler to use. I gave it 3 stars, because it is more glitchy than my chromecast. So, while it offers more applications than chromecast,  and is more convenient to use, it doesn't seem to work as smoothly as my chromecast.", "verified": true, "helpfulness": "0/0", "author": "BG"}, {"rating": 5.0, "review": "Works great. Own 3 - one per TV", "verified": true, "helpfulness": "0/0", "author": "Paul Swift"}, {"rating": 3.0, "review": "Doesn't work as well as the Chromecast. Has issues with bandwidth and the screensaver doesn't have the option to put the time on it. It's an OK device, works well with Sling, but if Sling had the ability to use Chromecast, I wouldn't have purchased this.", "verified": true, "helpfulness": "0/0", "author": "Henry S"}, {"rating": 4.0, "review": "Its small and powerful but does have some small glitches. One of the issues I have is quick and random black screens about 1 to 2 seconds in length. For the size and the price it doesn't bother me but it does get annoying when it happens 2 or 3 times during a movie or a show you are trying to watch. Other then that small minor issue. I think its a great product. I also like the remote app on your smart phone. I dont like using the physical remote to search so I use the voice search which works great and its extremely accurate. I dont think I will buy the remote with the voice feature since this was a budget buy. Overall the system functions are user friendly and it includes a tutorial before you start using it.I gave it 4 stars since the black screens are really annoying. I hope there will be a firmware update to fix this issue.", "verified": true, "helpfulness": "0/0", "author": "Tony Fasuto"}, {"rating": 1.0, "review": "Didn't work consistently at all.  I have Apple TV, which always works but this kept shutting down when trying to start Netflix.  Also didn't like running Sling TV much.", "verified": true, "helpfulness": "0/0", "author": "Bob Larson"}, {"rating": 1.0, "review": "IF YOU HAVE COMCAST DO NOT PURCHASE THIS DEVICEIf you are looking for a device to play HBO Go, Showtime, or any live tv network and you have comcast DO NOT bother.The only thing my fire tv stick is usable for is Netflix and Amazon Prime.I did not come across this information during my search of Chromecast vs. Amazon Fire Stick, until I had ordered, shipped, and attempted to set it up. Do not waste your time with this device if you have Comcast and care about TV.", "verified": true, "helpfulness": "0/0", "author": "P Chandor"}]