[{"rating": 4.0, "review": "I cut my cable and this makes the transition much smoother.  I love the interface and it's a great device even if you don't subscribe to Amazon Prime.  I have a smart tv but ended up purchasing another to use on it as well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"TLPfeiffer\""}, {"rating": 5.0, "review": "Very good TV Stick. I purchased 1 of these Fire TV Sticks, plus 2 of the larger Fire TV boxes.This stick is better than Google Chromecast or Roku.  For roughly $35, this is money well spent especially if you have Amazon prime. With Prime, you have access to all the Amazon movies, TV shows, and music.  You can also view your photos that are uploaded to the Amazon Cloud.  If you're into games, there is a whole library of games to choose from, some are free, some are paid. If you do play games though, I would recommend the larger Fire TV box which is more expensive but has better performance.  I have both and I notice the difference.This is an Android box so you can also side load apps without rooting it which is awesome.  There are lots of articles online on how to side load apps.We use this Fire TV stick and Fire TV box every day after we cut the cable tv cord.  Excellent device and great for it's price", "verified": false, "helpfulness": "0/0", "author": "TechFanReviews"}, {"rating": 2.0, "review": "the apps are in desperate need of an update.-youtube freezes (useless)-netflix video skips forward-twitch crashes (also no search feature) why?these apps work perfectly fine on my xbox one, so its not an issue with my connectionIm ready to switch to ruku or cromecast", "verified": false, "helpfulness": "0/0", "author": "jaycrim"}, {"rating": 4.0, "review": "Having joined the multitude of television viewers choosing a better way to watch television than cable or satellite viewing I've come to realize that the few hours in my day that are saved for relaxing can also include a select number of quality viewing hours. This is done by preselecting my preferences and saving about $600 per year, streaming with my Kindle and now streaming with the Fire Stick. It's an easier way of viewing shows available and comes with a little remote that provides the familiar comfort that an old remote did without developing the bad an unnecessary habit of surfing for something good to watch. We pay for internet, Hulu, and Netflix and of course Amazon Prime which saves us hundreds of dollars with free shipping and extra savings with Subscribe and Save. Lots of value when every dollar we make these days has to go further than before. Fire Stick also offers more viewing choices than just using the kindle connected to the tv. My husband is enjoying his old westerns again and I am enjoying the fact the he doesn't  channel surf anymore! Why four stars instead of five? I was under the impression that with the stick streaming would be a smoother process. Often times especially on weekends we find ourselves waiting while the system has to buffer. Perhaps the stick has nothing to do with solving that problem, but when a lot of folks are using the net like on weekends the tv goes into its own little spin cycle more often than during weekdays and I thought the Fire Stick would eliminate that issue. It doesn't. But all the other benefits are there and is worth the $39 I paid for it.", "verified": true, "helpfulness": "0/0", "author": "murthom1"}, {"rating": 5.0, "review": "Great way to watch TV. I have become a couch potato because of the great programming offered! LOL", "verified": true, "helpfulness": "0/0", "author": "Laura Katt"}, {"rating": 5.0, "review": "Works great,", "verified": true, "helpfulness": "0/0", "author": "Rodrigo O."}, {"rating": 4.0, "review": "It's hang some times, but so far i like it.", "verified": true, "helpfulness": "0/0", "author": "FAHAD ALGRAINI \"T2\""}, {"rating": 5.0, "review": "This is the s***!! Love this thing!", "verified": true, "helpfulness": "0/0", "author": "L. Silva"}, {"rating": 5.0, "review": "The fire stick has been great for us.  We did not have a \"smart TV\", though it was good and HD.  Fire stick solves that problem.  We can stream anything that we can access.  With Netflix and amazon prime that is nearly everything we would want.  I wish I had purchased this sooner.", "verified": true, "helpfulness": "0/0", "author": "debhuishmac"}, {"rating": 5.0, "review": "Love it!!!! And so easy to set up which is a major plus.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]