[{"rating": 4.0, "review": "Good product to help maximize amazon prime membership.", "verified": true, "helpfulness": "0/0", "author": "Michael Pytel"}, {"rating": 4.0, "review": "Great little device. Quick and easy setup, great picture quality and a good variety of apps. The interface is cluttered and could use some work.", "verified": true, "helpfulness": "0/0", "author": "Vilna Peralta"}, {"rating": 5.0, "review": "I am extremely impressed with this.  It compliments and extends the abilities of my Kindle Fire beautifully.  The screen sharing was perfect and could only be improved by having a quick toggle on the home screen which I still may figure out with more experimentation.Setup was simple and quick.  The one missing necessary channel is HBO Go and they say it's coming soon.I recommend this for everyone but especially for those technophobe relatives who have trouble with new things.  It's really simple.  The Netflix app is the best layout design out of any I've used so far too.  I've got a Roku, Logitech Revue and  a Chromecast and the Amazon Firestick has been the best yet!Another fantastic job from the Amazon Team!  Great job guys!", "verified": true, "helpfulness": "0/0", "author": "John \"IT Administrator for a small Cable Television equipment provider in Oklahoma.\""}, {"rating": 4.0, "review": "Works well on my 60mbs internet service. I wish you could cast your computer screen to the TV like Chromecast does however.", "verified": true, "helpfulness": "0/0", "author": "Mike Clouse"}, {"rating": 4.0, "review": "No surprises! Everything I expected.", "verified": true, "helpfulness": "0/0", "author": "J. Weiner"}, {"rating": 5.0, "review": "Way quicker than the smart apps on my Samsung LCD.  Works great.  For best performance it says to plug the adapter into the side of the fire stick which adds to more cords.", "verified": true, "helpfulness": "0/0", "author": "tconno"}, {"rating": 4.0, "review": "I love my Fire TV Stick, works great, awesome value!", "verified": true, "helpfulness": "0/0", "author": "Vaughn A Clement"}, {"rating": 1.0, "review": "Cannot view same shows on kindle Amazon prime. It says I ordered something when I didnt", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "Performed perfectly, just as expected.  Loved the exclusive Amazon content", "verified": true, "helpfulness": "0/0", "author": "Robert L Grenader"}, {"rating": 4.0, "review": "the fire stick is an easy way to connect to many streaming products now available by the Internet. There still are many apps missing. For example I am a member of acorn TV and really wish the app was available. I have read that it is coming but it would be appreciated if someone could tell me when. Also the screen mirroring function works great. I've tested it on my fire HDX and on my galaxy note 2 and it works well on both. The setup is easy and in about 15 minutes you're connected to the many products available on the fire stick . Netflix, Pandora , and many of the new streaming news services such as CBS and Huffington Post are also available . There also many other niche sites that are available and most of them are free . Enjoy the product and let me know if you hear about acorn TV . All in all it's a great start the key to long-term success is the number of apps available.", "verified": true, "helpfulness": "0/0", "author": "JC"}]