[{"rating": 5.0, "review": "works fine", "verified": true, "helpfulness": "0/0", "author": "James Sinclair"}, {"rating": 5.0, "review": "very good value, the interface makes it more practical and inviting than google chromecast.", "verified": true, "helpfulness": "0/0", "author": "beto"}, {"rating": 5.0, "review": "I love this", "verified": true, "helpfulness": "0/0", "author": "Laura Chon"}, {"rating": 5.0, "review": "A great item!!! I love it!You can play games and see Netflix or listen Spotify :D", "verified": true, "helpfulness": "0/0", "author": "Edward MC"}, {"rating": 2.0, "review": "never got it to work", "verified": true, "helpfulness": "0/0", "author": "blue7053"}, {"rating": 1.0, "review": "Garbage. It's the only wireless device in my whole house that has trouble connecting to my network. Once it does, it can't stay connected. Love the user interface, but the device is worthless. I even bought two.", "verified": true, "helpfulness": "0/0", "author": "Christopher E Woolman"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Dandridge"}, {"rating": 4.0, "review": "Love being able to watch shows without commercials", "verified": true, "helpfulness": "0/0", "author": "Fay Hayes"}, {"rating": 1.0, "review": "Absolutely the worst device I've used in a long time.  If Amazon wants to compete in the streaming business, it must do two things. 1) Fix its overall streaming strategy.  The streams you provide across all devices are low quality, barely SD let alone HD.  2) Develop a better streaming tool.I've been an Amazon user from the beginning and a technologist since 1992.  They can ship stuff fast, but they certainly cannot stream stuff fast.  I never have a quality issue with streams from Netflix using Chromecast or through a PS3 or AppleTV.  But, I tried this FireStick and it ONLY streams Amazon content with any regularity in quality (imagine that).  The HBOgo is out of sync (voice and video) and other platforms, such as watching Netflix, are low-quality streams when viewing them through the FireStick.  Furthermore, it is constantly warning you of \"low-bandwidth\" even though I have a 50MB verified downstream.  It drops it s wireless connection frequently and a number of other errors I've documented.  Load times are ridiculous just getting the device to \"unsleep\" can take several attempts and several minutes.  Anyway, don't waste your money.  Buy an AppleTV or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Arif R"}, {"rating": 5.0, "review": "excellent product. perfect price. 4thumbs up!!!!", "verified": true, "helpfulness": "0/0", "author": "dave"}]