[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kathryn J Venezia"}, {"rating": 5.0, "review": "Love it!Better than cable!Better than Netflix (which is part anyways)!I am yet to stump it and I have a pretty eclectic  taste. Don't be fooled this isn't a cheap alternative to cable. This is a more powerful library with more extensive stacks for those who are willing to pay for it's use.However the money is worth EVERY DIME.", "verified": true, "helpfulness": "0/0", "author": "Patrick Devine"}, {"rating": 3.0, "review": "It's a great streaming stick with all the services you would expect. The specs are top notch, and the voice control via the Fire TV app is handy, if not a bit gimmicky. I found the user interface to be cumbersome and filled to the brim with useless offers and suggestions. Coming from Roku boxes, Fire TV is a navigational nightmare. With Roku, I can choose what clutters up by screen.TL;DR... I give 3 stars for performance. This thing is built to stream! But I minus 2 stars for bloat and navigation.", "verified": true, "helpfulness": "1/1", "author": "Les McGowan"}, {"rating": 5.0, "review": "Love this thing! It's fast, looks good, plugs right into the HDMI port.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 3.0, "review": "Just OK.Easy to set up.Don't get the number of movies advertised.I am not a TV watcher, but bought it for my wife.She watched one Prime movie. Wasn't interested in most of the other movies.", "verified": true, "helpfulness": "0/0", "author": "Raymond P. Duhon"}, {"rating": 5.0, "review": "they work great", "verified": true, "helpfulness": "0/0", "author": "MW"}, {"rating": 4.0, "review": "Love the Fire Stick. Remote is awesome. App is better. Would be 5 stars if it had HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Product was as described and arrived on time.", "verified": true, "helpfulness": "0/0", "author": "BC Jo"}, {"rating": 5.0, "review": "Excellent product, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Bruce Westerbuhr"}, {"rating": 4.0, "review": "Very good only complaint is the limited  selection from amazon prime", "verified": true, "helpfulness": "0/0", "author": "ahmed idris"}]