[{"rating": 5.0, "review": "Easy set and start up very user friendly load with options great buy recommend for all.", "verified": true, "helpfulness": "0/0", "author": "vince"}, {"rating": 5.0, "review": "The best ever entertainment device.", "verified": true, "helpfulness": "0/0", "author": "suzy"}, {"rating": 2.0, "review": "The stick would work great, but it gets EXTREMELY hot.  I'm concerned the unit may melt, catch fire (no pun intended), or ruin my TV.  If it weren't for this major issue with the unit, I would probably love it.", "verified": true, "helpfulness": "0/0", "author": "MCastro"}, {"rating": 1.0, "review": "Very dispointed.  Only a limited (30/500) set of free games  Most shows/movies require payment first.  Most so called free apps (i.e. PBS) won't even work unless you signup painfully on a laptop and commit to some deal.  I rather just just my Android Phone with chromecast instead.  I wish they offered the same free stuff as Google Play.", "verified": true, "helpfulness": "0/1", "author": "P. L. Huang \"bookworm\""}, {"rating": 3.0, "review": "Needed more instructions to get started, great after the learning curve", "verified": true, "helpfulness": "0/0", "author": "David M."}, {"rating": 5.0, "review": "Every once in awhile we have connection issues, but that seems to happen at certain times of the day, so it could just be our internet having connectivity issues. But this is a great product and we love all of the things you can watch with it(movies and music videos) and games you can play(like frogger and motorcycle riding).", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 4.0, "review": "It has provided an excellent source of  movies and other entertainment.", "verified": true, "helpfulness": "0/0", "author": "Bobbo"}, {"rating": 5.0, "review": "I 'lost' my Roku stuff so I ordered this.  It's faster than the Roku but also seems to crash a little more often. It does have the added benefit of hiding behind the TV for those of us who don't like clutter.  I've now found the Roku so I have that in the other room.  I love them both.", "verified": true, "helpfulness": "0/0", "author": "Dalifan256 \"Dalifan256\""}, {"rating": 5.0, "review": "I am very happy with my Amazon Fire TV Stick. We live out in the country so our internet comes from a radio tower so I do have some buffering issues once in a while. I do believe it is because of our internet, not the Fire TV Stick itself. Right now I am just using it with a free trial of Netflix. So far so good.", "verified": true, "helpfulness": "0/0", "author": "C. Porter"}, {"rating": 4.0, "review": "Amazon Fire TV Stick works great.  It's very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Melissa Soto"}]