[{"rating": 5.0, "review": "the responsiveness is amazing on this. I have two other Rokus but this is now my favorite. the operating system is great and does not have that lag the others do. amazing product, I would get another one if i had another TV.", "verified": true, "helpfulness": "0/0", "author": "Michael G"}, {"rating": 3.0, "review": "The Fire TV Stick is a great product that finally brings Amazon into the same realm as Google's ChromeCast and the Roku Stick.The screens are easy to navigate and it ties in well with Amazon prime content as well as Netflix.It would be a 5/5 stars but there is one flaw. The system seems to have a problem authenticating into a network after a bit of use. It seems to loose the password and says that you \"authentication problems.\"  The only fixes that I've found to date are restarting the system by unplugging it or holding down the select and play button for five seconds to restart it.  I've tried this with three different routers and they all have had the same problems. All my other devices have been fine during the testing.I hope Amazon determines the problem ans issues a patch soon!!!", "verified": true, "helpfulness": "2/2", "author": "Eric/Mira"}, {"rating": 4.0, "review": "Prime will not play on my HD TV. I have an older HDTV and the technology doesn't allow Prime to play on the TV Stick. I am able to use apps such as PLEX, etc. that work fine.", "verified": true, "helpfulness": "0/0", "author": "Dan S."}, {"rating": 4.0, "review": "The UI is just not up to par compared to Roku for using app other than Amazon content. Performance of the device is very good compared to the Roku Streaming Stick.", "verified": true, "helpfulness": "0/0", "author": "J.Rohne"}, {"rating": 5.0, "review": "Great deal .. Best stick around better than Chrome (Have one of these also) because you don't need \"to cast\" too it .. So fully independent of a computer smartphone or tablet \"Pluto TV\" is the best so many great channels, also has nice remote control easy to use.", "verified": true, "helpfulness": "0/0", "author": "Videomike77"}, {"rating": 5.0, "review": "this is an excellent unit. I am waiting for another one with prime discount for another TV at home.", "verified": true, "helpfulness": "0/0", "author": "Y. Zhang"}, {"rating": 3.0, "review": "When it is working it works very well.  The issue i have is every time I try to use it I need to unplug it and plug it back in (reboot) to get it to work. Additionally the \"curser\" will sometimes navigate very quickly through the menu without even touching the remote.  I only paid $19 for it so it doesn't seem work it to exchange it", "verified": true, "helpfulness": "30/35", "author": "Kurt Melinda Bennett"}, {"rating": 5.0, "review": "Great much better than chromcast. Love the user interface. You can mirror your Android phone I did it with both LG G3 and Note 4. Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "shak"}, {"rating": 4.0, "review": "Functions as advertised. The remote makes it unique and useful. However, it has ways to go to compete with Chormecast. I have both on the same TV and I found myself using the chromecast twice the times I use the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "Love this! So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Homchick"}]