[{"rating": 5.0, "review": "This works really well with high speed internet. So far, since we have Prime, we're enjoying using it to watch instant videos on our tv. We also can look at our pictures! We haven't done too much other than that, but so far so good.", "verified": true, "helpfulness": "0/0", "author": "Lydia Johnston"}, {"rating": 5.0, "review": "Works fine.  Been having fun with it", "verified": true, "helpfulness": "0/0", "author": "Barbara Matthews \"bamsdragon\""}, {"rating": 3.0, "review": "bought to test against the chromecast...i like the idea of the fire stick more, but not just yet, the UI seems slow, maybe after a few updates i'll change my rating.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 2.0, "review": "No sound for local files (through Plex) that have 5.1 sound in MP4 containers. Netflix and other stuff works ok, not super fast as claimed due to quad-core and what not. Ability to side-load Android apps saved its return else it was going back.", "verified": true, "helpfulness": "0/0", "author": "Average fountain pen user"}, {"rating": 5.0, "review": "It's amazing, waiting for the HBOGO to be added and it will be outta this world", "verified": true, "helpfulness": "0/0", "author": "Jennifer cadena"}, {"rating": 5.0, "review": "This is so cool!!! So glad!!!! Thanks Amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 1.0, "review": "Could not get help in setting up so that sound came thru. Background sounds from program played. Return ed stick.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "Very happy with purchase, got a second one", "verified": true, "helpfulness": "0/0", "author": "Scott willadsen"}, {"rating": 5.0, "review": "It was great", "verified": true, "helpfulness": "0/0", "author": "marvin"}, {"rating": 4.0, "review": "Easy to install Tv stick & App for it.Features that work well: voice search for shows & movies, control from TV Stick App, concurrent TV showing & Kindle use for other things. Access to Hulu Plus. Don't have Netflex to t r yFeatures not work as documented:  cannot show photos or videos from Cloud Drive;  Cannot install App for Cloud Photo or Cloud Video & Photo.Compared to ChromecastMore expensiveTake a little more steps to installCannot be used with other devices via Chrome Browser - much more restrictive scope - very Amazon-centric", "verified": true, "helpfulness": "0/0", "author": "Sam (McGyver) T."}]