[{"rating": 5.0, "review": "Easy set up works great!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. I'm getting rid of cable now and save my money.", "verified": true, "helpfulness": "1/1", "author": "C. Anik \"niko\""}, {"rating": 5.0, "review": "Wow this stick is so amazing!  So many things on it and all we had to do was plug it in.  All our pictures, music, etc. were right on our screen for us.  Thanks Amazon, you are the best!!!", "verified": true, "helpfulness": "1/1", "author": "Maggiegreeneyes62"}, {"rating": 4.0, "review": "Works great! Only issue is I can't get the sound to go through my stereo system which is hooked up to the TV. When I had my Blu-ray hooked into the same HDMI outlet it would play through the stereo.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "Great gift for my son, he uses it everyday.", "verified": true, "helpfulness": "1/1", "author": "Don Helms."}, {"rating": 5.0, "review": "I really give this a 4.5 out of 5. I have owned the fire stick since early December and ordered at special price as I was a Prime Member. The fire stick has been wonderful! I have no issues with connectivity, no blackouts or flickering of picture while watching shows on various apps. On installation, I do recall it took a few attempts to connect to my internet but since then the fire stick has remained connected. Sometimes when I switch my TV input mode to the Amazon Fire stick port the screen will be blank but this is simply because the fire stick is on sleep mode and pressing the home key or any button for that matter on your fire stick remote will awaken it. The reason I dock some points is because they don't have an a app for vudu or HBO GO (which appears they are). I am not super upset about HBO GO because they do have individual HBO shows available. Lastly I wish there was a way to easily search prime videos that are available for rent only.One other thing, while the remote included doesn't support voice search there is an app available on droid as well as iphone which does support the voice function without having to purchase the separate remote.", "verified": true, "helpfulness": "1/1", "author": "Book_thyme"}, {"rating": 5.0, "review": "so quick and easy to setup! Less then 5 min!! And very clear pictures.", "verified": true, "helpfulness": "1/1", "author": "Colleen"}, {"rating": 5.0, "review": "This device is wonderful. This now makes it so much easier to watch the videos included with Amazon Prime on our television.", "verified": true, "helpfulness": "1/1", "author": "Robert E Fadoir"}, {"rating": 4.0, "review": "The stick works great for watching shows. There are a couple of problems which keep it from 5 stars:1) Occasionally it will lose the ability to do WPA-PSK WiFi. When this happens, it will not connect to my WiFi, it always says the password is invalid. I have to remove USB power from the stick to reboot it to get it to work again.2) During some shows on Netflix and Amazon services there will be frames dropped and audio samples lost. I assume this is the device not being able to keep up with the stream. We don't experience this with the other Netflix / Amazon devices in the house (PS3 / Xbox).That said, the speed of the device is SO much better than the build in players on our Sony TV and Blu-Ray or our Vaio TV. The UI is intuitive and responsive.", "verified": true, "helpfulness": "0/0", "author": "UFGeek"}, {"rating": 1.0, "review": "This would be an awesome purchase If It Ever Worked Properly.  This was my first time buying anything like this and I was so excited Only to be let down repeatedly...All throughout the day and night ! It is Constantly, and I mean Constantly shutting down and saying connection error And trying to buffer itself. It seems I am not Alone as I read other reviews. The Only way I have found to fix the error is to physically unplug it and plug it back in the t.v. Until it decides to reboot itself. I really wouldn't mind if it was only on occasion but its 6-10 times a day. Why can't this be fixed? It's the only problem I have with the fire stick But its become a Big Problem as it just gets worse and worse. At this point I would Not recommend and I would Not buy this again Unless this was a guarantee fix.", "verified": true, "helpfulness": "0/0", "author": "Peggiann"}]