[{"rating": 5.0, "review": "Great buy.", "verified": true, "helpfulness": "0/0", "author": "BETTY R."}, {"rating": 5.0, "review": "Love fire stick. Great series and prime movies. Now will be able to take this on vacation,watching movies on TV rather than a laptop.", "verified": true, "helpfulness": "0/0", "author": "Amtrak51"}, {"rating": 5.0, "review": "Love it!!! Super fast and easy to use. Set it up within 3mins and was watching movies right away! I have Amazon Prime so this was awesome. Before I would watch it videos on my iPad or laptop. Now I can enjoy Prime on my tv.", "verified": true, "helpfulness": "0/0", "author": "Veronica"}, {"rating": 5.0, "review": "I've had it for a little over 3 weeks,  and I love it. It's easy to use,  I watch my Netflix and Amazon Prime videos, both work just fine.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 5.0, "review": "Great way to entertain family and friends.  Easy to install and activate.  Makes a terrific gift,", "verified": true, "helpfulness": "0/0", "author": "R. Pyle"}, {"rating": 1.0, "review": "not very useful.  only lets you watch some Amazon prime shows for free.  Otherwise everything is pay and the services are expensive.  If I had to do again probably would not have gotten.", "verified": true, "helpfulness": "0/0", "author": "Anthony F. Uberti"}, {"rating": 5.0, "review": "I have enjoyed using it it helps with spare room TVs and I watch more on it than sat tv !", "verified": true, "helpfulness": "0/0", "author": "Tim Klein"}, {"rating": 4.0, "review": "I love it . it has its moments but it is everything it was cracked up to be in more.", "verified": true, "helpfulness": "0/0", "author": "Reelog"}, {"rating": 4.0, "review": "slow on downloads but I think it's my Wifi connection.  overall happy with the Fire stick and all of the options, available programs.", "verified": true, "helpfulness": "0/0", "author": "Kelly O Ryan"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "juan hidalgo"}]