[{"rating": 5.0, "review": "Absolutely love it, I recommend it!! Very easy to navigate, very happy with it", "verified": true, "helpfulness": "0/0", "author": "Heather Ellis"}, {"rating": 3.0, "review": "I haven't seen any tv programs listed that I have ever heard of. And haven't really checked out much else.  I need to get AT&R; uverse  so it doesn't stop and start.  I had to have a friend come in and get it going.  We shall see.", "verified": true, "helpfulness": "0/0", "author": "Sharon Jarding"}, {"rating": 5.0, "review": "Love the UX of the menu. So easy to use and much better option than Chromecast (I have both).", "verified": false, "helpfulness": "0/0", "author": "APL418"}, {"rating": 4.0, "review": "It's not bad, could have a few options added like Hulu or Google but I like it.", "verified": true, "helpfulness": "0/0", "author": "Adrien Wilhite"}, {"rating": 5.0, "review": "The Fire TV Stick is great. The only unpleasant surprise was the fact that nearly anything we want to watch costs money. I guess there really is no such thing as a free lunch!", "verified": true, "helpfulness": "0/0", "author": "Charles Ota Heller \"Charles O. Heller\""}, {"rating": 4.0, "review": "Easy set up smooth operation. Lots of choices but some only in SD.", "verified": true, "helpfulness": "0/0", "author": "rich petersen"}, {"rating": 4.0, "review": "Does a great job streaming with our very slow internet.  Like it so well I bought a second one. Wish it had the CBS app available.", "verified": true, "helpfulness": "0/0", "author": "Vicky Young"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Donald M. Leavitt"}, {"rating": 1.0, "review": "I got it all setup and able to connect it. I have a DSL connection because of work and it's connection speed is too low so it will not stream video", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "Love my fir stick. How did I live with out?", "verified": true, "helpfulness": "0/0", "author": "TimHBTR54"}]