[{"rating": 4.0, "review": "I love my Fire TV Stick! I did away with cable a while ago, and was looking for just a bit more options than over the air TV offered. I was tossing around the idea of Netflix, but decided to give Fire TV a try first seeing as how I already had a prime account, and could do Netflix with the Fire TV later if I felt I needed more options. I've had Fire TV for almost 2 wks now, and am very happy with it. Set up was simple and took less than 5 mins., the variety is plenty for me, and my daughter is loving having Dora back on TV again! I was also super excited to find soo much variety in the apps. There must be 2 dozen excersize options alone. I've even recommended the Fire TV Stick to friends!", "verified": true, "helpfulness": "0/0", "author": "Rene"}, {"rating": 4.0, "review": "No comments.", "verified": true, "helpfulness": "0/0", "author": "DLMILES"}, {"rating": 3.0, "review": "Is a very good system, but you need to put it next to the router. Very bad wifi signal.", "verified": true, "helpfulness": "1/1", "author": "Jorge Bogaert"}, {"rating": 5.0, "review": "Love it, easy to use, wonderful device", "verified": true, "helpfulness": "0/0", "author": "Janet E. Nosal"}, {"rating": 4.0, "review": "His good but don't let me search more app chanels", "verified": true, "helpfulness": "0/0", "author": "Juan H."}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Douglas Torres"}, {"rating": 1.0, "review": "Do not lose remote... if you set-up a WiFi to use for your stick and download the remote app to your phone/tablet and then change your WiFi you better change it via your remote..  the app remote & fire stick MUST be on same WIFI.  you lose your remote before changing WIFI your screwed.  The app remote on ur tablet/phone won't work and you are screwed.  Throw your fire stick away!!!  Spent over an hour with technical support and they had no answer..  serious flaw in the fire stick", "verified": true, "helpfulness": "0/0", "author": "saline smith"}, {"rating": 5.0, "review": "If I could I would give the Fire TV Stick another star. To my family it is the icing on the cake. I first started as a Amazon shopper, then acquired their credit card to take advantage of reward points. Purchased a Kindle which pretty much replaced my desktop and also became a Amazon prime member. With prime I have built a music playlist that's incredible. I would recommend buying fire tv & sticks. I own one fire tv  which is best for gamers, one stick in man cave for music and one in bedroom for video. Grandkids love the games, I the audio & video library that much is free being a Prime member. Prime membership includes free two day shipping from Amazon and access to great games, audio and video. Sometimes I purchase cd's not available through Prime membership but you get the cd's plus its loaded onto the your cloud to play through Amazon's fire or sticks or your Kindle. I could go on and on but the package is incredible.", "verified": true, "helpfulness": "0/0", "author": "JAMES/m"}, {"rating": 5.0, "review": "We absolutely love this purchase!  Wish it had HBOGo and a few other subscription channels- but I bet they'll come.  So easy.  Really great device.", "verified": true, "helpfulness": "0/0", "author": "Ashley Harper-Oberle"}, {"rating": 5.0, "review": "Got this thing for $20.  Would have paid the regular price for this thing.  Works great!  Remote is fantastic!", "verified": true, "helpfulness": "0/0", "author": "Michael Fleming"}]