[{"rating": 4.0, "review": "bought 3, 2 for $19, and 1 for $25 at best buy black friday special.  Works as expected, the included apps were pretty useless, i have netflix it doesn't work as fast as my smart tv.  Network speed and range is mediocre.  You really need to have prime for this to be useful otherwise;Think of it as a simple inexpensive andriod box.  Mostly use it with xbmc and other side load.mirror option with samsung tab pro is pretty slow and inconsistent, sideloaded airplay and used ipad air, that works fairly well.my main complaint is it doesn't let me output 1080p with my sony 4k tv only let me set to 720p, on my 1080p tvs it works fine.trying to get to worth with my blue tooth devices, so far does not sync not sure why yet, will keep playing and see if I can get it to work.", "verified": true, "helpfulness": "1/1", "author": "Charles C Tai"}, {"rating": 5.0, "review": "I know it has less processing power than the fire tv box, but I can't notice. Works every bit as fast as Roku. Just a smaller library of available apps. No dedicated network apps, CBS, CWTV, Epix, FOX, NBC, TBS, TCM, or VUDU. However, lots of support for Amazon games and Amazon dedicated kids programming, Hasbro Studios, Jim Henson Family TV. Best $20 ever spent.", "verified": true, "helpfulness": "0/0", "author": "Shaggy Rogers"}, {"rating": 5.0, "review": "WONDERFUL PURCHASE!  I CAN ENJOY WATCHING T.V. AT ANYTIME.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "awesome awesome awesome purchase. I love this thing. many changes and free movies even with out prime.", "verified": true, "helpfulness": "0/0", "author": "Princess"}, {"rating": 5.0, "review": "I spend a lot of time with my Kindle, so don't watch a lot of TV or listen to a lot of music, and haven't yet had a real need to get a connection faster than DSL, but when the new Fire stick was offered for $19, I figured how could I go wrong?  Worst case I'd be able to stream music but not video.The first stick couldn't complete set up, which entailed a return to get a stick that could do a software update and be functional, but Amazon handled all that very well and very promptly as always.  Once things were up and running (the hardest part of setup was getting the battery cover off the remote, and waiting for the software download to finish, everything else took only a few minutes), I was thrilled to see the stick streamed video without a hiccup despite a humble DSL connection.  I found some great music playlists and instant videos ... and  will definitely be a fan of Alpha House and Bosch!For the next generation stick, I have to agree with other reviewers ... please redesign the battery cover on the remote so it can actually be removed without superhuman effort, and please redesign the power adapter so it doesn't take up two places on a power strip.And please please please .... more episodes of Bosch asap!  The pilot left a lot of us fans dangling!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jchinitz\""}, {"rating": 5.0, "review": "A very straight forward device. Very easy and quick to set up. We have already watched movies and tv series. Also, the Amazon PC web site for the Fire Stick makes for a powerful and easy access option for reviewing and adding items to the watch list.All in all, a great product.", "verified": true, "helpfulness": "2/2", "author": "MaryAnn Werner and Edward Werner"}, {"rating": 4.0, "review": "it is very easy to hook up and it works great . We have a slow internet connection but works great no problems", "verified": true, "helpfulness": "0/0", "author": "Leon W. Greenwood Jr."}, {"rating": 4.0, "review": "Whoever designed the remote should be shot.Simplicity in design is one thing and is a virtue that all industrial design should try to achieve.However, not including ANY grip features on an all-smooth plastic back or DIRECTION ARROWS on WHICH PIECE should be sliding is MORONIC. Remote design fail.I'll update this review once I figure out how to PUT THE BATTERIES IN!!!Update...30 minutes later....Okay, managed to pry off the battery lid and installed the batteries. Sheesh, talk about dumb design. ARGH! Enough ranting...CONNECTION of the Firestick was surprisingly straightforward and idiot-proof. Connected it to back of my Samsung flatscreen was not too difficult, albeit I had to use the enclosed HDMI extender because of the tight dimensions. A PLUS! Thanks Amazon for including the hdmi extender dongle!WIFI connection was straight forward until it wouldn't connect because my wireless router has MAC filtering on. Had to turn mac filtering off for it to connect. Still haven't figured out where the MAC address of the Firestick is printed or encoded. Will re-enable mac filtering once I find it's mac address.SOFTWARE and USER INTERFACE was surprisingly very well laid out. KUDOS to the user interface team! (I still have a bone to pick with whomever designed the remote control.) All pertinent controls are well placed, Since this is an Amazon product, the Prime Video and related links take center stage. There are links for Movies, TV, Watchlist, Video Library (instant-video movies and tv shows you bought ) Games, Apps, Music, Photos, Settings.I was happily surprised all my Prime iCloud photos showed up and I was able to run a slideshow on my big screen tv!SOFTWARE APPS CHOICE was a bit limited. I'll chuck this up to early adoption syndrome. Hopefully as the product matures, more apps will be available. I was disappointed that VUDU app was not available. While the FLIXSTER app was, VUDU is the other half of the inane marriage that is called the ULTRAVIOLET ecosystem. Some movies only stream via FLIXSTER, some only stream via VUDU, WE NEED BOTH.VIDEO QUALITY streamed from Prime HD sources were surprisingly good. KUDOS Amazon! I cannot say the same about FLIXSTER stream quality. Quite dissapointed with Flixster stream quality. Much compression and artifacts. Boohoo!Video quality from NETFLIX is comparable to Prime HD, pretty good. Yay NETFLIX !OVERALL IMPRESSION is a good buy! For the money spent $19 (two day launch special) even $39 price is a good deal; I find this a very good value! Small inconspicuous, inexpensive device that can add new life to HDMI capable tvs.HIGHLY RECCOMMENDED", "verified": true, "helpfulness": "0/2", "author": "Brooklyn Bumpkin"}, {"rating": 5.0, "review": "I am really shocked.This little thing is amazing!!!I paid $19 on the 2 day promotion.I am so glad i did.Its super fast,  loads netflix and Amazon Prime Movies with hardly any delay at all.Faster than any of my other devices.And i have ROKU 3 Apple Tv  PS3 xbox 360  Blu Ray players WDTV Live, all of which can stream  and none of them apart from ROKU 3, come close to this Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Stuart Scott-davis"}, {"rating": 5.0, "review": "Very satisfied with the Fire TV Stick.  It operates smoothly and quickly.  I have two ROKU 3's in my home, and the Fire Stick is just as fast if not faster when navigating.The remote is small and attractive and easy to operate by feel.  This is being used on a bedroom TV.  The included HDMI extension was needed because of the limited clearance to the wall at the HDMI connector, a nice touch by Amazon to include that accessory.", "verified": true, "helpfulness": "0/0", "author": "Anthony2102"}]