[{"rating": 5.0, "review": "We love the Fire Stick! This is so easy to setup and use, even a middleaged non- tech savy lady like me can use it:)", "verified": true, "helpfulness": "0/0", "author": "Kendra G. Palmer"}, {"rating": 4.0, "review": "Purchased during the pre-order for $19; at that price it's hard to be disappointed since there is MUCH more functionality than the Chromecast (which sells for more). Hard to tell if the app ecosystem is just in infancy or if this is as good as it will get; time will tell.Capable replacement for my dated GoogleTV; everything is VERY responsive and the usual suspects are available for media. I'm not thrilled with the Amazon lock-in, but happy with the Plex, Netflix and Amazon Prime Streaming apps (a bit peaved my Plex-Pass didn't net me a free FireTV app, but that's not Amazon's fault).I will say that the trimmed features have me thinking about just buying the full-sized FireTV and giving the Stick away as a stocking stuffer; search is painful without the voice capable remote and the reduced CPU and RAM limit your app choices even more from the already small Amazon AppStore outside of Google's Play Store.Would give 5-star if Amazon had made a media device that didn't add another remote to my livingroom; looks like my best option to solve that involves the Logitech Harmony remotes which adds another few hundred dollars to my final cost to get exactly what I want.", "verified": true, "helpfulness": "0/0", "author": "Isaac S."}, {"rating": 5.0, "review": "Tl;dr I no longer use the Chromecast. This device does everything that I need really well.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "John L. Louderback"}, {"rating": 5.0, "review": "Excellent product - tons of viewing options!! Be careful with the length of this item, though. Depending on how the back of your TV is configured you may not have room to insert it into the HDMI input. I almost ran into this problem but was luckily able to avoid it. (The outer shell of my tv forms a raised lip rather close to the HDMI inputs that almost prevented me from using this product)", "verified": true, "helpfulness": "0/0", "author": "michael a. gizzo"}, {"rating": 5.0, "review": "I really like this device! My kids love the game feature... I'm not positive how the coins work yet but I can see us using that as some kind of good behavior incentive. It took a while for the remote app to work but it's pretty cool once we got it to connect. I love that the Netflix app on my phone recognizes it and let's me fling show up to the tv.  I had to order it through bestbuy since it's back ordered on amazon. But I'm excited to get the game controllers for it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It fell short of my expectations. I use a Roku 1 at the moment because it allows me to have Acorn TV. None of my smart TV's have that app and neither does this stick. Another problem is that unlike my roku box I can't stream seamlessly from the stick from my mobile phone wifi hotspot. It buffers constantly. My Roku box doesn't have a problem with the WIFI from my cell phone and I can stream video for hours without interruption. I will keep the sticks I purchased but only because I received them at a really low price and I can give them to people who don't know what Acorn TV is....or care.", "verified": true, "helpfulness": "0/0", "author": "A. Saul"}, {"rating": 2.0, "review": "As a DirecTV customer this product is of little value other than providing access to AmazonPrime and Netflix which most competing devices have as well, but the Apps that require a provider (ShowtimeAnytime, Disney) don't include DirectTV.  Until this changes I will stick with Roku devices.", "verified": true, "helpfulness": "0/0", "author": "J. Daniels"}, {"rating": 5.0, "review": "I'm a ROKU user for years now and just brought the new Fire TV Stick for an introductory price.  It is great as I am also an Amazon Prime member.  Everything I need to readily available on the Fire Stick.  It offers most apps that ROKU has except for music apps which I love.  The Fire Stick only has a few radio stations available compared to ROKU.  Other than that it is inexpensive and wonderful to use.", "verified": true, "helpfulness": "0/0", "author": "Leslie Light"}, {"rating": 5.0, "review": "I have a full Fire TV box for my main tv.  The Fire Stick works just as effectively as the box, on my second tv.", "verified": true, "helpfulness": "0/0", "author": "insolent cur"}]