[{"rating": 5.0, "review": "Love it! Ordered two by mistake but decided to keep both.", "verified": true, "helpfulness": "0/0", "author": "Tina C."}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Nadine keane"}, {"rating": 3.0, "review": "Some Applications work well for example music photos and old movies. On the other hand to subscribe to TV stations requires such a large subscription it's not close to being free. There should be some directions that would help a person get started like fires TV for dummies", "verified": true, "helpfulness": "0/0", "author": "jmm"}, {"rating": 1.0, "review": "The stick kept wanting to validate my pin number and would get hung up. After 5-8 attempts I decided to watch the movie I purchased on my laptop.", "verified": true, "helpfulness": "0/0", "author": "TD"}, {"rating": 5.0, "review": "Works Great, easy to set up...also a Roku user....", "verified": true, "helpfulness": "0/0", "author": "bud majest"}, {"rating": 5.0, "review": "It works great, so easy to connect; we struggled with a certain \"Smart Tv\" that we had nothing but problems connecting to our wireless internet. This was simple and works amazing, wish we'd know about this month's before, we would have saved ourselves a lot of frustration!", "verified": true, "helpfulness": "0/0", "author": "Ron Ellison"}, {"rating": 5.0, "review": "Worth buying. Easy to set up and use....update...Had this a couple weeks now and at first it was awesome. Now it's constantly freezing and pausing while watching movies on netflix. It just started yesterday and I've tried several fixes with no luck. I'm starting to realize it wasn't worth the money and I'm going back to my ps3 for netflix since it doesn't have any issues.", "verified": true, "helpfulness": "0/0", "author": "Michael G."}, {"rating": 5.0, "review": "Wonderful product!!", "verified": true, "helpfulness": "0/0", "author": "Shilo Fisher"}, {"rating": 5.0, "review": "I can't the believe the power this little stick packs. Super quick downloads along with seamless playback. I'm buying several more over the next couple of months and replacing all of my older Roku players with this little beauty.", "verified": true, "helpfulness": "0/0", "author": "Steven M. Roehl"}, {"rating": 5.0, "review": "Exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "Sheila Proctor"}]