[{"rating": 5.0, "review": "This stick with xbmc flawless its the best short and simple", "verified": true, "helpfulness": "0/0", "author": "Mikel Bledsoe"}, {"rating": 4.0, "review": "I have used Roku, Google TV and Chromecaster.  I like the First TV stick for many reasons.  The first is the remote. The remote is much higher quality than what comes with the base Roku devices.  I like the interface and particularly the control I have over kids.  The device has some very interesting game options and the remote works well with them.  I would give this five stars but doesn't support HBO  Go and some other services.", "verified": true, "helpfulness": "0/0", "author": "NorhLoudspeaker"}, {"rating": 2.0, "review": "I've used the Roku, Apple TV, and Android TV (Nexus Player).  This works as well as any of them, it's just the interface is a complete mess.  From the downloading of apps to the launching of apps, this product is so Amazon-centric that it's a hinderance to use any other service.  I like either Roku or Android TV better.  Apple TV is the worst of the bunch.  It is a complete mess.", "verified": true, "helpfulness": "0/0", "author": "A. Davies \"adogg\""}, {"rating": 5.0, "review": "OK, I probably didn't need another gadget to plug in (had to buy another HDMI switch), but the lure of Amazon Prime movies, etc. was too great.  So far I have been very pleased.  It worked right out of the box (my Amazon account was pre-loaded), and the interface is pretty straightforward. The remote works just fine and the content on Amazon Prime is excellent.  Wish it had a VUDU app since I have some things located there, but I can use my Apple TV for that.If you have Amazon Prime, I'd highly recommend this purchase.  It's well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Bill Gehring"}, {"rating": 4.0, "review": "Fire stick works great, especially with smart phone app. I bought a second fire stick for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "CE"}, {"rating": 5.0, "review": "Just love it😍", "verified": true, "helpfulness": "0/0", "author": "april otero"}, {"rating": 4.0, "review": "Goood..however, it doesn't have youtube app.", "verified": true, "helpfulness": "0/0", "author": "EL_CAZADOR"}, {"rating": 3.0, "review": "I installed it a few days ago.  I already had the Chromecast, which I like a lot.  I don't like the Fire TV Stick by comparison.  They work quite differently and the Fire unit takes a while to get used to.  Once it is operational it seems to work fine.", "verified": true, "helpfulness": "0/0", "author": "Christian Humanist"}, {"rating": 5.0, "review": "LOVE IT!!!!!! Totally satisfied and more so. The video library is great. Super easy to install and use. No wireless problems at all. You shoukd buy it!!!", "verified": true, "helpfulness": "0/0", "author": "Sarah  Walton"}, {"rating": 4.0, "review": "Works great one our newest t.v.,but on the large plasma,we get squiggly lines on it. on the whole I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Linda K. Goble"}]