[{"rating": 2.0, "review": "The FIre TV stick strive for greatness yet once again, just like the Fire Phone, fell short of expectations.As is the case with Amazon product, the products appear well constructed, first-class built and hyped greatly by its well-developed advertisement wed page. When I have the choice between this Fire Stick and Roku Stick for my 3 month special Sling promotion, I chose this after reading its wed page and considering all the hypes around its hardware. And as was the case with the Fire Phone, I was quite disappointed.First, the Fire TV isn't exactly popular with apps developer, as is the case with everything in Amazon stratosphere. You will notice that in app advertisement, Amazon put Youtube.com and not the usual YouTube red logo. That's because YouTube doesn't have a dedicated app for Amazon Fire Stick yet. Though this is the least of my problem since there is alternative app that function just the same. I am only mentioning this as proof that app developing for Fire Stick is quite underdeveloped.Second, the app that is active for Fire Stick isn't exactly well developed! SlingTV and MLBTV apps were the main reasons I got this stick to begin with and the lagging, slow responsiveness, freezing and untimely exits have caused me to pull out quite a few hair from my head. I can't vouch for Netflix, Hulu, or HBO Go since I am not subscribed to their services but I can safely assume that their functions isn't much better than what I experienced with Sling or MLBTV.Lack of contents and dysfunctional apps really drive the value of this seemingly powerful stick down. I don't know exactly how Amazon's gonna woo all those developers when the public interest in its Fire Stick remains limited either. So save yourself some time and grief (hair as well), go buy either the Roku stick or Nexus player. The Amazon TV line slowly but surely will end up just like its phone, giveaway nobody wants.", "verified": true, "helpfulness": "0/0", "author": "KIET N."}, {"rating": 2.0, "review": "Was promised a membership with Prime if I bought the Paperwhite and so got this too.  If you don't sign up for Netflix, Prime, etc., your \"free shows\" are limited.  I could get basically the same with the rabbit jack.  Also, he said you could talk your commands to tv with the remote.  NOT, you have to get an app for your smart phone and use the smart phone to talk to the tv.  Who wants to keep their phone on just to turn the programs?  Another disappointment Amazon.", "verified": true, "helpfulness": "0/0", "author": "Aminuts \"D. Mendez\""}, {"rating": 5.0, "review": "Great interface, super convenient remote, snappy and quick.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Chunglo"}, {"rating": 1.0, "review": "I had high hopes for the Fire Stick, but it's just not working for me. The control was broken when I first got it, I ended up having to take it to get fixed, now it's hit or miss whether the whole thing works. It doesn't want to stay connected to internet (yes I've called both Amazon and my internet company), I will be in the middle of a movie and it will disconnect and it'll take me thirty minutes or more to get it back on. So frustrating! I'm definitely not a fan.", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "We love this!  Its got about as many bells and whistles as the Roku.  Sometimes it takes a while to load.  And also to start up after being off all day.  Wasn't happy the insurance I got to go with this didn't start until this shipped, and we had pre ordered it.", "verified": true, "helpfulness": "0/1", "author": "Tanks Daddy"}, {"rating": 5.0, "review": "We love this! Got it for my husband for Father's Day so we didn't have to have the computer connected to the TV anymore. It's fabulous! So glad the price is low too!", "verified": true, "helpfulness": "0/0", "author": "Katherine"}, {"rating": 5.0, "review": "The stick was easy to install and run.  It works very well with Netflix and Amazon Prime.  We love it.", "verified": true, "helpfulness": "0/0", "author": "Clifton Curry"}, {"rating": 3.0, "review": "This is an inexpensive streaming device that works well with the Amazon content, but it can be a little slow and I have had it lock up if it is not powered down after about a week. And this is in a house with a heat pump, so the temperature only changes by about 3 degrees F or 1 degree C.I actually like the remote on the stick better than the one that comes with the full Fire TV, as I leave my remotes on a chair or nightstand when I use them. This remote has a flat back, while the one with voice control has a curved back (can be better if you normally hold your remote).The Netflix app is good, and the Music app is nice.Unfortunately, if you ever run the Amazon Music stuff, it will tend to start playing music when you pause an Amazon Video stream (until you reboot the Amazon Fire). I have had this happen with both the Fire TV Stick and the Fire TV.All of my complaints are fixable in software, so I have no problem recommending the hardware to people who are Amazon Prime members and use Amazon Instant Video.", "verified": true, "helpfulness": "0/0", "author": "garkin"}, {"rating": 1.0, "review": "JUNK! I have wasted so much time trying to get it to work and it has been so frustrating.  I returned the first one and amazon sent another, same issues.  I have tried it with all different router settings.  I am a computer/network technician and this product is junk!!", "verified": true, "helpfulness": "0/0", "author": "G.A."}, {"rating": 5.0, "review": "Buenisimo", "verified": true, "helpfulness": "0/0", "author": "Juan Carlos Cabral"}]