[{"rating": 4.0, "review": "Pretty cool, though there aren't a great selection of games and a lot of them are laced with in-app purchases. Also, the video streaming quality doesn't appear to be as good as my other smart devices for some reason. Good investment otherwise though!", "verified": true, "helpfulness": "0/1", "author": "Caleb"}, {"rating": 1.0, "review": "Disappointed....I purchased the TV stick and I was really excited to try it out. I have been using Rok for years and have found nothing to even remotely give the ease of use and dependability of Roku. So hookup for the TV stick was pretty much straight forward. But connecting to the internet was horrible. I tried and tried and then I tired of trying, so I made arrangements to return and get another (thinking surely it was the box, because everything else works that needs the internet, so it couldn't possibly be my network). Well, I got the other one and guess what? After working with it for what seemed like forever, it finally connected to the network...then kicked me out of it. I wasn't able to get it to work to try it. I am envious of those who have tried it and adore it. I love my kindle and would love to be one that loved anything amazon would put their name on, but unfortunately this was a bust for me. Good luck to those that purchase, surely your luck will be better than mine. I do believe in my heart that had it connected and maintained the connection that I would have been happy with it. But I guess I will never ever know.", "verified": false, "helpfulness": "2/3", "author": "Kendra Armprester"}, {"rating": 4.0, "review": "Its a great little device! I wish there were more games available for it that used only the remote but I'm sure that will change with time. Searching through Amazon's music library could be streamlined for better results. The video playback is excellent. If it could cast your screen like the Chromecast can, this device would be top notch.", "verified": true, "helpfulness": "0/1", "author": "Gabe Reed"}, {"rating": 5.0, "review": "Exactly what I wanted! Easy to set up and access my Amazon Prime tv shows and videos without having to lug out my computer each time.", "verified": true, "helpfulness": "0/1", "author": "Megan C. Mcninch \"MCM\""}, {"rating": 5.0, "review": "My life just got so much easier. I LOVE this thing, it has fully replaced my Chromecast because it's so much easier to use. I was constantly having to restart my Chromecast to get it to recognize my streaming attempts. With the Fire TV Stick, all I have to do is use the remote (which DOES come with it -- it's the voice recognition remote that's sold separately.) I haven't touched my Chromecast since I opened this, because all the services I use (Amazon Prime, Hulu+, Netflix) are available and insanely easy to navigate.There are only two cons:The tutorial is only shown after setup -- and by the time you get through setup, you already know what you're doingYou can't stream a feed directly from your desktop, so if you want to show something direct from your computer, you'll still need to use Chromecast. (Though honestly, the Chromecast functionality for that is so crappy, I almost wouldn't even consider it a con.)", "verified": true, "helpfulness": "0/1", "author": "Julia W \"Julia\""}, {"rating": 2.0, "review": "streaming was very choppy.  made watching anything unenjoyable.  Fire TV much better.", "verified": true, "helpfulness": "1/1", "author": "Shelly Forkel \"ibelieve1968\""}, {"rating": 4.0, "review": "So far, so good. It was very easy to setup. Streaming works perfectly and the interface is easy to navigate. I've used Apple TV, Roku and SmartTV from Sony, Samsung and Vizio and find this device to be on par with the best of them. This could be a 5 star device if the iOS app is awesome when it comes out - it could also drop the score if it doesn't work, that would be a huge detraction.We use this for Netflix, Hulu, Amazon Video, Pandora, Flixter and some games. Missing HBOGo is a bit of a bummer too, but I have it on other devices. Knowing that there will never be a device that will stream from every service I use (Apple won't carry Amazon and vice-versa, for starters) I think that this and an Apple TV are the two to get.", "verified": true, "helpfulness": "0/1", "author": "C. J. Pirrello"}, {"rating": 1.0, "review": "Hopefully Amazon reads this review (since its actually there product) and others find it useful. I bought the 2 fire sticks for 19 each (Prime member) because i am trying to get rid of my Xbox, which i never play. It has all the content that the Xbox but the main reason that I bought the Fire Tv stick and that is to mirror my phone to my TV. The product page even says that it supports mirroring from a Samsung device (i have the GS5),. Guess what..It doesn't, after spending 3 hours trying to get it to mirror to the screen, I called amazon support for them to tell me that Samsung as its own Miracast program called Allshare and cant be linked to a Fire Tv stick. I will probably be returning both of my fire TV sticks and just buy a Google ChromeCast. Its just wrong for a company to state  that it's products perform a certain way but never lives up to what it suppose to do.", "verified": true, "helpfulness": "71/87", "author": "travis"}, {"rating": 4.0, "review": "It would have been better if it had HBO to GO, but well worth the money!", "verified": true, "helpfulness": "0/1", "author": "Kenneth L. Petro"}, {"rating": 4.0, "review": "Works great the only thing I wish that it has is a Vudu app. I know they are competitors but it still sucks. I can still watch some of our videos off of Flixster if they were UV. I was lucky to pick mine up on there 2 day sale for 19$ or I would of bought a different stick so I could watch Vudu. I love that I can listen to all my music I buy off of amazon though.", "verified": true, "helpfulness": "1/2", "author": "Miss E"}]