[{"rating": 4.0, "review": "I was hoping there was a blootooth feature to Cooney to tablet for situations where WiFi is very good.", "verified": true, "helpfulness": "0/0", "author": "Paul Slocoast"}, {"rating": 5.0, "review": "Simple to set up and lots of great stuff to enhance your TV", "verified": true, "helpfulness": "0/0", "author": "Jason D. Hhaddad \"jdh1973\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "paul Vidaic"}, {"rating": 5.0, "review": "Works wonderfully, my TV on the other hand likes to flash when it changes the quality depending on Internet speed so on some shows my TV flashes when it goes from say 480 to 1080 or 720 but the stick pauses itself when this happens so it's nice that you don't miss anything but frustrating that I have to press play 3 times in the first minute of show. Love the Bluetooth remote!", "verified": true, "helpfulness": "0/0", "author": "TRice"}, {"rating": 5.0, "review": "Easy to set up. I connect with Amazon Prime, Hulu and Netflix in just a few minutes. It controls are easy to use and it is fast.Jim", "verified": true, "helpfulness": "0/0", "author": "Jim Wenzloff"}, {"rating": 5.0, "review": "Awesome and powerful", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 5.0, "review": "Great user interface.", "verified": true, "helpfulness": "0/0", "author": "Abel Herrera"}, {"rating": 1.0, "review": "Extremely disappointed in this item. I actually returned it. It didn't include HBO and other networks that I wanted so there was no need to keep it.", "verified": true, "helpfulness": "0/0", "author": "Diane Natuzzi"}, {"rating": 5.0, "review": "Very good product would recommend", "verified": true, "helpfulness": "0/1", "author": "humberto"}, {"rating": 4.0, "review": "This was a gift and it works great, figuring out how to use the remote effectively was tricky but within a couple of uses I have it down, It came with a free 30 day trial of Amazon Prime which didn't work out so well but with a few emails Amazon fixed the problem, I just wish Prime had a bigger selection of movies", "verified": true, "helpfulness": "0/0", "author": "Jamie Conklin"}]