[{"rating": 4.0, "review": "It is so easy to install.  It came on time packaged for safe shipment.  The stick with remote is so easy to navigate", "verified": true, "helpfulness": "0/0", "author": "Judy Davis"}, {"rating": 5.0, "review": "I wasn't expecting it to be this good, even after I ordered it.  I was using Amazon app in my Samsung smart before for browsing and watching my prime videos. Now that apps look so bad before this stick. So easy navigation, super quick response, it can pull video and audio from my amazon cloud drive and I can use voice commands from the fire tv mobile app.  Great buy.  I hight recommend for any prime members.", "verified": true, "helpfulness": "0/0", "author": "San"}, {"rating": 5.0, "review": "Better than Roku, and that takes some doing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"lorax niner\""}, {"rating": 5.0, "review": "Oh my goodness!  What an awesome little gadget!  We LOVE the Amazon Fire TV Stick!  It's easy to set up and use- it's very cool!", "verified": true, "helpfulness": "0/0", "author": "Deborah R. Blackmarr"}, {"rating": 5.0, "review": "I have had no heat issues, easy to use, and has never frozen using over a couple months. Love the parental controls. If I set a pin they can only watch on amazon video what I allowed with pin each individually even if it was free to watch. Would like to see more companies support their apps with this device. I can side load apps from google play or amazon really easy but they only work if the app support remote control use. and I have to go into app settings to launch but it is a work around till more companies move their butts and support. On amazon part I hope they update and allow your phone to be used as a touch screen like a tracking pad and would help get around app incompatibility issues. The phone app is easy to work and do remember that if you use the voice function you have to go in and clear your previous voice history as they store it online. I have not used cloud picture storage yet. But I prefer not to cloud store my pictures any where.", "verified": true, "helpfulness": "0/0", "author": "Jane Doe \"It's ME\""}, {"rating": 5.0, "review": "Really very nice and with Kindle Prime and Tv I have enjoed watching movies.", "verified": true, "helpfulness": "0/0", "author": "Katherine Broussard"}, {"rating": 1.0, "review": "Wasn't picking up our wifi signal", "verified": true, "helpfulness": "0/0", "author": "ShallyPoo"}, {"rating": 4.0, "review": "Set up was easy. Works great.", "verified": true, "helpfulness": "0/0", "author": "James R. Pratt III"}, {"rating": 5.0, "review": "The best device on the market.", "verified": true, "helpfulness": "0/0", "author": "Frantz gilbert"}, {"rating": 5.0, "review": "Great!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "JLA"}]