[{"rating": 3.0, "review": "If you don't want to purchase prime instant video, the Fire TV Stick isn't a product for you.", "verified": true, "helpfulness": "0/0", "author": "myearsareitchy"}, {"rating": 4.0, "review": "Initially had connectivity issues however they seem to have disappeared. In it's current state it works fine. I am giving it 4 instead of 5 simply because of its interface being less than preferable and it doesn't come preloaded with basic apps like YouTube... but you can dig through the 3rd party YouTube apps and get what you need.", "verified": true, "helpfulness": "0/0", "author": "Joel Richey"}, {"rating": 5.0, "review": "Holy snap! You GOTTA get one of these. We recently moved out 3 y/o son into his own room so he can start sleeping in his own bed. Finally ready! We were going to add another Uverse wireless tv set in there, but we're limited to only 2 wireless devices, so that was out of the question. Then we started using the extra Wii console to play movies from Amazon Instant Video. The quality was TERRIBLE, so I thought that's just how it's going to be. A day later I saw an ad about the Fire TV Stick and decided to give that a shot that way I didn't have to keep coming back into the room and turning off the console an hour later.We received the item like 2 days earlier than expected. It took just a few minutes to setup (I skipped the intro video it came with). Man, the quality of the videos are AMAZING!!!! I'm ready to buy some more just to give to my parents since they don't really like cable anyway. I'll be sure to bring this TV Stick with me where ever we travel. This is probably one of the best things I purchased this year and I've probably already spent close to $10,000 this year. Oops.", "verified": true, "helpfulness": "0/0", "author": "Kevin Lam"}, {"rating": 5.0, "review": "Use it more than cable", "verified": true, "helpfulness": "1/1", "author": "Redsim"}, {"rating": 5.0, "review": "Love the clarity of the picture.  Very easy to use.", "verified": true, "helpfulness": "1/1", "author": "Sue Lichtenberg"}, {"rating": 5.0, "review": "better than apple... always works", "verified": true, "helpfulness": "0/0", "author": "Claus R. Martel \"Claus Martel\""}, {"rating": 5.0, "review": "Saves me $200 a month on my cable bill. We were only watching less than a handful of channels from our cable provider. This allows us to keep up with the few shows we follow (which we would have to DVR anyway so the one day delay doesn't make a difference) and my toddler can still have her Disney shows. I like that we can watch movies and since we are prime members there are many out there for free to watch. Glad we purchased this! Works great with no lag. Easy to use. Couldn't ask for anything better at this time. We had roku and hated it. This is much better.", "verified": true, "helpfulness": "1/1", "author": "Natasha Holcomb \"Love Great Deals\""}, {"rating": 5.0, "review": "Bought two Fire TV--nice; hesitant about getting a little stick. It surprised me!", "verified": true, "helpfulness": "1/1", "author": "Honu"}, {"rating": 5.0, "review": "I was considering purchasing a smart tv but was on the fence about replacing a tv that worked well. Instead, we decided to give the Amazon Fire stick a chance and we are glad we did.I can easily access Amazon Prime videos, listen to music, watch Hulu or Netflix. It comes with a remote so I don't have to use my computer which is nice. I use it more than my chromecast because of this.I wish it came with the voice remote but for the price, it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "skydivegirl24"}, {"rating": 5.0, "review": "Pros: amazing for Netflix (Netflix on my TiVo was terrible); easy to install and operate; sets up in a few minutes; intuitiveCons: none", "verified": true, "helpfulness": "1/1", "author": "New Horizon Academy"}]