[{"rating": 1.0, "review": "Unable to get it to connect to my network. Went back to using my Roku. Technical support  was unable to help, suggesting at the end that it was my internet provider. that may be but for the Roku it isn't a problem, and for no other devices in my house is it an issue. Sorry but I'm not going from Amazons help desk to Comcasts help desk each denying it to be their problem.", "verified": true, "helpfulness": "0/0", "author": "Jeff Doyle"}, {"rating": 5.0, "review": "Very easy to hook up.  Simple to operate.", "verified": true, "helpfulness": "0/0", "author": "Sidney J. Halpern"}, {"rating": 5.0, "review": "Love it so easy to use works great just wish our local internet provider could supply us with reasonable bandwidth.  We have a Chromecast that we were using some but now that we have the Fire stick we only use the chromecast when we need to cast something from the laptop .  And at less than $40 it is a deal", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simple installation.  Amazon Prime Video and Netflix at my fingertips. Love it and recommend it!", "verified": true, "helpfulness": "0/0", "author": "Rose on Camellia"}, {"rating": 4.0, "review": "I love this product, a little hard to navigate at first but after that it was exactly what I expected!", "verified": true, "helpfulness": "0/0", "author": "Candy Nunez"}, {"rating": 5.0, "review": "Perfect...much better than the USB stuff on the market.  Works great!", "verified": true, "helpfulness": "0/0", "author": "Den Demron \"Justaguy\""}, {"rating": 3.0, "review": "I got it for free with a sling tv promotion. It is good for using sling, but for all other media, devices like xbox or playstation work much quicker, with better user navigation.", "verified": true, "helpfulness": "0/0", "author": "Philip"}, {"rating": 5.0, "review": "Lover this!! So easy to install and use!!", "verified": true, "helpfulness": "0/0", "author": "Tami A. Calugi"}, {"rating": 4.0, "review": "Not a bad little streaming device.I mostly use it for streaming Amazon Prime shows and movies.It has a very nice app for Netflix too.", "verified": true, "helpfulness": "0/0", "author": "J Rook \"RooK!\""}, {"rating": 5.0, "review": "WORKS REAL GOOD. I REALLY LIKE IT.", "verified": true, "helpfulness": "0/0", "author": "Gary Weaver"}]