[{"rating": 4.0, "review": "A real bargain. Works great.", "verified": true, "helpfulness": "0/0", "author": "TREN"}, {"rating": 4.0, "review": "EXCELLENT PRODUCT SAVED ME THE COST OF DIRECT TV, AND WITH A BETTER TRUE 1080 HD PICTURE. THE ONLY NEGATIVE IS THE  POWER CORD FROM THE ADAPTER TO THE STICK IS TO SHORT AND THE CORD IS PROPRIETARY, AND AMAZON DOES NOT HAVE A LONGER ONE!", "verified": true, "helpfulness": "0/0", "author": "LITKO"}, {"rating": 4.0, "review": "I purchased this during the $20 promo - why wouldn't you want to try it for such a great price? We got rid of the cable box in the bedroom in anticipation of receiving this and it was such a great decision. It does have limited apps compared to the Roku which we gifted to a family member last Christmas, but maybe Amazon will expand the app selection?? I'll love the music channels to listen to while getting ready without using my phone and wasting the battery. I give 4 stars because the remote is not designed well. I don't get the circular design of the top button, it sometimes clicks the wrong direction if you don't hit it right on the edge of the direction you want. You have to really push hard on the buttons and the feed from the remote to the tv is slow - we've clicked a few times and nothing was received on the tv and then all of the sudden it scrolls uncontrollably to catch up to the amount of times you pressed the button to navigate. The cord to plug into the wall is VERY short so depending on where the tv is located in comparison to the outlet, you may need to use an extension cord. For PRIME folks, it is a must get. For the $20 promo price, it's a nice device to have and it'll save us a few bucks a month without having the extra cable box!", "verified": true, "helpfulness": "0/0", "author": "Vickielacie"}, {"rating": 1.0, "review": "I am very unsatisfied with my Fire TV Stick. I primarily use Netflix and Bloomberg TV, but find myself unable to keep a connection. I have a strong wi-fi connection to the Stick, but it keeps freezing and forcing me back to the network settings. I have other devices in close proximately to this device that are operating with wireless without an issue. When the connectivity problem occurs the device is unable to find any wi-fi in the area (neighbors, etc.). These other wi-fi connections show up when the device is functioning properly, so it leads me to believe the device is faulty and not every router in the neighborhood at the very same instant.To solve the connectivity problem, I find myself \"hard restarting\" the device (hold middle button and Play/Pause) at least once a day to re-connect through the power cycle. It's just a quick to sit through the start-up of an Xbox or Apple TV.A wonderful idea that I thought would be the icing on the cake to convince me to subscribe to Amazon Prime, but I think I am better off without.", "verified": true, "helpfulness": "192/217", "author": "Eric"}, {"rating": 1.0, "review": "IT DOES NOT WORK AS I THOUGHT IT DID ,INFO SAYS Mirror your tablet or phone on your TV , BUT THATS NOT THE CASE FULLY IT HAS TO HAVE INTERNET CONECTION TO EVEN WORK, AND IT USES DATA  .SO IF YOU DONT HAVE WIFI OR INTERNET IT WONT WORK, SO IF YOU WANNA WATCH A TV SHOW OR MOVIE FROM YOUR DEVICE IT HAS TO HOOK UP TO THE INTERNET TO WORK ,CAN NOT GO FROM PHONE TO TV", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very good :).  I'm glad I bought it.  The quality of the materials are good and the materials are of high quality.  WOULD BUY AGAIN! :)", "verified": true, "helpfulness": "0/0", "author": "Steven Chang"}, {"rating": 3.0, "review": "Could be faster and sometimes freezes. Movie archives must be enriched.", "verified": true, "helpfulness": "0/0", "author": "Ali-Ceyda"}, {"rating": 5.0, "review": "I bought two of these sticks because they are so great. It turns any TV with a HDMI and WIFI into a Smart TV. I also have a ChromeCast I hate the fact that with a ChromCast you have to have a device to stream from, this is a self contained device with remote.", "verified": true, "helpfulness": "0/0", "author": "T. Lorenzo \"PennysMom\""}, {"rating": 5.0, "review": "Fire TV Stick did not disappoint - everything functions like expected or better", "verified": true, "helpfulness": "0/0", "author": "Nikolai Gevorkyan"}, {"rating": 5.0, "review": "Absolutely outstanding, after one I went and got three more, the only question I have, will I have aproblem running 4 Sticks at the same time on the same network.... can someone answer that for me.THXLarry Paylor", "verified": true, "helpfulness": "0/0", "author": "Larry Paylor"}]