[{"rating": 2.0, "review": "Unfortunately, I don't think the Fire TV Stick should have been released yet... It is not quite ready for Prime time.  Here are the reasons in my case:1)  The WI-FI does not seem to stay reliably connected.  At least twice now when I have come to use the Fire Stick and I wake it up from sleep, the unit would not connect to my W-FI router.  The only fix was to pull the power, plug it back in, and let it connect.  No other device in my household has a problem with the router and the Fire Stick works once it connects.2)  The remote control has an uncomfortable feel in my hand (too thin and small) It also a 'key bounce' problem when I press a key.  What I mean by key bounce is that, for example, if I press the left or right movement key, it may register that single key press as multiple (2 or 3) key presses.  VERY annoying indeed.  I don't know if the problem is in the Fire Stick or its remote.  I also had a hard time opening the battery compartment of the remote as others have suggested.3)  I purchased and installed PLEX on my Fire Stick.  PLEX was working and when I was navigating selections in the PLEX app, the app suddenly disappeared.  I had to call Amazon and they quickly refunded my PLEX purchase and I had to purchase it app again.4) YouTube app hangs for a short time while playing video.  It does this fairly consistently.5)  The user interface leaves a little to be desired.  As another review suggested it works but it is certainly not intuitive.  Netflix interface is not great either but that is Netflix issue.On the good side, when it plays (Netflix, Amazon Prime) it does that well and picture quality is very good.  The $19 intro price (the reason I wanted to try it) makes it bearable while I wait for hopeful updates that will fix these issues.For now I will use the ROKU 1 that I also just bought and that does not have these odd issues.  I have to say my ROKU experiences have been almost completely positive with the exception of the ROKU 3 that has a very similar Netflix user interface as the one in the Fire Stick.At this point, not counting the interface issues I have with the Netflix, I am disappointed.  I expected better quality from Amazon.", "verified": true, "helpfulness": "0/0", "author": "A. Cohen"}, {"rating": 5.0, "review": "Super easy set up and playback is quick quick!!!  I LIKE IT ALOT!  I have a roku 2 in my son's room and got this for the living room...Amazing!  You've done it again amazon!  Now I need to get one for my bedroom!", "verified": true, "helpfulness": "0/0", "author": "GRn_eyEd_GiRL"}, {"rating": 5.0, "review": "Finally received my new Fire TV Stick. USPS was 5 days later than the posted delivery date. It took about 45 minutes to download the software update (probably because everybody was trying to access the download at once due to the delivery of a new product). Other than that, it was a snap to set up. The packaging was comparable to Apple, i.e. first class.I unhooked my Apple TV and now use the new Fire Stick.  It is easier to use and delivers smoother streaming than the Apple TV.  And, as a Prime member, I get free access to the Amazon movies and tv. It's still new, but my first impression is that this  is a great product and equal or better than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "gprichard"}, {"rating": 5.0, "review": "Easy to set up (except getting the Harmony remote to work with it took a little time). And I now have all my streaming services consolidated in one very inexpensive device. I used to have netflix from one device, pandora from another, and amazon from yet another. This makes everything simple for a low price.", "verified": true, "helpfulness": "0/0", "author": "K. Paris"}, {"rating": 3.0, "review": "Love everything this product does.  Great menu and streaming.  The only complaint I have is that the remote is useless.  I was wondering if anyone else is having trouble using theirs.  It is very unresponsive and when I do get it to select something it continuously keeps rolling and won't stop.  I ended up having to use my smartphone as the remote.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 1.0, "review": "Constantly locks up with a quick flash of \"HDCP Noncompliant\" that forces me to re-push play on my remote. This occurs every 2 to 5 minutes. I love the interface and quality stream, but since it's basically unusable since I need to push play every 2 to 5 minutes, I have to give it one star until it is fixed via firmware. Its just too inconvenient.", "verified": true, "helpfulness": "0/0", "author": "C-DAWG YO"}, {"rating": 5.0, "review": "It arrived yesterday and I got a chance to play with it last night.  It's fast... much faster than my blu ray player for loading videos from the web.  I tried it with several services that I subscribe to and this thing excelled at all of them.  I also love that I can use my smart phone as the remote (you'll need to download the Amazon Fire TV Stick Remote ap).It arrived yesterday and I spent the evening playing with it, installing aps like Netfix and Hulu+.  It streamed the videos fast (via my N wireless router) and they looked great.  I also like that you can play games with it!The only con I have is that doesn't make my coffee in the morning.", "verified": true, "helpfulness": "0/0", "author": "Tone P."}, {"rating": 5.0, "review": "Got it yesterday. Set up was a breeze. A lot of very good content. So far, I've tested Bloomberg TV+, Watch ESPN, CBS News, PBS Videos, Netflix, Hulu Plus, YouTube, Flixster and some other apps. Except for Bloomberg TV+ (in which there was a split second delay between voice and picture), my experience has been excellent.", "verified": true, "helpfulness": "0/0", "author": "S.G."}, {"rating": 3.0, "review": "Got this during the pre-release offer.  It arrived yesterday.  I was up late working with it and checking out what it will do.As with most computer-related items, the software determines the value of the hardware.  The OS on this little stick is very capable and the resolution of the hardware is great.  Much of the options it offers for viewing, are duplicates of what is already available.To be up front, we cut the cable in our home 10 years ago, when broadband came out.Netflix has been on my Wii for several years.PBS is a great little app, as our coverage here with OTA is poor, but the content is limited.Most of the TV Channel apps require a cable subscription, ESPN, Lifetime, NFL, A&E;, etc.Hulu Plus requires a subscription.Even the news programs are tape delayed. CBSN seems to be a good candidate for best of the bunch.Many of the broadcasters are not updating the content frequently.The Miracast function of the Fire Stick is NOT compatible with the Dell Venue 8 Pro running Windows 8.1.  I WAS able to get Miracast running from the Dell on a different stick - (https://amazon.com/gp/product/B00LBON9IE/ref=oh_aui_detailpage_o09_s00?ie=UTF8&psc;=1)Amazon would do well, if they gave this item away to their Prime customers.  It is a GREAT Prime content server.I also LOVE the little remote.", "verified": true, "helpfulness": "0/0", "author": "Pastor Jay"}, {"rating": 1.0, "review": "My TV FireStick worked for two days then button-presses on the remote became intermittent. Shortly thereafter, it would not work at all. Just to be sure, I replaced the batteries. No improvement. I requested a replacement from Amazon but they said they won't be shipping more units until after January 15. They issued a refund and told me to place my order again and discard the one I have. Disappointed.", "verified": true, "helpfulness": "0/0", "author": "azcurt \"Tucsonan\""}]