[{"rating": 5.0, "review": "Works Really good. Easy To install and use. Take it with you anywhere a TV is available. Or you can run on laptop.", "verified": true, "helpfulness": "0/0", "author": "Michael John"}, {"rating": 5.0, "review": "This is fabulous. It was very easy to set up and is easy navigate through. I bought it for my mother and she loves it. I like the portability of it. i have not set up the app for voice on the phone yet. Will check back when I do", "verified": true, "helpfulness": "0/0", "author": "Murph"}, {"rating": 2.0, "review": "As much as I wanted to love this thing (it's so cool, right?), I just don't.  It was awesome the first few months I had it.  I got a great deal on it since I am a Prime member.  However, after awhile, it stopped loading the shows.  On both Prime and Netflix.  It would load the menu then just give up.  I had to switch to a Wi-Fi enabled blu-ray player.  That hasn't given me as many problems as the Fire Stick.  Sorry, Amazon.  I love you, but this one was not so good.", "verified": true, "helpfulness": "1/1", "author": "Caitlin Malk"}, {"rating": 5.0, "review": "thumbs up", "verified": true, "helpfulness": "0/0", "author": "julie hallman"}, {"rating": 3.0, "review": "Perhaps I'm just clueless on this one, but I was expecting to be able to search across all platforms like I can with my Roku. Am I doing something wrong here?When I attempt to search for something, it only searches Amazon Prime content, and not Netflix or Hulu. And yes, I did add the apps and login to them.Aside from that, it's not a bad deal. The picture quality seems to have improved on my television, and the navigation is not bad. I like it. I was just expecting the ability to do a little more than I seem to be able to do with it.", "verified": true, "helpfulness": "1/1", "author": "Charles"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Patience Enwere"}, {"rating": 4.0, "review": "Great value for Prime Members! Access to a great library of Movies, TV shows, Music.& Much more, most of it Free.I have a basic internet speed pkg. and it still struggles very rarely.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was pretty impressed with all the movies and different apps on this product.  It was very easy to install and I had no complications at all.  So far, so good!", "verified": true, "helpfulness": "0/0", "author": "Jocelyn T. Bynum"}, {"rating": 5.0, "review": "my son love this product because he can watch any movie he wants and play games with his friends. everyone should get one for their kids because this is a nice way to keep an eye on your teens, thanks amazon!!!!!", "verified": true, "helpfulness": "0/0", "author": "Carmen ayalapagan"}, {"rating": 4.0, "review": "It freezes a lot but it's still worth having", "verified": true, "helpfulness": "0/0", "author": "Emily Bailey \"Adhe\""}]