[{"rating": 5.0, "review": "can i use the firestick on my laptop with a hdmi port?", "verified": true, "helpfulness": "0/0", "author": "A.  Rachels-Armstrong"}, {"rating": 5.0, "review": "More than met our expectations!", "verified": true, "helpfulness": "0/0", "author": "ALS"}, {"rating": 5.0, "review": "It met my expec", "verified": true, "helpfulness": "0/0", "author": "Iris A. Stadin"}, {"rating": 2.0, "review": "Freezes and keeps buffering. Can't keep up with the game speeds. It's so frustrating watching a live game on fling-using tha Fire stick. Thinking of returning it.", "verified": true, "helpfulness": "0/0", "author": "Milcah Ochieng"}, {"rating": 1.0, "review": "I replaced my xbox one with this, because all I used my xb one for was amazon prime.  This is one of the worst purchases I've made.  I can't watch anything without it buffering every 30 seconds.  The xbox was fine with the same amazon prime membership on the same network.  Also, the 'feature' that duplicates your phone/tablet screen on the tv does not work either; it is lags then disconnects constantly to the point of unusable.Do not buy this if you are a samsung android user or have anything but the absolute best bandwidth on your internet connection (though that may be bad too).  Terrible. Terrible. Terrible.  Total disappointment.... and it just exited out of a program for no reason with 4 minutes remaining.Update, I can stream HD to my laptop and tablet in the same room as the stick at the same time with no problem... this thing is terrible.", "verified": true, "helpfulness": "1/1", "author": "Zachary D. Patitz"}, {"rating": 5.0, "review": "Why do I pay for dish!!  Plenty to watch- works perfectly- not the greatest 4g picture but it is still totally watchable.", "verified": true, "helpfulness": "0/0", "author": "Michael Blake"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Christy L Carpenter"}, {"rating": 5.0, "review": "Love it. Set up was quick and easy. Thinking about purchasing another one to replace my roku", "verified": true, "helpfulness": "0/0", "author": "Adrienne"}, {"rating": 5.0, "review": "Great for watching Prime video and netflix. I bought it when it first came out at half the price. Great for making dumb TVs smart. The interface is slick and responsive. The earlier TVs with smart functions had a clunky interface, which led to accidental movie purchases. This streamlines the process and mistakes are few.I wish the there was a faster way to put it to sleep, like directly in the home menu. Having to dig it up takes a bit of effort.", "verified": true, "helpfulness": "0/0", "author": "franziz"}, {"rating": 5.0, "review": "Love this !!!", "verified": true, "helpfulness": "0/0", "author": "danielle langreder"}]