[{"rating": 4.0, "review": "Works well. Fairly easy to set up. Remote is enigmatic, but once figured out it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Margaret R."}, {"rating": 5.0, "review": "Wow - SO nice for my bedroom TV!", "verified": true, "helpfulness": "0/0", "author": "Julia Charles \"Julie\""}, {"rating": 5.0, "review": "This device is fantastic. I love the interface the most. I have tried Chromecast, but definitely recommend this product instead due to the beautiful interface. If you are having buffering issues:http://support.smartdnsproxy.com/customer/portal/articles/1600122-amazon-fire-tv-dns-setup-for-smart-dns-proxyGo to the link above and follow the simple instructions to configure your network properly. Before I did this fix I would constantly have to buffer HBO GO every 10 seconds. This will absolutely fix that, I have not had any issues since putting in the IP values. The site will tell you exactly the steps you need to take to fix this.", "verified": true, "helpfulness": "0/0", "author": "ML \"ML2\""}, {"rating": 2.0, "review": "Little complicated", "verified": true, "helpfulness": "0/0", "author": "tabatha"}, {"rating": 3.0, "review": "Not as many channels as I hoped. But still a decent alternative to cable.", "verified": true, "helpfulness": "0/0", "author": "Daniel Spyers"}, {"rating": 3.0, "review": "I have only used it once and it seemed to work fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "We love it but it should have come with a more complete manual.  Having to \"buy\" a manual to learn the tricks of the device is really lame.", "verified": true, "helpfulness": "0/0", "author": "Robert C White"}, {"rating": 5.0, "review": "My 3 yr old twins can switch from TV to the fire stick with ease and pick a show... Love it", "verified": true, "helpfulness": "0/0", "author": "cassandra brown"}, {"rating": 5.0, "review": "It should be called amazing fire stick", "verified": true, "helpfulness": "0/0", "author": "Brian"}]