[{"rating": 3.0, "review": "Works good when the Wifi is good at 2.4 Gigahertz.  Not reliable it seems at 5 GHZ wifi lots of buffering, maybe a weak signal.", "verified": true, "helpfulness": "0/0", "author": "Michael E Krueger"}, {"rating": 5.0, "review": "easy-simple and great value for the dollar.", "verified": true, "helpfulness": "0/0", "author": "rob webb"}, {"rating": 5.0, "review": "The Fire stick has been awesome. Easy to use & worth the money!!!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Wilson"}, {"rating": 5.0, "review": "I am totally addicted to this!", "verified": true, "helpfulness": "0/0", "author": "Shree Lafaye Ziller"}, {"rating": 5.0, "review": "Comparing to chromecast, this is way better than chromecast as it is superfast, slim, and sleek. Very good product", "verified": true, "helpfulness": "0/0", "author": "Dino Jameson"}, {"rating": 5.0, "review": "Great multimedia stick. Love it for my prime movies, netflix, prime photos, prime music, etc.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Enjoying it very much 😊😊", "verified": true, "helpfulness": "0/0", "author": "Richard J. Gambino"}, {"rating": 5.0, "review": "Amazing!!! ...#whoneedscableanymore", "verified": true, "helpfulness": "0/0", "author": "Nicole A. Wallman"}, {"rating": 3.0, "review": "I rec'd as a Xmas gift and I have used it a lot.  There is still a somewhat limited selection for me as I am not into cartoons or horror movies/TV shows.  More documentary, history and current TV shows would be wonderful.  Also I was curious about the range of the stick.  My bedroom is on the other side of my living room wall where the wireless router is located.  I find I have to turn my bedroom TV  and pull the router closer in order to get consistent connection.", "verified": true, "helpfulness": "0/0", "author": "Linda R. Gierich"}, {"rating": 5.0, "review": "This is the best! I got a season pass for The Walking Dead Season 5 and watched all of the episodes on my big TV. I discovered what X-ray was when I checked the time on my Fire Phone or my Fire HD 7. X-ray was showing trivia and identifying the performers scene-by-scene. This was well worth the cost and I still plan to purchase the DVDs when they are available. I am a big fan of The Walking Dead, but there is so much more to watch using my Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Marta R. \"Seans Mom\""}]