[{"rating": 5.0, "review": "great gadget", "verified": true, "helpfulness": "0/0", "author": "Jack O'Neal"}, {"rating": 4.0, "review": "I have issues with Hulu Plus on it. It takes a long time to load and freezes frequently where I have to start over from home. Netflix seems to work ok but is not really for someone who likes to watch TV because it's mostly movies. Haven't tried the Amazon Prime yet. The sticks were easy to set up. We bought 2 at the same time. One continues to go haywire and we have to unplug, reboot, and start all over. The other one doesn't have that problem at all. For the price, you get what you pay for. After the initial investment we cut our TV bill from $95.00 to $17.00 a month for both Netflix and Hulu Plus. Worth the value if you don't mind some bugs.", "verified": true, "helpfulness": "0/0", "author": "Donna Paoletti"}, {"rating": 5.0, "review": "Talk about your one-stop shop when it comes to entertainment. You can use Fire Stick for Netflix, Hulu Plus, Showtime Anytime, Pandora, ESPN, games, music and so much more. This is a great buy promising to provide endless hours of entertainment.", "verified": false, "helpfulness": "0/0", "author": "Dabney Struble"}, {"rating": 5.0, "review": "I didn't know had to pay for most of the best apps.", "verified": true, "helpfulness": "0/0", "author": "Elvin M."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Maria J Tapia"}, {"rating": 3.0, "review": "Generally, this is a pretty slick little piece of tech, but I have to knock it down from 5 to 3 stars because when I watch video, either on Netflix or Amazon Prime, it goes black every few minutes for a second or two. Sometimes the video picks up, but other times I have to hit play again as it will act as though I hit the pause button. This makes it really distracting and I've gone back to my PS3 for watching videos. I've tried rebooting the unit and it has had no effect. I tend to think it must be a flaw in the stick as it happens with both services.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "I love this stick. It's beyond easy to use and loads quickly. I enjoy the beautiful scenes that display when in \"sleep mode\".", "verified": true, "helpfulness": "0/0", "author": "Chelsea Robb"}, {"rating": 5.0, "review": "Pretty freaking sweet :-).  The only thing I wish it had was the ability to control my TV volume as well.", "verified": true, "helpfulness": "0/0", "author": "Bob \"Bob\""}, {"rating": 5.0, "review": "If you are already paying for the amazon prime this is a great tool to go along with it. Plus if you are a huge movie collector like i am its a great way to collect without the clutter of hundreds of movies. My mother has the roku stick, first this ones cheaper, and is already hooked up to your account and second, this comes with so much more. go for it", "verified": true, "helpfulness": "0/0", "author": "Jordan M King"}, {"rating": 5.0, "review": "Plug and play, just the way I like it.", "verified": true, "helpfulness": "0/0", "author": "R. Sherwood \"Better Bagel\""}]