[{"rating": 5.0, "review": "this is great, i have used it every night without a single problem", "verified": true, "helpfulness": "0/0", "author": "Richard Collins"}, {"rating": 5.0, "review": "Handy", "verified": true, "helpfulness": "0/0", "author": "Mac user"}, {"rating": 5.0, "review": "awesome tool for my TV's", "verified": true, "helpfulness": "0/0", "author": "God Child \"Faye\""}, {"rating": 5.0, "review": "for the price and its portability make it a great buy!", "verified": true, "helpfulness": "0/0", "author": "Denny Gortari"}, {"rating": 5.0, "review": "Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Darlene Smith"}, {"rating": 5.0, "review": "love this thing...", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 2.0, "review": "I owned a Chromecast but left it behind when I moved, so I decided to try the Fire TV Stick since I already had Prime. Within 24 hours I bought another Chromecast.I couldn't find many free apps that were of any value. Most of the apps were loaded with advertising and delivered little content.Also my Fire TV Stick keeps crashing due to network problems. Granted I don't have a fantastic wireless connection, but everything else I use can cope with my network.I'm hoping in time the Fire TV Stick experience will improve, but as it is I only use it to stream Amazon Instant Video.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Waugh \"lover of puppets\""}, {"rating": 5.0, "review": "Swag", "verified": true, "helpfulness": "0/0", "author": "James bruno"}, {"rating": 5.0, "review": "Woo hoo. I can't believe I missed out on streaming for this long. SInce its my first time with this I decided to try out the stick vs the tv. The stick is definetly the right choice for me. I hate using voice controls (awkward talking to an inanimate object) so I do not need this function. Setting up was literally just pluggin in the little stick. I already have youtube and hulu accounts so I just simply logged myself in and started watching tv. The wait time for each load is not particularly long. I have an older computer for watching videos so the load time is just slightly same or less.", "verified": true, "helpfulness": "0/0", "author": "Bunny"}, {"rating": 5.0, "review": "Love it, makes using the internet on TV so easy", "verified": true, "helpfulness": "0/0", "author": "Rachel Senyitko"}]