[{"rating": 2.0, "review": "Not what I thought it would be.  I think I need a tutor!  Lol", "verified": true, "helpfulness": "0/0", "author": "sharon"}, {"rating": 4.0, "review": "4.5- really quick on HD, great response, fast, good selection and friendly familiar user interface- easy to use. Would be nice if was cordless- constantly plugged in with a wire is an opportunity. Overall, innovative quality product, will recommend.", "verified": true, "helpfulness": "0/0", "author": "Ms Rosered"}, {"rating": 5.0, "review": "A very nice addition to our entertainment options.", "verified": true, "helpfulness": "0/0", "author": "Merlin"}, {"rating": 4.0, "review": "Love this, so easy and convenient. Would have 5 stars if I could download my purchases to my tablet!", "verified": true, "helpfulness": "0/0", "author": "Sharon Miro"}, {"rating": 2.0, "review": "Freezes all the time", "verified": true, "helpfulness": "0/0", "author": "Michael C."}, {"rating": 5.0, "review": "I am a huge apple fan but this is superior than the apple tv I have.  Apple allows you to only watch movies on apple products.  When you buy movies on amazon you can watch them on both apple and pc.  The quality is better for both visual and audio.  The free content is amazing.  I am saying goodbye to apple tv", "verified": true, "helpfulness": "0/0", "author": "Joshua Rothenberg"}, {"rating": 4.0, "review": "Like it, Although sometimes it says signal is bad even think the Wi-Fi is 3 feet away.", "verified": true, "helpfulness": "0/0", "author": "Erikshea"}, {"rating": 5.0, "review": "great product, way better than the roku", "verified": true, "helpfulness": "0/0", "author": "J Jackson"}, {"rating": 5.0, "review": "Amazing !  We as a family have been staying up late on our vacation and watching some of  the most amazing movies.  Plus, the TV series have us hooked and we have watched 14 episodes of the first two seasons of one of our favorites. Thanks to whoever invented this thing.. John Hubble", "verified": true, "helpfulness": "0/0", "author": "John M Hubble"}, {"rating": 5.0, "review": "Work's great, just make sure you have a good internet provide.", "verified": true, "helpfulness": "0/0", "author": "Muneca Patterson"}]