[{"rating": 5.0, "review": "Love iit! Took it on vacation with me so I could binge watch my shows!", "verified": true, "helpfulness": "0/0", "author": "Kelli Miller"}, {"rating": 1.0, "review": "Thought this was wireless but it has to be plugged into TV AND electrical outlet.", "verified": true, "helpfulness": "0/0", "author": "H. Swilley"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "AUSTIN IMES"}, {"rating": 5.0, "review": "Taste good, lol", "verified": true, "helpfulness": "0/0", "author": "Nsboyz \"Duane Dias\""}, {"rating": 1.0, "review": "Laggy slow appleTV is better", "verified": true, "helpfulness": "0/0", "author": "Jayfray"}, {"rating": 3.0, "review": "The functionality is great.  I was anticipating more for free with my Prime account.  I shouldn't be too hard, there are plenty of options to see for free.  I just didn't anticipate the volume of stuff you'd need to pay for.  I was also surprise that the price of a movie is no different than my local cable company.", "verified": true, "helpfulness": "0/0", "author": "Mike \"Just a poster\""}, {"rating": 5.0, "review": "Bought for my GF who doesn't watch a lot of tv.", "verified": true, "helpfulness": "0/0", "author": "Devinnez"}, {"rating": 5.0, "review": "Love it see ya cable. Bought another. These reviews that state they loose connection? Have you noticed that it is on windy days? Well its your wi-fi . its a radio wave. Environmental conditions. Its the way to go the fire stick and run Netflix on it. Its great'", "verified": true, "helpfulness": "0/0", "author": "Carl W."}, {"rating": 5.0, "review": "I showed up later than promised but it works great I would buy it again", "verified": true, "helpfulness": "0/0", "author": "jeff harris"}, {"rating": 3.0, "review": "I want to love it.  Easy enough to set up.  It does a very weird lag thing where the audio continues as normal, but the picture freezes and then rapidly catches up.  I feel bad for anyone who is medicated!! Lol", "verified": true, "helpfulness": "0/0", "author": "MELISSA BAIKIE-RICK"}]