[{"rating": 5.0, "review": "The installation was easy.Customer oriented. The choices are excellent and provide what we are looking for. Thank you for a great product.", "verified": true, "helpfulness": "0/0", "author": "Robert Harper"}, {"rating": 5.0, "review": "Very easy to use.  Best product out there for movie watching", "verified": true, "helpfulness": "0/0", "author": "jim kirkbride"}, {"rating": 2.0, "review": "You need high speed internet for this to work well. Also should know there is more than just plugging it in to work", "verified": true, "helpfulness": "0/0", "author": "Donald Sigler"}, {"rating": 5.0, "review": "I got his for my mom as a gift, and she loves it. I had no idea how many apps it had available. Almost makes me wish I had gotten one of these for myself.", "verified": true, "helpfulness": "0/0", "author": "Don Willi"}, {"rating": 5.0, "review": "Works great! I use this for Netflix, Amazon Prime Instant, and Amazon music. Fast, immediate response, hit one button on remote and you're ready to go - menu easy and quick to navigate. Initial set up was easy as well and it updated automatically to the latest version.", "verified": true, "helpfulness": "0/0", "author": "S. Woosley"}, {"rating": 5.0, "review": "Works great, just as it says.", "verified": true, "helpfulness": "0/0", "author": "Gary B. Severn"}, {"rating": 5.0, "review": "So much easier than using the Kindle HD.", "verified": true, "helpfulness": "0/0", "author": "H. Pittsley"}, {"rating": 3.0, "review": "The apps I prefer and expected, like VUDU, HBO, are not currently supported/available. Better like only what Prime has available, otherwise you may want to wait or consider another product. I also own a Roku 3, and it's great! I am hopeful that the Fire TV will improve on availability of other \"providers.\"", "verified": true, "helpfulness": "0/0", "author": "Rodger Wasson"}, {"rating": 3.0, "review": "I really want to love this. Starting with the fact that my preorder came out way after the black Fridays one. The system is almost always out of sync, voice and pictures match up about 30% of the time. I have checked my setting and connection as fully as I can. I'm running gigabyte internet on a dual band 2.5 and 5 gigahertz, my WiFi is receiving on 2.5 at 100mbps and the 5 GHz ban at 650mbps. I know that the Fire Stick has AC connection, so I really hope its a softwares problem that can be fixted with an update. I also really wish that the apps didn't require two clicks to open. When I click Netflix and Hulu I don't want to be prompted to open the ap that I already clicked to open.", "verified": true, "helpfulness": "0/0", "author": "K. Davies"}, {"rating": 5.0, "review": "How on earth did I live without this?  It was very easy to install, even for one who is a technological idiot.  Thanks so much, Amazon!  To get the most from it, you really need to join Netflix and HuluPlus, especially if you love British series and movies.", "verified": true, "helpfulness": "0/0", "author": "Judith S. Baker"}]