[{"rating": 5.0, "review": "Definitely enjoying it, and yes it's helping me to make the decision to get rid of cable easier.", "verified": true, "helpfulness": "0/0", "author": "terry legrande"}, {"rating": 5.0, "review": "Great item, so many apps to choose from.", "verified": true, "helpfulness": "0/0", "author": "jennie rider"}, {"rating": 5.0, "review": "The fire stick came very quickly and it contained everything I needed to connect my tv to hulu and netflix. I am enjoying it and would recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "Donna Bailey"}, {"rating": 1.0, "review": "Could not get the sound to work on Amazon or Netflix, even though I am a subscriber to both.  After multiple attempts to trouble shoot with Amazon, I returned one and got another with the same problem.  Amazon said it was not compatible with my TV.  Chromecast and Roku work with it so that is what I'm using on my TVs.", "verified": true, "helpfulness": "0/0", "author": "cuartor wynne"}, {"rating": 5.0, "review": "does the trick!", "verified": true, "helpfulness": "0/0", "author": "the old bodger"}, {"rating": 4.0, "review": "Works as advertized.", "verified": true, "helpfulness": "0/0", "author": "Harvey Rudolph"}, {"rating": 5.0, "review": "it did what it said it was going to do it was great", "verified": true, "helpfulness": "0/0", "author": "George Thompson"}, {"rating": 5.0, "review": "Super easy setup......just plug in to your HDMI port and your set! It Navigates through Youtube, Hulu, netflix etc pretty much the same as using Wii or any other gaming system.", "verified": true, "helpfulness": "0/0", "author": "mommyofone"}, {"rating": 5.0, "review": "We got this to try because we had Chromecast but had trouble getting it to work.  It was always freezing up in the middle of a show.  The Fire stick is a lot better!  The remote is easy to use and it doesn't freeze up in the middle of a show.  Great product at a great price!  Love!!!", "verified": true, "helpfulness": "0/0", "author": "Nicole Elizabeth Chandler"}, {"rating": 5.0, "review": "Super", "verified": true, "helpfulness": "0/0", "author": "Wanda I. Velazquez"}]