[{"rating": 1.0, "review": "Do you need internet service.", "verified": false, "helpfulness": "0/1", "author": "Jasmine"}, {"rating": 4.0, "review": "Does exactly what the description reads.", "verified": true, "helpfulness": "0/0", "author": "Bald Wookiee"}, {"rating": 3.0, "review": "Awesome picture quality. Quick and responsive.BUT... it continuously gives you a connectivity error message or it has to buffer forever. Too often. It's a pain in the butt. I can't figure it out, but it seems people on here are having that same problem and it sounds like the firestickTV is just a poor signal receiver. However, I got it for $20, on that intro offer so it doesn't hurt a whole lot. I wouldn't pay $40 for it with all these problems though.", "verified": true, "helpfulness": "1/1", "author": "Brigham \"ghamira\""}, {"rating": 3.0, "review": "When it works it's great. Much faster then Roku stick. Constant WiFi issues though. Doesn't matter if it's 5Ghz or 2.4Ghz fails to connect while everything else works perfectly on WiFi. Solution is to unplug it for couple seconds then it's back to normal for awhile.", "verified": true, "helpfulness": "1/1", "author": "Ronnie W."}, {"rating": 2.0, "review": "So disappointed! Bought this s our second \"fire tv\" in our house. We keep the first and origonal in our room and thought this ones lack of cord would be fantastic in the living room. WRONG. It's advertised on tv with no cord, now it never actualy says cordless, that's where they get you. Do ou see a cord when they lug it in on the commercial? Nope. How about in the advertised picture? Nope, not there either. But hey, imagine our surprise when we open the box and BAM a cord. Seems sily that it would be a big deal but now we have this thick ugly black cord hanging from our tv against my very beautiful wall. Whatever amazon...The product itself is subpar. We constantly have to reset it. I'm way too lazy to send it back or it'd be gone.", "verified": true, "helpfulness": "1/3", "author": "Amber"}, {"rating": 2.0, "review": "Really annoying beeps w/lags on video streaming.", "verified": true, "helpfulness": "1/1", "author": "sby"}, {"rating": 4.0, "review": "It's great...", "verified": true, "helpfulness": "0/1", "author": "Bradley Carson"}, {"rating": 5.0, "review": "Thank you", "verified": true, "helpfulness": "0/1", "author": "Martino"}, {"rating": 5.0, "review": "Easy to use and simple setup", "verified": true, "helpfulness": "0/1", "author": "Diana McDaniel"}, {"rating": 5.0, "review": "Best media player stick in the market. I don't know how they do it but Amazon Prime contents plays instantly.A must for Amazon Prime member", "verified": true, "helpfulness": "2/2", "author": "jimbo"}]