[{"rating": 5.0, "review": "Very easy to set up and use. Extremely pleased with the product.", "verified": true, "helpfulness": "0/0", "author": "Gary P. Williams \"gpw\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Daniel Cotten"}, {"rating": 1.0, "review": "Disappointed with it not having contract with Directv", "verified": true, "helpfulness": "1/2", "author": "Mark Breen"}, {"rating": 4.0, "review": "Hoping mine is just defective. I have this and a Chromecast. The fire stick stutters a lot. I have it right next to my router and it gets 14Mbs, so I don't think its the wireless. My phone streams Hulu without issue and its several feet further Away. I have seen some forums with some other people having the same issue. All the YouTube removes shoe the remote works smooth and responsive. Mine will pause for minutes, more often then not, between the response. I think the remote is Bluetooth, so within the distance I am  using the remote it should work fine. I would give it 5 stars if I know for sure it was defective and not just a design issue.", "verified": true, "helpfulness": "0/0", "author": "jspfunk"}, {"rating": 3.0, "review": "Actually, I had high hopes for the Fire Stick, but have ended up being disappointed. It was not clear when purchasing the device that you had to have TV service to get and watch History Channel shows (which was the primary reason I purchased the unit) and also that I cannot “fling” what I am doing on my tablet to the TV screen without the latest version of Android. Sure wish that had all been explained… in any case, it really does not do what I expected and in the end I really did not need to spend the money on this.", "verified": true, "helpfulness": "0/0", "author": "Grant J."}, {"rating": 5.0, "review": "First, let me tell you... you have to plug in the fire stick. As in, you have to plug it in to an outlet for it to get power. Somehow, when I purchased this, I thought it just plugged in like a thumb drive and that was it. The cord to plug it in is included, but very short. I nearly had a melt-down trying to figure out how to get that tiny cord down to the almost-floor-height receptacles. Then, I remembered it's a modern TV and has a stupid plug in the back of the TV. I have never felt so stupid. So, let's hope I just saved you a melt down. IT PLUGS IN. YOUR TV HAS AN OUTLET. IT'S ALL GOOD.Now, on to the workings. We have a \"box\" already, so the working isn't new. It seems, to me, to work just as fast as the box we had on another TV. It doesn't have the \"voice recognition\" component, but I never use it anyway, so I'm not missing it. Super easy to search, easy to link my existing Netflix account, and away we went. I've already caught up on a season of Grimm and am about to start in on some episodes of Castle.I truly love this, as there are no commercials.One thing I have noticed is that our local internet speeds pretty much stink at times. And, when it's draggy, the stick may get draggy as well, especially if I'm surfing the 'net on another device (ex: my laptop). But, that is NOT the Stick's fault. That's Century Link's fault. Just wanted to give you a head's up.", "verified": true, "helpfulness": "0/0", "author": "J. Burnett"}, {"rating": 5.0, "review": "Easy to install", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love that I can use my cellphone as the remote!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It would be nice to have voice support instead of needing the mobile app. A good YouTube app would be nice, too. Other than those 2 things, I love it! So nice to watch WatchESPN and Flixster and Amazon Prime videos (no Amazon Prime on my Chromecast or Tivo). I took it on vacation with me and had no issues using it at other homes.", "verified": true, "helpfulness": "0/0", "author": "YoYo"}, {"rating": 5.0, "review": "Since receiving the fire stick I've watched 2 movies, an entire season of 1 program and added a bunch of movies to my wish list.", "verified": true, "helpfulness": "0/0", "author": "Debra A. Karniol \"Deb\""}]