[{"rating": 2.0, "review": "Not real impressed with this item, it won't stay connected to WiFi.", "verified": true, "helpfulness": "1/1", "author": "M. Alexander"}, {"rating": 3.0, "review": "Easy navigation. Problems:  Very hard to get remote open to put batteries in.  Cannot leave power on to stick as it interferes with the digital TV signal for over the air channels.", "verified": true, "helpfulness": "0/0", "author": "James Coggeshall"}, {"rating": 5.0, "review": "I bought this when it came out at the introductory price and waited because it was back ordered. I had almost forgotten about it and then it was here. Very simple to hook up (you do need to plug it in) and it was already signed in to my Amazon.com account. It works great, the picture quality is super and it works seamlessly with my prime account. Easy to access Netflix, YouTube and all the other services /apps. The remote is a nice addition and it works very well despite looking so simple. I would highly recommend the fire stick to anyone.", "verified": true, "helpfulness": "0/0", "author": "c smith"}, {"rating": 3.0, "review": "The device itself is friendly with an easy to navigate interface. What is disappointing is the amount of Apps available for Fire TV.  If Amazon and the major TV networks can't reach an agreement to include their Apps, I don't believe this technology will last long.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "The Fire Stick has performed as advertised. I am enjoying Prime programming on my TV as well as my Kindle.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Was very easy to setup and connect.  The only difficulty was getting it from behind some wires so that it could get a clear signal.  Since then works well. Wish we had a few more movies to pick from.", "verified": true, "helpfulness": "0/0", "author": "The Bear \"Tommy L Waldrop\""}, {"rating": 2.0, "review": "Totally not worth it.", "verified": true, "helpfulness": "0/0", "author": "Paul A. Steward Jr."}, {"rating": 4.0, "review": "Getting into each app was more difficult using the on-screen log in then setting up the Fire Stick. Save yourself frustration and log-in with your computer.", "verified": true, "helpfulness": "0/0", "author": "potterygirl"}, {"rating": 3.0, "review": "Was not aware to have a powered USB adapter plugged into it. Kind of takes the portability out of it.", "verified": true, "helpfulness": "0/0", "author": "Tony Salmon"}, {"rating": 4.0, "review": "Great value! It adds so much to our entertainment selection.  We have binged watch a huge variety of shows and makes Prime a much better value.  My only negative is that it sometimes loses Wifi connections and takes awhile to reload.", "verified": true, "helpfulness": "0/0", "author": "Amber Bren"}]