[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kunal Patel"}, {"rating": 1.0, "review": "For some reason it needs to be within 5 feet of the WiFi router to be of any use, couldn't get it to authenticate to the signal that it considers \"good\" until I moved the router within said 5 feet and got a \"very good\" signal. It occasionally losses connection to the network and I have to do the whole authentication dance again, getting the signal up to a \"very good\" before it will authenticate. I don't know why it just hangs forever attempting to authenticate with anything less than a \"very good\" network, but it does and it requires some drastic proximity to get a network to \"very good.\"I've now worked out a trick where I have the wireless hot-spot on my phone setup with the same password and SSID as my router, I'll get the phone close enough to provide a \"very good\" signal, have the Fire TV Stick auth to my phone and then I pull the hot-spot out from under it and it somehow has no problem switching back to the router. All in all, it's a very odd problem and I haven't been able to rule out the hardware or the software as the source.Even at another house (where I took it to play the excellent Fibbage with friends) getting the damn thing to authenticate to the network was absurd and I ended up playing 5 feet from the device so that my phone could provide WiFi for it to connect with (didn't want to bother faking out the authentication for their router.)The only content that you're really getting here over a chromecast (which works fine for me in the same place) is Amazon video. If Amazon ever provides a means to get Amazon video on chromecast, I'll happily stop using the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Darthyoshiboy \"darthyoshi\""}, {"rating": 5.0, "review": "Yes.........", "verified": true, "helpfulness": "0/0", "author": "Kevin Joseph Martin"}, {"rating": 5.0, "review": "I love it, but I am disappointed that so many of the older movies have to be rented.", "verified": true, "helpfulness": "0/0", "author": "nancy lester"}, {"rating": 5.0, "review": "Best $40.00 bucks I ever spent.Love it.", "verified": true, "helpfulness": "0/0", "author": "C. Ramsay"}, {"rating": 5.0, "review": "Beyond my expectations!", "verified": true, "helpfulness": "0/0", "author": "Alexis"}, {"rating": 5.0, "review": "I love it.  I like watching everything on a TV screen.", "verified": true, "helpfulness": "0/0", "author": "Mary Zimowski"}, {"rating": 1.0, "review": "I was happy about the price, but we constantly have to unplug it to be able to watch movies. I hope they make improvements.", "verified": true, "helpfulness": "0/0", "author": "Kathy Nipp"}, {"rating": 3.0, "review": "Nice access to prime instant video but the interface is really unnecessarily complicated and disjointed.", "verified": true, "helpfulness": "0/0", "author": "Harry"}, {"rating": 5.0, "review": "Love it! I have it in my daughter's room and she watches movies & play games.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Rogers"}]