[{"rating": 5.0, "review": "i can honestly say i have no complaints it streams fast no loading easy setup price point was good  i love it", "verified": true, "helpfulness": "0/0", "author": "brookhock"}, {"rating": 5.0, "review": "This is my best purchase yet", "verified": true, "helpfulness": "0/0", "author": "Jaimie"}, {"rating": 5.0, "review": "Fabulous", "verified": true, "helpfulness": "0/0", "author": "laura shimmell"}, {"rating": 4.0, "review": "the content is good for amazon prime members but for other applications such as netflix is ​​not as fluid", "verified": true, "helpfulness": "0/0", "author": "DIEGO ORTIZ"}, {"rating": 4.0, "review": "I am completely satisfied with the quality and usability of the Fire Stick! We recently got rid of DirectTV and will not go back! The ability to choose programs that are commercial-free is priceless!The only cons are....... 1) tiny remote, easy to lose & 2) if the remote is accidentally touched, it will stop or change the show.The Fire Stick phone app is amazing! However,  For future upgrades, I would suggest a lanyard attachment for ease of storing or locating!!??", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is an excellent invention for those who don't use game boy consoles or buy a HDM cord to connect from laptop/internet to tv disabling your use of the laptop. Shipping was fast. Would purchase amazon products again.", "verified": true, "helpfulness": "0/0", "author": "sunnylouis"}, {"rating": 4.0, "review": "Easy set up and easy operation. I hope to expand on it's usage in the future but for now enjoying prime tv and pandora!", "verified": true, "helpfulness": "0/0", "author": "Marie"}, {"rating": 2.0, "review": "The Fire stick requires a clunky power supply to make it work.  Part of the point of a stick is to simplify and eliminate the power supply...no where is this detail indicated in the product description or features - until you open the box after purchase.", "verified": true, "helpfulness": "0/1", "author": "Moxee"}, {"rating": 5.0, "review": "Love it. Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Liz Churchill"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Tomas"}]