[{"rating": 5.0, "review": "User friendly and great picture.  Excellent product and a good price.", "verified": true, "helpfulness": "0/1", "author": "Kristen"}, {"rating": 5.0, "review": "C", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was one of the early adopters of the stick.  I've waited a while to write my review of the stick.  I had mixed feelings at first because the \"as shipped\" configuration needed a lengthy update to get up and running.  This suggested to me that the hardware was rushed before the software was finalized.  I now have many months with the Fire TV and can say that what it does it does extremely well.  The free Plex app makes it quite versatile.  Prime works and works well.  While my Roku has significantly more features, this fire stick is extremely portable so it's ideal for travel.  The iOS fire TV app allows me to use my iPhone or iPad as the remote so all I need is the HDMI stick and its wall wart. The included remote stays home.  With Plex and Prime video I am never at a loss for entertainment when I'm on the road or visiting family.  One very minor con is it gets kind of hot when plugged in.", "verified": true, "helpfulness": "0/1", "author": "M. Diaz \"Magician\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "jennifer bass"}, {"rating": 5.0, "review": "!!! Cut The Cord !!, I have 2 Fire sticks 2 Fire Tvs 1 HD antenna and Kodi....", "verified": true, "helpfulness": "0/1", "author": "luz"}, {"rating": 3.0, "review": "I have a play station 3, a roku stick, a roku 3 and an Amazon fire stick. The Amazon fire stick is the only one that I tend to have trouble streaming TV shows with. The picture will freeze while the audio continues to play. I have had my internet provider come out to make sure that there are no connection problems (and there aren't) so I'm thinking that it is issues with this stick.  That's too bad.", "verified": true, "helpfulness": "0/1", "author": "Katie W"}, {"rating": 4.0, "review": "Easy to use!!!  Love that it has a lot of options on it from Hulu to Sling TV.", "verified": true, "helpfulness": "0/1", "author": "bob iversen"}, {"rating": 4.0, "review": "I'm sure there's not much I can say that hasn't already been said. It's speedy, nice interface, good selection of apps. Plays flawlessly. One app I would like to see is Vudu, because we own a lot of Vudu videos. I emailed Vudu about this and they said they will not be in Amazon AppStore because it's a competitor. I don't see how then Vudu is on Play and iTunes, considering both are video competitors. At any rate, that's my one missing app complaint. I can still acces my Vudu library from Flixster so not a deal breaker. I've deducted one star because this \"8 GB\" storage stick only actually has about 5 GB available. Which is enough for streaming video apps and services, but not so much to add games. Especially larger games. I suppose one should get the Fire TV if you want more than a few small games. Being I own Android tablets I should have been prepared for the less internal storage, but I guess I thought the Stick storage was different. I was wrong.", "verified": true, "helpfulness": "1/2", "author": "Jo Sherrill"}, {"rating": 4.0, "review": "it's a new way to watch TV still getting used to it.. There are a few of my favorite shows I have not found yet or I find them and I have to buy them separately from Netflix or Hulu??? As soon as I get it all figured out I will be canceling cable!!", "verified": true, "helpfulness": "0/1", "author": "MooMoo \"MooMoo\""}, {"rating": 2.0, "review": "I have a horrible time pulling anything in from the internet. It always locks up and buffers for ages.", "verified": false, "helpfulness": "2/3", "author": "Donna Trotter"}]