[{"rating": 5.0, "review": "The amazon fire stick is the greatest thing, very easy to install. An the best part is we got amazon video back on our tv. Recommend this product to any one who loves amazon an does not have it installed on their smart-tv.", "verified": true, "helpfulness": "0/1", "author": "Thomas Hiday \"HIDAYROZE\""}, {"rating": 4.0, "review": "Wish there was more flexibility with how the hdmi stick attaches, perhaps rotation could be added. Quality product, works as expected.", "verified": true, "helpfulness": "0/1", "author": "Patrick Connors"}, {"rating": 2.0, "review": "Despite having high speed internet we've still had lots of connection issues. And it would be nice to have more content.", "verified": true, "helpfulness": "1/1", "author": "ginnywa"}, {"rating": 5.0, "review": "Waaaaay better than I expected it to be. We actually replaced our Apple TV with the Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "ecavala931"}, {"rating": 4.0, "review": "Like it very much!", "verified": true, "helpfulness": "0/1", "author": "luis"}, {"rating": 4.0, "review": "The only problem I'm having is I can't use voice search for other apps like Netflix it's a large bummer hopefully they will fix it later", "verified": true, "helpfulness": "0/2", "author": "Justin Walsh"}, {"rating": 5.0, "review": "Very easy to install except opening the remote to insert the battery almost impossible.  A bad design...", "verified": true, "helpfulness": "1/2", "author": "Barbara"}, {"rating": 5.0, "review": "So easy to use and I will always have something to watch! Thank you Amazon!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love it! I can see movies I've missed and there's always something on.", "verified": true, "helpfulness": "0/1", "author": "Carolyn Lifland \"cpeaches\""}, {"rating": 5.0, "review": "This is perfect. Bought a large, expensive flat screen right before they came out with Smart TVs. This resolved that problem and has made our life easier.", "verified": true, "helpfulness": "1/2", "author": "Mil C"}]