[{"rating": 2.0, "review": "1 star -8 Dec 2015, afternoonhttp://www.amazon.com/forum/kindle/ref=cm_cd_fp_ef_tft_tp?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdThread;=Tx2CDOG0K31UBSBThis thing is GARBAGE.  Guess this is what I get for being an early adopter.  Nice in theory, executed poorly.  I can't believe they shipped these out.  It will not stay on the network, disrupts my wireless network, then forgets how to connect to my wireless network.  The remote will sometimes stop responding (or the unit stops responding to the remote), and then it stacks up all the \"commands\" the remote was issued and executes them once it does start responding.You will likely be forced to use the HDMI extension, if you don't it gets even worse. I have an LG 46\" LED TV and without the extension, my network basically blew up and puked on itself because of the Stick.  I think it should be called Amazon Fire STUCK.Update - 2 Stars, 8 Dec 2015, 930pm: called tech support.  Was transferred to a second tech person.  I could barely understand anything they said.  It wasn't the light accent they had, but the really poor audio quality.  I tried to ask them to speak up and clearly but I always got a \"Uh huh, okay\" to that request.  She had me move the device from my port 4 on the TV to port 2 and remove the extender cable.  I still didn't have an internet connection (and I had powered it off at least three times).  Next, she had me go into Settings, System and check for a software update.  Checking for software update is not there, I told her this and she sounded confused - obviously reading from a script.  It was under settings-->system--> about.  I had no updates available and told her this. I told her the \"last checked\" was todays date.  She said \"well, I guess that solved our problem\".  Wait...what? No, I told her the last update date was Nov 10 and would be happy to read her my version number. This fell on deaf ears.  The unit did start to work though.  I don't have an answer as to what was going on or why it wasn't working for the last two days.  She did have me press the back+right movement button (She didn't tell me if it was supposed to be at the same time or one after another even after asking).  I pressed them at the same time and held it.  I'll call it the Amazon Two Finger Salute because after doing that, it started to work.My ping times are not super, but definitely not as bad as they were when I first started this out.  I will continue to update as I use the device.", "verified": true, "helpfulness": "1/3", "author": "P. Cahill"}, {"rating": 5.0, "review": "Will be ordering 2 more. Still love the Chromecast, but this is slowly becoming #1.", "verified": true, "helpfulness": "0/0", "author": "Scott Graves"}, {"rating": 4.0, "review": "good product...no power off feature...if u overuse it and it freezes...u have to unplug device...a power off button would be nicer...............also controls are too senistive", "verified": false, "helpfulness": "0/0", "author": "shanti dewan"}, {"rating": 3.0, "review": "Reasonable for my needs.", "verified": false, "helpfulness": "0/0", "author": "kaly   karusala"}, {"rating": 5.0, "review": "Worked well for the first week. After the honeymoon period was over the hang issues started. The stick will occasionally hang while the Netflix app is running and it keeps logging out of netflix (I am fed up of signing in again and again). Not sure if it is a problem with the Netflix app or the fire stick.Edit: The issue went away after power cycling the stick. Have been using it for almost 3 months now and it works well. Not had the issue again.My only complaint with the device is that there is no easy way to put the device to sleep. You have to go to settings every time. A sleep button would have been great.", "verified": true, "helpfulness": "0/0", "author": "Ashish"}, {"rating": 5.0, "review": "I would say out of the entire year, this by far was probably my favorite purchase!  Set up was easy and it's SO easy to use and it's just great!  I love it and I definitely would recommend this device!", "verified": true, "helpfulness": "0/0", "author": "Jason Fonville"}, {"rating": 5.0, "review": "Works great. Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "David B."}, {"rating": 5.0, "review": "A great lil stick. Portable and responsive.The TV USB, at least mine, causes it to response noticeably slower. Using the wall plug gives it speed.Allcast is compatible, via my Note 3, which was a major selling point for me.The streaming is great, though I suspect it’s coming  in at 720 but it doesn’t make that large of difference for me.I’m glad with this purchase. The Chromecast gives me the ability cast a chrome tab to it. I wish the TV stick could do this but its ability to cast from my Note 3 compensates. I’ll keep the Chromecast but I mostly use the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Paul S."}, {"rating": 5.0, "review": "We have now purchased three of these. Two for our house and one for our daughter and son-in-law. Love the ability to watch Prime without the buffering issues that our cable company had!", "verified": true, "helpfulness": "0/0", "author": "Lori Loves Books! \"Books I Love!\""}, {"rating": 1.0, "review": "first of all i pre ordered this unite in Oct. received 3 days ago wright out of the box  it had problems. scrolling apps would not go to next app in line, would jump 2-3 apps or jump to the end. some apps had video no sound.games with remote hard to control clunky. while watching netflix the picture would jerk and finally fire TV crashed no apps just side bar booted the unite and that did not fix it so the next day i did a factory resit still has problems. called customer service not much help so now returning the unite back to amazon. it is kinda sad i have 2 roku and 1 roku stick in the the house and none of them have given me grief as the fire TV in fact i ordered another roku stick to replace fire TV", "verified": true, "helpfulness": "5/6", "author": "phperdue"}]