[{"rating": 3.0, "review": "I have a love hate relationship with this device. It works. If you can get the battery cover off to put the batteries in. I'll hate having to replace them. The battery cover does not slide off easily! It took me longer to put batteries in than to set it up.", "verified": true, "helpfulness": "0/0", "author": "jlehr"}, {"rating": 4.0, "review": "Really liked the Fire TV Stick. Easy to use and took only minutes to install. I wish it would turn off without me having to unplug each time after use.  I also gave it 4 stars because it freezes from time to time. Only way to make it work again is to unplug and plug.", "verified": true, "helpfulness": "0/0", "author": "amazonjunkie \"amazonjunkie\""}, {"rating": 4.0, "review": "not bad, on some shows there is a lag.....in viewing , it stops then starts again ,", "verified": true, "helpfulness": "0/0", "author": "Gwen"}, {"rating": 5.0, "review": "Love love love it!", "verified": true, "helpfulness": "0/0", "author": "djkathy"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Peter L. Haffner"}, {"rating": 4.0, "review": "I give the Fire TV Stick 4.5 stars so far but I'm certain my rating will change to 5 stars.  I just haven't owned the Fire Stick for long enough (or used it enough) to feel comfortable with a 5-star rating.  I was a little nervous at first with the setup (it took a minute for the television to acknowledge the correct HD port, turning the television off helped a lot) and then it took another minute to boot the Fire Stick.  Once those issues were overcome, set up was easy and intuitive.  The video guy was helpful, but a little corny.  Streaming is a little slow at times, but that has more to do with my wi-fi service/bandwith than with the Fire TV Stick.  When I'm home alone, and have the wi-fi all to myself, streaming is just fine!  My husband finds the remote to be a little small, but I didn't buy it for his big hands and the remote is fine for me!  I may tell him to download the app in order use his phone as the remote, (which I enjoy doing as well) but only after I've watched my programs.  Great job Amazon!  I can't wait to bump my rating up to 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Netflix, Amazon Prime, Flixster, all on my tv. Great, easy to install.", "verified": true, "helpfulness": "0/0", "author": "FredZ"}, {"rating": 5.0, "review": "At first I wasn't sure if I would use this, but I bought one, Now I LOVE IT. Whenever I travel on vacation or business, I bring it and plug it in to the tv- bam - instant on demand (with my Netflix and Prime account) and no heavy hotel fees. I also use it instead of my DVR on my home tv because the remote control is easier to use than the cable tv one for video watching. For guest room, it is great because I have no cable box in there. This stick uses my wireless Internet to stream tv and movies from Netflix for the guest tv.", "verified": true, "helpfulness": "0/0", "author": "Evil coco bean"}, {"rating": 5.0, "review": "works great but not a lot different from a ROKU.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Ricks"}, {"rating": 5.0, "review": "I'm very happy will order again", "verified": true, "helpfulness": "0/0", "author": "ganny"}]