[{"rating": 5.0, "review": "I got this product on sale before it's release for about twenty dollars and it was the best thing I ever bought. I had prime for over a year but it wasn't till I got the fire stick that I started watching the videos on my TV. It's super easy to plug in and use and I love it love it LOVE IT.  I recommend this product highly.", "verified": true, "helpfulness": "0/0", "author": "A Romance Junkie \"Mady\""}, {"rating": 2.0, "review": "I'm severely disappointed in this product.  I would have expected this product to be able to play my local files already being served by a DLNA server.  The only way you can do it is to buy a $5 app from them AND put yet another media server on my network.  Without this, this just duplicates the functionality of the TiVo that I already have.", "verified": true, "helpfulness": "0/0", "author": "Dave Doyle"}, {"rating": 1.0, "review": "It keeps disconnecting from my WiFi although all of my other internet enable devices are working.  Very frustrating...", "verified": true, "helpfulness": "1/1", "author": "Tom"}, {"rating": 5.0, "review": "Simple to use. I plugged it in and was watching Amazon Prime in less than five minutes. Great way to watch Prime Video!", "verified": true, "helpfulness": "0/0", "author": "david c"}, {"rating": 1.0, "review": "Limited apps, and UI is sluggish", "verified": false, "helpfulness": "0/0", "author": "sheetal"}, {"rating": 5.0, "review": "Firestorm was easy to install and worked perfectly right away.It was easy to access Netflix and Amazon Prime videos and watch them on my TV set- Much better than on my computer monitor", "verified": true, "helpfulness": "0/0", "author": "Michael Mciver"}, {"rating": 3.0, "review": "Bought this thinking it would be nice to be able to watch Showtime in another room but it doesn't work because of Comcast I guess.", "verified": true, "helpfulness": "0/0", "author": "Stacey Bossler"}, {"rating": 3.0, "review": "Still haven't figured out how to use this !", "verified": true, "helpfulness": "0/0", "author": "Liz morales"}, {"rating": 5.0, "review": "We really enjoy the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Cleve Robinson"}, {"rating": 5.0, "review": "Really nice gadget. It was an ideal Christmas gift to receive.", "verified": true, "helpfulness": "0/0", "author": "John P. Mauffray, Jr."}]