[{"rating": 5.0, "review": "I have two Fire TV Sticks. First one was initially a big headache to set up in a TV located in a built-in concrete stand (wireless connectivity issues?) but once we moved our router from floor to a desk it worked very well. However, our second stick took just less than 5 minutes to set up and worked perfectly from the start. It's easy to switch between the Fire Stick and Chromecast if needed but we plan to transition to Fire Stick for Netflix so we don't have to switch between the two. If you have Amazon Prime and/or like to rent digital movies then this Fire TV Stick is wonderful. Easy search feature and Watchlist feature makes it easy to save titles for later viewing. We are enjoying the Amazon original pilots in addition to our extensive watch list.", "verified": true, "helpfulness": "1/1", "author": "MG"}, {"rating": 3.0, "review": "The battery cover was nearly impossible to remove. Had to take it to local hardware store to get help with it.  Has to be made easier", "verified": true, "helpfulness": "0/0", "author": "S. Winkler"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "1/1", "author": "Saundra K."}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "1/1", "author": "jeff aiken"}, {"rating": 3.0, "review": "Fire TV Stick works fine and is easy to set up. Purchased to watch Prime shows. Seems like most are very old or B grade movies. Many times you are referred to purchase or rent on Amazon because desired content is not rated PRIME. Can't make the iPhone 6+ app connect/pair with the Stick and can't find a good source for assistance.", "verified": true, "helpfulness": "0/0", "author": "David L. Ellis \"Dellis80134\""}, {"rating": 5.0, "review": "Love Amazon Prime, Fire stick loads right up, connected to WiFi with no problems. Second one I bought for another TV.", "verified": true, "helpfulness": "1/1", "author": "John R Foglia"}, {"rating": 5.0, "review": "pretty amazing device, specially for the 20 bucks I paid.I was able to side load kodi on it too and that ran reasonably well, a bit underpowered for HD but mostly ok otherwise for 720p", "verified": true, "helpfulness": "0/0", "author": "Joseph Fountain \"bobo\""}, {"rating": 5.0, "review": "easy to hook up and more games and movies  for the grandchildren.  Life is good.", "verified": true, "helpfulness": "0/0", "author": "john crank"}, {"rating": 5.0, "review": "Awesome product!!", "verified": true, "helpfulness": "1/1", "author": "George Garland"}, {"rating": 5.0, "review": "Once I got it setup, I really like it. Setup was frustrating because of entry of email and password and no correction button. Love the use of it once it was understood. I would really recommend that people purchase the voice controlled remote.", "verified": true, "helpfulness": "0/0", "author": "LadyJane"}]