[{"rating": 5.0, "review": "This device does everything that it says it will do. I set it up in minutes and am thoroughly enjoying the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Vicki F. Pinson"}, {"rating": 3.0, "review": "it was not what I expected; not easy to turn off and on nor to navigate.", "verified": true, "helpfulness": "0/0", "author": "mona inati"}, {"rating": 5.0, "review": "Does exactly what you want it to do.  Streams Netflix, Amazon Prime and more!  So easy to set up.  A lot of people are complaining that it needs to be plugged into a power source to work, and while it's true, I don't think that's a huge issue.  I have power strips near every TV in my house since the TVs, blue-ray players, and cable boxes all have to be plugged in anyways.  Overall, great product for a great price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I returned because i have to pay for everything i want to see", "verified": true, "helpfulness": "0/1", "author": "Surami Pulido"}, {"rating": 5.0, "review": "I love the Fire stick! It's perfect!", "verified": true, "helpfulness": "0/0", "author": "Margarita Sandoval"}, {"rating": 5.0, "review": "Great Product, easy to setup!", "verified": true, "helpfulness": "0/0", "author": "Shalyon"}, {"rating": 3.0, "review": "Drops the signal folio much", "verified": true, "helpfulness": "0/0", "author": "kevin powdrill"}, {"rating": 1.0, "review": "The Fire Stick is not particularly intuitive, takes a long time to get to the selection you want, doesn't do much the computer can't do except without a cable.But the worst was when my one-click Amazon setting did not apply when purchasing via the Fire Stick - it defaulted to a gift card I did NOT want to use.  Customer service advised \"It's not currently possible to pay for digital orders with a credit or debit card when there are promotional or gift card funds available in your account. I’m sorry for any inconvenience this causes. \"When I called to speak with a customer service rep - after my email was answered promptly - I was told the same thing : they can't do it my way, they have to do it their way.  The customer service person took a long time to decide they could refund on the gift card; when he couldn't make it work to use my debit card, he decided maybe he could 'comp' me this one time.  But then he didn't.I waited too long to return the Fire Stick, which was entirely my error.  I would not recommend buying the Fire Stick (or, because of my experience, anything else electronic from Amazon) because of the poor quality, the lack of support, and the bad customer service..", "verified": true, "helpfulness": "0/1", "author": "Atlantanne"}, {"rating": 4.0, "review": "Good experience.", "verified": true, "helpfulness": "0/0", "author": "Simon L. Montes"}, {"rating": 5.0, "review": "My friend love the fire stick she wants another one so thank you", "verified": true, "helpfulness": "0/0", "author": "wilson staten"}]