[{"rating": 5.0, "review": "The only downside is that I don't have enough input ports on my home theater to accommodate another source. So we need to listen to sound from the TV speakers. Wonderfully easy to use with a great selection of video and music titles.", "verified": true, "helpfulness": "0/0", "author": "Sidney D Johnson"}, {"rating": 5.0, "review": "I purchased two of these sticks. Shipping and set up was very easy! I purchased one for my children's room and one for mine. I initially had problems with freezing in my children's rooms which was very odd to me because that room is closest to the router. I also had intermittent freezing in another room further from the router.  I updated my router (which I had since 2007) and since then we have not had any problems. I have had this stick for less than a week, but so far so good.", "verified": true, "helpfulness": "0/0", "author": "S. Daily"}, {"rating": 5.0, "review": "Initially had issues getting this to work.  After downloading the user manual, I reset my wi-fi router.  After doing so, I got a connection.  Other than having some wi-fi internet speed issues (provider/carrier issues), I am able to stream movies no problem.  Like this little device, and I can see where it will save me money later.", "verified": true, "helpfulness": "0/0", "author": "BeneDee \"Wine Country Joe\""}, {"rating": 5.0, "review": "Worked great. I had to use the HDMI cable extension in order to get a strong signal.", "verified": true, "helpfulness": "0/0", "author": "brownstone47"}, {"rating": 5.0, "review": "Not sure if the power adapter would be dual voltage I went for the gamble as my questions got various answers. I can confirm that the power adapter comes with dual voltage 120-240V and US plug. As for streaming it is intended for the U.S. only. Right now in the U.S. I did set it up on the TV here in FL and it was a breeze. In less than 1 minute the first show was streaming. Device came registered to my Amazon account already and all I had to do is plug it in and connect it to WiFi. Unfortunately the streaming requires faster WiFi and the buffering is not sufficient. So will have to watch on tablet again.  Not Amazon's fault. Now in two weeks I move back to Europe and exciting to do the ultimate test how it reacts to Smart DNS. I will update the results. At least there the streaming capacity would not be an issue.Update: Set up in in Switzerland is done. Fire TV is working the same way as the Apple TV and is perfectly capable of streaming  with Smart DNS. I am very pleased with the Fire TV stick.Con: The remote control to replace a battery is a nightmare. This needs a new design.", "verified": true, "helpfulness": "0/0", "author": "Liliane Grimm \"Liliane G\""}, {"rating": 5.0, "review": "Best thing in my life right now!", "verified": true, "helpfulness": "0/0", "author": "Amy K."}, {"rating": 5.0, "review": "Was having problems streaming on my Samsung smart TV. Fire TV stick to the rescue.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Yayyyy fire stick! Love Amazon for making this. So easy to plug in and use, and has all the main apps like Hulu and Netflix. I don't actually know why anyone would spend more money for the box when this stick does great for half the cost!", "verified": true, "helpfulness": "0/0", "author": "Kelsey"}, {"rating": 5.0, "review": "Love It!!!", "verified": true, "helpfulness": "0/0", "author": "jlynn"}, {"rating": 5.0, "review": "best interface I've used (we have a vizio smartTV, roku, and this), bought for the back room tv but swapped to the main room because it's so superior.", "verified": true, "helpfulness": "0/0", "author": "vdub"}]