[{"rating": 5.0, "review": "Like this much better than the chromecast.  Great option if  you already have Prime.  Nice!", "verified": true, "helpfulness": "0/0", "author": "Betty the Buyer \"The Buyer\""}, {"rating": 5.0, "review": "I absolutely love my Fire TV stick I paid $24 and honestly I think this will give Apple TV a run! Plenty of content well designed and very easy to use!", "verified": true, "helpfulness": "0/1", "author": "tspielman"}, {"rating": 5.0, "review": "What a product!  I have had an Apple TV for many years and even though I'm a big Apple fan, this is a better buy and of course carries Amazon Prime which Apple still does not.", "verified": true, "helpfulness": "0/0", "author": "Frank C"}, {"rating": 5.0, "review": "Great it works, thanks!", "verified": true, "helpfulness": "0/0", "author": "Mikhail Antonov \"Manta17\""}, {"rating": 5.0, "review": "Love it super easy to use.", "verified": true, "helpfulness": "0/0", "author": "Rodney L Billings"}, {"rating": 5.0, "review": "I feel the same way about the Fire TV Stick that I do about Fire TV....great deals, performance, and support by Amazon. Don't let the lack of the voice remote throw you; you get more than you're paying for anyway.", "verified": true, "helpfulness": "0/0", "author": "deusXango"}, {"rating": 5.0, "review": "Awesome device, streams quick, clear, and HD Amazon Prime must have device.", "verified": true, "helpfulness": "0/0", "author": "Neo"}, {"rating": 5.0, "review": "I received my fire stick in the mail just 24 hrs ago and love it. I can easily stream netflix and prime shows.My kids love the app games. I also like that i was able to connect my smartphone thru the fire app and use it for voice search and also as a controller for it", "verified": true, "helpfulness": "1/1", "author": "sburgin \"That Review Chick\""}, {"rating": 5.0, "review": "Set up for the Fire TV stick could not have been easier. It is truly plug and play! All the cables and batteries were included and we were able to set up our non-Smart TV within minutes. The app for Amazon is excellent ( unlike the Amazon app on our Vizio Smart TV) and the speed of movies loading was really good. On our vizio it takes a few seconds for the movie to load but there is barely a blip before content loads on the Fire stick.The fact that you can use your phone instead of the remote to search for movies and control the device is a definite plus. The remote for the fire stick is small and I can see it easily getting misplaced so it will be good to have a backup app on the phone to use as a remote. The fact that the app on the phone allows for a voice search of content is even better!I already have the Amazon Prime membership and this device only makes it more perfect. My kids loved that the Prime songs that they streamed through the fire stick actually showed the lyrics so they could 'sing' along.Highly recommended!", "verified": true, "helpfulness": "1/1", "author": "Liat2768 \"Liat2768\""}, {"rating": 4.0, "review": "Much better than the Roku stick.  It streams well, but you need to plug it into a power source.  Amazon prime instantly streams as it stated, however Netflix and Hulu still need to buffer a bit.  Granted the buffering is a lot fast so you don't need to wait that long.  I recommend and will be getting more of these items.", "verified": true, "helpfulness": "0/0", "author": "C.Schmidt"}]