[{"rating": 5.0, "review": "Very happy with my purchase", "verified": true, "helpfulness": "0/0", "author": "T. Dugan"}, {"rating": 5.0, "review": "We are extremely happy with Amazon Fire TV Stick - Great", "verified": true, "helpfulness": "0/0", "author": "john kearns"}, {"rating": 5.0, "review": "Got it as a birthday gift and absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "DebC."}, {"rating": 5.0, "review": "I love my fire tv, so I said what the hell, why not try the tv stick. I'm Glad I did. I can now take my fire tv when I visit family or while I'm traveling (If the internet is good)", "verified": true, "helpfulness": "0/0", "author": "Dark5tatic"}, {"rating": 5.0, "review": "Awesome device lots of apps would definitely recommend it. If you want to make your tv a smart tv this will be the least expensive route..", "verified": true, "helpfulness": "0/0", "author": "Jd"}, {"rating": 5.0, "review": "I love this item.  It is much better than my Google Chrome stick because it does not required a computer or cellphone to us it.", "verified": true, "helpfulness": "0/0", "author": "Olivia Cooper"}, {"rating": 1.0, "review": "This device keeps dropping off the WiFi when I am streaming a movie.  I have no trouble with other TVs, that I have, streaming  movies using a different device that is connected to the same WiFi.  I only have problems with this device.  I also downloaded the app on my phone that can be used to control this device and I have a difficult time pairing it.  It works some of the time and other times it does not.  I guess you get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Bullard"}, {"rating": 5.0, "review": "Everything I needed I got with the Fire Stick.  Perfect", "verified": true, "helpfulness": "0/0", "author": "nancy thrall"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Donaldo Gutierrez"}, {"rating": 5.0, "review": "All I can say is wow. We can now watch movies from Prime, Amazon instant Video, and others in our bedroom, living room, or out on the porch. This is an expensive tool that has exceeded my expectations. Thank you one again to the Amazon guys developing this stuff. You rock.Oh, by the way, I only need my DVD/Blue ray players to back up my hard drive now. Thanks.", "verified": true, "helpfulness": "0/0", "author": "KRoberts \"KatieR\""}]