[{"rating": 5.0, "review": "Get it.  Seriously.  If you're on the fence about whether to get this or to get one of the other media sticks, Fire TV Stick far outperforms each of them.", "verified": true, "helpfulness": "0/0", "author": "zachwlucas"}, {"rating": 5.0, "review": "The fire tv stick Works very well.  The problem we are encountering is with our home Wi-Fi.  Once we have that straightened out, we should really begin to enjoy the Fire Tv stick.", "verified": true, "helpfulness": "0/0", "author": "Grandmom"}, {"rating": 4.0, "review": "As long as you have good wifi it works well , I misread the description when I though hdmi would power the device . It requires power to the USB port and comes with a wall adapter ( most TvShop have usb but lack enough power output) so it's just extra parts to keep track of when you travel .", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 1.0, "review": "I was quite dissapointed with this product. The organization in the screen is quite confusing and messy, the tutorials make no sense.  Most of the time i had to use my kidle (which i love) as a remote control, quite annoying.  Also the stick has to be attached to a power source the cable just looks tacky unlike the commercial were it looks wireless.  I am getting a refund but i have to pay for shipping.  Honestly the apple tv is much better and its like $10 more.  Yes you wont be able to watch videos from Amazon Prime but im able to watxh any video from my computer (i just stream it through the apple tv)  sorry but this was just not for me", "verified": true, "helpfulness": "0/1", "author": "raquel"}, {"rating": 4.0, "review": "works great with Netflix but slow with NBC", "verified": true, "helpfulness": "0/0", "author": "Ray A."}, {"rating": 5.0, "review": "Super easy to install; instruction easy to understand and follow; speedy link up.", "verified": true, "helpfulness": "0/0", "author": "dmd26"}, {"rating": 5.0, "review": "Really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "teri priest"}, {"rating": 5.0, "review": "Some time there is problem with the signal or wi-fi due to bad weather but it's ok. I still love it, thank you.", "verified": true, "helpfulness": "0/0", "author": "Nelson Figueroa"}, {"rating": 5.0, "review": "Love it!!! Absolutely", "verified": true, "helpfulness": "0/0", "author": "tiffanie byrd"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "G. Guarin"}]