[{"rating": 4.0, "review": "Nice and easy no fees", "verified": true, "helpfulness": "0/0", "author": "jason rathbun"}, {"rating": 5.0, "review": "This is an excellent devlce. High quality and very versatile.", "verified": true, "helpfulness": "0/0", "author": "Raul"}, {"rating": 1.0, "review": "I still haven't managed to get this thing working. It won't connect to my router.", "verified": true, "helpfulness": "0/0", "author": "Mary B."}, {"rating": 5.0, "review": "that is the most amazing thing ever if I could give it 10 stars I would", "verified": true, "helpfulness": "0/0", "author": "Carmen vanduren"}, {"rating": 5.0, "review": "It is great.  I love it.  It works great.", "verified": true, "helpfulness": "0/0", "author": "Karen A. Workman"}, {"rating": 5.0, "review": "I have Verizon DSL, i wanted to get rid of my landline phone but just keep the internet, they told me they no longer will do this!!! HOW RUDE!!!well after i bought the Amazon firestick, i feel justified and that my wifi thru verizon send the signal to my big screen tv.This small price of 39.99 is a dream come true, now i can watch netflix and amazon prime movies on my tv instead of on my smallercomputer screen. Comes loaded with apps games etc. One of the few things that i can say is \"WELL WORTH THE MONEY!!!", "verified": true, "helpfulness": "0/0", "author": "Mr. David B. Beattie"}, {"rating": 5.0, "review": "My wife absolutely loves this thing. When compared to the ChromeCast (which has its utility), she finds it far simpler, more reliable, and generally a better experience.", "verified": true, "helpfulness": "0/0", "author": "Timothy Glinatsis \"The Turnip\""}, {"rating": 5.0, "review": "always great with PRIME!!!", "verified": true, "helpfulness": "0/0", "author": "eDUARDO DELEON"}, {"rating": 5.0, "review": "it's a much better deal than the other fire tv at $99 and does the exact same stuff. I have both. If I were to have to choose between them, I'd choose the stick because it is smaller. The stick does have to be plugged in which I wasn't expecting. Also, the remote doesn't have voice recognition which I have come to love on the other fire tv.", "verified": true, "helpfulness": "0/0", "author": "KT"}, {"rating": 5.0, "review": "Extremely functional and easy to use.  Would recommend for anyone that uses netflix or amazon streaming video as it is much easier than other devices that are similar (also own a Google Chromecast and I prefer the Fire TV Stick for its functionality).", "verified": true, "helpfulness": "0/0", "author": "Nate"}]