[{"rating": 5.0, "review": "It's easy to use and is easy to hook up.  I move it to different tv's.", "verified": true, "helpfulness": "0/0", "author": "SND"}, {"rating": 1.0, "review": "Well to have full access you need prime amazon also internet. I feel i spend more money than actually having cable/satellite .", "verified": true, "helpfulness": "0/0", "author": "Essoney"}, {"rating": 4.0, "review": "I like this very much.  I was surprised that I didn't need my computer, phone or tablet for this to work.  I also have Chromecast and prefer Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Toni"}, {"rating": 5.0, "review": "Awesome!!! I bought this during their anniversary sale and I've never been happier!! Now only if the remote was a little bigger! It keeps getting lost in my couch.", "verified": true, "helpfulness": "0/0", "author": "Thu Pham"}, {"rating": 5.0, "review": "Love it..even took it o vacation with me!", "verified": true, "helpfulness": "0/0", "author": "latoya owens"}, {"rating": 5.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "darlene kelley"}, {"rating": 5.0, "review": "I have two of these.  Work great!  Frequently watch Amazon videos and Netflix without issues.", "verified": true, "helpfulness": "0/0", "author": "brc1981"}, {"rating": 2.0, "review": "You need amazing wiFI or mine is faulty. My WiFI works with everything else problem free, all devices, phones, tablets etc. When I move the firestick not even 20ft to plug it into the TV in the living room it drops the connection or wont even connect???? I can not move my router and equipment to the living room where the firestick is supposed to be. It only works in one room where no one is?", "verified": false, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Fire stick is awesome!! For $25 you cannot get better that this.", "verified": true, "helpfulness": "0/0", "author": "Jitan Arora"}, {"rating": 5.0, "review": "Best money i have ever spent on entertainment!", "verified": true, "helpfulness": "0/0", "author": "Kent W Rabourn"}]