[{"rating": 5.0, "review": "WOW. TV and movies galore. Well worth the price any time.", "verified": true, "helpfulness": "0/0", "author": "rob Ray"}, {"rating": 5.0, "review": "Really does the job.  You can access a ton of stuff whether it me Netflix or HBO or other sources", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Work great love", "verified": true, "helpfulness": "0/1", "author": "Debra  Woodruff"}, {"rating": 4.0, "review": "Just had it about 2 weeks but works great so far. Lots of new show access.", "verified": true, "helpfulness": "0/0", "author": "Mike Rivera"}, {"rating": 5.0, "review": "Absolutely love it!  Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "msg03"}, {"rating": 5.0, "review": "Just purchased this and loving so far.....", "verified": true, "helpfulness": "0/0", "author": "S4 \"S4\""}, {"rating": 5.0, "review": "Great product. Works great. All Prime shows are in high definition and also allows you to access your Prime Music. With Fire phone or Kindle Fire - allowd for mirroring with X-ray. Full integration of Amazon products. Highly recommend. Also Amazon has cleaned up the interface - looks beautiful.", "verified": true, "helpfulness": "0/0", "author": "Ken B."}, {"rating": 5.0, "review": "Easy to setup and great listings provided, movies tv series etc.  Highly recommend", "verified": true, "helpfulness": "0/0", "author": "JGC"}, {"rating": 4.0, "review": "The best online video streamer for the money.  Got it on sale at Staples.com.  Well worth the price if you get it under $25.  Easy setup.  Not much memory to load apps, but enough content to satisfy your crave.Pro: Easy startup.  Menu and tabs are easy to understand and accessible.Con: no memory expansion.  USB outlet on device at a precarious position.  Need better design to support cable dangling.  No voice commands.", "verified": true, "helpfulness": "0/0", "author": "Paulie"}, {"rating": 5.0, "review": "Wonderful, cant' live without it.  I get all the movies and series instantly on my tv.  Easy to use.  Can't believe that little remote can do it all.  It streams perfectly in HD.  My TV has never looked so good.", "verified": true, "helpfulness": "0/0", "author": "RUSSELL CLAUNCH"}]