[{"rating": 5.0, "review": "Amazon does it again!  This is an awesome tool!  I have a smart TV but is not as fun and easy to use as the stick!  And, if you tell your Harmony Ultimate it is a Fire TV it controls it, vey cool!  This is a great way to get screensavers on your TV also....buy it it's cool!", "verified": true, "helpfulness": "0/0", "author": "Al Sample"}, {"rating": 5.0, "review": "Love it! I wish I had gotten this sooner! Better than a kindle on steriods!!!!", "verified": true, "helpfulness": "0/0", "author": "sbpar"}, {"rating": 5.0, "review": "Works great with myTV", "verified": true, "helpfulness": "0/0", "author": "abilene_m_f"}, {"rating": 4.0, "review": "If youre an amazon Prime member this is a no brainer. Im a roku user, and this wont replace my roku 3 mainly because the roku 3 is so much faster at loading than a streaming stick. But this is great alongside. Now I can stream the Amazon prime music as well as having easy access to everything else. The games look fun for wasting a minute or two so Ive ordered a controller. Plus, like the Fire tablet, you can sideload apps...the roku cannot do that unless youre using a third party like plex which requires a PC/Mac connection. Again $19?? No brainer.", "verified": true, "helpfulness": "1/1", "author": "Casey Earl"}, {"rating": 1.0, "review": "Absolutely horrific!! The initial setup was glitchy, causing green lines to appear across the screen and random buzz noises. My husband had to go out of his way to research how to fix it because the troubleshooting in the manual didn't help.After it was hooked up, many streaming apps failed to work. We usually watch league of legends on twitch, and when we tried the app crashed after loading an ad. Hulu and Netflix stuttered a lot with pauses in frame rate while the sound continued, most of which lasted up to 30 seconds. Sometimes the shows would pause entirely with no buffer problems. It just froze.The product overheats very fast. Ours is plugged into the back of our vizio tv. We have had to unplug and replug to reset it or let it cool off.Overall it's slow, glitchy, and not worth the wait.", "verified": true, "helpfulness": "2/4", "author": "CoolKatBranden"}, {"rating": 4.0, "review": "It took me a while to get the Fire TV Stick, but so far, I like it.  I have Amazon Prime and a Netflix account.  That's really all you need to get your money's worth with this device, but there are plenty of other apps that you can download.I can't wait until my boyfriend realizes that he's been wasting his money for years paying for cable from Comcast.  You could be entertained for the rest of your life with one of these; if all you ever chose to do was sit on the couch and watch television!I find that the remote is a little troublesome at times and is not as responsive as a more expensive one would be.  I have small hands, though, and it's just the right size.  I recommend being patient with your Fire TV Stick.  Just press one button on the remote at a time and then, wait for the device to respond.  If you keep mashing buttons, it will freeze.", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 5.0, "review": "WoW  great performance, very fast very impressed . recommended 100%", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Note: This was purchased by my husband. I’m an Amazon Prime Member– call me a homer! But it is so cool to come home to a door piled high with Amazon packages! I was able to get the $19 Amazon deal for the Fire Stick. My household has had two Chromecast sticks for about a year. I had some reservations about the Fire Stick, but after  weeks, My family is very happy. There are too many details to go in depth, but here is my family’s feedback. First – we are a “stick” family – we already have a stack of boxes – TiVo, DVD, Modem, router, ….; so we are out of power outlets. The Chromecast was a cool addition. However, even though the Chromecast is not a high friction type of device, even with the latest firmware, the Chromecast still has its quirks.Also, the second screen interface – using your PC,MAC or phone is non-intuitive. So I was hoping the Fire Stick would raise the bar – just a little bit; well, we are ordering our second stick. Amazon got the user interface, as Red Riding Hood would say, ..”just right!”. My husband was going to show me how the Fire Stick worked; I didn’t have time so later that day I picked up the remote – accessed all my Amazon Prime content; all my Amazon Prime Preferences; was able to Access my Netflix account with no problems, but all that said – the interface is so intuitive I gave the remote to my 9 year old daughter and she was on her way.I do like the parental controls. Of course  my husband was disappointed when I didn’t need his considerable IT experience to use the Fire Stick. He did say that the installation was no muss, no fuss. I didn’t hear any cuss words or epithets when he was installing the Fire Stick. I did have to change the stick from his account to my account – I think he was surprised I was able to do this without his help. Are we going to “eBay” the Chromecasts? No. We use StreamCast  to view our local content, and although it is a second screen type of application, it is easy to use, when the Chromecast wants to “play good”. As we are out of HDMI ports on or TV’s I would hope Amazon will add a similar feature, but for now they want you to use their cloud storage. And finally – even with the Chromecast we could not see the light at the end of the “cord cutting” tunnel. Fire is not there yet, but we can definitely see a twinkle. The Fire Stick is a no brainer at $19; If you have Amazon Prime, it is a good investment; Non prime, compare features for the other sticks (and Apple puck) to see what works for you, but if you want an easy to navigate viewing experience – Fire Stick has my “Prime” vote.", "verified": true, "helpfulness": "2/2", "author": "Z Hayes"}, {"rating": 1.0, "review": "I'm hoping that it is just my particular unit, but I have tried for the last week on three different high-speed networks and I literally can't watch more than 3-4 seconds between buffering pauses. My Kindle Fire Reader (tablet, not FireStick) works wonderfully with streaming video on the same networks, but this FireStick is EXTREMELY frustrating. So... sending it back.If the replacement is any better, I promise to update my review.", "verified": true, "helpfulness": "2/2", "author": "Max's Dad"}, {"rating": 2.0, "review": "WATCH ESPN will not work if you are a CHARTER subscriber.  Seems Amazon and Charter don't have an agreement, since WATCH ESPN works fine on my ANDROID devices.  ESPN responded with the following: \"Charter has opted to not allow access on Amazon Fire TV at this time. We have not received any information why this is the case. We are working with Charter to resolve the issue. Any further questions regarding Amazon Fire TV through Charter will require contacting Charter directly.\"", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]