[{"rating": 3.0, "review": "Not entirely the most reliable streaming device, but it does the trick.", "verified": true, "helpfulness": "0/0", "author": "Lstfn"}, {"rating": 5.0, "review": "great !!!!!", "verified": true, "helpfulness": "0/0", "author": "Chip"}, {"rating": 5.0, "review": "Love the fire stick. Much better than satellite or cable", "verified": true, "helpfulness": "0/0", "author": "j.schrack"}, {"rating": 5.0, "review": "I reall like my Fire TV Stick it makes it really easy to get free movies from my Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "maggie9227"}, {"rating": 2.0, "review": "All the expected apps. Hard to navigate and find the content you want. The games are unnecessary. MLB.tv app runs so poorly that it's not worth watching a game. Hulu app is not as bad, but still frustrating with constant buffering and stalls. Netflix works like a charm. Music app is good.", "verified": true, "helpfulness": "0/0", "author": "james bryan"}, {"rating": 5.0, "review": "I've been cable depended for quite a while but the Fire TV Stick has opened up a new world to me. I've used it for over a week now and I have no complaints. I'm finally ready to get rid of cable.", "verified": true, "helpfulness": "0/0", "author": "H. Gibbs"}, {"rating": 5.0, "review": "Cannot say enough good things about it. I am thinking of ordering a second one for another TV", "verified": true, "helpfulness": "0/0", "author": "Marlene Brannen \"Koontz\""}, {"rating": 5.0, "review": "More than met my expectations.  It is a terrific addition to my TV enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Ralph J. Miele"}, {"rating": 4.0, "review": "As we learn more of the things it can do, I am sure we will up our rating.", "verified": true, "helpfulness": "0/0", "author": "Jim Shofner"}, {"rating": 5.0, "review": "I bought this as a present and my mother is very happy with the product.", "verified": true, "helpfulness": "0/0", "author": "Sylvia A Gualpa"}]