[{"rating": 4.0, "review": "This was a Xmas gift which has worked well, though we did have to contact tech support to reload Netflix.  It's working well now and tech support knew exactly what to do to fix the problem.", "verified": true, "helpfulness": "0/0", "author": "jadk \"siam lotus\""}, {"rating": 3.0, "review": "When this thing works, it's rather amazing. I've been using it to watch Netflix, YouTube videos, and Twitch streams on my living room television.The problem is... it doesn't always work.In the past few days, there's been quite a few issues tied to this piece of technology. It's rather frequently forgetting the network it's connected to or rebooting at around 11PM CST for no real discernible reason I can see. Just now, it's stopped detecting the remote control itself that CAME with the unit. These are pretty annoying aspects of the Fire TV Stick which make me say to any future buyers to wait a little bit until some of these bugs fall out.That being said, installation was a breeze and it is very handy when these issues don't come up to interrupt your viewing experience.", "verified": true, "helpfulness": "1/1", "author": "Mike Schumacher"}, {"rating": 5.0, "review": "A breeze to install.  I find it easy to use, though others in my household found it took a little getting used to.  I do find that my TV will now default to the Fire Stick as a video source, which is a small annoyance, but otherwise I love having this.  I use my existing accounts (Prime, Netflix, etc), and find extras like PBS, Kino Films and more.  Cool!", "verified": true, "helpfulness": "0/0", "author": "NYCShopper"}, {"rating": 5.0, "review": "it is great!  I love to stream movies.", "verified": true, "helpfulness": "0/0", "author": "Mary Lou Porter"}, {"rating": 5.0, "review": "We plugged it in a few weeks ago with no issues and have been watching movies ever since.  My Amazon Prime has some little known movies that are really pretty good.  Still Mine was one of my favorites.  I got the app for my iphone and can now use my voice to find the movie I want from my watchlist.  We are grandparents without a lot of techno savvy but this was easy for us to use!!", "verified": true, "helpfulness": "0/0", "author": "Beth S. \"Hiking grandma\""}, {"rating": 5.0, "review": "Love this... Everything at your fingertips!", "verified": true, "helpfulness": "0/0", "author": "Tina"}, {"rating": 4.0, "review": "Well, what canI say?  I pre-ordered this in October and when it arrived I was very excited.  It was easy to install and seemed to work just fine in the beginning.  It started to act up January 10th 2015.  I contacted  Amazon and told them that the movies were cutting off in the middle and that it was asking me to reconnect to the Internet or that the connection was lost, yet all my other electronics and Internet were working.  They told me to hit the pause/play key and the center button and that it should re-start the first stick.  Well, it did.  It worked for a movie or two then started to act up again.  Long story short, I had to call four times before they replaced just the stick, not the accessories.  Amazon was helpful, but I found out later that you should be talking to engineering not tech support, like that made a difference.. It did not.  I received the new stick yesterday and it has already started happening again.  It cut off in the middle of a movie and said that my internet connection is lost.  It was not.. I don't know if I will be keeping this or if I will start looking in to getting Apple TV.  I have been a loyal customer of Amazon for years and I appreciate all the new additions it has made over the years.  However, I am deeply disappointed in the way the are handling the issue with Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Porsche"}, {"rating": 4.0, "review": "I like the idea of it but it did not work for us because we have Hughes Net and it is just not fast enough to download a movie.  The movies keep going off until we just get frustrated and have not used it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use, very fast, and works perfectly with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jeremiah"}, {"rating": 1.0, "review": "not hard to hook up at all,,,,but, somewhere in the sales pitch we should have been informed about Broadband capacity needed.Steaming eats up all your available use in VERY short order. So if you really want it, check with your internet provider first and prepare for a higher cost on that end. We returned our stick { minus shipping-of course }.", "verified": true, "helpfulness": "2/3", "author": "charles mcintire"}]