[{"rating": 5.0, "review": "WE LOVE IT", "verified": true, "helpfulness": "0/0", "author": "RICHARD SMITH"}, {"rating": 5.0, "review": "What a great device for turning your dumb TV into a smart TV. Only took a few minutes to install.", "verified": true, "helpfulness": "0/0", "author": "George E Reffett"}, {"rating": 1.0, "review": "Won't work 20 feet from modem. I have no problem with PCs, Kindle or other devices from this range so it is the stick. Should be more powerfull.Disappointed!", "verified": true, "helpfulness": "0/0", "author": "pd"}, {"rating": 5.0, "review": "Fantastic little gadget at a great price.  Easily competes with apple tv.", "verified": true, "helpfulness": "0/0", "author": "Scott G. Newman"}, {"rating": 3.0, "review": "Works amazingly well, but interferes with over the air antenna when plugged in!It may have some quirks/bugs, but it works very well.  Quality of picture and sound are very good.  I like the feature where you can use the phone as a remote with a keyboard to navigate through the menus.  So far I've tried Netflix, Amazon video, and Youtube.  Youtube froze and had to be restarted, but other than that works very well.  I'm sure such bugs will be fixed soon.Now the only problem I see is that when plugged in and the power is also plugged in, it interferes with my over the air antenna, and the signal keeps getting interrupted.  Unplugging the USB cable does the trick.  Annoying, but I can live with this.", "verified": true, "helpfulness": "0/0", "author": "dImo"}, {"rating": 5.0, "review": "Best buy, would purchase it again, in fact I'm sorry I waited so long. Easy setup, was watching a movie within 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "Mr. D."}, {"rating": 4.0, "review": "Ok, truly took me a minute to figure out the stick needs to be plugged into a power source to work, which makes it a bit hard length wise, but other than that it works perfectly and already has all my info on it! Who needs a smart TV when I can just use this for $35?", "verified": true, "helpfulness": "0/0", "author": "The Real Mrs. Walsh"}, {"rating": 3.0, "review": "Works well, but disappointed in the fact that it requires an outlet to power.  Makes it less portable.  Have it positioned right next to my router so I cannot comment on range, although I have a 5G router and it works well connected to my 5g signal.  If all you use is prime, this is the stick for you.  If you use other than prime, I would recommend the Roku, which I also own.", "verified": true, "helpfulness": "0/0", "author": "scooter"}, {"rating": 3.0, "review": "Very poor instructions and very, very, poor explanations of cost per year or episode.", "verified": true, "helpfulness": "0/0", "author": "Henry N. wilson"}, {"rating": 3.0, "review": "Routinely have audio sync issues when watching Amazon and Netflix content (I'm assuming everything but these were the only two I used enough to notice the issue). It now resides in a drawer and I've gone back to other devices.", "verified": true, "helpfulness": "0/0", "author": "Mark Pugner"}]