[{"rating": 5.0, "review": "I have barely started using the Fire TV Stick but am excited about all of the possibilities.  A great addition to Amazon's Prime Membership.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I have a chromecast and it blows this out of the water. I picked it up on pre-order and am very thankful I did. I will probably try to sell it. Don't waste your time with this device. Between the lack of Amazon Prime content (just list what is free, don't mix in all the stuff that costs with the free stuff trying to trick me into buying things) and the poor controls/layout of everything...just get a chromecast.", "verified": true, "helpfulness": "2/5", "author": "Elazar"}, {"rating": 3.0, "review": "The packaging was nice and well done.  Out of the box it was easy to plug in and get going.  One great feature was that the device was pre-registered with my Amazon account information.  However, setting it up was slow and the device processed with a blank black screen.  This made me wonder if it was doing anything or not.  Eventually it started up with the basic menu.This basic menu seemed easy to use but fairly limited.  For example, my iOS app saves what I have been watching and where I stopped.  Even between devices I have this \"Continue Watching\" option right up front.  This was not the same on the Fire TV Stick.After clicking 80% of the way through my watchlist I found the program I was watching but there were several seasons.  So then had to find and drill down into the season and the episode to start watching from where I was.  Lots of clicking.  Also, the device seems to take a pause to respond when clicking.  Sigh.", "verified": true, "helpfulness": "0/0", "author": "Scott Cink"}, {"rating": 5.0, "review": "Just started exploring what the fire stick can do.  So far, we are really impressed.  The streaming is really clear, and the sound is good.  Great alternative to traditional TV", "verified": true, "helpfulness": "0/0", "author": "C. Stoker \"cat lover\""}, {"rating": 5.0, "review": "We have the Fire Stick in addition to the Fire TV and 2 Apple TV's. We actually really like them all. The Fire Stick has performed as well as the full fledged Fire TV as far as we can tell. The Fire TV user interface looks nicer than the Apple TV's but as far as pure function goes I'd call it a wash, they're both fine. If you use Amazon Instant Video go with the Fire TV's, if you use iTunes you have more reason to consider the Apple TV's. The Fire TV's have more App choices by far than the Apple TV's, though that hasn't mattered much to us so far, we really only use Netflix, Hulu Plus, and the Amazon Instant Video and iTunes (we use both, and price compare to decide where we buy a movie or show). If you're thinking about getting one of these just go for it, the price is great for what you get, I doubt you'll be disappointed.", "verified": true, "helpfulness": "0/0", "author": "D. Stone"}, {"rating": 5.0, "review": "I wasn't quite sure what this was but it sounded like a good product.  I ordered it a few weeks ago when it was on sale but it was back ordered.  I had forgotten about it until one day it arrived.  Set up was simple and it works great with wifi.  I can watch Amazon movies, Netflix, watch youtube videos and also play free games!", "verified": true, "helpfulness": "0/0", "author": "Maleficent"}, {"rating": 5.0, "review": "Great replacement! When Fire Stick works it is a wonderful addition; particularly when you have Prime.", "verified": true, "helpfulness": "0/0", "author": "Morris Alpern"}, {"rating": 3.0, "review": "My first prime was cancelled twice. Had to buy 30 day membership. Did not get response for second email. The Fire works well. The number of free movies is limited.", "verified": true, "helpfulness": "0/1", "author": "Douglas G. Ordetx"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Rommel R Layug"}, {"rating": 1.0, "review": "I connected the fire stick to the back of the TV and plugged it into an electrical socket. It was able to connect to my wifi network long enough to update itself. Since that time, I have been unable to connect at all.Pretty much seems like a waste of money at this point.", "verified": true, "helpfulness": "0/1", "author": "John R"}]