[{"rating": 5.0, "review": "Awesome, only thing I don't like is that I didn't switch to it sooner.", "verified": true, "helpfulness": "0/0", "author": "Daschatoe"}, {"rating": 5.0, "review": "I love my fire tv stick. Now I can watch my shows and movies on any T.V. in my house.", "verified": true, "helpfulness": "0/0", "author": "Dana Crosse"}, {"rating": 4.0, "review": "A bit laggy at times but overall a great purchase! The right product for the right price.", "verified": true, "helpfulness": "0/0", "author": "Monica"}, {"rating": 5.0, "review": "works great, easy install, packed and shipped well. Can't go wrong with Amazon.", "verified": true, "helpfulness": "0/0", "author": "A GrandMa"}, {"rating": 4.0, "review": "Great device for the money, just wish it had a web browser like the Kindle Fire", "verified": true, "helpfulness": "0/0", "author": "marc"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Read other reviews and had a little concern about reception. Turned out to be a non-issue as the Fire TV Stick works flawlessly and as advertised. It is located in the same room as my wireless router, but my internet speed is not that great. Picture quality is great and have had no issues. So far used mostly for Netflix and Amazon Prime programming. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Steve Bell"}, {"rating": 4.0, "review": "This is a great addition to my entertainment tools. It has so much to choose from but I do wish it had more choices in classic movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Ramon L. Ortiz"}, {"rating": 5.0, "review": "I was using my iPad prior to getting the Fire stick. I love this product. I had no issues with set up. And it woks great!", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "A must have for Prime members", "verified": true, "helpfulness": "0/0", "author": "Susan Valker"}]