[{"rating": 4.0, "review": "Super simple, amazing technology for the price.", "verified": true, "helpfulness": "0/0", "author": "wanderlust"}, {"rating": 5.0, "review": "Love my Fire Stick!!  My wife and I each have a Kindle Fire HD, and I always wished that we could watch the content that we get on the Kindles on our 56\" flat screen TV.  A friend told me to get a smart TV.  But for just $30, I purchased the Fire Stick and now have my NetFlix, Hulu, and Amazon Prime accounts all on the big screen.  And it's so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jim Bono"}, {"rating": 5.0, "review": "Love it! Great interface, easy to use, tons of options to watch, rent, or buy. Easy to setup and super small!", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 2.0, "review": "I did not expect to have to pay for most of the programs I want to watch.  Thought with this and Prime I'd be all set. Be sure you have wifi or it won't work.", "verified": true, "helpfulness": "0/1", "author": "Marilyn W. Delozier \"dillonroad\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jennifer M. Hughes"}, {"rating": 5.0, "review": "This thing is as advertised.  I'm not having any lag or speed issues at all.  Couldn't be happier", "verified": true, "helpfulness": "0/0", "author": "David Wheeler"}, {"rating": 4.0, "review": "Good product! I like the controller which reminds me of an iPod's click-wheel. I didn't know that the firestick needed to be plugged in separately and does not charge directly from the TV, hence a 4-star rating.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ziplocked87\""}, {"rating": 2.0, "review": "We've had the fire stick for a little while now and I never seem to have good luck with it.  It drops the wifi --- or resets my account, the click moves too far over.  When I hit left once it moves 8 spaces, or 3, or 2, or right. Its wonky.  I tried calling into support, but everytime I think of it I'm at work and don't have my firestick with me.  We use the chromecast more often. (  boo)", "verified": true, "helpfulness": "1/2", "author": "Kristen Buley \"KLBuley\""}, {"rating": 5.0, "review": "I have never seen a product engineered with that level of user empathy.", "verified": true, "helpfulness": "0/0", "author": "Robert N. Mckay \"rnoel\""}, {"rating": 5.0, "review": "Love it!  Very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]