[{"rating": 5.0, "review": "Fire tv stick is awesome I get to watch all of my favorite shows it has wwe network that's a big plus and I'm a prime member so I get to see movies and music 5 stars 6 if they had it", "verified": true, "helpfulness": "0/0", "author": "Mo"}, {"rating": 1.0, "review": "I thought being a prime member I would be able to download series and movies for free, but I have to pay for most things", "verified": true, "helpfulness": "0/1", "author": "Shari E. Jones"}, {"rating": 4.0, "review": "Just have it a short time. But so far happy with it. Would recommend", "verified": true, "helpfulness": "0/0", "author": "LOLETTE GONZALEZ"}, {"rating": 5.0, "review": "Pretty cool little device.", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 4.0, "review": "I've used the fire stick just aFew times and I'm impressed with the ease of both the set up and navigation of the device!", "verified": true, "helpfulness": "0/0", "author": "Bethany Westerfeldt"}, {"rating": 5.0, "review": "Very easy to use and lots of titles to choose from. The apps are a great way to see newer stuff, since the titles included with prime are mostly a few years old. Very easy to set up and operate with the included remote. Overall very happy and product met expectations.", "verified": true, "helpfulness": "0/0", "author": "Heather M"}, {"rating": 5.0, "review": "Awesome! Better than I ever imagined! So many great choices,  I down graded my cable package.  Definitely the best choice I've made so far this year.", "verified": true, "helpfulness": "0/0", "author": "Brenda Smiles"}, {"rating": 5.0, "review": "Best integration of Prime Video that I've found so far.", "verified": true, "helpfulness": "0/0", "author": "Brandon W"}, {"rating": 5.0, "review": "Easy to install.  Operates much like my Roku 2. I am very satisfied.  My 8 year old grandson picked up the remote and immediately began playing some Star Wars game that worked flawlessly.  Yet the remote is incredibly simple to use, only six buttons.", "verified": true, "helpfulness": "0/0", "author": "W."}, {"rating": 4.0, "review": "It met all of my expectations Im thinking I can drop my cable now..", "verified": true, "helpfulness": "0/0", "author": "Hal Dalson"}]