[{"rating": 5.0, "review": "So far so good. Does what it should. Only minor complaint is how hard it is to get the battery chamber open for the remote control. It's 2015, designers of products should know how to make them effortless and user friendly. I also found it curious that the stick would not fit the port of my TV, but the extender does. The instructions say that if you have trouble getting the stick on your TV try using the extender. It's as if they know it is not the right size to fit. It makes me wonder if they made a huge defective batch and rather than discard them, created the extender.", "verified": true, "helpfulness": "0/1", "author": "tjwash \"tjwash\""}, {"rating": 5.0, "review": "The days are too short to explor every thing . Its going to take a long time to view all this makes available", "verified": true, "helpfulness": "0/0", "author": "Timothy L. Gooley"}, {"rating": 1.0, "review": "Getting ready to return this useless tool.  Useless because the remote is junk.  It is impossible  to open the cheaply made remote to put the battery in.  Without the remote, the stick is useless.  Everything else was easy to put into place. It shouldn't require an abnormal amount of pressure to slide the battery door open and without hurting one's thumb during the process. Even with the \"Note: It can take a considerable amount of pressure to open the battery door.\" Why does it have to be this way?  I've never felt more disappointed and frustrated with an otherwise simple object that is supposed to enhance television viewing experience.", "verified": true, "helpfulness": "1/2", "author": "Lady jkd"}, {"rating": 5.0, "review": "Bought the Fire stick for my daughter and she loves it. Installation was a breeze and the size of the remote is perfect. I am so satisfied with this purchase and of course with my Amazon Fire TV I purchased last year.", "verified": true, "helpfulness": "0/0", "author": "DELILAH \"AVID READER\""}, {"rating": 5.0, "review": "When you unlock its full potential it becomes the best source of entertainment far none", "verified": true, "helpfulness": "0/0", "author": "Rachel Frizado-Kowski"}, {"rating": 4.0, "review": "I love it, it is super simple and easy to use. However it freezes like the Roku, however much less than the Roku.", "verified": true, "helpfulness": "0/0", "author": "erika"}, {"rating": 5.0, "review": "Simple to set-up and use. It works well.", "verified": true, "helpfulness": "0/0", "author": "T Pardon"}, {"rating": 5.0, "review": "works great,LOVE IT", "verified": true, "helpfulness": "0/0", "author": "sandy keathley"}, {"rating": 5.0, "review": "I LOVE IT it's easy to use, set up, control and extremely fast😍😍😍😍", "verified": true, "helpfulness": "0/0", "author": "Gavin Roberts Chapman"}, {"rating": 5.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "ivich"}]