[{"rating": 4.0, "review": "I like it , works for me, price was right", "verified": true, "helpfulness": "0/0", "author": "C.R.Baker"}, {"rating": 5.0, "review": "Fire TV Stick works well and is very portable.  The UI is a little slower than the Fire TV box but it makes up for that in size.  Great for streaming content from Amazon and other providers.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "This is great piece of entertainment equipment. It is very quick and offers much of what we like. The remote works from anywhere and for the price, you can't beat this. Works with sling tv like a champ. Very happy.", "verified": true, "helpfulness": "0/0", "author": "Cmrnkl"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amy Lou"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "mia"}, {"rating": 2.0, "review": "I would like the product but it just does not have the power my Roku has out in the country with a slower broadband. I am unable to watch SlingTV or stream a show without buffering or kicking me out completely to my home screen. Most of the issue is on my side but I have no other option for my ISP.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Yongzheng Hu"}, {"rating": 4.0, "review": "Works great - MUCH better than Roku stick (garbage).  But I wish it had more apps.  News sources are minimal.  Great if you have an Amazon Prime membership.Of note:  Set up was easy and intuitive, as is functionality.  Bought a second one for my other TV and took back the Roku which fails on all fronts other than having the most apps (but who cares if it's constantly flaking out and is significantly slower than the Fire stick?)", "verified": true, "helpfulness": "0/0", "author": "teufelhunden \"teufelhunden\""}, {"rating": 3.0, "review": "Loses internet connection about every other day and have to unplug and replug in", "verified": true, "helpfulness": "0/0", "author": "Brooke"}, {"rating": 5.0, "review": "This is fantastic.  Everything I need is streaming through the Amazon fire stick. I have given up cable for good. I am thinking about the Amazon TV fire stick.", "verified": true, "helpfulness": "0/0", "author": "bonid \"bonid\""}]