[{"rating": 3.0, "review": "It's awesome whenever it works properly. However, I have encountered streaming issues many times.", "verified": true, "helpfulness": "0/0", "author": "djenyap"}, {"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 3.0, "review": "Its not as user friendly as expected. The home page seems a little complicated, and it doesn't seem to have very good picture quality. Finally you cannot rate anything on the interface, or do nearly as much as expected. I don't recommend buying this for yourself, maybe as a gift to someone.", "verified": true, "helpfulness": "0/0", "author": "Brier"}, {"rating": 2.0, "review": "It freezes and skips constantly. I love the idea of this product but it makes you INSANE to watch programming and have it freeze every 45 seconds.", "verified": true, "helpfulness": "0/0", "author": "joey"}, {"rating": 1.0, "review": "I thought that this was going to be the solution to me cutting the cord in my upstairs bedroom.  If only the fire stick could figure out whether it was connected or not.  This device is like an old annoying girlfriend.....when you think you are connected, it tells you that you are not, even though the settings says it is.  There is a disconnect between the settings and the actual stick.  Then it tells you it can't find the wifi, but every other device in the room has full connection. I even bought the NetGear WiFi extender, and still no dice.  The fire stick sits right above the extender.  I can stream anything on my iPad, or phone no problem, but I can't even get the fire stick to load the menu.  I am getting ready to call customer service to return it.I have had chromecast in the same room with no troubles what so ever.  My advice is be sure to read all the reviews.  It sounds like unless it is litterally on the TV in the room with the router, it is useless.  Many others have reported the same thing on here.  Buyer Beware.", "verified": true, "helpfulness": "1/1", "author": "Limes"}, {"rating": 3.0, "review": "I am using for 30 day trial.", "verified": true, "helpfulness": "0/1", "author": "Jonel"}, {"rating": 1.0, "review": "Keeps reloading, no signal! Bad", "verified": true, "helpfulness": "0/2", "author": "Dave"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "MikeyVD"}, {"rating": 2.0, "review": "I need to get it working before I can write a review", "verified": true, "helpfulness": "0/2", "author": "james boden"}, {"rating": 4.0, "review": "very impressive for the money great performance at a great price", "verified": true, "helpfulness": "1/1", "author": "perry"}]