[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Mandy roberson \"Mandy Roberson\""}, {"rating": 5.0, "review": "This Fire TV stick is so nice! It is so nice to be able to watch different shows on my television now instead of watching on my computer via Internet. The price for this is really reasonable and I want to get myself another one. The fire stick can be good to give a way as a gift to someone. This is also good for people like myself who may not have a smart tv and it's so easy to get it hooked up to your TV and then your good to go. This is also good for people who may not have cable TV as well. I can't believe this little small device can really enrich your TV experience and I can listen to the radio through the TV via iHeart radio or Pandora. I just got this Fire Tv stick yesterday so I'm pretty excited right now...lol. Kudos to you Amazon for making this!...You have just outdone yourself this time. :-)", "verified": true, "helpfulness": "0/0", "author": "HiddenandundiscoveredonAmazon"}, {"rating": 5.0, "review": "Better than chromecast", "verified": true, "helpfulness": "0/0", "author": "Claire  pryce"}, {"rating": 5.0, "review": "If you have Prime... you need this! It is awesome and the Fire TV Remote App works nicely from my Kindle Fire HDX and my Android phone.", "verified": true, "helpfulness": "1/1", "author": "Steven R"}, {"rating": 5.0, "review": "This is a great device. We bought this as a replacement for our old Roku. We couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "B.L."}, {"rating": 4.0, "review": "Incredible!", "verified": true, "helpfulness": "0/0", "author": "M. Gail Davis \"Surfbaby\""}, {"rating": 2.0, "review": "Got this free with the deal sling was having. After connecting it and using it for a bit I noticed the control would register more clicks than I had pushed at times. Like when trying to type something with the keyboard when i click right to choose a letter it would Like register 10 clicks at times. Happened randomly and not all the time but enough to be really annoying since when searching for something it would skip a lot. Got a remote replacement from amazon and nope same problem so I didn't have a faulty control its just sucks. A workaround is using the smartphone app client but if I wanted to use my phone as a control I'd use my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Ricardo"}, {"rating": 5.0, "review": "Better then the other similar devices", "verified": true, "helpfulness": "0/0", "author": "Trey Clements"}, {"rating": 5.0, "review": "Easy to use. I use my prime, netflix, youtube, and twitch. The picture is clear and it is quicker than using my playstation. I wish time warner on demand were on it though.", "verified": true, "helpfulness": "0/0", "author": "Paige"}, {"rating": 5.0, "review": "I now have this, apple tv, and Samsung smart tv. I rank this right up there with apple tv, though I do prefer the apple tv for how smooth it is.Mirroring is a tough one, but there is an app that allows you to mirror your phone. The phone remote is worth downloading, fyi. A very, very good buy for the price!", "verified": true, "helpfulness": "0/0", "author": "J. Amabile \"Jenn\""}]