[{"rating": 5.0, "review": "We LOVE this!!! I purchased this for my daughter & it's just unbelievable how simple it was to connect & use! I'll be buying one for every room in my house next!!! We watch a lot of movies on Netflix & Amazon and I love the simple portability. I may buy the wireless controller soon so we can play some of the games on the tv as well. Great invention Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Genell Goodson \"GYG\""}, {"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "ALexander O"}, {"rating": 5.0, "review": "love it!  So easy and a great way to make your TV smart!", "verified": true, "helpfulness": "0/0", "author": "Catherine Martin"}, {"rating": 5.0, "review": "Easy to install, works great. Came with batteries :)", "verified": true, "helpfulness": "0/0", "author": "awise1"}, {"rating": 5.0, "review": "This device is FANTASTIC!!", "verified": true, "helpfulness": "0/0", "author": "Beth Cooper"}, {"rating": 4.0, "review": "Working as advertised there is no delay turning it on, the searching and the movie or tv shows come up right away unlike my DVR that I was using to get Netflixs it took a couple of minutes to get it going and was slow refreshing in moving between screens I won't be using the dvr again", "verified": true, "helpfulness": "0/0", "author": "Steve Nelles \"JSteven\""}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "love it makes my regular flat screen into a smart tv", "verified": true, "helpfulness": "0/0", "author": "Vincent Bos"}, {"rating": 4.0, "review": "I bought the Stick because I could not get cc on Netflix with the app built into my TV. Fire Stick enabled this, which was great. Moreover reception is hi-res, good bandwidth. (I'm lucky my router is right next to TV.) Interface is decent, the small remote adequate though improvable. I'm very happy the Stick solved my Netflix cc problem. Now wife and I can get all the dialog. Another point: only $39. That's good.", "verified": true, "helpfulness": "0/0", "author": "Sherab K"}, {"rating": 5.0, "review": "This thing is GREAT with Amazon prime. If times get tough, I could cut all my HBO, Showtime & cable bill entirely and just use this (although you'd be playing catch up with some seasons and prime doesn't offer ALL shows and networks). Streams clean and was easy to install. You DO have access to other services (HULU, ect), however, the more services you use, the more you'll pay (monthly). Kinda like a la carte viewing. Nice alternative to Cable and/or satellite TV, and an inexpensive way to experiment with \"cutting the cord\".  I'm not there YET....but certainly headed in that direction. p.s. you DO need a wireless broadband network in place to use this product. I assumed everyone has a wireless network, and you know what they say about assuming!", "verified": true, "helpfulness": "0/0", "author": "Amazon Guy"}]