[{"rating": 5.0, "review": "Love it!! :)", "verified": true, "helpfulness": "0/0", "author": "Danni"}, {"rating": 4.0, "review": "I was one of the many prime members that pre-ordered the firetv stick for 20 bucks.It does as advertised, in my opinion it does load faster than the Roku stick (I have one on my mom's tv).It is well organized and geared toward Prime members, and when you're not using it, it puts a nicescreen saver on your TV.(although you can load all apps including Netflix to it, well almost all apps)There are two apps missing that might need to be added.  One being HBOgo, but if you're a Prime member,you already get to watch most of the HBO tv shows like Oz and others.The other app missing is VUDU.  I myself have almost 200 movies stored in my VUDU account, but cant watchthem on the fire stick, at least not directly from VUDU. There is a way around it. You have to make sure your VUDUaccount is linked to Ultraviolet,  also open a Flixster account and also link it to Ultraviolet.  All your movies stored (almost all)that are on your VUDU account are now viewable through Flixster.  There is a Flixster app for the fire stick.That being said Flixster has a downfall,  if you are watching a movie and have to stop and come back later, Flixster does not startwhere you left off, it starts over at the beginning of the movie.  VUDU (like prime) always gives you the option of starting whereyou left off.  Because HBOGO and VUDU are missing apps,  I give the Fire TV stick 4 stars. However, if you don't have a VUDU account,or don't care for HBO. then I would give the FireTv stick 5 stars. (Prime is still cheaper than Netflix btw and you get more)(Amazon add VUDU hint hint lol)", "verified": true, "helpfulness": "0/0", "author": "J. SKEENS"}, {"rating": 5.0, "review": "We have had other wifi devices for our TV and this one seems to work the best so far.  We really like it.", "verified": true, "helpfulness": "0/0", "author": "L. B. Woodbury"}, {"rating": 5.0, "review": "I have had a Roku 2, a Chromecast, and used Smart TV and Smart devices to let me connect to streaming media and none of them are as simple and well rounded as this tiny little stick. A form factor like Chrome cast is what I wanted so it could easily be hidden behind the tv, but this thing is far more powerful, much more stable than my Roku 2 grew to be. Chromecast was great for what it was, but was easily paced by this stick in both power and responsiveness, not to mention not having to use the cumbersome method of pushing streaming services from your phone. ALSO huge points for this being one of the cheapest Miracast sticks you can buy. I picked mine up for 24.99 during black friday and it is a steal at that price. I'd pay 40 for it easily after having it now for a few months. Amazon has pretty much convinced me also to buy the full sized Fire TV Box with this thing for my other tv in the house. Gaming on it is great, the ability to use apps I have purchased for my phone on here (not all but some) is awesome. If you need a streaming stick, there really is no better choice, and if your a member of Amazon Prime, there really is no other choice. This manages to enrich the service your already paying for so much it hardly seems like the cost of Amazon prime is enough. With this stick I will be cutting the cable cord soon enough.", "verified": true, "helpfulness": "0/0", "author": "Darrell Greer"}, {"rating": 5.0, "review": "Great product. Very satisfied with it!I like everything about it.Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"lifeblue3\""}, {"rating": 5.0, "review": "I really enjoy my Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Ouillette"}, {"rating": 5.0, "review": "\"Easy to use, easy to set up, the RF remote is wonderful, voice search via iOS on the iPhone is great.\"--So sayeth my techie husbandAccessing Amazon Prime's extensive kids programming content during a recent four-day fever…priceless.", "verified": true, "helpfulness": "0/0", "author": "Silver Spring Mom"}, {"rating": 3.0, "review": "a bit slow while changing apps. Internet connection is a bit slow and laggy. I'm running 50 MBS and my N-router is about 10 feet from the Fire TV stick. Good for the price( $20.00) , however It will not replace my Apple TV", "verified": true, "helpfulness": "1/1", "author": "Xman0499"}, {"rating": 2.0, "review": "I like it but am disappointed that it goes out a lot and I have to unplug the power and re-plug to get it to work again.", "verified": true, "helpfulness": "1/1", "author": "Mary Mueller"}, {"rating": 5.0, "review": "It's just great!", "verified": true, "helpfulness": "0/0", "author": "the orange"}]