[{"rating": 1.0, "review": "I thought this stick was going to be a great addition to my internet viewing pleasure. Boy, was I wrong. It is a piece of crap! Streaming with it is a nightmare. It constantly starts and stops blaming low connectivity on my wifi. Odd, how I don't have that problem with my blu-ray DVD players or computer. I have high speed with century link which provides great service for all my other electronics. My advice, don't waste your money until they build a unit with storage capability that can handle your wifi load.", "verified": true, "helpfulness": "0/0", "author": "P. Harry"}, {"rating": 5.0, "review": "Just like my 1st Amazon Fire. Plug and play - my office TV has never had such a good picture.", "verified": true, "helpfulness": "0/0", "author": "Victoria Lippmeier"}, {"rating": 4.0, "review": "good product; on time delivery", "verified": true, "helpfulness": "0/0", "author": "Gary L. Cooper"}, {"rating": 5.0, "review": "Can you connect more than one Tv in your house if yes how.  Thank you. Ps with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Michele"}, {"rating": 5.0, "review": "Easy to use, even for a technotard like me! Works perfectly with Amazon Prime providing a vast array of free shows.", "verified": true, "helpfulness": "0/0", "author": "sharon"}, {"rating": 5.0, "review": "have great expectations for this  . . haven't used it yet but trust completely that if it's kindle. . it's got to be great!!", "verified": true, "helpfulness": "0/0", "author": "Nancy Romero \"dog breeder\""}, {"rating": 4.0, "review": "so far so good!", "verified": true, "helpfulness": "0/0", "author": "tom dean"}, {"rating": 5.0, "review": "easy to set up,", "verified": true, "helpfulness": "0/0", "author": "Sue Bostrom"}, {"rating": 4.0, "review": "The Fire TV Stick does what I needed to do. I like it. There are times, I wish it would have buttons or command features. Overall, I am happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Andy V."}, {"rating": 5.0, "review": "I currently am using it with a slingbox M1 to watch my Satellite programming from one house to another house.  I am not using the top quality setting and the looks are every bit as good as if I was watching the program at the other house.  Another feature will be to reduce the number of satellite boxes and replace them with the Fire TV Stick and the Slingbox App.", "verified": true, "helpfulness": "0/0", "author": "OldnGrey"}]