[{"rating": 5.0, "review": "This is an amazing piece of technology.  I had it up and running in a matter of minutes.  If Amazon Prime were a little less expensive, I would own it too.", "verified": true, "helpfulness": "0/0", "author": "James A Mueller"}, {"rating": 5.0, "review": "WOW!! I have been dying for a smart TV but being that my tv is fairly new I cant buy another one. This product is amazing. There are so may free apps and movie apps that I just love. Seriously, KUNGFu movie app. Drive-In Movie App. Oh and an app for just scary movies...ALL FREE. Initially I had to call amazon because it wasn't working so that was a little frustrating but hang in there if it happens to you.Its definitely worth it.I don't have amazon prime but now I am contemplating getting it just because of all the movie options..", "verified": true, "helpfulness": "0/0", "author": "jazz"}, {"rating": 5.0, "review": "Unfortunately the device was not compatible with my TV. However the return service was excellent. I'm giving five stars for excellent follow-through on the service.", "verified": true, "helpfulness": "0/0", "author": "parag anandpura"}, {"rating": 5.0, "review": "So glad I bought this!! It's absolutely perfect for my room and I can't wait to take it with me this weekend when I travel to see how it holds up in a hotel.", "verified": true, "helpfulness": "0/0", "author": "Kellie"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Deanna"}, {"rating": 3.0, "review": "The User interface is attractive. But screen mirroring is only compatible with Amazon devices and even popular brands like samsung and apple devices can't mirror their screen.", "verified": true, "helpfulness": "0/0", "author": "Arnab Pal"}, {"rating": 5.0, "review": "Easy", "verified": true, "helpfulness": "0/0", "author": "Nick Reeder"}, {"rating": 1.0, "review": "I would like to try this item but, unfortunately,  at the end of the purchase process  I got a message that it can't be delivery to PR.  However, when I select the product it says that it can be delivery to my location.  I believe that the restriction to delivery to PR was resolved a couple of years ago.  It will be great if somebody can clarify this.  Thank you!", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the stick. Easy to use and a decent number of apps make this my preferred device even though my smart tv has some of the same apps built in. The app interface is way better than those I have seen on smart tvs.", "verified": true, "helpfulness": "0/0", "author": "onlinepurchaser"}, {"rating": 3.0, "review": "PROS:The apps and presentation of movies and synopsis is \"high tech\" in  appearance.It was easy to install and navigate.It arrived on time and is $10 cheaper then all the other TV streaming media players.CONS:The video or movie will CONSTANTLY  need to \"rebuff\" or. \"Reload\". (Has nothing to do w the Internet connection)I highly recommend purchasing a ROKU. I hav a ROKU for each television in my house and never had problems. The only reason I purchased this Fire stick was because it was $10 cheaper and I was interested in trying something new.", "verified": true, "helpfulness": "0/0", "author": "GIA"}]