[{"rating": 5.0, "review": "I love it! Very easy to use and totally worth it", "verified": true, "helpfulness": "0/0", "author": "Tiffany damon"}, {"rating": 4.0, "review": "It came with minimal directions on the set up process. The product itself is was good.", "verified": true, "helpfulness": "0/0", "author": "Melanie Land"}, {"rating": 5.0, "review": "Very easy to navigate and auto set up if you have a prime membership! Only had for a short time but love it so far! I downloaded the free App, and use voice search.", "verified": true, "helpfulness": "0/0", "author": "Dudabuda"}, {"rating": 2.0, "review": "Same problem with the fire box, refuses to play HD content in HD", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/0", "author": "Kevin Marcantel"}, {"rating": 5.0, "review": "The firestick is so easy to use and it has a lot of features I didn't know about", "verified": true, "helpfulness": "0/0", "author": "Jennifer N \"Jen N\""}, {"rating": 2.0, "review": "Maybe I didn't do enough fine print reading,  but I understood this to be a way to stream movies and different tv shows for free if I was Prime. Apparently the apps are free, but require a subscription to view the movies. It's the same thing our Xbox and Kindles do. Just disappointed with myself for missing that tidbit of info.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It loses one star for cutting out every now and then.  The good news is that it resumes after a second or two without losing anything.  I especially appreciate being able to see all of my photo's and videos that I have taken on my Fire phone.  They go automatically to the cloud and are easily found and played using the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Stuberg"}, {"rating": 5.0, "review": "Wish I would have gotten when Oromo came out, great item, ditching time warner asap!", "verified": true, "helpfulness": "0/0", "author": "Margaret Bond"}, {"rating": 5.0, "review": "It did exactly what the description said. It was amazingly simple to set up and is very easy to use. I am having so much fun exploring all the options.", "verified": true, "helpfulness": "0/0", "author": "J. Hogan \"J9\""}]