[{"rating": 4.0, "review": "Love being able to watch shows without commercials", "verified": true, "helpfulness": "0/0", "author": "Fay Hayes"}, {"rating": 1.0, "review": "Absolutely the worst device I've used in a long time.  If Amazon wants to compete in the streaming business, it must do two things. 1) Fix its overall streaming strategy.  The streams you provide across all devices are low quality, barely SD let alone HD.  2) Develop a better streaming tool.I've been an Amazon user from the beginning and a technologist since 1992.  They can ship stuff fast, but they certainly cannot stream stuff fast.  I never have a quality issue with streams from Netflix using Chromecast or through a PS3 or AppleTV.  But, I tried this FireStick and it ONLY streams Amazon content with any regularity in quality (imagine that).  The HBOgo is out of sync (voice and video) and other platforms, such as watching Netflix, are low-quality streams when viewing them through the FireStick.  Furthermore, it is constantly warning you of \"low-bandwidth\" even though I have a 50MB verified downstream.  It drops it s wireless connection frequently and a number of other errors I've documented.  Load times are ridiculous just getting the device to \"unsleep\" can take several attempts and several minutes.  Anyway, don't waste your money.  Buy an AppleTV or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Arif R"}, {"rating": 5.0, "review": "excellent product. perfect price. 4thumbs up!!!!", "verified": true, "helpfulness": "0/0", "author": "dave"}, {"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "0/0", "author": "Kristi mitton"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "francisco barroso"}, {"rating": 5.0, "review": "Works great - love streaming from prime and works great with Sling TV! Only disappointment is I cannot stream to the stick AND fire tv box at the same time. If one of them is on and you turn on the other it disables the first. So much for trying to obsolete my cable subscription. Would be okay if you are the only person in the house but more than 1 person, more than one tv and you are out of luck.", "verified": true, "helpfulness": "0/0", "author": "forcefan"}, {"rating": 5.0, "review": "Easy to use, works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Hendrica Regez"}, {"rating": 5.0, "review": "Works great, I mostly use it for Netflix. I have a smart tv but its lags sometimes and it can get annoying. The control that comes with this is great but you will most likely loose it. If you do just download the amazon fire remote app, its great and works on almost any smart phone. The only thing  I do not like is that there is no off button, it always stays on. The only way to turn it off is to unplug the power cable. There should be a better way.", "verified": true, "helpfulness": "0/0", "author": "Isaac"}, {"rating": 4.0, "review": "I like this product; however, I thought any apps would be downloadable on the fire TV stick, not just a select number.", "verified": true, "helpfulness": "0/0", "author": "Chelsie Stout"}, {"rating": 5.0, "review": "Love it! Tons of shows and so many other services all-in-one!", "verified": true, "helpfulness": "0/0", "author": "Jerrod Nieman"}]