[{"rating": 5.0, "review": "I'm really enjoying the fire stick. So easy to install.", "verified": true, "helpfulness": "0/0", "author": "marilyn k struble"}, {"rating": 2.0, "review": "picture is not as clear and bright as normal broadcasting.", "verified": true, "helpfulness": "0/0", "author": "rbue"}, {"rating": 5.0, "review": "Better and cheaper than regular cable. Works great with WiFi that is also hooked up to several other devices. Very easy set up as well.", "verified": true, "helpfulness": "0/0", "author": "BStar436"}, {"rating": 5.0, "review": "It just came today!  It's so easy to set up. I watch Netflix on my Smart TV, so I wanted to be able to watch it upstairs.  Once I downloaded Netflix on my fire stick, I was off an running.  I am SO happy with it so far.  :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great device. $$$ savings on programming", "verified": true, "helpfulness": "0/0", "author": "James H.Manning"}, {"rating": 4.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Matthew Southard"}, {"rating": 4.0, "review": "so far so good.  if i don't get any suprises.", "verified": true, "helpfulness": "0/0", "author": "thomas  jorgensen"}, {"rating": 1.0, "review": "UPDATE: Amazon was kind enough to exchange my Fire Stick for a new one but guess what? Still useless. I can connect 3 iPhones, 1 iPod, 3 Kindles, 1 laptop, 1 desktop, 1 Xbox 360 & a Wii but not the FireStick.ORIGINAL: If I could give it a -1, I would. Every day I have to reset this stupid thing to connect to my wifi. No other device in my house has wifi issues. None. It's for my daughters' TV so of course I hear about it every time it stops working. When I do get it to connect, there's always some glitch or issue with streaming. It would be over-priced if it was free.", "verified": true, "helpfulness": "2/2", "author": "HillbillySid"}, {"rating": 4.0, "review": "just have to star using it more", "verified": true, "helpfulness": "0/0", "author": "Marilyn Cardwell"}, {"rating": 5.0, "review": "This product streams video and music exceedingly well.  Great user interface.", "verified": true, "helpfulness": "0/0", "author": "HarryCardi"}]