[{"rating": 4.0, "review": "Nice streaming device", "verified": false, "helpfulness": "0/0", "author": "Marissa Juan"}, {"rating": 5.0, "review": "I use it primarily to view Netflix. It took less than five minutes to set up and it works. What more could I ask?", "verified": true, "helpfulness": "0/0", "author": "G.B. FISHER"}, {"rating": 5.0, "review": "Easy to setup, easy to navigate. Satisfied buyer.", "verified": true, "helpfulness": "0/0", "author": "Sheron"}, {"rating": 4.0, "review": "Works as expected", "verified": true, "helpfulness": "0/0", "author": "Albert A Dameika Jr"}, {"rating": 2.0, "review": "The device itself is great BUT there are couple issues and deal breakers for me:(1) If you don't live in US you will NOT be able to enjoy Prime Instant Video even if you're paying for it as part of your Prime annual subscription. So I am limiting it to use it for Netflix and other stream services that doesn't have so ridiculous constrains.(2) Plex that is the app to stream local media that comes with the stick but is not that free as advertized.  You have to activate it paying extra 6 USD to activate it (If not you will get a 1 min playback) AND the worst thing is that it has bugs (constant requirement to re-activate your client until you remove and re-install the application again) plus the fact if your server doesn't support trans coding like mine (small NAS) then the Player is unable to play common formats like AVI or MKV.  Using the windows version of the Plex Home Theater doesn't have those issues and open these files.The only good thing for me was that I could side loaded KODI (formerly known as XBMC) that is FREE and opens any video in any format using any type of server.  But this is not part of the base experience of the device so I had to mess on Internet forums to overcome some these annoying issues.For now if I want to see Amazon Prime Instant Video I have to pay also for a VPN provider and do a VPN to get an US IP Address to circumvent the constrain but this adds costs just to have an stream line experience.I know that the intend of the stick is to access Amazon content and all the focus is there but for me is a very limited experience and it's a shame.", "verified": true, "helpfulness": "0/0", "author": "Kirk Steinklauber"}, {"rating": 2.0, "review": "I keep loosing wifi connection, then have to manually unplug and plug back in to reset. The wifi is not very strong, HD drops to SD all the time, which does not happen with Apple TV, or Chromecast.Hopefully there will a future update that can fix it.", "verified": false, "helpfulness": "0/0", "author": "Kash"}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Leslie"}, {"rating": 5.0, "review": "SO FAR I LOVE IT", "verified": true, "helpfulness": "0/0", "author": "PAUL D. ADELMAN"}, {"rating": 5.0, "review": "Easy set-up, pretty easy to use, still getting used to the menu", "verified": true, "helpfulness": "0/0", "author": "John A."}, {"rating": 5.0, "review": "Easy to install, inexpensive, and lots to watch with my prime membership!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]