[{"rating": 5.0, "review": "the applications are fast and works better than the apps on my smart tv...love it", "verified": true, "helpfulness": "0/0", "author": "wapiti"}, {"rating": 5.0, "review": "I already own two apple TV's but I bought a stick anyway because it was cheap and out of pure curiosity.  I have had it for less than a week and I have already been able to install XBMC and some other side apps and I can honestly say that this might take the place of my bedroom apple tv!", "verified": true, "helpfulness": "0/0", "author": "EFFZero"}, {"rating": 5.0, "review": " Amazon released a lower cost version of their Fire TV set top video player. This version comes on an HDMI stick similar to a Chromecast and Roku Streaming stick. The major difference is that the Amazon product is a full Android computer, complete with 1 gig of RAM and 8 gigs of flash storage. It costs only $39, about in line with those competing devices.The Fire TV Stick can run most of what the larger and more expensive Fire TV can run - with the exception of more involved 3D games with heavy system requirements. In my testing most of the casual games performed well.In addition to Amazon's streaming services the Fire TV Stick also works with YouTube, Netflix, and other services. HBO Go is the one exception.The Fire TV Stick is a great value - and perhaps a better value than the more expensive Fire TV. It's probably the most functional streaming device at this price point.", "verified": true, "helpfulness": "4/5", "author": "Lon J. Seidman \"lon@ lon.tv\""}, {"rating": 5.0, "review": "FANTASTIC.  LOVE THIS LITTLE DEVICE.  I just received my Fire TV Stick yesterday.  The installation was a piece of cake.  Of course, you have to have an open HDMI port to use it.  Once installed, connection to my wireless network was easy.  I have been an Amazon Prime member since September of this year. Since joining the free 30 day trial for the free 2-day shipping, I  also  started to watch streamed movies and TV series available at no extra cost (dropped Netflix) that comes with membership. I signed on to Amazon Prime after the trial period.  In order to enjoy these videos on my large TV, I had to Chromecast them from my computer_kind of a hassle.  With this Amazon Fire TV stick I can now watch these TV/movie offerings directly_no more computer in the equation.  The device is so easy to navigate with and to select what you want to see.  I am not going to reiterate all it can do_it can do a lot_because you should just watch the info promo on the product.  With the smartphone app coming soon, this is going to be an even sweeter device.  As a pause, fast forward or rewind for clarity kind of viewer, I love the fact that on the controller these functions are easy to do.  I am just learning how to take full advantage of all the features of this great device, but I am sold, it is a winner!", "verified": true, "helpfulness": "1/2", "author": "J. Ebner"}, {"rating": 5.0, "review": "My only complaint is that sometimes it stops playing music from amazon prime services, either sits with the \"loading...\" message on the screen or just does nothing at all.  All video streaming seems to work well.", "verified": true, "helpfulness": "0/1", "author": "Eric Van Handel"}, {"rating": 3.0, "review": "I was able to get this for $19 so no real complaints. It works fast and smooth andbhas great picture quality with the tvs it works on. that being said, my main tv is a 50\" samsung dlp and it will not work. Says not supported mode and thats a bummer for me. Also the hdmi plug doesn't seem to be exactly standard because it would not fit into 2 of my tvs. I tried for 15 minutes to plug this thing in and even spun the tv around. i compared it to an hdmi cord that plugs right in and the slot inside the fire stick where the terminals are is slightly smaller.  The extension it came with is similiar but i was able to get it in after almost breaking the hdmi slot on my tv. after all that it works great and on my other tvs it plugs right in. I want to give this 5 stars because the software is nice and easy to use. Ive not had a single slow down or buffer issue and it loads movies so fast. i just cant because of the compatibility issues ive had.  So to sum it up i have a 7yo Samsung dlp it will not work with and had a very hard time plugging in. i have a 3yo insignia plasma with the same plug issue but it does work after forcing it in. And i have three 32\" samsung leds about a year old that plug in fine and work also. So it seems that older tvs have the issues and thats sad because most newer tvs are smart withs apps and you really wouldn't need this for those.", "verified": false, "helpfulness": "0/0", "author": "starlord"}, {"rating": 5.0, "review": "Works great, easy to install.  Love it with my prime music.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really great product, easy to setup easy to use, now if I can just it it away from my kids so I can explore some more!!!", "verified": true, "helpfulness": "1/1", "author": "Keith A. Richmond"}, {"rating": 5.0, "review": "Amazing product from Amazon, love it!", "verified": true, "helpfulness": "1/1", "author": "Kathar"}, {"rating": 5.0, "review": "So far I have really enjoyed the Fire TV Stick.  I have been able to watch several movies and TV shows via Prime on my TV.", "verified": true, "helpfulness": "1/1", "author": "GMR"}]