[{"rating": 4.0, "review": "Works pretty well.  It compares to many of the other streaming devices out there.  I'm not a big fan of the layout though. I wish the interface was more like my Roku 3.  Does lose signal sometimes and needs to be reset, but that may be an issue with my router.", "verified": true, "helpfulness": "0/1", "author": "N. Lupacchino"}, {"rating": 5.0, "review": "I bought this for my daughter who was moving out with her friend and they love it!  They don't have cable and I felt sorry for them so I bought this so they would have something to watch!  Sure wish they would have had these when I left home on my own!  Lol", "verified": true, "helpfulness": "0/1", "author": "Cheryl Thompson"}, {"rating": 5.0, "review": "Absolutely love it!! Just what we needed", "verified": true, "helpfulness": "0/1", "author": "alyson solch"}, {"rating": 5.0, "review": "Easiest electronic device I've ever installed.", "verified": true, "helpfulness": "0/1", "author": "Janet"}, {"rating": 5.0, "review": "I love this thing!!!", "verified": true, "helpfulness": "0/1", "author": "Omar Martinez"}, {"rating": 4.0, "review": "I like the  ease of use but the picture quality is bad.  The stick makes it  look like a soap opera with character's movements unnaturally smooth.  It's the soap opera effect.  Can anyone relate?", "verified": true, "helpfulness": "0/2", "author": "Angela  Bach"}, {"rating": 3.0, "review": "Everything is good on this unit however the remote really sucks as the left right up down often run into eachother so when you try to go right sometimes it goes down.  The Roku, by far, a better remote and quicker navigation.", "verified": true, "helpfulness": "0/1", "author": "GRECO GACHES"}, {"rating": 5.0, "review": "One of the best purchases I've made, this is an awesome device!", "verified": true, "helpfulness": "0/1", "author": "Bryan Nauer"}, {"rating": 5.0, "review": "Awesome product.", "verified": true, "helpfulness": "0/1", "author": "Antonio Robinson"}, {"rating": 4.0, "review": "Works well after you get it configured to your internet.", "verified": true, "helpfulness": "0/1", "author": "R. Stoffel"}]