[{"rating": 4.0, "review": "The plug-in cord is too short.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth J Rasmussen"}, {"rating": 5.0, "review": "This is a great little device that provides many useful choices in content. I would highly recommend Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Woody Goulart"}, {"rating": 5.0, "review": "A great value, especially if you subscribe to Prime.  Easy to hook up; easy to operate.", "verified": true, "helpfulness": "0/0", "author": "Amazon Shopper - IA"}, {"rating": 4.0, "review": "Very happy with the fire stick. The only problem is I can't figure out how take off the movie or show off after I watch it", "verified": true, "helpfulness": "0/0", "author": "john arsenault"}, {"rating": 5.0, "review": "Superb! Greatly exceeded my expectations! We use it for Prime movies and television shows.", "verified": true, "helpfulness": "0/0", "author": "Polykid \"Polykid\""}, {"rating": 3.0, "review": "At times apps are slow", "verified": false, "helpfulness": "0/0", "author": "Sudhir Krishnan"}, {"rating": 3.0, "review": "Phenomenal product, easy to install, easy to use, exactly as advertised. That would warrant a 5-star rating.Product support: So far, Amazon's earned 0 stars. There seems to be some kind of problem with the authorization process at Amazon; my access to TV shows, movies, etc. that are \"included with Prime\" sometimes disappears. The only solution so far is to unplug everything (HDMI, power) from everything (TV, wall, receiver), wait a few minutes, and start over powering up and reattaching things. I'd think this was my problem alone except that other customers have experienced the same issue. The only helpful advice I received came from other customers' comments. Amazon has done nothing to correct the problem or help me find a work-around.", "verified": true, "helpfulness": "0/0", "author": "SA"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jeanette143"}, {"rating": 5.0, "review": "Thrilled have been able to get the Fire TV Stick at a great price however I have not used it yet I hear wonderful things from others that have it.", "verified": true, "helpfulness": "0/0", "author": "Pamela S"}, {"rating": 1.0, "review": "This thing does a poor job connecting to Internet. It always buffers so watching Amazon or Netflix is brutal.im returning mine unfortunately, maybe it's just this particular device.", "verified": true, "helpfulness": "0/1", "author": "David Ball"}]