[{"rating": 1.0, "review": "As the owner of the Fire TV I was quite keen to get the stick. So far it is not cutting it. The main reason I got it was for my kids to play Minecraft and at $20 it seemed worth it.- The stick does not support Minecraft.  (Also, Amazon, please add Clash of Clans to your library)- Another issue is my Amazon gamepad battled to synch with the stick.- The remote is flimsy and difficult to open. Whereas the Fire TV remote is very nice. If you decide to buy this as an option the price raises to Fire TV cost.- Finally, having to power it via USB and recommendation to use the brick makes this slim stick a bulky mess. One can only hope that somewhere in the near future that the stick is powered via HDMI.You are better off just getting the Fire TV, SERIOUSLY!*** As a streaming device I am still evaluating its performance. I did notice that at startup the software update sucked bandwidth horribly.", "verified": true, "helpfulness": "2/4", "author": "HowzitUSA"}, {"rating": 4.0, "review": "I am an owner of the google chromecast. I am also a prime member. The only difference, besides the games, is amazon video. I mean, i know theres more but the im talking about the main ones like Netflix, Hulu, etc. The connectivity that google has with its app is so easy! for example. if i am watching a show from Hulu, i can easily stream it to my T.V. With the Fire TV Stick, i would have to either use the app to use my phone as a remote or use the actual remote (which adds another remote to the furniture) to navigate and find the show i am watching. It got annoying to have to do all of that when instead i could easily just stream it from my phone to the chromecast.Now dont get me wrong, its an awesome device that i plan to keep for my next TV, but since i am spoiled with how the chromecast easily connects with all the streaming apps. I cant say that it will replace my chromecast. I Love Amazon and all their products but im sure a liitle update actually can and will replace my chromecast.", "verified": true, "helpfulness": "3/3", "author": "09GODSSON19"}, {"rating": 5.0, "review": "The Android app could use a little work but it's Excellent!  Functional, Tiny, Portable.  Yahoooooo!", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 5.0, "review": "The Fire Stick works great -- plain and simple.  Set-up was a breeze.  Instant access to Netflix, Amazon Prime and a ton of other stuff. The included remote control works perfectly.  I'm buying another!", "verified": true, "helpfulness": "0/0", "author": "KG \"KG\""}, {"rating": 5.0, "review": "Game changer!, my chromecast is now obsolete.", "verified": true, "helpfulness": "0/0", "author": "J Wyman"}, {"rating": 1.0, "review": "I was excited about this but it really is a piece of crap. I got it, plugged it in (yes the power cord is in a horrible place and required) it wasn't configured to my account as promised. I tried to get it set up on my own and no luck. I called Amazon and was told it was a known issue and will be fixed in 24 hours. I called back after a few hours and was told there was no known issue and after 1.5 hours on the phone they got it registered. I enjoyed it for a week and after watching a movie on Prime I went to find another and poof...no network. Mind you my other 8 devices are on it fine but not the Fire Stick. I put in my credentials again....that's all you can do...and nothing. Just get a Roku and be happy with a proven product. I have twice in less than a week unplugged my Fire Stick and put my Roku back in. It really is worthless, which is a shame because I like Amazon. I guess they need to get out of the hardware business.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a must have for any Amazon Prime member.  The stick is not as good as the FireTV box but it is very close.  I have the FireTV box in my living room and put the FireTV Stick in the bedroom and will use the stick when travelling.  It was really easy to set up and the voice app on the phone/tablet works great.  The remote that is included works just fine too!I have the HBO Go app on my Kindle tablet and phone, so no reason to believe the app won't be made available soon for the FireTV lineup.  I heard it may be by the end of December 2014.Again, it's a no brainer if you're a Prime member and if you're not it is a good entry device into streaming media players and it gives you a free month of Prime to start.", "verified": true, "helpfulness": "0/0", "author": "My $0.02"}, {"rating": 1.0, "review": "The product is super easy to set up; but from there it just gets bad.  You have to wait about ten minutes for the stick to do an upgrade.  Then a video is shown on how to use the system.  I am trying to watch Hulu and the stick is having so many issues streaming.  The screen is freezing, goes blank, only audio works and on and on.  And yes, it is plugged into the wall.  I think I am going to stick with a roku box for permanent ideas.  Im just not sure this product was ready for market.", "verified": true, "helpfulness": "2/4", "author": "Danielle"}, {"rating": 1.0, "review": "This product clearly has some weird issues with HDMI connectivity.  After plugging into my AVR,  it must have tried to configure CEC, and in doing so, shut down my TV and when the TV was powered back on, I had an error I had never heard of before.It literally takes a power cycle of the fire stick for video to be displayed.", "verified": true, "helpfulness": "3/5", "author": "Todd Brust"}, {"rating": 4.0, "review": "Finally a competitor for the Roku. I have this on my non-smart TV and it fills a gap in my entertainment. The ability to use a remote has turned into a real plus. I also have a Chromecast and get tired of having to use my phone to control the TV. If i want to use my phone there is an app for that. For Prime Members this is a must have. You get access to all  your Music, Photos, Apps, and Prime Movies. Not sure how useful it is for games, but it does that too.  the faster processor is pretty notable, and it responds immediately to any command. Big plus i have found is the 5GHz support to clear up the 2.4 for other things. A recent update fixed the Display Mirroring for Windows 8.1 and now I can mirror the display on my Surface 3, but this is display only not audio (like AirPlay)", "verified": true, "helpfulness": "0/1", "author": "jedi-mykal \"jedi-mykal\""}]