[{"rating": 5.0, "review": "This Item hardly needs another 5 star review. But I'll give it one anyhow.I have had a computer connected to my TV for as long as that has been possible. Therefore I didn't understand the purpose of this thing. Why would anyone want yet another \"Thing\" to deal with, when you can do the exact same thing with your computer. Still, I am a gadget nerd and I have been looking at this thing for quite a while. We cut our cable off almost 2 years ago and have been doing fine with the internet and an antenna. But recently, I saw this for $39 and thought what the hell. Let's see what the hype is about.Turns out that the fire TV stick is tuned up for watching internet based Media on your TV. Lol. No kidding right? But the point is it is many times better at feeding you media than your computer alone. The way you interface is much easier and far superior to using a keyboard and mouse. And further, I never would have thought of looking for half of the stuff that is available to you. I never would have gone looking for \"NOVA\" documentaries on my own for example. But seeing them offered was all I needed to be interested in watching them. We had Amazon Prime anyhow, and Netflix. Both items we used on the computer previously. I am a huge YouTube watcher, and that is here too along with a host of other things that I never really knew about before. And it’s all accessed with about the simplest remote I have ever seen. This gets 5 stars because it's simply brilliant. It is many times better at delivering internet based media to your TV than your standard computer setup. Far from being a gimmick, I wish I had got this lil gadget sooner.", "verified": true, "helpfulness": "0/0", "author": "SallyMacLennane"}, {"rating": 5.0, "review": "love it.  best thing i've bought in a while.", "verified": true, "helpfulness": "0/0", "author": "tman"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Judith A Harris"}, {"rating": 5.0, "review": "This has, so far, exceeded my expectations! I will be adding Sling TV soon for the trial-run.", "verified": true, "helpfulness": "0/0", "author": "Hapintn"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Janel F. Johnston"}, {"rating": 5.0, "review": "I love my Amazon fire stick! It's amazing!", "verified": true, "helpfulness": "0/0", "author": "Emily Einarsson"}, {"rating": 4.0, "review": "WORKS GREAT WITHOUT HAVING TO LOG IN WITH THE COMPUTER - PLUS MY SON LOVES THE GAMES", "verified": true, "helpfulness": "0/0", "author": "Jody Miller"}, {"rating": 5.0, "review": "I love the fire stick. It basically turned my 6 year old TV into a smart tv. It certainly is better than having to buy a brand new smart tv.", "verified": true, "helpfulness": "0/0", "author": "Bookworm"}, {"rating": 5.0, "review": "So happy with this purchase.  I have a WD media player that does similar things, but wanted something that was easily portable.  This definitely fits the bill!  I like how easily accessible amazon prime movies and shows are and the reliability of playback has been great.  Very little to no buffering as I experienced with other devices.  I would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "A. Young"}, {"rating": 4.0, "review": "its ok", "verified": true, "helpfulness": "0/0", "author": "sam691"}]