[{"rating": 5.0, "review": "This is awesome for binge watching!I wish Amazon would add Audible to the list of Apps.I strongly recommend Caller-ID (Fire TV Edition) by guidology. It is cool to see who is calling when you need to have your phone charging and it is not in plain sight.", "verified": true, "helpfulness": "0/0", "author": "G G W \"Old School Sci Fi\""}, {"rating": 5.0, "review": "Kids got this for their dad.  It is easy to use, works exactly as described.  Love getting all our subscribed shows on Netflix, Hulu, Amazon prime, etc. It's great!", "verified": true, "helpfulness": "0/0", "author": "Nancy O'Connell"}, {"rating": 4.0, "review": "Worked pretty well so far. No problems till date.", "verified": true, "helpfulness": "0/0", "author": "Gopalakrishna Kesavan"}, {"rating": 5.0, "review": "Works real well thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Much better than the Roku we had purchased.", "verified": true, "helpfulness": "0/0", "author": "Kendra Thomas"}, {"rating": 5.0, "review": "was more than expected.", "verified": true, "helpfulness": "0/0", "author": "Daniel A Canada"}, {"rating": 4.0, "review": "I am so happy with this and the availabity to watch so many more shows.  I gave it a 4 star rating because the streaming gets interrupted.", "verified": true, "helpfulness": "0/1", "author": "H. Miller"}, {"rating": 5.0, "review": "Love this little device. Great quality for a little price! Amazon does it again.", "verified": true, "helpfulness": "0/0", "author": "Matt W."}, {"rating": 3.0, "review": "So far.....I have to say that the Fire TV Stick has been underwhelming. The selection of material available to view is more limited than I had hoped.Maybe I just need to spend more time using it.....I hope so. There are so many times watching the programming on TV that I end up watching the rotating circle indicating buffering and waiting for the program to start.....then I give up in frustration. Maybe I will just return it.", "verified": true, "helpfulness": "2/2", "author": "Andrew P"}, {"rating": 5.0, "review": "Bought this for my 70 year old Dad. Set up was very easy and he doesn't have and trouble navigating for use.I'm buying a second one for me!", "verified": true, "helpfulness": "0/0", "author": "Ajtshead3"}]