[{"rating": 1.0, "review": "The stick keeps freezing during the tutorial video and then restarting. There is no way to skip it either. I hope they fix this with an update otherwise it's doa.", "verified": true, "helpfulness": "3/9", "author": "Samuel Luna"}, {"rating": 2.0, "review": "Here is my complaint, parental controls, and that is a deal breaker for me.  I also have a ROKU and several Kindles.  My complaint with Amazon video in general boils down to parental controls.  In my Amazon account settings I can set parental controls by putting viewing restrictions with either G, Family, Teen, or Mature.  So if I set parental controls to Teen, my children are not able to watch R, NC-17, TV-MA or Unrated.  Only issue is these movies are still shown in the available selections with the cover, they just have a lock on them.  If you are familiar with Netflix, if you set parental controls these movies don't even show up.  That is what I am looking for.  This leads to the Fire TV Stick, it basically does what I was looking for, and that is a ROKU like device for another television that will stream Netflix and Amazon video.  The parental controls you set on your main Amazon account will apply to my ROKU and all my Kindle devices, but it WILL NOT apply those same parental control settings to my Fire TV Stick.  So yes you can set parental controls on the Fire TV Stick on the device itself, but the only way to do so is to require a PIN every time a video is selected for viewing.  So this leads to two issues.  Once again all movies of all ratings are shown on screen.  So my children are able to see movie covers I wish they couldn't see.  Next issue, every time they want to watch a video, it requires me to enter the PIN.  So I have to physically go enter the PIN every time they want to watch the next episode of some 20 minute cartoon that I am fine with them watching.  So if you have children and parental controls are a concern for you, skip this device unless the parental control issues are improved/fixed.", "verified": true, "helpfulness": "4/6", "author": "Jon"}, {"rating": 2.0, "review": "UPDATE 12 - 5 -14I've fixed the greying issue on my tv screen so that is good but several weeks after owning the fire stick, my disappointment increases. The remote control response rate with the fire stick itself is very slow and it loses connection to my router a lot. It says that the router is not within range when it is right next to each other. I really would like to return it by will get charged a shipping rate of $6.95 which quite honestly just isn't worth it.I received my Fire TV stick yesterday and have been playing around with it for a bit. I have to say I'm a bit disappointed. I had high hopes because of all the great reviews on blogs. I did get it for $19 so it's not too bad. First off, it does not fit well into the HDMI port, it requires a bit of maneuvering. Second thing I noticed is that when I first plug it in, the brightness is normal and the same as if I was watching regular television. After a few minutes though, the entire screen starts to dim and has a gray overcast. I cannot figure out how to fix this and ruins the watching experience. Lastly, the interface is very cluttered. It is very hard to scroll or search for things which I guess I can expect since it is similiar to the Kindle Fire interface.", "verified": true, "helpfulness": "1/3", "author": "W. Chan \"book nerd\""}, {"rating": 3.0, "review": "I love the premise of it, but for whatever reason my tv keeps turning off when its in use. Idk what the deal with it is but hopefully I can figure it out.", "verified": true, "helpfulness": "0/2", "author": "William Chimel"}, {"rating": 5.0, "review": "WOW!  So far it is great and has done everything promised.  It does not come with much instructions and I had to use the TV remote to get started (which is much handier anyway).  Love how fast it is to stream.  I've only had it for part of a day.  If it last a year it will be great.  I do not know if I have to unplug my fire stick from the electrical outlet when I have finished, but tend to think I should.  That would be the only unhandy thing about it.  Somehow I bought a video I did not intend to buy.  My 16 mo. old grand daughter may have had a hand in that.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to install on tv, updated fairly quickly and easy to use.  Bargain at $19!  Love it.", "verified": true, "helpfulness": "0/1", "author": "md"}, {"rating": 3.0, "review": "Roku Stick is still better.Pros:-$20 when I bought it-Runs apps perfectlyCons:-Had to pay for PLEX app.-Remote has no voice search.-Had to pair every device in the house to cast youtube.-Failed to install update on first try. Required a power down.-Says that if I don't plug into wall I won't receive best performance or updates.-Came with my amazon account already logged in. Security issues if I bought this as a gift", "verified": true, "helpfulness": "0/3", "author": "MELISA PEREZ"}, {"rating": 4.0, "review": "Device is great. Quality of interface and image/sound delivery is very good.  It is certainly a better experience over Chromecast.  Prime users will get the most use out of it.  For others it is still good.I have one MAJOR negative that I certainly hope they resolve.  Our Prime membership is under my wife's email and I am listed as a Prime user.  I bought using my account which is technically Prime as I bought this for $20 and it says \"Prime\" on my account.  When prompted with the offer to \"Sign up for Prime\" I selected it thinking I would get more information as I was already a Prime user and maybe just needed to put my information in to activate or just learn more.  Wrong.  If you click the button you will be signed up and IMMEDIATELY CHARGED $99.  No warning.  No \"Are you sure\" message.  They just charge one of your cards on file and you've got Prime (or in my case, another Prime.)  I had to go in an end my membership after realizing what happened.Love Amazon but this was a bad user experience.", "verified": true, "helpfulness": "0/2", "author": "Geoff"}, {"rating": 5.0, "review": "I received both devices, installed, configured and updated without a hitch. For the price, this works great, no complaints and with the Prime Library, I had a blast using Miracast from my phones and tablets. Get yourselves one of these cool gadgets.", "verified": true, "helpfulness": "1/2", "author": "Art Rodriguez \"Javisin\""}, {"rating": 1.0, "review": "Received this today and I'm thinking it was a pretty big waste of money. We already had Amazon Prime and have used a Roku for years. We can watch our Amazon Prime shows on our Roku (as well as Netflix, Flixster, etc.) WITHOUT having to put in a pin before each show. Yet if we put the settings on the new Fire TV stick to allow us to watch a show, my elementary aged child can purchase anything from Amazon. Ridiculous. So far this is just a matter of settings. We now won't be watching shows on this thing as I don't see anything new it can offer us - except for more hassles in unwanted purchases or me having to put in the pin every 22 minutes for a new show. So next I went to check out the games. I picked one to purchase but it said that it requires a game remote - and we don't have that either. So I guess I can purchase some game remotes if I want our Fire TV Stick to get any use, but right now it's just going to collect dust.", "verified": true, "helpfulness": "2/13", "author": "Andrea"}]