[{"rating": 5.0, "review": "wonderful, great never heard of movies, love that it comes loaded with the music  you have purchased", "verified": false, "helpfulness": "0/0", "author": "Jennie Torrell"}, {"rating": 5.0, "review": "this product works great.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "great way to get all the amazon prime video features on our tv.. We are a no cable family and the fire stick makes it all okay!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"popeye65\""}, {"rating": 5.0, "review": "We are a non-cable family and long-time prime members.  We always used to watch netflix through our playstation, but I never hooked up my amazon prime account to the playstation out of laziness.  This arrived and we just plugged it into the TV and we were ready to go with all the amazon prime tv and movies!  It's easier and faster to move through than the playstation as well.  We haven't done too much with the apps, but were able to watch Monday night football through the espn app, which we wouldn't have been able to get on our regular TV.  The fire stick also puts on a nice screensaver of changing landscape phots and then puts my TV to sleep after about a half hour if we aren't actively watching a program or using an app.  Very cool and worth $40.", "verified": true, "helpfulness": "0/0", "author": "K. Field \"quiltingkate\""}, {"rating": 5.0, "review": "Love this!  I preordered it last fall before it was actually available and received it shortly before Christmas. Used it for the first time this week. Setup was VERY easy. Capabilities are exactly as advertised. Only this I wish Amazon would do is add Vudu app so it can literally use a single device for everything. Great job Amazon on this design!", "verified": true, "helpfulness": "0/0", "author": "JOHN A COX"}, {"rating": 3.0, "review": "This is an amazing first try for Amazon. But they need to fix the way it connects to the internet... I don't know how else to say it other then it looses connection on someday constantly then other days it'll work perfectly. And my router is in the same room so it's not a distance issue. Glad I didn't pay full price for this item.", "verified": true, "helpfulness": "3/3", "author": "Customer family of 5"}, {"rating": 5.0, "review": "I love this fire stick so much!  It was delivered and it took me maybe 10 minutes to set up and was watchingnetflix and my amazon video library, it was so easy I almost could not believe it.  thank you amazon foran amazing way to watch my movies.  totally happy", "verified": true, "helpfulness": "0/0", "author": "alaskanrose"}, {"rating": 5.0, "review": "Great Product, Great Price. Buy It", "verified": true, "helpfulness": "0/0", "author": "musiclover"}, {"rating": 4.0, "review": "I love it for the specs, but the color seems a little off compared to other hdmi devices connected to my tv. (Computer, PS4, PS3, Roku 2 XS)", "verified": true, "helpfulness": "0/0", "author": "Daimon Christopher Sodapop Toppi"}, {"rating": 5.0, "review": "Awesome Device!", "verified": true, "helpfulness": "0/0", "author": "Ginger Gravois"}]