[{"rating": 4.0, "review": "A sweetheart of a memory stick. The operating system is still a little dodgy,hopefully they'll fix this.", "verified": true, "helpfulness": "0/0", "author": "R. Zeek Seseika"}, {"rating": 5.0, "review": "Man, this thing works well.  I have an older, store-brand TV in the bedroom, and this plugged in and worked fine.  The TV I have supports 1080 resolution and had an HDMI port, but I thought it would be too old given what the item description says.  It took me longer to find my stupid router password than to set the thing up.  To be honest, I just changed the password and then updated our half dozen other networked devices as I could not get the older password to work or whatever....  Now, I am wondering why I paid so much extra for a \"smart TV\" for the living room when I could've gotten the same quality in a \"dumb\" one and just added something like this.  Live and learn.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 1.0, "review": "August 2015 Update: REALLY DISLIKE THIS FIRE STICK! : I wish I could give it Zero Stars. Within about two months (of course, after the 30 day return period), it stutters & stalls & freezes - I have to constantly unplug it to reset it. FORGET ABOUT A GOOD BINGE VIEWING RAINY DAY - having to reset it is enough to drive one crazy!  I really, really, REALLY do NOT like it. / Original Review: Do NOT order the SLING TV / FIRE STICK Bundle !! I got on Amazon to order a new streaming device because after 5 years my netgear is done. I wanted to upgrade to a Roku streaming stick. Well, the promo for \"Buy 3 months of Sling TV & get a free Fire Stick\" popped up, so I checked it out & researched the Fire Stick & decided to try it. I paid the $65 for Sling TV, but then when went to order the Fire Stick, it is not even available until the end of April, first of May. So, I immediately called Sling TV to cancel because they do not have a \"freeze your service option\" & I wouldn't be able to use it until the stick gets here in May (I was going to reorder when they were back in stock). Well, Roxanne at Sling, then the Supervisor Joe at Sling, refused to refund my money. So, I gave them $65 fifteen minutes before I called them  for something I cannot use until MAY & then I will not get three months worth of service out of it that I paid for. That is NOT the way to treat customers when you're trying to build a business!", "verified": true, "helpfulness": "0/0", "author": "SK \"SK\""}, {"rating": 4.0, "review": "It is good deal for $99 per year", "verified": true, "helpfulness": "0/0", "author": "Peter Chow"}, {"rating": 5.0, "review": "I love my fire stick.", "verified": true, "helpfulness": "0/0", "author": "Rachel Wallace"}, {"rating": 3.0, "review": "It worked fine when I installed it. However, a few days later, I could not get Amazon Fire Stick to appear on the TV screen. The screen was just black, after switching von TV to HDMI. I called for help and was told that there is a general problem with the Amazon network, which should be cleared up in a day or two. After three days, I called again and was told that I have to disconnect the power supply and then reconnect it. I did this and it worked. However, it seems that every time to want to use Firestick, it is the same problem. I have to disconnect and reconnect the power source. Is this normal? It is very inconvenient to have to do this every time.Sincerely,Erik Meyererikmeyer40@hotmail.com614-638-5380", "verified": true, "helpfulness": "0/0", "author": "Erik Meyer"}, {"rating": 5.0, "review": "Have it on two TV's and works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This has many really good features- my only complaint is it does not fast forward very well- very hard to gage how far you have gone forward on a show- also seems to freeze a lot- frozen picture while sound goes on.", "verified": true, "helpfulness": "0/0", "author": "susie roberts"}, {"rating": 5.0, "review": "Easy to installIntuitive to use.", "verified": true, "helpfulness": "0/0", "author": "MLM"}, {"rating": 5.0, "review": "I am amazed of all the new shows that I can watch on the fire tv stick.  It has opened up a new world for me. Very pleased", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Pecoraro \"Pat Pecoraro\""}]