[{"rating": 1.0, "review": "I purchased this device because it was on sale during the last prime days. I tried for about an hour and switched back over to using my Roku instead. I am not that into Amazon Prime content and find locating what I want to view hard with their user interface. So it is now just one of things I may send with my child to college, if they will even want it. Basically, I spent my money on something I will ever use.", "verified": true, "helpfulness": "0/0", "author": "Patrick P. Pueringer"}, {"rating": 5.0, "review": "Fire stick has been great! :-)", "verified": true, "helpfulness": "0/0", "author": "Jesse L."}, {"rating": 4.0, "review": "The design is sleek and nice but remore control requires a little force when pressing the keypad...To me, Roku remote is much easier to use when scrolling, selecting and navigating through screens.", "verified": true, "helpfulness": "0/0", "author": "Abbie"}, {"rating": 5.0, "review": "Very easy to install and operate", "verified": true, "helpfulness": "0/0", "author": "Carl"}, {"rating": 5.0, "review": "I'm beyond happy I purchased the fire stick. Has about every single TV app available", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Donna Brooks"}, {"rating": 5.0, "review": "Sweet. Works perfect !", "verified": true, "helpfulness": "0/0", "author": "ruben"}, {"rating": 5.0, "review": "Hi plugged in with my daughter watching movies on Amazon prime within 10 minutes.  Very easy to figure out with only about six steps in the instruction manual. Even somebody who is not very up to speed on the latest technology would not have a problem managing the set up of this item. I am going to be getting rid of my Google Chrome. It worked really well but because I have an Amazon prime account, this one serves me better and has a remote!", "verified": true, "helpfulness": "0/0", "author": "Sarah A Long"}, {"rating": 5.0, "review": "Free with 3 months of Sling, um, okay, duh!", "verified": true, "helpfulness": "0/0", "author": "andy powers"}, {"rating": 5.0, "review": "Love it. Easiest way to keep all your online streaming subscriptions in one place. Also I don't know of an easier way to browse Prime.", "verified": true, "helpfulness": "0/0", "author": "Red_Tile"}]