[{"rating": 5.0, "review": "Easy to install.Works like magic. I am having to upgrade my internet speed. I have been running on the 20 Bytes- I needed to upgrade to the 30 Bytes. very reasonable price.", "verified": true, "helpfulness": "0/0", "author": "Carl D Curry"}, {"rating": 5.0, "review": "Amazing, definitely worth the money, for sure.", "verified": true, "helpfulness": "0/0", "author": "Lynn"}, {"rating": 1.0, "review": "Most content requires additionall payment even with a prime acct.Waste of time & money", "verified": true, "helpfulness": "2/3", "author": "John Schmoeger"}, {"rating": 4.0, "review": "This is a great little gadget with many movie titles, games and  apps. The only problem some of the preloaded games and apps will never be used.  I was disappointed that dailymotion and vimeo app had very limited search capabilities. I could not download  some of the many popular video search browsers but for the price I guess it is what should be expected. This is definitely better than the Google Chrome Stick which I took back it just wasn't worth it. I enjoy using this Fire Stick when there is nothing on tv it helps ease the boredom.", "verified": true, "helpfulness": "0/0", "author": "Rita Farias"}, {"rating": 5.0, "review": "love it.  best thing ever!", "verified": true, "helpfulness": "0/0", "author": "Maureen A."}, {"rating": 5.0, "review": "Very easy to use and a great bonus for Prime users", "verified": true, "helpfulness": "0/0", "author": "Chris Flanary"}, {"rating": 1.0, "review": "t, for w", "verified": true, "helpfulness": "0/5", "author": "Richard McDonald"}, {"rating": 5.0, "review": "I purchased the Fire TV stick to replace a Roku streaming stick, and I found that Fire Tv stick is WAY more responsive, FASTER, and it has a load more storage.  Also Voice search using your smart phone is nifty.  This, I have to say, is the best and most cost effective way to turn your dumb tv into a SmartTV!", "verified": true, "helpfulness": "0/0", "author": "Robert S."}, {"rating": 5.0, "review": "Very pleased with the Fire TV Stick.  Has the apps I wanted (thank you for Sling TV!), stable platform, and an intuitive remote.  Feels like the finished product it is.  Would like to see some support for a web-browser to reach the streaming sites that currently don't have apps (Crunchyroll), and support on the Home screen for non-Amazon 3rd party apps, but I'll be patient and let the developers do their thing.", "verified": true, "helpfulness": "0/0", "author": "Craig Zank"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Kenneth J Derck"}]