[{"rating": 1.0, "review": "Dont like the fact that it has to be plugged into an electrical outlet.", "verified": true, "helpfulness": "0/1", "author": "gregory morris"}, {"rating": 5.0, "review": "love the product and the capabilities it has", "verified": true, "helpfulness": "0/0", "author": "JP Collins"}, {"rating": 4.0, "review": "This is great!! Very easy to set up and navigate through. Bought this to use on the road in hotels and unless it's an open wifi meaning no login screen is needed, you can't use this without a travel router. I heard a browser of some sort will come in an update so it can be used in hotels with login screens for Internet.", "verified": true, "helpfulness": "0/0", "author": "John D Niewoit Jr"}, {"rating": 5.0, "review": "Great!  A wonderful addition to our home entertainment repertoire.", "verified": true, "helpfulness": "0/0", "author": "Charles Donohue"}, {"rating": 5.0, "review": "I was very happy with the Firestick. It is simple to install and the on-screen instructions are easy to follow.", "verified": true, "helpfulness": "0/0", "author": "Mark Gasvoda"}, {"rating": 5.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "Nipper220"}, {"rating": 5.0, "review": "AESOME!!!! Just what we were looking for. We plan to get another one for our daughter too.... great product, easy to use and very effective....", "verified": true, "helpfulness": "0/0", "author": "shawn"}, {"rating": 4.0, "review": "I love the Fire TV Stick.  The only reason I only gave it 4 Stars, is because the stick gets quite warm.  It concerns me if this is going to be a Fire Hazard.  It's a great item, as it's quite user Friendly.  I would recommend this to anyone, but also let them know, that at least mine gets very warm.", "verified": true, "helpfulness": "0/0", "author": "PruskyD \"Beauf\""}, {"rating": 4.0, "review": "Works great. A little laggy at times navigating the UI but no issues watching videos. I wish you could cast your own video to it though. I plan to give this to my parents so they can use my account to watch Prime instant video. So far it's stayed logged in.", "verified": true, "helpfulness": "0/0", "author": "bb999"}, {"rating": 5.0, "review": "This is great, have been thoroughly enjoying it with our prime membership!", "verified": true, "helpfulness": "0/0", "author": "Keith William Darling"}]