[{"rating": 5.0, "review": "Good  product , great  price.", "verified": true, "helpfulness": "0/0", "author": "OL'FART"}, {"rating": 5.0, "review": "Just got my Fire TV stick and I love it. Super user friendly and I've had no problems!", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 5.0, "review": "Great, affordable device for streaming through HDMI", "verified": true, "helpfulness": "0/0", "author": "Primetime4x4"}, {"rating": 1.0, "review": "It won't stay connected to my wifi. I have a good signal and all my other devices stay connected. This one just won't work. I will be returning it since I can't use it.", "verified": true, "helpfulness": "0/0", "author": "Bev Rdz"}, {"rating": 5.0, "review": "This is great. I am saving 200.00 a month on my cable bill by using the the fire stick. If you want to lower your cable bill I strongly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Ralph Boutwell"}, {"rating": 1.0, "review": "This product is literally a joke. If you got 40 bucks to burn try using it more than 10 feet from wifi and see how funny it is. Amazon should be sued for selling this product. They're customer 'support' will not work with me or answer my questions. All I know is.. if you don't have some world class wifi, you ain't watching nothing. BE WARE", "verified": true, "helpfulness": "1/1", "author": "Christopher Mason"}, {"rating": 5.0, "review": "Love it!  Brings us hours and hours of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Millie S. Wilson"}, {"rating": 2.0, "review": "I didn't realize it had to be plugged in to operate. I wouldn't have purchased it had I known that.", "verified": true, "helpfulness": "0/0", "author": "Greg Murphy"}, {"rating": 5.0, "review": "Easy to setup and use.  Worked right out of the box.  I like the content on Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Jim Para"}, {"rating": 5.0, "review": "Super easy to setup. Good pricing too.", "verified": true, "helpfulness": "0/0", "author": "Blue Daisy"}]