[{"rating": 4.0, "review": "I like it, it is super to be able to just watch stuff on the tv without messing with cables and cords and whatnot. I just wish it was easier to search for stuff. It might be me that is the problem, maybe I haven't spent enough time with it yet. But evn if I can't figure it out, i am still happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Kathleen C."}, {"rating": 5.0, "review": "Rad. Better than chromecast by far", "verified": true, "helpfulness": "0/0", "author": "swaggasaurus rex"}, {"rating": 5.0, "review": "Fire stick works great faster to start then the Roku 3500R. Not as many video apps yet though.", "verified": true, "helpfulness": "0/0", "author": "Rick \"Rick\""}, {"rating": 5.0, "review": "LOVE it!", "verified": true, "helpfulness": "0/0", "author": "Michell Gour"}, {"rating": 5.0, "review": "Great device. I bought it mainly for sling tv but it works great for amazon content. The Amazon prime content works great. I really like the prime music and additional video apps. Only down side is the usb needing to be plugged in ruins the sleekness of the device and adds wires.  Also the app that you can download to control the stick isn't great. I don't like the pull down and talk option on the app.", "verified": true, "helpfulness": "0/0", "author": "BZ"}, {"rating": 4.0, "review": "Very convenient at an affordable price !!!", "verified": true, "helpfulness": "0/0", "author": "Mildred L."}, {"rating": 5.0, "review": "I love this! It is so easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "sabrina"}, {"rating": 5.0, "review": "It took awhile to get my fire stick but it's well worth it.  I had another machine that would do the same thing as the stick but it was slow and I often lost my internet connection.  When I plugged in the FIRE STICK it was instant speed.  I have a pretty good flat screen TV but it's not the new SMART TV with all of this built in.  Now I feel like I do have a new TV.  The fire stick is easy to use and performs beautiful!", "verified": true, "helpfulness": "0/0", "author": "K. R. Schmidt \"Jake\""}, {"rating": 3.0, "review": "At one time I had the Fire TV Stick, the Chromecast and the Roku 3 all plugged in at the same time. The Chromecast was the slowest and was constantly buffering movies. The Fire TV Stick was not bad but it somehow seemed limited in its offerings outside of Amazon and in its ultra simple remote. If price were not an object the Roku 3 is by far the fastest, broadest device going. The Search function is fantastic and the remote has a lot more controls and a jack to plug in the included earbuds.  If you can afford it spring for the Ruko 3 which has now been reduced to 86 bucks.", "verified": true, "helpfulness": "0/0", "author": "Saul Nathanson"}, {"rating": 5.0, "review": "I have the Chromecast but sometimes like to stream content via Amazon with my prime membership or rent/stream a movie.  I have a PS3 but got very tired of using the controller and wanted to streamline my entertainment center.  Don't get me wrong, I still use my PS3 for gaming and blueray.  This is also a great addition for I can also play my music from Amazon cloud through my surround sound speakers.", "verified": true, "helpfulness": "0/0", "author": "james"}]