[{"rating": 5.0, "review": "I bought this when it was on sale for Prime users. I wanted it to see if it would be easier to watch Prime shows than on my blue ray. I'm very happy. If anything, it is continuous play on series! I have been waiting forever for this! Of course, like Netflix, it will stop after a few, but I'm ok with that. I enjoy not having to keep going back to click on the next episode.I also like using my fire HDX as a remote.It was worth 20 bucks for me.", "verified": true, "helpfulness": "1/1", "author": "donella m."}, {"rating": 5.0, "review": "Pretty awesome. Best out right now. I bought mine through staples online since Amazon has none in Stock.", "verified": true, "helpfulness": "0/0", "author": "J. Rorrer \"philiprr\""}, {"rating": 4.0, "review": "I own 2 and I will be buying another.  The remote works great and the Fire stick is very easy to use.  The only thing I don't like is that it occasionally drops the internet connection so you have to unplug the USB from the wall charger, then everything works great again.  I wish that the search function also searched Netflix, but I get that this is an Amazon product so I understand why it doesn't.", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 5.0, "review": "Works great. As advertised", "verified": true, "helpfulness": "0/0", "author": "ROBERT STEHLY"}, {"rating": 4.0, "review": "Works fairly well. Glad I was able to get it on a prime deal for 19 bucks. Wish there were more game apps available for the included remote. Do not expect to use the second screen function with a 2013 Kindle Fire HD.", "verified": true, "helpfulness": "0/0", "author": "Kenny B"}, {"rating": 5.0, "review": "Easy installation and easy to use. Great product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The movies appear to show very dark.", "verified": true, "helpfulness": "0/0", "author": "Eugenia"}, {"rating": 4.0, "review": "How do you get the battery  compartment opened I have tried everyway I could and can not manage to open the battery compartment.Finally found in comments how others had this problem and got it opened.Like the stick and it is simple to operate.Deducted a star for poor info on how to open battery dept.", "verified": true, "helpfulness": "0/0", "author": "Eddie Wils \"EJ\""}, {"rating": 3.0, "review": "I'm still getting to know the device, but it did disappoint me that after setting up and connecting the Fire Stick, it is supposedly out of range of our home network.  So I have to check more into this since every other computer and smart phone in our house can receive our wi-fi network signal.", "verified": true, "helpfulness": "0/0", "author": "Patricia Pringle"}, {"rating": 4.0, "review": "It works faster and better than my old Roku stick. The price is definitely right... I'm sure it's a loss-leader type thing for Amazon, especially at the pre-order price. In fact, I bought two and I'm not even sure what to do with the other one! I wish the buttons on the remote lit up though because it's difficult to use in the dark. I haven't tried to use it in concert with my Kindle Fire yet, but that could be very cool!", "verified": true, "helpfulness": "0/0", "author": "FDR Jones"}]