[{"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "Javier Rodriguez"}, {"rating": 4.0, "review": "Overall, this is a great product and has replaced my Chromecast. I had some issues with the Chromecast and it became unreliable. When I saw I could grab this for $20, I knew it was at least worth it to take a shot. It has exceeded my expectations. For right now I use it for Netflix and Amazon Prime's movies, shows and music. The interface is easy to use and the remote works great. Setup was quick and easy and it hasn't had an issue in over 2 months of use. Casting from my phone as come in handy on occasion too. I might just grab another one for the other TV.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Love it! So easy to use! Set up easy as can be!", "verified": true, "helpfulness": "0/0", "author": "Sarah Jackson"}, {"rating": 5.0, "review": "We love being able to watch programs without always going back to the computer to look for the next thing to watch. We live in Minnesota, so January and February are big months for watching TV.", "verified": true, "helpfulness": "0/0", "author": "Linda Gridley"}, {"rating": 5.0, "review": "Happy Camper here - recent purchase of new Samsung tv (not smart) with available HDMI port - not being technically savvy - I was able to get this item going and am now enjoying tons of movies, concerts, youtube with $99/yr Amazon prime - if you have kids or want to have access to tons of movies or music concerts (at your leisure) - who needs a smart tv when you can purchase a fire stick that enables your tv to be smart and stream media ... love, love, love it!!  Without Amazon prime - there is still a lot available but adding prime is like having whipped cream on your dessert every day all year long - who wouldn't want that??", "verified": true, "helpfulness": "0/0", "author": "miatagirl"}, {"rating": 5.0, "review": "Just as good as our Fire TV Box. I like the box better but this is just as good.", "verified": true, "helpfulness": "0/0", "author": "rockergirl15"}, {"rating": 3.0, "review": "One thing bad thing I've noticed is doesn't allow me to have \"HBO Go.\"", "verified": true, "helpfulness": "0/0", "author": "Tony Bottom \"Tony B\""}, {"rating": 4.0, "review": "This was a gift for my Wife and she has enjoyed it. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "William Beverly"}, {"rating": 5.0, "review": "Best little gadget Chrome you got competition with this!!!!!", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "If you have WIFI in your home this allows you to stream programming to your tv. Very nice.", "verified": true, "helpfulness": "0/0", "author": "Donald W. May"}]