[{"rating": 5.0, "review": "Great to watch all my FREE Prime Member Movies and so easy to connect. The screen saver photos are stunning. Great deal for Prime members! Get your under 48 hour shipping and movies for 100 bucks a year. Heck, I have gotten some of my stuff within 18 hours with Prime. This thing even sweetens the deal more.", "verified": true, "helpfulness": "0/0", "author": "Regular Joe"}, {"rating": 5.0, "review": "A MUST HAVE ON ALL TVs", "verified": true, "helpfulness": "0/0", "author": "Laura Brown"}, {"rating": 1.0, "review": "The firestick constantly freezes and it is almost impossible to watch anything on it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This expands my viewing choices immensely. I love it.", "verified": true, "helpfulness": "0/0", "author": "Donna Donaldson \"aislinnluv\""}, {"rating": 4.0, "review": "Far superior to the Chromecast I was using, although it was tricky to install. Had to go to the help videos. It would be helpful if the navigation circle had arrows on it so I would have realized what it was.", "verified": true, "helpfulness": "0/0", "author": "BunnyLady"}, {"rating": 2.0, "review": "Kept freezing up. Went back to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "joewit"}, {"rating": 5.0, "review": "Exelent product! !", "verified": true, "helpfulness": "0/0", "author": "Hugo"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "margaret cornn"}, {"rating": 3.0, "review": "Great media service with a very good selection of media. With Amazon Prime it's even better. However, the WiFi is not as strong as my ChromeCast and it only worked reliably when my router was very close to the FireTV stick. Luckily I have a two router setup in my house because it would not work with where my main router is located about 70 feet away, but my ChromeCast was working fine. Tech support told me it worked best with 5MHz Wi-Fi routers, but it works fine with 2500 Hz router as long as it's a really strong signal. Excellent once it's working.", "verified": true, "helpfulness": "0/0", "author": "TC"}, {"rating": 5.0, "review": "This is by far my favorite streaming device. Easy to install, handy remote, and great on screen options. The home screen is a little busy and requires a bit of scrolling but the performance and options compared to competitors can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Brandon Pettit"}]