[{"rating": 5.0, "review": "I love it now that I got it to work. You absolutely MUST use the USB power supply that is included with the unit. I couldn't fit it into the space behind my flat tv so I used another that was on a 90 degree angle. It acted so weird that I finally returned it for a replacement. When the new one acted the same way I tried it on my other TV set which had plenty of space behind and Voila' it worked perfect on the supplied power supply.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far so good.  Working as it should. Bought it just to connect to Netflix so it has provided that.", "verified": true, "helpfulness": "0/0", "author": "tony johnson"}, {"rating": 5.0, "review": "It was so easy to install and use. The cost was perfect for all that you can use it for,  Besides watching movies, you can play games and look at your photos on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Catherine E. Lambert \"Cathy L.\""}, {"rating": 5.0, "review": "have it on a small flat screen in a spare bedroom and it's a great way to get prime and Netflix in the room without having to buy a new tv or blu-Ray player", "verified": true, "helpfulness": "0/0", "author": "Jon Jarrett"}, {"rating": 5.0, "review": "Love it, plug and Go with my Sony TV.. Tried many other items, none worked..", "verified": true, "helpfulness": "0/0", "author": "Joanna"}, {"rating": 4.0, "review": "I am amazed at the # of movies available. Games & T V  showers are available too. It is easy to install. If I can do it, anyone can! This one devise added a whole new avenue of entertainment for my wife and I. We love it. Gotta go. We are going to watch a movie of our choice! FREE!", "verified": true, "helpfulness": "0/0", "author": "Anthony R Collins"}, {"rating": 1.0, "review": "Very disappointed,", "verified": true, "helpfulness": "0/2", "author": "vita"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick worked beautifully.  I have a Samsung TV and was told I had to get the Samsung TV Internet stick (which didn't work).  So I tried the Fire TV Stick and in less than 5 minutes was watching Netflix.", "verified": true, "helpfulness": "0/0", "author": "Bridget Arce"}, {"rating": 1.0, "review": "I've bought 2 of these stupid things. Both times they work great for like 3 months and then one day, for no apparent reason, they decide to just stop connecting to my network even though it says the strength is \"very good\" and even though my wi-fi is working fine with my other devices. Nothing fixes the problem. Not restarting. Not unplugging and restarting. Not even resetting back to factory settings. Nothing. The first time it was after a powerful thunderstorm and I thought maybe it was related to lightening. So I sucked it up and bought a new one. This time it just quit. For no reason. After only 3-4 months of daily use. Grrrrr", "verified": true, "helpfulness": "1/1", "author": "Vixie"}, {"rating": 5.0, "review": "WORKS GREAT much better than the M/S one and about 1/2 the price.  the only item that I can find fault with and this is really pickey and it is because I am not 12 years old, I am seventy eight  and all of this stuff has just came about lately.  Expand the instructions a little for us older folks.", "verified": true, "helpfulness": "0/0", "author": "John F."}]