[{"rating": 2.0, "review": "Soooo frustrated right now. It worked fine for a couple of weeks and now it won't work correctly. It keeps loosing connection to the network and when it is connected the remote is unresponsive or wonky. We thought the (brand new) batteries it came with might need replacing but that did not alleviate the problems we have been encountering.", "verified": true, "helpfulness": "1/1", "author": "Jenn H."}, {"rating": 4.0, "review": "Love it so far!", "verified": true, "helpfulness": "0/0", "author": "Cody Ross"}, {"rating": 3.0, "review": "I really really want to LOVE the Fire TV stick.  The concept is awesome and being able to access my Prime music, cloud storage, etc all on my tv PLUS watching our favorite shows - it's a great idea!  BUT...we've only had a handful of times where the stick has actually worked like it should since it arrived last week.  It takes forever to stream music.  It's also constantly saying it can't access our internet or is \"connected with problems\" when if we access the Prime Video player app via our PS3, it's working just great that way.  I hope Amazon comes up with a fix for these wifi connection issues because if they do, I can then give this a 5 star rating.  until then, it's a great idea but not worth the frustration.", "verified": true, "helpfulness": "0/0", "author": "Rfeew"}, {"rating": 5.0, "review": "Good buy", "verified": true, "helpfulness": "0/0", "author": "survivor \"beenthere\""}, {"rating": 5.0, "review": "Amazing value.  Downside vs. the fire tv box, it is noticeably slower, and the remote it comes with is not quite as awesome.  Otherwise, like I said, amazing value, it does everything the full box can do.  I also plan to take this with us on the road so hotel rooms and grandma's house can also have my kid's shows readily available.", "verified": true, "helpfulness": "0/0", "author": "Brian F"}, {"rating": 5.0, "review": "Love my Fire TV Stick......binge watching as I type this :)  Works great....setup easy....no problems!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Many reviews states that the interface was slow but to be honest, I don't think it is. I am used to using an Xbox or did player for Netflix, Hulu, etc. and this is a great experience.", "verified": true, "helpfulness": "0/0", "author": "Chris Shepard"}, {"rating": 5.0, "review": "Great streaming device", "verified": true, "helpfulness": "0/0", "author": "rb \"rb\""}, {"rating": 5.0, "review": "Excellent device. Easy to install and set up. Allow access to Amazon prime benefits.", "verified": true, "helpfulness": "0/0", "author": "Jairball"}, {"rating": 5.0, "review": "with all the reviews up already, there's little point restating the obvious with lot's of words... suffice to say, this stick is a great value and works very well for its intended purpose: primarily accessing amazon content.i bought this on a lark, mostly because it's cheap, new and interesting.  although i've been a prime member for a long time, i'm not much of an amazon service consumer, beyond the improved shipping that prime offers.  for media, i've used various servers over the years and am now simply running upnp/dlna from my router (an Archer AC model).  one of my TVs, a samsung model, does dlna but can't handle certain encodings, so i thought maybe the fire tv stick will save the day...anyway, in my haste, i didn't really read much about the fire tv stick and was mildly disappointed to find that the app store is woefully inadequate.  very little useful organization and almost no selection.  but sideloading works!  sure enough, a number of sites mention this and it took all of 10 minutes to download, install and configure XBMC on this little stick.  another site recommended using llama to configure the home screen icon of an app you'll never use, making it a cinch to launch XBMC without going through some very tedious menus. ...and i have to say XBMC runs very smoothly with no stuttering or noticeable menu delays.now that this stick does something i need, it will stay on my tv and maybe i will explore more of the features amazon actually had in mind for it.", "verified": true, "helpfulness": "0/0", "author": "pog"}]