[{"rating": 4.0, "review": "Simple to boot-up and easy to use", "verified": true, "helpfulness": "0/0", "author": "John Kummers"}, {"rating": 5.0, "review": "Purchased it for my sister who is clueless when it comes to technology.  Having used Chomecast before I figured the Fire Stick would be easier to operate for her as it eliminates the step of syncing the phone to the tv.  So far so good.  She has figured it out and has had no issues with it.  Great deal for $19. If it goes on sale again I would snatch another one up.", "verified": true, "helpfulness": "0/0", "author": "Tara"}, {"rating": 1.0, "review": "My fire stick did not work properly.  I tried to exchange it for another one and it was nearly impossible for them to just send me a new one.  So I just returned the item.  Would have loved for Amazon to just do an exchange.", "verified": true, "helpfulness": "2/2", "author": "Julie Dunn"}, {"rating": 5.0, "review": "I was accessing  Amazon Prime and Netflix through my DVD player. It was terribly slow and cumbersome.  The Fire TV stick has made all the difference in the world. It is so much easier to get to Prime shows and the other apps. Great item.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I have had the Fire TV Stick for about 2 weeks and so far, I have no complaints. The Fire TV Stick remote is a big help and combined with the fact that your smartphone or tablet could double up as an alternate remote makes this product even better.Setup was a breeze and I was up and running in under 5 minutes. I predominantly use this for Netflix in my exercise room.Good Product!", "verified": true, "helpfulness": "0/0", "author": "Thomas Fan \"ET\""}, {"rating": 5.0, "review": "This is exactly what I needed to turn my \"dumb\" Blue-Ray and \"dumb\" TV into a system that allowed Amazon and Netfix.", "verified": true, "helpfulness": "0/0", "author": "Caballero Solitario"}, {"rating": 5.0, "review": "Me and my grand kids love it.", "verified": true, "helpfulness": "0/0", "author": "Sacramento D."}, {"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "curtis williams"}, {"rating": 5.0, "review": "Once I got it up and running, love it", "verified": true, "helpfulness": "0/0", "author": "anita giampa"}, {"rating": 3.0, "review": "Having problems with the remote", "verified": true, "helpfulness": "0/0", "author": "Jackie McLean"}]