[{"rating": 3.0, "review": "I bought this as a gift for my parents.  They have an older Samsung 50\"(sorry I don't know the exact MFG PN) and unfortunately it wasn't compatible.  It did work with the newer TVs they have in the house though.  Semi disappointed but it works great with newer TVs.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 1.0, "review": "constantly freezes up, rarely works for an entire movie. I have several video over wifi devices that work flawlessly most of the time so it's definitely not my network.", "verified": true, "helpfulness": "0/0", "author": "John Berger \"John\""}, {"rating": 4.0, "review": "Simple to use, just wish it didn't have to be plugged in to work...didn't know that before buying it.", "verified": true, "helpfulness": "0/0", "author": "satisfied"}, {"rating": 3.0, "review": "The games are crap. I guess I should have done more research!! I got the fire tablet in December for my daughter which allows me to download pretty good and fun games for her. I assumed the tablet would sync with the fire stick since both devices are on the same account. WRONG... The half way decent games aren't free therefore leaving a small selection of crappy games.", "verified": false, "helpfulness": "0/0", "author": "Mesha Klish"}, {"rating": 2.0, "review": "My chromecast can hold an internet connection but this one can't.", "verified": true, "helpfulness": "0/0", "author": "C"}, {"rating": 1.0, "review": "This product is extremely buggy. Biggest waste of money I've spent. It has constant connection problems when you wake it from sleep mode, often requiring several restarts.", "verified": true, "helpfulness": "1/1", "author": "Michael A. Jones"}, {"rating": 5.0, "review": "Much easier than Roku, because of voice search. Our go to device now.", "verified": true, "helpfulness": "0/0", "author": "Tim D from Dallas \"Tim\""}, {"rating": 5.0, "review": "The best stick I spent my money on", "verified": true, "helpfulness": "0/0", "author": "sharika williams"}, {"rating": 4.0, "review": "Great for streaming Netflix and Amazon Prime. Wish it had more channels.", "verified": true, "helpfulness": "0/0", "author": "Mark E Thoms"}, {"rating": 5.0, "review": "Excellent device", "verified": true, "helpfulness": "0/0", "author": "Vicente Perez"}]