[{"rating": 1.0, "review": "My Sony Bravia TV was manufactured in 2008. I thought that was pretty new. However, this fire stick will NOT work on televisions manufactured before 2009. If this was mentioned before I ordered it, I didn't notice.  It was a big disappointment", "verified": true, "helpfulness": "0/0", "author": "Eric M. Hanson \"Wine Guy\""}, {"rating": 5.0, "review": "Easy Peasy! Love it! Will buy another. Between the Fire Stick and Apple TV we can watch everything!!!!", "verified": true, "helpfulness": "0/0", "author": "Maman"}, {"rating": 1.0, "review": "Doesn't allow me to watch CURRENT shows...for free", "verified": true, "helpfulness": "0/3", "author": "Aaron Carbins"}, {"rating": 4.0, "review": "Very easy to install and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "S in CO"}, {"rating": 3.0, "review": "Problems exist with establishing a stable wifi connection between stick and modem\\wifi router.Purchased this specifically for watching NetFlix. Many other apps available, some good, some OK,some you need an amazon prime account to utilize.Expected a more consistent wifi connection", "verified": true, "helpfulness": "0/0", "author": "rockinct"}, {"rating": 5.0, "review": "Just love love it", "verified": true, "helpfulness": "0/0", "author": "maria matos"}, {"rating": 5.0, "review": "Can't say enough about Fire TV! As an avid Android user, I love this device! I cancelled my DirecTV service after my contract ran out and have officially gone to an all-streaming household with this as one of the centerpieces. I love that you can sideload Android apps to it from your PC that don't come from the official store; in this way you can fully customize it as you want, just like any rooted Android device. Almost anything you may want to watch on regular TV, cable service or smart TV has a way to get it working through your Fire TV, whether paid service like Sling TV for cable channels (including standalone HBO without a traditional TV service subscription using HBO Now) like AMC, History, ESPN, etc. or any one of the free apps out there you can install (including ones that aren't necessarily on the up and up, if you know what I mean, but I won't get into that here, that's what search engines are for!)  Of course, Hulu, Netflix and Amazon Prime video are available to use as well as an almost endless amount of other streaming apps. Should have done this a long time ago! Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Lenny"}, {"rating": 4.0, "review": "It's nice just wish more movies were included with the prime membership.", "verified": true, "helpfulness": "0/0", "author": "db"}, {"rating": 5.0, "review": "I love this little thing, so small and powerful!", "verified": true, "helpfulness": "0/0", "author": "Eric DuPont"}, {"rating": 5.0, "review": "works great for my kids", "verified": true, "helpfulness": "0/0", "author": "kevin ramirez"}]