[{"rating": 5.0, "review": "I never knew about this technology. Now I don't have to connect my laptop. I love this product! My son bought it for me.  I can now watch movies from my TV by using WiFi.", "verified": true, "helpfulness": "0/1", "author": "zenobia Rhyner"}, {"rating": 5.0, "review": "It took less then tem minutes for this senior citizen to get it up and running and to watch my first movie. FANTASTIC!!!", "verified": true, "helpfulness": "0/1", "author": "Julieann"}, {"rating": 5.0, "review": "Absolutely love love this product! I am so glad I purchased. I don't have any cable in my home and I was able to install this very easy!", "verified": true, "helpfulness": "0/1", "author": "Lee N Heredia"}, {"rating": 4.0, "review": "I'm liking it so far.  We've had it hooked up for about a week.  I also have a Roku and there's a huge difference in the search option.  Roku shows me everything available while the Fire stick is consistently pushing Amazon only content at me.", "verified": true, "helpfulness": "0/1", "author": "Jaime"}, {"rating": 4.0, "review": "Remote is nice but I like the chromecast better.", "verified": true, "helpfulness": "0/1", "author": "MacGyver"}, {"rating": 5.0, "review": "AWESOME!!!!", "verified": true, "helpfulness": "0/1", "author": "Freda brooks"}, {"rating": 5.0, "review": "Love it! Incredibly easy to use, particularly with the app for you phone", "verified": true, "helpfulness": "0/1", "author": "garbageman"}, {"rating": 5.0, "review": "Got this when Amazon was having their big sale, mainly because our toddler threw away the Roku remote and so far, so good! The husband loves it! For sure worth the $24! It's perfect for people without smart tv's!", "verified": true, "helpfulness": "0/1", "author": "Kimberly"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/1", "author": "donald thiessen"}, {"rating": 5.0, "review": "It over heats and stopped working after 6 months. Amazon has replace it.YEAH Amazon.  I noticed that it is warm while in hibernation mode...hmmm", "verified": true, "helpfulness": "0/1", "author": "Prime Member Pat"}]