[{"rating": 5.0, "review": "Fantastic.  What a great way to watch movies.  Love Amazon.", "verified": true, "helpfulness": "0/0", "author": "Harry R. Davies"}, {"rating": 5.0, "review": "Love the fire stick had a couple of issues initially with my fairly new tv.1.firestick inserted into hdmi one and for some reason the tv would not recognize anything plugged into port one? I then tried hdmi port two same issue no signal.I then tried unplugging the firestick from the tv and the wall outlet let it sit for a few and then connect firestick back into power outlet only figured it would boot up first and then plug unit back into the tv this still gave no signal from hdmi port.I am not really quite sure how I thought the next step would work but it did.Here is how I got the tv to recognize firestick through hdmi port.I removed the usb cord from the charger and plugged the end that was in the charger into a usb port on the tv then I plugged the other end into the firestick and inserted firestick into hdmi port one.I then selected hdmi port one on the tv input menu and the firestick was recognized as it should.This problem was on a tv that is seven months old strange however if you have a tv with usb this may be a work around for some having  this particular issue.Now the good stuff set up was really easy once recognized ,wireless set up was easy and streaming quality was impressive netfix no stutter or drops.App selection is large and the voice recognition remote purchased seperately works great so much easier to search titles.All in all love this thing beyond initial issue its great.Would reccomend to anyone.", "verified": true, "helpfulness": "1/1", "author": "ALICE"}, {"rating": 5.0, "review": "I purchased one of these for my bedroom - which is not a smart TV and in the meantime I got a new TV in the living room and it is a smart TV and has the Amazon app built in.  When the TV in the living room started having connectivity issues I brought the Fire Stick from my bedroom and well - I just ordered another one.  The difference is amazing  No lags - no hangs - better picture.  Wow...", "verified": true, "helpfulness": "1/1", "author": "The Analog Kid"}, {"rating": 1.0, "review": "limited choices", "verified": true, "helpfulness": "2/3", "author": "Z"}, {"rating": 5.0, "review": "Works much better than using the Wii", "verified": true, "helpfulness": "0/0", "author": "Russell orton"}, {"rating": 5.0, "review": "Excellent Device, best Netflix/Hulu/Amazon Prime player I have, and I have a lot of them.  It's capable of quite a lot if you side load apps.  Has Bluetooth so you can connect keyboard/mouse/controller/remote.  Seems to have enough  power.  Runs XBMC.  With the remote control included, you can't beat it for the price.", "verified": true, "helpfulness": "0/0", "author": "Patrick Bush \"Loki\""}, {"rating": 5.0, "review": "We are very happy with our Fire TV stick..  The menus are very easy to navigate and find what we are looking for.  I love all of the options for the free Prime movies and shows. I do find that we rent movies more than I expected since we search for all kinds of different movies for the kids.  It is very convenient to download to our iPads and take it on the go!", "verified": true, "helpfulness": "0/0", "author": "happylady"}, {"rating": 5.0, "review": "After sideload some interesting softwares, you will never need other boxes on my TV.", "verified": true, "helpfulness": "0/0", "author": "dminer"}, {"rating": 5.0, "review": "Amazing product so easy to use", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "Love this thing no regrets you won't either", "verified": true, "helpfulness": "0/0", "author": "Michael Mullins"}]