[{"rating": 5.0, "review": "We love it. My Fiancee loves the variety of programs.", "verified": true, "helpfulness": "0/0", "author": "Dorothy"}, {"rating": 2.0, "review": "Unresponsive, laggy, doesnt pick up wifi connection well, poorly optimized apps. General frustration. wouldnt reccomend.", "verified": true, "helpfulness": "0/0", "author": "Bobby"}, {"rating": 1.0, "review": "While the fire tv stick is a great concept it falls down on execution.  A fairly *large* number of users including myself have consistent issues with it disconnecting from wireless, or at least refusing to actually stream content without constant reboots.  For proof see this thread on the forums with over 600 current posts:http://www.amazon.com/forum/kindle/ref=cm_cd_pg_pg22?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdPage;=22&cdThread;=Tx2CDOG0K31UBSBThat comes up as the *top* google search item when you search for amazon kindle fire tv stick disconnects.I *love* the interface overall, and wish it worked consistently, but then considering I got mine during the $20 introductory offer I can't really complain for the price, and i still actively use it, simply rebooting every hour or two while using it, holding out hope that one day Amazon will fix the issue.  Unfortunately you'll find on that thread that even contacting amazon support about it simply ends up continually doing factory resets, or various reboots that temporarily fix things until the problem starts again, or eventually offering a replacement stick that ends up with the same issue.  There appears to be a design flaw in the hardware somewhere along the line.  Unfortunately I can't recommend it to anyone who expects things to \"just work\"", "verified": true, "helpfulness": "1/1", "author": "Jonathan Haase"}, {"rating": 3.0, "review": "Good product!  Kids love the games!  Only problem is the wi-fi range.  Signal doesn't go the walls to my middle bedroom.  Had to move kid's bedrooms, in order for right kid to be able to use it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far I like the Fire TV.  I have three!!!", "verified": true, "helpfulness": "1/1", "author": "Pipsqueak"}, {"rating": 2.0, "review": "Such potential. Ordered two while there was a discount.  One said connected to wifi, but all apps said it wasn't connected.  Not much can be done without apps on wifi.  Since wouldn't work, gave one to my sister, never heard back.  Gave the other unopened to a coworker who had the same issue.", "verified": true, "helpfulness": "1/1", "author": "BK"}, {"rating": 5.0, "review": "I was on the fence about cutting to cable cord but I am beyond happy with my purchase of the Fire Tv Stick and the apps for watching shows and movies. I haven't even scratched the surface of all that it offers and I am thrilled with it. The initial set up is so easy a child could do it, and I love the remote..", "verified": true, "helpfulness": "1/1", "author": "Catherine Dana"}, {"rating": 5.0, "review": "This device is awesome!  Its amazing how much content is available.  We just cut our satellite services and I am completely amazed by the Amazon Fire TV Stick.  I only wish I would have bought it sooner.", "verified": true, "helpfulness": "1/1", "author": "SeanMVIA"}, {"rating": 4.0, "review": "Great streaming item, and I must say--an upgraded streaming device when compared to chrome-cast.", "verified": true, "helpfulness": "1/1", "author": "jorge"}, {"rating": 5.0, "review": "It was everything I heard it would be.", "verified": true, "helpfulness": "1/1", "author": "Christine L Edwards"}]