[{"rating": 5.0, "review": "A little stick that can do a whole lot.", "verified": true, "helpfulness": "0/0", "author": "Bill Walden"}, {"rating": 5.0, "review": "Super easy to use and install, ordered Netflix with it as well.  This is exactly what I was looking for!", "verified": true, "helpfulness": "0/0", "author": "Brooke Dando"}, {"rating": 5.0, "review": "Easier than a smart tv remote!Be sure to set up 'one click' for everything on your amazon account to access 'pay for' and 'free' applications.", "verified": true, "helpfulness": "0/0", "author": "Dawn Clarke"}, {"rating": 4.0, "review": "Easy to setup and works good. Sometimes the shows are a little jumpy but that maybe my router.", "verified": true, "helpfulness": "0/0", "author": "David c stone"}, {"rating": 5.0, "review": "Purchased this with the current deal going on with Sling TV. We are a cord cutting family and used the PS3 as our primary device to view television. A friend told me about the Sling TV promotion and I am very impressed with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Ortega \"Gabe\""}, {"rating": 5.0, "review": "Item is awesome. We'll never be bored with TV again. Delivered on or as close to promised time as possible due to weather.", "verified": true, "helpfulness": "0/0", "author": "Steve w"}, {"rating": 5.0, "review": "Have had no issues -- it was easy to install and enjoying Amazon prime as well as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Threekrees"}, {"rating": 4.0, "review": "I love the Fire TV stick.  This allows me to watch Fire RV on other sets in the house.  This will also be nice for the guest rooms the next time we have company or especially kids that do gaming.  They can hook in from the guest room(s). We have Fire TV in our main room living room.  Technoloy is wonderful and this gives me a chance to catch up on series, etc.  while I work in the kitchen, etc.  A few challenges...We have our large screens flush mounted to the walls an wiring is hiden into walls.  It is not easy to reach the stick dock, even with the extension piece, but can be done.  Also, the commercial makes things look much easier (re: the dude with the seashell).  I do have to use the extra plug in cord to get coverage, so not a simplistic wireless environment.  I leave the stick plugged into the TV I mostly use for the Fire stick, and unplug/retract the cord when not in use.  Otherwise, it is an out of place cord, dangling down under the TV.  Not everyone has their TV on a stand, etc.  Overall, I just love having this capability.  Technology is wonderful!  Thanks for the entertainment!", "verified": true, "helpfulness": "0/0", "author": "Samantha E. Whitaker"}, {"rating": 5.0, "review": "Hoping I can update this review with a higher score after I hear from amazon.Just got a brand new stick for my sling TV. However my remote will not connect out of the box. I tried all the troubleshooting online, switched batteries. I can occasionally get it to work if I unplug the unit from the wall and plug it back in. Once out of every 4-5 times. I am going try the phone remote app and see if it is more successful.When I got it to work the speed and video quality was great. I hope this remote issue it just a small bump in the road. I really want to give a higher score but can't right now.Update 2/: Amazon got in touch with me right away.  It's working and it's fantastic! Very fast and great for streaming. Love the sling app it works great and very easy to use.Putting the batteries in the remote can be a challenge. The cover is very very hard to take off. That would be my only complaint at this point.", "verified": true, "helpfulness": "1/1", "author": "shopper1 \"PS3/bluray plyr\""}, {"rating": 4.0, "review": "It stops working after a couple days use... then i have to keep it off and reconnect to the internet after a day or so and not to mention it loses internet connection in the middle of watching a programe ... all that is a total of one star other than that this peice of equipment is amazing to add to your telivision expiriance and i would highly recomend buying one if you use your tv seldomly", "verified": true, "helpfulness": "0/0", "author": "thc \"Jack\""}]