[{"rating": 5.0, "review": "I absolute love this thing. The interface is clean and responsive. The remote is super responsive but a little clicky. I would buy these as gifts if there was any in stock. Im also in love with the youtube app.", "verified": false, "helpfulness": "0/0", "author": "John Antonio"}, {"rating": 5.0, "review": "Great product for a great price.", "verified": true, "helpfulness": "0/0", "author": "Ronald Ramirez"}, {"rating": 3.0, "review": "It's probably great if you have an ISP that provides high speed internet of more than 1.5 mbps. That said, I have even had difficulty with standard definition movies running without having to buffer in the middle of it. This is no improvement over what I had without the stick.", "verified": true, "helpfulness": "1/3", "author": "Coliwabl \"coliwabl\""}, {"rating": 5.0, "review": "Works as expected, quick and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install, intuitive remote and good content.", "verified": true, "helpfulness": "0/0", "author": "J. Soler \"Xbox 360 gamer\""}, {"rating": 5.0, "review": "Fire TV Stick is amazing!I thought Apple TV was great; Fire TV Stick is even better!The installation was easy. The remote control works smoothly. The selections are similar but different from Apple TV, so having both is an excellent choice. The price is about one third the cost of Apple TV ($35 vs $100).If you are a Prime subscriber, Fire TV movies are free. You can watch all the TV & movies you want. You really don't need cable TV anymore. Cut cable loose & save your money.The screensaver pictures are outstanding & pleasing to watch.Apple has some catching up to do.", "verified": true, "helpfulness": "0/0", "author": "Donald Dustin \"dsquared\""}, {"rating": 5.0, "review": "Every thing about this tv stick is amazing but the remote of this thing is really the big deal.It's seating in the palm of the hand because its compact size and the you can navigate without looking at the remote.Amazon engeneers put a lot in to this device trying to make it the best tv stick in the market and in my opinion the did it.", "verified": true, "helpfulness": "0/0", "author": "Avraham"}, {"rating": 2.0, "review": "Okay, but Roku stick is a much better value.", "verified": true, "helpfulness": "0/0", "author": "CNY \"UPSTATE NY\""}, {"rating": 5.0, "review": "I received my Fire Stick on 12/12/14 and so far so good.  I am loving it. Very user friendly.  I will update again in a month or so..", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 5.0, "review": "I'll have to hand it to you Amazon, you out did yourself and exceeded my expectations.  I dare say that this device is better than my Chrome Cast.", "verified": true, "helpfulness": "0/0", "author": "Sean T Stewart"}]