[{"rating": 5.0, "review": "Love the fire stick.  Had bought my husband one for the garage, and my roku died, so I got one for me.  Love, Love it.", "verified": true, "helpfulness": "0/0", "author": "T. Faircloth \"#1hillstreetfan\""}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "satified customer"}, {"rating": 2.0, "review": "I would love to know how this item works, however, our not incredibly old TV is not compatible with it. Crome Stick works just fine.  Amazon you really need to ask for the TV model in order to ensure the fire stick and TV will work together before purchase.", "verified": true, "helpfulness": "0/0", "author": "Jennifer W."}, {"rating": 4.0, "review": "Took only minutes to set up! Remote made it really easy to navigate Prime and other services. A good investment to make my TV \"smarter\".", "verified": true, "helpfulness": "0/0", "author": "Bill Rehaume"}, {"rating": 1.0, "review": "Let me start by saying amazon is one of the BEST companies out there in my opinion. Their customer service is always top notch and the quality of most products is always very good. I don't know where that ball got dropped with this!  I ordered the firestick for an extra TV in my workout room and once I got it set up, it works great BUT it took me almost an hour to get the batteries into the remote...and you can't set up (or use) the firestick without the remote. The back of the remote is nearly impossible to get off, therefore preventing you from being able to get the batteries in. If this was just a fluke or \"operator error\" on my part I would have never considered giving this product a \"one\", but when I went online to see if anyone else had similar issues, there were hundreds/thousands of posts about the same issue. Knowing that this is an issue with so many people and not fixing it prior to selling more is just negligent. I was frustrated beyond words trying to get this open and was using scissors tinted and wedge it open...not smart but when you are frustrated, you just want to figure the task out.  I was able to get the remote open safely but someone is bound to be not so lucky and really hurt themselves.  Unfortunately there is not really a great alternative for this product out there if you want to watch amazon prime but consider yourself warned that you either have to be a \"muscle fit body builder\" to get the remote open or beyond patient. Good luck!", "verified": true, "helpfulness": "0/0", "author": "kristin"}, {"rating": 1.0, "review": "This is my 1st post ever. I have a Roku Stick, Chromecast (student deal), and got the Fire TV stick (Free with Sling TV) today.Setup was easy. But I switched off the TV and turned the TV back on, Fire TV wouldn't work. Called support and was trouble shooting for an hour. They were going to send in a replacement device.Cons:Stupid design - The power port is on the left-side. It blocks all the other HDMI ports. Roku & Chromecast are neat, the power port is in the rear. Why would someone keep the power port in the side?2) The power adapter is flat and wide. It blocks 2 of my power plug slots. Roku has an iPhone Style power adapter, sleek and tall, so that it doesn't block other plug points.I would definitely not recommend this stupid device, even if its free.", "verified": true, "helpfulness": "1/1", "author": "Satheesh S."}, {"rating": 5.0, "review": "We received our Fire TV Stick today and LOVE it!!  It took about 5min to get it up and going, and that includes the little tutorial video and entering passwords for Netflix, etc.  It couldn't have been easier.  Love that it is so small but works so well.  We were watching college basketball on Watch ESPN and there appeared to be no lag time.  This is a great product and we will be ordering another one!!", "verified": true, "helpfulness": "0/0", "author": "Chellie Slovak"}, {"rating": 2.0, "review": "Not impressed, especially with the user interface, way to complicated/messy. Makes me realize how good Apple TV actually is.", "verified": true, "helpfulness": "1/1", "author": "gg878"}, {"rating": 1.0, "review": "It works, it is easy to setup, even without external USB power and more than 30 feet away from router, it picked up signal, it is updated, it is connected to wireless... and it was awesome, it was all I have wanted,  it worked with true HD and true sound...Then I have configured the parental control, requiring a pin for purchases, and with strong feeling of security happily went away to help my wife setup a dinner table and bragged all about all those new cool features... and bam... in less than 5 minutes my 3 years old kid managed to rent a movie for $5.99What? How? It was locked... and amazingly in settings it was showing that it is locked.... ?!?!Well... we have watched a good movie. Kids are in bed now, And I am crying and printing return label... This awesome and wonderful gadget is going back home to Amazon, it is dangerous.", "verified": true, "helpfulness": "0/0", "author": "Alex P."}, {"rating": 1.0, "review": "It never works. Always drops its connection and will freeze  when trying to watch anything, especially Netflix.  Bought two of these and tried to use in our new house, neither work. Since it's updated its Always says \"connected with problems\" . Not worth it, get a roku.", "verified": true, "helpfulness": "1/1", "author": "Emmanuel G."}]