[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Margie baird"}, {"rating": 3.0, "review": "Requires much more bandwidth than its counterparts as the picture quality is better", "verified": true, "helpfulness": "1/1", "author": "elweaselgrande"}, {"rating": 4.0, "review": "I love the ease of use!  I love the accessibility!  I love the variety!  It is great.  My biggest complaint is there are no social media apps.  I would love to be able to check facebook, instagram, twitter, etc...", "verified": true, "helpfulness": "2/2", "author": "Becky Kuhn"}, {"rating": 5.0, "review": "I pulled the trigger on a pair of these during the $19 blowout special when the Fire TV Stick was announced.Originally I had planned on giving them as gifts, but one day decided to open one up and try it out....Holy cow.I will sum it up as best I can -- after using the Fire TV stick for about a month, I am pretty sure we're going to be able to completely get rid of one of the cable boxes in our home and save a few bucks.  The apps available are great (the kids get a ton of use out of the Disney app) and I am sure more are coming soon.The included remote works great, and the now-released iOS companion app also works great for controlling the Fire TV Stick.The single issue I've seen with it is that sometimes the apps where you have to slug in your account info for your TV provider (again, for Disney) seem to lose their authentication credentials, causing the app to not work.  The fix is pretty simple, but doesn't seem like it should be this way -- hoping a future firmware upgrade resolves this.All-in-all, an amazing value.  Amazon absolutely has a winner on it's hands.  Do not hesitate to buy this!", "verified": true, "helpfulness": "1/1", "author": "Craig A. Liess"}, {"rating": 4.0, "review": "I think that it is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "fj"}, {"rating": 5.0, "review": "Simple to install. Very easy to use once installed. Easy to navigate through the various options of playing games, watching TV shows and/or movies. Excellent entertainment choices. Try it, you'll like it!", "verified": true, "helpfulness": "0/0", "author": "lowpost10"}, {"rating": 3.0, "review": "My husband and I are disappointed with the Amazon Fire TV Stick. We love Amazon.com and order from it nearly daily, but this is a disappointing product. We expected Amazon to have the latest videos available, like Blockbuster Now or Redbox. Instead, we have to PAY for videos as old as 2010 or older. There's also no web browser, so we can't watch streaming video from the internet. We just bought a Roku 3 and installed it yesterday. So far, we're much happier with it than with the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Lilah L."}, {"rating": 5.0, "review": "Love it! Super easy to set up.... would recommend to anyone.  Cutting out some of my cable expenses. ..tired of paying to watch in my other rooms.", "verified": true, "helpfulness": "0/0", "author": "donna"}, {"rating": 2.0, "review": "The Fire TV Stick is everything I was hoping...except Netflix pretty consistently goes into a buffer state and gets stuck at 25% for a minute before going back to the show with a decreased quality in picture or giving me an error about not being able to play this right now. I called Amazon and ran through the troubleshooting steps (adding the dongle, resetting device, uninstall & reinstall netflix), which seemed to help for a couple hours only. I really just want one device that all apps work on. Hopefully the Netflix app will get a fix.Update: Returning Fire TV Stick...continued problems with buffering and video quality on both Hulu+ and Netflix. My PS3 only has issues with Hulu+ so I'll stick with that for now and maybe try a Roku.", "verified": true, "helpfulness": "0/0", "author": "Amber"}, {"rating": 5.0, "review": "Very happy with this item. Gives lots of variety of shows, movies and other videos to choose from.", "verified": true, "helpfulness": "0/0", "author": "Mary Sullivan"}]