[{"rating": 5.0, "review": "I am madly in love with this gadget.", "verified": true, "helpfulness": "0/0", "author": "greatgary"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Timothy S. Doering"}, {"rating": 4.0, "review": "I pre-order this when it was on sale for $20. I already have an AppleTV but thought I'll give this a try. It's interesting playing Flappy Bird on this. I mostly use this for Netflix through.", "verified": true, "helpfulness": "0/0", "author": "Mimi"}, {"rating": 2.0, "review": "It's probably a decent media device, however it was promptly returned to Best Buy when I realized I needed to supply billing information just to download free apps like Netflix. Sorry Amazon, you lost me. The included hdmi extension was nice though, since my tv didn't offer enough clearance for the stick.", "verified": false, "helpfulness": "0/0", "author": "Max"}, {"rating": 5.0, "review": "I have a chromecast and some Android computer stick my brother gave me for Christmas. Of the three the Fire Stick is far superior. The remote makes it easy to use and the unit is very stable compared to the other two devices we own which would log out of Netflix or freeze occasionally. The only advantage of the Android was browsing ability.", "verified": true, "helpfulness": "0/0", "author": "Greg Collins \"Maverick\""}, {"rating": 4.0, "review": "Easy set up and works great so far. Pretty awesome for the price", "verified": true, "helpfulness": "0/0", "author": "SSJr"}, {"rating": 5.0, "review": "I like the fire tv we have in the other room, I got this for free with sling tv.  The stick was for our guest bedroom, it's better than roku, but spend the extra money and get the fire tv for your main television", "verified": true, "helpfulness": "0/0", "author": "L.S. Hart"}, {"rating": 5.0, "review": "This product has allowed us to consider dropping cable services saving us a huge amount of money on a monthly basis.  The programs are great and I can even listen to my amazon music through it.  I have watched several movies for my graduate degree courses on the device also.  It turned my older Samsung TV into a smart TV for a fraction of the cost!", "verified": true, "helpfulness": "0/0", "author": "Shawn Chisholm \"flitemedic01\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Alan D"}, {"rating": 3.0, "review": "I like what it does but I expected a more.  It should function as a wireless connection between the TV and the computer,  so I can have the computer content on the TV and don't need a separate cable for that purpose.  Instead it apparently only interfaces with amazon devices.  Also despite being in the same room as the main Internet connection, modem a router it keeps losing the network connection.", "verified": true, "helpfulness": "0/1", "author": "Russell Smith"}]