[{"rating": 5.0, "review": "Connected my Fire TV Stick to an older LCD TV that had no network connectivity of any kind.  The stick easily attached to my WiFi then updated it's software first thing.  I have Amazon Prime and Hulu Plus.  Everything works beautifully and has made our oldest TV the best one in the house!I only have 3Mb DSL and the HD streaming is flawless, responsive, and never has to stop to cache more of the stream.", "verified": true, "helpfulness": "0/0", "author": "Yo Coop!"}, {"rating": 5.0, "review": "Worked great. No nearby power outlet so am running it without power. Surprised it worked.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick meets and exceeds my expectations for a streaming device of this class since I've tried many others. I'm happy with this purchase and I've been able to use it 10 minutes after it was delivered. I heartily recommend this product to anyone looking for an easy-to-install, easy-to-use streaming device.", "verified": false, "helpfulness": "0/0", "author": "Nadia A Stumbo"}, {"rating": 5.0, "review": "It's perfect", "verified": true, "helpfulness": "0/0", "author": "Vickie Smith"}, {"rating": 5.0, "review": "Works quite well, thank you. I bought it on sale in Best Buy for $26, and it is worth every penny. It is far cheaper than a Roku stick and unlike Chromecast, it has its own remote. The software interface is pleasing enough and I was able to find all the apps I want. So, yes, I am very pleased with the purchase.", "verified": true, "helpfulness": "0/0", "author": "AM"}, {"rating": 4.0, "review": "The fire stick work well. unfortunatelyit didn't use all apps", "verified": true, "helpfulness": "0/0", "author": "MELVIN PARKES"}, {"rating": 5.0, "review": "Love the fire stick, much better than cromecast", "verified": true, "helpfulness": "0/0", "author": "Ty Houseman"}, {"rating": 4.0, "review": "The only reason I cannot give it 5 stars is that it is not quite as amazing as the FireTV that I also own. It does not have the lightning fast quick-play capabilities that the FireTV has for prime instant-video, and the default remote does not support voice search. Since I got this at initial offering for $20, I decided to add in a voice search remote like the one that comes with the FireTV. In the end that makes the remote almost twice as expensive as the FireTV Stick. Overall, just as many features as the FireTV, just in a smaller and way less expensive form factor. The only other thing to note is that most TVs (especially older ones) do not put out the ~1amp via their USB console port that the FireTV Stick requires, so even though some people claim they can run the FireTV Stick via the USB console port, don't count on it. You will most likely need to plug the stick into the provided USB AC adapter.", "verified": true, "helpfulness": "0/0", "author": "J Crosier \"JC\""}, {"rating": 4.0, "review": "Works pretty well. Easier to navigate than my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Pete VG"}, {"rating": 5.0, "review": "My wife loves it!It is now her go to device. We have a Chrome Stick, Roku and Samsung dongle and she will only use the Fire Stick now.Great product, simple to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Working hard in California\""}]