[{"rating": 3.0, "review": "UPDATE: I got the stick to work with my NETGEAR N600 (WNDR3700), however to get this working I had to re-work my entire WLAN because the FireTV stick does NOT support special characters in the SSID!The reason I am giving the device 3 stars and not more is because setup is a PITA, a device like this must support WPS to make WLAN config trivial and not depend on a display keyboard to enter the password.ORIG REVIEW: Beware this stick does not work with every wireless router, in my case I have a NETGEAR N600 (WNDR3700) and the stick is unable to connect on b/g/n and a/n networks, with or without a password.The distance between my router and the stick was less than 4 ft.", "verified": true, "helpfulness": "1/2", "author": "Sauraus"}, {"rating": 5.0, "review": "Very simple to set up and use.  Works great, I was surprised with it's speed.  Great value for what is on the market in this product type.", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 5.0, "review": "This is cool. It's so much faster to get where I want to be than through the TiVO, or the game box. I like how it automatically adjusted the screen size. I wish the Amazon music player had a shuffle all setting or channel creator like Pandora though. If it did I would probably just use this all the time.", "verified": true, "helpfulness": "0/0", "author": "Bhob"}, {"rating": 3.0, "review": "Device loses network connectivity when it sleeps or idles. Network connectivity is restored when you unplug device from the TV and power-source (to restart the device) or upon factory reset. The device also froze once in the menu however all video streaming was just as good as my PS4 hooked up via Ethernet. I called amazon and after about 20-30 minutes they informed me it was a known issue and have shipped out a replacement  Fire TV stick. The device menu's looked good but felt very 'beta edition' to me. It seems like they could use a lot of work to get them up to the Kindle Fire standard. I would wait to buy this device until it has been on the market a bit longer and glitches are fixed but overall i am optimistic about the device.", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 1.0, "review": "It does not work with my tv (Samsung LN46B530P7F) at all.  You plug it into any of the HDMI ports and the tv will recognize that it's there, but will not allow you to select it as the input.  It skips over it as if it weren't there.  I have never been so disappointed.  Switching back to my chromecast, because it has fewer shortcomings than this complete failure.", "verified": true, "helpfulness": "2/4", "author": "Kelly R. Fair"}, {"rating": 3.0, "review": "Ok so I had a terrible time getting the updates to download took me over the course of an evening. I run two wireless routers each have a \"g\" and \"n\" broadcast. I have the ssip the same on each,  but on different channels so my connection will transition seamlessly as I walk through the house. The fire stick does not work under these conditions.  I noticed when the FS scanned it didn't display all 4 of the connections, but displayed them as 2 connections even though they are addressed to different channels.  I changed the ssid on my \"g\"  broadcast in the room where my fire stick is and it has seemed to fix my connection problems.", "verified": true, "helpfulness": "0/0", "author": "Kevin Brendler"}, {"rating": 5.0, "review": "just got it - so far so awesome", "verified": true, "helpfulness": "0/0", "author": "Happy Camper \"I am a Happy Camper so I guess I’m doing something right. Hiking my own hike - authentic camper since 1969.\""}, {"rating": 2.0, "review": "I have Fire TV and love it so I thought this would be great for our kid's bedrooms and bought 2.  I didn't realize it has to be plugged into a power outlet (very misleading advertising doesn't show that). I do see in small print that it has to be plugged into an outlet.  What's the use if I need to have this thing plugged so Amazon can do updates? No thanks.  I would have just purchased 2 more Fire TV.s We have enough wires/cords running, thought this was a perfect solution to not having to plug crap into the wall!  Waste of money….returning both.", "verified": true, "helpfulness": "0/4", "author": "Brooke's Mom"}, {"rating": 5.0, "review": "Good at what it does.  Find suggested material very applicable to my likes, surprisingly. Definitely Amazon oriented.", "verified": true, "helpfulness": "0/0", "author": "jpm \"jpm\""}, {"rating": 1.0, "review": "Will not support audio with home theatre surround system (optical audio cables with AV receiver).  One must purchase the Fire TV Box to enjoy home theatre surround (has optical audio port on back). Wish Amazon made this clear - tech support indicated it would support home theatre audio with no additional cables, hardware, etc. They were wrong. To Amazon's credit, they gave me an immediate refund.", "verified": true, "helpfulness": "1/2", "author": "Dru \"Dru\""}]