[{"rating": 4.0, "review": "Having a remote is nice, but the buttons are a little too sensitive. Quality and performance is great and all the major media apps seem to be there. Ples, Hulu, Netflix, prime video all work great. Amazon content is front and center which is a pro and a con. As a Prime member it's way easier to get to Prime video than on my blu-ray player. But it's also got all the other Amazon content front and center, and I am not into that ecosystem outside of Prime. I have not tried any non media related apps.", "verified": true, "helpfulness": "0/0", "author": "Ron Diaz"}, {"rating": 5.0, "review": "fire is great excellent device", "verified": true, "helpfulness": "0/0", "author": "brianna carson"}, {"rating": 3.0, "review": "Needs additional feature. I could not use in hotel because I could not agree to the Hotel Internets terms. This could be easily solved by the stick checking for this and allowing the user to review and agree to the terms in the silk browser during set up.", "verified": true, "helpfulness": "0/0", "author": "R. LOFTON"}, {"rating": 5.0, "review": "Amazing product. I use it mostly for Netflix and it works flawless. Wifi signal is pretty good!", "verified": true, "helpfulness": "0/0", "author": "Salvador"}, {"rating": 3.0, "review": "It's okay-doesn't work with all televisions. I had to send mine back.", "verified": true, "helpfulness": "0/0", "author": "Kdill"}, {"rating": 2.0, "review": "Looks nicer than chromecast, lots of features, but glitchy. Screen freezes a lot. Tried to watch something on hulu and it constantly froze. Switched back to chromecast, watched same exact thing on hulu with no problems.", "verified": true, "helpfulness": "1/1", "author": "Sam Callaway"}, {"rating": 5.0, "review": "Be sure you have a really good wi-fi signal or you'll get a lot of lag, otherwise this thing is great.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 4.0, "review": "i bought this to see if i can reduce my cable bill by dropping some movie channels....we  will see;this device ,like most  A prods is very intuitive and user friendly;i have normal(not high speed)comcast broadband,and FS won't connect in upstairs bedrooms;it is the only device i have that has connectivity issues on the third level of my home;but it works beautifully downstairs-clear,stutter free hd  and cloud music access...if i save money on comcast movie purchases  in the next 90 days,i  will return with a 5 star recommend", "verified": true, "helpfulness": "0/0", "author": "herman keene"}, {"rating": 1.0, "review": "It would be ZERO stars if possible.  Constantly crashes and disconnects from internet.  DONT BUY.  Support is a joke.  Ask if it was plugged in and to restart my network devices to fix while none of my other products connect ever have issues.  No thanks to NEHA at Amazon \"support\".", "verified": true, "helpfulness": "2/3", "author": "JAC"}, {"rating": 4.0, "review": "I've used a Roku products most of my streaming life and I'm more than a little used to that interface. With that said I decided to try the Fire Stick and while I wasn't disappointed in the hardware or performance I am not a fan of Amazon's interface (also not a fan of Kindle Fire interface). That's a personal preference though, there's not necessarily anything wrong with the interface, it's just overly busy for my taste. Everything seems perform snappy after the initial setup which was quite laggy for several minute or more while apps and preferences were synced and downloaded. I would probably buy again if the price was right but would most likely return to Roku if similar specs were available there.", "verified": true, "helpfulness": "0/0", "author": "Austin Haynes \"Sinitron\""}]