[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Mechale'"}, {"rating": 5.0, "review": "Works great", "verified": false, "helpfulness": "0/0", "author": "Zack"}, {"rating": 5.0, "review": "If you don't have a smart TV with the Prime App this is a no-brainer.  Works great and the picture quality appears to be better than the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "KFG"}, {"rating": 5.0, "review": "Great product. Need to do some tinkering at the beginning to get all the apps you want, but other than that its the future of television.", "verified": true, "helpfulness": "0/0", "author": "Geoffrey M. Anderson"}, {"rating": 5.0, "review": "Love this product. I use it plugged in behind my tv that is mounted to the wall and works great. I have used roku boxes in the past but there is not enough room for one of those in this situation. They make a stick version as well but the Fire Stick is cheaper and performs just as well. This is also way better than the google device. The google device can't even do half of what this can do and it could barely pickup my wifi that was only 20 ft away. I have no issues with wifi or power and love that it comes with a remote. I have had this for a couple months now and love being able to use it for Netflix, Amazon Instant Video, and storing and watching things from the cloud drive.", "verified": true, "helpfulness": "0/0", "author": "Brandon Biniecki"}, {"rating": 5.0, "review": "works as good as you internet service is reliable. you have great internet service, i would truly recommend this product. If you need to get a 5.1 or 7.1 surround sound connected by the bigger version.  if you have a tv with usb...you dont need a 110v plug to getting working, big bonus", "verified": true, "helpfulness": "0/0", "author": "daniel v"}, {"rating": 3.0, "review": "The Fire TV Stick is great for Amazon Prime and Netflix -- but it simply doesn't work with Hulu, which is one of the main reasons I bought it. So that's been pretty disappointing. I've talked to Amazon a few times and they can't seem to figure out how to fix it. Other people have had the same problem I've had (where the audio keeps going but the screen goes black). Amazon tries to blame it on Hulu, but Hulu works fine on my laptop, so it's something about the compatibility of the fire stick with Hulu. I hope Amazon figures it out.", "verified": true, "helpfulness": "0/0", "author": "Dahlia Schweitzer"}, {"rating": 5.0, "review": "Perfect for parents", "verified": true, "helpfulness": "0/0", "author": "mjl11940"}, {"rating": 5.0, "review": "I replaced my old Nintendo Wii system with the fire tv stick and I am so happy, it is small, fits nicely behind the tv and the system is fast. I love the apps you can download, you can even read books on it, which is funny. My daughter loves the games, my husband loves the news and sports apps and I love instant streaming and netflix on it. Such a small thing and so many options. I also like their cooking apps.I haven't had even one single problem with it since I bought it in Novemeber 2014. My son used to use a chromcast for his tv and after using my fire tv stick he bought the fire stick as well.Before I bought the fire stick I compared it to all the other systems out there including roku and some other most used ones and the fire stick game out as a winner all over.", "verified": true, "helpfulness": "2/2", "author": "Cherry"}, {"rating": 3.0, "review": "Works great...when it works.  I bought it to use on the road as I spend half my life in hotels.  The problem with free hotel Wi-Fi is that most of the time you need to access it through a web browser to connect.  The Fire TV Stick does not have this option so you get the \"Connected with problems\" message when you try to use it.  I'm still looking for a work-around.  If it wasn't for that it'd be an easy four-star product.", "verified": true, "helpfulness": "0/0", "author": "Rob S."}]