[{"rating": 2.0, "review": "Does not compare to apps available on other similar devices.", "verified": true, "helpfulness": "0/0", "author": "Cali_Angel01"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Madelyn"}, {"rating": 5.0, "review": "WOW!  I wish I had done this long ago.  It was so easy to get hooked up and started up right away.  Listened to my music and you can even see the lyrics printed out, which I loved!  Watched the second season first two episodes of Red Road and so enjoyed being able to watch two episodes back to back. The whole thing is amazing.  What a great concept!  If anyone is on the fence about this, jump on it!  The cost is minimal and the end result is so worth it!", "verified": true, "helpfulness": "0/0", "author": "Renee L. Still Day \"ojibwawife\""}, {"rating": 4.0, "review": "Very easy to use and portable. The remote took a little getting use to but other than that it fits my intended purpose for purchase. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "cjay \"cjay\""}, {"rating": 5.0, "review": "Neat ...beats having to use my Wii", "verified": true, "helpfulness": "0/0", "author": "Cherie Henderson"}, {"rating": 5.0, "review": "It continues to work flawlessly. Thank you for a very good product", "verified": true, "helpfulness": "0/0", "author": "Adrian Frias"}, {"rating": 5.0, "review": "This is awesome. Especially if you have a prime account. Really glad i got this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product, easy to install.", "verified": true, "helpfulness": "0/0", "author": "Suzanne"}, {"rating": 5.0, "review": "I love the fire tv stick!!!", "verified": true, "helpfulness": "0/0", "author": "Kristen Caruso"}, {"rating": 3.0, "review": "Fire Stick (or Fire TV Stick?) was relatively easy to install and offers the promise of easily spending a lot of money on entertainment. It seems easy to use, at least to page through offerings, but has one REALLY GLARING OMISSION. The is essentially NO documentation on how to use the device. I have had to solve several problems (like initially having no audio) by searching the internet or asking someone who has one of the things. Yes, I will keep it and, I assume, eventually learn the tricks of using it. But it would have been really nice to find some fundamental clues to how the thing works to accomplish different tasks.", "verified": true, "helpfulness": "0/0", "author": "Lewis Overton"}]