[{"rating": 5.0, "review": "This has been a life saver for us with our toddler. We can watch shows and movies on netflix, amazon prime, disney go, xfjnity tv app and youtube. it's so easy and fast to set up and to learn. Everything loads quickly as well.Hands down one of the best purchases we have ever made.", "verified": false, "helpfulness": "0/0", "author": "amber"}, {"rating": 2.0, "review": "When I first got the fire stick months ago, it was great and I wrote a 5 star review for it.  I love the interface, but it's continually gotten worse and worse at buffering (that little 3-5 second pause) while watching Netflix or Hulu.  I've tried the 'tricks' of clearing the caches for the apps, and even reset to factory settings once trying to get it to work better.  Finally I've went back to my xbox, which has it's own issues as far as buffering, but at least it's at the start of the show and doesn't interrupt dialog.A friend at work bought a Fire Stick based partially on what I'd originally told him, he immediately had the buffering issues and sent it back.It really feels like a software update should be able to fix this issue, but after months I don't want to spend any more time attempting to get it to work correctly.", "verified": true, "helpfulness": "0/0", "author": "Robert B"}, {"rating": 3.0, "review": "Wish it didn't lose Wi-Fi signal in the middle of streaming (netfliix) It's Pretty good, but it does get pretty hot sometimes and lose Wi-Fi signal, which requires me to unplug it, restart it. My other wireless devices do not lose their Wi-Fi signal at the same time, proving that it is indeed just this one product losing the Wi-Fi signal at that time. Once I restart the firestick, Wi-Fi comes back, I think it may be getting too hot. Not sure why. But feels very hot to the touch. Don't know if the fire TV box would perform any better or with less heat?", "verified": true, "helpfulness": "0/0", "author": "rockwilder"}, {"rating": 5.0, "review": "FABULOUS", "verified": true, "helpfulness": "0/0", "author": "koko"}, {"rating": 4.0, "review": "The device works well enough.  If you have Amazon Prime Video, Hulu, Netflix, or any other streaming video service, I'm sure it'll suit you well.Unlike Chromecast, this device does not require a USB port on for power.  This is good for me since I have older TVs that don't have USB, but it also means it requires a free power outlet to plug it's power cable into.I only wish the instruction manual was more about how much power it draws.  Since Chromecasts plug into the TV's USB, it would stand to reason that the Chromecast turns off automatically when the TV is off.  The Fire stick plugs into a regular outlet and goes into a standby mode automatically after 30 minutes, but I'm still unsure if it is drawing additional power for WiFi or to check for updates.", "verified": true, "helpfulness": "0/0", "author": "theBilliot"}, {"rating": 5.0, "review": "I have had this a while now and I love it! It gets the prime movies and shows plus free HBO app that has tons of free movies on it. Netflix is also avalible through the fire stick and a lot of tv shows you can purchase 6 hr after they air for 2$ or you can buy the whole season.", "verified": true, "helpfulness": "0/0", "author": "Darcy Mines"}, {"rating": 5.0, "review": "Love it. works great", "verified": true, "helpfulness": "0/0", "author": "MC"}, {"rating": 5.0, "review": "the perfect solution to my extra TV that is not hooked to cable.", "verified": true, "helpfulness": "0/0", "author": "constance c."}, {"rating": 4.0, "review": "I bought the stick because I found Netflix limited and a hassle to keep up.  I can now watch all the Downton Abbey episodes I missed and catch up.  But it took my engineer husband all weekend to figure out how to install and make it work.  Other folks may not have the same difficulty, but the stick came with no instructions or troubleshooting whatsoever.  End result is good.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "as described", "verified": true, "helpfulness": "0/0", "author": "Chelsea"}]