[{"rating": 4.0, "review": "It works well, to my expectation. Wish there are more TV channels but i suppose as long as you have either netflix/hulu/hbo this is enough for a \"non\" smart TV. I like the control, feels very smooth to touch and operate. There are some lag between pressing the bottom and navigating through the menus. Not enough to cause a huge issue and i'm not sure if that's due to the fire stick itself or my internet connection. However, I have realize that after prolong usage, sometimes the loading screen can get stuck and the stick need to be cool off or restarted (lol...a fire stick that needs to be cooled off). Only happened few times. I also wish there's an actual off button or selection in the menu so I don't have to navigate through 5 different places just to put the stick to sleep. Because technically, even after you turned off the tv, the stick is still \"functioning\" and i suppose this could sap away bandwidth? Just my two cents on a new product that still have potential to grow :)", "verified": true, "helpfulness": "0/0", "author": "antapolar"}, {"rating": 5.0, "review": "Works fine!", "verified": true, "helpfulness": "0/0", "author": "John N. Mitchell \"johnnmitchell\""}, {"rating": 5.0, "review": "Perfect! simply perfect! I am loving it.", "verified": true, "helpfulness": "0/0", "author": "Goku \"tech geek!\""}, {"rating": 5.0, "review": "After getting it all hooked up and ready it works great. The apps and functionality are good, especially with kid related stuff. The little remote is also very easy for the kids to use. I'm waiting for the HBO go app and an Apple one and then it will be pretty much perfect.", "verified": true, "helpfulness": "0/0", "author": "Jackie D"}, {"rating": 5.0, "review": "This is so easy to operate, my 2 1/2 year old can put on a show for herself! LOVE the creative galaxy show that is created for amazon, it has replaced all disney shows, thank goodness! Great that you can access music too! Perfect solution to high cable prices!!!", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 1.0, "review": "What is the point of the stick if you have to have a tv provider to watch any of the \"watch\" apps. On our tablet we can still get episodes and things for free with those apps but with the stick you have to choose a provider in order to get into the app or if you can get in it won't let you play anything. I also didn't like how it talked about having thousands of apps but I wanted the abc app and can't find it anywhere. So to sum up the only thing I can do with the stick that I cant do with my bluray player is watch amazon instant video but I could do this on our wii so this was a pointless purchase. So frustrated that I can get more tv on my tablet than this.", "verified": true, "helpfulness": "1/2", "author": "Ashley Schwartz"}, {"rating": 3.0, "review": "Interface is pretty good so far. Much better than the built in hub on my samsung smart tv...However, I am hugely disappointed that the showtime app is COMPLETELY USELESS if you are a Directv subscriber. If you have Directv and want to use the showtime anytime app tough luck. It isn't even on the subscriber option list. Therefore you cannot sign in and/or use the app. What a letdown.", "verified": true, "helpfulness": "1/1", "author": "BRIAN ROCK"}, {"rating": 1.0, "review": "I bought this device to handle mirroring of my tablet to my television. It does not handle this. I guess according to the specs it must be a compatible device , I find that my ASUS memo must not be compatible. Sure I only spent $20 for fire stick but am not impressed basically all it does is stream a bunch of movies and tv shows from the usual sources , Netflix , Amazon instant video ans so on. Point is we all more than likely already have devices to do this. I do not have unlimited data on my internet so this is simply a waste.", "verified": true, "helpfulness": "1/2", "author": "Shirley crook"}, {"rating": 2.0, "review": "Very disappointed. Not half as user friendly as a roku, the menu is a mess, and the first show I tried to play got stuck and I eventually just gave up trying to view it. It also had problems with the wifi signal despite the fact that no other device has problems from that location.", "verified": false, "helpfulness": "1/1", "author": "Jswizzy"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "CW"}]