[{"rating": 5.0, "review": "It made watching Sling TV and The Blaze network so much easier!!", "verified": true, "helpfulness": "0/0", "author": "gundoggie"}, {"rating": 5.0, "review": "Just rec'd this item yesterday and it is awesome. Very easy to set up and the remote is very responsive. I want to thank Mike Williams for taking the time to answer my emailed question regarding this item. I purchased this because my Samsung Smart TV was very slow in response, the choice of APPS was poor and it was constantly buffering. The Fire TV Stick responds immediately, the remote is very easy to use at night, and it is very easy to add APPS. There is no buffering so far. I use closed captions because I need to keep the sound down as this TV is in the bedroom and it is very quiet here at night. The captions on the Samsung were always flashing and very hard to read on Prime movies. Now I can control the caption size and color much easier. I just love this!!!", "verified": true, "helpfulness": "0/0", "author": "Joan Napolitano"}, {"rating": 5.0, "review": "Very nice small portable device works as advertised. Controller is very easy to use and so far love ir.", "verified": true, "helpfulness": "0/0", "author": "Doug Applegate"}, {"rating": 5.0, "review": "This is really great idea.  It's cool to be able to make a regular television have some of the smart tv features.", "verified": true, "helpfulness": "0/0", "author": "Gavan Petersen"}, {"rating": 5.0, "review": "Excellent product. Gonna order another one.", "verified": true, "helpfulness": "0/0", "author": "Latrona D. Garnett"}, {"rating": 5.0, "review": "Great product. I own also a Chromecast and Fire TV stick is the first choice, specially if you are a Prime member.Variety of apps and available media is the best.", "verified": true, "helpfulness": "0/0", "author": "Buki Finzi"}, {"rating": 5.0, "review": "Excellent way to access Netflix!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth U. DuBois"}, {"rating": 5.0, "review": "I like it alot so far.  I've had it a few weeks.  All the standard TV and movie apps.  Easy to use with the remote it comes with.", "verified": true, "helpfulness": "0/0", "author": "MTP"}, {"rating": 5.0, "review": "Great product super easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "LuAnn Stine"}, {"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Cupcake Mom"}]