[{"rating": 5.0, "review": "We able to watch movies  and shows at our leisure  and discover shows we never new about.", "verified": true, "helpfulness": "0/0", "author": "Felisha Workman"}, {"rating": 5.0, "review": "Lots of content-especially if you have Amazon Prime. Very satisfied", "verified": true, "helpfulness": "0/0", "author": "David P. Kelly"}, {"rating": 1.0, "review": "Keep dropping network connection and it won't mirror to my kindle fire HDX and  I have tickets in for support haven't got any. Spent money have a item that's just sitting here. TELL  ME HOW YOU WOULD LIKE IT!!!!!!!!!😣", "verified": true, "helpfulness": "1/2", "author": "EB"}, {"rating": 5.0, "review": "Once we sorted out whether either my wife or I can use it, all worked well. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Peter Heyl"}, {"rating": 5.0, "review": "Well done. Easy set-up", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Loses connection with our WiFi often, and some of the apps are not working with my cable provider (Comcast/Xfinity).  Its a bit disappointing.  I'm hoping these kinks will be worked out over time.  Search functions for apps / TV / Movies could be easier, as I find it spits me back out to the home screen often.", "verified": true, "helpfulness": "1/1", "author": "D. Gabriel \"D. Gabriel\""}, {"rating": 5.0, "review": "I like this device better than my Roku stick. It is much more responsive, and it has a huge selection of networks to watch.", "verified": true, "helpfulness": "0/0", "author": "Strawberry Peach"}, {"rating": 3.0, "review": "I have used Roku for a long while now. I got this thinking I would use this and give one of my Roku's to my parents. After using it, I just wanted to give this one away. I will be holding on tight to my Roku's. No offense Amazon, but this is a dud. The interface is awful and not user friendly. I tried it for a few days, but just don't like it. As for my parents. I will not be giving the Fire to my parents. I would rather buy them a Roku.On a positive note. It does what it says it will, but I just can't get past the interface.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "got just for my prime works well", "verified": true, "helpfulness": "0/0", "author": "brian podolak"}, {"rating": 2.0, "review": "I wish I could review it but our internet is so slow out here in the country that after our son added the fire stick to our TV we just kept getting the little circles trying to load it.  Even though we pay for high speed internet we don't really get it.  We're going to hang on to it in hopes that the system will improve.", "verified": true, "helpfulness": "0/2", "author": "Patsy Clark \"Ellie\""}]