[{"rating": 1.0, "review": "Sooooooo slow. We have Google Chromecast and a Roku and they are both so much faster to navigate through the menus. I don't know if we just got a defective one or what but the Fire stick is drastically slower than the Chromecast (also a stick) and the Roku (set top device, not a stick). We tried using this a few times and set it aside to return because we couldn't take it and I kind of forgot about returning it. I'm 10 days outside of the return period and luckily amazon is still letting me return it - thank goodness. We are going to try the Amazon Fire TV (non-stick) or Apple TV - hopefully they are faster. If not, I guess we will just get another Roku for the other tv!", "verified": true, "helpfulness": "1/2", "author": "Kate H."}, {"rating": 3.0, "review": "Has the wifi range as advertised.", "verified": true, "helpfulness": "1/2", "author": "Shopper"}, {"rating": 5.0, "review": "Sure glad I got one, much better than Chromecast.", "verified": true, "helpfulness": "1/2", "author": "Gary E. Crossley"}, {"rating": 5.0, "review": "Worth it just for the Plex app alone.", "verified": true, "helpfulness": "1/2", "author": "Styxx"}, {"rating": 5.0, "review": "Just what the doctor ordered, works as I expected and helped me cut the cable", "verified": true, "helpfulness": "1/2", "author": "William"}, {"rating": 5.0, "review": "great buy very pleased", "verified": true, "helpfulness": "1/2", "author": "FAA"}, {"rating": 1.0, "review": "I am not able to use it in my country due to geographical bla bla bla, you should put that in the description of the product, neither using a prime account", "verified": true, "helpfulness": "3/5", "author": "Jose costales"}, {"rating": 3.0, "review": "I was super thrilled to buy the FireTV Stick because it's advertised to be Mircast certified and I would not only be able to watch Netflix, etc. through the stick on my tv, but also cast whatever I'm looking at on my laptop or smart phone as well. Not the case at all. It wasn't until I Google searched help to figure out how to troubleshoot casting that I saw a multitude of other customers who were duped as well, including those who work in associated tech fields. No Bueno, Amazon. In addition to that disappointment, the power cord is REALLY short and is about 6\" too short to reach my surge protector. Although the manual urges you to use the included power cord and adapter, the stic thankfully runs just fine off the power it gets from the USB port on my tv. The likes: a simple low profile remote, ability to use the FireTV app (in case remote is lost or batteries dead), fast surfing and response time of commands, no buffering issues.", "verified": true, "helpfulness": "1/2", "author": "Amanda"}, {"rating": 5.0, "review": "I love it. It is all that Amazon said it would be. It was shipped very quickly and arrived without hassle. To set it up you just plug it into any HDMI port and answer questions via the remote. It couldn't be easier. You do need wi-fi though and an Amazon account. There is TONS of programming on Amazon Prime and you can receive Net Flix or many other content. The games are basic but that is OK. The remote is basic too but there are replacements that are more comprehensive.Good solid product", "verified": true, "helpfulness": "1/2", "author": "Casch \"Chris\""}, {"rating": 5.0, "review": "Just what I needed", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]