[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Lynette"}, {"rating": 5.0, "review": "My order arrived exactly when they said it would..  it is so very simple - i love it will get another for the kids room and cancel cable.!", "verified": true, "helpfulness": "0/0", "author": "Dahlia Morgan"}, {"rating": 1.0, "review": "works great but its not supported by comcast", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this Fire stick. I couldn't be happier", "verified": true, "helpfulness": "0/0", "author": "Renae Patterson"}, {"rating": 1.0, "review": "Unable to use with Netflix", "verified": true, "helpfulness": "0/0", "author": "erica blaisdell"}, {"rating": 5.0, "review": "I  don't know why I waited so long to purchase one!? Buying another and reccomend highly!", "verified": true, "helpfulness": "0/0", "author": "LAURA"}, {"rating": 1.0, "review": "Requires a restart daily. Any time I want to use it I have to physically unplug it and plug it back in. Going back to Chromecast.Edit: After spending half an hour on the phone with Amazon support, it is clear they have no idea why this issue is occurring and I'll be promptly returning it.", "verified": true, "helpfulness": "0/1", "author": "Ben C."}, {"rating": 5.0, "review": "This is great. I have now canceled cable.", "verified": true, "helpfulness": "0/0", "author": "CyberSleuth"}, {"rating": 5.0, "review": "Absolutely perfect device, stunning HD, hundreds of apps and hundreds of thousands of episodes of quality, contemporary and old school television shows and movies to watch and music to listen to. For only $40! What more could a person want? Congratulations, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 3.0, "review": "Wi-Fi disconnects frequently, causes lag in video. I have good quality wifi, can stream from laptops and phones no problem.", "verified": true, "helpfulness": "0/0", "author": "D. Fountain-Jagodzinski"}]