[{"rating": 3.0, "review": "my favorite roku service is Acorn TV which is not listed as most popular content providers cannot find out if it is included", "verified": false, "helpfulness": "0/0", "author": "James R. Ellis \"dancing fool\""}, {"rating": 4.0, "review": "OK", "verified": true, "helpfulness": "0/1", "author": "Tuan Pham"}, {"rating": 5.0, "review": "I love the fire TV stick so far.  My kids can use to watch tv and play games.  I love that I do not need to rent another expensive cable box!!  They know how to download the apps and watch all their favorite show.  It is definitely worth the money!", "verified": true, "helpfulness": "0/0", "author": "Jamie H. Walker \"jco012\""}, {"rating": 1.0, "review": "When first trying to install, I used the USB as power, and the picture was distorted and flickered. I then powered it with the AC adapter and had the same issue. I moved the stick to a different HDMI port and it worked. The picture was very dark even in the sample video they had in the setup. It was so bad I took pictures of it and sent it to Amazon. There was some back and forth including resetting it, seeing if there were any updates, none of which worked. I moved the stick to other TV's, other brands and it didn't help. I then received an e-mail from Amazon saying that it was probably my bandwidth. When I went to reply with a record from benchmark software showing I have 18 Mbps service, the e-mail was bounced back...Anyways, I put this on a TV we don't use much and had to turn up the brightness to extreme levels. All of my other TV's were calibrated manually using the Aria DVD. A little old but works for everything else. I have 2 Roku's and 2 Blu-Ray players and they produce a great picture.I've also noticed connectivity issues, especially with 3rd party streaming services. Conveniently, Netflix wouldn't work on the Fire Stick, but Amazon Prime movies did. Netflix worked on every other device I have, just not the Fire Stick.When useful, it really is geared towards Amazon's Prime services. If you don't have them, it would be far less useful.I got it for only $20, but I would never recommend this thing to anyone.", "verified": true, "helpfulness": "6/7", "author": "M. Newman"}, {"rating": 4.0, "review": "very easy to use. Very intuitive.  I do wish it would access HBOGo.", "verified": true, "helpfulness": "1/1", "author": "Walter G. Haag"}, {"rating": 4.0, "review": "So far so good, easy setup, seems to work well, not sure how to restrict data inappropriate for younger age groups. Still a learning process.", "verified": true, "helpfulness": "1/1", "author": "THE JUDGE"}, {"rating": 5.0, "review": "Excellent. Exceeds my expectations!", "verified": true, "helpfulness": "1/1", "author": "andrea thompson"}, {"rating": 4.0, "review": "So far so good. Although, the second time I use it the connection with the remote was a little off & it started clicking thru titles without me pressing any buttons. I restarted it & so far it works great, I love the display & how everything is set up. For example, the netflix on roku goes back to the page after an episode & I have to click at the continue the next episode it's nice, when binge watching, to not have to keep clicking a new episode. Plus the price is excellent! Exactly what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "shelby wade"}, {"rating": 5.0, "review": "With cost of cable getting so expensive, this is a great device - so easy to set-up & use...LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 4.0, "review": "So convenient. Love this!", "verified": true, "helpfulness": "0/0", "author": "Steven"}]