[{"rating": 5.0, "review": "The fire stick is an amazing product. Everyone should go out and buy one.", "verified": true, "helpfulness": "0/0", "author": "Josh Reyes"}, {"rating": 5.0, "review": "Initially I was very skeptical about these sticks.  Later I was confused on which one to buy.  The choices were chromecast, roku stick and fire stick. So, I did the best I could do..  I tried all three.  In short, I kept fire stick and chromecast, returned roku stick.Let me explain.....Cons of each, firstOf the three, fire TV stick has the best hardware, hands down. However, you are married to Amazon ecosystem.  I hated that.In order to use chromecast, you must have a device, like Android phone, pc, etc. I hated that too..Roku stick, like fire stick can be used independently.  The apps are plenty.. However you have to use the one they give to you. Say if you want to side load apps of your choice, you are out of luck..  I hated that..  Also it was slow for me..Pros...The reason I chose fire tv stick over roku is because1) fire TV stick has better hardware, than roku. It is fast2) fire TV stick is Android at the core..  This is a very important feature..3) because fire TV stick is Android, I could manipulate and load xbmc in it.  This in itself is the best of all features.  I could get hundreds of channels via xbmc.. Xbmc is a content aggregator. If you don't know what is xbmc, Google it..  You will be addicted. Once you realize how good xbmc is, you will thank yourself for not buying roku.Now why did I keep chromecast then? The downside I listed for chromecast is actually also a feature in itself..  I can cast anything from my chrome browser to TV.. Eg., say you want to watch hulu, you cannot do so in fire TV stick or roku ( paid hulu plus is the only option there).  Not so with chromecast. Just get it started on chrome browser on pc or phone and cast it to TV via chromecast. Problem solved.... It is cheaper too..Of course lot of folks will counter that by saying load casting apps to fire TV stick and do it that way..  Trust me, it is not easy..In summary, fire TV stick is good because of versatility. Chromecast is good because of flexibility.Although I like roku and it's nice apps, in this case it lost (at least for me) to fire stick.", "verified": true, "helpfulness": "0/0", "author": "harry"}, {"rating": 4.0, "review": "Nice but occasionally freezes with Hulu like some of the earlier model Roku's would -- hopefully will be fixed with updates.  Other than that - nice interface and no other issues with playback on netflix, prime, or youtube.", "verified": true, "helpfulness": "0/0", "author": "A.Watson"}, {"rating": 5.0, "review": "Excellent device with tons of content. Super easy to set up. Love it !!", "verified": true, "helpfulness": "0/0", "author": "lawrence a thennes"}, {"rating": 5.0, "review": "OMG !!! What An Outstanding Product !!! This Fire TV Stick Is What I Always Wanted. To Be In The Comfort Of Your Home Watching Netflix, Hulu Plus, YouTube Video's & So Much More.... Also Spotify !! I'm In Love. Not To Exclude The Cool - Crisp High-Def Picture Quality It Brings With The HDMI Connector. Amazon... What Will You Think Of Next. I'M ORDERING MORE FIRE TV STICKS !!! Best Multi-Media Device I Invested In Buying. $$$ Well Spent.", "verified": true, "helpfulness": "1/1", "author": "Frederick Smith"}, {"rating": 5.0, "review": "Easy to use and access movies and shows. Not much wiring or crazy instalation", "verified": true, "helpfulness": "1/1", "author": "Leanna Catron"}, {"rating": 5.0, "review": "This thing is awesome!  Bought it 2 weeks ago and absolutely love it.  Not sure what the difference is between the fire stick and fire tv.  I was told it was games, but the stick has games as well.  We took a trip for spring break and brought this along.  We were able to plug it in to the TV's at the hotels as well as the cabin we stayed in.  It was very nice to have all the Amazon movies as well as Netflix and Amazon games to keep the kids occupied in the evenings.  This is definitely a must have for our family trips from here on out!", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 3.0, "review": "Not jumping up and down with this one. Not much to pick from on the channel selections.Not that easy to set up either. Not all thumbs friendly, you need a geeks help.", "verified": true, "helpfulness": "0/0", "author": "facefind"}, {"rating": 5.0, "review": "It has everything I need, is very user friendly and all at an affordable price.  I was able to \"cut the cord\" and have gone from a $260+ cable bill to about $75/mo. ($15 for Netflix & Hulu and $60 for internet service).", "verified": true, "helpfulness": "0/0", "author": "Amy Taulli"}, {"rating": 5.0, "review": "Awesome!!!!! Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Laura Keeney"}]