[{"rating": 4.0, "review": "Love it.  After we'd had it for about 2 weeks it stopped working.  We tried everything, then our son suggested that we unplug it and wait 30 seconds.  That did the trick.", "verified": true, "helpfulness": "0/0", "author": "dotti"}, {"rating": 2.0, "review": "It's decent enough. But it's weak at picking up and maintaining a WiFi signal.", "verified": true, "helpfulness": "1/1", "author": "MeteorSage"}, {"rating": 4.0, "review": "my problem is  it came with no info how much some of the video we want to watch costs,  we are very ignorant about this stuff and should have realized it was to good to be true.", "verified": true, "helpfulness": "0/0", "author": "Sandra L. Brunner"}, {"rating": 4.0, "review": "I like the ease of use. Can't wait until there are more recent movies in Prime. I love horror flicks though and there is a healthy selection.", "verified": true, "helpfulness": "0/0", "author": "scottswelderchick"}, {"rating": 4.0, "review": "Easy to use and made my old TV smart.  It was very easy to setup - took about 5 minutes to setup including getting my netflix up and running.  Very good for the price, $39.The only downside is it seems that netflix content locks multiple times per show.  It recovers to the 25% mark and then hangs, bounces you out and asks if you want to retry or go to other content.  If you say retry it works fine 9/10 times.  That does not happen with Amazon provided videos.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer - Jody"}, {"rating": 5.0, "review": "Got it at the intro price and love it!!", "verified": true, "helpfulness": "0/0", "author": "Aaron K"}, {"rating": 3.0, "review": "Having some glitches with Netflix. Easy to use but somewhat unreliable so far.", "verified": true, "helpfulness": "1/1", "author": "LMP1962"}, {"rating": 5.0, "review": "Extremely simple to set up.  If you are already using fire tv then this stick will look very familiar.", "verified": true, "helpfulness": "0/0", "author": "Mark Hintze"}, {"rating": 4.0, "review": "This little device is pretty amazing. I have been very impressed with what it has to offer. I am not much of a gamer so this is a great alternative to owning a PS4 or Xbox one and gives you all the streaming capabilities that you could desire.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Purchased to watch youtube guitar lessons on my large screen tv a nd ended up using it for so  much more.. love it .", "verified": true, "helpfulness": "0/1", "author": "tcb"}]