[{"rating": 3.0, "review": "I really like being able to watch everything I want, but there are some functionality issues that keep cropping up. The input is super annoying when you're trying to put in passwords. The remote is kinda crappy and mine already has a button stuck. Navigating is awkward with the remote and sometimes I get signed out of Netflix, prompting more wrestling with the remote. But once you stop and just watch, I really like the streaming quality. Overall, I still like it but I think there are issues that need to be addressed. Also, I use campus housing and I cannot use my username/password WiFi directly, I had to get a router and set up a secondary WiFi system just for my room. Just FYI. Also, you can't sign in on networks that you have to accept terms for (open public things like hotels etc)", "verified": true, "helpfulness": "0/0", "author": "ehousehay"}, {"rating": 2.0, "review": "Apps are not so great that makes this device not cool enough as compared to google chromecast.", "verified": false, "helpfulness": "0/1", "author": "Raghav"}, {"rating": 4.0, "review": "Great stick !", "verified": true, "helpfulness": "0/0", "author": "Helmut J. Schmidtke"}, {"rating": 5.0, "review": "This little firesick is amazing. I first bought the chromestick, but I really didn't want to use our phones all the time. I took the chromestick back to best buy that cost me 35.00, and got the firestick on sale for 24.99! All apps available on the firestick, and I don't have to load all my apps on mY phone. Also, just bought the gaming controller. Works like a charm! I highly recommend this!", "verified": true, "helpfulness": "0/0", "author": "Bruce Niemchick \"atunedvoice\""}, {"rating": 5.0, "review": "I am really excited about the Firestick! It works great and was so easy to set up.  Took it out of the box plugged it in and we were watching a movie within 30 minutes!!!  I will be able to cancel my movie channels that I am paying close to $40 a month for and save enough to more than cover my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Lisa C."}, {"rating": 5.0, "review": "Great Product from Amazon. Really Love it.", "verified": true, "helpfulness": "0/0", "author": "Sachi"}, {"rating": 5.0, "review": "After a couple of weeks with hands on usage the verdict is in, I am a fan!I've used a majority of the devices out there, with the exception of the Roku stick or full size Amazon Fire, and this one holds its own.Most topics that can be covered have probably already been done to death. So I'll stick to a pro's and con's list just to highlight my own personal thoughts.But first, the one thing I do want to single out though, is the ability of this device to use compatible apps you may already have in your collection, items I haven't even seen them list as compatible in the searches. While setting up the stick, I noticed two of my surveillance apps at the top of the screen. Set up and tested both with no issues. For me this is a huge plus, since this will mostly be a device I use while traveling.Pros:-Compact for travel-Quick and responsive-Lots of apps-Ability to watch my surveillance cameras on a big screen if I so desire.-Slick, compact remote (even if it isn't voice compatible)Cons:-Remote issues (could be a line of sight thing, but clicking once might result in multiple responses overshooting selections you  intended to make. VERY frustrating trying to select text or anything else)-Apps (there are still a few apps that are not supported yet, either not available or service providers not authorizing use, but with  Amazons pull I'm sure that is only momentary)Feel free to ask me any questions. If I don't know I'll test it and find out.", "verified": true, "helpfulness": "0/0", "author": "Tommy M."}, {"rating": 1.0, "review": "Do you need the internet to use this", "verified": false, "helpfulness": "1/9", "author": "jeremy a miller"}, {"rating": 5.0, "review": "The Fire TV stick is great.  I purchased mainly for Netflix but it does so much more.  Great price, great product.", "verified": true, "helpfulness": "0/0", "author": "PamS"}, {"rating": 5.0, "review": "I didn't expect very much when I purchased this item for a dumb tv in my library.  While it's great having access to my Netflix and Prime accounts, I was delighted to find there are a number of both free and for cost apps designed specifically for the Fire Stick.  In particular I quickly found an app that enabled me to directly access and playback music, pictures and video stored on my various NAS servers.  Costing a whopping $1.50, the app is incredibly easy to use and unlike other products so far has never exhibited any out of sync or stuttering on my network -- even with demanding HD material.The Fire Stick menu interface itself is very easy to navigate and offers a great deal of flexibility in terms of setup for various screen sizes.  An important consideration in my case.  I found the supplied remote very easy to use.  I was able to pick up the Fire Stick on sale for $24.95 at a local merchandiser and consider it to be the bargain of the year.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "H. Kane \"AV enthusiast\""}]