[{"rating": 5.0, "review": "Streams very fast and is easy to set up and transfer from set to set.", "verified": true, "helpfulness": "0/0", "author": "john maine"}, {"rating": 5.0, "review": "Wow! So much from something so small. The stick is small but mighty. I installed it in a few minutes & was perusing movies with ease. Well thought ouut & simple to use. The stick has changed the way I watch television forever!", "verified": true, "helpfulness": "0/0", "author": "XV-Man"}, {"rating": 4.0, "review": "I really like it. The only thing it won't do that I want it to is to get VuDu.", "verified": true, "helpfulness": "0/0", "author": "Charles Herrin"}, {"rating": 5.0, "review": "Love it!.Got this from somewhere else,and already had it programmed with Kodi (xbmc) I'm sure I could've done the install myself,but for under 60 bucks,I'd rather not risk screwing something up big time.(if you don't know what Kodi/XBMC is,look it up-it's fantastic) the simplicity of having that program along with all the other favs like Netflix,Plex,HBO Go,etc (HBO Go-not if you're a comcast customer that is,no support as of right now) Nice simple,easy to use,and navigate.Heck,I'd even recommend this for the non tech savvy at this point,and there is a SLIGHT learning curve to Kodi,but nothing too major.There are also ways to \"side load' Android apps,but I wont get into that right now.The wi fi is nice and strong with this stick too,we have an old house with lathe and plaster walls,ad this seems to do just fine with the router about 30 ft away (and the router is an old G model) so far so good!", "verified": true, "helpfulness": "1/1", "author": "Mick Schnabel \"Miklaus\""}, {"rating": 1.0, "review": "Looked forward to getting this thing and yet, it is almost May 2015 and I still cannot get the  bleeping thing to work.", "verified": true, "helpfulness": "1/1", "author": "Connie"}, {"rating": 2.0, "review": "Have to uninstall and reinstall Netflix almost every night in order to watch it.  It always freezes or won't load any shows or movies.", "verified": true, "helpfulness": "1/1", "author": "MFowles"}, {"rating": 4.0, "review": "Works great.......", "verified": true, "helpfulness": "0/1", "author": "steven greseth"}, {"rating": 1.0, "review": "Does not work properly in my country Tha Bahamas.If this product was only made for the USA it should of being stated before I made the purchase", "verified": true, "helpfulness": "1/2", "author": "Daniel M Cartwright"}, {"rating": 5.0, "review": "Awesome! We love all the choices available with the Fire Stick!", "verified": true, "helpfulness": "0/1", "author": "Amazon reader \"The Cover Guy\""}, {"rating": 4.0, "review": "exactly as expected", "verified": true, "helpfulness": "0/1", "author": "jer"}]