[{"rating": 5.0, "review": "Much, much more than expected. Don't let this turn you into A couch potato.", "verified": true, "helpfulness": "0/0", "author": "Will D"}, {"rating": 5.0, "review": "This is the best.. It responds fast and was easy to set up. The games are great and the whole family loves this.. A great gift for you of someone!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my fire stick. Bought one for my mom. Wish I could type my selection tho.", "verified": true, "helpfulness": "1/1", "author": "Candy"}, {"rating": 1.0, "review": "Bought 2 of these and not very happy.  It conts to boot me off when watching something or buffs every couple of mins.  I checked my internet speed with 3 diff companies and all have over 50 mbs upload and download.  If I could get my money back I would.  Would never buy again.  Save your money and buy the Sony Box that does the same thing and with more options.  You can use your Amazon Prime Membership on it too.  Hope this helps.", "verified": true, "helpfulness": "2/3", "author": "Tony C \"HONESTY\""}, {"rating": 5.0, "review": "OH MY GOSH I love this so much I go back and forth to Atlanta Georgia every two weeks and I stay at a hotel and this comes in handy every time. It's easy to hookup and easy to use I have so many people asking me where I get from I just say duh Amazon but of course.", "verified": true, "helpfulness": "0/0", "author": "Tina"}, {"rating": 4.0, "review": "Simple to install and easy to program", "verified": true, "helpfulness": "0/0", "author": "Sandra Solano"}, {"rating": 5.0, "review": "Fantastic value. A added to supplement Netflix as a movie and TV show source. I can use it stand alone to watch Netflix and music and....and the list goes on.", "verified": true, "helpfulness": "0/0", "author": "W.T.McCarthy"}, {"rating": 2.0, "review": "I didn't realize this needed to be plugged in to the outlet in order to work.  Part of the reason I bought it was because it was so small but now I have a cord hanging down from my tv.  Also the cord is way too short and I need to use an extension cord! Annoying!", "verified": true, "helpfulness": "0/0", "author": "Caitlin Rubenstein"}, {"rating": 2.0, "review": "this was disappointing, the price for the device was good however the prices for the episodes were ridiculous.  I have a subscription to Hulu Plus but you wanted me to down load an app then charge me more per episode.  Do you ever think that some people might be on a low budget??", "verified": true, "helpfulness": "0/0", "author": "corinne cisneros"}, {"rating": 2.0, "review": "I have mixed feelings about this. When it actually WORKS, it's great! It offers a nice selection of apps, it's easy to use, and it's a good substitute for paying for cable. The issue is,  IT NEVER WORKS. I can get it to work maybe 30% of the time? I constantly reboot it, and I even leave it completely off and unplugged overnight and it still doesn't work. It's not a wifi issue, as it's less than 3 feet from my modem. It even says under settings that it has a \"very strong\" connection, and yet nothing will load. It always says \"please check network settings\" but the network settings say it's fine! Restarting the apps and rebooting the system doesn't fix it. I mostly use it for Netflix and hulu; hulu sometimes will work when netflix won't but most of the time neither of them work. It's extremely frustrating!", "verified": true, "helpfulness": "1/1", "author": "Stephanie Sherwood"}]