[{"rating": 4.0, "review": "I've had mine for two weeks. If you watch Prime movies or Prime TV then this item is for you. It eliminates the hassle of connecting a tablet or computer to your TV. I would have given it five stars but the remote is a little awkward to use due to it's small size. Amazon made it very easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "John Escobar"}, {"rating": 5.0, "review": "I preordered this so I got a really good price.  I have the Roku on my living room TV.  When I saw this I bought it for my bedroom TV.  I love it and it work fine.  The only issue I have is that the remote is so small and easy to lose.  I put velcro on the remote and behind the TV so now I have a place to keep it when not in use.  I can now watch my movies from Amazon or Netflix while my husband watches whatever he wants.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have a smart TV an apple TV a Smart Bluray player and I have to say I have never been so happy with the format and interface of a product for streaming media and this was by far the least expensive.", "verified": true, "helpfulness": "1/1", "author": "David stimmer"}, {"rating": 5.0, "review": "This was a great buy.  I have a chromecast and have been using it for about 6 months, and noticed some issues right from the start that i didnt like. The Fire TV stick Is much easier to use, faster, and comes with a remote.  Some may not like another remote, but its critical in my opinion.  The Chromecast constantly disconnected from my phone(android) and ipad.  I would start watching and set my device down, then i would try to control the chromecast later, to pause video, turn it off, etc, and i would not be able to reconnect.  I would constantly take 2-10 minutes trying to take control of the chomecast again.  Very annoying.  The Fire Tv stick has not had this issue, even when using my devices as remotes.  I love it, and i would highly recommend it over the chromecast.  There is one thing that i find a bit confusing: When navigating the screens, you will swipe( if using your phone/tablet) to move to then next selection, but it moves in the opposite direction as would expect.  Example:  when swiping left on ipad/android, the list of icons/homescreen moves to the left.  But when doing the same swipe on your device when using the Fire TV stick, the icons move to the right.  Certainly not a deal-breaker.  Overall, well done, Amazon, well done.", "verified": true, "helpfulness": "0/0", "author": "Sandouble"}, {"rating": 1.0, "review": "doesn't work, will be returning it", "verified": true, "helpfulness": "0/2", "author": "Peggy"}, {"rating": 5.0, "review": "Simply awesome!", "verified": true, "helpfulness": "0/0", "author": "Michelle Bengen"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "max"}, {"rating": 4.0, "review": "It works pretty well, but it freezes up on me from time to time while I'm watching Netflix. That could also be from my Internet connection, so take it with a grain of salt.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "There's a lot to like about the Fire Stick - from watching old TV from the 50's on a big screen TV, to the CBS news feed, and especially how easy it is to set up. Occasionally however, in spite of the fact that I have an extra high speed DSL connection the Fire Stick can be outrun by the stream coming down and the wait icon ( a rotating circle) shows up. About 50% of those pauses turn into a broken connection and I am treated to a message informing me I have to have an internet connection. Mildly irritating, but my ISP probably is causing those hiccups. The solution is really simple: Just reboot the fire stick.So I press the reconnect button and all is well - wait, there is no reconnect button.So I press the reboot button and all is well - wait, there is no reboot button, either.So I haul my sorry (and crippled) self across the living room and perform a hard boot, by unplugging and replugging the fire stick receiver. Within a few seconds I am facing my home screen and can reselect whatever I was watching.", "verified": true, "helpfulness": "0/0", "author": "JonO"}, {"rating": 1.0, "review": "Keeps dropping the wifi!!", "verified": true, "helpfulness": "0/1", "author": "Peipooch"}]