[{"rating": 5.0, "review": "I like the way it makes my regular flat screen TV into a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Margaret K. Myott \"M.Myott\""}, {"rating": 2.0, "review": "So they advertise that this is faster and better than the Chromecast but it was SOOOO much slower.  My WiFi network is stupid fast, had to upgrade it all a while back when I purchased the nVidia Shield; stellar router, T1 fiber Internet, even tried with no other devices online, tried 2.4 and 5GHz bands and only about 20ft from the router and still buffering ever 20 seconds.  This thing has many issues.  For starters, my TV wouldn't recognize it, that took about 10 minutes and then another 10 minutes trying to connect the remote.  The USB power cable CANNOT be plugged into the TV, you must used the AC adapter.  Be warned, the cable is only a few feet so if you have your TV wall mounted and don't have a wall outlet near the ceiling you will need a USB extender.If you enjoy using Allcast, give it up, doesn't work well at all with this.  When Allcast is searching for devices it finds my Roku, all three Chromecasts and.......3 minutes later it finds this firestick.  Figured I would buy this with the hopes of faster media streaming from my tablet or phone of my own media since it is dual band but I was wrong.  Streaming over my Chromecast is much faster and smoother.  Less buffering than this stick.  Save yourself the headache.Do you enjoy how playing Netflix and when a show ends the next one plays automatically after?  Give that up cause it sort of does that.  Once the fire stick is done with one episode, it buffers the next to 99% and stays there; only playing audio.  It forces you to manually grab the remote, back out of Netflix and play the next episode if you want audio and video.The device does come with some pre-installed apps, mostly just some sports worthlessness, Pandora and Netflix.  (Yaaaawn)  Very easy to navigate and find your way around.  You are able to find your Prime music and movies with great ease but transfer and buffering times are so slow I had enough time to purchase other products on amazon before they began to play.Overall I want to punch myself in the face on even buying this.  Had such high hopes, amazon usually is a step above the rest.  Switched back to my crummy little Chromecast and Roku 2.  Guess I will just endure laggy and glitchy performance till the Chromecast 2 comes out.  Please don't waste your money, I beg you.  I fell for marketing hype and fluffed up advertisement and now I have to print a return shipping label.  My vision of amazon made products has greatly decreased.  Oh well, live and learn I guess.", "verified": true, "helpfulness": "0/0", "author": "BloodAgent"}, {"rating": 5.0, "review": "I gave it to my grandson for christmas and he loves it.He used it to watch movies with his grandpa and now im buying him one too.It is great and very simple to use.", "verified": true, "helpfulness": "1/1", "author": "cathy parenzin"}, {"rating": 1.0, "review": "At a certain extent it's good but majority of all the movies we wanted to watch we couldn't cause you have to pay.  Majority of alot of movies or music you have to pay.", "verified": true, "helpfulness": "0/0", "author": "Vianey Ruelas"}, {"rating": 5.0, "review": "amazing tool", "verified": true, "helpfulness": "0/1", "author": "Robert Britten"}, {"rating": 5.0, "review": "This is amazing, it functions way better than chromecast (besides not having screen mirroring, please add that) and is super slick to use. Highly recommend, and if you get the fire TV app on your phone you can voice control it too.", "verified": true, "helpfulness": "1/1", "author": "TTJAM"}, {"rating": 1.0, "review": "They want you to pay for things that are free on other systems that are free. Check out Netflix. Much cheaper and easier to use!", "verified": true, "helpfulness": "2/2", "author": "Robert Smith"}, {"rating": 5.0, "review": "Absolutely love it", "verified": true, "helpfulness": "0/1", "author": "Rick Bumbaca"}, {"rating": 4.0, "review": "We are enjoying the Fire Stick and have seen many movies that were good.  Wish there were more movies available and that ESPN and others were free!", "verified": true, "helpfulness": "0/0", "author": "SALLY"}, {"rating": 5.0, "review": "Easy to set up and works great!", "verified": true, "helpfulness": "1/1", "author": "Shari Neuenschwander"}]