[{"rating": 5.0, "review": "It works very well.  I just wish that in the commercials and all the promos for it that they would actually mention that it has to plug into a power outlet.  That was one reason we bought this, even though we have a Chromecast, because finding free plug-in near the TV is not easy.  I do think that it works better than the Chromecast though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got this for $19 last year. Haven't turned my Xbox on once since I got this bad boy. It's just too convenient. Pair it with the Plex app and you'll never leave bed. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 5.0, "review": "Grest", "verified": true, "helpfulness": "0/0", "author": "Susan E Fuller"}, {"rating": 3.0, "review": "Has issues staying connected to my WiFi, and requires me to reboot it once every couple of days. Otherwise, it is just fine for Amazon Prime Video and Netflix, while much less noisy and more energy efficient than my PS4. I assume Amazon will work out the kinks along the way. Will NOT under any circumstances connect to my 5 GHz wireless N. Have to fall back to the 2.4 GHz band, which is congested with everything streaming off it. Hope Amazon will fix that issue too, since I've seen a LOT of posts about 5GHz connectivity issues.", "verified": true, "helpfulness": "0/0", "author": "John Garr"}, {"rating": 5.0, "review": "It does what it said it would. I just plug in the stick into a HDMI port choose input and most streaming entity was seen, for free and for purchased.", "verified": true, "helpfulness": "0/0", "author": "kingview"}, {"rating": 5.0, "review": "very good product, and good price", "verified": true, "helpfulness": "0/0", "author": "liuyan"}, {"rating": 4.0, "review": "Perfect for streaming amazon. Hopefully add HBO go in the future. Do need to plug into a power source.", "verified": true, "helpfulness": "0/0", "author": "Ajay Joshi"}, {"rating": 4.0, "review": "Good product. It is still buggy but I'm sure this is because it is a new product", "verified": true, "helpfulness": "0/0", "author": "Diana Olivera"}, {"rating": 4.0, "review": "It works well, but the Netflix app takes a while to load. I'm not sure if it's a Fire Stick concern or a Netflix concern, but it does knock the usability of the device down a peg. It should also specify in the app descriptions which are subscription based and which aren't.", "verified": true, "helpfulness": "0/0", "author": "I am disappoint"}, {"rating": 1.0, "review": "This is the first time that I have been disappointed with Amazon. This product drops signals since the day I got it. I called customer service twice. Each time ended with me being told a technician would contact me with no follow up. There are lots of people having similar issues. It should be recalled. Amazon is ignoring this issue. I do not recommend.", "verified": true, "helpfulness": "1/1", "author": "maureen singer"}]