[{"rating": 5.0, "review": "Oh! I am thrilled about the Fire Stick! I just don't like playing extra every time something new in video comes out.", "verified": true, "helpfulness": "0/0", "author": "Edward Abratowski"}, {"rating": 5.0, "review": "Why have I wasted so much money on AppleTV and Roku?! The fire stick is so much better! It has so many more view options that don't exist on Roku or AppleTV and its cost so much less! Any one want to buy two Roku's and a AppleTV so I can replace them with Fire sticks?", "verified": true, "helpfulness": "0/0", "author": "Patti Altshuler"}, {"rating": 3.0, "review": "The quality of the video is not great.  This may be a problem with the wireless router throttling down  down the bandwidth.  Finding the content that i seek is not always easy.  I do like the portability.", "verified": true, "helpfulness": "0/0", "author": "David C. Kelder"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Wanda E. Boggs"}, {"rating": 3.0, "review": "Now that our son finally was able to get it to work it seems to be performing pretty well.  I do find it difficult to find what I want to watch.  I still have now found a search function.My frustration initially was that it was not installing as the minimal instructions said it would and there was no tech assistance that I could find.  We are so lucky our son is sort of a tech because we would still not have it working after receiving it for Christmas.  This is the second item I have received through amazon for which there is no assistance.  Really disappointed in that aspect of Amazon.", "verified": true, "helpfulness": "0/0", "author": "Rosie"}, {"rating": 4.0, "review": "Is nice", "verified": true, "helpfulness": "0/0", "author": "humberto"}, {"rating": 5.0, "review": "Great value for the price", "verified": true, "helpfulness": "0/0", "author": "Marcus Williams"}, {"rating": 5.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Taylor Chamness"}, {"rating": 5.0, "review": "So far this product is excellent. Easy to install and easy to use. Love it!", "verified": true, "helpfulness": "0/0", "author": "Ida Gencarelli"}, {"rating": 4.0, "review": "I love it it works amazingly I just wish it had a web browser. Then it would be flawless.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}]