[{"rating": 5.0, "review": "awsome", "verified": true, "helpfulness": "0/0", "author": "Michael Montelongo"}, {"rating": 3.0, "review": "Excellent streaming device, works perfect with Netflix, Hulu, Amazon Prime and in my case more importantly Plex. Only downside is it doesn't work well with TV on and off features (Vizio). TV will remain on all day, won't power off unless I unplug the Amazon TV Fire Stick. Other then that I love this video streaming unit!", "verified": true, "helpfulness": "1/1", "author": "Brad Stickler"}, {"rating": 5.0, "review": "Love, love, love it. This is all i do all day. Watch shows and movies", "verified": true, "helpfulness": "1/1", "author": "Mara H. Montano \"Jesuslove\""}, {"rating": 1.0, "review": "Even the Amazon movies won't play. They play better with Roku or online.", "verified": true, "helpfulness": "1/2", "author": "Rene Gonzalez \"René G.\""}, {"rating": 4.0, "review": "This is much easier and more user friendly than my Chromecast.  I'm giving it 4 stars because casting things from my phone to the unit is a little tricky.  If you like using the apps like netflix, hulu etc I'd say BUY IT.  It's a quick and cheap way to turn a dumb TV into a smart TV.", "verified": true, "helpfulness": "1/1", "author": "Shannon D"}, {"rating": 5.0, "review": "A good value is you're a Amazon Prime member. Instantly turns a simple projector into a \"smart\" projector.", "verified": true, "helpfulness": "0/0", "author": "Ryan Chen \"Ryan\""}, {"rating": 4.0, "review": "Easy setup,  Works as advertised... easy to operate, great features", "verified": true, "helpfulness": "0/0", "author": "Robert Ricci"}, {"rating": 5.0, "review": "A great device that allows so many options. Great movie selection! Amazon music is impressive. Works great with my Fire HD tablet. Would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "GIrigoyen"}, {"rating": 5.0, "review": "So much easier than the other type.", "verified": true, "helpfulness": "0/0", "author": "Chris Granda"}, {"rating": 5.0, "review": "i love the stick and how it works just need more fastnloud shows and car reality stuff", "verified": true, "helpfulness": "0/0", "author": "greg cook"}]