[{"rating": 4.0, "review": "Quick and simple instal with easy access,  made more useful with prime account", "verified": true, "helpfulness": "0/0", "author": "J. G. Billingsley MD \"airdoc\""}, {"rating": 4.0, "review": "Has to have a WiFi network to connect and mirror other devices. Was hoping to use it as a mirror to my android devices but will not connect stay connected with my tablet.", "verified": true, "helpfulness": "0/0", "author": "Kristi Matie"}, {"rating": 4.0, "review": "With Amazon Prime, this is a great gift. However, it is a little difficult getting used to it. Some kind of manual would be helpful.", "verified": true, "helpfulness": "0/0", "author": "Bud H"}, {"rating": 5.0, "review": "Amazing! Easy set up and works fast!", "verified": true, "helpfulness": "0/0", "author": "Abby Scioneaux"}, {"rating": 1.0, "review": "When loading apps, error messages show up... Unable to run, try later... Not very impressed with Fire Stick... maybe someone could help situation.. Thank you..", "verified": true, "helpfulness": "0/0", "author": "DOUGLAS"}, {"rating": 5.0, "review": "Thanks you should done this longtime ago", "verified": true, "helpfulness": "0/0", "author": "Perry Sandoval"}, {"rating": 5.0, "review": "Easy to install. Easy to use. Love it!", "verified": true, "helpfulness": "0/0", "author": "Judith Pinter"}, {"rating": 5.0, "review": "So far I love it for the price....I used it for mostly Netflix, Amazon Prime and Pandora....but with Amazon Prime music list growing, I use Pandoar less.  I don't like the directional ring and select button as I tend to hit the wrong one or both as the directional button is thin and surrounds the larger select button...but I've learned to live with it....else it seem to buffer up and so far the only buffer loss as been on The Blaze app where sometimes it fits and starts or changes res....but since I don't spend a lot of time using that app. I don't care. Over all I like this little bugger a lot. I see it has force Roku to drop the price on their \"stick\".... I have two Roku boxes in the house...they work pretty well too but I've had buffer or bad packet jams on them from time to time...don't know if those are app or Roku related...certainly not my Net Connection which is 20 Meg up and downWHEN or IF Amazon gets the music selection on Prime that Rhapsody has I will be dropping Rhapsody for a number of reasons. One is the music from Amazon, on The Stick, is very reliably solid, Rhapsody's App's for devices other than a computer tend to quit or stall...and even my computer app stalls...and Rhapsody's new app wiped out all my PlayLists when I tried to change a few things on my local device....and those lists took me years to compile....not happy with them.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "Great item....", "verified": true, "helpfulness": "0/0", "author": "eric simmons"}, {"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Andrevious"}]