[{"rating": 5.0, "review": "Got this as part of the pre-order special from Amazon, and I love it! It's a really nice all in one media center stick that you can plug into the back of any \"dumb\" TV and turn it into smart TV with customizable apps. I love the fact that I can control it with the remote, or with a simple app I can control it anywhere in the house with my android smart phone. We use it extensively for Amazon Prime movies, Netflix, Amazon Music, etc...5 out of 5 stars, it's useful, easy to configure and fills a nice niche!", "verified": true, "helpfulness": "2/2", "author": "Joshua Collins"}, {"rating": 4.0, "review": "Good unit. i like having the remote so I don't have to use a Mobil device lime other products.  I thought the unit was supposed to also do screen mirroring and I don't see it having that ability. Love that I can pull prime music from it as well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am positively happy I decided to buy the fire stick . The only problem I am too addicted to watch shows when I have other important business to take care of. Have told my friends to try it. Great gift as well.", "verified": true, "helpfulness": "1/1", "author": "Irene Azzarito"}, {"rating": 5.0, "review": "Love it love it love it. One of the best gifts ever! With all of the things that you can get with a prime membership I am getting rid of my cable!", "verified": true, "helpfulness": "1/1", "author": "Victoria Moynihan"}, {"rating": 5.0, "review": "Had trouble connecting my smart phone but other than that, it's great!", "verified": true, "helpfulness": "1/1", "author": "T. Brantner \"gringa908\""}, {"rating": 5.0, "review": "I'm addicted to it. I watch it every day.", "verified": true, "helpfulness": "1/1", "author": "donna a gregory"}, {"rating": 5.0, "review": "Great product, I wish I could have bought another at introductory price, a good value at $39", "verified": true, "helpfulness": "1/1", "author": "Alan Griffin"}, {"rating": 5.0, "review": "wish i could get dish any where to download into it", "verified": true, "helpfulness": "1/1", "author": "carol a gatewood"}, {"rating": 5.0, "review": "Received item quickly and exactly as described.", "verified": true, "helpfulness": "1/1", "author": "RayRay's \"Tell It Like It Is\""}, {"rating": 5.0, "review": "So far I love it.  It makes strolling the streaming world very easy.  Currently loving ARCHER and all that geniusly written hilarity.The ONLY drawback is that they've made the little remote bright black.  Dull black.  Invisible black.  Lose it anywhere and can't see it black.  I recommend spray paint or bright duct tape.  Your friends might think you're a doof, but at least you won't be walking in circles muttering \"Where's The #@%# Remote??\"", "verified": true, "helpfulness": "1/1", "author": "T. JORGENSON \"Pamphleteer\""}]