[{"rating": 5.0, "review": "Works great. However my husband lost the remote with in the first weekend. Any products to fix that? Maybe Velcro shirt so I can connect things to him???? Hmmmm", "verified": true, "helpfulness": "0/0", "author": "Kelly A."}, {"rating": 4.0, "review": "I found it extremely easy to setup. The stick offers many relevant apps, movies, music and sports. Some videos from Youtube has audio static but I believe it is due to how it was downloaded. I personally love it and wish I had brought it a lot sooner.", "verified": true, "helpfulness": "0/0", "author": "Janice H."}, {"rating": 5.0, "review": "Love my Firestick!", "verified": true, "helpfulness": "0/1", "author": "LAH"}, {"rating": 5.0, "review": "Enjoying the Fire stick so far. Works well,  no issues.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire stick is a must have ! It's easy to setup and the remote control works like a charm.  I had recently purchased a chrome cast but found out I was not able to use it with Hotel's WiFi ,  the Amazon fire stick allows you to use the hotel's wifi without any problem .  Unlike the chrome cast you don't even have to use your phone or mobile device ,  this is an awesome device worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Ramses A Perez"}, {"rating": 5.0, "review": "Very slick. Best DVR or cable interface I've used so far. VERY intuitive and easy. Kudos Amazon! Fantastic value.", "verified": true, "helpfulness": "0/0", "author": "Erik Williams"}, {"rating": 5.0, "review": "I love this Fire stick!  I can watch hi-def streaming with Amazon Prime and Netflix.  That's was the primary reason for my purchase.  And this has EXCEEDED my expectations!  I though, eh, $39, it's worth a shot.  And worth it this is!I was using my blue ray player to stream Netflix and it was sub-par, I was forced to purchase a new device because the manufacturer was removing that feature.  I am SO glad they did.  :)I might even purchase another Fire stick for my other room, even though the Stick is portable, I can just plug it into my other tv.  It's wireless, it's made to live freeIn the box you get the Fire stick and a power cord.  You must use the power cord because the Fire stick does not get enough power through just the HDMI port.I will definitely buy another!!", "verified": true, "helpfulness": "0/0", "author": "Rose"}, {"rating": 5.0, "review": "It is better for our TV and needs than Chrome Cast was. We can now watch Hulu and Prime Movies without interminable buffering. It works as expected.", "verified": true, "helpfulness": "0/0", "author": "C. Lee"}, {"rating": 5.0, "review": "love it easy to use", "verified": true, "helpfulness": "0/1", "author": "beebee"}, {"rating": 5.0, "review": "Love, love, love this.", "verified": true, "helpfulness": "0/0", "author": "Erin O."}]