[{"rating": 3.0, "review": "NOT Samsung compatible! I have a Vizio and it works great and loved it! Tried to use in my bedroom (got a Samsung as a present from my son) and it doesn't work at all. I looked it up and it apparently isn't compatible with Samsung. I guess I will have to use my Chromecast for the bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Leah"}, {"rating": 5.0, "review": "Better than expected", "verified": true, "helpfulness": "0/0", "author": "GWEN HARRISON"}, {"rating": 5.0, "review": "The Fire TV Stick is outstanding.  It loads really fast, no buffering. The remote is simple and easy to use.  Love the feature of it being already set up when it arrives, all you do is plug it in and watch.  Love the size, no need for a cabinet, just plug it into the HDMI plug on the tv and plug the power plug into the USB in your tv.  I have to say, I had some trouble with the power plugged into the wall.  It made the stick really hot and one time I had trouble.  I used the remote to scroll through a menu but when I let go of the button, it kept scrolling by itself.  I touched the stick and it was really hot.  I tried using the USB for the power and and it has run just fine for a month now.  Running cool and no trouble.", "verified": true, "helpfulness": "1/1", "author": "Buyer \"Buyer\""}, {"rating": 5.0, "review": "Had the fire stick for a few weeks so have not had time to check out all it has to offer.  I bought so I could watch the Bosch series which we enjoyed a lot.  Also, have watched all the seasons of Justified.  We have been extremely pleased so far.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it !!!!", "verified": true, "helpfulness": "0/0", "author": "Bruce H. Shaw"}, {"rating": 5.0, "review": "Love it, so easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "Katie Brown"}, {"rating": 2.0, "review": "Had the stick for a few weeks and worked good and now will not connect to the wifi, keeps \"scanning\" for networks.  Stick is defective and will be returned.", "verified": true, "helpfulness": "0/0", "author": "ctv20"}, {"rating": 5.0, "review": "Got this free with sling, best free item ever. I'll probably be buying an extra also.", "verified": true, "helpfulness": "0/0", "author": "Blake Peavy"}, {"rating": 5.0, "review": "Love converting my TV to a have features of a smart tv without the larger cost of purchasing one.", "verified": false, "helpfulness": "0/0", "author": "Shirley Kelly"}, {"rating": 1.0, "review": "I've been using this stick for over a month now and am extremely frustrated and ticked off.I used to watch Netflix through an old Wii.  It worked great.  I \"upgraded\" to the Fire Stick at the same time I upgraded to a fiberoptic internet service.Everything that interacts in my home with the fiberoptic network is vastly improved.This stick, though, loses sync with my home wifi network every few minutes, and sometimes a Netflix video will play for two seconds, buffer, play for two more seconds, buffer some more, and so on.Watching other video services, including Amazon's videos, I experience the same problems.  So it isn't Netflix, and it isn't my home wife network.The Android app for the stick loses sync in less than 30 seconds.  If you don't interact with the app, it will disconnect from the wifi network and you have to keep reconnecting.  If you are lucky, it reconnects after twenty or thirty seconds.If you are lucky.The app is also very glitchy between my interactions on the phone and what happens on the TV.Amazon has a lot of bugs to work out on this garbage.Update: I have upgraded to the Fire TV, which has a 2 GB buffer, and all the problems I had with the Stick are solved.", "verified": true, "helpfulness": "0/0", "author": "LT"}]