[{"rating": 5.0, "review": "Best way to watch TV EVER!", "verified": true, "helpfulness": "0/0", "author": "Kilee"}, {"rating": 5.0, "review": "works fine", "verified": true, "helpfulness": "0/0", "author": "Alvin Bailey"}, {"rating": 5.0, "review": "Great item for hulu Netflix and other apps great gift for fathers day.", "verified": true, "helpfulness": "0/0", "author": "frank"}, {"rating": 5.0, "review": "This is exactly what I was looking for. I can watch a lot of different things with it.", "verified": true, "helpfulness": "0/0", "author": "Debra Spann"}, {"rating": 5.0, "review": "I am surprised how much I love this. It totally repaces cable and netflix", "verified": true, "helpfulness": "0/0", "author": "suzi motooka"}, {"rating": 5.0, "review": "The fire stick works very well despite what others say about its performance compared to the fire tv set top box.  I mostly use the stick for streaming netflix and prime instant video. I recently started using Kodi as a side loaded app and I am very impressed.", "verified": true, "helpfulness": "0/0", "author": "J. Jones"}, {"rating": 5.0, "review": "what a great addition to our viewing fun!!!", "verified": true, "helpfulness": "0/0", "author": "Daniel J Lohman"}, {"rating": 3.0, "review": "Overall I would put the software as 100 but the hardware just isn't up to par the Amazon Stick can't keep a clear signal. I've upgraded my router and  internet speeds for streaming but the stick either can't find the signal or the streaming suffers. The funny thing is I get full bars of WIFI on my phone outside, right behind the wall were the stick is. Yes it will work well if the TV were closer to the Router but that's not how my house is set up (For those saying get a stronger router see previous sentence). I've been through two sticks already (The stick would drop the connection randomly until finally it wouldn't connect to WFI no matter the distance). If an new one comes out with better connection capabilities I'd be willing to try because despite the issue it does have some pretty solid apps that are easily navigated.", "verified": true, "helpfulness": "0/0", "author": "Jared C."}, {"rating": 5.0, "review": "love it, and said bye to cable TV. No more commercials.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 1.0, "review": "this device limited download apps on it. It won't let you download apps. from third party and it can not be rooted. I don't know what to do it. should I return it or keep it.", "verified": true, "helpfulness": "0/1", "author": "tai"}]