[{"rating": 5.0, "review": "Great item for the price!", "verified": true, "helpfulness": "0/0", "author": "Kathy D"}, {"rating": 5.0, "review": "Just as expected! No regrets", "verified": true, "helpfulness": "0/0", "author": "MedGuy \"Doc Vishal\""}, {"rating": 3.0, "review": "Responds slowly at times. No HBO GO service. ShowtimeAnytime is a pain in the butt to set up through the device (my computer isn't in the same room, and ShowtimeAnytime's website doesn't have the same interface via mobile, so I can't authorize the Fire TV Stick when I remember I want to watch Showtime). Recently the device disconnected from my WiFi and refused to reconnect. I had to reboot the device by unplugging it from its power source and the TV.I am underwhelmed by this device.", "verified": true, "helpfulness": "0/0", "author": "Island Cyclist"}, {"rating": 5.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Steide \"Eventsplanner\""}, {"rating": 5.0, "review": "I love it. It works great and provides the entertainment I need!", "verified": true, "helpfulness": "0/0", "author": "Brittany"}, {"rating": 4.0, "review": "Great SItck", "verified": true, "helpfulness": "0/0", "author": "Alexander Murillo Chavarria"}, {"rating": 5.0, "review": "Just got it but needed Amazon support to help me set it up and now it works fine.  Only issue is having to use 3 remotes now, tv one to change input, cable one to turn on tv and fire stick remote to access fire stick tv.  We'll get the hang of it after we've done it a few times.  But there's a lot there especially if your a prime member which I am.", "verified": true, "helpfulness": "0/0", "author": "Audrey M."}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "tracy rann"}, {"rating": 4.0, "review": "I enjoy having this - there are so many more choices available.  It was easy to set up and is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Music n Books"}, {"rating": 4.0, "review": "The Fire TV Stick was easy to set up and is very easy to use.  There are tons of apps to choose from.  The only downside was the wire that has to run to an electrical outlet from the stick.", "verified": true, "helpfulness": "0/0", "author": "wyld40"}]