[{"rating": 5.0, "review": "This is our first venture into on demand TV.  This is easy to use and set up.  Very easy to use with Prime.", "verified": true, "helpfulness": "0/0", "author": "pjo"}, {"rating": 5.0, "review": "I read reviews and all media streaming devices.but I haven't done anything Amazon fire stick more than exceeded my needs I recommend this to anyone looking for a inexpensive way to stream yourApps", "verified": false, "helpfulness": "0/0", "author": "brian fox"}, {"rating": 4.0, "review": "much quicker than Chromecast.  However,  I am 99% certain that the Fire Sick intentionally slows down Netflix.  Amazon Prime works perfectly, and them menus are nice and quick, but it is nearly impossible to watch Netflix on it.", "verified": true, "helpfulness": "0/0", "author": "Jackson"}, {"rating": 5.0, "review": "I'm so amazed of the quality on the fire tv stick. The picture is clear and very easy to use, even my kids enjoy it. And the fact that I can use it anywhere...😊", "verified": true, "helpfulness": "0/0", "author": "minda bybee"}, {"rating": 5.0, "review": "Very easy to setup and use. My 9 tear old son had no problem finding movies and games after a short video tutorial that auto loads upon initial plugin.", "verified": true, "helpfulness": "0/0", "author": "christopher renne"}, {"rating": 4.0, "review": "So far I like it. I have had no problem really with the streaming on netflix or prime videos. As of right now it is well worth the price.", "verified": true, "helpfulness": "0/0", "author": "SAMANTHA"}, {"rating": 5.0, "review": "Very easy to use, and gives you access to endless hours of TV watching.  Great if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "Lelak"}, {"rating": 5.0, "review": "Amazing stick", "verified": true, "helpfulness": "0/0", "author": "Jesus A. Gonzalez"}, {"rating": 4.0, "review": "The interface is pretty simple and sleek. The big problems i have  are too short of a wall adapter cord for the usb power, a glitchy remote that sometimes jumps through 2, 3 or many selections when you are trying to advance one at a time, some of the apps only have a smaller selection of the content that you can view online on the web page (for example pbs and pbs kids) and last you are not able to add selections to my list in a child's profile on netflix. Those are all somewhat minor inconveniences so i still rate the firestick highly. We have gotten a great deal of enjoyment and convenience from it.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey M. Arnold"}, {"rating": 5.0, "review": "Amazing product.  So easy to use.  I LOVE IT.  Moves easily from TV to TV and is a great compliment to the Prime membership.  The price is great, the product is great, a WIN WIN.", "verified": true, "helpfulness": "0/0", "author": "Lynn M. Higgins"}]