[{"rating": 3.0, "review": "Set up was pretty easy.  Logging into Prime and Netflix-no problem.  I really like the interface on Netflix.  Unfortunately, I am unable to watch ANY programs.  They come up when I search but when I hit play, they just get stuck in the \"loading\" loop ad infinitum.  I had my old ROKU set up on another channel so I checked that it wasn't my Internet connection.  The first generation ROKU loads up netflix quickly.  The new firestick not only does not load up netflix content, but doesn't load up Amazon content either.  What a dud!!!  Also, I'm having trouble with the remote.  It seems to click ahead twice for every click and when you try to enter stuff on the keyboard with the remote, it will often enter two letters or skip a whole row of letters.  Another glitch is that the onscreen keyboard occasionally goes out of wack where the letters get scrambled and are no longer in the alphabetical order that is normal for a keyboard entry.  I will seek out the help desk but right now I would recommend people hold off until the bugs are worked out.Edit:  I figured out the problem. Truns out after having no problem initially connecting to my router, the firestick was having authentation issues.  After re-entering my password, still had authentication issues.  Went back to my ROKU and it was having a few issues but not nearly as bad.  I have an older TV and the HDMI inputs are in the back of the TV which was shielding the signal from the stick.  If you have a similar set up, I would avoid buying any of the stick devices and go with the set top type boxes.  My short-term solution is to angle my TV slightly so that there is a slight gap facing towards my router.  I might end up moving my router closer to the TV (or behind it)", "verified": true, "helpfulness": "0/1", "author": "Bill Neely"}, {"rating": 5.0, "review": "This has an easy to use 'user' interface, and performs better than I expected.", "verified": true, "helpfulness": "1/1", "author": "azpeeps"}, {"rating": 4.0, "review": "Incredible remote. Works without line of sight. Need it whether you have a smart tv or not so you can do a voice search. Very smart remote. A lot of options. Only scratched the surface.", "verified": true, "helpfulness": "0/0", "author": "Sir Mabin"}, {"rating": 1.0, "review": "it came with no prime connection, when I tried to tie it to my existing amazon account it would not log in, so the accounts were not the same login.  I tried the help pages which are pathetic and designed for a 2 year old no a problem with the technology.  I had to search down a contact number and got someone with such bad english I thought I was calling an offshore sales line.  The entire experience was miserable. I am sure it's a decent product but Amazon like it's other corporate companions has put customer service at the bottom of the this of it priorities.. This was not worth the 20 even with a discount, the hassle really isn't worth the waste of anyone's time of money.", "verified": true, "helpfulness": "1/3", "author": "Eric"}, {"rating": 5.0, "review": "Works as expected.", "verified": true, "helpfulness": "1/1", "author": "Matthew Neu"}, {"rating": 5.0, "review": "excellent gadget for bargain price of $25 at Best Buy.  So many things to watch if you have Amazon Prime or Netflix .  Easy to set up, worked immediately with my home wifi with 5 MBS speed.  I also installed the android Fire Stick app which added voice search for effortless searching.  Somewhat unhappy that some of my old scifi movies were not available or cost too much,  but that is a complaint about Netflix,  not the fault of the Amazon Fire Stick itself..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Amazon ads for the fire tv stick as well as the fire tv stick box feature Plex. So i am pretty tweaked to find I have to pay $5 for the plex app. It's not the cost but the false advertising that i find upsetting.Very limited app library too.  Stick with roku.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!!! For someone who is tired of watching on Laptop, who owns a TV, and doesn't have to listen to commercials is great! If I can install it, anybody can...crazy easy I instruction; simple.", "verified": true, "helpfulness": "2/2", "author": "Cindy"}, {"rating": 1.0, "review": "received one firestick... installed it, connected to my wifi - but after it updated the software, it powered off and never powered back on again.received a replacement firestick - installed it, connected to my wifi - but it kept giving an error that it wasn't able to update.  Did a factory reset, but continued to give the same error.Roku's are so much easier to connect and use... we'll just continue to use the three Roku's we have that don't have any issues.  Just wanted to try the firestick device to have something to compare to - but for this one, there is no comparison.", "verified": true, "helpfulness": "2/4", "author": "Michael Edgerle"}, {"rating": 1.0, "review": "I bought this to replace Roku HD, which was slowing down. Fire TV Stick is even slower. Apps for Fire Stick are limited compared to Roku. Sound comes and goes in all ports on TV.  Product is not ready for Prime Time, just like Fire Phone. Amazon is rushing products that aren't fully baked, which is a shame because shopping on Amazon & Amazon customer service are 5 stars. Screen savers are nice, but I'd rather be able to watch a movie without constant buffering.", "verified": true, "helpfulness": "2/4", "author": "PT"}]