[{"rating": 3.0, "review": "a little complicated for me to realize what it does and if it costs more for me", "verified": true, "helpfulness": "0/0", "author": "pam h hegg"}, {"rating": 1.0, "review": "Got this for my daughter.  Worked great for first week, now doesn't work at all. Tried on multiple tv's, nothing! How do I file a warranty claim?", "verified": true, "helpfulness": "0/0", "author": "Ronald P Gwin"}, {"rating": 4.0, "review": "On May 12, 2015  an email was sent from store_news@amazon.com entitled,\"Watch TV Without Bugging Your Partner,\" stating that ,\"Amazon Fire TV and Fire TV Stick are now compatible with Bluetooth headphones.\" so I happily proceeded to order a Fire TV Stick for a tv in a bedroom ( I already have the Fire TV in the main family room).Well, imagine my surprise when I attempted to pair the bluetooth headphones (which I ordered at the same time as my new Fire TV Stick) and was informed that only bluetooth game controllers not headphones can be paired with the Fire TV Sitck!Thankfully, I am able to use both items in other applications and will not need to return them but I was disappointed that Amazon misinformed me as well as other loyal customers.I phoned customer service, explained the situation and was kindly issued a five (5) dollar promotional credit.FYI -The Fire TV will pair with bluetooth headphones and game controllers.", "verified": true, "helpfulness": "0/0", "author": "Elena M. Phillips"}, {"rating": 5.0, "review": "Simply love it.  Easy to install and operate. Why ever watch \"regular\" TV again?", "verified": true, "helpfulness": "0/0", "author": "Flyingsolo"}, {"rating": 5.0, "review": "Great, Better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Sandra Nary"}, {"rating": 3.0, "review": "This is ok for the price, however it does stop to buffer a lot more than my Amazon Fire TV streamer that I purchased for $99. I think spending the extra money may have been worth it, but this is for the extra TV.", "verified": true, "helpfulness": "0/0", "author": "Jillian Gingery"}, {"rating": 5.0, "review": "use this TV stick everyday and have no issues with this. Does what its supposed to", "verified": true, "helpfulness": "0/0", "author": "Marcin Rak"}, {"rating": 5.0, "review": "Plugged it in to my Samsung SmartTV, fired it up, Firestick updated its software automatically and just works. Very fast response, about 5x faster than the app that is provided by Samsung to access Amazon. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "nesnet"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "SHAWN L."}, {"rating": 3.0, "review": "It was fine but it is the same as having the fire tablet connected to the TV but with a cable. Since we have 2 fire tablets already I took it back.", "verified": true, "helpfulness": "0/0", "author": "Sjacks14"}]