[{"rating": 5.0, "review": "Perfect little device. Just perfect.", "verified": true, "helpfulness": "0/0", "author": "Daniel Duran, Jr"}, {"rating": 3.0, "review": "If you are a heavy Netflix user, like we are, you may want to think twice before buying the FireTV Stick... or at least power it via AC (which, to be fair, Amazon recommends anyway).  It seems that when the FireTV Stick loses power, it does not retain your logon information for Netflix (this is not an issue for ANY of the other apps that I use that require logon)... so, if you are powering via USB port on your TV, this will happen every time you turn off your TV!  Evidently, Amazon sees retaining your logon credentials for Netflix as a \"feature request\" and not a bug (nevermind that this is a basic expectation of any app, that all other apps on the FireTV Stick seem to not have any issue with this and that every other device I use Netflix on does not have this issue).  This \"feature request\" has been open for some time.If you are okay with powering via AC (which would drastically reduce how often you'd need to enter Netflix credentials) or are not a heavy Netflix user, this device is a fantastic value.  Apps work well, interface with Amazon services is excellent (as you'd expect).  A cross-app search function would be welcomed, but otherwise very, very good device!", "verified": true, "helpfulness": "0/0", "author": "jpn010"}, {"rating": 4.0, "review": "I'm happy with it but don't know why I can't get newsmax or RT tv or fox news so I can keep up on world events.  Also would like to get hulu regular.", "verified": true, "helpfulness": "0/0", "author": "Norman T"}, {"rating": 5.0, "review": "I really love the fire stick!  I have a ROKU for my office TV but instead of buying another one for my bedroom I decided to buy the fire stick.  I was lucky enough to catch the fire stick on sale which was my first plus.  2nd this was SO easy to set up.  I love the options it has as well.  I have been able to watch Hulu Plus, Netflix and a bunch of other channels with it...no problems at all.", "verified": true, "helpfulness": "0/0", "author": "N. Mason"}, {"rating": 5.0, "review": "Have a Google TV, Roku, and Google Cast. Wish I would have bought 3 more Fire Sticks.", "verified": false, "helpfulness": "0/0", "author": "John Hernandez"}, {"rating": 3.0, "review": "I've had to restart fire stick. Any times. Other than that it's been fine.", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Works great for kids room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This has worked perfectly for me to stream Netflix and Hulu on my tv and not have to hook up my laptop to it.  Set-up was a breeze and didn't take very long for me because I already had my Netflix and Hulu accounts.  I am very happy with this purchase.  I was a little hesitant based on some of the reviews but so far so good with this product.", "verified": true, "helpfulness": "0/0", "author": "Jenny Gray"}, {"rating": 2.0, "review": "The stick is great for watching free stuff, such as old HBO series and some movies. Unfortunately, Amazon did not say that it requires a newer HDMI port. After 45 minutes on the phone with an exceptionally helpful Amazon tech, she determined that the stick was not supposed to work with my four year old TV b/c the HDMI ports were not new enough. The stick does work, however, it causes interference with regular channels - the options...send it back for a refund or keep it and only plug into the TV when we want to use it. We are keeping it.", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "David Giocolo"}]