[{"rating": 4.0, "review": "Very convenient.  But I can use my phone instead.  Save the cost.", "verified": true, "helpfulness": "0/0", "author": "Angie Neely Penn"}, {"rating": 4.0, "review": "complicated to purchase movies, even when having a prime account.", "verified": true, "helpfulness": "0/0", "author": "stefany"}, {"rating": 4.0, "review": "wish the mirror option for the iPhone was available. like make a legit app that works with mirroring iPhone to the tv screen.", "verified": true, "helpfulness": "0/0", "author": "Elliott L."}, {"rating": 5.0, "review": "This was the single best purchase I made this year.  I can't believe all the entertainment that I was missing.", "verified": true, "helpfulness": "0/0", "author": "Language Teacher"}, {"rating": 4.0, "review": "The easiest and most inexpensive way to make any TV a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works good, lots of choices of movies to watch.", "verified": true, "helpfulness": "0/0", "author": "Wilbert Z."}, {"rating": 5.0, "review": "I no longer need Cable or the expense of cable!!  This is a wonderful device especially if you are already a prime member!  Very easy to set up and it walks you through the instructions for using it!! Beats Apple TV by far!", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 4.0, "review": "Great product - easy to use and loads content quickly.", "verified": true, "helpfulness": "0/0", "author": "Dustin Paulson"}, {"rating": 5.0, "review": "Works well. I bought the fire stick for my bedroom TV and it fits my needs. I would suggest if you are going to be a heavy user of Fire TV, to buy the box version for a few bucks more. I watch an hour or two a day from the stick, and all other viewing is done at the Fire TV box.I do not have any experience with the other devices for streaming, but will say that this stick boots quickly and it's easy to navigate. I wish it came with the audible search remote.", "verified": true, "helpfulness": "1/1", "author": "Ajay"}, {"rating": 5.0, "review": "Very pleased with this decision!", "verified": true, "helpfulness": "0/0", "author": "Wingster"}]