[{"rating": 5.0, "review": "Had purchased a chromecast and had to return it over compatibility issues. So glad I did. The Firestick is far superior. Easier to install and the remote allows instant use without your tablet or phone. The free month of Amazon Prime allows instant access to tons of media. I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Martin B. Hartman"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome. It has many useful apps for watching TV and is very fast. I've been using this device for a couple of months now and couldn't be happier. The load times are lightening fast and the buffer is done in no time. Yes, I have a great internet connection, but the Fire TV Stick is capable of taking advantage of this connection. It is significantly faster, and plays better video quality than the Google ChromeCast. Having it's own remote is ideal and suits my needs. The screen saver turns on when left idle - which is great since I have a plasma - and the pictures in the screen saver can be changed to your personal photos. The only thing it's missing is HBOGO, but hopefully it will be supported at some point.", "verified": true, "helpfulness": "0/0", "author": "Chaaaaarlie"}, {"rating": 5.0, "review": "I pre-ordered my Fire TV Stick and just received it. I have owned three generations of Roku players and absolutely love the Fire TV Stick. It is very similar to the Roku but has a great interface and is fast pretty fast. I love the small size, it is very convenient and there is ever an option to get a short USB power cord to connect to your TV so there is no need for any additional power cords.", "verified": true, "helpfulness": "0/0", "author": "J. Benjamin Burford"}, {"rating": 5.0, "review": "Very easy to set-up and use. The quality of the connection is outstanding! We are watching all our shows without slow streaming problems. Another great benefit of Amazon Prime!!!", "verified": true, "helpfulness": "0/0", "author": "Katherine Taylor"}, {"rating": 5.0, "review": "Only had it for five days but I love it. Easy to set up and easy to use.", "verified": true, "helpfulness": "1/1", "author": "dee"}, {"rating": 5.0, "review": "Did not buy it for me but the new owners love it!", "verified": true, "helpfulness": "0/0", "author": "Gabriela"}, {"rating": 5.0, "review": "Truly even better than I hoped. Easily set up and I was ready to view all the Prime movies I had been watching on my Kindle and laptop. Only problem I had was opening the remote but a youtube video showed me how. Can't beat the price and can't beat the service from Amazon.", "verified": true, "helpfulness": "0/0", "author": "melody"}, {"rating": 5.0, "review": "This is device is a must have, especially if you are a Prime member.  It is easy to get set up and use.  My family has a Apple TV device set up that has never been used because we cannot figure out how to use it.  It took less than 30 minutes to get from opening the box to watching a movie with this product.  You can add movies to your watch list via your laptop and then select them to watch on your TV.  We love it!", "verified": true, "helpfulness": "0/0", "author": "M Barker \"Financial Executive\""}, {"rating": 5.0, "review": "I like it a lot.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Coco\""}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "charles alshouse"}]