[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "jeanie binder"}, {"rating": 5.0, "review": "AMAZING!!!", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Bud A Cowan"}, {"rating": 5.0, "review": "just became the favorite tv in the house because of this little number. great value", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 4.0, "review": "Lots of great old tv shows here. Not quite the easiest to set up. Cannot be used in hotel rooms, (or at least the one we were in) and the search function could be improved. All in all, a good deal for the money.Not quite sure why some content from my kindle account came over and some did not. That was a little confusing; making me set up some accounts again but others showed up. Odd.", "verified": true, "helpfulness": "0/0", "author": "katydid"}, {"rating": 5.0, "review": "I am really enjoying it!!", "verified": true, "helpfulness": "0/0", "author": "Sandra Khan"}, {"rating": 5.0, "review": "I was nervous about the internet speed that we have in the house.  I have had little issues with streaming, despite my lower internet speed.  I love Hulu Plus and Amazon Prime.  The only surprise was some of the TV Shows on Amazon Fire have a per episode or per season cost.  I should have figured that to be the case, but I didn't.  I went to Hulu and Netflix and found most of my shows and only a small monthly charge.Overall, I have been thrilled with the Fire TV Stick!", "verified": true, "helpfulness": "1/1", "author": "Chill1960"}, {"rating": 4.0, "review": "SO FAR I AM VERY SATISFIED WITH THE FIRE STICK, I AM FAIRLY NEW WHEN IT COMES TO STREAMING DEVICES BUT I CAN SEE WHERE THIS WILL BE ALL I NEED FOR CONTENT, KEEP WORKING ON PUTTING MORE PRESSURE ON THE CABLE AND SATELLITE COMPANIES TO BENEFIT OUR VIEWING PLEASURE", "verified": true, "helpfulness": "0/0", "author": "Frederic H MacArthur"}, {"rating": 5.0, "review": "Very nice way to watch Amazon Prime on TV.", "verified": true, "helpfulness": "0/0", "author": "Conant E Crosier"}, {"rating": 5.0, "review": "very easy to set up, and everything as advertised.", "verified": true, "helpfulness": "0/0", "author": "c r zachem"}]