[{"rating": 5.0, "review": "Great product.  Really pleased with it.", "verified": true, "helpfulness": "0/0", "author": "wendy bee"}, {"rating": 2.0, "review": "The Prime TV Watching material is pitiful.", "verified": true, "helpfulness": "0/0", "author": "Art Jonez"}, {"rating": 4.0, "review": "If you want to cut the cable, get a Roku.  If you primarily want to watch Amazon Prime, this will work (though Roku is better for that, too).  The Firestick is portable and will allow you to logon to guest networks that required web-based authentication.  It's obviously built to push Amazon content.  Though the channel list is growing, it will never compete with the thousands offered through Roku.", "verified": true, "helpfulness": "0/0", "author": "Private \"Unlisted\""}, {"rating": 3.0, "review": "The Amazon Fire TV Stick does offer a lot of options and gives the user another reason to move away from cable.  But being a Prime member I was disappointed that Amazon had such a limited number of free movies to view.  That's were it falls short.  Most of the movies have to be purchased to view.  I actually have more free movie viewing options with Xfinity than with the Fire Stick.  I will be looking into the Amazon Fire TV Media player to see if I can view use it to view digitally saved programming.  I have a WD TV Media player which does this.", "verified": true, "helpfulness": "0/0", "author": "movin-on66"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Mh"}, {"rating": 3.0, "review": "Too soon to give it a higher rateing.", "verified": true, "helpfulness": "0/0", "author": "Ronald Maertz \"photoman\""}, {"rating": 5.0, "review": "Great for the price, can watch Netflix, Hulu and HBOGo on tv if already prescribed does have some connection issues if wifi is iffy.", "verified": true, "helpfulness": "0/0", "author": "Noreen"}, {"rating": 1.0, "review": "there is a voice relapse in this. hope they get this fixed", "verified": true, "helpfulness": "0/0", "author": "Janice Anheluk"}, {"rating": 5.0, "review": "New to our entertainment system. We Like it.", "verified": true, "helpfulness": "0/0", "author": "bl"}, {"rating": 5.0, "review": "The fire stick was excellent.  You have no idea how much better it is rather than that poor app that comes with a Visio TV.", "verified": true, "helpfulness": "0/0", "author": "Alvin Yafuso"}]