[{"rating": 4.0, "review": "Excellent content but tends to load a little slow.", "verified": true, "helpfulness": "0/0", "author": "Nick Marshall"}, {"rating": 5.0, "review": "It's great.  Does just what it says it does.  Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Toby"}, {"rating": 5.0, "review": "Nice product, super fast, with everything needed. Neat with the fie tv app, just wish you could say 'select' instead of having to press the button to complete the play.Wish I would have been able to buy it on Prime Day - all sold out. I was on the waitlist, but never received any notification if I would get it.I ordered it from Best Buy when they had It on sale.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "An awesome device, lots of great options.", "verified": true, "helpfulness": "0/0", "author": "Tia"}, {"rating": 5.0, "review": "This is awesome!  so convenient.", "verified": true, "helpfulness": "0/0", "author": "Erin Miller"}, {"rating": 4.0, "review": "We use our Amazon Fire TV Sticks for listening to music a lot. Great for putting on a playlist as we clean or just sit around the house. The only problem I seem to have is when I create a new playlist, add Prime Music to my cloud and purchase new albums. They don't show up in my music lists on Amazon Fire TV Stick. I am sure there is a solution to this problem; I will keep trying to figure it out. Watching Amazon Prime Instant Video is easy and works well.", "verified": true, "helpfulness": "0/0", "author": "Barry Ammons"}, {"rating": 5.0, "review": "Easy to install & use. Remote takes a lot of getting used to. Could have more extensive user manual included.", "verified": true, "helpfulness": "0/0", "author": "axylotyl"}, {"rating": 5.0, "review": "Better than Apple TV.  That was hard for me to say!", "verified": true, "helpfulness": "1/1", "author": "Andrew Nicholes"}, {"rating": 1.0, "review": "When I first used it, it appeared to work quite well, but when I used it the second time to watch Netflix, it buffered to the point I couldn't watch the program and the picture quality was very poor.", "verified": true, "helpfulness": "1/2", "author": "Tricia"}, {"rating": 4.0, "review": "Does everything the Amazon Fire does except search by voice. This is a great product.", "verified": true, "helpfulness": "1/1", "author": "wires"}]