[{"rating": 5.0, "review": "Transitioned from the Xbox to the Fire Stick and we love it. Faster loading times, never drops the wifi signal, and can completely handle all of the traffic we put through it. I can't praise it enough.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Bummer-  Some nice features BUT it doesn't consistently run NETFLIX.  So we are back to our ROKU.", "verified": false, "helpfulness": "2/4", "author": "Kath"}, {"rating": 5.0, "review": "I'm almost 65 and was a little intimidated by how easily it would connect up.  It could not have been simpler and I immediately was able to binge watch Transparent.  I'm so excited to have so much access to movies, tv and more!  Amazon Prime plus Fire TV = no more prime movie channels on Dish - Now we just need news.", "verified": true, "helpfulness": "0/1", "author": "L. M. Duncan"}, {"rating": 3.0, "review": "We love the FireTV stick, but the remote is so tiny, dark, and easy to lose.  Ours has slipped down somewhere and been gone for three days, so we are dead in the water.  Replacement remotes won't be in stock for a month, and the Fire TV remote app isn't compatible with any of our devices; not even our Amazon Kindle Fire.  What's the deal with that?  In short this is a wonderful device if you can keep up with the remote.  I guess it will be a month or more until we can use it again.", "verified": true, "helpfulness": "0/1", "author": "David Blackstone"}, {"rating": 5.0, "review": "Works great. Very to setup and use.  Just very intuitive.", "verified": true, "helpfulness": "0/0", "author": "David Pagel"}, {"rating": 5.0, "review": "Wonderful product.  Too bad the power adapter needs to be used, it really compromises the otherwise clean design.  I did have one problem, though.  I went travelling and thought it would be great to use this on the hotel TV.  Unfortunately, when accessing WiFi that has a landing page, or terms that must be accepted via a Web Form, there is no possibility of doing so.  Otherwise I would give it 5 stars.  Fortunately for me,  I had the Nvidia Shield controller with HDMI output that I could use.------------Updated from 4-stars to 5.  Had an opportunity to test Amazon's Captive Portal update, which fixes my previous complaint.  It works like a charm, with only 1 hitch.  I checked into a Hilton chain hotel and used my HHonors account to get WiFi access.  This worked for the Fire Stick -- however, the HHonors has a 24-hour limit.  After 24-hours, I couldn't simply use the Captive Portal again.  I had to \"Forget Network\" and reattach and then it worked.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Scott Davis"}, {"rating": 5.0, "review": "Love this device! I am using it on a TV in our extra living room that doesn't have a cable box. Now that room is the favorite hot spot! We watch tons of Amazon Prime content and Netflix! We will be buying another one for the kids room!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Wish there were more of the 40,000 Prime Movies available for selection. Too hard to find a movie or free TV show with Prime. Otherwise an excellent purchase.", "verified": true, "helpfulness": "0/0", "author": "BonesBella \"Maven\""}, {"rating": 2.0, "review": "Disappointing product from Amazon. I really wanted to like it, but It simply just did not work. I had Chromecast and Fire TV Stick and I liked Chromecast better.1- Initial setup takes about 30-45 minutes compared to 10-15 minutes for Google Chrome Cast2- Disconnects much more often than Chromecast3- Very slow to load videos even from Amazon instant streaming4- The remote control is useless and slow when it comes to typing, whereas with Chromecast, your cellphone or tablet is your remote control, so much easier to work with5- Amazon TV Stick powers through the power adapter that comes with it. Chrome Cast powers through USB cable that can be hidden at the back of TV, so less visible wiring.6- You can not cast videos from your laptop. With Chromecast you can cast almost anything (videos, pictures, websites) browsed using Google chrome.", "verified": true, "helpfulness": "2/3", "author": "SP"}, {"rating": 3.0, "review": "I got this to replace my ps3 for streaming and it gets the job done plus more. There are a few neat apps on there, plus you can listen to pandora and everything. Sometimes though, it can be kind of unreliable. At random times, it just stops having internet connection when the wifi is perfectly fine in my home. Even after unplugging the power, sometimes it just won't stream anything. That's when I'm pretty much forced to not be able to use it and turn it off until hopefully it starts working next time I want to use it. It doesn't happen often, but enough to be irritating. Maybe a software update can fix it, but there hasn't been one released since I've gotten it.", "verified": true, "helpfulness": "0/0", "author": "oblivionblader"}]