[{"rating": 5.0, "review": "Best little device I have. You can set it up in your sleep or have a toddler to do it. It automatically has all of the popular apps such as Netflixs and Hulu, but the best part about it is being able to watch YouTube videos on my TV.. Not to mention they have games, and everything runs smoothly. The only thing I wish is that there is a On/Off switch, unfortunately to turn it off you just have to plug it out, but things could be worse.", "verified": true, "helpfulness": "0/0", "author": "Rebecca92"}, {"rating": 5.0, "review": "Love it you need a strong WiFi tho wasn't aware of that but it's awesome", "verified": true, "helpfulness": "0/0", "author": "Julie Gonzalez"}, {"rating": 5.0, "review": "Love the movies", "verified": true, "helpfulness": "0/0", "author": "Bill Miears"}, {"rating": 2.0, "review": "Streaming at my home is too slow for this. I don't want constant buffering. Returned item.", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 2.0, "review": "It's worked nocely for 1 month, then problem began when play 1080p movies...dead sound and freezing. I think heat damaged parts...it's body is very hot. Questionable on durability.", "verified": true, "helpfulness": "0/0", "author": "Ilkyung Sung"}, {"rating": 3.0, "review": "Item is ok.", "verified": true, "helpfulness": "0/0", "author": "Hollye Woods \"Mrs. Woods\""}, {"rating": 4.0, "review": "Works fine most of the time. I love the remote control which even works from down the hallway. Sometimes the adds on Hulu don't load but that might be the Hulu App. Sometimes (once a day) the Fire TV Stick loses connection to the WiFi and has to be powered off and on before it works again.", "verified": true, "helpfulness": "0/0", "author": "escherspace"}, {"rating": 5.0, "review": "great for  watching  movies", "verified": true, "helpfulness": "0/0", "author": "sprnkman"}, {"rating": 1.0, "review": "I love the Amazon Prime Video service; I had to return Fire TV Stick for these reasons. The USB device with the HDMI input and power connector made the unit hard to stay in place in my vertical HDMI input on my TV, because of it's weight. I was having to re-plug the device back into my TV set. The unit was always buffering due to the loss of a signal or the picture looked like it had snow on it. I had to return this product to Amazon; they refunded my money almost immediately. I purchased the more expensive Amazon Fire TV Device with the voice activated remote control, and I could not be more pleased the performance of this unit. The video and audio reception is superb, and the voice activated remote control is very handy to use.", "verified": true, "helpfulness": "2/2", "author": "Drumboy26 \"Drumboy26\""}, {"rating": 5.0, "review": "Fast and easy to set up.  Great product!", "verified": true, "helpfulness": "0/0", "author": "Shane Harold Hermann"}]