[{"rating": 1.0, "review": "If your cable company is COMCAST/INFINITY, it does not support the Amazon Fire Stick- can't watch Showtime/HBO GO even if you pay for the subscription......buying a ROKU stick", "verified": true, "helpfulness": "1/1", "author": "Frank Rod"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Cory L. Grayson"}, {"rating": 5.0, "review": "Wonderful device. Easy to setup picture quality is excellent.", "verified": true, "helpfulness": "0/0", "author": "doug engelke"}, {"rating": 5.0, "review": "Everything I thought it would be...love it", "verified": true, "helpfulness": "0/0", "author": "DonnaB"}, {"rating": 5.0, "review": "Not sure how I got along without the Firestick previously!", "verified": true, "helpfulness": "0/0", "author": "Bill Kirkpatrick"}, {"rating": 1.0, "review": "We could not get it to connect with our wifi without being kicked off. We checked the wifi signal strength and determined that was not the problem. Spent an hour on the phone with customer service to have them tell us they couldn't figure it out and would get back to us in a couple of days. Not good enough for us as a solution so we returned the fire tv sticks and bought Roku instead. It has been working fine.", "verified": true, "helpfulness": "1/2", "author": "Theresa M. Minor"}, {"rating": 2.0, "review": "I have 60 mbps internet speed, and this stick take long time to load TV shows with Sling TV. I owned an Apple TV, and this in no compare. I am very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Fort Worth Man"}, {"rating": 4.0, "review": "sent and received as ordered", "verified": true, "helpfulness": "0/0", "author": "gar"}, {"rating": 5.0, "review": "Works great and is east to set up and use. It works well with Prime.", "verified": true, "helpfulness": "0/0", "author": "A.L. Pearson"}, {"rating": 2.0, "review": "Somewhat disappointed in this product. First of all, I never saw any mention of minimum internet connection speeds (or maybe I missed that). My internet connection is too slow to stream seamlessly, so now I will have to pay to upgrade my speed. The stick also interferes with my regular tv viewing (frames freezing, sound going in and out) so I have to unplug the stick when not in use.  Was also very disappointed to find so many shows that you have to pay to watch. Honestly, I find a better selection of free movies/shows at my local library!  Would have expected a lot better from Amazon.", "verified": true, "helpfulness": "0/0", "author": "A. Covert"}]