[{"rating": 5.0, "review": "Great purchase! I got this for my bedroom TV which isn't a smart TV. I wanted to be able to watch Netflix shows while hubby played his PS3 on the living room TV. Works perfectly! Also took this on vacation and plugged into hotel TV. That was best decision. I could watch the movies and TV shows I wanted to  on my timetable.", "verified": true, "helpfulness": "0/1", "author": "Library Lady \"Librarian\""}, {"rating": 5.0, "review": "Love my Fire Stick. I have a rather sketchy \"high speed\" internet connection yet fire stick is better able to keep a connection and play than my more expensive Roku device. And clever Amazon, they made Prime slightly easier to access than Netflix so now I am watching more on Prime ;)", "verified": true, "helpfulness": "0/1", "author": "M. Galloway"}, {"rating": 4.0, "review": "Real good", "verified": true, "helpfulness": "0/1", "author": "Praveen Pavithran"}, {"rating": 5.0, "review": "We love it! Exceeded our expectations.  Very easy to connect to tv and started downloading apps immediately and watching our favorite shows.", "verified": true, "helpfulness": "0/1", "author": "Sherry Michael"}, {"rating": 5.0, "review": "best thing ever", "verified": true, "helpfulness": "0/1", "author": "DP"}, {"rating": 3.0, "review": "Not my top choice but it is ok. I had issues getting it set up but it seams to be running ok now.", "verified": false, "helpfulness": "0/1", "author": "Kristina Thomas"}, {"rating": 3.0, "review": "Have no problem streaming hd works great It will get 5 stars when they fix the app on Android for the remote couldn't even find my fire stick and I set up wifi networks for a living it's not my network,  roku has them beat the remote works fine. come on amazon today's technology one device equals one remote for all your equipment that is the standard now. you want to be top dog You have to have full package including app to control your devices", "verified": true, "helpfulness": "0/1", "author": "matthew young"}, {"rating": 1.0, "review": "Streaming is lousy personally I think it's overrated I'll stick with direct tv", "verified": true, "helpfulness": "0/1", "author": "Darrell Chapman"}, {"rating": 5.0, "review": "Super easy to install and offers more choices than my tv has.  Connects fast and has amazing video.", "verified": true, "helpfulness": "0/1", "author": "bonnie pearce"}, {"rating": 5.0, "review": "Love this product...it turned my regular tv into a smart TV!", "verified": true, "helpfulness": "0/1", "author": "Douglas Wright"}]