[{"rating": 3.0, "review": "I like the abilities of the Fire Stick, my problem is the constant buffering.  It's quite annoying.  Unless someone can tell me in the next day how this can be resolved I will have to return this item.  I was attempting to watch Grey's Anatomy on Netflix and it buffered so much I finally turned off the TV and went to sleep.", "verified": true, "helpfulness": "0/0", "author": "Scott Haskins Sr"}, {"rating": 5.0, "review": "This Fire Stick TV is a wonderful investment. Me and my wife are very much pleased and satisfied with Amazon Fire Stick TV.", "verified": true, "helpfulness": "0/0", "author": "Olskool"}, {"rating": 3.0, "review": "The initial set up was difficult as the left right/up down button on the remote would jump anywhere from 2-7 spaces at a time when trying to enter my wifi password and my Netflix password, and at times would stick and endlessly scroll until I hit another button.  It also lost connection to my wifi on the 2nd day, less than 36 hours after installing it, and I had to power cycle the unit on the back of my TV to get it to reconnect.  In that regard, it does not have as good of reception as the Chrome Stick, and has to be plugged into the wall to work properly, where as my Chrome Stick worked fine being powered by the USB adapter on my TV.  They need to improve the reception in future models and the power cord is only a few feet long so if you do not have an outlet very close to your TV, YOU WILL NEED AN EXTENSION CORD.  VERY ANNOYING.  MAKE IT LONGER.Overall, when working, which it has since then,  I am pretty happy with having my Netflix, HULU, HBOGO and Amazon PRIME and Amazon Music all on one streaming device with a remote to navigate.  The menus are also easy to see and Navigate.  It is worth the $39.00.Only 1 more issue.  Since I have a Prime Account, and I get free 2 day shipping, why did it take 10 days to fulfill the order and get it shipped?", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Works great.  Just need to update apps more often.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great way to utilize my Prime membership benefits.  A lot easier to watch on a TV than on a computer.", "verified": true, "helpfulness": "0/0", "author": "Suzanne Foster \"SoMD Dance Mom\""}, {"rating": 5.0, "review": "Awesome. Loving the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Rene \"M.Del Giacco\""}, {"rating": 1.0, "review": "This fire stick was a good idea but it Sucks. I really want it to watch Netflix but every time we but a movie on it keep freezing . I want my money back  do not buy it", "verified": true, "helpfulness": "0/1", "author": "Wendy"}, {"rating": 4.0, "review": "Easy to set up. I had a little trouble with it keeping connection with wifi but later seemed to resolve by attaching hdmi extension. Apparently attaching the fire stick straight to the tv allows it to get interference. Will likely buy another couple for my other tvs.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works really awesome, simply unplug & move to new location. Love it, & the price $40.00", "verified": true, "helpfulness": "0/0", "author": "Frank F."}, {"rating": 2.0, "review": "As an Amazon stockholder (since '97), I really wish the Fire Stick was phenomenal. But I have to say - it's not even as good as Roku 1. The interface is complex. I paid only $20 as a Prime customer. And I don't think it's worth that. It did set itself up - one plus - but not a strong enough point to make me want to give a dozen to friends and family as gifts. Suggest you keep looking. Try Roku 2 or Roku 3 or one of the DVD players that pulls in Netflix and other streaming services. I would imagine the Roku stick is really good.", "verified": true, "helpfulness": "1/1", "author": "Corwin Zechar"}]