[{"rating": 5.0, "review": "We love it !", "verified": true, "helpfulness": "0/0", "author": "wendy watson"}, {"rating": 5.0, "review": "Flat out awesome! I mostly use it for Netflix, works great. I was using a Chrome-cast, but using the Fire Stick remote instead of needed my phone or tablet to cast is sooooo much more convenient.", "verified": true, "helpfulness": "0/0", "author": "Almostsobur"}, {"rating": 5.0, "review": "Wish I had this year's ago! Love it.", "verified": true, "helpfulness": "0/0", "author": "melissa"}, {"rating": 4.0, "review": "It's. Everything I would hope it would be this Device is so awesome love that I can see all my favorite movies and tv shows !!!", "verified": true, "helpfulness": "0/0", "author": "Regina Davis"}, {"rating": 5.0, "review": "Great product.  Very convenient (far more so than using our smart tv's interface).  Plus, the voice-to-text search feature through iOS is very convenient.", "verified": true, "helpfulness": "0/0", "author": "Jkr1770"}, {"rating": 3.0, "review": "Did not work as i expected.not bad but not great. Prime members should have eccess to more free stuff.", "verified": true, "helpfulness": "0/0", "author": "JTM"}, {"rating": 5.0, "review": "This device is nothing short of amazing.  For the owner of an older television that was (and still is) otherwise high-end but that does not offer access to apps like Amazon Prime and Netflix this is a game-changer.  It is easy to use and install, streams video effortlessly and without the pixelization and degradation of image quality that I have experienced with other devices.  Frankly, for the price there is nothing that even comes close to this level of functionality.  Buy one today - I'd wager you won't regret that decision.", "verified": true, "helpfulness": "0/0", "author": "E5150"}, {"rating": 5.0, "review": "Plug and go works great", "verified": true, "helpfulness": "0/0", "author": "Mark Palmer"}, {"rating": 5.0, "review": "This is good!One time, it was playing Pandora and the same time I was watching Netflix. Besides that, I live it", "verified": true, "helpfulness": "0/0", "author": "Houston"}, {"rating": 4.0, "review": "A bit slower than Fire TV box but still very good device.Killed all competition.", "verified": true, "helpfulness": "0/0", "author": "Milan Cejic"}]