[{"rating": 3.0, "review": "Bought a pair at introductory price. Hookup was simple and straightforward. Having trouble with the unit overheating, then losing wifi connection and  then rebooting itself. Hopefully for the rest of the users this would be limited to the initial run and I just got some duds.In general, content is another issue, but I hope that will work itself out soon. I have Prime and Netflix but there never seems to be much else to watch. Maybe a change of mindset and developing market of cord cutters will solve that problem in the not too distant future. I understand the need for commercials, but the SAME commercial 8 times in a half hour is a bit much. Luckily, my Fire Stick reboots every 10 minutes so don't have to suffer through all 8 commercial breaks. I usually get fed up with it and turn it off before the half hour is up.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far so good . Easy set up as told and able to view movies right away. Wish i had bought two for our other tv also.", "verified": true, "helpfulness": "0/0", "author": "jani davis"}, {"rating": 5.0, "review": "Works as promised", "verified": true, "helpfulness": "0/0", "author": "DRH"}, {"rating": 4.0, "review": "love this!", "verified": true, "helpfulness": "0/0", "author": "Maya Johnson"}, {"rating": 5.0, "review": "Fast service and works great. All good. Love it.", "verified": true, "helpfulness": "0/0", "author": "Judy Benn"}, {"rating": 4.0, "review": "Its awesome!", "verified": true, "helpfulness": "0/0", "author": "ESTHER BENDAS"}, {"rating": 5.0, "review": "It was very hook up friendly", "verified": true, "helpfulness": "0/0", "author": "Sharon A. Valentine"}, {"rating": 5.0, "review": "Amazon Fire Stick is very cool and so easy to set up and use. When my cable bundle runs out I am definitely going to use it for my tv entertainment. You can play games with it too!  So cool!", "verified": true, "helpfulness": "0/0", "author": "Helene Kaliser"}, {"rating": 2.0, "review": "Convenient sure but very prone to freezing and skipping all media. An update got pushed through today but that didn't help. Tried running same media on phone and fire tablet but media only skipped and froze on TV stick. Unfortunate and disappointing at best. In concept it's great but when it rarely works I have to knock it for execution.", "verified": true, "helpfulness": "0/0", "author": "SFWilliams"}, {"rating": 5.0, "review": "Extremely satisfied especially after downloading the app on to my tablet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]