[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Nice little stick. Fits well, and although the the remote isn't the voice activated (that one comes with the fire TV), it works well. It's so convenient and the picture and sound quality is very good. I'm pleased with this for sure", "verified": true, "helpfulness": "0/0", "author": "Gregory J. Ciallella"}, {"rating": 5.0, "review": "Great option instead of getting the whole Fire TV system. Works great and is affordable!  I would highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to hook up! So many choices. Thank you for offering this through my Prime services😁", "verified": true, "helpfulness": "0/0", "author": "Alice Bunting"}, {"rating": 5.0, "review": "Very easy to set up and use.  Works exactly as expected", "verified": true, "helpfulness": "0/0", "author": "GW"}, {"rating": 2.0, "review": "I am not thoroughly impressed by the Fire TV Stick. I debated on whether or not to purchase this or the actual Fire TV. Since my main TV is a smart TV, I was mainly looking to purchase this for the secondary TV we have for the kids. I settled on the Stick and have yet to have a single day where it actually works. My Internet services have never given me problems with my phone, tablets or Smart TV. But when we try to use the Stick on any given day, I continually have \"connection problems\". Although on my phone or tablet it shows no issues. We have yet to be able to watch a single movie, although we have played a couple of games. I am seriously debating on returning my product.", "verified": true, "helpfulness": "0/0", "author": "Natalie Valle-Garcia"}, {"rating": 5.0, "review": "Very simple to learn, use and navigate. The screen is very clean with one column and various rows to select content. I recommend this over a smart tv especially if one has an AV receiver.", "verified": true, "helpfulness": "0/0", "author": "tarik"}, {"rating": 5.0, "review": "User friendly and works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "hard to use", "verified": true, "helpfulness": "0/0", "author": "RONALD B OLSON"}, {"rating": 3.0, "review": "1. Poor internet connectivity; oftentimes it will struggle to stay connected during Netflix or WatchESPN even if the network is fine on my computer or phone.2. Limited app availability means that there are some streaming services or apps I'd like to cast from my phone or computer but I can't.3. The plug cord is unsightly and sticks out from the device, which would be attractive otherwise.", "verified": true, "helpfulness": "0/0", "author": "Morgan Septer \"eragonsaphira\""}]