[{"rating": 5.0, "review": "Affordable entertainment!! Good bye cable!  Great product!", "verified": true, "helpfulness": "0/0", "author": "Sally"}, {"rating": 5.0, "review": "Best purchase I made ! I luv it!", "verified": true, "helpfulness": "0/0", "author": "Dominique Desiree Solomon"}, {"rating": 2.0, "review": "When it's working correctly, I love my FireStick...unfortunately, it has a major problem. The stick frequently loses Internet connection. I've read other reviews and troubleshooting tips which suggest unplugging the device from the power source for approximately 30 seconds. This works, but it's annoying to have to do this 3-4 times while watching a movie. I returned my first FireStick thinking it was a faulty device, but when the replacement did the same thing, I'm thinking it's a systemic error. Fix this design flaw (and give me an improved version) and I'll happily award five stars!", "verified": true, "helpfulness": "0/0", "author": "Alineal"}, {"rating": 5.0, "review": "Glad I have it!", "verified": true, "helpfulness": "0/0", "author": "Lucy Roach"}, {"rating": 2.0, "review": "I am so frustrated with this product.  I mainly watch Netflix using the Fire Stick and there is a 'glitch' that randomly prevents Netflix from loading.  You'll get different error messages but basically the app won't load or your show won't load.  Sometimes this happens when you are already in Netflix. A nice poster on an Amazon forum about this issue gave a workaround (clear the memory in Amazon video app & unplug), but it is a pain and Amazon should be fixing this problem via a software update.  The first star is for easy setup and the second star is because it was $20 when I bought it; so at least it was cheap!", "verified": true, "helpfulness": "0/0", "author": "AMC"}, {"rating": 2.0, "review": "Doesn't work very well in my house and I have Comcast Internet so it is fast enough to work well.", "verified": true, "helpfulness": "0/0", "author": "Z.P."}, {"rating": 5.0, "review": "I wish the price comes down again soon, because everyone in the family wants one for each television.  It's a great product!", "verified": true, "helpfulness": "0/0", "author": "Brooke"}, {"rating": 5.0, "review": "Love it. Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "JoAnn F"}, {"rating": 1.0, "review": "This is the worst media player I have ever used it is always freezing up and never staying connected  to the Internet when all other devices work fine.", "verified": true, "helpfulness": "0/0", "author": "Zachery and Kayla Westfall"}, {"rating": 5.0, "review": "I like having so many movies and TV shows available.  I also like that I can play my songs that I downloaded onto my phone through the free Amazon music", "verified": true, "helpfulness": "0/0", "author": "Nancy"}]