[{"rating": 3.0, "review": "Not really sure how I feel about this. It was easy enough to install, but after the second time using it, I kept getting an error saying I was not connected to the Internet when I was.. Changed to port, which worked for about five minutes, then kept buffering so it was a little annoying.  Changed the port again, so hoping the third time works.  If it doesn't I'm returning it.", "verified": true, "helpfulness": "0/0", "author": "Diane A Garrido"}, {"rating": 5.0, "review": "this is best thing there is .", "verified": true, "helpfulness": "0/0", "author": "charles efaw"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "JEFFREY PREDMORE"}, {"rating": 3.0, "review": "works good but it wont replace my cable", "verified": true, "helpfulness": "0/0", "author": "Billy Granger \"texasgranger\""}, {"rating": 3.0, "review": "We love the movies and shows available it's just the remote is erratic and moves way too quickly too select anything.", "verified": true, "helpfulness": "0/0", "author": "Marie C."}, {"rating": 5.0, "review": "Great product!  Installed in seconds.", "verified": true, "helpfulness": "0/0", "author": "Michael J Buckley"}, {"rating": 5.0, "review": "While I had a difficult time seeing it up, my husband did not. We realized it needed to be plugged into the wall and into an HDMI slot. The remote was hard to open to load the batteries. But all that aside we're very happy with our purchase. So much content available. The remote and navigating is easy. You can also get a Fire Stick smartphone app remote control that has voice control. The choices are amazing!  Traveling with Kids, PBS Kids, Amazon videos, and much more. We are still exploring. I plan on using the fitness prime videos to change up my workout routine. For the price and the trusted name behind it you can't go wrong!!", "verified": true, "helpfulness": "0/0", "author": "JC mom \"SHeller\""}, {"rating": 5.0, "review": "Opened a new media to me.  Love the variety.", "verified": true, "helpfulness": "0/0", "author": "Donna A. Peterson"}, {"rating": 5.0, "review": "I have been using this since Christmas and love the ease of use.  Previously watched Netflix through our PS-3 and which constantly getting disconnected due to the use of the joystick.  The Fire Stick remote makes the frustration of a joystick a thing of the pass.  I've recommended this to many people who have bought it and love it also.  The only problem I've encountered so far is turning off the TV!", "verified": true, "helpfulness": "0/0", "author": "Genie213"}, {"rating": 5.0, "review": "has a lot of good show free one day shipping well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Mike Bittle"}]